{
    "data": [
        {
            "title": "EUR/USD forecast: Neutral ECB should keep euro’s downside limited",
            "description": "<div class=\"field-content\" data-process-content=\"true\"><p class=\"text-align-justify\">The EUR/USD was trading around 1.16 handle ahead of the ECB rate decision, bouncing back a tad following the Fed’s slightly hawkish press conference yesterday where Powell made it clear that another cut isn’t guaranteed. But risp appetite remains largely supported even if European markets pulled back a little this morning ahead of the European Central Bank rate decision shortly. US President Donald Trump called his meeting with China’s President Xi Jinping “amazing”, with both sides agreeing to roll back some export restrictions and trade barriers – though markets had more or less priced that in already, which is why we haven’t seen a major reaction. The focus remains on AI euphoria and tech earnings, keeping the bears at bay for stock markets. This is helping to cushion the downside risks for the EUR/USD forecast and other risk-sensitive currency pairs such as AUD/USD. The ECB is widely expected to hold policy unchanged and as such we don’t expect any dovish reaction in the euro, especially after this morning’s release of surprisingly strong French GDP data.</p><p class=\"text-align-justify\"> </p><h2><b>Analysis: don’t write off the euro yet</b></h2><p class=\"text-align-justify\"> </p><p class=\"text-align-justify\">With the ECB likely to hold steady today and eurozone growth showing resilience, the single currency remains underpinned especially against the likes of the yen with the EUR/JPY today breaking out to a new high near 179.00 handle after a dovish hold by the Bank of Japan, making the EJ the best performing currency pair.  The euro is also holding firm against most other majors – it’s just the dollar’s current strength keeping it in check. Medium term, I’d still back the EUR/USD. A more hawkish ECB, firmer growth prospects, and German stimulus should all lend support. The short-term picture, though, will depend on how long the Fed’s hawkish afterglow lasts. Once that fades, EUR/USD could easily climb again. Personally, I don’t see it slipping much below 1.15 – and if it does, it won’t stay there for long.</p><p class=\"text-align-justify\"> </p><h2><b>Dollar takes a surprise boost from Powell’s press conference</b></h2><p class=\"text-align-justify\"> </p><p class=\"text-align-justify\">Powell’s press conference made one thing crystal clear – there’s a bit of discord brewing within the Fed. That hint of internal division gave the dollar a lift, with markets trimming around 10 basis points off expected rate cuts. The greenback firmed most against the low-yielding yen and Swiss franc. Powell said that a December cut isn’t a “foregone conclusion,” which shouldn’t have surprised the market. But it did, and that knocked odds from nearly certain to a more balanced 70% for a December cut.</p><p class=\"text-align-justify\"> </p><p class=\"text-align-justify\">As a result, the dollar found support – particularly against the yen, where the Bank of Japan still seems reluctant to tighten. Meanwhile, China’s one-year delay in rare earth export controls offered global supply chains a welcome reprieve, but the impact of this on the dollar should be negative especially against the yuan, Aussie and kiwi. Beyond today’s jobless claims, the ongoing US government shutdown has left the data calendar fairly sparse, meaning markets will take their cues from general risk appetite now that the dust settles on FOMC’s rate cut and Powell’s slightly hawkish commentary.</p><p class=\"text-align-justify\"> </p><h2><b>EUR/USD forecast ECB in focus as French GDP surprises and Germany stagnates</b></h2><p class=\"text-align-justify\"> </p><p class=\"text-align-justify\">For the EUR/USD forecast, the focus now shifts to the euro side of things. This morning’s Eurozone growth figures brought a pleasant surprise – at least from France. Despite political uncertainty, French GDP accelerated 0.5% quarter-on-quarter, easily topping forecasts. The contrast with Germany, however, couldn’t be starker. Europe’s industrial powerhouse flatlined in Q3, though a technical recession was narrowly avoided. All hope for Berlin now lies on the government’s hefty €500 billion fiscal package, aimed at infrastructure and defence. It’s substantial, but its impact might be slower to filter through than hoped.</p><p class=\"text-align-justify\"> </p><p class=\"text-align-justify\">Apart from Germany, most other Eurozone countries showed decent growth figures. As a whole, the Eurozone managed a 0.2% growth for the quarter.</p><p class=\"text-align-justify\"> </p><p class=\"text-align-justify\">All eyes now turn to the European Central Bank meeting. Christine Lagarde is unlikely to spring any surprises; the market still leans slightly towards another rate cut at some point in the middle of 2026, but for now she’ll probably play it safe and that should help to keep the EUR/USD forecast slightly titled to the upside despite the dollar’s recovery.</p><p class=\"text-align-justify\"> </p><h2><b>EUR/USD technical analysis and key levels to watch</b></h2><p class=\"text-align-justify\"> </p><figure role=\"group\"><img alt=\"EUR/USD forecast\" data-entity-type=\"file\" data-entity-uuid=\"ba3f6c10-9752-471d-bef0-83dcb2d6a036\" height=\"717\" loading=\"lazy\" src=\"https://micms.stonex.com//sites/default/files/inline-images-2/5532/25.10.30%20eurusd.png\" width=\"1437\"/><figcaption>Source: TradingView.com</figcaption></figure><p class=\"text-align-justify\"> </p><p class=\"text-align-justify\">Technically, <a href=\"https://www.tradingview.com/symbols/EURUSD/\">EUR/USD exchange rate</a> looks capped near 1.1650 for now, where the resistance trend of its bearish channel comes into play. A clean break above this level would re-instate the EUR/USD bullish forecast. On the downside, 1.1570ish is the top of its long-term support range between 1.1460-1.1570. While I wouldn’t rule out the potential for a dip inside this support zone in light of the hawkish-leaning FOMC press conference yesterday, much will now depend on the tone of the ECB chair Christine Lagarde.</p><p class=\"text-align-justify\"> </p><p class=\"text-align-justify\"> </p><p class=\"text-align-justify\"> </p><p class=\"text-align-justify\"> </p><a gtmlinkcontext=\"Whitepaper\" gtmlinkname=\"Download EUR USD Whitepaper\" href=\"/en-us/whitepapers/\" id=\"whitepaper\" target=\"_blank\"><img alt=\"Whitepaper\" class=\"prevent-zoom\" data-entity-type=\"file\" loading=\"lazy\" src=\"https://www.forex.com/en-us/-/media/project/gain-capital/forex/banners/campaigns/whitepapers/2025/FX-White-Paper-EUR-USD-V2.jpg?extension=webp&amp;hash=02BA65E65BB9F508C5A91DBB3AFB588E\" style=\"min-width:100%; height:auto;\"/></a><p> </p><p> </p><p style=\"background: white; margin: 0cm 0cm 12pt;\"><span style=\"letter-spacing: 0.1pt; color: black;\">-- Written by Fawad Razaqzada, Market Analyst</span></p><p style=\"background: white; margin: 0cm;\"><span style=\"letter-spacing: 0.1pt; color: black;\">Follow Fawad on Twitter <a href=\"https://twitter.com/Trader_F_R\"><span style=\"padding: 0cm; border: 1pt none windowtext; color: #0954b5;\">@Trader_F_R</span></a></span></p><p> </p><p> </p></div>",
            "link": "https://www.forex.com/en-us/news-and-analysis/eur-usd-forecast-neutral-ecb-should-keep-euro-s-downside-limited/",
            "author": "forex",
            "pub_date": "2025-10-31 10:53:46",
            "source": "forex",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US Dollar Eyes Breakout as EUR/USD, GBP/USD Probe Support, USD/JPY Rallies",
            "description": "<div class=\"field-content\" data-process-content=\"true\"><p>The US dollar is showing renewed strength as DXY approaches a key breakout zone. Both EUR/USD and GBP/USD are testing support, while USD/JPY continues to rally after the Bank of Japan refrained from signalling imminent rate hikes. With the Fed resisting December cut expectations and crucial ISM data due next week, traders are preparing for a decisive move in the greenback.</p><p> </p><p><strong><span>View related analysis:</span></strong></p><ul><li><span><a href=\"/en-us/news-and-analysis/us-dollar-japanese-yen-new-zealand-dollar-cot-report-analysis/\" target=\"_blank\">US Dollar, Japanese Yen, New Zealand Dollar: COT Report Analysis</a></span></li><li><span><a href=\"/en-us/news-and-analysis/us-dollar-dominates-as-bears-run-for-cover-yields-surge/\" target=\"_blank\">US Dollar Dominates as Bears Run for Cover, Yields Surge</a></span></li><li><span><a href=\"/en-us/news-and-analysis/us-dollar-leads-fx-majors-after-hawkish-fomc-usd-jpy-aud-usd-in-focus/\" target=\"_blank\">US Dollar Leads FX Majors After Hawkish FOMC: USD/JPY, AUD/USD in Focus</a></span></li><li><span><a href=\"/en-us/news-and-analysis/gold-shows-tentative-signs-of-stability-options-hint-at-mild-recovery/\" target=\"_blank\">Gold Shows Tentative Signs Of Stability, Options Hint At Mild Recovery</a></span></li></ul><p> </p><h2 class=\"caption1\">DXY Nears Breakout Zone as Major Forex Pairs Test Key Levels</h2><p>At the beginning of October, I outlined a case for the US dollar to extend its bounce from the 96 lows as part of a ‘wave C’ within an ABC correction. Initially, the bias was for wave C to terminate around 100, with the potential to extend towards 102 before reverting to its dominant bearish trend. Given the recent pickup in bullish momentum, perhaps wave C will prove deeper after all.</p><p>Jerome Powell pushed back against the idea of a 25bp cut in December at this week’s FOMC meeting, which caught many by surprise, given Fed funds futures were implying around a 90% chance of a Christmas cut beforehand. While US data remains limited due to the government shutdown, traders will be watching next week’s ISM reports closely — particularly the ‘prices paid’ and ‘employment’ sub-indices — as these could help shape expectations for Fed policy in December and the US dollar’s trajectory. The DXY now sits around a key resistance level heading into the weekend, making next week pivotal for the greenback’s direction.</p><img alt=\"Line chart comparing ISM Non-Manufacturing PMI, Prices Paid, and Employment indices from 2008 to 2025. The data show inflationary and employment trends traders use to gauge US economic momentum and Federal Reserve policy expectations, helping guide the US dollar outlook.\" class=\"align-center\" data-entity-type=\"file\" data-entity-uuid=\"fcb37104-104c-4d28-9e9d-4ae6e8c8115d\" height=\"566\" loading=\"lazy\" src=\"https://micms.stonex.com//sites/default/files/inline-images/image-20251031092605-1.jpeg\" width=\"1040\"/><p><i>Chart prepared by Matt Simpson: Source – Institute for Supply Management (ISM, LSEG)</i></p><p> </p><a gtmlinkcontext=\"Whitepaper\" gtmlinkname=\"Download EUR USD Whitepaper\" href=\"/en-us/whitepapers/\" id=\"whitepaper\" target=\"_blank\"><img alt=\"Whitepaper\" class=\"prevent-zoom\" data-entity-type=\"file\" loading=\"lazy\" src=\"https://www.forex.com/en-us/-/media/project/gain-capital/forex/banners/campaigns/whitepapers/2025/FX-White-Paper-EUR-USD-V2.jpg?extension=webp&amp;hash=02BA65E65BB9F508C5A91DBB3AFB588E\" style=\"min-width:100%; height:auto;\"/></a><p> </p><h2>US Dollar Index (DXY) Technical Analysis</h2><p>The US dollar index is on track to rise for a second consecutive month and form a morning star reversal pattern. While a break above the August high (99.67) would confirm this as a bullish reversal signal, traders may prefer to treat a sustained move above the 100 handle as confirmation. The May high (100.97) then comes into focus for bulls, while the 138.2% Fibonacci level (101.46), the 102 handle, and the 161.8% extension (102.42) also present potential upside targets.</p><p>As for the bigger picture, I suspect the US dollar will print new lows as we move into next year, as softer data allows the Fed to signal fresh rate cuts. A lower high formed in January (108.84), suggesting the broader trend remains bearish.</p><p>The rally from the July 2023 low (96.00) to the January high (108.84) appears corrective in nature, terminating with that lower high before momentum reversed sharply lower in an impulsive fashion. The core bias is that the dollar’s current rally represents an ABC correction against this year’s declines, and momentum is likely to revert lower once the current wave C completes.</p><img alt=\"Chart analysis of the US Dollar Index (DXY) showing a potential morning star reversal at support near 96, with resistance at the August high (99.67) and 100 handle. Fibonacci extensions at 101.46 and 102.42 highlight upside targets, while RSI indicators show improving momentum on both weekly and monthly charts.\" class=\"align-center\" data-entity-type=\"file\" data-entity-uuid=\"dd432801-53f3-4e2a-b2f4-a3bb0ec1a179\" height=\"841\" loading=\"lazy\" src=\"https://micms.stonex.com//sites/default/files/inline-images/image-20251031092623-2.jpeg\" width=\"1579\"/><p><i>Chart analysis by Matt Simpson - data source: TradingView </i><a href=\"https://www.tradingview.com/symbols/ICEUS-DX1!/\" target=\"_blank\"><i>U.S. Dollar Index Futures</i></a></p><h2> </h2><a gtmlinkcontext=\"Whitepaper\" gtmlinkname=\"Download USD JPY Whitepaper\" href=\"/en-us/whitepapers/\" id=\"whitepaper\" target=\"_blank\"><img alt=\"Whitepaper\" class=\"prevent-zoom\" data-entity-type=\"file\" loading=\"lazy\" src=\"https://www.forex.com/en-us/-/media/project/gain-capital/forex/banners/campaigns/whitepapers/2025/FX-White-Paper-USD-JPY-V2.jpg?extension=webp&amp;hash=02BA65E65BB9F508C5A91DBB3AFB588E\" style=\"min-width:100%; height:auto;\"/></a><p> </p><h2>Major Forex Pairs Weaken as US Dollar Strengthens</h2><p>With my bias for the US dollar to break higher initially, I’ll switch to the daily chart of forex majors to see how they stack up against the dollar’s dominance.</p><ul><li><b>EUR/USD</b> is on the cusp of testing the October low (1.1542), though a break below 1.1528 is required to confirm a bearish breakout.</li><li><b>GBP/USD</b> has breached the August low but failed to follow through, suggesting a minor bounce may occur in the near term. However, an eventual downside break remains plausible unless US data weakens next week, which could bring the 1.30 handle into focus for pound bears.</li><li><b>USD/CHF</b> is back above 0.80 after forming a higher low on the daily chart, with bulls likely targeting a break of the October high (0.8076).</li><li><b>USD/CAD</b> saw clear bullish range expansion on Thursday and is attempting to break above 1.40, following a bullish hammer that perfectly respected its 200-day EMA. The bias favours a retest of the October high (1.4080).</li><li><b>USD/JPY</b> surged to an eight-month high after the Bank of Japan refrained from committing to an imminent rate hike at yesterday’s meeting.</li><li><b>AUD/USD</b> fell for a second day; however, as outlined in yesterday’s report, the pullback may be limited, with a move towards 0.67 still possible for the Australian dollar.</li><li><b>NZD/USD </b>also declined for a second session, with its daily trend structure remaining bearish and pointing towards 0.57, potentially lifting AUD/NZD in the near term.</li></ul><p> </p><img alt=\"Eight-chart dashboard comparing major forex pairs against the US dollar, showing DXY strength alongside bearish setups for EUR/USD, GBP/USD, AUD/USD, and NZD/USD, and bullish trends for USD/JPY, USD/CHF, and USD/CAD on daily charts. Chart analysis by Matt Simpson - source: TradingView\" class=\"align-center\" data-entity-type=\"file\" data-entity-uuid=\"a149bd12-4c49-4967-a4a8-f59fe65089be\" height=\"1009\" loading=\"lazy\" src=\"https://micms.stonex.com//sites/default/files/inline-images/image-20251031093224-1.jpeg\" width=\"1844\"/><p><i>Chart analysis by Matt Simpson - source: TradingView</i></p><p> </p>View the full <a href=\"/en-us/trading-tools/economic-calendar/\" target=\"_blank\"><em>economic calendar</em></a><p> </p><p style=\"margin: 0px 0px 1em; padding: 0px; border: 0px;\">-- Written by Matt Simpson</p><p style=\"margin: 0px 0px 1em; padding: 0px; border: 0px;\">Follow Matt on Twitter <a href=\"https://twitter.com/cLeverEdge\" rel=\"noopener noreferrer\" style=\"background-color: transparent; margin: 0px; padding: 0px; border: 0px;\" target=\"_blank\">@cLeverEdge</a></p><p> </p><p> </p></div>",
            "link": "https://www.forex.com/en-us/news-and-analysis/us-dollar-eyes-breakout-as-eur-usd-gbp-usd-probe-support-usd-jpy-rallies-2025-10-30/",
            "author": "forex",
            "pub_date": "2025-10-31 10:53:44",
            "source": "forex",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Japanese yen outlook: USD/JPY stalls above 154.00 as Tokyo inflation heats up",
            "description": "<div class=\"field-content\" data-process-content=\"true\"><ul><li>Tokyo CPI-ex fresh food lifts 2.8%, beating forecasts</li><li>Core-core inflation also jumped to 2.8%</li><li>BOJ signals no rush to hike, eyes wage talks</li><li>USD/JPY pulls back but trend remains bullish</li></ul><h2>Summary</h2><p>Tokyo’s inflation data surprised to the upside, with all key measures accelerating and staying well above the BOJ’s 2% target. While that’s reignited talk of a potential rate hike, Governor Ueda’s cautious stance and focus on spring wage negotiations suggest any move may be delayed. USD/JPY retreated from multi-month highs post-release, but with bullish momentum intact, traders may look to buy dips near key support levels.</p><h2>Tokyo Inflation Heats up</h2><p>Consumer prices in Japan’s capital Tokyo accelerated sharply in October, coming in well above market expectations and keeping the prospect of a rate hike from the Bank of Japan by year-end alive.</p><p>In an ominous sign for what may be coming when the national report is released in late November, headline inflation accelerated to an annual pace of 2.8%, up from 2.5% in September. Excluding fresh food, inflation increased 2.8% from a year earlier, above the 2.5% pace of the prior two months and higher than the 2.6% rate expected. This is the measure the Bank of Japan targets, aiming for 2% growth per annum.</p><p>Excluding fresh food and energy prices, the so-called core-core measure also lifted 2.8%, three tenths higher than a month earlier.</p><p><img alt=\"image-20251031124011-3\" data-entity-type=\"file\" data-entity-uuid=\"178de1b8-955c-4967-9e85-36e3dd2e08e0\" height=\"1126\" loading=\"lazy\" src=\"https://micms.stonex.com//sites/default/files/inline-images/image-20251031124011-3.png\" width=\"1841\"/></p><p>Source: TradingView</p><p>As seen in the chart above, all three measures remain well above the Bank of Japan’s 2% mandate. Given the strength of the rolling 36-month correlation coefficients between the Tokyo and nationwide data seen in blue, the bounce in the capital is likely to be reflective of price trends in other parts of the country.</p><h2>BOJ Focused on Wage Negotiations</h2><p>While there was mixed news from other economic data released on Friday—with unemployment unexpectedly ticking higher to 2.6%, retail sales undershooting forecasts, while industrial output impressed—when it comes to the path of interest rates in Japan, it really comes down to the international environment and, domestically, wage and inflation pressures.</p><p>BOJ Governor Ueda underlined that point during his press conference on Thursday following the BOJ’s policy meeting, where it kept its key policy rate unchanged at 0.5%. He suggested the bank wanted to see “early momentum” in spring wage negotiations when considering whether to tighten policy further, signalling a desire to wait well into the first quarter of 2026 before an adjustment may be made.</p><a gtmlinkcontext=\"Whitepaper\" gtmlinkname=\"Download USD JPY Whitepaper\" href=\"/en-us/whitepapers/\" id=\"whitepaper\" target=\"_blank\"><img alt=\"Whitepaper\" class=\"prevent-zoom\" data-entity-type=\"file\" loading=\"lazy\" src=\"https://www.forex.com/en-us/-/media/project/gain-capital/forex/banners/campaigns/whitepapers/2025/FX-White-Paper-USD-JPY-V2.jpg?extension=webp&amp;hash=02BA65E65BB9F508C5A91DBB3AFB588E\" style=\"min-width:100%; height:auto;\"/></a><h2 class=\"caption1\">December Rate Hike a ‘Coin Flip’</h2><p>Before the BOJ decision, swaps traders marginally favoured a 25 basis point rate hike in December, reflecting that two board members previously voted to lift rates in September and obvious pressure from U.S. officials to consider both growth and inflation outcomes when setting monetary and fiscal policy.</p><p><img alt=\"image-20251031123655-1\" data-entity-type=\"file\" data-entity-uuid=\"6ee0a50a-8e78-450d-94e4-b38109e3106b\" height=\"683\" loading=\"lazy\" src=\"https://micms.stonex.com//sites/default/files/inline-images/image-20251031123655-1.png\" width=\"697\"/></p><p>Source: Bloomberg</p><p>Now, despite the stronger-than-expected Tokyo inflation data, traders marginally favour no move from the BOJ in December, with a full 25 basis point hike not priced in until April when annual wage announcements will be made. The less hawkish rate outlook was one of the key factors that weighed on the Japanese yen on Thursday, along with the unexpected hawkish tilt from Jerome Powell following the FOMC rate decision late Wednesday.</p><h2>USD/JPY Pulls Back Following Breakout</h2><p>You can see in the USD/JPY daily chart below that the pair broke to fresh multi-month highs on Thursday before stalling above 154.00, pulling back modestly on Friday following the inflation report. With momentum indicators revealing strengthening upside pressure and price sitting in a strong uptrend, the preference remains to buy dips and bullish breaks over the near term.</p><p><img alt=\"image-20251031123919-2\" data-entity-type=\"file\" data-entity-uuid=\"8e06d55b-f6f4-49fd-b10d-b706e79755ff\" height=\"1126\" loading=\"lazy\" src=\"https://micms.stonex.com//sites/default/files/inline-images/image-20251031123919-2.png\" width=\"1835\"/></p><p>Source: TradingView</p><p>153.28 looms as an important focal point today, coinciding with former horizontal resistance. Having been broken, it may now flip to providing support, offering a potential entry level for longs where a stop can be placed below for protection. Thursday’s high and 154.80 resistance provide two potential targets. Considering the bullish break on Thursday came from within an ascending triangle pattern, neither option screens as overly ambitious. On the contrary, if convention proves accurate, the height of the triangle points to the potential for substantially larger gains.</p><p>If 153.28 were to be broken on the downside, uptrend support would be the likely first port of call around 152.00—coincidentally where the pair found buying support earlier this week.</p></div>",
            "link": "https://www.forex.com/en-us/news-and-analysis/japanese-yen-outlook-usd-jpy-stalls-above-154-00-as-tokyo-inflation-heats-up/",
            "author": "forex",
            "pub_date": "2025-10-31 10:53:43",
            "source": "forex",
            "kind": 1,
            "language": "en"
        }
    ]
}