{
    "data": [
        {
            "title": "US Equity Indexes Slump As Block Layoffs Trigger Fears of Wider Job Losses to AI",
            "description": "\n<p><chron>04:59 PM EST</chron>, <chron>02/27/2026</chron> (MT Newswires) -- US equity indexes fell on Friday as a layoff announcement at Block prompted fears of wider job displacement in favor of AI, sending Treasury yields to fresh lows on the year.</p><p>The Nasdaq Composite dropped 0.9% to 22,668.21, the S&amp;P 500 fell 0.4% to 6,878.88, and the Dow Jones Industrial Average declined 1.1% to 48,977.92.</p><p>Financials and technology were the sole decliners, while health care, consumer staples, and real estate led the gainers.</p><p>Block (XYZ) shares soared 17%, among the top gainers on the S&amp;P 500, after the financial technology company posted higher Q4 adjusted net income and revenue. It also announced a plan to cut its current workforce by more than 40%.</p><p>&quot;Gross profit continues to grow, we continue to serve more and more customers, and profitability is improving,&quot; Block Co-founder <person>Jack Dorsey</person> wrote in a post. &quot;But something has changed. We're already seeing that the intelligence tools we're creating and using, paired with smaller and flatter teams, are enabling a new way of working which fundamentally changes what it means to build and run a company.&quot;</p><p>Shares of <org value=\"CRWV.NaE\" idsrc=\"xmltag.org\" >CoreWeave</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='CRWV' fmr-param-security-type='Equity'>( CRWV )</span>  sank 19% after the cloud infrastructure company focused on artificial intelligence reported a wider Q4 loss. Earnings missed, with sustained investment in growth ahead of compute coming online, a Macquarie note said while cutting <org value=\"CRWV.NaE\" idsrc=\"xmltag.org\" >CoreWeave's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='CRWV' fmr-param-security-type='Equity'>( CRWV )</span> price target to <money>$90</money> from <money>$115</money>. &quot;Massive investment needed ahead of monetization remains a recurring theme. Execution at this scale could be choppy.&quot;</p><p><org value=\"ZS.NaE\" idsrc=\"xmltag.org\" >Zscaler</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='ZS' fmr-param-security-type='Equity'>( ZS )</span>  delivered strong fiscal Q2 results, beating the Street's adjusted earnings and sales expectations; but, CFRA, an independent research provider, told MT Newswires that a slowdown in net new annual recurring revenue additions will be a &quot;key investor concern.&quot; Shares of the cloud security company slumped 12%, the steepest decline in the Nasdaq.</p><p>In economic news, the US producer price index rose by 0.5% in January following a 0.4% increase in December, according to the <org>Bureau of Labor Statistics</org> on Friday, above the 0.3% gain expected in a <org>Bloomberg</org> survey. After excluding the more volatile food and energy prices, core PPI rose by 0.8%, more than the 0.3% gain anticipated and following a 0.6% jump in the previous month.</p><p>PPI was up 2.9% year-over-year in January after a 3.0% gain in December, while core prices rose by 3.6% following a 3.3% rise.</p><p>Services costs jumped 0.8% in the first month of the year, marking the largest gain since July, as trade as well as transportation and warehousing costs increased, according to a Stifel research note.</p><p>A sizable upswing in producer prices underscores the Federal Reserve's unfinished battle with inflation, and the flaws in the Federal Open Market Committee's &quot;longstanding passive and light-handed approach,&quot; the research note said.</p><p>&quot;While one data point does not make a trend, and much of the increase was isolated to trade services, any further confirmation of a reacceleration of cost pressures will not only solidify the Fed's position on the sidelines for some time despite outside pressure and, furthermore, call into question earlier rate cuts, but increasingly raise the notion of whether or not policy has become too accommodative,&quot; the note added.</p><p>Morgan Stanley economists forecast the core personal consumption expenditures price index, the Federal Reserve's preferred inflation measure, grew 0.52% month-over-month in January following the hotter-than-expected PPI print, from previous guidance of 0.49%. &quot;Our upward revision is explained by stronger domestic airfares (within transportation services), healthcare, and nonprofits serving households,&quot; according to a research note.</p><p>US Treasury yields declined, with the two-year down 6.3 basis points to 3.39%. The 10-year yield dropped 6.2 basis points to 3.96%, the lowest since November.</p><p>In energy markets, West Texas Intermediate crude oil futures jumped 3.2% to <money>$67.28</money> a barrel as a third round of indirect talks in <location value=\"LU/ch..geneva\" idsrc=\"xmltag.org\" >Geneva, Switzerland</location>, between <location value=\"LC/us\" idsrc=\"xmltag.org\" >the United States</location> and <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location> ended with an agreement to meet again next week.</p><p>&quot;A resolution to the central issue of Iranian domestic uranium enrichment remains elusive and will likely be the make-or-break factor in determining whether there will be another military confrontation,&quot; <person>Helima Croft</person>, head of global commodity strategy and MENA research at <org>RBC Capital Markets</org>, wrote in a research note. &quot;Despite the constructive soundbites, there are no indications that <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location> is willing to give up domestic enrichment.&quot;</p><p>In precious metals, gold futures rose 1.7% to <money>$5,281.5</money> per troy ounce, and silver futures jumped 7.9% to <money>$93.88</money> per troy ounce.</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/us-markets/202602271659MIDNIGHTUSEQUITY_A3575436",
            "pub_date": "2026-02-28 05:59:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Market analysts react to US-Israel strikes on Iran",
            "description": "\n<p><chron>Feb 28</chron> (Reuters) - <location value=\"LC/us\" idsrc=\"xmltag.org\" >The United States</location> and <location value=\"LC/il\" idsrc=\"xmltag.org\" >Israel</location> launched strikes on <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location> on Saturday that killed Supreme Leader <person>Ali Khamenei</person> and plunged the <location value=\"LR/mde\" idsrc=\"xmltag.org\" >Middle East</location> into a new conflict.</p>\n<p>The strikes put nearby oil-producing Gulf Arab countries on edge as fear of escalation grew with <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location> responding by launching missiles towards <location value=\"LC/il\" idsrc=\"xmltag.org\" >Israel</location>.</p>\n<p>Some oil majors and top trading houses suspended crude oil and fuel shipments via the <location>Strait of Hormuz</location> because of the attacks, four trading sources said on Saturday.    </p>\n<p>QUOTES:</p>\n<p><person>HELIMA CROFT</person>, RBC CAPITAL'S HEAD OF COMMODITIES RESEARCH:</p>\n<p>&quot;The ultimate oil price impact of today's military action will likely hinge on whether the IRGC folds in the face of the aerial onslaught or if it pursues further escalatory actions to appreciably raise the costs of <location value=\"LU/us.dc.wash\" idsrc=\"xmltag.org\" >Washington's</location> second regime change operation in a little over two months.&quot;</p>\n<p>&quot;It is our understanding that regional leaders warned <location value=\"LU/us.dc.wash\" idsrc=\"xmltag.org\" >Washington</location> about the contagion risks of another confrontation with <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location> and indicated that $100+/bbl oil was a clear and present danger.&quot;</p>\n<p>&quot;We would also note that all of this is taking place against a backdrop of minimal <org>OPEC</org> shock absorbers. In our view, every OPEC+ producer is essentially maxed out with the sole exception of <location value=\"LC/sa\" idsrc=\"xmltag.org\" >Saudi Arabia</location>. Hence, the barrel impact of any headline OPEC+ increase tomorrow will be limited by the lack of actual production capabilities.&quot;</p>\n<p><person>JORGE LEON</person>, SENIOR VICE PRESIDENT AND HEAD OF GEOPOLITICAL ANALYSIS AT RYSTAD ENERGY:  </p>\n<p>&quot;Alternative infrastructure in the <location value=\"LR/mde\" idsrc=\"xmltag.org\" >Middle East</location> can be used to bypass the Strait's flows, but the net impact remains an effective loss of 8-10 million bpd of crude oil supply,&quot; in a global market that uses about 100 million bpd. </p>\n<p>&quot;Nations with strategic petroleum reserves may take action and release volumes if the disruption of the Strait risks being extended. Unless de-escalation signals emerge swiftly, we expect a significant upward repricing of oil at the start of the week.&quot;</p>\n<p>ENERGY ANALYSTS AT EURASIA GROUP:</p>\n<p>&quot;Oil prices will rise sharply when markets open. Should the conflict continue into Sunday, oil prices are likely to respond by increasing by <money>$5-10</money> above the current <money>$73</money> baseline, based on <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran's</location> claim to have closed the <location>Strait of Hormuz</location> and the disruption in tanker traffic.&quot;</p>\n<p>ENERGY ANALYSTS AT BARCLAYS:</p>\n<p>&quot;Oil markets might have to face their worst fears on Monday. As things stand right now, we think Brent could hit <money>$100</money> (per barrel), as the market grapples with the threat of a potential supply disruption amid a spiralling security situation in the <location value=\"LR/mde\" idsrc=\"xmltag.org\" >Middle East</location>.&quot;</p>\n<p>VISHNU VARATHAN, HEAD OF MACRO RESEARCH, <person>ASIA EX-JAPAN</person>, MIZUHO, <location value=\"LC/sg\" idsrc=\"xmltag.org\" >SINGAPORE</location>:</p>\n<p>&quot;A broader state of spots of regional attacks/instability may be par for the course - in line with <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran's</location> warning. Oil prices are likely to remain elevated as production and passage remain prone to attacks and disruptions. <org>OPEC</org> may be under pressure to raise production to try and offset. But a 10-25% premium on oil is not outlandish - even without a blockade of the <location>Strait of Hormuz</location>, which is easily a 50% premium risk event.&quot;</p>\n<p><person>CHRISTOPHER WONG</person>, STRATEGIST, OCBC, <location value=\"LC/sg\" idsrc=\"xmltag.org\" >SINGAPORE</location>:</p>\n<p>&quot;The strike raises geopolitical risk premia as markets head into Monday's open. The immediate reaction function is fairly predictable: safe-haven assets such as gold are likely to see an upside gap, while oil prices may also firm on supply-disruption concerns. Risk assets and high-beta currencies ... could face an initial bout of volatility, particularly if headlines suggest potential retaliation or regional spillovers.&quot;</p>\n<p><person>NICK FERRES</person>, CIO, VANTAGE POINT ASSET MANAGEMENT, <location value=\"LC/sg\" idsrc=\"xmltag.org\" >SINGAPORE</location>:</p>\n<p>&quot;Energy is still inexpensive. That's the obvious sector that rallies on Monday. And gold.&quot;</p>\n<p> (Reporting by <person>Scott Murdoch</person>, <person>Tom Westbrook</person> and <person>Rae Wee</person>; Additional reporting by <person>Scott DiSavino</person>, <person>Timothy Gardner</person>, and <person>Rishabh Jaiswal</person>; Compiled by <person>Vidya Ranganathan</person>; Editing by <person>Rod Nickel</person>, <person>Andrea Ricci</person>, <person>Cynthia Osterman</person> and <person>Christopher Cushing</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602282240RTRSNEWSCOMBINED_KBN3PI0PR-OUSBS_1",
            "pub_date": "2026-03-01 11:40:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Xiaomi says February EV deliveries topped 20,000, down from January",
            "description": "\n<p><location value=\"LU/cn..beijng\" idsrc=\"xmltag.org\" >BEIJING</location>, <chron>March 1</chron> (Reuters) - Chinese electric vehicle maker <org value=\"XIACF.NaE\" idsrc=\"xmltag.org\" >Xiaomi</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='XIACF' fmr-param-security-type='Equity'>( XIACF )</span> said it delivered more than 20,000 vehicles in February, down from more than 39,000 in January, according to a post on its official Weibo account on Sunday.</p>\n<p>The smartphone and consumer electronics maker, which launched its first electric car, the Speed Ultra 7 (SU7) sedan, in 2024, said it was preparing for mass production of the next-generation SU7.</p>\n<p></p>\n<p> (Reporting by <location value=\"LU/cn..beijng\" idsrc=\"xmltag.org\" >Beijing</location> newsroom; Editing by <person>Christian Schmollinger</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602282148RTRSNEWSCOMBINED_KBN3PJ1HH-OUSBS_1",
            "pub_date": "2026-03-01 10:48:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US-Iran strikes unleash travel chaos as airlines cancel flights",
            "description": "\n<p>*    Major mideast hubs, including <location value=\"LU/ae..dubai\" idsrc=\"xmltag.org\" >Dubai</location> and <location value=\"LU/qa..doha\" idsrc=\"xmltag.org\" >Doha</location>, close\nairports</p>\n<p>*    Crews, planes and passengers disrupted globally</p>\n<p>*    <location>Dubai airport</location>, world's busiest, sustains damage from\n<location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location> attack</p>\n<p>*    EU aviation regulator advises against flying over\n<location value=\"LR/mde\" idsrc=\"xmltag.org\" >Middle East</location> amid military operations\n(Updates with <location>Dubai airport</location> damage, releads, adds analyst quote\nin paragraph 5 &amp; 6)</p>\n<p>By <person>Federico Maccioni</person> and <person>Joanna Plucinska</person></p>\n<p><location value=\"LU/ae..dubai\" idsrc=\"xmltag.org\" >DUBAI</location>, <chron>Feb 28</chron> (Reuters) - <person>Major Middle Eastern</person> airports,\nincluding <location value=\"LU/ae..dubai\" idsrc=\"xmltag.org\" >Dubai</location>, the world's busiest international travel hub,\nwere shut on Saturday after U.S. and Israeli strikes on <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location> and\nIranian missile retaliation rippled through the region,\nunleashing one of the most severe disruptions to global aviation\nin years.\n<location value=\"LU/ae..dubai\" idsrc=\"xmltag.org\" >Dubai's</location> international airport, which handles more than 1,000\nflights a day, sustained damage during an overnight Iranian\nretaliatory attack on sites across the Arab Gulf states, while\n<location value=\"LU/ae..abudha\" idsrc=\"xmltag.org\" >Abu Dhabi</location> and <location value=\"LC/kw\" idsrc=\"xmltag.org\" >Kuwait's</location> international airports were also hit.\nMajor regional gateways including <location value=\"LU/ae..dubai\" idsrc=\"xmltag.org\" >Dubai</location>, <location value=\"LU/qa..doha\" idsrc=\"xmltag.org\" >Doha</location> and <location value=\"LU/ae..abudha\" idsrc=\"xmltag.org\" >Abu Dhabi</location> were\nclosed as countries across the <location value=\"LR/mde\" idsrc=\"xmltag.org\" >Middle East</location> shut their airspace\nfollowing the strikes and <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran's</location> retaliation. Flight maps showed\nskies over <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location>, <location value=\"LC/iq\" idsrc=\"xmltag.org\" >Iraq</location>, <location value=\"LC/kw\" idsrc=\"xmltag.org\" >Kuwait</location>, <location value=\"LC/il\" idsrc=\"xmltag.org\" >Israel</location> and <location value=\"LC/bh\" idsrc=\"xmltag.org\" >Bahrain</location> virtually\nempty, while airlines across <location value=\"LR/eur\" idsrc=\"xmltag.org\" >Europe</location> and the <location value=\"LR/mde\" idsrc=\"xmltag.org\" >Middle\nEast</location> announced sweeping cancellations.</p>\n<p><location value=\"LU/ae..dubai\" idsrc=\"xmltag.org\" >Dubai</location> and neighbouring <location value=\"LU/qa..doha\" idsrc=\"xmltag.org\" >Doha</location> sit at the crossroads of\neast-west air travel, funnelling long-haul traffic between\n<location value=\"LR/eur\" idsrc=\"xmltag.org\" >Europe</location> and <location value=\"LR/asp\" idsrc=\"xmltag.org\" >Asia</location> through a tightly scheduled network of\nconnecting flights. Any prolonged shutdown of its airports\nripples far beyond the region, forcing airlines worldwide to\nreroute or cancel services.</p>\n<p>&quot;The scale of these hubs today is just so enormous. You will\nhave hundreds of thousands of people being stuck in wrong parts\nof the world without any certainty as to when they can move,&quot;\nsaid UK-based aviation analyst <person>John Strickland</person>.</p>\n<p>&quot;It hits at so many levels. There is the immediate issue of\nwhat happens today and the ricochet effect of how long this\npersists,&quot; Strickland added, noting that major Gulf airlines,\nlike <org>Emirates and Qatar Airways</org>, are also among the world's\nbiggest cargo operators.</p>\n<p>Dubai Airports suspended all flights at <org>Dubai International</org>\nand at <org>Al Maktoum International</org> until further notice, urging\npassengers not to travel.</p>\n<p></p>\n<p>AIRSPACE COULD BE CLOSED FOR 'SOME TIME'\nThe U.S. and <location value=\"LC/il\" idsrc=\"xmltag.org\" >Israel</location> launched their most ambitious attack on <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location>\nin decades on Saturday, killing <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran's</location> Supreme Leader Ayatollah\nAli Khamenei and prompting <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location> to retaliate with missile and\ndrone attacks, sharply raising the risk of a broader <location value=\"LR/mde\" idsrc=\"xmltag.org\" >Middle East</location>\nconflict.</p>\n<p>&quot;Passengers and airlines can expect airspace to be shut for\nquite some time,&quot; said <person>Eric Schouten</person>, head of aviation security\nadvisory Dyami.</p>\n<p>Airlines cancelled on Saturday about half of their flights\nto <location value=\"LC/qa\" idsrc=\"xmltag.org\" >Qatar</location> and <location value=\"LC/il\" idsrc=\"xmltag.org\" >Israel</location> and about 28% of their flights to <location value=\"LC/kw\" idsrc=\"xmltag.org\" >Kuwait</location>,\nafter <location value=\"LC/us\" idsrc=\"xmltag.org\" >the United States</location> and <location value=\"LC/il\" idsrc=\"xmltag.org\" >Israel</location> launched strikes on <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location>,\naccording to preliminary Cirium data. In total, about 24% of\nflights to the <location value=\"LR/mde\" idsrc=\"xmltag.org\" >Middle East</location> were cancelled, the data showed.</p>\n<p>The region has become more important for global aviation\nsince the <location value=\"LC/ru\" idsrc=\"xmltag.org\" >Russia</location>-<location value=\"LC/ua\" idsrc=\"xmltag.org\" >Ukraine</location> war forced airlines to avoid both\ncountries' airspace.</p>\n<p>Conflict zones add to operational risks, raising fears of\naccidental shoot-downs and lengthening routes, which increases\nfuel costs.</p>\n<p></p>\n<p></p>\n<p>PASSENGERS STRANDED ACROSS <location value=\"LR/eur\" idsrc=\"xmltag.org\" >EUROPE</location></p>\n<p>Students travelling from <location value=\"LU/fr..paris\" idsrc=\"xmltag.org\" >Paris</location> to <location value=\"LU/ae..dubai\" idsrc=\"xmltag.org\" >Dubai</location> said their college\ntrip was abandoned. &quot;We still have some students that went there\nearlier and they're stuck in <location value=\"LU/ae..dubai\" idsrc=\"xmltag.org\" >Dubai</location> and we don't know when\nthey'll be able to come back,&quot; said <person>Benjamin Gnatek</person>.</p>\n<p>At <location>Charles de Gaulle airport</location>, Thai-bound traveller <person>Roman\nSimon</person> said his onward flight via <location value=\"LU/qa..doha\" idsrc=\"xmltag.org\" >Doha</location> was cancelled. &quot;Now, we're\ntrying to find a solution to still make our trip to <location value=\"LC/th\" idsrc=\"xmltag.org\" >Thailand</location>,&quot;\nhe told Reuters.</p>\n<p>At <location value=\"LU/qa..doha\" idsrc=\"xmltag.org\" >Doha's</location> <location>Hamad International Airport</location>, gates were nearly\nempty as stranded passengers queued to make hotel arrangements,\na Reuters witness said.\nAs countries in the region closed their airspace, aircraft were\nforced to divert around Larnaca, <location value=\"LU/sa..jeddah\" idsrc=\"xmltag.org\" >Jeddah</location>, <location value=\"LU/eg..cairo\" idsrc=\"xmltag.org\" >Cairo</location> and <location value=\"LU/sa..riyadh\" idsrc=\"xmltag.org\" >Riyadh</location>.\nFlightradar24 briefly went down due to surging demand.</p>\n<p><org>The European Union's</org> aviation regulator EASA on Saturday\nrecommended its airlines stay out of the airspace affected by\nthe ongoing military intervention.</p>\n<p></p>\n<p>(Reporting by <person>Federico Maccioni</person> in <location value=\"LU/ae..dubai\" idsrc=\"xmltag.org\" >Dubai</location> and <person>Joanna Plucinska</person>\nin <location value=\"LU/gb.eng.london\" idsrc=\"xmltag.org\" >London</location>; Additional reporting by <person>Scott DiSavino</person> in <location value=\"LU/us.ny.nyc\" idsrc=\"xmltag.org\" >New York</location>,\n<person>Justyna Pawlak</person> in <location value=\"LU/qa..doha\" idsrc=\"xmltag.org\" >Doha</location>, <person>Tim Hepher</person> in <location value=\"LU/fr..paris\" idsrc=\"xmltag.org\" >Paris</location> and <person>Joe Brock</person> in <location value=\"LU/us.ca.losang\" idsrc=\"xmltag.org\" >Los\nAngeles</location>; Editing by <person>Adam Jourdan</person>, <person>Josephine Mason</person>, <person>Janet\nLawrence</person>, <person>Sharon Singleton</person>, <person>Rod Nickel</person>, <person>Louise Heavens</person> and <person>Deepa\nBabington</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602282058RTRSNEWSCOMBINED_L6N3ZO06V_1",
            "pub_date": "2026-03-01 09:58:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Oil and gas majors and traders suspend shipments via Hormuz, sources say",
            "description": "\n<p><location value=\"LU/gb.eng.london\" idsrc=\"xmltag.org\" >LONDON</location>, <chron>Feb 28</chron> (Reuters) - Several tanker owners, oil majors and trading houses have suspended crude oil, fuel and liquefied natural gas shipments via the <location>Strait of Hormuz</location> after the U.S. and <location value=\"LC/il\" idsrc=\"xmltag.org\" >Israel</location> attacked <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location> and <location value=\"LU/ir..tehran\" idsrc=\"xmltag.org\" >Tehran</location> said it had closed navigation, trading sources said on Saturday.</p>\n<p>&quot;Our ships will stay put for several days,&quot; one top executive at a major trading desk said. Satellite images from tanker trackers showed vessels backed up next to big ports, such as <location value=\"LU/ae..fujrah\" idsrc=\"xmltag.org\" >Fujairah</location> in the <location value=\"LC/ae\" idsrc=\"xmltag.org\" >United Arab Emirates</location>, and not moving through Hormuz.</p>\n<p>Multiple vessels in the area have received VHF transmission from <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran's</location> Revolutionary Guards that &quot;no ship is allowed to pass the <location>Strait of Hormuz</location>&quot;, an official with the EU naval mission Aspides told Reuters.</p>\n<p><org>The British Navy</org> said <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran's</location> orders were not legally binding and advised vessels to transit with caution.</p>\n<p>Vessel traffic through the <location>Strait of Hormuz</location> has not completely stopped but disruptions are building rapidly, shipbroker <org>Poten &amp; Partners</org> said in a note to clients.</p>\n<p>The tanker association INTERTANKO said the <org>U.S. Navy</org> had warned against navigation in the area - the whole of the Gulf, Gulf of <location value=\"LC/om\" idsrc=\"xmltag.org\" >Oman</location>, <location>North Arabian Sea</location>, and the <location>Strait of Hormuz</location> - saying it could not guarantee the safety of shipping.</p>\n<p><location value=\"LC/gr\" idsrc=\"xmltag.org\" >Greece's</location> shipping ministry advised vessels on Saturday to avoid the Persian Gulf, the Gulf of <location value=\"LC/om\" idsrc=\"xmltag.org\" >Oman</location> and the <location>Strait of Hormuz</location>, according to an advisory seen by Reuters.</p>\n<p>Some 20% of global oil, including from producers <location value=\"LC/sa\" idsrc=\"xmltag.org\" >Saudi Arabia</location>, the <location value=\"LC/ae\" idsrc=\"xmltag.org\" >United Arab Emirates</location>, <location value=\"LC/iq\" idsrc=\"xmltag.org\" >Iraq</location>, <location value=\"LC/kw\" idsrc=\"xmltag.org\" >Kuwait</location> and <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location>, passes through Hormuz along with large volumes of LNG from <location value=\"LC/qa\" idsrc=\"xmltag.org\" >Qatar</location>.</p>\n<p>Fourteen LNG tankers have shown signs of slowing down, U-turning or stopping in or around the Strait, said <person>Laura Page</person> from consultancy Kpler, adding that the number would likely rise, posing risks to Qatari LNG exports.</p>\n<p>German container-shipping group <org value=\"HLAGF.NaE\" idsrc=\"xmltag.org\" >Hapag-Lloyd</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='HLAGF' fmr-param-security-type='Equity'>( HLAGF )</span> said it is suspending all vessel transit through the <location>Strait of Hormuz</location> until further notice. Services calling on ports in the Gulf may experience delays, rerouting or schedule adjustments, the company said.</p>\n<p><location value=\"LC/dk\" idsrc=\"xmltag.org\" >Denmark's</location> Maersk said in an undated update on its website that it was coordinating with security partners on all operations in the <location>Red Sea</location> and the Gulf of Aden but cargo acceptance in the <location value=\"LR/mde\" idsrc=\"xmltag.org\" >Middle East</location> remained open.</p>\n<p>French shipping group CMA CGM said it had told its vessels inside or headed for the Gulf to proceed to shelter after <location value=\"LC/us\" idsrc=\"xmltag.org\" >the United States</location> and <location value=\"LC/il\" idsrc=\"xmltag.org\" >Israel</location> attacked <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location>.</p>\n<p> (Reporting by Dmitri Zhdannikov, <person>Marwa Rashad</person>, <person>Shariq Khan</person> and <person>Enes Tunagur</person>, Renee Maltezou and <person>Yannis Souliotis</person>; Editing by <person>Aidan Lewis</person>, <person>Kevin Liffey</person>, <person>Louise Heavens</person> and <person>Edmund Klamann</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/top-news/202602281155RTRSNEWSCOMBINED_KBN3PI0KY-OUSBS_1",
            "pub_date": "2026-03-01 09:45:49",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "OpenAI details layered protections in US defense department pact",
            "description": "\n<p><chron>Feb 28</chron> (Reuters) - OpenAI said on Saturday that the agreement it struck a day ago with the Pentagon to deploy technology on the U.S. defense department's classified network includes additional safeguards to protect its use cases.</p>\n<p>U.S. President Donald Trump on Friday directed the government to stop working with Anthropic, and the Pentagon said it would declare the startup a supply-chain risk, dealing a major blow to the artificial intelligence lab after a showdown about technology guardrails. Anthropic said it would challenge any risk designation in court.</p>\n<p>Soon after, rival OpenAI, which is backed by <org value=\"MSFT.NaE\" idsrc=\"xmltag.org\" >Microsoft</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='MSFT' fmr-param-security-type='Equity'>( MSFT )</span>, <org value=\"AMZN.NaE\" idsrc=\"xmltag.org\" >Amazon</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AMZN' fmr-param-security-type='Equity'>( AMZN )</span>, SoftBank and others, announced its own deal late on Friday.</p>\n<p>&quot;We think our agreement has more guardrails than any previous agreement for classified AI deployments, including Anthropic's,&quot; OpenAI said on Saturday.</p>\n<p>The AI firm said that the contract with the <org>Department of Defense</org>, which the Trump administration has renamed the <org>Department of War</org>, enforces three red lines: OpenAI technology cannot be used for mass domestic surveillance, to direct autonomous weapons systems, or for any high-stakes automated decisions.</p>\n<p>&quot;In our agreement, we protect our red lines through a more expansive, multi-layered approach. We retain full discretion over our safety stack, we deploy via cloud, cleared OpenAI personnel are in the loop, and we have strong contractual protections,&quot; OpenAI said.</p>\n<p>The Pentagon signed agreements worth up to <money>$200 million</money> each with major AI labs in the past year, including Anthropic, OpenAI and Google. The Pentagon is seeking to preserve all flexibility in defense and not be limited by warnings from the technology's creators against powering weapons with unreliable AI.</p>\n<p>OpenAI cautioned that any breach of its contract by the U.S. government could trigger a termination, though it added, &quot;We don't expect that to happen.&quot;</p>\n<p>The company also said rival Anthropic should not be labeled a \"supply-chain risk,\" noting, &quot;We have made our position on this clear to the government.&quot;</p>\n<p> (Reporting by <person>Mrinmay Dey</person> in <location value=\"LU/mx.sm.mexcty\" idsrc=\"xmltag.org\" >Mexico City</location> and Ananya Palyekar in <location value=\"LU/in..bangal\" idsrc=\"xmltag.org\" >Bangalore</location>; Editing by <person>Cynthia Osterman</person> and <person>Andrea Ricci</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602282020RTRSNEWSCOMBINED_KBN3PI18U-OUSBS_1",
            "pub_date": "2026-03-01 09:20:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Berkshire CEO Abel seeks to reassure shareholders after taking baton from Buffett",
            "description": "<p><chron>Feb 28</chron> (Reuters) - <org value=\"BRK/A.NaE\" idsrc=\"xmltag.org\" >Berkshire Hathaway's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='BRK/A' fmr-param-security-type='Equity'>( BRK/A )</span> new Chief Executive <person>Greg Abel</person> moved to put his stamp on the conglomerate with his first annual letter to shareholders on Saturday, pledging to maintain its &quot;fortress-like&quot; balance sheet and uphold the values of his predecessor and mentor, <person>Warren Buffett</person>.</p>\n<p>Abel, 63, said he wouldn't rush to deploy Berkshire's near-record <money>$373.3 billion</money> cash stake, though he said it gave the company plenty of &quot;dry powder&quot; and that he had no plans to begin paying dividends, which Buffett also opposed. Berkshire has not repurchased its own stock since the spring of 2024.</p>\n<p>&quot;I recognize how you want us to succeed together, and to do so in the right way,&quot; Abel wrote in an 18-page, single-spaced letter. &quot;My role is to ensure our liquidity levels and capital deployment remain intentional and deliberate.&quot;</p>\n<p>Abel also paid homage to Buffett, 95, who remains chairman and goes to Berkshire's offices five days a week, calling him a &quot;remarkable&quot; CEO.</p>\n<p>&quot;<person>Warren Buffett</person> is arguably the greatest investor of all time, with generations benefiting from his investment acumen,&quot; Abel wrote. &quot;To invest in Berkshire has long been a vote of trust in our founder - a trust that now rests with Berkshire.&quot;</p>\n<p>Berkshire shares have significantly underperformed the Standard &amp; Poor's 500 index since Buffett announced unexpectedly in May he was stepping aside as CEO.</p>\n<p>Though Abel's letter lacked Buffett's writing flair, <org>CFRA Research</org> analyst <person>Cathy Seifert</person> said it might prove reassuring to investors.</p>\n<p>&quot;He needed to show a degree of continuity, that the Berkshire franchise would continue despite the change in leadership, and it would be business as usual,&quot; she said. &quot;In my opinion, he hit the mark.&quot;</p>\n<p>The letter also signaled that Abel wouldn't upend Buffett's 60 years of work transforming Berkshire from a failing textile company into a more than <money>$1 trillion</money> conglomerate that owns car insurer Geico, BNSF railroad and dozens of other insurance, manufacturing, energy and retail businesses.</p>\n<p>&quot;If there were any doubts about whether Greg was the right individual to take the reins, the letter should dispel them,&quot; said <person>Dan Hanson</person>, who oversees more than <money>$6 billion</money> as head of the quality equity team at Neuberger Berman. </p>\n<p>PROFIT DECLINES</p>\n<p>Berkshire also reported declining profit, after taking writedowns for its approximately 27% stakes in both Kraft Heinz and oil company Occidental Petroleum.</p>\n<p>Fourth-quarter operating profit fell 30% to <money>$10.2 billion</money> as income from insurance operations such as Geico declined.</p>\n<p>Net income fell 3% to <money>$19.2 billion</money>, reflecting a <money>$4.5 billion</money> writedown for Occidental, despite gains from equity holdings led by <org value=\"AAPL.NaE\" idsrc=\"xmltag.org\" >Apple</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AAPL' fmr-param-security-type='Equity'>( AAPL )</span> and <org value=\"AXP.NaE\" idsrc=\"xmltag.org\" >American Express</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AXP' fmr-param-security-type='Equity'>( AXP )</span>.</p>\n<p>For all of 2025, operating profit fell 6% to <money>$44.49 billion</money>, while net income fell 25% to <money>$66.97 billion</money>. Buffett had long urged investors to ignore fluctuations in Berkshire's net income, which reflect accounting rules for equity investments.</p>\n<p>Full-year revenue was essentially unchanged at <money>$371.44 billion</money>, and Seifert said Abel &quot;teed up an expectation that reinsurance and commercial insurance growth may be nonexistent&quot; in 2026.&quot;</p>\n<p>One of Berkshire's best-known businesses, Fruit of the Loom, shed 6,000 jobs last year as revenue fell, Berkshire said.</p>\n<p>WILDFIRE-BATTERED PACIFICORP UTILITY 'NOT A DEEP POCKET'</p>\n<p>Abel said Berkshire's culture and values will continue &quot;in perpetuity,&quot; and signaled no changes in its decentralized structure in which its dozens of businesses operate largely without interference from the top.</p>\n<p>He also signaled a willingness to stick around, suggesting that in 20 years he will have had &quot;just a fraction of the tenure that Warren had.&quot;</p>\n<p>Abel pledged to invest in durable, well-managed businesses that Berkshire understands and &quot;avoid businesses that undermine the fabric of society or could jeopardize Berkshire's reputation.&quot;</p>\n<p>He didn't elaborate, but Seifert said he could have been referring to artificial intelligence. </p>\n<p>Abel acknowledged pressures on its PacifiCorp utility from litigation over <location value=\"LS/us.or\" idsrc=\"xmltag.org\" >Oregon</location> and <location value=\"LS/us.ca\" idsrc=\"xmltag.org\" >California</location> wildfires that burned more than 500,000 acres in 2020.</p>\n<p>Many victims blame PacifiCorp, saying it failed to shut off power lines. The utility has reached more than <money>$2.2 billion</money> of settlements, but faces <money>$50 billion</money> of additional wildfire claims. Abel said Berkshire accepts responsibility when it causes wildfires, but will fight unjustified claims in court.</p>\n<p>&quot;PacifiCorp is not an insurer of last resort and should not be treated as a deep pocket,&quot; Abel said. &quot;Accountability, paired with principled opposition to unwarranted liability, is essential to preserving the regulatory compact that governs utilities.&quot; </p>\n<p>TED WESCHLER STAYS ON</p>\n<p>Abel was more critical than Buffett of Berkshire businesses that could perform better.</p>\n<p>He said the performance gap between BNSF and industry-leading rivals is &quot;too wide,&quot; while &quot;self-inflicted&quot; difficulties at the Shaw flooring company hurt quality and service.</p>\n<p>&quot;Each business is accountable to its CEO, who is expected to pursue operational excellence relentlessly and close performance gaps,&quot; Abel said, referring to Berkshire's non-insurance businesses.</p>\n<p>Hanson, the Neuberger Berman investment manager, said: &quot;Those are fighting words.&quot;</p>\n<p>Berkshire has not named a chief investment officer to replace Buffett, though Abel said responsibility for equity investments &quot;ultimately resides with me as CEO.&quot;</p>\n<p>Abel signaled that longtime portfolio manager <person>Ted Weschler</person>, who manages about 6% of Berkshire's equity investments, will continue playing a &quot;broader role&quot; assessing significant investment opportunities and supporting Berkshire in other ways.</p>\n<p></p>\n<p> (Reporting by <person>Jonathan Stempel</person> in <location value=\"LU/us.ny.nyc\" idsrc=\"xmltag.org\" >New York</location>, Editing by <person>Megan Davies</person>, <person>Louise Heavens</person> and <person>Cynthia Osterman</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/top-news/202602281358RTRSNEWSCOMBINED_KBN3PI13J-OUSBS_1",
            "pub_date": "2026-03-01 09:25:51",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CANADA STOCKS-TSX ends lower but posts biggest monthly gain since 2020",
            "description": "\n<p>*</p>\n<p>TSX ends down 0.5% at 34,339.99,</p>\n<p></p>\n<p>*</p>\n<p>Posts 7.6% monthly gain</p>\n<p></p>\n<p>*</p>\n<p>Tech falls 2.5%, financials end 1.9% lower</p>\n<p></p>\n<p>*</p>\n<p>Energy adds 1.2% as oil settles up 2.8%</p>\n<p>(Updates at market close)</p>\n<p>By <person>Fergal Smith</person></p>\n<p><chron>Feb 27</chron> (Reuters) - <location value=\"LC/ca\" idsrc=\"xmltag.org\" >Canada's</location> main stock index gave back\nsome of its monthly gain on Friday as declines for financial and\ntechnology shares offset gains for resource stocks, while\ndomestic data showed the economy contracting in the fourth\nquarter.</p>\n<p>The S&amp;P/TSX composite index ended down 161.97\npoints, or 0.5%, at 34,339.99, after posting a record closing\nhigh in the three previous days.</p>\n<p><location>Wall Street</location> also lost ground as worries about credit losses\nand artificial intelligence disruption weighed.</p>\n<p>&quot;There is a lot of debate about AI disruption, spending.\nSome of that is finding its way into financials today as there\nare some worries that private credit issues may be starting to\nemerge,&quot; said Angelo Kourkafas, senior global investment\nstrategist at Edward Jones.</p>\n<p>&quot;On the flip side you have materials and energy that are\ndoing the heavy lifting for the TSX as investors rotate into\nreal asset businesses that are less likely to be disrupted by\nAI.&quot;</p>\n<p>For the month, the TSX added 7.6%, marking its biggest\nmonthly gain since <chron>November 2020</chron>, as metal mining shares\nbenefited from higher gold prices and stronger-than-expected\nbank earnings boosted financials.</p>\n<p>The <location value=\"LU/ca.on.tornto\" idsrc=\"xmltag.org\" >Toronto</location> market has advanced for 10 straight months, the\nlongest such winning streak since 2017.</p>\n<p><location value=\"LC/ca\" idsrc=\"xmltag.org\" >Canada's</location> gross domestic product fell at an annualized pace\nof 0.6% in the October-December quarter as manufacturers dipped\nheavily into inventories to meet demand, closing out the slowest\nyear of growth for the country since 2020.</p>\n<p>The technology sector lost 2.5% on Friday, with\nshares of e-commerce company <org value=\"SHOP.NaE\" idsrc=\"xmltag.org\" >Shopify Inc</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='SHOP' fmr-param-security-type='Equity'>( SHOP )</span> ending 4.3%\nlower.</p>\n<p>Financials fell 1.9%, while consumer discretionary\nwas down 1% as shares of apparel company <org value=\"ATZAF.NaE\" idsrc=\"xmltag.org\" >Aritzia</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='ATZAF' fmr-param-security-type='Equity'>( ATZAF )</span>\ndropped 7.8%.\nThree of 10 major sectors notched gains, including energy\n. It added 1.2% as the price of oil settled 2.8%\nhigher at <money>$67.02</money> a barrel.</p>\n<p>Traders braced for oil supply disruptions as nuclear talks\nbetween <location value=\"LC/us\" idsrc=\"xmltag.org\" >the United States</location> and <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location> had yet to reach an\nagreement.\nThe materials group, which includes metal mining shares, was up\n1% as the price of gold advanced 1.4%, benefiting from\nsafe-haven demand.\n(Reporting by <person>Fergal Smith</person> and <person>Utkarsh Tushar Hathi</person>; Editing by\n<person>Shailesh Kuber</person> and <person>Nick Zieminski</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/international/202602271651RTRSNEWSCOMBINED_L6N3ZN164_1",
            "pub_date": "2026-02-28 05:51:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "South Korea Feb exports beat forecasts, rise for ninth month",
            "description": "<p><location value=\"LU/kr..seoul\" idsrc=\"xmltag.org\" >SEOUL</location>, <chron>March 1</chron> (Reuters) - <location value=\"LC/kr\" idsrc=\"xmltag.org\" >South Korea's</location> exports extended their growth streak to a ninth month in February as strong chip sales continued to underpin overall shipments even as uncertainties regarding U.S. tariffs cloud the outlook.</p>\n<p>Exports from <location value=\"LR/asp\" idsrc=\"xmltag.org\" >Asia's</location> fourth-largest economy, a bellwether for global trade, increased 29.0% in February from a year earlier to <money>$67.45 billion</money>, trade data showed, beating the median forecast of a 24.0% gain in a Reuters poll of economists.</p>\n<p>Imports gained 7.5%, slower than the 13.0% estimated in the poll.</p>\n<p>The preliminary trade balance stood at <money>$15.51 billion</money> in February.</p>\n<p>&quot;Semiconductor exports jumped 160.9% to again record their highest monthly performance ever and exceeded <money>$20 billion</money> in value for three consecutive months, driven by strong demand thanks to AI investment and a surge in memory prices,&quot; the trade ministry said in a statement.</p>\n<p></p>\n<p> (Reporting by <person>Cynthia Kim</person>; Editing by <person>Edmund Klamann</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/technology/202602281935RTRSNEWSCOMBINED_KBN3PJ1DO-OUSBS_1",
            "pub_date": "2026-03-01 08:35:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Oil and gas majors and traders suspend shipments via Hormuz, sources say",
            "description": "\n<p><location value=\"LU/gb.eng.london\" idsrc=\"xmltag.org\" >LONDON</location>, <chron>Feb 28</chron> (Reuters) - Several tanker owners, oil\nmajors and trading houses have suspended crude oil, fuel and\nliquefied natural gas shipments via the <location>Strait of Hormuz</location> after\nthe U.S. and <location value=\"LC/il\" idsrc=\"xmltag.org\" >Israel</location> attacked <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location> and <location value=\"LU/ir..tehran\" idsrc=\"xmltag.org\" >Tehran</location> said it had closed\nnavigation, trading sources said on Saturday.</p>\n<p>&quot;Our ships will stay put for several days,&quot; one top\nexecutive at a major trading desk said. Satellite images from\ntanker trackers showed vessels backed up next to big ports, such\nas <location value=\"LU/ae..fujrah\" idsrc=\"xmltag.org\" >Fujairah</location> in the <location value=\"LC/ae\" idsrc=\"xmltag.org\" >United Arab Emirates</location>, and not moving through\nHormuz.</p>\n<p>Multiple vessels in the area have received VHF transmission\nfrom <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran's</location> Revolutionary Guards that &quot;no ship is allowed to\npass the <location>Strait of Hormuz</location>&quot;, an official with the EU naval\nmission Aspides told Reuters.</p>\n<p><org>The British Navy</org> said <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran's</location> orders were not legally binding\nand advised vessels to transit with caution.</p>\n<p>Vessel traffic through the <location>Strait of Hormuz</location> has not\ncompletely stopped but disruptions are building rapidly,\nshipbroker <org>Poten &amp; Partners</org> said in a note to clients.</p>\n<p>The tanker association INTERTANKO said the <org>U.S. Navy</org> had\nwarned against navigation in the area - the whole of the Gulf,\nGulf of <location value=\"LC/om\" idsrc=\"xmltag.org\" >Oman</location>, <location>North Arabian Sea</location>, and the <location>Strait of Hormuz</location> -\nsaying it could not guarantee the safety of shipping.</p>\n<p><location value=\"LC/gr\" idsrc=\"xmltag.org\" >Greece's</location> shipping ministry advised vessels on Saturday to\navoid the Persian Gulf, the Gulf of <location value=\"LC/om\" idsrc=\"xmltag.org\" >Oman</location> and the <location>Strait of\nHormuz</location>, according to an advisory seen by Reuters.</p>\n<p>Some 20% of global oil, including from producers <location value=\"LC/sa\" idsrc=\"xmltag.org\" >Saudi\nArabia</location>, the <location value=\"LC/ae\" idsrc=\"xmltag.org\" >United Arab Emirates</location>, <location value=\"LC/iq\" idsrc=\"xmltag.org\" >Iraq</location>, <location value=\"LC/kw\" idsrc=\"xmltag.org\" >Kuwait</location> and <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location>, passes\nthrough Hormuz along with large volumes of LNG from <location value=\"LC/qa\" idsrc=\"xmltag.org\" >Qatar</location>.</p>\n<p>Fourteen LNG tankers have shown signs of slowing down,\nU-turning or stopping in or around the Strait, said <person>Laura Page</person>\nfrom consultancy Kpler,adding that the number would likely rise,\nposing risks to Qatari LNG exports.</p>\n<p>German container-shipping group <org value=\"HLAGF.NaE\" idsrc=\"xmltag.org\" >Hapag-Lloyd</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='HLAGF' fmr-param-security-type='Equity'>( HLAGF )</span> said\nit is suspending all vessel transit through the <location>Strait of Hormuz</location>\nuntil further notice. Services calling on ports in the Gulf may\nexperience delays, rerouting or schedule adjustments, the\ncompany said.</p>\n<p><location value=\"LC/dk\" idsrc=\"xmltag.org\" >Denmark's</location> Maersk said in an undated update on\nits website that it was coordinating with security partners on\nall operations in the <location>Red Sea</location> and the Gulf of Aden but cargo\nacceptance in the <location value=\"LR/mde\" idsrc=\"xmltag.org\" >Middle East</location> remained open.</p>\n<p>French shipping group CMA CGM said it had told its vessels\ninside or headed for the Gulf to proceed to shelter after <location value=\"LC/us\" idsrc=\"xmltag.org\" >the\nUnited States</location> and <location value=\"LC/il\" idsrc=\"xmltag.org\" >Israel</location> attacked <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location>.\n(Reporting by Dmitri Zhdannikov, <person>Marwa Rashad</person>, <person>Shariq Khan</person> and\n<person>Enes Tunagur</person>, Renee Maltezou and <person>Yannis Souliotis</person>; Editing by\n<person>Aidan Lewis</person>, <person>Kevin Liffey</person>, <person>Louise Heavens</person> and <person>Edmund Klamann</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602281845RTRSNEWSCOMBINED_L6N3ZO0AY_1",
            "pub_date": "2026-03-01 07:45:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "OpenAI details layered protections in US defense department pact",
            "description": "\n<p>*    OpenAI's deal with Pentagon includes additional\nsafeguards</p>\n<p>*    OpenAI's contract enforces three red lines for AI use</p>\n<p>*    Agreement prohibits AI use for autonomous weapons\nsystems</p>\n<p>*    OpenAI says opposes labeling Anthropic as a supply\nchain risk\n(Adds details, background throughout)</p>\n<p><chron>Feb 28</chron> (Reuters) - OpenAI said on Saturday that the\nagreement it struck a day ago with the Pentagon to deploy\ntechnology on the U.S. defense department's classified network\nincludes additional safeguards to protect its use cases.</p>\n<p>U.S. President Donald Trump on Friday directed the\ngovernment to stop working with Anthropic, and the Pentagon said\nit would declare the startup a supply-chain risk, dealing a\nmajor blow to the artificial intelligence lab after a showdown\nabout technology guardrails. Anthropic said it would challenge\nany risk designation in court.</p>\n<p>Soon after, rival OpenAI, which is backed by <org value=\"MSFT.NaE\" idsrc=\"xmltag.org\" >Microsoft</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='MSFT' fmr-param-security-type='Equity'>( MSFT )</span>\n, <org value=\"AMZN.NaE\" idsrc=\"xmltag.org\" >Amazon</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AMZN' fmr-param-security-type='Equity'>( AMZN )</span>, SoftBank and others,\nannounced its own deal late on Friday.</p>\n<p>&quot;We think our agreement has more guardrails than any\nprevious agreement for classified AI deployments, including\nAnthropic's,&quot; OpenAI said on Saturday.</p>\n<p>The AI firm said that the contract with the <org>Department of\nDefense</org>, which the Trump administration has renamed the\n<org>Department of War</org>, enforces three red lines: OpenAI technology\ncannot be used for mass domestic surveillance, to direct\nautonomous weapons systems, or for any high-stakes automated\ndecisions.</p>\n<p>&quot;In our agreement, we protect our red lines through a more\nexpansive, multi-layered approach. We retain full discretion\nover our safety stack, we deploy via cloud, cleared OpenAI\npersonnel are in the loop, and we have strong contractual\nprotections,&quot; OpenAI said.</p>\n<p>The Pentagon signed agreements worth up to <money>$200 million</money> each\nwith major AI labs in the past year, including Anthropic, OpenAI\nand Google. The Pentagon is seeking to preserve all flexibility\nin defense and not be limited by warnings from the technology's\ncreators against powering weapons with unreliable AI.</p>\n<p>OpenAI cautioned that any breach of its contract by the U.S.\ngovernment could trigger a termination, though it added, &quot;We\ndon't expect that to happen.&quot;</p>\n<p>The company also said rival Anthropic should not be labeled\na \"supply-chain risk,\" noting, &quot;We have made our position on\nthis clear to the government.&quot;\n(Reporting by <person>Mrinmay Dey</person> in <location value=\"LU/mx.sm.mexcty\" idsrc=\"xmltag.org\" >Mexico City</location> and Ananya Palyekar in\n<location value=\"LU/in..bangal\" idsrc=\"xmltag.org\" >Bangalore</location>; Editing by <person>Cynthia Osterman</person> and <person>Andrea Ricci</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602281803RTRSNEWSCOMBINED_L1N3ZO0E8_1",
            "pub_date": "2026-03-01 07:03:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "REUTERS NEWS SCHEDULE AT 10 p.m. GMT/6.00 a.m. SGT",
            "description": "\n<p>Here are the top stories and upcoming coverage plans for Reuters\ntext service as of <chron>10 p.m. GMT</chron>/<chron>6.00 a.m.</chron> SGT. For a full\nschedule of news and events, go to our editorial calendar on\nReuters Connect.</p>\n<p></p>\n<p>TOP STORIES</p>\n<p></p>\n<p>GLOBAL</p>\n<p><location value=\"LC/ir\" idsrc=\"xmltag.org\" >IRAN</location>-CRISIS/</p>\n<p>Iranian leader Khamenei killed in strikes, <location value=\"LC/il\" idsrc=\"xmltag.org\" >Israel</location> says</p>\n<p><location value=\"LU/us.dc.wash\" idsrc=\"xmltag.org\" >WASHINGTON</location>/<location value=\"LU/il..jerusl\" idsrc=\"xmltag.org\" >JERUSALEM</location>/<location value=\"LU/ae..dubai\" idsrc=\"xmltag.org\" >DUBAI</location>/<location value=\"LU/qa..doha\" idsrc=\"xmltag.org\" >DOHA</location>, <chron>Feb 28</chron> (Reuters) - <location value=\"LC/us\" idsrc=\"xmltag.org\" >The\nUnited States</location> and <location value=\"LC/il\" idsrc=\"xmltag.org\" >Israel</location> launched the most ambitious attack on\n<location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location> in decades on Saturday, and <location value=\"LC/il\" idsrc=\"xmltag.org\" >Israel</location> said Supreme Leader <person>Ali\nKhamenei</person> had been killed in the operation.</p>\n<p></p>\n<p><location value=\"LC/ir\" idsrc=\"xmltag.org\" >IRAN</location>-CRISIS/GULF-FEARS/</p>\n<p>Analysis-<location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location> missiles brings war to Gulf doorstep; hardens\nsupport for US-Israel campaign</p>\n<p><location value=\"LU/ae..dubai\" idsrc=\"xmltag.org\" >DUBAI</location>, <chron>Feb 28</chron> (Reuters) - Thunderous blasts and towering\nfireballs from Iranian missiles streaking across Gulf states\nvindicated their leaders' long-held fears that <location value=\"LU/ir..tehran\" idsrc=\"xmltag.org\" >Tehran</location> can bring\nwar to their doorstep, likely to harden Arab rulers' support for\nU.S.-Israeli strikes.</p>\n<p></p>\n<p>U.S.</p>\n<p><location value=\"LC/ir\" idsrc=\"xmltag.org\" >IRAN</location>-CRISIS/<location value=\"LC/us\" idsrc=\"xmltag.org\" >USA</location>-TRUMP-ADVICE/</p>\n<p>Exclusive-Ahead of strikes, Trump was told <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location> attack is\nhigh risk, high reward</p>\n<p><location value=\"LU/us.dc.wash\" idsrc=\"xmltag.org\" >WASHINGTON</location>, <chron>Feb 28</chron> (Reuters) - Ahead of the U.S. attack on\n<location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location>, President <person>Donald Trump</person> received briefings that not only\ndelivered blunt assessments about the risk of major U.S.\ncasualties but also touted the prospect of a geopolitical shift\nin the <location value=\"LR/mde\" idsrc=\"xmltag.org\" >Middle East</location> in favor of U.S. interests, a U.S. official\ntold Reuters.</p>\n<p></p>\n<p><location value=\"LC/ir\" idsrc=\"xmltag.org\" >IRAN</location>-CRISIS/TRUMP-MAGA/</p>\n<p>Trump's <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location> strike tests MAGA unity ahead of midterms</p>\n<p><location value=\"LU/us.dc.wash\" idsrc=\"xmltag.org\" >WASHINGTON</location>, <chron>Feb 28</chron> (Reuters) - Some of the most prominent\nvoices within <person>Donald Trump's</person> MAGA movement spoke out on Saturday\nagainst his attack on <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location>, warning it could hurt Republicans in\nNovember's midterm elections, but there was no immediate sign of\noutright rebellion among his supporters.</p>\n<p></p>\n<p>BUSINESS</p>\n<p><location value=\"LC/ir\" idsrc=\"xmltag.org\" >IRAN</location>-CRISIS/GLOBAL-MARKETS/</p>\n<p>How US-Iran tensions could shape world markets</p>\n<p><location value=\"LU/gb.eng.london\" idsrc=\"xmltag.org\" >LONDON</location>/<location value=\"LU/ae..abudha\" idsrc=\"xmltag.org\" >ABU DHABI</location>, <chron>Feb 28</chron> (Reuters) - <location value=\"LC/us\" idsrc=\"xmltag.org\" >The United States</location> and\n<location value=\"LC/il\" idsrc=\"xmltag.org\" >Israel</location> launched strikes on <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location> on Saturday, targeting its\nleadership and plunging the <location value=\"LR/mde\" idsrc=\"xmltag.org\" >Middle East</location> into a new conflict that\nPresident <person>Donald Trump</person> said would end a security threat and give\nIranians a chance to topple their rulers. The strikes put nearby\noil-producing Gulf Arab countries on edge as fears of escalation\ngrew, and <location value=\"LU/ir..tehran\" idsrc=\"xmltag.org\" >Tehran</location> responded by launching missiles towards <location value=\"LC/il\" idsrc=\"xmltag.org\" >Israel</location>.</p>\n<p></p>\n<p><location value=\"LU/gb.eng.brkshr\" idsrc=\"xmltag.org\" >BERKSHIRE</location>-ANNUAL REPORT/</p>\n<p>Berkshire CEO Abel seeks to reassure shareholders after\ntaking baton from Buffett</p>\n<p><chron>Feb 28</chron> (Reuters) - Berkshire Hathaway's BRKa.N new Chief\nExecutive <person>Greg Abel</person> moved to put his stamp on the conglomerate\nwith his first annual letter to shareholders on Saturday,\npledging to maintain its &quot;fortress-like&quot; balance sheet and\nuphold the values of his predecessor and mentor, <person>Warren Buffett</person>.</p>\n<p></p>\n<p>SPORTS</p>\n<p>SOCCER-<location value=\"LS/gb.eng\" idsrc=\"xmltag.org\" >ENGLAND</location>-LIV-WHU/</p>\n<p>Soccer-Man City move within two points of leaders Arsenal,\n<location value=\"LU/gb.eng.liverp\" idsrc=\"xmltag.org\" >Liverpool</location> thrash West Ham</p>\n<p><location value=\"LU/gb.eng.manchr\" idsrc=\"xmltag.org\" >MANCHESTER, England</location>, <chron>Feb 28</chron> (Reuters) - <location value=\"LU/gb.eng.manchr\" idsrc=\"xmltag.org\" >Manchester</location> City are\nbreathing down Arsenal's necks in a <org>Premier League</org> title race\nthat is heating up, pulling within two points of the leaders\nwith a 1-0 win at Leeds United on Saturday.</p>\n<p></p>\n<p>CRICKET-T20-WORLDCUP-LKA-PAK/</p>\n<p>Cricket-<location value=\"LC/nz\" idsrc=\"xmltag.org\" >New Zealand</location> reach semis after <location value=\"LC/pk\" idsrc=\"xmltag.org\" >Pakistan</location> eliminated\nfrom T20 World Cup</p>\n<p><chron>Feb 28</chron> (Reuters) - <location value=\"LC/nz\" idsrc=\"xmltag.org\" >New Zealand</location> reached the Twenty20 World\nCup semi-finals after <location value=\"LC/pk\" idsrc=\"xmltag.org\" >Pakistan</location> crashed out despite a five-run\nvictory against already-eliminated <location value=\"LC/lk\" idsrc=\"xmltag.org\" >Sri Lanka</location> in a Group Two\nSuper Eights match in Pallekele on Saturday.</p>\n<p></p>\n<p>UPCOMING</p>\n<p>BUSINESS / ECONOMICS</p>\n<p><location value=\"LC/kz\" idsrc=\"xmltag.org\" >KAZAKHSTAN</location>-INFLATION/</p>\n<p><location value=\"LC/kz\" idsrc=\"xmltag.org\" >Kazakhstan</location> monthly inflation</p>\n<p><location value=\"LC/kz\" idsrc=\"xmltag.org\" >Kazakhstan</location> to publish monthly inflation data</p>\n<p>1 Mar</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602281700RTRSNEWSCOMBINED_L4N3ZO0B5_1",
            "pub_date": "2026-03-01 06:00:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "California treasurer urges Trump to honor SCOTUS tariff ruling",
            "description": "\n<block>\n<p><location value=\"LS/us.ca\" idsrc=\"xmltag.org\" >California's</location> treasurer and state controller joined officials from nine other states in sending a letter to President <person>Donald Trump</person> Thursday urging him to adhere to the <org>U.S. Supreme Court's</org> ruling on tariffs.</p><p>The high court by a 6-3 vote on <chron>Feb. 20</chron> <u>struck down</u> the sweeping tariffs Trump had imposed in 2025 in a series of executive orders that caused massive swings in the stock market. The ruling conversely <u>should &quot;be accretive</u> to growth expectations and somewhat disinflationary,&quot; <person>Jeff Lipton</person>, The Bond Buyer's market intelligence analyst said in a column the day of the ruling.</p><p>California Treasurer <person>Fiona Ma</person> and State Controller <person>Malia Cohen</person> were signatories along with 13 other state financial officers on the letter that asked Trump to adhere to the ruling, ensure that any structural tariff action proceeds only with clear congressional authorization and remedy the economic damage resulting from tariffs inconsistent with the court's guidance.</p><p>The majority opinion found the tariffs exceed the powers given to the president by <org>Congress</org> under a 1977 law providing the chief of state with the authority to regulate commerce only during national emergencies created by foreign threats. The constitution vests the power to levy taxes and duties with <org>Congress</org>. </p><p>&quot;President Trump's trade policies have injected uncertainty into economies that undermine responsible state budgeting and long-term investment, and it raises real costs for manufacturers and consumers while disrupting supply chains,&quot; Ma said. &quot;That's why we must follow the court's decision and restore order — so states can plan responsibly, markets can function with predictability and businesses and families aren't forced to shoulder the cost of policy whiplash.&quot;</p><p>The 15% global tariff Trump threatened after the ruling was handed down would represent a structural change to the American tax base, the letter states, asserting such a decision belongs to <org>Congress</org>.</p><p>&quot;As the state's chief fiscal officer, I believe durable economic growth depends on stability, predictability and respect for constitutional boundaries,&quot; Cohen said. &quot;We must restore clarity to protect taxpayers, safeguard state revenues and ensure accountability so that those who have borne these costs will be made whole.&quot;</p><p>Officials from <location value=\"LS/us.wa\" idsrc=\"xmltag.org\" >Washington</location>, <location value=\"LS/us.or\" idsrc=\"xmltag.org\" >Oregon</location>, <location value=\"LS/us.mn\" idsrc=\"xmltag.org\" >Minnesota</location>, <location value=\"LS/us.co\" idsrc=\"xmltag.org\" >Colorado</location>, <location value=\"LS/us.nv\" idsrc=\"xmltag.org\" >Nevada</location>, <location value=\"LS/us.il\" idsrc=\"xmltag.org\" >Illinois</location>, <location value=\"LS/us.md\" idsrc=\"xmltag.org\" >Maryland</location>, <location value=\"LS/us.vt\" idsrc=\"xmltag.org\" >Vermont</location> and <location value=\"LS/us.ct\" idsrc=\"xmltag.org\" >Connecticut</location> also signed the letter. </p><p>&quot;As we have previously emphasized in public statements, durable economic growth depends on predictability,&quot; the letter says. &quot;Trade policy must be stable and clearly grounded in law if markets, employers and state governments are to plan effectively.&quot;</p><p><location value=\"LS/us.ca\" idsrc=\"xmltag.org\" >California</location> Attorney General <person>Rob Bonta</person> and officials from other states had argued in <u>lawsuits</u> that it was unlawful for Trump to impose tariffs without the consent of <org>Congress</org>.</p><p>&quot;While this is great news,&quot; Bonta said when the ruling was handed down, &quot;we must not forget the chaos that sent businesses, consumers and global economies reeling. At a time when more and more families are struggling with affordability and having trouble paying for the basics — their utilities, groceries, gas — the administration seems intent on making it more expensive for Californians and Americans to live.&quot;</p><p>The letter also asked Trump to establish a clear and timely mechanism to reimburse American taxpayers, businesses and affected industries for tariffs imposed without proper constitutional ground, including restitution for demonstrable financial losses borne by the states.</p><p>The minority opinion by Justice <person>Brett Kavanaugh</person> raised questions as to whether the federal government will have to provide refunds to importers, which he estimated could cost more than <money>$200 billion</money>. </p><p>More than 900 companies have <u>sued</u> the U.S. over Trump's tariffs in the <org>U.S. Court of International Trade</org>, seeking refunds for duties slapped on countries worldwide that they were forced to absorb, the Financial Times reported.</p>\n</block>\n",
            "link": "https://www.fidelity.com/news/article/us-economy/202602271410SM______BNDBUYER_0000019c-a063-d9fc-a39f-feeb7e0c0001_110.1",
            "pub_date": "2026-02-28 03:10:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "OpenAI: Pentagon deal has stronger guardrails than Anthropic's",
            "description": "\n<p><chron>Feb 28</chron> (Reuters) - OpenAI said on Saturday that its\nagreement with the Pentagon &quot;has more guardrails than any\nprevious agreement for classified AI deployments, including\nAnthropic's.&quot;</p>\n<p>Open AI firm said that the contract struck on Friday to\ndeploy technology in the <org>U.S. Defense Department's</org> classified\nnetwork enforces three red lines: no use of OpenAI technology on\nmass domestic surveillance, no directing autonomous weapons\nsystems and no high-stakes automated decisions.\n(Reporting by <person>Mrinmay Dey</person> and Ananya Palyekar; Editing by\n<person>Cynthia Osterman</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602281615RTRSNEWSCOMBINED_L4N3ZO0AZ_1",
            "pub_date": "2026-03-01 05:15:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "APEX Tech Acquisition Inc. Announces Closing of Initial Public Offering, Including Partial Exercise of Overallotment Option",
            "description": "\n<p align=\"justify\"><strong><location value=\"LU/us.ny.nyc\" idsrc=\"xmltag.org\" >New York, New York</location>, <chron>Feb.  28, 2026</chron>  (GLOBE NEWSWIRE) -- </strong> <org>APEX Tech Acquisition Inc.</org>, a blank check company incorporated in the <location value=\"LC/ky\" idsrc=\"xmltag.org\" >Cayman Islands</location> as an exempted company (the “Company”), today announced the closing of its initial public offering of 11,197,131 units, including partial exercise of an over-allotment option, at <money>$10.00</money> per unit for aggregate gross proceeds to the Company of <money>$111,971,310</money>. The units began trading on <org>The New York Stock Exchange</org> (“NYSE”) on <chron>February 26, 2026</chron> under the ticker symbol “TRADU.” Each unit consists of one ordinary share and one right to receive one-fourth (1/4) of one ordinary share upon the consummation of an initial business combination. Once the securities comprising the units begin separate trading, the ordinary shares and the rights are expected to be traded on <org>NYSE</org> under the symbols “TRAD” and “TRADR,” respectively.</p>  <p align=\"justify\">A.G.P./<org>Alliance Global Partners</org> acted as the sole book-running manager for the offering.</p>  <p align=\"justify\">Venture Bridge Legal served as the U.S. counsel to the Company and <org>Robinson &amp; Cole LLP</org> served as the U.S. counsel to the representative of the underwriters in this offering.</p>  <p align=\"justify\">A registration statement on Form S-1 relating to the securities, as amended was previously filed with the <org>Securities and Exchange Commission</org> (&quot;SEC&quot;) and declared effective on <chron>February 25, 2026</chron>. This offering was made only by means of a prospectus forming part of the effective registration statement. Copies of the final prospectus may be obtained on the SEC’s website at http://www.sec.gov. Electronic copies of the prospectus may be obtained from A.G.P./<org>Alliance Global Partners</org>, <location>590 Madison Avenue</location>, 28th Floor, <location value=\"LU/us.ny.nyc\" idsrc=\"xmltag.org\" >New York, NY</location> 10022, or by telephone at (212) 624-2060, or by email at prospectus@allianceg.com.</p>  <p align=\"justify\"><i>This press release shall not constitute an offer to sell or a solicitation of an offer to buy these securities, nor shall there be any sale of these securities in any state or other jurisdiction in which such offer, solicitation or sale would be unlawful prior to the registration or qualification under the securities laws of any such state or other jurisdiction. No securities regulatory authority has either approved or disapproved of the contents of this press release.</i></p>  <p align=\"justify\"><b>About <org>APEX Tech Acquisition Inc.</org></b></p>  <p align=\"justify\">The Company is a blank check company incorporated in the <location value=\"LC/ky\" idsrc=\"xmltag.org\" >Cayman Islands</location> as an exempted company with limited liability for the purpose of effecting a merger, share exchange, asset acquisition, share purchase, reorganization or similar business combination with one or more businesses or entities. The Company intends to conduct a search for target businesses without being limited to a particular industry.</p>  <p align=\"justify\"><b>Forward-Looking Statements</b></p>  <p align=\"justify\">This press release contains statements that constitute “forward-looking statements,” including with respect to the initial public offering, the underwriters’ exercise of over-allotment option, the anticipated use of the net proceeds thereof and the Company’s search for an initial business combination. No assurance can be given that the offering discussed above will be completed on the terms described, or at all, or that the net proceeds of the offering will be used as indicated. Forward-looking statements are subject to numerous conditions, many of which are beyond the control of the Company, including those set forth in the Risk Factors section of the Company’s registration statement and preliminary prospectus for the IPO filed with the <org>SEC</org>. Copies are available on the SEC’s website, www.sec.gov.The Company undertakes no obligation to update these statements for revisions or changes after the date of this release, except as required by law.</p>  <p align=\"justify\"><b>Contact: </b><br/><org>APEX Tech Acquisition Inc.</org><br/>Attn: <person>Shaoren Liu</person><br/>E-mail: shaoren@apextech-inc.com</p>  Image: https://www.globenewswire.com/newsroom/ti?nf=OTY2MzQxMSM3NDYwODYzIzUwMDE1OTA0NA==  <br/> Image: https://ml.globenewswire.com/media/Nzg4MjBhYjQtY2E0Yi00NjY1LWFlYWUtYTdmNjUzZDVkZmViLTUwMDE1OTA0NC0yMDI2LTAyLTI4LWVu/tiny/APEX-Tech-Acquisition-Inc-.png\nSource: <org>APEX Tech Acquisition, Inc.</org>\n",
            "link": "https://www.fidelity.com/news/article/default/202602281623PRIMZONEFULLFEED9663411",
            "pub_date": "2026-03-01 05:23:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Here's how bitcoin's price rise could be fueled by job-stealing AI software",
            "description": "\n<p>Bitcoin’s future in an artificial intelligence-driven world may depend less on code and more on central banks.</p><p>In a new note, <person>Greg Cipolaro</person>, global head of research at financial services and infrastructure firm NYDIG, argued that artificial intelligence will affect bitcoin mainly through macroeconomic channels and its impact on the labor market.</p><p>The key variables are growth, employment, real interest rates and liquidity. Bitcoin, he writes, sits downstream of those forces.</p><p>If automation cuts jobs and wages, consumer demand could weaken and, in a severe case, falling incomes would strain debt payments and pressure asset prices.</p><p>Those fears appear to be well-grounded. Just this week, Jack Dorsey’s fintech firm Block unveiled its shrinking back toward its pre-pandemic size, cutting staff by about 40%. Dorsey cited AI-enabled efficiency for the job cuts, something that was theorized in Citrini's research on the AI-doom that spooked the market this week. </p><p>In such a scenario, policymakers might respond with lower rates or fiscal spending to stabilize the economy. That wave of liquidity could support bitcoin, which has often tracked shifts in global money supply.</p><p>A different outcome would look less friendly for the cryptocurrency. If AI boosts productivity and economic growth without major job losses, real yields could rise, and central banks might keep policy tight.</p><p>Higher real rates have historically weighed on bitcoin by raising the opportunity cost of holding it and making risk assets less attractive.</p><h2><strong>Shift in demand</strong></h2><p>Anxiety around AI echoes past moments of upheaval in Human society.</p><p>The steam engine displaced manual labor in factories and on farms. Electrification then rewired entire industries. Later, computers and the internet automated clerical work and reshaped retail, media and finance.</p><p>Each wave triggered fears of permanent job loss. In the early 1900s, factory mechanization sparked labor unrest as machines replaced skilled craftsmen. In the 1980s and 1990s, personal computers cut typist pools and back-office staff. More recently, e-commerce helped hollow out brick-and-mortar retail roles.</p><p>Yet aggregate demand did not collapse. Productivity rose. New industries absorbed displaced workers, even if the transition proved uneven and painful. Nowadays, we have industries that were unthinkable before the dawn of the internet. Think cloud computing.</p><p>Cipolaro argued AI may follow a similar pattern. As a general-purpose technology, it requires firms to redesign workflows and invest in complementary tools. Over time, that process tends to expand productive capacity rather than shrink it.</p><p>“The implication is not that disruption will be painless, but that the equilibrium response to new technology has historically been integration, not obsolescence,” Cipolaro wrote. “Society's response to AI will likely follow the same pattern.”</p><p>For bitcoin, that distinction matters. If AI ultimately lifts long-term growth, the structural backdrop could differ from the short-term shocks that often drive liquidity injections.</p><p>Meanwhile, adoption may also rise thanks to agentic payments, which would essentially see software pay other pieces of software without human involvement. One of Bitcoin’s earliest visions centered on machine-to-machine payments, and AI may be the necessary tool to make them a reality.</p><p>Still, incentives aren’t currently there for a widespread rollout. Credit cards bundle rewards and short-term credit, features that stablecoins do not yet match, Cipolaro noted.</p><p>Ultimately, while the rise of AI brings new challenges, what matters is the human response to the disruption it brings. If AI triggers a deflationary shock and forces the money printer to turn back on, or if it fuels a productivity boom that raises real yields, bitcoin will reflect that.</p>\n",
            "link": "https://www.fidelity.com/news/article/technology/202602281600COINDESKCRYPTONW_25daf57f-4b04-4623-bdad-b333dc188224",
            "pub_date": "2026-03-01 05:00:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "QUOTES-Market analysts react to US-Israel strikes on Iran",
            "description": "\n<p>(Adds Barclays comments)</p>\n<p><chron>Feb 28</chron> (Reuters) - <location value=\"LC/us\" idsrc=\"xmltag.org\" >The United States</location> and <location value=\"LC/il\" idsrc=\"xmltag.org\" >Israel</location> launched\nstrikes on <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location> on Saturday, targeting its leadership\nand plunging the <location value=\"LR/mde\" idsrc=\"xmltag.org\" >Middle East</location> into a new conflict that President\n<person>Donald Trump</person> said would end a security threat and give Iranians\na chance to topple their rulers.\nThe strikes put nearby oil-producing Gulf Arab countries on edge\nas fears of escalation grew, and <location value=\"LU/ir..tehran\" idsrc=\"xmltag.org\" >Tehran</location> responded by launching\nmissiles towards <location value=\"LC/il\" idsrc=\"xmltag.org\" >Israel</location>.\nSome oil majors and top trading houses suspended crude oil and\nfuel shipments via the <location>Strait of Hormuz</location> because of the attacks,\nfour trading sources said on Saturday.</p>\n<p></p>\n<p>QUOTES:</p>\n<p>ENERGY ANALYSTS AT <org value=\"BCS.NaE\" idsrc=\"xmltag.org\" >BARCLAYS</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='BCS' fmr-param-security-type='Equity'>( BCS )</span>:</p>\n<p>&quot;Oil markets might have to face their worst fears on Monday.\nAs things stand right now, we think Brent could hit <money>$100</money> (per\nbarrel), as the market grapples with the threat of a potential\nsupply disruption amid a spiralling security situation in the\n<location value=\"LR/mde\" idsrc=\"xmltag.org\" >Middle East</location>.&quot;</p>\n<p></p>\n<p>VISHNU VARATHAN, HEAD OF MACRO RESEARCH, <person>ASIA EX-JAPAN</person>,\nMIZUHO, <location value=\"LC/sg\" idsrc=\"xmltag.org\" >SINGAPORE</location>:</p>\n<p>&quot;A broader state of spots of regional attacks/instability\nmay be par for the course - in line with <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran's</location> warning. Oil\nprices are likely to remain elevated as production and passage\nremain prone to attacks and disruptions. <org>OPEC</org> may be under\npressure to raise production to try and offset. But a 10-25%\npremium on oil is not outlandish - even without a blockade of\nthe <location>Strait of Hormuz</location>, which is easily a 50% premium risk event.&quot;</p>\n<p></p>\n<p><person>CHRISTOPHER WONG</person>, STRATEGIST, OCBC, <location value=\"LC/sg\" idsrc=\"xmltag.org\" >SINGAPORE</location>:</p>\n<p>&quot;The strike raises geopolitical risk premia as markets head\ninto Monday's open. The immediate reaction function is fairly\npredictable: safe-haven assets such as gold are likely to see an\nupside gap, while oil prices may also firm on supply-disruption\nconcerns. Risk assets and high-beta currencies ... could face an\ninitial bout of volatility, particularly if headlines suggest\npotential retaliation or regional spillovers.&quot;</p>\n<p></p>\n<p><person>NICK FERRES</person>, CIO, VANTAGE POINT ASSET MANAGEMENT, <location value=\"LC/sg\" idsrc=\"xmltag.org\" >SINGAPORE</location>:</p>\n<p>&quot;Energy is still inexpensive. That's the obvious sector that\nrallies on Monday. And gold.&quot;</p>\n<p>(Reporting by <person>Scott Murdoch</person>, <person>Tom Westbrook</person>, <person>Rae Wee</person>; Additional\nReporting by <person>Scott DiSavino</person>;\nCompiled by Vidya Ranganathan\nEditing by <person>Rod Nickel</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602281416RTRSNEWSCOMBINED_L6N3ZO0FN_1",
            "pub_date": "2026-03-01 03:16:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Berkshire CEO Abel seeks to reassure shareholders after taking baton from Buffett",
            "description": "\n<p>*    Abel emphasizes trust, Berkshire values</p>\n<p>*    Analysts say Abel struck the right tone</p>\n<p>*    Berkshire reports declining profit for Q4, 2025\n(Adds analyst comments, financial details, Abel comments\nthroughout)</p>\n<p>By <person>Jonathan Stempel</person></p>\n<p><chron>Feb 28</chron> (Reuters) - <org value=\"BRK/A.NaE\" idsrc=\"xmltag.org\" >Berkshire Hathaway's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='BRK/A' fmr-param-security-type='Equity'>( BRK/A )</span> new\nChief Executive <person>Greg Abel</person> moved to put his stamp on the\nconglomerate with his first annual letter to shareholders on\nSaturday, pledging to maintain its &quot;fortress-like&quot; balance sheet\nand uphold the values of his predecessor and mentor, <person>Warren\nBuffett</person>.</p>\n<p>Abel, 63, said he wouldn't rush to deploy Berkshire's\nnear-record <money>$373.3 billion</money> cash stake, though he said it gave\nthe company plenty of &quot;dry powder&quot; and that he had no plans to\nbegin paying dividends, which Buffett also opposed. Berkshire\nhas not repurchased its own stock since the spring of 2024.\n&quot;I recognize how you want us to succeed together, and to do so\nin the right way,&quot; Abel wrote in an 18-page, single-spaced\nletter. &quot;My role is to ensure our liquidity levels and capital\ndeployment remain intentional and deliberate.&quot;</p>\n<p>Abel also paid homage to Buffett, 95, who remains chairman\nand goes to Berkshire's offices five days a week, calling him a\n&quot;remarkable&quot; CEO.</p>\n<p>&quot;<person>Warren Buffett</person> is arguably the greatest investor of all\ntime, with generations benefiting from his investment acumen,&quot;\nAbel wrote. &quot;To invest in Berkshire has long been a vote of\ntrust in our founder - a trust that now rests with Berkshire.&quot;\nBerkshire shares have significantly underperformed the Standard\n&amp; Poor's 500 index since Buffett announced unexpectedly\nin May he was stepping aside as CEO.\nThough Abel's letter lacked Buffett's writing flair, <org>CFRA\nResearch</org> analyst <person>Cathy Seifert</person> said it might prove reassuring to\ninvestors.</p>\n<p>&quot;He needed to show a degree of continuity, that the\nBerkshire franchise would continue despite the change in\nleadership, and it would be business as usual,&quot; she said. &quot;In my\nopinion, he hit the mark.&quot;\nThe letter also signaled that Abel wouldn't upend Buffett's 60\nyears of work transforming Berkshire from a failing textile\ncompany into a more than <money>$1 trillion</money> conglomerate that owns car\ninsurer Geico, BNSF railroad and dozens of other insurance,\nmanufacturing, energy and retail businesses.\n&quot;If there were any doubts about whether Greg was the right\nindividual to take the reins, the letter should dispel them,&quot;\nsaid <person>Dan Hanson</person>, who oversees more than <money>$6 billion</money> as head of\nthe quality equity team at Neuberger Berman.</p>\n<p></p>\n<p>PROFIT DECLINES\nBerkshire also reported declining profit, after taking\nwritedowns for its approximately 27% stakes in both <org value=\"KHC.NaE\" idsrc=\"xmltag.org\" >Kraft Heinz</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='KHC' fmr-param-security-type='Equity'>( KHC )</span>\nand oil company <org value=\"OXY.NaE\" idsrc=\"xmltag.org\" >Occidental Petroleum</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='OXY' fmr-param-security-type='Equity'>( OXY )</span>.\nFourth-quarter operating profit fell 30% to <money>$10.2 billion</money> as\nincome from insurance operations such as Geico declined.\nNet income fell 3% to <money>$19.2 billion</money>, reflecting a <money>$4.5 billion</money>\nwritedown for Occidental, despite gains from equity holdings led\nby <org value=\"AAPL.NaE\" idsrc=\"xmltag.org\" >Apple</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AAPL' fmr-param-security-type='Equity'>( AAPL )</span> and <org value=\"AXP.NaE\" idsrc=\"xmltag.org\" >American Express</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AXP' fmr-param-security-type='Equity'>( AXP )</span>.\nFor all of 2025, operating profit fell 6% to <money>$44.49 billion</money>,\nwhile net income fell 25% to <money>$66.97 billion</money>. Buffett had long\nurged investors to ignore fluctuations in Berkshire's net\nincome, which reflect accounting rules for equity investments.\nFull-year revenue was essentially unchanged at <money>$371.44 billion</money>,\nand Seifert said Abel &quot;teed up an expectation that reinsurance\nand commercial insurance growth may be nonexistent&quot; in 2026.&quot;</p>\n<p>One of Berkshire's best-known businesses, Fruit of the Loom,\nshed 6,000 jobs last year as revenue fell, Berkshire said.</p>\n<p>WILDFIRE-BATTERED PACIFICORP UTILITY 'NOT A DEEP POCKET'</p>\n<p>Abel said Berkshire's culture and values will continue &quot;in\nperpetuity,&quot; and signaled no changes in its decentralized\nstructure in which its dozens of businesses operate largely\nwithout interference from the top.\nHe also signaled a willingness to stick around, suggesting that\nin 20 years he will have had &quot;just a fraction of the tenure that\nWarren had.&quot;\nAbel pledged to invest in durable, well-managed businesses that\nBerkshire understands and &quot;avoid businesses that undermine the\nfabric of society or could jeopardize Berkshire's reputation.&quot;\nHe didn't elaborate, but Seifert said he could have been\nreferring to artificial intelligence.\nAbel acknowledged pressures on its PacifiCorp utility from\nlitigation over <location value=\"LS/us.or\" idsrc=\"xmltag.org\" >Oregon</location> and <location value=\"LS/us.ca\" idsrc=\"xmltag.org\" >California</location> wildfires that burned more\nthan 500,000 acres in 2020.\nMany victims blame PacifiCorp, saying it failed to shut off\npower lines. The utility has reached more than <money>$2.2 billion</money> of\nsettlements, but faces <money>$50 billion</money> of additional wildfire\nclaims. Abel said Berkshire accepts responsibility when it\ncauses wildfires, but will fight unjustified claims in court.\n&quot;PacifiCorp is not an insurer of last resort and should not be\ntreated as a deep pocket,&quot; Abel said. &quot;Accountability, paired\nwith principled opposition to unwarranted liability, is\nessential to preserving the regulatory compact that governs\nutilities.&quot;</p>\n<p>TED WESCHLER STAYS ON\nAbel was more critical than Buffett of Berkshire businesses that\ncould perform better.\nHe said the performance gap between BNSF and industry-leading\nrivals is &quot;too wide,&quot; while &quot;self-inflicted&quot; difficulties at the\nShaw flooring company hurt quality and service.\n&quot;Each business is accountable to its CEO, who is expected to\npursue operational excellence relentlessly and close performance\ngaps,&quot; Abel said, referring to Berkshire's non-insurance\nbusinesses.\nHanson, the Neuberger Berman investment manager, said: &quot;Those\nare fighting words.&quot;\nBerkshire has not named a chief investment officer to replace\nBuffett, though Abel said responsibility for equity investments\n&quot;ultimately resides with me as CEO.&quot;\nAbel signaled that longtime portfolio manager <person>Ted Weschler</person>, who\nmanages about 6% of Berkshire's equity investments, will\ncontinue playing a &quot;broader role&quot; assessing significant\ninvestment opportunities and supporting Berkshire in other ways.</p>\n<p>(Reporting by <person>Jonathan Stempel</person> in <location value=\"LU/us.ny.nyc\" idsrc=\"xmltag.org\" >New York</location>, Editing by <person>Megan\nDavies</person>, <person>Louise Heavens</person> and <person>Cynthia Osterman</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602281346RTRSNEWSCOMBINED_L6N3ZO0BY_1",
            "pub_date": "2026-03-01 02:46:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Berkshire CEO Abel seeks to reassure shareholders after taking baton from Buffett",
            "description": "<p><chron>Feb 28</chron> (Reuters) - <org value=\"BRK/A.NaE\" idsrc=\"xmltag.org\" >Berkshire Hathaway's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='BRK/A' fmr-param-security-type='Equity'>( BRK/A )</span> new Chief Executive <person>Greg Abel</person> moved to put his stamp on the conglomerate with his first annual letter to shareholders on Saturday, pledging to maintain its &quot;fortress-like&quot; balance sheet and uphold the values of his predecessor and mentor, <person>Warren Buffett</person>.</p>\n<p>Abel, 63, said he wouldn't rush to deploy Berkshire's near-record <money>$373.3 billion</money> cash stake, though he said it gave the company plenty of &quot;dry powder&quot; and that he had no plans to begin paying dividends, which Buffett also opposed. Berkshire has not repurchased its own stock since the spring of 2024.</p>\n<p>&quot;I recognize how you want us to succeed together, and to do so in the right way,&quot; Abel wrote in an 18-page, single-spaced letter. &quot;My role is to ensure our liquidity levels and capital deployment remain intentional and deliberate.&quot;</p>\n<p>Abel also paid homage to Buffett, 95, who remains chairman and goes to Berkshire's offices five days a week, calling him a &quot;remarkable&quot; CEO.</p>\n<p>&quot;<person>Warren Buffett</person> is arguably the greatest investor of all time, with generations benefiting from his investment acumen,&quot; Abel wrote. &quot;To invest in Berkshire has long been a vote of trust in our founder - a trust that now rests with Berkshire.&quot;</p>\n<p>Berkshire shares have significantly underperformed the Standard &amp; Poor's 500 index since Buffett announced unexpectedly in May he was stepping aside as CEO.</p>\n<p>Though Abel's letter lacked Buffett's writing flair, <org>CFRA Research</org> analyst <person>Cathy Seifert</person> said it might prove reassuring to investors.</p>\n<p>&quot;He needed to show a degree of continuity, that the Berkshire franchise would continue despite the change in leadership, and it would be business as usual,&quot; she said. &quot;In my opinion, he hit the mark.&quot;</p>\n<p>The letter also signaled that Abel wouldn't upend Buffett's 60 years of work transforming Berkshire from a failing textile company into a more than <money>$1 trillion</money> conglomerate that owns car insurer Geico, BNSF railroad and dozens of other insurance, manufacturing, energy and retail businesses.</p>\n<p>&quot;If there were any doubts about whether Greg was the right individual to take the reins, the letter should dispel them,&quot; said <person>Dan Hanson</person>, who oversees more than <money>$6 billion</money> as head of the quality equity team at Neuberger Berman. </p>\n<p>PROFIT DECLINES</p>\n<p>Berkshire also reported declining profit, after taking writedowns for its approximately 27% stakes in both Kraft Heinz and oil company Occidental Petroleum.</p>\n<p>Fourth-quarter operating profit fell 30% to <money>$10.2 billion</money> as income from insurance operations such as Geico declined.</p>\n<p>Net income fell 3% to <money>$19.2 billion</money>, reflecting a <money>$4.5 billion</money> writedown for Occidental, despite gains from equity holdings led by <org value=\"AAPL.NaE\" idsrc=\"xmltag.org\" >Apple</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AAPL' fmr-param-security-type='Equity'>( AAPL )</span> and <org value=\"AXP.NaE\" idsrc=\"xmltag.org\" >American Express</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AXP' fmr-param-security-type='Equity'>( AXP )</span>.</p>\n<p>For all of 2025, operating profit fell 6% to <money>$44.49 billion</money>, while net income fell 25% to <money>$66.97 billion</money>. Buffett had long urged investors to ignore fluctuations in Berkshire's net income, which reflect accounting rules for equity investments.</p>\n<p>Full-year revenue was essentially unchanged at <money>$371.44 billion</money>, and Seifert said Abel &quot;teed up an expectation that reinsurance and commercial insurance growth may be nonexistent&quot; in 2026.&quot;</p>\n<p>One of Berkshire's best-known businesses, Fruit of the Loom, shed 6,000 jobs last year as revenue fell, Berkshire said.</p>\n<p>WILDFIRE-BATTERED PACIFICORP UTILITY 'NOT A DEEP POCKET'</p>\n<p>Abel said Berkshire's culture and values will continue &quot;in perpetuity,&quot; and signaled no changes in its decentralized structure in which its dozens of businesses operate largely without interference from the top.</p>\n<p>He also signaled a willingness to stick around, suggesting that in 20 years he will have had &quot;just a fraction of the tenure that Warren had.&quot;</p>\n<p>Abel pledged to invest in durable, well-managed businesses that Berkshire understands and &quot;avoid businesses that undermine the fabric of society or could jeopardize Berkshire's reputation.&quot;</p>\n<p>He didn't elaborate, but Seifert said he could have been referring to artificial intelligence. </p>\n<p>Abel acknowledged pressures on its PacifiCorp utility from litigation over <location value=\"LS/us.or\" idsrc=\"xmltag.org\" >Oregon</location> and <location value=\"LS/us.ca\" idsrc=\"xmltag.org\" >California</location> wildfires that burned more than 500,000 acres in 2020.</p>\n<p>Many victims blame PacifiCorp, saying it failed to shut off power lines. The utility has reached more than <money>$2.2 billion</money> of settlements, but faces <money>$50 billion</money> of additional wildfire claims. Abel said Berkshire accepts responsibility when it causes wildfires, but will fight unjustified claims in court.</p>\n<p>&quot;PacifiCorp is not an insurer of last resort and should not be treated as a deep pocket,&quot; Abel said. &quot;Accountability, paired with principled opposition to unwarranted liability, is essential to preserving the regulatory compact that governs utilities.&quot; </p>\n<p>TED WESCHLER STAYS ON</p>\n<p>Abel was more critical than Buffett of Berkshire businesses that could perform better.</p>\n<p>He said the performance gap between BNSF and industry-leading rivals is &quot;too wide,&quot; while &quot;self-inflicted&quot; difficulties at the Shaw flooring company hurt quality and service.</p>\n<p>&quot;Each business is accountable to its CEO, who is expected to pursue operational excellence relentlessly and close performance gaps,&quot; Abel said, referring to Berkshire's non-insurance businesses.</p>\n<p>Hanson, the Neuberger Berman investment manager, said: &quot;Those are fighting words.&quot;</p>\n<p>Berkshire has not named a chief investment officer to replace Buffett, though Abel said responsibility for equity investments &quot;ultimately resides with me as CEO.&quot;</p>\n<p>Abel signaled that longtime portfolio manager <person>Ted Weschler</person>, who manages about 6% of Berkshire's equity investments, will continue playing a &quot;broader role&quot; assessing significant investment opportunities and supporting Berkshire in other ways.</p>\n<p></p>\n<p> (Reporting by <person>Jonathan Stempel</person> in <location value=\"LU/us.ny.nyc\" idsrc=\"xmltag.org\" >New York</location>, Editing by <person>Megan Davies</person>, <person>Louise Heavens</person> and <person>Cynthia Osterman</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602281358RTRSNEWSCOMBINED_KBN3PI13J-OUSBS_1",
            "pub_date": "2026-03-01 02:58:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Oil and gas majors and traders suspend shipments via Hormuz as US attacks Iran, sources say",
            "description": "\n<p><location value=\"LU/gb.eng.london\" idsrc=\"xmltag.org\" >LONDON</location>, <chron>Feb 28</chron> (Reuters) - Several tanker owners, oil majors and trading houses have suspended crude oil, fuel and liquefied natural gas shipments via the <location>Strait of Hormuz</location> after the U.S. and <location value=\"LC/il\" idsrc=\"xmltag.org\" >Israel</location> attacked <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location> and <location value=\"LU/ir..tehran\" idsrc=\"xmltag.org\" >Tehran</location> said it had closed navigation, trading sources said on Saturday.</p>\n<p>&quot;Our ships will stay put for several days,&quot; one top executive at a major trading desk said. Satellite images from tanker trackers showed vessels piling up next to big ports, such as <location value=\"LU/ae..fujrah\" idsrc=\"xmltag.org\" >Fujairah</location> in the <location value=\"LC/ae\" idsrc=\"xmltag.org\" >United Arab Emirates</location>, and not moving through Hormuz.</p>\n<p>Multiple vessels in the area have received VHF transmission from <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran's</location> Revolutionary Guards that &quot;no ship is allowed to pass the <location>Strait of Hormuz</location>&quot;, an official with the EU naval mission Aspides told Reuters.</p>\n<p><org>The UK Navy</org> said <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran's</location> orders were not legally binding and advised vessels to transit with caution.</p>\n<p>The tanker association INTERTANKO said the <org>U.S. Navy</org> had warned against navigation in the area - the whole of the Gulf, Gulf of <location value=\"LC/om\" idsrc=\"xmltag.org\" >Oman</location>, <location>North Arabian Sea</location>, and the <location>Strait of Hormuz</location> - saying it could not guarantee the safety of shipping.</p>\n<p><location value=\"LC/gr\" idsrc=\"xmltag.org\" >Greece's</location> shipping ministry advised vessels on Saturday to avoid the Persian Gulf, the Gulf of <location value=\"LC/om\" idsrc=\"xmltag.org\" >Oman</location> and the <location>Strait of Hormuz</location>, according to an advisory seen by Reuters.</p>\n<p>Some 20% of global oil from producers such as <location value=\"LC/sa\" idsrc=\"xmltag.org\" >Saudi Arabia</location>, the UAE, <location value=\"LC/iq\" idsrc=\"xmltag.org\" >Iraq</location>, <location value=\"LC/kw\" idsrc=\"xmltag.org\" >Kuwait</location> and <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location> pass through Hormuz as well as large volumes of LNG from <location value=\"LC/qa\" idsrc=\"xmltag.org\" >Qatar</location>.</p>\n<p>Fourteen LNG tankers have shown signs of slowing down, U-turning or stopping in or around the Strait, said <person>Laura Page</person> from consultancy Kpler, who added the number will likely rise, posing risks to Qatari LNG exports.</p>\n<p> (Reporting by Dmitri Zhdannikov, <person>Marwa Rashad</person>, <person>Shariq Khan</person> and <person>Enes Tunagur</person>, Renee Maltezou and <person>Yannis Souliotis</person>; Editing by <person>Aidan Lewis</person>, <person>Kevin Liffey</person> and <person>Louise Heavens</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602281155RTRSNEWSCOMBINED_KBN3PI0KY-OUSBS_1",
            "pub_date": "2026-03-01 00:55:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "ADNOC says operations continuing without interruption",
            "description": "\n<p><chron>Feb 28</chron> (Reuters) - <org>Abu Dhabi National Oil Company</org>\n(ADNOC) said on Saturday that its operations were continuing\nwithout interruption.</p>\n<p>In response to questions after the U.S. and Israeli strikes\non <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location>, a spokesperson for ADNOC said the company was closely\nmonitoring the situation and coordinating with relevant\nauthorities.\n(Reporting by <person>Yousef Saba</person>, Editing by <person>Timothy Heritage</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602281113RTRSNEWSCOMBINED_S8N3SG039_1",
            "pub_date": "2026-03-01 00:13:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "TSX Closer: Index Slumps Off a Record High, But Losses Capped On Commodity Prices and Investment In Canada",
            "description": "\n<p><chron>04:15 PM EST</chron>, <chron>02/27/2026</chron> (MT Newswires) -- <org>The Toronto Stock Exchange</org> slumped Friday, mostly on some profit taking after it set six record closes over the prior seven sessions, but losses on the resources-heavy index were capped by higher commodity prices, while investors continue to welcome news of a swing in foreign direct investment into a rare surplus.</p><p>The S&amp;P/TSX Composite Index closed down 161.97 points, or 0.5%, to 34,339.99,  falling off the 17th record close of 2026 set Thursday, with sectors mixed over Friday's session. For a second successive day, Info Tech led decliners , down 2.5%, while Financials was down near 2%. Telecom led gainers, up 1.65%, with Energy, up 1.15% and the Battery Metals Index, up 1.1%, next.</p><p><org>BMO Capital Markets</org> Chief Economist <person>Douglas Porter</person> in his regular Friday 'Talking Points' note noted even as the Canadian economy remains &quot;challenged by relentless trade uncertainty&quot;, the TSX continues to &quot;find its own path&quot;. Prior to Friday's stumble, the index managed to rise more than 1% this week to hit an record high above 34,500 and was up 8% in the first two months of the year. Porter noted a rebound in gold and firmer oil prices assisted, but Q1 bank earnings were also &quot;greeted favourably&quot;. He also noted economy-wide profits rose more than 6% in 2025, topping nominal GDP growth of 4.3% on the year. More broadly, <location value=\"LC/ca\" idsrc=\"xmltag.org\" >Canada</location> may be benefitting from a diversification push away from U.S. markets, where valuations are rich, Porter said.</p><p>Porter cited as just as one small sample of the shift into <location value=\"LC/ca\" idsrc=\"xmltag.org\" >Canada</location> in the past year a &quot;welcome&quot; swing in foreign direct investment into a rare surplus. For Q4 alone, quarterly net FDI inflows were <money>$11.6 billion</money>, driven by M&amp;A activity. Looking at the four-quarter trend reveals that for the first time in more than a decade, and only the second time in the past 18 years, <location value=\"LC/ca\" idsrc=\"xmltag.org\" >Canada</location> had a net inflow in FDI in 2025 of <money>$17.3 billion</money>, Porter noted. For perspective, Porter said that alone would have funded more than half of the current account deficit of <money>$30.4 billion</money> last year. He noted there are three major types of FDI: M&amp;A, greenfield investments, and reinvested earnings. In 2025, the latter remained in a large outflow position of <money>$47 billion</money> &quot;and is normally in a deficit because of <location value=\"LC/ca\" idsrc=\"xmltag.org\" >Canada's</location> large stock of outstanding investments abroad&quot; while M&amp;A was in a large offsetting surplus. Net new FDI investments were, thus,  in a surplus of <money>$17.6 billion</money> for the year, &quot;which is encouraging news for an economy looking for new growth avenues&quot;, Porter added.</p><p>Of commodities, gold rose to the highest in a month Friday following a report U.S. wholesale inflation rose above expectations in January. Gold for April delivery was last seen up <money>US$86.50</money> to to <money>US$5,280.70</money> per ounce, the highest since the record close of <money>US$5,354.80</money> on <chron>Jan. 29</chron>.</p><p>Also, West Texas Intermediate crude oil rose to a six-month high as a third round of talks between the U.S. and <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location> ended with an agreement to meet again next week amid reports <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location> is balking at U.S. demands it abandon its uranium enrichment program, raising worries President Trump will decide to strike at the OPEC+ member. WTI crude oil for April delivery closed up <money>US$1.81</money> to settle at <money>US$67.02</money> per barrel, the highest since <chron>Aug. 1</chron>, while <person>April Brent</person> crude was up <money>US$1.81</money> to <money>US$72.56</money>.</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/international/202602271615MIDNIGHTUSEQUITY_A3575347",
            "pub_date": "2026-02-28 05:15:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "DNO and Dana Gas halt Kurdistan output after U.S.-Israel strikes on Iran",
            "description": "<p><location value=\"LU/no..oslo\" idsrc=\"xmltag.org\" >OSLO</location>/<location value=\"LU/ae..dubai\" idsrc=\"xmltag.org\" >DUBAI</location>, <chron>Feb 28</chron> (Reuters) - <location value=\"LU/no..oslo\" idsrc=\"xmltag.org\" >Oslo</location>-listed DNO\nand <location value=\"LU/ae..dubai\" idsrc=\"xmltag.org\" >Dubai</location>-listed <org>Dana Gas</org> shut oil and gas production\nat their respective fields in the <location value=\"LU/iq..kurstn\" idsrc=\"xmltag.org\" >Kurdistan</location> region of <location value=\"LC/iq\" idsrc=\"xmltag.org\" >Iraq</location>, as a\nprecaution, after <location value=\"LC/us\" idsrc=\"xmltag.org\" >the United States</location> and <location value=\"LC/il\" idsrc=\"xmltag.org\" >Israel</location> launched strikes\non neighbouring <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location>.</p>\n<p>Last year, production facilities at both the Tawke oilfield\nand Khorm Mor gas field were attacked.</p>\n<p>No group claimed responsibility, but an Iraqi government\nsource told Reuters at the time that pro-Iranian militia were\nsuspected.</p>\n<p>&quot;Today, as a precautionary measure, we temporarily stopped\noperations and moved our people to safe locations,&quot; DNO\nExecutive Chairman <person>Bijan Mossavar-Rahmani</person> told Reuters.</p>\n<p>He added that the company had been preparing for &quot;a\npossibility of overhead military operations in the region for\nthe last couple of weeks&quot;.</p>\n<p>DNO and its partner <org value=\"GEGYF.NaE\" idsrc=\"xmltag.org\" >Genel Energy</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='GEGYF' fmr-param-security-type='Equity'>( GEGYF )</span> produced over\n77,000 barrels of oil per day (bpd) in the fourth quarter of\n2025 at their Tawke and Peshkabir fields, situated close to the\nborder with <location value=\"LC/tr\" idsrc=\"xmltag.org\" >Turkey</location>.</p>\n<p>Similarly, production at the <org>Dana Gas</org>-operated\nKhorm Mor gas field was shut on Saturday as a precautionary\nmeasure, a company source told Reuters.</p>\n<p><location value=\"LC/iq\" idsrc=\"xmltag.org\" >Iraq's</location> oil exports from the <location value=\"LU/iq..kurstn\" idsrc=\"xmltag.org\" >Kurdistan</location> region totalled\n200,000 bpd in February.</p>\n<p>Iraqi <location value=\"LU/iq..kurstn\" idsrc=\"xmltag.org\" >Kurdistan's</location> counter-terrorism service said U.S.-led\ncoalition forces intercepted several rockets and drones over the\nregional capital of Erbil on Saturday, the Iraqi news agency\nreported.</p>\n<p>Security officials told Reuters the attacks targeted U.S.\nforces stationed near <location>Erbil airport</location>.\n(Reporting by <person>Nerijus Adomaitis</person> in <location value=\"LU/no..oslo\" idsrc=\"xmltag.org\" >Oslo</location> and Maha El Dahan in\n<location value=\"LU/ae..dubai\" idsrc=\"xmltag.org\" >Dubai</location>, editing by <person>Gwladys Fouche</person> and <person>Louise Heavens</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602281034RTRSNEWSCOMBINED_L8N3ZO0KT_1",
            "pub_date": "2026-02-28 23:34:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Berkshire Hathaway profit falls on lower insurance income, writedown",
            "description": "\n<p> (Corrects full-year net income in paragraph 7 to <money>$66.97 billion</money> from <money>$89 billion</money>)</p>\n<p>By <person>Jonathan Stempel</person></p>\n<p><chron>Feb 28</chron> (Reuters) - <org value=\"BRK/A.NaE\" idsrc=\"xmltag.org\" >Berkshire Hathaway</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='BRK/A' fmr-param-security-type='Equity'>( BRK/A )</span> on Saturday said operating profit fell in the fourth quarter, reflecting lower income from its insurance operations, and wrote down a longstanding investment in <org value=\"OXY.NaE\" idsrc=\"xmltag.org\" >Occidental Petroleum</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='OXY' fmr-param-security-type='Equity'>( OXY )</span>.</p>\n<p>The quarter was <person>Warren Buffett's</person> last as the conglomerate's chief executive, a job now held by <person>Greg Abel</person>. Buffett remains chairman.</p>\n<p>Berkshire also reported ending 2025 with <money>$373.3 billion</money> of cash, giving Abel the firepower to make the kind of major acquisitions that eluded Buffett over the last decade.</p>\n<p>It was also the thirteenth consecutive quarter in which Berkshire sold more stocks than it bought, and the sixth with no share buybacks.</p>\n<p>Quarterly operating profit fell 30% to <money>$10.2 billion</money>, or about <money>$7,092</money> per Class A share, from <money>$14.53 billion</money> a year earlier.</p>\n<p>Net income fell 3% to <money>$19.2 billion</money> from <money>$19.69 billion</money>, as the writedown and lower operating profit offset the value of Berkshire's holdings in <org value=\"AAPL.NaE\" idsrc=\"xmltag.org\" >Apple</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AAPL' fmr-param-security-type='Equity'>( AAPL )</span>, <org value=\"AXP.NaE\" idsrc=\"xmltag.org\" >American Express</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AXP' fmr-param-security-type='Equity'>( AXP )</span> and other stocks.</p>\n<p>ABEL PAYS TRIBUTE TO BUFFETT</p>\n<p>For the full year, operating profit fell 6% to <money>$44.49 billion</money>, while net income fell 25% to <money>$66.97 billion</money>.</p>\n<p>Buffett had long urged investors to ignore fluctuations in Berkshire's net income, which reflect accounting rules that require Berkshire to report gains and losses on stocks that Berkshire isn't selling.</p>\n<p>In his first annual letter to Berkshire shareholders, Abel paid tribute to his mentor, calling Buffett a &quot;remarkable CEO&quot; and &quot;arguably the greatest investor of all time&quot; and pledging to maintain his discipline in determining how to invest Berkshire's capital.</p>\n<p>&quot;We are committed to strengthening the great legacy built by <person>Warren Buffett</person> and his business partner <person>Charlie Munger</person>, ensuring it endures through our commitment to excellence , Abel wrote, referring to Berkshire's late vice chairman. &quot;I recognize how you want us to succeed together, and to do so in the right way.&quot;</p>\n<p>Berkshire's <money>$4.5 billion</money> writedown for Occidental reflected its belief that the recent decline in the oil company's stock price was not &quot;temporary,&quot; though it said it had no intention to sell any of its stock.</p>\n<p>The writedown was Berkshire's second in 2025, in addition to a writedown of its investment in <org value=\"KHC.NaE\" idsrc=\"xmltag.org\" >Kraft Heinz</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='KHC' fmr-param-security-type='Equity'>( KHC )</span>.</p>\n<p>Quarterly insurance profit fell 38% to <money>$4.63 billion</money>.  Falling interest rates reduced income on Berkshire's cash, while pricing pressures limited the willingness of the Geico auto insurer and reinsurance businesses to add customers.</p>\n<p> (Reporting by <person>Jonathan Stempel</person> in <location value=\"LU/us.ny.nyc\" idsrc=\"xmltag.org\" >New York</location>; Editing by <person>Louise Heavens</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/top-news/202602280830RTRSNEWSCOMBINED_KBN3PI0OE-OUSBS_1",
            "pub_date": "2026-02-28 23:31:29",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Berkshire Hathaway profit falls on lower insurance income, writedown",
            "description": "\n<p>*    Berkshire took <money>$4.5 billion</money> writedown for Occidental</p>\n<p>*    Net seller of stocks, no buybacks in Q4</p>\n<p>*    Abel pledges to continue Buffett's legacy</p>\n<p>By <person>Jonathan Stempel</person></p>\n<p><chron>Feb 28</chron> (Reuters) - <org value=\"BRK/A.NaE\" idsrc=\"xmltag.org\" >Berkshire Hathaway</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='BRK/A' fmr-param-security-type='Equity'>( BRK/A )</span> on\nSaturday said operating profit fell in the fourth quarter,\nreflecting lower income from its insurance operations, and wrote\ndown a longstanding investment in <org value=\"OXY.NaE\" idsrc=\"xmltag.org\" >Occidental Petroleum</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='OXY' fmr-param-security-type='Equity'>( OXY )</span>.</p>\n<p>The quarter was <person>Warren Buffett's</person> last as the conglomerate's\nchief executive, a job now held by <person>Greg Abel</person>. Buffett remains\nchairman.</p>\n<p>Berkshire also reported ending 2025 with <money>$373.3 billion</money> of\ncash, giving Abel the firepower to make the kind of major\nacquisitions that eluded Buffett over the last decade.</p>\n<p>It was also the thirteenth consecutive quarter in which\nBerkshire sold more stocks than it bought, and the sixth with no\nshare buybacks.</p>\n<p>Quarterly operating profit fell 30% to <money>$10.2 billion</money>, or\nabout <money>$7,092</money> per Class A share, from <money>$14.53 billion</money> a year\nearlier.</p>\n<p>Net income fell 3% to <money>$19.2 billion</money> from <money>$19.69 billion</money>, as\nthe writedown and lower operating profit offset the value of\nBerkshire's holdings in <org value=\"AAPL.NaE\" idsrc=\"xmltag.org\" >Apple</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AAPL' fmr-param-security-type='Equity'>( AAPL )</span>, <org value=\"AXP.NaE\" idsrc=\"xmltag.org\" >American Express</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AXP' fmr-param-security-type='Equity'>( AXP )</span>\nand other stocks.</p>\n<p></p>\n<p>ABEL PAYS TRIBUTE TO BUFFETT</p>\n<p>For the full year, operating profit fell 6% to <money>$44.49\nbillion</money>, while net income fell 25% to <money>$66.97 billion</money>.</p>\n<p>Buffett had long urged investors to ignore fluctuations in\nBerkshire's net income, which reflect accounting rules that\nrequire Berkshire to report gains and losses on stocks that\nBerkshire isn't selling.</p>\n<p>In his first annual letter to Berkshire shareholders, Abel\npaid tribute to his mentor, calling Buffett a &quot;remarkable CEO&quot;\nand &quot;arguably the greatest investor of all time&quot; and pledging to\nmaintain his discipline in determining how to invest Berkshire's\ncapital.</p>\n<p>&quot;We are committed to strengthening the great legacy built\nby <person>Warren Buffett</person> and his business partner <person>Charlie Munger</person>,\nensuring it endures through our commitment to excellence , Abel\nwrote, referring to Berkshire's late vice chairman. &quot;I recognize\nhow you want us to succeed together, and to do so in the right\nway.&quot;</p>\n<p>Berkshire's <money>$4.5 billion</money> writedown for Occidental reflected\nits belief that the recent decline in the oil company's stock\nprice was not &quot;temporary,&quot; though it said it had no intention to\nsell any of its stock.</p>\n<p>The writedown was Berkshire's second in 2025, in addition\nto a writedown of its investment in <org value=\"KHC.NaE\" idsrc=\"xmltag.org\" >Kraft Heinz</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='KHC' fmr-param-security-type='Equity'>( KHC )</span>.</p>\n<p>Quarterly insurance profit fell 38% to <money>$4.63 billion</money>.\nFalling interest rates reduced income on Berkshire's cash, while\npricing pressures limited the willingness of the Geico auto\ninsurer and reinsurance businesses to add customers.</p>\n<p>(Reporting by <person>Jonathan Stempel</person> in <location value=\"LU/us.ny.nyc\" idsrc=\"xmltag.org\" >New York</location>; Editing by <person>Louise\nHeavens</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602281000RTRSNEWSCOMBINED_L6N3ZO0B7_1",
            "pub_date": "2026-02-28 23:00:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Goliath Resources Proposes to Extend Term of Warrants Held by McEwen Inc.",
            "description": "\n<p align=\"justify\"><location value=\"LU/ca.on.tornto\" idsrc=\"xmltag.org\" >TORONTO</location>, <chron>Feb.  28, 2026</chron>  (GLOBE NEWSWIRE) -- <strong><org value=\"GOTRF.NaE\" idsrc=\"xmltag.org\" >Goliath Resources Limited</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='GOTRF' fmr-param-security-type='Equity'>( GOTRF )</span>  (“Goliath” or the “Company”) </strong>announces that it has applied to the <org>TSX Venture Exchange</org> (the “TSXV”) to extend the term of an aggregate of 2,590,673 common share purchase warrants of the Company (the “Warrants”), with each Warrant being exercisable to acquire one common share of the Company (each a “Warrant Share”) at a price of <money>$2.50</money> per Warrant Share. As disclosed by the Company in a news release dated <chron>March 10, 2025</chron>, the Warrants were issued by the Company on <chron>March 10, 2025</chron> in connection with a <money>$10,000,000</money> strategic non-brokered private placement of 5,181,347 units of the Company (“Units”) to <org value=\"MUX.NaE\" idsrc=\"xmltag.org\" >McEwen Inc.</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='MUX' fmr-param-security-type='Equity'>( MUX )</span> (“McEwen”), an arm’s length party to the Company, at a deemed price of <money>C$1.93</money> per Unit, in exchange for the issuance to the Company of an aggregate of 868,056 shares of common stock of McEwen (“McEwen Shares”) at a deemed price of <money>C$11.52</money> per <person>McEwen Share</person>.</p>  <p align=\"justify\">The Warrants are scheduled to expire on <chron>March 10, 2026</chron>. Subject to acceptance by the TSXV, the Company will extend the expiry date of the warrants by six months to <chron>September 10, 2026</chron>. All other terms and conditions of the Warrants, including the exercise price, will remain unchanged.</p>  <p align=\"justify\"><strong>About <org value=\"GOTRF.NaE\" idsrc=\"xmltag.org\" >Goliath Resources Limited</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='GOTRF' fmr-param-security-type='Equity'>( GOTRF )</span></strong></p>  <p align=\"justify\"><org value=\"GOTRF.NaE\" idsrc=\"xmltag.org\" >Goliath Resources</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='GOTRF' fmr-param-security-type='Equity'>( GOTRF )</span> is an explorer of precious metals projects in the highly prospective Golden Triangle of <location value=\"LS/ca.bc\" idsrc=\"xmltag.org\" >Northwestern British Columbia</location>. All of its projects are in high quality geological settings and geopolitical safe jurisdictions amenable to mining in <location value=\"LC/ca\" idsrc=\"xmltag.org\" >Canada</location>. Goliath is a member and active supporter of CASERM which is an organization that represents a collaborative venture between <org>Colorado School of Mines and Virginia Tech</org>. In 2025, Goliath completed its largest drill campaign to date for a total of 64,364 meters. It is fully funded for a similar sized drill program in 2026. The Company’s key strategic cornerstone shareholders include <org>Crescat Capital</org>, <org>Waratah Capital Advisors</org>, <org value=\"MUX.NaE\" idsrc=\"xmltag.org\" >McEwen Inc.</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='MUX' fmr-param-security-type='Equity'>( MUX )</span> , a <org>Global Commodity Group</org> (<location value=\"LC/sg\" idsrc=\"xmltag.org\" >Singapore</location>), <person>Rob McEwen</person>, <person>Eric Sprott</person> and <person>Larry Childress</person>.</p>  <p align=\"justify\"><strong>For more information please contact: </strong></p>  <p align=\"justify\"><org value=\"GOTRF.NaE\" idsrc=\"xmltag.org\" >Goliath Resources Limited</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='GOTRF' fmr-param-security-type='Equity'>( GOTRF )</span> <br/>Mr. <person>Roger Rosmus</person> <br/>Founder and CEO <br/>Tel: +1.416.488.2887<br/>roger@goliathresources.com <br/>www.goliathresourcesltd.com </p>  <p align=\"justify\"><strong>Disclaimer for Forward-Looking Statements</strong></p>  <p align=\"justify\"><em>Certain statements contained in this press release constitute forward-looking information. These statements relate to future events or future performance. The use of any of the words “could”, “intend”, “expect”, “believe”, “will”, “projected”, “estimated” and similar expressions and statements relating to matters that are not historical facts are intended to identify forward-looking information and are based on Goliath’s current belief or assumptions as to the outcome and timing of such future events. Actual future results may differ materially. In particular, this release contains forward-looking information relating to, among other things: the extension of the term of the Warrants; and TSXV approval of the extension of the term of the Warrants. Various assumptions or factors are typically applied in drawing conclusions or making the forecasts or projections set out in forward-looking information. Those assumptions and factors are based on information currently available to Goliath. Although such statements are based on management's reasonable assumptions, there can be no assurance that the proposed transactions will occur, or that if the proposed transactions do occur, will be completed on the terms described above.</em></p>  <p align=\"justify\"><em>The forward-looking information contained in this release is made as of the date hereof and Goliath is not obligated to update or revise any forward-looking information, whether as a result of new information, future events or otherwise, except as required by applicable securities laws. Because of the risks, uncertainties and assumptions contained herein, investors should not place undue reliance on forward-looking information. The foregoing statements expressly qualify any forward-looking information contained herein.</em></p>  <p align=\"center\"><strong>Neither the TSXV nor its Regulation Services Provider (as that term is defined in the policies of the TSXV) accepts responsibility for the adequacy or accuracy of this release.</strong></p>  Image: https://www.globenewswire.com/newsroom/ti?nf=OTY2MzM3OSM3NDYwNzI5IzIwOTc5MzM=  <br/> Image: https://ml.globenewswire.com/media/MjM0M2ZmYWItMzNiZS00YTg4LWJhYzItNzIyYjExZmUzMDZiLTExMDk1MDQtMjAyNi0wMi0yOC1lbg==/tiny/Goliath-Resources-Limited.png <p> Image: Primary Logo </p>\nSource: <org value=\"GOTRF.NaE\" idsrc=\"xmltag.org\" >Goliath Resources Limited</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='GOTRF' fmr-param-security-type='Equity'>( GOTRF )</span>\n",
            "link": "https://www.fidelity.com/news/article/mergers-and-acquisitions/202602280938PRIMZONEFULLFEED9663379",
            "pub_date": "2026-02-28 22:38:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Travel chaos grips Middle East after US, Israel strikes on Iran",
            "description": "\n<p>*    Airspace closures affect routes between <location value=\"LR/eur\" idsrc=\"xmltag.org\" >Europe</location> and <location value=\"LR/asp\" idsrc=\"xmltag.org\" >Asia</location></p>\n<p></p>\n<p>*    Lufthansa, <org value=\"WZZAF.NaE\" idsrc=\"xmltag.org\" >Wizz Air</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='WZZAF' fmr-param-security-type='Equity'>( WZZAF )</span>, others halt flights to affected\nregions</p>\n<p>*    EU aviation regulator advises against flying over\n<location value=\"LR/mde\" idsrc=\"xmltag.org\" >Middle East</location> amid military operations\n(Adds Dubai Airports statement and footage from the airport,\nEtihad, Indian civil aviation authority statements, details on\nregional traffic rerouted through <location value=\"LC/sa\" idsrc=\"xmltag.org\" >Saudi Arabia</location> and <location value=\"LC/eg\" idsrc=\"xmltag.org\" >Egypt</location>)</p>\n<p>By <person>Federico Maccioni</person> and <person>Joanna Plucinska</person></p>\n<p><location value=\"LU/ae..dubai\" idsrc=\"xmltag.org\" >DUBAI</location>/<location value=\"LU/gb.eng.london\" idsrc=\"xmltag.org\" >LONDON</location>, <chron>Feb 28</chron> (Reuters) - Airlines\nsuspended flights across the <location value=\"LR/mde\" idsrc=\"xmltag.org\" >Middle East</location> on Saturday, including\nto and from the world's busiest travel hub <location value=\"LU/ae..dubai\" idsrc=\"xmltag.org\" >Dubai</location>, after <location value=\"LC/us\" idsrc=\"xmltag.org\" >the\nUnited States</location> and <location value=\"LC/il\" idsrc=\"xmltag.org\" >Israel</location> launched strikes on <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location>, plunging the\nregion into a renewed military confrontation.</p>\n<p>Flight maps showed airspace over <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location>, <location value=\"LC/iq\" idsrc=\"xmltag.org\" >Iraq</location>, <location value=\"LC/kw\" idsrc=\"xmltag.org\" >Kuwait</location>, <location value=\"LC/il\" idsrc=\"xmltag.org\" >Israel</location>\nand <location value=\"LC/bh\" idsrc=\"xmltag.org\" >Bahrain</location> virtually empty as <location value=\"LC/il\" idsrc=\"xmltag.org\" >Israel</location> said it struck <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location> and\nthe U.S. military initiated a series of strikes against targets\nin the country. <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location> retaliated with a salvo of missiles.</p>\n<p>Witnesses told Reuters about explosions across the Gulf,\nincluding in <location value=\"LC/qa\" idsrc=\"xmltag.org\" >Qatar's</location> <location value=\"LU/qa..doha\" idsrc=\"xmltag.org\" >Doha</location>, which hosts the biggest U.S. military\nbase in the <location value=\"LR/mde\" idsrc=\"xmltag.org\" >Middle East</location>, as well as <location value=\"LU/ae..abudha\" idsrc=\"xmltag.org\" >Abu Dhabi</location> and <location value=\"LU/ae..dubai\" idsrc=\"xmltag.org\" >Dubai</location> in the\n<location value=\"LC/ae\" idsrc=\"xmltag.org\" >United Arab Emirates</location> - key regional transport hubs.</p>\n<p>Dubai Airports said all flights at <org>Dubai International</org>,\nwhich handled nearly 100 million passengers last year, as well\nas the smaller <location>Al Maktoum International airport</location>, were suspended\nuntil further notice, urging passengers not to travel.</p>\n<p>&quot;Due to multiple regional airspace closures, Emirates has\ntemporarily suspended operations to and from <location value=\"LU/ae..dubai\" idsrc=\"xmltag.org\" >Dubai</location>,&quot; the\n<location value=\"LU/ae..dubai\" idsrc=\"xmltag.org\" >Dubai</location>-based carrier said, while its sister airline flydubai said\nit had temporarily suspended operations.</p>\n<p><org>Etihad Airways</org> said all flights scheduled to depart <location value=\"LU/ae..abudha\" idsrc=\"xmltag.org\" >Abu\nDhabi</location> were suspended until <chron>1000 GMT on Sunday</chron>, and flights\nexpected to arrive at the Gulf hub before that time would be\ncancelled. &quot;Flights already en route to <location value=\"LU/ae..abudha\" idsrc=\"xmltag.org\" >Abu Dhabi</location> are returning\nto their origin airports where required,&quot; it added.</p>\n<p></p>\n<p>STRIKES DEEPEN REGIONAL TURMOIL</p>\n<p>The escalation dimmed hopes for a diplomatic solution to\n<location value=\"LU/ir..tehran\" idsrc=\"xmltag.org\" >Tehran's</location> nuclear dispute with the West and reignited conflict\nafter weeks of U.S. military buildup in the region.</p>\n<p>It marks the latest upheaval for air travel in the usually\nbusy region amid escalating tensions. Airports in the <location value=\"LR/mde\" idsrc=\"xmltag.org\" >Middle\nEast</location> are some of the busiest in the world, covering an area\nstretching from <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location> and <location value=\"LC/iq\" idsrc=\"xmltag.org\" >Iraq</location> to the Mediterranean and serving\nas a connecting hub for flights between <location value=\"LR/eur\" idsrc=\"xmltag.org\" >Europe</location> and <location value=\"LR/asp\" idsrc=\"xmltag.org\" >Asia</location>.</p>\n<p>&quot;Passengers and airlines can expect airspace to be shut for\nquite some time in the region,&quot; said <person>Eric Schouten</person>, head of\naviation security advisory Dyami. &quot;The impact on regional\naviation is immediate and highly fluid.&quot;</p>\n<p></p>\n<p>FLIGHTS REROUTED, PASSENGERS STRANDED</p>\n<p>Airlines have cancelled almost 40% of flights to <location value=\"LC/il\" idsrc=\"xmltag.org\" >Israel</location> and\n6.7% of flights to the broader region on Saturday, according to\npreliminary Cirium data. That number seems likely to rise.</p>\n<p>At <location value=\"LU/qa..doha\" idsrc=\"xmltag.org\" >Doha's</location> <location>Hamad International Airport</location>, gates appeared almost\nempty, while stranded passengers queued to make hotel\narrangements. There was uncertainty about when flight schedules\nwould resume, a Reuters witness reported.</p>\n<p>The region has taken on a more important role since the\nstart of the war between <location value=\"LC/ru\" idsrc=\"xmltag.org\" >Russia</location> and <location value=\"LC/ua\" idsrc=\"xmltag.org\" >Ukraine</location>, which has forced\nairlines to avoid airspace over both countries.</p>\n<p>Conflict zones are an increasing operational burden on\nairlines as aerial attacks raise worries about accidental or\ndeliberate shoot-downs of commercial air traffic. Longer flight\ntimes also require more fuel, adding to their costs.</p>\n<p><location value=\"LC/il\" idsrc=\"xmltag.org\" >Israel</location>, <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location>, <location value=\"LC/iq\" idsrc=\"xmltag.org\" >Iraq</location>, <location value=\"LC/bh\" idsrc=\"xmltag.org\" >Bahrain</location>, <location value=\"LC/qa\" idsrc=\"xmltag.org\" >Qatar</location>, <location value=\"LC/kw\" idsrc=\"xmltag.org\" >Kuwait</location> and <location value=\"LC/jo\" idsrc=\"xmltag.org\" >Jordan</location> closed\ntheir airspace following the attacks and a map of the region on\nFlightradar24 showed planes avoiding these areas.</p>\n<p>Traffic instead appeared to be collecting around Larnaca,\n<location value=\"LC/cy\" idsrc=\"xmltag.org\" >Cyprus</location>, <location value=\"LU/sa..jeddah\" idsrc=\"xmltag.org\" >Jeddah</location>, <location value=\"LU/eg..cairo\" idsrc=\"xmltag.org\" >Cairo</location> and <location value=\"LU/sa..riyadh\" idsrc=\"xmltag.org\" >Riyadh</location> airports, according to the\nflight-tracking service, which earlier on Saturday experienced\nan outage due to a spike in the number of visitors to its\nwebsite.</p>\n<p></p>\n<p>BRITISH AIRWAYS, LUFTHANSA, WIZZ AIR SUSPEND FLIGHTS</p>\n<p><org>The European Union's</org> aviation regulator EASA on Saturday\nrecommended its airlines stay out of the airspace affected by\nthe ongoing military intervention.</p>\n<p><org>British Airways</org>, owned by IAG, said it had\ncancelled flights to <location value=\"LU/il..telavv\" idsrc=\"xmltag.org\" >Tel Aviv</location> and <location value=\"LC/bh\" idsrc=\"xmltag.org\" >Bahrain</location> until <chron>March 3</chron>, as well\nas Saturday's flights to <location value=\"LU/jo..amman\" idsrc=\"xmltag.org\" >Amman</location>.</p>\n<p><org>The Russian Ministry of Transport</org> said on Saturday that\nRussian air carriers had suspended flights to <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location> and <location value=\"LC/il\" idsrc=\"xmltag.org\" >Israel</location>.</p>\n<p><location value=\"LC/de\" idsrc=\"xmltag.org\" >Germany's</location> Lufthansa said it was suspending flights\nto and from <location value=\"LU/ae..dubai\" idsrc=\"xmltag.org\" >Dubai</location> on Saturday and Sunday and halting temporarily\nthe <location value=\"LU/il..telavv\" idsrc=\"xmltag.org\" >Tel Aviv</location>, <location value=\"LU/lb..beirut\" idsrc=\"xmltag.org\" >Beirut</location> and <location value=\"LC/om\" idsrc=\"xmltag.org\" >Oman</location> routes until <chron>March 7</chron>. Air <location value=\"LC/fr\" idsrc=\"xmltag.org\" >France</location>\ncancelled flights to and from <location value=\"LU/il..telavv\" idsrc=\"xmltag.org\" >Tel Aviv</location> and <location value=\"LU/lb..beirut\" idsrc=\"xmltag.org\" >Beirut</location>.</p>\n<p>Iberia also cancelled flights to <location value=\"LU/il..telavv\" idsrc=\"xmltag.org\" >Tel Aviv</location>, while <org value=\"WZZAF.NaE\" idsrc=\"xmltag.org\" >Wizz Air</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='WZZAF' fmr-param-security-type='Equity'>( WZZAF )</span>\nsuspended flights to and from <location value=\"LC/il\" idsrc=\"xmltag.org\" >Israel</location>, <location value=\"LU/ae..dubai\" idsrc=\"xmltag.org\" >Dubai</location>, <location value=\"LU/ae..abudha\" idsrc=\"xmltag.org\" >Abu Dhabi</location>\nand <location value=\"LU/jo..amman\" idsrc=\"xmltag.org\" >Amman</location> with immediate effect until the same date, it said.</p>\n<p><location value=\"LC/in\" idsrc=\"xmltag.org\" >India's</location> civil aviation authority the country was on alert to\nmanage potential flight diversions due to tensions in the <location value=\"LR/mde\" idsrc=\"xmltag.org\" >Middle\nEast</location>, as carriers like Air India and Indigo suspended flights.</p>\n<p></p>\n<p>REGIONAL CARRIERS AFFECTED</p>\n<p><org>Qatar Airways</org> and <org>Kuwait Airways</org> temporarily suspended\nflights, while <org>Turkish Airlines</org> also cancelled flights to\nseveral Middle Eastern destinations.</p>\n<p><location value=\"LC/kw\" idsrc=\"xmltag.org\" >Kuwait's</location> aviation authority said it was halting all flights\nto <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location> until further notice, according to the state news\nagency, while <org>Oman Air</org> said it had suspended all flights to\n<location value=\"LU/iq..bagdad\" idsrc=\"xmltag.org\" >Baghdad</location> due to the regional developments.</p>\n<p>KLM, the Dutch arm of Air France-KLM, has brought\nforward the suspension of its <location value=\"LU/nl..amster\" idsrc=\"xmltag.org\" >Amsterdam</location>-<location value=\"LU/il..telavv\" idsrc=\"xmltag.org\" >Tel Aviv</location> service,\ncancelling the flight scheduled for Saturday after strikes in\n<location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location>, a spokesperson said.</p>\n<p>The airline had announced on Wednesday that flights would be\nhalted from <chron>Sunday, March 1</chron>. Only one flight to <location value=\"LU/il..telavv\" idsrc=\"xmltag.org\" >Tel Aviv</location> had\nbeen scheduled for Saturday.\n<org>Virgin Atlantic</org> said it had decided to temporarily avoid Iraqi\nairspace, resulting in some re-routing of its flights.</p>\n<p></p>\n<p>(Reporting by <person>Federico Maccioni</person> in <location value=\"LU/ae..dubai\" idsrc=\"xmltag.org\" >Dubai</location> and <person>Joanna Plucinska</person>\nin <location value=\"LU/gb.eng.london\" idsrc=\"xmltag.org\" >London</location>; Additional reporting by <person>Justyna Pawlak</person> in <location value=\"LU/qa..doha\" idsrc=\"xmltag.org\" >Doha</location>;\nEditing by <person>Adam Jourdan</person>, <person>Josephine Mason</person>, <person>Janet Lawrence</person>, <person>Sharon\nSingleton</person> and <person>Louise Heavens</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602280940RTRSNEWSCOMBINED_L6N3ZO06V_1",
            "pub_date": "2026-02-28 22:40:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Trump touts economy, energy in Texas, mum on his favorite in Republican Senate race",
            "description": "<p><location value=\"LU/us.tx.corsti\" idsrc=\"xmltag.org\" >CORPUS CHRISTI, Texas</location>, <chron>Feb 27</chron> (Reuters) - U.S. President Donald Trump touted his economic and fossil fuel agenda in southern <location value=\"LS/us.tx\" idsrc=\"xmltag.org\" >Texas</location> on Friday but was coy about which of three Republican candidates he would back in the state's looming <org>U.S. Senate</org> primary.</p>\n<p>Trump has stayed out of his party's messy <org>U.S. Senate</org> contest ahead of Tuesday's vote. But his visit to <location value=\"LU/us.tx.corsti\" idsrc=\"xmltag.org\" >Corpus Christi</location> placed him near several competitive <org>U.S. House of Representatives</org> districts where Hispanic voters, an important constituency for Republicans nationally, could determine the outcome in November's midterm elections.</p>\n<p>The trip followed a warning from a <location value=\"LS/us.tx\" idsrc=\"xmltag.org\" >Texas</location> Republican who said her recent loss in a state legislature race, despite Trump's endorsement, was a &quot;wake-up call&quot; for the party.</p>\n<p>Trump, wearing a red Make America Great Again hat, spoke to several hundred supporters at a waterfront rally in front of a ship he said had carried Venezuelan oil.</p>\n<p>He made references to &quot;new friend and partner <location value=\"LC/ve\" idsrc=\"xmltag.org\" >Venezuela</location>,&quot; nearly two months after he ordered the U.S. military to arrest Venezuelan President <person>Nicolas Maduro</person> and seize control of the country's oil.</p>\n<p>Trump boasted about his single-minded determination to increase production of fossil fuels blamed for climate change, saying his policies had led to lower gasoline prices and helped boost economic growth. Gas prices are about 4% lower since January last year.</p>\n<p>&quot;We're witnessing a historic American energy boom like we've never seen,&quot; Trump said.</p>\n<p>The president's event springboarded off his State of the Union address, which sought to draw sharp contrasts with Democrats on affordability and immigration enforcement as they aim to gain control of <org>Congress</org> later this year.</p>\n<p>The <location value=\"LU/us.tx.corsti\" idsrc=\"xmltag.org\" >Corpus Christi</location> area is the top exporter of liquefied natural gas in the U.S., with 42% of the product nationwide passing through its port.</p>\n<p>TRUMP MUM ON ENDORSEMENT</p>\n<p>Midterm elections are historically seen as a check on the sitting president, and Trump has warned his agenda will be derailed if his party loses power. But first, Republicans in the deeply conservative state must settle on who they want to represent them in November's general election. </p>\n<p>Public opinion polls show Senator <person>John Cornyn</person>, in office since 2002, trailing two challengers - <location value=\"LS/us.tx\" idsrc=\"xmltag.org\" >Texas</location> Attorney General <person>Ken Paxton</person> and U.S. Representative <person>Wesley Hunt</person> - in <location value=\"LS/us.tx\" idsrc=\"xmltag.org\" >Texas'</location> most cutthroat contest.</p>\n<p>Trump told reporters shortly after arriving that he had &quot;pretty much&quot; decided who to support but would not announce the name.</p>\n<p>During the rally, Trump called both Cornyn and Paxton &quot;great&quot; and said there was &quot;a little bit of a race&quot; between the men.</p>\n<p>&quot;It's going to be an interesting one,&quot; Trump said.</p>\n<p>As he has done several times before, Trump also raised the prospect of seeking an unconstitutional third term as president.</p>\n<p>CAN FORCED REDISTRICTING RESCUE REPUBLICANS?</p>\n<p>At the president's urging last year, <location value=\"LS/us.tx\" idsrc=\"xmltag.org\" >Texas</location> Republicans launched a redistricting fight aimed at improving the party's prospects in U.S. House races. With the new map in effect, Republicans could gain up to five more seats across the state. </p>\n<p>Hispanic voters in south <location value=\"LS/us.tx\" idsrc=\"xmltag.org\" >Texas</location> are key to the party's electoral success, said <location value=\"LU/us.tx.corsti\" idsrc=\"xmltag.org\" >Corpus Christi's</location> state Senator <person>Adam Hinojosa</person>, the first Republican to represent the <location>Rio Grande Valley</location> in the <org>Texas Senate</org> since 1874.</p>\n<p>&quot;We need the job opportunities, we need to make sure that our families are taken care of, we need to be able to afford all of the groceries and things to have a decent lifestyle,&quot; Hinojosa said in an interview.</p>\n<p>Crediting Trump's border policy and pro-oil agenda, Hinojosa said he thought the president's visit would help energize the Republican base.</p>\n<p>Trump has prioritized maximizing U.S. fossil fuel production by rolling back environmental regulations and streamlining permitting for energy projects, benefiting places like southern <location value=\"LS/us.tx\" idsrc=\"xmltag.org\" >Texas</location>.</p>\n<p>Even so, a recent Reuters/Ipsos poll found that 36% of people nationwide approved of Trump's handling of the economy while 56% disapproved. </p>\n<p><person>Mary Campbell</person>, who attended Friday's rally and has two Christmas trees she keeps decorated for Trump year-round, said she was \"very happy with the border&quot; under his presidency. But the economy, she said, \"could use a little more help.\"</p>\n<p>\"I'm sad that prices are not quite controlled yet, but hopefully we're working in that direction,\" Campbell, of <location value=\"LU/us.tx.corsti\" idsrc=\"xmltag.org\" >Corpus Christi</location>, said. \"I have five kids, so you know, I watch some of them struggling.\"</p>\n<p>(Reporting by <person>Bo Erickson</person>, <person>Jarrett Renshaw</person> and <person>Nolan McCaskill</person>; Writing by <person>Bo Erickson</person> and <person>Steve Holland</person>; Editing by <person>Colleen Jenkins</person>, <person>Chris Reese</person>, <person>Rod Nickel</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/us-economy/202602271815RTRSNEWSCOMBINED_KBN3PH15Q-OUSWD_1",
            "pub_date": "2026-02-28 07:15:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Berkshire CEO Abel assures investors he'll be a careful steward after Buffett",
            "description": "\n<p><chron>Feb 28</chron> (Reuters) - <org value=\"BRK/A.NaE\" idsrc=\"xmltag.org\" >Berkshire Hathaway's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='BRK/A' fmr-param-security-type='Equity'>( BRK/A )</span> new\nchief executive <person>Greg Abel</person> moved to assure investors on Saturday\nthat he will continue the careful, deliberate management of his\npredecessor <person>Warren Buffett</person> as he steers the American\nconglomerate.</p>\n<p>In his first annual letter to shareholders, Abel said\nBerkshire's culture and values are unchanged and will continue\n&quot;in perpetuity.&quot;</p>\n<p>He also said Berkshire's <money>$373.3 billion</money> stake in cash and\nequivalents gives the company plenty of &quot;dry powder,&quot; but that\ncapital deployment will remain &quot;intentional and deliberate.&quot;</p>\n<p>Abel also paid homage to Buffett, who led Berkshire for 60\nyears and remains Berkshire's chairman, calling him a\n&quot;remarkable ceo&quot; who has left the company well-positioned for\ndecades to come.\n(Reporting by <person>Jonathan Stempel</person> in <location value=\"LU/us.ny.nyc\" idsrc=\"xmltag.org\" >New York</location>, Editing by <person>Louise\nHeavens</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602280908RTRSNEWSCOMBINED_L6N3ZO0AO_1",
            "pub_date": "2026-02-28 22:08:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Market analysts react to US-Israel strikes on Iran",
            "description": "\n<p><chron>Feb 28</chron> (Reuters) - <location value=\"LC/us\" idsrc=\"xmltag.org\" >The United States</location> and <location value=\"LC/il\" idsrc=\"xmltag.org\" >Israel</location> launched strikes on <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location> on Saturday, targeting its leadership and plunging the <location value=\"LR/mde\" idsrc=\"xmltag.org\" >Middle East</location> into a new conflict that President <person>Donald Trump</person> said would end a security threat and give Iranians a chance to topple their rulers.</p>\n<p>The strikes put nearby oil-producing Gulf Arab countries on edge as fears of escalation grew, and <location value=\"LU/ir..tehran\" idsrc=\"xmltag.org\" >Tehran</location> responded by launching missiles towards Israel. </p>\n<p>Some oil majors and top trading houses suspended crude oil and fuel shipments via the <location>Strait of Hormuz</location> because of the  attacks, four trading sources said on Saturday.    </p>\n<p>QUOTES:</p>\n<p>VISHNU VARATHAN, HEAD OF MACRO REASEARCH, <location value=\"LR/asp\" idsrc=\"xmltag.org\" >ASIA</location> EX-<location value=\"LC/jp\" idsrc=\"xmltag.org\" >JAPAN</location>, MIZUHO, <location value=\"LC/sg\" idsrc=\"xmltag.org\" >SINGAPORE</location>:</p>\n<p>&quot;A broader state of spots of regional attacks/instability may be par for the course - in line with <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran's</location> warning. Oil prices are likely to remain elevated as production and passage remain prone to attacks and disruptions. <org>OPEC</org> may be under pressure to raise production to try and offset. But a 10-25% premium on oil is not outlandish - even without a blockade of the Straits of Hormuz, which is easily a 50% premium risk event.&quot;</p>\n<p><person>CHRISTOPHER WONG</person>, STRATEGIST, OCBC, <location value=\"LC/sg\" idsrc=\"xmltag.org\" >SINGAPORE</location>:</p>\n<p>&quot;The strike raises geopolitical risk premia as markets head into Monday's open. The immediate reaction function is fairly predictable: safe-haven assets such as gold are likely to see an upside gap, while oil prices may also firm on supply-disruption concerns. Risk assets and high-beta currencies... could face an initial bout of volatility, particularly if headlines suggest potential retaliation or regional spillovers.&quot;</p>\n<p><person>NICK FERRES</person>, CIO, VANTAGE POINT ASSET MANAGEMENT, <location value=\"LC/sg\" idsrc=\"xmltag.org\" >SINGAPORE</location>:</p>\n<p>&quot;Energy is still inexpensive. That's the obvious sector that rallies on Monday. And gold.&quot;</p>\n<p><person>SAUL KAVONIC</person>, MST MARQUEE ENERGY ANALYST, <location value=\"LU/au..sydney\" idsrc=\"xmltag.org\" >SYDNEY</location>:</p>\n<p>&quot;Early indications are of a broader scale attack on <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location>, with counterattacks which could escalate to draw in multiple gulf countries. If the Iranian regime feel they face an existential threat, attempts to block the <location>Strait of Hormuz</location> cannot be ruled out. The US and allies will have military escort plans to try protect passage through the Strait.</p>\n<p>&quot;But if <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location> were to manage to disrupt flows through the Strait, over 20% of global oil and LNG flows could be impacted.  This could present a scenario three times the severity of the arab oil embargo and Iranian revolution in the 1970s, and drive oil prices into the triple digits, while LNG prices could retest the record highs of 2022.</p>\n<p>&quot;The scope for intentional and unintentional escalation in these circumstances is broad and hard to predict. Initial oil market reactions will price in higher risk of various scenarios that may disrupt supply, from a more modest disruption to 2mmbbld of Iranian exports, to attacks on regional oil infrastructure, through to disruption of passage through the <location>Strait of Hormuz</location> in the most extreme scenario. This could add several dollars more to oil, poised for even higher price spikes is the conflict escalates.</p>\n<p>&quot;A full prolonged closure of the <location>Strait of Hormuz</location> is unlikely. But even a partial disruption of flows, especially as some tankers avoid the region, could see several million barrels per day of oil disrupted which would still send oil over <money>$100</money>.&quot;</p>\n<p></p>\n<p> (Reporting by <person>Scott Murdoch</person>, <person>Tom Westbrook</person>, Rae Wee Compiled by <person>Vidya Ranganathan</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602280852RTRSNEWSCOMBINED_KBN3PI0PR-OUSBS_1",
            "pub_date": "2026-02-28 21:52:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "DNO shuts oil output in Iraqi Kurdistan as precaution after strikes on Iran",
            "description": "<p><location value=\"LU/no..oslo\" idsrc=\"xmltag.org\" >OSLO</location>, <chron>Feb 28</chron> (Reuters) - <location value=\"LU/no..oslo\" idsrc=\"xmltag.org\" >Oslo</location>-listed DNO shut\ndown its oil production in the <location value=\"LU/iq..kurstn\" idsrc=\"xmltag.org\" >Kurdistan</location> region of <location value=\"LC/iq\" idsrc=\"xmltag.org\" >Iraq</location> as a\nprecautionary measure after <location value=\"LC/il\" idsrc=\"xmltag.org\" >Israel</location> and <location value=\"LC/us\" idsrc=\"xmltag.org\" >the United States</location>\nlaunched strikes on neighbouring <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location>, the company told Reuters\non Saturday.</p>\n<p>&quot;We've been preparing for the hard stop of operations for\nthe last several weeks. Today, as a precautionary measure, we\ntemporarily stopped operations and moved our people to safe\nlocations,&quot; DNO Executive Chairman <person>Bijan Mossavar-Rahmani</person> said\nin an interview.</p>\n<p>DNO and its partner <org value=\"GEGYF.NaE\" idsrc=\"xmltag.org\" >Genel Energy</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='GEGYF' fmr-param-security-type='Equity'>( GEGYF )</span> produced over\n77,000 barrels of oil per day (bpd) in the fourth quarter of\n2025 at their Tawke and Peshkabir fields, situated close to the\nborder with <location value=\"LC/tr\" idsrc=\"xmltag.org\" >Turkey</location>.</p>\n<p><location value=\"LC/iq\" idsrc=\"xmltag.org\" >Iraq's</location> oil exports from the <location value=\"LU/iq..kurstn\" idsrc=\"xmltag.org\" >Kurdistan</location> region totalled\n200,000 bpd in February.\n(Reporting by <person>Nerijus Adomaitis</person> in <location value=\"LU/no..oslo\" idsrc=\"xmltag.org\" >Oslo</location>, editing by <person>Gwladys\nFouche</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602280854RTRSNEWSCOMBINED_L8N3ZO0HF_1",
            "pub_date": "2026-02-28 21:54:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Research Alert: CFRA Lowers Opinion On Shares Of Adtran Holdings To Sell From Hold",
            "description": "\n<p><chron>03:50 PM EST</chron>, <chron>02/27/2026</chron> (MT Newswires) -- CFRA, an independent research provider, has provided MT Newswires with the following research alert. Analysts at CFRA have summarized their opinion as follows:</p><p>We trim our 12-month target price by <money>$1</money> to <money>$9</money>, applying an EV/revenue multiple of 1.0x to our 2026 estimate, comparable to its three-year historical average multiple of 1.1x. We raise our 2026 EPS estimate by <money>$0.05</money> to <money>$0.48</money> and set 2027's at <money>$0.73</money>. The legislative environment for Huawei replacement in the EU is currently non-compulsory, meaning the transition away from Huawei will take years and may slow market activity until more stringent requirements are enacted. In addition, tightening supply conditions in key components such as memory and optics were highlighted, which could impact costs and supply chain dynamics. Finally, in some European markets, broadband deployment cycles are still at early stages, meaning revenue realization from these projects may be delayed, and some carriers have not started deployments yet.</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/investing-ideas/202602271550MIDNIGHTUSEQUITY_A3575407",
            "pub_date": "2026-02-28 04:50:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "How US-Iran tensions could shape world markets",
            "description": "<p><location value=\"LU/gb.eng.london\" idsrc=\"xmltag.org\" >LONDON</location>/<location value=\"LU/ae..abudha\" idsrc=\"xmltag.org\" >ABU DHABI</location>, <chron>Feb 28</chron> (Reuters) - <location value=\"LC/us\" idsrc=\"xmltag.org\" >The United States</location> and <location value=\"LC/il\" idsrc=\"xmltag.org\" >Israel</location> launched strikes on <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location> on Saturday, targeting its leadership and plunging the <location value=\"LR/mde\" idsrc=\"xmltag.org\" >Middle East</location> into a new conflict that President <person>Donald Trump</person> said would end a security threat and give Iranians a chance to topple their rulers.</p>\n<p>The strikes put nearby oil-producing Gulf Arab countries on edge as fears of escalation grew, and <location value=\"LU/ir..tehran\" idsrc=\"xmltag.org\" >Tehran</location> responded by launching missiles towards Israel. </p>\n<p>Here's how the conflict could play out across world markets.     </p>\n<p>OIL SPIKEOil is the main barometer of <location value=\"LR/mde\" idsrc=\"xmltag.org\" >Middle East</location> tension.</p>\n<p><location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location> is a major producer and lies opposite the oil-rich <location>Arabian Peninsula</location> across the <location>Strait of Hormuz</location>, through which about 20% of global oil supply passes. Conflict could limit oil entering the global market and push up prices.</p>\n<p>Brent crude traded on Friday around $73 a barrel, already up by a fifth this year.</p>\n<p>Some oil majors and top trading houses suspended crude oil and fuel shipments via the <location>Strait of Hormuz</location> because of the  attacks, four trading sources said on Saturday.</p>\n<p><person>William Jackson</person>, chief emerging markets economist at Capital Economics, said that even if the conflict was contained, Brent might rise to about <money>$80</money>, which was the peak during the 12-day war in <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location> last June. </p>\n<p>A prolonged conflict affecting supply could cause oil prices to jump to around <money>$100</money>, potentially adding 0.6-0.7 percentage points to global inflation, he said in a note. </p>\n<p>WILD SWINGS, EVERYWHERE</p>\n<p>The conflict is likely to exacerbate volatility across global markets, which have already swung wildly this year owing to Trump's tariffs and a sharp tech selloff.</p>\n<p>The VIX volatility index has risen by a third this year, and implied U.S. bond volatility is up 15%. </p>\n<p>Currency markets are unlikely to be immune, analysts say. </p>\n<p>The dollar index fell by around 1% during the June war, CBA notes. But that fall was short-lived and unwound after three or four days.  </p>\n<p>&quot;In current circumstances, the size of the fall will depend on how large and how long-lasting the conflict is expected to be,&quot; CBA analysts said in a note a week ago.  </p>\n<p>&quot;If the conflict was long-lasting and disrupted oil supplies, we expect the U.S. dollar would lift against most currencies except Japanese yen and Swiss franc. The U.S. is a net energy exporter and so benefits from higher oil and gas prices that would result from disrupted oil supply.&quot;</p>\n<p><location value=\"LC/il\" idsrc=\"xmltag.org\" >Israel's</location> shekel will almost certainly be another mover - <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location> quickly retaliated against <location value=\"LC/il\" idsrc=\"xmltag.org\" >Israel</location> on Saturday.</p>\n<p>It dropped 5% at the start of the June war and also reacted after <location value=\"LC/il\" idsrc=\"xmltag.org\" >Israel</location> struck <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran's</location> <location value=\"LU/sy..damcus\" idsrc=\"xmltag.org\" >Damascus</location> consulate in <chron>April 2024</chron> and when <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location> launched missiles at <location value=\"LC/il\" idsrc=\"xmltag.org\" >Israel</location> that October.</p>\n<p>All episodes were short-lived and followed by quick shekel rebounds. However, JPMorgan said it could be different this time if the conflict and a rise in market risk premia proved more persistent.     </p>\n<p>&quot;This would especially be the case if confrontation with <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location> also triggers more intensive operations against <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran's</location> proxies,&quot; the <location>Wall Street</location> bank said.</p>\n<p>SAFE-HAVENS DO THEIR THING</p>\n<p>The Swiss franc, widely regarded as a safe haven in times of turmoil, is expected to face further upward pressure, creating a headache for the <org>Swiss National Bank</org>. It is up 3% this year against the U.S. dollar.</p>\n<p>Investors could also make another dash for gold, which has had a record run and is up 22% so far in 2026, and into silver, which has also been on a roll.</p>\n<p>The conflict could also add to demand for U.S. Treasuries whose yields have been falling in the past few weeks. </p>\n<p>The outlier has been bitcoin, no longer seen as a haven. It fell 2% on Saturday and has shed more than a quarter of its value in two months.</p>\n<p>WATCH <location value=\"LR/mde\" idsrc=\"xmltag.org\" >MIDDLE EAST</location> MARKETS</p>\n<p>Trading in bourses in the <location value=\"LR/mde\" idsrc=\"xmltag.org\" >Middle East</location> on Sunday, including <location value=\"LC/sa\" idsrc=\"xmltag.org\" >Saudi Arabia</location> and <location value=\"LC/qa\" idsrc=\"xmltag.org\" >Qatar</location>, will provide an initial indicator of investor sentiment. While these markets are highly correlated to oil prices, an escalating conflict could ripple through the economies. </p>\n<p>&quot;I suspect markets will be down if these hostilities continue through the day,\" said <person>Ryan Lemand</person>, chief executive officer and co-founder of Neovision Wealth Management. Depending on the scale of the conflict, Gulf equities could drop by 3-5%, he said. </p>\n<p><location value=\"LC/sa\" idsrc=\"xmltag.org\" >Saudi Arabia's</location> benchmark stock index dropped 1.3% in five days through Thursday, its second consecutive week of declines. <location value=\"LU/ae..dubai\" idsrc=\"xmltag.org\" >Dubai's</location> main market, which reopens on Monday, fell in the last two weeks.     </p>\n<p>AIRLINE &amp; DEFENCE STOCKS   </p>\n<p>Global airlines cancelled flights across the <location value=\"LR/mde\" idsrc=\"xmltag.org\" >Middle East</location> on Saturday, and their stocks could be under pressure if the conflict spreads and forces more airspace closures.</p>\n<p>European weapons makers, up 10% this year, could see more demand.</p>\n<p></p>\n<p> (Reporting by <person>Dhara Ranasinghe</person>, <person>Marc Jones</person> and <person>Vidya Ranganathan</person> in <location value=\"LU/gb.eng.london\" idsrc=\"xmltag.org\" >London</location>, <person>Rae Wee</person> in <location value=\"LC/sg\" idsrc=\"xmltag.org\" >Singapore</location>, <person>Hadeel Al Sayegh</person> in <location value=\"LU/ae..abudha\" idsrc=\"xmltag.org\" >Abu Dhabi</location>; Editing by <person>Kevin Liffey</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/us-markets/202602280834RTRSNEWSCOMBINED_KBN3PI0OP-OUSBS_1",
            "pub_date": "2026-02-28 21:34:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Berkshire Hathaway profit falls on writedowns, lower insurance income",
            "description": "\n<p><chron>Feb 28</chron> (Reuters) - <org value=\"BRK/A.NaE\" idsrc=\"xmltag.org\" >Berkshire Hathaway</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='BRK/A' fmr-param-security-type='Equity'>( BRK/A )</span> on Saturday said operating profit fell in the fourth quarter, as it wrote down investments in <org value=\"KHC.NaE\" idsrc=\"xmltag.org\" >Kraft Heinz</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='KHC' fmr-param-security-type='Equity'>( KHC )</span> and <org value=\"OXY.NaE\" idsrc=\"xmltag.org\" >Occidental Petroleum</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='OXY' fmr-param-security-type='Equity'>( OXY )</span> while income from its insurance businesses declined.</p>\n<p>The quarter was <person>Warren Buffett's</person> last as the conglomerate's chief executive, a job now held by <person>Greg Abel</person>. Buffett remains chairman.</p>\n<p>Berkshire also reported ending 2025 with <money>$373.3 billion</money> of cash, giving Abel the firepower to make the kind of major acquisitions that eluded Buffett over the last decade.</p>\n<p>Quarterly operating profit fell 30% to <money>$10.2 billion</money>, or about <money>$7,092</money> per Class A share, from <money>$14.53 billion</money> a year earlier.</p>\n<p></p>\n<p> (Reporting by <person>Jonathan Stempel</person> in <location value=\"LU/us.ny.nyc\" idsrc=\"xmltag.org\" >New York</location>; Editing by <person>Louise Heavens</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602280830RTRSNEWSCOMBINED_KBN3PI0OE-OUSBS_1",
            "pub_date": "2026-02-28 21:30:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "How US-Iran tensions could shape world markets",
            "description": "<p><location value=\"LU/gb.eng.london\" idsrc=\"xmltag.org\" >LONDON</location>/<location value=\"LU/ae..abudha\" idsrc=\"xmltag.org\" >ABU DHABI</location>, <chron>Feb 28</chron> (Reuters) - <location value=\"LC/us\" idsrc=\"xmltag.org\" >The United States</location> and <location value=\"LC/il\" idsrc=\"xmltag.org\" >Israel</location> launched strikes on <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location> on Saturday, targeting its leadership and plunging the <location value=\"LR/mde\" idsrc=\"xmltag.org\" >Middle East</location> into a new conflict that President <person>Donald Trump</person> said would end a security threat and give Iranians a chance to topple their rulers.</p>\n<p>The strikes put nearby oil-producing Gulf Arab countries on edge as fears of escalation grew, and <location value=\"LU/ir..tehran\" idsrc=\"xmltag.org\" >Tehran</location> responded by launching missiles towards Israel. </p>\n<p>Here's how the conflict could play out across world markets.     </p>\n<p>OIL SPIKEOil is the main barometer of <location value=\"LR/mde\" idsrc=\"xmltag.org\" >Middle East</location> tension.</p>\n<p><location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location> is a major producer and lies opposite the oil-rich <location>Arabian Peninsula</location> across the <location>Strait of Hormuz</location>, through which about 20% of global oil supply passes. Conflict could limit oil entering the global market and push up prices.</p>\n<p>Brent crude traded on Friday around $73 a barrel, already up by a fifth this year.</p>\n<p>Some oil majors and top trading houses suspended crude oil and fuel shipments via the <location>Strait of Hormuz</location> because of the  attacks, four trading sources said on Saturday.</p>\n<p><person>William Jackson</person>, chief emerging markets economist at Capital Economics, said that even if the conflict was contained, Brent might rise to about <money>$80</money>, which was the peak during the 12-day war in <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location> last June. </p>\n<p>A prolonged conflict affecting supply could cause oil prices to jump to around <money>$100</money>, potentially adding 0.6-0.7 percentage points to global inflation, he said in a note. </p>\n<p>WILD SWINGS, EVERYWHERE</p>\n<p>The conflict is likely to exacerbate volatility across global markets, which have already swung wildly this year owing to Trump's tariffs and a sharp tech selloff.</p>\n<p>The VIX volatility index has risen by a third this year, and implied U.S. bond volatility is up 15%. </p>\n<p>Currency markets are unlikely to be immune, analysts say. </p>\n<p>The dollar index fell by around 1% during the June war, CBA notes. But that fall was short-lived and unwound after three or four days.  </p>\n<p>&quot;In current circumstances, the size of the fall will depend on how large and how long-lasting the conflict is expected to be,&quot; CBA analysts said in a note a week ago.  </p>\n<p>&quot;If the conflict was long-lasting and disrupted oil supplies, we expect the U.S. dollar would lift against most currencies except Japanese yen and Swiss franc. The U.S. is a net energy exporter and so benefits from higher oil and gas prices that would result from disrupted oil supply.&quot;</p>\n<p><location value=\"LC/il\" idsrc=\"xmltag.org\" >Israel's</location> shekel will almost certainly be another mover - <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location> quickly retaliated against <location value=\"LC/il\" idsrc=\"xmltag.org\" >Israel</location> on Saturday.</p>\n<p>It dropped 5% at the start of the June war and also reacted after <location value=\"LC/il\" idsrc=\"xmltag.org\" >Israel</location> struck <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran's</location> <location value=\"LU/sy..damcus\" idsrc=\"xmltag.org\" >Damascus</location> consulate in <chron>April 2024</chron> and when <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location> launched missiles at <location value=\"LC/il\" idsrc=\"xmltag.org\" >Israel</location> that October.</p>\n<p>All episodes were short-lived and followed by quick shekel rebounds. However, JPMorgan said it could be different this time if the conflict and a rise in market risk premia proved more persistent.     </p>\n<p>&quot;This would especially be the case if confrontation with <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location> also triggers more intensive operations against <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran's</location> proxies,&quot; the <location>Wall Street</location> bank said.</p>\n<p>SAFE-HAVENS DO THEIR THING</p>\n<p>The Swiss franc, widely regarded as a safe haven in times of turmoil, is expected to face further upward pressure, creating a headache for the <org>Swiss National Bank</org>. It is up 3% this year against the U.S. dollar.</p>\n<p>Investors could also make another dash for gold, which has had a record run and is up 22% so far in 2026, and into silver, which has also been on a roll.</p>\n<p>The conflict could also add to demand for U.S. Treasuries whose yields have been falling in the past few weeks. </p>\n<p>The outlier has been bitcoin, no longer seen as a haven. It fell 2% on Saturday and has shed more than a quarter of its value in two months.</p>\n<p>WATCH <location value=\"LR/mde\" idsrc=\"xmltag.org\" >MIDDLE EAST</location> MARKETS</p>\n<p>Trading in bourses in the <location value=\"LR/mde\" idsrc=\"xmltag.org\" >Middle East</location> on Sunday, including <location value=\"LC/sa\" idsrc=\"xmltag.org\" >Saudi Arabia</location> and <location value=\"LC/qa\" idsrc=\"xmltag.org\" >Qatar</location>, will provide an initial indicator of investor sentiment. While these markets are highly correlated to oil prices, an escalating conflict could ripple through the economies. </p>\n<p>&quot;I suspect markets will be down if these hostilities continue through the day,\" said <person>Ryan Lemand</person>, chief executive officer and co-founder of Neovision Wealth Management. Depending on the scale of the conflict, Gulf equities could drop by 3-5%, he said. </p>\n<p><location value=\"LC/sa\" idsrc=\"xmltag.org\" >Saudi Arabia's</location> benchmark stock index dropped 1.3% in five days through Thursday, its second consecutive week of declines. <location value=\"LU/ae..dubai\" idsrc=\"xmltag.org\" >Dubai's</location> main market, which reopens on Monday, fell in the last two weeks.     </p>\n<p>AIRLINE &amp; DEFENCE STOCKS   </p>\n<p>Global airlines cancelled flights across the <location value=\"LR/mde\" idsrc=\"xmltag.org\" >Middle East</location> on Saturday, and their stocks could be under pressure if the conflict spreads and forces more airspace closures.</p>\n<p>European weapons makers, up 10% this year, could see more demand.</p>\n<p></p>\n<p> (Reporting by <person>Dhara Ranasinghe</person>, <person>Marc Jones</person> and <person>Vidya Ranganathan</person> in <location value=\"LU/gb.eng.london\" idsrc=\"xmltag.org\" >London</location>, <person>Rae Wee</person> in <location value=\"LC/sg\" idsrc=\"xmltag.org\" >Singapore</location>, <person>Hadeel Al Sayegh</person> in <location value=\"LU/ae..abudha\" idsrc=\"xmltag.org\" >Abu Dhabi</location>; Editing by <person>Kevin Liffey</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/top-news/202602280834RTRSNEWSCOMBINED_KBN3PI0OP-OUSBS_1",
            "pub_date": "2026-02-28 21:40:44",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Berkshire Hathaway profit falls on writedowns, lower insurance income",
            "description": "\n<p>(.)</p>\n<p><chron>Feb 28</chron> (Reuters) - <org value=\"BRK/A.NaE\" idsrc=\"xmltag.org\" >Berkshire Hathaway</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='BRK/A' fmr-param-security-type='Equity'>( BRK/A )</span> on\nSaturday said operating profit fell in the fourth quarter, as it\nwrote down investments in <org value=\"KHC.NaE\" idsrc=\"xmltag.org\" >Kraft Heinz</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='KHC' fmr-param-security-type='Equity'>( KHC )</span> and <org value=\"OXY.NaE\" idsrc=\"xmltag.org\" >Occidental\nPetroleum</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='OXY' fmr-param-security-type='Equity'>( OXY )</span> while income from its insurance businesses\ndeclined.</p>\n<p>The quarter was <person>Warren Buffett's</person> last as the conglomerate's\nchief executive, a job now held by <person>Greg Abel</person>. Buffett remains\nchairman.</p>\n<p>Berkshire also reported ending 2025 with <money>$373.3 billion</money> of\ncash, giving Abel the firepower to make the kind of major\nacquisitions that eluded Buffett over the last decade.</p>\n<p>Quarterly operating profit fell 30% to <money>$10.2 billion</money>, or\nabout <money>$7,092</money> per Class A share, from <money>$14.53 billion</money> a year\nearlier.\n(Reporting by <person>Jonathan Stempel</person> in <location value=\"LU/us.ny.nyc\" idsrc=\"xmltag.org\" >New York</location>; Editing by <person>Louise\nHeavens</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602280825RTRSNEWSCOMBINED_L6N3ZO0AF_1",
            "pub_date": "2026-02-28 21:25:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Israel shuts down gas fields after US-Israel strikes on Iran",
            "description": "\n<p><location value=\"LU/gb.eng.london\" idsrc=\"xmltag.org\" >LONDON</location>, <chron>Feb 28</chron> - <org>The Israeli Energy Ministry</org> has ordered\nthe temporary shutdown of parts of the country's natural gas\nreservoirs after <location value=\"LC/il\" idsrc=\"xmltag.org\" >Israel</location> and <location value=\"LC/us\" idsrc=\"xmltag.org\" >the United States</location> launched strikes\non <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location> on Saturday.</p>\n<p>The Leviathan gas field offshore <location value=\"LC/il\" idsrc=\"xmltag.org\" >Israel</location>, operated by <org value=\"CVX.NaE\" idsrc=\"xmltag.org\" >Chevron</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='CVX' fmr-param-security-type='Equity'>( CVX )</span>\nhas been shut down, three sources told\nReuters. <org value=\"EERGF.NaE\" idsrc=\"xmltag.org\" >Energean's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='EERGF' fmr-param-security-type='Equity'>( EERGF )</span> production vessel that serves\nseveral Israeli fields has also been shut down, the company said\nin a statement.\n(Reporting by <person>Shadia Nasrallah</person> and <person>Marwa Rashad</person>; editing by\n<person>Barbara Lewis</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602280810RTRSNEWSCOMBINED_L8N3ZO0F6_1",
            "pub_date": "2026-02-28 21:10:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Micron Celebrates Opening of Indiaâs First Semiconductor Assembly and Test Facility",
            "description": "\n<p>SANAND, India, <chron>Feb.  28, 2026</chron>  (GLOBE NEWSWIRE) -- <org value=\"MU.NaE\" idsrc=\"xmltag.org\" >Micron Technology, Inc.</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='MU' fmr-param-security-type='Equity'>( MU )</span> today celebrated the grand opening of its semiconductor assembly and test facility in Sanand, Gujarat, India. The state-of-the-art facility converts advanced DRAM and NAND wafers from Micron's global manufacturing network into finished memory and storage products. Once fully ramped, the first phase of Micron’s Sanand operation will feature more than 500,000 square feet of cleanroom space, making it one of the world’s largest single-floor assembly and test cleanrooms. The site serves customers worldwide to meet the growing global demand for memory and storage fueled by AI.</p>  <p>The facility represents a combined investment of approximately <money>$2.75 billion</money> by Micron and its government partners, advancing semiconductor manufacturing capabilities in <location value=\"LC/in\" idsrc=\"xmltag.org\" >India</location>. Micron Chairman, President and CEO <person>Sanjay Mehrotra</person> and other executives witnessed the opening ceremony with Prime Minister <person>Narendra Modi</person>, Chief Minister of Gujarat <person>Bhupendra Patel</person>, Union Minister for Railways, Communications, Electronics &amp; IT Ashwini Vaishnaw, U.S. Ambassador to <person>India Sergio Gor</person> and other distinguished government officials and guests.</p>  <p>&quot;Today is a proud moment for Micron and India's growing semiconductor industry,&quot; said <person>Sanjay Mehrotra</person>, Chairman, President and CEO of <org value=\"MU.NaE\" idsrc=\"xmltag.org\" >Micron Technology</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='MU' fmr-param-security-type='Equity'>( MU )</span>. “This pioneering facility, the first assembly and test site of its kind in the country, helps build a resilient ecosystem that underpins the global AI economy. We are deeply grateful to the government of India, the Gujarat government and all of the partners involved for their steadfast support in making this achievement possible.&quot;</p>  <p>The Sanand site is ISO 9001:2015 certified and has begun commercial production. To mark the grand opening of the site, Micron presented its first shipment of made-in-India memory modules to Dell Technologies for its laptops made in <location value=\"LC/in\" idsrc=\"xmltag.org\" >India</location> for India. Micron expects to assemble and test tens of millions of chips at Sanand in 2026, scaling to hundreds of millions in 2027. The expansion of conventional assembly and test operations in <location value=\"LC/in\" idsrc=\"xmltag.org\" >India</location> complements Micron's planned development of advanced manufacturing and packaging capabilities in <location value=\"LC/us\" idsrc=\"xmltag.org\" >the United States</location> and strengthens the company’s global assembly and test network.</p>  <p>“The inauguration of Micron’s semiconductor facility in Sanand marks a historic milestone as Bharat begins its first commercial semiconductor chip production,” said Union Minister <person>Ashwini Vaishnaw</person>. “This is a decisive step towards building a trusted, resilient and self-reliant semiconductor ecosystem under the leadership of Hon’ble PM Shri Narendra Modi Ji. India is now moving from being a consumer of chips to becoming a global hub for semiconductor manufacturing and innovation.”</p>  <p>Micron is building India's next generation of semiconductor talent to support its operations in India. Through partnerships with <org>Pandit Deendayal Energy University</org> (PDEU), Namtech, leading universities nationwide and government-sponsored skills development programs, Micron is supporting STEM education, specialized training, workforce readiness for advanced manufacturing roles and community initiatives, including digital and AI literacy programs across the region. </p>  <p>Micron built and is operating the assembly and test facility in accordance with the company's sustainability goals, rigorous health and safety standards, and with local and global environmental commitments. The facility is designed to meet or exceed Leadership in Energy and Environmental Design (LEED) Gold standards. Additionally, the facility uses advanced water-saving technologies to enable zero liquid discharge.</p>  <p><strong>About <org value=\"MU.NaE\" idsrc=\"xmltag.org\" >Micron Technology, Inc.</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='MU' fmr-param-security-type='Equity'>( MU )</span></strong></p>  <p><org value=\"MU.NaE\" idsrc=\"xmltag.org\" >Micron Technology, Inc.</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='MU' fmr-param-security-type='Equity'>( MU )</span> is an industry leader in innovative memory and storage solutions, transforming how the world uses information to enrich life for all. With a relentless focus on our customers, technology leadership and manufacturing and operational excellence, Micron delivers a rich portfolio of high-performance DRAM, NAND and NOR memory and storage products. Every day, the innovations that our people create fuel the data economy, enabling advances in artificial intelligence (AI) and compute-intensive applications that unleash opportunities — from the data center to the intelligent edge and across the client and mobile user experience. To learn more about <org value=\"MU.NaE\" idsrc=\"xmltag.org\" >Micron Technology, Inc.</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='MU' fmr-param-security-type='Equity'>( MU )</span> , visit micron.com.</p>  <p><strong>Forward-Looking Statements</strong></p>  <p>This press release contains forward-looking statements, including statements regarding expectations of future production. These forward-looking statements are subject to a number of risks and uncertainties that could cause actual results to differ materially. Please refer to the documents Micron files with the <org>Securities and Exchange Commission</org>, specifically its most recent Form 10-K and Form 10-Q. These documents contain and identify important factors that could cause actual results to differ materially from those contained in these forward-looking statements. These certain factors can be found at https://investors.micron.com/risk-factor. Although Micron believes that the expectations reflected in the forward-looking statements are reasonable, Micron cannot guarantee future results, levels of activity, or achievements. Micron is under no duty to update any of the forward-looking statements after the date of this press release to conform these statements to actual results.</p>  <p><em>© 2026 <org value=\"MU.NaE\" idsrc=\"xmltag.org\" >Micron Technology, Inc.</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='MU' fmr-param-security-type='Equity'>( MU )</span> All rights reserved. Information, products, and/or specifications are subject to change without notice. Micron, the Micron logo, and all other Micron trademarks are the property of <org value=\"MU.NaE\" idsrc=\"xmltag.org\" >Micron Technology, Inc.</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='MU' fmr-param-security-type='Equity'>( MU )</span> All other trademarks are the property of their respective owners.</em><br/></p>  <p><strong>Micron Media Relations Contact</strong><br/><person>Mark Plungy</person><br/>+1 (408) 203-2910<br/>corpcomms@micron.com</p>  <p><strong>Micron Investor Relations Contact</strong> <br/>Satya Kumar <br/>+1 (408) 450-6199 <br/>satyakumar@micron.com</p>  Image: https://www.globenewswire.com/newsroom/ti?nf=OTY2MzEwMiM3NDU5OTAzIzIwMDUwMjQ=  <br/> Image: https://ml.globenewswire.com/media/M2JjMjk0ZWYtOWQwZS00OGE0LWI0ODUtNjllN2EyYWMxOTUyLTEwMTY1OTctMjAyNi0wMi0yOC1lbg==/tiny/Micron-Technology-Inc-.png\nSource: <org value=\"MU.NaE\" idsrc=\"xmltag.org\" >Micron Technology, Inc.</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='MU' fmr-param-security-type='Equity'>( MU )</span>\n",
            "link": "https://www.fidelity.com/news/article/technology/202602280700PRIMZONEFULLFEED9663102",
            "pub_date": "2026-02-28 20:00:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Research Alert: CFRA Lowers Opinion On Shares Of Zoom Communications To Sell From Hold",
            "description": "\n<p><chron>03:30 PM EST</chron>, <chron>02/27/2026</chron> (MT Newswires) -- CFRA, an independent research provider, has provided MT Newswires with the following research alert. Analysts at CFRA have summarized their opinion as follows:</p><p>We lower our 12-month target price by <money>$25</money> to <money>$65</money>, applying an EV/revenue multiple of 2.3x to our FY 27 (Jan.) estimate, a discount to its three-year historical average multiple at 3.7x. We raise our FY 27 EPS estimate by <money>$0.04</money> to <money>$5.91</money> and set FY 28's at <money>$6.12</money>. The Online business, while stabilizing, continues to see only slight growth, and guidance suggests that this segment will remain relatively flat, with only modest increases anticipated for FY 27. The company noted that price increases are not expected to be an ongoing lever for growth, indicating that future revenue improvement will rely more heavily on adding value and product innovation rather than pricing actions. Finally, the ongoing transition from on-prem to cloud for large enterprise customers remains incomplete, with approximately 150 million seats still on-prem. This indicates a slower migration pace and ongoing challenges in capturing full market potential.</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/investing-ideas/202602271530MIDNIGHTUSEQUITY_A3575394",
            "pub_date": "2026-02-28 04:30:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Newly-listed MetaOptics Ltd delivers strong year-on-year revenue growth of 891%, and remains well-capitalised for growth with cash position of S$8.8 million",
            "description": "\n<div class=\"xn-content\">\n<p><span class=\"legendSpanClass\"><location value=\"LC/sg\" idsrc=\"xmltag.org\" >SINGAPORE</location></span>, <span class=\"legendSpanClass\"><chron>Feb. 28, 2026</chron></span> /PRNewswire/ -- <b><org >MetaOptics Ltd</org> (Catalist: 9MT) (\"<org >MetaOptics</org>\" or the \"Company\", and together with its subsidiaries, the \"Group\") </b>which listed recently in <chron>September 2025</chron>, is pleased to announce its inaugural financial results for the financial year ended <chron>31 December 2025</chron> (\"<b>FY2025</b>\").</p>\n<div><table border=\"0\" cellspacing=\"0\" cellpadding=\"1\" class=\"prnbcc\"><tr><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\" nowrap=\"nowrap\"><br /></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\" nowrap=\"nowrap\"><br /></td><td class=\"prngen3\" colspan=\"1\" rowspan=\"1\" nowrap=\"nowrap\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>2025</b></span></p></td><td class=\"prngen3\" colspan=\"1\" rowspan=\"1\" nowrap=\"nowrap\"><p class=\"prnml4\"><span class=\"prnews_span\">2024</span></p></td><td class=\"prngen4\" colspan=\"1\" rowspan=\"1\" nowrap=\"nowrap\"><p class=\"prnml4\"><span class=\"prnews_span\">+/-</span></p></td></tr><tr><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\" nowrap=\"nowrap\"><br /></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\" nowrap=\"nowrap\"><br /></td><td class=\"prngen4\" colspan=\"1\" rowspan=\"1\" nowrap=\"nowrap\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>S$</b></span></p></td><td class=\"prngen4\" colspan=\"1\" rowspan=\"1\" nowrap=\"nowrap\"><p class=\"prnml4\"><span class=\"prnews_span\">S$</span></p></td><td class=\"prngen4\" colspan=\"1\" rowspan=\"1\" nowrap=\"nowrap\"><p class=\"prnml4\"><span class=\"prnews_span\">%</span></p></td></tr><tr><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\" nowrap=\"nowrap\"><br /></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\" nowrap=\"nowrap\"><br /></td><td class=\"prngen4\" colspan=\"1\" rowspan=\"1\" nowrap=\"nowrap\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>Unaudited</b></span></p></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\" nowrap=\"nowrap\"><br /></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\" nowrap=\"nowrap\"><br /></td></tr><tr><td class=\"prnpr2 prnpl2 prnvab prncbts prnrbrb1 prnbbbs prnsblb1\" colspan=\"1\" rowspan=\"1\" nowrap=\"nowrap\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>Revenue</b></span></p></td><td class=\"prngen6\" colspan=\"1\" rowspan=\"1\" nowrap=\"nowrap\"><br /></td><td class=\"prngen6\" colspan=\"1\" rowspan=\"1\" nowrap=\"nowrap\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>787,388</b></span></p></td><td class=\"prngen6\" colspan=\"1\" rowspan=\"1\" nowrap=\"nowrap\"><p class=\"prnml4\"><span class=\"prnews_span\">79,440</span></p></td><td class=\"prngen6\" colspan=\"1\" rowspan=\"1\" nowrap=\"nowrap\"><p class=\"prnml4\"><span class=\"prnews_span\">891</span></p></td></tr><tr><td class=\"prngen7\" colspan=\"1\" rowspan=\"1\" nowrap=\"nowrap\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>Gross profit </b></span></p></td><td class=\"prngen8\" colspan=\"1\" rowspan=\"1\" nowrap=\"nowrap\"><br /></td><td class=\"prngen8\" colspan=\"1\" rowspan=\"1\" nowrap=\"nowrap\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>159,826</b></span></p></td><td class=\"prngen8\" colspan=\"1\" rowspan=\"1\" nowrap=\"nowrap\"><p class=\"prnml4\"><span class=\"prnews_span\">26,569</span></p></td><td class=\"prngen8\" colspan=\"1\" rowspan=\"1\" nowrap=\"nowrap\"><p class=\"prnml4\"><span class=\"prnews_span\">502</span></p></td></tr><tr><td class=\"prngen7\" colspan=\"1\" rowspan=\"1\" nowrap=\"nowrap\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>Loss </b><b>after income tax and total <br />     comprehensive loss</b></span></p></td><td class=\"prngen8\" colspan=\"1\" rowspan=\"1\" nowrap=\"nowrap\"><br /></td><td class=\"prngen9\" colspan=\"1\" rowspan=\"1\" nowrap=\"nowrap\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>(5,445,573)</b></span></p></td><td class=\"prngen9\" colspan=\"1\" rowspan=\"1\" nowrap=\"nowrap\"><p class=\"prnml4\"><span class=\"prnews_span\">(1,950,882)</span></p></td><td class=\"prngen8\" colspan=\"1\" rowspan=\"1\" nowrap=\"nowrap\"><p class=\"prnml4\"><span class=\"prnews_span\">179</span></p></td></tr><tr><td class=\"prngen7\" colspan=\"1\" rowspan=\"1\" nowrap=\"nowrap\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>Loss per share for loss attributable to <br />     the equity holders of the Group:</b></span></p></td><td class=\"prngen8\" colspan=\"1\" rowspan=\"1\" nowrap=\"nowrap\"><br /></td><td class=\"prngen8\" colspan=\"1\" rowspan=\"1\" nowrap=\"nowrap\"><br /></td><td class=\"prngen8\" colspan=\"1\" rowspan=\"1\" nowrap=\"nowrap\"><br /></td><td class=\"prngen8\" colspan=\"1\" rowspan=\"1\" nowrap=\"nowrap\"><br /></td></tr><tr><td class=\"prnpr2 prnpl2 prnvab prnsbtb1 prnrbrb1 prnsbbb1 prnsblb1\" colspan=\"1\" rowspan=\"1\" nowrap=\"nowrap\"><p class=\"prnml4\"><span class=\"prnews_span\">- Basic and diluted loss per share (in <br />     cents)</span></p></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\" nowrap=\"nowrap\"><br /></td><td class=\"prngen11\" colspan=\"1\" rowspan=\"1\" nowrap=\"nowrap\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>(2.54)</b></span></p></td><td class=\"prngen11\" colspan=\"1\" rowspan=\"1\" nowrap=\"nowrap\"><p class=\"prnml4\"><span class=\"prnews_span\">(1.01)</span></p></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\" nowrap=\"nowrap\"><p class=\"prnml4\"><span class=\"prnews_span\">152</span></p></td></tr></table></div><p>The Company delivered significant year-on-year increase in revenue by 891% to <money>S$0.8 million</money> in FY2025, primarily due to delivery of a direct laser writer to a customer in <location value=\"LC/tw\" idsrc=\"xmltag.org\" >Taiwan</location>, as announced by the Company on <chron>24 September 2025</chron>, enabling metalens prototyping and fabrication in the region's semiconductor supply chain, as well as higher sales of metalenses and modules to customers globally, to facilitate customers' evaluation of metalens solutions and integration into their applications.</p><p>The net loss for FY2025 of <money>S$5.4 million</money> was primarily attributable to the following areas:</p><p>(i) <b>Expenses incurred as the Group seeks platforms for growth. </b>One-off professional fees of approximately <money>S$2.4 million</money> was incurred in FY2025, in connection with the Company's listing on Catalist of the SGX-ST in <chron>September 2025</chron>, and the proposed dual listing of the Company on the <org>NASDAQ stock exchange</org> as announced on <chron>17 November 2025</chron>;</p><p>(ii) Approximately <money>S$1 million</money> in non-cash expenses including finance expenses and depreciation and amortisation; and</p><p>(iii) <b>Enhanced research and development efforts</b>. Research and development expenses of approximately <money>S$1.8 million</money> was incurred in FY2025 in connection with and to drive new product launches, including the launch of the Group's latest proprietary metalens-powered consumer electronics prototypes and generation-2 products at the recently held CES 2026, which are expected to further strengthen the Group's competitive position, in view of the strong customer feedback and traction.</p><p><b><i>Positioning the Group for growth</i></b></p><p>As part of its succession planning and strategic expansion plans, the Group has also appointed Mr <person>Aloysius Chua Hao Peng</person> (\"<b>Aloysius</b>\") as Executive Director and Chief Executive Officer, to further drive and lead strategic initiatives and growth of the Group's 4 business groups encompassing:</p><p><b>(i) </b><b>Metalens equipment<br /></b>- Focuses on the sale of advanced metalens production machines, including the direct laser writer, metalens automatic tester, and metalens automatic assembler</p><p><b>(ii) </b><b>Metalens foundry<br /></b>- Manufacturing and fabrication of customised metalenses, including in <location value=\"LC/us\" idsrc=\"xmltag.org\" >the United States</location> as a strategic growth base, enabling the Group to provide its metalens design &amp; manufacturing expertise to world class clients and partners across <location value=\"LC/us\" idsrc=\"xmltag.org\" >the United States</location> in the fields of 5G smart phones, data communications, data centres, fiber optics, AI semiconductor manufacturing, and consumer electronics</p><p><b>(iii) </b><b>Metalens products<br /></b>- Design and development of the IoT powered products specifically the metalens 5G smartphone, pico projectors, and smart glasses incorporating metalens with 3D gesture recognition</p><p><b>(iv) </b><b><org >MetaOptics</org> artificial intelligence (\"AI\")<br /></b>- Development of 3D biometric, gesture recognition, imaging and IoT algorithms to optimise the implementation and performance of metalens technology</p><p>Mr Thng Chong Kim, as Executive Chairman, continues to oversee management performance, strategic planning and business development, including the recent expansion to <location value=\"LC/us\" idsrc=\"xmltag.org\" >the United States</location> with the recent incorporation of the subsidiary in <location value=\"LC/us\" idsrc=\"xmltag.org\" >the United States</location>, and membership in Stanford Engineering's <org>SystemX Alliance</org> program, supporting the Group's strategy to deliver high-performance metaoptics solutions to customers across <location value=\"LR/nam\" idsrc=\"xmltag.org\" >North America</location>.</p><p>The Group remains well-capitalised, with a cash balance of approximately <money>S$2.9 million</money> and <money>S$4.8 million</money> unutilised from the net proceeds raised in connection with the IPO and placement exercise undertaken in <chron>December 2025</chron>, respectively, providing a strong cash base totalling <money>S$8.8 million</money> allowing the Group to execute its commercial rollout globally and support customers' requirements with high performance metalens solutions.</p><p><b><span id=\"spanHghlt4a31\">By Order of the Board</span></b></p><p>Thng Chong Kim<br />Executive Chairman<br /><chron>28 February 2026</chron></p><p><u><b>About <org >MetaOptics Ltd</org></b></u></p><p><org >MetaOptics Ltd</org> (Catalist: 9MT) is a leading-edge semiconductor optics company pioneering glass-based metalens solutions enhanced by AI-driven image processing. Using advanced optical design and a scalable 12-inch DUV lithography process, it powers next-generation applications in CPO, mobile, AR VR, automotive and other emerging markets. Headquartered in <location value=\"LC/sg\" idsrc=\"xmltag.org\" >Singapore</location>, <org >MetaOptics</org> aims to deliver high-performance optics with the reliability and scalability demanded by today's most innovative technology brands. Find out more at www.metaoptics.sg.</p>\n\n\n\n<p id=\"PURL\"><img title=\"Cision\" width=\"12\" height=\"12\" alt=\"Cision\" src=\"https://edge.prnewswire.com/c/img/favicon.png?sn=CN98449&amp;sd=2026-02-28\" /> View original content:https://www.prnewswire.com/news-releases/newly-listed-metaoptics-ltd-delivers-strong-year-on-year-revenue-growth-of-891-and-remains-well-capitalised-for-growth-with-cash-position-of-s8-8-million-302700170.html</p><p>SOURCE <org >METAOPTICS LTD</org></p></div>\n",
            "link": "https://www.fidelity.com/news/article/technology/202602280621PR_NEWS_USPR_____CN98449",
            "pub_date": "2026-02-28 19:21:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        }
    ]
}