{
    "data": [
        {
            "title": "Intapp Stock: A Deep Dive Into Analyst Perspectives (9 Ratings)",
            "description": "\n<p>9 analysts have shared their evaluations of <org value=\"INTA.NaE\" idsrc=\"xmltag.org\" >Intapp</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='INTA' fmr-param-security-type='Equity'>( INTA )</span> during the recent three months, expressing a mix of bullish and bearish perspectives.</p>\n<p>The following table summarizes their recent ratings, shedding light on the changing sentiments within the past 30 days and comparing them to the preceding months.</p>\n<table>\n<thead>\n<tr>\n<th></th>\n<th align=\"right\"><strong>Bullish</strong></th>\n<th align=\"right\"><strong>Somewhat Bullish</strong></th>\n<th align=\"right\"><strong>Indifferent</strong></th>\n<th align=\"right\"><strong>Somewhat Bearish</strong></th>\n<th align=\"right\"><strong>Bearish</strong></th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td><strong>Total Ratings</strong></td>\n<td align=\"right\">2</td>\n<td align=\"right\">1</td>\n<td align=\"right\">4</td>\n<td align=\"right\">2</td>\n<td align=\"right\">0</td>\n</tr>\n<tr>\n<td><strong>Last 30D</strong></td>\n<td align=\"right\">1</td>\n<td align=\"right\">0</td>\n<td align=\"right\">1</td>\n<td align=\"right\">0</td>\n<td align=\"right\">0</td>\n</tr>\n<tr>\n<td><strong>1M Ago</strong></td>\n<td align=\"right\">1</td>\n<td align=\"right\">1</td>\n<td align=\"right\">2</td>\n<td align=\"right\">1</td>\n<td align=\"right\">0</td>\n</tr>\n<tr>\n<td><strong>2M Ago</strong></td>\n<td align=\"right\">0</td>\n<td align=\"right\">0</td>\n<td align=\"right\">0</td>\n<td align=\"right\">1</td>\n<td align=\"right\">0</td>\n</tr>\n<tr>\n<td><strong>3M Ago</strong></td>\n<td align=\"right\">0</td>\n<td align=\"right\">0</td>\n<td align=\"right\">1</td>\n<td align=\"right\">0</td>\n<td align=\"right\">0</td>\n</tr>\n</tbody>\n</table>\n\n<p>Insights from analysts' 12-month price targets are revealed, presenting an average target of <money>$39.67</money>, a high estimate of <money>$58.00</money>, and a low estimate of <money>$25.00</money>. A 14.8% drop is evident in the current average compared to the previous average price target of <money>$46.56</money>. </p>\n<p><img src=\"https://www.benzinga.com/files/images/story/2026/1772136030_0_0.png\" alt=\"price target chart\" /></p>\n\n<h2>Breaking Down Analyst Ratings: A Detailed Examination</h2>\n<p>The standing of <org value=\"INTA.NaE\" idsrc=\"xmltag.org\" >Intapp</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='INTA' fmr-param-security-type='Equity'>( INTA )</span> among financial experts is revealed through an in-depth exploration of recent analyst actions. The summary below outlines key analysts, their recent evaluations, and adjustments to ratings and price targets.</p>\n<table>\n<thead>\n<tr>\n<th>Analyst</th>\n<th>Analyst Firm</th>\n<th>Action Taken</th>\n<th>Rating</th>\n<th>Current Price Target</th>\n<th>Prior Price Target</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td><person>Patrick Moley</person></td>\n<td>Piper Sandler</td>\n<td>Lowers</td>\n<td>Neutral</td>\n<td><money>$25.00</money></td>\n<td><money>$33.00</money></td>\n</tr>\n<tr>\n<td><location>Parker Lane</location></td>\n<td>Stifel</td>\n<td>Lowers</td>\n<td>Buy</td>\n<td><money>$35.00</money></td>\n<td><money>$40.00</money></td>\n</tr>\n<tr>\n<td><person>Steven Enders</person></td>\n<td>Citigroup</td>\n<td>Lowers</td>\n<td>Neutral</td>\n<td><money>$36.00</money></td>\n<td><money>$49.00</money></td>\n</tr>\n<tr>\n<td><person>Saket Kalia</person></td>\n<td>Barclays</td>\n<td>Lowers</td>\n<td>Underweight</td>\n<td><money>$35.00</money></td>\n<td><money>$46.00</money></td>\n</tr>\n<tr>\n<td><person>Alexei Gogolev</person></td>\n<td>JP Morgan</td>\n<td>Lowers</td>\n<td>Overweight</td>\n<td><money>$58.00</money></td>\n<td><money>$70.00</money></td>\n</tr>\n<tr>\n<td><person>Patrick Moley</person></td>\n<td>Piper Sandler</td>\n<td>Lowers</td>\n<td>Neutral</td>\n<td><money>$33.00</money></td>\n<td><money>$42.00</money></td>\n</tr>\n<tr>\n<td><location>Parker Lane</location></td>\n<td>Stifel</td>\n<td>Lowers</td>\n<td>Buy</td>\n<td><money>$40.00</money></td>\n<td><money>$50.00</money></td>\n</tr>\n<tr>\n<td><person>Saket Kalia</person></td>\n<td>Barclays</td>\n<td>Raises</td>\n<td>Underweight</td>\n<td><money>$46.00</money></td>\n<td><money>$43.00</money></td>\n</tr>\n<tr>\n<td><person>Steven Enders</person></td>\n<td>Citigroup</td>\n<td>Raises</td>\n<td>Neutral</td>\n<td><money>$49.00</money></td>\n<td><money>$46.00</money></td>\n</tr>\n</tbody>\n</table>\n\n<h3>Key Insights:</h3>\n<ul>\n<li><strong>Action Taken:</strong> In response to dynamic market conditions and company performance, analysts update their recommendations. Whether they 'Maintain', 'Raise', or 'Lower' their stance, it signifies their reaction to recent developments related to <org value=\"INTA.NaE\" idsrc=\"xmltag.org\" >Intapp</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='INTA' fmr-param-security-type='Equity'>( INTA )</span>. This insight gives a snapshot of analysts' perspectives on the current state of the company.</li>\n<li><strong>Rating:</strong> Providing a comprehensive analysis, analysts offer qualitative assessments, ranging from 'Outperform' to 'Underperform'. These ratings reflect expectations for the relative performance of <org value=\"INTA.NaE\" idsrc=\"xmltag.org\" >Intapp</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='INTA' fmr-param-security-type='Equity'>( INTA )</span> compared to the broader market.</li>\n<li><strong>Price Targets:</strong> Analysts navigate through adjustments in price targets, providing estimates for <org value=\"INTA.NaE\" idsrc=\"xmltag.org\" >Intapp's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='INTA' fmr-param-security-type='Equity'>( INTA )</span> future value. Comparing current and prior targets offers insights into analysts' evolving expectations.</li>\n</ul>\n<p>To gain a panoramic view of <org value=\"INTA.NaE\" idsrc=\"xmltag.org\" >Intapp's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='INTA' fmr-param-security-type='Equity'>( INTA )</span> market performance, explore these analyst evaluations alongside essential financial indicators. Stay informed and make judicious decisions using our Ratings Table.</p>\n<p><strong>Stay up to date on <org value=\"INTA.NaE\" idsrc=\"xmltag.org\" >Intapp</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='INTA' fmr-param-security-type='Equity'>( INTA )</span> analyst ratings.</strong></p>\n<p>If you are interested in following small-cap stock news and performance you can start by tracking it here.</p>\n<h2>All You Need to Know About Intapp</h2>\n<p><org value=\"INTA.NaE\" idsrc=\"xmltag.org\" >Intapp Inc</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='INTA' fmr-param-security-type='Equity'>( INTA )</span> is a provider of industry-specific, cloud-based software solutions for the professional and financial services industry. It empowers private capital,g, legal, accounting, and consulting firms with the technology needed to meet rapidly changing client, investor, and regulatory requirements. Geographically, it derives a majority of its revenue from <location value=\"LC/us\" idsrc=\"xmltag.org\" >the United States</location> and also has a presence in the <location value=\"LC/gb\" idsrc=\"xmltag.org\" >United Kingdom</location> and the Rest of the world.</p>\n<h3>A Deep Dive into Intapp's Financials</h3>\n<p><strong>Market Capitalization Analysis:</strong> The company exhibits a lower market capitalization profile, positioning itself below industry averages. This suggests a smaller scale relative to peers.</p>\n<p><strong>Revenue Growth:</strong> <org value=\"INTA.NaE\" idsrc=\"xmltag.org\" >Intapp's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='INTA' fmr-param-security-type='Equity'>( INTA )</span> remarkable performance in 3M is evident. As of <chron>31 December, 2025</chron>, the company achieved an impressive revenue growth rate of <strong>15.67%</strong>. This signifies a substantial increase in the company's top-line earnings. When compared to others in the Information Technology sector, the company faces challenges, achieving a growth rate lower than the average among peers.</p>\n<p><strong>Net Margin:</strong> <org value=\"INTA.NaE\" idsrc=\"xmltag.org\" >Intapp's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='INTA' fmr-param-security-type='Equity'>( INTA )</span> net margin surpasses industry standards, highlighting the company's exceptional financial performance. With an impressive <strong>-4.23%</strong> net margin, the company effectively manages costs and achieves strong profitability.</p>\n<p><strong>Return on Equity (ROE):</strong> <org value=\"INTA.NaE\" idsrc=\"xmltag.org\" >Intapp's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='INTA' fmr-param-security-type='Equity'>( INTA )</span> financial strength is reflected in its exceptional ROE, which exceeds industry averages. With a remarkable ROE of <strong>-1.32%,</strong> the company showcases efficient use of equity capital and strong financial health.</p>\n<p><strong>Return on Assets (ROA):</strong> The company's ROA is a standout performer, exceeding industry averages. With an impressive ROA of <strong>-0.73%,</strong> the company showcases effective utilization of assets.</p>\n<p><strong>Debt Management:</strong> <org value=\"INTA.NaE\" idsrc=\"xmltag.org\" >Intapp's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='INTA' fmr-param-security-type='Equity'>( INTA )</span> debt-to-equity ratio is below industry norms, indicating a sound financial structure with a ratio of <strong>0.04</strong>.</p>\n<h2>The Basics of Analyst Ratings</h2>\n<p>Within the domain of banking and financial systems, analysts specialize in reporting for specific stocks or defined sectors. Their work involves attending company conference calls and meetings, researching company financial statements, and communicating with insiders to publish &quot;analyst ratings&quot; for stocks. Analysts typically assess and rate each stock once per quarter.</p>\n<p>Some analysts publish their predictions for metrics such as growth estimates, earnings, and revenue to provide additional guidance with their ratings. When using analyst ratings, it is important to keep in mind that stock and sector analysts are also human and are only offering their opinions to investors.</p>\n<p>This article was generated by Benzinga's automated content engine and reviewed by an editor.</p>\n",
            "link": "https://www.fidelity.com/news/article/technology/202602261500BENZINGAFULLNGTH50906072",
            "pub_date": "2026-02-27 04:00:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "LlamaLab Asks Court to Throw Out Epic Systems Lawsuit And to Sever Unrelated Companies",
            "description": "\n<div class=\"xn-content\">\n<p><span class=\"legendSpanClass\"><location value=\"LU/us.ny.nyc\" idsrc=\"xmltag.org\" >NEW YORK</location></span>, <span class=\"legendSpanClass\"><chron>Feb. 26, 2026</chron></span> /PRNewswire/ -- <u><org>LlamaLab, Inc</org></u>. and its founder <person>Shere Saidon</person> today filed legal motions asking a federal court to dismiss a lawsuit brought by Epic Systems, the massive software company that dominates the electronic health records industry. The motions argue that Epic bypassed its own contractual dispute resolution obligations and wrongly lumped LlamaLab into a case alongside over a dozen unrelated defendants. LlamaLab categorically denies all allegations.</p>\n    <div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder1\">\n                <p>\n\n                    <img src=\"https://mma.prnewswire.com/media/2921586/llamalab_Logo.jpg\" title=\"https://www.llamalab.ai\" alt=\"https://www.llamalab.ai\" />\n\n                </p>\n    </div>\n<p>LlamaLab was founded with a single mission: providing patients and their legal teams with fast, secure access to medical records in compliance with all applicable laws. The company helps victims of catastrophic injuries and corporate negligence retrieve the critical records they need to build their cases and get the financial relief they deserve.</p><p>\"Patient privacy has always come first. We have never sold, stolen, or misused patient data, and we never will,\" Saidon said. \"This lawsuit isn't about protecting patients, it's about a gatekeeper protecting its dominance by targeting companies that try to make it easier for patients to retrieve their own medical records. It is a transparent attempt by a market-dominant player to crush potential competition and protect its own revenue streams.\"</p><p>\"Epic points to speed, innovation, friendship, and AI as evidence of wrongdoing,\" Saidon added. \"Patients shouldn't have to put up with a system that treats efficiency as a threat.\"</p><p>Epic's 90-page complaint sweeps LlamaLab into a case with over a dozen other defendants. These defendants span three entirely separate groups, operating in different states, on different timelines, with different business models. LlamaLab has no connection to any of the other companies and individuals named in the case. As detailed in the filings, these groups had \"no coordinated plan, no conspiracy, no communication with one another,\" and no business relationship of any kind. Epic has also reserved the right to add up to 100 more unnamed defendants to the case.</p><p>Crucially, Epic grouped LlamaLab into the same lawsuit as an individual with a federal criminal conviction for conspiracy to defraud <location value=\"LC/us\" idsrc=\"xmltag.org\" >the United States</location> and a bar from the <org>SEC</org>. LlamaLab has never met, spoken to, or worked with that individual or any of the other defendants. The filings warn against Epic's attempt to manufacture \"guilt by association\" and the risk that a jury would unfairly hold evidence about one defendant against another.</p><p>Epic's decision to broadcast unfounded allegations does not change the facts. \"LlamaLab is an independent company with no involvement with Epic or their networks, and we should never have been dragged into this case,\" Saidon said.</p><p>LlamaLab is not a member of the Carequality or TEFCA networks at the center of Epic's complaint. No one from Epic or any of the hospital co-plaintiffs ever contacted LlamaLab about any concern before filing this lawsuit. The company learned of the allegations when they were made public in federal court.</p><p>While LlamaLab itself does not participate in these networks, the filings highlight how Epic is breaking its own rules. Network participants like Epic and its co-plaintiffs are contractually bound to resolve disputes through dedicated governance boards before filing lawsuits. Epic started that process but abandoned it. Under the agreements Epic signed, bypassing these procedures is itself a breach of contract. Epic agreed to this framework, and cannot simply abandon the rules just because the process isn't going its way.</p><p>\"Epic essentially concedes it is attempting to avoid dispute resolution procedures it cannot control and sidestep independent boards it does not respect,\" Saidon said.</p><p>LlamaLab continues to operate and remains committed to helping patients access their medical records. The company intends to defend itself vigorously and looks forward to clearing its name in court. A hearing on the motions will be scheduled before Judge <person>Fernando M. Olguin</person> in the <org>U.S. District Court for the Central District of California</org> .</p><p><u>Click here</u> for more information or to read the court filings.</p><p><b>About LlamaLab</b></p><p><org>LlamaLab, Inc.</org> is a technology company founded by <person>Shere Saidon</person> that provides fast, secure, and authorized retrieval of medical records for patients and law firms representing victims of catastrophic injuries, medical malpractice, and corporate negligence. The company was built to help injured patients and their attorneys get the evidence they need to fight for the relief they deserve.</p>\n\n\n\n<p id=\"PURL\"><img title=\"Cision\" width=\"12\" height=\"12\" alt=\"Cision\" src=\"https://edge.prnewswire.com/c/img/favicon.png?sn=FL97132&amp;sd=2026-02-26\" /> View original content to download multimedia:https://www.prnewswire.com/news-releases/llamalab-asks-court-to-throw-out-epic-systems-lawsuit-and-to-sever-unrelated-companies-302698923.html</p><p>SOURCE LLamaLab</p></div>\n",
            "link": "https://www.fidelity.com/news/article/technology/202602261504PR_NEWS_USPR_____FL97132",
            "pub_date": "2026-02-27 04:04:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Hydaway Digital Closes $1.2 Million Private Placement Financing; Shares up 9%, Hit Fresh 52 Week Highs",
            "description": "\n<p><chron>03:12 PM EST</chron>, <chron>02/26/2026</chron> (MT Newswires) -- <org >Hydaway Digital</org> (HIDE.V) was at last look up 9%, but off fresh 52 week highs hit earlier, after saying before the open of trade Thursday it closed its non-brokered private placement financing of 4.8 million units at a price of <money>$0.25</money> each for gross proceeds of up to <money>$1.2 million</money>.</p><p>The company said that each unit consists of a share and a share purchase warrant, with each warrant exercisable at <money>$0.40</money> per share for a period of one year from the date of issue.</p><p>&quot;The Company has the right to accelerate the expiry date if, at any time, the Shares trade at a price equal to or greater than <money>$0.75</money> for 5 consecutive trading days,&quot; said the company. &quot;In the event of acceleration, the expiry date will be accelerated to a date that is 30 days after the Company issues the acceleration notice through a news release, provided that the acceleration notice is issued within 10 business days after the end of the particular 5-Day Period.&quot;</p><p>The company also said that <person>Karl Kottmeier</person>, the chief executive officer and a director of the company subscribed for 110,000 units, contributing <money>$27,500</money> to the offering, through a company, <org>Madjak Management Ltd.</org></p><p>The proceeds will be used to continue to develop the company's GPU rental platform as well as for general working capital purposes.</p><p>The company's shares were last seen up <money>$0.05</money> at <money>$0.60</money> on the <org>TSX Venture Exchange</org>, having earlier touched as high as <money>$0.75</money>.</p><p>Price: 0.60, Change: +0.05, Percent Change: +9.09</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602261512MIDNIGHTUSEQUITY_A3574016",
            "pub_date": "2026-02-27 04:12:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Broadcom Poised to Benefit From AI-Driven Sales in Fiscal Q1, Oppenheimer Says",
            "description": "\n<p><chron>03:14 PM EST</chron>, <chron>02/26/2026</chron> (MT Newswires) -- <org value=\"AVGO.NaE\" idsrc=\"xmltag.org\" >Broadcom</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AVGO' fmr-param-security-type='Equity'>( AVGO )</span>  is expected to benefit from accelerating AI-related sales in fiscal Q1, driven by hyperscalers and cloud service providers developing large frontier Large Language Models, Oppenheimer said.</p><p>The brokerage said in a Wednesday note that it expects AI-related sales to rise about 30% quarter over quarter in Q1, accelerating from 25% in fiscal Q4 and 17% in fiscal Q3. This could provide upside to fiscal Q1 street estimates of <money>$19.2 billion</money> in sales and <money>$2.02</money> in earnings per share.</p><p>The investment firm said that <org value=\"AVGO.NaE\" idsrc=\"xmltag.org\" >Broadcom's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AVGO' fmr-param-security-type='Equity'>( AVGO )</span> dominant custom Application-Specific Integrated Circuit, or ASIC, and networking franchises underpin a growing backlog of more than <money>$162 billion</money>. Of that, roughly <money>$73 billion</money> is related to AI orders.</p><p>The brokerage noted that <org value=\"AVGO.NaE\" idsrc=\"xmltag.org\" >Broadcom's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AVGO' fmr-param-security-type='Equity'>( AVGO )</span> secular growth is supported by data center AI infrastructure, networking and expanding TPU workloads. The investment firm said the factors are expected to drive steady cash flow for the company.</p><p>Oppenheimer reiterated its outperform rating and <money>$450</money> price target on the stock.</p><p>Shares of <org value=\"AVGO.NaE\" idsrc=\"xmltag.org\" >Broadcom</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AVGO' fmr-param-security-type='Equity'>( AVGO )</span> were down 4.6% in recent Thursday trading.</p><p>Price: 316.93, Change: -15.38, Percent Change: -4.63</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602261514MIDNIGHTUSEQUITY_A3574025",
            "pub_date": "2026-02-27 04:14:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Top Midday Gainers",
            "description": "\n<p><chron>01:29 PM EST</chron>, <chron>02/26/2026</chron> (MT Newswires) -- <org value=\"EFXT.NaE\" idsrc=\"xmltag.org\" >Enerflex</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='EFXT' fmr-param-security-type='Equity'>( EFXT )</span>  said late on Wednesday its preliminary 2026 outlook &quot;reflects steady demand across its business lines and geographic regions&quot; while reporting a swing to a Q4 net loss, and it signed a deal to divest the majority of its operations in the <location value=\"LR/asp\" idsrc=\"xmltag.org\" >Asia Pacific</location> region.</p><p>Shares jumped 16% as intraday trading volume climbed to more than 436,000 from a daily average of about 447,000.</p><p><org value=\"PVLA.NaE\" idsrc=\"xmltag.org\" >Palvella Therapeutics</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='PVLA' fmr-param-security-type='Equity'>( PVLA )</span>  said late Wednesday it priced an upsized offering of 1.6 million shares at <money>$125</money> each and granted underwriters an option to purchase up to 240,000 additional shares, targeting gross proceeds of about <money>$200 million</money>.</p><p>Shares advanced 13% as intraday trading volume jumped to over 769,000 from a daily average of roughly 292,000.</p><p><org value=\"NVAX.NaE\" idsrc=\"xmltag.org\" >Novavax</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NVAX' fmr-param-security-type='Equity'>( NVAX )</span>  shares rose 18% amid heavy trading on Thursday after the company swung to a profit in Q4, with revenue exceeding analysts' expectations.</p><p>More than 16.9 million shares of the company traded intraday compared with a daily average of about 4.3 million.</p><p>Price: 23.17, Change: +3.31, Percent Change: +16.64</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/international/202602261329MIDNIGHTUSEQUITY_A3573962",
            "pub_date": "2026-02-27 02:29:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Fed's Goolsbee forecasts several more rate cuts this year, but not soon",
            "description": "\n<p><chron>Feb 26</chron> (Reuters) - Chicago Federal Reserve President <person>Austan Goolsbee</person> said on Thursday his forecast for several interest-rate cuts later this year makes him one of the more &quot;optimistic&quot; Fed policymakers, but said he wants the Fed to be &quot;careful&quot; in doing so because it could overheat the economy and inflation.   </p>\n<p>&quot;I have some confidence rates can come down several more times this year in 2026,&quot; Goolsbee said in an interview on Fox News. &quot;I just don't want to front load it too much before we actually have the evidence that the inflation is headed&quot; back down to the Fed's 2% goal. </p>\n<p></p>\n<p> (Reporting by <person>Ann Saphir</person>; Editing by <person>Chris Reese</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/us-economy/202602261450RTRSNEWSCOMBINED_KBN3PG2GZ-OUSBS_1",
            "pub_date": "2026-02-27 03:50:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Odds of early Warsh-led Fed rate cuts slide with bullish outlook",
            "description": "<p><location value=\"LU/us.dc.wash\" idsrc=\"xmltag.org\" >WASHINGTON</location>, <chron>Feb 26</chron> (Reuters) - Federal Reserve chair nominee <person>Kevin Warsh's</person> path to out-of-the-gate interest rate cuts in alignment with President <person>Donald Trump's</person> expectations could be narrowing amid emerging bullishness about the U.S. economy, growing CEO confidence in the outlook, and investors keying off a hawkish shift among the central bank's policymakers.</p>\n<p><org>The International Monetary Fund</org> said on Wednesday that with expected U.S. growth rising to 2.4% this year from 2.2% last year, the unemployment rate likely hovering near 4%, and inflation falling gradually, the Fed would have &quot;only modest scope to lower the policy rate over the coming year&quot; through a single quarter-percentage-point cut.</p>\n<p>A new Conference Board CEO survey, meanwhile, saw a sharp jump in the outlook for both the wider economy and within each leader's industry, with little sense that large rounds of layoffs were in the offing and firms passing through price increases from the Trump administration's import tariffs - a combination that could make it harder to justify rate cuts.</p>\n<p>Investors, meanwhile, have pushed back their bets on the timing of an initial Warsh-led rate cut, to the Fed's <chron>July 28-29</chron> meeting from the <chron>June 16-17</chron> gathering. Though his nomination has not been formally submitted to the <org>Senate</org>, Warsh is expected to be confirmed in time for the June meeting, with current Fed Chair <person>Jerome Powell's</person> leadership term ending in May.</p>\n<p>The improved outlook may be good for the economy, but it could leave Warsh in the same bind as Powell, with data and his colleagues pulling in one direction and the <org>White House</org> pulling in another.</p>\n<p>&quot;The Fed's reaction function has shifted slightly more hawkish,&quot; Natixis CIB economists <person>Christopher Hodge</person> and <person>Selin Aker</person> wrote in a note, concluding the central bank could only make two quarter-percentage-point rate cuts this year, rather than the three they previously expected.</p>\n<p>MIRAN SAYS BIG DROP IN RATES STILL POSSIBLE IN 2026</p>\n<p>The U.S. central bank's next meeting is scheduled for <chron>March 17-18</chron>, when its policy-setting Federal Open Market Committee is expected to hold the benchmark interest rate in the 3.50%-3.75% range. New quarterly economic and rate projections also will be released at the end of that meeting.</p>\n<p>In December, the only central bank official with a rate outlook close to the steep cuts Trump wants was Fed Governor <person>Stephen Miran</person>, the former head of the <location>Trump White House's</location> <org>Council of Economic Advisers</org>. Miran saw the Fed's policy rate falling to as low as the 2.00%-2.25% range in 2026. The median expectation among Miran's colleagues, by contrast, saw just one quarter-percentage-point cut as likely appropriate.</p>\n<p>Nearly three months later, and after a strong January employment report, Miran on Thursday told the &quot;Mornings with Maria&quot; program on Fox Business that he still feels rates could fall a full percentage point this year through four 25-basis-point cuts, ideally sooner than later.</p>\n<p>His outlook is partly based on his expectation for a &quot;profoundly disinflationary&quot; artificial intelligence boost to productivity, a &quot;supply shock&quot; that Warsh has also said should allow for lower rates.</p>\n<p>&quot;I really do not think that we have an inflation problem,&quot; despite recent inflation readings a point above the central bank's 2% target, said Miran, whose term as a Fed governor has technically expired, but who can continue to fill the job until a replacement is named. Absent some other departure from the Fed's seven-member <org>Board of Governors</org>, Miran's seat would be needed for Warsh to eventually come aboard.</p>\n<p>WARSH FACES POSSIBLE DILEMMA</p>\n<p>The minutes of the Fed's <chron>January 27-28</chron> meeting showed little support yet for relying on AI-optimism to recast monetary policy. Staff presentations suggested a small boost in the economy's potential may be developing - the &quot;supply shock&quot; Miran has mentioned, but only in a measured dose - though with demand still strong enough to sustain pressure on prices.</p>\n<p>The minutes also cited unexpected comments that several policymakers were open to the possibility that the next rate move could be a hike. In addition, Fed Governor <person>Christopher Waller</person>, who joined Miran in dissenting in favor of a cut at the meeting in January, said this week that if recent strong job growth is repeated, &quot;it may be appropriate to hold the FOMC's policy rate at current levels.&quot;</p>\n<p>The U.S. employment report for February is due to be released on <chron>March 6</chron>.</p>\n<p>A combination of sticky inflation, a steady unemployment rate, and continued economic growth would in many ways be a comforting outcome for the Fed. Policymakers generally agree that inflation will decline and anticipate the combination of slow job growth and low rates of layoffs will yield a roughly steady unemployment rate. As long as that outlook continues, and absent any sense that public expectations about inflation are starting to shift higher, there would be little motivation to do anything other than wait.</p>\n<p>Such an outcome could present a dilemma for Warsh, who has laid out arguments for why rates should fall and now will have to contend with a strong-willed and publicly demonstrative president who has taken the Fed chief nominee at his word. Trump said earlier this month that he had not asked Warsh to lower rates, but felt it was clear what his nominee would do.</p>\n<p>Trump has clashed with Powell repeatedly over the president's demands for deep rate cuts, but said of Warsh last month: &quot;I don't want to ask him that question. I think it's inappropriate ... I want to keep it nice and pure. But he certainly wants to cut rates.&quot;</p>\n<p>The president also told <org>NBC News</org> he had &quot;not much&quot; doubt rates would fall. &quot;We're way high,&quot; he said. Trump, who has linked his call for lower rates to hopes of financing federal government debt more cheaply and lowering costs for home mortgages, has voiced little concern about inflation that he feels has disappeared.</p>\n<p>However, with the economy currently growing beyond estimates of its potential and inflation showing little recent progress toward the Fed's target, there's no sense of urgency at the central bank to cut rates, particularly not as steeply as Trump or Miran have suggested.</p>\n<p>Trump's State of the Union speech to <org>Congress</org> earlier this week highlighted that paradox, as he trumpeted the good things that he believes have happened and those that are still to come. Many analysts agree a combination of fiscal stimulus in the form of tax cuts, ongoing deregulation, and the loose credit conditions supported by Fed rate cuts last year could spell upside for the economy - and make further reductions in borrowing costs all the less likely.</p>\n<p></p>\n<p>(Reporting by Howard Schneider;Editing by <person>Dan Burns</person> and <person>Paul Simao</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/us-economy/202602261456RTRSNEWSCOMBINED_KBN3PG2H9-OUSBS_1",
            "pub_date": "2026-02-27 03:56:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Apollo Recognized as the Top AI-Native Sales Intelligence Platform in G2's 2026 Best Software Awards",
            "description": "\n<div class=\"xn-content\">\n<p class=\"prntac\"><i>G2 rankings underscore Apollo</i><i>'s position as the leading agentic end-to-end GTM platform powering revenue teams worldwide</i></p><p><span class=\"legendSpanClass\"><location value=\"LU/us.ca.sanfrn\" idsrc=\"xmltag.org\" >SAN FRANCISCO</location></span>, <span class=\"legendSpanClass\"><chron>Feb. 26, 2026</chron></span> /PRNewswire/ -- Apollo.io, a leading AI-native go-to-market platform, today announced it has been ranked across a number of G2's 2026 Best Software Awards. This includes prominent rankings in the following five categories:</p>\n    <div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder1\">\n                <p>\n\n                    <img src=\"https://mma.prnewswire.com/media/2876231/Apollo_Logo.jpg\" title=\"Apollo (PRNewsfoto/Apollo.io)\" alt=\"Apollo (PRNewsfoto/Apollo.io)\" />\n\n                </p>\n    </div>\n<ul type=\"disc\"><li>#13 for Best Sales Software (out of 446 companies)</li><li>#27 for Best Marketing and Digital Advertising (out of 921 companies)</li><li>#36 for Best Collaboration and Productivity (out of 503 companies)</li><li>#44 for Best AI Software Products (out of 241 companies)</li><li>#80 for Best Global Software (out of 3,938 companies)</li></ul><p>Notably, Apollo is the only sales intelligence platform named in this year's Best AI Software Products list, a testament to the company's leadership in redefining modern go-to-market.</p><p>\"As sales cycles accelerate, revenue teams can't afford to be constrained by fragmented tech stacks. Modern teams need a unified GTM operating system built for speed and precision,\" said <person>Matt Curl</person>, CEO of Apollo.io. \"Apollo's mission is to empower businesses of any size with the industry's first comprehensive AI-native platform. We're taking data into action and have become the 'operating system' for hundreds of thousands of revenue-generating teams worldwide. This recognition from G2 reflects the impact we're delivering to our customers, and reinforces the momentum we're building across the GTM ecosystem.\"</p><p>Backed by nearly 10,000 customer reviews, the most of any sales intelligence company, G2 recognizes Apollo for its ease of use and best-in-class features, enabling sales and revenue teams to execute and drive impact from one intelligent operating system. Apollo AI actively drives workflows across the sales funnel — from identifying accounts to drafting outreach to supporting deal management.</p><p>Additionally, G2's \"The State of AI Sales Intelligence in Prospecting: 2026 Industry Report\" recognized Apollo with its highest rating of 4.7/5. The report stated that Apollo is, \"Focused on AI-guided account discovery, predictive scoring, and workflow-native prospecting experiences that integrate intelligence directly into execution.\"</p><p>According to G2 Data, 60% of B2B software teams already use AI across their sales processes. At that level, AI sales intelligence tools aren't experimental; they're expected to influence how teams prioritize, sequence, and execute. Apollo is clearly positioned as a leader in this regard.</p><p>G2 is the world's largest and most trusted software marketplace, reaching over 100 million buyers annually. Its annual Best Software Awards rank the world's best software companies and products based on authentic, timely reviews from real users.</p><p>\"As buyers increasingly shift to AI-driven research to discover software solutions, being recommended in the 'answer moment' must be earned with credible proof,\" said Godard Abel, co-founder and CEO at G2. \"Our <org>Best Software</org> Awards are grounded in trusted data from authentic customer reviews. They not only give buyers an objective, reliable guide to the products that help teams do their best work, but they're also the proof AI search platforms rely on when sourcing answers. Congratulations to this year's winners, including Apollo. Earning a spot on these lists signals real customer impact.\"</p><p>This news comes on the heels of other recent announcements validating Apollo's leadership in AI-powered GTM. Apollo was recently named to The Agentic List 2026 as a high-momentum, uptrending organization driving revenue for sales and marketing teams with agentic AI. This week, Apollo also announced the launch of its native connector for Anthropic's Claude, with which users can run outbound workflows — including identifying leads and adding them to outreach sequences — directly within a Claude conversation.</p><p>For more information on Apollo's latest AI features and integrations, visit https://www.apollo.io/ai.</p><p><b>About G2</b><b>'s Best Software Awards<br /></b>G2's 2026 Best Software Awards feature dozens of award lists, ranking software vendors and products using G2's proprietary algorithm. The results are based on G2's verified user reviews and publicly available market presence data. To be eligible for the Best Software Awards, a software company or product must have received at least 10 approved reviews during the 2025 calendar year. Scores reflect only data from reviews submitted during this evaluation period.</p><p>To learn more, view G2's 2026 Best Software Awards and read more about G2's methodology.</p><p><b>About G2<br /></b>G2 is the world's largest and most trusted software marketplace. More than 100 million people annually — including employees at all Fortune 500 companies — use G2 to make smarter software decisions based on authentic peer reviews. Thousands of software and services companies of all sizes partner with G2 to build their reputation and grow their business — including Salesforce, HubSpot, Zoom, and Adobe. To learn more about where you go for software, visit www.g2.com and follow G2 on LinkedIn.</p><p><b>About Apollo</b><br />Apollo.io is the company behind the industry's first fully agentic GTM platform, transforming how revenue teams execute. Going beyond automation, Apollo's intelligent agents actively drive results across the entire sales funnel — from prospecting to deal management — all in one place. Trusted by millions of users, Apollo is making world-class go-to-market simple, intelligent, and accessible for all. Visit apollo.io to learn more.</p>\n\n\n\n<p id=\"PURL\"><img title=\"Cision\" width=\"12\" height=\"12\" alt=\"Cision\" src=\"https://edge.prnewswire.com/c/img/favicon.png?sn=NE96903&amp;sd=2026-02-26\" /> View original content to download multimedia:https://www.prnewswire.com/news-releases/apollo-recognized-as-the-top-ai-native-sales-intelligence-platform-in-g2s-2026-best-software-awards-302698910.html</p><p>SOURCE Apollo.io</p></div>\n",
            "link": "https://www.fidelity.com/news/article/technology/202602261450PR_NEWS_USPR_____NE96903",
            "pub_date": "2026-02-27 03:50:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Esri Press Most Popular Ebooks Available in the Esri Store",
            "description": "\n<p class=\"bwalignc\">\n<i>ArcGIS Users Can Now Purchase Esri Press Ebooks at a 20 Percent Discount</i>\n\n</p><ul class=\"bwlistdisc\">\n<li>\nEsri now offers best-selling <org>Esri Press</org> ebooks directly in the <org>Esri Store</org>, expanding digital access to authoritative GIS learning resources.\n\n</li>\n<li>\nCustomers include ArcGIS users; partnership with VitalSource delivers ebooks instantly to existing or newly created VitalSource Bookshelf accounts.\n\n</li>\n<li>\nEleven popular titles launch with a 20 percent discount, immediate access after purchase, and cross-device reading via VitalSource.\n\n</li>\n<li>\nArcGIS users can shop <org>Esri Press</org> ebooks in the <org>Esri Store</org>; VitalSource customers' purchased titles automatically appear in the VitalSource Bookshelf after checkout.\n\n</li>\n</ul>\n<p>    <location value=\"LU/us.ca.rednds\" idsrc=\"xmltag.org\" >REDLANDS, Calif.</location>--(BUSINESS WIRE)--\nEsri, the global leader in location intelligence is offering the top best-selling <org>Esri Press</org> ebooks directly in the <org>Esri Store</org> for the first time.<b> </b>Eleven of <org>Esri Press's</org> most popular and influential titles are now available at a 20 percent discount, including <i>The Power of Where</i>,<b> </b><i>GIS Tutorial for ArcGIS Pro 3.4</i>,<b> </b><i>Top 20 Essential Skills for ArcGIS Experience Builder</i>,<b> </b>and<b> </b><i>Getting to Know ArcGIS Enterprise</i>.\n\n</p><p>\nArcGIS users can seamlessly add <org>Esri Press</org> ebooks to the same shopping cart as their software licenses or other products. Once the transaction is complete, customers will receive immediate access to their ebooks.\n\n</p><p>\nThis new opportunity is made possible through an expanded relationship with VitalSource, the leading platform for digital course materials and study tools. Customers who already use VitalSource will find <org>Esri Press</org> titles automatically delivered to their existing Bookshelf accounts. New customers will have a VitalSource Bookshelf account created for them during the purchase process, enabling instant reading on any device.\n\n</p><p>\nAdditional titles are scheduled to be added throughout the year, expanding access to authoritative GIS learning resources for students, professionals, and organizations.\n\n</p><p>\n<b>About Esri</b>\n\n</p><p>\nEsri, the global market leader in geographic information system (GIS) software, location intelligence, and mapping, helps customers unlock the full potential of data to improve operational and business results. Founded in 1969 in <location value=\"LU/us.ca.rednds\" idsrc=\"xmltag.org\" >Redlands, California</location>, USA, Esri software is deployed in hundreds of thousands of organizations globally, including Fortune 500 companies, government agencies, nonprofit institutions, and universities. Esri has regional offices, international distributors, and partners providing local support in over 100 countries on six continents. With its pioneering commitment to geospatial technology and analytics, Esri engineers the most innovative solutions that leverage a geographic approach to solving some of the world's most complex problems by placing them in the crucial context of location. Visit us at esri.com.\n\n</p><p>\nCopyright © 2026 Esri. All rights reserved. Esri, the <org>Esri Globe</org> logo, The Science of Where, ArcGIS, esri.com, and @esri.com are trademarks, service marks, or registered marks of Esri in <location value=\"LC/us\" idsrc=\"xmltag.org\" >the United States</location>, the <org>European Union</org>, or certain other jurisdictions. Other companies and products or services mentioned herein may be trademarks, service marks, or registered marks of their respective mark owners.\n\n</p><p><img alt=\"\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20260226416345r1&amp;sid=acqr8&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\" /><span class=\"bwct31415\" /></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\">https://www.businesswire.com/news/home/20260226416345/en/</span></p>\n<p>Source: Esri</p>\n",
            "link": "https://www.fidelity.com/news/article/technology/202602261453BIZWIRE_USPR_____20260226_BW416345",
            "pub_date": "2026-02-27 03:53:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Update: WTI Crude Oil Falls as U.S.-Iran Talks Resume and a Report Showed a Outsized Rise in U.S. Inventories",
            "description": "\n<p><chron>02:39 PM EST</chron>, <chron>02/26/2026</chron> (MT Newswires) -- West Texas Intermediate (WTI) crude oil closed lower on Thursday as talks between <location value=\"LC/us\" idsrc=\"xmltag.org\" >the United States</location> and <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location> resume in <location value=\"LU/ch..geneva\" idsrc=\"xmltag.org\" >Geneva</location> while a report showed an outsized rise in U.S. oil inventories last week.</p><p>WTIcrude oil for April delivery closed down <money>US$0.21</money> to settle at <money>US$65.21</money> per barrel after trading as low as <money>US$63.60</money> during the session.  <person>April Brent</person> oil was last seen down <money>US$0.5</money> to <money>US$70.80</money>.</p><p>The resumption of indirect talks between <location value=\"LC/us\" idsrc=\"xmltag.org\" >the United States</location> and <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location> cut into the geopolitical risk premium that has come as traders assess the odds of President Trump will order the armada he has assembled to attack the OPEC+ member and <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location> responds by closing the <location>Strait of Hormuz</location>, the chokepoint for nearly a fifth of global oil exports from Persian Gulf states.</p><p>However a successful conclusion to the negotiations is not a given. <org>The Trump Administration</org> is said to be pressing for an end to <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran's</location> uranium enrichment program as it looks to end the possibility of the <org>Islamic Republic</org> developing nuclear weapons. For its part, <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location> has said it has no plans to build a nuclear bomb and claims the enrichment program is for civilian purposes and is unwilling to end enrichment, while maintaining its right to continue building missiles and supporting militia groups in Middle Eastern countries.</p><p>&quot;Iranian officials for their part have stated that they are exclusively pursuing a civilian nuclear program, and that forgoing domestic enrichment is a nonstarter. <location value=\"LU/ir..tehran\" idsrc=\"xmltag.org\" >Tehran</location> has indicated that it is willing to potentially halt high-level uranium enrichment, reduce its overall stockpile of enriched material, and only use older, slower centrifuges. Beyond enrichment, <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location> has also ruled out concessions on its missile programs and support for its regional armed proxies. Whether this will be sufficient for <location value=\"LU/us.dc.wash\" idsrc=\"xmltag.org\" >Washington</location> remains to be seen,&quot; <person>Helima Croft</person>, Head of <org>Global Commodity Strategy and MENA Research</org> at <org>RBC Capital Markets</org>, wrote.</p><p>Despite the risks to Persian Gulf exports, the market remains oversupplied as global production continues to run ahead of demand as producers in OPEC+ and the Americas boost output while demand growth slows, boosting global inventories. <org>The Energy Information Agency</org> on Wednesday reported U.S. commercial oil inventories rose by 16-million barrels last week, the largest weekly build in three years, according to Reuters.</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/us-markets/202602261439MIDNIGHTUSEQUITY_A3574026",
            "pub_date": "2026-02-27 03:39:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Nvidia expects gaming chips shortage to last until year-end",
            "description": "\n<p><chron>Feb 26</chron> (Reuters) - A global shortage of gaming chips\ncould last until the end of this year, an <org value=\"NVDA.NaE\" idsrc=\"xmltag.org\" >Nvidia</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NVDA' fmr-param-security-type='Equity'>( NVDA )</span>\nexecutive has said, signaling more pain for the video game\nindustry that is already buckling under weak sales due to\nslowing consumer demand.</p>\n<p><org value=\"NVDA.NaE\" idsrc=\"xmltag.org\" >Nvidia</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NVDA' fmr-param-security-type='Equity'>( NVDA )</span> expects the supply constraints to hurt its gaming\nbusiness in the current quarter and beyond even as the chip\ngiant sees strong demand, <org value=\"NVDA.NaE\" idsrc=\"xmltag.org\" >Nvidia</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NVDA' fmr-param-security-type='Equity'>( NVDA )</span> finance chief <person>Colette Kress</person>\nsaid on the company's quarterly earnings call on Wednesday.</p>\n<p>&quot;As much as we would love to have more supply, we do believe\nfor a couple quarters it is going to be very tight,&quot; Kress said.</p>\n<p>&quot;If things improve by the end of the year, there is an\nopportunity to think about what that is from a year-over-year\ngrowth. But it's still too early for us to know at this time.&quot;</p>\n<p>With the tech industry racing to build out artificial\nintelligence capacity, demand for memory chips has outstripped\nsupply, causing a spike in prices and prompting manufacturers to\nprioritize components for higher-margin data center chips.</p>\n<p>That has constrained supply for consumer electronics such as\nsmartphones and personal computers, as well as gaming consoles.\n<org value=\"NVDA.NaE\" idsrc=\"xmltag.org\" >Nvidia</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NVDA' fmr-param-security-type='Equity'>( NVDA )</span> chips are widely used in PC gaming as well as in the\nNintendo Switch console, while <org value=\"SONY.NaE\" idsrc=\"xmltag.org\" >Sony's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='SONY' fmr-param-security-type='Equity'>( SONY )</span> PlayStation and\nMicrosoft's Xbox consoles use AMD hardware.</p>\n<p>Forecasts for the console market have been bleak. According\nto projections from tech industry research firm TrendForce in\nDecember, the console market is expected to see a 4.4% decline\nthis year, compared with its earlier forecast of a 3.5% drop.\n(Reporting by <person>Deborah Sophia</person> in Bengaluru; Editing by <person>Maju\nSamuel</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602261438RTRSNEWSCOMBINED_L4N3ZM250_1",
            "pub_date": "2026-02-27 03:38:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Nvidia expects gaming chips shortage to last until year-end",
            "description": "\n<p><chron>Feb 26</chron> (Reuters) - A global shortage of gaming chips could last until the end of this year, an <org value=\"NVDA.NaE\" idsrc=\"xmltag.org\" >Nvidia</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NVDA' fmr-param-security-type='Equity'>( NVDA )</span> executive has said, signaling more pain for the video game industry that is already buckling under weak sales due to slowing consumer demand.</p>\n<p><org value=\"NVDA.NaE\" idsrc=\"xmltag.org\" >Nvidia</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NVDA' fmr-param-security-type='Equity'>( NVDA )</span> expects the supply constraints to hurt its gaming business in the current quarter and beyond even as the chip giant sees strong demand, <org value=\"NVDA.NaE\" idsrc=\"xmltag.org\" >Nvidia</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NVDA' fmr-param-security-type='Equity'>( NVDA )</span> finance chief <person>Colette Kress</person> said on the company's quarterly earnings call on Wednesday.</p>\n<p>&quot;As much as we would love to have more supply, we do believe for a couple quarters it is going to be very tight,&quot; Kress said. </p>\n<p>&quot;If things improve by the end of the year, there is an opportunity to think about what that is from a year-over-year growth. But it's still too early for us to know at this time.&quot;</p>\n<p>With the tech industry racing to build out artificial intelligence capacity, demand for memory chips has outstripped supply, causing a spike in prices and prompting manufacturers to prioritize components for higher-margin data center chips.</p>\n<p>That has constrained supply for consumer electronics such as smartphones and personal computers, as well as gaming consoles. <org value=\"NVDA.NaE\" idsrc=\"xmltag.org\" >Nvidia</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NVDA' fmr-param-security-type='Equity'>( NVDA )</span> chips are widely used in PC gaming as well as in the Nintendo Switch console, while <org value=\"SONY.NaE\" idsrc=\"xmltag.org\" >Sony's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='SONY' fmr-param-security-type='Equity'>( SONY )</span> PlayStation and Microsoft's Xbox consoles use AMD hardware.</p>\n<p>Forecasts for the console market have been bleak. According to projections from tech industry research firm TrendForce in December, the console market is expected to see a 4.4% decline this year, compared with its earlier forecast of a 3.5% drop.</p>\n<p></p>\n<p> (Reporting by <person>Deborah Sophia</person> in Bengaluru; Editing by <person>Maju Samuel</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602261440RTRSNEWSCOMBINED_KBN3PG2G8-OUSBS_1",
            "pub_date": "2026-02-27 03:40:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "AI Concerns Among Factors Driving Nvidia Post-Earnings Selloff, BofA Says",
            "description": "\n<p><chron>02:43 PM EST</chron>, <chron>02/26/2026</chron> (MT Newswires) -- <org value=\"NVDA.NaE\" idsrc=\"xmltag.org\" >Nvidia's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NVDA' fmr-param-security-type='Equity'>( NVDA )</span>  post-earnings stock selloff likely reflects factors including ongoing fears around artificial intelligence as markets monitor an expected tough set-up for cloud capital spending, <org>BofA Securities</org> said in a note emailed Thursday.</p><p>Shares of the technology bellwether declined 5% after midday Thursday, wiping out gains for this year.</p><p>Late Wednesday, the chipmaking giant reported fiscal fourth-quarter results above <location>Wall Street's</location> estimates as an AI boom continued to fuel computing demand. At the same time, it issued a stronger-than-expected revenue outlook for the ongoing quarter.</p><p>The post-earnings market reaction likely reflects continued concerns around AI disruptions and greater upside from networking than compute, BofA analyst <person>Vivek Arya</person> wrote. In addition, there were no updates on the <money>$500 billion</money> data center revenue opportunity the company shared last year.</p><p>Arya, however, views this as short-term noise, saying the stock presents a &quot;compelling valuation.&quot;</p><p>Cloud capital spending is expected to face a tough comparison in 2027, after growing more than 50% annually from 2024 to 2026, Arya said.</p><p>Morgan Stanley separately flagged cash flow pressure at hyperscalers, raising questions about spending sustainability.</p><p><org value=\"NVDA.NaE\" idsrc=\"xmltag.org\" >Nvidia</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NVDA' fmr-param-security-type='Equity'>( NVDA )</span> &quot;more than delivered&quot; on its fourth-quarter performance and is poised to accelerate growth amid demand visibility, Arya said. BofA lifted its price target on <org value=\"NVDA.NaE\" idsrc=\"xmltag.org\" >Nvidia</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NVDA' fmr-param-security-type='Equity'>( NVDA )</span> shares to <money>$300</money> from <money>$275</money>, while reiterating its buy recommendation.</p><p>The brokerage raised <org value=\"NVDA.NaE\" idsrc=\"xmltag.org\" >Nvidia's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NVDA' fmr-param-security-type='Equity'>( NVDA )</span> earnings-per-share and revenue estimates from fiscal 2027 to 2029.</p><p>With supply commitments surging to <money>$95 billion</money>, <org value=\"NVDA.NaE\" idsrc=\"xmltag.org\" >Nvidia</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NVDA' fmr-param-security-type='Equity'>( NVDA )</span> &quot;may well be the most dependable supplier that can serve the AI market that we believe could double towards <money>$1.4</money> (trillion) in the next few years,&quot; Arya said.</p><p>Price: 186.45, Change: -9.18, Percent Change: -4.69</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602261443MIDNIGHTUSEQUITY_A3573983",
            "pub_date": "2026-02-27 03:43:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Belfry Reports Strategic Partnership With Willis, Kayna",
            "description": "\n<p><chron>02:44 PM EST</chron>, <chron>02/26/2026</chron> (MT Newswires) -- Willis, a <org value=\"WTW.NaE\" idsrc=\"xmltag.org\" >Willis Towers Watson</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='WTW' fmr-param-security-type='Equity'>( WTW )</span>  business, has partnered with</p><p><org>Belfry Software</org> to launch a digital insurance program for Belfry customers, the latter said Thursday.</p><p>The program pairs Willis insurance expertise with Kayna insurance technology to deliver insurance solutions, Belfry said.</p><p>Under the agreement, an insurance portal will be included in the Belfry dashboard for clients to apply and receive a no-obligation insurance quote, the company said.</p><p>Willis will leverage Kayna's technology to pre-fill forms and support quoting and simplifying the procurement process, it said.</p><p>Price: 305.22, Change: +8.38, Percent Change: +2.82</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602261444MIDNIGHTUSEQUITY_A3574014",
            "pub_date": "2026-02-27 03:44:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US STOCKS-Wall St slides as tech rally stalls, AI enthusiasm wanes after Nvidia results",
            "description": "\n<p>(Updates to mid-afternoon trading)</p>\n<p>*</p>\n<p>Indexes down: Dow 0.05%, S&amp;P 500 0.73%, Nasdaq 1.45%</p>\n<p></p>\n<p>*</p>\n<p>Philadelphia SE Semiconductor index set to snap 10-week\nwinning\nstreak</p>\n<p></p>\n<p>*</p>\n<p><org value=\"TTD.NaE\" idsrc=\"xmltag.org\" >Trade Desk</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='TTD' fmr-param-security-type='Equity'>( TTD )</span> plunges after Q1 revenue forecast below\nestimates</p>\n<p></p>\n<p>*</p>\n<p><person>J.M. Smucker</person> jumps on Q3 beat, deal with Elliott</p>\n<p></p>\n<p>By <person>Stephen Culp</person> and <person>Ragini Mathur</person></p>\n<p><location value=\"LU/us.ny.nyc\" idsrc=\"xmltag.org\" >NEW YORK</location>, <chron>Feb 26</chron> (Reuters) - U.S. stock indexes turned\nsharply lower on Thursday, the day after a less-than-stellar\nearnings report from artificial intelligence vanguard <org value=\"NVDA.NaE\" idsrc=\"xmltag.org\" >Nvidia</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NVDA' fmr-param-security-type='Equity'>( NVDA )</span>\ndragged technology shares which have provided muscle to\nthe recent rally.\nA pivot back to cyclical sectors helped limit the Dow's losses,\nwhile a 3.6% drop in the Philadelphia SE Semiconductor index\nhelped drag the tech-laden Nasdaq down 1.5%.</p>\n<p>With Thursday's drop, the SOX, which has surged 15.3%\nyear-to-date, is on the verge of snapping what would have been a\nrecord 11-week winning streak.</p>\n<p>Technology shares in general, and software\nand chips in particular, have see-sawed in recent\nweeks as investors wrestle with uneasiness over the massive\ncosts and potential disruption of nascent AI technology.</p>\n<p>While all three major U.S. stock indexes are on track for\nmodest weekly losses, the S&amp;P 500 and the Nasdaq are poised to\nclose lower on the month. The Dow remains on track to post an\nadvance in February.</p>\n<p><org value=\"NVDA.NaE\" idsrc=\"xmltag.org\" >Nvidia's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NVDA' fmr-param-security-type='Equity'>( NVDA )</span> fourth-quarter results, posted after Wednesday's\nclosing bell, were better than analysts expected, and the\nchipmaker provided above-market estimates. But the world's\nrichest company by market cap wrestled with increasingly\ndifficult year-on-year comparisons as its revenue growth\ndecelerates. Its shares were down 4.9%.</p>\n<p>&quot;<org value=\"NVDA.NaE\" idsrc=\"xmltag.org\" >Nvidia's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NVDA' fmr-param-security-type='Equity'>( NVDA )</span> results, while they were good and showed\nsubstantial growth year-over-year, they did not hit the high end\nof some people's expectations,&quot; said <person>Joseph Sroka</person>, chief\ninvestment officer at NovaPoint in <location value=\"LU/us.ga.atlnta\" idsrc=\"xmltag.org\" >Atlanta</location>. &quot;Now the news is\nover and there's probably a little bit of profit taking and\nwe're seeing money now rotate back to the victims from earlier\nin the week, the software companies that were portrayed to be\nthe ultimate victims of AI.&quot;</p>\n<p>The Dow Jones Industrial Average fell 26.44 points,\nor 0.05%, to 49,449.13, the S&amp;P 500 lost 51.00 points, or\n0.73%, to 6,895.13 and the Nasdaq Composite lost 335.80\npoints, or 1.45%, to 22,816.28.\nAmong the 11 major sectors of the S&amp;P 500, tech and\ncommunication services suffered the steepest\npercentage losses, while financials led the gainers,\nrising 1.0% on the strength of big bank shares, including\n<org value=\"JPM.NaE\" idsrc=\"xmltag.org\" >JPMorgan Chase</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='JPM' fmr-param-security-type='Equity'>( JPM )</span>, <org value=\"BAC.NaE\" idsrc=\"xmltag.org\" >Bank of America</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='BAC' fmr-param-security-type='Equity'>( BAC )</span> and <org value=\"WFC.NaE\" idsrc=\"xmltag.org\" >Wells Fargo</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='WFC' fmr-param-security-type='Equity'>( WFC )</span>\n.\nThe S&amp;P 500 software and services index, battered in\nrecent weeks on worries over AI-related disruption, gained 0.9%,\nboosted by a 3.1% increase in <org value=\"CRM.NaE\" idsrc=\"xmltag.org\" >Salesforce</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='CRM' fmr-param-security-type='Equity'>( CRM )</span> shares, even\nthough the company provided weaker-than-expected revenue\nguidance.\n<org value=\"TTD.NaE\" idsrc=\"xmltag.org\" >Trade Desk</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='TTD' fmr-param-security-type='Equity'>( TTD )</span> slid 3.9% following its disappointing revenue\nforecast amid mounting pressure from larger rivals.\n<person>J.M. Smucker</person> surged 9.1% on the packaged food company's\nsolid quarterly profit and sales estimates.\n<org value=\"AI.NaE\" idsrc=\"xmltag.org\" >C3.ai</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AI' fmr-param-security-type='Equity'>( AI )</span> tumbled 19.3% after it provided a\nweaker-than-expected current quarter sales forecast and\nannounced it would slash 26% of its global workforce.\n<org>Celsius Holding</org> jumped 7.1% after the energy drink\nmaker beat quarterly revenue estimates.</p>\n<p>Advancing issues outnumbered decliners by a 1.04-to-1 ratio\non the <org>NYSE</org>. There were 310 new highs and 63 new lows on the\n<org>NYSE</org>.</p>\n<p>On the Nasdaq, 2,069 stocks rose and 2,574 fell as declining\nissues outnumbered advancers by a 1.24-to-1 ratio.</p>\n<p>The S&amp;P 500 posted 35 new 52-week highs and one new low\nwhile the Nasdaq Composite recorded 74 new highs and 80 new\nlows.</p>\n<p>(Reporting by <person>Stephen Culp</person>; Additional reporting by <person>Shashwat\nChauhan</person> and <person>Ragini Mathur</person> in Bengaluru; Editing by <person>David\nGregorio</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/us-markets/202602261425RTRSNEWSCOMBINED_L6N3ZM173_1",
            "pub_date": "2026-02-27 03:25:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Upwind Runtime-First Cloud Security Platform Leader Integrates With New Extended Plan for AWS Security Hub",
            "description": "\n<p class=\"bwalignc\">\n<i>Upwind Becomes a Select CNAPP Partner Extending AWS Security Hub, Advancing the Next Phase of Cloud Security Integration</i>\n\n</p>\n<p>    <location value=\"LU/us.ca.sanfrn\" idsrc=\"xmltag.org\" >SAN FRANCISCO</location>--(BUSINESS WIRE)--\nUpwind, the runtime-first cloud security leader, today announced that its cloud-native application protection platform (CNAPP) is now integrated with the Extended plan in AWS Security Hub, Amazon Web Services’ unified security solution. This integration enables customers to gain deep, real-time visibility across their AWS workloads while reducing alert noise and focusing on the risks that matter most. By combining AWS detection services with Upwind’s runtime context, customers can prioritize active risk, streamline security operations, and strengthen protection of their workloads on AWS, through a simplified single-vendor Amazon Confidential experience with one contract, one bill, consolidated support, and flexible pricing through AWS.\n\n</p><p id=\"news-body-cta\">This press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20260226533036/en/</p><p>\nCloud security has reached an inflection point. As organizations rapidly scale containerized workloads, serverless architectures, and AI-driven applications, traditional approaches built on periodic scans and static posture checks are struggling to keep pace. Security teams need systems that operate at cloud speed, where detection, correlation, and response happen in real-time and continuously, not in snapshots.\n\n</p><p>\nAWS Security Hub Extended plan delivers curated enterprise security solutions from AWS and partners with simplified purchasing. It streamlines procurement through a single vendor experience – one contract, one bill, consolidated support, and flexible pricing. Security Hub Extended plan brings together the best of AWS detection services and curated partner solutions from endpoint and identity to security operations and artificial intelligence. These solutions enable defense-in-depth across your organization while simplifying deployment.\n\n</p><p>\nThe Extended Plan for AWS Security Hub simplifies how enterprises deploy and manage security tooling within AWS. By integrating directly into this framework, Upwind becomes part of a consolidated operating model, allowing security leaders to standardize procurement and align security operations more tightly with their existing AWS investments.\n\n</p><p>\n“AWS Security Hub Extended plan and Upwind deliver what enterprises need most: unified visibility and clarity across increasingly complex cloud environments,” said <person>Amiram Shachar</person>, CEO &amp; Co-founder at Upwind. “Cloud infrastructure has changed faster than the security models designed to protect it. The next era of cloud security must be built on runtime signals; that’s actually the only way to understand what is truly happening in production. By integrating Upwind's runtime-first cloud security platform with Security Hub Extended Plan, customers can base their decisions on live signals, not assumptions. That changes how teams prioritize risk, how they operate, and how fast they can move. This is the direction cloud security is heading.”\n\n</p><p>\nTogether, AWS Security Hub and Upwind help organizations shift from fragmented investigations to a more unified security workflow. Security Hub surfaces correlated findings and attack paths across AWS services, while Upwind enriches those findings with runtime-level insight to validate and investigate real risk. The result is a more connected security workflow that reduces friction between detection and remediation. For large enterprises operating at scale, the ability to combine centralized visibility with runtime-level insight is critical. As environments grow more distributed and teams more specialized, integrations like this allow security, engineering, and cloud operations to work from a shared source of truth.\n\n</p><p>\n“Upwind provides deep visibility and clarity across our AWS environment, allowing us to focus on real, actionable risk,” said Jerich Beason, CISO at Waste Management. “After an in-depth evaluation of CNAPP platforms and extensive hands-on testing, we chose Upwind and rolled it out across our AWS and broader cloud infrastructure. Since deployment, we’ve seen a significant reduction in security alerts and fewer irrelevant CVEs. That level of clarity enables our teams to prioritize what actually matters and operate far more efficiently. Cloud security has lacked meaningful context for too long. Upwind shows us what is happening in our environment and why it matters. The agent built on the platform allows us to interrogate our data in real time, saving time and money while strengthening our overall security operations. Just as important, they have earned the trust of our engineers and security teams and continue to operate at the speed we expect from modern cloud partners.”\n\n</p><p>\nAs cloud-native architectures evolve and AI-driven workloads expand, security strategies must evolve alongside them. Integrations built on shared telemetry and complementary capabilities represent the next step in how enterprises protect modern cloud environments at scale.\n\n</p><p>\nThe Extended Plan for AWS Security Hub is immediately available in all commercial AWS regions. To learn more, visit upwind.io.\n\n</p><p>\n<b>About Upwind</b>\n\n</p><p>\nUpwind is the next-generation cloud security platform built to lead the Runtime revolution. Headquartered in <location value=\"LU/us.ca.sanfrn\" idsrc=\"xmltag.org\" >San Francisco, California</location>, Upwind brings together a unified vision for cloud and application-layer protection, empowering organizations to run faster, detect threats earlier and secure their environments with unmatched precision. The company was founded by <person>Amiram Shachar</person> and the founding team behind Spot.io (acquired by NetApp for <money>$450 million</money>) and is backed by leading investors including Bessemer, <org>Salesforce Ventures</org>, Greylock, Cyberstarts, <org>Leaders Fund</org>, <org>Craft Ventures</org>,TCV, <location>Alta Park</location>, <org>Cerca Partners</org>, <org>Swish Ventures</org> and <org>Penny Jar Capital</org>. Upwind has raised <money>$430 million</money> since its founding in 2022 and is trusted by forward-thinking enterprises globally to bring real-time runtime intelligence to modern cloud security. For more information or to schedule a demo, visit www.upwind.io.\n\n</p><p><img alt=\"\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20260226533036r1&amp;sid=acqr8&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\" /><span class=\"bwct31415\" /></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\">https://www.businesswire.com/news/home/20260226533036/en/</span></p>\n<p>Source: Upwind</p>\n",
            "link": "https://www.fidelity.com/news/article/technology/202602261427BIZWIRE_USPR_____20260226_BW533036",
            "pub_date": "2026-02-27 03:27:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Vanair Unveils Zero-Emission EPEQ EPRO20 Power Skid at CONEXPO-CON/AGG 2026",
            "description": "\n<div class=\"xn-content\">\n<p><i>Patent-pending battery-powered air compressor saves money, reduces noise and delivers 20 CFM without engine idling or fuel-powered generators.</i></p><p><span class=\"legendSpanClass\"><location value=\"LU/us.nv.lasveg\" idsrc=\"xmltag.org\" >LAS VEGAS</location></span>, <span class=\"legendSpanClass\"><chron>Feb. 26, 2026</chron></span> /PRNewswire/ -- Vanair, a <org>Lincoln Electric Company</org>, today announced the introduction of its new EPEQ EPRO20 Power Skid, a revolutionary battery-powered air compressor system that eliminates the need for engine idling and fuel-powered compressors on construction sites. The patent-pending system named a finalist for the CONEXPO-CON/AGG Next Level Awards, will be shown to the industry for the first time at CONEXPO-CON/AGG 2026 in the Lincoln Electric/Vanair booth P8449.</p>\n    <div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder1\">\n                <p>\n\n                    <img src=\"https://mma.prnewswire.com/media/2921453/Vanair_Inc_Image.jpg\" title=\"The EPEQ EPRO20 represents a breakthrough in portable compressed air technology, delivering 20 CFM at up to 150 PSI with zero emissions and minimal noise.\" alt=\"The EPEQ EPRO20 represents a breakthrough in portable compressed air technology, delivering 20 CFM at up to 150 PSI with zero emissions and minimal noise.\" />\n\n                </p>\n    </div>\n<p>The EPEQ EPRO20 represents a breakthrough in portable compressed air technology, delivering 20 CFM at up to 150 PSI with zero emissions and minimal noise. The skid-mounted system drops into any pickup truck, UTV, van or trailer without installation, wiring or permanent vehicle modifications.</p><p>\"Construction crews have been forced to choose between idling expensive vehicles for hours or hauling noisy diesel- or gas-powered compressors that violate urban noise ordinances,\" said <person>Chip Jones</person>, national manager of Vanair's <org>Electrified Power Group</org>. \"The EPRO20 eliminates this dilemma entirely and make the work environment much nicer. Crews can literally drop it in place and start working with Clean, Quiet, Power that doesn't compromise productivity or burn fuel.\"</p><p>At the heart of the system is Vanair's advanced ELiMENT LiFePO4 battery providing 100 ampere-hours of 48-volt power, selected for its 5,000-cycle lifespan and safety advantages. The battery powers the EPEQ AIR20 reciprocating compressor through dual-speed operation, offering 10 CFM for extended runtime or 20 CFM for high-demand applications. A 30-gallon air storage tank ensures consistent pressure delivery.</p><p>The system integrates Vanair's proprietary Smart Display, a seven-inch interface that provides real-time monitoring of battery health, air pressure and system status. Comprehensive battery management protections include over-current, short-circuit and temperature monitoring to ensure reliable operation in harsh construction environments.</p><p>\"This isn't just another electric tool,\" added Jones. \"The EPRO20 is the entry point to our complete EPEQ ecosystem of electrified fleet equipment. Companies can start with one unit, prove the concept, then scale their electrification efforts without major investment.\"</p><p>The EPRO20 directly addresses construction industry challenges including emissions reduction, noise compliance and operational costs. By eliminating engine idling, the system saves 0.5 to 1.0 gallon of fuel per hour while reducing maintenance on high-value equipment. Workers benefit from reduced exhaust exposure and lower noise levels.</p><p>Applications range from residential contractors operating nail guns to utility crews running pneumatic tools. The system's 400-pound total weight balances robust capability with practical portability, while shore power charging capability ensures overnight battery replenishment.</p><p>The EPRO20 is manufactured at Vanair's <location value=\"LU/us.in.micity\" idsrc=\"xmltag.org\" >Michigan City, Indiana</location> facility and will be available through the company's network of more than 500 authorized dealers nationwide.</p><p>To access images of the new EPEQ EPRO20 Power Skid, please click here.</p><p><b>About Lincoln Electric<br /></b>Lincoln Electric is the world leader in the engineering, design and manufacturing of advanced arc welding solutions, automated joining, assembly and cutting systems, plasma and oxy-fuel cutting equipment and has a leading global position in brazing and soldering alloys. Lincoln Electric is recognized as the Welding Expert™ for its leading materials science, software development, automation engineering and application expertise, which advance customers' fabrication capabilities to help them build a better world. Headquartered in <location value=\"LU/us.oh.clevld\" idsrc=\"xmltag.org\" >Cleveland, Ohio</location>, Lincoln operates 71 manufacturing and automation system integration locations across 21 countries and maintains a worldwide network of distributors and sales offices serving customers in over 160 countries. For more information about Lincoln Electric and its products and services, visit the Company's website at https://www.lincolnelectric.com.</p><p><b>About Vanair<br /></b>Vanair offers an extensive product line of vehicle-mounted air compressors, generators, welders, hydraulics, Electrified Power Equipment, chargers/boosters, engine starters, EV chargers and custom products, making it the most comprehensive Mobile Power Solution provider in the world. Through innovative design, training and support, Vanair delivers rugged and reliable products that enhance efficiency and productivity globally. Wherever, whenever and however you need it... Vanair is there. For more information about Vanair and its products and services, visit the Company's website at https://vanair.com/.</p><p><i>Vanair, the Vanair logo, Mobile Power Solutions, EPEQ, Electrified Power Equipment, ELiMENT, Xcite, Solar Assist, Power Center, Mobile Support Box, and Clean Quiet, Power are registered trademarks or trademarks of Vanair®, a <org>Lincoln Electric Company</org>, <location value=\"LU/us.in.micity\" idsrc=\"xmltag.org\" >Michigan City, IN</location>, USA.</i></p><p><i>Lincoln Electric®, the Welding Expert, and Velion are registered trademarks of <org>The Lincoln Electric Company</org> and its related companies.</i></p>\n<div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder2\">\n                <p>\n\n                    <img src=\"https://mma.prnewswire.com/media/2778843/000Logo_Shadow_Tagline_MR_copy_2_Logo.jpg\" title=\"Marketing Consultants for the Vehicle and Transportation Industries (PRNewsfoto/Link Mfg., Ltd.)\" alt=\"Marketing Consultants for the Vehicle and Transportation Industries (PRNewsfoto/Link Mfg., Ltd.)\" />\n\n                </p>\n</div>\n\n\n\n<p id=\"PURL\"><img title=\"Cision\" width=\"12\" height=\"12\" alt=\"Cision\" src=\"https://edge.prnewswire.com/c/img/favicon.png?sn=NY96886&amp;sd=2026-02-26\" /> View original content to download multimedia:https://www.prnewswire.com/news-releases/vanair-unveils-zero-emission-epeq-epro20-power-skid-at-conexpo-conagg-2026-302698721.html</p><p>SOURCE <org>Vanair Inc</org></p></div>\n",
            "link": "https://www.fidelity.com/news/article/technology/202602261430PR_NEWS_USPR_____NY96886",
            "pub_date": "2026-02-27 03:30:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Research Alert: CFRA Reiterates Buy Opinion On Shares Of Royal Bank Of Canada",
            "description": "\n<p><chron>02:20 PM EST</chron>, <chron>02/26/2026</chron> (MT Newswires) -- CFRA, an independent research provider, has provided MT Newswires with the following research alert. Analysts at CFRA have summarized their opinion as follows:</p><p>We increase our 12-month target price by <money>CAD25</money> to <money>CAD305</money>, 17.4x our FY 27 (Oct.) EPS view of <money>CAD17.55</money>, a wider risk premium than the peer average of 12.7x given its scale and superior earnings profile. We raise our FY 26 EPS to <money>CAD16.10</money> from <money>CAD15.25</money> and increase FY 27's to <money>CAD17.55</money> from <money>CAD16.85</money>. While gross impaired loans (GILs) increased Y/Y in Q1, we've been encouraged by RY's performance since Liberation Day, as GILs have declined sequentially for two consecutive quarters. In the event of a Canadian recession, we expect RY's defensive positioning and diversified revenue streams to drive outperformance relative to peers. RY continues to outexecute the competition, with its adjusted ROE of 17.8% in Q1 2026 significantly exceeding many underperforming peers. The U.S. business, which has been a weak spot in recent years, is showing substantial improvement as turnaround efforts gain traction. To that point, City National's net income more than doubled Y/Y to <money>USD143 million</money> from <money>USD60 million</money>.</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/investing-ideas/202602261420MIDNIGHTUSEQUITY_A3574008",
            "pub_date": "2026-02-27 03:20:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Research Alert: CFRA Raises Opinion On Shares Of Celsius Holdings Inc. To Buy From Hold",
            "description": "\n<p><chron>02:20 PM EST</chron>, <chron>02/26/2026</chron> (MT Newswires) -- CFRA, an independent research provider, has provided MT Newswires with the following research alert. Analysts at CFRA have summarized their opinion as follows:</p><p>We raise our 12-month target by <money>$15</money> to <money>$70</money>, based on a 2027 P/E of 33.3x, a justified discount to CELH's historical average multiples. We increase our adjusted EPS estimates by <money>$0.10</money> to <money>$1.75</money> for 2026 and by <money>$0.20</money> to <money>$2.10</money> for 2027. Following CELH's Q4 earnings beat, we raise our estimates and upgrade shares to Buy from Hold. A few things stood out in the release, causing us to turn more positive on the name, with capital allocation at the top of the list. CELH is rapidly de-leveraging following debt incurred as a result of the Alani Nu and Rockstar Energy acquisitions in 2025, reducing  debt by <money>$198M</money> over the past three months and ending the year with only <money>$670M</money> in debt (vs. <money>$399M</money> in cash). Furthermore, CELH is ramping up buybacks, repurchasing <money>$39.8M</money> in stock in Q4, a dramatic increase from only <money>$3.3M</money> in the first nine months of 2025. Beverage companies are facing significant fundamental headwinds (i.e., tepid demand, tariffs, rising aluminum costs), but CELH stands out from a growth perspective.</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/investing-ideas/202602261420MIDNIGHTUSEQUITY_A3574010",
            "pub_date": "2026-02-27 03:20:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "BRIEF-TDE Group Files To Withdraw US IPO",
            "description": "\n<p><chron>Feb 26</chron> (Reuters) - TDE GROUP:</p>\n<p>* TDE GROUP : FILES TO WITHDRAW US IPO\nSource text:\n;))</p>\n",
            "link": "https://www.fidelity.com/news/article/default/202602261427RTRSNEWSCOMBINED_FWN3ZM2BE_1",
            "pub_date": "2026-02-27 03:27:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Google Translate Introduces AI Features",
            "description": "\n<p><chron>02:27 PM EST</chron>, <chron>02/26/2026</chron> (MT Newswires) -- Alphabet's (GOOGL, GOOG) <org value=\"GOOG.NaE\" idsrc=\"xmltag.org\" >Google</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='GOOG' fmr-param-security-type='Equity'>( GOOG )</span> on Thursday introduced new artificial intelligence-powered features in Google Translate to explore linguistic nuances.</p><p>Google Translate, using Gemini's multilingual capabilities, now offers multiple alternatives, which is particularly useful for translating idioms and more colloquial phrases, the tech giant said in a blog post.</p><p>The new features are available in the US and <location value=\"LC/in\" idsrc=\"xmltag.org\" >India</location> as of Thursday on the Google Translate app and will soon be available on the web, the company said.</p><p>Price: 307.82, Change: -5.14, Percent Change: -1.64</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602261427MIDNIGHTUSEQUITY_A3574006",
            "pub_date": "2026-02-27 03:27:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Sector Update: Energy Stocks Higher Thursday Afternoon",
            "description": "\n<p><chron>02:07 PM EST</chron>, <chron>02/26/2026</chron> (MT Newswires) -- Energy stocks were rising Thursday afternoon, with the NYSE Energy Sector Index increasing 0.4% and the State Street Energy Select Sector SPDR ETF (XLE) adding 0.6%.</p><p>The Philadelphia Oil Service Sector Index was decreasing 0.8%, and the Dow Jones US Utilities Index was easing 0.2%.</p><p>Front-month West Texas Intermediate crude oil was rising 1.1% to <money>$66.12</money> a barrel, and the global benchmark Brent crude contract was advancing 1.1% to <money>$71.67</money> a barrel. Henry Hub natural gas futures fell 1.9% to <money>$2.81</money> per 1 million BTU.</p><p>In sector news, US natural gas stocks declined by 52 billion cubic feet in the week ended <chron>Feb. 20</chron>, slightly larger than the 50-billion cubic foot decrease expected in a survey compiled by <org>Bloomberg</org> and following a decrease of 144 billion cubic feet in the previous week.</p><p>In corporate news, Eni (E) shares rose 2.6% after it reported Thursday Q4 sales from operations of <money>20.62 billion euros</money> (<money>$24.3 billion</money>), down from <money>23.49 billion euros</money> a year earlier but above analysts' estimates.</p><p><org value=\"EFXT.NaE\" idsrc=\"xmltag.org\" >Enerflex</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='EFXT' fmr-param-security-type='Equity'>( EFXT )</span>  shares jumped 17%. The company said late Wednesday its preliminary 2026 outlook &quot;reflects steady demand across its business lines and geographic regions&quot; while reporting a swing to a Q4 net loss, and it signed a deal to divest the majority of its operations in the <location value=\"LR/asp\" idsrc=\"xmltag.org\" >Asia Pacific</location> region.</p><p>Shell (SHEL) is reviewing and considering whether to sell some investments held under its <org>Shell Ventures</org> portfolio, Reuters reported. Shell shares were down 1.5%.</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/us-markets/202602261407MIDNIGHTUSEQUITY_A3573998",
            "pub_date": "2026-02-27 03:07:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Equity Markets Mostly Fall Intraday as Nvidia Drags Tech Lower",
            "description": "\n<p><chron>02:08 PM EST</chron>, <chron>02/26/2026</chron> (MT Newswires) -- US benchmark equity indexes were mostly lower intraday as a post-earnings sell-off in <org value=\"NVDA.NaE\" idsrc=\"xmltag.org\" >Nvidia</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NVDA' fmr-param-security-type='Equity'>( NVDA )</span>  shares weighed on the technology sector.</p><p>The Nasdaq Composite was down 1.5% at 22,796.2 after midday Thursday, while the S&amp;P 500 fell 0.8% to 6,891.8. The Dow Jones Industrial Average was little changed at 49,475.2. Tech was the worst-performing sector, down 2.3%, while financials led the gainers with a 1.1% advance.</p><p><org value=\"NVDA.NaE\" idsrc=\"xmltag.org\" >Nvidia</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NVDA' fmr-param-security-type='Equity'>( NVDA )</span> shares were down 5.2%, the worst performer on the Dow and among the worst on the S&amp;P 500, wiping out gains so far this year.</p><p>Late Wednesday, the chipmaking giant posted fiscal fourth-quarter results above <location>Wall Street's</location> estimates as an artificial intelligence boom continued to fuel computing demand. It offered a stronger-than-expected revenue outlook for the ongoing quarter.</p><p><org value=\"NVDA.NaE\" idsrc=\"xmltag.org\" >Nvidia's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NVDA' fmr-param-security-type='Equity'>( NVDA )</span> stock selloff likely reflects continued worries around AI and a tough comparison for cloud capital expenditure next year, <org>BofA Securities</org> said in a note.</p><p>Fellow mega-cap tech stocks <org value=\"AMZN.NaE\" idsrc=\"xmltag.org\" >Amazon.com</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AMZN' fmr-param-security-type='Equity'>( AMZN )</span>  and <org value=\"AAPL.NaE\" idsrc=\"xmltag.org\" >Apple</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AAPL' fmr-param-security-type='Equity'>( AAPL )</span>  were among the steepest decliners on the Dow intraday. On the S&amp;P 500, <org value=\"AVGO.NaE\" idsrc=\"xmltag.org\" >Broadcom</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AVGO' fmr-param-security-type='Equity'>( AVGO )</span> , <org value=\"SMCI.NaE\" idsrc=\"xmltag.org\" >Super Micro Computer</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='SMCI' fmr-param-security-type='Equity'>( SMCI )</span> , and <org value=\"AMAT.NaE\" idsrc=\"xmltag.org\" >Applied Materials</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AMAT' fmr-param-security-type='Equity'>( AMAT )</span>  were among the worst performers.</p><p><org value=\"CRM.NaE\" idsrc=\"xmltag.org\" >Salesforce</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='CRM' fmr-param-security-type='Equity'>( CRM )</span>  was the top gainer on the Dow, up 3.4%. The customer relationship management platform late Wednesday issued a weak full-year revenue outlook at the midpoint, but topped market estimates for its fiscal fourth-quarter results.</p><p><person>J.M. Smucker</person> (SJM) shares were up 8.8% intraday Thursday, the second-best performer on the S&amp;P 500. The food producer trimmed the top end of its full-year sales growth outlook due to a recent fire at one of its manufacturing facilities, while its fiscal third-quarter results topped market estimates.</p><p>Intuit (INTU), <org value=\"MNST.NaE\" idsrc=\"xmltag.org\" >Monster Beverage</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='MNST' fmr-param-security-type='Equity'>( MNST )</span>  and <org value=\"DELL.NaE\" idsrc=\"xmltag.org\" >Dell Technologies</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='DELL' fmr-param-security-type='Equity'>( DELL )</span>  are scheduled to report results after the closing bell Thursday, along with others.</p><p>US Treasury yields were lower intraday, with the 10-year rate down 1.9 basis points at 4.03% and the two-year rate falling 1.8 basis points to 3.45%.</p><p>West Texas Intermediate crude oil fell 0.2% to <money>$65.28</money> a barrel.</p><p>In economic news, weekly applications for unemployment insurance in the US increased, while continuing claims decreased, government data showed.</p><p>&quot;The behavior of claims over the past few weeks suggest that labor market conditions remain steady and layoffs remain subdued,&quot; Jefferies said in a note.</p><p>Gold was down 0.6% at <money>$5,195.20</money> per troy ounce, while silver dropped 4.1% to <money>$87.27</money> per ounce.</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/us-markets/202602261408MIDNIGHTUSEQUITY_A3573993",
            "pub_date": "2026-02-27 03:08:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Smartphone market set for biggest-ever decline in 2026 on memory price surge, IDC says",
            "description": "\n<p><chron>Feb 26</chron> (Reuters) - The global smartphone market is\npoised to suffer its biggest decline ever in 2026, sinking to a\nmore than decade low in shipments, as surging memory chip prices\ndrive up device costs, the <org>International Data Corporation</org> said\non Thursday.</p>\n<p>Smartphone shipments are expected to drop 12.9% to 1.12\nbillion units, the research firm said in a report.</p>\n<p>The decline will hit low-end Android manufacturers the\nhardest, while <org value=\"AAPL.NaE\" idsrc=\"xmltag.org\" >Apple</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AAPL' fmr-param-security-type='Equity'>( AAPL )</span> and Samsung are\npositioned to gain market share as smaller rivals struggle or\nexit the market entirely, the report said.</p>\n<p>&quot;What we are witnessing is not a temporary squeeze, but a\ntsunami-like shock originating in the memory supply chain,&quot; said\n<person>Francisco Jeronimo</person>, vice president for Worldwide Client Devices\nat IDC.</p>\n<p>Analysts have said rising component costs will erode margins\nat smartphone companies focused on budget devices, forcing them\nto pass on the expenses to consumers at a time when demand at\nhigher price points is weakening.</p>\n<p><org value=\"AAPL.NaE\" idsrc=\"xmltag.org\" >Apple</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AAPL' fmr-param-security-type='Equity'>( AAPL )</span> and Samsung, with stronger balance sheets and premium\npositioning, are better equipped to weather the crisis, IDC\nsaid.</p>\n<p>The average selling price of smartphones is projected to\nsurge 14% to a record <money>$523</money> this year, as manufacturers shift\ntoward higher-margin models to offset ballooning costs.</p>\n<p>IDC expects a modest 2% recovery in 2027 as the crisis\neases, followed by a 5.2% rebound in 2028, though it said that\nthe market was unlikely to return to previous norms.</p>\n<p>&quot;The memory crisis will cause more than a temporary decline;\nit marks a structural reset of the entire market,&quot; said <person>Nabila\nPopal</person>, senior research director at IDC's Mobile Phone Tracker.</p>\n<p>She warned that the sub-$100 smartphone segment,\nrepresenting 171 million devices, will become &quot;permanently\nuneconomical&quot; even after memory prices stabilize by mid-2027.\n(Reporting by <person>Kritika Lamba</person> in Bengaluru; Editing by Shinjini\nGanguli)</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602261403RTRSNEWSCOMBINED_L4N3ZM1VX_1",
            "pub_date": "2026-02-27 03:03:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Smartphone market set for biggest-ever decline in 2026 on memory price surge, IDC says",
            "description": "\n<p><chron>Feb 26</chron> (Reuters) - The global smartphone market is poised to suffer its biggest decline ever in 2026, sinking to a more than decade low in shipments, as surging memory chip prices drive up device costs, the <org>International Data Corporation</org> said on Thursday. </p>\n<p>Smartphone shipments are expected to drop 12.9% to 1.12 billion units, the research firm said in a report.  </p>\n<p>The decline will hit low-end Android manufacturers the hardest, while <org value=\"AAPL.NaE\" idsrc=\"xmltag.org\" >Apple</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AAPL' fmr-param-security-type='Equity'>( AAPL )</span> and Samsung are positioned to gain market share as smaller rivals struggle or exit the market entirely, the report said.</p>\n<p>&quot;What we are witnessing is not a temporary squeeze, but a tsunami-like shock originating in the memory supply chain,&quot; said <person>Francisco Jeronimo</person>, vice president for Worldwide Client Devices at IDC.</p>\n<p>A rapid build-out of AI infrastructure by tech firms such as Meta, Google and Microsoft has captured much of the memory chips supply, lifting prices as manufacturers prioritize components for higher-margin data centers over consumer devices. </p>\n<p>Memory chips, or DRAM, are crucial to smartphones as they allow power-hungry applications to run smoothly.</p>\n<p>Analysts have said rising component costs will force budget-device focused companies to pass the expenses on to consumers, just as demand at higher price points is weakening. </p>\n<p><org value=\"AAPL.NaE\" idsrc=\"xmltag.org\" >Apple</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AAPL' fmr-param-security-type='Equity'>( AAPL )</span> and Samsung, with stronger balance sheets and premium positioning, are better positioned, IDC said.</p>\n<p>It expects the average selling price of smartphones to surge 14% to a record <money>$523</money> this year, as manufacturers shift toward higher-margin models to offset ballooning costs.</p>\n<p>IDC expects a modest 2% recovery in 2027 as the crisis eases, followed by a 5.2% rebound in 2028, though it said that the market was unlikely to return to previous norms.</p>\n<p>&quot;The memory crisis will cause more than a temporary decline; it marks a structural reset of the entire market,&quot; said <person>Nabila Popal</person>, senior research director at IDC's Mobile Phone Tracker. </p>\n<p>She warned that the sub-$100 smartphone segment, representing 171 million devices, will become &quot;permanently uneconomical&quot; even after memory prices stabilize by mid-2027.</p>\n<p> (Reporting by <person>Kritika Lamba</person> in Bengaluru; Editing by Shinjini Ganguli)</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602261408RTRSNEWSCOMBINED_KBN3PG2DY-OUSBS_1",
            "pub_date": "2026-02-27 03:08:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Research Alert: CFRA Reiterates Buy Opinion On Shares Of Royal Bank Of Canada",
            "description": "\n<p><chron>02:15 PM EST</chron>, <chron>02/26/2026</chron> (MT Newswires) -- CFRA, an independent research provider, has provided MT Newswires with the following research alert. Analysts at CFRA have summarized their opinion as follows:</p><p>We increase our 12-month target price by <money>USD23</money> to <money>USD223</money>, 17.4x our FY 27 (Oct.) EPS view of <money>CAD17.55</money> (<money>USD12.81</money>), a wider risk premium than the peer average of 12.7x given its scale and superior earnings profile. We raise our FY 26 EPS to <money>CAD16.10</money> from <money>CAD15.25</money> and increase FY 27's to <money>CAD17.55</money> from <money>CAD16.85</money>. While gross impaired loans (GILs) increased Y/Y in Q1, we've been encouraged by RY's performance since Liberation Day, as GILs have declined sequentially for two consecutive quarters. In the event of a Canadian recession, we expect RY's defensive positioning and diversified revenue streams to drive outperformance relative to peers. RY continues to outexecute the competition, with its adjusted ROE of 17.8% in Q1 2026 significantly exceeding many underperforming peers. The U.S. business, which has been a weak spot in recent years, is showing substantial improvement as turnaround efforts gain traction. To that point, City National's net income more than doubled Y/Y to <money>USD143 million</money> from <money>USD60 million</money>.</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/investing-ideas/202602261415MIDNIGHTUSEQUITY_A3574005",
            "pub_date": "2026-02-27 03:15:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Bombardier has chance to boost business jet sales in India, says CEO",
            "description": "\n<p><location value=\"LU/ca.qc.montrl\" idsrc=\"xmltag.org\" >MONTREAL</location>, <chron>Feb 26</chron> (Reuters) - <location value=\"LC/in\" idsrc=\"xmltag.org\" >India's</location> efforts to improve its airport infrastructure will give Bombardier a chance to boost sales of business jets there, chief executive officer <person>Eric Martel</person> said on Thursday.</p>\n<p>Martel told reporters that around 60 Bombardier jets were operating in <location value=\"LC/in\" idsrc=\"xmltag.org\" >India</location>, adding that one challenge the company faced was the limited infrastructure.</p>\n<p>&quot;The good news is that they are spending a lot of money these days. They're building a dozen airports as far as I know, and maybe even more,&quot; he told reporters.</p>\n<p>&quot;The whole infrastructure (investment) taking place over the next few years will definitely open doors for growth for us.&quot;</p>\n<p> (Reporting by <person>Allison Lampert</person>, editing by <person>David Ljunggren</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602261414RTRSNEWSCOMBINED_KBN3PG2EV-OUSBS_1",
            "pub_date": "2026-02-27 03:14:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Motiva Enterprises buys cargo of Venezuelan Boscan heavy crude for March delivery, sources say",
            "description": "\n<p><location value=\"LU/us.ny.nyc\" idsrc=\"xmltag.org\" >NEW YORK</location>, <chron>Feb 26</chron> (Reuters) - <org>Motiva Enterprises</org> has\nbought a cargo of Venezuelan Boscan crude for delivery in March,\nsources said on Thursday.</p>\n<p>The purchase of Venezuelan Boscan is the first by Motiva,\nsaid two of the sources.</p>\n<p>The cargo was purchased from <org value=\"CVX.NaE\" idsrc=\"xmltag.org\" >Chevron</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='CVX' fmr-param-security-type='Equity'>( CVX )</span>, one of the\nsources said.</p>\n<p>Motiva did not immediately respond to requests for comment.\n(Reporting by <person>Nicole Jao</person> in <location value=\"LU/us.ny.nyc\" idsrc=\"xmltag.org\" >New York</location>; Editing by <person>Chris Reese</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602261414RTRSNEWSCOMBINED_L6N3ZM17T_1",
            "pub_date": "2026-02-27 03:14:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "UK's FTSE 100 finishes at record high on Rolls-Royce, LSEG boost",
            "description": "\n<p>*</p>\n<p>FTSE 100 up 0.4%, FTSE 250 up 0.4%</p>\n<p></p>\n<p>*</p>\n<p>Rolls-Royce rises on strong earnings and raised targets</p>\n<p></p>\n<p>*</p>\n<p>Starmer faces close fight in <location value=\"LU/gb.eng.manchr\" idsrc=\"xmltag.org\" >Manchester</location> versus Reform,\nGreens</p>\n<p>(Updates to market close)</p>\n<p>By Tharuniyaa  Lakshmi</p>\n<p><chron>Feb 26</chron> (Reuters) - <location value=\"LC/gb\" idsrc=\"xmltag.org\" >Britain's</location> FTSE 100 hit a record high\non Thursday, supported by a rally in shares in Rolls-Royce after\nits forecast upgrade and in LSEG after its share buyback.</p>\n<p>Rolls-Royce rose 9.1% after reporting a 40% jump in\nannual profit, driven by strong demand for its aero-engines and\nrising power needs from data centres. British aerospace and\ndefence stocks rose to an all-time high following\nthe results.</p>\n<p>The blue-chip FTSE 100 index closed 0.4% higher at\n10,846.70 points, while the domestically focused mid-cap FTSE\n250 was also up 0.4%.</p>\n<p>The FTSE 100 has climbed 6% so far in February, on pace for\nits eighth straight monthly rise and outperforming its U.S. and\nEuropean peers, buoyed by investor bets on an additional <org>Bank of\nEngland</org> rate cut in March.</p>\n<p>&quot;It is likely that the UK index's outperformance is here to\nstay,&quot; <person>Axel Rudolph</person>, senior financial analyst at IG, said.</p>\n<p>Despite the UK blue-chip index's near 22% surge in 2025,\nmany of its companies remain on single-digit price-to-earnings\nratios, making them appealing to investors looking to cut\nexposure to highly valued U.S. tech, Rudolph added.</p>\n<p><org value=\"LDNXF.NaE\" idsrc=\"xmltag.org\" >London Stock Exchange Group</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='LDNXF' fmr-param-security-type='Equity'>( LDNXF )</span> jumped 6.7% after\nannouncing a share buyback plan at a time the company faces\npressure from activist investor Elliott Management and concerns\nthat AI will squeeze its business model.</p>\n<p>Information group <org value=\"RELX.NaE\" idsrc=\"xmltag.org\" >RELX</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='RELX' fmr-param-security-type='Equity'>( RELX )</span> gained 4.6% amid a broad\nrecovery in global software and data stocks which had been\nhammered earlier this month on AI disruption fears.</p>\n<p>AI bellwether <org value=\"NVDA.NaE\" idsrc=\"xmltag.org\" >Nvidia</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NVDA' fmr-param-security-type='Equity'>( NVDA )</span>, however, fell 5% as its\nupbeat results failed to lift sentiment for investors\nincreasingly concerned about the returns from massive spending\non AI.</p>\n<p>Investors also sifted through a slate of domestic corporate\nupdates.</p>\n<p><org value=\"HKMPF.NaE\" idsrc=\"xmltag.org\" >Hikma Pharmaceuticals</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='HKMPF' fmr-param-security-type='Equity'>( HKMPF )</span> slumped 15.8% to a\nmore-than-three-year low after the drugmaker forecast slower\nannual revenue growth.</p>\n<p>On the political front, Prime Minister <person>Keir Starmer</person> faces a\nbig test on Thursday when voters in <location value=\"LU/gb.eng.manchr\" idsrc=\"xmltag.org\" >Manchester</location> cast their\nballots for a new lawmaker in an election that polls say is too\nclose to call between the British leader's <org>Labour Party</org>,\npopulist Reform UK and the left-leaning Greens.\n(Reporting by Tharuniyaa Lakshmi in Bengaluru; Editing by <person>Leroy\nLeo</person> and <person>Andrew Heavens</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/international/202602261211RTRSNEWSCOMBINED_L6N3ZM113_1",
            "pub_date": "2026-02-27 01:11:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Sector Update: Tech Stocks Fall Thursday Afternoon",
            "description": "\n<p><chron>01:46 PM EST</chron>, <chron>02/26/2026</chron> (MT Newswires) -- Tech stocks were lower Thursday afternoon, with the State Street Technology Select Sector SPDR ETF (XLK) falling 2.2% and the State Street SPDR S&amp;P Semiconductor ETF (XSD) dropping 2.7%.</p><p>The Philadelphia Semiconductor index shed 4.2%.</p><p>In corporate news, <org value=\"NVDA.NaE\" idsrc=\"xmltag.org\" >Nvidia</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NVDA' fmr-param-security-type='Equity'>( NVDA )</span>  shares were down 5% even after it reported a year-on-year jump in fiscal Q4 adjusted earnings and revenue late Wednesday and issued a fiscal Q1 revenue outlook above analysts' expectations.</p><p><org value=\"AI.NaE\" idsrc=\"xmltag.org\" >C3.ai</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AI' fmr-param-security-type='Equity'>( AI )</span>  shares tumbled 20%. The company posted &quot;weaker than expected&quot; fiscal Q3 results with &quot;significant misses across the board,&quot; Wedbush said in a note Thursday.</p><p><org value=\"AAPL.NaE\" idsrc=\"xmltag.org\" >Apple</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AAPL' fmr-param-security-type='Equity'>( AAPL )</span>  is in discussions with major Indian banks and global card networks to launch Apple Pay in the country around mid-2026, <org>Bloomberg</org> reported. <org value=\"AAPL.NaE\" idsrc=\"xmltag.org\" >Apple</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AAPL' fmr-param-security-type='Equity'>( AAPL )</span> shares were down 0.9%.</p><p><org value=\"CRM.NaE\" idsrc=\"xmltag.org\" >Salesforce</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='CRM' fmr-param-security-type='Equity'>( CRM )</span>  shares rose 3.3% after it topped market estimates for its fiscal Q4 results.</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/us-markets/202602261346MIDNIGHTUSEQUITY_A3573986",
            "pub_date": "2026-02-27 02:46:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US mortgage rates dip below 6%, but supply remains key",
            "description": "<p><location value=\"LU/us.dc.wash\" idsrc=\"xmltag.org\" >WASHINGTON</location>, <chron>Feb 26</chron> (Reuters) - The average rate on the popular U.S. 30-year fixed-rate mortgage fell below 6% this week for the first time in 3-1/2 years, but economists said the improvement was likely temporary and on its own insufficient to boost housing demand unless supply increased.</p>\n<p>The 30-year fixed mortgage rate averaged 5.98%, the lowest level since <chron>September 2022</chron>, from 6.01% last week, mortgage finance agency Freddie Mac said on Thursday. It averaged 6.76% during the same period a year ago. </p>\n<p>The drop followed a decline in the benchmark 10-year U.S. Treasury yield after the <org>U.S. Supreme Court</org> on Friday struck down President <person>Donald Trump's</person> sweeping tariffs, which he had pursued under a law meant for use in national emergencies. </p>\n<p>Trump swiftly imposed a 10% global tariff for 150 days to replace some of the emergency duties, before raising the rate to 15% over the weekend. The 30-year fixed-rate mortgage tracks the 10-year Treasury yield.</p>\n<p>&quot;This legal tug-of-war has triggered a flight to safety among investors, pushing bond prices higher and yields lower, helping mortgage rates settle around 6%,&quot; said <person>Jiayi Xu</person>, an economist at Realtor.com. &quot;However, as this week's decline stems from market volatility rather than fundamental economic data, more supportive economic data is needed to establish a consistent trend.&quot;</p>\n<p>Trump ordered the <org>Federal Housing Finance Agency</org> - which oversees Freddie Mac and another mortgage finance giant Fannie Mae - to purchase <money>$200 billion</money> of bonds issued by the two companies to help lower the cost of home loans. </p>\n<p>But the average rate on the 15-year fixed-rate mortgage increased to 5.44% this week from 5.35% in the prior week. It averaged 5.94% during the same period a year ago. </p>\n<p>SUPPLY IS KEY FOR THE HOUSING MARKET</p>\n<p>Economists are skeptical that mortgage purchases will significantly improve housing affordability.</p>\n<p>Minutes of the Federal Reserve's <chron>January 27-28</chron> policy meeting published last week, describing a briefing by a New York Fed official responsible for implementing monetary policy, noted that plans by the administration to buy mortgage bonds had caused &quot;a notable decline in mortgage-backed securities yields relative to those on comparable-maturity Treasury yields.\"</p>\n<p>Despite that move in the market, the official &quot;observed that the decline was unlikely to result in a material increase in mortgage refinancing because current mortgage rates are well above the weighted average rate of outstanding mortgages,&quot; the minutes said.</p>\n<p>Trump is under pressure to bring down costs, including for housing, as he and his fellow Republicans face a tough battle to retain control of the <org>U.S. Congress</org> in this year's mid-term elections. Economists and policymakers say a dearth of properties for sale, especially starter homes, was weighing on the housing market. </p>\n<p>The inventory of previously owned houses is well below its pre-pandemic level. Many homeowners hold mortgages with rates below 5%, creating what has been called a rate-lock. </p>\n<p>Though supply improved last year, progress has stalled. There have been reports of homeowners pulling their houses off the market because of lower prices. House prices increased 1.8% in the 12 months through December after climbing 2.1% in November, the <org>Federal Housing Finance Agency</org> said on Tuesday. </p>\n<p>Economists and trade groups say the Trump administration's trade and immigration policies, which have raised prices for building materials and appliances and undercut labor supply, were constraining builders' ability to break ground on new single-family housing projects. Building lots are also scarce amid state and local government regulations.</p>\n<p>Still, the slowdown in the 30-year fixed mortgage rate could encourage some potential sellers to list their homes, and draw prospective home buyers into the market.</p>\n<p>&quot;While buying power has already increased <money>$30,000</money> from last year, mortgage rates below 6% could be an important psychological threshold,&quot; said <person>Kara Ng</person>, senior economist at Zillow. &quot;Round numbers matter, and that headline alone could prompt many sidelined buyers to take another peek at the housing market.&quot; </p>\n<p></p>\n<p>(Reporting by Lucia Mutikani, additional reporting by <person>Michael S. Derby</person> and <person>Saeed Azhar</person>; Editing by <person>Chizu Nomiyama</person> and <person>Mark Porter</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/us-economy/202602261354RTRSNEWSCOMBINED_KBN3PG2D7-OUSBS_1",
            "pub_date": "2026-02-27 02:54:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US mortgage rates dip below 6%, but supply remains key",
            "description": "<p><location value=\"LU/us.dc.wash\" idsrc=\"xmltag.org\" >WASHINGTON</location>, <chron>Feb 26</chron> (Reuters) - The average rate on the popular U.S. 30-year fixed-rate mortgage fell below 6% this week for the first time in 3-1/2 years, but economists said the improvement was likely temporary and on its own insufficient to boost housing demand unless supply increased.</p>\n<p>The 30-year fixed mortgage rate averaged 5.98%, the lowest level since <chron>September 2022</chron>, from 6.01% last week, mortgage finance agency Freddie Mac said on Thursday. It averaged 6.76% during the same period a year ago. </p>\n<p>The drop followed a decline in the benchmark 10-year U.S. Treasury yield after the <org>U.S. Supreme Court</org> on Friday struck down President <person>Donald Trump's</person> sweeping tariffs, which he had pursued under a law meant for use in national emergencies. </p>\n<p>Trump swiftly imposed a 10% global tariff for 150 days to replace some of the emergency duties, before raising the rate to 15% over the weekend. The 30-year fixed-rate mortgage tracks the 10-year Treasury yield.</p>\n<p>&quot;This legal tug-of-war has triggered a flight to safety among investors, pushing bond prices higher and yields lower, helping mortgage rates settle around 6%,&quot; said <person>Jiayi Xu</person>, an economist at Realtor.com. &quot;However, as this week's decline stems from market volatility rather than fundamental economic data, more supportive economic data is needed to establish a consistent trend.&quot;</p>\n<p>Trump ordered the <org>Federal Housing Finance Agency</org> - which oversees Freddie Mac and another mortgage finance giant Fannie Mae - to purchase <money>$200 billion</money> of bonds issued by the two companies to help lower the cost of home loans. </p>\n<p>But the average rate on the 15-year fixed-rate mortgage increased to 5.44% this week from 5.35% in the prior week. It averaged 5.94% during the same period a year ago. </p>\n<p>SUPPLY IS KEY FOR THE HOUSING MARKET</p>\n<p>Economists are skeptical that mortgage purchases will significantly improve housing affordability.</p>\n<p>Minutes of the Federal Reserve's <chron>January 27-28</chron> policy meeting published last week, describing a briefing by a New York Fed official responsible for implementing monetary policy, noted that plans by the administration to buy mortgage bonds had caused &quot;a notable decline in mortgage-backed securities yields relative to those on comparable-maturity Treasury yields.\"</p>\n<p>Despite that move in the market, the official &quot;observed that the decline was unlikely to result in a material increase in mortgage refinancing because current mortgage rates are well above the weighted average rate of outstanding mortgages,&quot; the minutes said.</p>\n<p>Trump is under pressure to bring down costs, including for housing, as he and his fellow Republicans face a tough battle to retain control of the <org>U.S. Congress</org> in this year's mid-term elections. Economists and policymakers say a dearth of properties for sale, especially starter homes, was weighing on the housing market. </p>\n<p>The inventory of previously owned houses is well below its pre-pandemic level. Many homeowners hold mortgages with rates below 5%, creating what has been called a rate-lock. </p>\n<p>Though supply improved last year, progress has stalled. There have been reports of homeowners pulling their houses off the market because of lower prices. House prices increased 1.8% in the 12 months through December after climbing 2.1% in November, the <org>Federal Housing Finance Agency</org> said on Tuesday. </p>\n<p>Economists and trade groups say the Trump administration's trade and immigration policies, which have raised prices for building materials and appliances and undercut labor supply, were constraining builders' ability to break ground on new single-family housing projects. Building lots are also scarce amid state and local government regulations.</p>\n<p>Still, the slowdown in the 30-year fixed mortgage rate could encourage some potential sellers to list their homes, and draw prospective home buyers into the market.</p>\n<p>&quot;While buying power has already increased <money>$30,000</money> from last year, mortgage rates below 6% could be an important psychological threshold,&quot; said <person>Kara Ng</person>, senior economist at Zillow. &quot;Round numbers matter, and that headline alone could prompt many sidelined buyers to take another peek at the housing market.&quot; </p>\n<p></p>\n<p>(Reporting by Lucia Mutikani, additional reporting by <person>Michael S. Derby</person> and <person>Saeed Azhar</person>; Editing by <person>Chizu Nomiyama</person> and <person>Mark Porter</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/top-news/202602261354RTRSNEWSCOMBINED_KBN3PG2D7-OUSBS_1",
            "pub_date": "2026-02-27 03:05:42",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Belfry Announces Strategic Partnership with Willis and Kayna to Support Physical Security Providers",
            "description": "\n<div class=\"xn-content\">\n<p><span class=\"legendSpanClass\"><location value=\"LU/us.ny.nyc\" idsrc=\"xmltag.org\" >NEW YORK</location></span>, <span class=\"legendSpanClass\"><chron>Feb. 26, 2026</chron></span> /PRNewswire/ -- <org>Belfry Software</org>, a modern platform for physical security providers, has partnered with Willis, a WTW business , to launch a digital insurance program tailored for Belfry customers. The program pairs Willis insurance expertise with award-winning Kayna insurance technology to deliver data-led, streamlined insurance solutions.</p>\n    <div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder1\">\n                <p>\n\n                    <img src=\"https://mma.prnewswire.com/media/2603420/Belfry_Logo_Indigo_Logo.jpg\" title=\"belfrysoftware.com (PRNewsfoto/Belfry)\" alt=\"belfrysoftware.com (PRNewsfoto/Belfry)\" />\n\n                </p>\n    </div>\n<p>Belfry has transformed how security businesses operate by consolidating critical functions, including scheduling, timekeeping, payroll, billing, and more, into a single, integrated solution.</p><p>Willis is one of the world's leading insurance brokers and will serve as the placing broker for the program.</p><p>Kayna, Willis' technology partner, enables the distribution of Willis' security services insurance to Belfry customers by integrating a seamless insurance portal directly within the Belfry platform. Willis will utilize Kayna's technology to leverage real-time data to pre-fill forms and support quoting, saving users time and simplifying the procurement process.</p><p>As a result of this collaboration, an insurance portal will be included in the Belfry dashboard where customers can easily apply and receive a no-obligation insurance quote.</p><p class=\"prnml40\">\"At Belfry, we're building an all-in-one platform designed around the day-to-day realities of running a security company,\" said <person>Jordan Wallach</person>, Co-Founder &amp; CEO of Belfry. \"One of those realities is how difficult managing business insurance has been. It often takes weeks to gather and format the right payroll data for applications and audits, companies face surprise year-end adjustments because premiums are based on outdated payroll estimates, and finding the right coverage for complex risks isn't easy. By partnering Belfry's industry-specific payroll solution with Willis and Kayna, we're excited to help address challenges that have historically been a real pain for owners.\"</p><p>Willis has a team of insurance experts dedicated to ensuring Belfry customers can purchase robust coverage.</p><p>\"As part of our strategy to deliver tech-enabled insurance solutions, we're excited to partner with Belfry to embed coverage seamlessly into the security operator journey,\" stated <person>Paul Lubbers</person>, Head of US Affinity at Willis. \"Together, we aim to accelerate quoting and minimize premium audit risk, both of which are critical pain points and areas for improvements in the security industry.\" The partners share a commitment to support the success of Belfry customers by making it easier than ever to secure the right insurance coverage with minimal hassle so physical security operators can focus on their job with confidence.</p><p><person>Paul Prendergast</person>, Co-Founder &amp; CEO of Kayna concluded, \"Backed by decades of Willis experience and expertise in underwriting and claims management, Belfry is taking an industry lead on delivering data-driven insurance and market choice for their platform customers. This is a winning formula for a great partnership and one that I'm delighted to see powered by Kayna technology.\"</p><p><b>About Belfry</b></p><p>Belfry is an operating system built specifically for security guard services, helping security companies manage scheduling, field supervision, officer performance, compliance, communications, and back-office operations in one platform. Belfry works with security guard firms across <location value=\"LC/us\" idsrc=\"xmltag.org\" >the United States</location> to reduce manual work, improve operational visibility, protect profitability, and scale services more efficiently.</p><p>For more information about Belfry and its solutions, visit <b><u>www.belfrysoftware.com</u></b>.</p><p><b>About WTW </b></p><p>At WTW , we provide data-driven, insight-led solutions in the areas of people, risk and capital. Leveraging the global view and local expertise of our colleagues serving 140 countries and markets, we help organizations sharpen their strategy, enhance organizational resilience, motivate their workforce and maximize performance.</p><p>Working shoulder to shoulder with our clients, we uncover opportunities for sustainable success and provide perspective that moves you.</p><p><b>About Kayna</b></p><p>Kayna enables embedded insurance through vertical SaaS platforms. It provides the technology and data orchestration layer between carriers, brokers and any vertical SaaS platform to distribute insurance products that are directly relevant to platform customers.</p>\n\n\n\n<p id=\"PURL\"><img title=\"Cision\" width=\"12\" height=\"12\" alt=\"Cision\" src=\"https://edge.prnewswire.com/c/img/favicon.png?sn=NY97095&amp;sd=2026-02-26\" /> View original content to download multimedia:https://www.prnewswire.com/news-releases/belfry-announces-strategic-partnership-with-willis-and-kayna-to-support-physical-security-providers-302698797.html</p><p>SOURCE Belfry</p></div>\n",
            "link": "https://www.fidelity.com/news/article/technology/202602261400PR_NEWS_USPR_____NY97095",
            "pub_date": "2026-02-27 03:00:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Salesforce Stock Climbs Thursday: What's Going On?",
            "description": "\n<p><strong><org value=\"CRM.NaE\" idsrc=\"xmltag.org\" >Salesforce Inc</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='CRM' fmr-param-security-type='Equity'>( CRM )</span></strong> shares are climbing on Thursday after the company delivered a stronger‑than‑expected fourth quarter, boosted its dividend, launched a massive <money>$50 billion</money> buyback plan and issued guidance that topped <location>Wall Street</location> expectations.</p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><org value=\"CRM.NaE\" idsrc=\"xmltag.org\" >Salesforce</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='CRM' fmr-param-security-type='Equity'>( CRM )</span> stock is moving in positive territory. Why is CRM stock trading higher?</li>\n</ul>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Stronger‑Than‑Expected Q4 Results Lift Confidence</strong></h2>\n\n\n\n<p><org value=\"CRM.NaE\" idsrc=\"xmltag.org\" >Salesforce</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='CRM' fmr-param-security-type='Equity'>( CRM )</span> reported fourth‑quarter revenue of <money>$11.2 billion</money>, edging past forecasts, while adjusted earnings of <money>$3.81</money> per share came in far above the expected <money>$3.04</money>. Revenue grew 12% from a year ago, and remaining performance obligations reached <money>$72.4 billion</money>, up 14%.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Solid Outlook And Major Capital Return Plan</h2>\n\n\n\n<p>The company raised its quarterly dividend to <money>44 cents</money> per share and introduced a new <money>$50 billion</money> share repurchase program, replacing all previous authorizations.</p>\n\n\n\n<p><org value=\"CRM.NaE\" idsrc=\"xmltag.org\" >Salesforce</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='CRM' fmr-param-security-type='Equity'>( CRM )</span> also issued upbeat guidance. For the first-quarter, the company expects revenue between <money>$11.03 billion</money> and <money>$11.08 billion</money>, above analyst estimates, and adjusted earnings of <money>$3.11</money> to <money>$3.13</money> per share. For fiscal 2027, the company projects revenue of <money>$45.8 billion</money> to <money>$46.2 billion</money> and adjusted earnings of <money>$13.11</money> to <money>$13.19</money> per share.</p>\n\n\n\n<p>CEO<strong> <person>Marc Benioff</person></strong> noted that AI remains a major growth driver and reiterated <org value=\"CRM.NaE\" idsrc=\"xmltag.org\" >Salesforce's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='CRM' fmr-param-security-type='Equity'>( CRM )</span> long‑term goal of reaching <money>$63 billion</money> in revenue by fiscal 2030.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Analysts Stay Positive Despite Lower Price Targets</h2>\n\n\n\n<p>Following the company&#8217;s quarterly results, several analysts maintained positive ratings, but lowered price targets on the stock. Here&#8217;s a look at some of the most notable changes from Thursday.</p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>Piper Sandler analyst <person>Billy Fitzsimmons</person> reiterated an Overweight and lowered the price target from $280 to $250.</li>\n</ul>\n\n\n\n<ul class=\"wp-block-list\">\n<li>Wedbush analyst <person>Dan Ives</person> maintained an Outperform and lowered the price target from $375 to $325.</li>\n</ul>\n\n\n\n<ul class=\"wp-block-list\">\n<li>Needham analyst <person>Scott Berg</person> reiterated a Buy and maintained a $400 price target.</li>\n</ul>\n\n\n\n<ul class=\"wp-block-list\">\n<li>Wells Fargo analyst <person>Michael Turrin</person> maintained an Equal-Weight and lowered the price target from $235 to $210.</li>\n</ul>\n\n\n\n<ul class=\"wp-block-list\">\n<li>Oppenheimer analyst <person>Brian Schwartz</person> maintained an Outperform and lowered the price target from $275 to $250.</li>\n</ul>\n\n\n\n<ul class=\"wp-block-list\">\n<li><org>BMO Capital</org> analyst <person>Keith Bachman</person> maintained an Outperform and lowered the price target from $235 to $225.</li>\n</ul>\n\n\n\n<ul class=\"wp-block-list\">\n<li>TD Cowen analyst <person>Derrick Wood</person> maintained a Buy and lowered the price target from $325 to $250.</li>\n</ul>\n\n\n\n<p><strong>CRM Price Action:</strong> <org value=\"CRM.NaE\" idsrc=\"xmltag.org\" >Salesforce</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='CRM' fmr-param-security-type='Equity'>( CRM )</span> shares were up 3.33% at <money>$198.14</money> at the time of publication on Thursday, according to Benzinga Pro.</p>\n\n\n\n<p><em>Image: JackPress/Shutterstock</em></p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602261358BENZINGAFULLNGTH50903634",
            "pub_date": "2026-02-27 02:58:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "New Era Energy & Digital Strengthens Integrated Power Positioning at TCDC with Strategic 54-Acre Corridor LOI",
            "description": "\n<p>    <location value=\"LU/us.tx.midand\" idsrc=\"xmltag.org\" >MIDLAND, Texas</location>--(BUSINESS WIRE)--\n<org value=\"NUAI.NaE\" idsrc=\"xmltag.org\" >New Era Energy &amp; Digital, Inc.</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NUAI' fmr-param-security-type='Equity'>( NUAI )</span> (“New Era” or the “Company”), a developer and operator of next-generation digital infrastructure and integrated power assets in the <location>Permian Basin</location>, today announced it has entered into a non-binding Letter of Intent (\"LOI\") to acquire approximately 54 acres of strategically located land adjacent to its Texas Critical Data Centers (“TCDC”) campus in <location value=\"LU/us.tx.ector\" idsrc=\"xmltag.org\" >Ector County, Texas</location>.\n\n</p><p id=\"news-body-cta\">This press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20260226055146/en/</p><p>\nThe contemplated acquisition was undertaken as part of ongoing lease negotiations with a leading hyperscale tenant and partners, where securing the additional acreage emerged as a key milestone in advancing discussions. This development is accompanied by continued site advancement, including initial land clearing, removal of out-of-service and abandoned pipeline infrastructure, relocation of active lines, and subsurface soil sampling to support civil engineering design. These activities are intended to optimize the developable footprint and maximize usable acreage for data center deployment.\n\n</p><p>\nBy seeking to consolidate this corridor, New Era is looking to enhance its ability to structure direct power solutions and optimize interconnection design as it advances development of its now 438-acre, master-planned TCDC campus, which is designed to scale to more than 1 gigawatt over time.\n\n</p><p>\nThe additional acreage would expand New Era’s capacity to:\n\n</p><ul class=\"bwlistdisc\">\n<li>\nDirectly on next for major power offtake arrangements with nearby energy generation and transport infrastructure\n\n</li>\n<li>\nNegotiate more efficient and flexible interconnection structures\n\n</li>\n<li>\nReduce exposure to broader grid congestion and transmission constraints; and\n\n</li>\n<li>\nEnhance redundancy, reliability, and long-term expansion flexibility\n\n</li>\n</ul><p>\nThe Company expects control of the corridor between operating generation assets and its campus footprint may potentially increase New Era’s negotiating leverage with power producers while improving development sequencing. It also expands the Company’s options for transmission access and energy integration, which are critical for hyperscale and high-performance computing tenants requiring scalable, resilient power infrastructure.\n\n</p><p>\n<person>E. Will Gray II</person>, CEO of <org value=\"NUAI.NaE\" idsrc=\"xmltag.org\" >New Era Energy &amp; Digital</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NUAI' fmr-param-security-type='Equity'>( NUAI )</span> commented: “By taking the first step to secure this additional 54 acres, we are seeking to strengthen our strategic land position between major power generation and transmission assets and take a pivotal step toward finalizing a definitive lease agreement with our end tenant. This transaction would further reinforce TCDC’s positioning as an integrated power and digital infrastructure platform designed for long-term expansion and operational reliability.”\n\n</p><p>\n<b>About <org value=\"NUAI.NaE\" idsrc=\"xmltag.org\" >New Era Energy &amp; Digital, Inc.</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NUAI' fmr-param-security-type='Equity'>( NUAI )</span>\n<br /></b><org value=\"NUAI.NaE\" idsrc=\"xmltag.org\" >New Era Energy &amp; Digital, Inc.</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NUAI' fmr-param-security-type='Equity'>( NUAI )</span> is a developer and operator of next-generation digital infrastructure and integrated power assets. The Company is developing <org>Texas Critical Data Centers LLC</org> (“TCDC”), a 438 acre large-scale AI and high-performance computing data center campus located in <location value=\"LU/us.tx.ector\" idsrc=\"xmltag.org\" >Ector County</location>, outside <location value=\"LU/us.tx.odessa\" idsrc=\"xmltag.org\" >Odessa, Texas</location>. TCDC is master-planned as a multi-phase development, with anticipated capacity scaling to 1+ gigawatt over time. With a growing portfolio of strategically located, vertically integrated resources including powered land and powered shells, the Company delivers turnkey solutions that enable hyperscale, enterprise, and edge operators to accelerate data center deployment, optimize total cost of ownership, and future-proof their infrastructure investments. For more information, visit: www.newerainfra.ai, and follow <org value=\"NUAI.NaE\" idsrc=\"xmltag.org\" >New Era Energy &amp; Digital</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NUAI' fmr-param-security-type='Equity'>( NUAI )</span> on LinkedIn and X.\n\n</p><p>\n<b>Cautionary Note Regarding Forward-Looking Statements\n<br /></b>This press release contains “forward-looking statements.” Forward-looking statements reflect the current view about future events. When used in this press release, the words “anticipate,” “believe,” “estimate,” “expect,” “future,” “intend,” “plan” or the negative of these terms and similar expressions, as they relate to us or our management, identify forward-looking statements. Such statements include, but are not limited to, statements contained in this press release relating to our business strategy, our future operating results and liquidity and capital resources outlook. Forward-looking statements are based on our current expectations and assumptions regarding our business, the economy and other future conditions. Because forward-looking statements relate to the future, they are subject to inherent uncertainties, risks and changes in circumstances that are difficult to predict. Our actual results may differ materially from those contemplated by the forward-looking statements. They are neither statements of historical fact nor guarantees of assurance of future performance. We caution you therefore against relying on any of these forward-looking statements. Important factors that could cause actual results to differ materially from those in the forward-looking statements include, without limitation: (a) our ability to effectively operate our business segments; (b) our ability to manage our research, development, expansion, growth and operating expenses; (c) our ability to evaluate and measure our business, prospects and performance metrics; (d) our ability to compete, directly and indirectly, and succeed in a highly competitive and evolving industry; (e) our ability to respond and adapt to changes in technology and customer behavior; (f) our ability to protect our intellectual property and to develop, maintain and enhance a strong brand; and (g) other factors (including the risks contained in the “Risk Factors” section of our Annual Report on Form 10-K for the fiscal year ended <chron>December 31, 2024</chron>). Should one or more of these risks or uncertainties materialize, or should the underlying assumptions prove incorrect, actual results may differ significantly from those anticipated, believed, estimated, expected, intended or planned. Factors or events that could cause our actual results to differ may emerge from time to time, and it is not possible for us to predict all of them. We cannot guarantee future results, levels of activity, performance or achievements. Except as required by applicable law, including the securities laws of <location value=\"LC/us\" idsrc=\"xmltag.org\" >the United States</location>, we do not intend to update any of the forward-looking statements to conform these statements to actual results.\n\n</p><p><img alt=\"\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20260226055146r1&amp;sid=acqr8&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\" /><span class=\"bwct31415\" /></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\">https://www.businesswire.com/news/home/20260226055146/en/</span></p>\n<p>Source: <org value=\"NUAI.NaE\" idsrc=\"xmltag.org\" >New Era Energy &amp; Digital, Inc.</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NUAI' fmr-param-security-type='Equity'>( NUAI )</span></p>\n",
            "link": "https://www.fidelity.com/news/article/mergers-and-acquisitions/202602261400BIZWIRE_USPR_____20260226_BW055146",
            "pub_date": "2026-02-27 03:00:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Top Midday Decliners",
            "description": "\n<p><chron>01:38 PM EST</chron>, <chron>02/26/2026</chron> (MT Newswires) -- <org value=\"EOSE.NaE\" idsrc=\"xmltag.org\" >Eos Energy Enterprises</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='EOSE' fmr-param-security-type='Equity'>( EOSE )</span>  shares slumped 38% amid heavy trading after the company reported a larger-than-expected quarterly loss and revenue on Thursday that missed analysts' forecasts.</p><p>More than 116.4 million shares of the company traded intraday compared with a daily average of about 18.2 million.</p><p><org value=\"PRCT.NaE\" idsrc=\"xmltag.org\" >Procept BioRobotics</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='PRCT' fmr-param-security-type='Equity'>( PRCT )</span>  reported late Wednesday a wider Q4 net loss, and <org>BofA Securities</org> downgraded the company's stock to underperform from neutral.</p><p>Shares slumped 18% as intraday trading volume jumped to over 6 million from a daily average of about 1.26 million.</p><p>The <org value=\"TTD.NaE\" idsrc=\"xmltag.org\" >Trade Desk</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='TTD' fmr-param-security-type='Equity'>( TTD )</span>  stock slumped a day after the company issued lower-than-expected Q1 revenue guidance.</p><p>Shares fell 5.2%, with intraday trading volume at over 39.2 million versus a daily average of roughly 13.6 million.</p><p>Price: 6.89, Change: -4.25, Percent Change: -38.14</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/us-markets/202602261338MIDNIGHTUSEQUITY_A3573978",
            "pub_date": "2026-02-27 02:38:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Sector Update: Energy",
            "description": "\n<p><chron>01:41 PM EST</chron>, <chron>02/26/2026</chron> (MT Newswires) -- Energy stocks were higher Thursday afternoon, with the NYSE Energy Sector Index rising 0.4% and the State Street Energy Select Sector SPDR ETF (XLE) adding 0.6%.</p><p>The Philadelphia Oil Service Sector Index was decreasing 0.8%, and the Dow Jones US Utilities Index was  easing 0.2%.</p><p>Front-month West Texas Intermediate crude oil was rising 1.1% to <money>$66.12</money> a barrel, and the global benchmark Brent crude contract was advancing 1.1% to <money>$71.67</money> a barrel. Henry Hub natural gas futures fell 1.9% to <money>$2.81</money> per 1 million BTU.</p><p>In corporate news, Eni (E) shares rose 2.4% after it reported Thursday Q4 sales from operations of <money>20.62 billion euros</money> (<money>$24.3 billion</money>), down from <money>23.49 billion euros</money> a year earlier but above analysts' estimates.</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/us-markets/202602261341MIDNIGHTUSEQUITY_A3573984",
            "pub_date": "2026-02-27 02:41:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Mexico's Salinas-controlled TV Azteca announces bankruptcy proceedings",
            "description": "\n<p><location value=\"LU/mx.sm.mexcty\" idsrc=\"xmltag.org\" >MEXICO CITY</location>, <chron>Feb 26</chron> (Reuters) - Mexican broadcaster TV\nAzteca said on Thursday that shareholders had approved a\nvoluntary bankruptcy process for restructuring the company's\nfinances and liabilities.</p>\n<p>TV Azteca, controlled by Mexican business magnate <person>Ricardo\nSalinas Pliego</person>, blamed the bankruptcy process on multiple\nfactors: the recent payment of nearly <money>$2 billion</money> in back taxes\nto Mexican authorities, a &quot;complex negotiation&quot; with\ninternational creditors, the pandemic and the impact of license\npayments to the government in 2018.</p>\n<p>The company also pointed to &quot;profound transformations&quot; in\nthe television industry, including changes in the advertising\nmarket. TV Azteca is one of <location value=\"LC/mx\" idsrc=\"xmltag.org\" >Mexico's</location> most-watched broadcasters.</p>\n<p>\"This is a last-resort tool aimed at preserving the value of\nthe company, ensuring the continuity of its operations, and\nfacilitating the orderly fulfillment of its obligations without\ninterrupting its functioning,\" <person>Rafael Rodriguez</person>, TV Azteca's\nCEO, said in a statement.</p>\n<p>Trading in the broadcaster's shares on the <org>Mexican stock\nexchange</org> has been suspended since 2023, when the company failed\nto file its corporate results.\nSalinas, a conservative, has had fights with left-wing President\n<person>Claudia Sheinbaum</person> and her allies over the past year amid a\npublic feud over his back taxes. Sheinbaum repeatedly accused\nSalinas of being a tax dodger; he accused the government of\nextortion.</p>\n<p>Sheinbaum's government had threatened to seize assets and\nrevoke broadcast licenses if Salinas did not pay. The president\nhas made an aggressive push to increase tax revenue to fund an\nexpanding slate of social programs.</p>\n<p>Last month, Salinas' conglomerate <person>Grupo Salinas</person> said it\nwould pay <money>32 billion Mexican pesos</money> (<money>$1.86 billion</money>) to conclude\n20 years of tax disputes with the Mexican government. Sheinbaum\nhad previously said his companies owed more than <money>$4 billion</money>.</p>\n<p>(<money>$1</money> = <money>17.2340 Mexican pesos</money>)\n(Reporting by <person>Raul Castro</person> and <person>Brendan O'Boyle</person>; Editing by <person>Emily\nGreen</person>, <person>Rod Nickel</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602261335RTRSNEWSCOMBINED_L1N3ZM13B_1",
            "pub_date": "2026-02-27 02:35:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Market Chatter: Versant Media's CNBC Unit to Merge TV, Digital Operations",
            "description": "\n<p><chron>01:43 PM EST</chron>, <chron>02/26/2026</chron> (MT Newswires) -- <org value=\"VSNT.NaE\" idsrc=\"xmltag.org\" >Versant Media</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='VSNT' fmr-param-security-type='Equity'>( VSNT )</span>  unit CNBC is reorganizing its newsroom to combine television and digital operations as it prepares to implement a paywall on its website, leading to about a dozen job cuts, Reuters reported Thursday, citing sources familiar with the matter.</p><p>Among those who departed is website managing editor <person>Jeff McCracken</person>, Reuters said, adding that the layoffs were not intended to cut costs as CNBC plans to add about 40 roles in the coming year.</p><p><org value=\"VSNT.NaE\" idsrc=\"xmltag.org\" >Versant Media</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='VSNT' fmr-param-security-type='Equity'>( VSNT )</span> was spun out of <org value=\"CMCSA.NaE\" idsrc=\"xmltag.org\" >Comcast</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='CMCSA' fmr-param-security-type='Equity'>( CMCSA )</span>  in January.</p><p><org value=\"VSNT.NaE\" idsrc=\"xmltag.org\" >Versant Media</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='VSNT' fmr-param-security-type='Equity'>( VSNT )</span> and <org value=\"CMCSA.NaE\" idsrc=\"xmltag.org\" >Comcast</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='CMCSA' fmr-param-security-type='Equity'>( CMCSA )</span> did not immediately respond to MT Newswires' requests for comment.</p><p>(Market Chatter news is derived from conversations with market professionals globally. This information is believed to be from reliable sources but may include rumor and speculation. Accuracy is not guaranteed.)</p><p>Price: 31.86, Change: +0.86, Percent Change: +2.77</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602261343MIDNIGHTUSEQUITY_A3573967",
            "pub_date": "2026-02-27 02:43:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Exchange-Traded Funds Fall as US Equities Drop After Midday",
            "description": "\n<p><chron>01:19 PM EST</chron>, <chron>02/26/2026</chron> (MT Newswires) -- Broad Market Indicators</p><p>Broad-market exchange-traded funds IWM and IVV were lower. Actively traded <org>Invesco QQQ Trust</org> (QQQ) lost 1.8%.</p><p>US equity indexes fell midday Thursday amid a sell-off in semiconductor companies, pushing technology lower after <org value=\"NVDA.NaE\" idsrc=\"xmltag.org\" >Nvidia</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NVDA' fmr-param-security-type='Equity'>( NVDA )</span>  reported quarterly results overnight.</p><p>Energy</p><p>IShares US Energy ETF (IYE) and the State Street Energy Select Sector SPDR (XLE) each rose about 0.9%.</p><p>Technology</p><p>The State Street Technology Select Sector SPDR ETF (XLK) fell 2.1%; iShares US Technology ETF (IYW) and iShares Expanded Tech Sector ETF (IGM) were also lower.</p><p>The State Street SPDR S&amp;P Semiconductor (XSD) dropped 2.7%, and iShares Semiconductor (SOXX) was down 4%.</p><p>Financial</p><p>The State Street Financial Select Sector SPDR (XLF) rose 0.5%. Direxion Daily Financial Bull 3X Shares (FAS) climbed 1.8%, and its bearish counterpart, Direxion Daily Financial Bear 3X Shares (FAZ), fell 1.5%.</p><p>Commodities</p><p>Crude oil added 1.7%, and the United States Oil Fund (USO) was up 1.5%. Natural gas fell 2.5%, and the United States Natural Gas Fund (UNG) lost 2.7%.</p><p>Gold on Comex fell 0.8%, and the State Street SPDR Gold Shares (GLD) rose 0.3%. Silver lost 4.9%, and iShares Silver Trust (SLV) was down 1.9%.</p><p>Consumer</p><p>The State Street Consumer Staples Select Sector SPDR (XLP) shed 0.4%. The Vanguard Consumer Staples ETF (VDC) fell while iShares Dow Jones US Consumer Goods (IYK) was up.</p><p>The State Street Consumer Discretionary Select Sector SPDR (XLY) fell 0.7%. VanEck Retail ETF (RTH) lost 0.4%, and the State Street SPDR S&amp;P Retail (XRT) rose 0.6%.</p><p>Health Care</p><p>The State Street Health Care Select Sector SPDR (XLV) was down 1.1%, and iShares <org>US Healthcare</org> (IYH) and Vanguard Health Care ETF (VHT) declined. IShares Biotechnology ETF (IBB) fell 2.5%.</p><p>Industrial</p><p>The State Street Industrial Select Sector SPDR (XLI) was steady. Vanguard Industrials Index Fund (VIS) fell, while iShares US Industrials (IYJ) was little changed.</p><p>Cryptocurrency</p><p>In midday activity, bitcoin (BTC-USD) fell 3.3%. Among cryptocurrency ETFs, <org value=\"BITO.NaE\" idsrc=\"xmltag.org\" >ProShares Bitcoin ETF</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='BITO' fmr-param-security-type='Equity'>( BITO )</span>  lost 3.4%, <org value=\"EETH.NaE\" idsrc=\"xmltag.org\" >ProShares Ether ETF</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='EETH' fmr-param-security-type='Equity'>( EETH )</span>  fell 4.3%, and <org value=\"BETH.NaE\" idsrc=\"xmltag.org\" >ProShares Bitcoin &amp; Ether Market Cap Weight ETF</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='BETH' fmr-param-security-type='Equity'>( BETH )</span>  shed 3.7%.</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/us-markets/202602261319MIDNIGHTUSEQUITY_A3573957",
            "pub_date": "2026-02-27 02:19:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        }
    ]
}