{
    "data": [
        {
            "title": "Strategic Storage Trust VI, Inc. Expands in Toronto With New Class A Facility",
            "description": "\n<p>    <location value=\"LU/us.ca.ladnch\" idsrc=\"xmltag.org\" >LADERA RANCH, Calif.</location>--(BUSINESS WIRE)--\n<b><org>Strategic Storage Trust VI, Inc.</org> </b><b>(“SST VI”),</b> a publicly registered non-traded real estate investment trust sponsored by an affiliate of <org value=\"SMA.NaE\" idsrc=\"xmltag.org\" >SmartStop Self Storage REIT, Inc.</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='SMA' fmr-param-security-type='Equity'>( SMA )</span> (“SmartStop”) , announced the opening of a new Class A self-storage facility in <location value=\"LU/ca.on.tornto\" idsrc=\"xmltag.org\" >Toronto, Ontario</location>.\n\n</p><p>\nLocated at <location>1983 Kipling Ave.</location>, the new facility reflects the company’s long-term commitment to growing its Canadian platform through high-quality development in dense, supply-constrained urban markets.\n\n</p><p>\nThe five-story, climate-controlled facility offers approximately 90,300 net rentable square feet and features modern design, enhanced security, multiple elevators, and large indoor loading bays for convenient access throughout the building. The property is purpose-built to serve both residential and commercial customers seeking a secure, professionally managed storage solution.\n\n</p><p>\nStrategically positioned with convenient access from <location>Highway 401</location> and <location>Kipling Avenue</location>, the property benefits from strong visibility within a high-traffic commercial corridor that sees approximately 400,000 vehicles pass daily. The surrounding trade area includes nearly 600,000 residents within a five-mile radius, with approximately 45% of households within three miles being renter-occupied, supporting sustained demand for self-storage.\n\n</p><p>\nThe facility will serve customers across <location value=\"LU/ca.on.tornto\" idsrc=\"xmltag.org\" >Toronto</location>, Rexdale, <location value=\"LU/ca.on.misuga\" idsrc=\"xmltag.org\" >Mississauga</location>, <location value=\"LU/ca.on.braton\" idsrc=\"xmltag.org\" >Brampton</location>, <location value=\"LU/ca.on.vauhan\" idsrc=\"xmltag.org\" >Vaughan</location>, <location value=\"LU/ca.on.woodge\" idsrc=\"xmltag.org\" >Woodbridge</location>, and <location value=\"LU/ca.on.norork\" idsrc=\"xmltag.org\" >North York</location>, providing modern storage solutions in one of the Greater Toronto Area’s most dynamic and densely populated corridors.\n\n</p><p>\n“This new <location value=\"LU/ca.on.tornto\" idsrc=\"xmltag.org\" >Toronto</location> facility reflects our continued focus on expanding in high-growth, high-density markets with strong fundamentals,” said <person>H. Michael Schwartz</person>, President and CEO of <org>Strategic Storage Trust VI, Inc.</org> “With its premier location, modern design, and strong demographic profile, we believe this property is well-positioned to meet the storage needs of residents and businesses throughout the surrounding communities.”\n\n</p><p>\n<b>About <org>Strategic Storage Trust VI, Inc.</org> (SST VI):</b>\n\n</p><p>\nSST VI is a public non-traded REIT that elected to qualify as a REIT for federal income tax purposes. SST VI’s primary investment strategy is to invest in income-producing and growth self-storage facilities and related self-storage real estate investments in <location value=\"LC/us\" idsrc=\"xmltag.org\" >the United States</location> and <location value=\"LC/ca\" idsrc=\"xmltag.org\" >Canada</location>. As of <chron>February 26, 2026</chron>, SST VI has a portfolio of 13 operating properties in <location value=\"LC/us\" idsrc=\"xmltag.org\" >the United States</location> comprising approximately 9,100 units and 1,080,000 rentable square feet (including parking); 12 properties with approximately 11,100 units and 1,130,000 rentable square feet (including parking) in <location value=\"LC/ca\" idsrc=\"xmltag.org\" >Canada</location>, joint venture interests in four operational and one development property in two Canadian provinces (<location value=\"LS/ca.on\" idsrc=\"xmltag.org\" >Ontario</location> and Québec).\n\n</p><p>\n<b>About <org value=\"SMA.NaE\" idsrc=\"xmltag.org\" >SmartStop Self Storage REIT, Inc.</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='SMA' fmr-param-security-type='Equity'>( SMA )</span> :</b>\n\n</p><p>\n<org value=\"SMA.NaE\" idsrc=\"xmltag.org\" >SmartStop Self Storage REIT, Inc.</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='SMA' fmr-param-security-type='Equity'>( SMA )</span> (“SmartStop”) is a self-managed REIT with a fully integrated operations team of more than 1,000 self-storage professionals focused on growing the SmartStop® Self Storage brand. SmartStop, through its indirect subsidiary, <org>SmartStop REIT Advisors, LLC</org>, also sponsors other self-storage programs and, through its Managed Platform, offers third-party management services in the U.S. and <location value=\"LC/ca\" idsrc=\"xmltag.org\" >Canada</location>. As of <chron>February 26, 2026</chron>, SmartStop has an owned or managed portfolio of over 460 operating properties in 35 states, the <location value=\"LS/us.dc\" idsrc=\"xmltag.org\" >District of Columbia</location>, and <location value=\"LC/ca\" idsrc=\"xmltag.org\" >Canada</location>, comprising over 270,000 units and more than 35 million rentable square feet. SmartStop and its affiliates own or manage 50 operating self-storage properties across four provinces in <location value=\"LC/ca\" idsrc=\"xmltag.org\" >Canada</location>, which total approximately 43,000 units and 4.3 million rentable square feet. Additional information regarding SmartStop is available at www.smartstopselfstorage.com.\n\n</p><p><img alt=\"\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20260226240656r1&amp;sid=acqr8&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\" /><span class=\"bwct31415\" /></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\">https://www.businesswire.com/news/home/20260226240656/en/</span></p>\n<p>Source: <org>Strategic Storage Trust VI, Inc.</org></p>\n",
            "link": "https://www.fidelity.com/news/article/technology/202602261826BIZWIRE_USPR_____20260226_BW240656",
            "pub_date": "2026-02-27 07:26:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "MOZAYYX Acquisition Corp. Announces Closing of Upsized $300,000,000 Initial Public Offering",
            "description": "\n<p align=\"justify\"><strong><location value=\"LU/us.tx.austin\" idsrc=\"xmltag.org\" >Austin, TEXAS</location>, <chron>Feb.  26, 2026</chron>  (GLOBE NEWSWIRE) -- </strong><org>MOZAYYX Acquisition Corp.</org> (NYSE: MZYX.U) (the “Company”) today announced that it closed its upsized initial public offering of 30,000,000 units at <money>$10.00</money> per unit, including the issuance of 3,900,000 units as result of the underwriter’s partial exercise of its over-allotment option. The gross proceeds from the offering were <money>$300 million</money> before deducting underwriting discounts and estimated offering expenses. The units began trading on the <org>New York Stock Exchange</org> (“NYSE”) under the ticker symbol “MZYX.U” on <chron>February 25, 2026</chron>.</p>  <p align=\"justify\">Each unit consists of one Class A ordinary share and one-quarter of one redeemable warrant. Each whole warrant entitles the holder to purchase one Class A ordinary share of the Company at a price of <money>$11.50</money> per share. Once the securities comprising the units begin separate trading, the Class A ordinary shares and warrants are expected to be listed on <org>NYSE</org> under the symbols “MZYX” and “MZYX.WS”, respectively.</p>  <p align=\"justify\">The Company is a blank check company incorporated as an exempted company under the laws of the <location value=\"LC/ky\" idsrc=\"xmltag.org\" >Cayman Islands</location>, which will seek to effect a merger, share exchange, asset acquisition, share purchase, reorganization or similar business combination with one or more businesses or entities. </p>  <p align=\"justify\"><org>Cantor Fitzgerald &amp; Co.</org> acted as the sole book-running manager in the offering.<br/>  <br/>The offering was made only by means of a prospectus, copies of which may be obtained from <org>Cantor Fitzgerald &amp; Co.</org>, Attention: Capital Markets, <location>110 East 59th Street</location>, <location value=\"LU/us.ny.nyc\" idsrc=\"xmltag.org\" >New York, New York</location> 10022; Email: prospectus@cantor.com, or from the <org>SEC</org> website at www.sec.gov.</p>  <p align=\"justify\">A registration statement on Form S-1 relating to the Offering (File No. 333-293134), as amended, was filed with the <org>Securities and Exchange Commission</org> (“SEC”) and was declared effective by the <org>SEC</org> on <chron>February 24, 2026</chron> and a registration statement on Form S-1MEF (File No. 333-293715) was filed on <chron>February 25, 2026</chron> with the <org>SEC</org> which was effective automatically upon filing.</p>  <p align=\"justify\">This press release shall not constitute an offer to sell or a solicitation of an offer to buy, nor shall there be any sale of these securities in any state or jurisdiction in which such offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of any such state or jurisdiction.</p>  <p align=\"justify\"><b>Forward-Looking Statements</b></p>  <p align=\"justify\">This press release includes forward-looking statements that involve risks and uncertainties. Forward-looking statements are statements that are not historical facts. Such forward-looking statements are subject to risks and uncertainties, which could cause actual results to differ from the forward-looking statements. The Company expressly disclaims any obligations or undertaking to release publicly any updates or revisions to any forward-looking statements contained herein to reflect any change in the Company’s expectations with respect thereto or any change in events, conditions or circumstances on which any statement is based. No assurance can be given that the offering discussed above will be completed on the terms described, or at all. Forward-looking statements are subject to numerous conditions, many of which are beyond the control of the Company, including those set forth in the Risk Factors section of the Registration Statement and related preliminary prospectus filed in connection with the initial public offering with the <org>SEC</org>. Copies are available on the SEC’s website, www.sec.gov.</p>  <p align=\"justify\"><b>Contact:</b></p>  <p><org>MOZAYYX Acquisition Corp.</org><br/><person>Benjamin Zucker</person><br/>Chief Executive Officer and Chief Financial Officer<br/><location>111 Congress Ave</location>, Suite 1200<br/><location value=\"LU/us.tx.austin\" idsrc=\"xmltag.org\" >Austin, TX</location> 78701<br/>Email: ben@mozayyxac.com </p>  Image: https://www.globenewswire.com/newsroom/ti?nf=OTY2MjYxNCM3NDU4NTkwIzUwMDE1ODkzOQ==  <br/> Image: https://ml.globenewswire.com/media/NTg3NDY5OTItNjFiNC00NTY3LWI4ODYtYzFkYzFjMGE4ZjcwLTUwMDE1ODkzOS0yMDI2LTAyLTI2LWVu/tiny/MOZAYYX-Acquisition-Corp-.png\nSource: <org>MOZAYYX Acquisition Corp.</org>\n",
            "link": "https://www.fidelity.com/news/article/default/202602261840PRIMZONEFULLFEED9662614",
            "pub_date": "2026-02-27 07:40:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "White House official vows 'new interest' in airline industry after flight woes",
            "description": "<p><location value=\"LU/us.dc.wash\" idsrc=\"xmltag.org\" >WASHINGTON</location>, <chron>Feb 26</chron> (Reuters) - Deputy White House Chief of Staff James Blair vowed on Thursday to take a &quot;new interest&quot; in the U.S. aviation industry after he and his wife experienced issues with separate <org value=\"AAL.NaE\" idsrc=\"xmltag.org\" >American Airlines</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AAL' fmr-param-security-type='Equity'>( AAL )</span> flights.</p>\n<p>&quot;Today, <org value=\"AAL.NaE\" idsrc=\"xmltag.org\" >American Airlines</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AAL' fmr-param-security-type='Equity'>( AAL )</span> delays me 2.5 hours because someone failed to notice empty hydraulic fluid before it was time to go down the runway. Yesterday, they apparently forgot to BOOK A PILOT for my wife's flight,&quot; Blair said on X. &quot;I'm going to take a new interest in the airline industry.&quot;</p>\n<p><org>The White House</org> and <org value=\"AAL.NaE\" idsrc=\"xmltag.org\" >American Airlines</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AAL' fmr-param-security-type='Equity'>( AAL )</span> did not immediately comment.</p>\n<p><org value=\"AAL.NaE\" idsrc=\"xmltag.org\" >American Airlines'</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AAL' fmr-param-security-type='Equity'>( AAL )</span> performance has been under scrutiny since a late-January winter storm led to widespread flight cancellations that tested its recovery system.</p>\n<p>Data from aviation analytics firm OAG shows <org value=\"AAL.NaE\" idsrc=\"xmltag.org\" >American Airlines'</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AAL' fmr-param-security-type='Equity'>( AAL )</span> reliability lagged key rivals in January, trailing <org value=\"LUV.NaE\" idsrc=\"xmltag.org\" >Southwest Airlines</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='LUV' fmr-param-security-type='Equity'>( LUV )</span>, <org>Alaska Airlines</org>, <org>United Airlines</org> and <org value=\"DAL.NaE\" idsrc=\"xmltag.org\" >Delta Air Lines</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='DAL' fmr-param-security-type='Equity'>( DAL )</span> in on-time performance and posted the highest cancellation rate among those airlines.</p>\n<p>TRUMP ADMINISTRATION REVERSES BIDEN-ERA PROPOSALS</p>\n<p>Since President <person>Donald Trump</person> began his second term last year, his administration has taken a series of steps to reverse aviation consumer proposals by the administration of former President <person>Joe Biden</person>.</p>\n<p>In December, the <org>Transportation Department</org> moved to reverse some penalties imposed on airlines during the Biden administration, including waiving <money>$16.7 million</money> in fines imposed on <org value=\"AAL.NaE\" idsrc=\"xmltag.org\" >American Airlines</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AAL' fmr-param-security-type='Equity'>( AAL )</span> in 2024 as part of a settlement over the carrier's treatment of disabled passengers.</p>\n<p>The department also waived the remaining <money>$11 million</money> of a fine imposed on <org value=\"LUV.NaE\" idsrc=\"xmltag.org\" >Southwest</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='LUV' fmr-param-security-type='Equity'>( LUV )</span> as part of a <money>$140 million</money> settlement over operational problems that stranded more than 2 million passengers during the busy holiday travel period in <chron>December 2022</chron>.</p>\n<p>In November, the department withdrew a proposal issued under Biden that sought to require airlines to pay passengers cash compensation when carriers are responsible for U.S. flight disruptions.</p>\n<p>Last month, the <org>Transportation Department</org> proposed revising its guidance to deemphasize imposing civil fines on airlines that violate consumer protection rules and to drop Biden-era policies that toughened enforcement.</p>\n<p></p>\n<p> (Reporting by <person>David Shepardson</person>; Editing by <person>Jamie Freed</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602261840RTRSNEWSCOMBINED_KBN3PG2W2-OUSBS_1",
            "pub_date": "2026-02-27 07:40:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Google signs multibillion-dollar AI chip deal with Meta, Information reports",
            "description": "\n<p><chron>Feb 26</chron> (Reuters) - <org value=\"META.NaE\" idsrc=\"xmltag.org\" >Meta Platforms</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='META' fmr-param-security-type='Equity'>( META )</span> has signed a\ndeal to rent Google's AI chips, known as tensor\nprocessing units, to develop new AI models, the Information\nreported on Thursday, citing a person involved in the talks.</p>\n<p>The multi-year deal is worth billions of dollars, the report\nadded.</p>\n<p>Meta and Google did not immediately respond to Reuters'\nrequests for comment.\n(Reporting by Fabiola Arámburo in <location value=\"LU/mx.sm.mexcty\" idsrc=\"xmltag.org\" >Mexico City</location>; Editing by <person>Maju\nSamuel</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602261826RTRSNEWSCOMBINED_L6N3ZM1FL_1",
            "pub_date": "2026-02-27 07:26:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Google signs multibillion-dollar AI chip deal with Meta, Information reports",
            "description": "\n<p><chron>Feb 26</chron> (Reuters) - <org value=\"META.NaE\" idsrc=\"xmltag.org\" >Meta Platforms</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='META' fmr-param-security-type='Equity'>( META )</span> has signed a deal to rent Google's AI chips, known as tensor processing units, to develop new AI models, the Information reported on Thursday, citing a person involved in the talks.</p>\n<p>The multi-year deal is worth billions of dollars, the report added.</p>\n<p>Meta and Google did not immediately respond to Reuters' requests for comment.</p>\n<p></p>\n<p> (Reporting by Fabiola Arámburo in <location value=\"LU/mx.sm.mexcty\" idsrc=\"xmltag.org\" >Mexico City</location>; Editing by <person>Maju Samuel</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602261828RTRSNEWSCOMBINED_KBN3PG2V8-OUSBS_1",
            "pub_date": "2026-02-27 07:28:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Analysis-As Trump reins in China tech curbs, Beijing's export controls come of age",
            "description": "\n<p><location value=\"LU/cn..beijng\" idsrc=\"xmltag.org\" >BEIJING</location>, <chron>Feb 27</chron> (Reuters) - Almost a year after <location value=\"LC/cn\" idsrc=\"xmltag.org\" >China</location> expanded rare-earth export controls ostensibly aimed at preventing their use by foreign militaries, exporters are still asking a basic question: when does a small magnet turn an everyday product into a controlled item?</p>\n<p>Makers of products ranging from pill boxes, printed billboards, motor components and optical glass are among the growing number of companies that have queried the commerce ministry over whether they require export licences.</p>\n<p><location value=\"LU/cn..beijng\" idsrc=\"xmltag.org\" >Beijing</location> is expanding export enforcement manpower and imposing compliance nationwide, even as it raises costs for domestic firms and makes it harder for them to ship goods. </p>\n<p>A Reuters review of over 200 public export-control compliance enquiries to <location value=\"LC/cn\" idsrc=\"xmltag.org\" >China's</location> commerce ministry between 2019 and the start of this month showed a stark surge after rare-earth controls were tightened last April.</p>\n<p>In the meantime, <location value=\"LU/us.dc.wash\" idsrc=\"xmltag.org\" >Washington</location> has eased some export restrictions on products like advanced artificial-intelligence chips during President <person>Donald Trump's</person> second term, after <location value=\"LC/cn\" idsrc=\"xmltag.org\" >China's</location> curbs on rare earths exports threatened to hobble global supply chains spanning autos, technology, energy, aerospace, and defence.</p>\n<p>The export controls on both sides are expected to be in sharp focus as Trump and Chinese President Xi Jinping meet in <location value=\"LU/cn..beijng\" idsrc=\"xmltag.org\" >Beijing</location> in late March for their second in-person talks since Trump returned to office, setting up a high-stakes test of whether a fragile trade truce between the world's two largest economies can hold.</p>\n<p>&quot;What we are seeing in <location value=\"LC/cn\" idsrc=\"xmltag.org\" >China</location> is ... the rapid construction of a comprehensive export-control apparatus designed to weaponize chokepoints across strategic and non-strategic sectors,&quot; said <person>Alfredo Montufar-Helu</person>, a <location value=\"LU/cn..beijng\" idsrc=\"xmltag.org\" >Beijing</location>-based managing director at <org>Ankura Consulting</org>. &quot;That the U.S. is reining in some of its controls is a direct acknowledgement of <location value=\"LC/cn\" idsrc=\"xmltag.org\" >China's</location> growing leverage.&quot;</p>\n<p><location value=\"LC/cn\" idsrc=\"xmltag.org\" >China's</location> commerce ministry did not respond to a request for comment. </p>\n<p>EXPORT COMPLIANCE QUERIES JUMP</p>\n<p>Exporters have flooded the Chinese commerce ministry's website with urgent compliance questions: whether magnetic sheets cross rare-earth thresholds; whether gallium nitride chips are restricted; whether ultraviolet medical equipment counts as controlled technology.</p>\n<p>From 2019 through 2024, only 43 export-control compliance enquiries were posted publicly. In 2025 alone, the number jumped to 135, with about 16% of them complaints about issues such as shipment delays and increased regulatory burdens. The rate of complaints nearly doubled in early 2026.</p>\n<p>The actual number of queries from exporters is likely to be  orders of magnitude larger as there are several private channels these companies can use, including contacting provincial and municipal commerce bureaux, many of which do not have public query platforms like the central government's commerce ministry.</p>\n<p>The official responses to the queries from Chinese exporters have been vague and formulaic, stopping short of confirming whether any individual product, from rare-earth magnets to medical materials, required a licence.</p>\n<p>The enforcement push is also legal and bureaucratic. Since <location value=\"LC/cn\" idsrc=\"xmltag.org\" >China</location> enacted its Export Control Law in <chron>October 2020</chron>, it has introduced or expanded export control measures 29 times, compared to just six times between 2015-2020.</p>\n<p>Recruitment documents show 45 commerce ministry posts available in this year's national civil-service examination could be assigned to export-control-related work, compared with 11 such vacancies in both 2022 and 2023. </p>\n<p>Dozens of provincial and municipal governments have organised compliance seminars and policy briefings over the past year, while <location value=\"LU/cn..beijng\" idsrc=\"xmltag.org\" >Beijing</location> has convened national export-control work conferences bringing officials from across the country to the capital.</p>\n<p><location value=\"LU/cn..beijng\" idsrc=\"xmltag.org\" >Beijing's</location> <chron>October 2025</chron> revision to its rare-earth export-control regime reflected lessons from the U.S. Foreign Direct Product Rule, which allows <location value=\"LU/us.dc.wash\" idsrc=\"xmltag.org\" >Washington</location> to assert jurisdiction over certain foreign-made goods produced with American technology.</p>\n<p>&quot;<location value=\"LC/cn\" idsrc=\"xmltag.org\" >China's</location> use of rare earths as leverage is completely learned from the West - especially the U.S.,&quot; said <person>Li Xing</person>, professor at the <org>Guangdong Institute for International Strategies</org>, a think tank in <location value=\"LU/cn..gngzhu\" idsrc=\"xmltag.org\" >Guangzhou</location>. </p>\n<p><location value=\"LC/cn\" idsrc=\"xmltag.org\" >China</location> dominates the processing of rare earths, the conversion of ore into refined oxides and metals used in electric vehicles, wind turbines and defence systems, a chokepoint deeper in the supply chain than mining itself. </p>\n<p>Its new licensing system reaches into processing and downstream incorporation.</p>\n<p>&quot;This is not just a supply chain shortage. This is economic warfare,&quot; said <person>Nick Myers</person>, chief executive of U.S. rare-earth startup Phoenix Tailings.</p>\n<p>PACE OF U.S. EXPORT CONTROLS SLOWS</p>\n<p>During Trump's first term and under President <person>Joe Biden</person>, <location value=\"LC/us\" idsrc=\"xmltag.org\" >the United States</location> rapidly expanded export controls targeting <location value=\"LC/cn\" idsrc=\"xmltag.org\" >China</location>.</p>\n<p>Annual <location value=\"LC/cn\" idsrc=\"xmltag.org\" >China</location>-related additions to the Entity List, which requires U.S. exporters to obtain licences, often reviewed under a presumption of denial, surged from 47 in 2018 to 227 in 2020, reaching a record 257 in 2024, according to a Reuters analysis.  </p>\n<p>Since Trump's return to office, that trajectory has reversed. <location value=\"LC/cn\" idsrc=\"xmltag.org\" >China</location>-related Entity List additions fell to 131 in 2025, roughly half the previous year's pace.</p>\n<p>Earlier this month, the Pentagon briefly published, then withdrew, an updated Military End User list that would have added Chinese tech giants Alibaba and Baidu while removing a couple of memory chipmakers.</p>\n<p>The <org>White House</org> and the <org>U.S. Commerce Department's</org> <org>Bureau of Industry and Security</org> did not respond to requests for comment. A Pentagon official said the list was removed as it may require changes based on new information and that an updated list would be published, without further elaborating.</p>\n<p>The moderation has drawn criticism from bipartisan U.S. lawmakers, who have faulted the administration for approving certain Nvidia AI chip exports and cutting BIS funding. </p>\n<p>A <org value=\"NVDA.NaE\" idsrc=\"xmltag.org\" >Nvidia</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NVDA' fmr-param-security-type='Equity'>( NVDA )</span> spokesperson said in a statement that criticism of the current administration's decision to greenlight these semiconductor shipments to <location value=\"LC/cn\" idsrc=\"xmltag.org\" >China</location> was unintentionally promoting the interests of foreign competitors.</p>\n<p>&quot;America should always want its industry to compete for vetted and approved commercial businesses, and thereby protecting national security, creating American jobs, and keeping America's lead in AI,&quot; the spokesperson said.</p>\n<p><org value=\"NVDA.NaE\" idsrc=\"xmltag.org\" >Nvidia</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NVDA' fmr-param-security-type='Equity'>( NVDA )</span> CEO Jensen Huang, who criticised Biden-era controls, said last year that &quot;export control was a failure&quot; and that Trump &quot;realises it's exactly the wrong goal.&quot; </p>\n<p></p>\n<p> (Reporting by <person>Eduardo Baptista</person>; Editing by <person>Miyoung Kim</person> and <person>Jamie Freed</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602261802RTRSNEWSCOMBINED_KBN3PG2TL-OUSBS_1",
            "pub_date": "2026-02-27 07:02:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Mexico's Grupo Televisa reports Q4 loss of 7.68 billion pesos",
            "description": "\n<p><location value=\"LU/mx.sm.mexcty\" idsrc=\"xmltag.org\" >MEXICO CITY</location>, <chron>Feb 26</chron> - Mexican broadcaster Grupo Televisa\n, the world's largest producer of\nSpanish-language content, on Thursday posted a net loss of <money>7.68\nbillion pesos</money> (<money>$807.9 million</money>), after logging a loss of <money>9.86\nbillion pesos</money> a year earlier.</p>\n<p>Revenues for the last three months of 2025 shrunk 4.5% to\n<money>14.55 billion pesos</money>.</p>\n<p>(<money>$1</money> = <money>18.0080 Mexican pesos</money> at end-December)\n(Reporting by <person>Inigo Alexander</person>, Editing by <person>Daina Beth Solomon</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602261808RTRSNEWSCOMBINED_S0N3YD05B_1",
            "pub_date": "2026-02-27 07:08:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "MP Materials swings to Q4 profit on US government price support",
            "description": "\n<p><chron>Feb 26</chron> (Reuters) - Rare earths company <org value=\"MP.NaE\" idsrc=\"xmltag.org\" >MP Materials</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='MP' fmr-param-security-type='Equity'>( MP )</span> swung to a fourth-quarter profit, it said Thursday, exceeding analysts' expectations, driven by its price support agreement with the U.S. government and sale of magnetic material.    </p>\n<p>Rare earths are a group of 17 metals used to make magnets that turn power into motion. That industry is dominated by <location value=\"LC/cn\" idsrc=\"xmltag.org\" >China</location>, and the U.S. deal with <org value=\"MP.NaE\" idsrc=\"xmltag.org\" >MP Materials</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='MP' fmr-param-security-type='Equity'>( MP )</span> in 2025 was designed to loosen that nation's grip on the materials used to build weapons, electric vehicles and many electronics.</p>\n<p><org value=\"MP.NaE\" idsrc=\"xmltag.org\" >MP Materials</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='MP' fmr-param-security-type='Equity'>( MP )</span> controls the only rare earths mine in <location value=\"LR/nam\" idsrc=\"xmltag.org\" >North America</location> and processes those critical minerals in <location value=\"LS/us.ca\" idsrc=\"xmltag.org\" >California</location>. The company has also built a magnet facility in <location value=\"LS/us.tx\" idsrc=\"xmltag.org\" >Texas</location>.</p>\n<p>For the quarter ended <chron>December 31</chron>, <org value=\"MP.NaE\" idsrc=\"xmltag.org\" >MP Materials</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='MP' fmr-param-security-type='Equity'>( MP )</span> posted net income of <money>$9.4 million</money>, or <money>5 cents</money> per share, compared to a net loss of <money>$22.3 million</money>, or <money>14 cents</money> per share, in the year-ago period.</p>\n<p>Last year, the U.S. government guaranteed <org value=\"MP.NaE\" idsrc=\"xmltag.org\" >MP Materials</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='MP' fmr-param-security-type='Equity'>( MP )</span> a price floor of <money>$110</money> per kilogram for its rare earths; those prices have roughly doubled over the past seven months, above that floor.</p>\n<p>The company's results were aided by <money>$51 million</money> in price protection agreement income from the U.S. government.</p>\n<p>Excluding stock-based compensation expenses and one-time items, the company earned <money>9 cents</money> per share. By that measure, analysts expected results to break even, according to IBES data from LSEG.</p>\n<p>Shares fell 2.9% to <money>$58.25</money> in after-hours trading.</p>\n<p>MP stopped shipping rare earths to <location value=\"LC/cn\" idsrc=\"xmltag.org\" >China</location> for processing last year, halting a major source of revenue, and it has been boosting processing in California. </p>\n<p><org value=\"MP.NaE\" idsrc=\"xmltag.org\" >MP Materials</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='MP' fmr-param-security-type='Equity'>( MP )</span> has been bringing its <location value=\"LS/us.tx\" idsrc=\"xmltag.org\" >Texas</location> magnet facility online in the past year. During the quarter, the company posted <money>$19.9 million</money> in magnetics revenue and <money>$8.4 million</money> in adjusted magnetics profit.</p>\n<p>The company also said on Thursday it would build a second magnet facility as part of its agreement with the <org>U.S. Department of Defense</org> to manufacture 10,000 metric tons of magnets annually.</p>\n<p></p>\n<p>(Reporting by <person>Ernest Scheyder</person>; editing by <person>David Gaffen</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602261809RTRSNEWSCOMBINED_KBN3PG2T0-OUSBS_1",
            "pub_date": "2026-02-27 07:09:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Flutter Entertainment Stock Hits 52-Week Lows On Q4 Results: Here's What Company Said About Prediction Markets",
            "description": "\n<p>Sports betting and iGaming company<strong> <org value=\"FLUT.NaE\" idsrc=\"xmltag.org\" >Flutter Entertainment</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='FLUT' fmr-param-security-type='Equity'>( FLUT )</span> </strong>reported fourth-quarter financial results Thursday after market close. </p>\n\n\n\n<p>Here's the key highlights and why shares are falling.</p>\n\n\n\n<p><strong>       • Flutter Entertainment shares are approaching critical lows. Why are FLUT shares at support?</strong></p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Flutter Q4 Results</strong></h2>\n\n\n\n<p>Flutter reported fourth-quarter revenue of <money>$4.74 billion</money>, up 25% year-over-year. The revenue missed a Street consensus estimate of <money>$4.97 billion</money>, according to data from Benzinga Pro.</p>\n\n\n\n<p>The company reported quarterly earnings per share of <money>$1.74</money>, missing a Street consensus estimate of <money>$1.99</money>.</p>\n\n\n\n<p>Flutter ended the quarter with 15.07 million average monthly players, up 3% year-over-year.</p>\n\n\n\n<p>For the U.S. segment with <strong>FanDuel,</strong> the company reported 41% market share for online sportsbooks and 28% market share for iGaming. Revenue for the U.S. segment was up 33% year-over-year in the fourth quarter, with 35% growth for sportsbook revenue and 32% growth for iGaming.</p>\n\n\n\n<p>International revenue was up 17% year-over-year, with sportsbook revenue up 6% and iGaming up 31%.</p>\n\n\n\n<p>&quot;Flutter delivered strong 2025 results. Our unparalleled global scale and ongoing product innovation helped us reach almost 40 million customers across our portfolio of market-leading, local hero brands during the year,&quot; Flutter CEO<strong> <person>Peter Jackson</person> </strong>said.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Prediction Markets Launch</strong></h2>\n\n\n\n<p>Flutter launched its <strong>FanDuel Predicts</strong> in the U.S. in December. The platform allows sports-based markets in 18 states and non-sports markets in all 50 states.</p>\n\n\n\n<p>&quot;Prediction markets are a significant incremental growth opportunity for FanDuel. We believe the emergence of prediction markets will accelerate the path to state regulation of online sports betting and iGaming,&quot; Jackson said.</p>\n\n\n\n<p>Jackson called prediction markets the &quot;most valuable long-term opportunity in the U.S.&quot;</p>\n\n\n\n<p>The Flutter CEO said prediction markets will grow the total addressable market and help increase the reach of sports markets to users in states without legal online sportsbook options.</p>\n\n\n\n<p>&quot;We are exceptionally well-positioned to harness this opportunity given the nationwide strength of the FanDuel brand and our sports betting expertise.&quot;</p>\n\n\n\n<p>The comments are similar to those of sportsbook company<strong> <org value=\"DKNG.NaE\" idsrc=\"xmltag.org\" >DraftKings Inc</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='DKNG' fmr-param-security-type='Equity'>( DKNG )</span> </strong>, which highlighted prediction markets as a growth opportunity and not as a competitive threat. The market may think otherwise with shares trading down after results and guidance.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>What's Next for Flutter</strong></h2>\n\n\n\n<p>Flutter sees fiscal 2026 revenue totaling <money>$18.4 billion</money>, up 12% year-over-year. The revenue guidance is split as <money>$7.8 billion</money> for the U.S. segment and <money>$10.6 billion</money> for the International segment, up 12% and 13%, respectively, year-over-year.</p>\n\n\n\n<p>The company highlighted the opportunity it has for the 2026 FIFA World Cup, based on its global reach and strong market share in the U.S.</p>\n\n\n\n<p>&quot;We enter the year with high confidence and conviction behind our plans,&quot; Jackson said.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Flutter Entertainment Stock Price Action</strong></h2>\n\n\n\n<p>Flutter shares are down 9.45% to <money>$111.50</money> in after-hours trading on Thursday, hitting new 52-week lows versus a 52-week trading range of <money>$114.74</money> to <money>$313.69</money>.</p>\n\n\n\n<p><em>Photo: Piotr Swat via Shutterstock</em></p>\n",
            "link": "https://www.fidelity.com/news/article/us-markets/202602261746BENZINGAFULLNGTH50916246",
            "pub_date": "2026-02-27 06:46:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Analysis-As Trump reins in China tech curbs, Beijing's export controls come of age",
            "description": "\n<p><location value=\"LU/cn..beijng\" idsrc=\"xmltag.org\" >BEIJING</location>, <chron>Feb 27</chron> (Reuters) - Almost a year after <location value=\"LC/cn\" idsrc=\"xmltag.org\" >China</location> expanded rare-earth export controls ostensibly aimed at preventing their use by foreign militaries, exporters are still asking a basic question: when does a small magnet turn an everyday product into a controlled item?</p>\n<p>Makers of products ranging from pill boxes, printed billboards, motor components and optical glass are among the growing number of companies that have queried the commerce ministry over whether they require export licences.</p>\n<p><location value=\"LU/cn..beijng\" idsrc=\"xmltag.org\" >Beijing</location> is expanding export enforcement manpower and imposing compliance nationwide, even as it raises costs for domestic firms and makes it harder for them to ship goods. </p>\n<p>A Reuters review of over 200 public export-control compliance enquiries to <location value=\"LC/cn\" idsrc=\"xmltag.org\" >China's</location> commerce ministry between 2019 and the start of this month showed a stark surge after rare-earth controls were tightened last April.</p>\n<p>In the meantime, <location value=\"LU/us.dc.wash\" idsrc=\"xmltag.org\" >Washington</location> has eased some export restrictions on products like advanced artificial-intelligence chips during President <person>Donald Trump's</person> second term, after <location value=\"LC/cn\" idsrc=\"xmltag.org\" >China's</location> curbs on rare earths exports threatened to hobble global supply chains spanning autos, technology, energy, aerospace, and defence.</p>\n<p>The export controls on both sides are expected to be in sharp focus as Trump and Chinese President Xi Jinping meet in <location value=\"LU/cn..beijng\" idsrc=\"xmltag.org\" >Beijing</location> in late March for their second in-person talks since Trump returned to office, setting up a high-stakes test of whether a fragile trade truce between the world's two largest economies can hold.</p>\n<p>&quot;What we are seeing in <location value=\"LC/cn\" idsrc=\"xmltag.org\" >China</location> is ... the rapid construction of a comprehensive export-control apparatus designed to weaponize chokepoints across strategic and non-strategic sectors,&quot; said <person>Alfredo Montufar-Helu</person>, a <location value=\"LU/cn..beijng\" idsrc=\"xmltag.org\" >Beijing</location>-based managing director at <org>Ankura Consulting</org>. &quot;That the U.S. is reining in some of its controls is a direct acknowledgement of <location value=\"LC/cn\" idsrc=\"xmltag.org\" >China's</location> growing leverage.&quot;</p>\n<p><location value=\"LC/cn\" idsrc=\"xmltag.org\" >China's</location> commerce ministry did not respond to a request for comment. </p>\n<p>EXPORT COMPLIANCE QUERIES JUMP</p>\n<p>Exporters have flooded the Chinese commerce ministry's website with urgent compliance questions: whether magnetic sheets cross rare-earth thresholds; whether gallium nitride chips are restricted; whether ultraviolet medical equipment counts as controlled technology.</p>\n<p>From 2019 through 2024, only 43 export-control compliance enquiries were posted publicly. In 2025 alone, the number jumped to 135, with about 16% of them complaints about issues such as shipment delays and increased regulatory burdens. The rate of complaints nearly doubled in early 2026.</p>\n<p>The actual number of queries from exporters is likely to be  orders of magnitude larger as there are several private channels these companies can use, including contacting provincial and municipal commerce bureaux, many of which do not have public query platforms like the central government's commerce ministry.</p>\n<p>The official responses to the queries from Chinese exporters have been vague and formulaic, stopping short of confirming whether any individual product, from rare-earth magnets to medical materials, required a licence.</p>\n<p>The enforcement push is also legal and bureaucratic. Since <location value=\"LC/cn\" idsrc=\"xmltag.org\" >China</location> enacted its Export Control Law in <chron>October 2020</chron>, it has introduced or expanded export control measures 29 times, compared to just six times between 2015-2020.</p>\n<p>Recruitment documents show 45 commerce ministry posts available in this year's national civil-service examination could be assigned to export-control-related work, compared with 11 such vacancies in both 2022 and 2023. </p>\n<p>Dozens of provincial and municipal governments have organised compliance seminars and policy briefings over the past year, while <location value=\"LU/cn..beijng\" idsrc=\"xmltag.org\" >Beijing</location> has convened national export-control work conferences bringing officials from across the country to the capital.</p>\n<p><location value=\"LU/cn..beijng\" idsrc=\"xmltag.org\" >Beijing's</location> <chron>October 2025</chron> revision to its rare-earth export-control regime reflected lessons from the U.S. Foreign Direct Product Rule, which allows <location value=\"LU/us.dc.wash\" idsrc=\"xmltag.org\" >Washington</location> to assert jurisdiction over certain foreign-made goods produced with American technology.</p>\n<p>&quot;<location value=\"LC/cn\" idsrc=\"xmltag.org\" >China's</location> use of rare earths as leverage is completely learned from the West - especially the U.S.,&quot; said <person>Li Xing</person>, professor at the <org>Guangdong Institute for International Strategies</org>, a think tank in <location value=\"LU/cn..gngzhu\" idsrc=\"xmltag.org\" >Guangzhou</location>. </p>\n<p><location value=\"LC/cn\" idsrc=\"xmltag.org\" >China</location> dominates the processing of rare earths, the conversion of ore into refined oxides and metals used in electric vehicles, wind turbines and defence systems, a chokepoint deeper in the supply chain than mining itself. </p>\n<p>Its new licensing system reaches into processing and downstream incorporation.</p>\n<p>&quot;This is not just a supply chain shortage. This is economic warfare,&quot; said <person>Nick Myers</person>, chief executive of U.S. rare-earth startup Phoenix Tailings.</p>\n<p>PACE OF U.S. EXPORT CONTROLS SLOWS</p>\n<p>During Trump's first term and under President <person>Joe Biden</person>, <location value=\"LC/us\" idsrc=\"xmltag.org\" >the United States</location> rapidly expanded export controls targeting <location value=\"LC/cn\" idsrc=\"xmltag.org\" >China</location>.</p>\n<p>Annual <location value=\"LC/cn\" idsrc=\"xmltag.org\" >China</location>-related additions to the Entity List, which requires U.S. exporters to obtain licences, often reviewed under a presumption of denial, surged from 47 in 2018 to 227 in 2020, reaching a record 257 in 2024, according to a Reuters analysis.  </p>\n<p>Since Trump's return to office, that trajectory has reversed. <location value=\"LC/cn\" idsrc=\"xmltag.org\" >China</location>-related Entity List additions fell to 131 in 2025, roughly half the previous year's pace.</p>\n<p>Earlier this month, the Pentagon briefly published, then withdrew, an updated Military End User list that would have added Chinese tech giants Alibaba and Baidu while removing a couple of memory chipmakers.</p>\n<p>The <org>White House</org> and the <org>U.S. Commerce Department's</org> <org>Bureau of Industry and Security</org> did not respond to requests for comment. A Pentagon official said the list was removed as it may require changes based on new information and that an updated list would be published, without further elaborating.</p>\n<p>The moderation has drawn criticism from bipartisan U.S. lawmakers, who have faulted the administration for approving certain Nvidia AI chip exports and cutting BIS funding. </p>\n<p>A <org value=\"NVDA.NaE\" idsrc=\"xmltag.org\" >Nvidia</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NVDA' fmr-param-security-type='Equity'>( NVDA )</span> spokesperson said in a statement that criticism of the current administration's decision to greenlight these semiconductor shipments to <location value=\"LC/cn\" idsrc=\"xmltag.org\" >China</location> was unintentionally promoting the interests of foreign competitors.</p>\n<p>&quot;America should always want its industry to compete for vetted and approved commercial businesses, and thereby protecting national security, creating American jobs, and keeping America's lead in AI,&quot; the spokesperson said.</p>\n<p><org value=\"NVDA.NaE\" idsrc=\"xmltag.org\" >Nvidia</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NVDA' fmr-param-security-type='Equity'>( NVDA )</span> CEO Jensen Huang, who criticised Biden-era controls, said last year that &quot;export control was a failure&quot; and that Trump &quot;realises it's exactly the wrong goal.&quot; </p>\n<p></p>\n<p> (Reporting by <person>Eduardo Baptista</person>; Editing by <person>Miyoung Kim</person> and <person>Jamie Freed</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/top-news/202602261802RTRSNEWSCOMBINED_KBN3PG2TL-OUSBS_1",
            "pub_date": "2026-02-27 07:20:44",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Oceaneering International Insider Sold Shares Worth $1,432,774, According to a Recent SEC Filing",
            "description": "\n<p><chron>05:54 PM EST</chron>, <chron>02/26/2026</chron> (MT Newswires) -- <person>Benjamin Laura</person>, Senior Vice President &amp; Chief Operating Officer, on <chron>February 24, 2026</chron>, sold 38,282 shares in <org value=\"OII.NaE\" idsrc=\"xmltag.org\" >Oceaneering International</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='OII' fmr-param-security-type='Equity'>( OII )</span>  for <money>$1,432,774</money>. Following the Form 4 filing with the <org>SEC</org>, Laura has control over a total of 49,500 common shares of the company, with 40,805 shares held directly and 8,695 controlled indirectly.</p><p>SEC Filing:</p><p>https://www.sec.gov/Archives/edgar/data/73756/000007375626000055/xslF345X05/wk-form4_1772145975.xml</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602261754MIDNIGHTUSEQUITY_A3574399",
            "pub_date": "2026-02-27 06:54:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "NTSB says House bill does not fully address mid-air collision safety recommendations",
            "description": "\n<p><location value=\"LU/us.dc.wash\" idsrc=\"xmltag.org\" >WASHINGTON</location>, <chron>Feb 26</chron> (Reuters) - <org>The National\nTransportation Safety Board</org> said on Thursday a proposed <org>U.S.\nHouse of Representatives</org> aviation safety bill does not fully\naddress safety recommendations it issued after a 2025 mid-air\ncollision killed 67 people near <location value=\"LU/us.dc.wash\" idsrc=\"xmltag.org\" >Washington</location>.</p>\n<p>The NTSB said the House ALERT act fails to address its\nrecommendation to require the collision-warning technology known\nas ADS-B.\n(Reporting by <person>David Shepardson</person>; Editing by <person>Chris Reese</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602261757RTRSNEWSCOMBINED_L1N3ZM1OF_1",
            "pub_date": "2026-02-27 06:57:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Netflix declines to raise offer for Warner Bros",
            "description": "\n<p><chron>Feb 26</chron> (Reuters) - <org value=\"NFLX.NaE\" idsrc=\"xmltag.org\" >Netflix</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NFLX' fmr-param-security-type='Equity'>( NFLX )</span> said on Thursday it will not raise its offer for <org value=\"WBD.NaE\" idsrc=\"xmltag.org\" >Warner Bros Discovery</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='WBD' fmr-param-security-type='Equity'>( WBD )</span> after the HBO Max owner's board determined that <org value=\"PSKY.NaE\" idsrc=\"xmltag.org\" >Paramount Skydance's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='PSKY' fmr-param-security-type='Equity'>( PSKY )</span> latest proposal was a &quot;Superior Proposal&quot; to the streaming pioneer's existing merger agreement.</p>\n<p></p>\n<p> (Reporting by <person>Jaspreet Singh</person> in Bengaluru; Editing by <person>Tasim Zahid</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/top-news/202602261751RTRSNEWSCOMBINED_KBN3PG2SY-OUSBS_1",
            "pub_date": "2026-02-27 07:06:23",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Research Alert: Tln 2025: Adjusted Ebitda Surges 34% Amid Acquisition-driven Expansion",
            "description": "\n<p><chron>05:40 PM EST</chron>, <chron>02/26/2026</chron> (MT Newswires) -- CFRA, an independent research provider, has provided MT Newswires with the following research alert. Analysts at CFRA have summarized their opinion as follows:</p><p>TLN reported strong Q4 and full-year 2025 results, with adjusted EBITDA rising 34% to <money>$1.04B</money>, due to capacity revenues surging 153% to <money>$485M</money> and energy revenues increasing 14% to <money>$2.14B</money>. Adjusted FCF expanded 85% to <money>$524M</money> despite higher capex, while total generation grew 10% to 39.9 TWh. The company completed transformational <money>$3.8B</money> acquisitions of Freedom and Guernsey assets adding 2.8 GW of baseload capacity, with an additional <money>$3.45B</money> Cornerstone deal announced for 2.5 GW. TLN expanded its Amazon PPA to 1,920 MW and maintained disciplined hedging with 90% of 2026 and 40% of 2027 generation volumes hedged. We view the strategic acquisitions as enhancing TLN's competitive position in PJM markets while the expanded Amazon partnership provides long-term revenue visibility. Total assets increased to <money>$10.91B</money> from <money>$6.11B</money>, with long-term debt rising to <money>$6.78B</money> from <money>$3.00B</money> reflecting acquisition financing, though the enhanced scale should support stronger cash generation.</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/mergers-and-acquisitions/202602261740MIDNIGHTUSEQUITY_A3574367",
            "pub_date": "2026-02-27 06:40:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Oceaneering International Insider Sold Shares Worth $341,582, According to a Recent SEC Filing",
            "description": "\n<p><chron>05:42 PM EST</chron>, <chron>02/26/2026</chron> (MT Newswires) -- Catherine E Dunn, Vice President, Chief Accounting Officer, on <chron>February 24, 2026</chron>, sold 9,070 shares in <org value=\"OII.NaE\" idsrc=\"xmltag.org\" >Oceaneering International</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='OII' fmr-param-security-type='Equity'>( OII )</span>  for <money>$341,582</money>. Following the Form 4 filing with the <org>SEC</org>, Dunn has control over a total of 10,738 common shares of the company, with 10,738 shares held directly.</p><p>SEC Filing:</p><p>https://www.sec.gov/Archives/edgar/data/73756/000200148726000002/xslF345X05/wk-form4_1772145529.xml</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602261742MIDNIGHTUSEQUITY_A3574369",
            "pub_date": "2026-02-27 06:42:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US mortgage rate dips below 6% but economists don't expect a housing boom",
            "description": "<p><location value=\"LU/us.dc.wash\" idsrc=\"xmltag.org\" >WASHINGTON</location>, <chron>Feb 26</chron> (Reuters) - The average rate on the popular U.S. 30-year fixed-rate mortgage fell below 6% this week for the first time in 3-1/2 years, but the decline is likely temporary and on its own insufficient to significantly boost housing demand unless supply increases, said economists.</p>\n<p>The 30-year fixed mortgage rate averaged 5.98%, the lowest level since <chron>September 2022</chron>, down from 6.01% last week, mortgage finance company Freddie Mac said on Thursday. It averaged 6.76% during the same period a year ago.</p>\n<p>The housing market has become a hot-button political issue as President <person>Donald Trump</person>, under pressure to address cost-of-living concerns ahead of November midterm congressional elections, has floated a number of proposals to make homebuying more affordable.    </p>\n<p>The drop followed a decline in the benchmark 10-year U.S. Treasury yield after the <org>U.S. Supreme Court</org> on Friday struck down Trump's sweeping tariffs. In response, Trump imposed a 10% global tariff, before raising the rate to 15%. The 30-year fixed-rate mortgage tracks the 10-year Treasury yield.</p>\n<p>&quot;As this week's decline stems from market volatility rather than fundamental economic data, more supportive economic data is needed to establish a consistent trend,&quot; said <person>Jiayi Xu</person>, an economist at Realtor.com, while others noted a lack of housing inventory would continue to be a challenge for buyers.</p>\n<p>Economists and policymakers say a dearth of properties for sale, especially starter homes, continues to weigh on the housing market. Many homeowners hold mortgages with rates below 5%, creating what has been called a rate-lock. The inventory of previously owned houses is also well below its pre-pandemic level. </p>\n<p>Still, some bankers and market-watchers said the 30-year mortgage rate falling below 6% was an important psychological threshold that could draw some sellers to list their homes, and give potential homebuyers more confidence to jump into the market at a time when seasonally the market typically heats up. Mortgage refinancing has risen as the 30-year rate has fallen.</p>\n<p>&quot;That headline alone could prompt many sidelined buyers to take another peek at the housing market,&quot; said <person>Kara Ng</person>, senior economist at Zillow. </p>\n<p><person>Matt Vernon</person>, head of consumer lending at Bank of America, said he would expect any movement in the market to happen gradually. </p>\n<p>&quot;In many cases, life events drive decisions more than rates alone, but lower rates could be the nudge some buyers and current homeowners have been waiting for,&quot; said Vernon, adding mortgage application volumes at Bank of America are up nearly 22% year over year. </p>\n<p>RATE-LOCK LIMITS HOME AVAILABILITY</p>\n<p>House prices increased 1.8% in the 12 months through December after climbing 2.1% in November, the <org>Federal Housing Finance Agency</org>, which oversees mortgage finance giants Freddie Mac and Fannie Mae, said on Tuesday.    </p>\n<p>Trump last month ordered that agency to purchase <money>$200 billion</money> in mortgage bonds to help lower the cost of home loans.  </p>\n<p>Economists are skeptical that those mortgage purchases will significantly improve housing affordability.</p>\n<p>Minutes of the Federal Reserve's <chron>January 27-28</chron> policy meeting published last week, describing a briefing by a New York Fed official, noted that the administration's bond-buying plans had caused &quot;a notable decline in mortgage-backed securities yields.&quot; However, that is unlikely to materially boost mortgage refinancing &quot;because current mortgage rates are well above the weighted average rate of outstanding mortgages,&quot; the minutes noted. </p>\n<p> (Reporting by Lucia Mutikani, additional reporting by <person>Michael S. Derby</person> and <person>Saeed Azhar</person>; Editing by <person>Chizu Nomiyama</person>, <person>Mark Porter</person> and <person>Lisa Shumaker</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/top-news/202602261354RTRSNEWSCOMBINED_KBN3PG2D7-OUSBS_1",
            "pub_date": "2026-02-27 06:50:55",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US trade panel to probe impact of revoking China's permanent normal trade status",
            "description": "\n<p><location value=\"LU/us.dc.wash\" idsrc=\"xmltag.org\" >WASHINGTON</location>, <chron>Feb 26</chron> (Reuters) - <org>The U.S. International Trade Commission</org> said on Thursday it would investigate the economic impact of revoking <location value=\"LC/cn\" idsrc=\"xmltag.org\" >China's</location> permanent normal trade status over a six-year period, a move that would likely increase tariffs on Chinese imports.</p>\n<p>The trade panel said in a statement that it will publish the results of the probe, ordered in a congressional appropriations bill, by <chron>August 21</chron>.</p>\n<p>When he took office in <chron>January 2025</chron>, President <person>Donald Trump</person> ordered his trade and commerce chiefs to assess legislative proposals to revoke Permanent Normal Trade Relations with <location value=\"LC/cn\" idsrc=\"xmltag.org\" >China</location>. PNTR was first granted in 2000, allowing <location value=\"LC/cn\" idsrc=\"xmltag.org\" >China</location> to join the <org>World Trade Organization</org>, a move that catapulted the country into becoming the world's biggest manufacturer.</p>\n<p>Since his <chron>inauguration day</chron> order, Trump imposed new tariffs on Chinese imports that reached as high as 145% last year, but that had been reduced to around 20% through a series of trade negotiations before the <org>Supreme Court</org> last week ruled Trump's emergency tariffs illegal. </p>\n<p>Trump's punitive <location value=\"LC/cn\" idsrc=\"xmltag.org\" >China</location> duties sit on top of the normal &quot;Most Favored Nation&quot; duties of about 2.5% that prevailed before he launched a trade war on <location value=\"LC/cn\" idsrc=\"xmltag.org\" >China</location> during his first term, imposing tariffs of about 25% on most Chinese imports.</p>\n<p>Revoking PNTR would raise the base MFN rates, adding to whatever punitive duties Trump imposes to replace the illegal emergency tariffs under other trade authorities. </p>\n<p>The USITC, which studies trade and competitiveness matters and rules on anti-dumping and anti-subsidy trade cases, said its report would focus on U.S. trade, production and prices in the industries that could be directly and most affected by increasing tariffs on Chinese goods to the higher non-MFN rates.</p>\n<p>The panel said it would also examine an alternative scenario where <org>Congress</org> revokes PNTR treatment with a five-year phase-in of a subset of tariffs on products important for national security.</p>\n<p>The USITC said the public was invited to file written comments on the implications of raising these tariffs on Chinese imports, through the close of business on <chron>April 13</chron>. Due to the accelerated timeline, the commission said it does not plan to hold a public hearing.</p>\n<p>(Reporting by <person>David Lawder</person>, <person>Daphne Psaledakis</person> and <person>Bhargav Acharya</person>; Editing by <person>David Ljunggren</person> and <person>Mark Porter</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/us-economy/202602261537RTRSNEWSCOMBINED_KBN3PG23A-OUSBS_1",
            "pub_date": "2026-02-27 04:37:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "BRIEF-Diversified To Acquire Complementary, High-Quality, Low-Decline Producing Assets",
            "description": "\n<p><chron>Feb 26</chron> (Reuters) - <org value=\"DEC.NaE\" idsrc=\"xmltag.org\" >Diversified Energy Co</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='DEC' fmr-param-security-type='Equity'>( DEC )</span>:</p>\n<p>* DIVERSIFIED TO ACQUIRE COMPLEMENTARY, HIGH-QUALITY,\nLOW-DECLINE\nPRODUCING ASSETS</p>\n<p>* <org value=\"DEC.NaE\" idsrc=\"xmltag.org\" >DIVERSIFIED ENERGY CO</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='DEC' fmr-param-security-type='Equity'>( DEC )</span> - PURCHASE PRICE SET AT <money>$245 MILLION</money>\nIN\nCASH</p>\n<p>* <org value=\"DEC.NaE\" idsrc=\"xmltag.org\" >DIVERSIFIED ENERGY CO</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='DEC' fmr-param-security-type='Equity'>( DEC )</span> - TO BUY NATURAL GAS PROPERTIES IN\n<location value=\"LS/us.tx\" idsrc=\"xmltag.org\" >EAST\nTEXAS</location>\nSource text:\nFurther company coverage:</p>\n",
            "link": "https://www.fidelity.com/news/article/mergers-and-acquisitions/202602261725RTRSNEWSCOMBINED_TUA3MPW68_1",
            "pub_date": "2026-02-27 06:25:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Xenia Hotels & Resorts Insider Sold Shares Worth $3,179,424, According to a Recent SEC Filing",
            "description": "\n<p><chron>05:27 PM EST</chron>, <chron>02/26/2026</chron> (MT Newswires) -- Barry A N Bloom, President and Chief Operating Officer, on <chron>February 24, 2026</chron>, sold 202,508 shares in <org value=\"XHR.NaE\" idsrc=\"xmltag.org\" >Xenia Hotels &amp; Resorts</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='XHR' fmr-param-security-type='Equity'>( XHR )</span>  for <money>$3,179,424</money>. Following the Form 4 filing with the <org>SEC</org>, Bloom has control over a total of 15,233 common shares of the company, with 15,233 shares held directly.</p><p>SEC Filing:</p><p>https://www.sec.gov/Archives/edgar/data/1616000/000162828026012424/xslF345X05/wk-form4_1772144650.xml</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602261727MIDNIGHTUSEQUITY_A3574352",
            "pub_date": "2026-02-27 06:27:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Research Alert: CFRA Reiterates Hold Opinion On Shares Of The Toronto-dominion Bank",
            "description": "\n<p><chron>03:40 PM EST</chron>, <chron>02/26/2026</chron> (MT Newswires) -- CFRA, an independent research provider, has provided MT Newswires with the following research alert. Analysts at CFRA have summarized their opinion as follows:</p><p>After reviewing Q1 FY 26 earnings, we increase our 12-month target price by <money>CAD18</money> to <money>CAD151</money>, 14.8x our FY 27 (Oct.) EPS view of <money>CAD10.22</money>, above the peer average P/E of 13.1x, as superior credit quality and improving efficiency outweigh headwinds stemming from the asset cap on TD's two U.S. banking subsidiaries. We raise our FY 26 EPS estimate to <money>CAD9.37</money> from <money>CAD9.04</money> and increase FY 27's to <money>CAD10.22</money> from <money>CAD9.64</money>. While credit quality is weakening industry-wide, TD's recent results are encouraging. Gross impaired loans have risen only modestly in recent quarters. TD still trails peers on efficiency but is making progress as its adjusted efficiency ratio improved 190 bps Y/Y to 57.1% in Q1 FY 26. Return on equity (ROE) also improved 100 bps to 14.2%. Additional ROE gains should come readily as TD plans to reduce its CET1 ratio from 14.5% to approximately 13% by 2H FY 27, which would add another 100 bps to ROE. Shares yield a healthy 3.1%.</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/investing-ideas/202602261540MIDNIGHTUSEQUITY_A3574061",
            "pub_date": "2026-02-27 04:40:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Research Alert: CFRA Reiterates Hold Opinion On Shares Of The Toronto-dominion Bank",
            "description": "\n<p><chron>03:40 PM EST</chron>, <chron>02/26/2026</chron> (MT Newswires) -- CFRA, an independent research provider, has provided MT Newswires with the following research alert. Analysts at CFRA have summarized their opinion as follows:</p><p>After reviewing Q1 2026 earnings, we increase our 12-month target price by <money>USD15</money> to <money>USD110</money>, 14.8x our FY 27 (Oct.) EPS view of <money>CAD10.22</money>, above the peer average P/E of 13.1x, as superior credit quality and improving efficiency outweigh headwinds stemming from the asset cap on TD's two U.S. banking subsidiaries. We raise our FY 26 EPS estimate to <money>CAD9.37</money> from <money>CAD9.04</money> and increase FY 27's to <money>CAD10.22</money> from <money>CAD9.64</money>. While credit quality is weakening industry-wide, TD's recent results are encouraging. Gross impaired loans have risen only modestly in recent quarters. TD still trails peers on efficiency but is making progress as its adjusted efficiency ratio improved 190 bps Y/Y to 57.1% in Q1 FY 26. Return on equity (ROE) also improved 100 bps to 14.2%. Additional ROE gains should come readily as TD plans to reduce its CET1 ratio from 14.5% to approximately 13% by 2H FY 27, which would add another 100 bps to ROE. Shares yield a healthy 3.1%.</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/investing-ideas/202602261540MIDNIGHTUSEQUITY_A3574060",
            "pub_date": "2026-02-27 04:40:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "RB Global's Ritchie Bros. Auctioneers Sells US$265+ Million of Equipment in Orlando",
            "description": "\n<p><chron>05:02 PM EST</chron>, <chron>02/26/2026</chron> (MT Newswires) -- <org value=\"RBA.NaE\" idsrc=\"xmltag.org\" >RB Global</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='RBA' fmr-param-security-type='Equity'>( RBA )</span>  on Thursday said its <person>Ritchie Bros</person>. Auctioneers unit generated more than <money>US$265 million</money> in gross transaction value during its <chron>Feb. 16-20</chron> premier global auction in <location value=\"LU/us.fl.orlndo\" idsrc=\"xmltag.org\" >Orlando, Florida</location>, selling more than 14,500 equipment items, trucks and vehicles.</p><p>According to a statement, the five-day auction drew more than 19,500 participants from more than 80 countries across the construction, transportation, agriculture and energy sectors. Approximately 86% of the assets were sold to U.S. buyers, including 39% purchased by Floridians, with the remaining 14% purchased by international buyers as far away as <location value=\"LC/vn\" idsrc=\"xmltag.org\" >Vietnam</location>, <location value=\"LC/sa\" idsrc=\"xmltag.org\" >Saudi Arabia</location> and <location value=\"LC/au\" idsrc=\"xmltag.org\" >Australia</location>.</p><p>&quot;<location value=\"LU/us.fl.orlndo\" idsrc=\"xmltag.org\" >Orlando</location> continues to deliver scale and visibility that no other event in our industry can match,&quot; said <person>Jake Lawson</person>, president and head of <person>Ritchie Bros</person>. North <person>America Sales</person>. &quot;With more than 14,500 assets sold and participation from buyers onsite and online, the auction offers an early indicator of equipment demand and pricing trends.&quot;</p><p><org value=\"RBA.NaE\" idsrc=\"xmltag.org\" >RB Global</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='RBA' fmr-param-security-type='Equity'>( RBA )</span> shares closed up <money>C$3.71</money> to <money>C$139.25</money> on <org>Toronto Stock Exchange</org>.</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602261702MIDNIGHTUSEQUITY_A3574297",
            "pub_date": "2026-02-27 06:02:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Exclusive-ASML says next-gen EUV tools ready to mass-produce chips, marking key shift for AI chip production Â",
            "description": "\n<p><location value=\"LU/us.ca.sanjse\" idsrc=\"xmltag.org\" >SAN JOSE, California</location>, <chron>Feb 26</chron> (Reuters) - ASML Holding's next-generation chipmaking machine is ready for manufacturers to start bringing it into use for production at high volumes, a senior executive told Reuters, a big step for the chip industry.</p>\n<p>The Dutch company produces the world's only commercial extreme ultraviolet lithography (EUV) tools, which are a critical piece of equipment for chipmakers. This new tool will help chipmakers such as Taiwan Semiconductor Manufacturing  and <org value=\"INTC.NaE\" idsrc=\"xmltag.org\" >Intel</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='INTC' fmr-param-security-type='Equity'>( INTC )</span> produce more powerful and efficient chips, by eliminating several costly and complex steps from the chip-manufacturing process, data from ASML shows.</p>\n<p>ASML plans to release this data, which represents a key milestone, at a technical conference in <location value=\"LU/us.ca.sanjse\" idsrc=\"xmltag.org\" >San Jose</location> on Thursday, the company's chief technology officer, <person>Marco Pieters</person>, told Reuters on Wednesday.</p>\n<p>It has taken ASML years to develop the costly, next-generation tools as chipmakers have attempted to determine at what point it makes economic sense to begin to use them for mass production.</p>\n<p>But given that the current generation of EUV tools is approaching the technical limit of their ability to make complex AI chips, the next-generation machines - called High-NA EUV tools - are key for the AI industry to improve chatbots like OpenAI's ChatGPT and help chipmakers deliver their AI chip roadmaps on time to meet surging demand.</p>\n<p>The new tools cost roughly <money>$400 million</money>, twice the cost of the original EUV machines.</p>\n<p>The High-NA EUV tools now experience limited downtime, have produced 500,000 dinner-plate-sized silicon wafers and can draw sufficiently precise patterns that make up the circuits on the chip, the ASML data shows, Pieters said. In combination, the three data points indicate the tools are ready for manufacturers.</p>\n<p>&quot;I think that it's at a critical point to look at the amount of learning cycles that have happened,&quot; he said, referring to the number of tests that have been conducted on the machines by customers.</p>\n<p>Despite their technical readiness, it will take two to three years for companies to conduct enough testing and development to integrate them into manufacturing.</p>\n<p>&quot;(Chipmakers) have all the knowledge to qualify these tools,&quot; Pieters said.</p>\n<p>Pieters also said the company has achieved roughly 80% uptime at the moment and plans to achieve 90% by the end of the year. The imaging data ASML plans to release is enough to convince customers to replace multiple steps with the older-generation tools with a single <org>High-NA</org> step, Pieters said. The 500,000 wafers the machines have processed have allowed the company to work out many of the kinks.</p>\n<p></p>\n<p>(Reporting by <person>Max A. Cherney</person> in <location value=\"LU/us.ca.sanfrn\" idsrc=\"xmltag.org\" >San Francisco</location>;  Editing by <person>Sayantani Ghosh</person> and <person>Matthew Lewis</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602261704RTRSNEWSCOMBINED_KBN3PG2PC-OUSBS_1",
            "pub_date": "2026-02-27 06:04:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Teachers Federal Credit Union and Corridor Platforms Announce Intent to Launch Precision CUSO to Expand AI-Driven Credit Decisioning for Credit Unions Nationwide",
            "description": "\n<div class=\"xn-content\">\n<p class=\"prntac\"><i>Precision CUSO's AI-powered decisioning platform enables approval automation, scalability, and long-term competitiveness</i></p><p><span class=\"legendSpanClass\"><location value=\"LU/us.ny.hauuge\" idsrc=\"xmltag.org\" >HAUPPAUGE, N.Y.</location> and <location value=\"LU/us.nj.hawrth\" idsrc=\"xmltag.org\" >HAWORTH, N.J.</location></span>, <span class=\"legendSpanClass\"><chron>Feb. 26, 2026</chron></span> /PRNewswire/ -- <org>Teachers Federal Credit Union</org>, one of the largest credit unions in <location value=\"LC/us\" idsrc=\"xmltag.org\" >the United States</location> with more than <money>$9.9 billion</money> in assets and over 472,000 members nationwide, and Corridor Platforms, a leading provider of decision intelligence automation and governance software, today announced their intent to launch Precision CUSO, a <org>Credit Union Service Organization</org> (CUSO) created to deliver advanced approval automation and AI-driven credit decisioning capabilities to credit unions across the country.</p>\n    <div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder1\">\n                <p>\n\n                    <img src=\"https://mma.prnewswire.com/media/2921684/Teachers_Federal_Credit_Union_Corridor_Platforms.jpg\" title=\"Teachers Federal Credit Union and Corridor Platforms announce intent to launch Precision CUSO, a Credit Union Service Organization (CUSO) created to deliver advanced approval automation and AI-driven credit decisioning capabilities to credit unions across the country.\" alt=\"Teachers Federal Credit Union and Corridor Platforms announce intent to launch Precision CUSO, a Credit Union Service Organization (CUSO) created to deliver advanced approval automation and AI-driven credit decisioning capabilities to credit unions across the country.\" />\n\n                </p>\n    </div>\n<p>Precision CUSO will provide institutions with access to sophisticated decisioning technology that helps modernize lending and member engagement without sacrificing governance, compliance, or data ownership. The solution enables credit unions to automate credit approvals, streamline decision workflows, and apply data-driven insights at scale, empowering them to compete effectively in a rapidly evolving financial services landscape.</p><p>Precision CUSO offers credit unions a hosted decision intelligence platform that supports custom underwriting, automated compliance controls, and built-in governance. Credit unions can develop and refine decisioning strategies using their own member data, while also integrating existing in-house or third-party models. These models and strategies are continuously tested and optimized through a disciplined governance framework, including champion-challenger testing, reducing manual intervention, improving consistency, and enabling faster, more personalized member experiences as needs and behaviors evolve.</p><p>By leveraging a centralized decision analytics infrastructure developed in collaboration with <org>Teachers Federal Credit Union</org>, Precision CUSO connects data across core banking systems, loan origination platforms, bureau data, and other third-party sources to enable a holistic, real-time view of each member, supporting smarter decisions at every stage of the relationship.</p><p>\"Our partnership with Corridor Platforms has helped transform how we make decisions and serve our members,\" said <person>Brad Calhoun</person>, President and CEO of <org>Teachers Federal Credit Union</org>. \"With Precision CUSO, we are extending those same capabilities to credit unions nationwide — providing the tools to automate approvals, scale responsibly, and compete both today and well into the future, while staying grounded in the cooperative values that define our industry.\"</p><p>\"The pressure on credit unions to modernize has never been greater,\" said <person>Manish Gupta</person>, CEO of Corridor Platforms. \"Precision CUSO represents a 'by credit unions, for credit unions' solution that combines the innovation of AI-driven decisioning with the governance, transparency, and member-centric values that define the credit union industry. In an AI-first world, we have collaborated closely with <org>Teachers Federal Credit Union</org> to build a solution that allows credit unions of all sizes to innovate, grow, and meet the changing needs of their members with confidence.\"</p><p>For additional information and future updates on Precision CUSO, visit www.precisioncuso.org.</p><p><b>About <org>Teachers Federal Credit Union</org></b></p><p><org>Teachers Federal Credit Union</org> (Teachers) is one of the country's largest credit unions, with more than <money>$9.9 billion</money> in assets and over 472,000 members across all 50 states. Founded in <location value=\"LS/us.ny\" idsrc=\"xmltag.org\" >New York</location> in 1952, Teachers is a full-service, not-for-profit financial institution with an open charter offering membership to anyone in the U.S. through its 32 full-service branches and best-in-class digital solutions. Teachers is a key supporter of the communities it serves and is proud to offer a range of member-focused products with competitive rates and low fees. What started as a smart solution for teachers is now smart for all. For more information, visit www.teachersfcu.org.</p><p><b>About Corridor Platforms</b></p><p>Corridor Platforms is a leading provider of proprietary decision workflow governance and automation software for AI and GenAI. The company's decisioning platform was created by a team of highly seasoned banking professionals with experience leveraging the most advanced analytics, big data and AI capabilities for decisioning in regulated industries. <org>Corridor Platforms Inc.</org> is majority owned by its founders, with additional investment from EXL Services and <person>Oliver Wyman</person>. For more information visit www.corridorplatforms.com.</p>\n\n\n\n<p id=\"PURL\"><img title=\"Cision\" width=\"12\" height=\"12\" alt=\"Cision\" src=\"https://edge.prnewswire.com/c/img/favicon.png?sn=NY97303&amp;sd=2026-02-26\" /> View original content to download multimedia:https://www.prnewswire.com/news-releases/teachers-federal-credit-union-and-corridor-platforms-announce-intent-to-launch-precision-cuso-to-expand-ai-driven-credit-decisioning-for-credit-unions-nationwide-302699066.html</p><p>SOURCE <org>Teachers Federal Credit Union</org></p></div>\n",
            "link": "https://www.fidelity.com/news/article/technology/202602261712PR_NEWS_USPR_____NY97303",
            "pub_date": "2026-02-27 06:12:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Trading Day: Nvidia swings and misses",
            "description": "<p><location value=\"LU/us.fl.orlndo\" idsrc=\"xmltag.org\" >ORLANDO, Florida</location>, <chron>Feb 26</chron> (Reuters) - A heavy selloff in tech stocks pushed the S&amp;P 500 and Nasdaq lower on Thursday after investors' initial positive reaction to AI chipmaker <org value=\"NVDA.NaE\" idsrc=\"xmltag.org\" >Nvidia's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NVDA' fmr-param-security-type='Equity'>( NVDA )</span> results was replaced by doubt and pessimism, while safe-haven assets gold and Treasuries rose. </p>\n<p>More on that below. In my column today I look at the blistering rally in emerging market equities this year, led by <location value=\"LC/kr\" idsrc=\"xmltag.org\" >South Korea's</location> astonishing 50% surge, and ponder when the pause or correction comes. There's no way it can continue at this pace, can it?</p>\n<p>If you have more time to read, here are a few articles I recommend to help you make sense of what happened in markets today.</p>    1.         <org value=\"NVDA.NaE\" idsrc=\"xmltag.org\" >Nvidia's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NVDA' fmr-param-security-type='Equity'>( NVDA )</span> CEO prepares investors for a renewed battlewith Intel, AMD     2.         IMF calls for U.S. fiscal consolidation to bring down&quot;too big&quot; current account deficit          3.         To win <location value=\"LR/eur\" idsrc=\"xmltag.org\" >Europe's</location> embrace, <location value=\"LC/cn\" idsrc=\"xmltag.org\" >China</location> needs to uncap the yuan:Mike Dolan          4.         Rare earth shortages worsen in U.S. aerospace, chipsdespite trade truce, sources say          5.         <location value=\"LC/jp\" idsrc=\"xmltag.org\" >Japan's</location> Takaichi gets her doves in a row with BOJ boardappointees<p>Today's Key Market Moves</p>    *         STOCKS: Nasdaq -1.3%, S&amp;P 500 -0.5%. Dow and Russell2000 in the green. New highs overnight for <location value=\"LC/jp\" idsrc=\"xmltag.org\" >Japan</location>, <location value=\"LC/tw\" idsrc=\"xmltag.org\" >Taiwan</location>, SouthKorea, UK, and MSCI EM and <location value=\"LR/asp\" idsrc=\"xmltag.org\" >Asia</location> ex-<location value=\"LC/jp\" idsrc=\"xmltag.org\" >Japan</location> benchmark indices.     *         SECTORS/SHARES: Seven of S&amp;P 500's 11 sectors fall, tech-1.8%. <location value=\"LU/us.pa.phldph\" idsrc=\"xmltag.org\" >Philadelphia</location> semiconductor index -3%, <org value=\"NVDA.NaE\" idsrc=\"xmltag.org\" >Nvidia</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NVDA' fmr-param-security-type='Equity'>( NVDA )</span> -5.5%.Financials +1.3%, Paramount Skydance +10%.    *         FX: Dollar index ends flat. Sterling biggest G10decliner, most EM FX falls. Big exception is <location value=\"LC/cn\" idsrc=\"xmltag.org\" >China's</location> yuan -onshore and offshore CNY highest in nearly three years, onshoreCNY on longest winning streak since 2010.    *         BONDS: U.S. yields fall 3-4 bps, 7-year auction is ok.30-year U.S. mortgage rates below 6% for first time sinceSeptember 2022. UK 10-yr gilt yield lowest since <chron>Dec 2024</chron>.        *         COMMODITIES/METALS: Oil and gold slip a bit, with alleyes on U.S.-<location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location> talks, Comex copper has 3-week closing high.<p>Today's Talking Points </p>\n<p>* Tech's sentiment seesaw in full swing</p>\n<p><org value=\"NVDA.NaE\" idsrc=\"xmltag.org\" >Nvidia</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NVDA' fmr-param-security-type='Equity'>( NVDA )</span> shares spiked 4% in after-hours trade on Wednesday immediately after Q4 results showed a solid sales beat and forecast-busting outlook. But that's evidently not enough, and shares sank 5.5% on Thursday, the biggest fall since April and wiping <money>$260 billion</money> off the company's value. </p>\n<p>The last 24 hours show how skittish the market is around AI and whether its disruptive force will be for good or ill. More pressing, will AI deliver the returns investors expect from the huge capex underway across the sector? Views on that seem to change from day to day.</p>\n<p>* Summer Fed cut hopes fade</p>\n<p>As debate swirls around Fed Chair nominee <person>Kevin Warsh's</person> dovish or hawkish tendencies, recent moves in interest rate futures markets bear watching - the next fully-priced quarter percentage point rate cut is being pushed back to September.</p>\n<p>Presuming Warsh is confirmed by lawmakers and succeeds <person>Jerome Powell</person> in May as planned, that implies the Fed won't be easing until his third policy meeting as Chair. With core PCE inflation at 3%, this pause seems reasonable. President <person>Donald Trump</person>, looking to November's potentially tricky midterm elections, might not be so understanding. </p>\n<p>* U.S. mortgage &quot;relief&quot; </p>\n<p>Any frustration Trump may feel about sticky interest rates could be offset by more encouraging signals from the housing market - average 30-year mortgage rates are now below 6% for the first time since <chron>September 2022</chron>.</p>\n<p>Psychologically, the break into 5% territory could be significant for would-be homeowners, and if sustained, could help ease the affordability crisis ahead of the midterm elections. That said, borrowing to buy a house is still expensive - some 70% of all existing mortgages are at rates below 5%. </p>\n<p>What could move markets tomorrow?</p>    * Japan Tokyo CPI inflation (February)    * <location value=\"LC/jp\" idsrc=\"xmltag.org\" >Japan</location> industrial production (January, prelim)    * India GDP (Q3)    * <location value=\"LC/de\" idsrc=\"xmltag.org\" >Germany</location> unemployment (February)    * Germany CPI inflation (February)    * <org>Bank of England</org> chief economist <person>Huw Pill</person> speaks    * Canada GDP (Q4)    * U.S. producer price inflation (January)    * U.S. Chicago PMI (February)<p>Want to receive Trading Day in your inbox every weekday morning? Sign up for my newsletter here. </p>\n<p>Opinions expressed are those of the author. They do not reflect the views of <org>Reuters News</org>, which, under the Trust Principles, is committed to integrity, independence, and freedom from bias.</p>\n<p></p>\n<p> (Reporting by <person>Jamie McGeever</person>; Editing by <person>Nia Williams</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/international/202602261702RTRSNEWSCOMBINED_KBN3PG2PG-OUSBS_1",
            "pub_date": "2026-02-27 06:02:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "GLOBAL MARKETS-World shares retreat from record highs amid concerns about tech valuations",
            "description": "\n<p>(Updates prices throughout with U.S. markets close, adds oil\nsettlement)</p>\n<p>*</p>\n<p><org value=\"NVDA.NaE\" idsrc=\"xmltag.org\" >Nvidia</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NVDA' fmr-param-security-type='Equity'>( NVDA )</span> reports strong results, but shares fall</p>\n<p></p>\n<p>*</p>\n<p>S&amp;P 500 and Nasdaq finish lower; European shares ease</p>\n<p></p>\n<p>*</p>\n<p>World shares index eases after hitting record high</p>\n<p></p>\n<p>*</p>\n<p>Oil prices rise in volatile trading</p>\n<p></p>\n<p>By <person>Chibuike Oguh</person></p>\n<p><location value=\"LU/us.ny.nyc\" idsrc=\"xmltag.org\" >NEW YORK</location>, <chron>Feb 26</chron> (Reuters) - An index of global equity\nmarkets eased after hitting a record high on Thursday as\nconcerns about lofty valuations of leading technology companies\nweighed on markets after artificial intelligence chipmaker\n<org value=\"NVDA.NaE\" idsrc=\"xmltag.org\" >Nvidia</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NVDA' fmr-param-security-type='Equity'>( NVDA )</span> reported quarterly results.</p>\n<p>The benchmark S&amp;P 500 on <location>Wall Street</location> and equities in <location value=\"LR/eur\" idsrc=\"xmltag.org\" >Europe</location>\nfinished lower as investors digested another blowout quarter\nfrom <org value=\"NVDA.NaE\" idsrc=\"xmltag.org\" >Nvidia</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NVDA' fmr-param-security-type='Equity'>( NVDA )</span>, the world's most valuable company, but worried\nabout its market value even as it forecast that first-quarter\nrevenue would be a whopping <money>$78 billion</money>.</p>\n<p>On <location>Wall Street</location>, technology and communication services were\nthe biggest losers, with <org value=\"NVDA.NaE\" idsrc=\"xmltag.org\" >Nvidia's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NVDA' fmr-param-security-type='Equity'>( NVDA )</span> shares closing down 5.5%. The\nDow Jones Industrial Average edged higher by 0.03%, the\nS&amp;P 500 lost 0.53%, and the Nasdaq Composite fell\n1.2%.</p>\n<p></p>\n<p>LOFTY VALUATIONS RAISE CONCERNS</p>\n<p>&quot;People are getting concerned about lofty valuations even\nthough when you look at a company like <org value=\"NVDA.NaE\" idsrc=\"xmltag.org\" >Nvidia</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NVDA' fmr-param-security-type='Equity'>( NVDA )</span>, the estimates,\ncash flow, and everything else are dramatically higher,&quot; said\n<person>Thomas Plumb</person>, chief executive and portfolio manager at Plumb\nFunds in <location value=\"LU/us.wi.madisn\" idsrc=\"xmltag.org\" >Madison, Wisconsin</location>.</p>\n<p>&quot;But I think the sentiment will eventually match up with the\nrealities,&quot; said Plumb, who has <org value=\"NVDA.NaE\" idsrc=\"xmltag.org\" >Nvidia</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NVDA' fmr-param-security-type='Equity'>( NVDA )</span> as his largest investment\nholding.</p>\n<p>In <location value=\"LR/eur\" idsrc=\"xmltag.org\" >Europe</location>, the broad STOXX 600 index edged lower by\n0.05% after touching a new record high. MSCI's All Country World\nIndex eased 0.2% after rising to a record high\nof 1,063.86.</p>\n<p>&quot;It's an increasingly cloudy future for AI,&quot; said <person>James St.\nAubin</person>, chief investment officer at Ocean Park Asset Management\nin <location value=\"LU/us.ca.sanica\" idsrc=\"xmltag.org\" >Santa Monica, California</location>. &quot;It's not that AI isn't going to\nwork out. It's about who's going to be the winners? How do these\nfirms keep competitive advantages? There's a lot of upstream and\ndownstream impact that the market is really having trouble\nsorting out.&quot;</p>\n<p>Several heavyweight technology companies finished lower on\n<location>Wall Street</location>. Alphabet declined 1.7%, <org value=\"AAPL.NaE\" idsrc=\"xmltag.org\" >Apple</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AAPL' fmr-param-security-type='Equity'>( AAPL )</span>\nfell 0.5%, <org value=\"AMZN.NaE\" idsrc=\"xmltag.org\" >Amazon</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AMZN' fmr-param-security-type='Equity'>( AMZN )</span> lost 1.3%, and Tesla shed\n2.1%.</p>\n<p>&quot;I always go back to the curse of high expectations, where\nwith <org value=\"NVDA.NaE\" idsrc=\"xmltag.org\" >Nvidia</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NVDA' fmr-param-security-type='Equity'>( NVDA )</span>, everything has to be perfect in order for it to\ncontinue to thrive and to appreciate. And I think right now they\nmaybe didn't reassure investors enough that the line of sight\nwas clear,&quot; St. Aubin said.</p>\n<p><org value=\"CRM.NaE\" idsrc=\"xmltag.org\" >Salesforce</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='CRM' fmr-param-security-type='Equity'>( CRM )</span>, which reported quarterly revenue higher\nthan analyst estimates after markets closed on Wednesday, rose\n4%.</p>\n<p><org value=\"LDNXF.NaE\" idsrc=\"xmltag.org\" >London Stock Exchange Group's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='LDNXF' fmr-param-security-type='Equity'>( LDNXF )</span> shares jumped 9% in\n<location value=\"LU/gb.eng.london\" idsrc=\"xmltag.org\" >London</location> after it announced a <money>$4.1 billion</money> buyback under pressure\nfrom activist investor Elliott Management, which recently built\na stake in the data provider.</p>\n<p></p>\n<p>NUCLEAR TALKS</p>\n<p>Investors are eyeing indirect talks between the U.S. and\n<location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location> over their long-running nuclear dispute. Oil prices slipped\nin a volatile session as markets awaited the outcome of the\ntalks.</p>\n<p>Brent crude futures fell 0.14% to settle at <money>$70.75</money> a\nbarrel. U.S. crude futures settled down 0.32% to <money>$66.21</money>.</p>\n<p>Treasury bond prices in the U.S. and <location value=\"LR/eur\" idsrc=\"xmltag.org\" >Europe</location> edged higher on\nthe back of safe-haven bids as investors grew nervous about\ntensions involving <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location>.</p>\n<p>The yield on benchmark U.S. 10-year notes fell\n3.6 basis points to 4.012%. The 2-year note yield\nfell 3.5 basis points to 3.436%.</p>\n<p>In <location value=\"LR/eur\" idsrc=\"xmltag.org\" >Europe</location>, the yield on benchmark German 10-year Bunds\nlost 0.8 basis points to 2.69%.</p>\n<p>Safe-haven gold rose, with spot gold adding 0.29% to\n<money>$5,185.04</money> an ounce.</p>\n<p>In currency markets, the dollar rose against major\ncurrencies, including the euro and Swiss franc.</p>\n<p>The euro was down 0.09% at <money>$1.1798</money> against the\ndollar.  The dollar was up 0.23% to 0.774 against the Swiss\nfranc.</p>\n<p>The Japanese yen rose 0.16% to 156.1 against the\ngreenback days after the government of Prime Minister <person>Sanae\nTakaichi</person> nominated two pro-stimulus academics to the board of\nthe Bank of Japan.</p>\n<p></p>\n<p>(Reporting by <person>Chibuike Oguh</person> in New York\nEditing by <person>Rod Nickel</person> and <person>Nia Williams</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/international/202602261713RTRSNEWSCOMBINED_L1N3ZM1JG_1",
            "pub_date": "2026-02-27 06:13:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Mexico's Becle posts 13% drop in Q4 profit on higher tax burden",
            "description": "\n<p><location value=\"LU/mx.sm.mexcty\" idsrc=\"xmltag.org\" >MEXICO CITY</location>, <chron>Feb 26</chron> - <location value=\"LC/mx\" idsrc=\"xmltag.org\" >Mexico's</location> Becle, the\nworld's largest tequila maker, on Thursday posted a 12.8% drop\nin its fourth-quarter net profit compared to a year earlier,\nbrought about by a dip in sales and higher tax rates.\nNet profit for the final three months of 2025 fell to <money>1.35\nbillion Mexican pesos</money> (<money>$75.0 million</money>), as revenue declined 14.1%\nyear on year to <money>11.08 billion pesos</money> amid weaker volumes in <location value=\"LR/nam\" idsrc=\"xmltag.org\" >North\nAmerica</location> and unfavorable currency effects from a stronger peso.</p>\n<p>Analysts had predicted a net profit of <money>1.60 billion pesos</money>\nfrom revenues of <money>12.25 billion pesos</money>.</p>\n<p>The company said the profit decline was driven mainly by a\nhigher income tax burden, while lower sales also reduced\noperating leverage even as gross and operating margins improved.</p>\n<p>Becle typically makes more than half its sales in <location value=\"LC/ca\" idsrc=\"xmltag.org\" >Canada</location> and\n<location value=\"LC/us\" idsrc=\"xmltag.org\" >the United States</location> and a quarter in its home market of <location value=\"LC/mx\" idsrc=\"xmltag.org\" >Mexico</location>.</p>\n<p>Last year however saw an industry-wide downturn in spirits\nsold to the U.S., while a Canadian boycott of U.S. brands in the\nwake of on-and-off tariff threats from <location value=\"LU/us.dc.wash\" idsrc=\"xmltag.org\" >Washington</location> also hit Becle\nproducts sold in that country.</p>\n<p>Becle makes the bulk of its income from <person>Jose Cuervo</person> family\ntequilas as well as a range of mezcals, vodkas, gins and\nwhiskeys.\nIn the first nine months of 2025, the U.S. imported <money>$2.83\nbillion</money>-worth of tequila, down 26% from the same period a year\nearlier, according to the <org>U.S. Distilled Spirits Council</org>, as\nspirits imports fell 17% across the board.</p>\n<p>This level nevertheless remained above <location value=\"LC/us\" idsrc=\"xmltag.org\" >the United States'</location>\nwhiskey, gin and rum imports combined.</p>\n<p>Alcohol consumption has been hit worldwide in what some\nindustry groups have attributed to changing consumer habits as\ncustomers tighten wallets and opt for healthy alternatives, as\nwell as to the commercialization of legal marijuana.</p>\n<p></p>\n<p>(<money>$1</money> = <money>18.0080 Mexican pesos</money> at end-December)\n(Reporting by Iñigo Alexander; Editing by <person>Brendan O'Boyle</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602261713RTRSNEWSCOMBINED_L6N3ZM1CN_1",
            "pub_date": "2026-02-27 06:13:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Verdad Resources Completes Sale of Operated Oil and Gas Portfolio to Peoria Resources, LLC",
            "description": "\n<div class=\"xn-content\">\n<p><span class=\"legendSpanClass\"><location value=\"LU/us.co.denver\" idsrc=\"xmltag.org\" >DENVER</location></span>, <span class=\"legendSpanClass\"><chron>Feb. 26, 2026</chron></span> /PRNewswire/ -- <org>Verdad Resources Holdings LLC</org> (\"Verdad\" or the \"Company\") today announced that it has completed the sale of its entire operated oil and gas business to <org>Peoria Resources, LLC</org> (\"Peoria\"), a subsidiary of <org>JAPEX (U.S.) Corp.</org> (\"JUS\"). The transaction reflects a total enterprise value of approximately <money>$1.26 billion</money>.</p>\n    <div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder1\">\n                <p>\n\n                    <img src=\"https://mma.prnewswire.com/media/2921757/Verdad_Resources_Logo.jpg\" title=\"Verdad Resources (PRNewsfoto/Verdad Resources, Peoria Resources, LLC)\" alt=\"Verdad Resources (PRNewsfoto/Verdad Resources, Peoria Resources, LLC)\" />\n\n                </p>\n    </div>\n<p>Through the transaction, Peoria is acquiring all of Verdad's E&amp;P operating assets in the <location>Denver-Julesburg Basin</location>. The portfolio comprises approximately 101,000 net acres across <location value=\"LS/us.co\" idsrc=\"xmltag.org\" >Colorado</location> and <location value=\"LS/us.wy\" idsrc=\"xmltag.org\" >Wyoming</location> and focuses on horizontal <location value=\"LU/us.wy.nioara\" idsrc=\"xmltag.org\" >Niobrara</location> and Codell formation development.</p><p>\"This milestone reflects the strong execution that our team delivered throughout the <location>DJ Basin</location> and underscores the value that Verdad's upstream portfolio stands to deliver in its next phase of growth under Peoria's leadership,\" said <person>Philip Davis</person>, Co-Chief Executive Officer of Verdad.</p><p>\"As our <location>DJ Basin</location> operated assets enter this next chapter,\" commented <person>Arthur Beecherl</person>, Co-CEO of Verdad, \"we thank all our equity partners for their support of our mission to acquire, develop and grow these high-quality upstream assets.\"</p><p>\"We are excited to build upon the strong foundation the entire Verdad team has put in place across the last decade. We are committed to being a healthy, sustainable business that enhances value through top-tier operating and technology capabilities of our staff for decades to come,\" said <person>Greg West</person>, CEO of Peoria. \"We've picked up a rig and also commit ourselves to establishing enduring partnerships with all service providers, regulators and communities across the <location>DJ Basin</location>.\"</p><p>\"Verdad has assembled a premier operated position in the <location>DJ Basin</location>, and we are grateful to Philip, Arthur and their team for the platform they have built,\" said <person>David Kita</person>, Chief Technical Officer of Peoria. \"This acquisition is the starting point for Peoria's growth story — establishing a scaled foundation in the <location>DJ Basin</location> from which we plan to invest, develop and pursue additional operated acquisitions across the lower 48.\"</p><p>\"We are delighted to acquire such a quality asset as a cornerstone to our operated portfolio, and we look forward to future growth in the lower 48 with our top tier team and asset base,\" said <person>Josh Karim</person>, JUS Chief Operating Officer.</p><p><org>JP Morgan Securities LLC</org> served as exclusive financial advisor and <org>Kirkland &amp; Ellis LLP</org> served as exclusive legal advisor to Verdad in connection with the transaction.</p><p><org>Wells Fargo Securities, LLC</org> served as exclusive financial advisor to Peoria, and <org>Willkie Farr &amp; Gallagher LLP</org> served as exclusive legal advisor to Peoria in connection to the transaction. <org>Wells Fargo Bank</org>, National Association will serve as Administrative Agent on Peoria's credit facility.</p><p><b>About Verdad Resources<br /></b>Verdad Resources is an upstream oil and gas operator committed to responsibly developing oil and gas reserves with an emphasis on unconventional resources. With a deep respect for individuals, the land and the communities adjacent to our assets, Verdad strives to establish durable and mutually beneficial relationships in areas where it operates while fostering a culture of safety, integrity and hard work for its team members. To learn more, please visit www.verdadresources.com/.</p><p><b><i>About Peoria Resources<br /></i></b>Peoria Resources is an exploration and production company based in <location value=\"LU/us.tx.houstn\" idsrc=\"xmltag.org\" >Houston, TX</location> and <location value=\"LU/us.co.denver\" idsrc=\"xmltag.org\" >Denver, CO</location> focused on the development of operated oil and natural gas assets in the <location>DJ Basin</location> while continuing to pursue disciplined acquisitions of operated assets across the lower 48. The company is led by co-founders <person>Greg West</person> and <person>David Kita</person>. For more information, please visit: www.peoriaresources.com.</p><p><b><i>About <org>JAPEX (U.S.) Corp.</org><br /></i></b><org>JAPEX (U.S.) Corp.</org>, which was established in 1980, is a <location value=\"LU/us.tx.houstn\" idsrc=\"xmltag.org\" >Houston</location>-based overseas consolidated subsidiary of JAPEX (Japan Petroleum Exploration Co. Ltd.), focused on domestic U.S. investments in the energy industry. For more information, please visit: https://www.JAPEX.co.jp/en/.</p>\n<div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder2\">\n                <p>\n\n                    <img src=\"https://mma.prnewswire.com/media/2921762/Peoria_Resources_Logo.jpg\" title=\"Peoria Resources (PRNewsfoto/Verdad Resources, Peoria Resources, LLC)\" alt=\"Peoria Resources (PRNewsfoto/Verdad Resources, Peoria Resources, LLC)\" />\n\n                </p>\n</div>\n\n\n\n<p id=\"PURL\"><img title=\"Cision\" width=\"12\" height=\"12\" alt=\"Cision\" src=\"https://edge.prnewswire.com/c/img/favicon.png?sn=DA97322&amp;sd=2026-02-26\" /> View original content to download multimedia:https://www.prnewswire.com/news-releases/verdad-resources-completes-sale-of-operated-oil-and-gas-portfolio-to-peoria-resources-llc-302699068.html</p><p>SOURCE <org>Peoria Resources, LLC</org>; Verdad Resources</p></div>\n",
            "link": "https://www.fidelity.com/news/article/mergers-and-acquisitions/202602261714PR_NEWS_USPR_____DA97322",
            "pub_date": "2026-02-27 06:14:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US Equity Indexes Mixed as Financials Help Partially Offset Sell-Off in Chipmakers",
            "description": "\n<p><chron>04:44 PM EST</chron>, <chron>02/26/2026</chron> (MT Newswires) -- US equity indexes closed mixed on Thursday as gains in financials helped partially offset a sell-off in semiconductor firms, following <org value=\"NVDA.NaE\" idsrc=\"xmltag.org\" >Nvidia's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NVDA' fmr-param-security-type='Equity'>( NVDA )</span>  quarterly results overnight.</p><p>The Nasdaq Composite dropped 1.2% to 22,878.38, and the S&amp;P 500 dropped 0.5% to 6,908.86. The Dow Jones Industrial Average rose less than 0.1% to 49,499.20, clawing back all of its intraday declines.</p><p>All but four sectors, including financials and industrials, declined. <org value=\"AXP.NaE\" idsrc=\"xmltag.org\" >American Express</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AXP' fmr-param-security-type='Equity'>( AXP )</span> , Visa (V), and <org value=\"JPM.NaE\" idsrc=\"xmltag.org\" >JPMorgan Chase</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='JPM' fmr-param-security-type='Equity'>( JPM )</span>  were among the top five gainers in the Dow.</p><p>Technology, communication services, and consumer discretionary were among the steepest decliners.</p><p><org value=\"NVDA.NaE\" idsrc=\"xmltag.org\" >Nvidia</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NVDA' fmr-param-security-type='Equity'>( NVDA )</span> reported a year-over-year jump in fiscal Q4 adjusted earnings and revenue late Wednesday and issued a Q1 revenue outlook above analysts' expectations. Nevertheless, shares gave up after-hours gains accrued late Wednesday, and fell 5.5% in the regular session Thursday, the worst performer on the Dow and the Nasdaq.</p><p>Among stocks with a market capitalization of over <money>$200 billion</money>, nine out of the 10 worst performers were chipmakers, data compiled by Finviz showed. <org value=\"NVDA.NaE\" idsrc=\"xmltag.org\" >Nvidia</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NVDA' fmr-param-security-type='Equity'>( NVDA )</span> led the pack, with <org value=\"AVGO.NaE\" idsrc=\"xmltag.org\" >Broadcom</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AVGO' fmr-param-security-type='Equity'>( AVGO )</span> , <org value=\"AMAT.NaE\" idsrc=\"xmltag.org\" >Applied Materials</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AMAT' fmr-param-security-type='Equity'>( AMAT )</span> , and <org value=\"ASML.NaE\" idsrc=\"xmltag.org\" >ASML</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='ASML' fmr-param-security-type='Equity'>( ASML )</span> .</p><p>Further in company news, <org value=\"CRM.NaE\" idsrc=\"xmltag.org\" >Salesforce</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='CRM' fmr-param-security-type='Equity'>( CRM )</span>  shares rose 4%, the biggest outperformer on the Dow, after the customer relationship management platform reported overnight fiscal Q4 results above market expectations.</p><p><org value=\"PSKY.NaE\" idsrc=\"xmltag.org\" >Paramount Skydance</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='PSKY' fmr-param-security-type='Equity'>( PSKY )</span>  reported a wider Q4 loss but stronger-than-expected growth in year-over-year revenue late Wednesday. &quot;We like the operational momentum under new management, with the DTC segment showing strength,&quot; CFRA told MT Newswires while acknowledging the company's mixed results. Shares jumped 10%, the top gainer on the S&amp;P 500.</p><p>In economic news, US initial jobless claims rose to 212,000 in the week ended <chron>Feb. 21</chron> from an upwardly revised 208,000 in the previous week, compared with expectations for 216,000 in a survey of analysts compiled by <org>Bloomberg</org>.</p><p>Meanwhile, the Kansas City Fed monthly manufacturing index rose to 5 in February from 0 in January, higher than expectations for an increase to 2 in a <org>Bloomberg</org>-compiled survey.</p><p>Most US Treasury yields declined, with the two-year down 3.7 basis points to 3.43%. The 10-year yield dropped 3.8 basis points to 4.01%, the lowest since late November.</p><p>In precious metals, gold futures fell 0.4% to <money>$5,204.60</money> per troy ounce, and silver futures slumped 2.3% to <money>$89.20</money> per troy ounce.</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/us-markets/202602261644MIDNIGHTUSEQUITY_A3574261",
            "pub_date": "2026-02-27 05:44:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Nasdaq, S&P 500 Snap Two-Day Advance Amid Nvidia-Led Tech Pullback",
            "description": "\n<p><chron>04:49 PM EST</chron>, <chron>02/26/2026</chron> (MT Newswires) -- The Nasdaq Composite and the S&amp;P 500 closed lower Thursday after a two-day advance as <org value=\"NVDA.NaE\" idsrc=\"xmltag.org\" >Nvidia</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NVDA' fmr-param-security-type='Equity'>( NVDA )</span>  tumbled despite the technology bellwether's strong results and outlook.</p><p>The Nasdaq declined 1.2% to settle at 22,878.4, while the S&amp;P 500 fell 0.5% to 6,908.9. The Dow Jones Industrial Average was virtually flat at 49,499.2. Tech was the worst-performing sector, down 1.8%, while financials led the gainers with a 1.3% advance.</p><p><org value=\"NVDA.NaE\" idsrc=\"xmltag.org\" >Nvidia</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NVDA' fmr-param-security-type='Equity'>( NVDA )</span> shares slumped 5.5%, the worst performer on the Dow and among the worst on the S&amp;P 500, wiping out gains for this year.</p><p>Late Wednesday, the chipmaking giant posted fiscal fourth-quarter results above <location>Wall Street's</location> estimates as an artificial intelligence boom continued to fuel computing demand. It offered a stronger-than-expected revenue outlook for the ongoing quarter.</p><p>The post-earnings market reaction likely reflects continued concerns around AI disruptions and greater upside from networking than compute, <org>BofA Securities</org> analyst <person>Vivek Arya</person> wrote in a note. In addition, there were no updates on the <money>$500 billion</money> data center revenue opportunity the company shared last year.</p><p>Arya, however, views this as short-term noise, saying the stock presents a &quot;compelling valuation.&quot;</p><p>Morgan Stanley separately flagged cash flow pressure at hyperscalers, raising questions about capital spending sustainability.</p><p>Fellow mega-cap tech stock <org value=\"AMZN.NaE\" idsrc=\"xmltag.org\" >Amazon.com</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AMZN' fmr-param-security-type='Equity'>( AMZN )</span>  fell 1.3%, while <org value=\"AAPL.NaE\" idsrc=\"xmltag.org\" >Apple</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AAPL' fmr-param-security-type='Equity'>( AAPL )</span>  edged lower. <org value=\"AVGO.NaE\" idsrc=\"xmltag.org\" >Broadcom</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AVGO' fmr-param-security-type='Equity'>( AVGO )</span> , <org value=\"SMCI.NaE\" idsrc=\"xmltag.org\" >Super Micro Computer</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='SMCI' fmr-param-security-type='Equity'>( SMCI )</span> , and <org value=\"AMAT.NaE\" idsrc=\"xmltag.org\" >Applied Materials</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AMAT' fmr-param-security-type='Equity'>( AMAT )</span>  also saw declines.</p><p>US Treasury yields were lower, with the 10-year rate down 3.5 basis points at 4.01% and the two-year rate falling 3.5 basis points to 3.45%.</p><p><org value=\"CRM.NaE\" idsrc=\"xmltag.org\" >Salesforce</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='CRM' fmr-param-security-type='Equity'>( CRM )</span>  was the top gainer on the Dow, up 4%. The customer relationship management platform late Wednesday issued a weak full-year revenue outlook at the midpoint, but topped market estimates for its fiscal fourth-quarter results.</p><p><person>J.M. Smucker</person> (SJM) shares jumped 8.8%, the third-best performer on the S&amp;P 500. The food producer trimmed the top end of its full-year sales growth outlook due to a recent fire at one of its manufacturing facilities, while its fiscal third-quarter results topped market estimates.</p><p>West Texas Intermediate crude oil was last up 0.1% at <money>$65.51</money> a barrel.</p><p>In economic news, weekly applications for unemployment insurance in the US increased, while continuing claims decreased, government data showed.</p><p>&quot;The behavior of claims over the past few weeks suggest that labor market conditions remain steady and layoffs remain subdued,&quot; Jefferies said in a note.</p><p>Gold was last down 0.3% at <money>$5,212.60</money> per troy ounce, while silver dropped 1.8% to <money>$87.39</money> per ounce.</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/us-markets/202602261649MIDNIGHTUSEQUITY_A3574251",
            "pub_date": "2026-02-27 05:49:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Odds of early Warsh-led Fed rate cuts slide with bullish outlook",
            "description": "<p><location value=\"LU/us.dc.wash\" idsrc=\"xmltag.org\" >WASHINGTON</location>, <chron>Feb 26</chron> (Reuters) - Federal Reserve chair nominee <person>Kevin Warsh's</person> path to out-of-the-gate interest rate cuts in alignment with President <person>Donald Trump's</person> expectations could be narrowing amid emerging bullishness about the U.S. economy, growing CEO confidence in the outlook, and investors keying off a hawkish shift among the central bank's policymakers.</p>\n<p><org>The International Monetary Fund</org> said on Wednesday that with expected U.S. growth rising to 2.4% this year from 2.2% last year, the unemployment rate likely hovering near 4%, and inflation falling gradually, the Fed would have &quot;only modest scope to lower the policy rate over the coming year&quot; through a single quarter-percentage-point cut.</p>\n<p>A new Conference Board CEO survey, meanwhile, saw a sharp jump in the outlook for both the wider economy and within each leader's industry, with little sense that large rounds of layoffs were in the offing and firms passing through price increases from the Trump administration's import tariffs - a combination that could make it harder to justify rate cuts.</p>\n<p>Investors, meanwhile, have pushed back their bets on the timing of an initial Warsh-led rate cut, to the Fed's <chron>July 28-29</chron> meeting from the <chron>June 16-17</chron> gathering. Though his nomination has not been formally submitted to the <org>Senate</org>, Warsh is expected to be confirmed in time for the June meeting, with current Fed Chair <person>Jerome Powell's</person> leadership term ending in May.</p>\n<p>The improved outlook may be good for the economy, but it could leave Warsh in the same bind as Powell, with data and his colleagues pulling in one direction and the <org>White House</org> pulling in another.</p>\n<p>&quot;The Fed's reaction function has shifted slightly more hawkish,&quot; Natixis CIB economists <person>Christopher Hodge</person> and <person>Selin Aker</person> wrote in a note, concluding the central bank could only make two quarter-percentage-point rate cuts this year, rather than the three they previously expected.</p>\n<p>MIRAN SAYS BIG DROP IN RATES STILL POSSIBLE IN 2026</p>\n<p>The U.S. central bank's next meeting is scheduled for <chron>March 17-18</chron>, when its policy-setting Federal Open Market Committee is expected to hold the benchmark interest rate in the 3.50%-3.75% range. New quarterly economic and rate projections also will be released at the end of that meeting.</p>\n<p>In December, the only central bank official with a rate outlook close to the steep cuts Trump wants was Fed Governor <person>Stephen Miran</person>, the former head of the <location>Trump White House's</location> <org>Council of Economic Advisers</org>. Miran saw the Fed's policy rate falling to as low as the 2.00%-2.25% range in 2026. The median expectation among Miran's colleagues, by contrast, saw just one quarter-percentage-point cut as likely appropriate.</p>\n<p>Nearly three months later, and after a strong January employment report, Miran on Thursday told the &quot;Mornings with Maria&quot; program on Fox Business that he still feels rates could fall a full percentage point this year through four 25-basis-point cuts, ideally sooner than later.</p>\n<p>His outlook is partly based on his expectation for a &quot;profoundly disinflationary&quot; artificial intelligence boost to productivity, a &quot;supply shock&quot; that Warsh has also said should allow for lower rates.</p>\n<p>&quot;I really do not think that we have an inflation problem,&quot; despite recent inflation readings a point above the central bank's 2% target, said Miran, whose term as a Fed governor has technically expired, but who can continue to fill the job until a replacement is named. Absent some other departure from the Fed's seven-member <org>Board of Governors</org>, Miran's seat would be needed for Warsh to eventually come aboard.</p>\n<p>WARSH FACES POSSIBLE DILEMMA</p>\n<p>The minutes of the Fed's <chron>January 27-28</chron> meeting showed little support yet for relying on AI-optimism to recast monetary policy. Staff presentations suggested a small boost in the economy's potential may be developing - the &quot;supply shock&quot; Miran has mentioned, but only in a measured dose - though with demand still strong enough to sustain pressure on prices.</p>\n<p>The minutes also cited unexpected comments that several policymakers were open to the possibility that the next rate move could be a hike. In addition, Fed Governor <person>Christopher Waller</person>, who joined Miran in dissenting in favor of a cut at the meeting in January, said this week that if recent strong job growth is repeated, &quot;it may be appropriate to hold the FOMC's policy rate at current levels.&quot;</p>\n<p>The U.S. employment report for February is due to be released on <chron>March 6</chron>.</p>\n<p>A combination of sticky inflation, a steady unemployment rate, and continued economic growth would in many ways be a comforting outcome for the Fed. Policymakers generally agree that inflation will decline and anticipate the combination of slow job growth and low rates of layoffs will yield a roughly steady unemployment rate. As long as that outlook continues, and absent any sense that public expectations about inflation are starting to shift higher, there would be little motivation to do anything other than wait.</p>\n<p>Such an outcome could present a dilemma for Warsh, who has laid out arguments for why rates should fall and now will have to contend with a strong-willed and publicly demonstrative president who has taken the Fed chief nominee at his word. Trump said earlier this month that he had not asked Warsh to lower rates, but felt it was clear what his nominee would do.</p>\n<p>Trump has clashed with Powell repeatedly over the president's demands for deep rate cuts, but said of Warsh last month: &quot;I don't want to ask him that question. I think it's inappropriate ... I want to keep it nice and pure. But he certainly wants to cut rates.&quot;</p>\n<p>The president also told <org>NBC News</org> he had &quot;not much&quot; doubt rates would fall. &quot;We're way high,&quot; he said. Trump, who has linked his call for lower rates to hopes of financing federal government debt more cheaply and lowering costs for home mortgages, has voiced little concern about inflation that he feels has disappeared.</p>\n<p>However, with the economy currently growing beyond estimates of its potential and inflation showing little recent progress toward the Fed's target, there's no sense of urgency at the central bank to cut rates, particularly not as steeply as Trump or Miran have suggested.</p>\n<p>Trump's State of the Union speech to <org>Congress</org> earlier this week highlighted that paradox, as he trumpeted the good things that he believes have happened and those that are still to come. Many analysts agree a combination of fiscal stimulus in the form of tax cuts, ongoing deregulation, and the loose credit conditions supported by Fed rate cuts last year could spell upside for the economy - and make further reductions in borrowing costs all the less likely.</p>\n<p></p>\n<p>(Reporting by Howard Schneider;Editing by <person>Dan Burns</person> and <person>Paul Simao</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/us-economy/202602261456RTRSNEWSCOMBINED_KBN3PG2H9-OUSBS_1",
            "pub_date": "2026-02-27 03:56:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Trading Day: Nvidia swings and misses",
            "description": "<p><location value=\"LU/us.fl.orlndo\" idsrc=\"xmltag.org\" >ORLANDO, Florida</location>, <chron>Feb 26</chron> (Reuters) - A heavy selloff in tech stocks pushed the S&amp;P 500 and Nasdaq lower on Thursday after investors' initial positive reaction to AI chipmaker <org value=\"NVDA.NaE\" idsrc=\"xmltag.org\" >Nvidia's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NVDA' fmr-param-security-type='Equity'>( NVDA )</span> results was replaced by doubt and pessimism, while safe-haven assets gold and Treasuries rose. </p>\n<p>More on that below. In my column today I look at the blistering rally in emerging market equities this year, led by <location value=\"LC/kr\" idsrc=\"xmltag.org\" >South Korea's</location> astonishing 50% surge, and ponder when the pause or correction comes. There's no way it can continue at this pace, can it?</p>\n<p>If you have more time to read, here are a few articles I recommend to help you make sense of what happened in markets today.</p>    1.         <org value=\"NVDA.NaE\" idsrc=\"xmltag.org\" >Nvidia's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NVDA' fmr-param-security-type='Equity'>( NVDA )</span> CEO prepares investors for a renewed battlewith Intel, AMD     2.         IMF calls for U.S. fiscal consolidation to bring down&quot;too big&quot; current account deficit          3.         To win <location value=\"LR/eur\" idsrc=\"xmltag.org\" >Europe's</location> embrace, <location value=\"LC/cn\" idsrc=\"xmltag.org\" >China</location> needs to uncap the yuan:Mike Dolan          4.         Rare earth shortages worsen in U.S. aerospace, chipsdespite trade truce, sources say          5.         <location value=\"LC/jp\" idsrc=\"xmltag.org\" >Japan's</location> Takaichi gets her doves in a row with BOJ boardappointees<p>Today's Key Market Moves</p>    *         STOCKS: Nasdaq -1.3%, S&amp;P 500 -0.5%. Dow and Russell2000 in the green. New highs overnight for <location value=\"LC/jp\" idsrc=\"xmltag.org\" >Japan</location>, <location value=\"LC/tw\" idsrc=\"xmltag.org\" >Taiwan</location>, SouthKorea, UK, and MSCI EM and <location value=\"LR/asp\" idsrc=\"xmltag.org\" >Asia</location> ex-<location value=\"LC/jp\" idsrc=\"xmltag.org\" >Japan</location> benchmark indices.     *         SECTORS/SHARES: Seven of S&amp;P 500's 11 sectors fall, tech-1.8%. <location value=\"LU/us.pa.phldph\" idsrc=\"xmltag.org\" >Philadelphia</location> semiconductor index -3%, <org value=\"NVDA.NaE\" idsrc=\"xmltag.org\" >Nvidia</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NVDA' fmr-param-security-type='Equity'>( NVDA )</span> -5.5%.Financials +1.3%, Paramount Skydance +10%.    *         FX: Dollar index ends flat. Sterling biggest G10decliner, most EM FX falls. Big exception is <location value=\"LC/cn\" idsrc=\"xmltag.org\" >China's</location> yuan -onshore and offshore CNY highest in nearly three years, onshoreCNY on longest winning streak since 2010.    *         BONDS: U.S. yields fall 3-4 bps, 7-year auction is ok.30-year U.S. mortgage rates below 6% for first time sinceSeptember 2022. UK 10-yr gilt yield lowest since <chron>Dec 2024</chron>.        *         COMMODITIES/METALS: Oil and gold slip a bit, with alleyes on U.S.-<location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location> talks, Comex copper has 3-week closing high.<p>Today's Talking Points </p>\n<p>* Tech's sentiment seesaw in full swing</p>\n<p><org value=\"NVDA.NaE\" idsrc=\"xmltag.org\" >Nvidia</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NVDA' fmr-param-security-type='Equity'>( NVDA )</span> shares spiked 4% in after-hours trade on Wednesday immediately after Q4 results showed a solid sales beat and forecast-busting outlook. But that's evidently not enough, and shares sank 5.5% on Thursday, the biggest fall since April and wiping <money>$260 billion</money> off the company's value. </p>\n<p>The last 24 hours show how skittish the market is around AI and whether its disruptive force will be for good or ill. More pressing, will AI deliver the returns investors expect from the huge capex underway across the sector? Views on that seem to change from day to day.</p>\n<p>* Summer Fed cut hopes fade</p>\n<p>As debate swirls around Fed Chair nominee <person>Kevin Warsh's</person> dovish or hawkish tendencies, recent moves in interest rate futures markets bear watching - the next fully-priced quarter percentage point rate cut is being pushed back to September.</p>\n<p>Presuming Warsh is confirmed by lawmakers and succeeds <person>Jerome Powell</person> in May as planned, that implies the Fed won't be easing until his third policy meeting as Chair. With core PCE inflation at 3%, this pause seems reasonable. President <person>Donald Trump</person>, looking to November's potentially tricky midterm elections, might not be so understanding. </p>\n<p>* U.S. mortgage &quot;relief&quot; </p>\n<p>Any frustration Trump may feel about sticky interest rates could be offset by more encouraging signals from the housing market - average 30-year mortgage rates are now below 6% for the first time since <chron>September 2022</chron>.</p>\n<p>Psychologically, the break into 5% territory could be significant for would-be homeowners, and if sustained, could help ease the affordability crisis ahead of the midterm elections. That said, borrowing to buy a house is still expensive - some 70% of all existing mortgages are at rates below 5%. </p>\n<p>What could move markets tomorrow?</p>    * Japan Tokyo CPI inflation (February)    * <location value=\"LC/jp\" idsrc=\"xmltag.org\" >Japan</location> industrial production (January, prelim)    * India GDP (Q3)    * <location value=\"LC/de\" idsrc=\"xmltag.org\" >Germany</location> unemployment (February)    * Germany CPI inflation (February)    * <org>Bank of England</org> chief economist <person>Huw Pill</person> speaks    * Canada GDP (Q4)    * U.S. producer price inflation (January)    * U.S. Chicago PMI (February)<p>Want to receive Trading Day in your inbox every weekday morning? Sign up for my newsletter here. </p>\n<p>Opinions expressed are those of the author. They do not reflect the views of <org>Reuters News</org>, which, under the Trust Principles, is committed to integrity, independence, and freedom from bias.</p>\n<p></p>\n<p> (Reporting by <person>Jamie McGeever</person>; Editing by <person>Nia Williams</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/top-news/202602261702RTRSNEWSCOMBINED_KBN3PG2PG-OUSBS_1",
            "pub_date": "2026-02-27 06:10:44",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "SolSource Solutions and TriBeam Financial Launch Propel: A Simplified TPO Solution for Residential Solar and Battery Financing",
            "description": "\n<p>    <location value=\"LU/us.fl.miami\" idsrc=\"xmltag.org\" >MIAMI</location>--(BUSINESS WIRE)--\nSolSource Solutions (“<b>SolSource</b>”), a residential solar and storage finance company and TriBeam Financial (“<b>TriBeam</b>”), a technology-driven platform connecting large sales channels to low-cost capital providers, today announced the launch of <b>Propel</b>, a simplified third-party ownership (<b>TPO</b>) product designed to make financing residential solar and battery systems more predictable, transparent, and accessible.\n\n</p><p>\n<b>A New Approach to Residential Solar &amp; Storage Financing</b>\n\n</p><p>\nPropel combines SolSource’s TPO platform with TriBeam’s low-cost loan-origination capabilities in a single point-of-sale solution. Homeowners enter into long-term energy agreements (PPAs or leases) with SolSource that require prepayment of amounts due under the energy agreement. Homeowners may prepay with cash or with loans originated by independent capital providers through TriBeam’s platform.\n\n</p><p>\nLoan payments remain fixed, and under SolSource’s contract terms, homeowners have the option to obtain ownership of their solar and storage systems beginning after year five. Propel reduces friction and complexity, eliminates hidden fees, passes along the value of tax credits to the homeowner, and avoids price escalators that often increase the total cost to homeowners in traditional TPO models.\n\n</p><p>\n<b>Strategic Partnerships</b>\n\n</p><p>\nSolSource is launching Propel with the help of several national partners:\n\n</p><p>\nEnphase Energy, a global energy technology company, is a strategic partner in the launch of Propel. Enphase will serve as the exclusive provider of inverter and battery hardware meeting domestic content requirements, as well as a provider of services including Enphase Care operation and maintenance services, the Solargraf design and proposal tool, and safe-harboring support. Enphase was the first company to successfully commercialize microinverters and has shipped more than 86.4 million microinverters, with more than 5.1 million Enphase-based systems deployed across over 160 countries.\n\n</p><p>\nGreentech Renewables, a division of CED and a leading solar distributor with more than 100 locations across major U.S. solar markets, will provide national distribution, logistics, and installer support. Greentech Renewables offers logistics and warehouse expertise and assists installers in the selection and coordination of their bill of materials.\n\n</p><p>\nTriBeam technology powers Propel through Concert Finance, a financing program that enables solar and home-energy point-of-sale financing for homeowners through TriBeam’s established dealer network. Concert further streamlines the dealer's experience and supports disciplined underwriting and compliance.\n\n</p><p>\nTogether with these partners, Propel is positioned to scale rapidly while maintaining a compliance-focused operating framework.\n\n</p><p>\n<b>SolSource Leadership Appointment</b>\n\n</p><p>\nSolSource has appointed <person>Chris Couture</person> as Chief Executive Officer to lead the company's national expansion. Couture brings deep expertise in residential solar and storage finance, having most recently served as Vice President and Head of Customer Financing at Enphase Energy, and previously as Vice President at <org>SunPower Corporation</org>, where he oversaw customer financing and asset management.\n\n</p><p>\n<b>Executive Comments</b>\n\n</p><p>\n<b><person>Neil Auerbach</person></b>, Founder, Executive Chairman of SolSource Solutions and CEO of <org>Hudson Sustainable Group</org>, commented:\n\n</p><p>\n“The residential solar and battery storage market needs a simpler, lower-cost approach — without gimmicks such as hidden fees and escalators — to make the TPO model attractive to homeowners. Propel was built for that shift. By combining Hudson Sustainable Group’s multi-decade background in solar finance with TriBeam’s efficient capital platform, and with the support of industry leaders Enphase and Greentech Renewables, we’re able to deliver a straightforward, homeowner-centric solution that reduces friction and preserves long-term value. As an industry pioneer who supported the launch of numerous solar industry giants, I’m hopeful that Propel will set a new standard of excellence in TPO financing over the coming decade.”\n\n</p><p>\n<b><person>Chris Couture</person></b>, CEO of SolSource Solutions, said:\n\n</p><p>\n\"Propel is a product I believe the industry has genuinely needed for years — one that simplifies the TPO experience, eliminates hidden costs, and puts the homeowner first. The combination of SolSource and TriBeam’s financing platform, Enphase's hardware and services, and Greentech's distribution reach gives us everything we need to scale quickly and responsibly. I'm energized to lead this company and this team as we work to set a new standard for how residential solar and storage gets financed in this country.\"\n\n</p><p>\n<b><person>Alexi Evriviades</person></b>, CEO of TriBeam Financial, added:\n\n</p><p>\n“TriBeam was built to eliminate inefficiencies in point-of-sale finance. Propel brings together strong partners to deliver a streamlined financing solution that aligns the interests of homeowners, installers, and capital providers. Our platform connects large sales channels to low-cost capital while reducing overhead, allowing competitive pricing for consumers. We’re delighted to partner with SolSource, Enphase, and Greentech Renewables to bring this innovative product to market.”\n\n</p><p>\n<b>About SolSource Solutions</b>\n\n</p><p>\nSolSource is a residential solar and storage finance company dedicated to providing low-cost, transparent TPO financing solutions. Launched nationwide in early 2026, SolSource partners with leading technology providers and distributors to deliver a simplified TPO offering built on strong compliance and customer-service foundations.\n\n</p><p>\n<b>About TriBeam Financial</b>\n\n</p><p>\nTriBeam Financial operates a technology-driven point-of-sale lending platform connecting large sales channels to low-cost capital providers in the indirect consumer-lending space. While the platform accommodates multiple verticals, TriBeam’s current focus is residential solar and home-energy improvement lending.\n\n</p><p>\n<b>About <org>Hudson Sustainable Group</org></b>\n\n</p><p>\n<org>Hudson Sustainable Group</org> is a global renewable energy firm headquartered in <org>Miami, USA</org>, with offices in <location value=\"LU/jp..tokyo\" idsrc=\"xmltag.org\" >Tokyo, Japan</location>. Founded in 2007, Hudson specializes in the acquisition, development, and management of sustainable energy assets and has mobilized more than <money>$13 billion</money> in capital across over 25 investments globally.\n\n</p><p><img alt=\"\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20260226504883r1&amp;sid=acqr8&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\" /><span class=\"bwct31415\" /></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\">https://www.businesswire.com/news/home/20260226504883/en/</span></p>\n<p>Source: <org>Hudson Sustainable Group</org></p>\n",
            "link": "https://www.fidelity.com/news/article/technology/202602261630BIZWIRE_USPR_____20260226_BW504883",
            "pub_date": "2026-02-27 05:30:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Mexico's Becle posts 13% drop in Q4 profit",
            "description": "\n<p><location value=\"LU/mx.sm.mexcty\" idsrc=\"xmltag.org\" >MEXICO CITY</location>, <chron>Feb 26</chron> - <location value=\"LC/mx\" idsrc=\"xmltag.org\" >Mexico's</location> Becle, the\nworld's largest tequila maker, on Thursday posted a 12.8% drop\nin its fourth-quarter net profit compared to a year earlier,\nlanding roughly in line with analysts' forecasts.\nProfits for the last three months of 2025 landed at <money>1.35 billion\nMexican pesos</money> (<money>$75.0 million</money>), from revenues that fell 14.1%\nyear-on-year to <money>11.08 billion pesos</money>.</p>\n<p>Analysts had predicted a net profit of <money>1.60 billion pesos</money>\nfrom revenues of <money>12.25 billion pesos</money>.</p>\n<p></p>\n<p>(<money>$1</money> = <money>18.0080 Mexican pesos</money> at end-December)\n(Reporting by Iñigo Alexander; Editing by <person>Brendan O'Boyle</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602261655RTRSNEWSCOMBINED_S0N3YD05D_1",
            "pub_date": "2026-02-27 05:55:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Cheniere Corpus Christi, Texas LNG terminal gets boosted export approval from US",
            "description": "<p><location value=\"LU/us.tx.corsti\" idsrc=\"xmltag.org\" >CORPUS CHRISTI, Texas</location>, <chron>Feb 26</chron> (Reuters) - <org>The U.S.\nDepartment of Energy</org> said on Thursday it has approved a 12%\nincrease in exports from Cheniere's <location value=\"LU/us.tx.corsti\" idsrc=\"xmltag.org\" >Corpus Christi,\nTexas</location> liquefied natural gas terminal.</p>\n<p>The approval allows additional exports of up to 0.47 billion\ncubic feet per day of LNG to big markets in <location value=\"LR/asp\" idsrc=\"xmltag.org\" >Asia</location> and <location value=\"LR/eur\" idsrc=\"xmltag.org\" >Europe</location>, or\nnon-Free Trade Agreement countries, as the department calls\nthem. The expansion was approved for trains 8 and 9 of the\n<location value=\"LU/us.tx.corsti\" idsrc=\"xmltag.org\" >Corpus Christi</location> stage three project.</p>\n<p>&quot;This order helps further strengthen America's LNG export\ncapacity, delivering peace abroad and prosperity for Americans\nat home,&quot; said Energy Secretary <person>Chris Wright</person>, who was visiting\nthe project.</p>\n<p>Corpus Christi LNG has been operating as an export terminal\nsince 2018, and Cheniere announced a final investment decision\non trains 8 and 9  mid last year.\nCheniere said this week it has invested <money>$50 billion</money> in growing\nits two export facilities over the past decade and aims to\ndouble output to 100 million tons per annum by the mid-2030s.</p>\n<p>(Reporting by <person>Sheila Dang</person>; Writing by <person>Timothy Gardner</person>; Editing\nby <person>Will Dunham</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602261700RTRSNEWSCOMBINED_L1N3ZM1E8_1",
            "pub_date": "2026-02-27 06:00:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "ContextLogic Completes $907.5 Million Acquisition of US Salt, Marking Transformation into Business Ownership Platform",
            "description": "\n<p align=\"justify\"><location value=\"LU/us.ca.oaklnd\" idsrc=\"xmltag.org\" >OAKLAND, Calif.</location>, <chron>Feb.  26, 2026</chron>  (GLOBE NEWSWIRE) -- <org value=\"LOGC.NaE\" idsrc=\"xmltag.org\" >ContextLogic Holdings Inc.</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='LOGC' fmr-param-security-type='Equity'>( LOGC )</span> (“ContextLogic,” the “Company,” “we” or “our”) today announced the successful completion of its acquisition of <org>US Salt Parent Holdings, LLC</org> and its subsidiaries (collectively, “US Salt”) from private equity funds managed by <org>Emerald Lake Capital Management</org> (“Emerald Lake”) in a transaction that valued US Salt at an enterprise value of approximately <money>$907.5 million</money> (the “Transaction”).</p>    <p align=\"justify\">The closing of this Transaction marks a transformational milestone for <org value=\"LOGC.NaE\" idsrc=\"xmltag.org\" >ContextLogic</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='LOGC' fmr-param-security-type='Equity'>( LOGC )</span>, completing its evolution from an e-commerce company into a distinctive business ownership platform focused on owning niche, competitively advantaged, long-duration businesses run by world-class management teams. The closing of this Transaction will combine ContextLogic’s approximately <money>$2.9 billion</money> in net operating loss carryforwards and US Salt’s cash-generating business.</p>    <p align=\"justify\">“Today marks the culmination of nearly a year of strategic planning and execution. We believe <org value=\"LOGC.NaE\" idsrc=\"xmltag.org\" >ContextLogic</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='LOGC' fmr-param-security-type='Equity'>( LOGC )</span> is uniquely positioned to provide a long-term home for exceptional businesses and management teams—combining permanent capital, operational autonomy, and true alignment between owners and operators,” said <person>Raja Bobbili</person>, Managing Director at <org>Abrams Capital</org> and Chairman of the ContextLogic Board of Directors. “We look forward to partnering with <org>BC Partners</org> to pursue additional strategic opportunities for ContextLogic.”</p>    <p align=\"justify\">“We are excited to welcome US Salt into the <org value=\"LOGC.NaE\" idsrc=\"xmltag.org\" >ContextLogic</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='LOGC' fmr-param-security-type='Equity'>( LOGC )</span> family,” said <person>Ted Goldthorpe</person>, Chairman of the Investment Committee and a Member of the Board of Directors of <org value=\"LOGC.NaE\" idsrc=\"xmltag.org\" >ContextLogic</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='LOGC' fmr-param-security-type='Equity'>( LOGC )</span>. “With a 132-year track record, a proven and resilient business model, and a highly capable management team led by <person>David Sugarman</person>, US Salt is exactly the kind of business we want to own. This acquisition represents the first pearl in what we expect will be a carefully constructed string of pearls—each business selected for its durability, competitive positioning, and long-term value creation potential.”</p>    <p align=\"justify\"><strong>Transaction Structure and Financing</strong></p>    <p align=\"justify\">The Transaction was financed through a combination of (1) approximately <money>$292 million</money> of cash consideration from the Company, including an aggregate of <money>$150 million</money> from a fund advised by BC Partners Credit, (2) committed debt financing comprising a <money>$215 million</money> term loan and a <money>$25 million</money> revolving credit facility led by <person>Blackstone Credit</person> &amp; Insurance, and (3) <money>$115 million</money> in proceeds from ContextLogic’s registered Rights Offering to stockholders at <money>$8.00</money> per share (the “Rights Offering”), which was completed on <chron>February 20, 2026</chron> and fully backstopped by <org>Abrams Capital</org> and BC Partners Credit. As part of the Transaction, certain existing holders of <org>US Salt Parent Holdings, LLC</org>, including investment funds advised by <org>Abrams Capital</org>, rolled over equity stakes in US Salt with a total value of approximately <money>$325 million</money>.</p>    <p align=\"justify\"><strong>Ownership Structure</strong></p>    <p align=\"justify\">Following the closing, existing <org value=\"LOGC.NaE\" idsrc=\"xmltag.org\" >ContextLogic</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='LOGC' fmr-param-security-type='Equity'>( LOGC )</span> shareholders hold approximately 60% of the equity in <org value=\"LOGC.NaE\" idsrc=\"xmltag.org\" >ContextLogic</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='LOGC' fmr-param-security-type='Equity'>( LOGC )</span>. On an aggregate equity capital basis between <org value=\"LOGC.NaE\" idsrc=\"xmltag.org\" >ContextLogic</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='LOGC' fmr-param-security-type='Equity'>( LOGC )</span> and its subsidiary <org>ContextLogic Holdings, LLC</org>, ContextLogic’s existing shareholders, investment funds advised by <org>Abrams Capital</org>, a fund advised by BC Partners Credit, and other rolling shareholders and management own approximately 26.32%, 40.72%, 29.09%, and 3.87% respectively.</p>    <p align=\"justify\"><strong>Board of Directors and Management Structure</strong></p>    <p align=\"justify\">In connection with the closing of the Transaction, <person>David Abrams</person> and <person>Raja Bobbili</person> of <org>Abrams Capital</org> have joined the Board of <org value=\"LOGC.NaE\" idsrc=\"xmltag.org\" >ContextLogic</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='LOGC' fmr-param-security-type='Equity'>( LOGC )</span> (the “Board”). Mr. Bobbili serves as Chairman of the Board. <person>Ted Goldthorpe</person> remains on the Board and serves as Chairman of the Board’s newly-formed Investment Committee, which has primary responsibility over capital allocation decisions and also includes Messrs. Bobbili, Abrams and Ward as members. A new <org>US Salt Business Oversight Committee</org>, consisting of Messrs. Bobbili (Chair) and Ward, has been established to provide direct oversight over US Salt’s operations.</p>    <p align=\"justify\"><person>David Sugarman</person> continues to serve as Chief Executive Officer of US Salt and has entered into a multi-year incentive agreement that is intended to reward long-term value creation for shareholders. <person>Mark Ward</person> serves as President of <org value=\"LOGC.NaE\" idsrc=\"xmltag.org\" >ContextLogic</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='LOGC' fmr-param-security-type='Equity'>( LOGC )</span>. <org>No Abrams Capital</org> or BC Partners Credit representative receives compensation from the Company as a director or officer. Neither <org>Abrams Capital</org> nor <org>BC Partners</org> charges fees or promote to <org value=\"LOGC.NaE\" idsrc=\"xmltag.org\" >ContextLogic</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='LOGC' fmr-param-security-type='Equity'>( LOGC )</span>.</p>    <p align=\"justify\"><strong>Advisors</strong></p>    <p align=\"justify\">Rothschild &amp; Co acted as exclusive financial advisor to the Company. <org>McDermott, Will &amp; Schulte LLP</org> acted as legal advisor to the Company. <org>Abrams Capital</org> was advised by <org>Ropes &amp; Gray LLP</org>. <org>BC Partners</org> was advised by <org>Proskauer Rose LLP</org>. <org>US Salt and Emerald Lake Capital Management</org> were advised by <org>Kirkland &amp; Ellis LLP</org>. </p>    <p align=\"justify\"><strong>About <org value=\"LOGC.NaE\" idsrc=\"xmltag.org\" >ContextLogic</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='LOGC' fmr-param-security-type='Equity'>( LOGC )</span></strong> <strong>Holdings Inc.</strong></p>    <p align=\"justify\"><org value=\"LOGC.NaE\" idsrc=\"xmltag.org\" >ContextLogic</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='LOGC' fmr-param-security-type='Equity'>( LOGC )</span> is a publicly-traded business ownership platform established to own a collection of niche, competitively advantaged, long-duration businesses. Each business operates with meaningful autonomy under world-class management teams whose incentives are tightly aligned with those of the Company’s shareholders, supported by a governance structure that creates direct accountability between operators and owners. For more information about <org value=\"LOGC.NaE\" idsrc=\"xmltag.org\" >ContextLogic</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='LOGC' fmr-param-security-type='Equity'>( LOGC )</span>, please visit www.contextlogic.com.</p>    <p align=\"justify\"><strong>About <org>Abrams Capital</org></strong> </p>    <p align=\"justify\"><org>Abrams Capital</org> is a <location value=\"LU/us.ma.boston\" idsrc=\"xmltag.org\" >Boston</location>-based investment firm founded in 1999 by <person>David Abrams</person>. The firm’s investment strategy is opportunistic and made with a long-term time horizon. <org>Abrams Capital</org> and its affiliates have invested across a wide spectrum of asset types, investment strategies, market sectors, market cycles and industries. For further information, visit www.abramscapital.com/about.</p>    <p align=\"justify\"><strong>About <org>BC Partners</org> and BC Partners Credit</strong> </p>    <p align=\"justify\"><org>BC Partners</org> is a leading international investment firm in private equity, private debt, and real estate strategies. BC Partners Credit was launched in February 2017, with a focus on identifying attractive credit opportunities in any market environment, often in complex market segments. The platform leverages the broader firm’s deep industry and operating resources to provide flexible financing solutions to middle-market companies across Business Services, Industrials, Healthcare and other select sectors. For further information, visit www.bcpartners.com/credit-strategy<strong>.</strong></p>    <p align=\"justify\"><strong>About <org>Emerald Lake Capital Management</org></strong> </p>    <p align=\"justify\">Emerald Lake is a middle market private equity firm investing in capital-efficient businesses with sustainable competitive advantages and strong growth prospects in the industrials and services sectors. Emerald Lake seeks to accelerate company growth and unlock potential through supportive, trusting partnerships with management teams and a proven-value creation strategy. Founded in 2018, the firm manages more than <money>$2 billion</money> of equity capital and has made ten platform investments to date. For more information, visit www.elcm.com.</p>    <p align=\"justify\"><strong>Forward Looking Statements</strong> </p>    <p align=\"justify\">This communication contains forward-looking statements within the meaning of the Safe Harbor provisions of the Private Securities Litigation Reform Act of 1995. All statements other than statements of historical fact could be deemed forward-looking, including, but not limited to, statements regarding ContextLogic’s financial outlook, information concerning the acquisition of US Salt, including the transaction structure and financing, ownership structure, and internal leadership structure, the strategic alternatives considered by ContextLogic’s board of directors, including the decisions taken thereto and alternatives for the use of its cash or cash equivalents, possible or assumed future results of operations and expenses, management strategies and plans, competitive position, business environment, potential growth strategies and opportunities and ContextLogic’s continued listing on the OTC Markets. In some cases, forward-looking statements can be identified by terms such as “anticipates,” “believes,” “could,” “estimates,” “expects,” “foresees,” “forecasts,” “guidance,” “intends” “goals,” “may,” “might,” “outlook,” “plans,” “potential,” “predicts,” “projects,” “seeks,” “should,” “targets,” “will,” “would” or similar expressions and the negatives of those terms. These forward-looking statements are subject to risks, uncertainties, and assumptions. If the risks materialize or assumptions prove incorrect, actual results could differ materially from the results implied by these forward-looking statements. Important factors, risks and uncertainties that could cause actual results to differ materially from those forward-looking statements include, but are not limited to, statements regarding the Transaction,   the Purchase Agreement,  the strategic alternatives considered by the Company’s board of directors, including the decisions taken thereto; future financial performance; future liquidity and operating expenditures; financial condition and results of operations; enforceability of transfer restrictions and occurrence of an ownership change with the result that ContextLogic’s ability to use its net operating losses could be severely limited; future legislation resulting in <org value=\"LOGC.NaE\" idsrc=\"xmltag.org\" >ContextLogic</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='LOGC' fmr-param-security-type='Equity'>( LOGC )</span> being unable to realize the benefits of the tax attributes; ContextLogic’s ability to make use of the existing benefits of the tax attributes because <org value=\"LOGC.NaE\" idsrc=\"xmltag.org\" >ContextLogic</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='LOGC' fmr-param-security-type='Equity'>( LOGC )</span> may not generate taxable income; the IRS’s possible challenge of the amount of the tax attributes or claim that <org value=\"LOGC.NaE\" idsrc=\"xmltag.org\" >ContextLogic</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='LOGC' fmr-param-security-type='Equity'>( LOGC )</span> experienced an ownership change, which could reduce the amount of tax attributes that <org value=\"LOGC.NaE\" idsrc=\"xmltag.org\" >ContextLogic</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='LOGC' fmr-param-security-type='Equity'>( LOGC )</span> could use; competitive changes in the marketplace and other characterizations of future events or circumstances. New risks emerge from time to time. It is not possible for our management to predict all risks, nor can we assess the impact of all factors on our business or the extent to which any factor, or combination of factors, may cause actual results to differ materially from those contained in any forward-looking statements we may make. Further information on these and additional risks that could affect ContextLogic’s results is included in its filings with the <org>SEC</org>, including the Annual Report on Form 10-K for the year ended <chron>December 31, 2024</chron>, as amended by Amendment No. 1 to the Annual Report on Form 10K/A, the Quarterly Reports on Form 10-Q for the periods ended <chron>March 31, 2025</chron>, <chron>June 30, 2025</chron> and <chron>September 30, 2025</chron> and other reports that <org value=\"LOGC.NaE\" idsrc=\"xmltag.org\" >ContextLogic</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='LOGC' fmr-param-security-type='Equity'>( LOGC )</span> files with the <org>SEC</org> from time to time, which could cause actual results to vary from expectations. Any forward-looking statement made by <org value=\"LOGC.NaE\" idsrc=\"xmltag.org\" >ContextLogic</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='LOGC' fmr-param-security-type='Equity'>( LOGC )</span> in this news release speaks only as of the day on which <org value=\"LOGC.NaE\" idsrc=\"xmltag.org\" >ContextLogic</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='LOGC' fmr-param-security-type='Equity'>( LOGC )</span> makes it. <org value=\"LOGC.NaE\" idsrc=\"xmltag.org\" >ContextLogic</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='LOGC' fmr-param-security-type='Equity'>( LOGC )</span> assumes no obligation to, and except as otherwise required by federal securities law, does not currently intend to, update any such forward-looking statements after the date of this release. </p>    <p align=\"justify\"><strong>Investor Relations:</strong> <br/>Lucy Simon, CLHI <br/>ir@contextlogic.com </p>  Image: https://www.globenewswire.com/newsroom/ti?nf=OTY2MjUxNyM3NDU3NTE3IzIyMDQzMzE=  <br/> Image: https://ml.globenewswire.com/media/OGVhY2NjY2MtOGUwNS00N2JiLWE1MGUtYmRmMmFkOTE2OTRiLTEyMTU4ODQtMjAyNi0wMi0yNi1lbg==/tiny/ContextLogic-Holdings-Inc-.png <p> Image: Primary Logo </p>\nSource: <org value=\"LOGC.NaE\" idsrc=\"xmltag.org\" >ContextLogic Holdings Inc</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='LOGC' fmr-param-security-type='Equity'>( LOGC )</span>\n",
            "link": "https://www.fidelity.com/news/article/mergers-and-acquisitions/202602261645PRIMZONEFULLFEED9662517",
            "pub_date": "2026-02-27 05:45:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Ritchie Bros. Sells US$265+ Million in Orlando and Delivers Unmatched Scale at Industryâs Largest Auction",
            "description": "\n<p class=\"bwalignc\">\n14,500+ assets sold as global event signals strong start to 2026 equipment market\n\n</p>\n<p>    <location value=\"LU/us.fl.orlndo\" idsrc=\"xmltag.org\" >ORLANDO, Fla.</location> &amp; <location value=\"LU/us.il.wester\" idsrc=\"xmltag.org\" >WESTCHESTER, Ill.</location>--(BUSINESS WIRE)--\n<org value=\"RBA.NaE\" idsrc=\"xmltag.org\" >RB Global, Inc.</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='RBA' fmr-param-security-type='Equity'>( RBA )</span> , a trusted global marketplace for insights, services and transaction solutions for commercial assets and vehicles, today announced Ritchie Bros. Auctioneers generated more than US$265+ million in gross transaction value (GTV) during its <chron>Feb. 16-20</chron> premier global auction in <location value=\"LU/us.fl.orlndo\" idsrc=\"xmltag.org\" >Orlando, FL</location>, selling more than 14,500 equipment items, trucks and vehicles.\n\n</p><p>\nThe five-day auction drew more than 19,500 participants from 80+ countries across construction, transportation, agriculture and energy sectors. Approximately 86% of assets sold to U.S. buyers, including 39% purchased by Floridians, with the remaining 14% purchased by international buyers as far away as <location value=\"LC/vn\" idsrc=\"xmltag.org\" >Vietnam</location>, <location value=\"LC/sa\" idsrc=\"xmltag.org\" >Saudi Arabia</location> and <location value=\"LC/au\" idsrc=\"xmltag.org\" >Australia</location>.\n\n</p><p>\nWith assets sold through live onsite bidding, online participation and Timed Auction formats, <location value=\"LU/us.fl.orlndo\" idsrc=\"xmltag.org\" >Orlando</location> reflected broad global demand early in the year. Cross-border participation and category depth provided a clear snapshot of pricing and buyer appetite as the 2026 market gains momentum. The auction also showcased the broader capabilities of the Ritchie Bros. marketplace, with financing, shipping and other services available to help customers transact with confidence.\n\n</p><p>\n“Orlando continues to deliver scale and visibility that no other event in our industry can match,” said <person>Jake Lawson</person>, President and Head of Ritchie Bros. North <person>America Sales</person>. “With more than 14,500 assets sold and participation from buyers onsite and online, the auction offers an early indicator of equipment demand and pricing trends.”\n\n</p><p>\nThe event also featured one-day returns of two hallmarks from past <location value=\"LU/us.fl.orlndo\" idsrc=\"xmltag.org\" >Orlando</location> auctions. On day two, major equipment crossed the ramp for live bidding, marking a single-day revival of a format not seen in <location value=\"LU/us.fl.orlndo\" idsrc=\"xmltag.org\" >Orlando</location> since 2019. Then on day four, auctioneers called bids from the sound truck for one day only, bringing a familiar tradition back to the yard. Both moments added energy to the week while reinforcing how <location value=\"LU/us.fl.orlndo\" idsrc=\"xmltag.org\" >Orlando</location> blends long-standing auction heritage with a global digital marketplace. The company also introduced its first invite-only Creator Day, offering digital creators behind-the-scenes access to the auction and extending the event’s reach to new online audiences through social and digital channels.\n\n</p><p>\n“We appreciate the customers who participated onsite and online, along with the creators who helped extend visibility beyond the yard,” Lawson said. “Their engagement reflects the confidence the industry places in our marketplace and in <location value=\"LU/us.fl.orlndo\" idsrc=\"xmltag.org\" >Orlando</location> as a key moment on the equipment calendar.”\n\n</p><p>\nFor more information about upcoming Ritchie Bros. auctions, visit rbauction.com.\n\n</p><p>\n<b>About <org value=\"RBA.NaE\" idsrc=\"xmltag.org\" >RB Global</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='RBA' fmr-param-security-type='Equity'>( RBA )</span></b>\n\n</p><p>\n<org value=\"RBA.NaE\" idsrc=\"xmltag.org\" >RB Global, Inc.</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='RBA' fmr-param-security-type='Equity'>( RBA )</span> is a leading, omnichannel marketplace and trusted provider of value-added insights, services and transaction solutions for buyers and sellers of commercial assets and vehicles worldwide. Through its global network of auction sites and digital platform, <org value=\"RBA.NaE\" idsrc=\"xmltag.org\" >RB Global</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='RBA' fmr-param-security-type='Equity'>( RBA )</span> serves customers worldwide across a variety of asset classes, including automotive, construction, commercial transportation, government surplus, lifting and material handling, energy, mining and agriculture. The company’s end-to-end marketplace solutions include Ritchie Bros., IAA, Rouse Services, SmartEquip and VeriTread. For more information about <org value=\"RBA.NaE\" idsrc=\"xmltag.org\" >RB Global</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='RBA' fmr-param-security-type='Equity'>( RBA )</span>, visit rbglobal.com.\n\n</p><p>\n<b>Forward-Looking Statements</b>\n\n</p><p>\nCertain statements contained in this release include “forward-looking statements” within the meaning of U.S. federal securities laws and “forward-looking information” within the meaning of Canadian securities laws (collectively, \"forward-looking statements\"). Forward-looking statements herein include, in particular, statements relating to the Ritchie Bros. Auctioneers <chron>February 2026</chron> auction event in <location value=\"LU/us.fl.orlndo\" idsrc=\"xmltag.org\" >Orlando</location> (FL), including the effect on future auctions and the industry in general, and other subjects of this release that are not historical facts. Forward-looking statements are typically identified by such words as “aim,” “anticipate,” “believe,” “could,” “continue,” “estimate,” “expect,” “intend,” “may,” “ongoing,” “plan,” “potential,” “predict,” “will,” “should,” “would,” “could,” “likely,” “generally,” “future,” “long-term,” or the negative of these terms, and similar expressions intended to identify forward-looking statements. It is uncertain whether any of the events anticipated by the forward-looking statements will transpire or occur, or if any of them do, what impact they will have on the results of operations and financial condition of <org value=\"RBA.NaE\" idsrc=\"xmltag.org\" >RB Global's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='RBA' fmr-param-security-type='Equity'>( RBA )</span> common shares. Therefore, you should not place undue reliance on any such forward-looking statements and caution must be exercised in relying on forward-looking statements. Forward-looking statements are based on current expectations and assumptions that are subject to risks and uncertainties that may cause actual results to differ materially, including but not limited to risks and uncertainties relating to: our ability to drive shareholder value; potential growth and market opportunities; the level of participation in our auctions and the success of our online marketplaces; our ability to grow our businesses, acquire new customers, enhance our sector reach, drive geographic depth, and scale our operations; the impact of our initiatives, services, investments, and acquisitions on us and our customers; the acquisition or disposition of properties; potential future mergers and acquisitions; our ability to integrate acquisitions; our future capital expenditures and returns on those expenditures; our ability to add new business and information solutions, including, among others, our ability to maximize and integrate technology to enhance our existing services and support additional value-added service offerings; the supply trend of equipment and vehicles in the market and the anticipated price environment, as well as the resulting effect on our business and Gross Transaction Value (“GTV”); our compliance with laws, rules, regulations, and requirements that affect our business; effects of various economic, financial, industry, and market conditions or policies, including inflation, the supply and demand for property, equipment, or natural resources; the behavior of commercial assets and vehicle pricing; the relative percentage of GTV represented by straight commission or underwritten (guarantee and inventory) contracts, and its impact on revenues and profitability; our future capital expenditures and returns on those expenditures; the effect of any currency exchange and interest rate fluctuations on our results of operations; the effect of any tariffs on our results of operations; the grant and satisfaction of equity awards pursuant to our compensation plans; any future declaration and payment of dividends, including the tax treatment of any such dividends; financing available to us from our credit facilities or other sources, our ability to refinance borrowings, and the sufficiency of our working capital to meet our financial needs; our ability to satisfy our present operating requirements and fund future growth through existing working capital, credit facilities and debt; misappropriation of data or cybersecurity incidents; and, failure to comply with privacy and data protection laws. Other risks that could cause actual results to differ materially from those described in the forward-looking statements are included in “Part I, Item 1A: Risk Factors”, and the section titled \"Summary of Risk Factors\", in our Annual Report on Form 10-K for the year ended <chron>December 31, 2025</chron>, as such risk factors may be amended, supplemented or superseded from time to time by other reports we file with the <org>Securities and Exchange Commission</org>, including subsequent Quarterly Reports on Form 10-Q The forward-looking statements included in this release are made only as of the date hereof. While the list of factors presented here is considered representative, no such list should be considered to be a complete statement of all potential risks and uncertainties. Many of these risk factors are outside of our control, and as such, they involve risks which are not currently known that could cause actual results to differ materially from those discussed or implied herein. <org value=\"RBA.NaE\" idsrc=\"xmltag.org\" >RB Global</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='RBA' fmr-param-security-type='Equity'>( RBA )</span> does not undertake any obligation to update any forward-looking statements to reflect actual results, new information, future events, changes in its expectations or other circumstances that exist after the date as of which the forward-looking statements were made, except as required by law.\n\n</p><p><img alt=\"\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20260226865545r1&amp;sid=acqr8&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\" /><span class=\"bwct31415\" /></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\">https://www.businesswire.com/news/home/20260226865545/en/</span></p>\n<p>Source: <org value=\"RBA.NaE\" idsrc=\"xmltag.org\" >RB Global</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='RBA' fmr-param-security-type='Equity'>( RBA )</span></p>\n",
            "link": "https://www.fidelity.com/news/article/mergers-and-acquisitions/202602261645BIZWIRE_USPR_____20260226_BW865545",
            "pub_date": "2026-02-27 05:45:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Nasdaq, S&P 500 Drop as Semiconductor Stocks Slide After Nvidia Results",
            "description": "\n<p><chron>04:20 PM EST</chron>, <chron>02/26/2026</chron> (MT Newswires) -- The Nasdaq and S&amp;P 500 fell Thursday as semiconductor stocks sold off following <org value=\"NVDA.NaE\" idsrc=\"xmltag.org\" >Nvidia's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NVDA' fmr-param-security-type='Equity'>( NVDA )</span>  quarterly results late Wednesday.</p><p>* <org value=\"NVDA.NaE\" idsrc=\"xmltag.org\" >Nvidia</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NVDA' fmr-param-security-type='Equity'>( NVDA )</span> shares fell 5.5%, the biggest drop on the Nasdaq, after results failed to counter AI sector tumult. <org value=\"AVGO.NaE\" idsrc=\"xmltag.org\" >Broadcom</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AVGO' fmr-param-security-type='Equity'>( AVGO )</span> , <org value=\"AMAT.NaE\" idsrc=\"xmltag.org\" >Applied Materials</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AMAT' fmr-param-security-type='Equity'>( AMAT )</span> , and <org value=\"ASML.NaE\" idsrc=\"xmltag.org\" >ASML</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='ASML' fmr-param-security-type='Equity'>( ASML )</span>  also declined.</p><p>* US initial jobless claims last week rose to 212,000 from an upwardly revised 208,000 in the previous week, compared with expectations for 216,000 in an analyst survey compiled by <org>Bloomberg</org>.</p><p>* April West Texas Intermediate crude oil rose <money>$0.01</money> to settle at <money>$65.42</money> per barrel, while <person>April Brent</person> crude, the global benchmark, was last seen up <money>$0.02</money> at <money>$70.87</money>.</p><p>* <org value=\"PSKY.NaE\" idsrc=\"xmltag.org\" >Paramount Skydance</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='PSKY' fmr-param-security-type='Equity'>( PSKY )</span>  shares jumped 10%, the top gainer on the S&amp;P, a day after the company reported stronger-than-expected Q4 revenue growth.</p><p>* Global smartphone shipments are expected to decline almost 13% in 2026 due to a shortage of memory chips, research firm IDC said.</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/us-markets/202602261620MIDNIGHTUSEQUITY_A3574084",
            "pub_date": "2026-02-27 05:20:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Nvidia expects gaming chips shortage to last until year-end",
            "description": "\n<p><chron>Feb 26</chron> (Reuters) - A global shortage of gaming chips could last until the end of this year, an <org value=\"NVDA.NaE\" idsrc=\"xmltag.org\" >Nvidia</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NVDA' fmr-param-security-type='Equity'>( NVDA )</span> executive has said, signaling more pain for the video game industry that is already buckling under weak sales due to slowing consumer demand.</p>\n<p><org value=\"NVDA.NaE\" idsrc=\"xmltag.org\" >Nvidia</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NVDA' fmr-param-security-type='Equity'>( NVDA )</span> expects the supply constraints to hurt its gaming business in the current quarter and beyond even as the chip giant sees strong demand, <org value=\"NVDA.NaE\" idsrc=\"xmltag.org\" >Nvidia</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NVDA' fmr-param-security-type='Equity'>( NVDA )</span> finance chief <person>Colette Kress</person> said on the company's quarterly earnings call on Wednesday.</p>\n<p>&quot;As much as we would love to have more supply, we do believe for a couple quarters it is going to be very tight,&quot; Kress said. </p>\n<p>&quot;If things improve by the end of the year, there is an opportunity to think about what that is from a year-over-year growth. But it's still too early for us to know at this time.&quot;</p>\n<p>With the tech industry racing to build out artificial intelligence capacity, demand for memory chips has outstripped supply, causing a spike in prices and prompting manufacturers to prioritize components for higher-margin data center chips.</p>\n<p>That has constrained supply for consumer electronics such as smartphones and personal computers, as well as gaming consoles. <org value=\"NVDA.NaE\" idsrc=\"xmltag.org\" >Nvidia</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NVDA' fmr-param-security-type='Equity'>( NVDA )</span> chips are widely used in PC gaming as well as in the Nintendo Switch console, while <org value=\"SONY.NaE\" idsrc=\"xmltag.org\" >Sony's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='SONY' fmr-param-security-type='Equity'>( SONY )</span> PlayStation and Microsoft's Xbox consoles use AMD hardware.</p>\n<p>Forecasts for the console market have been bleak. According to projections from tech industry research firm TrendForce in December, the console market is expected to see a 4.4% decline this year, compared with its earlier forecast of a 3.5% drop.</p>\n<p></p>\n<p> (Reporting by <person>Deborah Sophia</person> in Bengaluru; Editing by <person>Maju Samuel</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/top-news/202602261440RTRSNEWSCOMBINED_KBN3PG2G8-OUSBS_1",
            "pub_date": "2026-02-27 05:45:41",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Warner Bros says Paramount bid superior, countdown begins for Netflix response",
            "description": "\n<p><chron>Feb 26</chron> (Reuters) - <org value=\"WBD.NaE\" idsrc=\"xmltag.org\" >Warner Bros Discovery</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='WBD' fmr-param-security-type='Equity'>( WBD )</span> said <org>Paramount's</org> revised <money>$31</money>-a-share offer was superior to its existing deal with <org value=\"NFLX.NaE\" idsrc=\"xmltag.org\" >Netflix</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NFLX' fmr-param-security-type='Equity'>( NFLX )</span>, giving the streaming giant four business days to respond or walk away from the bidding war for the coveted <location value=\"LU/us.ca.hollyw\" idsrc=\"xmltag.org\" >Hollywood</location> studio. </p>\n<p>The high-stakes battle could be in its final stretch after the announcement on Thursday. <org value=\"NFLX.NaE\" idsrc=\"xmltag.org\" >Netflix</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NFLX' fmr-param-security-type='Equity'>( NFLX )</span> had earlier this month granted <org>Warner Bros</org> a seven-day waiver to seek a &quot;best and final offer&quot; from <org>Paramount</org> for the company.</p>\n<p>As per the terms of the <org value=\"NFLX.NaE\" idsrc=\"xmltag.org\" >Netflix</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NFLX' fmr-param-security-type='Equity'>( NFLX )</span> merger agreement, the latest announcement initiates a four-business-day period during which <org value=\"NFLX.NaE\" idsrc=\"xmltag.org\" >Netflix</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NFLX' fmr-param-security-type='Equity'>( NFLX )</span> may propose revisions to the agreement, <org>Warner Bros</org> said.</p>\n<p>After this period, if the board determines that the <org value=\"PSKY.NaE\" idsrc=\"xmltag.org\" >Paramount Skydance</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='PSKY' fmr-param-security-type='Equity'>( PSKY )</span> proposal remains superior, <org>Warner Bros</org> may terminate the <org value=\"NFLX.NaE\" idsrc=\"xmltag.org\" >Netflix</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NFLX' fmr-param-security-type='Equity'>( NFLX )</span> merger agreement, it said.</p>\n<p>Shares of <org value=\"PSKY.NaE\" idsrc=\"xmltag.org\" >Paramount Skydance</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='PSKY' fmr-param-security-type='Equity'>( PSKY )</span> were up about 1.5% in extended trading, while <org>Warner Bros</org> shares were up nearly 1%</p>\n<p><org value=\"NFLX.NaE\" idsrc=\"xmltag.org\" >Netflix</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NFLX' fmr-param-security-type='Equity'>( NFLX )</span>, which is looking to buy <org>Warner Bros'</org> streaming and studio businesses, agreed in December to pay <money>$27.75</money> a share, saying the offer, along with a planned spinoff of <org>Warner Bros'</org> cable assets, would deliver a greater shareholder value.</p>\n<p>The bid partly depends on the debt level of those assets, which would be separately listed as Discovery Global, as well as the company's equity value once it starts trading. </p>\n<p>Estimates of Discovery Global's value vary greatly. <org>Warner Bros</org> said it could fetch between <money>$1.33</money> and <money>$6.86</money> a share, but <org>Paramount</org> said it is almost worthless.</p>\n<p>MoffettNathanson analysts had said a <org>Paramount</org> bid of <money>$34</money> a share would have ended the debate about Discovery Global's value. </p>\n<p>In its revised bid, <org>Paramount</org> raised the termination fee it would pay should the deal fail to gain regulatory approval to <money>$7 billion</money> from <money>$5.8 billion</money>. </p>\n<p>The <org value=\"NFLX.NaE\" idsrc=\"xmltag.org\" >Netflix</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NFLX' fmr-param-security-type='Equity'>( NFLX )</span> merger agreement remains in effect, and the Warner board continues to recommend the <org value=\"NFLX.NaE\" idsrc=\"xmltag.org\" >Netflix</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NFLX' fmr-param-security-type='Equity'>( NFLX )</span> transaction, without having withdrawn or modified its recommendation, the <org>Warner Bros</org> said.</p>\n<p><org value=\"NFLX.NaE\" idsrc=\"xmltag.org\" >NETFLIX'S</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NFLX' fmr-param-security-type='Equity'>( NFLX )</span> FINANCIAL MUSCLE </p>\n<p>With about <money>$9.03 billion</money> in cash and cash equivalents at the end of December, the creator of &quot;Stranger Things&quot; has ample financial muscle to raise its offer.</p>\n<p>Either deal will reshape the power structure of <location value=\"LU/us.ca.hollyw\" idsrc=\"xmltag.org\" >Hollywood</location> by handing the suitor one of the industry's most-coveted studios and an extensive content library, as well as lucrative entertainment franchises such as &quot;Game of Thrones&quot; and DC Comics.</p>\n<p><org>Paramount</org> has argued it has a clearer path to U.S. regulatory approval than <org value=\"NFLX.NaE\" idsrc=\"xmltag.org\" >Netflix</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NFLX' fmr-param-security-type='Equity'>( NFLX )</span> and had indicated that if <org>Warner Bros</org> rejects the new bid, it would be ready to launch a board challenge at this year's annual meeting.</p>\n<p>One of <org>Paramount's</org> director candidates could be a big shareholder in <org>Warner Bros</org>, hedge fund <org>Pentwater Capital Management</org> CEO <person>Matthew Halbower</person> said.</p>\n<p>Activist investor <org>Ancora Holdings</org>, which owns a small stake in <org>Warner Bros</org>, has also stepped up pressure on the HBO owner by saying the company did not adequately engage with <org>Paramount</org>.</p>\n<p><org>Warner Bros</org> has previously said its board has a track record of acting in the best interests of the company and shareholders.</p>\n<p> (Reporting by Aditya Soni and <person>Akash Sriram</person> in Bengaluru; Editing by Arun Koyyur and Shinjini Ganguli)</p>\n",
            "link": "https://www.fidelity.com/news/article/top-news/202602261622RTRSNEWSCOMBINED_KBN3PG2M3-OUSBS_1",
            "pub_date": "2026-02-27 05:45:40",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        }
    ]
}