{
    "data": [
        {
            "title": "Exclusive-Rare earth shortages worsen in US aerospace, chips despite trade truce, sources say",
            "description": "<p><location value=\"LU/ca.qc.montrl\" idsrc=\"xmltag.org\" >MONTREAL</location>/<location value=\"LU/cn..beijng\" idsrc=\"xmltag.org\" >BEIJING</location>/<location value=\"LU/us.dc.wash\" idsrc=\"xmltag.org\" >WASHINGTON</location>, <chron>Feb 26</chron> (Reuters) - Suppliers to U.S. aerospace and semiconductor firms face worsening rare earth shortages, with two turning away some clients, industry insiders said, weeks before U.S. President Donald Trump is expected to meet his Chinese counterpart Xi Jinping for a summit in <location value=\"LU/cn..beijng\" idsrc=\"xmltag.org\" >Beijing</location>.</p>\n<p>The shortages center on rare earths such as yttrium and scandium, niche members of the family of 17 elements, which play tiny but vital roles in defence technology, aerospace and semiconductors and are almost entirely produced in <location value=\"LC/cn\" idsrc=\"xmltag.org\" >China</location>.</p>\n<p>While <location value=\"LU/cn..beijng\" idsrc=\"xmltag.org\" >Beijing</location> has allowed many rare earth exports to resume since it imposed restrictions in April, shipments of these materials still rarely make it to the U.S. despite the October detente with <location value=\"LU/us.dc.wash\" idsrc=\"xmltag.org\" >Washington</location>, Chinese customs data show.</p>\n<p>That easing of trade tensions, premised in part on <location value=\"LC/cn\" idsrc=\"xmltag.org\" >China</location> pausing its critical mineral export restrictions, will be on the table when Trump and Xi meet in <location value=\"LU/cn..beijng\" idsrc=\"xmltag.org\" >Beijing</location> in March.</p>\n<p>A key pain point is yttrium, used in coatings that keep engines and turbines from melting at high temperatures. Without regular application of these coatings, engines cannot be used.</p>\n<p>Since Reuters first reported about yttrium shortages in November, prices have jumped 60% and are now about 69 times as high as a year ago. Some coatings manufacturers are also now starting to ration material, according to company executives and traders.</p>\n<p>Executives at two North American firms that buy yttrium to make coatings told Reuters they have needed to temporarily pause production due to shortages. One is also now turning away smaller and offshore customers in order to conserve supply for larger clients, which include certain engine makers.</p>\n<p>Another firm in the coating supply chain recently ran out of material and stopped selling products containing yttrium oxide, according to a source with direct knowledge of the matter.</p>\n<p>While shortages of yttrium and scandium have not weighed on production of jet engines or chips yet, a U.S. government official told Reuters some U.S. manufacturers now face &quot;shortages&quot; of certain rare earths from <location value=\"LC/cn\" idsrc=\"xmltag.org\" >China</location>.</p>\n<p><location value=\"LC/cn\" idsrc=\"xmltag.org\" >China</location> exported 17 tons of yttrium products to the U.S. in the eight months after controls were introduced last April versus 333 tons in the eight months before the measures.</p>\n<p>A <org>White House</org> official said the Trump administration is committed to ensuring access to critical minerals for all U.S. businesses. </p>\n<p>&quot;This includes negotiating with <location value=\"LC/cn\" idsrc=\"xmltag.org\" >China</location> and monitoring compliance with President Trump's agreement with President Xi, as well as developing alternative supply chains as warranted.&quot;</p>\n<p>Reuters spoke with two U.S. government officials, 14 company executives and staff, traders and analysts across aerospace and semiconductors. All of them spoke to Reuters on condition of anonymity except the analysts named in the story. The North American executives did not want to be named discussing internal production challenges in public. </p>\n<p><location value=\"LC/cn\" idsrc=\"xmltag.org\" >China's</location> <org>Ministry of Commerce</org> did not respond to questions.</p>\n<p>PRODUCTION PRESSURE </p>\n<p>While low yttrium supplies have not hurt engine production, manufacturers remain concerned, said aerospace supply chain specialist <person>Kevin Michaels</person>.</p>\n<p>&quot;This is a watch item and a tangible example of how <location value=\"LC/cn\" idsrc=\"xmltag.org\" >China</location> is flexing its rare earth muscle,&quot; said Michaels, managing director at U.S. consultant AeroDynamic Advisory. </p>\n<p>Enginemakers are already struggling to meet demand for spare parts from airlines and higher production by planemakers <org value=\"BA.NaE\" idsrc=\"xmltag.org\" >Boeing</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='BA' fmr-param-security-type='Equity'>( BA )</span> and Airbus.</p>\n<p>U.S. aircraft enginemakers <org>GE Aerospace</org>, RTX's Pratt &amp; Whitney and <org value=\"HON.NaE\" idsrc=\"xmltag.org\" >Honeywell</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='HON' fmr-param-security-type='Equity'>( HON )</span> declined comment.</p>\n<p>SCARCE SCANDIUM</p>\n<p>In addition to yttrium, U.S. semiconductor makers are running low on scandium, putting production of next-generation 5G chips at risk, said <person>Dylan Patel</person>, founder and CEO of research firm SemiAnalysis. </p>\n<p>With global production of only several tens of tons a year, scandium plays small but important parts in fuel cells, specialty aluminium aerospace alloys and advanced chip processing and packaging.</p>\n<p>Major U.S. semiconductor manufacturers all rely on scandium for making chip components that &quot;go into essentially every 5G smartphone and base station&quot;, Patel said.</p>\n<p>U.S. chipmakers have experienced delays in receiving new scandium export licenses from <location value=\"LC/cn\" idsrc=\"xmltag.org\" >China</location> in recent months and have reached out to <location value=\"LU/us.dc.wash\" idsrc=\"xmltag.org\" >Washington</location> for help, said two industry sources. </p>\n<p>Many of these firms had obtained scandium from third-country suppliers, another U.S. official said, but <location value=\"LC/cn\" idsrc=\"xmltag.org\" >China</location> requires license applicants to declare their end-users.</p>\n<p>&quot;Our thesis is that it is precisely the semi industry being targeted,&quot; the U.S. official said.</p>\n<p><org>The U.S. Semiconductor Industry Association</org> declined to comment.</p>\n<p>&quot;The U.S. currently has zero domestic scandium production and no operational alternative sources outside <location value=\"LC/cn\" idsrc=\"xmltag.org\" >China</location>,&quot; Patel said, adding that stockpiles are likely in months rather than years.</p>\n<p></p>\n<p> (Reporting by <person>Allison Lampert</person> in <location value=\"LU/ca.qc.montrl\" idsrc=\"xmltag.org\" >Montreal</location>; <person>Laurie Chen</person> and <person>Lewis Jackson</person> in <location value=\"LU/cn..beijng\" idsrc=\"xmltag.org\" >Beijing</location>; <person>Michael Martina</person> in <location value=\"LU/us.dc.wash\" idsrc=\"xmltag.org\" >Washington</location>; Additional reporting by <person>Fanny Potkin</person> in <location value=\"LC/sg\" idsrc=\"xmltag.org\" >Singapore</location>, <person>Ernest Scheyder</person> in <location value=\"LU/us.tx.houstn\" idsrc=\"xmltag.org\" >Houston</location> and <person>Melanie Burton</person> in <location value=\"LU/au..melbou\" idsrc=\"xmltag.org\" >Melbourne</location>; Editing by <person>Sonali Paul</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/top-news/202602252331RTRSNEWSCOMBINED_KBN3PG0AM-OUSBS_1",
            "pub_date": "2026-02-26 23:35:36",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Power of Canada Says TSX Approved Notice of Intention to Make an NCIB",
            "description": "\n<p><chron>08:35 AM EST</chron>, <chron>02/26/2026</chron> (MT Newswires) -- Power of <location value=\"LC/ca\" idsrc=\"xmltag.org\" >Canada</location> (POW.TO) on Thursday said the <org>Toronto Stock Exchange</org> (TSX) accepted its notice of intention to make a normal course issuer bid (NCIB).</p><p>Shares of the company closed up 1% to <money>$67.84</money> on Wednesday on the TSX.</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/international/202602260835MIDNIGHTUSEQUITY_A3573486",
            "pub_date": "2026-02-26 21:35:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Fed's Miran: Four quarter-point cuts still warranted this year, no \"all clear\" for job market",
            "description": "\n<p><location value=\"LU/us.dc.wash\" idsrc=\"xmltag.org\" >WASHINGTON</location>, <chron>Feb 26</chron> (Reuters) - Federal Reserve Governor <person>Stephen Miran</person> said strong job growth in January was &quot;a really good thing,&quot; but that the Fed should still cut a full percentage point from its policy rate this year because there were still risks to the labor market while inflation was no longer a problem.</p>\n<p>&quot;I think it's way too early to sort of sound an all clear that the labor market doesn't need more support from the Federal Reserve. I definitely think the labor market can be supported by the Federal Reserve further,&quot; with four cuts this year, Miran said on Fox Business's &quot;Mornings with Maria&quot;.</p>\n<p>&quot;I really do not think that we have an inflation problem,&quot; with recent inflation readings a percentage point above the Fed's target likely to slow.</p>\n<p></p>\n<p>(Reporting by <person>Howard Schneider</person>; Editing by <person>Chizu Nomiyama</person> )</p>\n",
            "link": "https://www.fidelity.com/news/article/us-economy/202602261004RTRSNEWSCOMBINED_KBN3PG1R3-OUSBS_1",
            "pub_date": "2026-02-26 23:04:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Ithina forms a global AI operating platform for physical commerce and industrial operations through strategic acquisitions, surpassing 50 million connected endpoints",
            "description": "\n<div class=\"xn-content\">\n<p class=\"prntac\"><i>Backed by <org>Kline Hill Partners</org>, <org>Probot Ventures</org>, and Zebra Technologies Corporation, Ithina launches one of the world's largest AI-enabled execution networks for the physical economy</i></p><p><span class=\"legendSpanClass\"><location value=\"LU/us.tx.dallas\" idsrc=\"xmltag.org\" >DALLAS</location></span>, <span class=\"legendSpanClass\"><chron>Feb. 26, 2026</chron></span> /PRNewswire/ -- <org>Ithina Holdings Inc.</org>, creator of Ithina, an AI-driven intelligence and execution platform for physical operations, completed the acquisitions of Displaydata (UK), Agile Display Solutions (U.S.), and Altierre (<location value=\"LR/eur\" idsrc=\"xmltag.org\" >Europe</location>).</p>\n    <div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder1\">\n                <p>\n\n                    <img src=\"https://mma.prnewswire.com/media/2919649/Ithina_Logo.jpg\" title=\"Ithina logo\" alt=\"Ithina logo\" />\n\n                </p>\n    </div>\n<div id=\"divReleaseHighlightce97\" style=\"border-top: 1px solid; border-bottom: 1px solid; border-color: Gray; color: gray; width: 200px; float: left; position: relative; margin: 5px 10px 5px 10px; text-align: justify;\" contenteditable=\"false\">Ithina forms a global AI operating platform for physical commerce and industrial operations with strategic acquisitions.</div><p>Ithina has launched as a global AI operating platform for real-time physical commerce and industrial operations, with more than 50 million connected endpoints already deployed across retail, manufacturing, and warehouse environments worldwide. With the acquisition, Ithina becomes one of the largest digitally addressable execution networks at the intersection of AI, edge connectivity, and IoT infrastructure—a foundation designed to move enterprises from insight to action inside the physical world.</p><p><b>From infrastructure to intelligence<br /></b>The combination unifies decades of leadership in electronic shelf labels (ESL), wireless edge infrastructure, and large-scale deployment operations with a purpose-built AI operating layer designed for continuous sensing, decision-making, and execution.</p><p>Ithina begins with global scale—transforming an established infrastructure footprint into an intelligent, closed-loop system capable of coordinating actions in real time across millions of endpoints.</p><p><b>A closed-loop AI operating system for the physical world<br /></b>The Ithina platform is designed as a closed loop across four integrated layers:</p><ul type=\"disc\"><li>Sense — capturing live operational signals from connected edge devices</li><li>Decide — applying contextual AI models to optimize outcomes in real time</li><li>Execute — activating actions through digital shelf labels, displays, and workflow systems</li><li>Learn — improving continuously through outcome-based feedback loops</li></ul><p>At the center of the system is Ithina Command, a human-in-the-loop control layer that supports transparency, governance, and enterprise oversight as AI-driven actions are deployed at scale.</p><p><b>Leadership perspective</b><br />\"These acquisitions consolidate decades of infrastructure leadership into a single global AI operating platform,\" said <person>Sanjay Purohit</person>, CEO of <org>Ithina Holdings Inc.</org> \"We're turning physical infrastructure into an intelligent network that can sense, decide, and act at enterprise scale—while maintaining the control and governance enterprises require.\"</p><p>\"We believe Ithina represents a rare opportunity to build a category-defining operating layer for the physical economy,\" said <person>James Bradshaw</person>, Managing Director at <org>Kline Hill Partners</org> and board member of Displaydata. \"Our decision to combine these businesses under Ithina and continuing support reflects conviction in the platform vision and the leadership team's ability to scale it globally.\"</p><p>\"Ithina is embedding enterprise-grade AI capabilities directly into everyday operations,\" said Anukriti Shukla, Chairperson of <org>Probot Ventures</org>. \"That unlocks real-time optimization not only for large organizations, but also for smaller operators who historically have not had access to this level of intelligence.\"</p><p><b>What this unlocks for enterprises<br /></b>For large enterprises, Ithina provides a unified operating layer capable of coordinating real-time decisions and execution across millions of endpoints, geographies, and workflows. That same capability—previously achievable only through complex, custom-built systems—is now also accessible to smaller operators such as convenience stores, regional grocers, and franchise-based warehouses by embedding AI directly into the infrastructure they already use.</p><p>Across retail environments, Ithina can help reduce perishable waste, improve planogram compliance, optimize promotions, and support more dynamic pricing and execution workflows. Across manufacturing and warehouse environments, Ithina can help improve throughput, accuracy, and workforce productivity through intelligent task orchestration powered by Ithina-enabled tags, displays, and connected workflows.</p><p><org>Ithina Holdings Inc.</org> completed the acquisitions of Displaydata, Agile Display Solutions, and Altierre, forming a global AI operating platform for physical commerce and industrial operations.</p><p>The <location value=\"LU/us.tx.dallas\" idsrc=\"xmltag.org\" >Dallas</location>-based company said the combined business now supports more than 50 million connected endpoints across retail, manufacturing, and warehouse environments worldwide.</p><p><b>About <org>Ithina Holdings Inc.</org><br /></b><org>Ithina Holdings Inc.</org> is the creator of Ithina, an AI-driven intelligence and execution platform for physical commerce and industrial operations, including retail, manufacturing, and warehouse environments. Ithina connects millions of edge endpoints with real-time AI decision-making to enable continuous optimization, transparency, and enterprise control across physical operations worldwide. To learn more, visit ithina.com.</p><p><b>About <org>Kline Hill Partners</org><br /></b>Founded in 2015, <org>Kline Hill Partners</org> is an investment firm focused on the private equity secondary market, with industry-leading capabilities in the small-deal space. With <money>$6.1 billion</money> in assets under management, Kline Hill's funds are backed by a blue-chip investor base that includes endowments, foundations, family offices, and other institutional investors. Together, Kline Hill's Core and Solutions strategies make up a platform designed to serve the entirety of the small-deal secondary market, with capabilities spanning LP fund transfers, GP-led transactions, and secondary direct transactions. For more information, please visit <u>www.klinehill.com</u></p>\n\n\n\n<p id=\"PURL\"><img title=\"Cision\" width=\"12\" height=\"12\" alt=\"Cision\" src=\"https://edge.prnewswire.com/c/img/favicon.png?sn=CL94986&amp;sd=2026-02-26\" /> View original content to download multimedia:https://www.prnewswire.com/news-releases/ithina-forms-a-global-ai-operating-platform-for-physical-commerce-and-industrial-operations-through-strategic-acquisitions-surpassing-50-million-connected-endpoints-302698542.html</p><p>SOURCE <org>Ithina Holdings, Inc</org></p></div>\n",
            "link": "https://www.fidelity.com/news/article/mergers-and-acquisitions/202602261002PR_NEWS_USPR_____CL94986",
            "pub_date": "2026-02-26 23:02:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Transparency-OneÂ® Emphasizes Importance of Supply Chain Traceability at âTrust in Beefâ Panel",
            "description": "\n<p style=\"padding-left:0pt;\"><location value=\"LU/us.tx.dallas\" idsrc=\"xmltag.org\" >DALLAS</location>, <chron>Feb.  26, 2026</chron>  (GLOBE NEWSWIRE) -- Transparency-One, ISN<sup>®</sup>’s responsible sourcing platform built to help bring transparency to supply chain management, recently collaborated with Nestlé, <org>Maple Valley Farms</org>, and <org>Farm Journal</org> to discuss the future of the United States’ beef industry. The event focused on the importance of responsible sourcing through supply chain traceability, welcoming over 100 attendees from notable brands across the CPG, Food, Beverage, and Retail space.</p>  <p style=\"padding-left:0pt;\">Industry leaders participated in a panel discussion centered on responsible sourcing and regulatory readiness and explored consumers’ increasing demand for transparency amid the beef supply chain’s notoriously complex model. Panelists outlined what it takes to create a transparency story from ranch to retail, underscoring meaningful transparency is achievable by gaining a clear view of suppliers and potential ranchers within the supply chain.</p>  <p style=\"padding-left:0pt;\">“The beef industry has built a strong foundation in stewardship, animal health, and food safety. With the right strategy and partners, it can continue to meet evolving responsible sourcing expectations,” said <person>Brittany Sizemore</person>, Senior Vice President at Transparency-One. “Aligned expectations for transparency and product origin through practical approaches can help provide brands a clear view of suppliers without duplicative reporting or added friction across the value chain.”</p>  <p style=\"padding-left:0pt;\">Beyond industry perspectives, the conversation addressed the need for stronger value chain partnerships, challenging retailers, brands, and partners to align on shared transparency and product origin expectations.</p>  <p style=\"padding-left:0pt;\">For more information on Transparency-One’s best-in-class supply chain mapping software and services, visit transparency-one.com.</p>  <p style=\"padding-left:0pt;\"><strong>About ISN</strong><br/>ISN is the global leader in contractor and supplier information management, with more than 25 years of experience connecting 900 Hiring Clients in capital-intensive industries with 90,000 active contractors and suppliers to promote safety, health, and sustainability in the workplace. ISN’s brands include ISNetworld<sup>®</sup>, a global online contractor and supplier management platform, Transparency-One<sup>®</sup>, a responsible sourcing platform built to bring transparency to supply chain management, and Empower<sup>®</sup>, a worker-level app built to keep workers moving forward.</p>  <p style=\"padding-left:0pt;\">ISN has 12 offices around the globe which provide award-winning support and training for its customers in more than 85 countries. ISN takes pride in leading worldwide efforts to improve the efficiency and effectiveness of contractor and supplier management systems and in serving as a world-class forum for sharing industry best practices, benchmarking performance, providing data insights among its members, and helping decision makers, including board members, ensure contractor and supplier risk is assessed and monitored. For more information, visit isn.com.</p>  <p style=\"padding-left:0pt;\"><strong>Media Contact</strong><br/><person>Alyssa Bruce</person><br/><person>Walker Sands</person> for ISN<br/>isnpr@walkersands.com</p>  Image: https://www.globenewswire.com/newsroom/ti?nf=OTY2MTY5MiM3NDU1OTAyIzUwMDE1NzM3Mg==  <br/> Image: https://ml.globenewswire.com/media/M2U2YTk2MDgtOTU5ZC00OTZiLTkxM2UtZDMyMGU4NTE1YzE0LTUwMDE1NzM3Mi0yMDI2LTAyLTI2LWVu/tiny/ISN.png\nSource: ISN\n",
            "link": "https://www.fidelity.com/news/article/technology/202602261012PRIMZONEFULLFEED9661692",
            "pub_date": "2026-02-26 23:12:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Freshworks Plans $400 Million Share Repurchase Program",
            "description": "\n<p><chron>10:10 AM EST</chron>, <chron>02/26/2026</chron> (MT Newswires) -- <org value=\"FRSH.NaE\" idsrc=\"xmltag.org\" >Freshworks</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='FRSH' fmr-param-security-type='Equity'>( FRSH )</span>  said Thursday its board authorized a stock repurchase program for up to <money>$400 million</money> of its outstanding class A shares.</p><p>The company said it may repurchase shares in the open market from time to time.</p><p>Price: 7.74, Change: +0.46, Percent Change: +6.25</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602261010MIDNIGHTUSEQUITY_A3573712",
            "pub_date": "2026-02-26 23:10:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Rollins Insider Sold Shares Worth $842,971, According to a Recent SEC Filing",
            "description": "\n<p><chron>10:12 AM EST</chron>, <chron>02/26/2026</chron> (MT Newswires) -- Elizabeth B Chandler, Chief Legal Officer, General Counsel, and Corporate Secretary, on <chron>February 25, 2026</chron>, sold 14,201 shares in <location value=\"LU/us.mt.rolins\" idsrc=\"xmltag.org\" >Rollins</location> (ROL) for <money>$842,971</money>. Following the Form 4 filing with the <org>SEC</org>, Chandler has control over a total of 55,977 common shares of the company, with 55,977 shares held directly.</p><p>SEC Filing:</p><p>https://www.sec.gov/Archives/edgar/data/84839/000146317026000006/xslF345X05/wk-form4_1772118353.xml</p><p>Price: 59.77, Change: +0.63, Percent Change: +1.07</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602261012MIDNIGHTUSEQUITY_A3573716",
            "pub_date": "2026-02-26 23:12:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Coco Robotics Launches Next-Gen Autonomous Robots for Urban Deliveries",
            "description": "\n<div class=\"xn-content\">\n<p class=\"prntac\">Trained on millions of city miles, Coco 2 robots expand urban logistics for cities - scaling<br />autonomous delivery through sidewalks, bike lanes and roads where permitted.</p><p><span class=\"legendSpanClass\"><location value=\"LU/us.ca.losang\" idsrc=\"xmltag.org\" >LOS ANGELES</location></span>, <span class=\"legendSpanClass\"><chron>Feb. 26, 2026</chron></span> /PRNewswire/ -- <u>Coco Robotics</u>, the world's leading urban robotics platform, today launched Coco 2, its next-generation autonomous delivery robots. This is a major milestone in the company's evolution into a physical AI leader as Coco 2 represents the shift from human-guided robotics to full autonomy.</p>\n    <div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder1\">\n                <p>\n\n                    <img src=\"https://mma.prnewswire.com/media/2920832/Coco_2_robot_enroute_to_a_delivery.jpg\" title=\"Coco 2 robot enroute to a delivery.\" alt=\"Coco 2 robot enroute to a delivery.\" />\n\n                </p>\n    </div>\n<p>Coco's new robots adapt more quickly to new cities, navigate complex urban environments with greater precision, and continuously improve through millions of real-world data points. Extending even further into urban logistics, Coco 2 is designed as a general-purpose urban robotics platform, enabling city-wide movement of goods for all types of businesses from restaurants and grocers to pharmacies and local retailers, expanding far beyond traditional sidewalk food deliveries.</p><p>Coco 2's capabilities are powered by the industry's largest dataset of sidewalk robot operations, built from millions of miles navigating complex urban environments - including flooded streets in <location value=\"LU/us.fl.miami\" idsrc=\"xmltag.org\" >Miami</location>, heavy snow and freezing temperatures in <location value=\"LU/us.il.chicgo\" idsrc=\"xmltag.org\" >Chicago</location>, and dense traffic in <location value=\"LU/us.ca.losang\" idsrc=\"xmltag.org\" >Los Angeles</location> - conditions that can disrupt urban logistics. This operational data continuously strengthens the fleet's AI, enabling safe and efficient deployment in new cities.</p><p>\"Every mile our robots have driven has made the whole fleet smarter,\" said <person>Zach Rash</person>, CEO and Co-Founder of Coco Robotics. \"Human-in-the-loop learnings have helped us improve with every edge case, creating a feedback loop between deployment, data collection, and model advancements. This ongoing process has steadily enhanced our fleet's intelligence, enabling Coco to operate in new cities with real-time adaptability.\"</p><p><b><i>From Sidewalks to Citywide Autonomy</i></b></p><p>While Coco began with sidewalk-first delivery, Coco 2 expands into bike lanes and roads where permitted, reducing delivery times by up to 50 percent compared to the prior generation. With up to three times longer uptime and improved resilience to weather and wear, Coco 2 also increases daily order capacity while lowering cost per mile.</p><p>Coco 2 builds upon Coco's Urban Robotic Platform to lower the cost per mile and increase the range and reliability of delivery - making instant delivery affordable at scale for any business, on any delivery platform, and across a wide range of basket sizes.</p><p>Today, Coco powers autonomous delivery through <org>Uber Eats</org>, DoorDash, and Wolt, and serves more than 3,000 merchants and restaurants - from local favorites to national brands - demonstrating growing demand. Building on that momentum, Coco is on track to scale its fleet to thousands of robots globally by the end of the year.</p><p><b><i>Under the Hood: The Intelligence Behind Coco 2</i></b></p><p>By leveraging NVIDIA Omniverse libraries, open robotics simulation and learning frameworks <person>Isaac Sim</person> and <org>Isaac Lab</org> along with NVIDIA Cosmos world foundation models - Coco creates physically accurate simulations and synthetic data, or computer-generated scenarios that mimic real streets, pedestrians, vehicles, and obstacles. This allows Coco's AI to safely practice navigating complex city streets and edge cases before ever leaving the warehouse.</p><p>Coco 2 robots run on NVIDIA Jetson Orin NX, a robotic computing platform that processes data much faster and more efficiently directly on the robot, without relying on cloud connections. This combination of NVIDIA accelerated computing and software creates a fully integrated driving system that lets Coco 2 see and understand its surroundings, anticipate movement, plan routes, and execute maneuvers smoothly and safely.</p><p>\"The era of physical AI has arrived, and scaling it requires a seamless loop between massive real-world data and high-performance edge computing,\" said <person>Amit Goel</person>, head of strategic partnerships at NVIDIA. \"By leveraging NVIDIA's full robotics stack, Coco is accelerating the deployment of autonomous systems that can safely navigate the complexities of our cities at scale.\"</p><p>As a result, Coco can now expand quickly into new cities, bringing modern, autonomous urban delivery to more neighborhoods and businesses.</p><p><b>About Coco Robotics</b></p><p><b>Coco Robotics is the world's largest urban robotics platform</b>, combining autonomous robots, real-world operations data, and advanced AI to power smarter, more efficient city logistics. Founded in 2020, Coco has completed over 500,000 zero-emission deliveries across the U.S. and <location value=\"LR/eur\" idsrc=\"xmltag.org\" >Europe</location>. The fleet continuously learns from millions of miles of real-world operations, giving Coco instant adaptability to new cities and environments. This data-driven intelligence allows Coco to expand rapidly while maintaining safe, reliable, and efficient operations. Coco's mission is to create more sustainable, reliable, and affordable last-mile logistics solutions in cities around the world. For more information, visit <u>www.cocodelivery.com</u>.</p><p>Media Contact:<br /><person>Nadia Jamshidi</person><br />nadia@honeyjar.ai</p>\n<div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder2\">\n                <p>\n\n                    <img src=\"https://mma.prnewswire.com/media/2488960/Coco_Robotics_Logo.jpg\" title=\"(PRNewsfoto/Coco)\" alt=\"(PRNewsfoto/Coco)\" />\n\n                </p>\n</div>\n\n\n\n<p id=\"PURL\"><img title=\"Cision\" width=\"12\" height=\"12\" alt=\"Cision\" src=\"https://edge.prnewswire.com/c/img/favicon.png?sn=SF96364&amp;sd=2026-02-26\" /> View original content to download multimedia:https://www.prnewswire.com/news-releases/coco-robotics-launches-next-gen-autonomous-robots-for-urban-deliveries-302698399.html</p><p>SOURCE Coco Robotics</p></div>\n",
            "link": "https://www.fidelity.com/news/article/technology/202602261000PR_NEWS_USPR_____SF96364",
            "pub_date": "2026-02-26 23:00:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "accessiBe Earns Top 10 Ranking in Content Management on G2's 2026 Best Software Awards",
            "description": "\n<div class=\"xn-content\">\n<p><span class=\"legendSpanClass\"><location value=\"LU/us.ny.nyc\" idsrc=\"xmltag.org\" >NEW YORK</location></span>, <span class=\"legendSpanClass\"><chron>Feb. 26, 2026</chron></span> /PRNewswire/ -- Leading end-to-end web accessibility platform <u>accessiBe</u> today announced it has been named to G2's 2026 Best Software Awards, earning a Top 10 ranking in the Content Management category and placing #25 in <org>EMEA Software</org>. accessiBe is the only accessibility company recognized in the <org>EMEA Software</org> category this year.</p>\n<div id=\"prni_dvprnejpgfdcaleft\" dir=\"ltr\" style=\"width: 100%; text-align: left;\"><img id=\"prnejpgfdcaleft\" title=\"accessiBe Logo\" src=\"https://mma.prnewswire.com/media/2289595/accessiBe_Logo.jpg\" alt=\"accessiBe Logo\" align=\"middle\" /></div><p>As the world's largest and most trusted software marketplace, G2 reaches over 100 million buyers annually. Its annual Best Software Awards rank the world's best software companies and products based on authentic, timely reviews from real users.</p><p>accessiBe's recognition in G2's 2026 Best Software Awards affirms its category leadership, placing the company alongside some of the most established names in enterprise software. It reinforces its role in delivering scalable accessibility solutions for organizations at every stage of growth and digital maturity.</p><p>\"As digital experiences grow more complex, accessibility demands a unified approach,\" said <person>Robert Lopez</person>, CEO of accessiBe. \"Modern organizations require a unified platform that brings together automation, developer-centric tooling, expert remediation, and ongoing support — delivered with clarity and accountability. This recognition confirms that the market expects more, and we've built for that expectation.\"</p><p>\"As buyers increasingly shift to AI-driven research to discover software solutions, being recommended in the 'answer moment' must be earned with credible proof,\" said Godard Abel, co-founder and CEO at G2. \"Our <org>Best Software</org> Awards are grounded in trusted data from authentic customer reviews. They not only give buyers an objective, reliable guide to the products that help teams do their best work, but they're also the proof AI search platforms rely on when sourcing answers. Congratulations to this year's winners, including accessiBe. Earning a spot on these lists signals real customer impact.\"</p><p><b>About G2's Best Software Awards</b></p><p>G2's 2026 Best Software Awards feature dozens of award lists, ranking software vendors and products using G2's proprietary algorithm. The results are based on G2's verified user reviews and publicly available market presence data. To be eligible for the Best Software Awards, a software company or product must have received at least 10 approved reviews during the 2025 calendar year. Scores reflect only data from reviews submitted during this evaluation period.</p><p>To learn more, view G2's 2026 Best Software Awards and read more about G2's methodology.</p><p><b>About accessiBe</b></p><p>accessiBe is an end-to-end accessibility platform unifying AI automation, developer tools, and expert services to help organizations create inclusive digital experiences at scale. Guided by its mission to level the digital playing field for everyone, the company is trusted by over 100,000 websites worldwide. Developed in collaboration with the disability community and organizations including the <org>National MS Society</org>, United Cerebral Palsy, and the Special Olympics <location value=\"LC/us\" idsrc=\"xmltag.org\" >USA</location> Games, accessiBe continues to advance accessibility through technology, accountability, and innovation. To learn more, visit <u>www.accesibe.com</u></p><p><b>About G2</b></p><p>G2 is the world's largest and most trusted software marketplace. More than 100 million people annually — including employees at all Fortune 500 companies — use G2 to make smarter software decisions based on authentic peer reviews. Thousands of software and services companies of all sizes partner with G2 to build their reputation and grow their business — including Salesforce, HubSpot, Zoom, and Adobe. To learn more about where you go for software, visit <u>www.g2.com</u> and follow G2 on LinkedIn.</p><p>Media Contact:</p><p><person>Olga Shmuklyer</person><br />Fusion Public Relations <br />accessibe@fusionpr.com<br />+1(917)715-0329</p><p>Logo: https://mma.prnewswire.com/media/2289595/accessiBe_Logo.jpg</p><p> </p>\n\n\n\n<p id=\"PURL\"><img title=\"Cision\" width=\"12\" height=\"12\" alt=\"Cision\" src=\"https://edge.prnewswire.com/c/img/favicon.png?sn=IO96559&amp;sd=2026-02-26\" /> View original content:https://www.prnewswire.com/news-releases/accessibe-earns-top-10-ranking-in-content-management-on-g2s-2026-best-software-awards-302698159.html</p><p>SOURCE accessiBe</p></div>\n",
            "link": "https://www.fidelity.com/news/article/technology/202602261000PR_NEWS_USPR_____IO96559",
            "pub_date": "2026-02-26 23:00:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Form 8.3",
            "description": "\n<p>    <location value=\"LU/gb.eng.london\" idsrc=\"xmltag.org\" >LONDON</location>--(BUSINESS WIRE)--</p>\n<p class=\"bwalignl\">\n \n\n</p><p class=\"bwalignr\">\n<b>FORM 8.3</b>\n\n</p><p class=\"bwalignc\">\n<b>PUBLIC OPENING POSITION DISCLOSURE/DEALING DISCLOSURE BY</b>\n\n</p><p class=\"bwalignc\">\n<b>A PERSON WITH INTERESTS IN RELEVANT SECURITIES REPRESENTING 1% OR MORE</b>\n\n</p><p class=\"bwalignc\">\n<b>Rule 8.3 of the Takeover Code (the “Code”)</b>\n\n</p><p>\n<b>1.</b> <b>KEY INFORMATION</b>\n\n</p><table class=\"bwwidth100 bwtablemarginb\" cellspacing=\"0\">\n<tr>\n<td class=\"bwvertalignt bwsinglebottom bwrightsingle bwpadl0 bwtopsingle bwleftsingle\" rowspan=\"1\" colspan=\"1\"><p class=\"bwcellpmargin\">\n<b>(a)</b> <b>Full name of discloser:</b>\n\n</p>\n\n</td>\n\n<td rowspan=\"1\" colspan=\"1\"> </td>\n<td class=\"bwsinglebottom bwpadl0 bwtopsingle bwrightsingle bwalignl bwvertalignm\" rowspan=\"1\" colspan=\"1\"><p class=\"bwcellpmargin bwalignl\">\n<org>Sand Grove Capital Management LLP</org>\n\n</p>\n\n</td>\n\n</tr>\n<tr>\n<td class=\"bwvertalignt bwsinglebottom bwrightsingle bwpadl0 bwleftsingle\" rowspan=\"1\" colspan=\"1\"><p class=\"bwcellpmargin\">\n<b>(b)</b> <b>Owner or controller of interests and short positions disclosed, if different from 1(a):</b>\n\n</p>\n\n<p class=\"bwcellpmargin\">\n<i>The naming of nominee or vehicle companies is insufficient. For a trust, the trustee(s), settlor and beneficiaries must be named.</i>\n\n</p>\n\n</td>\n\n<td rowspan=\"1\" colspan=\"1\"> </td>\n<td class=\"bwvertalignm bwsinglebottom bwpadl0 bwrightsingle bwalignl\" rowspan=\"1\" colspan=\"1\"><p class=\"bwcellpmargin bwalignl\">\nFund(s) for which <org>Sand Grove Capital Management LLP</org> serves as the Investment Manager or Discretionary Sub-Advisor\n\n</p>\n\n</td>\n\n</tr>\n<tr>\n<td class=\"bwvertalignt bwsinglebottom bwrightsingle bwpadl0 bwleftsingle\" rowspan=\"1\" colspan=\"1\"><p class=\"bwcellpmargin\">\n<b>(c)</b> <b>Name of offeror/offeree in relation to whose relevant securities this form relates:</b>\n\n</p>\n\n<p class=\"bwcellpmargin\">\n<i>Use a separate form for each offeror/offeree</i>\n\n</p>\n\n</td>\n\n<td rowspan=\"1\" colspan=\"1\"> </td>\n<td class=\"bwvertalignm bwsinglebottom bwpadl0 bwrightsingle bwalignl\" rowspan=\"1\" colspan=\"1\"><p class=\"bwcellpmargin bwalignl\">\n<org value=\"AGMFF.NaE\" idsrc=\"xmltag.org\" >Augmentum Fintech plc</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AGMFF' fmr-param-security-type='Equity'>( AGMFF )</span>\n\n</p>\n\n</td>\n\n</tr>\n<tr>\n<td class=\"bwvertalignt bwsinglebottom bwrightsingle bwpadl0 bwleftsingle\" rowspan=\"1\" colspan=\"1\"><p class=\"bwcellpmargin\">\n<b></b> <b>If an exempt fund manager connected with an offeror/offeree, state this and specify identity of offeror/offeree:</b>\n\n</p>\n\n</td>\n\n<td rowspan=\"1\" colspan=\"1\"> </td>\n<td class=\"bwvertalignm bwsinglebottom bwpadl0 bwrightsingle bwalignl\" rowspan=\"1\" colspan=\"1\"><p class=\"bwcellpmargin bwalignl\">\n \n\n</p>\n\n</td>\n\n</tr>\n<tr>\n<td class=\"bwvertalignt bwsinglebottom bwrightsingle bwpadl0 bwleftsingle\" rowspan=\"1\" colspan=\"1\"><p class=\"bwcellpmargin\">\n<b>(e) Date position held/dealing undertaken:</b>\n\n</p>\n\n<p class=\"bwcellpmargin\">\n<i>For an opening position disclosure, state the latest practicable date prior to the disclosure</i>\n\n</p>\n\n</td>\n\n<td rowspan=\"1\" colspan=\"1\"> </td>\n<td class=\"bwvertalignm bwsinglebottom bwpadl0 bwrightsingle bwalignl\" rowspan=\"1\" colspan=\"1\"><p class=\"bwcellpmargin bwalignl\">\n<chron>25 February 2026</chron>\n\n</p>\n\n</td>\n\n</tr>\n<tr>\n<td class=\"bwvertalignt bwrightsingle bwpadl0 bwsinglebottom bwleftsingle\" rowspan=\"1\" colspan=\"1\"><p class=\"bwcellpmargin\">\n<b>(f)</b> <b>In addition to the company in 1(c) above, is the discloser making disclosures in respect of any other party to the offer?</b>\n\n</p>\n\n<p class=\"bwcellpmargin\">\n<i>If it is a cash offer or possible cash offer, state “N/A”</i>\n\n</p>\n\n</td>\n\n<td rowspan=\"1\" colspan=\"1\"> </td>\n<td class=\"bwpadl0 bwsinglebottom bwrightsingle bwpadr0 bwpadb3 bwalignl bwvertalignm\" rowspan=\"1\" colspan=\"1\"><p class=\"bwcellpmargin bwalignl\">\nN/A\n\n</p>\n\n</td>\n\n</tr>\n</table><p>\n<b>2.</b> <b>POSITIONS OF THE PERSON MAKING THE DISCLOSURE</b>\n\n</p><p>\n<i>If there are positions or rights to subscribe to disclose in more than one class of relevant securities of the offeror or offeree named in 1(c), copy table 2(a) or (b) (as appropriate) for each additional class of relevant security.</i>\n\n</p><p>\n<b>(a)</b> <b>Interests and short positions in the relevant securities of the offeror or offeree to which the disclosure relates following the dealing (if any)</b>\n\n</p><table class=\"bwwidth100 bwtablemarginb\" cellspacing=\"0\">\n<tr>\n<td class=\"bwvertalignt bwsinglebottom bwrightsingle bwpadl0 bwtopsingle bwleftsingle\" rowspan=\"1\" colspan=\"1\"><p class=\"bwcellpmargin\">\n<b>Class of relevant security:</b>\n\n</p>\n\n</td>\n\n<td rowspan=\"1\" colspan=\"1\"> </td>\n<td colspan=\"7\" class=\"bwvertalignm bwsinglebottom bwpadl0 bwtopsingle bwrightsingle\" rowspan=\"1\"><p class=\"bwalignc bwcellpmargin\">\n1p ordinary\n\n</p>\n\n</td>\n\n</tr>\n<tr>\n<td class=\"bwvertalignt bwrightsingle bwrowaltcolor0 bwpadl0 bwleftsingle\" rowspan=\"1\" colspan=\"1\"><p class=\"bwcellpmargin\">\n \n\n</p>\n\n<p class=\"bwcellpmargin\">\n \n\n</p>\n\n</td>\n\n<td rowspan=\"1\" colspan=\"1\"> </td>\n<td colspan=\"3\" class=\"bwvertalignt bwsinglebottom bwrightsingle bwpadl0\" rowspan=\"1\"><p class=\"bwalignc bwcellpmargin\">\n<b>Interests</b>\n\n</p>\n\n</td>\n\n<td rowspan=\"1\" colspan=\"1\"> </td>\n<td colspan=\"3\" class=\"bwvertalignt bwsinglebottom bwpadl0 bwrightsingle\" rowspan=\"1\"><p class=\"bwalignc bwcellpmargin\">\n<b>Short positions</b>\n\n</p>\n\n</td>\n\n</tr>\n<tr>\n<td class=\"bwvertalignt bwsinglebottom bwrightsingle bwrowaltcolor0 bwpadl0 bwleftsingle\" rowspan=\"1\" colspan=\"1\"><p class=\"bwcellpmargin\">\n \n\n</p>\n\n</td>\n\n<td rowspan=\"1\" colspan=\"1\"> </td>\n<td class=\"bwvertalignt bwsinglebottom bwrightsingle bwpadl0\" rowspan=\"1\" colspan=\"1\"><p class=\"bwalignc bwcellpmargin\">\n<b>Number</b>\n\n</p>\n\n</td>\n\n<td rowspan=\"1\" colspan=\"1\"> </td>\n<td class=\"bwwidth11 bwvertalignt bwsinglebottom bwrightsingle bwpadl0\" rowspan=\"1\" colspan=\"1\"><p class=\"bwalignc bwcellpmargin\">\n<b>%</b>\n\n</p>\n\n</td>\n\n<td rowspan=\"1\" colspan=\"1\"> </td>\n<td class=\"bwvertalignt bwsinglebottom bwrightsingle bwpadl0\" rowspan=\"1\" colspan=\"1\"><p class=\"bwalignc bwcellpmargin\">\n<b>Number</b>\n\n</p>\n\n</td>\n\n<td rowspan=\"1\" colspan=\"1\"> </td>\n<td class=\"bwvertalignt bwsinglebottom bwpadl0 bwrightsingle\" rowspan=\"1\" colspan=\"1\"><p class=\"bwalignc bwcellpmargin\">\n<b>%</b>\n\n</p>\n\n</td>\n\n</tr>\n<tr>\n<td class=\"bwvertalignt bwsinglebottom bwrightsingle bwpadl0 bwleftsingle\" rowspan=\"1\" colspan=\"1\"><p class=\"bwcellpmargin\">\n<b>(1)</b> <b>Relevant securities owned and/or controlled:</b>\n\n</p>\n\n</td>\n\n<td rowspan=\"1\" colspan=\"1\"> </td>\n<td class=\"bwvertalignm bwsinglebottom bwrightsingle bwpadl0 bwalignc\" rowspan=\"1\" colspan=\"1\"><p class=\"bwalignc bwcellpmargin\">\n \n\n</p>\n\n</td>\n\n<td rowspan=\"1\" colspan=\"1\"> </td>\n<td class=\"bwwidth11 bwvertalignm bwsinglebottom bwrightsingle bwpadl0 bwalignc\" rowspan=\"1\" colspan=\"1\"><p class=\"bwalignc bwcellpmargin\">\n \n\n</p>\n\n</td>\n\n<td rowspan=\"1\" colspan=\"1\"> </td>\n<td class=\"bwvertalignt bwsinglebottom bwrightsingle bwpadl0\" rowspan=\"1\" colspan=\"1\"><p class=\"bwalignc bwcellpmargin\">\n \n\n</p>\n\n</td>\n\n<td rowspan=\"1\" colspan=\"1\"> </td>\n<td class=\"bwvertalignt bwsinglebottom bwpadl0 bwrightsingle\" rowspan=\"1\" colspan=\"1\"><p class=\"bwalignc bwcellpmargin\">\n \n\n</p>\n\n</td>\n\n</tr>\n<tr>\n<td class=\"bwvertalignt bwsinglebottom bwrightsingle bwpadl0 bwleftsingle\" rowspan=\"1\" colspan=\"1\"><p class=\"bwcellpmargin\">\n<b>(2)</b> <b>Cash-settled derivatives:</b>\n\n</p>\n\n</td>\n\n<td rowspan=\"1\" colspan=\"1\"> </td>\n<td class=\"bwsinglebottom bwrightsingle bwpadl0 bwpadr0 bwpadb3 bwalignc bwvertalignm\" rowspan=\"1\" colspan=\"1\"><p class=\"bwcellpmargin bwalignc\">\n2,414,067\n\n</p>\n\n</td>\n\n<td rowspan=\"1\" colspan=\"1\"> </td>\n<td class=\"bwwidth11 bwsinglebottom bwrightsingle bwpadl0 bwpadr0 bwpadb3 bwalignc bwvertalignm\" rowspan=\"1\" colspan=\"1\"><p class=\"bwcellpmargin bwalignc\">\n1.44%\n\n</p>\n\n</td>\n\n<td rowspan=\"1\" colspan=\"1\"> </td>\n<td class=\"bwvertalignm bwsinglebottom bwrightsingle bwpadl0\" rowspan=\"1\" colspan=\"1\"><p class=\"bwalignc bwcellpmargin\">\n \n\n</p>\n\n</td>\n\n<td rowspan=\"1\" colspan=\"1\"> </td>\n<td class=\"bwvertalignm bwsinglebottom bwpadl0 bwrightsingle\" rowspan=\"1\" colspan=\"1\"><p class=\"bwalignc bwcellpmargin\">\n \n\n</p>\n\n</td>\n\n</tr>\n<tr>\n<td class=\"bwvertalignt bwsinglebottom bwrightsingle bwpadl0 bwleftsingle\" rowspan=\"1\" colspan=\"1\"><p class=\"bwcellpmargin\">\n<b>(3)</b> <b>Stock-settled derivatives (including options) and agreements to purchase/sell:</b>\n\n</p>\n\n</td>\n\n<td rowspan=\"1\" colspan=\"1\"> </td>\n<td class=\"bwvertalignm bwsinglebottom bwrightsingle bwpadl0 bwalignc\" rowspan=\"1\" colspan=\"1\"><p class=\"bwalignc bwcellpmargin\">\n \n\n</p>\n\n</td>\n\n<td rowspan=\"1\" colspan=\"1\"> </td>\n<td class=\"bwwidth11 bwvertalignm bwsinglebottom bwrightsingle bwpadl0 bwalignc\" rowspan=\"1\" colspan=\"1\"><p class=\"bwalignc bwcellpmargin\">\n \n\n</p>\n\n</td>\n\n<td rowspan=\"1\" colspan=\"1\"> </td>\n<td class=\"bwvertalignt bwsinglebottom bwrightsingle bwpadl0\" rowspan=\"1\" colspan=\"1\"><p class=\"bwalignc bwcellpmargin\">\n \n\n</p>\n\n</td>\n\n<td rowspan=\"1\" colspan=\"1\"> </td>\n<td class=\"bwvertalignt bwsinglebottom bwpadl0 bwrightsingle\" rowspan=\"1\" colspan=\"1\"><p class=\"bwalignc bwcellpmargin\">\n \n\n</p>\n\n</td>\n\n</tr>\n<tr>\n<td class=\"bwvertalignt bwrightsingle bwpadl0 bwsinglebottom bwleftsingle\" rowspan=\"1\" colspan=\"1\"><p class=\"bwcellpmargin\">\n<b>TOTAL:</b>\n\n</p>\n\n</td>\n\n<td rowspan=\"1\" colspan=\"1\"> </td>\n<td class=\"bwrightsingle bwpadl0 bwsinglebottom bwpadr0 bwpadb3 bwalignc bwvertalignm\" rowspan=\"1\" colspan=\"1\"><p class=\"bwcellpmargin bwalignc\">\n2,414,067\n\n</p>\n\n</td>\n\n<td rowspan=\"1\" colspan=\"1\"> </td>\n<td class=\"bwwidth11 bwrightsingle bwpadl0 bwsinglebottom bwpadr0 bwpadb3 bwalignc bwvertalignm\" rowspan=\"1\" colspan=\"1\"><p class=\"bwcellpmargin bwalignc\">\n1.44%\n\n</p>\n\n</td>\n\n<td rowspan=\"1\" colspan=\"1\"> </td>\n<td class=\"bwvertalignm bwrightsingle bwpadl0 bwsinglebottom\" rowspan=\"1\" colspan=\"1\"><p class=\"bwalignc bwcellpmargin\">\n \n\n</p>\n\n</td>\n\n<td rowspan=\"1\" colspan=\"1\"> </td>\n<td class=\"bwvertalignm bwpadl0 bwsinglebottom bwrightsingle\" rowspan=\"1\" colspan=\"1\"><p class=\"bwalignc bwcellpmargin\">\n \n\n</p>\n\n</td>\n\n</tr>\n</table><p>\n<i>All interests and all short positions should be disclosed.</i>\n\n</p><p>\n<i>Details of any open stock-settled derivative positions (including traded options), or agreements to purchase or sell relevant securities, should be given on a Supplemental Form 8 (Open Positions).</i>\n\n</p><p>\n<b>(b)</b> <b>Rights to subscribe for new securities (including directors’ and other employee options)</b>\n\n</p><table class=\"bwwidth100 bwtablemarginb\" cellspacing=\"0\">\n<tr>\n<td class=\"bwvertalignt bwsinglebottom bwrightsingle bwpadl0 bwtopsingle bwleftsingle\" rowspan=\"1\" colspan=\"1\"><p class=\"bwcellpmargin\">\n<b>Class of relevant security in relation to which subscription right exists:</b>\n\n</p>\n\n</td>\n\n<td rowspan=\"1\" colspan=\"1\"> </td>\n<td class=\"bwvertalignt bwsinglebottom bwpadl0 bwtopsingle bwrightsingle\" rowspan=\"1\" colspan=\"1\"><p class=\"bwcellpmargin\">\n \n\n</p>\n\n</td>\n\n</tr>\n<tr>\n<td class=\"bwvertalignt bwrightsingle bwpadl0 bwsinglebottom bwleftsingle\" rowspan=\"1\" colspan=\"1\"><p class=\"bwcellpmargin\">\n<b>Details, including nature of the rights concerned and relevant percentages:</b>\n\n</p>\n\n</td>\n\n<td rowspan=\"1\" colspan=\"1\"> </td>\n<td class=\"bwvertalignt bwpadl0 bwsinglebottom bwrightsingle\" rowspan=\"1\" colspan=\"1\"><p class=\"bwcellpmargin\">\n \n\n</p>\n\n</td>\n\n</tr>\n</table><p>\n<b>3.</b> <b>DEALINGS (IF ANY) BY THE PERSON MAKING THE DISCLOSURE</b>\n\n</p><p>\n<i>Where there have been dealings in more than one class of relevant securities of the offeror or offeree named in 1(c), copy table 3(a), (b), (c) or (d) (as appropriate) for each additional class of relevant security dealt in.</i>\n\n</p><p>\n<i>The currency of all prices and other monetary amounts should be stated.</i>\n\n</p><p>\n<b>(a)</b> <b>Purchases and sales</b>\n\n</p><table class=\"bwwidth100 bwtablemarginb\" cellspacing=\"0\">\n<tr>\n<td class=\"bwwidth25 bwvertalignt bwsinglebottom bwrightsingle bwpadl0 bwtopsingle bwleftsingle\" rowspan=\"1\" colspan=\"1\"><p class=\"bwalignc bwcellpmargin\">\n<b>Class of relevant security</b>\n\n</p>\n\n</td>\n\n<td rowspan=\"1\" colspan=\"1\"> </td>\n<td class=\"bwwidth25 bwvertalignt bwsinglebottom bwrightsingle bwpadl0 bwtopsingle\" rowspan=\"1\" colspan=\"1\"><p class=\"bwalignc bwcellpmargin\">\n<b>Purchase/sale</b>\n\n</p>\n\n</td>\n\n<td rowspan=\"1\" colspan=\"1\"> </td>\n<td class=\"bwwidth25 bwvertalignt bwsinglebottom bwrightsingle bwpadl0 bwtopsingle\" rowspan=\"1\" colspan=\"1\"><p class=\"bwalignc bwcellpmargin\">\n<b>Number of securities</b>\n\n</p>\n\n</td>\n\n<td rowspan=\"1\" colspan=\"1\"> </td>\n<td class=\"bwwidth25 bwvertalignt bwsinglebottom bwpadl0 bwtopsingle bwrightsingle\" rowspan=\"1\" colspan=\"1\"><p class=\"bwalignc bwcellpmargin\">\n<b>Price per unit</b>\n\n</p>\n\n</td>\n\n</tr>\n<tr>\n<td class=\"bwwidth25 bwvertalignm bwsinglebottom bwrightsingle bwpadl0 bwleftsingle\" rowspan=\"1\" colspan=\"1\"><p class=\"bwalignc bwcellpmargin\">\n \n\n</p>\n\n</td>\n\n<td rowspan=\"1\" colspan=\"1\"> </td>\n<td class=\"bwwidth25 bwvertalignm bwsinglebottom bwrightsingle bwpadl0\" rowspan=\"1\" colspan=\"1\"><p class=\"bwalignc bwcellpmargin\">\n \n\n</p>\n\n</td>\n\n<td rowspan=\"1\" colspan=\"1\"> </td>\n<td class=\"bwwidth25 bwvertalignm bwsinglebottom bwrightsingle bwpadl0\" rowspan=\"1\" colspan=\"1\"><p class=\"bwalignc bwcellpmargin\">\n \n\n</p>\n\n</td>\n\n<td rowspan=\"1\" colspan=\"1\"> </td>\n<td class=\"bwwidth25 bwvertalignm bwsinglebottom bwpadl0 bwrightsingle\" rowspan=\"1\" colspan=\"1\"><p class=\"bwalignc bwcellpmargin\">\n \n\n</p>\n\n</td>\n\n</tr>\n<tr>\n<td class=\"bwwidth25 bwvertalignm bwsinglebottom bwrightsingle bwpadl0 bwleftsingle\" rowspan=\"1\" colspan=\"1\"><p class=\"bwalignc bwcellpmargin\">\n \n\n</p>\n\n</td>\n\n<td rowspan=\"1\" colspan=\"1\"> </td>\n<td class=\"bwwidth25 bwvertalignm bwsinglebottom bwrightsingle bwpadl0\" rowspan=\"1\" colspan=\"1\"><p class=\"bwalignc bwcellpmargin\">\n \n\n</p>\n\n</td>\n\n<td rowspan=\"1\" colspan=\"1\"> </td>\n<td class=\"bwwidth25 bwvertalignm bwsinglebottom bwrightsingle bwpadl0\" rowspan=\"1\" colspan=\"1\"><p class=\"bwalignc bwcellpmargin\">\n \n\n</p>\n\n</td>\n\n<td rowspan=\"1\" colspan=\"1\"> </td>\n<td class=\"bwwidth25 bwvertalignm bwsinglebottom bwpadl0 bwrightsingle\" rowspan=\"1\" colspan=\"1\"><p class=\"bwalignc bwcellpmargin\">\n \n\n</p>\n\n</td>\n\n</tr>\n<tr>\n<td class=\"bwwidth25 bwvertalignm bwsinglebottom bwrightsingle bwpadl0 bwleftsingle\" rowspan=\"1\" colspan=\"1\"><p class=\"bwalignc bwcellpmargin\">\n \n\n</p>\n\n</td>\n\n<td rowspan=\"1\" colspan=\"1\"> </td>\n<td class=\"bwwidth25 bwvertalignm bwsinglebottom bwrightsingle bwpadl0\" rowspan=\"1\" colspan=\"1\"><p class=\"bwalignc bwcellpmargin\">\n \n\n</p>\n\n</td>\n\n<td rowspan=\"1\" colspan=\"1\"> </td>\n<td class=\"bwwidth25 bwvertalignm bwsinglebottom bwrightsingle bwpadl0\" rowspan=\"1\" colspan=\"1\"><p class=\"bwalignc bwcellpmargin\">\n \n\n</p>\n\n</td>\n\n<td rowspan=\"1\" colspan=\"1\"> </td>\n<td class=\"bwwidth25 bwvertalignm bwsinglebottom bwpadl0 bwrightsingle\" rowspan=\"1\" colspan=\"1\"><p class=\"bwalignc bwcellpmargin\">\n \n\n</p>\n\n</td>\n\n</tr>\n<tr>\n<td class=\"bwwidth25 bwvertalignm bwrightsingle bwpadl0 bwsinglebottom bwleftsingle\" rowspan=\"1\" colspan=\"1\"><p class=\"bwalignc bwcellpmargin\">\n \n\n</p>\n\n</td>\n\n<td rowspan=\"1\" colspan=\"1\"> </td>\n<td class=\"bwwidth25 bwvertalignm bwrightsingle bwpadl0 bwsinglebottom\" rowspan=\"1\" colspan=\"1\"><p class=\"bwalignc bwcellpmargin\">\n \n\n</p>\n\n</td>\n\n<td rowspan=\"1\" colspan=\"1\"> </td>\n<td class=\"bwwidth25 bwvertalignm bwrightsingle bwpadl0 bwsinglebottom\" rowspan=\"1\" colspan=\"1\"><p class=\"bwalignc bwcellpmargin\">\n \n\n</p>\n\n</td>\n\n<td rowspan=\"1\" colspan=\"1\"> </td>\n<td class=\"bwwidth25 bwvertalignm bwpadl0 bwsinglebottom bwrightsingle\" rowspan=\"1\" colspan=\"1\"><p class=\"bwalignc bwcellpmargin\">\n \n\n</p>\n\n</td>\n\n</tr>\n</table><p>\n<b>(b)</b> <b>Cash-settled derivative transactions</b>\n\n</p><table class=\"bwwidth100 bwtablemarginb\" cellspacing=\"0\">\n<tr>\n<td class=\"bwvertalignt bwsinglebottom bwrightsingle bwpadl0 bwtopsingle bwleftsingle\" rowspan=\"1\" colspan=\"1\"><p class=\"bwalignc bwcellpmargin\">\n<b>Class of relevant security</b>\n\n</p>\n\n</td>\n\n<td rowspan=\"1\" colspan=\"1\"> </td>\n<td class=\"bwvertalignt bwsinglebottom bwrightsingle bwpadl0 bwtopsingle\" rowspan=\"1\" colspan=\"1\"><p class=\"bwalignc bwcellpmargin\">\n<b>Product description</b>\n\n</p>\n\n<p class=\"bwalignc bwcellpmargin\">\n<i>e.g. CFD</i>\n\n</p>\n\n</td>\n\n<td rowspan=\"1\" colspan=\"1\"> </td>\n<td class=\"bwvertalignt bwsinglebottom bwrightsingle bwpadl0 bwtopsingle\" rowspan=\"1\" colspan=\"1\"><p class=\"bwalignc bwcellpmargin\">\n<b>Nature of dealing</b>\n\n</p>\n\n<p class=\"bwalignc bwcellpmargin\">\n<i>e.g. opening/closing a long/short position, increasing/reducing a long/short position</i>\n\n</p>\n\n</td>\n\n<td rowspan=\"1\" colspan=\"1\"> </td>\n<td class=\"bwvertalignt bwsinglebottom bwrightsingle bwpadl0 bwtopsingle\" rowspan=\"1\" colspan=\"1\"><p class=\"bwalignc bwcellpmargin\">\n<b>Number of reference securities</b>\n\n</p>\n\n</td>\n\n<td rowspan=\"1\" colspan=\"1\"> </td>\n<td class=\"bwvertalignt bwsinglebottom bwpadl0 bwtopsingle bwrightsingle\" rowspan=\"1\" colspan=\"1\"><p class=\"bwalignc bwcellpmargin\">\n<b>Price per unit</b>\n\n</p>\n\n</td>\n\n</tr>\n<tr>\n<td class=\"bwvertalignm bwsinglebottom bwrightsingle bwpadl0 bwleftsingle bwalignc\" rowspan=\"1\" colspan=\"1\"><p class=\"bwalignc bwcellpmargin\">\n1p ordinary\n\n</p>\n\n</td>\n\n<td class=\"bwalignc bwvertalignm\" rowspan=\"1\" colspan=\"1\"><p class=\"bwalignc bwcellpmargin\">\n \n\n</p>\n\n</td>\n\n<td class=\"bwvertalignm bwsinglebottom bwrightsingle bwpadl0 bwalignc\" rowspan=\"1\" colspan=\"1\"><p class=\"bwalignc bwcellpmargin\">\nCFD\n\n</p>\n\n</td>\n\n<td class=\"bwalignc bwvertalignm\" rowspan=\"1\" colspan=\"1\"><p class=\"bwalignc bwcellpmargin\">\n \n\n</p>\n\n</td>\n\n<td class=\"bwvertalignm bwsinglebottom bwrightsingle bwpadl0 bwalignc\" rowspan=\"1\" colspan=\"1\"><p class=\"bwalignc bwcellpmargin\">\nOpening a long position\n\n</p>\n\n</td>\n\n<td class=\"bwalignc bwvertalignm\" rowspan=\"1\" colspan=\"1\"><p class=\"bwalignc bwcellpmargin\">\n \n\n</p>\n\n</td>\n\n<td class=\"bwsinglebottom bwrightsingle bwpadl0 bwpadr0 bwpadb3 bwalignc bwvertalignm\" rowspan=\"1\" colspan=\"1\"><p class=\"bwcellpmargin bwalignc\">\n2,164,067\n\n</p>\n\n</td>\n\n<td class=\"bwalignc bwvertalignm\" rowspan=\"1\" colspan=\"1\"><p class=\"bwalignc bwcellpmargin\">\n \n\n</p>\n\n</td>\n\n<td class=\"bwvertalignm bwsinglebottom bwpadl0 bwrightsingle bwalignc\" rowspan=\"1\" colspan=\"1\"><p class=\"bwalignc bwcellpmargin\">\n<money>108.8 GBp</money>\n\n</p>\n\n</td>\n\n</tr>\n<tr>\n<td class=\"bwvertalignm bwrightsingle bwpadl0 bwsinglebottom bwleftsingle bwalignc\" rowspan=\"1\" colspan=\"1\"><p class=\"bwalignc bwcellpmargin\">\n1p ordinary\n\n</p>\n\n</td>\n\n<td class=\"bwalignc bwvertalignm\" rowspan=\"1\" colspan=\"1\"><p class=\"bwalignc bwcellpmargin\">\n \n\n</p>\n\n</td>\n\n<td class=\"bwvertalignm bwrightsingle bwpadl0 bwsinglebottom bwalignc\" rowspan=\"1\" colspan=\"1\"><p class=\"bwalignc bwcellpmargin\">\nCFD\n\n</p>\n\n</td>\n\n<td class=\"bwalignc bwvertalignm\" rowspan=\"1\" colspan=\"1\"><p class=\"bwalignc bwcellpmargin\">\n \n\n</p>\n\n</td>\n\n<td class=\"bwvertalignm bwrightsingle bwpadl0 bwsinglebottom bwalignc\" rowspan=\"1\" colspan=\"1\"><p class=\"bwalignc bwcellpmargin\">\nIncreasing a long position\n\n</p>\n\n</td>\n\n<td class=\"bwalignc bwvertalignm\" rowspan=\"1\" colspan=\"1\"><p class=\"bwalignc bwcellpmargin\">\n \n\n</p>\n\n</td>\n\n<td class=\"bwrightsingle bwpadl0 bwsinglebottom bwpadr0 bwpadb3 bwalignc bwvertalignm\" rowspan=\"1\" colspan=\"1\"><p class=\"bwcellpmargin bwalignc\">\n250,000\n\n</p>\n\n</td>\n\n<td class=\"bwalignc bwvertalignm\" rowspan=\"1\" colspan=\"1\"><p class=\"bwalignc bwcellpmargin\">\n \n\n</p>\n\n</td>\n\n<td class=\"bwvertalignm bwpadl0 bwsinglebottom bwrightsingle bwalignc\" rowspan=\"1\" colspan=\"1\"><p class=\"bwalignc bwcellpmargin\">\n<money>108.75 GBp</money>\n\n</p>\n\n</td>\n\n</tr>\n</table><p>\n<b>(c)</b> <b>Stock-settled derivative transactions (including options)</b>\n\n</p><p>\n<b>(i)</b> <b>Writing, selling, purchasing or varying</b>\n\n</p><table class=\"bwwidth100 bwtablemarginb\" cellspacing=\"0\">\n<tr>\n<td class=\"bwvertalignt bwsinglebottom bwrightsingle bwpadl0 bwtopsingle bwleftsingle\" rowspan=\"1\" colspan=\"1\"><p class=\"bwalignc bwcellpmargin\">\n<b>Class of relevant security</b>\n\n</p>\n\n</td>\n\n<td rowspan=\"1\" colspan=\"1\"> </td>\n<td class=\"bwvertalignt bwsinglebottom bwrightsingle bwpadl0 bwtopsingle\" rowspan=\"1\" colspan=\"1\"><p class=\"bwalignc bwcellpmargin\">\n<b>Product description </b><i>e.g. call option</i>\n\n</p>\n\n</td>\n\n<td rowspan=\"1\" colspan=\"1\"> </td>\n<td class=\"bwvertalignt bwsinglebottom bwrightsingle bwpadl0 bwtopsingle\" rowspan=\"1\" colspan=\"1\"><p class=\"bwalignc bwcellpmargin\">\n<b>Writing, purchasing, selling, varying etc.</b>\n\n</p>\n\n</td>\n\n<td rowspan=\"1\" colspan=\"1\"> </td>\n<td class=\"bwvertalignt bwsinglebottom bwrightsingle bwpadl0 bwtopsingle\" rowspan=\"1\" colspan=\"1\"><p class=\"bwalignc bwcellpmargin\">\n<b>Number of securities to which option relates</b>\n\n</p>\n\n</td>\n\n<td rowspan=\"1\" colspan=\"1\"> </td>\n<td class=\"bwvertalignt bwsinglebottom bwrightsingle bwpadl0 bwtopsingle\" rowspan=\"1\" colspan=\"1\"><p class=\"bwalignc bwcellpmargin\">\n<b>Exercise price per unit</b>\n\n</p>\n\n</td>\n\n<td rowspan=\"1\" colspan=\"1\"> </td>\n<td class=\"bwvertalignt bwsinglebottom bwrightsingle bwpadl0 bwtopsingle\" rowspan=\"1\" colspan=\"1\"><p class=\"bwalignc bwcellpmargin\">\n<b>Type</b>\n\n</p>\n\n<p class=\"bwalignc bwcellpmargin\">\n<i>e.g. American, European etc.</i>\n\n</p>\n\n</td>\n\n<td rowspan=\"1\" colspan=\"1\"> </td>\n<td class=\"bwvertalignt bwsinglebottom bwrightsingle bwpadl0 bwtopsingle\" rowspan=\"1\" colspan=\"1\"><p class=\"bwalignc bwcellpmargin\">\n<b>Expiry date</b>\n\n</p>\n\n</td>\n\n<td rowspan=\"1\" colspan=\"1\"> </td>\n<td class=\"bwvertalignt bwsinglebottom bwpadl0 bwtopsingle bwrightsingle\" rowspan=\"1\" colspan=\"1\"><p class=\"bwalignc bwcellpmargin\">\n<b>Option money paid/ received per unit</b>\n\n</p>\n\n</td>\n\n</tr>\n<tr>\n<td class=\"bwvertalignt bwrightsingle bwpadl0 bwsinglebottom bwleftsingle\" rowspan=\"1\" colspan=\"1\"><p class=\"bwcellpmargin\">\n \n\n</p>\n\n</td>\n\n<td rowspan=\"1\" colspan=\"1\"> </td>\n<td class=\"bwvertalignt bwrightsingle bwpadl0 bwsinglebottom\" rowspan=\"1\" colspan=\"1\"><p class=\"bwcellpmargin\">\n \n\n</p>\n\n</td>\n\n<td rowspan=\"1\" colspan=\"1\"> </td>\n<td class=\"bwvertalignt bwrightsingle bwpadl0 bwsinglebottom\" rowspan=\"1\" colspan=\"1\"><p class=\"bwcellpmargin\">\n \n\n</p>\n\n</td>\n\n<td rowspan=\"1\" colspan=\"1\"> </td>\n<td class=\"bwvertalignt bwrightsingle bwpadl0 bwsinglebottom\" rowspan=\"1\" colspan=\"1\"><p class=\"bwcellpmargin\">\n \n\n</p>\n\n</td>\n\n<td rowspan=\"1\" colspan=\"1\"> </td>\n<td class=\"bwvertalignt bwrightsingle bwpadl0 bwsinglebottom\" rowspan=\"1\" colspan=\"1\"><p class=\"bwcellpmargin\">\n \n\n</p>\n\n</td>\n\n<td rowspan=\"1\" colspan=\"1\"> </td>\n<td class=\"bwvertalignt bwrightsingle bwpadl0 bwsinglebottom\" rowspan=\"1\" colspan=\"1\"><p class=\"bwcellpmargin\">\n \n\n</p>\n\n</td>\n\n<td rowspan=\"1\" colspan=\"1\"> </td>\n<td class=\"bwvertalignt bwrightsingle bwpadl0 bwsinglebottom\" rowspan=\"1\" colspan=\"1\"><p class=\"bwcellpmargin\">\n \n\n</p>\n\n</td>\n\n<td rowspan=\"1\" colspan=\"1\"> </td>\n<td class=\"bwvertalignt bwpadl0 bwsinglebottom bwrightsingle\" rowspan=\"1\" colspan=\"1\"><p class=\"bwcellpmargin\">\n \n\n</p>\n\n</td>\n\n</tr>\n</table><p>\n<b>(ii)</b> <b>Exercise</b>\n\n</p><table class=\"bwwidth100 bwtablemarginb\" cellspacing=\"0\">\n<tr>\n<td class=\"bwvertalignt bwsinglebottom bwrightsingle bwpadl0 bwtopsingle bwleftsingle\" rowspan=\"1\" colspan=\"1\"><p class=\"bwalignc bwcellpmargin\">\n<b>Class of relevant security</b>\n\n</p>\n\n</td>\n\n<td rowspan=\"1\" colspan=\"1\"> </td>\n<td class=\"bwwidth20 bwvertalignt bwsinglebottom bwrightsingle bwpadl0 bwtopsingle\" rowspan=\"1\" colspan=\"1\"><p class=\"bwalignc bwcellpmargin\">\n<b>Product description</b>\n\n</p>\n\n<p class=\"bwalignc bwcellpmargin\">\n<i>e.g. call option</i>\n\n</p>\n\n</td>\n\n<td rowspan=\"1\" colspan=\"1\"> </td>\n<td class=\"bwvertalignt bwsinglebottom bwrightsingle bwpadl0 bwtopsingle\" rowspan=\"1\" colspan=\"1\"><p class=\"bwalignc bwcellpmargin\">\n<b>Exercising/ exercised against</b>\n\n</p>\n\n</td>\n\n<td rowspan=\"1\" colspan=\"1\"> </td>\n<td class=\"bwvertalignt bwsinglebottom bwrightsingle bwpadl0 bwtopsingle\" rowspan=\"1\" colspan=\"1\"><p class=\"bwalignc bwcellpmargin\">\n<b>Number of securities</b>\n\n</p>\n\n</td>\n\n<td rowspan=\"1\" colspan=\"1\"> </td>\n<td class=\"bwvertalignt bwsinglebottom bwpadl0 bwtopsingle bwrightsingle\" rowspan=\"1\" colspan=\"1\"><p class=\"bwalignc bwcellpmargin\">\n<b>Exercise price per unit</b>\n\n</p>\n\n</td>\n\n</tr>\n<tr>\n<td class=\"bwvertalignt bwrightsingle bwpadl0 bwsinglebottom bwleftsingle\" rowspan=\"1\" colspan=\"1\"><p class=\"bwcellpmargin\">\n \n\n</p>\n\n</td>\n\n<td rowspan=\"1\" colspan=\"1\"> </td>\n<td class=\"bwwidth20 bwvertalignt bwrightsingle bwpadl0 bwsinglebottom\" rowspan=\"1\" colspan=\"1\"><p class=\"bwcellpmargin\">\n \n\n</p>\n\n</td>\n\n<td rowspan=\"1\" colspan=\"1\"> </td>\n<td class=\"bwvertalignt bwrightsingle bwpadl0 bwsinglebottom\" rowspan=\"1\" colspan=\"1\"><p class=\"bwcellpmargin\">\n \n\n</p>\n\n</td>\n\n<td rowspan=\"1\" colspan=\"1\"> </td>\n<td class=\"bwvertalignt bwrightsingle bwpadl0 bwsinglebottom\" rowspan=\"1\" colspan=\"1\"><p class=\"bwcellpmargin\">\n \n\n</p>\n\n</td>\n\n<td rowspan=\"1\" colspan=\"1\"> </td>\n<td class=\"bwvertalignt bwpadl0 bwsinglebottom bwrightsingle\" rowspan=\"1\" colspan=\"1\"><p class=\"bwcellpmargin\">\n \n\n</p>\n\n<p class=\"bwcellpmargin\">\n \n\n</p>\n\n</td>\n\n</tr>\n</table><p>\n<b>(d)</b> <b>Other dealings (including subscribing for new securities)</b>\n\n</p><table class=\"bwwidth100 bwtablemarginb\" cellspacing=\"0\">\n<tr>\n<td class=\"bwvertalignt bwsinglebottom bwrightsingle bwpadl0 bwtopsingle bwleftsingle\" rowspan=\"1\" colspan=\"1\"><p class=\"bwalignc bwcellpmargin\">\n<b>Class of relevant security</b>\n\n</p>\n\n</td>\n\n<td rowspan=\"1\" colspan=\"1\"> </td>\n<td class=\"bwvertalignt bwsinglebottom bwrightsingle bwpadl0 bwtopsingle\" rowspan=\"1\" colspan=\"1\"><p class=\"bwalignc bwcellpmargin\">\n<b>Nature of dealing</b>\n\n</p>\n\n<p class=\"bwalignc bwcellpmargin\">\n<i>e.g. subscription, conversion</i>\n\n</p>\n\n</td>\n\n<td rowspan=\"1\" colspan=\"1\"> </td>\n<td class=\"bwvertalignt bwsinglebottom bwrightsingle bwpadl0 bwtopsingle\" rowspan=\"1\" colspan=\"1\"><p class=\"bwalignc bwcellpmargin\">\n<b>Details</b>\n\n</p>\n\n</td>\n\n<td rowspan=\"1\" colspan=\"1\"> </td>\n<td class=\"bwvertalignt bwsinglebottom bwpadl0 bwtopsingle bwrightsingle\" rowspan=\"1\" colspan=\"1\"><p class=\"bwalignc bwcellpmargin\">\n<b>Price per unit (if applicable)</b>\n\n</p>\n\n</td>\n\n</tr>\n<tr>\n<td class=\"bwvertalignt bwrightsingle bwpadl0 bwsinglebottom bwleftsingle\" rowspan=\"1\" colspan=\"1\"><p class=\"bwcellpmargin\">\n \n\n</p>\n\n</td>\n\n<td rowspan=\"1\" colspan=\"1\"> </td>\n<td class=\"bwvertalignt bwrightsingle bwpadl0 bwsinglebottom\" rowspan=\"1\" colspan=\"1\"><p class=\"bwcellpmargin\">\n \n\n</p>\n\n<p class=\"bwcellpmargin\">\n \n\n</p>\n\n</td>\n\n<td rowspan=\"1\" colspan=\"1\"> </td>\n<td class=\"bwvertalignt bwrightsingle bwpadl0 bwsinglebottom\" rowspan=\"1\" colspan=\"1\"><p class=\"bwcellpmargin\">\n \n\n</p>\n\n</td>\n\n<td rowspan=\"1\" colspan=\"1\"> </td>\n<td class=\"bwvertalignt bwpadl0 bwsinglebottom bwrightsingle\" rowspan=\"1\" colspan=\"1\"><p class=\"bwcellpmargin\">\n \n\n</p>\n\n</td>\n\n</tr>\n</table><p>\n<b>4.</b> <b>OTHER INFORMATION</b>\n\n</p><p>\n<b>(a)</b> <b>Indemnity and other dealing arrangements</b>\n\n</p><table class=\"bwwidth100 bwtablemarginb\" cellspacing=\"0\">\n<tr>\n<td class=\"bwwidth100 bwvertalignt bwsinglebottom bwpadl0 bwtopsingle bwleftsingle bwrightsingle\" rowspan=\"1\" colspan=\"1\"><p class=\"bwcellpmargin\">\n<b>Details of any indemnity or option arrangement, or any agreement or understanding, formal or informal, relating to relevant securities which may be an inducement to deal or refrain from dealing entered into by the person making the disclosure and any party to the offer or any person acting in concert with a party to the offer:</b>\n\n</p>\n\n<p class=\"bwcellpmargin\">\n<i>Irrevocable commitments and letters of intent should not be included. If there are no such agreements, arrangements or understandings, state “none”</i>\n\n</p>\n\n</td>\n\n</tr>\n<tr>\n<td class=\"bwwidth100 bwvertalignt bwpadl0 bwsinglebottom bwleftsingle bwrightsingle\" rowspan=\"1\" colspan=\"1\"><p class=\"bwcellpmargin\">\n \n\n</p>\n\n<p class=\"bwcellpmargin\">\nNone\n\n</p>\n\n<p class=\"bwcellpmargin\">\n \n\n</p>\n\n</td>\n\n</tr>\n</table><p>\n<b>(b)</b> <b>Agreements, arrangements or understandings relating to options or derivatives</b>\n\n</p><table class=\"bwwidth100 bwtablemarginb\" cellspacing=\"0\">\n<tr>\n<td class=\"bwwidth100 bwvertalignt bwsinglebottom bwpadl0 bwtopsingle bwleftsingle bwrightsingle\" rowspan=\"1\" colspan=\"1\"><p class=\"bwcellpmargin\">\n<b>Details of any agreement, arrangement or understanding, formal or informal, between the person making the disclosure and any other person relating to:</b>\n\n</p>\n\n<p class=\"bwcellpmargin\">\n<b>(i)</b> <b>the voting rights of any relevant securities under any option; or</b>\n\n</p>\n\n<p class=\"bwcellpmargin\">\n<b>(ii)</b> <b>the voting rights or future acquisition or disposal of any relevant securities to which any derivative is referenced:</b>\n\n</p>\n\n<p class=\"bwcellpmargin\">\n<i>If there are no such agreements, arrangements or understandings, state “none”</i>\n\n</p>\n\n</td>\n\n</tr>\n<tr>\n<td class=\"bwwidth100 bwvertalignt bwpadl0 bwsinglebottom bwleftsingle bwrightsingle\" rowspan=\"1\" colspan=\"1\"><p class=\"bwcellpmargin\">\n \n\n</p>\n\n<p class=\"bwcellpmargin\">\nNone\n\n</p>\n\n<p class=\"bwcellpmargin\">\n \n\n</p>\n\n</td>\n\n</tr>\n</table><p>\n<b>(c)</b> <b>Attachments</b>\n\n</p><table class=\"bwwidth100 bwtablemarginb\" cellspacing=\"0\">\n<tr>\n<td class=\"bwvertalignt bwrightsingle bwpadl0 bwtopsingle bwsinglebottom bwleftsingle\" rowspan=\"1\" colspan=\"1\"><p class=\"bwcellpmargin\">\n<b>Is a Supplemental Form 8 (Open Positions) attached?</b>\n\n</p>\n\n</td>\n\n<td rowspan=\"1\" colspan=\"1\"> </td>\n<td class=\"bwvertalignm bwpadl0 bwtopsingle bwsinglebottom bwrightsingle\" rowspan=\"1\" colspan=\"1\"><p class=\"bwalignc bwcellpmargin\">\nNo\n\n</p>\n\n</td>\n\n</tr>\n</table><table cellspacing=\"0\" class=\"bwtablemarginb bwwidth100\">\n<tr>\n<td class=\"bwvertalignt bwsinglebottom bwrightsingle bwpadl0 bwtopsingle bwleftsingle bwwidth54\" rowspan=\"1\" colspan=\"1\"><p class=\"bwcellpmargin\">\nDate of disclosure:\n\n</p>\n\n</td>\n\n<td rowspan=\"1\" colspan=\"1\"> </td>\n<td class=\"bwvertalignm bwsinglebottom bwpadl0 bwtopsingle bwrightsingle bwwidth46\" rowspan=\"1\" colspan=\"1\"><p class=\"bwcellpmargin\">\n<chron>26 February 2026</chron>\n\n</p>\n\n</td>\n\n</tr>\n<tr>\n<td class=\"bwvertalignt bwsinglebottom bwrightsingle bwpadl0 bwleftsingle bwwidth54\" rowspan=\"1\" colspan=\"1\"><p class=\"bwcellpmargin\">\nContact name:\n\n</p>\n\n</td>\n\n<td rowspan=\"1\" colspan=\"1\"> </td>\n<td class=\"bwvertalignm bwsinglebottom bwpadl0 bwrightsingle bwwidth46\" rowspan=\"1\" colspan=\"1\"><p class=\"bwcellpmargin\">\n<person>James Evans</person>\n\n</p>\n\n</td>\n\n</tr>\n<tr>\n<td class=\"bwvertalignt bwrightsingle bwpadl0 bwsinglebottom bwleftsingle bwwidth54\" rowspan=\"1\" colspan=\"1\"><p class=\"bwcellpmargin\">\nTelephone number:\n\n</p>\n\n</td>\n\n<td rowspan=\"1\" colspan=\"1\"> </td>\n<td class=\"bwvertalignm bwpadl0 bwsinglebottom bwrightsingle bwwidth46\" rowspan=\"1\" colspan=\"1\"><p class=\"bwcellpmargin\">\n+44 20 3161 0743\n\n</p>\n\n</td>\n\n</tr>\n</table><p>\n<i>Public disclosures under Rule 8 of the Code must be made to a <org>Regulatory Information Service</org>.</i>\n\n</p><p>\n<i>The Panel’s Market Surveillance Unit is available for consultation in relation to the Code’s disclosure requirements on +44 (0)20 7638 0129.</i>\n\n</p><p>\n<i>*If the discloser is a natural person, a telephone number does not need to be included, provided contact information has been provided to the Panel’s Market Surveillance Unit.</i>\n\n</p><p>\n<i>The Code can be viewed on the Panel’s website at www.thetakeoverpanel.org.uk.</i>\n\n</p><p><img alt=\"\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20260226617741r1&amp;sid=acqr8&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\" /><span class=\"bwct31415\" /></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\">https://www.businesswire.com/news/home/20260226617741/en/</span></p>\n<p>Source: <org>Sand Grove Capital Management LLP</org></p>\n",
            "link": "https://www.fidelity.com/news/article/mergers-and-acquisitions/202602261000BIZWIRE_USPR_____20260226_BW617741",
            "pub_date": "2026-02-26 23:00:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "SR Aviation Infrastructure Acquires Republic Jet Center and Stratosphere Development, 50+ Acre Development Site in Farmingdale, NY",
            "description": "\n<div class=\"xn-content\">\n<p class=\"prntac\"><i>SRAI plans to complete the development plans for state-of-the-art hangar facility at a leading NY-region private airport</i></p><p><span class=\"legendSpanClass\"><location value=\"LU/us.ny.nyc\" idsrc=\"xmltag.org\" >NEW YORK</location></span>, <span class=\"legendSpanClass\"><chron>Feb. 26, 2026</chron></span> /PRNewswire/ --<b> SR Aviation Infrastructure (\"SRAI\")</b>, a subsidiary of <location value=\"LU/us.ny.nyc\" idsrc=\"xmltag.org\" >New York</location>- and <location value=\"LU/us.tn.nashvl\" idsrc=\"xmltag.org\" >Nashville</location>-based real estate investment and development firm SomeraRoad, announced the acquisition of <org>Republic Jet Center</org> and <org>Stratosphere Development</org> at <location>Farmingdale Republic Airport</location> (FRG) in <location value=\"LU/us.ny.farale\" idsrc=\"xmltag.org\" >Farmingdale, New York</location>, encompassing over 50 acres of developable land. SRAI plans to complete the approved development plans to deliver high-quality hangar space in one of the most premier and supply-constrained aviation markets in <location value=\"LC/us\" idsrc=\"xmltag.org\" >the United States</location>.</p>\n    <div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder1\">\n                <p>\n\n                    <img src=\"https://mma.prnewswire.com/media/2920689/SomeraRoad__SRAI_Farmingdale.jpg\" title=\"SRAI Farmingdale rendering.\" alt=\"SRAI Farmingdale rendering.\" />\n\n                </p>\n    </div>\n<p>\"<location value=\"LU/us.ny.farale\" idsrc=\"xmltag.org\" >Farmingdale</location> represents a significant growth milestone for SRAI and marks the expansion of our national portfolio into one of the country's most dynamic private aviation markets,\" said <person>Jonathon Reeser</person>, President of SRAI. \"This project reflects our commitment to acquiring and developing best-in-class hangar facilities at strategically located airports nationwide. <location value=\"LU/us.ny.farale\" idsrc=\"xmltag.org\" >Farmingdale</location> is one of the most important private aviation airports in the <location value=\"LU/us.ny.nyc\" idsrc=\"xmltag.org\" >New York</location> metro area and represents a pivotal step in SRAI's continued growth and leadership in the general aviation infrastructure sector.\"</p><p><location>Republic Airport</location> is a leading option for business aviation activity in the <location value=\"LU/us.ny.nyc\" idsrc=\"xmltag.org\" >New York City</location> metropolitan area and is strategically positioned to relieve pressure from increasing congestion, limited capacity, and persistent delays at competing airports such as <location>Teterboro Airport</location> and <location>Westchester County Airport</location>. The multi-phase development will deliver a best-in-class hangar facility with modern amenities and 28-foot hangar door heights designed to accommodate the most modern, state-of-the-art private jets, improving operational efficiency and raising the standard for private aviation infrastructure at the airport and across the region.</p><p>\"<location value=\"LU/us.ny.farale\" idsrc=\"xmltag.org\" >Farmingdale</location> represents a rare and strategic opportunity for SRAI, positioning the platform in one of the strongest private aviation markets in the country with a unique opportunity for new construction,\" said Monte Koch<b>,</b> Senior Advisor of SRAI. \"As demand for private and business aviation continues to surge, accessible hangar space in the <location value=\"LU/us.ny.nyc\" idsrc=\"xmltag.org\" >New York</location> region has become extraordinarily scarce. By delivering purpose-built, modern hangars at <location value=\"LU/us.ny.farale\" idsrc=\"xmltag.org\" >Farmingdale</location>, SRAI is not only addressing a critical infrastructure gap but will also set a new benchmark for quality and operational sophistication in one of the nation's busiest aviation corridors.\"</p><p>SRAI is an investment platform focused on the acquisition, development, and leasing of aviation-related real estate, including hangar space for based aircraft, corporate flight departments, government entities, FBOs, MROs, flight schools, charter, and management companies across <location value=\"LC/us\" idsrc=\"xmltag.org\" >the United States</location>. The platform addresses the supply–demand imbalance in aviation real estate and is building an institutional portfolio of high-quality assets. Current holdings include SRAI Las Vegas in <location value=\"LU/us.nv.lasveg\" idsrc=\"xmltag.org\" >Las Vegas, Nevada</location>; SRAI San Antonio in <location value=\"LU/us.tx.sanant\" idsrc=\"xmltag.org\" >San Antonio, Texas</location>; and SRAI Bozeman in <location value=\"LU/us.mt.bozman\" idsrc=\"xmltag.org\" >Bozeman, Montana</location>.</p><p>For more information on SRAI, please visit sraviationinfrastructure.com. For more information on SomeraRoad, please visit www.someraroadinc.com.</p><p>SRAI Farmingdale<br />7160 <location>Republic Airport</location><br /><location value=\"LU/us.ny.farale\" idsrc=\"xmltag.org\" >Farmingdale, NY</location> 11735</p><p><b><u>Media Contact <br /></u></b><person>Caroline Stephens</person><br />SomeraRoad, Director of Communications<br /><u>caroline@someraroadinc.com</u> </p>\n<div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder2\">\n                <p>\n\n                    <img src=\"https://mma.prnewswire.com/media/2560764/SRAI_Logo_Logo_V1.jpg\" title=\"SR Aviation Infrastructure logo (PRNewsfoto/SomeraRoad)\" alt=\"SR Aviation Infrastructure logo (PRNewsfoto/SomeraRoad)\" />\n\n                </p>\n</div>\n\n\n\n<p id=\"PURL\"><img title=\"Cision\" width=\"12\" height=\"12\" alt=\"Cision\" src=\"https://edge.prnewswire.com/c/img/favicon.png?sn=NY96170&amp;sd=2026-02-26\" /> View original content to download multimedia:https://www.prnewswire.com/news-releases/sr-aviation-infrastructure-acquires-republic-jet-center-and-stratosphere-development-50-acre-development-site-in-farmingdale-ny-302697827.html</p><p>SOURCE SomeraRoad</p></div>\n",
            "link": "https://www.fidelity.com/news/article/mergers-and-acquisitions/202602261000PR_NEWS_USPR_____NY96170",
            "pub_date": "2026-02-26 23:00:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US STOCKS SNAPSHOT-S&P 500 opens subdued as Nvidia's strong results draw muted reaction",
            "description": "\n<p><chron>Feb 26</chron> (Reuters) - The S&amp;P 500 and the Nasdaq were muted\nat the open on Thursday, as Nvidia's stellar earnings garnered a\ntepid reception, while broader technology stocks lost ground as\ninvestors assessed risks to the AI trade.</p>\n<p>The Dow Jones Industrial Average rose 62.4 points, or\n0.13%, at the open to 49,544.58. The S&amp;P 500 fell 1.4\npoints, or 0.02%, at the open to 6,944.74​, while the Nasdaq\nComposite dropped 51.5 points, or 0.22%, to 23,100.583\nat the opening bell.\n(Reporting by <person>Shashwat Chauhan</person> in Bengaluru; Editing by Devika\nSyamnath)</p>\n",
            "link": "https://www.fidelity.com/news/article/us-markets/202602260934RTRSNEWSCOMBINED_L4N3ZM1GT_1",
            "pub_date": "2026-02-26 22:34:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Quantum Computing Acceleration is Unlocking New Era of Autonomous Drone Efficiency",
            "description": "\n<p><location value=\"LU/us.ny.nyc\" idsrc=\"xmltag.org\" >NEW YORK</location>, <chron>Feb.  26, 2026</chron>  (GLOBE NEWSWIRE) -- Market News Updates News Commentary - Quantum computing is starting to play a meaningful role in improving how drones operate, especially when it comes to planning and real-time decision-making. Drone missions involve thousands of moving parts — weather, airspace rules, terrain, battery life, payload weight, and changing objectives. Traditional computers process these variables step by step, which can slow things down as operations scale. Quantum computing, however, is designed to evaluate many possibilities at once, helping operators find faster, more efficient routes and better mission plans. For investors, that means lower operating costs, faster execution, and more productive drone deployments.   Active Companies in the <org value=\"QUBT.NaE\" idsrc=\"xmltag.org\" >Quantum Computing</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='QUBT' fmr-param-security-type='Equity'>( QUBT )</span>, Drone and UAV industries looking for the latest opportunities may include <strong><org value=\"ZENA.NaE\" idsrc=\"xmltag.org\" >ZenaTech, Inc.</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='ZENA' fmr-param-security-type='Equity'>( ZENA )</span></strong> , <strong><org value=\"QUBT.NaE\" idsrc=\"xmltag.org\" >Quantum Computing Inc.</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='QUBT' fmr-param-security-type='Equity'>( QUBT )</span> </strong>, <strong><org value=\"RGTI.NaE\" idsrc=\"xmltag.org\" >Rigetti Computing, Inc.</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='RGTI' fmr-param-security-type='Equity'>( RGTI )</span> </strong>, <strong><org value=\"QBTS.NaE\" idsrc=\"xmltag.org\" >D-Wave Quantum Inc.</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='QBTS' fmr-param-security-type='Equity'>( QBTS )</span> </strong>, <strong><org value=\"IONQ.NaE\" idsrc=\"xmltag.org\" >IonQ</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='IONQ' fmr-param-security-type='Equity'>( IONQ )</span> </strong>.</p>  <p>The impact becomes even more important when managing fleets or swarms of drones. Coordinating dozens — or even hundreds — of autonomous aircraft creates incredibly complex optimization challenges. Quantum-enhanced algorithms can help determine which drone should go where, how to avoid collisions, and how to conserve energy in real time — all while adjusting to unexpected changes. That improves safety, increases uptime, and allows operators to scale operations without dramatically increasing overhead. In defense, logistics, and infrastructure inspection, that kind of efficiency can be a major competitive advantage and a differentiator in securing long-term contracts.</p>  <p>From an investment standpoint, this is where two high-growth industries intersect: drones and quantum computing. The global quantum computing market is projected to grow from around <money>USD 1.4 billion</money> in 2025 to nearly <money>USD 19.4 billion</money> by 2035, with sustained double-digit CAGR, according to recent forecasts. As enterprises and government agencies pour more into quantum R&amp;D and cloud-based access expands, the technology’s ability to solve complex optimization and AI problems will only strengthen. For investors, companies that successfully combine quantum-driven optimization with scalable drone platforms could offer differentiated performance, stronger contract wins, and exposure to two rapidly expanding markets.</p>  <p><strong>ZenaTech’s ZenaDrone Initiates Defense-focused Quantum Navigation System for GPS-Denied Drone Operations</strong><strong><em> - </em></strong><org value=\"ZENA.NaE\" idsrc=\"xmltag.org\" >ZenaTech, Inc.</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='ZENA' fmr-param-security-type='Equity'>( ZENA )</span>  (FSE: 49Q) (BMV: ZENA) (&quot;ZenaTech&quot;), a technology solution provider specializing in AI (Artificial Intelligence) drone, Drone as a Service (DaaS), enterprise SaaS, and <org value=\"QUBT.NaE\" idsrc=\"xmltag.org\" >Quantum Computing</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='QUBT' fmr-param-security-type='Equity'>( QUBT )</span> solutions, announces that its drone subsidiary ZenaDrone has initiated the development of a quantum navigation system designed to enable secure drone operations in GPS-denied and satellite-compromised environments. The system will initially support ZenaDrone 1000, the company’s multifunction heavy-lift drone for use in defense applications including ISR (Intelligence, Surveillance and Reconnaissance), specialized cargo, and border patrol. Future scalability is also planned across the company’s IQ series drone platforms.</p>  <p>“The ability to operate autonomously in GPS-denied environments is an operational imperative for modern defense,” said <person>Shaun Passley</person>, Ph.D., <org value=\"ZENA.NaE\" idsrc=\"xmltag.org\" >ZenaTech</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='ZENA' fmr-param-security-type='Equity'>( ZENA )</span> CEO. “We are committed to supporting U.S. defense and national security interests with technology that performs where conventional systems fail. We see quantum navigation as a cornerstone capability that will define the next generation of autonomous systems for defense, and we are making the strategic investments in the R&amp;D needed to enable our future leadership as the industry evolves.”</p>  <p>Quantum navigation systems are considered next-generation, self-contained and ultra-precise motion sensing systems that enable reliable navigation without GPS by using quantum physics–based principles and sensors. As defense operational landscapes evolve, defense missions increasingly face environments where GPS and satellite signals cannot be relied upon, whether due to jamming, spoofing, or other contested conditions. These navigation systems fuse quantum inertial measurement with AI-driven path correction, enabling sustained and accurate positioning over extended mission periods without reliance on external signals. Quantum navigation can also benefit commercial drones operating in GPS-challenged environments such as in dense urban corridors, indoor industrial facilities, underground sites, and long-range BVLOS (Beyond Visual Line-of-Sight) missions.</p>  <p>The Company’s R&amp;D team is at the initial stages of development focused on incorporating this capability into the ZenaDrone 1000, and management expects to advance through research and development, drone integration, and testing phases which will involve multifunctional teams in due time. The quantum navigation system is expected to be integrated into ZenaDrone’s defense and commercial drone platforms, enhancing capabilities for surveillance, critical infrastructure inspection, and defense missions.</p>  <p>The ZenaDrone 1000 is engineered as an advanced AI-powered VTOL heavy-lift platform optimized for defense use, offering ISR capabilities including real-time surveillance, tactical reconnaissance, and secure data collection, alongside cargo transport and mission-critical payload delivery. Its modular design allows rapid configuration for multi-mission operations in high-risk environments, from infrastructure monitoring to operational logistics support. <strong><em>Continued…</em></strong> <strong>Read this full release and additional news for ZENA by visiting: </strong>https://www.zenatech.com/newsroom/</p>  <p><em>In other <org value=\"QUBT.NaE\" idsrc=\"xmltag.org\" >Quantum Computing</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='QUBT' fmr-param-security-type='Equity'>( QUBT )</span>/UAV/Drone industry news of note:</em></p>  <p><strong><org value=\"QUBT.NaE\" idsrc=\"xmltag.org\" >Quantum Computing Inc.</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='QUBT' fmr-param-security-type='Equity'>( QUBT )</span> ,</strong> an innovative, quantum optics and integrated photonics technology company, recently announced the completion of acquiring <org>Luminar Semiconductor, Inc.</org> (&quot;LSI&quot;), a wholly owned subsidiary of Luminar Technologies, Inc. (&quot;Luminar&quot;) (LAZR), in an all-cash transaction valued at <money>$110 million</money> (the &quot;Transaction&quot;).</p>  <p>The acquisition represents a significant milestone in QCi's strategy to build a vertically integrated, product-driven photonics and quantum technology platform. The acquisition supports the Company's long-term strategic roadmap and is expected to add annual revenue to QCi's financial profile.</p>  <p>Rigetti Computing India P L, a wholly owned subsidiary of <strong><org value=\"RGTI.NaE\" idsrc=\"xmltag.org\" >Rigetti Computing, Inc.</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='RGTI' fmr-param-security-type='Equity'>( RGTI )</span> ,</strong> a pioneer in full-stack quantum-classical computing, recently announced that it has received an <money>$8.4 million</money> purchase order to deliver a 108-qubit quantum computer to the <org>Centre for Development of Advanced Computing</org> (C-DAC), India’s premier R&amp;D organization of the <org>Ministry of Electronics and Information Technology</org>. The system will be installed on-premises at C-DAC’s Bengaluru center and is scheduled to be deployed in the second half of 2026.</p>  <p>The system includes Rigetti’s proprietary chiplet-based architecture, which is the foundation of Rigetti’s path to scaling to extremely high qubit count systems required for error correction and fault-tolerant quantum computing.</p>  <p><strong><org value=\"QBTS.NaE\" idsrc=\"xmltag.org\" >D-Wave Quantum Inc.</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='QBTS' fmr-param-security-type='Equity'>( QBTS )</span> ,</strong> the only dual-platform quantum computing company, providing both annealing and gate-model systems, software and services, recently joined the Southeastern Quantum Collaborative (SQC) as an inaugural member, along with <org>The University of Alabama</org> in <location value=\"LU/us.al.hunlle\" idsrc=\"xmltag.org\" >Huntsville</location>, Davidson Technologies, IBM and <org>Alabama A&amp;M University</org>.</p>  <p>The SQC will bring together academia, industry and government to accelerate the advancement and application of quantum information science and technology across the Southeast. In addition, it aims to develop the quantum-ready workforce needed to commercialize the technology. Given Davidson hosts a D-Wave Advantage2TM system at its headquarters in <location value=\"LU/us.al.hunlle\" idsrc=\"xmltag.org\" >Huntsville, Alabama</location>, D-Wave is well positioned to support the SQC's quantum workforce development efforts.</p>  <p><strong><org value=\"IONQ.NaE\" idsrc=\"xmltag.org\" >IonQ</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='IONQ' fmr-param-security-type='Equity'>( IONQ )</span> </strong> recently announced it was awarded a contract under the Missile Defense Agency Scalable Homeland Innovative Enterprise Layered Defense (SHIELD) indefinite-delivery/indefinite-quantity (IDIQ) contract with a ceiling of <money>$151 billion</money>. This contract encompasses a broad range of work areas that allows for the rapid delivery of innovative capabilities to the warfighter with increased speed and agility.</p>  <p><org value=\"IONQ.NaE\" idsrc=\"xmltag.org\" >IonQ</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='IONQ' fmr-param-security-type='Equity'>( IONQ )</span> is among more than 2,400 companies eligible to compete for future task orders issued under the SHIELD IDIQ contract framework.</p>  <p><org value=\"IONQ.NaE\" idsrc=\"xmltag.org\" >IonQ</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='IONQ' fmr-param-security-type='Equity'>( IONQ )</span> delivers a full portfolio of quantum technologies spanning quantum computing, quantum networking, quantum sensing, and quantum security. The company also includes subsidiaries with established capabilities across space-based intelligence, secure communications, and precision timing technologies.</p>  <p>DISCLAIMER: MarketNewsUpdates.com (MNU) is a third party publisher and news dissemination service provider, which disseminates electronic information through multiple online media channels. MNU is NOT affiliated in any manner with any company mentioned herein. MNU and its affiliated companies are a news dissemination solutions provider and are NOT a registered broker/dealer/analyst/adviser, holds no investment licenses and may NOT sell, offer to sell or offer to buy any security. MNU’S market updates, news alerts and corporate profiles are NOT a solicitation or recommendation to buy, sell or hold securities.  The material in this release is intended to be strictly informational and is NEVER to be construed or interpreted as research material.  All readers are strongly urged to perform research and due diligence on their own and consult a licensed financial professional before considering any level of investing in stocks.  All material included herein is republished content and details which were previously disseminated by the companies mentioned in this release. MNU is not liable for any investment decisions by its readers or subscribers.  Investors are cautioned that they may lose all or a portion of their investment when investing in stocks. <strong>This press release was distributed on behalf of </strong><strong><org value=\"ZENA.NaE\" idsrc=\"xmltag.org\" >ZenaTech, Inc.</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='ZENA' fmr-param-security-type='Equity'>( ZENA )</span></strong> For current services performed MNU expects to be compensated <money>forty six hundred dollars</money> for news coverage of the current press releases issued by <org value=\"ZENA.NaE\" idsrc=\"xmltag.org\" >ZenaTech, Inc.</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='ZENA' fmr-param-security-type='Equity'>( ZENA )</span> by the Company. MNU HOLDS NO SHARES OF ANY COMPANY NAMED IN THIS RELEASE</p>  <p>This release contains &quot;forward-looking statements&quot; within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E the Securities Exchange Act of 1934, as amended and such forward-looking statements are made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995. &quot;Forward-looking statements&quot; describe future expectations, plans, results, or strategies and are generally preceded by words such as &quot;may&quot;, &quot;future&quot;, &quot;plan&quot; or &quot;planned&quot;, &quot;will&quot; or &quot;should&quot;, &quot;expected,&quot; &quot;anticipates&quot;, &quot;draft&quot;, &quot;eventually&quot; or &quot;projected&quot;. You are cautioned that such statements are subject to a multitude of risks and uncertainties that could cause future circumstances, events, or results to differ materially from those projected in the forward-looking statements, including the risks that actual results may differ materially from those projected in the forward-looking statements as a result of various factors, and other risks identified in a company's annual report on Form 10-K or 10-KSB and other filings made by such company with the <org>Securities and Exchange Commission</org>. You should consider these factors in evaluating the forward-looking statements included herein, and not place undue reliance on such statements. The forward-looking statements in this release are made as of the date hereof and MNU undertakes no obligation to update such statements.</p>  <p>Contact Information:</p>  <p>Media Contact email: editor@marketnewsupdates.com - +1(561)486-1799</p>  <p>SOURCE: MarketNewsUpdates.com</p>  Image: https://www.globenewswire.com/newsroom/ti?nf=OTY2MjA4NCM3NDU3MDQ4IzUwMDE1MzIxMQ==  <br/> Image: https://ml.globenewswire.com/media/MDFjY2ZlMjEtYzBiMS00Mzc3LTlhNzAtMzZhYmVmMzUxNDI5LTUwMDE1MzIxMS0yMDI2LTAyLTI2LWVu/tiny/MarketNewsUpdates-com.png <p> Image: Primary Logo </p>\nSource: MarketNewsUpdates.com\n",
            "link": "https://www.fidelity.com/news/article/technology/202602260945PRIMZONEFULLFEED9662084",
            "pub_date": "2026-02-26 22:45:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "U.S. shows ISAC leadership as Ericsson demonstrates breakthrough drone detection proof of concept at Texas headquarters",
            "description": "\n<div class=\"xn-content\">\n<ul type=\"disc\"><li>The proof of concept integrates sensing and spatial location of passive objects into mobile networks, proving 5G technology's ability to sense its surroundings using telecommunications infrastructure</li><li>Wide-area network sensing augments local sensors for UAV/airspace safety, transportation assistance, and industrial protection, and can enhance network performance</li><li>Ericsson's ISAC (Integrated Sensing and Communication) technology creates opportunities for commercial, public safety and defense use cases across the industry</li></ul><p><span class=\"legendSpanClass\"><location value=\"LU/us.tx.plano\" idsrc=\"xmltag.org\" >PLANO, Texas</location></span>, <span class=\"legendSpanClass\"><chron>Feb. 26, 2026</chron></span> /PRNewswire/ -- Ericsson today announced a successful live proof of concept of its ISAC (Integrated Sensing and Communication) technology at the company's U.S. Headquarters in <location value=\"LU/us.tx.plano\" idsrc=\"xmltag.org\" >Plano, Texas</location>, signaling a major step forward in the evolution of networks that both connect and sense the world around them. The live proof of concept centered on drone detection using Ericsson's massive-MIMO radios, showcasing the network's ability to track unmanned aerial vehicles (UAVs) within surrounding airspace.</p>\n    <div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder1\">\n                <p>\n\n                    <img src=\"https://mma.prnewswire.com/media/2920978/Ericsson_Drone_ISAC.jpg\" title=\"ISAC is an innovative technology that enables use cases across commercial, public safety and defense scenarios, enabling faster adoption of new emerging technologies like autonomous systems and drone delivery in commercial settings.\" alt=\"ISAC is an innovative technology that enables use cases across commercial, public safety and defense scenarios, enabling faster adoption of new emerging technologies like autonomous systems and drone delivery in commercial settings.\" />\n\n                </p>\n    </div>\n<p>This proof of concept demonstrates that the US is a global leader in ISAC technology which enhances national security, optimizes spectrum use, and drives economic growth. ISAC is an innovative technology that enables use cases across commercial, public safety and defense scenarios, enabling faster adoption of new emerging technologies like autonomous systems and drone delivery in commercial settings. From a defense scenario, it augments national security and provides an additional layer of safety.</p><p>ISAC integrates sensing and spatial location of passive (not connected) objects into the mobile communication network - extending network functionality beyond connectivity by enabling the detection and characterization of objects and movement using existing infrastructure. The capability is progressing in 3GPP with initial studies in Release 19 and is expected to form part of early 6G standardization, showing the foundation for broad, scalable sensing applications.</p><p>\"ISAC represents a transformative leap forward, merging advanced communications and sensing capabilities into a unified platform,\" said Dr. <person>Tom Rondeau</person>, Principal Director for the DoW's FutureG Office. \"By using communication signals to sense the physical world in real-time, ISAC gives wireless networks a new dimension of environmental awareness, enabling groundbreaking applications that advance both U.S. national security and commercial interests, and solidifying America's leadership in the race to 6G.\"</p><p>\"Today, we showed how ISAC can unlock a new class of applications - from safer skies to smarter cities - by introducing a powerful new sensing platform as an added layer to the existing telecom network,\" said <person>Yossi Cohen</person>, President and CEO of Ericsson Americas. \"By transforming deployed radio sites and spectrum to support both communications and sensing, we give networks the ability to truly perceive their surroundings. We can introduce these capabilities efficiently and responsibly, accelerating time to value for operators and their customers. As a trusted supplier and long-term partner worldwide, Ericsson brings the scale, reliability, and security to help service providers realize these benefits from day one.\"</p><p>During this proof of concept, Ericsson engineers showcased how network-based sensing supports use cases such as drone detection and airspace safety. We continue to explore how sensing can be used for automotive and transportation assistance; industrial automation and worker protection - use cases that benefit from the network's wide-area perspective and ability to \"see around corners.\"</p><p>Why it matters:</p><ul type=\"disc\"><li>Safer, smarter infrastructure: Network-based sensing can support use cases by augmenting local sensors with wide-area network awareness.</li><li>Efficient path to scale: ISAC is designed to reuse existing mobile network sites, spectrum, and hardware, enabling pragmatic introduction and coverage at scale.</li><li>Road to 6G: 3GPP studies have begun, with ISAC poised to become a foundational capability in the 6G era.</li></ul><p>The proof of concept underscores Ericsson's commitment to advancing 6G-era capabilities and collaborating with the broader ecosystem to validate real-world scenarios and deployment approaches across sites, spectrum, and hardware integration levels.</p><p><b>Ericsson in <location value=\"LC/us\" idsrc=\"xmltag.org\" >the United States</location></b></p><p>Ericsson has operated in the US for more than 120 years and continues to expand its footprint across research, manufacturing, and operations. The company employes more than 6,000 people across the country and operates 12 R&amp;D centers focused on AI, <span>ASIC</span> design, and antenna systems. Its U.S. headquarters in <location value=\"LU/us.tx.plano\" idsrc=\"xmltag.org\" >Plano, Texas</location>, serves as a major hub for advanced wireless R&amp;D, standards development, and customer engagement.</p><p>Ericsson also currently manufactures advanced 5G radios and RAN compute systems at its 5G <org>USA Smart Factory</org> in <location value=\"LU/us.tx.lewlle\" idsrc=\"xmltag.org\" >Lewisville, Texas</location> – one of the most advanced telecom manufacturing facilities in the country. Ericsson has invested more than <money>$150 million</money> in the factory and is the only manufacturer making telecom equipment at scale in the US. The highly automated, 300,000-square-foot facility supports more than 550 US manufacturing jobs and strengthens secure, resilient domestic supply chains. As 6G technology matures, Ericsson plans to build-on this US-based manufacturing foundation to support future deployments.</p><p>NOTES TO EDITORS:</p><p>FOLLOW US:</p><p>Subscribe to Ericsson press releases<br />Subscribe to Ericsson blog posts<br />https://x.com/ericsson <br />https://www.facebook.com/ericsson <br />https://www.linkedin.com/company/ericsson</p><p>MORE INFORMATION AT:<br />Ericsson Newsroom<br />media.relations@ericsson.com<br />investor.relations@ericsson.com</p><p>ABOUT ERICSSON:<br />Ericsson's high-performing, programmable networks provide connectivity for billions of people every day. For 150 years, we've been pioneers in creating technology for communication. We offer mobile communication and connectivity solutions for service providers and enterprises. Together with our customers and partners, we make the digital world of tomorrow a reality. www.ericsson.com</p><p> </p>\n<div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder2\">\n                <p>\n\n                    <img src=\"https://mma.prnewswire.com/media/657835/Ericsson_Logo.jpg\" title=\"(PRNewsfoto/Ericsson)\" alt=\"(PRNewsfoto/Ericsson)\" />\n\n                </p>\n</div>\n\n\n\n<p id=\"PURL\"><img title=\"Cision\" width=\"12\" height=\"12\" alt=\"Cision\" src=\"https://edge.prnewswire.com/c/img/favicon.png?sn=CL96479&amp;sd=2026-02-26\" /> View original content to download multimedia:https://www.prnewswire.com/news-releases/us-shows-isac-leadership-as-ericsson-demonstrates-breakthrough-drone-detection-proof-of-concept-at-texas-headquarters-302698167.html</p><p>SOURCE Ericsson</p></div>\n",
            "link": "https://www.fidelity.com/news/article/technology/202602260945PR_NEWS_USPR_____CL96479",
            "pub_date": "2026-02-26 22:45:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Research Alert: CFRA Maintains Hold Opinion On Shares Of Pinnacle West Capital Corporation",
            "description": "\n<p><chron>09:35 AM EST</chron>, <chron>02/26/2026</chron> (MT Newswires) -- CFRA, an independent research provider, has provided MT Newswires with the following research alert. Analysts at CFRA have summarized their opinion as follows:</p><p>Following PNW's Q4 earnings print, we adjust our 12-month target to <money>$105</money> from <money>$100</money>, valuing shares at 18x our 2027 EPS outlook of <money>$5.83</money> (2026 EPS view reiterated at <money>$4.69</money>). In Q4, PNW benefited from robust economic activity in <location value=\"LS/us.az\" idsrc=\"xmltag.org\" >Arizona</location>, posting 5% weather-normalized retail sales growth and 2.4% customer growth in 2025, with commercial and industrial sales demonstrating particular strength at 7.5% growth led by new manufacturing facilities and data center development. An exceptionally hot summer drove APS to set three all-time peak demand records, with system peak demand rising over 5% to 8.6GW. Looking ahead, the pending 2025 APS rate case represents a critical catalyst, as PNW seeks a <money>$580M</money> sales increase and 10.70% authorized ROE while proposing a Formula Rate Adjustment Mechanism that would enable more timely rate updates to address historical regulatory lags, with new rates expected in the second half of 2026. PNW's <money>$10.35B</money> capital investment plan aims to capture substantial load growth opportunities.</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/investing-ideas/202602260935MIDNIGHTUSEQUITY_A3573639",
            "pub_date": "2026-02-26 22:35:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "BlackSky Technology Swings to Q4 Loss, Revenue Rises; 2026 Revenue Outlook Issued",
            "description": "\n<p><chron>09:44 AM EST</chron>, <chron>02/26/2026</chron> (MT Newswires) -- <org value=\"BKSY/WS.NaE\" idsrc=\"xmltag.org\" >BlackSky Technology</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='BKSY/WS' fmr-param-security-type='Equity'>( BKSY/WS )</span>  shares were down 2% after the company posted a narrower Q4 loss but lower-than-expected revenue.</p><p>The company reported a Q4 loss early Thursday of <money>$0.02</money> per diluted share, narrowing from a loss of <money>$0.64</money> a year earlier.</p><p>Analysts polled by FactSet expected a loss of <money>$0.26</money>.</p><p>Net revenue for the quarter ended <chron>Dec. 31</chron> was <money>$35.2 million</money>, up from <money>$30.4 million</money> a year earlier.</p><p>Analysts surveyed by FactSet expected <money>$37.1 million</money>.</p><p>The company said it expects 2026 revenue of <money>$120 million</money> to <money>$145 million</money>.</p><p>Analysts polled by FactSet expect <money>$141.7 million</money>.</p><p>Price: 19.70, Change: -0.47, Percent Change: -2.33</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602260944MIDNIGHTUSEQUITY_A3573656",
            "pub_date": "2026-02-26 22:44:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Novavax Shares Jump After Swinging to Profit in Q4",
            "description": "\n<p><chron>09:44 AM EST</chron>, <chron>02/26/2026</chron> (MT Newswires) -- <org value=\"NVAX.NaE\" idsrc=\"xmltag.org\" >Novavax</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NVAX' fmr-param-security-type='Equity'>( NVAX )</span>  jumped in recent trading Thursday after reporting Q4 earnings of <money>$0.11</money> per diluted share, swinging from a loss of <money>$0.51</money> a year earlier.</p><p>Analysts surveyed by FactSet expected a loss of <money>$0.48</money>.</p><p>Revenue for the quarter ended <chron>Dec. 31</chron> was <money>$147.1 million</money>, compared with <money>$88.3 million</money> a year earlier.</p><p>Analysts surveyed by FactSet expected <money>$89.8 million</money>.</p><p>Shares of <org value=\"NVAX.NaE\" idsrc=\"xmltag.org\" >Novavax</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NVAX' fmr-param-security-type='Equity'>( NVAX )</span> were up more than 15% in recent trading.</p><p>Price: 10.99, Change: +1.46, Percent Change: +15.32</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602260944MIDNIGHTUSEQUITY_A3573642",
            "pub_date": "2026-02-26 22:44:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Wall Street Set to Open Little Changed as Investors Parse Earnings; Jobless Claims Data",
            "description": "\n<p><chron>09:18 AM EST</chron>, <chron>02/26/2026</chron> (MT Newswires) -- US stocks looked set to open little changed Thursday as investors digested  major earnings reports as well as the latest initial jobless claims report.</p><p>Dow Jones Industrial Average futures were down 0.2%, S&amp;P 500 futures were off 0.1%, and Nasdaq futures were marginally lower.</p><p>Initial jobless claims rose to 212,000 for the week ended <chron>Feb. 21</chron> from 208,000 the previous week, compared with expectations for a larger increase to 216,000, according analysts polled by <org>Bloomberg</org>.</p><p>Nvidia (NVDA) reported late Wednesday fiscal Q4 results above analyst forecasts as an artificial intelligence boom continued to fuel computing demand.</p><p>Salesforce (CRM) shares were tracking lower pre-bell as the customer relationship management platform issued a weak full-year revenue outlook at the midpoint, even though fiscal Q4 results topped market estimates.</p><p>Oil prices were moving sharply lower, with front-month global benchmarks Brent crude falling 1.3% to <money>$69.80</money>, while West Texas Intermediate crude was down 1.8% to <money>$64.25</money> a barrel.</p><p>In other world markets, <location value=\"LC/jp\" idsrc=\"xmltag.org\" >Japan's</location> Nikkei gained 0.3%, <location value=\"LU/cn..hongkg\" idsrc=\"xmltag.org\" >Hong Kong's</location> Hang Seng shed 1.4%, and <location value=\"LC/cn\" idsrc=\"xmltag.org\" >China's</location> Shanghai Composite was little changed. Meanwhile in <location value=\"LR/eur\" idsrc=\"xmltag.org\" >Europe's</location> early afternoon session, the UK's FTSE 100 was up 0.2%, while <location value=\"LC/de\" idsrc=\"xmltag.org\" >Germany's</location> DAX rose 0.5% and <location value=\"LC/fr\" idsrc=\"xmltag.org\" >France's</location> CAC rose 0.8%.</p><p>In equities, <org value=\"HCTI.NaE\" idsrc=\"xmltag.org\" >Healthcare Triangle</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='HCTI' fmr-param-security-type='Equity'>( HCTI )</span>  shares were up 43% in premarket activity, after the company said overnight its QuantumNexis subsidiary collaborated with TNG Digital to provide clinically validated digital mental health services in <location value=\"LC/my\" idsrc=\"xmltag.org\" >Malaysia</location>.</p><p><org value=\"NTNX.NaE\" idsrc=\"xmltag.org\" >Nutanix</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NTNX' fmr-param-security-type='Equity'>( NTNX )</span>  was up nearly 12%, a day after the company reported higher fiscal Q2 adjusted earnings and revenue that also beat analysts' forecasts.</p><p><org value=\"IONQ.NaE\" idsrc=\"xmltag.org\" >IonQ</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='IONQ' fmr-param-security-type='Equity'>( IONQ )</span>  shares were up 15%, a day after it posted higher Q4 revenue, in addition to issuing higher-than-expected Q1 and 2026 outlook.</p><p>Shares of Celsius (CELH) gained 12% after report Q4 results that beat forecasts, according to analysts surveyed by FactSet.</p><p>On the losing side, <org value=\"EOSE.NaE\" idsrc=\"xmltag.org\" >Eos Energy Enterprises</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='EOSE' fmr-param-security-type='Equity'>( EOSE )</span>  plunged nearly 30% pre-bell after it reported Q4 results and guidance that missed analyst forecasts by a wide margin.</p><p>The Trade Desk's (TTD) shares tumbled 15% after it provided Q1 guidance that fell short of Street expectations.</p><p>Chemed (CHE) shares were down 10% after it reported declining Q4 earnings that missed analyst forecasts, as did its 2026 adjusted EPS guidance.</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/us-markets/202602260918MIDNIGHTUSEQUITY_A3573559",
            "pub_date": "2026-02-26 22:18:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Sector Update: Energy Stocks Decline Pre-Bell Thursday",
            "description": "\n<p><chron>09:23 AM EST</chron>, <chron>02/26/2026</chron> (MT Newswires) -- Energy stocks were declining pre-bell Thursday, with the <org value=\"XLE.NaE\" idsrc=\"xmltag.org\" >State Street Energy Select Sector SPDR ETF</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='XLE' fmr-param-security-type='Equity'>( XLE )</span>  down 0.9%.</p><p>The <org value=\"USO.NaE\" idsrc=\"xmltag.org\" >United States Oil Fund</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='USO' fmr-param-security-type='Equity'>( USO )</span>  was 1.9% lower and the <org value=\"UNG.NaE\" idsrc=\"xmltag.org\" >United States Natural Gas Fund</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='UNG' fmr-param-security-type='Equity'>( UNG )</span>  was down 2.8%.</p><p>Front-month US West Texas Intermediate crude oil was down 1.6% at <money>$64.36</money> per barrel at the <org>New York Mercantile Exchange</org>. Global benchmark North Sea Brent crude oil lost 1.2% to <money>$69.92</money> per barrel, and natural gas futures were 3% lower at <money>$2.78</money> per 1 million British Thermal Units.</p><p>Cactus (WHD) stock was down almost 4% after the company reported lower Q4 adjusted earnings and revenue.</p><p>Eni (E) shares were up more than 1% even after the company posted lower Q4 earnings and sales.</p><p>Cheniere Energy (LNG) stock was down 0.3% even after the company reported higher Q4 net income and revenue.</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/us-markets/202602260923MIDNIGHTUSEQUITY_A3573604",
            "pub_date": "2026-02-26 22:23:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "AECC Unveils Blueprint for the Future of Connected Vehicle Architecture",
            "description": "\n<p class=\"bwalignc\">\n<b><i>New white paper delivers a vendor-neutral framework spanning edge, 5G, APIs, cloud, and software-defined vehicles</i></b>\n\n</p>\n<p>    <location value=\"LU/us.ma.wakefi\" idsrc=\"xmltag.org\" >WAKEFIELD, Mass.</location>--(BUSINESS WIRE)--\nThe <org>Automotive Edge Computing Consortium</org> (AECC) today released a new white paper, “AECC Industry Blueprint: Shaping the Future of Automotive Innovation.” This vital new document provides the automotive industry and the digital infrastructure ecosystem — including communications, computing and software — with a shared, vendor-neutral reference for deploying connected vehicle and mobility services at scale.\n\n</p><p>\nAs the automotive industry moves rapidly toward software defined vehicles, demand continues to grow for large scale data processing, highly reliable communications, and AI-enabled services that can meet strict latency and availability requirements. At the same time, it has become clear that architectures relying solely on centralized cloud infrastructures are no longer sufficient. The new white paper addresses this challenge by outlining a distributed edge, 5G, API, and cloud architecture designed to support emerging connected vehicle use cases in real-world deployment environments.\n\n</p><p>\nThe white paper reflects cross-working-group collaboration within AECC and represents AECC’s collective technical consensus. <org>The Architecture and Requirements Working Group</org> played a central role in its creation.\n\n</p><p>\nKey takeaways from the white paper include:\n\n</p><ol class=\"bwlistdecimal\">\n<li>\nA comprehensive reference architecture for enabling connected vehicle and mobility services using distributed edge and cloud computing.\n\n</li>\n<li>\nClear definition of roles and responsibilities across industry actors, including OEMs, network operators, edge, 5G, API and cloud providers, and service providers.\n\n</li>\n<li>\nA structured identification of gaps between current solutions and future technical and operational requirements.\n\n</li>\n<li>\nPractical insights informed by proof-of-concept activities that validate the proposed architectural approach.\n\n</li>\n</ol><p>\nThis publication builds on and consolidates several earlier AECC white papers. While previous documents focused on individual use cases or technical areas, this new white paper integrates those findings into a unified, end-to-end industry blueprint connecting challenges, requirements, architecture, and implementation learnings.\n\n</p><p>\n“Connected vehicle services are evolving quickly, and the industry needs a common architectural foundation to support deployment at scale,” said Dr. <person>Ryokichi Onishi</person>, AECC Board Chairperson. “This white paper reflects broad, cross-industry collaboration and provides a practical, vendor-neutral blueprint that supports both current deployments and future innovation.” AECC encourages OEMs, network operators, technology providers, and service developers to use this blueprint as a common reference when designing and deploying connected-vehicle and mobility solutions. Aligning on interoperable edge, 5G, API, and cloud architectures and collaborating to address the technical and operational gaps identified in the white paper are critical next steps for the industry.\n\n</p><p>\nThe white paper also outlines priorities for AECC, including continued proof-of-concept activities, further refinement of interface definitions, and deeper cross-industry collaboration to support real-world deployment.\n\n</p><p>\nAECC invites stakeholders to provide constructive feedback on the white paper and to engage through AECC working groups and proof of concept initiatives.\n\n</p><p>\nThe white paper is available on the AECC website.\n\n</p><p>\n<b>Engage with the AECC Through Collaborative Initiatives</b>\n\n</p><p>\nOrganizations seeking to explore practical applications of connected vehicle services are invited to participate in the AECC’s Proof of Concept (PoC) program. Case studies and on-demand videos highlighting successful PoC outcomes are available at https://aecc.org/proof of concepts/. Interested parties can initiate collaboration by contacting ProofofConcept@aecc.org.\n\n</p><p>\nThe AECC welcomes companies from all industries related to advancing connected vehicle services. To learn more about AECC membership, visit https://aecc.org/membership/.\n\n</p><p>\n<b>About the AECC</b>\n\n</p><p>\n<org>The Automotive Edge Computing Consortium</org> (AECC) is an association of cross-industry, global leaders working to explore the rapidly evolving and significant data and communications needs involved in instrumenting hundreds of millions of vehicles worldwide. The AECC’s goal is to promote best practices for communication and computing infrastructure to effectively utilize automotive big data, toward realizing an enriched mobility society. The AECC’s members are key players in the automotive, high-speed mobile network, edge computing, wireless technology, distributed computing and artificial intelligence markets. For more information about the AECC and its membership benefits, please visit https://aecc.org/.\n\n</p><p><img alt=\"\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20260226609513r1&amp;sid=acqr8&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\" /><span class=\"bwct31415\" /></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\">https://www.businesswire.com/news/home/20260226609513/en/</span></p>\n<p>Source: <org>Automotive Edge Computing Consortium</org></p>\n",
            "link": "https://www.fidelity.com/news/article/technology/202602260930BIZWIRE_USPR_____20260226_BW609513",
            "pub_date": "2026-02-26 22:30:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Northeastern University, SoftBank Corp., Keysight, and zTouch Networks Demonstrate LTM-powered Autonomous Agentic AI-RAN at MWC Barcelona 2026",
            "description": "\n<div class=\"xn-content\">\n<p><i>Long-standing industry-academic collaboration delivers first-of-its-kind intent-driven, AI-native RAN powered by a Large Telecom Model</i></p><p><span class=\"legendSpanClass\"><location value=\"LU/us.ma.boston\" idsrc=\"xmltag.org\" >BOSTON</location> and <location value=\"LU/es..barcel\" idsrc=\"xmltag.org\" >BARCELONA, Spain</location></span>, <span class=\"legendSpanClass\"><chron>Feb. 26, 2026</chron></span> /PRNewswire/ -- Northeastern University's <org>Institute for Intelligent Networked Systems</org> (INSI), SoftBank Corp. (SoftBank), Keysight Technologies, and zTouch Networks are demonstrating Autonomous Agentic AI-RAN (AgentRAN) at <org>Mobile World Congress</org> (MWC) <location value=\"LU/es..barcel\" idsrc=\"xmltag.org\" >Barcelona</location> 2026. AgentRAN is a first-of-its-kind system that coordinates a hierarchy of AI agents to translate high-level operator intents into real-time, autonomous 5G and 6G network configurations and services.</p>\n<p>The demonstration is the latest milestone in a collaboration anchored at <org>Northeastern University</org>, where INSI has served as a nexus for industry-academic partnerships at the frontier of intelligent wireless networks. Over the past few years, Northeastern has built deep research ties with SoftBank on AI-native architectures, leading to multiple publications, <org>AI-RAN Alliance</org> demonstrations, and innovation in next-generation wireless. INSI collaborates with Keysight on AI-RAN testing and spun off zTouch Networks to commercialize technology on open, GPU-accelerated RAN infrastructure. This demo brings those threads together for the first time around a shared vision: truly autonomous, AI-driven radio access networks.</p><p><b>How It Works</b></p><p>At the heart of the demo is AgentRAN, developed at Northeastern's <org>Open6G AI-RAN Alliance Lab</org>. Operators express goals in natural language – such as \"maximize throughput while prioritizing emergency traffic\" – and the AgentRAN Manager decomposes these intents into actions for specialized agents operating across the RAN stack. The agents are powered by the SoftBank's Large Telecom Model (LTM), a purpose-built foundation model trained on telecom-specific KPIs, configurations, and domain data—further optimized with high-fidelity training data generated using Keysight's RF digital twin channel emulation solutions with real world accurate 3D ray tracing capabilities (RaySIM, PROPSIM) for more accurate decisions than generic cloud models can deliver.</p><p>The Northeastern Open6G AI-RAN lab, using Keysight's PROPSIM, demonstrates multiple agentic scenarios, deployed on an end-to-end programmable private 5G AI-RAN infrastructure, managed and orchestrated by zTouch Networks' zTouch.OS. The demonstration shows the system's ability to detect changing conditions and adapt autonomously. Using Keysight's AI-RAN performance scoring solution, the system shows clear performance gains linked to the use of SoftBank's LTM, high fidelity training datasets generated by Keysight RF digital twin solutions, and zTouch Networks' zTouch.OS.</p><p><b>What the Partners Are Saying</b></p><p><b><i><person>Tommaso Melodia</person>, William L. Smith Professor at <org>Northeastern University</org> and INSI Director:</i></b><i> \"When Northeastern co-founded the <org>AI-RAN Alliance</org> alongside SoftBank, NVIDIA, and other industry leaders at MWC 2024, we set out to prove that AI can be woven directly into the fabric of the radio access network – not as an afterthought, but as its core operating principle. This demonstration is proof of this concept coming to life. Our open AI-RAN research infrastructure at INSI was purpose-built to bring together partners like SoftBank, Keysight, and zTouch Networks so we can move from ideas to working, validated systems faster than any one organization could alone. What you see here is a network that understands what an operator wants and figures out how to deliver it autonomously. This is the future of wireless, and it is being built through exactly this kind of deep, sustained collaboration.\"</i></p><p><b><i>Ryuji Wakikawa, Vice President and Head of the <org>Research Institute of Advanced Technology</org> at SoftBank Corp.: </i></b><i>\"This initiative demonstrates our Large Telecom Model working outside of our own infrastructure for the first time, which underscores the potential of this technology to transform the whole industry. We believe technology is only valuable when it is put to the service of society, and our team is glad to support the spread of this impact in other use-cases beyond our own.\"</i></p><p><b><i><person>Peng Cao</person>, Vice President and General Manager, <org>Wireless Test Group</org>, Keysight:</i></b><i> \"AI-native networks will only be as powerful as the data and validation frameworks behind them. Through this collaboration with <org>Northeastern University</org>, SoftBank, and zTouch Networks, Keysight is enabling the high-fidelity digital twin environments and performance intelligence needed to train, validate, and scale Large Telecom Models for real-world deployment. Together, we are helping the industry move forward with confidence toward an autonomous, trustworthy, AI-powered 6G era.\" </i></p><p><b><i>Salvatore D'Oro, zTouch Networks CTO:</i></b><i> \"We built zTouch Networks on a simple conviction: networks should understand what you need and deliver it autonomously - no armies of engineers, no months-long deployment cycles. This demonstration brings that vision to life. With zTouch.OS orchestrating an end-to-end AI-RAN infrastructure, operators can express an intent in plain language and watch the network configure itself in real time. Together with Northeastern, SoftBank, and Keysight, we're showing that truly autonomous, intent-driven wireless networks aren't a future promise - they're here.\"</i></p><p>The Agentic AI-RAN demonstration will be live at MWC Barcelona 2026, <chron>March 2-5</chron>, at the Keysight booth in Hall 5, Stand 5F41. Visitors can see the full intent-to-network pipeline in action and explore the AgentRAN dashboard, LTM integration, and real-time channel emulation firsthand.</p><p><b>About the Northeastern University INSI</b></p><p><org>The Institute for Intelligent Networked Systems</org> (INSI) at <org>Northeastern University</org> conducts cutting-edge research in wireless communications, networking, and systems. Home to the Colosseum wireless network emulator and the Open6G R&amp;D center, INSI leads multiple federally, industry, and state-funded programs advancing wireless technology.</p><p><b>Contacts: </b><person>Michele Polese</person> m.polese@northeastern.edu</p>\n\n\n\n<p id=\"PURL\"><img title=\"Cision\" width=\"12\" height=\"12\" alt=\"Cision\" src=\"https://edge.prnewswire.com/c/img/favicon.png?sn=NE96313&amp;sd=2026-02-26\" /> View original content:https://www.prnewswire.com/news-releases/northeastern-university-softbank-corp-keysight-and-ztouch-networks-demonstrate-ltm-powered-autonomous-agentic-ai-ran-at-mwc-barcelona-2026-302698452.html</p><p>SOURCE <org>Institute for Intelligent Networked Systems</org></p></div>\n",
            "link": "https://www.fidelity.com/news/article/technology/202602260930PR_NEWS_USPR_____NE96313",
            "pub_date": "2026-02-26 22:30:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "BRIEF-Irenic Makes Unsolicited Bid For Reservoir Media- Bloomberg News",
            "description": "\n<p><chron>Feb 26</chron> (Reuters) -</p>\n<p>* IRENIC MAKES UNSOLICITED BID FOR RESERVOIR MEDIA-BLOOMBERG\nNEWS</p>\n<p>* IRENIC SUBMITTED A BID FOR CO. WORTH <money>$10</money> TO <money>$11</money> PER SHARE\nOR\nABOUT <money>$1.1 BILLION</money> TO <money>$1.2 BILLION</money>, INCLUDING DEBT-BLOOMBERG\nNEWS\nSource text: https://tinyurl.com/2cpsz3y2\nFurther company coverage:</p>\n",
            "link": "https://www.fidelity.com/news/article/mergers-and-acquisitions/202602260927RTRSNEWSCOMBINED_FWN3ZM12U_1",
            "pub_date": "2026-02-26 22:27:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Natural Gas Falls to a Six-Month Low as Mild Forecasts Cut Into Demand",
            "description": "\n<p><chron>09:29 AM EST</chron>, <chron>02/26/2026</chron> (MT Newswires) -- Natural gas fell to a six-month low early Thursday ahead of fresh inventory data as long-term forecasts see mild weather coming for most of the country, cutting into heating demand for the fuel.</p><p>Gas for April delivery was last seen down <money>$0.07</money> to <money>US$2.80</money> per million British thermal units, the lowest since Aug.25. The drop comes as long-term forecasts from the <org>National Weather Service</org> expect all states to see warmer than seasonal temperatures in its eight to 14 day forecast as spring temperatures take an early hold.</p><p>&quot;Mid-March temps have shifted from normal to above average, and in the near term, the heating degree day forecast was 29.5% below normal for the lower-48 as of yesterday,&quot; <person>Christopher Louney</person>, Natural Gas and Gold Strategist at <org>RBC Capital Markets</org> wrote.</p><p><org>The Energy Information Administration</org> will release its weekly survey of inventories of the fuel later on Thursday morning, Celsius Energy exports the agency to report a draw on stocks of 53-billion cubic feet last week, well below the year-prior draw for the week of 252-bcf.</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602260929MIDNIGHTUSEQUITY_A3573614",
            "pub_date": "2026-02-26 22:29:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Sector Update: Tech Stocks Rise Pre-Bell Thursday",
            "description": "\n<p><chron>09:07 AM EST</chron>, <chron>02/26/2026</chron> (MT Newswires) -- Technology stocks were rising pre-bell Thursday, with the <org>State Street Technology Select Sector SPDR Fund</org> (XLK) 0.2% higher and the <org value=\"XSD.NaE\" idsrc=\"xmltag.org\" >State Street SPDR S&amp;P Semiconductor ETF</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='XSD' fmr-param-security-type='Equity'>( XSD )</span>  up 0.7%.</p><p><org value=\"SONY.NaE\" idsrc=\"xmltag.org\" >Sony Group</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='SONY' fmr-param-security-type='Equity'>( SONY )</span>  shares were up more than 3% after the company said it is increasing its share repurchase program to a maximum of <money>250 billion Japanese yen</money> (<money>$1.60 billion</money>) from <money>150 billion yen</money> previously.</p><p><org value=\"NVDA.NaE\" idsrc=\"xmltag.org\" >Nvidia</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NVDA' fmr-param-security-type='Equity'>( NVDA )</span>  stock was up 0.9% after the company reported higher fiscal Q4 adjusted earnings and revenue, and issued fiscal Q1 revenue outlook above analysts' expectations.</p><p><org value=\"BIDU.NaE\" idsrc=\"xmltag.org\" >Baidu</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='BIDU' fmr-param-security-type='Equity'>( BIDU )</span>  shares were down more than 3% after the company posted lower Q4 non-GAAP earnings and revenue.</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/us-markets/202602260907MIDNIGHTUSEQUITY_A3573572",
            "pub_date": "2026-02-26 22:07:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Sector Update: Health Care Stocks Edge Higher Pre-Bell Thursday",
            "description": "\n<p><chron>09:11 AM EST</chron>, <chron>02/26/2026</chron> (MT Newswires) -- Health care stocks were edging higher pre-bell Thursday, with the <org value=\"XLV.NaE\" idsrc=\"xmltag.org\" >State Street Health Care Select Sector SPDR ETF</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='XLV' fmr-param-security-type='Equity'>( XLV )</span>  up 0.2% and the iShares Biotechnology ETF (IBB) marginally advancing.</p><p>Indivior (INDV) stock was up more than 3% after the company reported higher Q4 adjusted earnings and net revenue.</p><p>Argenx (ARGX) shares were down more than 1% after the company reported a decline in Q4 earnings.</p><p><org value=\"KYMR.NaE\" idsrc=\"xmltag.org\" >Kymera Therapeutics</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='KYMR' fmr-param-security-type='Equity'>( KYMR )</span>  stock was down more than 9% after the company posted a wider Q4 net loss as revenue declined during the period.</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/us-markets/202602260911MIDNIGHTUSEQUITY_A3573586",
            "pub_date": "2026-02-26 22:11:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Havas Health and BrightInsight Forge Exclusive Alliance to Tackle Pharma's $500B+ Patient Problem",
            "description": "\n<div class=\"xn-content\">\n<p><span class=\"legendSpanClass\"><location value=\"LU/us.ny.nyc\" idsrc=\"xmltag.org\" >NEW YORK</location></span>, <span class=\"legendSpanClass\"><chron>Feb. 26, 2026</chron></span> /PRNewswire/ - <org>Havas Health</org> today announced an exclusive, strategic partnership with BrightInsight, the leading global platform for biopharma to deliver digital persistence and adherence solutions. This collaboration designates <org>Havas Health</org> as BrightInsight's single global agency partner, creating a first-of-its-kind offering that merges world-class healthcare strategy and creativity with a compliant, scalable digital health platform to support and retain the patient post-prescription.</p>\n<p>The partnership addresses a critical friction point in the industry: the gap between a breakthrough therapy prescription and its ability to achieve real-world effectiveness. Built on an AI-enabled, compliant digital health platform, the collaboration reflects <org>Havas Health's</org> broader Converged strategy, fusing human insight with advanced technology to deliver integrated, scalable solutions across the healthcare journey. <org>Havas Health</org> excels at defining the patient journey to activate engagement, and BrightInsight brings the configurable, \"always-on\" technology which has demonstrated the ability to reduce long term therapy discontinuation by four percentage points and increase adherence by four percentage points more than traditional patient support programs. BrightInsight's compliant solution will drive tremendous incremental value for brands across the 60-plus countries <org>Havas Health</org> supports.</p><p>\"Our clients are no longer asking <i>if</i> they should go digital, but how they can do so without reinventing the wheel for every market and every brand,\" said <person>Jeff Hoffman</person>, Chief Development Officer, Havas Health Network. \"By integrating BrightInsight's platform into our core offering, <org>Havas Health</org> is moving beyond traditional communications. We are now providing our clients with a pre-vetted, regulatory-ready engine that ensures a patient's experience with a brand is as meaningful and reliable as the therapy itself. That's where long-term value and impact are truly realized.\"</p><p>As treatment regimens become increasingly complex, and as more patients face chronic illnesses requiring lifelong management, patient adherence and persistence remain the primary barriers to clinical success. Industry analyses continue to estimate that poor patient adherence to prescribed therapies costs the global pharmaceutical industry approximately <money>$500 billion</money> annually.¹ This partnership allows <org>Havas Health</org> to rapidly deploy BrightInsight's solutions which have <u>proven</u> outcomes with top biopharma companies. These solutions bridge the value gap and deliver consistent clinical and commercial impact at scale. With a standardized but configurable digital health infrastructure, brands can both optimize and unify the support and experience provided to patients.</p><p>\"This partnership with <org>Havas Health</org> enables BrightInsight to bridge the gap between digital innovation and commercial scale,\" said <person>Kal Patel</person>, MD, CEO and Co-Founder of BrightInsight. \"By aligning our platform with Havas' deep strategic influence and global reach, we can ensure that digital health solutions are successfully integrated into the brand's DNA and the patient's daily life, driving measurable impact for our partners and better outcomes for patients worldwide.\"</p><p>This partnership represents the latest in a series of strategic alignments by <org>Havas Health</org> that underscore its commitment to advancing healthcare communications and technology. Building on collaborations with innovative platforms such as Ostro and Vurvey, <org>Havas Health</org> continues to invest in solutions that help clients build trust, demonstrate value, and scale confidently within an increasingly complex healthcare landscape.</p><p>¹ Source: <org>Capgemini Consulting</org> and HealthPrize Technologies; figure continues to be cited in industry reporting through 2025.</p><p><b>ABOUT HAVAS HEALTH NETWORK</b>  <br />Havas Health Network unites Havas Life, Havas Lynx, and Jacques, all wholly owned health and communications networks, with the consumer health businesses and practices of Havas Creative Network. The network's approach is centered around making a meaningful difference and has the talent, tenacity, and technology that health companies, brands, and people need to thrive in today's world. For more information, visit <b><u>www.HavasHealth.com</u></b>.  </p><p><b>ABOUT BRIGHTINSIGHT</b><br />BrightInsight is the de facto global platform for biopharma patient persistence and adherence. As the only platform supporting regulated digital health across 60+ countries, BrightInsight is the trusted foundation for the world's largest biopharma brands. For life sciences companies pursuing digital transformation, the company offers the leading technology to rapidly develop, launch, and scale digital solutions. BrightInsight's cloud-based platform is the foundation for patient companion apps, digital-first patient support programs (PSP) and Software as a Medical Device (SaMD) solutions to improve medication persistence and adherence. For more details, visit BrightInsight's <b><u>website</u></b>, <b><u>Blog</u></b>, <b><u>X</u></b> and <b><u>LinkedIn</u></b> pages.</p>\n\n\n\n<p id=\"PURL\"><img title=\"Cision\" width=\"12\" height=\"12\" alt=\"Cision\" src=\"https://edge.prnewswire.com/c/img/favicon.png?sn=TO92310&amp;sd=2026-02-26\" /> View original content:https://www.prnewswire.com/news-releases/havas-health-and-brightinsight-forge-exclusive-alliance-to-tackle-pharmas-500b-patient-problem-302697564.html</p><p>SOURCE Havas Health Network</p></div>\n",
            "link": "https://www.fidelity.com/news/article/technology/202602260915PR_NEWS_USPR_____TO92310",
            "pub_date": "2026-02-26 22:15:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "JFrog Announces $300 Million Share Repurchase Program",
            "description": "\n<p>    <location value=\"LU/us.ca.sunyvl\" idsrc=\"xmltag.org\" >SUNNYVALE, Calif.</location>--(BUSINESS WIRE)--\n<org value=\"FROG.NaE\" idsrc=\"xmltag.org\" >JFrog Ltd</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='FROG' fmr-param-security-type='Equity'>( FROG )</span>. (“JFrog”) , the <org>Liquid Software</org> company and creators of the JFrog Software Supply Chain Platform, today announced that its Board of Directors has authorized a share repurchase program of up to <money>$300 million</money> of the Company’s ordinary shares.\n\n</p><p>\nThe repurchase approval reflects JFrog’s confidence in executing on its strategy and its conviction in significant, durable growth opportunities.\n\n</p><p>\nBacked by a strong balance sheet and consistent free cash flow generation, <org value=\"FROG.NaE\" idsrc=\"xmltag.org\" >JFrog</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='FROG' fmr-param-security-type='Equity'>( FROG )</span> is well-positioned to return capital to shareholders while maintaining flexibility to invest in strategic growth initiatives.\n\n</p><p>\nCompany securities may be repurchased from time to time using a variety of methods, which may include open market purchases, privately negotiated transactions or otherwise, under the U.S. Securities Exchange Act of 1934, as amended, in accordance with U.S. securities laws and regulations. The repurchase program does not obligate the Company to acquire any particular amount of securities, and the repurchase program may be suspended or discontinued at any time at the Company's discretion.\n\n</p><p>\nThe actual timing, number and value of securities repurchased depend on a number of factors, including the market price of the Company's ordinary shares, general market and economic conditions, the Company's financial results and liquidity, and other considerations. The Company expects to fund repurchases with cash on hand and future cash generated from its operations.\n\n</p><p>\nRepurchases under the repurchase program may begin after conclusion of the 30-day period for creditors of the Company to object to the Company's intent to perform the distribution by way of repurchase in accordance with the Israeli Companies Regulations (Relief for <org>Public Companies Whose Securities</org> are Traded on Stock Exchanges Outside of <location value=\"LC/il\" idsrc=\"xmltag.org\" >Israel</location>), 5760-2000 and the Israeli Regulations (Approval of Distribution), 5761–2001.\n\n</p><p>\n<b>About <org value=\"FROG.NaE\" idsrc=\"xmltag.org\" >JFrog</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='FROG' fmr-param-security-type='Equity'>( FROG )</span></b>\n\n</p><p>\n<org value=\"FROG.NaE\" idsrc=\"xmltag.org\" >JFrog Ltd.</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='FROG' fmr-param-security-type='Equity'>( FROG )</span> , the creators of the unified DevOps, DevSecOps, DevGovOps and MLOps platform, is on a mission to create a world of software delivered without friction from development to production. Driven by a “Liquid Software” vision, the JFrog Platform is a software supply chain system of record that is designed to power organizations as they build, manage, and distribute secure software with speed and scale. Holistic security features help identify, protect, and remediate against threats and vulnerabilities. The universal, hybrid, multi-cloud JFrog Platform is available as both SaaS services across major cloud service providers and self-hosted. Millions of users and approximately 6,600 organizations worldwide, including a majority of the Fortune 100, depend on <org value=\"FROG.NaE\" idsrc=\"xmltag.org\" >JFrog</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='FROG' fmr-param-security-type='Equity'>( FROG )</span> solutions to securely embrace digital transformation in the AI era. Learn more at www.jfrog.com or follow us on X @<org value=\"FROG.NaE\" idsrc=\"xmltag.org\" >JFrog</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='FROG' fmr-param-security-type='Equity'>( FROG )</span>.\n\n</p><p>\n<b>Forward-Looking Statements</b>\n\n</p><p>\nThis press release contains “forward-looking” statements, as that term is defined under the U.S. federal securities laws, including but not limited to statements relating to the amount, timing and execution of, and other details about repurchases under the repurchase program.\n\n</p><p>\nForward-looking statements represent our beliefs and assumptions only as of the date of this press release. We disclaim any obligation to update forward-looking statements except as required by law.\n\n</p><p>\nOur actual results could differ materially from those stated or implied in forward-looking statements due to a number of factors, including but not limited to, risks detailed in our filings with the <org>Securities and Exchange Commission</org>, including in our annual report on Form 10-K for the year ended <chron>December 31, 2025</chron> filed on <chron>February 13, 2026</chron>, our quarterly reports on Form 10-Q, and other filings and reports that we may file from time to time with the <org>Securities and Exchange Commission</org>.\n\n</p><p><img alt=\"\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20260226464606r1&amp;sid=acqr8&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\" /><span class=\"bwct31415\" /></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\">https://www.businesswire.com/news/home/20260226464606/en/</span></p>\n<p>Source: <org value=\"FROG.NaE\" idsrc=\"xmltag.org\" >JFrog Ltd.</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='FROG' fmr-param-security-type='Equity'>( FROG )</span></p>\n",
            "link": "https://www.fidelity.com/news/article/technology/202602260915BIZWIRE_USPR_____20260226_BW464606",
            "pub_date": "2026-02-26 22:15:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Loar Q4 Adjusted Earnings, Revenue Rise; Updates 2026 Outlook",
            "description": "\n<p><chron>09:14 AM EST</chron>, <chron>02/26/2026</chron> (MT Newswires) -- <org value=\"LOAR.NaE\" idsrc=\"xmltag.org\" >Loar</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='LOAR' fmr-param-security-type='Equity'>( LOAR )</span>  reported Q4 adjusted earnings Thursday of <money>$0.26</money> per diluted share, up from <money>$0.11</money> a year earlier.</p><p>Four analysts polled by FactSet expected <money>$0.19</money>.</p><p>Net sales for the quarter ended <chron>Dec. 31</chron> were <money>$131.8 million</money>, up from <money>$110.4 million</money> a year earlier.</p><p>Four analysts surveyed by FactSet expected <money>$128 million</money>.</p><p>The company said it now expects 2026 adjusted EPS to be between <money>$0.76</money> and <money>$0.80</money>, down from its previous estimate of <money>$0.98</money> to <money>$1.03</money>. Four analysts polled by FactSet expect <money>$0.99</money>.</p><p>Net sales for the year are now guided to be between <money>$640 million</money> and <money>$650 million</money>, compared with <money>$540 million</money> to <money>$550 million</money> previously. Four analysts surveyed by FactSet expect <money>$633.5 million</money>.</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602260914MIDNIGHTUSEQUITY_A3573558",
            "pub_date": "2026-02-26 22:14:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Hilb Group Acquires Georgia-based Bonding Agency, Continues to Expand Southeast and Surety Offerings",
            "description": "\n<div class=\"xn-content\">\n<p><span class=\"legendSpanClass\"><location value=\"LU/us.va.rchmnd\" idsrc=\"xmltag.org\" >RICHMOND, Va.</location></span>, <span class=\"legendSpanClass\"><chron>Feb. 26, 2026</chron></span> /PRNewswire/ -- <org>Hilb Group</org> announced today that it has acquired a <location value=\"LS/us.ga\" idsrc=\"xmltag.org\" >Georgia</location>-based surety bond agency. The acquisition took effect on <chron>February 1, 2026</chron>, expanding the company's bonding offerings and continuing to grow its presence in the Southeast region. </p>\n    <div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder1\">\n                <p>\n\n                    <img src=\"https://mma.prnewswire.com/media/156338/the_hilb_group__llc_logo.jpg\" title=\"The Hilb Group, LLC. (PRNewsFoto/The Hilb Group, LLC)\" alt=\"The Hilb Group, LLC. (PRNewsFoto/The Hilb Group, LLC)\" />\n\n                </p>\n    </div>\n<p><b>About <org>Hilb Group</org>:</b> The Hilb Group is a leading property and casualty and employee benefits insurance brokerage and advisory firm headquartered in <location value=\"LU/us.va.rchmnd\" idsrc=\"xmltag.org\" >Richmond, Virginia</location>. <org>Hilb Group</org> is a portfolio company of The Carlyle Group, a global investment firm. <org>Hilb Group</org> seeks to grow through strategic acquisitions and by leveraging its resources and expertise to drive organic growth in its acquired agencies. The company has completed more than 200 acquisitions with over 125 offices in 32 states. <org>Hilb Group</org> is rated as one of the Fastest Growing Brokers by <org>Business Insurance</org>, a <org>Top P/C Agency</org> by <org>Insurance Journal</org>, and one of America's Fastest Growing Private Companies in the Inc. 5000. For more information on <org>Hilb Group's</org> growth as well as career opportunities, please visit our website at http://hilbgroup.com.</p><p>Media Contact:<br /><person>Peter Lobred</person> <br />804.548.4629 <br /><u>plobred@hilbgroup.com</u> </p><p>M&amp;A Contact: <br /><person>Ryan Havermann</person> <br />804.414.6508<br /><u>rhavermann@hilbgroup.com</u> </p>\n\n\n\n<p id=\"PURL\"><img title=\"Cision\" width=\"12\" height=\"12\" alt=\"Cision\" src=\"https://edge.prnewswire.com/c/img/favicon.png?sn=NE96227&amp;sd=2026-02-26\" /> View original content to download multimedia:https://www.prnewswire.com/news-releases/hilb-group-acquires-georgia-based-bonding-agency-continues-to-expand-southeast-and-surety-offerings-302697823.html</p><p>SOURCE <org>The Hilb Group, LLC</org></p></div>\n",
            "link": "https://www.fidelity.com/news/article/mergers-and-acquisitions/202602260915PR_NEWS_USPR_____NE96227",
            "pub_date": "2026-02-26 22:15:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Sector Update: Health Care",
            "description": "\n<p><chron>08:58 AM EST</chron>, <chron>02/26/2026</chron> (MT Newswires) -- Health care stocks were edging higher pre-bell Thursday, with the State Street Health Care Select Sector SPDR ETF (XLV) up 0.2% and the iShares Biotechnology ETF (IBB) marginally advancing.</p><p>Indivior (INDV) stock was up more than 3% after the company reported higher Q4 adjusted earnings and net revenue.</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/us-markets/202602260858MIDNIGHTUSEQUITY_A3573549",
            "pub_date": "2026-02-26 21:58:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Sector Update: Financial",
            "description": "\n<p><chron>08:59 AM EST</chron>, <chron>02/26/2026</chron> (MT Newswires) -- Financial stocks were advancing premarket Thursday, with the State Street Financial Select Sector SPDR ETF (XLF) up 0.2%.</p><p>The Direxion Daily Financial Bull 3X Shares (FAS) was 0.7% higher and its bearish counterpart Direxion Daily Financial Bear 3X Shares (FAZ) was down 0.6%.</p><p><org value=\"MLWIQXX.NaE\" idsrc=\"xmltag.org\" >Toronto-Dominion Bank</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='MLWIQXX' fmr-param-security-type='Equity'>( MLWIQXX )</span>  stock was up more than 1% after the company posted higher fiscal Q1 adjusted earnings and revenue.</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/us-markets/202602260859MIDNIGHTUSEQUITY_A3573555",
            "pub_date": "2026-02-26 21:59:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Intervala Invests $6M+ to Expand High-Reliability Electronics Manufacturing Capabilities",
            "description": "\n<ul class=\"bwlistdisc\">\n<li>\nStrategic investment in advanced PCBA and electromechanical manufacturing technology supports increasingly complex OEM programs in mission-critical markets\n\n</li>\n<li>\nBuild-out and new automated storage and retrieval systems help expand manufacturing capacity, with a total footprint of approximately 200,000 square feet\n\n</li>\n</ul>\n<p>    <location value=\"LU/us.pa.mouant\" idsrc=\"xmltag.org\" >MOUNT PLEASANT, Pa.</location>--(BUSINESS WIRE)--\nIntervala, a full-service electronics manufacturing services (EMS) provider specializing in complex electronic and electromechanical products, has invested more than <money>$6 million</money> in advanced manufacturing technology, automation, and facility expansion to strengthen its high-reliability capabilities for OEMs operating in mission-critical industries, including data center infrastructure and defense. The expansion strengthens Intervala’s printed circuit board assembly (PCBA) and electromechanical operations to support rising demands driven by AI workloads, defense modernization, and advanced medical technologies.\n\n</p><p>\nThe company’s recent upgrades include industry-leading equipment selected to improve quality, consistency, and throughput. This includes:\n\n</p><ul class=\"bwlistdisc\">\n<li>\nPanasonic SMT pick-and-place systems across five production lines for high-accuracy assembly\n\n</li>\n<li>\nPanasonic screen printing systems to ensure precise solder paste deposition and repeatable process control\n\n</li>\n<li>\n<person>Koh Young</person> automated optical inspection (AOI) systems for real-time defect detection and process feedback\n\n</li>\n<li>\nTakaya Flying Probe Testing for flexible electrical test coverage; and\n\n</li>\n<li>\nFanuc six-axis cobots to support automation and repeatability.\n\n</li>\n</ul><p>\n“Across the markets we serve, products are becoming more complex and expectations continue to rise,” said <person>Rob McKernan</person>, CEO of Intervala. “Manufacturing readiness is now just as critical as design innovation. Our continued commitment to advanced technology, backed by our deeply experienced engineering team, ensures we can deliver the precision, reliability, and repeatability these complex systems demand.”\n\n</p><p>\n<b>Intervala Expands Manufacturing Capacity to Address Growing Demand in Defense and AI Infrastructure</b>\n\n</p><p>\nAs part of the initiative, Intervala completed a 60,000-square-foot facility build-out, transforming previously underutilized space into fully operational manufacturing capacity. In addition, the installation of automated storage and retrieval systems (AS/RS) freed up approximately 40,000 square feet of additional floor space. Together, these improvements bring Intervala’s total footprint to approximately 200,000 square feet.\n\n</p><p>\nIntervala’s enhanced manufacturing environment is purpose-built to support today’s most demanding electronics designs and fully integrated electromechanical systems, including fine-pitch and high-density component placement, highly complex assemblies, rigorous inspection, testing, and traceability, as well as low- to mid-volume production with stringent reliability requirements. These capabilities are increasingly critical as OEMs seek to deliver greater functionality in smaller, denser board footprints without compromising performance or compliance.\n\n</p><p>\nIn mission-critical infrastructure markets, customer partners are seeing the impact of Intervala’s approach firsthand. “Our customers are navigating unprecedented complexity - from AI-driven data center expansion to next-generation defense and medical systems,” said McKernan. “They need a manufacturing partner that can scale with confidence, execute with precision, and engineer for reliability from day one. This investment ensures we’re not just keeping pace with demand - we’re helping our customers gain a competitive edge with systems built to perform when it matters most.”\n\n</p><p>\nCollectively, these enhancements strengthen Intervala’s ability to deliver complex, high-reliability programs at scale. The company combines the advanced technology, scale, and cost advantages typically associated with large contract manufacturers with the flexibility, responsiveness, and partnership more often found in smaller providers, enabling OEMs to move forward with confidence as product complexity increases.\n\n</p><p>\n<b>About Intervala</b>\n\n</p><p>\nIntervala is a full-service electronics manufacturing services (EMS) provider delivering complex electronic and electromechanical products for customers in the aerospace and defense, medical and life sciences, industrial, and data center markets.\n\n</p><p>\nDistinguished by advanced engineering expertise and a customer-first mindset, Intervala provides full-system integration services including printed circuit board assemblies, electromechanical systems, and cable and harness assemblies.\n\n</p><p>\nWith decades of experience and a culture built on quality, agility, and trust, Intervala partners with its customers to design, build, and deliver reliable products for applications where failure is not an option. Learn more at www.intervala.com.\n\n</p><p><img alt=\"\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20260226020376r1&amp;sid=acqr8&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\" /><span class=\"bwct31415\" /></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\">https://www.businesswire.com/news/home/20260226020376/en/</span></p>\n<p>Source: Intervala</p>\n",
            "link": "https://www.fidelity.com/news/article/technology/202602260900BIZWIRE_USPR_____20260226_BW020376",
            "pub_date": "2026-02-26 22:00:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Arms Cyber Announces Integration with Veeam to Automate the Isolation of Ransomware-Infected Backups",
            "description": "\n<p><location value=\"LU/us.tn.breood\" idsrc=\"xmltag.org\" >Brentwood, TN</location>, <chron>Feb.  26, 2026</chron>  (GLOBE NEWSWIRE) -- Arms Cyber, the leader in stealth-based ransomware defense, today announced a new technology partnership with Veeam® Software, the <org>Data and AI Trust</org> company. The partnership focuses on a direct technical integration designed to automatically flag and isolate backup restore points containing ransomware threats, significantly reducing recovery times and eliminating the risk of restoring infected data.</p>     <p>   </p>  <p>As ransomware grows more sophisticated, attackers frequently target backup infrastructure or dwell silently in systems for weeks before detonating. This means the most recent backups often contain the dormant malware. When IT teams rush to restore operations, they inadvertently reintroduce the malware to the network, causing a &quot;reinfection loop&quot; that paralyzes recovery efforts.</p>  <p>   </p>  <p>The integration between Arms Cyber and Veeam Data Platform addresses this critical challenge directly. By leveraging the REST API capabilities, Arms Cyber can now act as a high-fidelity sensor for the backup environment.</p>  <p>   </p>  <p>When Arms Cyber detects a ransomware event on a protected workload, it instantly triggers the Veeam Incident  API. This action immediately marks relevant restore points in the Veeam console as compromised, alerting backup administrators and preventing the accidental restoration of infected data.</p>  <p>   </p>  <p>“The old paradigm of security teams handling detection while IT teams handle separate recovery tools is failing customers during real-world crises,” said <person>Bob Kruse</person>, CEO at Arms Cyber. “Our mission is to move beyond simple alerting by taking automated action. By integrating with Veeam, we aren't just telling you that you have ransomware; we are physically interlocking with your backup system to ensure you don't restore the infection. This is what true cyber resilience looks like.”</p>  <p>   </p>  <p>Availability The integration requires Veeam Data Platform v12 or higher and an active Arms Cyber subscription. For more information on deployment, visit https://www.tawk.to/partner-program/.</p>  <p>   </p>  <p>About Arms Cyber Arms Cyber delivers a revolutionary approach to defeat attacks others miss through a three-part strategy: Conceal, Deceive, and Restore — powered by stealth. By adding stealth to an organization's existing security posture, we keep critical data invisible to attackers, detect threats before they cause serious damage, and enable rapid recovery without compromise. The outcome: no ransom payouts, no public breaches, no costly downtime.</p>  <p><br/><br/><br/></p>  Image: https://www.globenewswire.com/newsroom/ti?nf=OTY2MDY0NCM3NDUyOTUyIzUwMDEzMDIwMQ==  <br/> Image: https://ml.globenewswire.com/media/NmU4ZGVjNWEtOTU1YS00ZTMwLTlhOWMtNDE0ZmNmOGRkNTQ3LTUwMDEzMDIwMS0yMDI2LTAyLTI2LWVu/tiny/armscyber.png <pre>armscyber\narmscyber\n4084311516\npr@armscyber.com\n</pre>\nSource: armscyber\n",
            "link": "https://www.fidelity.com/news/article/technology/202602260900PRIMZONEFULLFEED9660644",
            "pub_date": "2026-02-26 22:00:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Kimbell Royalty Partners Swings to Q4 Net Income, Revenue Rises",
            "description": "\n<p><chron>09:00 AM EST</chron>, <chron>02/26/2026</chron> (MT Newswires) -- <org value=\"KRP.NaE\" idsrc=\"xmltag.org\" >Kimbell Royalty Partners</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='KRP' fmr-param-security-type='Equity'>( KRP )</span>  reported Q4 net income Thursday of <money>$0.21</money> per unit, swinging from a loss of <money>$0.48</money> a year earlier.</p><p>Three analysts polled by FactSet expected EPS of <money>$0.11</money>.</p><p>Revenue for the quarter ended <chron>Dec. 31</chron> was <money>$82.5 million</money>, up from <money>$66.7 million</money> a year earlier.</p><p>Analysts surveyed by FactSet expected <money>$76.8 million</money>.</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602260900MIDNIGHTUSEQUITY_A3573551",
            "pub_date": "2026-02-26 22:00:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "iAltA Holdings Acquires Delio",
            "description": "\n<p><location value=\"LU/us.ny.nyc\" idsrc=\"xmltag.org\" >NEW YORK</location>, <chron>Feb.  26, 2026</chron>  (GLOBE NEWSWIRE) --  iAltA Holdings, the WestCap-backed private markets infrastructure company, today announced that it has acquired Delio, the leading provider of white-label operating systems for private markets distribution and reporting.</p>  <p>Delio provides the operating systems and investment structures that enable asset managers, wealth firms and other distributors to digitize, distribute, and report on private market products. Its Delio Core OS leverages configurable, low-code tools and modules to commoditize the technologies and workflows needed to deliver a market-leading digital client experience within alternative investing, making Delio an ideal addition to iAltA’s growing suite of solutions.</p>  <p>“We founded iAltA because we saw a tremendous market need to solve systemic issues within the private market landscape for general partners and distributors,” said <person>Scott Ganeles</person>, Chief Executive Officer and Founding Partner of iAltA. “Delio has emerged as a digital infrastructure provider of choice for financial institutions seeking to integrate alternatives into their offerings while maintaining control over client experience.”</p>  <p>Trusted by more than 50 global financial institutions across 18 regulatory jurisdictions, Delio’s infrastructure supports more than 12,000 end clients worldwide, reinforcing its position as the leading industry utility for digital private markets capability.</p>  <p>“Private markets have seen tremendous growth over the past few years, but the infrastructure has not kept up the demand for access and offerings,” said <person>Gareth Lewis</person>, Founder and Co-Chief Executive Officer of Delio. “iAltA is our ideal partner since both our organizations were founded on the principle that the markets need more seamless and effective solutions to meet the challenges of demand. This partnership will increase both our reach and our impact.”</p>  <p>The Delio acquisition is the third for iAltA’s Private Markets vertical, which seeks to empower asset managers and distributors to transact dynamically, efficiently engage with investors, streamline fund operations and make data-driven decisions. Last year, iAltA acquired Verivend and Betterfront. This year, iAltA announced that its Wealth focused vertical acquired BridgeFT.</p>  <p>Launched in 2025 by founding partners <person>Scott Ganeles</person>, <person>Bill Sherman</person>, <person>Bill Crager</person> and <person>Laurence Tosi</person>, iAltA has a unique holding structure that blends core shared capabilities with foundational technologies and strategic partnerships with industry leaders. Each subsidiary operates independently while collectively contributing to the holding company’s larger cross-functional strategy and unified digital ecosystem.</p>  <p><b>About iAltA</b></p>  <p>iAltA is a private markets infrastructure company founded by industry leaders who believe in solving systemic challenges with operator-caliber precision. Incubated and backed by WestCap, iAltA builds platforms that unify fragmented workflows, elevate transparency, and empower market participants throughout the investment lifecycle. Visit www.ialta.com.</p>  <p><b>About Delio</b></p>  <p>Delio empowers financial institutions and investment firms to maintain full control of their alternative investment capabilities through its white-label, AI-powered operating system, Delio Core OS. Combining configurable, low-code tools with a collaborative, non-conflicted approach, Delio enables firms to streamline compliant, scalable workflows across aggregation, structuring, distribution, administration and reporting – all while delivering a seamless user experience for their clients.</p>  <p><br/></p>  Image: https://www.globenewswire.com/newsroom/ti?nf=OTY2MTcwNiM3NDU2MTI1IzUwMDE1MzExMw==  <br/> Image: https://ml.globenewswire.com/media/YmFkYjU2MjgtMmMwNC00NjA3LWE5N2YtMDExMGZkMzA0M2I0LTUwMDE1MzExMy0yMDI2LTAyLTI2LWVu/tiny/iAltA.png <pre>Press Contact\nFor iAltA\n<person>Ray Hennessey</person>\nVOCATUS\nrh@vocatusllc.com</pre><p> Image: Primary Logo </p>\nSource: iAltA\n",
            "link": "https://www.fidelity.com/news/article/mergers-and-acquisitions/202602260900PRIMZONEFULLFEED9661706",
            "pub_date": "2026-02-26 22:00:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Vance heads to competitive Wisconsin district to highlight Trump's economy",
            "description": "\n<p><chron>Feb 26</chron> (Reuters) - U.S. Vice President JD Vance will travel on Thursday to a competitive district in <location value=\"LS/us.wi\" idsrc=\"xmltag.org\" >Wisconsin</location>, as the <org>White House</org> steps up efforts to protect the narrow Republican majority in the <org>House of Representatives</org> ahead of November's midterm elections.</p>\n<p>Vance will visit Plover, part of <location value=\"LS/us.wi\" idsrc=\"xmltag.org\" >Wisconsin's</location> third congressional district, represented by Republican <person>Derrick Van Orden</person> and one of two Republican-held seats in the state that Democrats are targeting this cycle.</p>\n<p>The vice president is set to tour a manufacturing facility to underscore President <person>Donald Trump's</person> economic message following his State of the Union address on Tuesday. </p>\n<p>During that speech, Trump offered a broad-based sweep of kitchen-table economic issues - housing, healthcare and utility bills - but he stopped short of acknowledging that many Americans are still struggling with the high cost of living, including food and housing prices.</p>\n<p>Some Republican party strategists have warned that without a more emphatic message on inflation, Republicans are at risk of losing control of <org>Congress</org> in the November election.</p>\n<p>Vance's trip is part of a <org>White House</org> push to showcase the president and top administration officials in key battleground areas to highlight Trump's economic agenda. Later this week, the president is scheduled to visit <location value=\"LS/us.tx\" idsrc=\"xmltag.org\" >Texas</location> for an event focused on energy and the economy.</p>\n<p>National Democrats said this week they are ramping up spending in the <location value=\"LS/us.wi\" idsrc=\"xmltag.org\" >Wisconsin</location> district, where <person>Van Orden</person> won re-election in 2024 by fewer than three percentage points.     </p>\n<p>Trump carried the district by seven points in 2024, part of a sweep of battleground states that propelled him to victory. The president endorsed <person>Van Orden</person> in the 2026 race 10 months ago.</p>\n<p>The trip will mark Vance's second visit to the district. He traveled to <location value=\"LU/us.wi.lacsse\" idsrc=\"xmltag.org\" >La Crosse, Wisconsin</location> in August to promote President Trump's tax and spending law.</p>\n<p></p>\n<p> (Reporting by <person>Nandita Bose</person> in <location value=\"LU/us.dc.wash\" idsrc=\"xmltag.org\" >Washington</location>; Editing by <person>Raju Gopalakrishnan</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/us-economy/202602260501RTRSNEWSCOMBINED_KBN3PG11C-OUSTP_1",
            "pub_date": "2026-02-26 18:01:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Research Alert: CFRA Maintains Strong Buy Opinion On Shares Of Nvidia Corporation",
            "description": "\n<p><chron>05:05 AM EST</chron>, <chron>02/26/2026</chron> (MT Newswires) -- CFRA, an independent research provider, has provided MT Newswires with the following research alert. Analysts at CFRA have summarized their opinion as follows:</p><p>We keep our <money>$250</money> target, on a P/E of ~24x our CY 27 EPS view of <money>$10.31</money>, above peers/below historical. We lift our FY 27 EPS  to <money>$8.15</money> from <money>$7.80</money> and  FY 28  to <money>$10.31</money> from <money>$10.00</money>. We believe that NVDA's growth is being supported by rising hyperscaler capex (over half of sales), but we think investors need to see greater signs of successful AI monetization from its customer base in a year where CEO Jensen Huang sees Agentic AI at an inflection point. The bar undoubtedly increases, as NVDA makes the case that compute equals revenue for their customers to justify the higher spend. We do expect sequential growth to slow in 2H (tougher comps) but think this is already discounted in shares, while Physical AI/Sovereign AI offers long term upside. We no longer assume NVDA will gain considerable traction in <location value=\"LC/cn\" idsrc=\"xmltag.org\" >China</location> while Rubin appears on pace to ramp in 2H. We think investors continue to underestimate NVDA's content growth potential but also acknowledge bottleneck risks from memory/power.</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/investing-ideas/202602260505MIDNIGHTUSEQUITY_A3572921",
            "pub_date": "2026-02-26 18:05:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Morning Bid: Nvidia's damp squib",
            "description": "<p><chron>Feb 26</chron> (Reuters) - What matters in U.S. and global markets today</p>\n<p>By <person>Mike Dolan</person>, Editor-At-Large, Finance and Markets</p>\n<p>Nvidia beat the street again, but there were no market fireworks this time. After topping analysts' revenue estimates for the latest quarter and their forecast for the next one, the AI giant's shares popped up about 3% out of hours - but they've given back most of that since.</p>\n<p>Questions about rising competition and the narrowness of the chip giant's customer base continue to rumble.</p>\n<p>I'll get into that and more below.</p>\n<p>But first, check out my latest column on the key bone of contention standing in the way of deeper EU-China trade ties.</p>\n<p>And listen to the latest episode of the Morning Bid daily podcast. Subscribe to hear Reuters journalists discuss the biggest news in markets and finance seven days a week.</p>\n<p>NVIDIA'S DAMP SQUIB</p>\n<p>The broad takeaway seems to be that Nvidia is now already well priced for the AI boom, even if the surge in overall AI infrastructure spending is clearly going up a gear.</p>\n<p>That much can be seen in rallying <location value=\"LR/asp\" idsrc=\"xmltag.org\" >Asia</location> markets where big chipmakers and computing hardware sellers dominate - with the staggering rise in <location value=\"LC/kr\" idsrc=\"xmltag.org\" >South Korea's</location> Kospi index adding nearly 4% on Thursday. The <location value=\"LU/kr..seoul\" idsrc=\"xmltag.org\" >Seoul</location> benchmark is now up a whopping 50% for the year so far and has doubled in six months.</p>\n<p>It wasn't all sweetness and light in the tech world, however. Even though the software sector at large continued its recovery on Wednesday, Salesforce fell back 4% overnight after its latest results, while HR software firm Workday dropped another 8% to five-year lows.</p>\n<p>The overall S&amp;P 500 still managed a punchy 0.8% gain on Wednesday and futures held those gains ahead of Thursday's bell. European stocks were firmer during a busy earnings day there.</p>\n<p>Meantime, <location value=\"LC/jp\" idsrc=\"xmltag.org\" >Japan's</location> Nikkei pushed slightly higher as attention focused on the Bank of Japan. The focus this week has been on Prime Minister <person>Sanae Takaichi's</person> nomination of two dovish names to the BoJ board, which some likened to the Federal Reserve independence worries in the U.S. The yen initially weakened on that news.</p>\n<p>However, many investors have downplayed the impact of the nominations as they replace two similarly dovish policymakers, and BoJ independence from government has always been much more tenuous anyway. The yen caught a foothold against the dollar today as a result.</p>\n<p>There's no stopping <location value=\"LC/cn\" idsrc=\"xmltag.org\" >China's</location> yuan, however. Not only does it continue to strengthen against the dollar to its best levels in almost three years, but it hit its highest in 9 months against the euro today too.</p>\n<p>Elsewhere, energy markets turned their attention back to <location value=\"LU/ch..geneva\" idsrc=\"xmltag.org\" >Geneva</location>, where nuclear talks between the U.S. and <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location> resume on Thursday. With betting markets still seeing more than a 50% chance of a limited U.S. military strike over the next month, crude oil prices seemed calm, helped by reports that OPEC+ was considering boosting production at its next meeting.</p>\n<p>Chart of the day</p>\n<p>The latest jump in South Korean shares on Thursday was led by chip giants Samsung Electronics and SK Hynix after upbeat Nvidia earnings were released stateside overnight.</p>\n<p>The Korean market surge has also been fuelled by governance reforms spearheaded by President <person>Lee Jae Myung</person>, and on Wednesday parliament passed a third revision to the Commercial Act aimed at better protecting shareholder interests.</p>\n<p>Today's events to watch</p>\n<p>* U.S. weekly jobless claims (<chron>8:30 a.m. EST</chron>)</p>\n<p>* U.S. 7-year note auction</p>\n<p>* U.S.-<location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location> nuclear talks resume in <location value=\"LU/ch..geneva\" idsrc=\"xmltag.org\" >Geneva</location></p>\n<p>Want to receive the Morning Bid in your inbox every weekday morning? Sign up for the newsletter here. You can find ROI on the Reuters website, and you can follow us on LinkedIn and X.</p>\n<p>Opinions expressed are those of the author. They do not reflect the views of <org>Reuters News</org>, which, under the Trust Principles, is committed to integrity, independence, and freedom from bias.</p>\n<p></p>\n<p>(By <person>Mike Dolan</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/international/202602260708RTRSNEWSCOMBINED_KBN3PG1EU-OUSBS_1",
            "pub_date": "2026-02-26 20:08:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Oil Prices Slump as U.S.-Iran Talks Resume and a Report Showed a Outsized Rise in U.S. Inventories",
            "description": "\n<p><chron>08:43 AM EST</chron>, <chron>02/26/2026</chron> (MT Newswires) -- Oil prices fell more than 2% early on Thursday as talks between <location value=\"LC/us\" idsrc=\"xmltag.org\" >the United States</location> and <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location> resume in <location value=\"LU/ch..geneva\" idsrc=\"xmltag.org\" >Geneva</location> while a report showed an outsized rise in U.S. oil inventories last week.</p><p>West Texas Intermediate crude oil for April delivery was last seen down <money>US$1.67</money> to <money>US$63.75</money> per barrel, while <person>April Brent</person> oil was down <money>US$1.56</money> to <money>US$69.29</money>.</p><p>The resumption of indirect talks between <location value=\"LC/us\" idsrc=\"xmltag.org\" >the United States</location> and <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location> is cutting into the geopolitical risk premium that has come as traders assess the odds of President Trump will order the armada he has assembled to attack the OPEC+ member and <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location> responds by closing the <location>Strait of Hormuz</location>, the chokepoint for nearly a fifth of global oil exports from Persian Gulf states.</p><p>However a successful conclusion to the negotiations is not a given. <org>The Trump Administration</org> is said to be pressing for and end to <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran's</location> uranium enrichment program as it looks to end the possibility of the <org>Islamic Republic</org> developing nuclear weapons. For its part, <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location> has said it has no plans to build a nuclear bomb and claims the enrichment program is for civilian purposes and is unwilling to end enrichment, while maintaining its right to continue building missiles and supporting militia groups in Middle Eastern countries.</p><p>&quot;Iranian officials for their part have stated that they are exclusively pursuing a civilian nuclear program, and that forgoing domestic enrichment is a nonstarter. <location value=\"LU/ir..tehran\" idsrc=\"xmltag.org\" >Tehran</location> has indicated that it is willing to potentially halt high-level uranium enrichment, reduce its overall stockpile of enriched material, and only use older, slower centrifuges. Beyond enrichment, <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location> has also ruled out concessions on its missile programs and support for its regional armed proxies. Whether this will be sufficient for <location value=\"LU/us.dc.wash\" idsrc=\"xmltag.org\" >Washington</location> remains to be seen,&quot; <person>Helima Croft</person>, Head of <org>Global Commodity Strategy and MENA Research</org> at <org>RBC Capital Markets</org>, wrote.</p><p>Despite the risks to Persian Gulf supply, the market remains oversupplied as global production continues to run ahead of demand as producers in OPEC+ and the Americas boost output while demand growth slows, boosting global inventories. <org>The Energy Information Agency</org> on Wednesday reported U.S. commercial oil inventories rose by 16-million barrels last week, the largest weekly build in three years, according to Reuters.</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/us-markets/202602260843MIDNIGHTUSEQUITY_A3573509",
            "pub_date": "2026-02-26 21:43:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US weekly jobless claims increase marginally as labor market stabilizes",
            "description": "\n<p><location value=\"LU/us.dc.wash\" idsrc=\"xmltag.org\" >WASHINGTON</location>, <chron>Feb 26</chron> (Reuters) - The number of Americans filing new applications for jobless  benefits increased marginally last week and the unemployment rate appeared to hold steady in February amid a stable labor market.</p>\n<p>Initial claims for state unemployment benefits rose 4,000 to a seasonally 212,000 for the week ended <chron>February 21</chron>, the <org>Labor Department</org> said on Thursday. Economists polled by Reuters had forecast 215,000 claims for the latest week.</p>\n<p>Last week's claims included the Presidents' Day holiday, which could have impacted the data. Nonetheless, the level of claims suggested that the labor market continued to stabilize after hitting a soft patch last year amid uncertainty stemming from President <person>Donald Trump's</person> broad tariffs.</p>\n<p><org>The U.S. Supreme Court</org> last Friday struck down the tariffs, which Trump pursued under a law meant for use in national emergencies. Trump swiftly imposed a 10% global tariff for 150 days to replace some of the emergency duties, before raising the rate to 15% over the weekend.</p>\n<p>Economists said the latest moves created near-term uncertainty, but anticipated minimal economic impact. </p>\n<p>Lingering uncertainty from the since-invalidated import duties was blamed for a general hesitancy among businesses to increase hiring. A rapid adoption of artificial intelligence is also adding another layer of caution, economists said.</p>\n<p>The number of people receiving unemployment benefits after an initial week of aid, a proxy for hiring, dropped 31,000 to a seasonally adjusted 1.833 million during the week ended <chron>February 14</chron>, the claims report showed. The so-called continuing claims covered the period during which the government surveyed households for February's unemployment rate. </p>\n<p>The jobless rate eased to 4.3% in January from 4.4% in December. While the labor market is regaining its footing, consumers remain anxious about their employment prospects.</p>\n<p>A survey from the Conference Board this week showed the share of consumers who viewed jobs as &quot;hard to get&quot; increased to a five-year high in February, though households also believed the availability of jobs had improved.</p>\n<p>The median duration of unemployment is near four-year highs, and job opportunities remain scarce for young college graduates, labor market data shows. </p>\n<p>Jobless recent college graduates do not show in the claims data because they have limited or no work history, making them ineligible to file for unemployment benefits.</p>\n<p></p>\n<p> (Reporting by Lucia Mutikani; Editing by <person>Chizu Nomiyama</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/us-economy/202602260841RTRSNEWSCOMBINED_KBN3PG1NF-OUSBS_1",
            "pub_date": "2026-02-26 21:41:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        }
    ]
}