{
    "data": [
        {
            "title": "US STOCKS-Wall St ends lower as tech rally stalls, AI fervor wanes after Nvidia results",
            "description": "\n<p>*</p>\n<p>Philadelphia SE Semiconductor index set to snap 10-week\nwinning\nstreak</p>\n<p></p>\n<p>*</p>\n<p><org value=\"TTD.NaE\" idsrc=\"xmltag.org\" >Trade Desk</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='TTD' fmr-param-security-type='Equity'>( TTD )</span> plunges after Q1 revenue forecast below\nestimates</p>\n<p></p>\n<p>*</p>\n<p><person>J.M. Smucker</person> jumps on Q3 beat, deal with Elliott</p>\n<p>(Updates to market close)</p>\n<p>By <person>Stephen Culp</person> and <person>Ragini Mathur</person></p>\n<p><location value=\"LU/us.ny.nyc\" idsrc=\"xmltag.org\" >NEW YORK</location>, <chron>Feb 26</chron> (Reuters) - U.S. stocks turned sharply\nlower on Thursday, the day after earnings from artificial\nintelligence vanguard <org value=\"NVDA.NaE\" idsrc=\"xmltag.org\" >Nvidia</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NVDA' fmr-param-security-type='Equity'>( NVDA )</span> failed to impress\ninvestors, weighing down technology shares which have provided\nmuscle to the recent rally.</p>\n<p>A pivot back to cyclical sectors helped keep the Dow close\nto even, while a drop in the Philadelphia SE Semiconductor index\ndragged the tech-laden Nasdaq down the most.</p>\n<p>With Thursday's drop, the SOX, which has surged\nyear-to-date, was on the verge of snapping what would have been\na record 11-week winning streak.</p>\n<p>Technology shares in general, and software\nand chips in particular, have see-sawed in recent\nweeks as investors wrestle with uneasiness over the massive\ncosts and potential disruption of nascent AI technology.</p>\n<p>While all three major U.S. stock indexes are on track for\nmodest weekly losses, the S&amp;P 500 and the Nasdaq are poised to\nclose lower on the month. The Dow remains on track to post an\nadvance in February.</p>\n<p><org value=\"NVDA.NaE\" idsrc=\"xmltag.org\" >Nvidia's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NVDA' fmr-param-security-type='Equity'>( NVDA )</span> fourth-quarter results, posted after Wednesday's\nclosing bell, were better than analysts expected, and the\nchipmaker provided above-market estimates. But the world's\nrichest company by market cap wrestled with increasingly\ndifficult year-on-year comparisons as its revenue growth\ndecelerates.</p>\n<p>&quot;It feels like an <org value=\"NVDA.NaE\" idsrc=\"xmltag.org\" >Nvidia</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NVDA' fmr-param-security-type='Equity'>( NVDA )</span> hangover that's specific to the\nAI space,&quot; said <person>Michael Green</person>, chief strategist at Simplify\nAsset Management in <location value=\"LU/us.pa.phldph\" idsrc=\"xmltag.org\" >Philadelphia</location>. &quot;The S&amp;P itself is being\ndragged down by <org value=\"NVDA.NaE\" idsrc=\"xmltag.org\" >Nvidia</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NVDA' fmr-param-security-type='Equity'>( NVDA )</span> and the Magnificent 7, and the Nasdaq is\nreally getting hammered.&quot;</p>\n<p>&quot;It's as simple investors being levered long in <org value=\"NVDA.NaE\" idsrc=\"xmltag.org\" >Nvidia</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NVDA' fmr-param-security-type='Equity'>( NVDA )</span>\nand short the AI disruption,&quot; Green added. &quot;And when that failed\nto materialize in a large enough scale, they sold out of their\nposition, driving <org value=\"NVDA.NaE\" idsrc=\"xmltag.org\" >Nvidia</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NVDA' fmr-param-security-type='Equity'>( NVDA )</span> down and pushing the stocks they were\nshort back up.&quot;</p>\n<p></p>\n<p>According to preliminary data, the S&amp;P 500 lost 37.12\npoints, or 0.53%, to end at 6,909.01 points, while the Nasdaq\nComposite lost 272.93 points, or 1.18%, to 22,879.14.\nThe Dow Jones Industrial Average rose 18.61 points, or\n0.04%, to 49,500.76.</p>\n<p>The S&amp;P 500 software and services index gained\nground after being battered in recent weeks on worries of\npossible disruption from AI. The index got a boost from\n<org value=\"CRM.NaE\" idsrc=\"xmltag.org\" >Salesforce</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='CRM' fmr-param-security-type='Equity'>( CRM )</span> shares, even though the company provided\nweaker-than-expected revenue guidance.</p>\n<p><org value=\"TTD.NaE\" idsrc=\"xmltag.org\" >Trade Desk</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='TTD' fmr-param-security-type='Equity'>( TTD )</span> slid following its disappointing revenue\nforecast amid mounting pressure from larger rivals.\n<person>J.M. Smucker</person> surged on the packaged food company's solid\nquarterly profit and sales estimates.</p>\n<p><org value=\"AI.NaE\" idsrc=\"xmltag.org\" >C3.ai</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AI' fmr-param-security-type='Equity'>( AI )</span> tumbled after it provided a\nweaker-than-expected current-quarter sales forecast and\nannounced it would slash 26% of its global workforce.</p>\n<p><org>Celsius Holding</org> jumped after the energy drink maker\nbeat quarterly revenue estimates.</p>\n<p>(Reporting by <person>Stephen Culp</person>; Additional reporting by <person>Shashwat\nChauhan</person> and <person>Ragini Mathur</person> in Bengaluru; Editing by <person>David\nGregorio</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/us-markets/202602261600RTRSNEWSCOMBINED_L6N3ZM18L_1",
            "pub_date": "2026-02-27 05:00:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Intuit expects profit below estimates on higher marketing spend during US tax season",
            "description": "<p><chron>Feb 26</chron> (Reuters) - Intuit forecast third-quarter profit below <location>Wall Street</location> estimates on Thursday, as it anticipates higher marketing spending to attract more customers during the U.S. tax season.</p>\n<p>Shares of the company fell around 3% in extended trading.</p>\n<p>The third quarter is typically Intuit's strongest, as the tax season boosts demand for the company's financial management tools such as TurboTax, Credit Karma, and QuickBooks.</p>\n<p>The <org>Internal Revenue Service</org> (IRS), the U.S. federal government agency, began accepting federal tax returns on <chron>January 26</chron> this year, with the filing deadline set for <chron>April 15</chron>.</p>\n<p>Intuit CFO <person>Sandeep Aujla</person> told Reuters that increased marketing and customer support spending are deployed in the third quarter to capitalize on the tax season and drive growth in the assisted tax and QuickBooks segments.</p>\n<p>The company forecast adjusted earnings per share of <money>$12.45</money> to <money>$12.51</money> for the third quarter ending <chron>April 30</chron>, compared with analysts' average estimate of <money>$12.95</money>, according to data compiled by LSEG.</p>\n<p>It expects about 10% revenue growth in the quarter, largely in line with analysts' average estimate of 9.9% growth.</p>\n<p>The forecasts come amid market fears that the growing use of AI tools would erode demand for traditional software, as customers increasingly seek personalized financial guidance and automated solutions for tasks such as bookkeeping.</p>\n<p>To better compete with rivals such as H&amp;R Block, Oracle's NetSuite and Microsoft's Dynamics 365 Platform, Intuit has signed multi-year deals with AI startups Anthropic and OpenAI to integrate their frontier models into its software.</p>\n<p>&quot;We're paying OpenAI and Anthropic for the capabilities. We're not paying them revenue share,&quot; Aujla said, adding that more than 3 million clients engage with the company's AI agents.</p>\n<p>Intuit reiterated its fiscal 2026 forecasts and said its second-quarter revenue grew 17% to <money>$4.65 billion</money>, beating analysts' average estimate of <money>$4.53 billion</money>.</p>\n<p> (Reporting by <person>Jaspreet Singh</person> in Bengaluru; Editing by Shinjini Ganguli)</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602261602RTRSNEWSCOMBINED_KBN3PG2K3-OUSBS_1",
            "pub_date": "2026-02-27 05:02:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "MARA Announces Strategic Partnership with Starwood to Accelerate Delivery of Cutting Edge Hyperscale, Enterprise and AI Capable Digital InfrastructureÂ",
            "description": "\n<p><i>Joint Platform Expected to Deliver Approximately 1 GW of Near-Term IT Capacity, with Pathway to More than 2.5 GW </i></p>  <p align=\"justify\"><strong><location value=\"LU/us.fl.miami\" idsrc=\"xmltag.org\" >Miami, FL</location>, <chron>Feb.  26, 2026</chron>  (GLOBE NEWSWIRE) -- </strong><org value=\"MARA.NaE\" idsrc=\"xmltag.org\" >MARA Holdings, Inc.</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='MARA' fmr-param-security-type='Equity'>( MARA )</span> , a leading energy and compute infrastructure company, today announced it has entered into a strategic agreement with <org>Starwood Capital Group</org> (“Starwood”) and their dedicated data center development platform <org>Starwood Digital Ventures</org> (“SDV”). The partnership will enable the conversion and expansion of select MARA sites into next generation digital infrastructure capable of meeting the growing demand from enterprise, hyperscale and AI customers.</p>  <p align=\"justify\">Together, MARA and Starwood will jointly develop, finance, and operate digital infrastructure projects across MARA’s existing, power-rich portfolio. SDV will lead design, development, tenant sourcing, construction and facility operations with Starwood, a leading global investment firm, providing investment expertise to support enhanced project-level economics. MARA will contribute dedicated, energy-advanced data center sites. Together, the companies expect to deliver approximately 1 gigawatt of near-term IT capacity with a pathway to more than 2.5 gigawatts. By combining MARA’s energy-backed infrastructure and operating discipline with SDV’s proven track record, we believe the companies will bring leading digital infrastructure to market faster and with greater certainty than traditional development models.</p>  <p align=\"justify\">“MARA’s power rich sites give customers what they need most: predictable access to energy at scale,” said <person>Fred Thiel</person>, MARA’s Chairman and CEO. “Our partnership with Starwood will allow us to turn that power certainty into capacity certainty, so customers can run diverse workloads close to their data and users. This joint venture structure also gives us a more capital-efficient way to accelerate the buildout of digital infrastructure across our portfolio. Together, this partnership will accelerate our expansion into high-performance computing and advance our strategy to build an integrated, energy-backed digital infrastructure platform.”</p>  <p align=\"justify\">“We are excited to partner with MARA and leverage the skill and industry expertise of our <org>Starwood Digital Ventures</org> platform to create significant value together,” said <person>Barry Sternlicht</person>, Chairman and CEO of <org>Starwood Capital</org>. “Data centers are the infrastructure responsible for driving the modern economy, and our partnership with MARA expands our opportunities to continue investing in this sector.”</p>  <p align=\"justify\">“Under this partnership, SDV will leverage the strong execution capabilities and decades of experience across its team to deliver the scale and performance modern customers demand with an emphasis on community-conscious infrastructure,” said <person>Anthony Balestrieri</person>, Managing Director and Chief Executive Officer for <org>Starwood Digital Ventures</org>. “MARA’s operating sites and energy expertise help advance SDV’s operating philosophy in new and growing markets.”</p>  <p align=\"justify\"><b>The Intersection of Energy and Compute</b></p>  <p align=\"justify\">MARA’s sites operate at the intersection of energy and compute, and SDV’s development engine adds the strong execution and operating capabilities that will be required to convert and expand these sites into scalable and sustainable digital infrastructure.</p>  <p align=\"justify\">The companies will prioritize sites with access to low-cost energy, strong interconnection positions, and clear pathways to scale. These campuses will be designed to operate both Bitcoin mining and AI compute, giving MARA the ability to toggle workloads in response to market pricing and customer demand. This flexibility will create a clear upside for both partners, preserve economics across cycles, and provide a foundation for long term growth.</p>  <p align=\"justify\"><b>MARA Conference Call and <location>Fourth Quarter</location> and Fiscal Year 2025 Results </b></p>  <p align=\"justify\">MARA has separately announced financial results for the fourth quarter and fiscal year ended <chron>December 31, 2025</chron>. The Company will hold a webcast and conference call at <chron>5:00 p.m. Eastern Time</chron> (<chron>2:00 p.m. Pacific Time</chron>) today to discuss financial results.</p>  <p align=\"justify\">To register to participate in the conference call, please use the link below.</p>  <p align=\"justify\">Date: <chron>Thursday, February 26, 2026</chron><br/>Time: <chron>5:00 p.m. Eastern time</chron> (<chron>2:00 p.m. Pacific time</chron>)<br/>Registration link: LINK</p>  <p align=\"justify\">The webcast will also be available for replay at MARA’s website at ir.mara.com. If you have any difficulty connecting to the conference call, please contact MARA’s investor relations team at ir@mara.com.</p>  <p align=\"justify\"><b>Advisors</b></p>  <p align=\"justify\">JLL and Paul, Weiss, Rifkind, <org>Wharton and Garrison LLP</org> are serving as MARA's strategic and legal advisors in the transaction, respectively.</p>  <p align=\"justify\"><b>About MARA</b></p>  <p align=\"justify\">MARA deploys digital energy technologies to advance the world's energy systems. Harnessing the power of compute, MARA transforms excess energy into digital capital, balancing the grid and accelerating the deployment of critical infrastructure. Building on its expertise to redefine the future of energy, MARA develops technologies that reduce the energy demands of high-performance computing applications, from AI to the edge.</p>  <p align=\"justify\">For more information, visit www.mara.com, or follow us on:<br/>X: @MARA<br/>LinkedIn: www.linkedin.com/company/MARAHoldings <br/>Facebook: www.facebook.com/MARAHoldings <br/>Instagram: @MARAHoldingsInc</p>  <p align=\"justify\"><b>About <org>Starwood Capital Group</org></b></p>  <p align=\"justify\"><org>Starwood Capital Group</org> (“Starwood”) is a leading global investment firm with more than <money>$125 billion</money> of assets under management. Starwood focuses on investing in real assets around the globe and has invested in virtually every category of real estate totaling more than <money>$260 billion</money> of assets over its more than 30-year history.</p>  <p align=\"justify\">Starwood has assembled one of the largest global, privately held data center development portfolios with its platforms <org>Starwood Digital Ventures</org>, Echelon Data Centers, its investment in ESR in <location value=\"LR/asp\" idsrc=\"xmltag.org\" >Asia</location> and joint ventures with major electric and telecom utilities including Iberdrola, S.A. in <location value=\"LC/es\" idsrc=\"xmltag.org\" >Spain</location> and Telstra Group in <location value=\"LC/au\" idsrc=\"xmltag.org\" >Australia</location>. Starwood is also a leading provider of credit to digital infrastructure projects through its listed mortgage REIT, Starwood Property Trust, its credit fund series and its infrastructure lending platform, Starwood Infrastructure Finance (“SIF”), which focuses on the power and energy sectors. Internationally, major development projects are currently in process in the UK, <location value=\"LC/ie\" idsrc=\"xmltag.org\" >Ireland</location>, <location value=\"LC/es\" idsrc=\"xmltag.org\" >Spain</location>, <location value=\"LC/it\" idsrc=\"xmltag.org\" >Italy</location>, <location value=\"LC/au\" idsrc=\"xmltag.org\" >Australia</location>, and <location value=\"LC/jp\" idsrc=\"xmltag.org\" >Japan</location>.</p>  <p align=\"justify\"><b>About <org>Starwood Digital Ventures</org></b></p>  <p align=\"justify\"><org>Starwood Digital Ventures</org> (“SDV”) is Starwood Capital Group’s specialized, in-house platform for digital infrastructure investment, focusing on the development and management of data centers and digital assets. SDV’s 94-person team with data center expertise across more than 10 GW leverages decades of proven development experience and the latest technology to ensure its facilities are built and operate to the highest standards.</p>  <p align=\"justify\"><b>MARA Investor Notice</b></p>  <p align=\"justify\">Investing in MARA securities involves a high degree of risk. Before making an investment decision, you should carefully consider the risks, uncertainties and forward-looking statements described under the heading “Risk Factors” in MARA’s most recent Annual Report on Form 10-K and any other periodic reports that MARA may file with the <org>Securities and Exchange Commission</org> (the “SEC”). If any of these risks were to occur, MARA’s business, financial condition or results of operations would likely suffer. In that event, the value of MARA securities could decline, and you could lose part or all of your investment. The risks and uncertainties described herein and in MARA’s <org>SEC</org> filings are not the only ones facing MARA. Additional risks not presently known to MARA or that MARA currently deems immaterial may also impair MARA’s business operations. In addition, MARA’s past financial performance may not be a reliable indicator of future performance, and historical trends should not be used to anticipate results in the future. See “Forward-Looking Statements” below.</p>  <p><b>Forward-Looking Statements</b></p>  <p align=\"justify\">This press release contains forward-looking statements within the meaning of the federal securities laws. All statements, other than statements of historical fact, included in this press release are forward-looking statements. The words “may,” “will,” “could,” “anticipate,” “expect,” “intend,” “believe,” “continue,” “target” and similar expressions or variations or negatives of these words are intended to identify forward-looking statements, although not all forward-looking statements contain these identifying words. Such forward-looking statements include, among other things, statements related to MARA and SDV’s planned joint development of digital infrastructure projects; the expected capacity, scalability and performance of those facilities; the anticipated ability to shift between hyperscale and AI workloads and Bitcoin mining at those facilities; the anticipated benefits of the proposed transaction to MARA, including MARA’s expansion into high-performance computing; and MARA and SDV’s ability to advance and execute their joint digital energy infrastructure strategy. Such forward-looking statements are based on management's current expectations about future events as of the date hereof and involve many risks and uncertainties that could cause MARA’s actual results to differ materially from those expressed or implied in these forward-looking statements. Subsequent events and developments, including actual results or changes in MARA’s assumptions, may cause MARA’s views to change. Readers are cautioned not to place undue reliance on such forward-looking statements. All forward-looking statements included herein are expressly qualified in their entirety by these cautionary statements. Actual results may differ materially from those indicated by such forward-looking statements as a result of various important factors, including uncertainties related to market conditions, the other factors discussed in the “Risk Factors” section of MARA’s most recent Annual Report on Form 10-K filed with the U.S. <org>SEC</org> and the risks described in other filings that MARA may make from time to time with the <org>SEC</org>. Any forward-looking statements contained in this press release speak only as of the date hereof, and MARA specifically disclaims any obligation to update any forward-looking statement, whether as a result of new information, future events, or otherwise, except to the extent required by applicable law.</p>  <p><b>Contacts </b></p>  <p><b>MARA Contacts:</b><br/>MARA Investor Relations: ir@mara.com<br/>MARA Media: mara‑jf@joelefrank.com</p>  <p><b>Starwood Digital Ventures Contacts:</b><br/><person>Dana Gorman</person> / <person>Mallory Griffin</person> <br/>H/Advisors Abernathy <br/>dana.gorman@h-advisors.global / mallory.griffin@h-advisors.global <br/>212.371.5999</p>  Image: https://www.globenewswire.com/newsroom/ti?nf=OTY2MjQ3NCM3NDU4MjU0IzUwMDExNTk4MQ==  <br/> Image: https://ml.globenewswire.com/media/OTZkMTNiNTUtYWYwNy00YjUwLWI4OTQtMDVlNDhiOTc3ZTFiLTUwMDExNTk4MS0yMDI2LTAyLTI2LWVu/tiny/MARA-Holdings-Inc-.png <p> Image: Primary Logo </p>\nSource: <org value=\"MARA.NaE\" idsrc=\"xmltag.org\" >MARA Holdings, Inc.</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='MARA' fmr-param-security-type='Equity'>( MARA )</span>\n",
            "link": "https://www.fidelity.com/news/article/technology/202602261615PRIMZONEFULLFEED9662474",
            "pub_date": "2026-02-27 05:15:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Dover Fueling Solutions Launches ProGauge LR120 Radar to Enhance Accuracy and Visibility in Industrial Applications",
            "description": "\n<div class=\"xn-content\">\n<p><span class=\"legendSpanClass\"><location value=\"LU/us.il.dowove\" idsrc=\"xmltag.org\" >DOWNERS GROVE, Ill.</location></span>, <span class=\"legendSpanClass\"><chron>Feb. 26, 2026</chron></span> /PRNewswire/ -- Dover Fueling Solutions (\"DFS\"), a part of Dover and a leading global provider of advanced customer-focused technologies, services and solutions in the fuel and convenience retail industries, today announced the launch of the ProGauge<sup>®</sup> LR120 Radar, DFS's latest automatic tank gauging (ATG) solution specifically designed for industrial applications.</p>\n    <div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder1\">\n                <p>\n\n                    <img src=\"https://mma.prnewswire.com/media/2727878/Dover_blue_Logo.jpg\" title=\"Dover Logo (PRNewsfoto/Dover)\" alt=\"Dover Logo (PRNewsfoto/Dover)\" />\n\n                </p>\n    </div>\n<p>The LR120 Radar, which is available across <location value=\"LR/eur\" idsrc=\"xmltag.org\" >Europe</location>, the <location value=\"LR/mde\" idsrc=\"xmltag.org\" >Middle East</location>, and <location value=\"LR/afr\" idsrc=\"xmltag.org\" >Africa</location> (EMEA), as well as <location value=\"LR/sam\" idsrc=\"xmltag.org\" >South America</location> and <location value=\"LR/cam\" idsrc=\"xmltag.org\" >Latin America</location>, offers an exceptionally accurate solution that seamlessly integrates with the ProGauge MagLink LX<sup>®</sup> console family, providing operators with increased visibility.</p><p>Packaged in an airtight PVDF enclosure for years of reliable measurement service, the LR120 Radar delivers precise level measurement at ranges up to 98.4 ft (30 meters). Its long range, narrow beam makes it best suited for tanks, wet wells with obstructions, and solid level measurement. The LR120 Radar is also approved for open air applications outside of tanks and is hazardous area-compliant for use in explosive environments containing dust.</p><p>\"The ProGauge portfolio has evolved into a one-stop-shop for fuel management and is considered to be one of the leading brands for ATG solutions in the industry,\" said <person>Nuno Almeida</person>, DFS Director, Product Management, EMEA. \"By expanding our product portfolio to include accurate measurement for industrial applications, we are continuing to deliver truly global solutions that help provide operators with complete and accurate visibility into their stocks.\"</p><p>The LR120 Radar is compact and easy to install, and its 2mm accuracy near zero range distance yields optimum inventory management capability for a wide range of operators.</p><p><person>Stefano Scatena</person>, DFS Senior Director and General Manager, ATG &amp; WSM, added, \"Wherever our customers are in the world, whatever their needs, and whatever their forecourt set-up, the ProGauge portfolio has a solution to suit. The new LR120 Radar reflects our ability to help operators monitor and measure any liquid or solid on a site.\"</p><p><b>About Dover Fueling Solutions:</b></p><p>Dover Fueling Solutions<sup>®</sup> (DFS) is part of <org value=\"DOV.NaE\" idsrc=\"xmltag.org\" >Dover Corporation</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='DOV' fmr-param-security-type='Equity'>( DOV )</span> and a leading provider of advanced energy dispensing equipment, electronic automation, point-of-sale and payment systems, automatic tank gauging and subscription solutions to fueling and convenience retail customers worldwide. Comprised of brands Wayne®, Tokheim®, OPW®, ProGauge™, Fairbanks®, AvaLAN Networks™, LIQAL®, Bulloch Technologies®, and SiteIQ™, DFS is dedicated to offering a broad range of solutions that power vehicles, including conventional fuel and clean energy products that support gasoline, diesel, bio-diesel and ethanol as well as LNG, H2, LPG, CNG and EV chargers. Headquartered in <location value=\"LU/us.tx.austin\" idsrc=\"xmltag.org\" >Austin, TX</location>, DFS has a strong global manufacturing and technology development presence, including facilities in <location value=\"LC/br\" idsrc=\"xmltag.org\" >Brazil</location>, <location value=\"LC/ca\" idsrc=\"xmltag.org\" >Canada</location>, <location value=\"LC/cn\" idsrc=\"xmltag.org\" >China</location>, <location value=\"LC/in\" idsrc=\"xmltag.org\" >India</location>, <location value=\"LC/it\" idsrc=\"xmltag.org\" >Italy</location>, <location value=\"LC/pl\" idsrc=\"xmltag.org\" >Poland</location>, <location value=\"LC/be\" idsrc=\"xmltag.org\" >Belgium</location>, <location value=\"LC/nl\" idsrc=\"xmltag.org\" >the Netherlands</location>, the <location value=\"LC/gb\" idsrc=\"xmltag.org\" >United Kingdom</location> and <location value=\"LC/us\" idsrc=\"xmltag.org\" >the United States</location>. For more information about DFS, visit www.doverfuelingsolutions.com.</p><p><b>About Dover:</b></p><p>Dover is a diversified global manufacturer and solutions provider with annual revenue of over <money>$8 billion</money>. We deliver innovative equipment and components, consumable supplies, aftermarket parts, software and digital solutions, and support services through five operating segments: Engineered Products, Clean Energy &amp; Fueling, Imaging &amp; Identification, Pumps &amp; Process Solutions and Climate &amp; Sustainability Technologies. Dover combines global scale with operational agility to lead the markets we serve. Recognized for our entrepreneurial approach for over 70 years, our team of approximately 24,000 employees takes an ownership mindset, collaborating with customers to redefine what's possible. Headquartered in <location value=\"LU/us.il.dowove\" idsrc=\"xmltag.org\" >Downers Grove, Illinois</location>, Dover trades on the <org>New York Stock Exchange</org> under \"DOV.\" Additional information is available at dovercorporation.com.</p><p><b>Dover Fueling Solutions Contact:<br /></b><person>Amy Cearley</person><br />(512) 484-4259<br />amy.cearley@doverfs.com</p><p><b>Dover Media Contact:<br /></b>Adrian Sakowicz, VP, Communications<br />(630) 743-5039<br />asakowicz@dovercorp.com</p><p><b>Dover Investor Contact:<br /></b><person>Jack Dickens</person>, VP, Investor Relations<br />(630) 743-2566<br />jdickens@dovercorp.com</p>\n\n\n\n<p id=\"PURL\"><img title=\"Cision\" width=\"12\" height=\"12\" alt=\"Cision\" src=\"https://edge.prnewswire.com/c/img/favicon.png?sn=NY96710&amp;sd=2026-02-26\" /> View original content to download multimedia:https://www.prnewswire.com/news-releases/dover-fueling-solutions-launches-progauge-lr120-radar-to-enhance-accuracy-and-visibility-in-industrial-applications-302698552.html</p><p>SOURCE Dover</p></div>\n",
            "link": "https://www.fidelity.com/news/article/technology/202602261615PR_NEWS_USPR_____NY96710",
            "pub_date": "2026-02-27 05:15:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Coterra Energy misses quarterly profit estimates on weaker crude prices",
            "description": "\n<p><chron>Feb 26</chron> (Reuters) - Oil and gas producer <org value=\"CTRA.NaE\" idsrc=\"xmltag.org\" >Coterra Energy</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='CTRA' fmr-param-security-type='Equity'>( CTRA )</span>\nmissed <location>Wall Street</location> expectations for fourth-quarter\nprofit on Thursday, hurt by weaker crude prices.</p>\n<p>Global crude prices have come under pressure amid rising\nconcerns about oversupply, with <location value=\"LC/ve\" idsrc=\"xmltag.org\" >Venezuela</location> expected to add more\nbarrels.</p>\n<p>The company said the average price of oil was <money>$58.16</money> per\nbarrel during the quarter, compared with <money>$68.57</money> per barrel a\nyear earlier.</p>\n<p>However, record oil production in <location value=\"LC/us\" idsrc=\"xmltag.org\" >the United States</location> helped\ncushion the impact of weaker prices, with the country's output\naveraging about 13.6 million barrels per day in 2025, compared\nwith 13.2 million bpd a year earlier.</p>\n<p><org value=\"CTRA.NaE\" idsrc=\"xmltag.org\" >Coterra Energy</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='CTRA' fmr-param-security-type='Equity'>( CTRA )</span> said it produced 813,100 barrels of oil\nequivalent per day during the fourth quarter, up from 681,500\nboepd a year earlier.</p>\n<p>The company posted an adjusted profit of <money>39 cents</money> per share\nfor the three months ended <chron>December 31</chron>, compared with analysts'\naverage estimate of <money>48 cents</money>, according to data compiled by\nLSEG.\n(Reporting by <person>Sumit Saha</person> in Bengaluru; Editing by Shinjini\nGanguli)</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602261613RTRSNEWSCOMBINED_L4N3ZM2BG_1",
            "pub_date": "2026-02-27 05:13:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Diversified to Acquire Complementary, High-Quality, Low-Decline Producing Assets",
            "description": "\n<p align=\"justify\"><location value=\"LU/us.al.brmham\" idsrc=\"xmltag.org\" >BIRMINGHAM, Ala.</location>, <chron>Feb.  26, 2026</chron>  (GLOBE NEWSWIRE) -- <org value=\"DEC.NaE\" idsrc=\"xmltag.org\" >Diversified Energy Company</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='DEC' fmr-param-security-type='Equity'>( DEC )</span> (&quot;Diversified&quot; or the &quot;Company&quot;) is pleased to announce the execution of a purchase and sale agreement for the acquisition of high-working interest, natural gas properties and related facilities located in east <location value=\"LS/us.tx\" idsrc=\"xmltag.org\" >Texas</location> (the &quot;Assets&quot;) from Sheridan Production (the &quot;Seller&quot;) (the &quot;Acquisition&quot;).</p>  <p align=\"justify\">The Acquisition is expected to be funded through existing liquidity from Diversified’s senior secured bank facility. The Company expects to close the Acquisition in the second quarter of 2026, subject to customary closing conditions.</p>  <p align=\"left\"><strong>Acquisition Highlights</strong></p>  <ul type=\"disc\"><li style=\"text-align:left;\">Purchase price of <money>$245 million</money> in cash before anticipated, customary purchase price adjustments</li><li style=\"text-align:left;\">Net purchase price represents estimated ~PV-15 valuation</li><li style=\"text-align:left;\">2026 estimated net production of ~62 MMcfepd (~10 Mboepd)<sup>(a)</sup> with low annual declines of ~6%<sup>(b)</sup>   <ul type=\"circle\"><li style=\"text-align:left;\">Complements Diversified’s industry-leading corporate declines and low capital intensity</li><li style=\"text-align:left;\">Gas-weighted production with ~72% gas volumes</li></ul>   </li><li style=\"text-align:left;\">Estimated NTM EBITDA of <money>~$52 million</money><sup>(c)</sup>    <ul type=\"circle\"><li style=\"text-align:left;\">PDP Reserves of ~397 Bcfe with estimated PV-10 of <money>$310 million</money><sup>(b)</sup></li></ul>   </li><li style=\"text-align:left;\">Assets are contiguous with Diversified's existing <location value=\"LS/us.tx\" idsrc=\"xmltag.org\" >East Texas</location> assets   <ul type=\"circle\"><li style=\"text-align:left;\">Proximity to existing assets creates immediate line of sight to future operating efficiencies</li><li style=\"text-align:left;\">Includes ~75,000 acres of commercially attractive leasehold in <location value=\"LS/us.tx\" idsrc=\"xmltag.org\" >East Texas</location></li></ul>   </li></ul>  <p align=\"left\">Commenting on the Acquisition, CEO <person>Rusty Hutson, Jr.</person> said:</p>  <p align=\"justify\"><em>&quot;The target assets are a perfect fit with our existing <location value=\"LS/us.tx\" idsrc=\"xmltag.org\" >East Texas</location> operations and offer meaningful opportunities for material synergies upon completion of the Acquisition. The accretive transaction adds scale to our <location value=\"LS/us.tx\" idsrc=\"xmltag.org\" >East Texas</location> regional footprint and remains consistent with our strategy to focus on acquiring high-quality, low-decline producing assets at attractive valuations. These assets will benefit from our Smarter Asset Management approach to improve production, enhance margins, and grow free cash flow. Additionally, we anticipate that incremental cash flow can be generated from our Portfolio Optimization Programs. Our Company has a proven, demonstrated track record of delivering value to shareholders from our strategy of acquiring, operating, and optimizing established cash-generating energy assets.&quot;</em></p>  <p align=\"left\"><strong>Bolt-On Addition of Low-Decline PDP Assets</strong></p>  <p align=\"justify\">The Acquisition's estimated NTM EBITDA is approximately <money>$52 million</money> and reflects attractive valuation of approximately PV-15. The Acquisition is expected to add approximately 62 MMcfepd (~10 Mboepd) of production and approximately 397 Bcfe reserves with a PV-10 of <money>$310 million</money><sup>(b)</sup>. Additionally, the production profile of the Assets are highly complementary to the Company's existing portfolio and operational strategy, with low annual production declines of ~6% per year that would result in an unchanged consolidated decline rate, pro forma for the Acquisition. The Assets include additional undeveloped acreage that presents potential upside opportunities in line with Diversified's demonstrated ability to unlock value on non-core assets and the Assets provide opportunities to realize synergies attributable to Diversified’s operating scale and asset density.</p>  <p align=\"justify\">Footnotes:</p>  <p align=\"left\"><sup>a) </sup>Current production based on estimated average daily production for 2026; Estimate based on historical performance and engineered type curves for the Assets.</p>  <p align=\"left\"><sup>b) </sup>Estimated annual rate of production declines and PDP reserves values (including volumes, PV-10 and approximate PV value) calculated using historical production data, asset-specific type curves and an effective date of <chron>March 1, 2026</chron> and based on the NYMEX strip at <chron>February 2, 2026</chron>, with terminal price assumptions of <money>$3.75</money>/MMBtu and <money>$65.00</money>/Bbl for natural gas and oil, respectively.</p>  <p align=\"left\"><sup>c) </sup>Based on engineering reserves assumptions using historical cost assumptions and NYMEX strip as of <chron>February 2, 2026</chron> for the 12 month period ended <chron>March 1, 2027</chron>; does not include the impact of any projected or anticipated synergies that may occur subsequent to acquisition.</p>  <p align=\"justify\">This announcement contains inside information for the purposes of Article 7 of the UK version of Regulation (EU) No. 596/2014 on Market Abuse (“UK MAR”), as it forms part of the UK domestic law by virtue of the European Union (Withdrawal) Act 2018.</p>  <p align=\"left\">For further information, please contact:</p> <table style=\"border-collapse: collapse; width:99.9991%; border-collapse:collapse ;\"><tr><td style=\"width:67.669%;;text-align: left ;  vertical-align: middle; vertical-align: top ; \"><strong><org value=\"DEC.NaE\" idsrc=\"xmltag.org\" >Diversified Energy Company</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='DEC' fmr-param-security-type='Equity'>( DEC )</span> </strong></td><td style=\"width:32.3017%;;text-align: right ;  vertical-align: middle; vertical-align: top ; \">+1 973 856 2757</td></tr><tr><td style=\"width:67.669%;;text-align: left ;  vertical-align: middle; vertical-align: top ; \">Doug Kris</td><td style=\"width:32.3017%;;text-align: right ;  vertical-align: middle; vertical-align: bottom ; \">dkris@dgoc.com</td></tr><tr><td style=\"width:67.669%;;text-align: left ;  vertical-align: middle; vertical-align: top ; \">Senior Vice President<br/>Investor Relations &amp; Corporate Communications</td><td style=\"width:32.3017%;;text-align: right ;  vertical-align: middle; vertical-align: top ; \">www.div.energy</td></tr><tr><td style=\"width:67.669%;;text-align: left ;  vertical-align: middle; vertical-align: top ; \"><br/><br/><strong>FTI Consulting</strong></td><td style=\"width:32.3017%;;text-align: right ;  vertical-align: middle; vertical-align: bottom ; \">dec@fticonsulting.com</td></tr><tr><td style=\"width:67.669%;;text-align: left ;  vertical-align: middle; vertical-align: top ; \">U.S. &amp; UK Financial Public Relations</td><td style=\"width:32.3017%;;text-align: left ;  vertical-align: middle; vertical-align: bottom ; \"> </td></tr><tr><td style=\"width:67.669%;\"> </td><td style=\"width:32.3017%;\"> </td></tr></table> <p align=\"left\"><strong>About <org value=\"DEC.NaE\" idsrc=\"xmltag.org\" >Diversified Energy Company</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='DEC' fmr-param-security-type='Equity'>( DEC )</span> </strong></p>  <p align=\"justify\">Diversified is a leading publicly traded energy company focused on acquiring, operating, and optimizing cash-generating energy assets. Through our unique differentiated strategy, we acquire established assets and invest in them to improve environmental and operational performance until retiring those assets in a safe and environmentally secure manner. Recognized by ratings agencies and organizations for our sustainability leadership, this solutions-oriented, stewardship approach makes Diversified the <strong><org>Right Company</org> at the Right Time</strong> to responsibly produce energy, deliver reliable free cash flow, and generate shareholder value. </p>  <p align=\"left\"><strong>Forward-Looking Statements</strong></p>  <p align=\"justify\">This announcement contains forward-looking statements (within the meaning of the U.S. Private Securities Litigation Reform Act of 1995). These forward-looking statements, which contain the words &quot;anticipate&quot;, &quot;believe&quot;, &quot;intend&quot;, &quot;estimate&quot;, &quot;expect&quot;, &quot;may&quot;, &quot;will&quot;, &quot;seek&quot;, &quot;continue&quot;, &quot;aim&quot;, &quot;target&quot;, &quot;projected&quot;, &quot;plan&quot;, &quot;goal&quot;, &quot;achieve&quot;, &quot;opportunity&quot; and words of similar meaning, reflect the Company's beliefs and expectations and are based on numerous assumptions regarding the Company's present and future business strategies and the environment the Company will operate in and are subject to risks and uncertainties that may cause actual results to differ materially. No representation is made that any of these statements or forecasts will come to pass or that any forecast results will be achieved. Expected benefits of the Acquisition may not be realized and the Acquisition may not close on the terms described in this release at all. Forward-looking statements involve inherent known and unknown risks, uncertainties and contingencies because they relate to events and depend on circumstances that may or may not occur in the future and may cause the actual results, performance or achievements of the Company to be materially different from those expressed or implied by such forward-looking statements. Many of these risks and uncertainties relate to factors that are beyond the Company's ability to control or estimate precisely, including the risk factors described in the &quot;Risk Factors&quot; section in the Company's Annual Report and Form 10K for the year ended <chron>December 31, 2025</chron>, filed with the <org>United States Securities and Exchange Commission</org>. The pro forma financial information in this announcement is for informational purposes only, is not a projection of our future financial performance, and should not be considered indicative of actual results should the Acquisition be consummated. Forward-looking statements speak only as of their date and neither the Company nor any of its directors, officers, employees, agents, affiliates or advisers expressly disclaim any obligation to supplement, amend, update or revise any of the forward-looking statements made herein, except where it would be required to do so under applicable law. As a result, you are cautioned not to place undue reliance on such forward-looking statements.</p>  <p align=\"left\">USE OF PROJECTIONS</p>  <p align=\"justify\">This communication contains projections, including expected production volumes, PV-10, EBITDA and decline rates. Our independent auditors have not audited, reviewed, compiled, or performed any procedures with respect to the projections for the purpose of their inclusion in this communication, and accordingly, have not expressed an opinion or provided any other form of assurance with respect thereto for the purpose of this communication. These projections are for illustrative purposes only and should not be relied upon as being indicative of future results. The assumptions and estimates underlying the projected information are inherently uncertain and are subject to a wide variety of significant business, economic and competitive risks and uncertainties that could cause actual results to differ materially from those contained in the projected information. Even if our assumptions and estimates are correct, projections are inherently uncertain due to a number of factors outside our control. Accordingly, there can be no assurance that the projected results are indicative of our future performance after completion of the Acquisition or that actual results will not differ materially from those presented in the projected information. Inclusion of the projected information in this communication should not be regarded as a representation by any person that the results contained in the projected information will be achieved.</p>  <p align=\"justify\">Adjusted EBITDA</p>  <p align=\"justify\">As used herein, EBITDA represents earnings before interest, taxes, depletion, depreciation and amortization. Adjusted EBITDA includes adjusting for items that are not comparable period-over-period, namely, accretion of asset retirement obligation, other (income) expense, loss on joint and working interest owners receivable, (gain) loss on bargain purchases, (gain) loss on fair value adjustments of unsettled financial instruments, (gain) loss on natural gas and oil property and equipment, costs associated with acquisitions, other adjusting costs, non-cash equity compensation, (gain) loss on foreign currency hedge, net (gain) loss on interest rate swaps and items of a similar nature.</p>  <p align=\"justify\">Adjusted EBITDA should not be considered in isolation or as a substitute for operating profit or loss, net income or loss, or cash flows provided by operating, investing, and financing activities. However, we believe such a measure is useful to an investor in evaluating our financial performance because it (1) is widely used by investors in the natural gas and oil industry as an indicator of underlying business performance; (2) helps investors to more meaningfully evaluate and compare the results of our operations from period to period by removing the often-volatile revenue impact of changes in the fair value of derivative instruments prior to settlement; (3) is used in the calculation of a key metric in one of our Credit Facility financial covenants; and (4) is used by us as a performance measure in determining executive compensation. We are unable to provide a quantitative reconciliation of forward-looking Adjusted EBITDA to the most directly comparable forward-looking GAAP measure because the items necessary to estimate such forward-looking IFRS measure are not accessible or estimable at this time without unreasonable efforts. The reconciling items in future periods could be significant.</p>  <p align=\"justify\">PV-10</p>  <p align=\"justify\">PV-10 is a non-GAAP financial measure and generally differs from Standardized Measure, the most directly comparable GAAP measure, because it does not include the effects of income taxes on future net cash flows. While the Standardized Measure is free cash dependent on the unique tax situation of each company, PV-10 is based on a pricing methodology and discount factors that are consistent for all companies. In this announcement, PV-10 is calculated using NYMEX pricing. It is not practicable to reconcile PV-10 using NYMEX pricing to standardized measure in accordance with GAAP at this time. Investors should be cautioned that neither PV-10 nor the Standardized Measure represents an estimate of the fair market value of proved reserves.</p>  Image: https://www.globenewswire.com/newsroom/ti?nf=OTY2MjQ3MyM3NDU4MjEwIzIxODkxMzE=  <br/> Image: https://ml.globenewswire.com/media/ZDc4MGNmM2ItOTU3YS00NDI2LWI0MmUtNzZmZTZhYTliNjNhLTEyMDA2ODQtMjAyNi0wMi0yNi1lbg==/tiny/Diversified-Energy-PLC.png <p> Image: Primary Logo </p>\nSource: <org>Diversified Energy PLC</org>\n",
            "link": "https://www.fidelity.com/news/article/mergers-and-acquisitions/202602261615PRIMZONEFULLFEED9662473",
            "pub_date": "2026-02-27 05:15:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Sector Update: Tech Stocks Fall Late Afternoon",
            "description": "\n<p><chron>03:54 PM EST</chron>, <chron>02/26/2026</chron> (MT Newswires) -- Tech stocks were lower late Thursday afternoon, with the State Street Technology Select Sector SPDR ETF (XLK) falling 1.8% and the State Street SPDR S&amp;P Semiconductor ETF (XSD) dropping 2.3%.</p><p>The Philadelphia Semiconductor index slumped 3.9%.</p><p>In sector news, the global market for smartphones will fall 12.9% this year due to an unprecedented shortage of memory chips, <org>Bloomberg</org> reported Thursday, citing researcher IDC. The new forecast represents a significant downward revision to expectations, the report said, adding that the IDC now sees roughly 1.1 billion mobile shipments in 2026, compared with 1.26 billion in 2025.</p><p>In corporate news, <org value=\"NVDA.NaE\" idsrc=\"xmltag.org\" >Nvidia's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NVDA' fmr-param-security-type='Equity'>( NVDA )</span>  post-earnings stock selloff likely reflects factors including ongoing fears around AI as markets monitor an expected tough set-up for cloud capital spending, <org>BofA Securities</org> said in a note. <org value=\"NVDA.NaE\" idsrc=\"xmltag.org\" >Nvidia</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NVDA' fmr-param-security-type='Equity'>( NVDA )</span> late Wednesday reported fiscal Q4 results above <location>Wall Street's</location> estimates as an AI boom continued to fuel computing demand. <org value=\"NVDA.NaE\" idsrc=\"xmltag.org\" >Nvidia</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NVDA' fmr-param-security-type='Equity'>( NVDA )</span> shares were down 5.5%.</p><p><org value=\"AI.NaE\" idsrc=\"xmltag.org\" >C3.ai</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AI' fmr-param-security-type='Equity'>( AI )</span>  shares tumbled 19%. The company posted &quot;weaker than expected&quot; fiscal Q3 results with &quot;significant misses across the board,&quot; Wedbush said in a note Thursday.</p><p><org value=\"AAPL.NaE\" idsrc=\"xmltag.org\" >Apple</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AAPL' fmr-param-security-type='Equity'>( AAPL )</span>  is in discussions with major Indian banks and global card networks to launch Apple Pay in the country around mid-2026, <org>Bloomberg</org> reported. <org value=\"AAPL.NaE\" idsrc=\"xmltag.org\" >Apple</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AAPL' fmr-param-security-type='Equity'>( AAPL )</span> shares were down 0.7%.</p><p><org value=\"CRM.NaE\" idsrc=\"xmltag.org\" >Salesforce</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='CRM' fmr-param-security-type='Equity'>( CRM )</span>  shares rose 4.7% after it topped market estimates for its fiscal Q4 results.</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/us-markets/202602261554MIDNIGHTUSEQUITY_A3574068",
            "pub_date": "2026-02-27 04:54:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Sector Update: Energy Stocks Advance Late Afternoon",
            "description": "\n<p><chron>03:56 PM EST</chron>, <chron>02/26/2026</chron> (MT Newswires) -- Energy stocks were higher late Thursday afternoon, with the NYSE Energy Sector Index increasing 0.2% and the State Street Energy Select Sector SPDR ETF (XLE) adding 0.6%.</p><p>The Philadelphia Oil Service Sector Index was decreasing 0.7%, and the Dow Jones US Utilities Index was easing 0.2%.</p><p>Front-month West Texas Intermediate crude oil decreased 0.2% to <money>$65.29</money> a barrel, and the global benchmark Brent crude contract eased 0.1% to <money>$70.77</money> a barrel. Henry Hub natural gas futures fell 1.3% to <money>$2.83</money> per 1 million BTU.</p><p>In sector news, US natural gas stocks declined by 52 billion cubic feet in the week ended <chron>Feb. 20</chron>, slightly larger than the 50-billion cubic foot fall expected in a <org>Bloomberg</org> survey and following a decrease of 144 billion cubic feet in the previous week.</p><p>In corporate news, <org value=\"SRE.NaE\" idsrc=\"xmltag.org\" >Sempra</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='SRE' fmr-param-security-type='Equity'>( SRE )</span>  shares rose 1%. The company reported Q4 adjusted earnings of <money>$1.28</money> per diluted share, down from <money>$1.50</money> a year ago but above analysts' estimates.</p><p><org value=\"FSLR.NaE\" idsrc=\"xmltag.org\" >First Solar</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='FSLR' fmr-param-security-type='Equity'>( FSLR )</span>  shares were down nearly 5% after multiple analysts lowered their ratings and price targets on the company.</p><p><org value=\"EFXT.NaE\" idsrc=\"xmltag.org\" >Enerflex</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='EFXT' fmr-param-security-type='Equity'>( EFXT )</span>  shares jumped past 17%. The company said late Wednesday its preliminary 2026 outlook &quot;reflects steady demand across its business lines and geographic regions&quot; while reporting a swing to a Q4 net loss, and it signed a deal to divest the majority of its operations in the <location value=\"LR/asp\" idsrc=\"xmltag.org\" >Asia Pacific</location> region.</p><p>Shell (SHEL) is reviewing and considering whether to sell some investments held under its <org>Shell Ventures</org> portfolio, Reuters reported. Shell shares were down 1.4%.</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/us-markets/202602261556MIDNIGHTUSEQUITY_A3574073",
            "pub_date": "2026-02-27 04:56:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Optellum Secures TGA Approval to Expand AI-Enabled Lung Nodule Solution To Australia",
            "description": "\n<div class=\"xn-content\">\n<p><span class=\"legendSpanClass\"><location value=\"LU/gb.eng.oxford\" idsrc=\"xmltag.org\" >OXFORD, England</location></span>, <span class=\"legendSpanClass\"><chron>Feb. 26, 2026</chron></span> /PRNewswire/ -- Optellum, the leading AI-enabled solution for earlier lung cancer detection, is thrilled to announce that it has received <org>Therapeutic Goods Administration</org> (TGA) class IIb approval in <location value=\"LC/au\" idsrc=\"xmltag.org\" >Australia</location> for the <org>Virtual Nodule Clinic</org> (VNC) platform to support early lung cancer diagnosis. This important regulatory milestone was achieved after a rigorous review of technical documentation and validation studies, recognizing its safety and performance for clinical use. VNC helps identify, triage, and manage patients with pulmonary nodules, and includes a clinically validated AI decision support tool, lung cancer prediction (LCP) AI, already used in the US and EU/UK for nodule risk stratification. </p>\n    <div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder1\">\n                <p>\n\n                    <img src=\"https://mma.prnewswire.com/media/2633244/Optellum_Logo.jpg\" title=\"Optellum logo (PRNewsfoto/Optellum)\" alt=\"Optellum logo (PRNewsfoto/Optellum)\" />\n\n                </p>\n    </div>\n<p>Lung cancer remains a major health challenge in <location value=\"LC/au\" idsrc=\"xmltag.org\" >Australia</location>, with over 15,000 new diagnoses each year and low 5-year survival rates around 27%. [1] Delayed detection of incidental findings, inconsistent follow-up, and growing pressure on imaging and specialist services continue to contribute to later diagnosis. These pain points can lead to unnecessary anxiety for patients and missed opportunities for earlier intervention, highlighting the need for tools that support timely recognition and coordinated health systems.</p><p>This TGA clearance poises Optellum to help thousands of patients in <location value=\"LC/au\" idsrc=\"xmltag.org\" >Australia</location> by supporting earlier and more consistent identification of incidental lung nodules. By helping care teams prioritize higher-risk findings and streamline follow-up more efficiently, VNC aims to reduce delays and uncertainty along the lung cancer care pathway. This clearance marks an important step in bringing validated AI tools into everyday clinical workflows, without replacing clinical judgment.</p><p>Optellum remains committed to working with Australian health systems to support responsible AI adoption that improves patient care quality and experience. This milestone reflects Optellum's broader mission to help patients move from detection to diagnosis with speed, greater clarity, and confidence.</p><p><b>About Optellum</b><br />Optellum is a commercial-stage AI healthcare company dedicated to revolutionizing early diagnosis and treatment of lung disease, starting with one of the deadliest, lung cancer.</p><p>Optellum's flagship product, <org>Virtual Nodule Clinic</org> (VNC) with Lung Cancer Prediction AI (LCP), is the world's first and only <org>FDA</org>-cleared and reimbursed software-as-a-medical-device (SaMD) solution for AI-powered lung cancer prioritization and diagnostic support. Clinicians trust the Optellum solution to aid them in making the most appropriate life-saving treatment decisions for their patients. Backed by real-world clinical evidence, Optellum's solution accelerates the diagnostic care pathway by enabling early patient identification, enhancing prioritization, and improving clinicians' efficiency, reducing time to guideline-recommended treatment. Optellum VNC is <org>FDA</org> cleared, CE-MDR marked, TGA approved, and UKCA marked.</p><p>Optellum is headquartered in <location value=\"LU/gb.eng.oxford\" idsrc=\"xmltag.org\" >Oxford, UK</location>, and has an office at the <org>Texas Medical Center</org> in <location value=\"LU/us.tx.houstn\" idsrc=\"xmltag.org\" >Houston, Texas</location>, US.</p><p>[1] https://www.canceraustralia.gov.au/cancer-types/lung-cancer/lung-cancer-australia-statistics</p><p><b>Media Contact<br /></b>marketing@optellum.com</p>\n\n\n\n<p id=\"PURL\"><img title=\"Cision\" width=\"12\" height=\"12\" alt=\"Cision\" src=\"https://edge.prnewswire.com/c/img/favicon.png?sn=DA97228&amp;sd=2026-02-26\" /> View original content to download multimedia:https://www.prnewswire.com/news-releases/optellum-secures-tga-approval-to-expand-ai-enabled-lung-nodule-solution-to-australia-302698977.html</p><p>SOURCE Optellum</p></div>\n",
            "link": "https://www.fidelity.com/news/article/technology/202602261600PR_NEWS_USPR_____DA97228",
            "pub_date": "2026-02-27 05:00:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Federal Signal Corporation Appoints Two New Directors",
            "description": "\n<div class=\"xn-content\">\n<p><span class=\"legendSpanClass\"><location value=\"LU/us.il.dowove\" idsrc=\"xmltag.org\" >DOWNERS GROVE, Ill.</location></span>, <span class=\"legendSpanClass\"><chron>Feb. 26, 2026</chron></span> /PRNewswire/ -- The Board of Directors of <org value=\"FSS.NaE\" idsrc=\"xmltag.org\" >Federal Signal Corporation</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='FSS' fmr-param-security-type='Equity'>( FSS )</span> , a leader in environmental and safety solutions, today announced the appointments of Richard (\"Rich\") A. Maue and <person>Eric A. Vaillancourt</person> to the Company's board of directors, effective immediately.</p>\n<p>\"We are delighted to announce the appointments of Rich and Eric to our board of directors,\" said <person>Brenda L. Reichelderfer</person>, Chair of the board of <org value=\"FSS.NaE\" idsrc=\"xmltag.org\" >Federal Signal</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='FSS' fmr-param-security-type='Equity'>( FSS )</span>. \"Rich's vast experience as a senior finance leader in a global industrial organization, currently as the Chief Financial Officer (\"CFO\"), positions him to provide immediate, valued insight to our board. In his current role as the Chief Executive Officer (\"CEO\") of a market-leading company, Eric has significant expertise in operations, strategic planning, marketing and business development. His breadth of experience will make him a valuable addition to our board.\"   </p><p>Since <chron>January 2013</chron>, Mr. Maue has served as the CFO of <org value=\"CR.NaE\" idsrc=\"xmltag.org\" >Crane Company</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='CR' fmr-param-security-type='Equity'>( CR )</span> (\"Crane\") , a leading manufacturer of highly engineered components for challenging, mission-critical applications focused on the aerospace, defense, space and process industry end markets.</p><p>Mr. Maue joined Crane as Vice President, Controller and Chief Accounting Officer in <chron>August 2007</chron>. He served in that capacity until <chron>May 2010</chron>, when he became Co-CFO and in 2013 was promoted to Vice President, Finance and CFO, assuming full responsibility for all finance functions at Crane. In <chron>January 2019</chron>, Mr. Maue was promoted to Senior Vice President, and in <chron>March 2019</chron>, he also assumed segment leadership responsibility for Crane's Aerospace and Electronics business until <chron>February 2023</chron>, at which time Mr. Maue was promoted to Executive Vice President.</p><p>Prior to joining Crane, Mr. Maue worked at <org>Paxar Corporation</org> as Vice President, Controller and Chief Accounting Officer and at <org>Protiviti, Inc.</org> as a Director in their Internal Audit Practice. Mr. Maue started his career in the audit and business advisory practice at Arthur Andersen.</p><p>Mr. Maue graduated from <org>Villanova University</org> with a Bachelor of Science in accounting and is a certified public accountant.</p><p>Since <chron>November 2021</chron>, Mr. Vaillancourt has served as President and CEO of <org value=\"NPO.NaE\" idsrc=\"xmltag.org\" >Enpro Inc.</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NPO' fmr-param-security-type='Equity'>( NPO )</span>  , a leading industrial technology company focused on critical applications across many end-markets, including semiconductor, industrial process, commercial vehicle, sustainable power generation, aerospace, food and pharma, photonics, and life sciences.</p><p>Prior to his appointment as <org value=\"NPO.NaE\" idsrc=\"xmltag.org\" >Enpro's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NPO' fmr-param-security-type='Equity'>( NPO )</span> President and CEO, Mr. Vaillancourt served as its Interim President and CEO beginning in <chron>August 2021</chron>. Before assuming the interim role, Mr. Vaillancourt was President of <org value=\"NPO.NaE\" idsrc=\"xmltag.org\" >Enpro's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NPO' fmr-param-security-type='Equity'>( NPO )</span> Sealing Technologies segment starting in <chron>August 2020</chron>. Earlier, Mr. Vaillancourt served as President, STEMCO division beginning in <chron>July 2018</chron>, and as President of the Garlock division starting in <chron>November 2014</chron>. Since joining <org value=\"NPO.NaE\" idsrc=\"xmltag.org\" >Enpro</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NPO' fmr-param-security-type='Equity'>( NPO )</span> in 2009, Mr. Vaillancourt has also held roles including President, Garlock Sealing Products and Vice President of Sales and Marketing of the Garlock division.</p><p>Prior to joining <org value=\"NPO.NaE\" idsrc=\"xmltag.org\" >Enpro</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NPO' fmr-param-security-type='Equity'>( NPO )</span>, Mr. Vaillancourt held positions of increasing responsibility with <org>Bluelinx Corporation</org>, culminating in his position as Regional Vice President North-Sales and Distribution.</p><p>Mr. Vaillancourt received a Bachelor of Science in Business Management from <org>Empire State College</org> and completed the Harvard Advanced Management Program in 2014.</p><p><b>About <org value=\"FSS.NaE\" idsrc=\"xmltag.org\" >Federal Signal</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='FSS' fmr-param-security-type='Equity'>( FSS )</span></b></p><p><org value=\"FSS.NaE\" idsrc=\"xmltag.org\" >Federal Signal Corporation</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='FSS' fmr-param-security-type='Equity'>( FSS )</span> builds and delivers equipment of unmatched quality that moves material, cleans infrastructure, and protects the communities where we work and live. Founded in 1901, <org value=\"FSS.NaE\" idsrc=\"xmltag.org\" >Federal Signal</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='FSS' fmr-param-security-type='Equity'>( FSS )</span> is a leading global designer, manufacturer, and supplier of products and total solutions that serve municipal, governmental, industrial, and commercial customers. Headquartered in <location value=\"LU/us.il.dowove\" idsrc=\"xmltag.org\" >Downers Grove, Ill.</location>, with manufacturing facilities worldwide, the Company operates two groups: Environmental Solutions and Safety and Security Systems. For more information on <org value=\"FSS.NaE\" idsrc=\"xmltag.org\" >Federal Signal</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='FSS' fmr-param-security-type='Equity'>( FSS )</span>, visit: www.federalsignal.com.</p>\n\n\n\n<p id=\"PURL\"><img title=\"Cision\" width=\"12\" height=\"12\" alt=\"Cision\" src=\"https://edge.prnewswire.com/c/img/favicon.png?sn=CG97169&amp;sd=2026-02-26\" /> View original content:https://www.prnewswire.com/news-releases/federal-signal-corporation-appoints-two-new-directors-302698986.html</p><p>SOURCE <org value=\"FSS.NaE\" idsrc=\"xmltag.org\" >Federal Signal Corporation</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='FSS' fmr-param-security-type='Equity'>( FSS )</span></p></div>\n",
            "link": "https://www.fidelity.com/news/article/technology/202602261600PR_NEWS_USPR_____CG97169",
            "pub_date": "2026-02-27 05:00:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Viavi Solutions Insider Sold Shares Worth $730,750, According to a Recent SEC Filing",
            "description": "\n<p><chron>03:57 PM EST</chron>, <chron>02/26/2026</chron> (MT Newswires) -- Donald A Colvin, Director, on <chron>February 26, 2026</chron>, sold 25,000 shares in <org value=\"VIAV.NaE\" idsrc=\"xmltag.org\" >Viavi Solutions</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='VIAV' fmr-param-security-type='Equity'>( VIAV )</span>  for <money>$730,750</money>. Following the Form 4 filing with the <org>SEC</org>, Colvin has control over a total of 147,053 common shares of the company, with 147,053 shares held directly.</p><p>SEC Filing:</p><p>https://www.sec.gov/Archives/edgar/data/912093/000091209326000030/xslF345X05/form4.xml</p><p>Price: 29.90, Change: -0.95, Percent Change: -3.08</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602261557MIDNIGHTUSEQUITY_A3574074",
            "pub_date": "2026-02-27 04:57:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Highlander Silver and Bear Creek Mining Complete Business Combination",
            "description": "\n<p align=\"center\"><em>All</em> <em>monetary</em> <em>amounts</em> <em>are</em> <em>expressed</em> <em>in</em> <em>Canadian</em> <em>dollars,</em> <em>unless</em> <em>otherwise</em> <em>indicated.</em></p>  <p align=\"justify\"><location value=\"LU/ca.on.tornto\" idsrc=\"xmltag.org\" >TORONTO</location>, <chron>Feb.  26, 2026</chron>  (GLOBE NEWSWIRE) -- <org value=\"HLSCF.NaE\" idsrc=\"xmltag.org\" >Highlander Silver Corp.</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='HLSCF' fmr-param-security-type='Equity'>( HLSCF )</span> (“<strong>Highlander Silver”)</strong> and <org value=\"BCEKF.NaE\" idsrc=\"xmltag.org\" >Bear Creek Mining Corporation</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='BCEKF' fmr-param-security-type='Equity'>( BCEKF )</span>  (BVL: BCM) (“<strong>Bear Creek</strong>”) are pleased to announce the successful completion of the previously announced plan of arrangement under Division 5 of Part 9 of the <em>Business Corporations Act</em> (<location value=\"LS/ca.bc\" idsrc=\"xmltag.org\" >British Columbia</location>) (the “<strong>Arrangement</strong>”) and the concurrent closing of the debt settlement agreements (the “<strong>Debt Settlement Agreements</strong>”) between <org value=\"HLSCF.NaE\" idsrc=\"xmltag.org\" >Highlander Silver</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='HLSCF' fmr-param-security-type='Equity'>( HLSCF )</span> and each of Royal Gold, Inc., through its wholly-owned subsidiary, <org>International Royalty Corporation</org>, (“<strong>Royal Gold</strong>”) and Equinox Gold Corp. (“<strong>Equinox</strong>”).</p>  <p align=\"justify\">Pursuant to the Arrangement, <org value=\"HLSCF.NaE\" idsrc=\"xmltag.org\" >Highlander Silver</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='HLSCF' fmr-param-security-type='Equity'>( HLSCF )</span> acquired all of the issued and outstanding common shares of Bear Creek (the “<strong>Bear Creek Shares”)</strong> in exchange for 0.1175 common shares in the capital of <org value=\"HLSCF.NaE\" idsrc=\"xmltag.org\" >Highlander Silver</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='HLSCF' fmr-param-security-type='Equity'>( HLSCF )</span> (the “<strong>Highlander Shares”)</strong> for each Bear Creek Share held immediately prior to the effective time of the Arrangement (the “<strong>Consideration</strong>”).</p>  <p align=\"justify\">In connection with the closing of the Debt Settlement Agreements, <org value=\"HLSCF.NaE\" idsrc=\"xmltag.org\" >Highlander Silver</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='HLSCF' fmr-param-security-type='Equity'>( HLSCF )</span> paid cash consideration in the amounts of <money>US$6.2 million</money> to Royal Gold and <money>US$1.6 million</money> to Equinox. Concurrently with the closing of the Arrangement and the Debt Settlement Agreements, <org value=\"HLSCF.NaE\" idsrc=\"xmltag.org\" >Highlander Silver</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='HLSCF' fmr-param-security-type='Equity'>( HLSCF )</span> repaid the advance and outstanding interest owed to <org>Wheaton Precious Metals International Ltd.</org> (“<strong>Wheaton</strong>”) pursuant to the support agreement dated <chron>November 22, 2022</chron>, as amended, between Bear Creek and Wheaton.</p>  <p align=\"justify\">As a result of the completion of the Arrangement, the Bear Creek Shares are expected to be delisted from the <org>TSX Venture Exchange</org> on or about <chron>March 2, 2026</chron> (the “<strong>Delisting</strong>”). Bear Creek has notified OTC Markets Group and the Bolsa Valores de <location value=\"LU/pe..lima\" idsrc=\"xmltag.org\" >Lima</location> (“BVL”) of its intent to voluntarily withdraw its securities from the OTCQX trading platform and the BVL exchange. In connection with the Delisting, Bear Creek will also submit an application to the applicable securities regulators to cease to be a reporting issuer and to terminate its public reporting obligations in <location value=\"LC/ca\" idsrc=\"xmltag.org\" >Canada</location>. Further details regarding the Arrangement are set out in Bear Creek’s management information circular dated <chron>January 16, 2026</chron>, 2026, (the “<strong>Circular</strong>”) a copy of which is available under Bear Creek’s issuer profile on SEDAR+ at www.sedarplus.ca.</p>  <p align=\"justify\">Bear Creek Shareholders are reminded to review the Circular in respect of the procedure for receiving the Consideration for their Bear Creek Shares. Registered shareholders (Bear Creek Shares held in physical form or a direct registration system (&quot;DRS&quot;) advice) must complete, sign and return the letter of transmittal, along with their share certificate(s) or DRS advice(s), to <org>Endeavor Trust Corporation</org>, the depositary for the Arrangement. Non-registered shareholders (Bear Creek Shares held with a broker, bank or other intermediary) should contact their intermediaries for instructions and assistance in receiving the Consideration for such Bear Creek Shares. The letter of transmittal is available at https://bearcreekmining.com/investors/shareholder-meetings/ or under Bear Creek’s profile on SEDAR+ (www.sedarplus.ca).</p>  <p align=\"justify\"><strong>Early Warning Disclosure – Highlander </strong></p>  <p align=\"justify\">Pursuant to the requirements of National Instrument 62-104 – <em>Take-Over Bids and Issuer Bids</em> and National Instrument 62-103 – <em>The Early Warning System and Related Take-Over Bid and Insider Reporting Issues</em>, <org value=\"HLSCF.NaE\" idsrc=\"xmltag.org\" >Highlander Silver</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='HLSCF' fmr-param-security-type='Equity'>( HLSCF )</span> will file an early warning report (the “<strong>Early Warning Report</strong>”) in accordance with applicable securities laws, a copy of which will be made available on Highlander Silver’s issuer profile on SEDAR+ at www.sedarplus.ca. Further information and a copy of the Early Warning Report may also be obtained by contacting <org value=\"HLSCF.NaE\" idsrc=\"xmltag.org\" >Highlander Silver</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='HLSCF' fmr-param-security-type='Equity'>( HLSCF )</span> at the contact information below. The head office of <org value=\"HLSCF.NaE\" idsrc=\"xmltag.org\" >Highlander Silver</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='HLSCF' fmr-param-security-type='Equity'>( HLSCF )</span> is located at <location>100 King Street West</location>, Suite 2500, <location value=\"LU/ca.on.tornto\" idsrc=\"xmltag.org\" >Toronto, Ontario</location> M5X 1A9.</p>  <p align=\"justify\">Immediately prior to closing of the Arrangement, <org value=\"HLSCF.NaE\" idsrc=\"xmltag.org\" >Highlander Silver</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='HLSCF' fmr-param-security-type='Equity'>( HLSCF )</span> held 50,000,000 Bear Creek Shares, representing approximately 13.95% of the outstanding Bear Creek Shares immediately prior to closing of the Arrangement. Pursuant to the Arrangement, <org value=\"HLSCF.NaE\" idsrc=\"xmltag.org\" >Highlander Silver</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='HLSCF' fmr-param-security-type='Equity'>( HLSCF )</span> acquired an aggregate of 308,302,938 Bear Creek Shares, thereby increasing its holdings of Bear Creek Shares to 100%. Upon completion of the Arrangement, Bear Creek became a wholly-owned subsidiary of <org value=\"HLSCF.NaE\" idsrc=\"xmltag.org\" >Highlander Silver</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='HLSCF' fmr-param-security-type='Equity'>( HLSCF )</span>. In exchange for the Bear Creek Shares, <org value=\"HLSCF.NaE\" idsrc=\"xmltag.org\" >Highlander Silver</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='HLSCF' fmr-param-security-type='Equity'>( HLSCF )</span> issued 0.1175 Highlander Shares to holders of Bear Creek Shares for each Bear Creek Share held, for aggregate consideration of 36,225,457 Highlander Shares.</p>  <p align=\"justify\"><org value=\"HLSCF.NaE\" idsrc=\"xmltag.org\" >Highlander Silver</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='HLSCF' fmr-param-security-type='Equity'>( HLSCF )</span> acquired the Bear Creek Shares pursuant to the Arrangement and intends for Bear Creek to cease to be a reporting issuer in all jurisdictions of <location value=\"LC/ca\" idsrc=\"xmltag.org\" >Canada</location> and remain a wholly-owned subsidiary of <org value=\"HLSCF.NaE\" idsrc=\"xmltag.org\" >Highlander Silver</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='HLSCF' fmr-param-security-type='Equity'>( HLSCF )</span>.</p>  <p align=\"justify\"><strong>Early Warning Disclosure – Royal Gold </strong></p>  <p align=\"justify\">Immediately prior to the completion of the Arrangement, Royal Gold beneficially owned, directly or indirectly, or exercised control or direction over 58,381,399 Bear Creek Shares, representing approximately 16.29% of the issued and outstanding Bear Creek Shares (on a non-diluted basis). As a result of completion of the Arrangement, Bear Creek became a wholly-owned subsidiary of Highlander, and pursuant thereto, Royal Gold exchanged its Bear Creek Shares for such number of Highlander Shares as is equal to approximately 3.37% of the issued and outstanding Highlander Shares (on a non-diluted basis).</p>  <p align=\"justify\">Royal Gold will be filing an early warning report (the “<strong>Royal Gold Early Warning Report</strong>”) in accordance with applicable securities laws, a copy of which will be made available on the issuer profiles of both Royal Gold and Bear Creek, respectively, on SEDAR+ at www.sedarplus.ca. Further information and a copy of the Royal Gold Early Warning Report may also be obtained by contacting <org value=\"HLSCF.NaE\" idsrc=\"xmltag.org\" >Highlander Silver</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='HLSCF' fmr-param-security-type='Equity'>( HLSCF )</span> at the contact information below. The head office of <org value=\"HLSCF.NaE\" idsrc=\"xmltag.org\" >Highlander Silver</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='HLSCF' fmr-param-security-type='Equity'>( HLSCF )</span> is located at <location>100 King Street West</location>, Suite 2500, <location value=\"LU/ca.on.tornto\" idsrc=\"xmltag.org\" >Toronto, Ontario</location> M5X 1A9.</p>  <p align=\"justify\"><strong>About <org value=\"HLSCF.NaE\" idsrc=\"xmltag.org\" >Highlander Silver</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='HLSCF' fmr-param-security-type='Equity'>( HLSCF )</span></strong></p>  <p align=\"justify\"><org value=\"HLSCF.NaE\" idsrc=\"xmltag.org\" >Highlander Silver</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='HLSCF' fmr-param-security-type='Equity'>( HLSCF )</span> is primarily focused on advancing the bonanza grade San Luis gold-silver project that is located adjacent to the past-producing Pierina mine in <location value=\"LC/pe\" idsrc=\"xmltag.org\" >Central Peru</location>. San Luis hosts Indicated Mineral Resources of 356 koz Au at 24.4 g/t Au and 8.4 <person>Moz Ag</person> at 579 g/t Ag and ranks among the 10 highest grade projects globally in both gold and silver categories.<sup>1</sup> Highlander Silver’s significant shareholders include the <org>Augusta Group</org>, which boasts an exceptional track record of value creation totaling over <money>$4.5 billion</money> in exit transactions, and strategic shareholders, the Lundin family and <person>Eric Sprott</person>.</p>  <p align=\"justify\"><strong>Information contact</strong></p>  <p align=\"justify\"><em><org value=\"HLSCF.NaE\" idsrc=\"xmltag.org\" >Highlander Silver</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='HLSCF' fmr-param-security-type='Equity'>( HLSCF )</span></em></p>  <p align=\"justify\"><person>Arun Lamba</person>, Vice President Corporate Development<br/>Email: alamba@highlandersilver.com</p>  <p align=\"justify\"><strong>Scientific and Technical Information</strong></p>  <p align=\"justify\">Scientific and technical information in the news release relating to the <org>San Luis Project</org> are taken from the technical report entitled, “Technical Report on the San Luis Property” dated <chron>January 15, 2025</chron>, prepared by independent “qualified person” (as defined in National Instrument 43-101 Standards of Disclosure for Mineral Projects), <person>Martin Mount</person>, MSc MCSM FGS CGeol FIMMM Ceng, and available on Highlander Silver’s SEDAR+ profile at www.sedarplus.ca.</p>  <p align=\"justify\">_______________<br/><sup>1</sup> S&amp;P Global rankings including the San Luis gold-silver project.<br/></p>  <p align=\"justify\"><strong>Forward-looking statements </strong></p>  <p align=\"justify\">This news release contains “forward-looking information” within the meaning of applicable Canadian securities legislation. All statements, other than statements of historical fact, are forward-looking statements and are based on expectations, estimates and projections as at the date of this news release. Any statement that involves discussions with respect to predictions, expectations, beliefs, plans, projections, objectives, assumptions, future events or performance (often but not always using phrases such as “expects”, or “does not expect”, “is expected”, “anticipates” or “does not anticipate”, “plans”, “budget”, “scheduled”, “forecasts”, “estimates”, “believes” or “intends” or variations of such words and phrases or stating that certain actions, events or results “may” or “could”, “would”, “might” or “will” be taken to occur or be achieved) are not statements of historical fact and may be forward-looking statements.</p>  <p align=\"justify\">In this news release, forward-looking statements relate to, among other things, statements regarding: the completion of the Delisting and the timing thereof; the submission of the cease to be a reporting issuer application by Bear Creek; the filing of the Early Warning Report and the Royal Gold Early Warning Report; the intention for Bear Creek to remain a wholly-owned subsidiary of <org value=\"HLSCF.NaE\" idsrc=\"xmltag.org\" >Highlander Silver</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='HLSCF' fmr-param-security-type='Equity'>( HLSCF )</span>; and the exploration potential of the Mercedes mine. These forward-looking statements are no guarantees of future results and involve risks and uncertainties that may cause actual results to differ materially from the potential results discussed in the forward-looking statements.</p>  <p align=\"justify\">In respect of the forward-looking statements, <org value=\"HLSCF.NaE\" idsrc=\"xmltag.org\" >Highlander Silver</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='HLSCF' fmr-param-security-type='Equity'>( HLSCF )</span> and Bear Creek have relied on certain assumptions that they believe are reasonable at this time, including, but not limited to, assumptions concerning <org value=\"HLSCF.NaE\" idsrc=\"xmltag.org\" >Highlander Silver</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='HLSCF' fmr-param-security-type='Equity'>( HLSCF )</span>, Bear Creek and the Arrangement, including the anticipated benefits therefrom. Events or circumstances may cause actual results to differ materially from those predicted as a result of numerous known and unknown risks, uncertainties, and other factors.</p>  <p align=\"justify\">Risks and uncertainties that may cause such differences include but are not limited to: the possibility that the Bear Creek Shares will not be delisted from the <org>TSX Venture Exchange</org>, the OTCQX or the BVL exchange within the timing currently contemplated or at all; that Bear Creek’s application for an order to cease to be a reporting issuer (or equivalent) in each of the provinces and territories of <location value=\"LC/ca\" idsrc=\"xmltag.org\" >Canada</location> may not be accepted or may be delayed; and such other risk factors identified under the “Risk Factors” section in the Circular, a copy of which is available under Bear Creek’s issuer profile on SEDAR+ at www.sedarplus.ca. These factors are not intended to represent a complete list of the factors that could affect <org value=\"HLSCF.NaE\" idsrc=\"xmltag.org\" >Highlander Silver</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='HLSCF' fmr-param-security-type='Equity'>( HLSCF )</span> and Bear Creek. However, such risk factors should be considered carefully. There can be no assurances that such estimates and assumptions will prove to be correct. Accordingly, readers should not place undue reliance on the forward-looking statements and information contained in this news release concerning these times. Each of <org value=\"HLSCF.NaE\" idsrc=\"xmltag.org\" >Highlander Silver</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='HLSCF' fmr-param-security-type='Equity'>( HLSCF )</span> and Bear Creek is under no obligation (and expressly disclaims any such obligation) to update or alter any statements containing forward-looking information or the factors or assumptions underlying them, whether as a result of new information, future events or otherwise, except as required by applicable securities laws. All of the forward-looking information in this release is qualified by the cautionary statements herein.</p>  <p align=\"justify\"><em>Neither the <org>TSX Venture Exchange</org> nor its Regulation Services Provider (as that term is defined in the policies of the <org>TSX Venture Exchange</org>) accepts responsibility for the adequacy or accuracy of this news release.</em></p>  Image: https://www.globenewswire.com/newsroom/ti?nf=OTY2MjQ5OCM3NDU4MjgyIzIzMDE5NTU=  <br/> Image: https://ml.globenewswire.com/media/NmQ5MzA5YjUtNmM4YS00ODNkLTk3NWQtZGYyM2FjNTA5MTI3LTEzMTM1MDUtMjAyNi0wMi0yNi1lbg==/tiny/Highlander-Silver-Corp-.png <p> Image: Primary Logo </p>\nSource: <org value=\"HLSCF.NaE\" idsrc=\"xmltag.org\" >Highlander Silver Corp.</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='HLSCF' fmr-param-security-type='Equity'>( HLSCF )</span>\n",
            "link": "https://www.fidelity.com/news/article/mergers-and-acquisitions/202602261600PRIMZONEFULLFEED9662498",
            "pub_date": "2026-02-27 05:00:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US mortgage rates dip below 6%, but supply remains key",
            "description": "<p><location value=\"LU/us.dc.wash\" idsrc=\"xmltag.org\" >WASHINGTON</location>, <chron>Feb 26</chron> (Reuters) - The average rate on the popular U.S. 30-year fixed-rate mortgage fell below 6% this week for the first time in 3-1/2 years, but economists said the improvement was likely temporary and on its own insufficient to boost housing demand unless supply increased.</p>\n<p>The 30-year fixed mortgage rate averaged 5.98%, the lowest level since <chron>September 2022</chron>, from 6.01% last week, mortgage finance agency Freddie Mac said on Thursday. It averaged 6.76% during the same period a year ago. </p>\n<p>The drop followed a decline in the benchmark 10-year U.S. Treasury yield after the <org>U.S. Supreme Court</org> on Friday struck down President <person>Donald Trump's</person> sweeping tariffs, which he had pursued under a law meant for use in national emergencies. </p>\n<p>Trump swiftly imposed a 10% global tariff for 150 days to replace some of the emergency duties, before raising the rate to 15% over the weekend. The 30-year fixed-rate mortgage tracks the 10-year Treasury yield.</p>\n<p>&quot;This legal tug-of-war has triggered a flight to safety among investors, pushing bond prices higher and yields lower, helping mortgage rates settle around 6%,&quot; said <person>Jiayi Xu</person>, an economist at Realtor.com. &quot;However, as this week's decline stems from market volatility rather than fundamental economic data, more supportive economic data is needed to establish a consistent trend.&quot;</p>\n<p>Trump ordered the <org>Federal Housing Finance Agency</org> - which oversees Freddie Mac and another mortgage finance giant Fannie Mae - to purchase <money>$200 billion</money> of bonds issued by the two companies to help lower the cost of home loans. </p>\n<p>But the average rate on the 15-year fixed-rate mortgage increased to 5.44% this week from 5.35% in the prior week. It averaged 5.94% during the same period a year ago. </p>\n<p>SUPPLY IS KEY FOR THE HOUSING MARKET</p>\n<p>Economists are skeptical that mortgage purchases will significantly improve housing affordability.</p>\n<p>Minutes of the Federal Reserve's <chron>January 27-28</chron> policy meeting published last week, describing a briefing by a New York Fed official responsible for implementing monetary policy, noted that plans by the administration to buy mortgage bonds had caused &quot;a notable decline in mortgage-backed securities yields relative to those on comparable-maturity Treasury yields.\"</p>\n<p>Despite that move in the market, the official &quot;observed that the decline was unlikely to result in a material increase in mortgage refinancing because current mortgage rates are well above the weighted average rate of outstanding mortgages,&quot; the minutes said.</p>\n<p>Trump is under pressure to bring down costs, including for housing, as he and his fellow Republicans face a tough battle to retain control of the <org>U.S. Congress</org> in this year's mid-term elections. Economists and policymakers say a dearth of properties for sale, especially starter homes, was weighing on the housing market. </p>\n<p>The inventory of previously owned houses is well below its pre-pandemic level. Many homeowners hold mortgages with rates below 5%, creating what has been called a rate-lock. </p>\n<p>Though supply improved last year, progress has stalled. There have been reports of homeowners pulling their houses off the market because of lower prices. House prices increased 1.8% in the 12 months through December after climbing 2.1% in November, the <org>Federal Housing Finance Agency</org> said on Tuesday. </p>\n<p>Economists and trade groups say the Trump administration's trade and immigration policies, which have raised prices for building materials and appliances and undercut labor supply, were constraining builders' ability to break ground on new single-family housing projects. Building lots are also scarce amid state and local government regulations.</p>\n<p>Still, the slowdown in the 30-year fixed mortgage rate could encourage some potential sellers to list their homes, and draw prospective home buyers into the market.</p>\n<p>&quot;While buying power has already increased <money>$30,000</money> from last year, mortgage rates below 6% could be an important psychological threshold,&quot; said <person>Kara Ng</person>, senior economist at Zillow. &quot;Round numbers matter, and that headline alone could prompt many sidelined buyers to take another peek at the housing market.&quot; </p>\n<p></p>\n<p>(Reporting by Lucia Mutikani, additional reporting by <person>Michael S. Derby</person> and <person>Saeed Azhar</person>; Editing by <person>Chizu Nomiyama</person> and <person>Mark Porter</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/top-news/202602261354RTRSNEWSCOMBINED_KBN3PG2D7-OUSBS_1",
            "pub_date": "2026-02-27 05:10:42",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Sector Update: Health Care",
            "description": "\n<p><chron>03:34 PM EST</chron>, <chron>02/26/2026</chron> (MT Newswires) -- Health care stocks declined late Thursday afternoon with the NYSE Health Care Index easing 0.1% and the State Street Health Care Select Sector SPDR ETF (XLV) decreasing 0.3%.</p><p>The iShares Biotechnology ETF (IBB) dropped 1.1%.</p><p>In corporate news, <org value=\"MMSI.NaE\" idsrc=\"xmltag.org\" >Merit Medical Systems</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='MMSI' fmr-param-security-type='Equity'>( MMSI )</span>  shares fell 1.5% after Wells Fargo downgraded the stock to equal weight from overweight.</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/us-markets/202602261534MIDNIGHTUSEQUITY_A3574056",
            "pub_date": "2026-02-27 04:34:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Sector Update: Energy",
            "description": "\n<p><chron>03:40 PM EST</chron>, <chron>02/26/2026</chron> (MT Newswires) -- Energy stocks were rising late Thursday afternoon, with the NYSE Energy Sector Index increasing 0.2% and the State Street Energy Select Sector SPDR ETF (XLE) adding 0.6%.</p><p>The Philadelphia Oil Service Sector Index was decreasing 0.7%, and the Dow Jones US Utilities Index was easing 0.2%.</p><p>Front-month West Texas Intermediate crude oil decreased 0.2% to <money>$65.29</money> a barrel, and the global benchmark Brent crude contract eased 0.1% to <money>$70.77</money> a barrel. Henry Hub natural gas futures fell 1.3% to <money>$2.83</money> per 1 million BTU.</p><p>In sector news, US natural gas stocks declined by 52 billion cubic feet in the week ended <chron>Feb. 20</chron>, slightly larger than the 50-billion cubic foot decrease expected in a survey compiled by <org>Bloomberg</org> and following a decrease of 144 billion cubic feet in the previous week.</p><p>In corporate news, <org value=\"SRE.NaE\" idsrc=\"xmltag.org\" >Sempra</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='SRE' fmr-param-security-type='Equity'>( SRE )</span>  shares rose 1.4%. The company reported Q4 adjusted earnings Thursday of <money>$1.28</money> per diluted share, down from <money>$1.50</money> a year earlier but above analysts' estimates.</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/us-markets/202602261540MIDNIGHTUSEQUITY_A3574058",
            "pub_date": "2026-02-27 04:40:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US trade panel to probe impact of revoking China's permanent normal trade status",
            "description": "\n<p><location value=\"LU/us.dc.wash\" idsrc=\"xmltag.org\" >WASHINGTON</location>, <chron>Feb 26</chron> (Reuters) - <org>The U.S. International Trade Commission</org> said on Thursday it would investigate the economic impact of revoking <location value=\"LC/cn\" idsrc=\"xmltag.org\" >China's</location> permanent normal trade status over a six-year period, a move that would likely increase tariffs on Chinese imports.</p>\n<p>The trade panel said in a statement that it will publish the results of the probe, ordered in a congressional appropriations bill, by <chron>August 21</chron>.</p>\n<p>When he took office in <chron>January 2025</chron>, President <person>Donald Trump</person> ordered his trade and commerce chiefs to assess legislative proposals to revoke Permanent Normal Trade Relations with <location value=\"LC/cn\" idsrc=\"xmltag.org\" >China</location>. PNTR was first granted in 2000, allowing <location value=\"LC/cn\" idsrc=\"xmltag.org\" >China</location> to join the <org>World Trade Organization</org>, a move that catapulted the country into becoming the world's biggest manufacturer.</p>\n<p>Since his <chron>inauguration day</chron> order, Trump imposed new tariffs on Chinese imports that reached as high as 145% last year, but that had been reduced to around 20% through a series of trade negotiations before the <org>Supreme Court</org> last week ruled Trump's emergency tariffs illegal. </p>\n<p>Trump's punitive <location value=\"LC/cn\" idsrc=\"xmltag.org\" >China</location> duties sit on top of the normal &quot;Most Favored Nation&quot; duties of about 2.5% that prevailed before he launched a trade war on <location value=\"LC/cn\" idsrc=\"xmltag.org\" >China</location> during his first term, imposing tariffs of about 25% on most Chinese imports.</p>\n<p>Revoking PNTR would raise the base MFN rates, adding to whatever punitive duties Trump imposes to replace the illegal emergency tariffs under other trade authorities. </p>\n<p>The USITC, which studies trade and competitiveness matters and rules on anti-dumping and anti-subsidy trade cases, said its report would focus on U.S. trade, production and prices in the industries that could be directly and most affected by increasing tariffs on Chinese goods to the higher non-MFN rates.</p>\n<p>The panel said it would also examine an alternative scenario where <org>Congress</org> revokes PNTR treatment with a five-year phase-in of a subset of tariffs on products important for national security.</p>\n<p>The USITC said the public was invited to file written comments on the implications of raising these tariffs on Chinese imports, through the close of business on <chron>April 13</chron>. Due to the accelerated timeline, the commission said it does not plan to hold a public hearing.</p>\n<p>(Reporting by <person>David Lawder</person>, <person>Daphne Psaledakis</person> and <person>Bhargav Acharya</person>; Editing by <person>David Ljunggren</person> and <person>Mark Porter</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/us-economy/202602261537RTRSNEWSCOMBINED_KBN3PG23A-OUSBS_1",
            "pub_date": "2026-02-27 04:37:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Research Alert: CFRA Reiterates Hold Opinion On Shares Of The Toronto-dominion Bank",
            "description": "\n<p><chron>03:40 PM EST</chron>, <chron>02/26/2026</chron> (MT Newswires) -- CFRA, an independent research provider, has provided MT Newswires with the following research alert. Analysts at CFRA have summarized their opinion as follows:</p><p>After reviewing Q1 FY 26 earnings, we increase our 12-month target price by <money>CAD18</money> to <money>CAD151</money>, 14.8x our FY 27 (Oct.) EPS view of <money>CAD10.22</money>, above the peer average P/E of 13.1x, as superior credit quality and improving efficiency outweigh headwinds stemming from the asset cap on TD's two U.S. banking subsidiaries. We raise our FY 26 EPS estimate to <money>CAD9.37</money> from <money>CAD9.04</money> and increase FY 27's to <money>CAD10.22</money> from <money>CAD9.64</money>. While credit quality is weakening industry-wide, TD's recent results are encouraging. Gross impaired loans have risen only modestly in recent quarters. TD still trails peers on efficiency but is making progress as its adjusted efficiency ratio improved 190 bps Y/Y to 57.1% in Q1 FY 26. Return on equity (ROE) also improved 100 bps to 14.2%. Additional ROE gains should come readily as TD plans to reduce its CET1 ratio from 14.5% to approximately 13% by 2H FY 27, which would add another 100 bps to ROE. Shares yield a healthy 3.1%.</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/investing-ideas/202602261540MIDNIGHTUSEQUITY_A3574061",
            "pub_date": "2026-02-27 04:40:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Research Alert: CFRA Reiterates Hold Opinion On Shares Of The Toronto-dominion Bank",
            "description": "\n<p><chron>03:40 PM EST</chron>, <chron>02/26/2026</chron> (MT Newswires) -- CFRA, an independent research provider, has provided MT Newswires with the following research alert. Analysts at CFRA have summarized their opinion as follows:</p><p>After reviewing Q1 2026 earnings, we increase our 12-month target price by <money>USD15</money> to <money>USD110</money>, 14.8x our FY 27 (Oct.) EPS view of <money>CAD10.22</money>, above the peer average P/E of 13.1x, as superior credit quality and improving efficiency outweigh headwinds stemming from the asset cap on TD's two U.S. banking subsidiaries. We raise our FY 26 EPS estimate to <money>CAD9.37</money> from <money>CAD9.04</money> and increase FY 27's to <money>CAD10.22</money> from <money>CAD9.64</money>. While credit quality is weakening industry-wide, TD's recent results are encouraging. Gross impaired loans have risen only modestly in recent quarters. TD still trails peers on efficiency but is making progress as its adjusted efficiency ratio improved 190 bps Y/Y to 57.1% in Q1 FY 26. Return on equity (ROE) also improved 100 bps to 14.2%. Additional ROE gains should come readily as TD plans to reduce its CET1 ratio from 14.5% to approximately 13% by 2H FY 27, which would add another 100 bps to ROE. Shares yield a healthy 3.1%.</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/investing-ideas/202602261540MIDNIGHTUSEQUITY_A3574060",
            "pub_date": "2026-02-27 04:40:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Modine Manufacturing Insider Sold Shares Worth $2,816,520, According to a Recent SEC Filing",
            "description": "\n<p><chron>03:33 PM EST</chron>, <chron>02/26/2026</chron> (MT Newswires) -- Marsha C Williams, Director, on <chron>February 24, 2026</chron>, sold 12,000 shares in <org value=\"MOD.NaE\" idsrc=\"xmltag.org\" >Modine Manufacturing</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='MOD' fmr-param-security-type='Equity'>( MOD )</span>  for <money>$2,816,520</money>. Following the Form 4 filing with the <org>SEC</org>, Williams has control over a total of 110,653 common shares of the company, with 110,653 shares held directly.</p><p>SEC Filing:</p><p>https://www.sec.gov/Archives/edgar/data/67347/000118560926000005/xslF345X05/form4-02262026_080216.xml</p><p>Price: 229.50, Change: -0.69, Percent Change: -0.30</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602261533MIDNIGHTUSEQUITY_A3574055",
            "pub_date": "2026-02-27 04:33:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "--Graphic Packaging Keeps Quarterly Dividend at $0.11 a Share, Payable April 8 to Holders of Record March 15",
            "description": "\n<p><chron>03:42 PM EST</chron>, <chron>02/26/2026</chron> (MT Newswires) --</p><p>Price: 12.15, Change: +0.14, Percent Change: +1.12</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602261542MIDNIGHTUSEQUITY_A3574059",
            "pub_date": "2026-02-27 04:42:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Sector Update: Financial",
            "description": "\n<p><chron>03:26 PM EST</chron>, <chron>02/26/2026</chron> (MT Newswires) -- Financial stocks were advancing in late Thursday afternoon trading, with the NYSE Financial Index up 0.9% and the State Street Financial Select Sector SPDR ETF (XLF) ahead 1.2%.</p><p>The Philadelphia Housing Index was adding 0.7%, and the State Street Real Estate Select Sector SPDR ETF (XLRE) was rising 0.5%.</p><p>Bitcoin (BTC-USD) was declining 0.4% to <money>$67,734.9</money>, and the yield for 10-year US Treasuries was decreasing 3.2 basis points to 4.02%.</p><p>In corporate news, <org value=\"APO.NaE\" idsrc=\"xmltag.org\" >Apollo Global Management</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='APO' fmr-param-security-type='Equity'>( APO )</span>  and French bank BNP Paribas are close to entering a partnership to arrange loans for corporate and private equity clients in <location value=\"LR/eur\" idsrc=\"xmltag.org\" >Europe</location>, <org>Bloomberg</org> reported. Apollo shares were down 2.7%.</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/us-markets/202602261526MIDNIGHTUSEQUITY_A3574050",
            "pub_date": "2026-02-27 04:26:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "EMERGING MARKETS-LatAM assets swept up in global risk-off move; Colombian assets plunge",
            "description": "\n<pre>\n\n        *\n      <location value=\"LC/sn\" idsrc=\"xmltag.org\" >Senegal</location> seeks <money>$362 million</money> with its first public bond in\n2026\n\n\n        *\n      <location value=\"LC/ec\" idsrc=\"xmltag.org\" >Ecuador</location> increases tariffs on Colombian goods to 50% from\nMarch\n\n\n        *\n      Colombian assets set for biggest one-day falls in years\n\n\n        *\n      Latam stocks down 1.1%, <location value=\"LC/co\" idsrc=\"xmltag.org\" >Colombia</location> stocks down over 4%\n\n\n\n (Updates with late trading prices)\n    By <person>Pranav Kashyap</person> and <person>Purvi Agarwal</person>\n       <chron>Feb 26</chron> (Reuters) - Most Latin American currencies and\nstocks weakened, as caution around AI trade dampened global risk\nsentiment, while Colombian assets largely underperformed peers\nafter <location value=\"LC/ec\" idsrc=\"xmltag.org\" >Ecuador</location> hiked tariffs on its products.\n    Colombian stocks slumped 4.7%, and were set for\ntheir steepest intraday decline since <chron>March 2020</chron>, while the\nlocal peso lost 2.1% against the dollar, and was on track\nfor its biggest one-day fall since April last year.\n    <location value=\"LC/ec\" idsrc=\"xmltag.org\" >Ecuador</location> will increase tariffs on Colombian imports to 50%\nfrom the current 30% from <chron>March 1</chron>, the government said in a\nstatement on Thursday, escalating a trade spat between the\nneighboring countries over border security.\n    A 1.5% tumble in oil prices also impacted Colombian assets.\nOil is among the country's top exports.\n    Broadly, investors were not impressed by chip giant <org value=\"NVDA.NaE\" idsrc=\"xmltag.org\" >Nvidia's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NVDA' fmr-param-security-type='Equity'>( NVDA )</span>\n upbeat forecasts as doubts lingered over returns from\nlofty investments in AI, which hit risk appetite across markets.\n    The trepidation reverberated in <location value=\"LR/cam\" idsrc=\"xmltag.org\" >Latin America</location>, with MSCI's\nindex tracking stocks in the region down 1%.\n    Even with Thursday's softer tone, the index eyed a positive\nend to the month, as cracks in the AI trade, stretched tech\nvaluations, and uncertainty around President <person>Donald Trump's</person>\ntariff agenda prompted investors to diversify away from U.S.\nstocks.\n    <person>William Jackson</person>, chief EM economist at Capital Economics,\nsaid &quot;EM external positions look strong by recent standards,\nsuggesting that they are well placed to cope were there to be a\nbout of outflows.&quot;\n\n    REAL TURNS LOWER, <location value=\"LC/br\" idsrc=\"xmltag.org\" >BRAZIL</location> ECONOMY COOLS\n    <location value=\"LC/br\" idsrc=\"xmltag.org\" >Brazil's</location> real was down 0.3%, and on track for a\nroughly 2% monthly gain, though that would be only about half\nthe increase of January's rally.\n    The currency has been under pressure as a series of datasets\nthat point to a cooling economy have led investors to anticipate\nan interest rate cut in March, which could be <location value=\"LC/br\" idsrc=\"xmltag.org\" >Brazil's</location> first\nsince 2024.\n    The real has resumed its downtrend, <person>Kenneth Broux</person>, head of\ncorporate research at Societe Generale, noted.\n    &quot;The political dimension cannot be overlooked for the\noutperformance of the real.&quot;\n    In <location value=\"LR/cam\" idsrc=\"xmltag.org\" >Latin America</location>, the story has become less about a single\nEM trade and more focused on individual markets, as local data\npulls central banks onto diverging paths, impacting the\nattractiveness of the carry trade in these markets.\n    <location value=\"LC/mx\" idsrc=\"xmltag.org\" >Mexico's</location> economy has shown signs of heating up after last\nyear's sluggishness, reinforcing the central bank's decision to\npause its rate-cut cycle. <org>The Bank of Mexico</org> still raised its\ngrowth forecast for the economy this year to 1.6% from 1.1%.\n     But <location value=\"LC/mx\" idsrc=\"xmltag.org\" >Mexico's</location> assets ran into a rough patch earlier in the\nweek as investors assessed the fallout from Sunday's operation\nin which Mexican forces killed the country's most wanted cartel\nleader.\n    The peso was down 0.2% on Thursday, while stocks\n were off 0.1%.\n    <location value=\"LC/cl\" idsrc=\"xmltag.org\" >Chile's</location> peso and stocks also fell as prices\nof copper eased from two-week highs.\n    In frontier markets, <location value=\"LC/sn\" idsrc=\"xmltag.org\" >Senegal's</location> dollar bonds firmed as the\ngovernment launched its first public bond offering of the year,\naiming to raise <money>200 billion CFA francs</money> (<money>$362.15 million</money>).\n\n    Key Latin American stock indexes and currencies:\n\n\n Latin American market\n prices from Reuters\n Equities                    Latest     Daily %\n                                        change\n MSCI Emerging Markets         1617.27       0.17\n\n MSCI LatAm                    3252.08      -0.95\n Brazil Bovespa              190685.98      -0.29\n Mexico IPC                   71083.87      -0.09\n Chile IPSA                   11049.69      -0.75\n Argentina Merval            2758585.0      -1.48\n                                     5\n Colombia COLCAP               2269.71      -4.73\n\n Currencies                  Latest     Daily %\n                                        change\n Brazil real                    5.1381      -0.26\n Mexico peso                      17.2      -0.24\n Chile peso                     865.47      -1.02\n Colombia peso                  3760.5      -2.06\n Peru sol                       3.3545       0.03\n Argentina peso (interbank)       1408        1.4\n\n Argentina peso (parallel)        1405      -0.72\n\n\n\n\n (Reporting by <person>Pranav Kashyap</person> in <location value=\"LU/in..bangal\" idsrc=\"xmltag.org\" >Bangalore</location>\nEditing by <person>Rod Nickel</person> and Shinjini Ganguli)\n\n</pre>\n",
            "link": "https://www.fidelity.com/news/article/international/202602261527RTRSNEWSCOMBINED_L1N3ZM1A2_1",
            "pub_date": "2026-02-27 04:27:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Empresas Copec's Q4 profit jumps 26%, above expectations",
            "description": "\n<p><chron>Feb 26</chron> (Reuters) - Chilean industrial conglomerate\nEmpresas Copec on Thursday posted an 26% jump in net\nprofit for the last quarter of 2025, hitting <money>$242 million</money>, from\nrevenues that rose 11% to <money>$7.7 billion</money>.</p>\n<p>Earnings landed comfortably above the expectations of\nanalysts polled by LSEG, who had predicted a fourth-quarter\nprofit of <money>$142 million</money> from revenues of <money>$7.1 billion</money>.</p>\n<p>In an earnings statement, Copec said that a railway\nlogistics project being built alongside its Sucuriu pulp mill\ncomplex in <location value=\"LC/br\" idsrc=\"xmltag.org\" >Brazil</location> should be completed towards the end of next\nyear, in line with the expected start-up of the plant.\n(Reporting by <person>Sarah Morland</person>;)</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602261523RTRSNEWSCOMBINED_S0N3YN04N_1",
            "pub_date": "2026-02-27 04:23:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Sector Update: Consumer",
            "description": "\n<p><chron>03:26 PM EST</chron>, <chron>02/26/2026</chron> (MT Newswires) -- Consumer stocks were mixed late Thursday afternoon, with the State Street Consumer Staples Select Sector SPDR ETF (XLP) decreasing 0.2% and the State Street Consumer Discretionary Select Sector SPDR ETF (XLY) fractionally higher.</p><p>In corporate news, <org value=\"SHAK.NaE\" idsrc=\"xmltag.org\" >Shake Shack</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='SHAK' fmr-param-security-type='Equity'>( SHAK )</span>  reported better-than-expected Q4 earnings and said the new year has kicked off on a high note despite weather-related headwinds. Its shares jumped past 9%.</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602261526MIDNIGHTUSEQUITY_A3574051",
            "pub_date": "2026-02-27 04:26:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Warner Bros' TV decline puts pressure on Netflix deal",
            "description": "<p><chron>Feb 26</chron> (Reuters) - <org value=\"WBD.NaE\" idsrc=\"xmltag.org\" >Warner Bros Discovery</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='WBD' fmr-param-security-type='Equity'>( WBD )</span> heaped an additional burden on <org value=\"NFLX.NaE\" idsrc=\"xmltag.org\" >Netflix's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NFLX' fmr-param-security-type='Equity'>( NFLX )</span> <money>$82.7 billion</money> bid for the movie studio and HBO.</p>\n<p>The entertainment company behind the buzzy series &quot;Heated Rivalry&quot; and the film &quot;<location>Wuthering Heights</location>&quot; reported fourth-quarter earnings Thursday that showed profit at its cable channels is deteriorating at a fast pace.</p>\n<p>The networks, which include CNN, the Discovery Network and TNT, are not part of <org value=\"NFLX.NaE\" idsrc=\"xmltag.org\" >Netflix's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NFLX' fmr-param-security-type='Equity'>( NFLX )</span> deal. But their worth as a separately traded company is a key component in valuing the streaming service's offer for the <org>Warner Bros</org> film and TV studios, its library, HBO and the HBO Max streaming service.</p>\n<p>Rival <org value=\"PSKY.NaE\" idsrc=\"xmltag.org\" >Paramount Skydance</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='PSKY' fmr-param-security-type='Equity'>( PSKY )</span> raised its proposal to buy all of <org>Warner Bros</org> to <money>$110 billion</money>. On Tuesday, the Warner board said it is negotiating with the rival bidder to determine whether the revised proposal could result in a deal superior to <org value=\"NFLX.NaE\" idsrc=\"xmltag.org\" >Netflix's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NFLX' fmr-param-security-type='Equity'>( NFLX )</span> offer. </p>\n<p><org>Warner Bros</org> Chief Executive <person>David Zaslav</person> did not address the discussions on a call with investors Thursday. Instead, he highlighted his role in sparking a bidding war for the coveted assets.</p>\n<p>&quot;We engaged with four bidders, which led to eight price increases, and have thus far achieved a 63% increase in value versus the first offer received in September, delivering significant value to WBD shareholders throughout the process,&quot; Zaslav told investors.</p>\n<p>Warner's board had previously determined <org value=\"NFLX.NaE\" idsrc=\"xmltag.org\" >Netflix's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NFLX' fmr-param-security-type='Equity'>( NFLX )</span> offer was superior to <org>Paramount's</org> because investors would also receive the value of its planned spin-off of the television group, Discovery Global.</p>\n<p>The division's revenue fell to <money>$4.2 billion</money>, down 12% from a year earlier, and adjusted income dropped to <money>$1.4 billion</money>, a 27% plunge from the same quarter a year earlier. Such declines affect the value of the TV networks as a standalone business, Discovery Global.</p>\n<p>Its closest comparison is Versant Media, the cable and digital assets separated from Comcast earlier this year. Versant's enterprise is worth roughly 3 times its 2025 forecast EBITDA of <money>$2.1 billion</money>. On the same yardstick, Discovery Global's market capitalization would be approximately <money>$3 billion</money> or a little over <money>$1</money> per share, assuming <money>$17 billion</money> in net debt.</p>\n<p>Add that to <org value=\"NFLX.NaE\" idsrc=\"xmltag.org\" >Netflix's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NFLX' fmr-param-security-type='Equity'>( NFLX )</span> cash offer of <money>$27.75</money> per share and it comes in shy of <org>Paramount's</org> bid of <money>$31</money>.</p>\n<p>Warner CFO <person>Gunnar Wiedenfels</person> declined to address that comparison. <org value=\"NFLX.NaE\" idsrc=\"xmltag.org\" >Netflix</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NFLX' fmr-param-security-type='Equity'>( NFLX )</span> declined a request for comment.</p>\n<p>HBO Max continued to grow, helped by series like &quot;Heated Rivalry&quot; and &quot;It: Welcome to Derry.&quot; <org>Warner Bros</org> added 3.5 million streaming subscribers in the quarter, bringing its total number worldwide to 131.6 million.</p>\n<p>The streaming group's revenue rose 5% to nearly <money>$2.8 billion</money>, but adjusted earnings fell 4% to <money>$393 million</money> due to the end of an unspecified distribution deal.</p>\n<p>&quot;The best thing for WBD shareholders is that it is being sold, because its fundamentals continue to deteriorate,&quot; wrote Needham &amp; Co senior research analyst <person>Laura Martin</person>.</p>\n<p>Warner's stock was largely unchanged in early morning trading.</p>\n<p>Zaslav also highlighted the success of the <org>Warner Bros</org> film slate, including &quot;<location>Wuthering Heights</location>,&quot; &quot;A Minecraft Movie&quot; and &quot;Superman.&quot;</p>\n<p>&quot;We love the motion picture business,&quot; Zaslav said on the call. &quot;We at the company believe so deeply in the motion picture business, putting movies on the screen for shared experience ... Our commitment to the motion picture business is the core of our company.&quot;</p>\n<p><org value=\"NFLX.NaE\" idsrc=\"xmltag.org\" >Netflix</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NFLX' fmr-param-security-type='Equity'>( NFLX )</span> Chief Executive <person>Ted Sarandos</person> has defended his deal for the studio and HBO by affirming his commitment to releasing movies in theaters, a strategy that was never part of <org value=\"NFLX.NaE\" idsrc=\"xmltag.org\" >Netflix's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NFLX' fmr-param-security-type='Equity'>( NFLX )</span> DNA.</p>\n<p>Should <org>Warner Bros</org> board declare that <org>Paramount's</org> deal is superior, <org value=\"NFLX.NaE\" idsrc=\"xmltag.org\" >Netflix</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NFLX' fmr-param-security-type='Equity'>( NFLX )</span> has four business days to revise its offer.</p>\n<p> (Reporting by <person>Dawn Chmielewski</person> in <location value=\"LU/us.ca.losang\" idsrc=\"xmltag.org\" >Los Angeles</location> and <person>Harshita Mary Varghese</person> in Bengaluru; Editing by <person>Jennifer Saba</person>, <person>Edwina Gibbs</person> and <person>Nick Zieminski</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/top-news/202602260705RTRSNEWSCOMBINED_KBN3PG1EB-OUSBS_1",
            "pub_date": "2026-02-27 04:35:48",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Intapp Stock: A Deep Dive Into Analyst Perspectives (9 Ratings)",
            "description": "\n<p>9 analysts have shared their evaluations of <org value=\"INTA.NaE\" idsrc=\"xmltag.org\" >Intapp</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='INTA' fmr-param-security-type='Equity'>( INTA )</span> during the recent three months, expressing a mix of bullish and bearish perspectives.</p>\n<p>The following table summarizes their recent ratings, shedding light on the changing sentiments within the past 30 days and comparing them to the preceding months.</p>\n<table>\n<thead>\n<tr>\n<th></th>\n<th align=\"right\"><strong>Bullish</strong></th>\n<th align=\"right\"><strong>Somewhat Bullish</strong></th>\n<th align=\"right\"><strong>Indifferent</strong></th>\n<th align=\"right\"><strong>Somewhat Bearish</strong></th>\n<th align=\"right\"><strong>Bearish</strong></th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td><strong>Total Ratings</strong></td>\n<td align=\"right\">2</td>\n<td align=\"right\">1</td>\n<td align=\"right\">4</td>\n<td align=\"right\">2</td>\n<td align=\"right\">0</td>\n</tr>\n<tr>\n<td><strong>Last 30D</strong></td>\n<td align=\"right\">1</td>\n<td align=\"right\">0</td>\n<td align=\"right\">1</td>\n<td align=\"right\">0</td>\n<td align=\"right\">0</td>\n</tr>\n<tr>\n<td><strong>1M Ago</strong></td>\n<td align=\"right\">1</td>\n<td align=\"right\">1</td>\n<td align=\"right\">2</td>\n<td align=\"right\">1</td>\n<td align=\"right\">0</td>\n</tr>\n<tr>\n<td><strong>2M Ago</strong></td>\n<td align=\"right\">0</td>\n<td align=\"right\">0</td>\n<td align=\"right\">0</td>\n<td align=\"right\">1</td>\n<td align=\"right\">0</td>\n</tr>\n<tr>\n<td><strong>3M Ago</strong></td>\n<td align=\"right\">0</td>\n<td align=\"right\">0</td>\n<td align=\"right\">1</td>\n<td align=\"right\">0</td>\n<td align=\"right\">0</td>\n</tr>\n</tbody>\n</table>\n\n<p>Insights from analysts' 12-month price targets are revealed, presenting an average target of <money>$39.67</money>, a high estimate of <money>$58.00</money>, and a low estimate of <money>$25.00</money>. A 14.8% drop is evident in the current average compared to the previous average price target of <money>$46.56</money>. </p>\n<p><img src=\"https://www.benzinga.com/files/images/story/2026/1772136030_0_0.png\" alt=\"price target chart\" /></p>\n\n<h2>Breaking Down Analyst Ratings: A Detailed Examination</h2>\n<p>The standing of <org value=\"INTA.NaE\" idsrc=\"xmltag.org\" >Intapp</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='INTA' fmr-param-security-type='Equity'>( INTA )</span> among financial experts is revealed through an in-depth exploration of recent analyst actions. The summary below outlines key analysts, their recent evaluations, and adjustments to ratings and price targets.</p>\n<table>\n<thead>\n<tr>\n<th>Analyst</th>\n<th>Analyst Firm</th>\n<th>Action Taken</th>\n<th>Rating</th>\n<th>Current Price Target</th>\n<th>Prior Price Target</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td><person>Patrick Moley</person></td>\n<td>Piper Sandler</td>\n<td>Lowers</td>\n<td>Neutral</td>\n<td><money>$25.00</money></td>\n<td><money>$33.00</money></td>\n</tr>\n<tr>\n<td><location>Parker Lane</location></td>\n<td>Stifel</td>\n<td>Lowers</td>\n<td>Buy</td>\n<td><money>$35.00</money></td>\n<td><money>$40.00</money></td>\n</tr>\n<tr>\n<td><person>Steven Enders</person></td>\n<td>Citigroup</td>\n<td>Lowers</td>\n<td>Neutral</td>\n<td><money>$36.00</money></td>\n<td><money>$49.00</money></td>\n</tr>\n<tr>\n<td><person>Saket Kalia</person></td>\n<td>Barclays</td>\n<td>Lowers</td>\n<td>Underweight</td>\n<td><money>$35.00</money></td>\n<td><money>$46.00</money></td>\n</tr>\n<tr>\n<td><person>Alexei Gogolev</person></td>\n<td>JP Morgan</td>\n<td>Lowers</td>\n<td>Overweight</td>\n<td><money>$58.00</money></td>\n<td><money>$70.00</money></td>\n</tr>\n<tr>\n<td><person>Patrick Moley</person></td>\n<td>Piper Sandler</td>\n<td>Lowers</td>\n<td>Neutral</td>\n<td><money>$33.00</money></td>\n<td><money>$42.00</money></td>\n</tr>\n<tr>\n<td><location>Parker Lane</location></td>\n<td>Stifel</td>\n<td>Lowers</td>\n<td>Buy</td>\n<td><money>$40.00</money></td>\n<td><money>$50.00</money></td>\n</tr>\n<tr>\n<td><person>Saket Kalia</person></td>\n<td>Barclays</td>\n<td>Raises</td>\n<td>Underweight</td>\n<td><money>$46.00</money></td>\n<td><money>$43.00</money></td>\n</tr>\n<tr>\n<td><person>Steven Enders</person></td>\n<td>Citigroup</td>\n<td>Raises</td>\n<td>Neutral</td>\n<td><money>$49.00</money></td>\n<td><money>$46.00</money></td>\n</tr>\n</tbody>\n</table>\n\n<h3>Key Insights:</h3>\n<ul>\n<li><strong>Action Taken:</strong> In response to dynamic market conditions and company performance, analysts update their recommendations. Whether they 'Maintain', 'Raise', or 'Lower' their stance, it signifies their reaction to recent developments related to <org value=\"INTA.NaE\" idsrc=\"xmltag.org\" >Intapp</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='INTA' fmr-param-security-type='Equity'>( INTA )</span>. This insight gives a snapshot of analysts' perspectives on the current state of the company.</li>\n<li><strong>Rating:</strong> Providing a comprehensive analysis, analysts offer qualitative assessments, ranging from 'Outperform' to 'Underperform'. These ratings reflect expectations for the relative performance of <org value=\"INTA.NaE\" idsrc=\"xmltag.org\" >Intapp</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='INTA' fmr-param-security-type='Equity'>( INTA )</span> compared to the broader market.</li>\n<li><strong>Price Targets:</strong> Analysts navigate through adjustments in price targets, providing estimates for <org value=\"INTA.NaE\" idsrc=\"xmltag.org\" >Intapp's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='INTA' fmr-param-security-type='Equity'>( INTA )</span> future value. Comparing current and prior targets offers insights into analysts' evolving expectations.</li>\n</ul>\n<p>To gain a panoramic view of <org value=\"INTA.NaE\" idsrc=\"xmltag.org\" >Intapp's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='INTA' fmr-param-security-type='Equity'>( INTA )</span> market performance, explore these analyst evaluations alongside essential financial indicators. Stay informed and make judicious decisions using our Ratings Table.</p>\n<p><strong>Stay up to date on <org value=\"INTA.NaE\" idsrc=\"xmltag.org\" >Intapp</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='INTA' fmr-param-security-type='Equity'>( INTA )</span> analyst ratings.</strong></p>\n<p>If you are interested in following small-cap stock news and performance you can start by tracking it here.</p>\n<h2>All You Need to Know About Intapp</h2>\n<p><org value=\"INTA.NaE\" idsrc=\"xmltag.org\" >Intapp Inc</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='INTA' fmr-param-security-type='Equity'>( INTA )</span> is a provider of industry-specific, cloud-based software solutions for the professional and financial services industry. It empowers private capital,g, legal, accounting, and consulting firms with the technology needed to meet rapidly changing client, investor, and regulatory requirements. Geographically, it derives a majority of its revenue from <location value=\"LC/us\" idsrc=\"xmltag.org\" >the United States</location> and also has a presence in the <location value=\"LC/gb\" idsrc=\"xmltag.org\" >United Kingdom</location> and the Rest of the world.</p>\n<h3>A Deep Dive into Intapp's Financials</h3>\n<p><strong>Market Capitalization Analysis:</strong> The company exhibits a lower market capitalization profile, positioning itself below industry averages. This suggests a smaller scale relative to peers.</p>\n<p><strong>Revenue Growth:</strong> <org value=\"INTA.NaE\" idsrc=\"xmltag.org\" >Intapp's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='INTA' fmr-param-security-type='Equity'>( INTA )</span> remarkable performance in 3M is evident. As of <chron>31 December, 2025</chron>, the company achieved an impressive revenue growth rate of <strong>15.67%</strong>. This signifies a substantial increase in the company's top-line earnings. When compared to others in the Information Technology sector, the company faces challenges, achieving a growth rate lower than the average among peers.</p>\n<p><strong>Net Margin:</strong> <org value=\"INTA.NaE\" idsrc=\"xmltag.org\" >Intapp's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='INTA' fmr-param-security-type='Equity'>( INTA )</span> net margin surpasses industry standards, highlighting the company's exceptional financial performance. With an impressive <strong>-4.23%</strong> net margin, the company effectively manages costs and achieves strong profitability.</p>\n<p><strong>Return on Equity (ROE):</strong> <org value=\"INTA.NaE\" idsrc=\"xmltag.org\" >Intapp's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='INTA' fmr-param-security-type='Equity'>( INTA )</span> financial strength is reflected in its exceptional ROE, which exceeds industry averages. With a remarkable ROE of <strong>-1.32%,</strong> the company showcases efficient use of equity capital and strong financial health.</p>\n<p><strong>Return on Assets (ROA):</strong> The company's ROA is a standout performer, exceeding industry averages. With an impressive ROA of <strong>-0.73%,</strong> the company showcases effective utilization of assets.</p>\n<p><strong>Debt Management:</strong> <org value=\"INTA.NaE\" idsrc=\"xmltag.org\" >Intapp's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='INTA' fmr-param-security-type='Equity'>( INTA )</span> debt-to-equity ratio is below industry norms, indicating a sound financial structure with a ratio of <strong>0.04</strong>.</p>\n<h2>The Basics of Analyst Ratings</h2>\n<p>Within the domain of banking and financial systems, analysts specialize in reporting for specific stocks or defined sectors. Their work involves attending company conference calls and meetings, researching company financial statements, and communicating with insiders to publish &quot;analyst ratings&quot; for stocks. Analysts typically assess and rate each stock once per quarter.</p>\n<p>Some analysts publish their predictions for metrics such as growth estimates, earnings, and revenue to provide additional guidance with their ratings. When using analyst ratings, it is important to keep in mind that stock and sector analysts are also human and are only offering their opinions to investors.</p>\n<p>This article was generated by Benzinga's automated content engine and reviewed by an editor.</p>\n",
            "link": "https://www.fidelity.com/news/article/technology/202602261500BENZINGAFULLNGTH50906072",
            "pub_date": "2026-02-27 04:00:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "LlamaLab Asks Court to Throw Out Epic Systems Lawsuit And to Sever Unrelated Companies",
            "description": "\n<div class=\"xn-content\">\n<p><span class=\"legendSpanClass\"><location value=\"LU/us.ny.nyc\" idsrc=\"xmltag.org\" >NEW YORK</location></span>, <span class=\"legendSpanClass\"><chron>Feb. 26, 2026</chron></span> /PRNewswire/ -- <u><org>LlamaLab, Inc</org></u>. and its founder <person>Shere Saidon</person> today filed legal motions asking a federal court to dismiss a lawsuit brought by Epic Systems, the massive software company that dominates the electronic health records industry. The motions argue that Epic bypassed its own contractual dispute resolution obligations and wrongly lumped LlamaLab into a case alongside over a dozen unrelated defendants. LlamaLab categorically denies all allegations.</p>\n    <div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder1\">\n                <p>\n\n                    <img src=\"https://mma.prnewswire.com/media/2921586/llamalab_Logo.jpg\" title=\"https://www.llamalab.ai\" alt=\"https://www.llamalab.ai\" />\n\n                </p>\n    </div>\n<p>LlamaLab was founded with a single mission: providing patients and their legal teams with fast, secure access to medical records in compliance with all applicable laws. The company helps victims of catastrophic injuries and corporate negligence retrieve the critical records they need to build their cases and get the financial relief they deserve.</p><p>\"Patient privacy has always come first. We have never sold, stolen, or misused patient data, and we never will,\" Saidon said. \"This lawsuit isn't about protecting patients, it's about a gatekeeper protecting its dominance by targeting companies that try to make it easier for patients to retrieve their own medical records. It is a transparent attempt by a market-dominant player to crush potential competition and protect its own revenue streams.\"</p><p>\"Epic points to speed, innovation, friendship, and AI as evidence of wrongdoing,\" Saidon added. \"Patients shouldn't have to put up with a system that treats efficiency as a threat.\"</p><p>Epic's 90-page complaint sweeps LlamaLab into a case with over a dozen other defendants. These defendants span three entirely separate groups, operating in different states, on different timelines, with different business models. LlamaLab has no connection to any of the other companies and individuals named in the case. As detailed in the filings, these groups had \"no coordinated plan, no conspiracy, no communication with one another,\" and no business relationship of any kind. Epic has also reserved the right to add up to 100 more unnamed defendants to the case.</p><p>Crucially, Epic grouped LlamaLab into the same lawsuit as an individual with a federal criminal conviction for conspiracy to defraud <location value=\"LC/us\" idsrc=\"xmltag.org\" >the United States</location> and a bar from the <org>SEC</org>. LlamaLab has never met, spoken to, or worked with that individual or any of the other defendants. The filings warn against Epic's attempt to manufacture \"guilt by association\" and the risk that a jury would unfairly hold evidence about one defendant against another.</p><p>Epic's decision to broadcast unfounded allegations does not change the facts. \"LlamaLab is an independent company with no involvement with Epic or their networks, and we should never have been dragged into this case,\" Saidon said.</p><p>LlamaLab is not a member of the Carequality or TEFCA networks at the center of Epic's complaint. No one from Epic or any of the hospital co-plaintiffs ever contacted LlamaLab about any concern before filing this lawsuit. The company learned of the allegations when they were made public in federal court.</p><p>While LlamaLab itself does not participate in these networks, the filings highlight how Epic is breaking its own rules. Network participants like Epic and its co-plaintiffs are contractually bound to resolve disputes through dedicated governance boards before filing lawsuits. Epic started that process but abandoned it. Under the agreements Epic signed, bypassing these procedures is itself a breach of contract. Epic agreed to this framework, and cannot simply abandon the rules just because the process isn't going its way.</p><p>\"Epic essentially concedes it is attempting to avoid dispute resolution procedures it cannot control and sidestep independent boards it does not respect,\" Saidon said.</p><p>LlamaLab continues to operate and remains committed to helping patients access their medical records. The company intends to defend itself vigorously and looks forward to clearing its name in court. A hearing on the motions will be scheduled before Judge <person>Fernando M. Olguin</person> in the <org>U.S. District Court for the Central District of California</org> .</p><p><u>Click here</u> for more information or to read the court filings.</p><p><b>About LlamaLab</b></p><p><org>LlamaLab, Inc.</org> is a technology company founded by <person>Shere Saidon</person> that provides fast, secure, and authorized retrieval of medical records for patients and law firms representing victims of catastrophic injuries, medical malpractice, and corporate negligence. The company was built to help injured patients and their attorneys get the evidence they need to fight for the relief they deserve.</p>\n\n\n\n<p id=\"PURL\"><img title=\"Cision\" width=\"12\" height=\"12\" alt=\"Cision\" src=\"https://edge.prnewswire.com/c/img/favicon.png?sn=FL97132&amp;sd=2026-02-26\" /> View original content to download multimedia:https://www.prnewswire.com/news-releases/llamalab-asks-court-to-throw-out-epic-systems-lawsuit-and-to-sever-unrelated-companies-302698923.html</p><p>SOURCE LLamaLab</p></div>\n",
            "link": "https://www.fidelity.com/news/article/technology/202602261504PR_NEWS_USPR_____FL97132",
            "pub_date": "2026-02-27 04:04:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Hydaway Digital Closes $1.2 Million Private Placement Financing; Shares up 9%, Hit Fresh 52 Week Highs",
            "description": "\n<p><chron>03:12 PM EST</chron>, <chron>02/26/2026</chron> (MT Newswires) -- <org >Hydaway Digital</org> (HIDE.V) was at last look up 9%, but off fresh 52 week highs hit earlier, after saying before the open of trade Thursday it closed its non-brokered private placement financing of 4.8 million units at a price of <money>$0.25</money> each for gross proceeds of up to <money>$1.2 million</money>.</p><p>The company said that each unit consists of a share and a share purchase warrant, with each warrant exercisable at <money>$0.40</money> per share for a period of one year from the date of issue.</p><p>&quot;The Company has the right to accelerate the expiry date if, at any time, the Shares trade at a price equal to or greater than <money>$0.75</money> for 5 consecutive trading days,&quot; said the company. &quot;In the event of acceleration, the expiry date will be accelerated to a date that is 30 days after the Company issues the acceleration notice through a news release, provided that the acceleration notice is issued within 10 business days after the end of the particular 5-Day Period.&quot;</p><p>The company also said that <person>Karl Kottmeier</person>, the chief executive officer and a director of the company subscribed for 110,000 units, contributing <money>$27,500</money> to the offering, through a company, <org>Madjak Management Ltd.</org></p><p>The proceeds will be used to continue to develop the company's GPU rental platform as well as for general working capital purposes.</p><p>The company's shares were last seen up <money>$0.05</money> at <money>$0.60</money> on the <org>TSX Venture Exchange</org>, having earlier touched as high as <money>$0.75</money>.</p><p>Price: 0.60, Change: +0.05, Percent Change: +9.09</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602261512MIDNIGHTUSEQUITY_A3574016",
            "pub_date": "2026-02-27 04:12:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Broadcom Poised to Benefit From AI-Driven Sales in Fiscal Q1, Oppenheimer Says",
            "description": "\n<p><chron>03:14 PM EST</chron>, <chron>02/26/2026</chron> (MT Newswires) -- <org value=\"AVGO.NaE\" idsrc=\"xmltag.org\" >Broadcom</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AVGO' fmr-param-security-type='Equity'>( AVGO )</span>  is expected to benefit from accelerating AI-related sales in fiscal Q1, driven by hyperscalers and cloud service providers developing large frontier Large Language Models, Oppenheimer said.</p><p>The brokerage said in a Wednesday note that it expects AI-related sales to rise about 30% quarter over quarter in Q1, accelerating from 25% in fiscal Q4 and 17% in fiscal Q3. This could provide upside to fiscal Q1 street estimates of <money>$19.2 billion</money> in sales and <money>$2.02</money> in earnings per share.</p><p>The investment firm said that <org value=\"AVGO.NaE\" idsrc=\"xmltag.org\" >Broadcom's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AVGO' fmr-param-security-type='Equity'>( AVGO )</span> dominant custom Application-Specific Integrated Circuit, or ASIC, and networking franchises underpin a growing backlog of more than <money>$162 billion</money>. Of that, roughly <money>$73 billion</money> is related to AI orders.</p><p>The brokerage noted that <org value=\"AVGO.NaE\" idsrc=\"xmltag.org\" >Broadcom's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AVGO' fmr-param-security-type='Equity'>( AVGO )</span> secular growth is supported by data center AI infrastructure, networking and expanding TPU workloads. The investment firm said the factors are expected to drive steady cash flow for the company.</p><p>Oppenheimer reiterated its outperform rating and <money>$450</money> price target on the stock.</p><p>Shares of <org value=\"AVGO.NaE\" idsrc=\"xmltag.org\" >Broadcom</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AVGO' fmr-param-security-type='Equity'>( AVGO )</span> were down 4.6% in recent Thursday trading.</p><p>Price: 316.93, Change: -15.38, Percent Change: -4.63</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602261514MIDNIGHTUSEQUITY_A3574025",
            "pub_date": "2026-02-27 04:14:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Top Midday Gainers",
            "description": "\n<p><chron>01:29 PM EST</chron>, <chron>02/26/2026</chron> (MT Newswires) -- <org value=\"EFXT.NaE\" idsrc=\"xmltag.org\" >Enerflex</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='EFXT' fmr-param-security-type='Equity'>( EFXT )</span>  said late on Wednesday its preliminary 2026 outlook &quot;reflects steady demand across its business lines and geographic regions&quot; while reporting a swing to a Q4 net loss, and it signed a deal to divest the majority of its operations in the <location value=\"LR/asp\" idsrc=\"xmltag.org\" >Asia Pacific</location> region.</p><p>Shares jumped 16% as intraday trading volume climbed to more than 436,000 from a daily average of about 447,000.</p><p><org value=\"PVLA.NaE\" idsrc=\"xmltag.org\" >Palvella Therapeutics</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='PVLA' fmr-param-security-type='Equity'>( PVLA )</span>  said late Wednesday it priced an upsized offering of 1.6 million shares at <money>$125</money> each and granted underwriters an option to purchase up to 240,000 additional shares, targeting gross proceeds of about <money>$200 million</money>.</p><p>Shares advanced 13% as intraday trading volume jumped to over 769,000 from a daily average of roughly 292,000.</p><p><org value=\"NVAX.NaE\" idsrc=\"xmltag.org\" >Novavax</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NVAX' fmr-param-security-type='Equity'>( NVAX )</span>  shares rose 18% amid heavy trading on Thursday after the company swung to a profit in Q4, with revenue exceeding analysts' expectations.</p><p>More than 16.9 million shares of the company traded intraday compared with a daily average of about 4.3 million.</p><p>Price: 23.17, Change: +3.31, Percent Change: +16.64</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/international/202602261329MIDNIGHTUSEQUITY_A3573962",
            "pub_date": "2026-02-27 02:29:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Fed's Goolsbee forecasts several more rate cuts this year, but not soon",
            "description": "\n<p><chron>Feb 26</chron> (Reuters) - Chicago Federal Reserve President <person>Austan Goolsbee</person> said on Thursday his forecast for several interest-rate cuts later this year makes him one of the more &quot;optimistic&quot; Fed policymakers, but said he wants the Fed to be &quot;careful&quot; in doing so because it could overheat the economy and inflation.   </p>\n<p>&quot;I have some confidence rates can come down several more times this year in 2026,&quot; Goolsbee said in an interview on Fox News. &quot;I just don't want to front load it too much before we actually have the evidence that the inflation is headed&quot; back down to the Fed's 2% goal. </p>\n<p></p>\n<p> (Reporting by <person>Ann Saphir</person>; Editing by <person>Chris Reese</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/us-economy/202602261450RTRSNEWSCOMBINED_KBN3PG2GZ-OUSBS_1",
            "pub_date": "2026-02-27 03:50:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Odds of early Warsh-led Fed rate cuts slide with bullish outlook",
            "description": "<p><location value=\"LU/us.dc.wash\" idsrc=\"xmltag.org\" >WASHINGTON</location>, <chron>Feb 26</chron> (Reuters) - Federal Reserve chair nominee <person>Kevin Warsh's</person> path to out-of-the-gate interest rate cuts in alignment with President <person>Donald Trump's</person> expectations could be narrowing amid emerging bullishness about the U.S. economy, growing CEO confidence in the outlook, and investors keying off a hawkish shift among the central bank's policymakers.</p>\n<p><org>The International Monetary Fund</org> said on Wednesday that with expected U.S. growth rising to 2.4% this year from 2.2% last year, the unemployment rate likely hovering near 4%, and inflation falling gradually, the Fed would have &quot;only modest scope to lower the policy rate over the coming year&quot; through a single quarter-percentage-point cut.</p>\n<p>A new Conference Board CEO survey, meanwhile, saw a sharp jump in the outlook for both the wider economy and within each leader's industry, with little sense that large rounds of layoffs were in the offing and firms passing through price increases from the Trump administration's import tariffs - a combination that could make it harder to justify rate cuts.</p>\n<p>Investors, meanwhile, have pushed back their bets on the timing of an initial Warsh-led rate cut, to the Fed's <chron>July 28-29</chron> meeting from the <chron>June 16-17</chron> gathering. Though his nomination has not been formally submitted to the <org>Senate</org>, Warsh is expected to be confirmed in time for the June meeting, with current Fed Chair <person>Jerome Powell's</person> leadership term ending in May.</p>\n<p>The improved outlook may be good for the economy, but it could leave Warsh in the same bind as Powell, with data and his colleagues pulling in one direction and the <org>White House</org> pulling in another.</p>\n<p>&quot;The Fed's reaction function has shifted slightly more hawkish,&quot; Natixis CIB economists <person>Christopher Hodge</person> and <person>Selin Aker</person> wrote in a note, concluding the central bank could only make two quarter-percentage-point rate cuts this year, rather than the three they previously expected.</p>\n<p>MIRAN SAYS BIG DROP IN RATES STILL POSSIBLE IN 2026</p>\n<p>The U.S. central bank's next meeting is scheduled for <chron>March 17-18</chron>, when its policy-setting Federal Open Market Committee is expected to hold the benchmark interest rate in the 3.50%-3.75% range. New quarterly economic and rate projections also will be released at the end of that meeting.</p>\n<p>In December, the only central bank official with a rate outlook close to the steep cuts Trump wants was Fed Governor <person>Stephen Miran</person>, the former head of the <location>Trump White House's</location> <org>Council of Economic Advisers</org>. Miran saw the Fed's policy rate falling to as low as the 2.00%-2.25% range in 2026. The median expectation among Miran's colleagues, by contrast, saw just one quarter-percentage-point cut as likely appropriate.</p>\n<p>Nearly three months later, and after a strong January employment report, Miran on Thursday told the &quot;Mornings with Maria&quot; program on Fox Business that he still feels rates could fall a full percentage point this year through four 25-basis-point cuts, ideally sooner than later.</p>\n<p>His outlook is partly based on his expectation for a &quot;profoundly disinflationary&quot; artificial intelligence boost to productivity, a &quot;supply shock&quot; that Warsh has also said should allow for lower rates.</p>\n<p>&quot;I really do not think that we have an inflation problem,&quot; despite recent inflation readings a point above the central bank's 2% target, said Miran, whose term as a Fed governor has technically expired, but who can continue to fill the job until a replacement is named. Absent some other departure from the Fed's seven-member <org>Board of Governors</org>, Miran's seat would be needed for Warsh to eventually come aboard.</p>\n<p>WARSH FACES POSSIBLE DILEMMA</p>\n<p>The minutes of the Fed's <chron>January 27-28</chron> meeting showed little support yet for relying on AI-optimism to recast monetary policy. Staff presentations suggested a small boost in the economy's potential may be developing - the &quot;supply shock&quot; Miran has mentioned, but only in a measured dose - though with demand still strong enough to sustain pressure on prices.</p>\n<p>The minutes also cited unexpected comments that several policymakers were open to the possibility that the next rate move could be a hike. In addition, Fed Governor <person>Christopher Waller</person>, who joined Miran in dissenting in favor of a cut at the meeting in January, said this week that if recent strong job growth is repeated, &quot;it may be appropriate to hold the FOMC's policy rate at current levels.&quot;</p>\n<p>The U.S. employment report for February is due to be released on <chron>March 6</chron>.</p>\n<p>A combination of sticky inflation, a steady unemployment rate, and continued economic growth would in many ways be a comforting outcome for the Fed. Policymakers generally agree that inflation will decline and anticipate the combination of slow job growth and low rates of layoffs will yield a roughly steady unemployment rate. As long as that outlook continues, and absent any sense that public expectations about inflation are starting to shift higher, there would be little motivation to do anything other than wait.</p>\n<p>Such an outcome could present a dilemma for Warsh, who has laid out arguments for why rates should fall and now will have to contend with a strong-willed and publicly demonstrative president who has taken the Fed chief nominee at his word. Trump said earlier this month that he had not asked Warsh to lower rates, but felt it was clear what his nominee would do.</p>\n<p>Trump has clashed with Powell repeatedly over the president's demands for deep rate cuts, but said of Warsh last month: &quot;I don't want to ask him that question. I think it's inappropriate ... I want to keep it nice and pure. But he certainly wants to cut rates.&quot;</p>\n<p>The president also told <org>NBC News</org> he had &quot;not much&quot; doubt rates would fall. &quot;We're way high,&quot; he said. Trump, who has linked his call for lower rates to hopes of financing federal government debt more cheaply and lowering costs for home mortgages, has voiced little concern about inflation that he feels has disappeared.</p>\n<p>However, with the economy currently growing beyond estimates of its potential and inflation showing little recent progress toward the Fed's target, there's no sense of urgency at the central bank to cut rates, particularly not as steeply as Trump or Miran have suggested.</p>\n<p>Trump's State of the Union speech to <org>Congress</org> earlier this week highlighted that paradox, as he trumpeted the good things that he believes have happened and those that are still to come. Many analysts agree a combination of fiscal stimulus in the form of tax cuts, ongoing deregulation, and the loose credit conditions supported by Fed rate cuts last year could spell upside for the economy - and make further reductions in borrowing costs all the less likely.</p>\n<p></p>\n<p>(Reporting by Howard Schneider;Editing by <person>Dan Burns</person> and <person>Paul Simao</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/us-economy/202602261456RTRSNEWSCOMBINED_KBN3PG2H9-OUSBS_1",
            "pub_date": "2026-02-27 03:56:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Apollo Recognized as the Top AI-Native Sales Intelligence Platform in G2's 2026 Best Software Awards",
            "description": "\n<div class=\"xn-content\">\n<p class=\"prntac\"><i>G2 rankings underscore Apollo</i><i>'s position as the leading agentic end-to-end GTM platform powering revenue teams worldwide</i></p><p><span class=\"legendSpanClass\"><location value=\"LU/us.ca.sanfrn\" idsrc=\"xmltag.org\" >SAN FRANCISCO</location></span>, <span class=\"legendSpanClass\"><chron>Feb. 26, 2026</chron></span> /PRNewswire/ -- Apollo.io, a leading AI-native go-to-market platform, today announced it has been ranked across a number of G2's 2026 Best Software Awards. This includes prominent rankings in the following five categories:</p>\n    <div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder1\">\n                <p>\n\n                    <img src=\"https://mma.prnewswire.com/media/2876231/Apollo_Logo.jpg\" title=\"Apollo (PRNewsfoto/Apollo.io)\" alt=\"Apollo (PRNewsfoto/Apollo.io)\" />\n\n                </p>\n    </div>\n<ul type=\"disc\"><li>#13 for Best Sales Software (out of 446 companies)</li><li>#27 for Best Marketing and Digital Advertising (out of 921 companies)</li><li>#36 for Best Collaboration and Productivity (out of 503 companies)</li><li>#44 for Best AI Software Products (out of 241 companies)</li><li>#80 for Best Global Software (out of 3,938 companies)</li></ul><p>Notably, Apollo is the only sales intelligence platform named in this year's Best AI Software Products list, a testament to the company's leadership in redefining modern go-to-market.</p><p>\"As sales cycles accelerate, revenue teams can't afford to be constrained by fragmented tech stacks. Modern teams need a unified GTM operating system built for speed and precision,\" said <person>Matt Curl</person>, CEO of Apollo.io. \"Apollo's mission is to empower businesses of any size with the industry's first comprehensive AI-native platform. We're taking data into action and have become the 'operating system' for hundreds of thousands of revenue-generating teams worldwide. This recognition from G2 reflects the impact we're delivering to our customers, and reinforces the momentum we're building across the GTM ecosystem.\"</p><p>Backed by nearly 10,000 customer reviews, the most of any sales intelligence company, G2 recognizes Apollo for its ease of use and best-in-class features, enabling sales and revenue teams to execute and drive impact from one intelligent operating system. Apollo AI actively drives workflows across the sales funnel — from identifying accounts to drafting outreach to supporting deal management.</p><p>Additionally, G2's \"The State of AI Sales Intelligence in Prospecting: 2026 Industry Report\" recognized Apollo with its highest rating of 4.7/5. The report stated that Apollo is, \"Focused on AI-guided account discovery, predictive scoring, and workflow-native prospecting experiences that integrate intelligence directly into execution.\"</p><p>According to G2 Data, 60% of B2B software teams already use AI across their sales processes. At that level, AI sales intelligence tools aren't experimental; they're expected to influence how teams prioritize, sequence, and execute. Apollo is clearly positioned as a leader in this regard.</p><p>G2 is the world's largest and most trusted software marketplace, reaching over 100 million buyers annually. Its annual Best Software Awards rank the world's best software companies and products based on authentic, timely reviews from real users.</p><p>\"As buyers increasingly shift to AI-driven research to discover software solutions, being recommended in the 'answer moment' must be earned with credible proof,\" said Godard Abel, co-founder and CEO at G2. \"Our <org>Best Software</org> Awards are grounded in trusted data from authentic customer reviews. They not only give buyers an objective, reliable guide to the products that help teams do their best work, but they're also the proof AI search platforms rely on when sourcing answers. Congratulations to this year's winners, including Apollo. Earning a spot on these lists signals real customer impact.\"</p><p>This news comes on the heels of other recent announcements validating Apollo's leadership in AI-powered GTM. Apollo was recently named to The Agentic List 2026 as a high-momentum, uptrending organization driving revenue for sales and marketing teams with agentic AI. This week, Apollo also announced the launch of its native connector for Anthropic's Claude, with which users can run outbound workflows — including identifying leads and adding them to outreach sequences — directly within a Claude conversation.</p><p>For more information on Apollo's latest AI features and integrations, visit https://www.apollo.io/ai.</p><p><b>About G2</b><b>'s Best Software Awards<br /></b>G2's 2026 Best Software Awards feature dozens of award lists, ranking software vendors and products using G2's proprietary algorithm. The results are based on G2's verified user reviews and publicly available market presence data. To be eligible for the Best Software Awards, a software company or product must have received at least 10 approved reviews during the 2025 calendar year. Scores reflect only data from reviews submitted during this evaluation period.</p><p>To learn more, view G2's 2026 Best Software Awards and read more about G2's methodology.</p><p><b>About G2<br /></b>G2 is the world's largest and most trusted software marketplace. More than 100 million people annually — including employees at all Fortune 500 companies — use G2 to make smarter software decisions based on authentic peer reviews. Thousands of software and services companies of all sizes partner with G2 to build their reputation and grow their business — including Salesforce, HubSpot, Zoom, and Adobe. To learn more about where you go for software, visit www.g2.com and follow G2 on LinkedIn.</p><p><b>About Apollo</b><br />Apollo.io is the company behind the industry's first fully agentic GTM platform, transforming how revenue teams execute. Going beyond automation, Apollo's intelligent agents actively drive results across the entire sales funnel — from prospecting to deal management — all in one place. Trusted by millions of users, Apollo is making world-class go-to-market simple, intelligent, and accessible for all. Visit apollo.io to learn more.</p>\n\n\n\n<p id=\"PURL\"><img title=\"Cision\" width=\"12\" height=\"12\" alt=\"Cision\" src=\"https://edge.prnewswire.com/c/img/favicon.png?sn=NE96903&amp;sd=2026-02-26\" /> View original content to download multimedia:https://www.prnewswire.com/news-releases/apollo-recognized-as-the-top-ai-native-sales-intelligence-platform-in-g2s-2026-best-software-awards-302698910.html</p><p>SOURCE Apollo.io</p></div>\n",
            "link": "https://www.fidelity.com/news/article/technology/202602261450PR_NEWS_USPR_____NE96903",
            "pub_date": "2026-02-27 03:50:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Esri Press Most Popular Ebooks Available in the Esri Store",
            "description": "\n<p class=\"bwalignc\">\n<i>ArcGIS Users Can Now Purchase Esri Press Ebooks at a 20 Percent Discount</i>\n\n</p><ul class=\"bwlistdisc\">\n<li>\nEsri now offers best-selling <org>Esri Press</org> ebooks directly in the <org>Esri Store</org>, expanding digital access to authoritative GIS learning resources.\n\n</li>\n<li>\nCustomers include ArcGIS users; partnership with VitalSource delivers ebooks instantly to existing or newly created VitalSource Bookshelf accounts.\n\n</li>\n<li>\nEleven popular titles launch with a 20 percent discount, immediate access after purchase, and cross-device reading via VitalSource.\n\n</li>\n<li>\nArcGIS users can shop <org>Esri Press</org> ebooks in the <org>Esri Store</org>; VitalSource customers' purchased titles automatically appear in the VitalSource Bookshelf after checkout.\n\n</li>\n</ul>\n<p>    <location value=\"LU/us.ca.rednds\" idsrc=\"xmltag.org\" >REDLANDS, Calif.</location>--(BUSINESS WIRE)--\nEsri, the global leader in location intelligence is offering the top best-selling <org>Esri Press</org> ebooks directly in the <org>Esri Store</org> for the first time.<b> </b>Eleven of <org>Esri Press's</org> most popular and influential titles are now available at a 20 percent discount, including <i>The Power of Where</i>,<b> </b><i>GIS Tutorial for ArcGIS Pro 3.4</i>,<b> </b><i>Top 20 Essential Skills for ArcGIS Experience Builder</i>,<b> </b>and<b> </b><i>Getting to Know ArcGIS Enterprise</i>.\n\n</p><p>\nArcGIS users can seamlessly add <org>Esri Press</org> ebooks to the same shopping cart as their software licenses or other products. Once the transaction is complete, customers will receive immediate access to their ebooks.\n\n</p><p>\nThis new opportunity is made possible through an expanded relationship with VitalSource, the leading platform for digital course materials and study tools. Customers who already use VitalSource will find <org>Esri Press</org> titles automatically delivered to their existing Bookshelf accounts. New customers will have a VitalSource Bookshelf account created for them during the purchase process, enabling instant reading on any device.\n\n</p><p>\nAdditional titles are scheduled to be added throughout the year, expanding access to authoritative GIS learning resources for students, professionals, and organizations.\n\n</p><p>\n<b>About Esri</b>\n\n</p><p>\nEsri, the global market leader in geographic information system (GIS) software, location intelligence, and mapping, helps customers unlock the full potential of data to improve operational and business results. Founded in 1969 in <location value=\"LU/us.ca.rednds\" idsrc=\"xmltag.org\" >Redlands, California</location>, USA, Esri software is deployed in hundreds of thousands of organizations globally, including Fortune 500 companies, government agencies, nonprofit institutions, and universities. Esri has regional offices, international distributors, and partners providing local support in over 100 countries on six continents. With its pioneering commitment to geospatial technology and analytics, Esri engineers the most innovative solutions that leverage a geographic approach to solving some of the world's most complex problems by placing them in the crucial context of location. Visit us at esri.com.\n\n</p><p>\nCopyright © 2026 Esri. All rights reserved. Esri, the <org>Esri Globe</org> logo, The Science of Where, ArcGIS, esri.com, and @esri.com are trademarks, service marks, or registered marks of Esri in <location value=\"LC/us\" idsrc=\"xmltag.org\" >the United States</location>, the <org>European Union</org>, or certain other jurisdictions. Other companies and products or services mentioned herein may be trademarks, service marks, or registered marks of their respective mark owners.\n\n</p><p><img alt=\"\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20260226416345r1&amp;sid=acqr8&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\" /><span class=\"bwct31415\" /></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\">https://www.businesswire.com/news/home/20260226416345/en/</span></p>\n<p>Source: Esri</p>\n",
            "link": "https://www.fidelity.com/news/article/technology/202602261453BIZWIRE_USPR_____20260226_BW416345",
            "pub_date": "2026-02-27 03:53:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Update: WTI Crude Oil Falls as U.S.-Iran Talks Resume and a Report Showed a Outsized Rise in U.S. Inventories",
            "description": "\n<p><chron>02:39 PM EST</chron>, <chron>02/26/2026</chron> (MT Newswires) -- West Texas Intermediate (WTI) crude oil closed lower on Thursday as talks between <location value=\"LC/us\" idsrc=\"xmltag.org\" >the United States</location> and <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location> resume in <location value=\"LU/ch..geneva\" idsrc=\"xmltag.org\" >Geneva</location> while a report showed an outsized rise in U.S. oil inventories last week.</p><p>WTIcrude oil for April delivery closed down <money>US$0.21</money> to settle at <money>US$65.21</money> per barrel after trading as low as <money>US$63.60</money> during the session.  <person>April Brent</person> oil was last seen down <money>US$0.5</money> to <money>US$70.80</money>.</p><p>The resumption of indirect talks between <location value=\"LC/us\" idsrc=\"xmltag.org\" >the United States</location> and <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location> cut into the geopolitical risk premium that has come as traders assess the odds of President Trump will order the armada he has assembled to attack the OPEC+ member and <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location> responds by closing the <location>Strait of Hormuz</location>, the chokepoint for nearly a fifth of global oil exports from Persian Gulf states.</p><p>However a successful conclusion to the negotiations is not a given. <org>The Trump Administration</org> is said to be pressing for an end to <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran's</location> uranium enrichment program as it looks to end the possibility of the <org>Islamic Republic</org> developing nuclear weapons. For its part, <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location> has said it has no plans to build a nuclear bomb and claims the enrichment program is for civilian purposes and is unwilling to end enrichment, while maintaining its right to continue building missiles and supporting militia groups in Middle Eastern countries.</p><p>&quot;Iranian officials for their part have stated that they are exclusively pursuing a civilian nuclear program, and that forgoing domestic enrichment is a nonstarter. <location value=\"LU/ir..tehran\" idsrc=\"xmltag.org\" >Tehran</location> has indicated that it is willing to potentially halt high-level uranium enrichment, reduce its overall stockpile of enriched material, and only use older, slower centrifuges. Beyond enrichment, <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location> has also ruled out concessions on its missile programs and support for its regional armed proxies. Whether this will be sufficient for <location value=\"LU/us.dc.wash\" idsrc=\"xmltag.org\" >Washington</location> remains to be seen,&quot; <person>Helima Croft</person>, Head of <org>Global Commodity Strategy and MENA Research</org> at <org>RBC Capital Markets</org>, wrote.</p><p>Despite the risks to Persian Gulf exports, the market remains oversupplied as global production continues to run ahead of demand as producers in OPEC+ and the Americas boost output while demand growth slows, boosting global inventories. <org>The Energy Information Agency</org> on Wednesday reported U.S. commercial oil inventories rose by 16-million barrels last week, the largest weekly build in three years, according to Reuters.</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/us-markets/202602261439MIDNIGHTUSEQUITY_A3574026",
            "pub_date": "2026-02-27 03:39:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Nvidia expects gaming chips shortage to last until year-end",
            "description": "\n<p><chron>Feb 26</chron> (Reuters) - A global shortage of gaming chips\ncould last until the end of this year, an <org value=\"NVDA.NaE\" idsrc=\"xmltag.org\" >Nvidia</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NVDA' fmr-param-security-type='Equity'>( NVDA )</span>\nexecutive has said, signaling more pain for the video game\nindustry that is already buckling under weak sales due to\nslowing consumer demand.</p>\n<p><org value=\"NVDA.NaE\" idsrc=\"xmltag.org\" >Nvidia</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NVDA' fmr-param-security-type='Equity'>( NVDA )</span> expects the supply constraints to hurt its gaming\nbusiness in the current quarter and beyond even as the chip\ngiant sees strong demand, <org value=\"NVDA.NaE\" idsrc=\"xmltag.org\" >Nvidia</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NVDA' fmr-param-security-type='Equity'>( NVDA )</span> finance chief <person>Colette Kress</person>\nsaid on the company's quarterly earnings call on Wednesday.</p>\n<p>&quot;As much as we would love to have more supply, we do believe\nfor a couple quarters it is going to be very tight,&quot; Kress said.</p>\n<p>&quot;If things improve by the end of the year, there is an\nopportunity to think about what that is from a year-over-year\ngrowth. But it's still too early for us to know at this time.&quot;</p>\n<p>With the tech industry racing to build out artificial\nintelligence capacity, demand for memory chips has outstripped\nsupply, causing a spike in prices and prompting manufacturers to\nprioritize components for higher-margin data center chips.</p>\n<p>That has constrained supply for consumer electronics such as\nsmartphones and personal computers, as well as gaming consoles.\n<org value=\"NVDA.NaE\" idsrc=\"xmltag.org\" >Nvidia</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NVDA' fmr-param-security-type='Equity'>( NVDA )</span> chips are widely used in PC gaming as well as in the\nNintendo Switch console, while <org value=\"SONY.NaE\" idsrc=\"xmltag.org\" >Sony's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='SONY' fmr-param-security-type='Equity'>( SONY )</span> PlayStation and\nMicrosoft's Xbox consoles use AMD hardware.</p>\n<p>Forecasts for the console market have been bleak. According\nto projections from tech industry research firm TrendForce in\nDecember, the console market is expected to see a 4.4% decline\nthis year, compared with its earlier forecast of a 3.5% drop.\n(Reporting by <person>Deborah Sophia</person> in Bengaluru; Editing by <person>Maju\nSamuel</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602261438RTRSNEWSCOMBINED_L4N3ZM250_1",
            "pub_date": "2026-02-27 03:38:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Nvidia expects gaming chips shortage to last until year-end",
            "description": "\n<p><chron>Feb 26</chron> (Reuters) - A global shortage of gaming chips could last until the end of this year, an <org value=\"NVDA.NaE\" idsrc=\"xmltag.org\" >Nvidia</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NVDA' fmr-param-security-type='Equity'>( NVDA )</span> executive has said, signaling more pain for the video game industry that is already buckling under weak sales due to slowing consumer demand.</p>\n<p><org value=\"NVDA.NaE\" idsrc=\"xmltag.org\" >Nvidia</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NVDA' fmr-param-security-type='Equity'>( NVDA )</span> expects the supply constraints to hurt its gaming business in the current quarter and beyond even as the chip giant sees strong demand, <org value=\"NVDA.NaE\" idsrc=\"xmltag.org\" >Nvidia</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NVDA' fmr-param-security-type='Equity'>( NVDA )</span> finance chief <person>Colette Kress</person> said on the company's quarterly earnings call on Wednesday.</p>\n<p>&quot;As much as we would love to have more supply, we do believe for a couple quarters it is going to be very tight,&quot; Kress said. </p>\n<p>&quot;If things improve by the end of the year, there is an opportunity to think about what that is from a year-over-year growth. But it's still too early for us to know at this time.&quot;</p>\n<p>With the tech industry racing to build out artificial intelligence capacity, demand for memory chips has outstripped supply, causing a spike in prices and prompting manufacturers to prioritize components for higher-margin data center chips.</p>\n<p>That has constrained supply for consumer electronics such as smartphones and personal computers, as well as gaming consoles. <org value=\"NVDA.NaE\" idsrc=\"xmltag.org\" >Nvidia</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NVDA' fmr-param-security-type='Equity'>( NVDA )</span> chips are widely used in PC gaming as well as in the Nintendo Switch console, while <org value=\"SONY.NaE\" idsrc=\"xmltag.org\" >Sony's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='SONY' fmr-param-security-type='Equity'>( SONY )</span> PlayStation and Microsoft's Xbox consoles use AMD hardware.</p>\n<p>Forecasts for the console market have been bleak. According to projections from tech industry research firm TrendForce in December, the console market is expected to see a 4.4% decline this year, compared with its earlier forecast of a 3.5% drop.</p>\n<p></p>\n<p> (Reporting by <person>Deborah Sophia</person> in Bengaluru; Editing by <person>Maju Samuel</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602261440RTRSNEWSCOMBINED_KBN3PG2G8-OUSBS_1",
            "pub_date": "2026-02-27 03:40:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "AI Concerns Among Factors Driving Nvidia Post-Earnings Selloff, BofA Says",
            "description": "\n<p><chron>02:43 PM EST</chron>, <chron>02/26/2026</chron> (MT Newswires) -- <org value=\"NVDA.NaE\" idsrc=\"xmltag.org\" >Nvidia's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NVDA' fmr-param-security-type='Equity'>( NVDA )</span>  post-earnings stock selloff likely reflects factors including ongoing fears around artificial intelligence as markets monitor an expected tough set-up for cloud capital spending, <org>BofA Securities</org> said in a note emailed Thursday.</p><p>Shares of the technology bellwether declined 5% after midday Thursday, wiping out gains for this year.</p><p>Late Wednesday, the chipmaking giant reported fiscal fourth-quarter results above <location>Wall Street's</location> estimates as an AI boom continued to fuel computing demand. At the same time, it issued a stronger-than-expected revenue outlook for the ongoing quarter.</p><p>The post-earnings market reaction likely reflects continued concerns around AI disruptions and greater upside from networking than compute, BofA analyst <person>Vivek Arya</person> wrote. In addition, there were no updates on the <money>$500 billion</money> data center revenue opportunity the company shared last year.</p><p>Arya, however, views this as short-term noise, saying the stock presents a &quot;compelling valuation.&quot;</p><p>Cloud capital spending is expected to face a tough comparison in 2027, after growing more than 50% annually from 2024 to 2026, Arya said.</p><p>Morgan Stanley separately flagged cash flow pressure at hyperscalers, raising questions about spending sustainability.</p><p><org value=\"NVDA.NaE\" idsrc=\"xmltag.org\" >Nvidia</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NVDA' fmr-param-security-type='Equity'>( NVDA )</span> &quot;more than delivered&quot; on its fourth-quarter performance and is poised to accelerate growth amid demand visibility, Arya said. BofA lifted its price target on <org value=\"NVDA.NaE\" idsrc=\"xmltag.org\" >Nvidia</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NVDA' fmr-param-security-type='Equity'>( NVDA )</span> shares to <money>$300</money> from <money>$275</money>, while reiterating its buy recommendation.</p><p>The brokerage raised <org value=\"NVDA.NaE\" idsrc=\"xmltag.org\" >Nvidia's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NVDA' fmr-param-security-type='Equity'>( NVDA )</span> earnings-per-share and revenue estimates from fiscal 2027 to 2029.</p><p>With supply commitments surging to <money>$95 billion</money>, <org value=\"NVDA.NaE\" idsrc=\"xmltag.org\" >Nvidia</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NVDA' fmr-param-security-type='Equity'>( NVDA )</span> &quot;may well be the most dependable supplier that can serve the AI market that we believe could double towards <money>$1.4</money> (trillion) in the next few years,&quot; Arya said.</p><p>Price: 186.45, Change: -9.18, Percent Change: -4.69</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602261443MIDNIGHTUSEQUITY_A3573983",
            "pub_date": "2026-02-27 03:43:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Belfry Reports Strategic Partnership With Willis, Kayna",
            "description": "\n<p><chron>02:44 PM EST</chron>, <chron>02/26/2026</chron> (MT Newswires) -- Willis, a <org value=\"WTW.NaE\" idsrc=\"xmltag.org\" >Willis Towers Watson</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='WTW' fmr-param-security-type='Equity'>( WTW )</span>  business, has partnered with</p><p><org>Belfry Software</org> to launch a digital insurance program for Belfry customers, the latter said Thursday.</p><p>The program pairs Willis insurance expertise with Kayna insurance technology to deliver insurance solutions, Belfry said.</p><p>Under the agreement, an insurance portal will be included in the Belfry dashboard for clients to apply and receive a no-obligation insurance quote, the company said.</p><p>Willis will leverage Kayna's technology to pre-fill forms and support quoting and simplifying the procurement process, it said.</p><p>Price: 305.22, Change: +8.38, Percent Change: +2.82</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602261444MIDNIGHTUSEQUITY_A3574014",
            "pub_date": "2026-02-27 03:44:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US STOCKS-Wall St slides as tech rally stalls, AI enthusiasm wanes after Nvidia results",
            "description": "\n<p>(Updates to mid-afternoon trading)</p>\n<p>*</p>\n<p>Indexes down: Dow 0.05%, S&amp;P 500 0.73%, Nasdaq 1.45%</p>\n<p></p>\n<p>*</p>\n<p>Philadelphia SE Semiconductor index set to snap 10-week\nwinning\nstreak</p>\n<p></p>\n<p>*</p>\n<p><org value=\"TTD.NaE\" idsrc=\"xmltag.org\" >Trade Desk</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='TTD' fmr-param-security-type='Equity'>( TTD )</span> plunges after Q1 revenue forecast below\nestimates</p>\n<p></p>\n<p>*</p>\n<p><person>J.M. Smucker</person> jumps on Q3 beat, deal with Elliott</p>\n<p></p>\n<p>By <person>Stephen Culp</person> and <person>Ragini Mathur</person></p>\n<p><location value=\"LU/us.ny.nyc\" idsrc=\"xmltag.org\" >NEW YORK</location>, <chron>Feb 26</chron> (Reuters) - U.S. stock indexes turned\nsharply lower on Thursday, the day after a less-than-stellar\nearnings report from artificial intelligence vanguard <org value=\"NVDA.NaE\" idsrc=\"xmltag.org\" >Nvidia</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NVDA' fmr-param-security-type='Equity'>( NVDA )</span>\ndragged technology shares which have provided muscle to\nthe recent rally.\nA pivot back to cyclical sectors helped limit the Dow's losses,\nwhile a 3.6% drop in the Philadelphia SE Semiconductor index\nhelped drag the tech-laden Nasdaq down 1.5%.</p>\n<p>With Thursday's drop, the SOX, which has surged 15.3%\nyear-to-date, is on the verge of snapping what would have been a\nrecord 11-week winning streak.</p>\n<p>Technology shares in general, and software\nand chips in particular, have see-sawed in recent\nweeks as investors wrestle with uneasiness over the massive\ncosts and potential disruption of nascent AI technology.</p>\n<p>While all three major U.S. stock indexes are on track for\nmodest weekly losses, the S&amp;P 500 and the Nasdaq are poised to\nclose lower on the month. The Dow remains on track to post an\nadvance in February.</p>\n<p><org value=\"NVDA.NaE\" idsrc=\"xmltag.org\" >Nvidia's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NVDA' fmr-param-security-type='Equity'>( NVDA )</span> fourth-quarter results, posted after Wednesday's\nclosing bell, were better than analysts expected, and the\nchipmaker provided above-market estimates. But the world's\nrichest company by market cap wrestled with increasingly\ndifficult year-on-year comparisons as its revenue growth\ndecelerates. Its shares were down 4.9%.</p>\n<p>&quot;<org value=\"NVDA.NaE\" idsrc=\"xmltag.org\" >Nvidia's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NVDA' fmr-param-security-type='Equity'>( NVDA )</span> results, while they were good and showed\nsubstantial growth year-over-year, they did not hit the high end\nof some people's expectations,&quot; said <person>Joseph Sroka</person>, chief\ninvestment officer at NovaPoint in <location value=\"LU/us.ga.atlnta\" idsrc=\"xmltag.org\" >Atlanta</location>. &quot;Now the news is\nover and there's probably a little bit of profit taking and\nwe're seeing money now rotate back to the victims from earlier\nin the week, the software companies that were portrayed to be\nthe ultimate victims of AI.&quot;</p>\n<p>The Dow Jones Industrial Average fell 26.44 points,\nor 0.05%, to 49,449.13, the S&amp;P 500 lost 51.00 points, or\n0.73%, to 6,895.13 and the Nasdaq Composite lost 335.80\npoints, or 1.45%, to 22,816.28.\nAmong the 11 major sectors of the S&amp;P 500, tech and\ncommunication services suffered the steepest\npercentage losses, while financials led the gainers,\nrising 1.0% on the strength of big bank shares, including\n<org value=\"JPM.NaE\" idsrc=\"xmltag.org\" >JPMorgan Chase</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='JPM' fmr-param-security-type='Equity'>( JPM )</span>, <org value=\"BAC.NaE\" idsrc=\"xmltag.org\" >Bank of America</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='BAC' fmr-param-security-type='Equity'>( BAC )</span> and <org value=\"WFC.NaE\" idsrc=\"xmltag.org\" >Wells Fargo</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='WFC' fmr-param-security-type='Equity'>( WFC )</span>\n.\nThe S&amp;P 500 software and services index, battered in\nrecent weeks on worries over AI-related disruption, gained 0.9%,\nboosted by a 3.1% increase in <org value=\"CRM.NaE\" idsrc=\"xmltag.org\" >Salesforce</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='CRM' fmr-param-security-type='Equity'>( CRM )</span> shares, even\nthough the company provided weaker-than-expected revenue\nguidance.\n<org value=\"TTD.NaE\" idsrc=\"xmltag.org\" >Trade Desk</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='TTD' fmr-param-security-type='Equity'>( TTD )</span> slid 3.9% following its disappointing revenue\nforecast amid mounting pressure from larger rivals.\n<person>J.M. Smucker</person> surged 9.1% on the packaged food company's\nsolid quarterly profit and sales estimates.\n<org value=\"AI.NaE\" idsrc=\"xmltag.org\" >C3.ai</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AI' fmr-param-security-type='Equity'>( AI )</span> tumbled 19.3% after it provided a\nweaker-than-expected current quarter sales forecast and\nannounced it would slash 26% of its global workforce.\n<org>Celsius Holding</org> jumped 7.1% after the energy drink\nmaker beat quarterly revenue estimates.</p>\n<p>Advancing issues outnumbered decliners by a 1.04-to-1 ratio\non the <org>NYSE</org>. There were 310 new highs and 63 new lows on the\n<org>NYSE</org>.</p>\n<p>On the Nasdaq, 2,069 stocks rose and 2,574 fell as declining\nissues outnumbered advancers by a 1.24-to-1 ratio.</p>\n<p>The S&amp;P 500 posted 35 new 52-week highs and one new low\nwhile the Nasdaq Composite recorded 74 new highs and 80 new\nlows.</p>\n<p>(Reporting by <person>Stephen Culp</person>; Additional reporting by <person>Shashwat\nChauhan</person> and <person>Ragini Mathur</person> in Bengaluru; Editing by <person>David\nGregorio</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/us-markets/202602261425RTRSNEWSCOMBINED_L6N3ZM173_1",
            "pub_date": "2026-02-27 03:25:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        }
    ]
}