{
    "data": [
        {
            "title": "February Kansas City Fed Manufacturing Index Posts Larger-Than-Expected Rise",
            "description": "\n<p><chron>11:10 AM EST</chron>, <chron>02/26/2026</chron> (MT Newswires) -- The Kansas City Fed monthly manufacturing index rose to a reading of 5 in February from 0 in January, higher than expectations for an increase to 2 in a survey compiled by <org>Bloomberg</org>.</p><p>The increase follows expansion in readings for the other regional manufacturing data released so far. The ISM's national manufacturing reading will be released on <chron>March 2</chron>.</p><p>Within the <location value=\"LU/us.mo.kancty\" idsrc=\"xmltag.org\" >Kansas City</location> data, there were index gains for production, shipments, new orders, inventories, while readings for prices received for finished goods and the number of employees declined.</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/us-economy/202602261110MIDNIGHTUSEQUITY_A3573818",
            "pub_date": "2026-02-27 00:10:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Sector Update: Tech",
            "description": "\n<p><chron>01:06 PM EST</chron>, <chron>02/26/2026</chron> (MT Newswires) -- Tech stocks were lower Thursday afternoon, with the State Street Technology Select Sector SPDR ETF (XLK) falling 2.2% and the State Street SPDR S&amp;P Semiconductor ETF (XSD) dropping 2.7%.</p><p>The Philadelphia Semiconductor index shed 4.2%.</p><p>In corporate news, <org value=\"NVDA.NaE\" idsrc=\"xmltag.org\" >Nvidia</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NVDA' fmr-param-security-type='Equity'>( NVDA )</span>  shares were down 4.9% even after it reported a year-on-year jump in fiscal Q4 adjusted earnings and revenue late Wednesday and issued a fiscal Q1 revenue outlook above analysts' expectations.</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/us-markets/202602261306MIDNIGHTUSEQUITY_A3573956",
            "pub_date": "2026-02-27 02:06:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Bluevine Launches Suite of Tools to Modernize Small Business Invoicing and Payments",
            "description": "\n<div class=\"xn-content\">\n<p class=\"prntac\"><i>From creating estimates, to adding discounts to invoices, to ACH positive pay for its Premier customer, Bluevine's new features make it easier and more secure for businesses to get paid</i></p><p><span class=\"legendSpanClass\"><location value=\"LU/us.nj.jerity\" idsrc=\"xmltag.org\" >JERSEY CITY, N.J.</location></span>, <span class=\"legendSpanClass\"><chron>Feb. 26, 2026</chron></span> /PRNewswire/ -- <u>Bluevine</u>, the largest digital banking platform for small businesses in the U.S.*, <u>has announced the launch of a number of invoicing and payments features</u> to help modernize how small businesses get paid. Now, through their Bluevine account, users can do everything from creating estimates that they can then convert into invoices, to adding discounts to invoices, to instantly sending payments to other Bluevines users at no cost.</p>\n    <div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder1\">\n                <p>\n\n                    <img src=\"https://mma.prnewswire.com/media/2500940/Bluevine_Trademark_Blue_Logo.jpg\" title=\"Bluevine (PRNewsfoto/Bluevine)\" alt=\"Bluevine (PRNewsfoto/Bluevine)\" />\n\n                </p>\n    </div>\n<p>\"We know that cash flow issues remain among the biggest challenges for small business owners–our most recent end-of-year survey of small business owners showed that 23% of them have cash flow issues,\" said <person>Kyle Cooper</person>, Bluevine's SVP and GM of Checking and Payments. \"Since launching our invoicing product in <chron>June 2025</chron>, <u>we've seen that when invoices include built-in payment options</u> and real-time visibility, businesses get paid more than twice as fast on average. Giving users the ability to send estimates, track payment status, and apply discounts to their invoices from their Bluevine account helps reduce payment delays and improve cash flow.\"</p><p>Beyond the invoicing features, Bluevine also launched a number of additional updates including:</p><ul type=\"disc\"><li><b>Bluevine Pay: </b>Now, Bluevine users can instantly send and receive payments to other Bluevine users–or between their Bluevine accounts–at no cost.</li><li><b>ACH positive pay for Bluevine Premier customers: </b>Bluevine Premier customers can now review outgoing ACH payments to new payees before they're sent out to add an additional layer of security to users' accounts. Additionally, users can set custom rules and guidelines to streamline how, and when, they want to review payments.</li><li><b>Multiple business management through single sign-on: </b>Bluevine customers can manage multiple businesses through a single sign-on. Juggling multiple businesses is already challenging enough–having to constantly log out to go between accounts shouldn't add to those challenges.</li><li><b>Two-factor authentication via push notification: </b>Bluevine app users can now authenticate via the app or via SMS without waiting on a text.</li></ul><p>\"Modern small business owners expect all aspects of financial management to be seamless and intuitive,\" said Cooper. \"These updates are all in service of that: There's no reason that day-to-day financial management should be a pain for small business owners and we're proud to make it easier for them here at Bluevine.\"</p><p>For additional information on Bluevine's newest product updates, read here.</p><p>*<i>As compared to publicly available data on the number of lifetime customer accounts held by other U.S. banking platforms dedicated to small businesses that offer both checking and lending services, as of <chron>January 2026</chron>.</i></p><p><b>About Bluevine<br /></b><u>Bluevine</u> is the largest small business banking platform in the U.S.*, serving as the financial operating system for startups and small businesses. Through a single account, companies can earn more, save more, borrow, and manage their money whenever and wherever they do business - without ever stepping into a branch. Accessible through one dashboard, its product suite integrates high-yield business checking, accounts payable, debit and credit cards, loans, and lines of credit. Since 2013, Bluevine has served over 900,000 customers, delivered over <money>$17 billion</money> in loans, and is currently trusted with over <money>$1.8 billion</money> in managed customer deposits.</p><p>Bluevine is backed by leading private and institutional investors, including <org>Lightspeed Venture Partners</org>, <org>Menlo Ventures</org>, 83North, <org>Citi Ventures</org>, <org>ION Crossover Partners</org>, <org>SVB Capital</org>, <org>Nationwide Insurance</org>, and M12 (Microsoft's Venture Arm). Bluevine is a financial technology company, not a bank. Banking Services provided by <org>Coastal Community Bank</org>, Member FDIC. Lines of credit are issued by <org>Celtic Bank</org>. For more information, please visit <u>bluevine.com</u> or follow us on <u>LinkedIn</u>, <u>Instagram</u>, <u>Facebook</u>, and <u>Twitter</u>.</p>\n\n\n\n<p id=\"PURL\"><img title=\"Cision\" width=\"12\" height=\"12\" alt=\"Cision\" src=\"https://edge.prnewswire.com/c/img/favicon.png?sn=LA96769&amp;sd=2026-02-26\" /> View original content to download multimedia:https://www.prnewswire.com/news-releases/bluevine-launches-suite-of-tools-to-modernize-small-business-invoicing-and-payments-302698613.html</p><p>SOURCE Bluevine</p></div>\n",
            "link": "https://www.fidelity.com/news/article/technology/202602261302PR_NEWS_USPR_____LA96769",
            "pub_date": "2026-02-27 02:02:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Exclusive-Washington presses Syria to shift from Chinese telecom systems",
            "description": "<p><location value=\"LU/sy..damcus\" idsrc=\"xmltag.org\" >DAMASCUS</location>, <chron>Feb 26</chron> (Reuters) - <location value=\"LC/us\" idsrc=\"xmltag.org\" >The United States</location> has warned <location value=\"LC/sy\" idsrc=\"xmltag.org\" >Syria</location> against relying on Chinese technology in its telecommunications sector, arguing it conflicts with U.S. interests and threatens U.S. national security, according to three sources familiar with the matter.</p>\n<p>The message was conveyed during an unreported meeting between a <org>U.S. State Department</org> team and Syrian Communications Minister <person>Abdulsalam Haykal</person> in <location value=\"LU/us.ca.sanfrn\" idsrc=\"xmltag.org\" >San Francisco</location> on Tuesday.</p>\n<p><location value=\"LU/us.dc.wash\" idsrc=\"xmltag.org\" >Washington</location> has been coordinating closely with <location value=\"LU/sy..damcus\" idsrc=\"xmltag.org\" >Damascus</location> since 2024, when <location value=\"LC/sy\" idsrc=\"xmltag.org\" >Syria's</location> now President <person>Ahmed al-Sharaa</person> ousted longtime leader <person>Bashar al-Assad</person>, who had a strategic partnership with <location value=\"LC/cn\" idsrc=\"xmltag.org\" >China</location>.</p>\n<p><location value=\"LC/sy\" idsrc=\"xmltag.org\" >Syria</location> is exploring the possibility of procuring Chinese technology to support its telecommunications towers and the infrastructure of local internet service providers, according to a Syrian businessman involved in the procurement talks.</p>\n<p>&quot;The U.S. side asked for clarity on the ministry's plans regarding Chinese telecom equipment,&quot; said another source briefed on the talks.</p>\n<p>SYRIAN OFFICIALS CITE US EXPORT CONTROLS AS TELECOMS BARRIER</p>\n<p><location value=\"LC/sy\" idsrc=\"xmltag.org\" >Syria</location> is open to partnering with US firms but the matter was urgent and export controls and &quot;over-compliance&quot; remained an issue, according to person familiar with the meeting in <location value=\"LU/us.ca.sanfrn\" idsrc=\"xmltag.org\" >San Francisco</location>.</p>\n<p>A U.S. diplomat familiar with the discussions told Reuters that the <org>U.S. State Department</org> &quot;clearly urged Syrians to use American technology or technology from allied countries in the telecoms sector.&quot;</p>\n<p>It was unclear whether <location value=\"LC/us\" idsrc=\"xmltag.org\" >the United States</location> pledged financial or logistical support to <location value=\"LC/sy\" idsrc=\"xmltag.org\" >Syria</location> to do so.</p>\n<p>Responding to Reuters questions, a <org>U.S. State Department</org> spokesperson said: &quot;We urge countries to prioritize national security and privacy over lower-priced equipment and services in all critical infrastructure procurement. If it seems too good to be true, it probably is.&quot;</p>\n<p>The spokesperson added that Chinese intelligence and security services &quot;can legally compel Chinese citizens and companies to share sensitive data or grant unauthorized access to their customers' systems&quot; and promises by Chinese companies to protect customers' privacy were &quot;entirely inconsistent with <location value=\"LC/cn\" idsrc=\"xmltag.org\" >China's</location> own laws and well-established practices.&quot;</p>\n<p><location value=\"LC/cn\" idsrc=\"xmltag.org\" >China</location> has repeatedly rejected allegations of it using technology for spying purposes.</p>\n<p><org>The Syrian Ministry</org> of telecommunications told Reuters any decisions related to equipment and infrastructure are made &quot;in accordance with national technical and security standards, ensuring data protection and service continuity.&quot;</p>\n<p>The ministry said it is also prioritizing the diversification of partnerships and technology sources to serve the national interest.</p>\n<p><location value=\"LC/sy\" idsrc=\"xmltag.org\" >Syria's</location> telecom infrastructure has relied heavily on Chinese technology due to U.S. sanctions imposed on successive Assad governments over the civil war that grew from a crackdown on anti-government protests in 2011.</p>\n<p>Huawei technology accounts for more than 50% of the infrastructure of Syriatel and MTN, the country's only telecom operators, according to a senior source at one of the companies and documents reviewed by Reuters. Huawei did not immediately respond to a request for comment.</p>\n<p><location value=\"LC/sy\" idsrc=\"xmltag.org\" >Syria</location> is seeking to develop its private telecommunications sector, devastated by 14 years of war, by attracting foreign investment. </p>\n<p>In early February, <location value=\"LC/sa\" idsrc=\"xmltag.org\" >Saudi Arabia's</location> largest telecom operator, STC, announced it would invest <money>$800 million</money> to &quot;strengthen telecommunications infrastructure and connect <location value=\"LC/sy\" idsrc=\"xmltag.org\" >Syria</location> regionally and internationally through a fibre-optic network extending over 4,500 kilometres.&quot;</p>\n<p>The ministry of telecommunications says that U.S. restrictions &quot;hinder the availability of many American technologies and services in the Syrian market&quot;, emphasizing that it welcomes expanding cooperation with U.S. companies when these restrictions are lifted.</p>\n<p><location value=\"LC/sy\" idsrc=\"xmltag.org\" >Syria</location> has inadequate telecommunications infrastructure, with network coverage weak outside city centres and connection speeds in many areas barely exceeding a few kilobits per second.</p>\n<p></p>\n<p> (Additional reporting by <person>Timour Azhari</person>; Writing by Feras Dalatey; Editing by <person>Philippa Fletcher</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/technology/202602261311RTRSNEWSCOMBINED_KBN3PG2A0-OUSTP_1",
            "pub_date": "2026-02-27 02:11:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Research Alert: CFRA Keeps Buy Opinion On Shares Of Canadian Imperial Bank Of Commerce",
            "description": "\n<p><chron>01:05 PM EST</chron>, <chron>02/26/2026</chron> (MT Newswires) -- CFRA, an independent research provider, has provided MT Newswires with the following research alert. Analysts at CFRA have summarized their opinion as follows:</p><p>We raise our 12-month target price by <money>USD20</money> to <money>USD135</money>, 17.3x our FY 27 (Oct.) EPS view of <money>CAD10.70</money> (<money>USD7.82</money>), a premium to the bank's five-year forward P/E average of 9.9x to reflect CM's strong capital position, decreased office exposure in the U.S., as well as momentum in wealth management and capital markets. Our multiple is above the peer average of 12.8x. We raise our FY 26 EPS to <money>CAD10.06</money> from <money>CAD9.52</money> and increase FY 27's to <money>CAD10.70</money> from <money>CAD10.27</money>. As AI shifts from an opportunity to a threat for many U.S. companies in 2026, we believe Canadian banks face lower disruption risk.  <location value=\"LC/ca\" idsrc=\"xmltag.org\" >Canada</location> typically adopts new technology more slowly, and its oligopolistic banking market has high barriers to entry through hefty capital requirements and regulation. While AI will still transform Canadian banking operations, the risk remains limited.  We're particularly positive on CM as it actively adopts AI to enhance customer service, streamline operations, and strengthen risk management.</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/investing-ideas/202602261305MIDNIGHTUSEQUITY_A3573958",
            "pub_date": "2026-02-27 02:05:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Research Alert: CFRA Keeps Buy Opinion On Shares Of Canadian Imperial Bank Of Commerce",
            "description": "\n<p><chron>01:05 PM EST</chron>, <chron>02/26/2026</chron> (MT Newswires) -- CFRA, an independent research provider, has provided MT Newswires with the following research alert. Analysts at CFRA have summarized their opinion as follows:</p><p>We raise our 12-month target price by <money>CAD25</money> to <money>CAD185</money>, 17.3x our FY 27 (Oct.) EPS view of <money>CAD10.70</money>, a premium to the bank's five-year forward P/E average of 9.9x to reflect CM's strong capital position, decreased office exposure in the U.S., as well as momentum in wealth management and capital markets. Our multiple is above the peer average of 12.8x. We raise our FY 26 EPS to <money>CAD10.06</money> from <money>CAD9.52</money> and increase FY 27's to <money>CAD10.70</money> from <money>CAD10.27</money>. As AI shifts from an opportunity to a threat for many U.S. companies in 2026, we believe Canadian banks face lower disruption risk.  <location value=\"LC/ca\" idsrc=\"xmltag.org\" >Canada</location> typically adopts new technology more slowly, and its oligopolistic banking market has high barriers to entry through hefty capital requirements and regulation. While AI will still transform Canadian banking operations, the risk remains limited.  We're particularly positive on CM as it actively adopts AI to enhance customer service, streamline operations, and strengthen risk management.</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/investing-ideas/202602261305MIDNIGHTUSEQUITY_A3573959",
            "pub_date": "2026-02-27 02:05:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "EBay Stock Is Trending Today: What's Going On?",
            "description": "\n<p><strong><org value=\"EBAY.NaE\" idsrc=\"xmltag.org\" >EBay Inc</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='EBAY' fmr-param-security-type='Equity'>( EBAY )</span></strong> shares are trading higher on Thursday even as the company announced it will cut about 800 jobs, roughly 6% of its full‑time workforce, as part of an effort to realign staffing with its strategic priorities. Here&#8217;s what you may want to know.</p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><org value=\"EBAY.NaE\" idsrc=\"xmltag.org\" >EBay</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='EBAY' fmr-param-security-type='Equity'>( EBAY )</span> shares are powering higher. Why is <org value=\"EBAY.NaE\" idsrc=\"xmltag.org\" >EBAY</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='EBAY' fmr-param-security-type='Equity'>( EBAY )</span> stock up today?</li>\n</ul>\n\n\n\n<h2 class=\"wp-block-heading\">Reason Behind The Job Cuts</h2>\n\n\n\n<p><org value=\"EBAY.NaE\" idsrc=\"xmltag.org\" >EBay</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='EBAY' fmr-param-security-type='Equity'>( EBAY )</span> said the job cuts are intended to streamline operations and shift resources toward areas that support long‑term growth, <org>Bloomberg</org> reported. The company said it plans to reinvest across the business and reshape teams so they're better aligned with its long‑term strategy.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Third Round Of Layoffs In Recent Years</h2>\n\n\n\n<p>This marks <org value=\"EBAY.NaE\" idsrc=\"xmltag.org\" >eBay's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='EBAY' fmr-param-security-type='Equity'>( EBAY )</span> third round of workforce reductions in three years. In early 2024, the company cut about 1,000 jobs — around 9% of its staff — after labor costs outpaced growth. A year earlier, in early 2023, <org value=\"EBAY.NaE\" idsrc=\"xmltag.org\" >eBay</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='EBAY' fmr-param-security-type='Equity'>( EBAY )</span> eliminated about 500 roles, or roughly 4% of its workforce, as consumer spending cooled following the pandemic‑era surge in online shopping.</p>\n\n\n\n<p>The restructuring news comes just a week after <org value=\"EBAY.NaE\" idsrc=\"xmltag.org\" >eBay</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='EBAY' fmr-param-security-type='Equity'>( EBAY )</span> reported a strong fourth quarter and announced plans to acquire <strong>Depop</strong>, a secondhand fashion marketplace popular with younger shoppers, for about <money>$1.2 billion</money>.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Technical Indicators Show Bullish Momentum</h2>\n\n\n\n<p><org value=\"EBAY.NaE\" idsrc=\"xmltag.org\" >EBay</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='EBAY' fmr-param-security-type='Equity'>( EBAY )</span> is currently positioned above its key moving averages, which suggests a bullish sentiment in the market. The stock is trading 1.7% above its 20-day SMA, 0.1% above its 50-day SMA and 0.8% above its 100-day SMA, indicating a potential for continued upward momentum.</p>\n\n\n\n<p>With an RSI of 47.29, <org value=\"EBAY.NaE\" idsrc=\"xmltag.org\" >eBay</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='EBAY' fmr-param-security-type='Equity'>( EBAY )</span> is in neutral territory, meaning it isn&#8217;t currently overbought or oversold, suggesting that there could be room for further price movement in either direction. MACD is above its signal line, indicating bullish momentum for <org value=\"EBAY.NaE\" idsrc=\"xmltag.org\" >eBay</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='EBAY' fmr-param-security-type='Equity'>( EBAY )</span>. Traders might see continued strength in the stock, especially if it can maintain this position.</p>\n\n\n\n<p>Key support sits at <money>$81.00</money>, while resistance is at <money>$97.50</money>. If eBay&#8217;s stock tests the support level and holds, it could signal a potential reversal or continuation of the current trend, while a breach of resistance may lead to a new upward phase.</p>\n\n\n\n<p><org value=\"EBAY.NaE\" idsrc=\"xmltag.org\" >eBay</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='EBAY' fmr-param-security-type='Equity'>( EBAY )</span> has shown a long-term bullish trend, with the 50-day SMA above the 200-day SMA, indicating strength in the overall trend. This relationship suggests that traders should remain optimistic about the stock&#8217;s longer-term prospects.</p>\n\n\n\n<p>Over the past 12 months, eBay&#8217;s stock has gained 27.55%, reflecting a strong recovery and positive market sentiment. This performance indicates that the stock has been able to capitalize on favorable conditions, setting a solid foundation for future growth.</p>\n\n\n\n<p><strong>EBAY Price Action:</strong> <org value=\"EBAY.NaE\" idsrc=\"xmltag.org\" >EBay</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='EBAY' fmr-param-security-type='Equity'>( EBAY )</span> shares were up 3.38% at <money>$88.21</money> at the time of publication on Thursday, according to Benzinga Pro.</p>\n\n\n\n<p><em>Image: JHVEPhoto/Shutterstock</em></p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602261313BENZINGAFULLNGTH50901647",
            "pub_date": "2026-02-27 02:13:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Hormel Mixed Q1: Retail Weakness Weigh On Strong Foodservice, International Sales",
            "description": "\n<p><strong><org value=\"HRL.NaE\" idsrc=\"xmltag.org\" >Hormel Foods Corp</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='HRL' fmr-param-security-type='Equity'>( HRL )</span></strong> stock fell on Thursday after the company reported mixed first-quarter FY26 results.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Earnings Snapshot</strong></h2>\n\n\n\n<p>The company reported&#160;adjusted earnings per share of <money>34 cents</money>, beating&#160;the analyst consensus estimate of <money>32 cents</money>.</p>\n\n\n\n<p>However, sales of&#160;<money>$3.03 billion</money>&#160;missed the Street view of&#160;<money>$3.07 billion</money>.</p>\n\n\n\n<p>The company reported operating income of $244 million and adjusted operating income of $247 million, resulting in an operating margin of 8% and an adjusted operating margin of 8.2%.</p>\n\n\n\n<p>Cash flow from operations totaled&#160;<money>$349&#160;million</money> in the quarter.</p>\n\n\n\n<p>Inventories at quarter-end were&#160;<money>$1.6 billion</money>, and cash on hand stood at <money>$868 million</money>.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Segment Performance</strong></h2>\n\n\n\n<p>Retail volume declined 6% and net sales fell 2% in the quarter, both of which continued to be impacted by strategic exit from select non-core private label snack nut items and weaknesses in branded and private label packaged deli items.</p>\n\n\n\n<p>Foodservice volume remained flat&#160;while net sales rose&#160;7%&#160;led by strong performance across&#160;the customized solutions business, premium prepared proteins, and branded pepperoni.</p>\n\n\n\n<p>International volume increased 1%&#160;and net sales upped 8% on strong performance in the multinational businesses and branded exports, thanks to&#160;SPAM&#160;luncheon meat.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Whole-Bird Turkey Unit Sale</strong></h2>\n\n\n\n<p>This month, the company announced the decision to sell its whole-bird turkey business to <strong>Life-Science Innovations</strong>, in line with Hormel's focus on expanding value-added protein offerings.</p>\n\n\n\n<p>The sale is expected to close by the end of the company&#8217;s second quarter of FY26.</p>\n\n\n\n<p>&#8220;These strategic transactions enable us to focus resources on high-growth opportunities that meet evolving consumer needs while reducing our exposure to volatile commodity markets,&#8221; said President <person>John Ghingo</person>. &#8220;The Jennie-O branded portfolio remains a strategic and important part of our growth strategy, and this move positions us to accelerate growth in value-added turkey categories where we have a clear consumer advantage.&#8221;</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Outlook</strong></h2>\n\n\n\n<p>The firm reaffirmed its FY26 adjusted earnings of&#160;<money>$1.43</money>&#160;to&#160;<money>$1.51</money>&#160;per share, versus the&#160;<money>$1.47</money> that analysts projected.</p>\n\n\n\n<p>The company forecasts sales of&#160;<money>$12.2 billion</money>&#160;to&#160;<money>$12.5 billion</money>, compared with the&#160;<money>$12.384 billion</money>&#160;analyst estimate.</p>\n\n\n\n<p>During the conference call, <org value=\"HRL.NaE\" idsrc=\"xmltag.org\" >Hormel Foods</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='HRL' fmr-param-security-type='Equity'>( HRL )</span> stated that it expects adjusted EPS in the second quarter to remain flat or slightly increase compared with 2025, signaling steady performance amid ongoing market conditions.</p>\n\n\n\n<p><strong>HRL</strong> <strong>Price Action:</strong> Hormel Foods shares are down 0.43% at <money>$25.24</money> at publication on Thursday.</p>\n\n\n\n<p><em>Photo: Viewimage via Shutterstock</em></p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602261315BENZINGAFULLNGTH50901749",
            "pub_date": "2026-02-27 02:15:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Baidu Q4 2025 Earnings Call Transcript",
            "description": "\n<p><strong><org value=\"BIDU.NaE\" idsrc=\"xmltag.org\" >Baidu, Inc.</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='BIDU' fmr-param-security-type='Equity'>( BIDU )</span> </strong>reported fourth-quarter financial results before the market open on Thursday. The transcript from the company&#8217;s earnings call has been provided below.</p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><org value=\"BIDU.NaE\" idsrc=\"xmltag.org\" >Baidu</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='BIDU' fmr-param-security-type='Equity'>( BIDU )</span> shares are retreating from recent levels. What&#8217;s weighing on BIDU shares?</li>\n</ul>\n\n\n\n<p><em>This transcript is brought to you by Benzinga APIs. For real-time access to our entire catalog, please visit https://www.benzinga.com/apis/ for a consultation.</em></p>\n\n\n\n<p><strong><person>Juan Lin</person></strong> (Director of Investor Relations)</p>\n\n\n\n<p>Hello and thank you for standing by for Baidu&#8217;s fourth quarter and fiscal year 2025 earnings conference call. At this time, all participants are in a listen only mode. After management&#8217;s prepared remarks, there will be a question and answer session. Today&#8217;s conference is being recorded. If you have any objections, you may disconnect at this time. I would now like to turn the meeting over to your host for today&#8217;s conference, <person>Juan Lin</person>, Baidu&#8217;s Director of Investor Relations. Hello everyone and welcome to Baidu&#8217;s fourth quarter and fiscal year 2025 earnings conference call. Baidu&#8217;s earnings release was distributed earlier today and you can find a copy on our website as well as on newswire services. On the call today we have <person>Robin Lee</person>, our co Founder and CEO <person>Julius Luong Luo</person>, our EVP in charge of <org>Baidu Mobile Ecosystem Group</org> mega, our EVP in charge of Baidu AI Cloud Group ACG and Henry Haifeng, our cfo. After our prepared remarks, we will hold a Q and A session. Please note that the discussion today will contain forward looking statements made under the safe harbor provisions of the U.S. Private Securities Litigation Reform act of 1995. Forward looking statements are subject to risks and uncertainties that may cause actual results to differ materially from our current expectations. For detailed discussions of these risks and uncertainties, please refer to our latest Annual report and other filings with <org>SEC</org> and <org>Hong Kong Stock Exchange</org>. <org value=\"BIDU.NaE\" idsrc=\"xmltag.org\" >Baidu</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='BIDU' fmr-param-security-type='Equity'>( BIDU )</span> does not undertake any obligation to update any forward looking statements except as required under applicable law. Our earnings press release and this call includes discussions of certain unaudited non GAAP financial measures. Our press release contains a reconciliation of the unaudited non GAAP measures to the audited most directly comparable GAAP measures and is available on our IR website at ir.baidu.com As a reminder, this conference is being recorded. In addition, a webcast of this conference call will be available on Baidu&#8217;s IR website. I will now turn the call over to our CEO Robin.</p>\n\n\n\n<p><strong><person>Robin Li</person> </strong>(Co-Founder and CEO)</p>\n\n\n\n<p>Hello everyone. In Q4 <org value=\"BIDU.NaE\" idsrc=\"xmltag.org\" >Baidu</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='BIDU' fmr-param-security-type='Equity'>( BIDU )</span> General business total revenue was <money>RMB 26.1 billion</money>. Revenue from our core AI power business exceeded <money>RMB 11 billion</money>, accounting for 43% of <org value=\"BIDU.NaE\" idsrc=\"xmltag.org\" >Baidu</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='BIDU' fmr-param-security-type='Equity'>( BIDU )</span> General Business revenue in AI Cloud infrastructure subscription based revenue from AI accelerator infrastructurestructure grew 143% year over year, accelerating further from 128% in Q3. Meanwhile, Apollo Go maintained its robust momentum, delivering 3.4 million fully driverless operational rides in the quarter Total rides increased by over 200% year over year 2025 marked the third year of our journey in Genai and a pivotal year where AI became the new core of our portfolio. In 2025, we made substantial progress in scaling AI across our businesses, accelerating AI cloud growth, expanding robotaxi operations with improved unit economics and deepening AI integration into our mobile ecosystem. Looking at our portfolio through an AI native lens, momentum across our core AI powered businesses and continue to build in 2025 AI Cloud Infra gained strong traction through its highly efficient and cost effective training and inference capabilities. Revenue from AI Cloud Infra reached approximately <money>RMB 20 billion</money> in 2025, up 34% year over year, outpacing industry growth. Our AI application portfolio is among the most comprehensive in the industry, combining AI empowered flagship products with AI native offerings that unlock entirely new use cases. For the full year 2025, revenue from AI applications exceeded <money>RMB10 billion</money>. Apollo Go achieved a significant landmark. We delivered over 10 million fully driverless operational rides in 2025 alone. To date, Apollo Go has provided a total of over 20 million rides to the public. Cumulatively, with our accelerated global expansion, Apollo GO&#8217;s footprint has now reached 26 cities worldwide, reinforcing our leadership in autonomous ride hailing services. Lastly, our AI native marketing services including digital humans and agents sustained strong growth with revenue up 110% year over year. Collectively, these results demonstrate AI&#8217;s growing contribution to Baidu&#8217;s value creation and our ability to translate AI capabilities into scalable commercial impact. Now let me share the key highlights of the quarter starting with our proprietary AI chips. This quarter we announced the proposed spin off and separate the listing of kunlunxing. After more than a decade of steadfast investment in self developed AI chips, we are proud to see the market increasingly recognize their value and proven performance. This milestone validates our long term strategic vision and unlocks new opportunities for value creation. Our AI chips are built on a proprietary architecture developed in house from day one. They deliver stable high performance AI computing at scale with broad compatibility across different models and frameworks. This enables customers to deploy faster with lower integration costs. What distinguishes our AI chips is a proven track record of large scale real world deployments with leading enterpridess across diverse industries spanning financial services, telecommunications, energy and Internet sectors. Customers choose our chips for reliable performance, stable supply at scale, exceptional software compatibility and strong efficiency, especially in inference workloads. Looking ahead, we see significant opportunities for both <org value=\"BIDU.NaE\" idsrc=\"xmltag.org\" >Baidu</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='BIDU' fmr-param-security-type='Equity'>( BIDU )</span> and Kunlunxing as AI infrastructurestructure demand continues to accelerate. Next I will turn to our AI cloud infrastructurestructure. Our infrastructurestructure is among the most advanced in <location value=\"LC/cn\" idsrc=\"xmltag.org\" >China</location>, powered by a diverse mix of domestic and international high performance computing resources. In Q4, subscription based revenue from AI accelerator infrastructurestructure grew 143% year over year, achieving triple digit growth for the full year.</p>\n\n\n\n<p>Automate operational compliance and safety checks through intelligent visual analysis. While known brands across coffee chains, quick service restaurants and fine dining are now using ETN to ensure high standard operations across their thousands of locations. Another example is FM Agent, our self-evolving agent designed to solve complex operational challenges by autonomously reasoning across data, rules and real-world constraints. It simulates countless scenarios to identify best solutions. We&#8217;ve seen strong validation both internally through our own cloud resource optimization and externally across industries like manufacturing, energy, finance and logistics, where efficiency improvement is a universal priority. On the organizational front, we recently established the <org>Personal Super Intelligence Business Group</org> or psig. Personal Super Intelligence Group Unified Baidu, <person>Wen Gu</person> and <location>Baidu Drive</location> are two flagship consumer-facing AI applications. Even before this organizational integration, the two teams had already collaborated at the product level to deliver innovations like Free Canvas and gemflow. This new group enables even deeper collaboration going forward as we accelerate the rollout of new applications to foster a robust growth curve driven by application layer innovation. Shifting to Physical AI Apollo Go represents our largest AI application in the physical world. 2025 was a year of accelerated scaling for Apollo Go, where we reinforced our leadership in operational scale and achieved significant progress in global expansion. We continue to expand fully driverless operations at pace delivering 3.4 million fully driverless operational rides in Q4 with weekly rides peaking at over 300,000. Total rides grew by over 200% year over year. Cumulative rides provided to the public have surpassed 20 million as of <chron>February 2026</chron>, firmly cementing our position as the world&#8217;s leading autonomous ride-hailing service provider. We entered 2026 with momentum across key international markets. In the UK, we advanced our partnerships with Uber and Lyft, moving forward with plans to pilot autonomous vehicles in <location value=\"LU/gb.eng.london\" idsrc=\"xmltag.org\" >London</location> with testing expected to begin in the first half of 2026. This represents an important step in Apollo GO&#8217;s international expansion, extending our right-hand drive robo taxi capabilities from <location value=\"LU/cn..hongkg\" idsrc=\"xmltag.org\" >Hong Kong</location> to another strategically important market In <location value=\"LC/ch\" idsrc=\"xmltag.org\" >Switzerland</location>. We initiated testing in St. Gallen. Following our market entry last quarter in the <location value=\"LR/mde\" idsrc=\"xmltag.org\" >Middle East</location>, we achieved progress in both <location value=\"LU/ae..abudha\" idsrc=\"xmltag.org\" >Abu Dhabi</location> and <location value=\"LU/ae..dubai\" idsrc=\"xmltag.org\" >Dubai</location>. In <location value=\"LU/ae..abudha\" idsrc=\"xmltag.org\" >Abu Dhabi</location>, we launched a fully autonomous ride-hailing services on <location>Yas Island</location>. In January with Autogo in <location value=\"LU/ae..dubai\" idsrc=\"xmltag.org\" >Dubai</location>, we secured the city&#8217;s first fully driverless testing permit from the Roads and Transport Authority. We also announced the next phase of our global partnership with Uber to bring our fully autonomous ride-hailing services to <location value=\"LU/ae..dubai\" idsrc=\"xmltag.org\" >Dubai</location> via the Uber platform. These are critical milestones that accelerate our progress across the Emirates. In <location value=\"LR/asp\" idsrc=\"xmltag.org\" >Asia</location>, we entered a new market, <location value=\"LC/kr\" idsrc=\"xmltag.org\" >South Korea</location>, starting with the <location value=\"LU/kr..seoul\" idsrc=\"xmltag.org\" >Seoul</location> metropolitan area, further expanding our presence across the Asian region. Meanwhile in <location value=\"LU/cn..hongkg\" idsrc=\"xmltag.org\" >Hong Kong</location>, we expanded our open road testing into Sunwen and initiated cross-district testing between Airport island and Tung Chung, bringing us closer to commercial readiness there. As of <chron>February 2026</chron>, Apollo GO&#8217;s global footprint reached 26 cities, demonstrating the scalability of our autonomous driving technology across diverse regulatory and operational environments. Looking ahead, we are focused on accelerating expansion to more cities globally while continuously improving operational excellence and unit economics. Our growing experience across diverse markets gives us confidence in our ability to scale further, and we expect more cities to achieve positive unit economics over time. Underpinning this expansion, safety remains our top priority and the foundation of everything we do. Our autonomous ride-hailing service is the safest globally with our fully driverless vehicles experience an airbag deployment accident only once every over 12 million kilometers. As we scale, we will continue strengthening safety standards and ensure sustained reliability. Ultimately, our mission is to harness AI to transform mobility, making it fundamentally safer, more affordable and more comfortable, and improving how billions of people move, work and live. In summary, with AI now firmly integrated across our portfolio, we believe we are well positioned to deliver sustainable value and shape the next phase of the AI era. With that, let me turn the call over to Henry to go through the financial results.</p>\n\n\n\n<p><strong><person>Henry He</person> (Chief Financial Officer)</strong></p>\n\n\n\n<p>Thank you Robin and hello everyone. We are making progress on our key focus areas. Over the recent quarters, we&#8217;ve enhanced disclosure for greater transparency and driven operational efficiency improvements. This quarter we took a significant step to unlock value from our strategic AI chip investment through the proposed Kunlunxin spin-off and a separate listing, a milestone we are particularly pleased with. We&#8217;ve also announced a new <money>US$5 billion</money> share repurchase program and adopted a dividend policy for the first time. Additionally, we&#8217;ve sharpened our strategic focus on high potential AI applications by forming a <org>PSIG Business Group</org> integrating <org value=\"BIDU.NaE\" idsrc=\"xmltag.org\" >Baidu</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='BIDU' fmr-param-security-type='Equity'>( BIDU )</span>, WenKu and <location>Baidu Drive</location>. These actions reflect our consistent execution and ongoing focus on creating shareholder value. Looking at Q4 results, we saw positive momentum. <org value=\"BIDU.NaE\" idsrc=\"xmltag.org\" >Baidu</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='BIDU' fmr-param-security-type='Equity'>( BIDU )</span> General Business Total revenue increased 6% quarter over quarter, with non-GAAP operating profit expanding 28% sequentially to <money>RMB 2.8 billion</money>. Operating cash flow for <org value=\"BIDU.NaE\" idsrc=\"xmltag.org\" >Baidu</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='BIDU' fmr-param-security-type='Equity'>( BIDU )</span> turned positive in Q3 and remained positive in Q4, generating a combined <money>RMB 3.9 billion</money> across both quarters. In terms of our core AI powered business in Q4 revenue exceeded <money>RMB 11 billion</money>, accounting for 43% of <org value=\"BIDU.NaE\" idsrc=\"xmltag.org\" >Baidu</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='BIDU' fmr-param-security-type='Equity'>( BIDU )</span> General Business revenue. We are seeing strong momentum across several areas. AI Cloud Infra continues to gain market traction and outpace industry average. Our AI application portfolio is expanding rapidly with strong enterprise adoption. Combining AI Cloud Infra and AI application, our cloud revenue reached <money>RMB 30 billion</money> for the full year 2025 meanwhile, Apollo Go reinforces its position as a global leader in autonomous ride hailing with one of the industry&#8217;s largest footprints and the strongest growth momentum and AI native marketing services is growing fast. These results demonstrate our progress and we believe this is just the beginning. We have a robust pipeline of initiatives ahead and we are confident in our ability to create lasting shareholder value. Now let me walk through the details of our fourth quarter and full year 2025 financial results. Total revenues in Q4 were <money>RMB 32.7 billion</money>, increasing 5% quarter over quarter primarily due to an increase in Baidu Core AI powered business. Total revenues for the full year 2025 were <money>RMB 129.1 billion</money>, decreasing 3% year over year primarily due to a decrease in legacy business partially offset by an increase in Baidu Core AI powered business. Cost of revenues was <money>RMB 18.3 billion</money> in Q4 which remained flat quarter over quarter. Cost of revenues was <money>RMB 72.4 billion</money> in 2025, increasing 10% year over year primarily due to an increase in costs related to Baidu Core AI powered business. Operating expenses were <money>RMB 13.0 billion</money> in Q4, increasing 10% quarter over quarter primarily due to an increased expected credit losses and a one time employee severance cost to improve efficiency. Operating expenses will RMB <money>$46.3 billion</money> in 2025, increasing 1% year over year. Impairment of long lived assets was <money>RMB 16.2 billion</money> in 2025 attributable to an impairment loss of core asset group. Operating income was <money>RMB 1.5 billion</money> in Q4 and operating margin was 5%. Operating loss was <money>RMB 5.8 billion</money> in 2025 and operating loss margin was 5% excluding impairment of long lived assets. Operating income was <money>RMB 10.4 billion</money> in 2025. Non GAAP operating income was <money>RMB 3.0 billion</money> in Q4 and non GAAP operating margin was 9%. Non GAAP operating income was <money>RMB 15.0 billion</money> in 2025 and non GAAP operating margin was 12% in Q4. Total. Other income net was <money>RMB 1.2 billion</money> compared to <money>RMB 1.9 billion</money> last quarter. Income tax expense was <money>RMB 1.0 billion</money> compared to income tax benefit of <money>RMB 1.8 billion</money> last quarter in 2025. Total other income net was <money>RMB 12.5 billion</money> compared to <money>RMB 7.4 billion</money> in the same period last year. Income Tax expense was <money>RMB 1.3 billion</money> compared to <money>RMB 4.4 billion</money> in the same period last year In Q4, net income attributable to <org value=\"BIDU.NaE\" idsrc=\"xmltag.org\" >Baidu</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='BIDU' fmr-param-security-type='Equity'>( BIDU )</span> was <money>RMB 1.8 billion</money>. Net margin for <org value=\"BIDU.NaE\" idsrc=\"xmltag.org\" >Baidu</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='BIDU' fmr-param-security-type='Equity'>( BIDU )</span> was 5% and diluted earnings per ADS was <money>RMB 3.71</money>. Non GAAP net income attributable to Baidu Was <money>RMB 3.9 billion</money>, non GAAP net margin for <org value=\"BIDU.NaE\" idsrc=\"xmltag.org\" >Baidu</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='BIDU' fmr-param-security-type='Equity'>( BIDU )</span> was 12% and non GAAP diluted earnings per ADS was <money>RMB 10.62</money>. In 2025, net income attributable to <org value=\"BIDU.NaE\" idsrc=\"xmltag.org\" >BaidU</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='BIDU' fmr-param-security-type='Equity'>( BIDU )</span> was <money>RMB 5.6 billion</money>. Net margin for <org value=\"BIDU.NaE\" idsrc=\"xmltag.org\" >BaidU</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='BIDU' fmr-param-security-type='Equity'>( BIDU )</span> was 4% and diluted earnings per ADS was <money>RMB 11.78</money>. Excluding the impact of impairment of long lived assets, net income attributable to <org value=\"BIDU.NaE\" idsrc=\"xmltag.org\" >Baidu</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='BIDU' fmr-param-security-type='Equity'>( BIDU )</span> was <money>RMB 19.4 billion</money>. Non GAAP net income attributable to <org value=\"BIDU.NaE\" idsrc=\"xmltag.org\" >Baidu</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='BIDU' fmr-param-security-type='Equity'>( BIDU )</span> was IMB 18.9 billion. Non GAAP net margin for <org value=\"BIDU.NaE\" idsrc=\"xmltag.org\" >Baidu</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='BIDU' fmr-param-security-type='Equity'>( BIDU )</span> was 15% and non GAAP diluted earnings per ADS was <money>RMB 53.41</money>. We defined total cash and investments as cash equivalents, restricted cash short term investments, net long term time deposits and held to maturity investments and adjusted long term investments. As of <chron>December 31, 2025</chron>, total cash and investments were <money>RMB 294.1 billion</money>. In Q4, operating cash flow was <money>RMB 2.6 billion</money>. In 2025, operating cash flow was negative <money>RMB 3.0 billion</money>, which remained positive for the past two consecutive quarters. Kaidu General Business had approximately 29,000 employees as of <chron>December 31, 2025</chron>. With that operator, let&#8217;s now open the call to questions.</p>\n\n\n\n<p><strong>Operator</strong></p>\n\n\n\n<p>Thank you ladies and gentlemen. We will now begin the question and answer session. If you wish to ask a question, please press the star key then one on your telephone and wait for your name to be announced. If you wish to cancel your request, please press star 2. Your first question comes from <person>Alicia Yap</person> with Citigroup. Please ask your question.</p>\n\n\n\n<p><strong>Citigroup Analyst</strong></p>\n\n\n\n<p> Thank you. Good evening Robin, Henry and Jen. Thanks for taking my questions. I have questions related to the model. So we have noticed very active model iteration reasons. How does management view the current competitive landscape? And then <org value=\"BIDU.NaE\" idsrc=\"xmltag.org\" >Baidu</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='BIDU' fmr-param-security-type='Equity'>( BIDU )</span> recently also released updated earning 5.0 and also make some organizational adjustments. So could management discuss the strategic rationale behind these moves and also how the company thinks about the relationship between the model evolutions and also the application in your overall AI strategy. Thank you.</p>\n\n\n\n<p><strong><person>Robin Li</person> (Co-Founder and CEO)</strong></p>\n\n\n\n<p>Hi Alissa, this is Robin. We did see very active model releases recently. The market is highly competitive and moving fast, but amid all the competition we&#8217;ve always believed that applications matter more than models because models ultimately create value through applications. That is why we always take an application driven approach with earning. Model improvements are guided by the most valuable and promising use cases and this has been consistent across every iteration of earning. As I just mentioned recently we released the updated version of Ernie 5.0. At the same time, we&#8217;ve been proactively making organizational changes to stay agile in this fast moving market. We restructured our model team into different focus areas. One team continues pushing frontier capabilities at the foundation model level to maintain technical leadership early has clear strengths in several key areas such as creative writing, omni model understanding and instruction following. We are confident we will keep improving erle&#8217;s performance across key application scenarios. Meanwhile, this high value application scenarios continuously provide ERNIE wi</p>\n\n\n\n<p><strong>Operator</strong></p>\n\n\n\n<p>Your next question comes from <person>Alex Yao</person> with JP Morgan. Please ask your question.<br/></p>\n\n\n\n<p><strong>JP Morgan Analyst</strong></p>\n\n\n\n<p>Good evening management team and thank you for taking my question. I have one question about the Baidu AI Cloud. We noticed the Baidu AI Cloud revenue delivered a strong growth for the full year 2025. Can you elaborate and help us understand the key growth driver behind the robust revenue growth number and how shall we think about the AI Cloud revenue growth outlook in 2026? Thank you,<br/></p>\n\n\n\n<p><strong><person>Robin Li</person> (Co-Founder and CEO)</strong></p>\n\n\n\n<p>thank you Alex this is Dove for 2025. Our AI Cloud revenue which includes revenue from AI Cloud Infra and AI applications reached <money>RMB 30 billion</money> in 2025. Revenue from AI cloud infrastructure grew 34% year over year, outpacing the broader market within AI Cloud Infra. Subscription based revenue from AI accelerator infrastructurestructure grew 143% year over year in Q4 and has become the primary growth driver demonstrating strong momentum. We remain highly confident in sustaining strong growth momentum in 2026. Underpinning our growth is the accelerating enterprise AI adoption. We&#8217;re seeing demand growth in both training and inference workloads and we expect the demand of AI computing to keep expanding, creating significant opportunities ahead. Baidu&#8217;s full stack end to end AI architecture is a key differentiator in capturing such opportunity. At the foundation of this architecture is our industry leading AI infrastructurestructurestructure which achieves an excellent balance across performance, efficiency and cost. Our AI infrastructurestructurem is powered by a diverse mix of chips. We have built deep expertise in heterogeneous computing and unified scheduling which enables us to efficiently manage computing resources from different chip vendors and achieve industry leading performance and efficiency. In the meanwhile, our proprietary chip capabilities provide a significant competitive advantage. As Robin just mentioned, our self developed Kunlunxin AI chips deliver strong performance, compatibility and cost efficiency. They have been deployed at scale with leading enterprise customers across financial services, telecom, energy and Internet sectors and the market feedback has been very positive. Kunlunkin serves as a key component of our own cloud platform&#8217;s computing power, playing an important role in our overall AI infrastructure. As AI demand grows, the advantages of our AI infrastructure will become increasingly evident. Beyond AI infrastructure we just discussed, we are continuously evolving our best in class agent Infra to help enterprises rapidly build and deploy AI agents at scale. We keep bringing in the latest, most cutting edge capabilities. For example, we recently launched simplified open Cloud deployment on Baidu AI Cloud which streamlines the process so that even users with no coding experience can quickly deploy their own open cloud agents. Then, looking into 2026 as Enterprise AI deployments deepen further, we are confident that our cloud business will continue to grow faster than the industry. We expect AI Cloud and Infra to maintain strong momentum with AI accelerator infrastructure continuing to serve as a core driver propelling our overall cloud business toward a more sustainable and high quality growth model. Thank you.</p>\n\n\n\n<p><strong>Operator</strong></p>\n\n\n\n<p>Your next question comes from <person>Lincoln Kong</person> with GS. Please ask your question.</p>\n\n\n\n<p><strong>Goldman Sachs Analyst</strong></p>\n\n\n\n<p>Thank you Management for taking my question.</p>\n\n\n\n<p>So actually this quarter we see this AI power business continue to deliver pretty solid growth. How does management view the current stage development for those AI power businesses? So when should we expect this share to exceed, say 50% of the <org value=\"BIDU.NaE\" idsrc=\"xmltag.org\" >Baidu</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='BIDU' fmr-param-security-type='Equity'>( BIDU )</span> General business? And what will be the key driver going forward for the AI powered business? Thank you. </p>\n\n\n\n<p><strong><person>Robin Li</person> (Co-Founder and CEO)</strong></p>\n\n\n\n<p>Okay, let me start by sharing how we think about our core AI powered business. This includes AI cloud infrastructurestructure, AI applications like Baidu WenKu and <location>Baidu Drive</location>, and our robotaxibusiness, Apollo and our AI native marketing services including agents and digital humans. AI Powered Bins organizes our business according to the nature of Our products and services where AI is empowering each to create meaningful customer value and business impact. In Q4, AI powered business revenue exceeded <money>RMB 11 billion</money>. That&#8217;s like 43% of <org value=\"BIDU.NaE\" idsrc=\"xmltag.org\" >Baidu</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='BIDU' fmr-param-security-type='Equity'>( BIDU )</span> General business revenue. This percentage has been rapidly increasing over the recent quarters. And AI powered business is becoming the core driver of our overall revenue growth. Each of our AI powered businesses has clear strategic positioning and competitive advantage. First, it&#8217;s AI infrastructure AI cloud infrastructure. We see enterprises scale AI from pilots to production and our full stack end to end AI capabilities enable strong performance at competitive cost. AI</p>\n\n\n\n<p>cloud infrastructure revenue grow faster than the industry average in 2025 with subscription based AI accelerator infrastructurestructure revenue accelerating sharply in Q4. And second, it&#8217;s AI applications. We&#8217;ve always believed AI&#8217;s ultimate value will settle at the application layer. And we built one of China&#8217;s most comprehensive AI application portfolios. As AI capabilities continue to evolve and new use cases emerge, we see significant expansion potential in this business. And then third is the Robotaxibin Apollo Go. Apollo Go is scaling rapidly while expanding internationally. We lead globally in operating scale, safety record efficiency and cost structure. And the fourth is AI native marketing services. Like agents and digital humans. They improve engagement and conversion. And we&#8217;re seeing strong market adoption with great potential ahead. So, looking to the mid to long term, as enterprise AI deployment deepens, monetization capabilities of AI applications improve and physical AI applications such as autonomous driving continue to expand. And we&#8217;re confident in the growth trajectory of our AI powered business. These AI powered business aren&#8217;t isolated. They continuously reinforce each other through our full stack capabilities. And based on current visibility, we believe our core AI part business will become the majority of <org value=\"BIDU.NaE\" idsrc=\"xmltag.org\" >Baidu</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='BIDU' fmr-param-security-type='Equity'>( BIDU )</span> general business in the foreseeable future.</p>\n\n\n\n<p><strong>Operator</strong></p>\n\n\n\n<p>Your next question comes from <person>Wei Xiong</person>. Please ask your question. </p>\n\n\n\n<p><strong>USB Analyst</strong></p>\n\n\n\n<p>Sure. Good evening, Management. Thank you for taking my questions. Could Management elaborate on the framework that you use to allocate capital, including shareholder returns, organic investment and potential strategic strategic opportunities? And also could management comment on the long term strategic positioning of kunlunxin within the <org>Baidu Group</org>? Thank you.</p>\n\n\n\n<p><strong><person>Henry He</person> (Chief Financial Officer)</strong></p>\n\n\n\n<p>Thank you. <person>Xiong Wei</person>, this is Henry. I believe many of you may have noticed our recent series of initiatives. These include enhancing our disclosures, improving operational efficiency, optimizing our organizational structure, advancing the proposed kunlunxin spin off and a separate listing, and also announcing our new share repurchase program and the first dividend policy. And recently, we&#8217;re also reforming the psig, the <org>Personal Superintelligence Group Business Group</org> integrating Baidu Wenku and <location>Baidu Drive</location> altogether. These moves reflect a coherent execution framework demonstrating our improved management execution and ongoing commitment to creating shareholder value. I think take our new share repurchase program as one example. We are very focused on providing clear and sustainable returns to shareholders. So in the recent in February the board has approved a new 5 billion</p>\n\n\n\n<p>US dollar share repurchase program which we plan to execute on a regular basis in a very disciplined and transparent manner. We are also introducing <org value=\"BIDU.NaE\" idsrc=\"xmltag.org\" >Baidu</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='BIDU' fmr-param-security-type='Equity'>( BIDU )</span> first Dividend policy. We believe the introduction of the policy alongside with a sizable buyback program will further strengthen our shareholder return profile and attract a broader range of investors, thereby further diversifying our investor base. As you mentioned, the proposed spin off and a separate list of Kunlanxing is another good example. We are making very good progress of the listing process. Kunlencheng is a result of over decades of investment and represents a critical infrastructure component of our full stack AI capabilities. We believe this spin off and a separate listing will receive strong market recognition and unlock significant value for <org>Baidu Asset Group</org>. So looking ahead, we firmly believe the company has tremendous value and we will continue unlocking it through various initiatives. We remain committed to deliver sustainable and consistent returns to our shareholders. So more initiatives will follow in due course. So stay tuned with us. Thank you. </p>\n\n\n\n<p><strong>Operator </strong></p>\n\n\n\n<p>Your next question comes from <person>Gary Yu</person> with Morgan Stanley. Please ask your question.</p>\n\n\n\n<p><strong>Morgan Stanley (Equity Analyst)</strong></p>\n\n\n\n<p>Hi. Thank you Management. My question is on Robo Taxi. And first of all, congratulations on the Robotaxi expansion into more countries, especially to my hometown <location value=\"LU/cn..hongkg\" idsrc=\"xmltag.org\" >Hong Kong</location>. Can you share your overseas strategy in 2026 and what are your key competitive advantages there? And also with Waymo&#8217;s, recently valued at 126 billion, how is management thinking about unlocking Apollo Gold&#8217;s value? Would you consider a spin off? Thank you. </p>\n\n\n\n<p><strong><person>Robin Li</person> (Co-Founder and CEO)</strong></p>\n\n\n\n<p>Hi Gary, As I mentioned last quarter, I believe Robotaxi has reached a tipping point globally. Through continuous delivery of safe autonomous rides and positive word miles, we&#8217;re seeing more countries and regions creating supportive environments for Robotaxi operations. We believe the industry will accelerate in 2026. Apollo is clear global leader in this space. We&#8217;ve completed over 20 million cumulative rides. At peak period. Our weekly fully driverless rides exceeded 300,000. To date, <person>Apollo Gold</person> fleets have accumulated more than 300 million autonomous kilometers, including over 190 million fully driverless Atoms kilometers with an outstanding safety record. And we continue advancing our industry leading technology to make rides safer and more comfortable. We&#8217;re also accelerating international expansion to capture global opportunities. Today, our Global footprint spans 26 cities across different continents, covering both Left hand and right hand drive robotaxi markets. Our autonomous driving system works reliably anywhere across different traffic patterns and different urban environments. Notably, very few players have entered right hand drive robotaxi markets. While we&#8217;ve already established a presence and are making rapid progress. Moreover, we have a fundamental cost advantage. our fleet is the world&#8217;s first purpose built production vehicle designed from the ground up for Level 4 autonomous driving. At under <money>US$30,000</money> per vehicle, our fleet offers</p>\n\n\n\n<p><strong>Operator</strong></p>\n\n\n\n<p>Your next question comes from Miranda Zuang with <org>Bank of America Securities</org>. Please ask your question. </p>\n\n\n\n<p><strong><org>Bank of America Securities Equity Analyst</org></strong></p>\n\n\n\n<p>Thank you management for taking my question. Wish you a happy year of health. So my question is about competition. We have seen that the consumer facing AI competition is intensifying recently, especially during the <chron>Chinese New Year</chron>. How do you assess the current competitive dynamics? Where do you see Baidu&#8217;s AI to see products such as the earning assistance differentiation and also positioning in this market? And lastly, how to think about the path to monetization. Thank you.</p>\n\n\n\n<p><strong><person>Julius Luo</person> (Executive Vice Preisdent)</strong></p>\n\n\n\n<p>This is Julius. The AI2C product market is highly competitive. We have seen some competitors adopt very aggressive market strategies to rapidly scale their user base in the past <chron>Chinese New Year</chron>. However, as technology and products evolve rapidly, we still believe our core strategy should remain grounded in actual user needs. We are highly committed to continuously enhancing our existing products and services capabilities through AI innovations to better serve our users in our flagship consumer facing products, the Baidu App. Today we have build the Earning Assistant to strengthen our service capabilities across the entire user journey from information seeking to providing solutions and completing tasks. On information seeking, we have significantly enhanced how users assess information through Earning Assistant. For example, we have improved the answer accuracy and relevance through racial and Earning Assistant maintains low error rates with minimal hallucinations, delivering the highly trustworthy content to users. We have also integrated the multilingual AI Search API capabilities that can enable users to assess the broader information sources during conversations, improving the information richness and usability, especially for scenarios like traveling planning which is quite helpful. And in December Earning assistance MAU surpassed 200 million and with conversation rounds and engagements growing quite fast for task complexion, we are integrating the multi-channel platform agents to connect users with tools and real world services. This quarter alone we added nearly 100 service capabilities, especially in healthcare, travel, education and E commerce. For example, through the <org>Baidu Health</org> multi-channel platform integrated into earnings system, users can assess a range of healthcare capabilities spanning online to offline services. In E commerce, our multi-channel platform module saw a very strong GMV growth quarter over quarter. Meanwhile, we are taking a different approach with the standalone app positioning as a platform for innovations and experimentations. Our earlier multimodal AI features have gained good traction with the younger audiences and more recently we have added AI capabilities focus on the workplace productivity tapping into earning books ability to handle complex tasks in professional settings, we are seeing the promising early signals in these productivity scenarios. We take a measured approach to monetize the AI tools products, prioritizing the product excellence and the user experiences. Monetization will follow naturally as the products mature. Thank you for your question.</p>\n\n\n\n<p><strong>Macquarie Analyst</strong></p>\n\n\n\n<p> Good evening. My question is mostly focusing on the AI investment. How do you think about the AI related CAPEX over the next 12 to 24 months? How should we think about the return profile of these AI investments and expected impact on the ROIC over time? Broadly speaking, where do you see further efficiency opportunities to support margin cash flow improvements in the future? Thank you, Thank you.</p>\n\n\n\n<p><strong><person>Henry He</person> (Chief Financial Officer)</strong></p>\n\n\n\n<p>This is Henry first of all on capex and AI investment. Since we have launched earnings In March of 2023 we have invested over <money>100 billion RMB</money> in AI. Going forward, we will continue to maintain this level of the investment density. Second, we are very conscious about returns and understand investors focus on the return on capital invested. That&#8217;s why we have work to improve our financial performance and we have delivered a good result on key metrics over the past few quarters. For example, in Q4 gross profit for <org value=\"BIDU.NaE\" idsrc=\"xmltag.org\" >Baidu</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='BIDU' fmr-param-security-type='Equity'>( BIDU )</span> grew double digits sequentially and the non GAAP operating income for <org value=\"BIDU.NaE\" idsrc=\"xmltag.org\" >Baidu</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='BIDU' fmr-param-security-type='Equity'>( BIDU )</span> increased about 35% quarter over quarter. We also performed better on the margin profile both on margin and EBIT margin sequence. Importantly, operating cash flow for <org value=\"BIDU.NaE\" idsrc=\"xmltag.org\" >Baidu</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='BIDU' fmr-param-security-type='Equity'>( BIDU )</span> turned positive in Q3 and remained positive in Q4 with the second half operating cash flow reaching nearly <money>4 billion RMB</money>. Free cash flow for <org value=\"BIDU.NaE\" idsrc=\"xmltag.org\" >Baidu</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='BIDU' fmr-param-security-type='Equity'>( BIDU )</span> also turned positive in Q4. Thirdly, we have also found and explored alternative ways of supporting our financial needs including for example operational and financing leasing as well as we have access to the low cost interest backing borrowing. For example, some of these bank borrowings and the leasing facilities carry the interest rates as low as below 2%. So these approaches help us maintain a healthy long term financing structure while sustaining our AI investment and support our business growth. So in summary, we will continue to maintain our AI investment density while balancing investor focus on profitability and return timelines. We believe that even with significant AI investment, operating cash flow remain positive going forward as well. Thank you.</p>\n\n\n\n<p><strong>Operator</strong></p>\n\n\n\n<p>Thank you ladies and gentlemen. That does conclude our conference for today. Thank you for participating. You may all disconnect.</p>\n\n\n\n<p><em>This transcript is to be used for informational purposes only. Though Benzinga believes the content to be substantially and directionally correct, Benzinga cannot and does not guarantee 100% accuracy of the content herein. Audio quality, accents and technical issues could impact the exactness and we advise you to refer to source audio files before making any decisions based upon the above.</em></p>\n\n\n\n<p><em>Image: Shutterstock.com</em></p>\n",
            "link": "https://www.fidelity.com/news/article/technology/202602261248BENZINGAFULLNGTH50900493",
            "pub_date": "2026-02-27 01:48:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Lohman Technologies Appoints Two Industry Leaders to Drive AI-Enabled Remote Cardiac Innovation",
            "description": "\n<div class=\"xn-content\">\n<p>Board expansion accelerates commercialization pipeline of explainable AI and scalable RPM partnerships.</p><p><span class=\"legendSpanClass\"><location value=\"LU/us.wi.milkee\" idsrc=\"xmltag.org\" >MILWAUKEE</location></span>, <span class=\"legendSpanClass\"><chron>Feb. 26, 2026</chron></span> /PRNewswire/ -- Lohman Technologies announced today that Dr. <person>Daniel DeBehnke</person> and <person>Peter E. Aftosmes</person> have joined its Board of Directors as the company accelerates commercialization of its AI-enabled remote cardiac monitoring platform.</p>\n    <div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder1\">\n                <p>\n\n                    <img src=\"https://mma.prnewswire.com/media/2921469/Lohman_Technologies_Logo.jpg\" title=\"Lohman Technologies\" alt=\"Lohman Technologies\" />\n\n                </p>\n    </div>\n<p>Lohman's proprietary platform offers <org>FDA</org>-cleared clinical-grade ECG technology, explainable AI analytics and cloud-based care coordination to support continuity of cardiac care. AfibAlert — the predicate to HomECG+ — was the first <org>FDA</org>-cleared handheld atrial fibrillation detection device, establishing the company's early leadership in portable cardiac diagnostics and health equity.</p><p>\"AI is clinically usable today,\" said <person>Jason Dvorak</person>, President of Lohman Technologies. \"We are delivering actionable cardiac insights in near real-time. Dr. DeBehnke and Peter bring the enterprise and payer perspective necessary to expand our goal of accessible healthcare for everyone on a national level.</p><p><person>Craig Schiefelbein</person>, Chairman, added, \"Scaling responsibly requires seasoned leadership. As we prioritize RPM partners and enterprise health systems, their experience ensures we maintain operational discipline while driving innovation.\"</p><p><b>Dr. <person>Daniel DeBehnke</person> said:</b><br />\"The clinical validity of Lohman's technology stands out. The integration of AI-driven prioritization and EHR connectivity supports smarter triage and faster intervention. That improves patient outcomes and strengthens provider economics.\"</p><p><b><person>Peter E. Aftosmes</person> added:</b><br />\"Healthcare is shifting toward proactive, longitudinal care management. Lohman's recurring revenue model — device, software, and service — creates predictable value for stakeholders while improving care coordination.\"</p><p><b>About Lohman Technologies<br /></b>Lohman's patented solution, HomECG+, offers a direct connection between the patient and their healthcare providers, eliminating the need for a smartphone or WIFI technology. This not only enhances efficiency but also expands access to cardiac monitoring services.</p><p>For more information, visit www.homecg.com.</p>\n\n\n\n<p id=\"PURL\"><img title=\"Cision\" width=\"12\" height=\"12\" alt=\"Cision\" src=\"https://edge.prnewswire.com/c/img/favicon.png?sn=CG96916&amp;sd=2026-02-26\" /> View original content to download multimedia:https://www.prnewswire.com/news-releases/lohman-technologies-appoints-two-industry-leaders-to-drive-ai-enabled-remote-cardiac-innovation-302698742.html</p><p>SOURCE Lohman Technologies</p></div>\n",
            "link": "https://www.fidelity.com/news/article/technology/202602261254PR_NEWS_USPR_____CG96916",
            "pub_date": "2026-02-27 01:54:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Eli Lilly's New Oral Weight Loss Drug Outperforms Semaglutide, Eyes Potential US Approval In Q2",
            "description": "\n<p><strong><org value=\"LLY.NaE\" idsrc=\"xmltag.org\" >Eli Lilly and Co.</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='LLY' fmr-param-security-type='Equity'>( LLY )</span> </strong>shares are down on Thursday. The company announced promising results for its oral GLP-1 medication, orforglipron.</p>\n\n\n\n<p>On Thursday, the Zepbound maker shared detailed results from ACHIEVE-3, the first head-to-head Phase 3 trial evaluating orforglipron, an oral GLP-1, compared with <strong>Novo Nordisk A/S&#8217;</strong> oral semaglutide in adults with type 2 diabetes inadequately controlled with metformin. The 52-week trial enrolled 1,698 participants.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Lilly&#8217;s Oral Drug Outperforms Novo Nordisk&#8217;s Drug</h2>\n\n\n\n<p>In ACHIEVE-3, orforglipron outperformed oral semaglutide across the primary and all key secondary endpoints, delivering significantly greater improvements in A1C (blood sugar) and weight.</p>\n\n\n\n<p>In the latest news, <org value=\"LLY.NaE\" idsrc=\"xmltag.org\" >Eli Lilly</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='LLY' fmr-param-security-type='Equity'>( LLY )</span> reported that orforglipron 36 mg significantly outperformed oral semaglutide 14 mg in a Phase 3 trial, achieving a 2.2% reduction in A1C compared to 1.4% for the latter. Additionally, participants taking orforglipron lost an average of 19.7 lbs (9.2%), which is 73.6% greater weight loss than those on semaglutide.</p>\n\n\n\n<p>The company has submitted orforglipron for regulatory approval in over 40 countries, with a potential U.S. decision for obesity treatment expected in the second quarter of 2026.</p>\n\n\n\n<p>On Monday, <org value=\"NVO.NaE\" idsrc=\"xmltag.org\" >Novo Nordisk</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NVO' fmr-param-security-type='Equity'>( NVO )</span> released headline data from its REDEFINE 4, an open-label phase 3 trial from the global REDEFINE clinical trial program.</p>\n\n\n\n<p>The trial did not achieve its primary endpoint of demonstrating non-inferiority on weight loss for CagriSema compared to Eli Lilly&#8217;s tirzepatide after 84 weeks.</p>\n\n\n\n<p>The broader market experienced declines on Thursday, with the S&amp;P 500 down 1.08% and the Nasdaq slipping 1.80%. Eli Lilly&#8217;s drop comes along with broader market weakness, suggesting that the positive news surrounding orforglipron may be driving investor interest independently of market trends.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Technical Analysis</h2>\n\n\n\n<p>Currently, the stock is trading 5.2% below its 20-day simple moving average (SMA) and 8.4% below its 100-day SMA, indicating some short-term weakness. Over the past 12 months, shares have increased approximately 65%, and they are currently positioned closer to their 52-week highs than lows.</p>\n\n\n\n<p>The RSI is at 50.00, which is considered neutral territory, indicating no strong momentum in either direction. Meanwhile, MACD is at 0.10, below its signal line at 0.15, suggesting bearish pressure on the stock.</p>\n\n\n\n<p>The combination of neutral RSI and bearish MACD suggests mixed momentum.</p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Key Resistance</strong>: <money>$1,100.00</money></li>\n\n\n\n<li><strong>Key Support</strong>: <money>$950.00</money></li>\n</ul>\n\n\n\n<p><strong>LLY Price Action:</strong> <org value=\"LLY.NaE\" idsrc=\"xmltag.org\" >Eli Lilly</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='LLY' fmr-param-security-type='Equity'>( LLY )</span> shares were down 1.97% at <money>$1008.53</money> at the time of publication on Thursday, according to Benzinga Pro data.</p>\n\n\n\n<p><em>Image Via Shutterstock</em></p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602261259BENZINGAFULLNGTH50900949",
            "pub_date": "2026-02-27 01:59:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Office Movers Express Expands Regional Footprint With the Acquisition of Two Baltimore Firms",
            "description": "\n<p>    <location value=\"LU/us.dc.wash\" idsrc=\"xmltag.org\" >WASHINGTON</location>--(BUSINESS WIRE)--\nOffice Movers Express (OMX), the <location value=\"LU/us.dc.wash\" idsrc=\"xmltag.org\" >Washington</location> metro region’s only mover exclusively serving commercial clients, has announced the acquisition of two prominent <location value=\"LU/us.md.bltmre\" idsrc=\"xmltag.org\" >Baltimore</location> companies: Hoffberger Moving Services (HMS), Baltimore’s largest commercial mover specializing in healthcare and laboratory relocation services, and Re-form, the mid-Atlantic’s only used office furniture reseller, refurbisher and inventory manager.\n\n</p><p id=\"news-body-cta\">This press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20260226815456/en/</p><p>\nThe acquisitions more than double the size of OMX and significantly expand the company’s service capabilities, fleet size and warehousing/storage locations across the <location value=\"LU/us.md.bltmre\" idsrc=\"xmltag.org\" >Baltimore Washington</location> corridor. It provides HMS, founded in 2007, and the 37-year-old Re-form the benefit of OMX’s resources and four decades’ experience as they enter the <location value=\"LU/us.dc.wash\" idsrc=\"xmltag.org\" >Washington</location> market.\n\n</p><p>\n“The need for an office mover is by nature an intermittent one,” said OMX President <person>Mike Miller</person>. “Acquiring two firms who also only serve commercial customers and who provide complementary services to ours gives us additional resources to fulfill more diversified customer needs more often, while also broadening our customer base.”\n\n</p><p>\nHMS and Re-form will continue to serve their <location value=\"LU/us.md.bltmre\" idsrc=\"xmltag.org\" >Baltimore</location> customers with commercial moving, refurbished furniture sales and inventory management while maintaining current staffing levels in <location value=\"LU/us.md.bltmre\" idsrc=\"xmltag.org\" >Baltimore</location>. Corporate management will be administered by OMX from their headquarters in <location value=\"LU/us.md.bellle\" idsrc=\"xmltag.org\" >Beltsville, MD</location>.\n\n</p><p>\nRe-form CEO <person>Clayton Fisk</person> said: “With OMX’s resources they can now provide a more complete portfolio of services – including decommissioning and disposal. And their customers can now rely on one trusted partner to handle the full lifecycle of office furniture from repurposing and refurbishing, to resale and recycling in the <location value=\"LU/us.md.bltmre\" idsrc=\"xmltag.org\" >Baltimore Washington</location> area.”\n\n</p><p>\nTogether, the three companies provide moving and storage services for some of the most well-known names in commercial, government and health-related industries: Johns Hopkins, NIH, The Smithsonian, Southwest Airlines, Microsoft, <org>American University</org>, <org>The Library of Congress</org>, CareFirst, the Pentagon, IMF and many of the top 100 law firms in <location value=\"LU/us.dc.wash\" idsrc=\"xmltag.org\" >Washington</location>.\n\n</p><p>\nOMX is the only moving company in the region exclusively dedicated to commercial clients in DC, <location value=\"LS/us.md\" idsrc=\"xmltag.org\" >Maryland</location> and northern <location value=\"LS/us.va\" idsrc=\"xmltag.org\" >Virginia</location> since 1981. The firm also provides complete office decommissioning services as well as short and long-term storage in its 100,000 square feet of climate-controlled and video-monitored warehouses.\n\n</p><p><img alt=\"\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20260226815456r1&amp;sid=acqr8&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\" /><span class=\"bwct31415\" /></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\">https://www.businesswire.com/news/home/20260226815456/en/</span></p>\n<p>Source: Office Movers Express</p>\n",
            "link": "https://www.fidelity.com/news/article/mergers-and-acquisitions/202602261300BIZWIRE_USPR_____20260226_BW815456",
            "pub_date": "2026-02-27 02:00:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Musk touts California robotaxis but Tesla does nothing to get permits",
            "description": "<p><location value=\"LU/us.ca.losang\" idsrc=\"xmltag.org\" >LOS ANGELES</location>, <chron>Feb 26</chron> (Reuters) - For more than a year, <person>Elon Musk</person> has repeatedly said Tesla is months away from launching a driverless robotaxi service in <location value=\"LS/us.ca\" idsrc=\"xmltag.org\" >California</location> - once state regulators give their blessing.</p>\n<p>Tesla did nothing to secure that approval in 2025, according to previously unreported state <org>Department of Motor Vehicles</org> records and a state spokesperson. Tesla logged zero miles of autonomous test driving on California roads last year for the sixth year in a row, the records show.</p>\n<p>Documenting test miles is critical in <location value=\"LS/us.ca\" idsrc=\"xmltag.org\" >California's</location> regulatory system for robotaxis, which requires companies to progress through a series of permits before being allowed to operate a driverless ride-hailing service such as Alphabet's Waymo.</p>\n<p>Much of Tesla's <money>$1.5 trillion</money> market value is tied to investors' belief that it will soon operate a vast fleet of robotaxis and sell millions of autonomous-driving software subscriptions. Operating driverless vehicles in <location value=\"LS/us.ca\" idsrc=\"xmltag.org\" >California</location> - the largest U.S. auto market - is a linchpin of those ambitions.</p>\n<p><person>Bryant Walker Smith</person>, a <org>University of South Carolina</org> law professor and autonomous-driving expert who has consulted for the California DMV, said Tesla is implying that \"they are ready and regulators are not,\" while the reality is that \"regulators are ready, and they are not.\"</p>\n<p>Tesla did not respond to requests for comment. On an earnings call in October, Musk told analysts that the company is &quot;paranoid about safety&quot; and that it takes a &quot;cautious approach&quot; to new markets. &quot;We probably could just let it loose in these cities,&quot; he said, &quot;but we just don't want to take a chance.&quot;</p>\n<p>So far, Tesla operates only a small pilot robotaxi service in <location value=\"LU/us.tx.austin\" idsrc=\"xmltag.org\" >Austin, Texas</location>, which has far fewer regulatory barriers than <location value=\"LS/us.ca\" idsrc=\"xmltag.org\" >California</location>.</p>\n<p>In the <location value=\"LU/us.ca.sanfrn\" idsrc=\"xmltag.org\" >San Francisco Bay Area</location>, the company last July started operating what it called a \"robotaxi\" service that was not a robotaxi service at all. Instead, it is a chauffeur service with human drivers who use Tesla's \"Full Self-Driving\" driver-assistance software, which is not fully autonomous, according to the state regulator authorizing the service and Tesla's disclosures to customers.</p>\n<p>In order to operate fully self-driving vehicles in <location value=\"LS/us.ca\" idsrc=\"xmltag.org\" >California</location>, like Waymo, Tesla would first need to obtain permits to test and operate driverless vehicles from the state's <org>DMV and Public Utilities Commission</org>, which regulates commercial ride-hailing.</p>\n<p>Tesla so far has only the entry-level DMV permit, which allows testing driverless vehicles only with a human safety monitor in the driver's seat. A DMV spokesperson said Tesla has not applied for any additional permits.</p>\n<p>Tesla would need to log at least 50,000 miles (80,467 km) of autonomous driving on public roads in <location value=\"LS/us.ca\" idsrc=\"xmltag.org\" >California</location> with a safety driver before applying for a different permit allowing testing without one, according to proposed DMV regulations expected to be finalized later this year.</p>\n<p>Tesla has not logged any miles with state regulators since 2019 and has documented only 562 miles in total since 2016. </p>\n<p>Waymo, by comparison, logged more than 13 million testing miles and secured seven different regulatory approvals between 2014 and 2023, when it received approval to charge passengers for rides in driverless robotaxis. Waymo is one of three companies with <location value=\"LS/us.ca\" idsrc=\"xmltag.org\" >California</location> permits to commercially operate driverless vehicles and the only one approved to operate a robotaxi fleet anything like what Musk envisions.</p>\n<p>In written comments last year, Tesla criticized some of the California DMV's proposed revisions to autonomous-driving rules, questioning the need for testing on state roads and minimum-mile requirements. The company also complained about &quot;overly burdensome reporting requirements&quot; for crashes and other system failures.</p>\n<p>Musk has often suggested <location value=\"LS/us.ca\" idsrc=\"xmltag.org\" >California</location> regulations are the main impediment to deploying robotaxis there. On an <chron>October 2024</chron> earnings call, he said <location value=\"LS/us.ca\" idsrc=\"xmltag.org\" >California</location> has \"quite a long regulatory approval process.\"</p>\n<p>\"I'd be shocked if we don't get approved next year,\" he added, \"but it's just not something we totally control.\"</p>\n<p></p>\n<p>(Reporting by <person>Chris Kirkham</person> in <location value=\"LU/us.ca.losang\" idsrc=\"xmltag.org\" >Los Angeles</location>; Editing by <person>Brian Thevenot</person> and <person>Matthew Lewis</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/top-news/202602260605RTRSNEWSCOMBINED_KBN3PG187-OUSBS_1",
            "pub_date": "2026-02-27 01:55:44",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US weekly jobless claims rise slightly; unemployment rate likely unchanged in February",
            "description": "<p><location value=\"LU/us.dc.wash\" idsrc=\"xmltag.org\" >WASHINGTON</location>, <chron>Feb 26</chron> (Reuters) - The number of Americans filing new applications for jobless benefits increased slightly last week and the unemployment rate appeared to hold steady in February amid a stable labor market.</p>\n<p>The weekly jobless claims report from the <org>Labor Department</org> on Thursday suggested the labor market remained in a &quot;low-hire, low-fire&quot; state, and supported economists' expectations that the Federal Reserve would not cut interest rates before Fed Chair <person>Jerome Powell's</person> term ends in May. </p>\n<p>The labor market is regaining its footing after hitting a soft patch last year amid uncertainty economists attributed to President <person>Donald Trump's</person> broad tariffs.</p>\n<p>&quot;The data show no sign of the layoffs we would expect in a weakening labor market during the early days of a hypothetical recession,&quot; said <person>Carl Weinberg</person>, chief economist at High Frequency Economics. &quot;That will jolly up traders who believe the Fed will not cut rates anytime soon, given a steady labor market and inflation above target.&quot;</p>\n<p>Initial claims for state unemployment benefits rose 4,000 to a seasonally adjusted  212,000 for the week ended <chron>February 21</chron>. Economists polled by Reuters had forecast 215,000 claims for the latest week. Last week's claims included the Presidents' Day holiday, which could have impacted the data. </p>\n<p>Still, claims were below the levels seen during the same period last year. <org>The U.S. Supreme Court</org> last Friday struck down the tariffs, which Trump pursued under a law meant for use in national emergencies. Trump swiftly imposed a 10% global tariff for 150 days to replace some of the emergency duties, before raising the rate to 15% over the weekend.</p>\n<p>Economists said the latest moves created near-term uncertainty, but anticipated minimal economic impact. </p>\n<p>Lingering uncertainty from the since-invalidated import duties was blamed for a general hesitancy among businesses to increase hiring. A rapid adoption of artificial intelligence is adding another layer of caution, economists said. AI is the leading cause of layoffs in the technology sector.</p>\n<p>Stocks on <location>Wall Street</location> fell amid wariness over the implications of AI. The dollar advanced against a basket of currencies. U.S. Treasury yields were lower.</p>\n<p>LOW HIRING IS THE MOST WORRYING ASPECT</p>\n<p>&quot;The low hiring rate is still the most concerning aspect of the labor market, but the trend in continued claims suggests employers aren't pulling back further,&quot; said <person>Nancy Vanden Houten</person>, lead U.S. economist at Oxford Economics.</p>\n<p>The number of people receiving unemployment benefits after an initial week of aid, a proxy for hiring, dropped 31,000 to a seasonally adjusted 1.833 million during the week ended <chron>February 14</chron>, the claims report showed. The so-called continuing claims covered the period during which the government surveyed households for February's unemployment rate. </p>\n<p>Continued claims rose modestly between the January and February survey weeks. The jobless rate eased to 4.3% in January from 4.4% in December. The Chicago Fed forecast the unemployment rate steady at 4.28% in February, which would round up to 4.3%.</p>\n<p>While the labor market is stabilizing, consumers remain anxious about their employment prospects. </p>\n<p>A survey from the Conference Board this week showed the share of consumers who viewed jobs as &quot;hard to get&quot; increased to a five-year high in February, though households also believed the availability of jobs had improved.</p>\n<p>The median duration of unemployment is near four-year highs, and jobs remain scarce for young college graduates, labor market data shows. Unemployed recent college graduates do not show in the claims data because they have limited or no work history, making them ineligible to file for jobless benefits.</p>\n<p>&quot;The relationship between continuing claims and unemployment is far from airtight, given that the long-term unemployed, new entrants to the labor market, and those re-entering from inactivity, all are ineligible to claim,&quot; said <person>Oliver Allen</person>, senior U.S. economist at Pantheon Macroeconomics. </p>\n<p>Allen added that the Conference Board survey's &quot;hard to get&quot; jobs measure was &quot;a very reliable indicator in the past,&quot; and pointed &quot;to the unemployment rate rising again soon.&quot;</p>\n<p>Continuing claims could be falling because some people have exhausted their eligibility, limited to 26 weeks in most states.</p>\n<p><person>Andrew Stettner</person>, senior director for economic security at the <org>National Employment Law Project</org>, said a town hall for technology workers this past Sunday captured the AI anxiety.</p>\n<p>&quot;Software engineers talked about being laid off and out of work for 12 months or more,&quot; said Stettner, a former director of unemployment insurance modernization at the <org>Labor Department</org>.</p>\n<p>&quot;They saw AI as just the latest accelerant of rounds of technology layoffs at major companies like Amazon, but more importantly a rising threat for engineers to find any new job.&quot; </p>\n<p>(Reporting by Lucia Mutikani; Editing by <person>Chizu Nomiyama</person> and <person>Andrea Ricci</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/top-news/202602260841RTRSNEWSCOMBINED_KBN3PG1NF-OUSBS_1",
            "pub_date": "2026-02-27 01:55:43",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US Equity Indexes Decline as Chipmakers Dive After Nvidia's Results",
            "description": "\n<p><chron>12:29 PM EST</chron>, <chron>02/26/2026</chron> (MT Newswires) -- US equity indexes fell midday Thursday amid a sell-off in semiconductor companies, pushing technology lower after <org value=\"NVDA.NaE\" idsrc=\"xmltag.org\" >Nvidia</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NVDA' fmr-param-security-type='Equity'>( NVDA )</span>  announced quarterly results overnight.</p><p>The Nasdaq Composite dropped 1.6% to 22,782.1, the S&amp;P 500 fell 1% to 6,877.2, and the Dow Jones Industrial Average declined 0.4% to 49,308.8.</p><p>All but three sectors, energy, financials, and real estate, declined. Communication services, consumer discretionary, and materials were among the steepest decliners.</p><p><org value=\"NVDA.NaE\" idsrc=\"xmltag.org\" >Nvidia</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NVDA' fmr-param-security-type='Equity'>( NVDA )</span> reported a year-over-year jump in fiscal Q4 adjusted earnings and revenue late Wednesday and issued a Q1 revenue outlook above analysts' expectations. Nevertheless, shares gave up after-hours gains accrued late Wednesday, and fell 4% in the regular session after midday on Thursday, the worst performer on the Dow.</p><p>Among stocks with a market capitalization of more than <money>$200 billion</money>, nine out of the 10 worst performers were chipmakers, including <org value=\"AVGO.NaE\" idsrc=\"xmltag.org\" >Broadcom</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AVGO' fmr-param-security-type='Equity'>( AVGO )</span> , according to data compiled by Finviz.</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/us-markets/202602261229MIDNIGHTUSEQUITY_A3573923",
            "pub_date": "2026-02-27 01:29:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US STOCKS-Nasdaq leads Wall Street lower as tech rally stalls, Nvidia earnings disappoint",
            "description": "\n<p>*</p>\n<p>Indexes down: Dow 0.23%, S&amp;P 500 0.87%, Nasdaq 1.5%</p>\n<p></p>\n<p>*</p>\n<p><org value=\"TTD.NaE\" idsrc=\"xmltag.org\" >Trade Desk</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='TTD' fmr-param-security-type='Equity'>( TTD )</span> plunges after Q1 revenue forecast below\nestimates</p>\n<p></p>\n<p>*</p>\n<p><person>J.M. Smucker</person> jumps on Q3 beat, deal with Elliott</p>\n<p>(Updates with afternoon trading levels)</p>\n<p>By <person>Ragini Mathur</person> and <person>Shashwat Chauhan</person></p>\n<p><chron>Feb 26</chron> (Reuters) - The Nasdaq led losses on Thursday, as\na recent rally in technology stocks lost steam, with <org value=\"NVDA.NaE\" idsrc=\"xmltag.org\" >Nvidia's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NVDA' fmr-param-security-type='Equity'>( NVDA )</span>\nstellar results failing to enthuse investors and reigniting\nworries over the AI trade.</p>\n<p>The AI bellwether dropped 4.5% despite\nbetter-than-expected results for the January quarter and an\nupbeat current-quarter revenue forecast.</p>\n<p>&quot;The reaction is a little surprising and it is a\ncontinuation of what we see as the main issue: valuations,&quot; said\n<person>Jake Johnston</person>, portfolio manager at Advisors Asset Management.</p>\n<p>&quot;We see the tech premium seems to be coming out of the\nmarket and a lot of this has to do with the fact that a lot of\nthese names were priced for perfection, perhaps even a little\ntoo frothy.&quot;</p>\n<p>The Philadelphia SE Semiconductor Index dropped 3.4%\nafter hitting a record high in the previous session, on pace to\nsnap a 10-week winning streak, if losses hold.</p>\n<p>Most megacap and growth stocks were lower, with Alphabet\nand <org value=\"AMZN.NaE\" idsrc=\"xmltag.org\" >Amazon.com</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AMZN' fmr-param-security-type='Equity'>( AMZN )</span> down more than 1% each.</p>\n<p>Meanwhile, the S&amp;P 500 software and services index\ngained 0.7%, rebounding from a recent rout, as\n<org value=\"CRM.NaE\" idsrc=\"xmltag.org\" >Salesforce</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='CRM' fmr-param-security-type='Equity'>( CRM )</span> climbed 2% despite a subdued revenue forecast\nfor its fiscal 2027.</p>\n<p>Software, financial brokerages, data analytics and legal\nservices, real estate services and trucking sectors clocked\nheavy losses earlier this year over AI disruption fears.</p>\n<p>The S&amp;P 500 and the Nasdaq closed at two-week\nhighs on Wednesday, fueled by a rally in heavyweight technology\nstocks.</p>\n<p>At <chron>11:48 a.m.</chron>, the Dow Jones Industrial Average fell\n112.27 points, or 0.23%, to 49,369.88, the S&amp;P 500 lost\n60.76 points, or 0.87%, to 6,885.05 and the Nasdaq Composite\nlost 355.32 points, or 1.53%, to 22,796.76.</p>\n<p>The information technology index and the\ncommunication services index were the biggest\ndecliners among the 11 major S&amp;P sectors.</p>\n<p>Financials gained 0.8%, helping offset some losses.</p>\n<p>Big banks including <org value=\"MS.NaE\" idsrc=\"xmltag.org\" >Morgan Stanley</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='MS' fmr-param-security-type='Equity'>( MS )</span>, <org value=\"GS.NaE\" idsrc=\"xmltag.org\" >Goldman Sachs</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='GS' fmr-param-security-type='Equity'>( GS )</span>\nand <org value=\"C/PN.NaE\" idsrc=\"xmltag.org\" >Citigroup</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='C/PN' fmr-param-security-type='Equity'>( C/PN )</span> rose nearly 1% each.</p>\n<p>Investors also monitored the latest round of U.S.-<location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location> talks\nin <location value=\"LU/ch..geneva\" idsrc=\"xmltag.org\" >Geneva</location> aimed at resolving their longstanding nuclear dispute\nand averting new strikes on <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location>.</p>\n<p>Crude oil prices reversed their initial declines and were\nlast up more than 1%, with the energy stocks index\nclimbing 0.9%.</p>\n<p>February has been choppy, with the main U.S. indexes\nswinging sharply between gains and losses as sentiment toward AI\nand technology stocks wavered as investors fretted over the\npayoff from massive planned AI spending.</p>\n<p>Among other stocks, <org value=\"TTD.NaE\" idsrc=\"xmltag.org\" >Trade Desk</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='TTD' fmr-param-security-type='Equity'>( TTD )</span> fell 5% after the\nadvertising technology firm forecast first-quarter revenue below\nestimates amid mounting pressure from larger rivals.</p>\n<p><person>J.M. Smucker</person> jumped 6% after the Uncrustables maker\nbeat third-quarter expectations and appointed two directors to\nits board in a deal with activist-investor <org>Elliott Investment\nManagement</org>.</p>\n<p><org value=\"AI.NaE\" idsrc=\"xmltag.org\" >C3.ai</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AI' fmr-param-security-type='Equity'>( AI )</span> tumbled 20% after the software provider\nforecast current-quarter sales below estimates and said it was\ncutting 26% of its global workforce.</p>\n<p><org>Celsius Holding</org> jumped 7.3% after the energy drink\nmaker reported fourth-quarter revenue above estimates.</p>\n<p>Declining issues outnumbered advancers by a 1.04-to-1 ratio\non the <org>NYSE</org> and by  a 1.39-to-1 ratio on the Nasdaq.</p>\n<p>The S&amp;P 500 posted 32 new 52-week highs and one new low,\nwhile the Nasdaq Composite recorded 68 new highs and 65 new\nlows.\n(Reporting by <person>Shashwat Chauhan</person> and <person>Ragini Mathur</person> in Bengaluru;\nEditing by Devika Syamnath and Sriraj Kalluvila)</p>\n",
            "link": "https://www.fidelity.com/news/article/us-markets/202602261233RTRSNEWSCOMBINED_L4N3ZM1SX_1",
            "pub_date": "2026-02-27 01:33:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "DATATRAK Standalone eConsent Accelerates Clinical Trials",
            "description": "\n<p><i><strong>eConsent solution deploys in under four weeks, integrates with any EDC, and delivers affordable, patient‑centric digital consent</strong></i></p> <p><strong id=\"dateline\"><location value=\"LU/us.tx.austin\" idsrc=\"xmltag.org\" >AUSTIN, TX</location> / ACCESS Newswire / <chron>February 26, 2026</chron> / </strong><org value=\"DTRK.NaE\" idsrc=\"xmltag.org\" >DATATRAK International, Inc.'s</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='DTRK' fmr-param-security-type='Equity'>( DTRK )</span><strong> </strong> DATATRAK Powered by Fountayn unified eClinical, eSource, and decentralized clinical trial (DCT) platform, announces the release of its standalone eConsent solution designed to help sponsors, CROs, and sites modernize informed consent while reducing startup timelines and technology costs. The new eConsent offering can be deployed in under four weeks and is available as a lightweight, cost‑effective module or as a fully integrated component of the DATATRAK Powered by Fountayn EDC and DCT ecosystem.</p><p>Unlike many eConsent tools that are bundled only within large, expensive ePRO or DCT packages, <org value=\"DTRK.NaE\" idsrc=\"xmltag.org\" >DATATRAK's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='DTRK' fmr-param-security-type='Equity'>( DTRK )</span> standalone eConsent delivers flexible pricing so study teams can implement digital informed consent without paying for an entire ePRO system they do not need. Reasonable, study‑level pricing makes eConsent accessible for a broader range of trials and budgets, including early‑phase, single‑site, and investigator‑initiated studies.</p><p>&quot;Study teams want the benefits of modern eConsent-faster startup, better participant understanding, and cleaner documentation-without lengthy implementations or bloated platform costs,&quot; said <person>Alex Tabatabai</person>, CEO, <org value=\"DTRK.NaE\" idsrc=\"xmltag.org\" >DATATRAK</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='DTRK' fmr-param-security-type='Equity'>( DTRK )</span>. &quot;Our standalone eConsent is purpose‑built to launch quickly, fit into existing study infrastructure, and scale seamlessly when sponsors are ready to expand into DATATRAK EDC, ePRO, RTSM, CTMS, or full decentralized clinical trials.&quot;</p><p><strong>Fast Startup, IND‑Ready Timelines</strong></p><p>The <org value=\"DTRK.NaE\" idsrc=\"xmltag.org\" >DATATRAK</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='DTRK' fmr-param-security-type='Equity'>( DTRK )</span> eConsent solution is designed for implementation timelines of under four weeks, allowing study teams to go live in time for IND or ethics approval and first‑patient‑in milestones. Configuration is supported by reusable templates and best‑practice workflows that help streamline approvals and site activation.</p><p><strong>Standalone eConsent with Enterprise‑Grade Integration</strong></p><p>The eConsent module can be used as a standalone utility and integrated with third‑party infrastructure, including external EDC, RTSM, CTMS, and eTMF systems, or deployed as a native component of DATATRAK EDC. When used with DATATRAK EDC, consent data and enrollment status are seamlessly connected to subject records, randomization, and visit schedules, enabling true end‑to‑end digital trial execution on a single platform.</p><p><strong>Key Capabilities Include:</strong></p><p>1. Standalone eConsent that integrates with third‑party clinical trial systems or EDC<br />2. Seamless integration with the consent and enrollment workflow in EDC<br />3. Support for remote and decentralized clinical trials with patient access from any device<br />4. Designed for protocol amendments and regulatory workflows</p><p><org value=\"DTRK.NaE\" idsrc=\"xmltag.org\" >DATATRAK's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='DTRK' fmr-param-security-type='Equity'>( DTRK )</span> eConsent simplifies managing protocol amendments and re‑consent, a common pain point for sponsors and sites. Study teams can easily trigger and track re‑consent when protocol changes occur, ensuring every participant is on the correct version and that audit trails remain inspection‑ready.</p><p>The system also supports tracking and managing supporting documents such as witness statements, translations, and supplemental information, helping maintain complete, compliant records across sites and regions.</p><p><strong>Flexible Patient Engagement and Enrollment Options</strong></p><p>To support both site‑based and remote enrollment, the eConsent solution enables sites to invite participants using multiple methods: email links, QR codes patients can scan on their own device, or direct registration by the physician or site staff. Sites can also schedule consent visits prior to trial enrollment, helping ensure participants have adequate time to review materials, ask questions, and complete consent in a controlled, compliant workflow.</p><p>When combined with <org value=\"DTRK.NaE\" idsrc=\"xmltag.org\" >DATATRAK's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='DTRK' fmr-param-security-type='Equity'>( DTRK )</span> EDC, ePRO, and eSource capabilities, sponsors can extend the same patient‑centric digital experience beyond consent to ongoing data collection and engagement throughout the study.</p><p><strong>About <org value=\"DTRK.NaE\" idsrc=\"xmltag.org\" >DATATRAK</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='DTRK' fmr-param-security-type='Equity'>( DTRK )</span></strong></p><p>DATATRAK Powered by Fountayn is transforming healthcare and life sciences through technological innovations by providing a unified, cloud based eClinical and decentralized clinical trial platform that brings together EDC, eSource, ePRO/eCOA, eConsent, RTSM, RBM, Adjudication, Imaging, Safety, Global Oversight and Enterprise Workflow Management, CTMS, eTMF, and DCT tools in a single, configurable environment. With global access from any device and a single‑source data model, <org value=\"DTRK.NaE\" idsrc=\"xmltag.org\" >DATATRAK</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='DTRK' fmr-param-security-type='Equity'>( DTRK )</span> helps sponsors, CROs, and sites accelerate study timelines, improve data quality, and reduce operational burden across all phases of clinical research. <org value=\"DTRK.NaE\" idsrc=\"xmltag.org\" >DATATRAK</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='DTRK' fmr-param-security-type='Equity'>( DTRK )</span> complies with the highest Quality Assurance standards that are 21 CFR Part 11, GDPR, GCP, HIPAA, and CDISC compliant that are fully validated by our experienced team of software quality engineers. <org value=\"DTRK.NaE\" idsrc=\"xmltag.org\" >DATATRAK's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='DTRK' fmr-param-security-type='Equity'>( DTRK )</span> cloud-based platform is trusted in 83 countries, 6 continents, for over 10,000 clinical trials. <org value=\"DTRK.NaE\" idsrc=\"xmltag.org\" >DATATRAK</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='DTRK' fmr-param-security-type='Equity'>( DTRK )</span> is based in <location value=\"LU/us.tx.austin\" idsrc=\"xmltag.org\" >Austin, Texas</location> and has team members and data hosting infrastructure in its key service regions of <location value=\"LC/us\" idsrc=\"xmltag.org\" >the United States</location>, <location value=\"LR/eur\" idsrc=\"xmltag.org\" >Europe</location>, and <location value=\"LC/jp\" idsrc=\"xmltag.org\" >Japan</location>. For more information, visit www.fountayn.com or www.datatrak.com.</p><p><strong>Contact: </strong>sales@fountayn.com</p><p><strong>SOURCE: </strong><org value=\"DTRK.NaE\" idsrc=\"xmltag.org\" >Datatrak International</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='DTRK' fmr-param-security-type='Equity'>( DTRK )</span></p><br /><br />View the original press release on ACCESS Newswire<br /><br />\n      <img src=\"https://app.accessnewswire.com/img.ashx?id=1141923\" width=\"0\" height=\"0\"/>\n",
            "link": "https://www.fidelity.com/news/article/technology/202602261245ACCESSWRNAPR_____1141923",
            "pub_date": "2026-02-27 01:45:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "NetActuate Announces 2026 C-Band Transition Acceleration Program Powered by Open Network Edge",
            "description": "\n<div class=\"xn-content\">\n<p><span class=\"legendSpanClass\"><location value=\"LU/us.ca.losang\" idsrc=\"xmltag.org\" >LOS ANGELES</location></span>, <span class=\"legendSpanClass\"><chron>Feb. 26, 2026</chron></span> /PRNewswire/ -- NetActuate, a leading provider of global infrastructure and network services in 45+ markets worldwide, today announced its <u>C-Band Transition Acceleration Program</u> to actively support organizations in <location value=\"LC/us\" idsrc=\"xmltag.org\" >the United States</location> executing the next phase of the C-band transition. With turnkey capabilities spanning edge site deployment coordination, regional data centers, backhaul, large-scale IP delivery, and <u>Open Network Edge (ONE)</u> IaaS, NetActuate is an ideal partner for providing infrastructure and networking to full-stack solutions as part of new C-band transition business models.</p>\n    <div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder1\">\n                <p>\n\n                    <img src=\"https://mma.prnewswire.com/media/2921320/NetActuate___reallocate_radio_spectrum_Large.jpg\" title=\"2026 is the year for C-band transition acceleration.\" alt=\"2026 is the year for C-band transition acceleration.\" />\n\n                </p>\n    </div>\n<p>On <chron>November 20, 2025</chron>, the <org>Federal Communications Commission</org> (FCC) voted unanimously to repurpose the 3.7 to 4.2 GHz spectrum band by clearing 3.7 to 3.98 GHz for flexible use, establishing 3.98 to 4.0 GHz as a guard band, and moving incumbent satellite operations into the upper portion of the band. This monumental shift is driving multi-year infrastructure and operational changes across satellite distribution, broadcast, and wireless ecosystems.</p><p>With major readiness and transition deadlines now passed, 2026 is a key year for operators to move forward with modernization that is repeatable across sites, resilient under live traffic, and operationally stable over time. C-band contribution and distribution is mission-critical and requires engineered routing and redundancy for contribution-grade transport.</p><p>By leveraging NetActuate's infrastructure and networking capabilities, enterprises avoid trying to stitch together multiple providers across roofs, facilities, transport, compute, and delivery.</p><p><i>\"C-band has moved beyond readiness timelines and into large-scale execution,\" said <person>Mark Mahle</person>, CEO of NetActuate. \"Operators need a practical path from roof to IP that is built for mission-critical contribution and distribution. NetActuate stands ready to help you standardize and scale rollouts across sites in 2026.\"</i></p><p>NetActuate's C-band transition acceleration program brings together:</p><ul type=\"disc\"><li>Rooftop and edge-adjacent deployment coordination for dishes, antennas, cabinets, and supporting equipment</li><li>Backhaul into colocation, bare metal, and edge cloud footprints aligned to customer POPs, partners, and clouds</li><li>Anycast-based traffic steering and resilient IP delivery engineered for redundancy and predictable failover</li><li>Architecture assistance for routing policy, diversity planning, monitoring, and cutover execution</li></ul><p>With NetActuate's <u>ONE (Open Network Edge)</u>, teams can standardize deployments and scale faster using a DevOps-first operating model across cloud, Kubernetes, colocation, and bare metal. NetActuate's 22 PoPs in <location value=\"LC/us\" idsrc=\"xmltag.org\" >the United States</location> provide an ideal place to terminate, process, secure, and route traffic close to where it enters the network. NetActuate's customer portal tooling, APIs, and automation-friendly workflows help shorten change cycles and reduce operational friction.</p><p>Customers can engage <u><org>NetActuate Consulting</org></u> as an extension of their team for architecture guidance, solution design, DevOps, vNOC, smarter hands, logistics, and ongoing support as needed.</p><p>Many C-band workflows are mission-critical contribution and distribution paths where route stability and rapid recovery matter as much as bandwidth. NetActuate's global, highly peered network is designed to support low latency routing, load balancing, and delivery optimization at scale. For organizations expanding delivery infrastructure alongside their transition, <u>NetActuate's CDN Solution</u> provides a foundation for global scale while customers retain control of their service stack.</p><p><u>Learn more</u> and request an <u>Architecture Review Session</u>.</p><p><b>About NetActuate<br /></b>NetActuate delivers edge infrastructure and network solutions in over 45 locations worldwide, enabling customers to take control of their workloads anywhere with low latency, resiliency, and security built in. Our Open Network Edge (ONE) IaaS built on open source software and standards provides everything needed to architect cloud environments and extensible infrastructure. Choose between VMs, Kubernetes, cloud, colocation, bare metal, and storage infrastructure—all with Anycast connectivity. We offer 24x7 support, expert consulting, and flexible, open solutions engineered for scalability and performance.</p><p>To schedule a call with NetActuate engineers or learn more about our products and services, visit <u>netactuate.com</u>. For technical insights on improving reliability, reducing latency, and simplifying architecture at the network level, visit <u>anycast.com</u>.</p>\n<div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder2\">\n                <p>\n\n                    <img src=\"https://mma.prnewswire.com/media/2918346/NetActuate_Logo.jpg\" title=\"NetActuate Logo (PRNewsfoto/NetActuate)\" alt=\"NetActuate Logo (PRNewsfoto/NetActuate)\" />\n\n                </p>\n</div>\n\n\n\n<p id=\"PURL\"><img title=\"Cision\" width=\"12\" height=\"12\" alt=\"Cision\" src=\"https://edge.prnewswire.com/c/img/favicon.png?sn=NY96747&amp;sd=2026-02-26\" /> View original content to download multimedia:https://www.prnewswire.com/news-releases/netactuate-announces-2026-c-band-transition-acceleration-program-powered-by-open-network-edge-302698589.html</p><p>SOURCE NetActuate</p></div>\n",
            "link": "https://www.fidelity.com/news/article/technology/202602261245PR_NEWS_USPR_____NY96747",
            "pub_date": "2026-02-27 01:45:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Market Chatter: Kenvue Bid to Dismiss Texas AG Lawsuit Rejected by Judge",
            "description": "\n<p><chron>12:37 PM EST</chron>, <chron>02/26/2026</chron> (MT Newswires) -- <org value=\"KVUE.NaE\" idsrc=\"xmltag.org\" >Kenvue's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='KVUE' fmr-param-security-type='Equity'>( KVUE )</span>  attempt to dismiss a lawsuit by <location value=\"LS/us.tx\" idsrc=\"xmltag.org\" >Texas</location> Attorney General <person>Ken Paxton</person> was rejected by a state judge on Thursday, Reuters reported.</p><p>Paxton has accused the company of falsely marketing Tylenol by concealing possible autism risks to children whose mothers took the painkiller while pregnant.</p><p><org value=\"KVUE.NaE\" idsrc=\"xmltag.org\" >Kenvue</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='KVUE' fmr-param-security-type='Equity'>( KVUE )</span> didn't immediately reply to a request for comment from MT Newswires.</p><p>(Market Chatter news is derived from conversations with market professionals globally. This information is believed to be from reliable sources but may include rumor and speculation. Accuracy is not guaranteed.)</p><p>Price: 18.93, Change: +0.16, Percent Change: +0.83</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602261237MIDNIGHTUSEQUITY_A3573939",
            "pub_date": "2026-02-27 01:37:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "MARA Holdings Stock Slides Ahead Of Q4 Earnings",
            "description": "\n<p><strong><org value=\"MARA.NaE\" idsrc=\"xmltag.org\" >MARA Holdings Inc</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='MARA' fmr-param-security-type='Equity'>( MARA )</span></strong> shares are under pressure on Thursday. Investors seem to be taking a cautious stance ahead of the Bitcoin miner's quarterly earnings report due after the market close Thursday.</p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><org value=\"MARA.NaE\" idsrc=\"xmltag.org\" >MARA Holdings</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='MARA' fmr-param-security-type='Equity'>( MARA )</span> stock is feeling bearish pressure. What&#8217;s behind MARA decline?</li>\n</ul>\n\n\n\n<h2 class=\"wp-block-heading\">Earnings Anticipation</h2>\n\n\n\n<p>Mara is preparing to report results after the bell, with analysts expecting a loss of <money>11 cents</money> per share. The weakness on Thursday may be coming from broader uncertainty in the crypto‑mining space, where investors are waiting for clearer signals on profitability, especially amid <strong>Bitcoin </strong>(CRYPTO: BTC) price volatility.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><location>Strong Momentum Last Quarter</location></h2>\n\n\n\n<p>The hesitation comes despite a strong showing last quarter when Mara beat earnings expectations by <money>16 cents</money>. Revenue jumped 92% year-over-year to <money>$252 million</money>, and net income swung to <money>$123 million</money>, a sharp turnaround from the <money>$125 million</money> loss reported in the third quarter of 2024.</p>\n\n\n\n<p>The company also nearly doubled its Bitcoin holdings, ending the quarter with 52,850 BTC, up from 26,747 BTC a year earlier.</p>\n\n\n\n<h2 class=\"wp-block-heading\">What Analysts Have To Say</h2>\n\n\n\n<p>The recent analyst actions for <org value=\"MARA.NaE\" idsrc=\"xmltag.org\" >Mara Holdings</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='MARA' fmr-param-security-type='Equity'>( MARA )</span> show a mixed trend with some firms maintaining their ratings while others have shown an upgrade. Key actions include Piper Sandler maintaining an &#8216;Overweight&#8217; rating but reducing the target from <money>$26.00</money> to <money>$16.00</money> on <chron>Jan. 14</chron>. Additionally, <location>Compass Point</location> upgraded the company to &#8216;Buy&#8217; from &#8216;Neutral&#8217; and set a target of <money>$30.00</money> on <chron>Nov. 24</chron>.</p>\n\n\n\n<p>Other significant actions involve JP Morgan and Cantor Fitzgerald, who both maintained an &#8216;Overweight&#8217; rating for Mara on <chron>Nov. 24</chron> and <chron>Nov. 5</chron> respectively, albeit with revised targets. Rosenblatt also maintained a &#8216;Buy&#8217; rating on <chron>Nov. 5</chron>, setting a target of <money>$22.00</money>, down from the previous <money>$25.00</money>.</p>\n\n\n\n<p><strong>MARA Price Action:</strong> MARA shares were down 3.62% at <money>$8.26</money> at the time of publication on Thursday, according to Benzinga Pro.</p>\n\n\n\n<p><em>Image: Shutterstock.com</em></p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602261239BENZINGAFULLNGTH50900085",
            "pub_date": "2026-02-27 01:39:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CIQ Launches RLC Pro, Redefining the Enterprise Linux Standard for the Next Generation of Infrastructure",
            "description": "\n<div class=\"xn-content\">\n<p><b>Commercially supported offering unifies open source availability and enterprise capabilities in one solution, eliminating infrastructure fragmentation and delivering long term support, FIPS and direct bug fixes as standard features.</b></p><p><span class=\"legendSpanClass\"><location value=\"LU/us.nv.reno\" idsrc=\"xmltag.org\" >RENO, Nev.</location></span>, <span class=\"legendSpanClass\"><chron>Feb. 26, 2026</chron></span> /PRNewswire/ -- CIQ, the founding support and services partner of Rocky Linux, today launched Rocky Linux from CIQ Pro (RLC Pro), a commercially supported Enterprise Linux subscription that transforms how organizations consume production-grade infrastructure and provides a strong foundation for next-generation software infrastructure, including AI, HPC and security hardened options. With Enterprise Linux binary compatibility, RLC Pro bundles long term support and lifecycle management, FIPS 140-3 validation, indemnification, security and support SLAs and customer-driven, direct bug fixes as necessary features, creating a clear path from community-based to mission-critical enterprise production.</p>\n    <div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder1\">\n                <p>\n\n                    <img src=\"https://mma.prnewswire.com/media/2832135/CIQ_Logo.jpg\" title=\"Powering the next generation of software infrastructure (PRNewsfoto/CIQ)\" alt=\"Powering the next generation of software infrastructure (PRNewsfoto/CIQ)\" />\n\n                </p>\n    </div>\n<p>RLC Pro represents a fundamental shift in what can be expected from enterprise operating systems and redefines the Enterprise Linux standard. CIQ believes that long term support, FIPS validation and direct bug fixes should be bundled as base features, not sold as expensive add-ons. For the first time, organizations get the commercial accountability and vendor support production infrastructure demands, bundled into one solution as the base offering from CIQ.</p><p>This addresses a long-standing market gap. Today, enterprises choosing open source solutions accept operational risk, spending engineering resources hunting through GitHub for stability solutions and managing security vulnerabilities without vendor backing. Those who choose commercial solutions often pay additional subscription fees to unlock the features they need on top of base licensing costs. This is orders of magnitude more difficult and risky when maintaining the operating system. RLC Pro eliminates the difficulty and risk by making these capabilities standard, delivering the support enterprises need, leaning on CIQ for faster bug fixes, vulnerability patches and escalated support as part of the base offering.</p><p>RLC Pro transforms what enterprises can accomplish by providing:</p><ul type=\"disc\"><li><b>Bundled long term support</b> enables platform teams to plan infrastructure on 3-5 year horizons without forced point-release upgrades. They can deploy once, maintain stability and focus engineering resources on business differentiation rather than operating system maintenance.</li><li><b>FIPS 140-3 validated packages</b> enable enterprises to deploy at scale in government, defense, financial services and healthcare by passing compliance audits without resource-intensive internal certification efforts.</li><li><b>Direct bug and security fixes</b> from CIQ's engineering team keep production systems running and SLAs met based on specific customer feedback. Engineers stop firefighting infrastructure issues and start shipping features faster.</li><li><b>Enterprise License Agreements</b> (ELAs) to cover your entire infrastructure: from core, to cloud and edge, RLC Pro has your back.</li></ul><p>Rocky Linux is one of the most widely deployed enterprise Linux distributions worldwide, with Extra Packages for Enterprise Linux (EPEL) telemetry showing more than 2.75 million actively deployed instances globally. As adoption has accelerated, so has enterprise demand for commercially backed support, long-term lifecycle guarantees and validated compliance capabilities. RLC Pro directly addresses that market need.</p><p>\"AI is driving a true inflection point for enterprise infrastructure,\" said <person>Gregory Kurtzer</person>, CEO of CIQ and Cofounder of Rocky Linux. \"RLC Pro brings together the infrastructure capabilities organizations need into a use-everywhere model that prioritizes efficiency, security and usability. We believe long term support, FIPS validation and direct, responsive engineering should be standard. When you hit a bug, we fix it. When you need a security remediation, we deliver it. And when you need a partner to ensure your infrastructure is running at its best, CIQ is there with you.\"</p><p>\"The real transformation here is what this enables enterprises to do,\" said <person>Bjorn Hovland</person>, President of CIQ. \"Deploy in regulated environments immediately. Plan infrastructure investments with confidence. Free engineering talent to build products instead of managing operating systems. RLC Pro doesn't just change how organizations consume Linux, it changes what they can accomplish with it.\"</p><p>RLC Pro is available today from CIQ and through <location>AWS Marketplace</location>, <location>Microsoft Azure Marketplace</location> and <location>Google Cloud Marketplace</location>. It will soon be available through the CIQ Portal, launching in the coming months.</p><p>To learn more about RLC Pro and CIQ's complete Enterprise Linux portfolio, read the CIQ blog post. Also, join <person>Brady Dibble</person>, Director of Product Management, for the upcoming webinar \"RLC Pro: Redefining what Enterprise Linux should be,\" on <chron>Thursday, March 12, 2026</chron> at <chron>11am PT</chron> / <chron>2pm ET</chron>.</p><p><b>About CIQ</b></p><p>CIQ is the founding support and services partner of Rocky Linux and the leader in enterprise Linux architecture for sovereign AI inferencing at scale. CIQ delivers a complete software infrastructure stack, from the operating system to orchestration, enabling enterprises, government agencies, research institutions and supercomputing centers worldwide to deploy AI and high-performance computing workloads with strategic independence and control. CIQ's product portfolio includes the Rocky Linux from CIQ Pro (RLC Pro) family of enterprise operating systems, Ascender Pro for IT automation, Fuzzball for cloud HPC orchestration, Warewulf Pro for cluster provisioning, and Apptainer, the leading container system for high-performance computing. Together, these products provide the secure, performant infrastructure foundation that modern AI deployments demand. For more information, visit ciq.com.</p><p><b>MEDIA CONTACT:<br /></b><person>Cristin Connelly</person><br />Cathey.co for CIQ<br />cristin@cathey.co</p>\n\n\n\n<p id=\"PURL\"><img title=\"Cision\" width=\"12\" height=\"12\" alt=\"Cision\" src=\"https://edge.prnewswire.com/c/img/favicon.png?sn=NY96221&amp;sd=2026-02-26\" /> View original content to download multimedia:https://www.prnewswire.com/news-releases/ciq-launches-rlc-pro-redefining-the-enterprise-linux-standard-for-the-next-generation-of-infrastructure-302697766.html</p><p>SOURCE CIQ</p></div>\n",
            "link": "https://www.fidelity.com/news/article/technology/202602261205PR_NEWS_USPR_____NY96221",
            "pub_date": "2026-02-27 01:05:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Research Alert: CFRA Keeps Hold Opinion On Ads Of Wpp",
            "description": "\n<p><chron>12:10 PM EST</chron>, <chron>02/26/2026</chron> (MT Newswires) -- CFRA, an independent research provider, has provided MT Newswires with the following research alert. Analysts at CFRA have summarized their opinion as follows:</p><p>We maintain our 3-STARS (Hold) rating but lower our 12-month target price to <money>USD20</money> (<money>USD23</money>), based on 2026 P/E of 6.2x. The multiple reflects a 1.5x discount to the 10-year historical mean, incorporating weaker near-term revenue visibility and structural AI-related pricing risk. We apply a modest premium to the parent multiple to reflect structural valuation differences in the ADS listing, including broader U.S. investor access and trading volumes. We raise our 2026 revenue forecast by 5.6% to <money>GBP13.7B</money> (<money>GBP13B</money>), aligned with updated management guidance for weaker first-half trends followed by improvement in the second half of 2026. We forecast 2027 revenue of <money>GBP13.9B</money>, up 1.5% Y/Y, assuming gradual stabilization in advertising demand and improved new business momentum. We also forecast 2026 EPS of <money>GBP0.64</money>  and 2027 EPS of <money>GBP0.65</money>, reflecting modest margin assumptions. We remain cautious on AI-driven competitive intensity, which could pressure pricing power and reduce long-term margins.</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/investing-ideas/202602261210MIDNIGHTUSEQUITY_A3573906",
            "pub_date": "2026-02-27 01:10:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "European Stocks Mixed in Thursday Trading; Economic Expectations Lower in EU, Euro Area",
            "description": "\n<p><chron>12:10 PM EST</chron>, <chron>02/26/2026</chron> (MT Newswires) -- The European stock markets were set to close mixed in Thursday trading as The Stoxx Europe was unchanged, <location value=\"LC/de\" idsrc=\"xmltag.org\" >Germany's</location> DAX rose 0.4%, the FTSE 100 was up 0.4%, <location value=\"LC/fr\" idsrc=\"xmltag.org\" >France's</location> CAC gained 0.7%, and the Swiss Market Index was down 0.5%.</p><p>The Economic Sentiment Indicator for February decreased in both the EU and the euro area, falling 1 point to 98.3 for each, according to the <org>European Commission</org>. The Employment Expectations Indicator also declined compared to January, with the EU 0.7 points lower to 98.5, and the euro area down 0.6 points to 97.6. Both indicators continue to remain below their long-term averages of 100.</p><p>And in corporate news, Stellantis reported early Thursday it swung to an H2 adjusted loss of <money>0.60 euros</money> (<money>$0.71</money>) per diluted share from an adjusted profit of <money>0.08 euros</money> a year earlier.</p><p>Net revenue for the half-year ended <chron>Dec. 31</chron> was <money>79.25 billion euros</money>, up from <money>71.86 billion euros</money> a year ago.</p><p>Shares of Stellantis rose 4.2% in <location value=\"LU/fr..paris\" idsrc=\"xmltag.org\" >Paris</location>.</p><p>For 2026, the automaker said it continues to expect revenue to rise by a mid-single digit and to see sequential improvements from H1 to H2.</p><p>BNP Paribas and Apollo Global Management are close to entering a partnership to arrange loans for corporate and private equity clients in <location value=\"LR/eur\" idsrc=\"xmltag.org\" >Europe</location>, <org>Bloomberg</org> reported Thursday, citing people with knowledge of the matter. Apollo and BNP did not immediately respond to a request to comment from MTNewswires.</p><p>Shares of BNP Paribas were down 0.1% in <location value=\"LU/fr..paris\" idsrc=\"xmltag.org\" >Paris</location>.</p><p>GSK said Thursday that <location value=\"LC/cn\" idsrc=\"xmltag.org\" >China's</location> drug regulator has accepted for priority review its new drug application for its experimental treatment, linerixibat, for patients with primary biliary cholangitis, a rare autoimmune liver disease.</p><p>The filing is supported by results from a phase 3 trial that met its primary and key secondary endpoints, showing meaningful and sustained improvement in itching and sleep disturbance compared with placebo, the company said.</p><p>Separately, GSK said <location value=\"LC/jp\" idsrc=\"xmltag.org\" >Japan</location> also accepted for review its new drug application for experimental chronic hepatitis B treatment, bepirovirsen, in adults.</p><p>Shares of GSK were down 2.1% in <location value=\"LU/gb.eng.london\" idsrc=\"xmltag.org\" >London</location>.</p><p>Nokia said Thursday it won an exclusive agreement to deploy network connectivity systems for 17 of Telefonica's new edge data centers in <location value=\"LC/es\" idsrc=\"xmltag.org\" >Spain</location>.</p><p>The company will supply data center switches and service routers to connect localized computing systems and link the nodes to external networks, the company said.</p><p>Shares of Nokia dropped 3% in <location value=\"LU/fi..helsin\" idsrc=\"xmltag.org\" >Helsinki</location>, while Telefonica shares were down 1% in <location value=\"LU/es..madrid\" idsrc=\"xmltag.org\" >Madrid</location>.</p><p>Eni reported Q4 earnings Thursday of <money>0.01 euro</money> (<money>$0.01</money>) per diluted share, down from <money>0.06 euro</money> a year earlier.</p><p>Sales from operations for the quarter ended <chron>Dec. 31</chron> were <money>20.62 billion euros</money>, down from <money>23.49 billion euros</money> a year earlier. Four analysts surveyed by FactSet expected <money>18.63 billion euros</money>.</p><p>Shares of the Italian oil and gas company gained 2.5% in <location value=\"LU/it.lo.milan\" idsrc=\"xmltag.org\" >Milan</location>.</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/international/202602261210MIDNIGHTUSEQUITY_A3573874",
            "pub_date": "2026-02-27 01:10:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "UK's FTSE 100 finishes at record high on Rolls-Royce, LSEG boost",
            "description": "\n<p>*</p>\n<p>FTSE 100 up 0.4%, FTSE 250 up 0.4%</p>\n<p></p>\n<p>*</p>\n<p>Rolls-Royce rises on strong earnings and raised targets</p>\n<p></p>\n<p>*</p>\n<p>Starmer faces close fight in <location value=\"LU/gb.eng.manchr\" idsrc=\"xmltag.org\" >Manchester</location> versus Reform,\nGreens</p>\n<p>(Updates to market close)</p>\n<p>By Tharuniyaa  Lakshmi</p>\n<p><chron>Feb 26</chron> (Reuters) - <location value=\"LC/gb\" idsrc=\"xmltag.org\" >Britain's</location> FTSE 100 hit a record high\non Thursday, supported by a rally in shares in Rolls-Royce after\nits forecast upgrade and in LSEG after its share buyback.</p>\n<p>Rolls-Royce rose 9.1% after reporting a 40% jump in\nannual profit, driven by strong demand for its aero-engines and\nrising power needs from data centres. British aerospace and\ndefence stocks rose to an all-time high following\nthe results.</p>\n<p>The blue-chip FTSE 100 index closed 0.4% higher at\n10,846.70 points, while the domestically focused mid-cap FTSE\n250 was also up 0.4%.</p>\n<p>The FTSE 100 has climbed 6% so far in February, on pace for\nits eighth straight monthly rise and outperforming its U.S. and\nEuropean peers, buoyed by investor bets on an additional <org>Bank of\nEngland</org> rate cut in March.</p>\n<p>&quot;It is likely that the UK index's outperformance is here to\nstay,&quot; <person>Axel Rudolph</person>, senior financial analyst at IG, said.</p>\n<p>Despite the UK blue-chip index's near 22% surge in 2025,\nmany of its companies remain on single-digit price-to-earnings\nratios, making them appealing to investors looking to cut\nexposure to highly valued U.S. tech, Rudolph added.</p>\n<p><org value=\"LDNXF.NaE\" idsrc=\"xmltag.org\" >London Stock Exchange Group</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='LDNXF' fmr-param-security-type='Equity'>( LDNXF )</span> jumped 6.7% after\nannouncing a share buyback plan at a time the company faces\npressure from activist investor Elliott Management and concerns\nthat AI will squeeze its business model.</p>\n<p>Information group <org value=\"RELX.NaE\" idsrc=\"xmltag.org\" >RELX</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='RELX' fmr-param-security-type='Equity'>( RELX )</span> gained 4.6% amid a broad\nrecovery in global software and data stocks which had been\nhammered earlier this month on AI disruption fears.</p>\n<p>AI bellwether <org value=\"NVDA.NaE\" idsrc=\"xmltag.org\" >Nvidia</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NVDA' fmr-param-security-type='Equity'>( NVDA )</span>, however, fell 5% as its\nupbeat results failed to lift sentiment for investors\nincreasingly concerned about the returns from massive spending\non AI.</p>\n<p>Investors also sifted through a slate of domestic corporate\nupdates.</p>\n<p><org value=\"HKMPF.NaE\" idsrc=\"xmltag.org\" >Hikma Pharmaceuticals</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='HKMPF' fmr-param-security-type='Equity'>( HKMPF )</span> slumped 15.8% to a\nmore-than-three-year low after the drugmaker forecast slower\nannual revenue growth.</p>\n<p>On the political front, Prime Minister <person>Keir Starmer</person> faces a\nbig test on Thursday when voters in <location value=\"LU/gb.eng.manchr\" idsrc=\"xmltag.org\" >Manchester</location> cast their\nballots for a new lawmaker in an election that polls say is too\nclose to call between the British leader's <org>Labour Party</org>,\npopulist Reform UK and the left-leaning Greens.\n(Reporting by Tharuniyaa Lakshmi in Bengaluru; Editing by <person>Leroy\nLeo</person> and <person>Andrew Heavens</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/international/202602261211RTRSNEWSCOMBINED_L6N3ZM113_1",
            "pub_date": "2026-02-27 01:11:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Penumbra Seen as 'Strategic and Financial Fit' for Boston Scientific, RBC Says",
            "description": "\n<p><chron>12:11 PM EST</chron>, <chron>02/26/2026</chron> (MT Newswires) -- Penumbra (PEN) is a strong &quot;strategic and financial&quot; fit for <org value=\"BSX.NaE\" idsrc=\"xmltag.org\" >Boston Scientific</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='BSX' fmr-param-security-type='Equity'>( BSX )</span>  and the pending merger is expected to support <org value=\"BSX.NaE\" idsrc=\"xmltag.org\" >Boston Scientific's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='BSX' fmr-param-security-type='Equity'>( BSX )</span> growth profile, <org>RBC Capital Markets</org> said.</p><p>The company's Q4 beat was driven by notable outperformance in embolization and access segments. Total revenue came in at about <money>$385 million</money>, up roughly 21% year on year. Adjusted EPS came in at <money>$1.18</money>, beating the consensus of <money>$1.11</money>, the brokerage said in a Wednesday note.</p><p>The investment firm expects 2026 adjusted EPS of <money>$5.19</money> and revenue of <money>$1.61 billion</money>.</p><p>RBC noted that Penumbra has a large addressable patient population for intervention and immersive health and it will continue to be a leader in the neurovascular segment.</p><p>The brokerage has a sector perform rating on the stock, with a <money>$374</money> price target.</p><p>Price: 339.99, Change: +1.32, Percent Change: +0.39</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602261211MIDNIGHTUSEQUITY_A3573850",
            "pub_date": "2026-02-27 01:11:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Snowflake Seen as 'AI Winner' as Companies Move More Data to AI Workflows, Wedbush Says",
            "description": "\n<p><chron>12:12 PM EST</chron>, <chron>02/26/2026</chron> (MT Newswires) -- Snowflake (SNOW) is seen as an &quot;AI winner&quot; as companies move more private and sensitive data into artificial intelligence workflows, which raises the need for data systems and can lift its core data warehouse usage, Wedbush said in a note Thursday.</p><p>Progress at Anthropic is being read the wrong way by the market, because better AI models can increase demand for data platforms that connect those models to governed company data, the investment firm said.</p><p>Snowflake's Q4 results backed that view, with total revenue of <money>$1.28 billion</money> and product revenue of <money>$1.23 billion</money>, up 30% from a year earlier, both above guidance and Street estimates, Wedbush said.</p><p>Backlog grew fast, with remaining performance obligations of <money>$9.772 billion</money>, up 42% from a year earlier, including a roughly <money>$400 million</money> deal and seven nine figure deals, Wedbush analysts noted.</p><p>Wedbush kept an outperform rating with a <money>$270</money> price target for Snowflake, citing better-than-expected fiscal 2027 outlook and about 27% higher product revenue forecast, helped by the Observe acquisition.</p><p>Price: 173.05, Change: +3.84, Percent Change: +2.27</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602261212MIDNIGHTUSEQUITY_A3573863",
            "pub_date": "2026-02-27 01:12:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Fed's Miran: Four quarter-point cuts still warranted this year, no \"all clear\" for job market",
            "description": "\n<p><location value=\"LU/us.dc.wash\" idsrc=\"xmltag.org\" >WASHINGTON</location>, <chron>Feb 26</chron> (Reuters) - Federal Reserve Governor <person>Stephen Miran</person> said strong job growth in January was &quot;a really good thing,&quot; but that the Fed should still cut a full percentage point from its policy rate this year because there were still risks to the labor market while inflation was no longer a problem.</p>\n<p>&quot;I think it's way too early to sort of sound an all clear that the labor market doesn't need more support from the Federal Reserve. I definitely think the labor market can be supported by the Federal Reserve further,&quot; with four cuts this year, Miran said on Fox Business's &quot;Mornings with Maria&quot;.</p>\n<p>&quot;I really do not think that we have an inflation problem,&quot; with recent inflation readings a percentage point above the Fed's target likely to slow.</p>\n<p></p>\n<p>(Reporting by <person>Howard Schneider</person>; Editing by <person>Chizu Nomiyama</person> )</p>\n",
            "link": "https://www.fidelity.com/news/article/us-economy/202602261004RTRSNEWSCOMBINED_KBN3PG1R3-OUSBS_1",
            "pub_date": "2026-02-26 23:04:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Corel Corporation Announces Strategic Transaction to Create Two Independent Companies",
            "description": "\n<p align=\"center\"><em><org>Vector Capital</org> to Acquire Corel’s Suite of Trusted Software Brands for Creativity and Productivity</em></p>  <p align=\"center\"><em>KKR to Retain Ownership of Parallels Business</em></p>  <p align=\"justify\"><location value=\"LU/ca.on.ottawa\" idsrc=\"xmltag.org\" >OTTAWA, Ontario</location>, <chron>Feb.  26, 2026</chron>  (GLOBE NEWSWIRE) -- <org>Corel Corporation</org> (“Corel”) today announced a definitive agreement that will separate its business into two independent companies. Under the terms of the definitive agreement, <org>Vector Capital Management, L.P.</org> (“Vector”), a leading private equity firm specializing in technology investments, will acquire Corel’s portfolio of creativity and productivity software and related brands. Parallels will remain under ownership of funds managed by KKR, a leading global investment firm. Financial terms of the transaction were not disclosed.</p>  <p align=\"justify\">Corel provides professional software for graphics, productivity, and digital workflow management, with a broad portfolio of desktop and digital tools, including trusted brands CorelDRAW, MindManager, and WinZip. The Parallels business offers cross-platform and virtualization software, including the well-known Parallels Desktop, enabling businesses and individuals to run Windows applications on Mac computers, and Parallels Workspace Solutions, delivering secure virtual applications and desktops across hybrid and cloud environments.</p>  <p align=\"justify\">By creating two independent organizations with dedicated teams and strategic focuses, Corel and Parallels will be best positioned to serve their respective customers and markets.</p>  <p align=\"justify\">Upon completion of the transaction, <person>Christa Quarles</person>, Chief Executive Officer of <org>Corel Corporation</org>, will continue to serve as Chief Executive Officer of Parallels and Prasannaa Ganesan, former Chief Operating Officer of Corel, will become Chief Executive Officer of Corel.</p>  <p align=\"justify\">“We are building on a strong year of growth at Parallels, with Parallels Workspace solutions delivering 49% net new annual recurring revenue growth in 2025, and Parallels Desktop now serving more than one million customers worldwide. Becoming an independent company will allow Parallels to sharpen our focus while continuing to deliver even greater value to our customers,” said <person>Christa Quarles</person>, Chief Executive Officer of Parallels. “I’m excited to work with our team to execute our strategy in this next phase.”</p>  <p align=\"justify\">“Corel has a strong portfolio of trusted and reliable software brands that enable its millions of users to create, ideate, and collaborate. We are excited to reunite with the Corel team and look forward to leveraging our deep familiarity with Corel’s business to drive growth through strategic M&amp;A, product innovation, and operational enhancement,” said <person>Alex Slusky</person>, Founding Partner of <org>Vector Capital</org>, which previously owned Corel and oversaw a significant period of operational development and strategic growth. “We are pleased to welcome Prasannaa back to the helm and are eager to work with him and Corel leadership to focus on disciplined execution, and long-term value creation opportunities.”</p>  <p align=\"justify\">“Corel has delighted and served its customers for decades, providing them with a differentiated portfolio of well-known and trusted software products that simply get the job done,” added Ganesan. “I am excited to return to Corel and to partner with Vector as we focus on supporting the company, building on its established foundation, and delivering reliable, high-quality professional software products to our global customer base.”</p>  <p align=\"justify\">The transaction is expected to close in <chron>May 2026</chron>, subject to customary closing conditions, including regulatory approvals.</p>  <p align=\"justify\"><org>Moelis &amp; Company LLC</org> served as lead financial advisor to Corel and <org>Kirkland &amp; Ellis LLP</org> as legal counsel in connection with the transaction. <org>Paul Hastings LLP</org> served as legal counsel to <org>Vector Capital</org>, with Alvarez &amp; Marsal serving as financial advisor.</p>  <p align=\"justify\"><strong>About Corel</strong><br/>Corel products enable knowledge workers around the world to do great work faster. Offering some of the industry's best-known software brands, we give individuals and teams the power to create, collaborate, and deliver impressive results. Our success is driven by an unwavering commitment to deliver a broad portfolio of innovative applications – including CorelDRAW, MindManager, and WinZip – to inspire users and help them achieve their goals. To learn more about Corel, please visit www.corel.com.</p>  <p><strong>About Parallels</strong></p>  <p align=\"justify\">Parallels is a global leader in cross-platform and virtualization solutions that make it simple for businesses and individuals to securely access applications and data on any device, anywhere.<br/><br/>Parallels operates two core businesses. Parallels Desktop enables individuals and organizations to run Windows applications on Mac computers, providing a seamless, native-like experience without changing devices or disrupting workflows. Parallels Workspace Solutions deliver simple, flexible, and secure virtual applications and desktops through Parallels RAS, Parallels DaaS, and Parallels Browser Isolation, offering a modern, cost-effective alternative to traditional VDI across hybrid and cloud environments.</p>  <p align=\"justify\">Together, Parallels helps customers reduce complexity, streamline IT operations, improve security, and deliver a seamless user experience across Windows, macOS, Linux, ChromeOS, iOS, Android, and the cloud and emerging application models. To learn more, visit www.parallels.com.</p>  <p align=\"justify\"><strong>About <org>Vector Capital</org></strong><br/><org>Vector Capital</org> is a leading, <location value=\"LU/us.ca.sanfrn\" idsrc=\"xmltag.org\" >San Francisco</location>-based investment firm focused on transformational investments in middle-market technology and technology-enabled businesses. Founded in 1997, Vector manages over <money>$4 billion</money> of capital across credit and private equity strategies on behalf of a high-quality group of global limited partners. For over 29 years, Vector has combined technology investments with operational transformation to deliver breakthrough results. For more information, visit www.vectorcapital.com.</p>  <p align=\"justify\"><strong>Media Contact</strong></p>  <p align=\"justify\">For Corel:<br/><person>Beatrice Vogel</person>, Director of Corporate Communications, beatrice.vogel@corel.com</p>  <p align=\"justify\">For <org>Vector Capital</org>:<br/><person>Nathaniel Garnick</person> / <person>Grace Cartwright</person><br/><org>Gasthalter &amp; Co.</org> <br/>(212) 257-4170<br/>vector@gasthalter.com</p>  <p align=\"justify\"><em>© 2026 <org>Corel Corporation</org>. All rights reserved. Corel, CorelDRAW, MindManager and WinZip are trademarks or registered trademarks of <org>Corel Corporation</org>. Parallels is a registered trademark of <org>Parallels International GmbH</org>. All other company, product and service names, logos, brands and any registered or unregistered trademarks mentioned are used for identification purposes only and remain the exclusive property of their respective owners. For all notices and legal information please visit </em><em>www.corel.com/en/legal-information/</em><em> and </em><em>www.parallels.com/about/legal/</em></p>  Image: https://www.globenewswire.com/newsroom/ti?nf=OTY2MjEzMSM3NDU2Nzc1IzIwOTI0ODk=  <br/> Image: https://ml.globenewswire.com/media/YTAxNmIzZjMtZDIyZi00NDE4LWI1YmYtMmU0ZTdhYjU0YmE5LTExMDQwNjAtMjAyNi0wMi0yNi1lbg==/tiny/Corel-Corporation.png <p> Image: Primary Logo </p>\nSource: <org>Corel Corporation</org>\n",
            "link": "https://www.fidelity.com/news/article/mergers-and-acquisitions/202602261200PRIMZONEFULLFEED9662131",
            "pub_date": "2026-02-27 01:00:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CricutÂ® Introduces the Next Generation of Creativity â Cricut Joyâ¢ 2 and Cricut ExploreÂ® 5",
            "description": "\n<p> Image: Explore 5 &amp; Joy 2 </p>  <p align=\"center\">A Media Snippet accompanying this announcement is available by clicking on this link.</p>  <p><location value=\"LU/us.ut.soudan\" idsrc=\"xmltag.org\" >SOUTH JORDAN, Utah</location>, <chron>Feb.  26, 2026</chron>  (GLOBE NEWSWIRE) -- Cricut®, Inc. is making personalization easier than ever with the introduction of two next-generation cutting machines: Cricut Joy™ 2 and Cricut Explore® 5. These machines represent the start of a new era for <org value=\"CRCT.NaE\" idsrc=\"xmltag.org\" >Cricut</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='CRCT' fmr-param-security-type='Equity'>( CRCT )</span> users, including a smaller, modern machine design, a dramatically simplified, guided software experience, and all the tools and materials needed to get started right in the box.</p>  <p><strong>Introducing Cricut Joy 2: Big Creativity, Small Footprint</strong><br/>Cricut Joy 2 is the next iteration of Cricut’s most compact cutting machine – it’s perfect for fast, fun, everyday projects like custom cards, labels, simple decals, and now, for the first time, full-color stickers thanks to its all-new Print Then Cut sensor.</p>  <p>Fitting in the palms of your hands, Cricut Joy 2 offers portability without compromise, enabling creativity in any space in your home. New bundles make it easy for crafters at every level to start making right away. Each bundle includes a cutting machine, popular materials, and essential tools, eliminating the guesswork of additional purchases and giving users everything needed to start — and keep — creating. With built-in savings, a simplified shopping experience, and the supplies to make up to 150 projects right out of the box*, it’s the best way to kickstart the creative journey with confidence and value.</p>  <p>Cricut Joy 2 will be offered in Blue, Coral, and an exclusive <person>Jade Green</person> color, available only at Michaels.</p>  <p><strong>Introducing Cricut Explore 5: More Compact and Made for Bigger Ideas</strong><br/>Cricut Explore 5 is the newest evolution of Cricut’s most popular cutting machine, redesigned to be <strong>30% more compact</strong> than the previous generation so it fits more naturally into modern homes — without sacrificing performance or capability.</p>  <p>Ideal for vinyl decals, custom apparel, full-color stickers, cards, and specialty projects like magnets and rubber stamps, Cricut Explore 5 is compatible with six tools* and features an improved writing and drawing experience with snap-in pen loading and a streamlined interface. Also available in new bundle options, crafters can choose the one that best fits their needs and be confident they'll have the supplies to hit the ground cutting.</p>  <p>Cricut Explore 5 will come in Taupe, and an exclusive Teal color available only at Michaels.</p>  <p>“<em>Our users have consistently told us they want products that are easier to use and more affordable. We listened and simplified the entire experience end-to-end,” </em>said <person>Ashish Arora</person>, CEO at <org value=\"CRCT.NaE\" idsrc=\"xmltag.org\" >Cricut</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='CRCT' fmr-param-security-type='Equity'>( CRCT )</span>.<em> “From the moment they open the box, everything required to be successful is included. We guide them through a reimagined onboarding and design experience with intuitive, guided flows that take the guesswork out of making and make it easier than ever to go from idea to finished project with confidence.” </em></p>  <p>“<em>At Michaels, we are passionate about inspiring creativity at every skill level, and our partnership with <org value=\"CRCT.NaE\" idsrc=\"xmltag.org\" >Cricut</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='CRCT' fmr-param-security-type='Equity'>( CRCT )</span> allows us to do just that in an exciting new way,</em>” said <person>Chuck Smith</person>, Senior Vice President and General Merchandise Manager at Michaels. “<em>We’re thrilled to collaborate on the launch of Cricut’s newest smart cutting machines—the Cricut Joy 2 and Cricut Explore 5—and to offer our customers exclusive colorways like the Jade Green Joy 2 and the Teal Explore 5, available only at Michaels. These machines combine innovation, ease of use, and style, and we can’t wait for our customers to bring their creative ideas to life with them.</em>”</p>  <p><strong>A Reimagined Design Experience</strong><br/>At the heart of this launch is a significantly enhanced Design Space platform — purpose‑built to reduce guesswork and help creators feel confident from the moment inspiration strikes.</p>  <p>New <strong>Guided Flows</strong> are designed to understand a user’s project intent—what they want to make—and provide step-by-step guidance to move from idea to finished project without confusion. Intuitive and contextual, the guided flows surface only what’s needed at each stage of the design process and help users understand exactly what materials, blanks, or tools are required.</p>  <p>Within guided flows, the Canvas is now automatically sized to reflect a user's selected project type, while <strong>Project Preview </strong>allows users to see their design on the intended blank (e.g., T-shirt, mug, phone case). These updates help give users confidence that their projects will turn out as desired.</p>  <p><org value=\"CRCT.NaE\" idsrc=\"xmltag.org\" >Cricut</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='CRCT' fmr-param-security-type='Equity'>( CRCT )</span> also introduced <strong>Create AI</strong>, a new feature in Design Space available only to paid subscribers that generates custom, cut-ready, single-layer AI designs. This allows users to turn their wildest ideas, like “a dinosaur with a unicorn horn riding a skateboard,” into project-ready artwork in seconds.</p>  <p>Together, these updates reinforce Cricut’s commitment to being the go-to creative platform where software and hardware work in harmony to support crafters at every stage of their journey while keeping the focus where it belongs: Creativity.</p>  <p><strong>Availability &amp; Pricing</strong><br/>Cricut Joy™ 2 and Cricut Explore® 5 will be available beginning <chron>February 27th</chron> in the U.S. and <location value=\"LC/ca\" idsrc=\"xmltag.org\" >Canada</location> at Cricut.com and Michaels, as well as in most international markets where <org value=\"CRCT.NaE\" idsrc=\"xmltag.org\" >Cricut</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='CRCT' fmr-param-security-type='Equity'>( CRCT )</span> is sold.*</p>  <p><strong>Price ranges:</strong><br/>Cricut Joy™ 2: <money>$99</money> – <money>$229 USD</money><br/>Cricut Explore 5®: <money>$199</money> – <money>$349 USD</money></p>  <p>For more information, visit www.cricut.com</p>  <p>*Product contents and colors vary by bundle; not available in all regions or all retailers. Specialty tools sold separately. Projects calculated based on 4 in x 6 in average size using included materials.</p>  <p><strong>About <org value=\"CRCT.NaE\" idsrc=\"xmltag.org\" >Cricut, Inc.</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='CRCT' fmr-param-security-type='Equity'>( CRCT )</span></strong><br/><org value=\"CRCT.NaE\" idsrc=\"xmltag.org\" >Cricut, Inc.</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='CRCT' fmr-param-security-type='Equity'>( CRCT )</span> is a creative platform company that makes it easy for users to create meaningful personal items. <org value=\"CRCT.NaE\" idsrc=\"xmltag.org\" >Cricut</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='CRCT' fmr-param-security-type='Equity'>( CRCT )</span> hardware and software work together as a connected platform for consumers to make beautiful, high-quality projects quickly and easily. These industry-leading products include a flagship line of smart cutting machines — the Cricut Maker® family, the Cricut Explore® family, and the Cricut Joy® family — accompanied by other unique tools like Cricut EasyPress®, the Infusible Ink™ system, and a diverse collection of materials. In addition to providing tools and materials, <org value=\"CRCT.NaE\" idsrc=\"xmltag.org\" >Cricut</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='CRCT' fmr-param-security-type='Equity'>( CRCT )</span> fosters a thriving community of millions of dedicated users worldwide.</p>  <p><strong>Press Contact</strong><br/>Cricut PR<br/>pr@cricut.com</p>  Image: https://www.globenewswire.com/newsroom/ti?nf=OTY2MTYwOCM3NDUyNDcxIzIyMDYzMzU=  <br/> Image: https://ml.globenewswire.com/media/ZDUxZDllZWUtMDQ4OS00NjA0LWEwNGItNjc2MGZhNzNhZTljLTEyMTc4ODgtMjAyNi0wMi0yNi1lbg==/tiny/Cricut-Inc-.png <p> Image: Primary Logo </p>\nSource: <org value=\"CRCT.NaE\" idsrc=\"xmltag.org\" >Cricut, Inc.</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='CRCT' fmr-param-security-type='Equity'>( CRCT )</span>\n",
            "link": "https://www.fidelity.com/news/article/technology/202602261200PRIMZONEFULLFEED9661608",
            "pub_date": "2026-02-27 01:00:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Research Alert: CFRA Upgrades Opinion On Shares Of Adss Of Iqiyi Inc. To Hold From Sell",
            "description": "\n<p><chron>11:45 AM EST</chron>, <chron>02/26/2026</chron> (MT Newswires) -- CFRA, an independent research provider, has provided MT Newswires with the following research alert. Analysts at CFRA have summarized their opinion as follows:</p><p>We upgrade our opinion to Hold from Sell as the recent share price decline has moved valuation to a fair level, in our view. We maintain our target price at <money>USD1.90</money>, implying a 2026 P/E of 18.4x (vs. 26x for its competitor, Netflix, and 24x for Bilibili). We think the discount is justified by its significantly weaker profitability with 1% operating margins, declining revenue trend in 2025, and heavy debt burden limiting financial flexibility. In 2025, revenue/non-GAAP net income of <money>CNY29.29B</money>/<money>CNY280M</money> came in higher than the consensus forecast of <money>CNY27.24B</money>/<money>CNY238M</money>. In Q4 2025, iQIYI showed sequential revenue stabilization but continued margin pressure, with total revenue growing 3% Y/Y to <money>CNY6.79B</money> after multiple quarters of decline. However, operating margins compressed significantly to 1% from 4% in the prior year. iQIYI increased content investments in Q4, with content costs rising 11% Y/Y to <money>CNY3.83B</money> to support a more robust original drama lineup. We keep our 2026 EPS at <money>CNY0.74</money> and set 2027 at <money>CNY1.01</money>.</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/investing-ideas/202602261145MIDNIGHTUSEQUITY_A3573871",
            "pub_date": "2026-02-27 00:45:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Research Alert: CFRA Maintains A Strong Buy Opinion On Shares Of Salesforce Inc.",
            "description": "\n<p><chron>11:55 AM EST</chron>, <chron>02/26/2026</chron> (MT Newswires) -- CFRA, an independent research provider, has provided MT Newswires with the following research alert. Analysts at CFRA have summarized their opinion as follows:</p><p>We cut our 12-month target price to <money>$240</money> from <money>$300</money> on lower revised P/E of about 16x our CY 27 EPS view, a deep discount to historical  averages. After better-than-expected Jan-Q results, we raise our FY 27 EPS estimate to <money>$13.19</money> from  <money>$12.90</money>  and FY 28 to <money>$14.77</money> from <money>$14.55</money>. We believe the market is overly focused on the deceleration in SF's legacy clouds while substantially underestimating the scale and velocity of its AI-driven Agentic Enterprise business. The current valuation at less than 14x reflects a high level of pessimism despite strong Agentforce growth and SF's attempt to support shares with a new <money>$50B</money> buyback. SF guides for a re-acceleration in organic subscription and support revenue growth in the 2H, with confidence based on Net New Average Order Value (NNAOV) growth outpacing AOV growth for the last two quarters (expected to continue in FY 27). The market  is not pricing in this scenario (we prefer to wait and see), but if it occurs, it will help support a re-rating in shares.</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/investing-ideas/202602261155MIDNIGHTUSEQUITY_A3573883",
            "pub_date": "2026-02-27 00:55:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Top Midday Stories: Nvidia Shares Fall After Earnings; Janus Henderson Receives Acquisition Offer From Victory",
            "description": "\n<p><chron>12:00 PM EST</chron>, <chron>02/26/2026</chron> (MT Newswires) -- The Nasdaq Composite fell 1.7% in late-morning trading Thursday, the S&amp;P 500 dropped 1%, and the Dow Jones Industrial Average eased 0.3% as <location>Wall Street</location> assessed results from <org value=\"NVDA.NaE\" idsrc=\"xmltag.org\" >Nvidia</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NVDA' fmr-param-security-type='Equity'>( NVDA )</span> .</p><p><org value=\"NVDA.NaE\" idsrc=\"xmltag.org\" >Nvidia</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NVDA' fmr-param-security-type='Equity'>( NVDA )</span> reported fiscal Q4 adjusted earnings late Wednesday of <money>$1.62</money> per diluted share, up from <money>$0.89</money> a year earlier and above the FactSet consensus estimate of <money>$1.54</money>. Revenue rose to <money>$68.13 billion</money> from <money>$39.33 billion</money>, topping the consensus of <money>$66.13 billion</money>. In Q1, the company expects revenue of <money>$78 billion</money>, plus or minus 2%. Analysts project <money>$72.93 billion</money>. The company is finalizing a partnership and investment deal with <org value=\"MSFT.NaE\" idsrc=\"xmltag.org\" >Microsoft</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='MSFT' fmr-param-security-type='Equity'>( MSFT )</span>-backed (MSFT) OpenAI, but there is no assurance that the transaction will be completed. <org value=\"NVDA.NaE\" idsrc=\"xmltag.org\" >Nvidia</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NVDA' fmr-param-security-type='Equity'>( NVDA )</span> shares fell 4.6% around midday, while <org value=\"MSFT.NaE\" idsrc=\"xmltag.org\" >Microsoft</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='MSFT' fmr-param-security-type='Equity'>( MSFT )</span> eased 0.3%.</p><p><org value=\"JHG.NaE\" idsrc=\"xmltag.org\" >Janus Henderson Group</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='JHG' fmr-param-security-type='Equity'>( JHG )</span>  was sent an acquisition offer from Victory Capital valued at <money>$57.04</money> per share, Victory said Thursday. The proposal includes <money>$30</money> in cash per share and a fixed exchange ratio of 0.350 Victory Capital shares based on its Wednesday closing price. Janus shares rose 5.7%.</p><p><org value=\"CRM.NaE\" idsrc=\"xmltag.org\" >Salesforce</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='CRM' fmr-param-security-type='Equity'>( CRM )</span>  reported fiscal Q4 adjusted earnings late Wednesday of <money>$3.81</money> per diluted share, up from <money>$2.78</money> a year earlier and above the FactSet consensus of <money>$3.05</money>. Revenue rose to <money>$11.2 billion</money> from <money>$9.99 billion</money>, topping the consensus of <money>$11.19 billion</money>. In Q1, the company expects adjusted EPS of <money>$3.11</money> to <money>$3.13</money> on revenue of <money>$11.03 billion</money> to <money>$11.08 billion</money>. Analysts project EPS of <money>$3.01</money> on revenue of <money>$11.01 billion</money>. <org value=\"CRM.NaE\" idsrc=\"xmltag.org\" >Salesforce</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='CRM' fmr-param-security-type='Equity'>( CRM )</span> shares rose 2.3%.</p><p>Suppliers to US aerospace and semiconductor firms are struggling with rare-earth shortages, particularly yttrium and scandium, which are vital for aerospace engines and chips and are almost entirely produced in <location value=\"LC/cn\" idsrc=\"xmltag.org\" >China</location>, Reuters reported. <org>GE Aerospace</org> (GE) shares fell 0.5%, RTX rose 1%, and <org value=\"HON.NaE\" idsrc=\"xmltag.org\" >Honeywell International</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='HON' fmr-param-security-type='Equity'>( HON )</span>  eased 0.2%.</p><p><org value=\"F.NaE\" idsrc=\"xmltag.org\" >Ford Motor</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='F' fmr-param-security-type='Equity'>( F )</span>  will provide an over-the-air update to a lighting system software glitch that led to the recall of almost 4.4 million vehicles. The company said clients could also visit a Ford dealer to fix the issue. Ford shares rose 0.7%.</p><p><org value=\"NEE.NaE\" idsrc=\"xmltag.org\" >NextEra Energy</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NEE' fmr-param-security-type='Equity'>( NEE )</span>  plans to sell <money>$2 billion</money> of equity units in a public offering. NextEra shares fell 1.4%.</p><p>Price: 186.67, Change: -8.96, Percent Change: -4.58</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/international/202602261200MIDNIGHTUSEQUITY_A3573866",
            "pub_date": "2026-02-27 01:00:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "TKF Burnside Real Estate Partners Announces Acquisition of White Plains Office Property",
            "description": "\n<p class=\"bwalignc\">\n<i>The purchase marks <location value=\"LU/us.ny.broeld\" idsrc=\"xmltag.org\" >Brookfield</location> veterans <person>Ric Clark</person> and Dennis Friedrich’s second acquisition under the newly founded firm</i>\n\n</p>\n<p>    <location value=\"LU/us.ny.nyc\" idsrc=\"xmltag.org\" >NEW YORK</location>--(BUSINESS WIRE)--\n<org>TKF Burnside Real Estate Partners</org>, the real estate investment and operating company founded by <person>Ric Clark</person> and <person>Dennis Friedrich</person>, announced it has acquired <location>360 Hamilton Avenue</location>, a 400,000 rentable square foot Class A office property located in <location value=\"LU/us.ny.whiins\" idsrc=\"xmltag.org\" >White Plains, NY</location>. <person>Dave Hou</person> of TKF Burnside represented the company in the transaction. <person>Kevin Welsh</person> and <person>Charles Han</person> of Newmark represented the undisclosed sellers, and <person>Chris Kramer</person> and <person>Tim Polglase</person> of Newmark represented TKF Burnside on the acquisition financing.\n\n</p><p id=\"news-body-cta\">This press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20260226498675/en/</p><p>\nThe property, conveniently located within short walking distance to the <location>White Plains Metro-North Station</location> and the city’s top restaurants, shopping and robust social scene, currently houses <org>Merrill Lynch, Skadden, Arps, Slate, Meagher &amp; Flom LLP</org>, <org>Heineken USA</org>, and Bank of America among other top-tier tenants. TKF Burnside plans to modernize and enhance the existing hospitality-level amenity offerings, supporting the building’s tenants in attracting and retaining top talent.\n\n</p><p>\n“As the <location value=\"LU/us.ny.nyc\" idsrc=\"xmltag.org\" >New York City</location> office market continues to rebound in a meaningful way, we’ve seen the momentum spread to the near-in business districts,” said <person>Ric Clark</person>, co-founder of TKF Burnside. “Office demand is evolving but one principal remains: companies follow talent and talent follows vibrant, connected communities. <location value=\"LU/us.ny.whiins\" idsrc=\"xmltag.org\" >White Plains</location> – with a rapidly expanding residential base and the restaurants, social energy, walkability and affordability that today’s workforce demands – is exactly where modern companies want to be and a great place to invest.”\n\n</p><p>\nWith this acquisition – the second in just over a year for the firm – TKF Burnside’s portfolio now spans nearly one million square feet across the greater <location value=\"LU/us.ny.nyc\" idsrc=\"xmltag.org\" >New York</location> metropolitan area.\n\n</p><p>\n“The acquisition of 360 Hamilton marks an important milestone in the growth of TKF Burnside’s investment and operating platform, building on the momentum of our recent acquisition of 1000 Woodbury on <location>Long Island</location>,” said <person>Dennis Friedrich</person>, co-founder of TKF Burnside. “This property strongly aligns with our strategy of investing in high-quality, amenitized assets located in dynamic, transit-oriented markets, whether that’s Manhattan’s central business district or a growing inner suburban market like <location value=\"LU/us.ny.whiins\" idsrc=\"xmltag.org\" >White Plains</location>, the central commercial hub of <location value=\"LU/us.ny.weheer\" idsrc=\"xmltag.org\" >Westchester County</location> and one of the shortest one-seat train rides into the Grand Central area.”\n\n</p><p>\n<b>About TKF Burnside\n<br /></b><org>TKF Burnside Real Estate Partners</org> is an accomplished real estate investment and operating company led by <person>Ric Clark</person> and <person>Dennis Friedrich</person>, both former C-suite executives and long-time colleagues at <location value=\"LU/us.ny.broeld\" idsrc=\"xmltag.org\" >Brookfield</location>, who together previously managed one of the largest global real estate portfolios (<money>$200B</money> AUM). With over 65+ years of combined experience and expertise, they operated, repositioned and developed iconic properties across a broad range of asset classes in five continents. TKF Burnside’s investment strategy is to acquire high-quality or high-potential undercapitalized and underperforming real estate assets with a focused turnaround strategy to enhance value and achieve outperformance within the office, multifamily, retail and mixed-use sectors.\n\n</p><p><img alt=\"\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20260226498675r1&amp;sid=acqr8&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\" /><span class=\"bwct31415\" /></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\">https://www.businesswire.com/news/home/20260226498675/en/</span></p>\n<p>Source: <org>TKF Burnside Real Estate Partners</org></p>\n",
            "link": "https://www.fidelity.com/news/article/mergers-and-acquisitions/202602261200BIZWIRE_USPR_____20260226_BW498675",
            "pub_date": "2026-02-27 01:00:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Fractional AI Announces Acquisition of Fabius",
            "description": "\n<div class=\"xn-content\">\n<p><span class=\"legendSpanClass\"><location value=\"LU/us.ca.sanfrn\" idsrc=\"xmltag.org\" >SAN FRANCISCO</location></span>, <span class=\"legendSpanClass\"><chron>Feb. 26, 2026</chron></span> /PRNewswire/ -- Fractional AI, the leader in applied AI, today announced its acquisition of Fabius, a Y-Combinator startup focused on automating sales and operational workflows using AI.</p>\n    <div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder1\">\n                <p>\n\n                    <img src=\"https://mma.prnewswire.com/media/2871189/Fractional_AI_Logo_Large.jpg\" title=\"Fractional AI Logo (PRNewsfoto/Fractional AI)\" alt=\"Fractional AI Logo (PRNewsfoto/Fractional AI)\" />\n\n                </p>\n    </div>\n<p>As enterprise demand for production AI systems continues to accelerate, Fractional AI has experienced rapid growth partnering with the world's largest PE firms to transform their portfolio companies with bespoke AI software. The acquisition strengthens Fractional's position as the fastest growing AI-native service provider.</p><p>\"At Fractional, we build AI systems that integrate into how businesses actually run to drive real impact,\" said Chris <span>Taylor, co-founder and CEO of Fractional AI</span>. \"Fabius shares that mindset, and together we're expanding the scope and scale of what we can deliver to our clients.\"</p><p>Founded in 2020 and part of YC's Winter 2023 cohort, Fabius brings deep experience applying early advances in generative and embedding-based models to real-world services workflows, complementing Fractional's execution-led approach to designing AI systems that deliver measurable business outcomes.</p><p>\"At Fabius, we saw that the most impactful AI systems are those built directly into how a company delivers its core offering,\" said <person>Neil Madsen</person>,<span> co-founder and CEO of Fabius</span>. \"Fractional shares that philosophy of translating AI into durable operational advantage. We're excited to help scale that impact.\"</p><p><b>About Fractional AI</b></p><p>Fractional AI builds custom generative AI solutions that help companies move from experimentation into production. An OpenAI partner, Fractional AI works with enterprises and private equity-backed companies to design and deploy applied AI systems that integrate into real workflows, support critical decisions, and create lasting competitive advantage</p>\n\n\n\n<p id=\"PURL\"><img title=\"Cision\" width=\"12\" height=\"12\" alt=\"Cision\" src=\"https://edge.prnewswire.com/c/img/favicon.png?sn=SF96072&amp;sd=2026-02-26\" /> View original content to download multimedia:https://www.prnewswire.com/news-releases/fractional-ai-announces-acquisition-of-fabius-302697651.html</p><p>SOURCE Fractional AI</p></div>\n",
            "link": "https://www.fidelity.com/news/article/mergers-and-acquisitions/202602261200PR_NEWS_USPR_____SF96072",
            "pub_date": "2026-02-27 01:00:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "LoanBud Launches AI-Powered Platform to Verify SBA Financeability Before Businesses Go to Market",
            "description": "\n<div class=\"xn-content\">\n<p class=\"prntac\"><b><i>AI-powered intake and human review surface SBA eligibility issues early, reducing deal risk and delays</i></b></p><p><span class=\"legendSpanClass\"><location value=\"LU/us.ny.nyc\" idsrc=\"xmltag.org\" >NEW YORK</location></span>, <span class=\"legendSpanClass\"><chron>Feb. 26, 2026</chron></span> /PRNewswire/ -- LoanBud, a financial technology company modernizing access to <org>Small Business Administration</org> (SBA) financing, today announced the launch of its <b>LoanBud Prequalification Platform (LoanBud.io)</b>, a first-of-its-kind solution that prequalifies businesses for SBA financing prior to listing—bringing financing validation to the start of the sale process instead of the end.</p>\n    <div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder1\">\n                <p>\n\n                    <img src=\"https://mma.prnewswire.com/media/2841865/LoanBud_Logo.jpg\" title=\"LoanBud (PRNewsfoto/LoanBud)\" alt=\"LoanBud (PRNewsfoto/LoanBud)\" />\n\n                </p>\n    </div>\n<p>Financing uncertainty is one of the most common reasons small business acquisition deals slow down, retrade, or collapse. LoanBud's Prequalification Platform moves SBA eligibility upstream by combining structured document intake with AI-assisted analysis to quickly identify whether a business is likely to qualify for SBA financing and to estimate potential loan capacity for qualified buyers.</p><p>\"Too often, financing is introduced after the deal momentum is already built, and that's when surprises show up,\" said Burke Purcell, CEO of LoanBud. \"The LoanBud Prequalification Platform brings structure, speed, and transparency to the front end of the process so brokers, sellers, and buyers can invest time and resources with greater confidence.\"</p><p>LoanBud's software combines structured intake, optical character recognition (OCR), and AI-assisted analysis to accelerate early-stage diligence. Sellers and brokers upload tax returns, financial statements and the confidential information memorandum (CIM). The platform extracts key data, flags missing items and inconsistencies, and helps LoanBud's SBA financing team complete an initial eligibility review more efficiently.</p><p>Product features include:</p><ul type=\"disc\"><li>Guided document checklist that keeps sellers and brokers on track and reduces back-and-forth.</li><li>OCR-powered extraction from tax returns, profit-and-loss statements, balance sheets and deal documents to accelerate early diligence.</li><li>AI-assisted CIM review that summarizes the business model, key risks and transferability considerations.</li><li>Automated first-pass financial spread and cash-flow normalization to support SBA sizing discussions.</li><li>Deal Readiness Report that flags gaps (missing financials, debt schedule issues, inconsistencies) with clear next steps.</li></ul><p>Most submissions receive an initial determination within one to two business days, along with structured feedback and key conditions, subject to buyer qualifications and lender underwriting. Updated financial statements may be requested periodically. Rather than waiting for a buyer to initiate underwriting, sellers can address financeability questions upfront, allowing listings to enter the market with more certainty and fewer unexpected issues.</p><p>The platform also provides brokers with a centralized workspace to manage listings end to end, including secure document uploads, real-time visibility into prequalification status and a structured workflow to keep deals moving. Once a business is prequalified, the broker receives a unique application URL to share with interested buyers. Buyers can then apply for financing tied to that specific business, and LoanBud routes the request through its SBA lender partner network.</p><p>To learn more or submit a business listing for prequalification, visit <b>LoanBud.io</b>.</p><p><b>About LoanBud<br /></b>LoanBud is a financial technology platform modernizing access to SBA financing for small business acquisitions, expansion, working capital, and owner-occupied commercial real estate. Through its national marketplace of 50+ SBA lenders and proprietary prequalification infrastructure, LoanBud helps entrepreneurs, brokers, and sellers navigate SBA-backed transactions with greater clarity and efficiency. LoanBud is not a lender; it operates a marketplace that connects buyers and sellers with SBA lenders through its network of approved lenders. Learn more at <b>LoanBud.io</b>.</p>\n\n\n\n<p id=\"PURL\"><img title=\"Cision\" width=\"12\" height=\"12\" alt=\"Cision\" src=\"https://edge.prnewswire.com/c/img/favicon.png?sn=NY96829&amp;sd=2026-02-26\" /> View original content to download multimedia:https://www.prnewswire.com/news-releases/loanbud-launches-ai-powered-platform-to-verify-sba-financeability-before-businesses-go-to-market-302698649.html</p><p>SOURCE LoanBud</p></div>\n",
            "link": "https://www.fidelity.com/news/article/technology/202602261137PR_NEWS_USPR_____NY96829",
            "pub_date": "2026-02-27 00:37:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "eClinical Solutions Highlights 2025 Achievements and Announces Latest Innovations to Accelerate and Future-Proof Clinical Trials",
            "description": "\n<p class=\"bwalignc\">\n<i>Working with top global pharmaceutical sponsors, company doubles down on agentic AI and RBQM investments to bend the clinical development efficiency curve</i>\n\n</p>\n<p>    <location value=\"LU/us.ma.boston\" idsrc=\"xmltag.org\" >BOSTON</location>--(BUSINESS WIRE)--\neClinical <org>Solutions LLC</org>, a global provider of digital clinical software and services, today announced 2025 milestones along with new 2026 innovation to support the end-to-end clinical research lifecycle, bringing breakthrough therapies to patients faster. Last year the company added over 20 net new customers to its portfolio of biopharma and CRO clients, which now includes 18 of the top 50 pharmaceutical companies in the world, supporting clinical trial leaders with an AI-first, risk-based approach.\n\n</p><p>\nNotably, eClinical Solutions focused on evolving elluminate as a clinical data intelligence platform to improve trial efficiency, debuting elluminate agents. The agents are fueled by data products with shared context and workflows with agentic, assistive, and task-oriented AI, and a data foundation with grounding guardrails and policies. Additionally, the company launched a digitized Integrated Data Review Plan (IDRP), positioning eClinical Solutions as the first company to centralize digital data review within a single platform, and announced an industry collaboration with ZS, pairing eClinical Solutions’ elluminate RBQM (risk-based quality management) technology with ZS’ RBQM consulting and custom-built solution expertise to create a unified integrated quality risk management (IQRM) experience for sponsors.\n\n</p><p>\nOther key company highlights from 2025 included industry recognition in Everest Group's Tech Provider Spotlight: Risk-Based Quality Management (RBQM) report, highlighting eClinical Solutions’ elluminate RBQM capabilities. eClinical Solutions also won the 2025 <org>Top Workplace USA</org> Award: Remote Work and the 2025 Top Workplaces Culture Excellence Award: Work-Life Flexibility, for the fourth consecutive year. Finally, the <org>Society for Clinical Data Management</org> (SCDM) awarded eClinical Solutions with the SCDM Innovation Award for Advancements in Health Insight Generation and elected <person>Dawn Kaminski</person>, Vice President of Business Development Operations at eClinical Solutions as Executive Secretary of the <org>SCDM Board</org> for 2026.\n\n</p><p>\nBuilding on 2025 momentum, the company has unveiled new updates to the elluminate platform this year aimed at supporting sponsors’ objectives - from ensuring ease of compliance with the revised ICH E6 R(3) guidelines to expanding agentic AI efficiencies:\n\n</p><ul class=\"bwlistdisc\">\n<li>\n<b>Agentic data review automation:</b> The Explain Agent in Data Central uses clinical data and protocol-aware intelligence to interpret charts in real time, highlight meaningful patterns, and recommend next steps, eliminating hours of manual navigation by delivering instant, explainable insights where reviewers work.\n\n</li>\n<li>\n<b>End-to-end RBQM traceability:</b> RACT integration into review objectives plus RBQM Snapshots to preserve evidence over time, improve audit readiness, and strengthen follow-up execution.\n\n</li>\n<li>\n<b>Faster, more consistent RBQM setup: </b>Study-level RBQM configuration with linkage to global KRIs/QTLs and the ability to auto-pull KRIs/QTLs from RACT, reducing manual effort and accelerating study startup.\n\n</li>\n<li>\n<b>Guided centralized monitoring experience</b>: In-context KRI/QTL/risk signal review - thresholds, recommendations, related observations - directly from the RBQM Overview to drive faster, more consistent decisions.\n\n</li>\n<li>\n<b>Agentic SDTM mapping automation from spec to executable code</b>: Automated and agentic-AI-powered specification generation, plus transparent code generation - Python/R/SAS - with traceability from spec through execution logs to accelerate submission-ready datasets.\n\n</li>\n</ul><p>\n“Insight from clients and partners at ENGAGE 2025 and the data from our 2025 <org>Industry Outlook Survey</org> reaffirmed our conviction of creating a strong data intelligence foundation through the elluminate platform that elicits scalable innovation, from embedding intelligence to risk-based approaches,” said Raj Indupuri, CEO and co-founder of eClinical Solutions. “As we look at our next phase of growth, we’re hyper-focused on driving return on investment for our clients and leaning into agentic AI in 2026, for the next era of clinical trial automation.”\n\n</p><p>\n<b>About eClinical <org>Solutions LLC</org>\n<br /></b>eClinical Solutions’ industry-leading clinical data intelligence platform, elluminate<sup>®</sup>, and biometrics services experts help biopharma researchers at large, mid-size, and emerging life sciences organizations develop tomorrow’s breakthroughs with today’s resources. eClinical is a privately-held, purpose-driven company with a global workforce and winner of the 2025 <org>Top Workplace USA</org> Award: Remote Work, the 2025 Top Workplaces Culture Excellence Award: Work-Life Flexibility, and Great Place To Work<sup>®</sup> India Certification™. Learn more at www.eclinicalsol.com and follow eClinical Solutions on LinkedIn.\n\n</p><p><img alt=\"\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20260226417788r1&amp;sid=acqr8&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\" /><span class=\"bwct31415\" /></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\">https://www.businesswire.com/news/home/20260226417788/en/</span></p>\n<p>Source: eClinical <org>Solutions LLC</org></p>\n",
            "link": "https://www.fidelity.com/news/article/technology/202602261140BIZWIRE_USPR_____20260226_BW417788",
            "pub_date": "2026-02-27 00:40:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Research Alert: CFRA Maintains Hold Opinion On Shares Of Pinnacle West Capital Corporation",
            "description": "\n<p><chron>09:35 AM EST</chron>, <chron>02/26/2026</chron> (MT Newswires) -- CFRA, an independent research provider, has provided MT Newswires with the following research alert. Analysts at CFRA have summarized their opinion as follows:</p><p>Following PNW's Q4 earnings print, we adjust our 12-month target to <money>$105</money> from <money>$100</money>, valuing shares at 18x our 2027 EPS outlook of <money>$5.83</money> (2026 EPS view reiterated at <money>$4.69</money>). In Q4, PNW benefited from robust economic activity in <location value=\"LS/us.az\" idsrc=\"xmltag.org\" >Arizona</location>, posting 5% weather-normalized retail sales growth and 2.4% customer growth in 2025, with commercial and industrial sales demonstrating particular strength at 7.5% growth led by new manufacturing facilities and data center development. An exceptionally hot summer drove APS to set three all-time peak demand records, with system peak demand rising over 5% to 8.6GW. Looking ahead, the pending 2025 APS rate case represents a critical catalyst, as PNW seeks a <money>$580M</money> sales increase and 10.70% authorized ROE while proposing a Formula Rate Adjustment Mechanism that would enable more timely rate updates to address historical regulatory lags, with new rates expected in the second half of 2026. PNW's <money>$10.35B</money> capital investment plan aims to capture substantial load growth opportunities.</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/investing-ideas/202602260935MIDNIGHTUSEQUITY_A3573639",
            "pub_date": "2026-02-26 22:35:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Nutanix's AMD Partnership Likely Sets Valuation Floor, Morgan Stanley Says",
            "description": "\n<p><chron>11:40 AM EST</chron>, <chron>02/26/2026</chron> (MT Newswires) -- <org value=\"NTNX.NaE\" idsrc=\"xmltag.org\" >Nutanix's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NTNX' fmr-param-security-type='Equity'>( NTNX )</span>  <money>$250 million</money> investment and partnership with <org value=\"AMD.NaE\" idsrc=\"xmltag.org\" >Advanced Micro Devices</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AMD' fmr-param-security-type='Equity'>( AMD )</span>  to build an edge inference solution could set a floor on valuation, Morgan Stanley said in a note Thursday.</p><p>While the commercial impact is several quarters away, a strategic equity investment at about <money>$36</money> likely signals a floor on valuation despite the limited revenue visibility, the report said.</p><p>The note also pointed to supply-chain issues on CPU availability and higher memory prices that impacted customers' ability to procure servers towards the second-half of Q2.</p><p>That led the company to cut its revenue growth expectations while Q2 revenue came in ahead of market expectations, it said.</p><p>&quot;While revenue gets pushed out, bookings growth is sustaining in the mid-teens and new customer acquisition remains robust,&quot; the report said.</p><p>Morgan Stanley cut its price target to <money>$53</money> from <money>$56</money> while maintaining its equal weight rating on <org value=\"NTNX.NaE\" idsrc=\"xmltag.org\" >Nutanix</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NTNX' fmr-param-security-type='Equity'>( NTNX )</span>.</p><p>Price: 40.12, Change: +1.68, Percent Change: +4.36</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602261140MIDNIGHTUSEQUITY_A3573816",
            "pub_date": "2026-02-27 00:40:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Market Chatter: PayPal Not Currently in Talks to be Acquired by Stripe",
            "description": "\n<p><chron>11:41 AM EST</chron>, <chron>02/26/2026</chron> (MT Newswires) -- <org value=\"PYPL.NaE\" idsrc=\"xmltag.org\" >PayPal Holdings</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='PYPL' fmr-param-security-type='Equity'>( PYPL )</span>  is not currently holding talks to sell itself to Stripe or any other company, Semafor reported Thursday, citing people familiar with the matter.</p><p>The report said <org value=\"PYPL.NaE\" idsrc=\"xmltag.org\" >PayPal</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='PYPL' fmr-param-security-type='Equity'>( PYPL )</span> has been working for months with bankers to brace for the possibility of activist pressure or an unsolicited takeover approach.</p><p><org value=\"PYPL.NaE\" idsrc=\"xmltag.org\" >PayPal</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='PYPL' fmr-param-security-type='Equity'>( PYPL )</span> didn't immediately reply to a request for comment from MT Newswires.</p><p>(Market Chatter news is derived from conversations with market professionals globally. This information is believed to be from reliable sources but may include rumor and speculation. Accuracy is not guaranteed.)</p><p>Price: 45.55, Change: -1.75, Percent Change: -3.69</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602261141MIDNIGHTUSEQUITY_A3573845",
            "pub_date": "2026-02-27 00:41:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Warner Bros' TV decline puts pressure on Netflix deal",
            "description": "\n<p>*</p>\n<p><org>Warner Bros'</org> TV revenue and income decline significantly</p>\n<p></p>\n<p>*</p>\n<p>Discovery Global's standalone value impacted by revenue\nand\nincome drop</p>\n<p></p>\n<p>*</p>\n<p><org value=\"NFLX.NaE\" idsrc=\"xmltag.org\" >Netflix</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NFLX' fmr-param-security-type='Equity'>( NFLX )</span> has four days to revise offer if <org>Paramount's</org> bid\nis\nfavored</p>\n<p></p>\n<p>*</p>\n<p><org>Warner Bros</org> adds 3.5 million streaming subscribers in Q4</p>\n<p>(Adds conference call details, bullets)</p>\n<p>By <person>Dawn Chmielewski</person></p>\n<p><chron>Feb 26</chron> (Reuters) -</p>\n<p><org value=\"WBD.NaE\" idsrc=\"xmltag.org\" >Warner Bros Discovery</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='WBD' fmr-param-security-type='Equity'>( WBD )</span> heaped an additional burden on\n<org value=\"NFLX.NaE\" idsrc=\"xmltag.org\" >Netflix's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NFLX' fmr-param-security-type='Equity'>( NFLX )</span> <money>$82.7 billion</money> bid for the movie studio and\nHBO.</p>\n<p>The entertainment company behind the buzzy series &quot;Heated\nRivalry&quot; and the film &quot;<location>Wuthering Heights</location>&quot; reported\nfourth-quarter earnings Thursday that showed profit at its cable\nchannels is deteriorating at a fast pace.</p>\n<p>The networks, which include CNN, the Discovery Network and\nTNT, are not part of</p>\n<p><org value=\"NFLX.NaE\" idsrc=\"xmltag.org\" >Netflix's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NFLX' fmr-param-security-type='Equity'>( NFLX )</span> deal</p>\n<p>. But their worth as a separately traded company is a key\ncomponent in valuing the streaming service's offer for the\n<org>Warner Bros</org> film and TV studios, its library, HBO and the HBO\nMax streaming service.</p>\n<p>Rival <org value=\"PSKY.NaE\" idsrc=\"xmltag.org\" >Paramount Skydance</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='PSKY' fmr-param-security-type='Equity'>( PSKY )</span></p>\n<p>raised its proposal</p>\n<p>to buy all of <org>Warner Bros</org> to <money>$110 billion</money>. On Tuesday, the\nWarner board said it is negotiating with the rival bidder to\ndetermine whether the revised proposal could result in a deal\nsuperior to <org value=\"NFLX.NaE\" idsrc=\"xmltag.org\" >Netflix's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NFLX' fmr-param-security-type='Equity'>( NFLX )</span> offer.</p>\n<p><org>Warner Bros</org> Chief Executive <person>David Zaslav</person> did not address the\ndiscussions on a call with investors Thursday. Instead, he\nhighlighted his role in sparking a bidding war for the coveted\nassets.</p>\n<p>&quot;We engaged with four bidders, which led to eight price\nincreases, and have thus far achieved a 63% increase in value\nversus the first offer received in September, delivering\nsignificant value to WBD shareholders throughout the process,&quot;\nZaslav told investors.</p>\n<p>Warner's board had previously determined <org value=\"NFLX.NaE\" idsrc=\"xmltag.org\" >Netflix's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NFLX' fmr-param-security-type='Equity'>( NFLX )</span> offer was\nsuperior to <org>Paramount's</org> because investors would also receive the\nvalue of its planned spin-off of the television group, Discovery\nGlobal.\nThe division's revenue fell to <money>$4.2 billion</money>, down 12% from a\nyear earlier, and adjusted income dropped to <money>$1.4 billion</money>, a 27%\nplunge from the same quarter a year earlier. Such declines\naffect the value of the TV networks as a standalone business,\nDiscovery Global.</p>\n<p>Its</p>\n<p>closest comparison</p>\n<p>is Versant Media, the cable and digital assets separated\nfrom <org value=\"CMCSA.NaE\" idsrc=\"xmltag.org\" >Comcast</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='CMCSA' fmr-param-security-type='Equity'>( CMCSA )</span> earlier this year. Versant's enterprise is worth\nroughly 3 times its 2025 forecast EBITDA of <money>$2.1 billion</money>. On the\nsame yardstick, Discovery Global's market capitalization would\nbe approximately <money>$3 billion</money> or a little over <money>$1</money> per share,\nassuming <money>$17 billion</money> in net debt.</p>\n<p>Add that to <org value=\"NFLX.NaE\" idsrc=\"xmltag.org\" >Netflix's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NFLX' fmr-param-security-type='Equity'>( NFLX )</span> cash offer of <money>$27.75</money> per share and it\ncomes in shy of <org>Paramount's</org> bid of <money>$31</money>.</p>\n<p>Warner CFO <person>Gunnar Wiedenfels</person> declined to address that\ncomparison. <org value=\"NFLX.NaE\" idsrc=\"xmltag.org\" >Netflix</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NFLX' fmr-param-security-type='Equity'>( NFLX )</span> did not immediately reply to a request for\ncomment.\nHBO Max continued to grow, helped by series like &quot;Heated\nRivalry&quot; and &quot;It: Welcome to Derry.&quot; <org>Warner Bros</org> added 3.5\nmillion streaming subscribers in the quarter, bringing its total\nnumber worldwide to 131.6 million.</p>\n<p>The streaming group's revenue rose 5% to nearly <money>$2.8\nbillion</money>, but adjusted earnings fell 4% to <money>$393 million</money> due to\nthe end of an unspecified distribution deal.</p>\n<p>&quot;The best thing for WBD shareholders is that it is being\nsold, because its fundamentals continue to deteriorate,&quot; wrote\nNeedham &amp; Co senior research analyst <person>Laura Martin</person>.</p>\n<p>Warner's stock was largely unchanged in early morning\ntrading.\nZaslav also highlighted the success of the <org>Warner Bros</org> film\nslate, including &quot;<location>Wuthering Heights</location>,&quot; &quot;A Minecraft Movie&quot; and\n&quot;Superman.&quot;\n&quot;We love the motion picture business,&quot; Zaslav said on the call.\n&quot;We at the company believe so deeply in the motion picture\nbusiness, putting movies on the screen for shared experience ...\nOur commitment to the motion picture business is the core of our\ncompany.&quot;</p>\n<p><org value=\"NFLX.NaE\" idsrc=\"xmltag.org\" >Netflix</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NFLX' fmr-param-security-type='Equity'>( NFLX )</span> Chief Executive <person>Ted Sarandos</person> has defended his deal\nfor the studio and HBO by affirming his commitment to</p>\n<p>releasing movies in theaters</p>\n<p>, a strategy that was never part of <org value=\"NFLX.NaE\" idsrc=\"xmltag.org\" >Netflix's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NFLX' fmr-param-security-type='Equity'>( NFLX )</span> DNA.</p>\n<p>Should <org>Warner Bros</org> board declare that <org>Paramount's</org> deal is\nsuperior, <org value=\"NFLX.NaE\" idsrc=\"xmltag.org\" >Netflix</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NFLX' fmr-param-security-type='Equity'>( NFLX )</span> has four business days to revise its offer.\n(Reporting by <person>Dawn Chmielewski</person> in <location value=\"LU/us.ca.losang\" idsrc=\"xmltag.org\" >Los Angeles</location> and <person>Harshita Mary\nVarghese</person> in Bengaluru; Editing by <person>Jennifer Saba</person>, <person>Edwina Gibbs</person>\nand <person>Nick Zieminski</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602261127RTRSNEWSCOMBINED_L6N3ZM0X2_1",
            "pub_date": "2026-02-27 00:27:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        }
    ]
}