{
    "data": [
        {
            "title": "Sector Update: Financial Stocks Fall in Afternoon Trading",
            "description": "\n<p><chron>02:01 PM EST</chron>, <chron>02/27/2026</chron> (MT Newswires) -- Financial stocks declined in Friday afternoon trading, with the NYSE Financial Index dropping 2.1% and the State Street Financial Select Sector SPDR ETF (XLF) falling 2.5%.</p><p>The Philadelphia Housing Index was climbing 1%, and the State Street Real Estate Select Sector SPDR ETF (XLRE) was up 0.6%.</p><p>Bitcoin (BTC-USD) was falling 2.6% to <money>$65,473</money>, and the yield for 10-year US Treasuries was dropping to around 3.97%.</p><p>In economic news, the US Producer Price Index rose by 0.5% in January following a 0.4% increase in December, according to the <org>Bureau of Labor Statistics</org> on Friday, above the 0.3% gain expected in a <org>Bloomberg</org> survey. After excluding the more volatile food and energy prices, core PPI rose by 0.8%, more than the 0.3% gain anticipated and following a 0.6% jump in the previous month.</p><p>In corporate news, Market Financial Solutions, the failed UK mortgage firm backed by <org value=\"BCS.NaE\" idsrc=\"xmltag.org\" >Barclays</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='BCS' fmr-param-security-type='Equity'>( BCS )</span> , <org value=\"APO.NaE\" idsrc=\"xmltag.org\" >Apollo Global Management's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='APO' fmr-param-security-type='Equity'>( APO )</span>  <org>Atlas SP Partners</org>, <org value=\"JEF.NaE\" idsrc=\"xmltag.org\" >Jefferies Financial</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='JEF' fmr-param-security-type='Equity'>( JEF )</span>  and others, may have a 930-million-pound (<money>$1.3 billion</money>) collateral shortfall for its loans, <org>Bloomberg</org> reported, citing documents from Zircon Bridging and Amber Bridging it obtained. <org value=\"BCS.NaE\" idsrc=\"xmltag.org\" >Barclays</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='BCS' fmr-param-security-type='Equity'>( BCS )</span> shares fell 4%, Apollo slumped past 8%, and Jefferies dropped past 10%.</p><p>TPG (TPG) has a total exposure to Market Financial Solutions of 44 million pounds (<money>$59 million</money>), <org>Bloomberg</org> reported. TPG shares were down 4.4%.</p><p><org value=\"BLK.NaE\" idsrc=\"xmltag.org\" >BlackRock's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='BLK' fmr-param-security-type='Equity'>( BLK )</span>  <org>Global Infrastructure Partners</org> and EQT are in advanced talks to buy AES (AES), <org>Bloomberg</org> reported. <org value=\"BLK.NaE\" idsrc=\"xmltag.org\" >BlackRock</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='BLK' fmr-param-security-type='Equity'>( BLK )</span> shares were falling around 3%.</p><p>Block (XYZ) shares jumped past 14% after it posted higher Q4 adjusted net income and revenue. The company also announced a plan to cut its workforce by more than 40%.</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/us-markets/202602271401MIDNIGHTUSEQUITY_A3575327",
            "pub_date": "2026-02-28 03:01:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Equity Markets Fall Intraday After Producer Prices Report; Oil Rises",
            "description": "\n<p><chron>02:09 PM EST</chron>, <chron>02/27/2026</chron> (MT Newswires) -- US benchmark equity indexes were lower intraday as traders parsed a hot producer prices report, while oil prices moved higher.</p><p>The Dow Jones Industrial Average was down 1.3% at 48,853.5 after midday Friday, while the Nasdaq Composite fell 1.2% to 22,599. The S&amp;P 500 dropped 0.8% to 6,853.9. Among sectors, financials saw the steepest drop of 2.4%, followed by technology's 2.2% fall. Consumer staples and energy led the gainers.</p><p>In economic news, US producer prices rose at the fastest pace in four months in January as growth in the services index hit the highest since July, government data showed.</p><p>&quot;A sizable upswing in producer prices underscores the (Federal Reserve's) unfinished battle with inflation, and furthermore, the flaws in the (Federal Open Market Committee's) longstanding passive and light-handed approach,&quot; Stifel said in a note to clients.</p><p>West Texas Intermediate crude oil rose 2.7% to <money>$67</money> a barrel intraday Friday.</p><p>The latest round of negotiations between the US and <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location> failed to result in a deal, with further talks scheduled ahead, <org>ING Bank</org> said in a report.</p><p>&quot;We are moving dangerously close towards President (<person>Donald) Trump's</person> deadline for a deal,&quot; the firm said. &quot;The market is pricing in a large risk premium due to this uncertainty; we believe as much as (<money>$10</money> a barrel).&quot;</p><p>US Treasury yields were lower intraday, with the 10-year rate down 5.3 basis points at 3.96% and the two-year rate falling 6.1 basis points to 3.39%.</p><p>In company news, OpenAI said it secured <money>$110 billion</money> in new funding, including investments from tech heavyweights <org value=\"NVDA.NaE\" idsrc=\"xmltag.org\" >Nvidia</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NVDA' fmr-param-security-type='Equity'>( NVDA )</span>  and <org value=\"AMZN.NaE\" idsrc=\"xmltag.org\" >Amazon.com</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AMZN' fmr-param-security-type='Equity'>( AMZN )</span> , as the ChatGPT parent aims to expand its infrastructure amid rising demand for artificial intelligence.</p><p><org value=\"NVDA.NaE\" idsrc=\"xmltag.org\" >Nvidia</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NVDA' fmr-param-security-type='Equity'>( NVDA )</span> shares were down 3.5%, among the worst performers on the Dow intraday, while <org value=\"AMZN.NaE\" idsrc=\"xmltag.org\" >Amazon</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AMZN' fmr-param-security-type='Equity'>( AMZN )</span> rose 0.5%.</p><p><org value=\"PSKY.NaE\" idsrc=\"xmltag.org\" >Paramount Skydance</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='PSKY' fmr-param-security-type='Equity'>( PSKY )</span>  shares jumped 23%, the top gainer on the S&amp;P 500, while <org value=\"NFLX.NaE\" idsrc=\"xmltag.org\" >Netflix</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NFLX' fmr-param-security-type='Equity'>( NFLX )</span>  surged 13%, among the best performers on the index.</p><p>Late Thursday, <org value=\"NFLX.NaE\" idsrc=\"xmltag.org\" >Netflix</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NFLX' fmr-param-security-type='Equity'>( NFLX )</span> said it abandoned its plan to acquire <org value=\"WBD.NaE\" idsrc=\"xmltag.org\" >Warner Bros. Discovery</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='WBD' fmr-param-security-type='Equity'>( WBD )</span> , handing the deal to <org>Paramount</org>, but still walking away with a <money>$2.8 billion</money> breakup fee.</p><p><org>Warner Bros</org>. shares were down 1.9% intraday Friday.</p><p>Gold rose 1.3% to <money>$5,257.20</money> per troy ounce, while silver jumped 6.8% to <money>$92.91</money> per ounce.</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/us-markets/202602271409MIDNIGHTUSEQUITY_A3575345",
            "pub_date": "2026-02-28 03:09:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Examining the Future: CPS Technologies's Earnings Outlook",
            "description": "\n<p><org value=\"CPSH.NaE\" idsrc=\"xmltag.org\" >CPS Technologies</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='CPSH' fmr-param-security-type='Equity'>( CPSH )</span> is preparing to release its quarterly earnings on Monday, 2026-03-02. Here's a brief overview of what investors should keep in mind before the announcement.</p>\n<p>Analysts expect <org value=\"CPSH.NaE\" idsrc=\"xmltag.org\" >CPS Technologies</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='CPSH' fmr-param-security-type='Equity'>( CPSH )</span> to report an <strong>earnings per share</strong> (EPS) of <money>$0.01</money>.</p>\n<p>The announcement from <org value=\"CPSH.NaE\" idsrc=\"xmltag.org\" >CPS Technologies</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='CPSH' fmr-param-security-type='Equity'>( CPSH )</span> is eagerly anticipated, with investors seeking news of surpassing estimates and favorable guidance for the next quarter.</p>\n<p>It's worth noting for new investors that guidance can be a key determinant of stock price movements.</p>\n<p>Here's a look at <org value=\"CPSH.NaE\" idsrc=\"xmltag.org\" >CPS Technologies's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='CPSH' fmr-param-security-type='Equity'>( CPSH )</span> past performance and the resulting price change:</p>\n<p><table>\n<thead>\n<tr>\n<th><strong>Quarter</strong></th>\n<th align=\"right\"><strong>Q3 2025</strong></th>\n<th align=\"right\"><strong>Q2 2025</strong></th>\n<th align=\"right\"><strong>Q1 2025</strong></th>\n<th align=\"right\"><strong>Q4 2024</strong></th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td><strong>EPS Estimate</strong></td>\n<td align=\"right\"></td>\n<td align=\"right\"></td>\n<td align=\"right\"></td>\n<td align=\"right\"></td>\n</tr>\n<tr>\n<td><strong>EPS Actual</strong></td>\n<td align=\"right\">0.01</td>\n<td align=\"right\">0.01</td>\n<td align=\"right\">0.01</td>\n<td align=\"right\">-0.07</td>\n</tr>\n<tr>\n<td><strong>Price Change %</strong></td>\n<td align=\"right\">-1.82</td>\n<td align=\"right\">11.11</td>\n<td align=\"right\">8.39</td>\n<td align=\"right\">4.41</td>\n</tr>\n</tbody>\n</table></p>\n<h3>Market Performance of CPS Technologies's Stock</h3>\n<p>Shares of <org value=\"CPSH.NaE\" idsrc=\"xmltag.org\" >CPS Technologies</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='CPSH' fmr-param-security-type='Equity'>( CPSH )</span> were trading at <money>$4.47</money> as of <chron>February 26</chron>. Over the last 52-week period, shares are up 181.71%. Given that these returns are generally positive, long-term shareholders are likely bullish going into this earnings release. </p>\n<h3>All You Need to Know About CPS Technologies</h3>\n<p><org value=\"CPSH.NaE\" idsrc=\"xmltag.org\" >CPS Technologies Corp</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='CPSH' fmr-param-security-type='Equity'>( CPSH )</span> provides material solutions to the transportation, automotive, energy, computing/Internet, telecommunications, aerospace, defense, and oil and gas end markets. Its primary material solution is metal matrix composites (MMCs), which are a class of materials consisting of a combination of metal and ceramic. The company designs, manufactures and sells custom MMC components, which manages the performance and reliability of systems in the end markets. It also provides baseplates and housings used in radar, satellite and avionics applications. The company provides lids and heat spreaders used with integrated circuits in Internet switches and routers.</p>\n<h3>Financial Insights: CPS Technologies</h3>\n<p><strong>Market Capitalization:</strong> Indicating a reduced size compared to industry averages, the company's market capitalization poses unique challenges.</p>\n<p><strong>Revenue Growth:</strong> <org value=\"CPSH.NaE\" idsrc=\"xmltag.org\" >CPS Technologies</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='CPSH' fmr-param-security-type='Equity'>( CPSH )</span> displayed positive results in 3 months. As of <chron>30 September, 2025</chron>, the company achieved a solid revenue growth rate of approximately <strong>107.29%</strong>. This indicates a notable increase in the company's top-line earnings. As compared to its peers, the company achieved a growth rate higher than the average among peers in Information Technology sector.</p>\n<p><strong>Net Margin:</strong> <org value=\"CPSH.NaE\" idsrc=\"xmltag.org\" >CPS Technologies's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='CPSH' fmr-param-security-type='Equity'>( CPSH )</span> financial strength is reflected in its exceptional net margin, which exceeds industry averages. With a remarkable net margin of <strong>2.36%,</strong> the company showcases strong profitability and effective cost management.</p>\n<p><strong>Return on Equity (ROE):</strong> The company's ROE is a standout performer, exceeding industry averages. With an impressive ROE of <strong>1.39%,</strong> the company showcases effective utilization of equity capital.</p>\n<p><strong>Return on Assets (ROA):</strong> <org value=\"CPSH.NaE\" idsrc=\"xmltag.org\" >CPS Technologies's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='CPSH' fmr-param-security-type='Equity'>( CPSH )</span> ROA stands out, surpassing industry averages. With an impressive ROA of <strong>1.04%</strong>, the company demonstrates effective utilization of assets and strong financial performance.</p>\n<p><strong>Debt Management:</strong> <org value=\"CPSH.NaE\" idsrc=\"xmltag.org\" >CPS Technologies's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='CPSH' fmr-param-security-type='Equity'>( CPSH )</span> debt-to-equity ratio is below industry norms, indicating a sound financial structure with a ratio of <strong>0.02</strong>.</p>\n<p><strong>To track all earnings releases for <org value=\"CPSH.NaE\" idsrc=\"xmltag.org\" >CPS Technologies</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='CPSH' fmr-param-security-type='Equity'>( CPSH )</span> visit their earnings calendar on our site.</strong></p>\n<p><em>This article was generated by Benzinga's automated content engine and reviewed by an editor.</em></p>\n",
            "link": "https://www.fidelity.com/news/article/technology/202602271402BENZINGAFULLNGTH50941091",
            "pub_date": "2026-02-28 03:02:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Geographic Solutions Earns the Top Prize at The DaVinci AwardsÂ®",
            "description": "\n<div class=\"xn-content\">\n<p><i>The Nation's Leading Provider of Workforce Development Software Recognized for Innovative Reentry Employment System</i></p><p><span class=\"legendSpanClass\"><location value=\"LU/us.fl.palbor\" idsrc=\"xmltag.org\" >PALM HARBOR, Fla.</location></span>, <span class=\"legendSpanClass\"><chron>Feb. 27, 2026</chron></span> /PRNewswire/ -- Geographic Solutions has been recognized in the latest round of The DaVinci Awards® judging, earning a three-star certification in the category of 'Technology' for the Virtual OneStop Reentry Employment Opportunities (<person>VOS REO</person>) solution and the <org>California Correctional Training and Rehabilitation Authority</org> (CALCTRA) Entry to Employment (E2E) Network.</p>\n    <div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder1\">\n                <p>\n\n                    <img src=\"https://mma.prnewswire.com/media/2332309/Geographic_Solutions_Logo.jpg\" title=\"Geographic Solutions Inc. (PRNewsfoto/Geographic Solutions, Inc.)\" alt=\"Geographic Solutions Inc. (PRNewsfoto/Geographic Solutions, Inc.)\" />\n\n                </p>\n    </div>\n<p>The DaVinci Awards® is an international awards body that celebrates outstanding displays of innovation, or significant achievements, in business, technology, products, and lifestyle. Nominations are accepted on behalf of individuals, teams or departments, entire organizations, or specific products or services. The awards were launched in 2025, making Geographic Solutions one of the world's first to receive one.</p><p>Entrants in the 'Technology' segment of the awards were invited to showcase their breakthroughs in a broad range of areas, including advanced electronics, smart devices, AI, cybersecurity, internet services, networking and data management.</p><p>CEO and Founder of The DaVinci Awards®, <person>James Williams</person>, said: \"We're delighted to award Geographic Solutions a DaVinci Award®, in recognition of their fantastic work in helping individuals re-enter the world of work.\"</p><p>Williams further states, \"The technology landscape is fiercely competitive. Lower barriers to entry across the sector have made acquiring, keeping, and growing customers and users harder than ever before. Three-star awards are earned by nominees that embody innovation and deliver unparalleled impact. Many congratulations to Geographic Solutions in securing this award.\"</p><p>The DaVinci Awards® COO, <person>Annabelle Whittall</person>, added: \"Geographic Solutions' strengths lay in its clear evidence base, multi-state implementation, and operational execution within complex public sector environments. The cross-agency integration and secure infrastructure design reflect thoughtful engineering and strategic clarity.\"</p><p>Whittall commented further stating, \"Three-star distinction recognizes rare, benchmark-level innovation with proven societal and technological impact. Geographic Solutions has delivered something genuinely transformative.\"</p><p>Geographic Solutions Founder and President, <person>Paul Toomey</person>, said: \"Geographic Solutions is truly honored to receive the prestigious three-star recognition by The DaVinci Awards®. Our dedicated team remains deeply committed to developing innovative software solutions that empower individuals facing barriers to employment. <person>VOS REO</person> builds meaningful pathways from incarceration back into society – and ultimately into the workforce.\"</p><p>Toomey notes that \"Through CALCTRA's first-of-its-kind E2E Network, we are helping reshape the corrections narrative by moving beyond traditional job training and equipping justice-impacted individuals with secure, technology-driven job search tools that support sustainable employment after release.\"</p><p>To view all winners, please visit: https://www.davinciawards.com/awards/technology/2026-winners/</p><p><b><u>Notes for Editors</u></b></p><p><b>About The DaVinci Awards®</b> </p><p>The DaVinci Awards® is an international online awards body recognizing outstanding feats of innovation, or achievements, in the fields of business, technology, products, and lifestyle &amp; culture. Nominations are accepted all year around from individuals, teams, organizations, or products &amp; services. Nominations are judged by a global panel of experts in their fields, with winners earning either a 1-star, 2-star, or 3-star certification. The awards were founded and operated by the team behind The Cloud Awards, an internationally renowned awards body which has been recognizing excellence in cloud computing since 2011.</p><p><b>About Geographic Solutions<br /></b>Geographic Solutions is the nation's leading provider of integrated software for state and local workforce agencies, serving more than 40 states and U.S. territories. Our comprehensive platforms support all federally funded workforce and partner programs, including WIOA, labor exchange, labor market information, education, reentry, human services, and unemployment insurance.</p>\n\n\n\n<p id=\"PURL\"><img title=\"Cision\" width=\"12\" height=\"12\" alt=\"Cision\" src=\"https://edge.prnewswire.com/c/img/favicon.png?sn=FL97964&amp;sd=2026-02-27\" /> View original content to download multimedia:https://www.prnewswire.com/news-releases/geographic-solutions-earns-the-top-prize-at-the-davinci-awards-302699880.html</p><p>SOURCE <org>Geographic Solutions, Inc.</org></p></div>\n",
            "link": "https://www.fidelity.com/news/article/technology/202602271407PR_NEWS_USPR_____FL97964",
            "pub_date": "2026-02-28 03:07:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "What's Behind The Drop In Microsoft Stock?",
            "description": "\n<p>Shares of <strong><org value=\"MSFT.NaE\" idsrc=\"xmltag.org\" >Microsoft Corporation</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='MSFT' fmr-param-security-type='Equity'>( MSFT )</span></strong> are falling Friday as the company tries to reaffirm a strong partnership with OpenAI despite not being included in the AI company&#8217;s latest funding and partnerships announcement.</p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><org value=\"MSFT.NaE\" idsrc=\"xmltag.org\" >Microsoft</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='MSFT' fmr-param-security-type='Equity'>( MSFT )</span> stock is under selling pressure. Why is MSFT stock trading lower?</li>\n</ul>\n\n\n\n<h2 class=\"wp-block-heading\">OpenAI Announces New Funding Round Sans Microsoft</h2>\n\n\n\n<p>OpenAI announced <money>$110B</money> in new investment at a <money>$730B</money> pre-money valuation. This includes <money>$30B</money> from SoftBank, <money>$30B</money> from NVIDIA, and <money>$50B</money> from Amazon. The company also signed a strategic partnership with Amazon and secured next generation inference compute with NVIDIA.</p>\n\n\n\n<p><org value=\"MSFT.NaE\" idsrc=\"xmltag.org\" >Microsoft</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='MSFT' fmr-param-security-type='Equity'>( MSFT )</span>, who was not mentioned in the press release, has a mutually beneficial arrangement with OpenAI that started in 2019. <org value=\"MSFT.NaE\" idsrc=\"xmltag.org\" >Microsoft</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='MSFT' fmr-param-security-type='Equity'>( MSFT )</span> released a statement Friday saying that its relationship with OpenAI, including revenue shares, IP agreements and Azure as the stateless cloud provider remains unchanged. </p>\n\n\n\n<p>Even though <org value=\"MSFT.NaE\" idsrc=\"xmltag.org\" >Microsoft</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='MSFT' fmr-param-security-type='Equity'>( MSFT )</span> reaffirmed the relationship, shares still slid. </p>\n\n\n\n<h2 class=\"wp-block-heading\">Shares Down Slightly In Regular Trading</h2>\n\n\n\n<p><strong>MSFT Price Action:</strong> <org value=\"MSFT.NaE\" idsrc=\"xmltag.org\" >Microsoft</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='MSFT' fmr-param-security-type='Equity'>( MSFT )</span> shares were down 2.17% at <money>$393.01</money> at the time of publication on Friday, according to Benzinga Pro data.<br/></p>\n\n\n\n<p><em>Image: Shutterstock</em></p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602271414BENZINGAFULLNGTH50941689",
            "pub_date": "2026-02-28 03:14:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Wingstop Insider Sold Shares Worth $703,958, According to a Recent SEC Filing",
            "description": "\n<p><chron>02:14 PM EST</chron>, <chron>02/27/2026</chron> (MT Newswires) -- Kilandigalu Madati, Director, on <chron>February 25, 2026</chron>, sold 2,700 shares in <org value=\"WING.NaE\" idsrc=\"xmltag.org\" >Wingstop</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='WING' fmr-param-security-type='Equity'>( WING )</span>  for <money>$703,958</money>. Following the Form 4 filing with the <org>SEC</org>, Madati has control over a total of 2,583 common shares of the company, with 2,583 shares held directly.</p><p>SEC Filing:</p><p>https://www.sec.gov/Archives/edgar/data/1636222/000162828026012698/xslF345X05/wk-form4_1772219147.xml</p><p>Price: 264.11, Change: -7.89, Percent Change: -2.90</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602271414MIDNIGHTUSEQUITY_A3575351",
            "pub_date": "2026-02-28 03:14:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "OpenAI clinches $840 billion valuation with mega funding from Amazon, Nvidia, SoftBank",
            "description": "<p><chron>Feb 27</chron> (Reuters) - OpenAI's latest funding round valued the ChatGPT maker at <money>$840 billion</money> as Big Tech and <person>Masayoshi Son's</person> SoftBank piled into the <money>$110 billion</money> blockbuster round, signaling the AI investment race is alive and well despite recent fears of a valuation bubble. </p>\n<p>The funding round - one of the largest private capital raises on record - with various strings and conditions attached that come in phases, includes a <money>$30 billion</money> investment from SoftBank, <money>$30 billion</money> from Nvidia, and <money>$50 billion</money> from <org value=\"AMZN.NaE\" idsrc=\"xmltag.org\" >Amazon</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AMZN' fmr-param-security-type='Equity'>( AMZN )</span>. </p>\n<p>It comes ahead of the AI startup's expected mega-IPO this year to meet the ChatGPT maker's surging compute and R&amp;D costs. </p>\n<p>More investors are expected to join the round as it progresses, OpenAI said in a statement on Friday.</p>\n<p>FUNDING BOOST AMID COMPETITION</p>\n<p>With the latest injection, SoftBank's investment in OpenAI is set to be <money>$64.6 billion</money>, representing an ownership interest of about 13%, the Japanese conglomerate said. The investment will come in three phases throughout this year, with the first tranche of <money>$10 billion</money> expected to close by <chron>April 1</chron>. </p>\n<p>As a result of the investment, SoftBank will gain preferred shares that will be converted into common shares of OpenAI upon an IPO. </p>\n<p>SoftBank said the <money>$30 billion</money> is expected to be financed initially through bridge loans and capital raise from major financial institutions. The Japanese investment giant has sold stakes in its existing investments, including Nvidia, in order to fund its check into OpenAI. </p>\n<p>The infusion will help OpenAI secure advanced AI chips and the computing capacity it needs to maintain its lead position in the AI industry, especially as competition heats up from Anthropic and Alphabet's Google. </p>\n<p>It also exacerbates <location>Wall Street</location> concerns about  &quot;circular&quot; financing agreements, where firms invest in and sign supply deals with each other, inflating demand and revenue.</p>\n<p>After years of outsized gains, tech stocks have suffered sharp declines in 2026 as investors question whether AI investments will generate sufficient returns to justify lofty valuations.</p>\n<p>Nvidia was punished by shareholders this week after the chipmaker said it would pour money into the AI ecosystem, instead of returning cash to shareholders. Nvidia's investment in OpenAI gives the chip company a financial stake in one of its largest customers, tightening their already intertwined relationship.</p>\n<p>OpenAI said on Friday it would use Nvidia's latest Rubin systems, representing five gigawatts of computing capacity - enough energy to power millions of U.S. households.</p>\n<p>It was not immediately clear whether Nvidia's <money>$30 billion</money> investment replaced its earlier commitment announced in September under which Nvidia was set to invest up to <money>$100 billion</money> in the startup. </p>\n<p>OpenAI and Nvidia did not immediately respond to Reuters' requests for clarification. </p>\n<p>AMAZON PARTNERSHIP </p>\n<p>The new investment is crucial for OpenAI. </p>\n<p>The launch of Google's Gemini 3 in November has given the Alphabet-owned company a stronger footing, while Anthropic has cemented its lead in the enterprise AI market with its specialized coding tool.</p>\n<p>OpenAI, which is yet to turn a profit, is targeting roughly <money>$600 billion</money> in total compute spend through 2030, a source told Reuters last week. </p>\n<p>Along with the <money>$50 billion</money> investment, OpenAI and <org value=\"AMZN.NaE\" idsrc=\"xmltag.org\" >Amazon</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AMZN' fmr-param-security-type='Equity'>( AMZN )</span> have also struck a deal in which OpenAI will utilize two gigawatts of computing capacity powered by <org value=\"AMZN.NaE\" idsrc=\"xmltag.org\" >Amazon's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AMZN' fmr-param-security-type='Equity'>( AMZN )</span> in-house Trainium AI chips.</p>\n<p>The companies are also expanding their <money>$38 billion</money> cloud deal signed last year, with OpenAI saying it would spend an additional <money>$100 billion</money> on Amazon Web Services over the next eight years. As well, OpenAI will work with <org value=\"AMZN.NaE\" idsrc=\"xmltag.org\" >Amazon</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AMZN' fmr-param-security-type='Equity'>( AMZN )</span> to develop customized models for the e-commerce company's engineering teams.</p>\n<p><org value=\"AMZN.NaE\" idsrc=\"xmltag.org\" >Amazon</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AMZN' fmr-param-security-type='Equity'>( AMZN )</span> will start with an initial <money>$15 billion</money> investment, followed by another <money>$35 billion</money> in the coming months when certain conditions are met, the companies said. </p>\n<p>AWS will be the exclusive third-party cloud provider for OpenAI Frontier, the ChatGPT maker's enterprise platform for building and running AI agents. </p>\n<p>Microsoft, in a joint statement with OpenAI, sought to outline the limits to the work that <org value=\"AMZN.NaE\" idsrc=\"xmltag.org\" >Amazon</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AMZN' fmr-param-security-type='Equity'>( AMZN )</span> and OpenAI can undertake together without involving Azure, Microsoft's cloud unit. </p>\n<p>The partnership does not change OpenAI's relationship with Microsoft, with Microsoft Azure still the exclusive cloud provider for OpenAI's APIs that provide access to OpenAI's models, the companies said. OpenAI's first-party products, including Frontier, will continue to be hosted on Azure. </p>\n<p>ChatGPT serves more than 900 million weekly active users, OpenAI said on Friday, adding that it has surpassed 50 million consumer subscribers. January and February are on track to become the largest months for new subscriber additions, it said.</p>\n<p> (Reporting by <person>Deborah Sophia</person> and <person>Akash Sriram</person> in Bengaluru, <person>Krystal Hu</person> in <location value=\"LU/us.ca.sanfrn\" idsrc=\"xmltag.org\" >San Francisco</location>; Additional reporting by <person>Stephen Nellis</person> in <location value=\"LU/us.ca.sanfrn\" idsrc=\"xmltag.org\" >San Francisco</location>; Editing by Arun Koyyur, <person>Chizu Nomiyama</person>, <person>Nick Zieminski</person>, <person>Sayantani Ghosh</person>, <person>Rod Nickel</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/top-news/202602270835RTRSNEWSCOMBINED_KBN3PH1K6-OUSBS_1",
            "pub_date": "2026-02-28 03:25:47",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Sector Update: Consumer Stocks Mixed Friday Afternoon",
            "description": "\n<p><chron>01:50 PM EST</chron>, <chron>02/27/2026</chron> (MT Newswires) -- Consumer stocks were mixed Friday afternoon, with the State Street Consumer Staples Select Sector SPDR ETF (XLP) increasing 1.2% and the State Street Consumer Discretionary Select Sector SPDR ETF (XLY) down 0.6%.</p><p>In corporate news, <org value=\"NFLX.NaE\" idsrc=\"xmltag.org\" >Netflix</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NFLX' fmr-param-security-type='Equity'>( NFLX )</span>  abandoned its plan to buy <org value=\"WBD.NaE\" idsrc=\"xmltag.org\" >Warner Bros. Discovery</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='WBD' fmr-param-security-type='Equity'>( WBD )</span> , handing the deal to <org value=\"PSKY.NaE\" idsrc=\"xmltag.org\" >Paramount Skydance</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='PSKY' fmr-param-security-type='Equity'>( PSKY )</span> , but still walking away with a <money>$2.8 billion</money> breakup fee, according to the streaming giant's statement Thursday evening. <org value=\"NFLX.NaE\" idsrc=\"xmltag.org\" >Netflix</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NFLX' fmr-param-security-type='Equity'>( NFLX )</span> shares jumped 13%, Warner was down 1.8%, and <org>Paramount</org> climbed 24%.</p><p><org value=\"HAS.NaE\" idsrc=\"xmltag.org\" >Hasbro</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='HAS' fmr-param-security-type='Equity'>( HAS )</span>  on Friday sued the US government to recover tariff payments made under President <person>Donald Trump's</person> emergency trade measures, which were deemed illegal by the <org>US Supreme Court</org> last week, Reuters reported, citing court documents. <org value=\"HAS.NaE\" idsrc=\"xmltag.org\" >Hasbro</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='HAS' fmr-param-security-type='Equity'>( HAS )</span> shares were down 0.7%.</p><p><org value=\"F.NaE\" idsrc=\"xmltag.org\" >Ford Motor</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='F' fmr-param-security-type='Equity'>( F )</span>  attorney <person>Mark Freedlander</person> said three of the four businesses that First Brands plans to sell in the coming weeks produce parts for the carmaker, <org>Bloomberg</org> reported, citing his comments at a bankruptcy hearing. Ford shares were shedding 1.9%.</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/us-markets/202602271350MIDNIGHTUSEQUITY_A3575321",
            "pub_date": "2026-02-28 02:50:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Update: Gold Rises to a Month High as U.S. Wholesale Prices Rose Above Expectations in January",
            "description": "\n<p><chron>02:00 PM EST</chron>, <chron>02/27/2026</chron> (MT Newswires) -- (Updates prices.)</p><p>Gold rose to the highest in a month early Friday following a report U.S. wholesale inflation rose above expectations in January.</p><p>Gold for April delivery was last seen up <money>$53.80</money> to <money>US$5,248.00</money> per ounce, the highest since the record close of <money>US$5,354.80</money> on <chron>Jan. 29</chron>.</p><p><org>The U.S. Bureau of Labor Statistics</org> reported the January Producer Price Index (PPI) rose by 0.5% from December, up from 0.4% in the prior month and above expectations for a rise of 0.3%, according to Marketwatch. Core PPI, excluding volatile items, rose at a 0.3% pace, unchanged from December and under expectations for a 0.4% rise.</p><p>The agency said the rise came on higher prices for services, which rose 0.8% from December, while final demand goods declined 0.3 percent.</p><p>U.S. stock indices weakened following the data, which dims hopes for a cut to U.S. interest rates from the Federal Reserve, but also comes as traders move away from risk assets as <location value=\"LC/us\" idsrc=\"xmltag.org\" >the United States</location> threatens to attack <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location> and earnings from AI chip maker Nvidia (NVDA) failed to meet market expectations.</p><p>The dollar fell following the data, with the ICE dollar index last seen down 0.15 points to 97.64. Treasury yields weakened as bond prices rose, with the yield on the U.S. two-year note last seen down 4.7 basis points to 3.395%, while the 10-year note was paying 3.966%, down 4.2 points.</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/us-markets/202602271400MIDNIGHTUSEQUITY_A3575342",
            "pub_date": "2026-02-28 03:00:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Cargo Traffic to Los Angeles Port Expected to Fall in Week Ending March 14",
            "description": "\n<p><chron>01:47 PM EST</chron>, <chron>02/27/2026</chron> (MT Newswires) -- Cargo traffic at the <location value=\"LU/us.ca.losang\" idsrc=\"xmltag.org\" >Port of Los Angeles</location> is expected to fall in the week ending <chron>March 14</chron>, according to data from the ship-tracking system Port Optimizer.</p><p>A total of 93,629 20-foot equivalent units, a standardized measure of cargo capacity, are projected to reach the port in the week, the data showed. That volume reflects an 8.4% drop from the previous week and a 6.7% gain from a year earlier.</p><p>Fifteen freight vessels are scheduled to arrive at the port in the week ending <chron>March 14</chron>, the data showed. That's down from 20 vessels this week and 19 in the week ending <chron>March 7</chron>.</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/us-economy/202602271347MIDNIGHTUSEQUITY_A3575316",
            "pub_date": "2026-02-28 02:47:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US charges 30 additional people who took part in Minnesota ICE protest at church, Bondi says",
            "description": "\n<p><chron>Feb 27</chron> (Reuters) - <org>The U.S. Justice Department</org> on Friday charged 30 more people accused of disrupting a <location value=\"LS/us.mn\" idsrc=\"xmltag.org\" >Minnesota</location> church service last month in protest of the Trump administration's immigration enforcement operation.</p>\n<p>The indictment vastly increases the scope of a criminal case that also includes former CNN anchor <person>Don Lemon</person>, one of nine people initially charged in the case. All 39 defendants are charged with conspiracy against the right of religious worship and violating a law that forbids obstructing access to houses of worship. </p>\n<p>&quot;At my direction, federal agents have already arrested 25 of them, with more to come throughout the day,&quot; U.S. Attorney General Pam Bondi said on social media. &quot;YOU CANNOT ATTACK A HOUSE OF WORSHIP. If you do so, you cannot hide from us - we will find you, arrest you, and prosecute you.&quot;</p>\n<p>Lemon and several others previously charged have pleaded not guilty. Lemon, now an independent journalist who livestreamed the demonstration, has argued the charges violate his free press rights under the First Amendment to the U.S. Constitution. </p>\n<p>(Reporting by <person>Bhargav Acharya</person>, Writing by <person>Christian Martinez</person>; Editing by <person>Rod Nickel</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/us-economy/202602271347RTRSNEWSCOMBINED_KBN3PH2BH-OUSTP_1",
            "pub_date": "2026-02-28 02:47:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Research Alert: CFRA Maintains Hold Opinion On Shares Of Monster Beverage Corporation",
            "description": "\n<p><chron>01:55 PM EST</chron>, <chron>02/27/2026</chron> (MT Newswires) -- CFRA, an independent research provider, has provided MT Newswires with the following research alert. Analysts at CFRA have summarized their opinion as follows:</p><p>We increase our 12-month price target by <money>$15</money> to <money>$90</money>, based on a 2027 P/E of 36.0x, a slight premium to the stock's five-year average forward P/E of 34.6x due to international growth potential. We maintain our 2026 adjusted EPS estimate of <money>$2.25</money> but raise 2027's by <money>$0.05</money> to <money>$2.50</money>. Following MNST's Q4 beat, we maintain a Hold opinion but raise our price target on the shares. MNST posted Q4 adjusted EPS of <money>$0.51</money> vs. <money>$0.39</money> (+30% Y/Y), well ahead of the <money>$0.49</money> consensus. MNST's net sales rose 18% to <money>$2.13B</money> (<money>$90M</money> above consensus) and gross margin expanded 20 bps to 55.5% (40 bps below consensus). Shares have had a tremendous run over the last six months, and while MNST's recent execution has greatly improved, we view the stock's valuation as fair and its risk/reward as balanced, particularly considering growing concerns about further margin improvement amid rising aluminum costs.</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/investing-ideas/202602271355MIDNIGHTUSEQUITY_A3575338",
            "pub_date": "2026-02-28 02:55:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Dorsey's blunt AI warning sharpens debate over jobs and profits",
            "description": "<p><chron>Feb 27</chron> (Reuters) - <person>Jack Dorsey</person> is not the first chief executive to say artificial intelligence will transform work. He may be among the first to act as if it already has - and to say so openly.</p>\n<p>&quot;Intelligence tools have changed what it means to build and run a company. We're already seeing it internally. A significantly smaller team using the tools can do more and do it better,&quot; Block CEO and co-founder said in a statement on Thursday.</p>\n<p>&quot;I don't think we're early to this realization. I think most companies are late,&quot; he added as he laid out plans to cut over 4,000 jobs, nearly half the company's workforce, as part of an overhaul to embed AI across the fintech's operations.</p>\n<p>Block shares rose sharply on Friday, underscoring how markets are increasingly rewarding companies that present AI not as an experiment but as a driver of structural change.</p>\n<p>Dorsey also delivered a blunt warning to peers: most companies are behind the AI curve and will reach the same conclusion within a year.</p>\n<p>&quot;I'd rather get there honestly and on our own terms than be forced into it reactively.&quot;</p>\n<p>Until now, most executives have resisted those kinds of sweeping conclusions even as their firms pour billions into the technology.</p>\n<p>The comments are likely to sharpen a growing debate among executives, economists, investors and policymakers: is AI primarily a tool that helps workers do more - or one that enables companies to do the same with far fewer people?</p>\n<p>AI JOB CUTS ACCELERATE</p>\n<p>AI-linked layoffs have been rising worldwide.</p>\n<p>According to a Reuters tally, companies have announced more than 61,000 job cuts tied to AI, including <org value=\"AMZN.NaE\" idsrc=\"xmltag.org\" >Amazon</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AMZN' fmr-param-security-type='Equity'>( AMZN )</span>, <org value=\"PINS.NaE\" idsrc=\"xmltag.org\" >Pinterest</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='PINS' fmr-param-security-type='Equity'>( PINS )</span> and <location value=\"LC/au\" idsrc=\"xmltag.org\" >Australia's</location> Wisetech since November.</p>\n<p>But Block is among the highest-profile companies to cite AI explicitly as the primary driver of its reductions, rather than a secondary efficiency gain.</p>\n<p>Some investors argue that automation-related cuts are partly correcting for years of overhiring.</p>\n<p>&quot;AI is the new scapegoat,&quot; said <person>Brian Jacobsen</person>, chief economic strategist at Annex Wealth Management, on Friday.</p>\n<p>Still, markets are increasingly uneasy about AI's potential to upend jobs and profits amid an uncertain global economic backdrop.</p>\n<p>A widely circulated report this week by <org>Citrini Research</org> outlined a 2028 scenario in which unemployment rises to 10.2%, driven by rapid displacement of workers in software, logistics and delivery roles.</p>\n<p>BUSINESSES HAVE BEEN MORE GUARDED</p>\n<p>Evidence is emerging that firms are beginning to see returns on their investment.</p>\n<p>Morgan Stanley analysts said this week there has been a steady rise in the number of companies reporting quantifiable benefits from AI adoption, based on an analysis of more than 10,000 earnings calls and fourth-quarter conference transcripts.</p>\n<p>Some 21% of S&amp;P 500 companies mentioned at least one measurable benefit, up from 15% in the third quarter and 10% in the final quarter of 2024. Greater AI use will boost companies' profit margins by 40 basis points this year, they estimate.</p>\n<p>But until now, most executives and policymakers have been more guarded than Dorsey when talking about AI and jobs.</p>\n<p>&quot;What we are seeing for the moment is that it's increasing productivity,&quot; ECB President <person>Christine Lagarde</person> told a committee of the European Parliament on Thursday. </p>\n<p>&quot;But we are not yet seeing consequences in terms of labour market and waves of redundancies that are feared, and that you know we will be extremely attentive going forward.&quot;</p>\n<p>At the <org>World Economic Forum</org> last month, <org value=\"JPM.NaE\" idsrc=\"xmltag.org\" >JPMorgan Chase</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='JPM' fmr-param-security-type='Equity'>( JPM )</span> CEO <person>Jamie Dimon</person> said jobs would disappear but new ones would emerge. </p>\n<p>On Friday, Bank of America global economists <person>Claudio Irigoyen</person> and <person>Antonio Gabriel</person> said AI could ultimately affect a quarter of all jobs.</p>\n<p>AI shock, they said, will be disruptive for companies that do not survive and for workers who are displaced, but the economy will be better off because it will create new jobs and business opportunities that were previously prohibitive.</p>\n<p><person>Michael Ashley Schulman</person>, partner and CIO at <org>Running Point Capital Advisors</org>, warned of unintended consequences from drastic steps like Block's.</p>\n<p>&quot;Dorsey's strategy suggests that less is more and that human capital has lost its competitive edge,&quot; he said.</p>\n<p>&quot;The question is whether the company is resetting to its smaller, nimbler startup days or whether it might lose the creativity and human intuition that built its most iconic products in the first place.&quot;    </p>\n<p></p>\n<p> (Reporting by <person>Utkarsh Shetti</person> and <person>Manya Saini</person> in Bengaluru, <person>Romolo Tosiani</person> and <person>Philippe Leroy Beaulieu</person> in Gdansk and <person>Francesco Canepa</person> in Frankfurt;Writing by Josephine MasonEditing by <person>Louise Heavens</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602271356RTRSNEWSCOMBINED_KBN3PH2C8-OUSBS_1",
            "pub_date": "2026-02-28 02:56:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Dell's Outlook 'Unexpectedly Strong,' BofA Says as Memory Shortage Lingers",
            "description": "\n<p><chron>01:57 PM EST</chron>, <chron>02/27/2026</chron> (MT Newswires) -- <org value=\"DELL.NaE\" idsrc=\"xmltag.org\" >Dell Technologies'</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='DELL' fmr-param-security-type='Equity'>( DELL )</span>  fiscal 2027 outlook was surprisingly strong amid a shortage of memory chips and the expected impact of price increases, <org>BofA Securities</org> said in a note e-mailed Friday.</p><p>Late Thursday, the computer maker logged fourth-quarter results above <location>Wall Street's</location> estimates, buoyed by a surge in orders for artificial intelligence-optimized servers. For fiscal 2027, the company expects adjusted earnings to jump 25% annually to <money>$12.90</money> a share on revenue of <money>$138 billion</money> to <money>$142 billion</money>.</p><p>Dell's shares soared 22% in Friday afternoon trade. The stock has jumped 17% so far in 2026.</p><p>Dell's outlook was &quot;unexpectedly strong&quot; relative to concerns regarding the impact on margins from commodity headwinds, BofA analyst Wamsi Mohan said. &quot;While the near term is clearly strong, we are unsure of the demand elasticity created by the swift and significant price actions taken by Dell.&quot;</p><p>The rapid expansion of AI infrastructure and workloads is exerting pressure on the memory ecosystem. Memory chips are used in a wide range of product categories including smartphones, laptops, automobiles and data centers.</p><p>&quot;While Dell remains confident that it has the supply needed to meet current guidance, we believe that there could be more demand destruction given the significant and fairly unprecedented price increases,&quot; Mohan said.</p><p>Dell expects AI server revenue of <money>$13 billion</money> for the first quarter and <money>$50 billion</money> for the full year, Chief Financial Officer <person>David Kennedy</person> said on an earnings conference call, according to a FactSet transcript.</p><p>BofA expects AI servers to be the main driver for Dell's sales growth in fiscal 2027 following &quot;exceptionally strong&quot; demand in the fourth quarter, especially among enterprises.</p><p>&quot;Dell noted AI use cases are expanding from training to inference and agentic workloads,&quot; Mohan said. &quot;Dell enters (fiscal 2027) with strong visibility into AI server demand and backlog conversion.&quot;</p><p>The brokerage raised its price objective on the Dell stock to <money>$155</money> from <money>$135</money>, while reiterating its buy rating.</p><p>&quot;We model (this year's second half) weaker than (the first half), which could prove to be ultimately conservative,&quot; Mohan said. &quot;(Dell's management) acknowledged the significant headwinds and potential pull forward of demand, however AI demand growth could prove to be an offset.&quot;</p><p>Price: 147.08, Change: +25.63, Percent Change: +21.10</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602271357MIDNIGHTUSEQUITY_A3575293",
            "pub_date": "2026-02-28 02:57:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Sector Update: Energy",
            "description": "\n<p><chron>01:35 PM EST</chron>, <chron>02/27/2026</chron> (MT Newswires) -- Energy stocks rose Friday afternoon with the NYSE Energy Sector Index gaining 1.4% and the State Street Energy Select Sector SPDR ETF (XLE) adding 1%.</p><p>The Philadelphia Oil Service Sector Index eased 0.1%, and the Dow Jones US Utilities Index increased 0.5%.</p><p>West Texas Intermediate crude oil rose 2.6% to <money>$66.87</money> a barrel, and global benchmark Brent advanced 2.5% to <money>$72.52</money> a barrel. Henry Hub natural gas futures rose 1.5% to <money>$2.87</money> per 1 million BTU.</p><p>In corporate news, <org value=\"AES.NaE\" idsrc=\"xmltag.org\" >AES</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AES' fmr-param-security-type='Equity'>( AES )</span>  shares jumped 5.5% after <org>Bloomberg</org> reported that BlackRock's (BLK) <org>Global Infrastructure Partners</org> and EQT are in advanced talks to buy the company.</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/us-markets/202602271335MIDNIGHTUSEQUITY_A3575310",
            "pub_date": "2026-02-28 02:35:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Iamgold Insider Sold Shares Worth $1,018,881, According to a Recent SEC Filing",
            "description": "\n<p><chron>01:42 PM EST</chron>, <chron>02/27/2026</chron> (MT Newswires) -- <person>David Stewart Smith</person>, Director, on <chron>February 27, 2026</chron>, sold 31,000 shares in <org value=\"IAG.NaE\" idsrc=\"xmltag.org\" >Iamgold</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='IAG' fmr-param-security-type='Equity'>( IAG )</span>  for <money>$1,018,881</money>. Following the Form 4 filing with the <org>SEC</org>, Smith has control over a total of 20,000 common shares of the company, with 20,000 shares held directly.</p><p>SEC Filing:</p><p>https://www.sec.gov/Archives/edgar/data/1203464/000164794326000001/xslF345X05/primary_doc.xml</p><p>Price: 24.21, Change: +0.39, Percent Change: +1.64</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602271342MIDNIGHTUSEQUITY_A3575318",
            "pub_date": "2026-02-28 02:42:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "--Tariffs Influenced Novartis to Build Over 7 Plants in US, Trump Says",
            "description": "\n<p><chron>01:43 PM EST</chron>, <chron>02/27/2026</chron> (MT Newswires) --</p><p>Price: 169.41, Change: +3.90, Percent Change: +2.36</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602271343MIDNIGHTUSEQUITY_A3575315",
            "pub_date": "2026-02-28 02:43:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "GLOBAL MARKETS-Stocks fall but set for monthly gain as investors take a breather from AIÂ",
            "description": "\n<p>(New throughout, updates prices, adds analyst comment)</p>\n<p>*</p>\n<p><location>Wall Street</location> stocks weaken</p>\n<p></p>\n<p>*</p>\n<p>US-<location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location> developments in focus</p>\n<p></p>\n<p>*</p>\n<p>Oil prices gain</p>\n<p></p>\n<p>*</p>\n<p>US Treasury yields fall</p>\n<p></p>\n<p>By <person>Chibuike Oguh</person></p>\n<p><location value=\"LU/us.ny.nyc\" idsrc=\"xmltag.org\" >NEW YORK</location>, <chron>Feb 27</chron> (Reuters) - Global stocks edged lower\non Friday but still traded near record highs and were on track\nfor a monthly gain as investors paused amid concerns about AI,\nwhile geopolitical tensions and possible supply disruptions were\nhelping to lift oil prices.</p>\n<p>Concerns about sky-high valuations and the broader impact of\nAI have weakened market sentiment this week after <org value=\"NVDA.NaE\" idsrc=\"xmltag.org\" >Nvidia</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NVDA' fmr-param-security-type='Equity'>( NVDA )</span>\nposted better-than-expected results. Shares in <org value=\"NVDA.NaE\" idsrc=\"xmltag.org\" >Nvidia</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NVDA' fmr-param-security-type='Equity'>( NVDA )</span>,\nthe world's most valuable company, were down 1.6%, extending\nlosses from the prior session.</p>\n<p><location>Wall Street</location> stocks were lower, with the benchmark S&amp;P 500\ndown 0.66%, the Dow Jones Industrial Average\nfalling 1.25% and the Nasdaq Composite 0.84% lower.\nSemiconductor stocks were down 1.2%.</p>\n<p>&quot;I love semiconductor companies,&quot; said <person>Talley Leger</person>, chief\nmarket strategist at <org>The Wealth Consulting Group</org>. &quot;But I just\nfeel that as a group, the share prices have achieved my return\nobjectives so at this stage I have locked in and protected the\ngains in these stocks since the April lows. That's just prudent\nrisk management on my part.&quot;</p>\n<p>MSCI's All Country World Index was down\n0.37% but on track to gain 0.24% for the week and 1% for\nFebruary.</p>\n<p>&quot;We're just in a stage in the market cycle where not just\nthe market but that particular industry group - semiconductors,\nthat's up more than 100% in a year - have priced in a lot of\ngood news. And now it's time for a breather,&quot; Leger said.</p>\n<p><location value=\"LR/eur\" idsrc=\"xmltag.org\" >Europe's</location> STOXX 600 was up 0.19% after hitting a\nfresh record high.</p>\n<p></p>\n<p>U.S.-<location value=\"LC/ir\" idsrc=\"xmltag.org\" >IRAN</location> TALKS CONTINUE</p>\n<p>Markets were also watching developments in U.S.-<location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location> nuclear\ntalks, as <location value=\"LU/us.dc.wash\" idsrc=\"xmltag.org\" >Washington</location> amassed more military resources in the\n<location value=\"LR/mde\" idsrc=\"xmltag.org\" >Middle East</location>.\nAn Omani mediator gave an optimistic summary of the latest\nnegotiations, but signs of a breakthrough that could avert\npotential U.S. strikes remained elusive.\nThe U.S. and <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location> plan to resume negotiations after\nconsultations in their countries' capitals, Omani Foreign\nMinister <person>Sayyid Badr Albusaidi</person> said in a post on X after the\nday's meetings in <location value=\"LC/ch\" idsrc=\"xmltag.org\" >Switzerland</location>.</p>\n<p>U.S. crude rose 2.48% to <money>$66.85</money> a barrel, and Brent\nrose to <money>$72.60</money>, up 2.6%.</p>\n<p>In the bond market, the yield on benchmark U.S. 10-year\nnotes fell 3.8 basis points to 3.977%. The 2-year\nnote yield fell 4.2 basis points to 3.406%.\nIn <location value=\"LR/eur\" idsrc=\"xmltag.org\" >Europe</location>, the yield on the benchmark German 10-year Bunds\nfell 3.2 basis points to 2.666%.</p>\n<p></p>\n<p>STARMER FALTERS\nSterling was down 0.24% at <money>$1.3449</money> after British Prime\nMinister <person>Keir Starmer's</person> <org>Labour Party</org> suffered an election defeat\nin an area of Greater Manchester that it had dominated for\nalmost a century.\nData in <location value=\"LC/jp\" idsrc=\"xmltag.org\" >Japan</location> showed cooling inflation in <location value=\"LU/jp..tokyo\" idsrc=\"xmltag.org\" >Tokyo</location> and\nweaker-than-expected factory output, complicating the case for\npolicy rate increases by the central bank.</p>\n<p>The yen was up 0.03% to 156.070 against the dollar.</p>\n<p>The dollar index, which measures the greenback\nagainst a basket of currencies, was flat at 97.65. The euro\nwas up 0.17% at <money>$1.1819</money> against the dollar.</p>\n<p>Spot gold rose 1.3% to <money>$5,255.94</money> an ounce. Spot\nsilver rose 5.61% to <money>$93.30</money> an ounce.</p>\n<p>(Reporting by <person>Chibuike Oguh</person> in <location value=\"LU/us.ny.nyc\" idsrc=\"xmltag.org\" >New York</location>; Editing by <person>Hugh Lawson</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/international/202602271159RTRSNEWSCOMBINED_L1N3ZN0GI_1",
            "pub_date": "2026-02-28 00:59:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Top Midday Decliners",
            "description": "\n<p><chron>01:20 PM EST</chron>, <chron>02/27/2026</chron> (MT Newswires) -- <org value=\"FLGT.NaE\" idsrc=\"xmltag.org\" >Fulgent Genetics</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='FLGT' fmr-param-security-type='Equity'>( FLGT )</span>  reported Friday Q4 sales below market expectations, and its forecasts for non-GAAP loss and revenue missed consensus for the full-year 2026.</p><p>Shares sank 37% following a rise in intraday trading volume to over 1.42 million from a daily average of about 211,000.</p><p><org value=\"ZS.NaE\" idsrc=\"xmltag.org\" >Zscaler</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='ZS' fmr-param-security-type='Equity'>( ZS )</span>  delivered strong fiscal Q2 results, beating the market's adjusted earnings and sales expectations. But, CFRA, an independent research provider, told MT Newswires that a slowdown in net new annual recurring revenue additions will be a &quot;key investor concern.&quot;</p><p>Shares of <org value=\"ZS.NaE\" idsrc=\"xmltag.org\" >Zscaler</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='ZS' fmr-param-security-type='Equity'>( ZS )</span> dropped 14%, with intraday trading volume of over 6.82 million against a daily average of roughly 2.23 million.</p><p><org value=\"CRWV.NaE\" idsrc=\"xmltag.org\" >CoreWeave</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='CRWV' fmr-param-security-type='Equity'>( CRWV )</span>  reported a wider Q4 loss, and Macquarie said in a note that sustained investment in growth is ahead of compute coming online. Macquarie cut its price target to <money>$90</money> from <money>$115</money> while keeping its neutral rating.</p><p>&quot;Massive investment needed ahead of monetization remains a recurring theme. Execution at this scale could be choppy,&quot; the research note said.</p><p>Shares of <org value=\"CRWV.NaE\" idsrc=\"xmltag.org\" >CoreWeave</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='CRWV' fmr-param-security-type='Equity'>( CRWV )</span> were down 20% as intraday trading volume catapulted to more than 40 million from a daily average of about 27.2 million.</p><p>Price: 15.55, Change: -9.21, Percent Change: -37.20</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/us-markets/202602271320MIDNIGHTUSEQUITY_A3575283",
            "pub_date": "2026-02-28 02:20:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Sector Update: Health Care",
            "description": "\n<p><chron>01:28 PM EST</chron>, <chron>02/27/2026</chron> (MT Newswires) -- Health care stocks rose Friday afternoon, with the NYSE Health Care Index adding 1.1% and the State Street Health Care Select Sector SPDR ETF (XLV) advancing 1.2%.</p><p>The iShares Biotechnology ETF (IBB) increased 0.5%.</p><p>In corporate news, <org value=\"MRK.NaE\" idsrc=\"xmltag.org\" >Merck</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='MRK' fmr-param-security-type='Equity'>( MRK )</span>  is cutting 154 roles from two locations in <location value=\"LU/us.nc.durham\" idsrc=\"xmltag.org\" >Durham, North Carolina</location>, according to data on the <org>North Carolina Department of Commerce's</org> website. Separately, <org value=\"MRK.NaE\" idsrc=\"xmltag.org\" >Merck</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='MRK' fmr-param-security-type='Equity'>( MRK )</span> said Friday that a phase 3 trial showed Keytruda plus Padcev decreased the risk of event-free survival events by 47% and cut the risk of death by 35% when given before and after surgery compared with chemotherapy and surgery in people with muscle-invasive bladder cancer. <org value=\"MRK.NaE\" idsrc=\"xmltag.org\" >Merck</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='MRK' fmr-param-security-type='Equity'>( MRK )</span> shares were rising 3.3%.</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/us-markets/202602271328MIDNIGHTUSEQUITY_A3575303",
            "pub_date": "2026-02-28 02:28:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Exclusive-Warner Bros signs $110 billion deal with Paramount, its executive discloses in townhall",
            "description": "<p><chron>Feb 27</chron> (Reuters) - <org value=\"WBD.NaE\" idsrc=\"xmltag.org\" >Warner Bros Discovery</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='WBD' fmr-param-security-type='Equity'>( WBD )</span> has agreed to be acquired by <org value=\"PSKY.NaE\" idsrc=\"xmltag.org\" >Paramount Skydance</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='PSKY' fmr-param-security-type='Equity'>( PSKY )</span> in a <money>$110 billion</money> deal signed Friday morning, according to an audio clip of a global townhall by the company, which was reviewed by Reuters.</p>\n<p>&quot;<org value=\"NFLX.NaE\" idsrc=\"xmltag.org\" >Netflix</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NFLX' fmr-param-security-type='Equity'>( NFLX )</span> had the legal right to match the PSKY offer. As you all know, they ultimately decided not to do that. That then resulted in a signed agreement with PSKY as of this morning. So that's where everything stands,&quot; <person>Bruce Campbell</person>, <org>Warner Bros'</org> chief revenue and strategy officer, said in the townhall.</p>\n<p><org>Paramount</org> and <org>Warner Bros</org> did not immediately respond to requests for comment.</p>\n<p>The deal - which includes some <money>$29 billion</money> in debt - is among <location value=\"LU/us.ca.hollyw\" idsrc=\"xmltag.org\" >Hollywood's</location> biggest media shake-ups and will create one of the largest film studios in the world, allowing <org>Paramount</org> to tap Warner's trove of intellectual property, including franchises such as &quot;Fantastic Beasts&quot; and &quot;The Matrix&quot;.</p>\n<p>It will also allow <org>Paramount</org> to bolster its streaming efforts, with a potential combination of HBO Max and Paramount+, enabling it to gain market share and tussle with market leader Netflix. </p>\n<p>The agreement caps a bidding war after <org value=\"NFLX.NaE\" idsrc=\"xmltag.org\" >Netflix</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NFLX' fmr-param-security-type='Equity'>( NFLX )</span> declined to match <org>Paramount's</org> latest <money>$31</money>-per-share offer, which was deemed superior by <org>Warner Bros</org> to the streaming pioneer's <money>$27.75</money>-per-share agreement for its assets.</p>\n<p><org>Paramount</org> was in pursuit of <org>Warner Bros</org> since late last year when it launched a hostile campaign to wrestle the company from the streaming giant by consistently raising its offer. </p>\n<p>The company, led by billionaire <person>Larry Ellison's</person> son <person>David Ellison</person>, enticed Warner's board back to the bargaining table by raising the possibility of an improved cash offer.</p>\n<p>In its revised bid, <org>Paramount</org> raised the termination fee it would pay should the deal fail to gain regulatory approval to <money>$7 billion</money> from <money>$5.8 billion</money>. </p>\n<p>Activist investor <org>Ancora Holdings</org>, which owns a small stake in <org>Warner Bros</org>, had also stepped up pressure on the HBO owner to engage more with <org>Paramount</org>.</p>\n<p>Still, the merger is likely to draw antitrust scrutiny in <location value=\"LS/us.wa\" idsrc=\"xmltag.org\" >Washington</location>, foreign countries and U.S. states, including <location value=\"LS/us.ca\" idsrc=\"xmltag.org\" >California</location>, despite the Ellisons' ties to President <person>Donald Trump</person>. </p>\n<p>Lawmakers on both sides of the political aisle have raised concerns that any deal to acquire <org>Warner Bros</org> could result in fewer choices and higher prices for consumers. </p>\n<p>Cinema operators are also concerned that combining large <location value=\"LU/us.ca.hollyw\" idsrc=\"xmltag.org\" >Hollywood</location> studios could cost jobs and reduce the number of movies released in theaters.  </p>\n<p></p>\n<p> (Reporting by <person>Karol Badohal</person> in <location value=\"LC/pl\" idsrc=\"xmltag.org\" >Poland</location> and <person>Harshita Mary Varghese</person> in Bengaluru; Editing by Arun Koyyur)</p>\n",
            "link": "https://www.fidelity.com/news/article/top-news/202602271340RTRSNEWSCOMBINED_KBN3PH2BF-OUSBS_1",
            "pub_date": "2026-02-28 02:46:14",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Brothers Launch True North Budgeting: Privacy-First Desktop App Offers Calm Alternative as Subscription Fatigue Grows",
            "description": "\n<p><location value=\"LU/us.az.phonix\" idsrc=\"xmltag.org\" >Phoenix, AZ</location>, <chron>Feb.  27, 2026</chron>  (GLOBE NEWSWIRE) -- True North Budgeting, a privacy-first desktop budgeting application created by brothers <person>Ashton and Aaron Alexander</person>, is now available for individuals and households who want a clear picture of where their money goes - without cloud syncing, bank logins, subscriptions, or tracking. The offline budgeting tool launched <chron>February 14, 2026</chron>, and is available for Windows, macOS, and Linux for a one-time price of <money>$49.99</money>.</p>  <p>After years of watching users struggle with overwhelming budgeting apps that demanded bank credentials, monthly fees, and constant connectivity, the Alexander brothers created something different: a budgeting tool designed to reduce anxiety instead of adding to it.</p>  <p>&quot;We kept hearing the same thing: 'I just want to see where my money goes without giving up my privacy or paying forever,'&quot; said <person>Aaron Alexander</person>, co-founder. &quot;That's why we built True North - to give people a calm, private space for their finances that they actually own.&quot;</p>  <p><b>Privacy-First by Design, Not as an Add-On</b></p>  <p>True North Budgeting runs entirely offline, storing budget data locally on the user's device. It does not collect budgeting data, does not include analytics or telemetry, and never asks users to connect bank accounts.</p>  <p>While many budgeting tools prioritize automation and engagement, True North was built around a different premise: budgeting works best when it is calm, private, and user-owned.</p>  <p>In an era where financial apps compete for attention with notifications, gamification, and engagement metrics, True North takes the opposite approach. The interface is deliberately quiet - no alerts, no daily streaks, no social comparisons. Just clear numbers and calm design.</p>  <p>&quot;Privacy-first shouldn't be a premium feature or buried in settings,&quot; said <person>Ashton Alexander</person>, co-founder. &quot;For personal finance, privacy has to be the default. Our goal is a budgeting app that behaves like a notebook - something you own - rather than an account you rent.&quot;</p>  <p><b>Subscription Fatigue Meets Privacy Concerns</b></p>  <p>As financial activity increasingly migrates to cloud platforms, concerns around data exposure continue to grow. Recent industry data shows approximately 80% of organizations experienced cloud security incidents in the past year, with breaches averaging <money>$5.17 million</money> per incident.</p>  <p>Beyond security, recurring subscription models have become standard across software categories. Many budgeting apps charge <money>$10-15</money> monthly while layering on upsells and feature tiers - costs that add up to <money>$120-180</money> annually, or nearly <money>$1,800</money> over ten years.</p>  <p>True North Budgeting's one-time <money>$49.99</money> purchase eliminates recurring fees while keeping budget files on the user's hard drive, never transmitted to external servers.</p>  <p>The timing is notable: True North's launch comes months after Intuit announced the shutdown of Mint, leaving millions of users searching for alternatives. Many former Mint users are reconsidering whether cloud-based financial tools align with their privacy values.</p>  <p><b>Complete Financial View Without Cloud Dependency</b></p>  <p>True North Budgeting includes seven core modules designed to provide complete cash flow visibility without automated bank syncing:</p>  <p><b>Dashboard: </b>Central overview showing upcoming expenses grouped by pay period and 12-month forecast.</p>  <p><b>Income Tracking: </b>Tools for take-home pay tracking across monthly, semi-monthly, and bi-weekly schedules.</p>  <p><b>Expense Management: </b>Categorization using 50/30/20 framework (Needs, Wants, Debt, Investing) with subscription tracking.</p>  <p><b>Assets &amp; Net Worth: </b>Tracking across assets and linked debts to reflect equity and overall financial position.</p>  <p><b>Financial Goals: </b>Savings goals with targets and scheduled contributions aligned to pay periods.</p>  <p><b>Budget Calendar: </b>Color-coded calendar for income, expenses, and goals with click-to-edit events. The visual approach provides clarity that spreadsheet users appreciate - showing when money arrives and leaves at a glance.</p>  <p><b>Insights &amp; Reports: </b>Views covering net worth, emergency fund progress, budget allocation, and debt strategies.</p>  <p><b>Part of a <org>Broader Local-First Movement</org></b></p>  <p>True North Budgeting joins a growing number of applications embracing &quot;local-first&quot; principles - storing user data on devices rather than in the cloud. While this approach has gained traction in productivity and note-taking software, True North brings the philosophy to personal finance.</p>  <p>The local-first approach mirrors trends in note-taking apps like Obsidian, password managers offering local vaults, and productivity tools prioritizing offline functionality - sectors where users increasingly demand data sovereignty alongside features.</p>  <p>&quot;People are asking different questions about the software they rely on,&quot; said Ashton. &quot;Not just 'What does it do?' but 'Who controls it? What does it collect?' True North is our answer for budgeting - a tool that stays with you, on your device, on your terms.&quot;</p>  <p>True North Budgeting is available for Windows, macOS, and Linux at <b>https://truenorthbudgeting.com</b></p>  <p><b>About True North Budgeting</b></p>  <p>True North Budgeting is a privacy-first budgeting tool built to help people create a calmer, more intentional relationship with money. Designed offline by default, it keeps financial data on the user's device with no forced accounts, syncing, or tracking. True North Budgeting is operated by <org>Cash Compass LLC</org>, based in <location value=\"LU/us.az.phonix\" idsrc=\"xmltag.org\" >Phoenix, Arizona</location>.</p>  <p><br/></p>  <p><b>Media Contact<br/></b><b>Company: </b>True North Budgeting<br/><b>Contact: </b><person>Aaron Alexander</person><br/><b>Phone: </b>602-874-8622<br/><b>Email: </b>support@truenorthbudgeting.com<br/><b>Country: </b><location value=\"LC/us\" idsrc=\"xmltag.org\" >United States</location><br/><b>Website: </b>https://truenorthbudgeting.com<br/><b>Social Media: </b>@truenorthbudgeting, @truenorthbudget</p>  Image: https://www.globenewswire.com/newsroom/ti?nf=OTY2MzAyNiM3NDU5NzU1IzUwMDE1OTEzMQ==  <br/> Image: https://ml.globenewswire.com/media/ODMxYzA5YWUtNDk0NS00ZjUyLTk3MDQtNmExNjUzMzU5YjdkLTUwMDE1OTEzMS0yMDI2LTAyLTI3LWVu/tiny/True-North-Budgeting.png <pre>Media Contact\nCompany: True North Budgeting\nContact: <person>Aaron Alexander</person>\nPhone: 602-874-8622\nEmail: support@truenorthbudgeting.com\nCountry: <location value=\"LC/us\" idsrc=\"xmltag.org\" >United States</location>\nWebsite: https://truenorthbudgeting.com\nSocial Media: @truenorthbudgeting, @truenorthbudget</pre>\nSource: True North Budgeting\n",
            "link": "https://www.fidelity.com/news/article/technology/202602271319PRIMZONEFULLFEED9663026",
            "pub_date": "2026-02-28 02:19:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Research Alert: CFRA Maintains Strong Buy Opinion On Shares Of Axon Enterprise, Inc.",
            "description": "\n<p><chron>01:25 PM EST</chron>, <chron>02/27/2026</chron> (MT Newswires) -- CFRA, an independent research provider, has provided MT Newswires with the following research alert. Analysts at CFRA have summarized their opinion as follows:</p><p>We reiterate our 12-month target of <money>$785</money>, 72.8x our 2027 EPS estimate, below AXON's avg. fwd P/E of 100.1x (during the trailing-twelve-month period) but above peers' avg. of 52.8x. Following the strong Q4 beat, we raise our EPS estimates: 2026 by <money>$0.15</money> to <money>$7.94</money> and 2027 by <money>$0.84</money> to <money>$10.78</money>. AXON's fundamental strength is evident in its record bookings of <money>$7.4B</money> (+46% Y/Y) and future contracted bookings of <money>$14.4B</money>. The AI Era Plan generated <money>$750M</money> in bookings during its first full year, demonstrating strong customer adoption. Net revenue retention of 125% reflects expanding wallet share with existing customers. 2026 revenue guidance of 27%-30% growth and new 2028 targets (<money>$6B</money> revenue, 28% EBITDA margin) showcase confidence in the company's product roadmap, including Axon 911, Vehicle Intelligence, and Body Mini. Geographic and vertical expansion into corrections, enterprise, and international markets (which surpassed <money>$1B</money> in bookings) provides multiple growth vectors beyond core U.S. state and local law enforcement.</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/investing-ideas/202602271325MIDNIGHTUSEQUITY_A3575306",
            "pub_date": "2026-02-28 02:25:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Research Alert: CFRA Maintains Buy Opinion On Ads Of Vipshop Holdings",
            "description": "\n<p><chron>01:30 PM EST</chron>, <chron>02/27/2026</chron> (MT Newswires) -- CFRA, an independent research provider, has provided MT Newswires with the following research alert. Analysts at CFRA have summarized their opinion as follows:</p><p>We raise our target to <money>USD21</money> from <money>USD20</money>, on 7.8x our 2026 EPADS forecast, which represents a premium to the stock's three-year average forward P/E of 6.8x. We believe this multiple reasonably reflects (i) <org value=\"VIPS.NaE\" idsrc=\"xmltag.org\" >Vipshop's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='VIPS' fmr-param-security-type='Equity'>( VIPS )</span> strong profitability and well-managed operating expenses; (ii) double-digit growth from the loyal high-end super VIP customer base, which indicates high repeat purchase potential and overall growth; and (iii) an improving macroeconomic backdrop, including a gradual recovery in consumer spending sentiment. We keep our EPADS view at <money>CNY18.50</money> for 2026 and set 2027 at <money>CNY20.32</money>. In our view, <org value=\"VIPS.NaE\" idsrc=\"xmltag.org\" >Vipshop's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='VIPS' fmr-param-security-type='Equity'>( VIPS )</span> strategy, which emphasizes on sustainable growth and continued shareholder returns are able to offset near-term headwinds, positioning the company well for long-term value creation. Although slow consumer sentiment recovery remains a headwind for <location value=\"LC/cn\" idsrc=\"xmltag.org\" >China's</location> consumer market, we expect stable and modest consumer discretionary spending growth supported by Chinese government stimulus measures. Moreover, with the <chron>Chinese New Year</chron> falling in mid-February, we expect some consumption to be deferred, which will contribute to stronger sales in Q1 2026 on a Y/Y basis.</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/investing-ideas/202602271330MIDNIGHTUSEQUITY_A3575308",
            "pub_date": "2026-02-28 02:30:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Market Chatter: Hasbro Sues US Government for Tariff Repayment",
            "description": "\n<p><chron>01:27 PM EST</chron>, <chron>02/27/2026</chron> (MT Newswires) -- <org value=\"HAS.NaE\" idsrc=\"xmltag.org\" >Hasbro</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='HAS' fmr-param-security-type='Equity'>( HAS )</span>  on Friday sued the US government to recover tariff payments made under President <person>Donald Trump's</person> emergency trade measures, which were deemed illegal by the <org>US Supreme Court</org> last week, Reuters reported, citing court documents.</p><p><org value=\"HAS.NaE\" idsrc=\"xmltag.org\" >Hasbro</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='HAS' fmr-param-security-type='Equity'>( HAS )</span> didn't immediately reply to a request for comment from MT Newswires.</p><p>(Market Chatter news is derived from conversations with market professionals globally. This information is believed to be from reliable sources but may include rumor and speculation. Accuracy is not guaranteed.)</p><p>Price: 99.68, Change: -0.69, Percent Change: -0.68</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602271327MIDNIGHTUSEQUITY_A3575304",
            "pub_date": "2026-02-28 02:27:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Cheniere gets $370 million 'alternative fuel' tax break from Trump's IRS",
            "description": "<p><location value=\"LU/us.dc.wash\" idsrc=\"xmltag.org\" >WASHINGTON</location>, <chron>Feb 27</chron> (Reuters) - <org value=\"LNG.NaE\" idsrc=\"xmltag.org\" >Cheniere Energy Inc</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='LNG' fmr-param-security-type='Equity'>( LNG )</span>\ndisclosed this week that it got a <money>$370 million</money> tax break\nfrom the Trump administration for burning liquefied natural gas\nin its massive tankers, a credit critics said was meant for far\nsmaller boats.</p>\n<p>The company said on Thursday in financial disclosures that\nit had won the alternative fuels tax break from the IRS. The tax\ncredit was in a law signed by former President <person>George W. Bush</person> in\n2005 that was designed to subsidize an array of alternative\nfuels derived from sources including biomass, coal and natural\ngas.</p>\n<p>The credit was designed to be claimed by parties operating\nmotor vehicles or motorboats. The IRS does not define the size\nof a motorboat, but other federal regulations define them as\nsmaller than 65 feet long (20 m), tiny compared to LNG tankers,\nwhich can measure about three football fields long.</p>\n<p>&quot;Cheniere took a very aggressive position&quot; on the tax\ncredit, said <person>William Henck</person>, a former IRS lawyer. &quot;Does a tanker\nsound like a motorboat?&quot;</p>\n<p>Lukas Shankar-Ross, a deputy director at the environmental\nnonprofit group <org>Friends of the Earth</org>, called Cheniere's claiming\nof the credit a &quot;new kind of fabulous and incredulous\ninterpretation of the tax code that has been rubber-stamped by\nan IRS whose independence is increasingly in question.&quot;</p>\n<p>Cheniere's disclosure was first reported by the <org>Washington\nPost</org>.\nCheniere, whose CEO <person>Jack Fusco</person> donated to President <person>Donald\nTrump's</person> 2024 campaign, declined to comment. The IRS did not\nimmediately respond to a request for comment.\nCheniere, which exported the first LNG cargo from the lower 48\nstates 10 years ago, told Reuters earlier that it has invested\n<money>$50 billion</money> in growing its two export facilities in <location value=\"LS/us.tx\" idsrc=\"xmltag.org\" >Texas</location> and\n<location value=\"LS/us.la\" idsrc=\"xmltag.org\" >Louisiana</location> over the decade and aims to double output to 100\nmillion tons per annum by the mid-2030s.</p>\n<p>(Reporting by <person>Timothy Gardner</person>; Editing by <person>Mark Porter</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602271329RTRSNEWSCOMBINED_L1N3ZN0YG_1",
            "pub_date": "2026-02-28 02:29:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Kansas City Fed Services Index Rises in February",
            "description": "\n<p><chron>11:22 AM EST</chron>, <chron>02/27/2026</chron> (MT Newswires) -- The Kansas City Federal Reserve's monthly composite services index rose to a reading of 6 in February after coming in at 2 in January, higher than reading of 2 expected in a survey compiled by <org>Bloomberg</org>.</p><p>The other regional services measures already released have indicated mixed readings.</p><p>There was an increase in the <location value=\"LU/us.mo.kancty\" idsrc=\"xmltag.org\" >Kansas City</location> revenue/sales reading to 15 from 4, while the employment reading declined to negative 5 from negative 3.</p><p>The reading of selling prices declined to 14 from 21, while the input price index fell to 31 from 39. A reading above zero indicates growth.</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/us-economy/202602271122MIDNIGHTUSEQUITY_A3575187",
            "pub_date": "2026-02-28 00:22:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US Equity Indexes Slump as Technology Wobbles Amid Hot Inflation Print",
            "description": "\n<p><chron>01:06 PM EST</chron>, <chron>02/27/2026</chron> (MT Newswires) -- US equity indexes fell in midday trading on Friday after producer price inflation data turned hot and technology remained under pressure.</p><p>The Dow Jones Industrial Average declined 1.5% to 48,765.3, the Nasdaq Composite fell 0.8% to 22,626.5, and the S&amp;P 500 slid 0.8% to 6,855.2.</p><p>Financials and technology led the decliners, while consumer staples and health care were top gainers.</p><p>The US Producer Price Index rose by 0.5% in January following a 0.4% increase in December, according to the <org>Bureau of Labor Statistics</org> on Friday, above the 0.3% gain expected in a <org>Bloomberg</org> survey. After excluding the more volatile food and energy prices, core PPI rose by 0.8%, more than the 0.3% gain anticipated and following a 0.6% jump in the previous month.</p><p>PPI was up 2.9% year-over-year in January after a 3.0% gain in December, while core prices rose by 3.6% following a 3.3% rise.</p><p>A sizable upswing in producer prices underscores the Federal Reserve's unfinished battle with inflation, and the flaws in the Federal Open Market Committee's &quot;longstanding passive and light-handed approach,&quot; according to a Stifel research note.</p><p>&quot;While one data point does not make a trend, and much of the increase was isolated to trade services, any further confirmation of a reacceleration of cost pressures will not only solidify the Fed's position on the sidelines for some time despite outside pressure and furthermore call into question earlier rate cuts, but increasingly raise the notion of whether or not policy has become too accommodative,&quot; the note added.</p><p>Most US Treasury yields declined, with the two-year down 5.1 basis points to 3.41%. The 10-year yield dropped 4.7 basis points to 3.97%, heading for the lowest since late 2024.</p><p>In company news, Block (XYZ) shares soared 15%, among the top gainers on the S&amp;P 500, after the financial technology company posted higher Q4 adjusted net income and revenue. It also announced a plan to cut its current workforce by more than 40%.</p><p>&quot;Gross profit continues to grow, we continue to serve more and more customers, and profitability is improving,&quot; Block Co-founder <person>Jack Dorsey</person> wrote in a post. &quot;But something has changed. We're already seeing that the intelligence tools we're creating and using, paired with smaller and flatter teams, are enabling a new way of working which fundamentally changes what it means to build and run a company.&quot;</p><p>Shares of <org value=\"CRWV.NaE\" idsrc=\"xmltag.org\" >CoreWeave</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='CRWV' fmr-param-security-type='Equity'>( CRWV )</span>  sank 19% after the cloud infrastructure company focused on artificial intelligence reported a wider Q4 loss. Earnings missed, with sustained investment in growth ahead of compute coming online, a Macquarie note said while cutting <org value=\"CRWV.NaE\" idsrc=\"xmltag.org\" >CoreWeave's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='CRWV' fmr-param-security-type='Equity'>( CRWV )</span> price target to <money>$90</money> from <money>$115</money>. &quot;Massive investment needed ahead of monetization remains a recurring theme. Execution at this scale could be choppy.&quot;</p><p><org value=\"ZS.NaE\" idsrc=\"xmltag.org\" >Zscaler</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='ZS' fmr-param-security-type='Equity'>( ZS )</span>  delivered strong fiscal Q2 results, beating the market's adjusted earnings and sales expectations. However, CFRA, an independent research provider, told MT Newswires that a slowdown in net new annual recurring revenue additions will be a &quot;key investor concern.&quot; Shares of the cloud security company slumped 15%, the steepest decline in the Nasdaq.</p><p>In energy markets, West Texas Intermediate crude oil futures jumped 2.1% to <money>$66.58</money> a barrel as a third round of indirect talks in <location value=\"LU/ch..geneva\" idsrc=\"xmltag.org\" >Geneva, Switzerland</location>, between the US and <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location> ended with an agreement to meet again next week.</p><p>In precious metals, gold futures rose 1% to <money>$5,246.9</money> per troy ounce, and silver futures jumped 7.4% to <money>$93.43</money> per troy ounce.</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/us-markets/202602271306MIDNIGHTUSEQUITY_A3575272",
            "pub_date": "2026-02-28 02:06:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Exchange-Traded Funds Decline as US Equities Fall After Midday",
            "description": "\n<p><chron>01:09 PM EST</chron>, <chron>02/27/2026</chron> (MT Newswires) -- Broad Market Indicators</p><p>Broad-market exchange-traded funds IWM and IVV were lower. Actively traded <org>Invesco QQQ Trust</org> (QQQ) was down 0.5%.</p><p>US equity indexes fell in midday trading on Friday following a higher-than-expected producer price report.</p><p>Energy</p><p>IShares US Energy ETF (IYE) was up 0.7%, and the State Street Energy Select Sector SPDR (XLE) rose 1.2%.</p><p>Technology</p><p>The State Street Technology Select Sector SPDR ETF (XLK) fell 1.6%; iShares US Technology ETF (IYW) and iShares Expanded Tech Sector ETF (IGM) were also lower.</p><p>The State Street SPDR S&amp;P Semiconductor (XSD) dropped 2.6%, and iShares Semiconductor (SOXX) was down 1.8%.</p><p>Financial</p><p>The State Street Financial Select Sector SPDR (XLF) dipped 2.4%. Direxion Daily Financial Bull 3X Shares (FAS) dropped 7.2%, and its bearish counterpart, Direxion Daily Financial Bear 3X Shares (FAZ), climbed 7.4%.</p><p>Commodities</p><p>Crude oil added 2.2%, and the United States Oil Fund (USO) was up 2%. Natural gas gained 1%, and the United States Natural Gas Fund (UNG) rose 1.1%.</p><p>Gold on Comex was up 1.1%, and the State Street SPDR Gold Shares (GLD) rose 0.8%. Silver added 7.7%, and iShares Silver Trust (SLV) gained 5.4%.</p><p>Consumer</p><p>The State Street Consumer Staples Select Sector SPDR (XLP) added 1.1%. The Vanguard Consumer Staples ETF (VDC) and iShares Dow Jones US Consumer Goods (IYK) also advanced.</p><p>The State Street Consumer Discretionary Select Sector SPDR (XLY) fell 0.7%. VanEck Retail ETF (RTH) rose 0.5%, and the State Street SPDR S&amp;P Retail (XRT) slipped 1%.</p><p>Health Care</p><p>The State Street Health Care Select Sector SPDR (XLV) was up 1.1%, and iShares <org>US Healthcare</org> (IYH) and Vanguard Health Care ETF (VHT) edged higher. IShares Biotechnology ETF (IBB) rose 0.4%.</p><p>Industrial</p><p>The State Street Industrial Select Sector SPDR (XLI) was down 0.5%. Vanguard Industrials Index Fund (VIS) and iShares US Industrials (IYJ) were in the red.</p><p>Cryptocurrency</p><p>In midday activity, bitcoin (BTC-USD) fell 1.7%. Among cryptocurrency ETFs, <org value=\"BITO.NaE\" idsrc=\"xmltag.org\" >ProShares Bitcoin ETF</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='BITO' fmr-param-security-type='Equity'>( BITO )</span>  lost 2.7%, <org value=\"EETH.NaE\" idsrc=\"xmltag.org\" >ProShares Ether ETF</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='EETH' fmr-param-security-type='Equity'>( EETH )</span>  dropped 4.7%, and <org value=\"BETH.NaE\" idsrc=\"xmltag.org\" >ProShares Bitcoin &amp; Ether Market Cap Weight ETF</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='BETH' fmr-param-security-type='Equity'>( BETH )</span>  shed 3.3%.</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/us-markets/202602271309MIDNIGHTUSEQUITY_A3575285",
            "pub_date": "2026-02-28 02:09:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "11 Analysts Assess OneStream: What You Need To Know",
            "description": "\n<p><org value=\"OS.NaE\" idsrc=\"xmltag.org\" >OneStream</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='OS' fmr-param-security-type='Equity'>( OS )</span> has been analyzed by 11 analysts in the last three months, revealing a diverse range of perspectives from bullish to bearish.</p>\n<p>Summarizing their recent assessments, the table below illustrates the evolving sentiments in the past 30 days and compares them to the preceding months.</p>\n<table>\n<thead>\n<tr>\n<th></th>\n<th align=\"right\"><strong>Bullish</strong></th>\n<th align=\"right\"><strong>Somewhat Bullish</strong></th>\n<th align=\"right\"><strong>Indifferent</strong></th>\n<th align=\"right\"><strong>Somewhat Bearish</strong></th>\n<th align=\"right\"><strong>Bearish</strong></th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td><strong>Total Ratings</strong></td>\n<td align=\"right\">2</td>\n<td align=\"right\">0</td>\n<td align=\"right\">8</td>\n<td align=\"right\">1</td>\n<td align=\"right\">0</td>\n</tr>\n<tr>\n<td><strong>Last 30D</strong></td>\n<td align=\"right\">0</td>\n<td align=\"right\">0</td>\n<td align=\"right\">0</td>\n<td align=\"right\">0</td>\n<td align=\"right\">0</td>\n</tr>\n<tr>\n<td><strong>1M Ago</strong></td>\n<td align=\"right\">0</td>\n<td align=\"right\">0</td>\n<td align=\"right\">0</td>\n<td align=\"right\">0</td>\n<td align=\"right\">0</td>\n</tr>\n<tr>\n<td><strong>2M Ago</strong></td>\n<td align=\"right\">0</td>\n<td align=\"right\">0</td>\n<td align=\"right\">7</td>\n<td align=\"right\">1</td>\n<td align=\"right\">0</td>\n</tr>\n<tr>\n<td><strong>3M Ago</strong></td>\n<td align=\"right\">2</td>\n<td align=\"right\">0</td>\n<td align=\"right\">1</td>\n<td align=\"right\">0</td>\n<td align=\"right\">0</td>\n</tr>\n</tbody>\n</table>\n\n<p>The 12-month price targets, analyzed by analysts, offer insights with an average target of <money>$24.27</money>, a high estimate of <money>$26.00</money>, and a low estimate of <money>$24.00</money>. This current average has decreased by 5.45% from the previous average price target of <money>$25.67</money>. </p>\n<p><img src=\"https://www.benzinga.com/files/images/story/2026/1772215250_0.png\" alt=\"price target chart\" /></p>\n\n<h2>Understanding Analyst Ratings: A Comprehensive Breakdown</h2>\n<p>The standing of <org value=\"OS.NaE\" idsrc=\"xmltag.org\" >OneStream</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='OS' fmr-param-security-type='Equity'>( OS )</span> among financial experts is revealed through an in-depth exploration of recent analyst actions. The summary below outlines key analysts, their recent evaluations, and adjustments to ratings and price targets.</p>\n<table>\n<thead>\n<tr>\n<th>Analyst</th>\n<th>Analyst Firm</th>\n<th>Action Taken</th>\n<th>Rating</th>\n<th>Current Price Target</th>\n<th>Prior Price Target</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td><person>Mark Murphy</person></td>\n<td>JP Morgan</td>\n<td>Raises</td>\n<td>Underweight</td>\n<td><money>$24.00</money></td>\n<td><money>$23.00</money></td>\n</tr>\n<tr>\n<td><person>Derrick Wood</person></td>\n<td>TD Cowen</td>\n<td>Lowers</td>\n<td>Hold</td>\n<td><money>$24.00</money></td>\n<td><money>$27.00</money></td>\n</tr>\n<tr>\n<td><person>Robert Simmons</person></td>\n<td>Rosenblatt</td>\n<td>Lowers</td>\n<td>Neutral</td>\n<td><money>$24.00</money></td>\n<td><money>$26.00</money></td>\n</tr>\n<tr>\n<td><person>Mark Schappel</person></td>\n<td><location>Loop Capital</location></td>\n<td>Lowers</td>\n<td>Hold</td>\n<td><money>$24.00</money></td>\n<td><money>$25.00</money></td>\n</tr>\n<tr>\n<td><person>Siti Panigrahi</person></td>\n<td>Mizuho</td>\n<td>Lowers</td>\n<td>Neutral</td>\n<td><money>$24.00</money></td>\n<td><money>$25.00</money></td>\n</tr>\n<tr>\n<td><person>Chris Quintero</person></td>\n<td>Morgan Stanley</td>\n<td>Lowers</td>\n<td>Equal-Weight</td>\n<td><money>$24.00</money></td>\n<td><money>$27.00</money></td>\n</tr>\n<tr>\n<td><person>Daniel Jester</person></td>\n<td><org>BMO Capital</org></td>\n<td>Lowers</td>\n<td>Market Perform</td>\n<td><money>$24.00</money></td>\n<td><money>$25.00</money></td>\n</tr>\n<tr>\n<td><person>Hannah Rudoff</person></td>\n<td>Piper Sandler</td>\n<td>Lowers</td>\n<td>Neutral</td>\n<td><money>$24.00</money></td>\n<td><money>$28.00</money></td>\n</tr>\n<tr>\n<td><person>Steven Enders</person></td>\n<td>Citigroup</td>\n<td>Lowers</td>\n<td>Neutral</td>\n<td><money>$24.00</money></td>\n<td><money>$25.00</money></td>\n</tr>\n<tr>\n<td><person>Nick Altmann</person></td>\n<td>BTIG</td>\n<td>Announces</td>\n<td>Buy</td>\n<td><money>$25.00</money></td>\n<td>-</td>\n</tr>\n<tr>\n<td><person>Robert Simmons</person></td>\n<td>Rosenblatt</td>\n<td>Announces</td>\n<td>Buy</td>\n<td><money>$26.00</money></td>\n<td>-</td>\n</tr>\n</tbody>\n</table>\n\n<h3>Key Insights:</h3>\n<ul>\n<li><strong>Action Taken:</strong> Responding to changing market dynamics and company performance, analysts update their recommendations. Whether they 'Maintain', 'Raise', or 'Lower' their stance, it signifies their response to recent developments related to <org value=\"OS.NaE\" idsrc=\"xmltag.org\" >OneStream</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='OS' fmr-param-security-type='Equity'>( OS )</span>. This offers insight into analysts' perspectives on the current state of the company.</li>\n<li><strong>Rating:</strong> Gaining insights, analysts provide qualitative assessments, ranging from 'Outperform' to 'Underperform'. These ratings reflect expectations for the relative performance of <org value=\"OS.NaE\" idsrc=\"xmltag.org\" >OneStream</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='OS' fmr-param-security-type='Equity'>( OS )</span> compared to the broader market.</li>\n<li><strong>Price Targets:</strong> Analysts set price targets as an estimate of a stock's future value. Comparing the current and prior price targets provides insight into how analysts' expectations have changed over time. This information can be valuable for investors seeking to understand consensus views on the stock's potential future performance.</li>\n</ul>\n<p>Navigating through these analyst evaluations alongside other financial indicators can contribute to a holistic understanding of <org value=\"OS.NaE\" idsrc=\"xmltag.org\" >OneStream's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='OS' fmr-param-security-type='Equity'>( OS )</span> market standing. Stay informed and make data-driven decisions with our Ratings Table.</p>\n<p><strong>Stay up to date on <org value=\"OS.NaE\" idsrc=\"xmltag.org\" >OneStream</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='OS' fmr-param-security-type='Equity'>( OS )</span> analyst ratings.</strong></p>\n<h2>About OneStream</h2>\n<p><org value=\"OS.NaE\" idsrc=\"xmltag.org\" >OneStream Inc</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='OS' fmr-param-security-type='Equity'>( OS )</span> is an AI-enabled and extensible software platform that unifies core financial functions and broader operational data and processes within a single platform. The Digital Finance Cloud of the company provides a comprehensive, dynamic, and predictive view of the entire enterprise, providing corporate leaders the control, visibility, and agility required to proactively adjust business and day-to-day execution. Company platform unifies core financial and operational data and processes within a single platform, with solutions that maintain the integrity of corporate reporting standards for Finance while providing operationally insights for business users.</p>\n<h3>OneStream's Economic Impact: An Analysis</h3>\n<p><strong>Market Capitalization:</strong> Indicating a reduced size compared to industry averages, the company's market capitalization poses unique challenges.</p>\n<p><strong>Revenue Growth:</strong> <org value=\"OS.NaE\" idsrc=\"xmltag.org\" >OneStream's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='OS' fmr-param-security-type='Equity'>( OS )</span> remarkable performance in 3M is evident. As of <chron>30 September, 2025</chron>, the company achieved an impressive revenue growth rate of <strong>19.49%</strong>. This signifies a substantial increase in the company's top-line earnings. As compared to competitors, the company encountered difficulties, with a growth rate lower than the average among peers in the Information Technology sector.</p>\n<p><strong>Net Margin:</strong> <org value=\"OS.NaE\" idsrc=\"xmltag.org\" >OneStream's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='OS' fmr-param-security-type='Equity'>( OS )</span> net margin is below industry averages, indicating potential challenges in maintaining strong profitability. With a net margin of <strong>-5.74%,</strong> the company may face hurdles in effective cost management.</p>\n<p><strong>Return on Equity (ROE):</strong> <org value=\"OS.NaE\" idsrc=\"xmltag.org\" >OneStream's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='OS' fmr-param-security-type='Equity'>( OS )</span> ROE is below industry averages, indicating potential challenges in efficiently utilizing equity capital. With an ROE of <strong>-1.9%,</strong> the company may face hurdles in achieving optimal financial returns.</p>\n<p><strong>Return on Assets (ROA):</strong> <org value=\"OS.NaE\" idsrc=\"xmltag.org\" >OneStream's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='OS' fmr-param-security-type='Equity'>( OS )</span> ROA is below industry averages, indicating potential challenges in efficiently utilizing assets. With an ROA of <strong>-0.95%,</strong> the company may face hurdles in achieving optimal financial returns.</p>\n<p><strong>Debt Management:</strong> <org value=\"OS.NaE\" idsrc=\"xmltag.org\" >OneStream's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='OS' fmr-param-security-type='Equity'>( OS )</span> debt-to-equity ratio is below the industry average. With a ratio of <b>0.04</b>, the company relies less on debt financing, maintaining a healthier balance between debt and equity, which can be viewed positively by investors.</p>\n<h2>The Core of Analyst Ratings: What Every Investor Should Know</h2>\n<p>Analysts are specialists within banking and financial systems that typically report for specific stocks or within defined sectors. These people research company financial statements, sit in conference calls and meetings, and speak with relevant insiders to determine what are known as analyst ratings for stocks. Typically, analysts will rate each stock once a quarter. </p>\n<p>Some analysts publish their predictions for metrics such as growth estimates, earnings, and revenue to provide additional guidance with their ratings. When using analyst ratings, it is important to keep in mind that stock and sector analysts are also human and are only offering their opinions to investors.</p>\n<p>This article was generated by Benzinga's automated content engine and reviewed by an editor.</p>\n",
            "link": "https://www.fidelity.com/news/article/technology/202602271300BENZINGAFULLNGTH50938398",
            "pub_date": "2026-02-28 02:00:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Intuit Stock: A Deep Dive Into Analyst Perspectives (10 Ratings)",
            "description": "\n<p>Ratings for Intuit were provided by 10 analysts in the past three months, showcasing a mix of bullish and bearish perspectives.</p>\n<p>The table below provides a concise overview of recent ratings by analysts, offering insights into the changing sentiments over the past 30 days and drawing comparisons with the preceding months for a holistic perspective.</p>\n<table>\n<thead>\n<tr>\n<th></th>\n<th align=\"right\"><strong>Bullish</strong></th>\n<th align=\"right\"><strong>Somewhat Bullish</strong></th>\n<th align=\"right\"><strong>Indifferent</strong></th>\n<th align=\"right\"><strong>Somewhat Bearish</strong></th>\n<th align=\"right\"><strong>Bearish</strong></th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td><strong>Total Ratings</strong></td>\n<td align=\"right\">3</td>\n<td align=\"right\">5</td>\n<td align=\"right\">2</td>\n<td align=\"right\">0</td>\n<td align=\"right\">0</td>\n</tr>\n<tr>\n<td><strong>Last 30D</strong></td>\n<td align=\"right\">0</td>\n<td align=\"right\">3</td>\n<td align=\"right\">0</td>\n<td align=\"right\">0</td>\n<td align=\"right\">0</td>\n</tr>\n<tr>\n<td><strong>1M Ago</strong></td>\n<td align=\"right\">1</td>\n<td align=\"right\">2</td>\n<td align=\"right\">1</td>\n<td align=\"right\">0</td>\n<td align=\"right\">0</td>\n</tr>\n<tr>\n<td><strong>2M Ago</strong></td>\n<td align=\"right\">2</td>\n<td align=\"right\">0</td>\n<td align=\"right\">1</td>\n<td align=\"right\">0</td>\n<td align=\"right\">0</td>\n</tr>\n<tr>\n<td><strong>3M Ago</strong></td>\n<td align=\"right\">0</td>\n<td align=\"right\">0</td>\n<td align=\"right\">0</td>\n<td align=\"right\">0</td>\n<td align=\"right\">0</td>\n</tr>\n</tbody>\n</table>\n\n<p>Analysts have set 12-month price targets for Intuit, revealing an average target of <money>$634.2</money>, a high estimate of <money>$802.00</money>, and a low estimate of <money>$425.00</money>. A negative shift in sentiment is evident as analysts have decreased the average price target by 21.23%. </p>\n<p><img src=\"https://www.benzinga.com/files/images/story/2026/1772215272_0_0.png\" alt=\"price target chart\" /></p>\n\n<h2>Diving into Analyst Ratings: An In-Depth Exploration</h2>\n<p>The analysis of recent analyst actions sheds light on the perception of Intuit by financial experts. The following summary presents key analysts, their recent evaluations, and adjustments to ratings and price targets.</p>\n<table>\n<thead>\n<tr>\n<th>Analyst</th>\n<th>Analyst Firm</th>\n<th>Action Taken</th>\n<th>Rating</th>\n<th>Current Price Target</th>\n<th>Prior Price Target</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td><person>Rishi Jaluria</person></td>\n<td><org>RBC Capital</org></td>\n<td>Lowers</td>\n<td>Outperform</td>\n<td><money>$600.00</money></td>\n<td><money>$850.00</money></td>\n</tr>\n<tr>\n<td><person>Scott Schneeberger</person></td>\n<td>Oppenheimer</td>\n<td>Lowers</td>\n<td>Outperform</td>\n<td><money>$558.00</money></td>\n<td><money>$696.00</money></td>\n</tr>\n<tr>\n<td><person>Kirk Materne</person></td>\n<td><org>Evercore ISI Group</org></td>\n<td>Lowers</td>\n<td>Outperform</td>\n<td><money>$540.00</money></td>\n<td><money>$875.00</money></td>\n</tr>\n<tr>\n<td><person>Michael Turrin</person></td>\n<td>Wells Fargo</td>\n<td>Lowers</td>\n<td>Equal-Weight</td>\n<td><money>$425.00</money></td>\n<td><money>$700.00</money></td>\n</tr>\n<tr>\n<td><person>Daniel Jester</person></td>\n<td><org>BMO Capital</org></td>\n<td>Lowers</td>\n<td>Outperform</td>\n<td><money>$624.00</money></td>\n<td><money>$810.00</money></td>\n</tr>\n<tr>\n<td><person>Jared Levine</person></td>\n<td>TD Cowen</td>\n<td>Lowers</td>\n<td>Buy</td>\n<td><money>$658.00</money></td>\n<td><money>$802.00</money></td>\n</tr>\n<tr>\n<td><person>Scott Schneeberger</person></td>\n<td>Oppenheimer</td>\n<td>Lowers</td>\n<td>Outperform</td>\n<td><money>$696.00</money></td>\n<td><money>$868.00</money></td>\n</tr>\n<tr>\n<td><person>Michael Turrin</person></td>\n<td>Wells Fargo</td>\n<td>Lowers</td>\n<td>Equal-Weight</td>\n<td><money>$700.00</money></td>\n<td><money>$840.00</money></td>\n</tr>\n<tr>\n<td><person>Jared Levine</person></td>\n<td>TD Cowen</td>\n<td>Announces</td>\n<td>Buy</td>\n<td><money>$802.00</money></td>\n<td>-</td>\n</tr>\n<tr>\n<td><person>Arvind Ramnani</person></td>\n<td><org>Truist Securities</org></td>\n<td>Announces</td>\n<td>Buy</td>\n<td><money>$739.00</money></td>\n<td>-</td>\n</tr>\n</tbody>\n</table>\n\n<h3>Key Insights:</h3>\n<ul>\n<li><strong>Action Taken:</strong> Analysts adapt their recommendations to changing market conditions and company performance. Whether they 'Maintain', 'Raise' or 'Lower' their stance, it reflects their response to recent developments related to Intuit. This information provides a snapshot of how analysts perceive the current state of the company.</li>\n<li><strong>Rating:</strong> Unveiling insights, analysts deliver qualitative insights into stock performance, from 'Outperform' to 'Underperform'. These ratings convey expectations for the relative performance of Intuit compared to the broader market.</li>\n<li><strong>Price Targets:</strong> Analysts navigate through adjustments in price targets, providing estimates for Intuit's future value. Comparing current and prior targets offers insights into analysts' evolving expectations.</li>\n</ul>\n<p>Analyzing these analyst evaluations alongside relevant financial metrics can provide a comprehensive view of Intuit's market position. Stay informed and make data-driven decisions with the assistance of our Ratings Table.</p>\n<p><strong>Stay up to date on Intuit analyst ratings.</strong></p>\n<h2>Discovering Intuit: A Closer Look</h2>\n<p>Intuit serves small and midsize businesses with accounting software QuickBooks and online marketing platform Mailchimp. The company also operates retail tax filing tool TurboTax, personal finance platform Credit Karma, and a suite of professional tax offerings for accountants. Founded in the mid-1980s, Intuit enjoys a dominant market share for small-to-midsize business accounting and self-serve tax filing in the US.</p>\n<h3>Key Indicators: Intuit's Financial Health</h3>\n<p><strong>Market Capitalization Highlights:</strong> Above the industry average, the company's market capitalization signifies a significant scale, indicating strong confidence and market prominence.</p>\n<p><strong>Revenue Growth:</strong> Intuit's revenue growth over a period of 3M has been noteworthy. As of <chron>31 October, 2025</chron>, the company achieved a revenue growth rate of approximately <strong>18.34%</strong>. This indicates a substantial increase in the company's top-line earnings. As compared to its peers, the revenue growth lags behind its industry peers. The company achieved a growth rate lower than the average among peers in Information Technology sector.</p>\n<p><strong>Net Margin:</strong> Intuit's financial strength is reflected in its exceptional net margin, which exceeds industry averages. With a remarkable net margin of <strong>11.48%,</strong> the company showcases strong profitability and effective cost management.</p>\n<p><strong>Return on Equity (ROE):</strong> Intuit's ROE lags behind industry averages, suggesting challenges in maximizing returns on equity capital. With an ROE of <strong>2.29%,</strong> the company may face hurdles in achieving optimal financial performance.</p>\n<p><strong>Return on Assets (ROA):</strong> Intuit's financial strength is reflected in its exceptional ROA, which exceeds industry averages. With a remarkable ROA of <strong>1.27%,</strong> the company showcases efficient use of assets and strong financial health.</p>\n<p><strong>Debt Management:</strong> With a below-average debt-to-equity ratio of <strong>0.36</strong>, Intuit adopts a prudent financial strategy, indicating a balanced approach to debt management.</p>\n<h2>How Are Analyst Ratings Determined?</h2>\n<p>Benzinga tracks 150 analyst firms and reports on their stock expectations. Analysts typically arrive at their conclusions by predicting how much money a company will make in the future, usually the upcoming five years, and how risky or predictable that company's revenue streams are.</p>\n<p>Analysts attend company conference calls and meetings, research company financial statements, and communicate with insiders to publish their ratings on stocks. Analysts typically rate each stock once per quarter or whenever the company has a major update.</p>\n<p>Beyond their standard evaluations, some analysts contribute predictions for metrics like growth estimates, earnings, and revenue, furnishing investors with additional guidance. Users of analyst ratings should be mindful that this specialized advice is shaped by human perspectives and may be subject to variability.</p>\n<p>This article was generated by Benzinga's automated content engine and reviewed by an editor.</p>\n",
            "link": "https://www.fidelity.com/news/article/technology/202602271301BENZINGAFULLNGTH50938421",
            "pub_date": "2026-02-28 02:01:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "UnitedHealth caps employee pay raises to 2%, Bloomberg News reports",
            "description": "\n<p><chron>Feb 27</chron> (Reuters) - <org value=\"UNH.NaE\" idsrc=\"xmltag.org\" >UnitedHealth Group</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='UNH' fmr-param-security-type='Equity'>( UNH )</span> has limited employee pay raises this year to between 0% and 2%, depending on performance, <org>Bloomberg News</org> reported on Friday, citing a person familiar with the matter.</p>    *         The modest compensation increases come as the companyrecently told an unspecified number of workers they were beinglaid off, <org>Bloomberg</org> reported, citing the person.          *         <org value=\"UNH.NaE\" idsrc=\"xmltag.org\" >UnitedHealth</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='UNH' fmr-param-security-type='Equity'>( UNH )</span> did not immediately respond to a Reutersrequest for comment.          *         The company earlier this year         said         2026 revenue would decline for the first time indecades.          *         The company's shares were also pressured after the Trumpadministration proposed a much smaller-than-expected increase to2027 <org>Medicare Advantage</org> rates.<p> (Reporting by Sneha S K in Bengaluru; Editing by <person>Tasim Zahid</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602271305RTRSNEWSCOMBINED_KBN3PH27Q-OUSBS_1",
            "pub_date": "2026-02-28 02:05:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Quantum eMotion to Buy SKV Technology Assets",
            "description": "\n<p><chron>01:06 PM EST</chron>, <chron>02/27/2026</chron> (MT Newswires) -- <org value=\"QNC.NaE\" idsrc=\"xmltag.org\" >Quantum eMotion</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='QNC' fmr-param-security-type='Equity'>( QNC )</span>  on Friday said it entered into an agreement to buy key technology assets through the acquisition of SKV Technology, a <location value=\"LS/us.ca\" idsrc=\"xmltag.org\" >California</location>-based cybersecurity company.</p><p>The assets include the SecureKey platform developed and commercialized by Jet Lab Technologies) and held by SKV. <person>Jason Thomas</person>, founder of <org>SKV and Jet Lab</org> and lead technologist of <org>Jet Lab</org>, will be joining <org value=\"QNC.NaE\" idsrc=\"xmltag.org\" >Quantum eMotion</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='QNC' fmr-param-security-type='Equity'>( QNC )</span> in an executive development role</p><p>The company said in consideration, it will make milestone-based earn-out payments of up to <money>$7 million</money>, payable at its election in cash, shares of the company, or a combination thereof. <org value=\"QNC.NaE\" idsrc=\"xmltag.org\" >Quantum eMotion</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='QNC' fmr-param-security-type='Equity'>( QNC )</span> will also pay royalties of up to <money>$15 million</money>, subject to specified sales thresholds, on products incorporating the SecureKey technology for a term of up to five years.</p><p>The earn-out payments will be contingent upon the achievement of defined technical and integration milestones centered on the successful realization of the combined Sentry-Q + SecureKey full-stack quantum-resilient security architecture. Closing is expected to occur on or about <chron>March 2</chron>.</p><p>Shares of the company were last seen up <money>$0.07</money> to <money>$5.00</money> on the <org>TSX Venture Exchange</org>.</p><p>Price: 5.00, Change: +0.07, Percent Change: +1.42</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602271306MIDNIGHTUSEQUITY_A3575281",
            "pub_date": "2026-02-28 02:06:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Research Alert: CFRA Maintains Hold Opinion On Shares Of Everpure",
            "description": "\n<p><chron>12:50 PM EST</chron>, <chron>02/27/2026</chron> (MT Newswires) -- CFRA, an independent research provider, has provided MT Newswires with the following research alert. Analysts at CFRA have summarized their opinion as follows:</p><p>We cut our target to <money>$70</money> from <money>$78</money>, applying 25x to our FY 28 (Jan.) EPS estimate, above peers on expected share gains. We lift our FY 27 EPS view to <money>$2.28</money> from <money>$2.23</money> and initiate FY 28 at <money>$2.78</money>. We maintain our Hold view on PSTG as we think the company's premium valuation already reflects its strong execution and AI-driven growth momentum. FY 26 revenue reached <money>$3.7B</money> with RPO surging 40% Y/Y, but we believe near-term margin pressure from rapidly rising component costs and 1touch integration dilution temper the earnings visibility heading into FY 27. While we view the <org value=\"PSTG.NaE\" idsrc=\"xmltag.org\" >Everpure</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='PSTG' fmr-param-security-type='Equity'>( PSTG )</span> rebrand and expanding hyperscaler engagement positively, FY 27 guidance embeds meaningful back-half execution risk with limited visibility into input pricing. We think PSTG's pricing power and subscription mix shift provide insulation, but at current levels, the risk/reward appears balanced. We would turn more constructive on clearer margin recovery or an earlier-than-expected hyperscale revenue recognition with favorable unit economics.</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/investing-ideas/202602271250MIDNIGHTUSEQUITY_A3575278",
            "pub_date": "2026-02-28 01:50:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Research Alert: CFRA Maintains Hold Opinion On Shares Of Everpure",
            "description": "\n<p><chron>12:55 PM EST</chron>, <chron>02/27/2026</chron> (MT Newswires) -- CFRA, an independent research provider, has provided MT Newswires with the following research alert. Analysts at CFRA have summarized their opinion as follows:</p><p>We cut our target to <money>$70</money> from <money>$78</money>, applying 25x to our FY 28 (Jan.) EPS estimate, above peers on expected share gains. We lift our FY 27 EPS view to <money>$2.28</money> from <money>$2.23</money> and initiate FY 28 at <money>$2.78</money>. We maintain our Hold view on PSTG as we think the company's premium valuation already reflects its strong execution and AI-driven growth momentum. FY 26 revenue reached <money>$3.7B</money> with RPO surging 40% Y/Y, but we believe near-term margin pressure from rapidly rising component costs and 1touch integration dilution temper the earnings visibility heading into FY 27. While we view the <org value=\"PSTG.NaE\" idsrc=\"xmltag.org\" >Everpure</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='PSTG' fmr-param-security-type='Equity'>( PSTG )</span> rebrand and expanding hyperscaler engagement positively, FY 27 guidance embeds meaningful back-half execution risk with limited visibility into input pricing. We think PSTG's pricing power and subscription mix shift provide insulation, but at current levels, the risk/reward appears balanced. We would turn more constructive on clearer margin recovery or an earlier-than-expected hyperscale revenue recognition with favorable unit economics.</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/investing-ideas/202602271255MIDNIGHTUSEQUITY_A3575280",
            "pub_date": "2026-02-28 01:55:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Bitcoin Miner MARA Pivots To AI After $1.7 Billion Loss As Stock Surges 10%",
            "description": "\n<p><strong><org value=\"MARA.NaE\" idsrc=\"xmltag.org\" >MARA Holdings</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='MARA' fmr-param-security-type='Equity'>( MARA )</span></strong> surged over 10% after announcing a joint venture with <strong><org>Starwood Digital Ventures</org></strong> to pivot mining sites toward AI infrastructure, despite reporting a <money>$1.7 billion</money> Q4 loss driven by <strong>Bitcoin</strong> (CRYPTO: BTC) writedowns.</p>\n\n\n\n<h3 class=\"wp-block-heading\">MARA Reports <money>$1.7 Billion</money> Q4 Loss</h3>\n\n\n\n<p>The company reported a Q4 net loss of <money>$1.7 billion</money> compared to net income of <money>$528.3 million</money> a year earlier.&#160;</p>\n\n\n\n<p>A <money>$1.5 billion</money> decline in the fair value of Bitcoin holdings wiped out operating gains as BTC dropped from <money>$114,068</money> at the end of Q3 to <money>$87,498</money> by <chron>December 31</chron>.</p>\n\n\n\n<p>Revenue fell 6% to <money>$202.3 million</money> from <money>$214.4 million</money> in Q4 2024, driven by a 14% drop in the average price of Bitcoin mined during the quarter.&#160;</p>\n\n\n\n<p>Full-year revenue grew 38% to <money>$907.1 million</money>, but the topline growth was overshadowed by the massive quarterly writedown.</p>\n\n\n\n<p>MARA held 53,822 BTC valued at roughly <money>$4.7 billion</money> as of <chron>December 31</chron>, up 20% year-over-year.&#160;</p>\n\n\n\n<p>Energized hashrate rose 25% to 66.4 EH/s, though that fell short of the company&#8217;s 75 EH/s target—a gap attributed to capital discipline rather than operational failure.</p>\n\n\n\n<h3 class=\"wp-block-heading\">MARA&#8217;s AI Infrastructure Strategy</h3>\n\n\n\n<p>The Starwood joint venture targets more than 1 gigawatt of IT capacity, with a roadmap stretching beyond 2.5 GW.&#160;</p>\n\n\n\n<p>MARA will contribute data center sites while Starwood handles design, construction, tenant sourcing, and operations.&#160;</p>\n\n\n\n<p>Moreover, MARA can invest up to 50% in individual projects, and Bitcoin mining continues at sites where power costs remain favorable.</p>\n\n\n\n<p>Earlier this month, MARA acquired a 64% stake in <strong>Exaion</strong>, a firm providing AI and high-performance computing solutions for corporate and government clients.&#160;</p>\n\n\n\n<p>The company also bought a 42-megawatt data center in <location value=\"LS/us.ne\" idsrc=\"xmltag.org\" >Nebraska</location>.</p>\n\n\n\n<p>The CEO emphasized the strategic shift: MARA is &#8220;no longer simply a Bitcoin miner.&#8221; The strategy reflects a broader industry trend. </p>\n\n\n\n<p>Miners like <strong>Cipher</strong> and <strong>Bitfarms</strong> are repurposing energy-heavy infrastructure into AI and high-performance computing data centers to diversify revenue as mining margins shrink.</p>\n\n\n\n<h3 class=\"wp-block-heading\">MARA Stock Technical Analysis</h3>\n\n\n\n<p>MARA is breaking out from a multi-week base with exceptional momentum. </p>\n\n\n\n<p>The Supertrend at <money>$7.98</money> flipped green below price, confirming momentum shifted decisively bullish.&#160;</p>\n\n\n\n<p>The stock trades 21% above the Supertrend, showing strong separation from capitulation lows.</p>\n\n\n\n<p>MARA reclaimed the 20 EMA at <money>$8.24</money> and 50 EMA at <money>$8.60</money>, currently testing the 100 EMA at <money>$9.65</money>.&#160;</p>\n\n\n\n<p>This rapid reclaim of multiple EMAs in a single session demonstrates exceptional buying pressure.</p>\n\n\n\n<p>The descending trendline from the <money>$25</money> peak was decisively broken with today&#8217;s surge.</p>\n\n\n\n<p>MARA exploded through it with conviction—textbook trend reversal behavior. The rally from <money>$7.00</money> to <money>$9.66</money> represents 38% from the lows.</p>\n\n\n\n<p>Immediate resistance sits at the 200 EMA at <money>$11.47</money>, representing 19% upside. Support shifted to <money>$8.50-$9.00</money>, backed by the 50 EMA at <money>$8.60</money> and Supertrend at <money>$7.98</money>.</p>\n\n\n\n<p><em>Image: Shutterstock</em></p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602271257BENZINGAFULLNGTH50938208",
            "pub_date": "2026-02-28 01:57:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Toymaker Hasbro joins wave of companies suing U.S. government over IEEPA tariff payments",
            "description": "<p><location value=\"LU/us.ny.nyc\" idsrc=\"xmltag.org\" >NEW YORK, NY</location>, <chron>Feb 27</chron> - Toymaker Hasbro on Friday joined hundreds of companies suing for refunds of tariffs paid under President <person>Donald Trump's</person> emergency trade measures, which were deemed illegal by the <org>U.S. Supreme Court</org> last week, according to court documents. </p>\n<p>The Play-Doh-maker, which did not disclose how much it has paid in IEEPA tariffs, is requesting full refunds along with interest. The lawsuit joins more than 2,000 similar cases filed in the <org>U.S. Court of International Trade</org> since April.</p>\n<p>French beauty group L'Oreal , British vacuum manufacturer Dyson and contact lens maker Bausch + Lomb on Monday filed lawsuits against <org>U.S. Customs and Border Protection</org> over IEEPA refunds. Beanie Babies maker <org>Ty Inc.</org> also filed a similar lawsuit this week.  </p>\n<p>Hasbro is being represented by law firm Sandler, Travis &amp; Rosenberg, which is also representing Swiss sportswear company On and personal care product maker Conair in their respective IEEPA lawsuits. </p>\n<p>Hasbro did not immediately respond to a request for comment. </p>\n<p></p>\n<p> (Reporting by <person>Arriana McLymore</person> in <location value=\"LU/us.ny.nyc\" idsrc=\"xmltag.org\" >New York City</location>; Editing by <person>Chizu Nomiyama</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602271257RTRSNEWSCOMBINED_KBN3PH282-OUSBS_1",
            "pub_date": "2026-02-28 01:57:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Netflix surges as investors cheer decision to exit Warner Bros race",
            "description": "<p><chron>Feb 27</chron> (Reuters) - <org value=\"NFLX.NaE\" idsrc=\"xmltag.org\" >Netflix</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NFLX' fmr-param-security-type='Equity'>( NFLX )</span> jumped more than 10% on Friday as investors applauded its decision to exit the race for <org value=\"WBD.NaE\" idsrc=\"xmltag.org\" >Warner Bros Discovery</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='WBD' fmr-param-security-type='Equity'>( WBD )</span>, a months-long bidding war with <org value=\"PSKY.NaE\" idsrc=\"xmltag.org\" >Paramount Skydance</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='PSKY' fmr-param-security-type='Equity'>( PSKY )</span> for some of <location value=\"LU/us.ca.hollyw\" idsrc=\"xmltag.org\" >Hollywood's</location> most prized assets.</p>\n<p><org value=\"NFLX.NaE\" idsrc=\"xmltag.org\" >Netflix</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NFLX' fmr-param-security-type='Equity'>( NFLX )</span> declined to match <org>Paramount's</org> latest <money>$31</money> per share bid or raise its offer of <money>$27.75</money> a share for <org>Warner Bros's</org> studio and streaming assets, stating that the deal was &quot;no longer financially attractive&quot;.</p>\n<p>The decision was welcomed by investors. Shares of the streaming giant had shed more than 18% since <org value=\"NFLX.NaE\" idsrc=\"xmltag.org\" >Netflix</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NFLX' fmr-param-security-type='Equity'>( NFLX )</span> announced its deal with <org>Warner Bros</org> on <chron>December 5</chron>. </p>\n<p>The latest move is a &quot;tick in the box&quot; for discipline, said <person>Ben Barringer</person>, head of technology research at Quilter Cheviot. </p>\n<p>&quot;What you want from a management team is an ability to look at acquisitions, value them, pay what they think is a fair price, but to not overpay.&quot;</p>\n<p>Analysts and investors had questioned whether <org value=\"NFLX.NaE\" idsrc=\"xmltag.org\" >Netflix's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NFLX' fmr-param-security-type='Equity'>( NFLX )</span> bid was a defensive attempt to block a future competitor or an offensive shift away from its historically disciplined build-versus-buy approach. </p>\n<p>&quot;A positive turn of events in our view, as we believe NFLX's withdrawal from the race will leave it free to refocus on its business, while its closest competitors grapple with long and distracting regulatory approval and merger integration processes, and with PSKY saddled with sizable deal debts,&quot; HSBC analysts said. </p>\n<p>'GOOD BUSINESS SENSE'</p>\n<p>Shares of the <person>David Ellison</person>-led <org>Paramount</org>, meanwhile, were up 17%. </p>\n<p><org>Paramount's</org> deal, valued at <money>$110 billion</money>, including debt, represents nearly 13 times <org>Warner Bros'</org> EBITDA this year, according to estimates from LSEG. That is well above what <org>Paramount</org> is worth on the same basis, which is 7 times its estimated earnings. </p>\n<p>A tie-up with <org>Warner Bros</org> would allow <org>Paramount's</org> storied <location value=\"LU/us.ca.hollyw\" idsrc=\"xmltag.org\" >Hollywood</location> studio to tap into Warner's deep trove of intellectual property -including franchises such as &quot;Fantastic Beasts&quot; and &quot;The Matrix&quot; - across film, television and streaming.</p>\n<p>&quot;WBD's largest asset is declining and the company is still under debt from its last failed merger. But this deal is more about Ellison taking over <location value=\"LU/us.ca.hollyw\" idsrc=\"xmltag.org\" >Hollywood</location> and ego than it is about good business sense,&quot; said <person>Ross Benes</person>, senior analyst at Emarketer.</p>\n<p>For <org>Paramount's</org> streaming unit, a combination with HBO Max and Discovery+ would reshape its position in a streaming era long dominated by <org value=\"NFLX.NaE\" idsrc=\"xmltag.org\" >Netflix</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NFLX' fmr-param-security-type='Equity'>( NFLX )</span>.</p>\n<p>&quot;<org>Paramount</org> was the streaming market laggard, and it needs <org>Warner Bros'</org> content and capabilities to play catch-up. It will need more than <person>Harry Potter</person> for the deal to work its magic and enable <org>Paramount</org> to fight off <org value=\"NFLX.NaE\" idsrc=\"xmltag.org\" >Netflix</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NFLX' fmr-param-security-type='Equity'>( NFLX )</span>, Disney and Amazon in the streaming wars,&quot; said <person>Dan Coatsworth</person>, head of markets at AJ Bell. </p>\n<p>In the fight for <org>Warner Bros</org>, the <org>Paramount</org> consortium backed by billionaire <person>Larry Ellison</person> and led by his son, <org>Paramount</org> CEO <person>David Ellison</person>, also boosted its termination fee to <money>$7 billion</money> and expanded its financing commitments, including <money>$45.7 billion</money> in equity.</p>\n<p>&quot;There is a right price and wrong price for any acquisition, and the pressure is now on <org>Paramount</org> to prove the big financial outlay is worth it,&quot; said Coatsworth. </p>\n<p> (Reporting by <person>Harshita Mary Varghese</person>, <person>Rashika Singh</person> and <person>Kanchana Chakravarty</person> in Bengaluru; <person>Jennifer Saba</person> in <location value=\"LU/us.ny.nyc\" idsrc=\"xmltag.org\" >New York</location>; editing by <person>Arpan Varghese</person>, Devika Syamnath and Shinjini Ganguli)</p>\n",
            "link": "https://www.fidelity.com/news/article/top-news/202602270508RTRSNEWSCOMBINED_KBN3PH110-OUSBS_1",
            "pub_date": "2026-02-28 02:10:49",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Britain's FTSE 100 ends at record high for third straight day; Barclays slides",
            "description": "\n<p>*</p>\n<p>FTSE 100 up 0.6%, FTSE 250 up 0.2%</p>\n<p></p>\n<p>*</p>\n<p><org value=\"BCS.NaE\" idsrc=\"xmltag.org\" >Barclays</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='BCS' fmr-param-security-type='Equity'>( BCS )</span> shares fall due to Market Financial Solutions\ncollapse</p>\n<p></p>\n<p>*</p>\n<p><org value=\"RTMVF.NaE\" idsrc=\"xmltag.org\" >Rightmove</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='RTMVF' fmr-param-security-type='Equity'>( RTMVF )</span> climbs on profit beat and 90 million pound\nbuyback</p>\n<p></p>\n<p>*</p>\n<p>Labour loses <location value=\"LU/gb.eng.manchr\" idsrc=\"xmltag.org\" >Manchester</location> ward to Greens, signalling\npolitical\nshift</p>\n<p>(Updates to market close)</p>\n<p><chron>Feb 27</chron> (Reuters) - <location value=\"LU/gb.eng.london\" idsrc=\"xmltag.org\" >London's</location> FTSE 100 climbed to a record\nhigh on Friday, boosted by heavyweight miners and defensive\nstocks while <org value=\"BCS.NaE\" idsrc=\"xmltag.org\" >Barclays</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='BCS' fmr-param-security-type='Equity'>( BCS )</span> slumped on concerns over its exposure to\ncollapsed UK lender Market Financial Solutions.</p>\n<p>Shares of <org value=\"BCS.NaE\" idsrc=\"xmltag.org\" >Barclays</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='BCS' fmr-param-security-type='Equity'>( BCS )</span> fell 4.2% and Jefferies\ndropped 10% after reports that they and other lenders face\npotential losses tied to the collapse of mortgage lender MFS,\nwhich has been placed into administration following allegations\nof financial irregularities.</p>\n<p>The blue-chip FTSE 100 rose 0.6% to 10,910.55\npoints, notching a record close for the third straight day,\nwhile the mid-cap FTSE 250 closed up 0.2%.</p>\n<p>The FTSE 100 index advanced 6.7% in February, its eighth\nmonthly climb in a row and its longest monthly winning streak\nsince 2012-2013. The index outperformed U.S. and European\nbenchmarks this month as optimism around a potential <org>Bank of\nEngland</org> rate cut in March lifted sentiment.</p>\n<p>At times, however, gains have been tempered by worries that\nemerging AI tools could disrupt established business models, as\nwell as trade-related uncertainties from U.S. President Donald\nTrump's fresh tariffs earlier this month.</p>\n<p>Precious-metal miners and industrial-metal\nminers rose as demand for gold and copper\nincreased, with investors flocking to safe-haven assets amid\nuncertainty over U.S. tariff policies and heightened tensions\nbetween <location value=\"LC/us\" idsrc=\"xmltag.org\" >the United States</location> and <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location>.</p>\n<p>Mining stocks have been among the biggest contributors to\nthe FTSE 100's gains over the past year, supported by soaring\nmetals pricing.</p>\n<p>Shares in drugmaker <org value=\"AZN.NaE\" idsrc=\"xmltag.org\" >AstraZeneca</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AZN' fmr-param-security-type='Equity'>( AZN )</span> and food group\n<org value=\"UL.NaE\" idsrc=\"xmltag.org\" >Unilever</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='UL' fmr-param-security-type='Equity'>( UL )</span> firmed 2.9% and 2%, respectively.\nAmong others, shares of IAG dropped 7.5% after the\nairlines owner failed to provide profit guidance for this year\nand expressed concerns about potentially higher fuel prices.\nHays slumped 10% to the bottom of the mid-cap index\nafter the recruiter announced the departure of CEO <person>Dirk Hahn</person> and\nslashed its dividend by 84%.\nOn the political front, Prime Minister <person>Keir Starmer's</person> <org>Labour\nParty</org> suffered a defeat to the <org>Green Party</org> in a <location value=\"LU/gb.eng.manchr\" idsrc=\"xmltag.org\" >Manchester</location> ward\nit had dominated for nearly a century, underscoring the\nfragmentation of <location value=\"LC/gb\" idsrc=\"xmltag.org\" >Britain's</location> traditional two-party system.\n(Reporting by Tharuniyaa Lakshmi in Bengaluru; Editing by <person>Leroy\nLeo</person> and Emelia Sithole-Matarise)</p>\n",
            "link": "https://www.fidelity.com/news/article/us-markets/202602271232RTRSNEWSCOMBINED_L6N3ZN10S_1",
            "pub_date": "2026-02-28 01:32:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Research Alert: CFRA Maintains Sell Opinion On Shares Of Hp Inc.",
            "description": "\n<p><chron>12:40 PM EST</chron>, <chron>02/27/2026</chron> (MT Newswires) -- CFRA, an independent research provider, has provided MT Newswires with the following research alert. Analysts at CFRA have summarized their opinion as follows:</p><p>We cut our 12-month target by <money>$3</money> to <money>$16</money>, valuing HP at 5.5x our CY 2027 EPS view of <money>$2.99</money>, below peers due to anemic growth. We cut our FY 26 (Oct.) EPS view to <money>$2.91</money> (<money>$3.09</money>) and FY 27's to <money>$2.98</money> (<money>$3.28</money>). Our reduced estimates reflect escalating memory costs, up roughly 100% Q/Q, about 35% of PC BOM, which we believe will compress PS margins into the low to mid-5% area for the balance of FY 26. While Q1 beat expectations (non-GAAP EPS <money>$0.81</money> vs. consensus' <money>$0.77</money>, revenue <money>$14.4B</money> vs. <money>$14.1B</money>), we think upside was partly led by consumer demand pull-in, which is unlikely to repeat. Management maintained its <money>$2.90</money> to <money>$3.20</money> non-GAAP EPS guide but steered toward the low end, and we see risk as skewed to the downside as mitigation levers (supplier qualification, configuration changes, pricing) lag cost inflation. Print remains challenged at negative 2% Y/Y with units down 6%. We maintain Sell as we see limited catalysts to offset margin pressure, an interim CEO transition, and a double-digit PC unit TAM decline in CY 26.</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/investing-ideas/202602271240MIDNIGHTUSEQUITY_A3575269",
            "pub_date": "2026-02-28 01:40:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        }
    ]
}