{
    "data": [
        {
            "title": "Ramsey Theory Group CEO Dan Herbatschek Announces Ashutosh Sharma Appointed to Head of Engineering",
            "description": "\n<p><location value=\"LU/us.ny.nyc\" idsrc=\"xmltag.org\" >NEW YORK</location>, <chron>Feb.  27, 2026</chron>  (GLOBE NEWSWIRE) -- <org>Ramsey Theory Group</org> (RTG), a multidisciplinary technology firm spanning software development, artificial intelligence, quantitative analysis, IT &amp; cybersecurity, digital marketing, and product development, today announced the appointment of <person>Ashutosh Sharma</person> as Head of Engineering.</p>  <p>Sharma has been a key contributor within RTG’s engineering organization, most recently serving as a Senior Software Engineer, where he helped deliver production software and AI-enabled solutions across the firm’s portfolio. In his new role, Sharma will lead RTG’s new hiring and engineering execution across client engagements and internal product initiatives—strengthening delivery rigor, scaling core engineering practices, and accelerating the development of secure, high-performance systems.</p>  <p>“Engineering is the backbone of every durable technology company—where vision becomes reality through craftsmanship, discipline, and systems thinking,” said <strong>Dan Herbatschek</strong>, Founder &amp; CEO of <org>Ramsey Theory Group</org>. “Ashutosh has consistently demonstrated the technical judgment and leadership temperament required to scale our engineering capabilities as we expand our product footprint and deepen our work in AI, security, and enterprise software.”</p>  <p>“As RTG continues to grow, our mandate is to build systems that are not only effective, but resilient—architectured for real-world constraints and long-term maintainability,” said <person>Ashutosh Sharma</person>, Head of Engineering. “I’m excited to partner with our teams across the company to further elevate engineering standards and execution velocity, while staying grounded in the curiosity and integrity that define RTG’s culture.”</p>  <p>Sharma’s promotion underscores a broader strategic shift at <org>Ramsey Theory Group</org> to prioritize organizational agility and elite talent acquisition in an increasingly fast changing tech landscape. By elevating internal leaders who possess both deep technical expertise and a forward-looking mindset, RTG is positioning itself to rapidly adapt to market shifts, particularly in the realms of generative AI and automated systems. This move marks the first in a series of initiatives aimed at scaling a world-class engineering team capable of meeting the demands of a fast-changing global economy.</p>  <p><strong>About <org>Ramsey Theory Group</org></strong><br/>Founded by CEO <person>Dan Herbatschek</person>, <location value=\"LU/us.ny.nyc\" idsrc=\"xmltag.org\" >New York</location>-based <org>Ramsey Theory Capital</org>, operating as <org>Ramsey Theory Group</org>, is a diversified technology company focused on building and scaling AI-driven platforms that power mission-critical enterprise operations. It has additional offices in <location value=\"LU/us.ca.losang\" idsrc=\"xmltag.org\" >Los Angeles</location> and <location value=\"LS/us.nj\" idsrc=\"xmltag.org\" >New Jersey</location>. The firm delivers advanced artificial intelligence, data engineering, automation, and digital transformation solutions across healthcare, field service, logistics, automotive, and digital commerce markets.</p>  <p>Its portfolio includes Erdos Technologies, Erdos Digital, Erdos Tracks, Erdos Logistics, Erdos Medical, and Eunifi—each designed to help organizations move beyond experimentation to deploy AI at scale with measurable operational, financial, and customer-experience impact.</p>  <p>With a focus on practical AI adoption, governance-ready architecture, and real-world outcomes, <org>Ramsey Theory Capital</org> partners with organizations to modernize workflows, automate complex decision-making, and turn data into durable competitive advantage.</p>  <p><strong>Media Contact</strong><br/><person>Ria Romano</person>, Partner<br/><org>RPR Public Relations, Inc.</org><br/>Tel. 786-290-6413</p>  <p>A photo accompanying this announcement is available at https://www.globenewswire.com/NewsRoom/AttachmentNg/4f9a2f07-775e-41f3-b2f6-792ab7b869b8</p>  <p> </p>  Image: https://www.globenewswire.com/newsroom/ti?nf=OTY2MzE4MiM3NDYwMTgwIzUwMDE1MjY2Ng==  <br/> Image: https://ml.globenewswire.com/media/NmE1M2Y3YTktNjM5Yy00NDhlLTk5ZTAtNDNjZmM3Mjg5YmE4LTUwMDE1MjY2Ni0yMDI2LTAyLTI3LWVu/tiny/Ramsey-Theory-Group.png <p> Image: Primary Logo </p><div style=\"padding:0px;width: 100%;\"><div style=\"clear:both\"></div><div style=\"float: right;padding-left:20px\"><div><h5>Ashutosh Sharma Appointed to Head of Engineering at <org>Ramsey Theory Group</org></h5></div><div>  Image: https://ml.globenewswire.com/media/4f9a2f07-775e-41f3-b2f6-792ab7b869b8/medium/ashutosh-sharma-appointed-to-head-of-engineering-at-ramsey-t.JPG  </div><p></p><div> <h5>Sharma has been a key contributor within RTG’s engineering organization, most recently serving as a Senior Software Engineer, where he helped deliver production software and AI-enabled solutions across the firm’s portfolio. In his new role, Sharma will lead RTG’s new hiring and engineering execution across client engagements and internal product initiatives—strengthening delivery rigor, scaling core engineering practices, and accelerating the development of secure, high-performance systems.</h5></div></div></div>\nSource: <org>Ramsey Theory Group</org>\n",
            "link": "https://www.fidelity.com/news/article/technology/202602271638PRIMZONEFULLFEED9663182",
            "pub_date": "2026-02-28 05:38:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "XRP Stalls Below $2, But Ripple Is Still Well-Positioned, Advocates Say",
            "description": "\n<p><strong>XRP</strong> (CRYPTO: XRP) is way off <money>$2</money>, yet recent industry discussions suggest the token and the XRP Ledger could play a central role in a digitized global financial system.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>The XRP Ledger Has One Advantage</strong></h2>\n\n\n\n<p>On the Paul Barron podcast, panelists addressed perceived competition between the Canton Network and the XRP Ledger.</p>\n\n\n\n<p>The discussion argued that the <org>Depository Trust &amp; Clearing Corporation</org> using Canton for tokenization does not directly threaten XRP's use case. </p>\n\n\n\n<p>Canton is designed for real-world asset tokenization and privacy across subnets, rather than cross-border liquidity.</p>\n\n\n\n<p>By contrast, the XRP Ledger is described as a bridge asset system built for instant cross-border and cross-asset settlement. </p>\n\n\n\n<p>Under that framework, tokenized assets issued on Canton that move across currencies or jurisdictions could still require a neutral liquidity layer such as XRP.</p>\n\n\n\n<p>Tokenization of real-world assets was highlighted as a major long-term catalyst. </p>\n\n\n\n<p>Hosts cited commentary from the <org>World Economic Forum</org> suggesting that a significant portion of global assets, from government treasuries to commodities, could eventually migrate on chain.</p>\n\n\n\n<p>In that scenario, XRP would function as a shared liquidity pool connecting tokenized treasuries, gold, commodities and central bank digital currencies across borders in near real time.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Ripple's Strategic Positioning</strong></h2>\n\n\n\n<p>Ripple is also seen as strengthening its institutional footprint through acquisitions and infrastructure expansion.</p>\n\n\n\n<p>Speculation has emerged that Ripple could explore bank acquisitions to accelerate integration within the global financial system, potentially targeting institutions such as <strong>BNY</strong> or <strong>Standard Chartered</strong>. No formal announcements have been made.</p>\n\n\n\n<p>Between 2023 and 2025, Ripple pursued acquisitions aimed at expanding custody, liquidity and stablecoin infrastructure. </p>\n\n\n\n<p>Its stablecoin, <strong>RLUSD</strong> (CRYPTO: RLUSD), is positioned as a potential &quot;cash leg&quot; for tokenized securities and commodities, complementing XRP's proposed role as a bridge asset.</p>\n\n\n\n<p>In this framing, XRP is presented not merely as a speculative token but as a liquidity layer within a broader blockchain-based financial architecture focused on interoperability and tokenized collateral.</p>\n\n\n\n<p><em>Image: Shutterstock</em></p>\n",
            "link": "https://www.fidelity.com/news/article/technology/202602271639BENZINGAFULLNGTH50948121",
            "pub_date": "2026-02-28 05:39:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "BRIEF-Paramount To Acquire Warner Bros. Discovery For Enterprise Value of $110 Billion",
            "description": "\n<p><chron>Feb 27</chron> (Reuters) - <org value=\"PSKY.NaE\" idsrc=\"xmltag.org\" >Paramount Skydance Corp</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='PSKY' fmr-param-security-type='Equity'>( PSKY )</span>:</p>\n<p>* PARAMOUNT TO ACQUIRE WARNER BROS. DISCOVERY TO FORM\nNEXT-GENERATION GLOBAL MEDIA AND ENTERTAINMENT COMPANY</p>\n<p>* <org value=\"PSKY.NaE\" idsrc=\"xmltag.org\" >PARAMOUNT SKYDANCE CORP</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='PSKY' fmr-param-security-type='Equity'>( PSKY )</span>: TRANSACTION VALUES WBD AT\nENTERPRISE\nVALUE OF <money>$110 BILLION</money></p>\n<p>* <org value=\"PSKY.NaE\" idsrc=\"xmltag.org\" >PARAMOUNT SKYDANCE CORP</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='PSKY' fmr-param-security-type='Equity'>( PSKY )</span>: ISSUING <money>$47 BILLION</money> OF NEW CLASS\nB\nSHARES AT <money>$16.02</money> PER SHARE</p>\n<p>* <org value=\"PSKY.NaE\" idsrc=\"xmltag.org\" >PARAMOUNT SKYDANCE CORP</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='PSKY' fmr-param-security-type='Equity'>( PSKY )</span>: TRANSACTION HAS BEEN UNANIMOUSLY\nAPPROVED BY BOARDS OF DIRECTORS OF BOTH COMPANIES AND IS\nEXPECTED TO CLOSE IN Q3 2026</p>\n<p>* <org value=\"PSKY.NaE\" idsrc=\"xmltag.org\" >PARAMOUNT SKYDANCE</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='PSKY' fmr-param-security-type='Equity'>( PSKY )</span>: WILL INVEST IN EXPANDING CREATIVE\nENGINES AT\nCORE OF BOTH WBD AND PARAMOUNT</p>\n<p>* <org value=\"PSKY.NaE\" idsrc=\"xmltag.org\" >PARAMOUNT SKYDANCE CORP</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='PSKY' fmr-param-security-type='Equity'>( PSKY )</span>: EXPECTS THAT ACQUISITION WILL\nYIELD\nOVER <money>$6 BILLION</money> IN SYNERGIES</p>\n<p>* <org value=\"PSKY.NaE\" idsrc=\"xmltag.org\" >PARAMOUNT SKYDANCE</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='PSKY' fmr-param-security-type='Equity'>( PSKY )</span>: VOTE ON DEAL EXPECTED IN EARLY SPRING\nOF\n2026</p>\n<p>* <org value=\"PSKY.NaE\" idsrc=\"xmltag.org\" >PARAMOUNT SKYDANCE CORP</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='PSKY' fmr-param-security-type='Equity'>( PSKY )</span>: DEAL VALUES WBD AT <money>$81 BILLION</money> IN\nEQUITY VALUE</p>\n<p>* <org value=\"PSKY.NaE\" idsrc=\"xmltag.org\" >PARAMOUNT SKYDANCE CORP</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='PSKY' fmr-param-security-type='Equity'>( PSKY )</span>:  PARAMOUNT HAS TERMINATED ITS\nALL-CASH\nTENDER OFFER TO ACQUIRE ALL OUTSTANDING SHARES OF WBD</p>\n<p>* <org value=\"PSKY.NaE\" idsrc=\"xmltag.org\" >PARAMOUNT SKYDANCE</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='PSKY' fmr-param-security-type='Equity'>( PSKY )</span>: PROPOSED TRANSACTION BETWEEN PARAMOUNT\n&amp; WBD\nIS NOT SUBJECT TO ANY FINANCING CONDITIONS\nSource text:\nFurther company coverage:</p>\n",
            "link": "https://www.fidelity.com/news/article/mergers-and-acquisitions/202602271643RTRSNEWSCOMBINED_TUA9JZLH2_1",
            "pub_date": "2026-02-28 05:43:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Delta orders 34 more Airbus A321neo jets in fleet renewal push",
            "description": "\n<p><location value=\"LU/us.il.chicgo\" idsrc=\"xmltag.org\" >CHICAGO</location>, <chron>Feb 27</chron> (Reuters) - <org value=\"DAL.NaE\" idsrc=\"xmltag.org\" >Delta Air Lines</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='DAL' fmr-param-security-type='Equity'>( DAL )</span> said on Friday it will buy 34 more Airbus A321neo jets as part of its plan to refresh its fleet with aircraft that burn less fuel and offer more premium seats.</p>\n<p>The new planes are due to arrive starting in 2029.</p>\n<p>The order lifts Delta's total commitment for the A321neo to 189 aircraft. The airline already flies 92 of them and has 97 more on firm order. It holds options for another 36.</p>\n<p>The deal marks the <location value=\"LU/us.ga.atlnta\" idsrc=\"xmltag.org\" >Atlanta</location>-based airline's third aircraft announcement this year. In January, it ordered 30 Boeing 787-10 jets, and later added an order for 31 Airbus widebody aircraft.</p>\n<p>Delta, like other major carriers, has been adding newer jets that are more efficient and have more seats in premium cabins.</p>\n<p>The airline has said most of its planned seat capacity growth will come from those higher-priced seats rather than the main cabin.</p>\n<p>The A321neo is expected to be a key part of that strategy on domestic and shorter international routes.</p>\n<p>Delta said the aircraft has the lowest operating cost per seat among its narrowbody jets and carries more first-class and extra-legroom seats than any other single-aisle aircraft in its fleet.</p>\n<p>The new aircraft will be powered by RTX's Pratt &amp; Whitney GTF engines.</p>\n<p></p>\n<p>(Reporting by Rajesh Kumar SinghEditing by <person>Rod Nickel</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602271643RTRSNEWSCOMBINED_KBN3PH2KP-OUSBS_1",
            "pub_date": "2026-02-28 05:43:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "California treasurer urges Trump to honor SCOTUS tariff ruling",
            "description": "\n<block>\n<p><location value=\"LS/us.ca\" idsrc=\"xmltag.org\" >California's</location> treasurer and state controller joined officials from nine other states in sending a letter to President <person>Donald Trump</person> Thursday urging him to adhere to the <org>U.S. Supreme Court's</org> ruling on tariffs.</p><p>The high court by a 6-3 vote on <chron>Feb. 20</chron> <u>struck down</u> the sweeping tariffs Trump had imposed in 2025 in a series of executive orders that caused massive swings in the stock market. The ruling conversely <u>should &quot;be accretive</u> to growth expectations and somewhat disinflationary,&quot; <person>Jeff Lipton</person>, The Bond Buyer's market intelligence analyst said in a column the day of the ruling.</p><p>California Treasurer <person>Fiona Ma</person> and State Controller <person>Malia Cohen</person> were signatories along with 13 other state financial officers on the letter that asked Trump to adhere to the ruling, ensure that any structural tariff action proceeds only with clear congressional authorization and remedy the economic damage resulting from tariffs inconsistent with the court's guidance.</p><p>The majority opinion found the tariffs exceed the powers given to the president by <org>Congress</org> under a 1977 law providing the chief of state with the authority to regulate commerce only during national emergencies created by foreign threats. The constitution vests the power to levy taxes and duties with <org>Congress</org>. </p><p>&quot;President Trump's trade policies have injected uncertainty into economies that undermine responsible state budgeting and long-term investment, and it raises real costs for manufacturers and consumers while disrupting supply chains,&quot; Ma said. &quot;That's why we must follow the court's decision and restore order — so states can plan responsibly, markets can function with predictability and businesses and families aren't forced to shoulder the cost of policy whiplash.&quot;</p><p>The 15% global tariff Trump threatened after the ruling was handed down would represent a structural change to the American tax base, the letter states, asserting such a decision belongs to <org>Congress</org>.</p><p>&quot;As the state's chief fiscal officer, I believe durable economic growth depends on stability, predictability and respect for constitutional boundaries,&quot; Cohen said. &quot;We must restore clarity to protect taxpayers, safeguard state revenues and ensure accountability so that those who have borne these costs will be made whole.&quot;</p><p>Officials from <location value=\"LS/us.wa\" idsrc=\"xmltag.org\" >Washington</location>, <location value=\"LS/us.or\" idsrc=\"xmltag.org\" >Oregon</location>, <location value=\"LS/us.mn\" idsrc=\"xmltag.org\" >Minnesota</location>, <location value=\"LS/us.co\" idsrc=\"xmltag.org\" >Colorado</location>, <location value=\"LS/us.nv\" idsrc=\"xmltag.org\" >Nevada</location>, <location value=\"LS/us.il\" idsrc=\"xmltag.org\" >Illinois</location>, <location value=\"LS/us.md\" idsrc=\"xmltag.org\" >Maryland</location>, <location value=\"LS/us.vt\" idsrc=\"xmltag.org\" >Vermont</location> and <location value=\"LS/us.ct\" idsrc=\"xmltag.org\" >Connecticut</location> also signed the letter. </p><p>&quot;As we have previously emphasized in public statements, durable economic growth depends on predictability,&quot; the letter says. &quot;Trade policy must be stable and clearly grounded in law if markets, employers and state governments are to plan effectively.&quot;</p><p><location value=\"LS/us.ca\" idsrc=\"xmltag.org\" >California</location> Attorney General <person>Rob Bonta</person> and officials from other states had argued in <u>lawsuits</u> that it was unlawful for Trump to impose tariffs without the consent of <org>Congress</org>.</p><p>&quot;While this is great news,&quot; Bonta said when the ruling was handed down, &quot;we must not forget the chaos that sent businesses, consumers and global economies reeling. At a time when more and more families are struggling with affordability and having trouble paying for the basics — their utilities, groceries, gas — the administration seems intent on making it more expensive for Californians and Americans to live.&quot;</p><p>The letter also asked Trump to establish a clear and timely mechanism to reimburse American taxpayers, businesses and affected industries for tariffs imposed without proper constitutional ground, including restitution for demonstrable financial losses borne by the states.</p><p>The minority opinion by Justice <person>Brett Kavanaugh</person> raised questions as to whether the federal government will have to provide refunds to importers, which he estimated could cost more than <money>$200 billion</money>. </p><p>More than 900 companies have <u>sued</u> the U.S. over Trump's tariffs in the <org>U.S. Court of International Trade</org>, seeking refunds for duties slapped on countries worldwide that they were forced to absorb, the Financial Times reported.</p>\n</block>\n",
            "link": "https://www.fidelity.com/news/article/us-economy/202602271410SM______BNDBUYER_0000019c-a063-d9fc-a39f-feeb7e0c0001_110.1",
            "pub_date": "2026-02-28 03:10:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Draganfly Closes US$50.0 Million Registered Direct Offering",
            "description": "\n<p><chron>04:26 PM EST</chron>, <chron>02/27/2026</chron> (MT Newswires) -- <org value=\"DPRO.NaE\" idsrc=\"xmltag.org\" >Draganfly</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='DPRO' fmr-param-security-type='Equity'>( DPRO )</span>  edged higher in after-hours Nasdaq trading after the company on Friday closed a registered direct offering of 7.15-million shares at a price of <money>US$7.00</money> each, for total proceeds of approximately <money>$50.0 million</money>.</p><p><org value=\"DPRO.NaE\" idsrc=\"xmltag.org\" >Draganfly</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='DPRO' fmr-param-security-type='Equity'>( DPRO )</span> aims to use the capital for general corporate purposes, including to &quot;fund its capabilities to meet demand for its new products including growth initiatives and/or for working capital requirements including the continuing development and marketing of core products, potential acquisitions and research and development&quot;.</p><p>The company's shares were last seen up <money>US$0.07</money> to <money>US$6.61</money> after hours. They closed down <money>C$0.46</money> to <money>C$8.90</money> on the <org>Toronto Stock Exchange</org>.</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602271626MIDNIGHTUSEQUITY_A3575433",
            "pub_date": "2026-02-28 05:26:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Warner Bros signs $110 billion deal with Paramount, ends bidding war with Netflix",
            "description": "<p><chron>Feb 27</chron> (Reuters) - <org value=\"WBD.NaE\" idsrc=\"xmltag.org\" >Warner Bros Discovery</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='WBD' fmr-param-security-type='Equity'>( WBD )</span> said on Friday it has agreed to be acquired by <org value=\"PSKY.NaE\" idsrc=\"xmltag.org\" >Paramount Skydance</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='PSKY' fmr-param-security-type='Equity'>( PSKY )</span> in a <money>$110 billion</money> deal, ending a high-stakes bidding war after <org value=\"NFLX.NaE\" idsrc=\"xmltag.org\" >Netflix</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NFLX' fmr-param-security-type='Equity'>( NFLX )</span> walked away from its agreement with the HBO Max owner.</p>\n<p>Reuters first reported on <org value=\"WBD.NaE\" idsrc=\"xmltag.org\" >Warner Bros Discovery</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='WBD' fmr-param-security-type='Equity'>( WBD )</span> and <org>Paramount</org> signing a deal on Friday morning, citing an audio clip of a global townhall held by the company.</p>\n<p>&quot;<org value=\"NFLX.NaE\" idsrc=\"xmltag.org\" >Netflix</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NFLX' fmr-param-security-type='Equity'>( NFLX )</span> had the legal right to match the PSKY offer. As you all know, they ultimately decided not to do that. That then resulted in a signed agreement with PSKY as of this morning. So that's where everything stands,&quot; <person>Bruce Campbell</person>, <org>Warner Bros'</org> chief revenue and strategy officer, said in the townhall.</p>\n<p>On Thursday, <org value=\"NFLX.NaE\" idsrc=\"xmltag.org\" >Netflix</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NFLX' fmr-param-security-type='Equity'>( NFLX )</span> declined to match <org>Paramount's</org> latest <money>$31</money>-per-share offer, which <org>Warner Bros</org> deemed superior to the streaming pioneer's <money>$27.75</money>-per-share agreement for its studio and streaming assets.</p>\n<p>While <org>Paramount</org> has won the bidding war for <org value=\"WBD.NaE\" idsrc=\"xmltag.org\" >Warner Bros Discovery</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='WBD' fmr-param-security-type='Equity'>( WBD )</span>, the merger has drawn scrutiny. <location value=\"LS/us.ca\" idsrc=\"xmltag.org\" >California</location> regulators are preparing a vigorous review of the <money>$110 billion</money> deal, which could reshape <location value=\"LU/us.ca.hollyw\" idsrc=\"xmltag.org\" >Hollywood</location>.</p>\n<p><org>Paramount</org>, led by billionaire <person>Larry Ellison's</person> son <person>David Ellison</person>, has deep political connections to the Trump administration, which could get it federal regulatory approval for its deal.</p>\n<p>California State Attorney General <person>Rob Bonta</person> said on Thursday that <location value=\"LS/us.ca\" idsrc=\"xmltag.org\" >California</location> is already investigating the deal and will be &quot;vigorous&quot; in its review.</p>\n<p>'EU ANTITRUST APPROVAL LIKELY NOT A HURDLE'</p>\n<p><org>Paramount</org> is expected to easily win <org>European Union</org> antitrust approval, with any required divestments likely to be minor, Reuters reported on Friday, citing sources.</p>\n<p>The deal - which includes some <money>$29 billion</money> in debt - is among <location value=\"LU/us.ca.hollyw\" idsrc=\"xmltag.org\" >Hollywood's</location> biggest media shake-ups and will create one of the largest film studios in the world, allowing <org>Paramount</org> to tap Warner's trove of intellectual property, including franchises such as &quot;Fantastic Beasts&quot; and &quot;The Matrix&quot;.</p>\n<p>It will also allow <org>Paramount</org> to bolster its streaming efforts, with a potential combination of HBO Max and Paramount+, enabling it to gain market share and tussle with market leader Netflix. </p>\n<p><org>Paramount</org> was in pursuit of <org>Warner Bros</org> since late last year when it launched a hostile campaign to wrestle the company from the streaming giant by consistently raising its offer. </p>\n<p>The company, led by billionaire <person>Larry Ellison's</person> son <person>David Ellison</person>, enticed Warner's board back to the bargaining table by raising the possibility of an improved cash offer.</p>\n<p>In its revised bid, <org>Paramount</org> raised the termination fee it would pay should the deal fail to gain regulatory approval to <money>$7 billion</money> from <money>$5.8 billion</money>.</p>\n<p><org>Paramount</org> paid the <money>$2.80 billion</money> termination fee that <org>Warner Bros</org> owed <org value=\"NFLX.NaE\" idsrc=\"xmltag.org\" >Netflix</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NFLX' fmr-param-security-type='Equity'>( NFLX )</span>, the streaming giant said in a regulatory filing on Friday.</p>\n<p>Activist investor <org>Ancora Holdings</org>, which owns a small stake in <org>Warner Bros</org>, had also stepped up pressure on the HBO owner to engage more with <org>Paramount</org>.</p>\n<p>Lawmakers on both sides of the political aisle have raised concerns that any deal to acquire <org>Warner Bros</org> could result in fewer choices and higher prices for consumers. </p>\n<p>Cinema operators are also concerned that combining large <location value=\"LU/us.ca.hollyw\" idsrc=\"xmltag.org\" >Hollywood</location> studios could cost jobs and reduce the number of movies released in theaters.</p>\n<p></p>\n<p> (Reporting by <person>Karol Badohal</person> in <location value=\"LC/pl\" idsrc=\"xmltag.org\" >Poland</location> and <person>Harshita Mary Varghese</person> in Bengaluru, additional reporting by <person>Jaspreet Singh</person> in Bengaluru; Editing by Arun Koyyur and Shinjini Ganguli)</p>\n",
            "link": "https://www.fidelity.com/news/article/top-news/202602271637RTRSNEWSCOMBINED_KBN3PH2KR-OUSBS_1",
            "pub_date": "2026-02-28 05:46:22",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "PrimeEnergy Resources Amends Credit Agreement",
            "description": "\n<p><chron>04:29 PM EST</chron>, <chron>02/27/2026</chron> (MT Newswires) -- <org value=\"PNRG.NaE\" idsrc=\"xmltag.org\" >PrimeEnergy Resources</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='PNRG' fmr-param-security-type='Equity'>( PNRG )</span>  said Friday it has amended its credit agreement with its bank group.</p><p>The borrowing base was reaffirmed at <money>$115 million</money>, the company said, adding that as of <chron>Feb. 27</chron> it had no borrowings outstanding under the facility, leaving the full amount available.</p><p>PrimeEnergy said the amendment also decreases the applicable interest rate margins by 50 basis points for all utilization levels.</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602271629MIDNIGHTUSEQUITY_A3575439",
            "pub_date": "2026-02-28 05:29:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "FRO â Changes to the Board Composition",
            "description": "\n<p align=\"justify\"><org value=\"FRO.NaE\" idsrc=\"xmltag.org\" >Frontline plc</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='FRO' fmr-param-security-type='Equity'>( FRO )</span> (“Frontline” or the “Company”) announces that Mr. Ørjan Svanevik has resigned as Director of the Company. The Board would like to thank Mr. Svanevik for his considerable contribution to the Company during his directorship. </p>  <p align=\"justify\">At the same time, the Company announces the appointment of Mr. <person>Mikkel Storm Weum</person> as a Director. </p>  <p align=\"justify\">Mr. Weum is employed as an Investment Director in Seatankers Management Norway AS, responsible for Sale and Purchase, Newbuildings and Projects. Mr. Weum is also serving as a director on the <org>Board of NYSE</org> listed Flex LNG Ltd and on the <org>Board of NYSE</org> listed Star Bulk Carriers Corp. Prior to being employed by Seatankers Management AS, Mr. <person>Mikkel Storm Weum</person> served as Senior Vice President, responsible for Business Development in SFL Management AS. Mr. Weum was also employed as Vice President, Head of Commercial in Teekay Offshore working with Shuttle Tankers and Floating Offshore storage. Mr. Weum holds a Master’s degree in Naval Architecture from <org>Newcastle University</org> and a MSc in Shipping Trade and Finance from <org>Cass Business School</org>, <org>City University</org>.</p>  <p align=\"justify\"><chron>February 27, 2026</chron></p>  <p align=\"justify\">The Board of Directors<br/><org value=\"FRO.NaE\" idsrc=\"xmltag.org\" >Frontline plc</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='FRO' fmr-param-security-type='Equity'>( FRO )</span><br/>Limassol, <location value=\"LC/cy\" idsrc=\"xmltag.org\" >Cyprus</location></p>  <p align=\"justify\">This information is subject to the disclosure requirements pursuant to section 5 -12 of the Norwegian Securities Trading Act.</p>  Image: https://www.globenewswire.com/newsroom/ti?nf=MTAwMTE2NzI1MiM0MDIzNTAwMTcjMjAwMzM3OA==  <br/> Image: https://ml-eu.globenewswire.com/media/MTRhNThkMjctYmFiNy00OTNlLWEzYjgtMmQ4NjAxNjRjYjBlLTEwMTQ5NTEtMjAyNi0wMi0yNy1lbg==/tiny/Frontline-plc-.png <p> Image: Primary Logo </p>\nSource: <org value=\"FRO.NaE\" idsrc=\"xmltag.org\" >Frontline plc</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='FRO' fmr-param-security-type='Equity'>( FRO )</span>.\n",
            "link": "https://www.fidelity.com/news/article/mergers-and-acquisitions/202602271630PRIMZONEFULLFEED1001167252",
            "pub_date": "2026-02-28 05:30:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Sector Update: Financial Stocks Decline Friday",
            "description": "\n<p><chron>04:07 PM EST</chron>, <chron>02/27/2026</chron> (MT Newswires) -- Financial stocks declined in Friday trading with the NYSE Financial Index falling 2% and the State Street Financial Select Sector SPDR ETF (XLF) dropping 2.1%.</p><p>The Philadelphia Housing Index rose 0.6%, and the State Street Real Estate Select Sector SPDR ETF (XLRE) gained 0.5%.</p><p>Bitcoin (BTC-USD) fell 2.8% to <money>$65,649</money>, and the yield for 10-year US Treasuries dropped 5.5 basis points to 3.96%.</p><p>In economic news, the US producer price index rose by 0.5% in January following a 0.4% increase in December, above the 0.3% gain expected in a <org>Bloomberg</org> survey. After excluding the more volatile food and energy prices, core PPI rose by 0.8%, more than the 0.3% gain anticipated and following a 0.6% jump in the previous month.</p><p>In corporate news, Market Financial Solutions, the failed UK bridging lender financed by <org value=\"BCS.NaE\" idsrc=\"xmltag.org\" >Barclays</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='BCS' fmr-param-security-type='Equity'>( BCS )</span> , <org value=\"APO.NaE\" idsrc=\"xmltag.org\" >Apollo Global Management's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='APO' fmr-param-security-type='Equity'>( APO )</span>  <org>Atlas SP Partners</org>, <org value=\"JEF.NaE\" idsrc=\"xmltag.org\" >Jefferies Financial</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='JEF' fmr-param-security-type='Equity'>( JEF )</span>  and others, may have a 930-million-pound (<money>$1.3 billion</money>) collateral shortfall for its loans, <org>Bloomberg</org> reported, citing documents from Zircon Bridging and Amber Bridging. <org value=\"BCS.NaE\" idsrc=\"xmltag.org\" >Barclays</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='BCS' fmr-param-security-type='Equity'>( BCS )</span> shares fell 4%, Apollo slumped 8.6%, and Jefferies tumbled 9.3%.</p><p><org value=\"EQIX.NaE\" idsrc=\"xmltag.org\" >Equinix</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='EQIX' fmr-param-security-type='Equity'>( EQIX )</span>  and the Canada Pension Plan Investment Board agreed to acquire Nordic data center provider atNorth from private equity firm Partners Group for <money>$4 billion</money>. <org value=\"EQIX.NaE\" idsrc=\"xmltag.org\" >Equinix</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='EQIX' fmr-param-security-type='Equity'>( EQIX )</span> shares rose 2.8%.</p><p><org value=\"BLK.NaE\" idsrc=\"xmltag.org\" >BlackRock's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='BLK' fmr-param-security-type='Equity'>( BLK )</span>  <org>Global Infrastructure Partners</org> and EQT are in advanced talks to buy AES (AES), <org>Bloomberg</org> reported. <org value=\"BLK.NaE\" idsrc=\"xmltag.org\" >BlackRock</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='BLK' fmr-param-security-type='Equity'>( BLK )</span> shares fell 2.4%.</p><p>Block (XYZ) shares jumped 17% after the company posted higher Q4 adjusted net income and revenue and announced a plan to cut its workforce by 40%.</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/us-markets/202602271607MIDNIGHTUSEQUITY_A3575412",
            "pub_date": "2026-02-28 05:07:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US Equity Markets Close Lower After Higher-Than-Expected Producer Price Data",
            "description": "\n<p><chron>04:14 PM EST</chron>, <chron>02/27/2026</chron> (MT Newswires) -- US equity indexes were down Friday following a higher-than-expected producer price report and continued pressure on technology stocks.</p><p>* <org>The Bureau of Labor Statistics</org> said Friday the US Producer Price Index rose by 0.5% in January following a 0.4% increase in December, and higher than the 0.3% gain expected in a <org>Bloomberg</org> survey. After excluding the more volatile food and energy prices, core PPI rose by 0.8%, more than the 0.3% anticipated gain.</p><p>* Tech stocks were lower Friday afternoon, with the State Street Technology Select Sector SPDR ETF (XLK) falling 1.7% and the State Street SPDR S&amp;P Semiconductor ETF (XSD) dropping 1.6%.</p><p>* April West Texas Intermediate crude oil rose <money>$2.11</money> to settle at <money>$65.42</money> per barrel, while <person>April Brent</person> crude, the global benchmark, was last seen up <money>$0.02</money> at <money>$70.87</money>.</p><p>* Dell (DELL) shares were up roughly 22% after the company late Thursday reported fiscal Q4 results above market estimates amid a surge in orders for AI-optimized servers.</p><p>* Market Financial Solutions, the UK mortgage firm backed by <org value=\"BCS.NaE\" idsrc=\"xmltag.org\" >Barclays</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='BCS' fmr-param-security-type='Equity'>( BCS )</span> , <org value=\"APO.NaE\" idsrc=\"xmltag.org\" >Apollo Global Management's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='APO' fmr-param-security-type='Equity'>( APO )</span>  <org>Atlas SP Partners</org>, <org value=\"JEF.NaE\" idsrc=\"xmltag.org\" >Jefferies Financial</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='JEF' fmr-param-security-type='Equity'>( JEF )</span>  and others, may have a <money>930-million-pound sterling</money> (<money>$1.3 billion</money>) collateral shortfall for its loans, <org>Bloomberg</org> reported, citing documents from Zircon Bridging and Amber Bridging it obtained. <org value=\"BCS.NaE\" idsrc=\"xmltag.org\" >Barclays</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='BCS' fmr-param-security-type='Equity'>( BCS )</span> shares fell about 4%, Apollo dropped nearly 8.6%, and Jefferies decreased over 9.3%.</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/us-markets/202602271614MIDNIGHTUSEQUITY_A3575421",
            "pub_date": "2026-02-28 05:14:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "MWC 2026: Amdocs Collaborates with Microsoft to Bring AI-Accelerated Application Modernization to Enterprises",
            "description": "\n<p><i><strong>Joint collaboration combines the <org value=\"DOX.NaE\" idsrc=\"xmltag.org\" >Amdocs'</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='DOX' fmr-param-security-type='Equity'>( DOX )</span> Agentic Services, as part of </strong></i><strong><org value=\"DOX.NaE\" idsrc=\"xmltag.org\" >Amdocs</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='DOX' fmr-param-security-type='Equity'>( DOX )</span> agentic operating system,</strong><i><strong> aOS, with Microsoft's AI technologies to help enterprises modernize faster, at scale, and with greater resilience.</strong></i></p> <p><strong id=\"dateline\"><location value=\"LU/us.nj.jerity\" idsrc=\"xmltag.org\" >JERSEY CITY, NJ</location> / ACCESS Newswire / <chron>February 27, 2026</chron> / </strong><org value=\"DOX.NaE\" idsrc=\"xmltag.org\" >Amdocs</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='DOX' fmr-param-security-type='Equity'>( DOX )</span> , a leading provider of software and services to communications and media companies, today announced a collaboration with Microsoft to deliver AI-accelerated application modernization solutions designed to drive measurable business outcomes, from business case to execution, while helping enterprises transform their technology landscape into an agent-ready foundation. In this approach, cloud migration is a key enabler within a broader modernization journey, supporting improved quality and efficiency across the enterprise technology lifecycle.</p><p><org value=\"DOX.NaE\" idsrc=\"xmltag.org\" >Amdocs</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='DOX' fmr-param-security-type='Equity'>( DOX )</span> delivers its cloud migration, modernization, and quality engineering expertise through its multivendor Amdocs Agentic Services, which includes Microsoft technologies like Microsoft Foundry (including Azure Open AI in Foundry Models), Microsoft Migration Agents, GitHub Copilot and Fabric IQ. Enterprises can deploy a coordinated set of <org value=\"DOX.NaE\" idsrc=\"xmltag.org\" >Amdocs</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='DOX' fmr-param-security-type='Equity'>( DOX )</span> and Microsoft IT agents that automate and orchestrate end-to-end modernization activities, enabling accelerated refactoring, strengthened architectural resilience, and seamless migration to Microsoft Azure.</p><p>At the core of the solution is Amdocs Agentic Services, part of the <org value=\"DOX.NaE\" idsrc=\"xmltag.org\" >Amdocs</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='DOX' fmr-param-security-type='Equity'>( DOX )</span> agentic operating system (aOS), which orchestrates specialized agents from across <org>Amdocs Studios</org> into coordinated, multi-agent workflows. Delivered through a growing library of pre-built, customizable workflows, the agentic services operationalizes AI across modernization initiatives at scale. This scalable model simplifies execution, enhances quality and consistency, and delivers measurable business outcomes with full observability and control.</p><p>&quot;This collaboration with Microsoft marks a pivotal step forward in shaping how enterprises modernize at scale,&quot; said <person>Anthony Goonetilleke</person>, Group President of Technology and Head of Strategy at <org value=\"DOX.NaE\" idsrc=\"xmltag.org\" >Amdocs</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='DOX' fmr-param-security-type='Equity'>( DOX )</span>. &quot;Powered by <org value=\"DOX.NaE\" idsrc=\"xmltag.org\" >Amdocs</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='DOX' fmr-param-security-type='Equity'>( DOX )</span> aOS, with AI embedded at the core of execution, we are reimagining modernization as an agent-led, intelligently orchestrated process that helps organizations address technical debt and achieve enterprise-grade speed and efficiency.&quot;</p><p>&quot;Enterprises today are looking for practical, scalable ways to modernize their applications while minimizing risk and disruption,&quot; said <person>Rick Lievano</person>, Worldwide CTO, Telco, Media &amp; Gaming at Microsoft. &quot;By combining Microsoft's AI capabilities with <org value=\"DOX.NaE\" idsrc=\"xmltag.org\" >Amdocs'</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='DOX' fmr-param-security-type='Equity'>( DOX )</span> deep modernization expertise to deliver Service-as-Software, this collaboration empowers customers to accelerate their cloud journeys on Microsoft Azure with greater confidence, speed, and efficiency.&quot;</p><p><org value=\"DOX.NaE\" idsrc=\"xmltag.org\" >Amdocs</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='DOX' fmr-param-security-type='Equity'>( DOX )</span> and Microsoft will share more about how they are collaborating to drive innovation at <org>Mobile World Congress</org> (MWC) 2026, the world's largest telco conference. <org value=\"DOX.NaE\" idsrc=\"xmltag.org\" >Amdocs</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='DOX' fmr-param-security-type='Equity'>( DOX )</span> will demonstrate its cloud transformation-specialized agents at its partner demo corner pods at the booth, and Microsoft will showcase the solution at its booth.</p><p><strong>Supporting Resources</strong></p><ul style=\"list-style-type:disc;\"><li><p>Keep up with <org value=\"DOX.NaE\" idsrc=\"xmltag.org\" >Amdocs</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='DOX' fmr-param-security-type='Equity'>( DOX )</span> news by visiting the company's website</p></li><li><p>Follow us on X, Facebook, LinkedIn and YouTube</p></li></ul><p><strong>About <org value=\"DOX.NaE\" idsrc=\"xmltag.org\" >Amdocs</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='DOX' fmr-param-security-type='Equity'>( DOX )</span></strong></p><p><org value=\"DOX.NaE\" idsrc=\"xmltag.org\" >Amdocs</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='DOX' fmr-param-security-type='Equity'>( DOX )</span> helps the world's leading communications and media companies deliver exceptional customer experiences through reliable, efficient, and secure operations at scale. We provide software products and services that embed intelligence into how work runs across business, IT, and network domains - delivering measurable outcomes in customer experience, network performance, cloud modernization, and revenue growth. With our talented people, and more than 40 years of experience running mission-critical systems around the globe, <org value=\"DOX.NaE\" idsrc=\"xmltag.org\" >Amdocs</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='DOX' fmr-param-security-type='Equity'>( DOX )</span> runs billions of transactions daily. Our technology is relied on every day, connecting people worldwide and advancing a more inclusive, connected world. Together, we help those who shape the future to make it amazing. <org value=\"DOX.NaE\" idsrc=\"xmltag.org\" >Amdocs</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='DOX' fmr-param-security-type='Equity'>( DOX )</span> is listed on the NASDAQ Global Select Market and reported revenue of <money>$4.53 billion</money> in fiscal 2025. For more information, visit www.amdocs.com.</p><p><strong><org value=\"DOX.NaE\" idsrc=\"xmltag.org\" >Amdocs'</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='DOX' fmr-param-security-type='Equity'>( DOX )</span> Forward-Looking Statement</strong></p><p>This press release includes information that constitutes forward-looking statements made pursuant to the safe harbor provision of the Private Securities Litigation Reform Act of 1995, including statements about <org value=\"DOX.NaE\" idsrc=\"xmltag.org\" >Amdocs'</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='DOX' fmr-param-security-type='Equity'>( DOX )</span> growth and business results in future quarters and years. Although we believe the expectations reflected in such forward-looking statements are based upon reasonable assumptions, we can give no assurance that our expectations will be obtained or that any deviations will not be material. Such statements involve risks and uncertainties that may cause future results to differ from those anticipated. These risks include, but are not limited to, the effects of general macroeconomic conditions, prevailing level of macroeconomic, business and operational uncertainty, including as a result of geopolitical events or other regional events or pandemics, changes to trade policies including tariffs and trade restrictions, as well as the current inflationary environment, and the effects of these conditions on the Company's customers' businesses and levels of business activity, including the effect of the current economic uncertainty and industry pressure on the spending decisions of the Company's customers. <org value=\"DOX.NaE\" idsrc=\"xmltag.org\" >Amdocs'</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='DOX' fmr-param-security-type='Equity'>( DOX )</span> ability to grow in the business markets that it serves, <org value=\"DOX.NaE\" idsrc=\"xmltag.org\" >Amdocs'</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='DOX' fmr-param-security-type='Equity'>( DOX )</span> ability to successfully integrate acquired businesses, adverse effects of market competition, rapid technological shifts that may render the Company's products and services obsolete, security incidents, including breaches and cyberattacks to our systems and networks and those of our partners or customers, potential loss of a major customer, our ability to develop long-term relationships with our customers, our ability to successfully and effectively implement artificial intelligence and Generative AI in the Company's offerings and operations, and risks associated with operating businesses in the international market. <org value=\"DOX.NaE\" idsrc=\"xmltag.org\" >Amdocs</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='DOX' fmr-param-security-type='Equity'>( DOX )</span> may elect to update these forward-looking statements at some point in the future; however, <org value=\"DOX.NaE\" idsrc=\"xmltag.org\" >Amdocs</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='DOX' fmr-param-security-type='Equity'>( DOX )</span> specifically disclaims any obligation to do so. These and other risks are discussed at greater length in <org value=\"DOX.NaE\" idsrc=\"xmltag.org\" >Amdocs'</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='DOX' fmr-param-security-type='Equity'>( DOX )</span> filings with the <org>Securities and Exchange Commission</org>, including in our Annual Report on Form 20-F for the fiscal year ended <chron>September 30, 2025</chron>, filed on <chron>December 15, 2025</chron>, and for the first quarter of fiscal 2026 on <chron>February 3, 2026</chron>.</p><p><strong>Media Contacts</strong></p><p style=\"text-align:justify;\"><person>Swati Sharma</person><br />Amdocs Public Relations<br />E-mail: swati.sharma4@amdocs.com</p><p style=\"text-align:justify;\"><strong>SOURCE:</strong> <org>Amdocs Management Limited</org></p><br /><br />View the original press release on ACCESS Newswire<br /><br />\n      <img src=\"https://app.accessnewswire.com/img.ashx?id=1142341\" width=\"0\" height=\"0\"/>\n",
            "link": "https://www.fidelity.com/news/article/technology/202602271605ACCESSWRNAPR_____1142341",
            "pub_date": "2026-02-28 05:05:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Keysight and MediaTek Advance AIâDriven Uplink Optimization and Model Life Cycle Management for Radio Access Networks",
            "description": "\n<p>\nWorking prototype shows how artificial intelligence-radio access network techniques can adapt to site conditions and improve uplink performance at scale\n\n</p>\n<p>    <location value=\"LU/us.ca.sanosa\" idsrc=\"xmltag.org\" >SANTA ROSA, Calif.</location>--(BUSINESS WIRE)--\n<org value=\"KEYS.NaE\" idsrc=\"xmltag.org\" >Keysight Technologies, Inc.</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='KEYS' fmr-param-security-type='Equity'>( KEYS )</span> and MediaTek announced a working prototype that advances AI‑driven uplink optimization and model life cycle management for next‑generation radio access networks (RAN). The prototype will be demonstrated at <org>Mobile World Congress</org> 2026 and shows how AI‑enabled, RAN-assisted intelligence can improve uplink performance in real time while remaining effective over time through practical model retraining and over‑the‑air (OTA) updates, helping operators and ecosystem partners accelerate the transition to networks.\n\n</p><p>\nAs networks evolve, maintaining consistent uplink performance becomes increasingly challenging. Coverage conditions vary widely across urban, rural, indoor, and hard-to-reach locations. Traditional transmitter diversity techniques are often static, which can limit performance as conditions change. At the same time, AI models trained in one environment may not perform the same across all deployment scenarios and updating those models in live networks can be operationally complex. Operators need an approach that is accurate, site‑aware, and easy to maintain.\n\n</p><p>\n<org value=\"KEYS.NaE\" idsrc=\"xmltag.org\" >Keysight</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='KEYS' fmr-param-security-type='Equity'>( KEYS )</span> and MediaTek address this need by combining RAN‑assisted AI decision‑making, site‑specific model retraining, and over-the-air (OTA) model updates in a controlled test environment that mimics real-world network conditions. The prototype leverages Keysight’s Channel Studio RaySim and its Network and Channel Emulation solutions to create realistic, repeatable validation scenarios. This enables measurable gains in uplink throughput, spectral efficiency, and reliability while reducing the operational effort required to support diverse deployment environments. The work aligns with the objectives of the AI‑RAN Alliance, supporting scalable deployment and continuous optimization of AI in the RAN.\n\n</p><p>\n<b><person>Mingxi Fan</person>, Senior General Manager of <org>Wireless Technology Group</org>, MediaTek, said:</b> “We’re looking forward to highlighting how instrumental uplink performance enhancement will be in scaling future mobile networks so they can support AI-era applications more efficiently. Transmit diversity is a promising technique to be implemented at the device level so it can work across a wide variety of network environments, and our collaboration with <org value=\"KEYS.NaE\" idsrc=\"xmltag.org\" >Keysight</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='KEYS' fmr-param-security-type='Equity'>( KEYS )</span> demonstrates that through open infrastructure and device cooperation, our technology will facilitate practical, scalable AI-native RAN deployments.”\n\n</p><p>\n<b><person>Peng Cao</person>, Vice President and General Manager, <org>Wireless Test Group</org>, <org value=\"KEYS.NaE\" idsrc=\"xmltag.org\" >Keysight</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='KEYS' fmr-param-security-type='Equity'>( KEYS )</span>, said:</b> “Together with MediaTek, we have demonstrated a novel AI-enabling-AI technique which helps address the increasing demand on mobile networks’ uplink performance, capacity, and consistent end user experiences driven by AI and AR applications. This involves training and testing the AI-enhanced transmitter model in the UE with high-fidelity real-world training datasets generated from Keysight’s RF digital twin channel emulation solutions with 3D ray tracing capabilities.”\n\n</p><p>\n<b>About <org value=\"KEYS.NaE\" idsrc=\"xmltag.org\" >Keysight Technologies</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='KEYS' fmr-param-security-type='Equity'>( KEYS )</span></b>\n\n</p><p>\nAt <org value=\"KEYS.NaE\" idsrc=\"xmltag.org\" >Keysight</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='KEYS' fmr-param-security-type='Equity'>( KEYS )</span> , we inspire and empower innovators to bring world-changing technologies to life. As an S&amp;P 500 company, we’re delivering market-leading design, emulation, and test solutions to help engineers develop and deploy faster, with less risk, throughout the entire product life cycle. We’re a global innovation partner enabling customers in communications, industrial automation, aerospace and defense, automotive, semiconductor, and general electronics markets to accelerate innovation to connect and secure the world. Learn more at Keysight Newsroom and www.keysight.com.\n\n</p><p><img alt=\"\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20260227733318r1&amp;sid=acqr8&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\" /><span class=\"bwct31415\" /></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\">https://www.businesswire.com/news/home/20260227733318/en/</span></p>\n<p>Source: <org value=\"KEYS.NaE\" idsrc=\"xmltag.org\" >Keysight Technologies, Inc.</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='KEYS' fmr-param-security-type='Equity'>( KEYS )</span></p>\n",
            "link": "https://www.fidelity.com/news/article/technology/202602271615BIZWIRE_USPR_____20260227_BW733318",
            "pub_date": "2026-02-28 05:15:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "TSX Closer: Index Slumps Off a Record High, But Losses Capped On Commodity Prices and Investment In Canada",
            "description": "\n<p><chron>04:15 PM EST</chron>, <chron>02/27/2026</chron> (MT Newswires) -- <org>The Toronto Stock Exchange</org> slumped Friday, mostly on some profit taking after it set six record closes over the prior seven sessions, but losses on the resources-heavy index were capped by higher commodity prices, while investors continue to welcome news of a swing in foreign direct investment into a rare surplus.</p><p>The S&amp;P/TSX Composite Index closed down 161.97 points, or 0.5%, to 34,339.99,  falling off the 17th record close of 2026 set Thursday, with sectors mixed over Friday's session. For a second successive day, Info Tech led decliners , down 2.5%, while Financials was down near 2%. Telecom led gainers, up 1.65%, with Energy, up 1.15% and the Battery Metals Index, up 1.1%, next.</p><p><org>BMO Capital Markets</org> Chief Economist <person>Douglas Porter</person> in his regular Friday 'Talking Points' note noted even as the Canadian economy remains &quot;challenged by relentless trade uncertainty&quot;, the TSX continues to &quot;find its own path&quot;. Prior to Friday's stumble, the index managed to rise more than 1% this week to hit an record high above 34,500 and was up 8% in the first two months of the year. Porter noted a rebound in gold and firmer oil prices assisted, but Q1 bank earnings were also &quot;greeted favourably&quot;. He also noted economy-wide profits rose more than 6% in 2025, topping nominal GDP growth of 4.3% on the year. More broadly, <location value=\"LC/ca\" idsrc=\"xmltag.org\" >Canada</location> may be benefitting from a diversification push away from U.S. markets, where valuations are rich, Porter said.</p><p>Porter cited as just as one small sample of the shift into <location value=\"LC/ca\" idsrc=\"xmltag.org\" >Canada</location> in the past year a &quot;welcome&quot; swing in foreign direct investment into a rare surplus. For Q4 alone, quarterly net FDI inflows were <money>$11.6 billion</money>, driven by M&amp;A activity. Looking at the four-quarter trend reveals that for the first time in more than a decade, and only the second time in the past 18 years, <location value=\"LC/ca\" idsrc=\"xmltag.org\" >Canada</location> had a net inflow in FDI in 2025 of <money>$17.3 billion</money>, Porter noted. For perspective, Porter said that alone would have funded more than half of the current account deficit of <money>$30.4 billion</money> last year. He noted there are three major types of FDI: M&amp;A, greenfield investments, and reinvested earnings. In 2025, the latter remained in a large outflow position of <money>$47 billion</money> &quot;and is normally in a deficit because of <location value=\"LC/ca\" idsrc=\"xmltag.org\" >Canada's</location> large stock of outstanding investments abroad&quot; while M&amp;A was in a large offsetting surplus. Net new FDI investments were, thus,  in a surplus of <money>$17.6 billion</money> for the year, &quot;which is encouraging news for an economy looking for new growth avenues&quot;, Porter added.</p><p>Of commodities, gold rose to the highest in a month Friday following a report U.S. wholesale inflation rose above expectations in January. Gold for April delivery was last seen up <money>US$86.50</money> to to <money>US$5,280.70</money> per ounce, the highest since the record close of <money>US$5,354.80</money> on <chron>Jan. 29</chron>.</p><p>Also, West Texas Intermediate crude oil rose to a six-month high as a third round of talks between the U.S. and <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location> ended with an agreement to meet again next week amid reports <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location> is balking at U.S. demands it abandon its uranium enrichment program, raising worries President Trump will decide to strike at the OPEC+ member. WTI crude oil for April delivery closed up <money>US$1.81</money> to settle at <money>US$67.02</money> per barrel, the highest since <chron>Aug. 1</chron>, while <person>April Brent</person> crude was up <money>US$1.81</money> to <money>US$72.56</money>.</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/international/202602271615MIDNIGHTUSEQUITY_A3575347",
            "pub_date": "2026-02-28 05:15:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Aardvark Therapeutics pauses late-stage trial testing rare disease treatment",
            "description": "\n<p><chron>Feb 27</chron> (Reuters) - <org value=\"AARD.NaE\" idsrc=\"xmltag.org\" >Aardvark Therapeutics</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AARD' fmr-param-security-type='Equity'>( AARD )</span> on\nFriday said it is voluntarily pausing its late-stage trial\ntesting its experimental treatment for a type of rare genetic\ndisease.</p>\n<p>(Reporting by Sneha  S K; Editing by <person>Maju Samuel</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602271610RTRSNEWSCOMBINED_L4N3ZN20N_1",
            "pub_date": "2026-02-28 05:10:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Zscaler Could Face Headwinds Linked to High Red Canary Churn Rates, Oppenheimer Says",
            "description": "\n<p><chron>04:11 PM EST</chron>, <chron>02/27/2026</chron> (MT Newswires) -- <org value=\"ZS.NaE\" idsrc=\"xmltag.org\" >Zscaler</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='ZS' fmr-param-security-type='Equity'>( ZS )</span>  delivered solid fiscal second-quarter results, though elevated churn rates in <person>Red Canary's</person> managed detection and response business is one of the areas worth keeping an eye out on, Oppenheimer said in a note e-mailed Friday.</p><p>Late Thursday, the cloud security company increased its full-year outlook after reporting better-than-expected second-quarter results.</p><p>&quot;<org value=\"ZS.NaE\" idsrc=\"xmltag.org\" >Zscaler</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='ZS' fmr-param-security-type='Equity'>( ZS )</span> delivered a solid beat-and-raise quarter (and) drove incremental margin expansion,&quot; Oppenheimer analysts, including <person>Ittai Kidron</person>, said in a note to clients. &quot;Strength in <org>Zero Trust</org> branch, cloud, and new metered-solutions disclosures exhibit traction in non-seat-based revenues.&quot;</p><p>However, the recently acquired <person>Red Canary</person> business experienced higher churn and is not expected to grow at &quot;a comparable pace&quot; ahead as <org value=\"ZS.NaE\" idsrc=\"xmltag.org\" >Zscaler</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='ZS' fmr-param-security-type='Equity'>( ZS )</span> shifts its focus to selling artificial intelligence offerings based on the business' AI technology compared with its managed detection and response, or MDR, services, the analysts said. &quot;This may cause headwinds to (2027 annual recurring revenue) growth.&quot;</p><p>The MDR service provides continuous monitoring and response to security threats across IT environments, according to the company.</p><p><org value=\"ZS.NaE\" idsrc=\"xmltag.org\" >Zscaler's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='ZS' fmr-param-security-type='Equity'>( ZS )</span> billings growth &quot;decelerated meaningfully,&quot; while core Zscaler Internet and Private Access ARR growth has decelerated to mid-teens, Oppenheimer said. &quot;<person>Red Canary's</person> elevated churn rates across MDR customers could become a modest drag on consolidated growth metrics at renewal and heading into (2027).&quot;</p><p>The brokerage slashed its price target on the <org value=\"ZS.NaE\" idsrc=\"xmltag.org\" >Zscaler</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='ZS' fmr-param-security-type='Equity'>( ZS )</span> stock to <money>$280</money> from <money>$345</money> while reiterating its outperform rating.</p><p>&quot;While not yet impacting operations, memory prices remain a risk, potentially leading to future price increases to offset,&quot; the Oppenheimer analysts said.</p><p>The company's shares slumped 12% Friday, bringing its year-to-date decline to about 37%.</p><p><org value=\"ZS.NaE\" idsrc=\"xmltag.org\" >Zscaler</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='ZS' fmr-param-security-type='Equity'>( ZS )</span> is seeing continued strong demand across AI security, Zero Trust Everywhere, and data security, giving the company &quot;a highly durable runway for long-term growth,&quot; Chief Executive <person>Jay Chaudhry</person> said in a statement late Thursday. &quot;Organizations racing to adopt AI are looking to us to provide the security solution they trust, and we're just scratching the surface of this massive future growth opportunity.&quot;</p><p>Price: 145.34, Change: -22.02, Percent Change: -13.16</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602271611MIDNIGHTUSEQUITY_A3575387",
            "pub_date": "2026-02-28 05:11:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "OpenAI clinches $840 billion valuation with mega funding from Amazon, Nvidia, SoftBank",
            "description": "<p><chron>Feb 27</chron> (Reuters) - OpenAI's latest funding round valued the ChatGPT maker at <money>$840 billion</money> as Big Tech and <person>Masayoshi Son's</person> SoftBank piled into the <money>$110 billion</money> blockbuster round, signaling the AI investment race is alive and well despite recent fears of a valuation bubble. </p>\n<p>The funding round - one of the largest private capital raises on record - with various strings and conditions attached that come in phases, includes a <money>$30 billion</money> investment from SoftBank, <money>$30 billion</money> from Nvidia, and <money>$50 billion</money> from <org value=\"AMZN.NaE\" idsrc=\"xmltag.org\" >Amazon</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AMZN' fmr-param-security-type='Equity'>( AMZN )</span>. </p>\n<p>It comes ahead of the AI startup's expected mega-IPO this year to meet the ChatGPT maker's surging compute and R&amp;D costs. </p>\n<p>More investors are expected to join the round as it progresses, OpenAI said in a statement on Friday.</p>\n<p>FUNDING BOOST AMID COMPETITION</p>\n<p>With the latest injection, SoftBank's investment in OpenAI is set to be <money>$64.6 billion</money>, representing an ownership interest of about 13%, the Japanese conglomerate said. The investment will come in three phases throughout this year, with the first tranche of <money>$10 billion</money> expected to close by <chron>April 1</chron>. </p>\n<p>As a result of the investment, SoftBank will gain preferred shares that will be converted into common shares of OpenAI upon an IPO. </p>\n<p>SoftBank said the <money>$30 billion</money> is expected to be financed initially through bridge loans and capital raise from major financial institutions. The Japanese investment giant has sold stakes in its existing investments, including Nvidia, in order to fund its check into OpenAI. </p>\n<p>The infusion will help OpenAI secure advanced AI chips and the computing capacity it needs to maintain its lead position in the AI industry, especially as competition heats up from Anthropic and Alphabet's Google. </p>\n<p>It also exacerbates <location>Wall Street</location> concerns about  &quot;circular&quot; financing agreements, where firms invest in and sign supply deals with each other, inflating demand and revenue.</p>\n<p>After years of outsized gains, tech stocks have suffered sharp declines in 2026 as investors question whether AI investments will generate sufficient returns to justify lofty valuations.</p>\n<p>Nvidia was punished by shareholders this week after the chipmaker said it would pour money into the AI ecosystem, instead of returning cash to shareholders. Nvidia's investment in OpenAI gives the chip company a financial stake in one of its largest customers, tightening their already intertwined relationship.</p>\n<p>OpenAI said on Friday it would use Nvidia's latest Rubin systems, representing five gigawatts of computing capacity - enough energy to power millions of U.S. households.</p>\n<p>It was not immediately clear whether Nvidia's <money>$30 billion</money> investment replaced its earlier commitment announced in September under which Nvidia was set to invest up to <money>$100 billion</money> in the startup. </p>\n<p>OpenAI and Nvidia did not immediately respond to Reuters' requests for clarification. </p>\n<p>AMAZON PARTNERSHIP </p>\n<p>The new investment is crucial for OpenAI. </p>\n<p>The launch of Google's Gemini 3 in November has given the Alphabet-owned company a stronger footing, while Anthropic has cemented its lead in the enterprise AI market with its specialized coding tool.</p>\n<p>OpenAI, which is yet to turn a profit, is targeting roughly <money>$600 billion</money> in total compute spend through 2030, a source told Reuters last week. </p>\n<p>Along with the <money>$50 billion</money> investment, OpenAI and <org value=\"AMZN.NaE\" idsrc=\"xmltag.org\" >Amazon</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AMZN' fmr-param-security-type='Equity'>( AMZN )</span> have also struck a deal in which OpenAI will utilize two gigawatts of computing capacity powered by <org value=\"AMZN.NaE\" idsrc=\"xmltag.org\" >Amazon's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AMZN' fmr-param-security-type='Equity'>( AMZN )</span> in-house Trainium AI chips.</p>\n<p>The companies are also expanding their <money>$38 billion</money> cloud deal signed last year, with OpenAI saying it would spend an additional <money>$100 billion</money> on Amazon Web Services over the next eight years. As well, OpenAI will work with <org value=\"AMZN.NaE\" idsrc=\"xmltag.org\" >Amazon</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AMZN' fmr-param-security-type='Equity'>( AMZN )</span> to develop customized models for the e-commerce company's engineering teams.</p>\n<p><org value=\"AMZN.NaE\" idsrc=\"xmltag.org\" >Amazon</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AMZN' fmr-param-security-type='Equity'>( AMZN )</span> will start with an initial <money>$15 billion</money> investment, followed by another <money>$35 billion</money> in the coming months when certain conditions are met, the companies said. </p>\n<p>AWS will be the exclusive third-party cloud provider for OpenAI Frontier, the ChatGPT maker's enterprise platform for building and running AI agents. </p>\n<p>Microsoft, in a joint statement with OpenAI, sought to outline the limits to the work that <org value=\"AMZN.NaE\" idsrc=\"xmltag.org\" >Amazon</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AMZN' fmr-param-security-type='Equity'>( AMZN )</span> and OpenAI can undertake together without involving Azure, Microsoft's cloud unit. </p>\n<p>The partnership does not change OpenAI's relationship with Microsoft, with Microsoft Azure still the exclusive cloud provider for OpenAI's APIs that provide access to OpenAI's models, the companies said. OpenAI's first-party products, including Frontier, will continue to be hosted on Azure. </p>\n<p>ChatGPT serves more than 900 million weekly active users, OpenAI said on Friday, adding that it has surpassed 50 million consumer subscribers. January and February are on track to become the largest months for new subscriber additions, it said.</p>\n<p> (Reporting by <person>Deborah Sophia</person> and <person>Akash Sriram</person> in Bengaluru, <person>Krystal Hu</person> in <location value=\"LU/us.ca.sanfrn\" idsrc=\"xmltag.org\" >San Francisco</location>; Additional reporting by <person>Stephen Nellis</person> in <location value=\"LU/us.ca.sanfrn\" idsrc=\"xmltag.org\" >San Francisco</location>; Editing by Arun Koyyur, <person>Chizu Nomiyama</person>, <person>Nick Zieminski</person>, <person>Sayantani Ghosh</person>, <person>Rod Nickel</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/top-news/202602270835RTRSNEWSCOMBINED_KBN3PH1K6-OUSBS_1",
            "pub_date": "2026-02-28 05:26:32",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Cargo Traffic to Los Angeles Port Expected to Fall in Week Ending March 14",
            "description": "\n<p><chron>01:47 PM EST</chron>, <chron>02/27/2026</chron> (MT Newswires) -- Cargo traffic at the <location value=\"LU/us.ca.losang\" idsrc=\"xmltag.org\" >Port of Los Angeles</location> is expected to fall in the week ending <chron>March 14</chron>, according to data from the ship-tracking system Port Optimizer.</p><p>A total of 93,629 20-foot equivalent units, a standardized measure of cargo capacity, are projected to reach the port in the week, the data showed. That volume reflects an 8.4% drop from the previous week and a 6.7% gain from a year earlier.</p><p>Fifteen freight vessels are scheduled to arrive at the port in the week ending <chron>March 14</chron>, the data showed. That's down from 20 vessels this week and 19 in the week ending <chron>March 7</chron>.</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/us-economy/202602271347MIDNIGHTUSEQUITY_A3575316",
            "pub_date": "2026-02-28 02:47:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Correction: Sector Update: Health Care",
            "description": "\n<p><chron>03:57 PM EST</chron>, <chron>02/27/2026</chron> (MT Newswires) -- (Corrects ticker symbol)</p><p>Health care stocks rose late Friday afternoon, with the NYSE Health Care Index adding 1.3% and the State Street Health Care Select Sector SPDR ETF (XLV) advancing 1.5%.</p><p>The iShares Biotechnology ETF (IBB) increased 0.7%.</p><p>In corporate news, <org value=\"GENB.NaE\" idsrc=\"xmltag.org\" >Generate Biomedicines</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='GENB' fmr-param-security-type='Equity'>( GENB )</span>  shares fell past 25% in their Nasdaq debut on Friday after the company priced its IPO of 25 million shares at <money>$16</money> each.</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/us-markets/202602271557MIDNIGHTUSEQUITY_A3575414",
            "pub_date": "2026-02-28 04:57:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Sector Update: Tech Stocks Fall Late Afternoon",
            "description": "\n<p><chron>03:58 PM EST</chron>, <chron>02/27/2026</chron> (MT Newswires) -- Tech stocks fell late Friday afternoon with the State Street Technology Select Sector SPDR ETF (XLK) declining 1.5% and the State Street SPDR S&amp;P Semiconductor ETF (XSD) dropping 2%.</p><p>The Philadelphia Semiconductor index shed 1.2%.</p><p>In corporate news, <org value=\"ZS.NaE\" idsrc=\"xmltag.org\" >Zscaler</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='ZS' fmr-param-security-type='Equity'>( ZS )</span>  delivered strong fiscal Q2 results, beating the market's adjusted earnings and sales expectations. CFRA, an independent research provider, said that a slowdown in net new annual recurring revenue additions will be a &quot;key investor concern.&quot; <org value=\"ZS.NaE\" idsrc=\"xmltag.org\" >Zscaler</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='ZS' fmr-param-security-type='Equity'>( ZS )</span> shares fell 13%.</p><p>OpenAI said Friday that it secured <money>$110 billion</money> in new funding, including investments from <org value=\"NVDA.NaE\" idsrc=\"xmltag.org\" >Nvidia</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NVDA' fmr-param-security-type='Equity'>( NVDA )</span>  and <org value=\"AMZN.NaE\" idsrc=\"xmltag.org\" >Amazon.com</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AMZN' fmr-param-security-type='Equity'>( AMZN )</span> , as the ChatGPT parent aims to expand its infrastructure amid rising demand for AI. <org value=\"NVDA.NaE\" idsrc=\"xmltag.org\" >Nvidia</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NVDA' fmr-param-security-type='Equity'>( NVDA )</span> shares were down 4.1%, and <org value=\"AMZN.NaE\" idsrc=\"xmltag.org\" >Amazon</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AMZN' fmr-param-security-type='Equity'>( AMZN )</span> was up 0.6%.</p><p><org value=\"CRWV.NaE\" idsrc=\"xmltag.org\" >CoreWeave</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='CRWV' fmr-param-security-type='Equity'>( CRWV )</span>  shares sank 19% after the company reported a wider Q4 loss. Macquarie cut its price target to <money>$90</money> from <money>$115</money> while keeping its neutral rating.</p><p>Dell (DELL) shares surged 21% after the company late Thursday reported fiscal Q4 results above market estimates amid a surge in orders for AI-optimized servers.</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/us-markets/202602271558MIDNIGHTUSEQUITY_A3575409",
            "pub_date": "2026-02-28 04:58:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US agency approves Charter Communications' $34.5 billion deal to buy Cox",
            "description": "\n<p><location value=\"LU/us.dc.wash\" idsrc=\"xmltag.org\" >WASHINGTON</location>, <chron>Feb 27</chron> (Reuters) - <org>The Federal Communications Commission</org> said Friday it approved Charter Communications' <money>$34.5 billion</money> acquisition of <org>Cox Communications</org>.</p>\n<p>The deal announced in <chron>March 2025</chron> combines two of the largest U.S. cable and broadband operators in their battle with streaming giants and mobile carriers.</p>\n<p>The FCC said Spectrum-owner Charter will invest billions of dollars to upgrade its network and deliver high-speed service and the company committed to onshoring jobs. Charter also agreed to extend its <money>$20</money>/hour minimum starting wage to Cox workers.</p>\n<p>Reuters reported last year the deal would create the largest U.S. cable TV and broadband provider with around 38 million subscribers, surpassing market leader Comcast.</p>\n<p></p>\n<p>(Reporting by <person>David Shepardson</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602271548RTRSNEWSCOMBINED_KBN3PH2HS-OUSBS_1",
            "pub_date": "2026-02-28 04:48:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "MWC 2026: Amdocs Collaborates with Google Cloud to Accelerate AI Adoption and Power the Agentic Telco Contact Center",
            "description": "\n<p><i><strong>The solution combines Google Cloud's Gemini Enterprise for Customer Experience and <org value=\"DOX.NaE\" idsrc=\"xmltag.org\" >Amdocs'</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='DOX' fmr-param-security-type='Equity'>( DOX )</span> Cognitive Core with telco-specific intelligence to deliver an end-to-end, generative Agentic Telco Contact Center</strong></i></p> <p><strong id=\"dateline\"><location value=\"LU/us.nj.jerity\" idsrc=\"xmltag.org\" >JERSEY CITY, NJ</location> / ACCESS Newswire / <chron>February 27, 2026</chron> / </strong><org value=\"DOX.NaE\" idsrc=\"xmltag.org\" >Amdocs</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='DOX' fmr-param-security-type='Equity'>( DOX )</span> , a leading provider of software and services to communications and media companies, today announced a collaboration with Google Cloud to help service providers accelerate adoption of AI and transform the telco contact center with an agentic, AI-first approach.</p><p>The solution combines the conversational intelligence of Google Cloud's Gemini Enterprise for Customer Experience (CX) with the domain precision of <org value=\"DOX.NaE\" idsrc=\"xmltag.org\" >Amdocs'</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='DOX' fmr-param-security-type='Equity'>( DOX )</span> Cognitive Core - the generative AI technology foundation of <org value=\"DOX.NaE\" idsrc=\"xmltag.org\" >Amdocs'</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='DOX' fmr-param-security-type='Equity'>( DOX )</span> agentic operating system for telco, aOS - creating an end-to-end, telco-specific, generative agentic contact center.</p><p>This collaboration fuses Google Cloud's AI and cloud leadership, including Google's Gemini models, with <org value=\"DOX.NaE\" idsrc=\"xmltag.org\" >Amdocs'</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='DOX' fmr-param-security-type='Equity'>( DOX )</span> telecom DNA and mastery of operational BSS/OSS systems of record. This solution delivers a ready-made, telco-grade AI experience fabric that bridges care, commerce, and operations through a unified, intelligent platform.</p><p>The solution is built on <org value=\"DOX.NaE\" idsrc=\"xmltag.org\" >Amdocs'</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='DOX' fmr-param-security-type='Equity'>( DOX )</span> Cognitive Core, with built-in telco-specific agents and sub-agents, working seamlessly with Gemini Enterprise for CX. It is designed as a turn-key, production-ready solution that enables operators to accelerate time-to-market with a pre-built, certified, domain-specific AI platform deployable on top of any BSS and OSS environment.</p><p>By combining Google Cloud's AI capabilities with <org value=\"DOX.NaE\" idsrc=\"xmltag.org\" >Amdocs'</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='DOX' fmr-param-security-type='Equity'>( DOX )</span> deep telco domain leadership, service providers gain out-of-the-box support for complex, end-to-end telco business processes, with full configurability to align with each operator's commercial policies, care journeys, and operating models. This includes AI-driven automation across billing inquiries, payment issues, disputes and adjustments, roaming issues, plan changes, renewals, and personalized upsell and cross-sell opportunities, all governed through business configuration and tightly embedded with systems of record for true end-to-end execution.</p><p>Built for telco-grade scale and trust, the solution incorporates strong governance, policy control, and end-to-end traceability, enabling service providers to confidently deploy generative and agentic AI across the telco contact center while maintaining compliance, auditability, and operational integrity.</p><p>As a result, service providers can lower operational costs, reduce call volumes, and accelerate AI innovation, while delivering faster, more personalized, and more consistent customer experiences that drive higher Net Promoter Scores (NPS) and measurable improvements in customer satisfaction.</p><p>&quot;Collaborating with <org value=\"DOX.NaE\" idsrc=\"xmltag.org\" >Amdocs</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='DOX' fmr-param-security-type='Equity'>( DOX )</span> enables us to bring Google Cloud's Gemini-powered conversational AI to telcos in a way that's deeply integrated with complex, real-world industry processes,&quot; said <person>Angelo Libertucci</person>, global head of industry, Telecom, Google Cloud. &quot;By combining our leadership in AI-driven customer experience with <org value=\"DOX.NaE\" idsrc=\"xmltag.org\" >Amdocs'</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='DOX' fmr-param-security-type='Equity'>( DOX )</span> deep domain expertise and systems of record, we're helping empower operators to deploy sophisticated AI agents that not only enhance the customer experience but also drive operational efficiency and measurable business value.&quot;</p><p>&quot;Our expanded integration with Google Cloud brings together our deep, verticalized expertise and telco ontology with the most advanced conversational AI technology in the market,&quot; said <person>Anthony Goonetilleke</person>, Group President of Technology and Head of Strategy at <org value=\"DOX.NaE\" idsrc=\"xmltag.org\" >Amdocs</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='DOX' fmr-param-security-type='Equity'>( DOX )</span>. &quot;Together, we're helping operators move from reactive, high-cost contact centers to proactive, AI-first engagement models that accelerate business value, reduce operating complexity, and streamline customer journeys.&quot;</p><p><org value=\"DOX.NaE\" idsrc=\"xmltag.org\" >Amdocs</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='DOX' fmr-param-security-type='Equity'>( DOX )</span> and Google will be showcasing their joint solutions at Mobile World Congress Barcelona, <chron>March 2-5</chron>.</p><p><strong>Supporting Resources</strong></p><ul style=\"list-style-type:disc;\"><li><p>Keep up with <org value=\"DOX.NaE\" idsrc=\"xmltag.org\" >Amdocs</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='DOX' fmr-param-security-type='Equity'>( DOX )</span> news by visiting the company's website</p></li><li><p>Follow us on X, Facebook, LinkedIn, and YouTube</p></li></ul><p><strong>About <org value=\"DOX.NaE\" idsrc=\"xmltag.org\" >Amdocs</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='DOX' fmr-param-security-type='Equity'>( DOX )</span></strong></p><p><org value=\"DOX.NaE\" idsrc=\"xmltag.org\" >Amdocs</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='DOX' fmr-param-security-type='Equity'>( DOX )</span> helps the world's leading communications and media companies deliver exceptional customer experiences through reliable, efficient, and secure operations at scale. We provide software products and services that embed intelligence into how work runs across business, IT, and network domains - delivering measurable outcomes in customer experience, network performance, cloud modernization, and revenue growth. With our talented people, and more than 40 years of experience running mission-critical systems around the globe, <org value=\"DOX.NaE\" idsrc=\"xmltag.org\" >Amdocs</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='DOX' fmr-param-security-type='Equity'>( DOX )</span> runs billions of transactions daily. Our technology is relied on every day, connecting people worldwide and advancing a more inclusive, connected world. Together, we help those who shape the future to make it amazing. <org value=\"DOX.NaE\" idsrc=\"xmltag.org\" >Amdocs</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='DOX' fmr-param-security-type='Equity'>( DOX )</span> is listed on the NASDAQ Global Select Market and reported revenue of <money>$4.53 billion</money> in fiscal 2025. For more information, visit www.amdocs.com.</p><p><strong><org value=\"DOX.NaE\" idsrc=\"xmltag.org\" >Amdocs'</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='DOX' fmr-param-security-type='Equity'>( DOX )</span> Forward-Looking Statement</strong></p><p>This press release includes information that constitutes forward-looking statements made pursuant to the safe harbor provision of the Private Securities Litigation Reform Act of 1995, including statements about <org value=\"DOX.NaE\" idsrc=\"xmltag.org\" >Amdocs'</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='DOX' fmr-param-security-type='Equity'>( DOX )</span> growth and business results in future quarters and years. Although we believe the expectations reflected in such forward-looking statements are based upon reasonable assumptions, we can give no assurance that our expectations will be obtained or that any deviations will not be material. Such statements involve risks and uncertainties that may cause future results to differ from those anticipated. These risks include, but are not limited to, the effects of general macroeconomic conditions, prevailing level of macroeconomic, business and operational uncertainty, including as a result of geopolitical events or other regional events or pandemics, changes to trade policies including tariffs and trade restrictions, as well as the current inflationary environment, and the effects of these conditions on the Company's customers' businesses and levels of business activity, including the effect of the current economic uncertainty and industry pressure on the spending decisions of the Company's customers. <org value=\"DOX.NaE\" idsrc=\"xmltag.org\" >Amdocs'</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='DOX' fmr-param-security-type='Equity'>( DOX )</span> ability to grow in the business markets that it serves, <org value=\"DOX.NaE\" idsrc=\"xmltag.org\" >Amdocs'</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='DOX' fmr-param-security-type='Equity'>( DOX )</span> ability to successfully integrate acquired businesses, adverse effects of market competition, rapid technological shifts that may render the Company's products and services obsolete, security incidents, including breaches and cyberattacks to our systems and networks and those of our partners or customers, potential loss of a major customer, our ability to develop long-term relationships with our customers, our ability to successfully and effectively implement artificial intelligence and Generative AI in the Company's offerings and operations, and risks associated with operating businesses in the international market. <org value=\"DOX.NaE\" idsrc=\"xmltag.org\" >Amdocs</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='DOX' fmr-param-security-type='Equity'>( DOX )</span> may elect to update these forward-looking statements at some point in the future; however, <org value=\"DOX.NaE\" idsrc=\"xmltag.org\" >Amdocs</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='DOX' fmr-param-security-type='Equity'>( DOX )</span> specifically disclaims any obligation to do so. These and other risks are discussed at greater length in <org value=\"DOX.NaE\" idsrc=\"xmltag.org\" >Amdocs'</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='DOX' fmr-param-security-type='Equity'>( DOX )</span> filings with the <org>Securities and Exchange Commission</org>, including in our Annual Report on Form 20-F for the fiscal year ended <chron>September 30, 2025</chron>, filed on <chron>December 15, 2025</chron>, and for the first quarter of fiscal 2026 on <chron>February 3, 2026</chron>.</p><p><strong>Media Contacts</strong></p><p>Mario Hajiloizi<br />Amdocs Public Relations<br />E-mail: mario.hajiloizi@amdocs.com</p><p><strong>SOURCE:</strong> <org>Amdocs Management Limited</org></p><br /><br />View the original press release on ACCESS Newswire<br /><br />\n      <img src=\"https://app.accessnewswire.com/img.ashx?id=1142340\" width=\"0\" height=\"0\"/>\n",
            "link": "https://www.fidelity.com/news/article/technology/202602271600ACCESSWRNAPR_____1142340",
            "pub_date": "2026-02-28 05:00:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Research Alert: CFRA Lowers Opinion On Shares Of Adtran Holdings To Sell From Hold",
            "description": "\n<p><chron>03:50 PM EST</chron>, <chron>02/27/2026</chron> (MT Newswires) -- CFRA, an independent research provider, has provided MT Newswires with the following research alert. Analysts at CFRA have summarized their opinion as follows:</p><p>We trim our 12-month target price by <money>$1</money> to <money>$9</money>, applying an EV/revenue multiple of 1.0x to our 2026 estimate, comparable to its three-year historical average multiple of 1.1x. We raise our 2026 EPS estimate by <money>$0.05</money> to <money>$0.48</money> and set 2027's at <money>$0.73</money>. The legislative environment for Huawei replacement in the EU is currently non-compulsory, meaning the transition away from Huawei will take years and may slow market activity until more stringent requirements are enacted. In addition, tightening supply conditions in key components such as memory and optics were highlighted, which could impact costs and supply chain dynamics. Finally, in some European markets, broadband deployment cycles are still at early stages, meaning revenue realization from these projects may be delayed, and some carriers have not started deployments yet.</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/investing-ideas/202602271550MIDNIGHTUSEQUITY_A3575407",
            "pub_date": "2026-02-28 04:50:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "EMERGING MARKETS-LatAm FX mixed, stocks down as risk appetite wanes; assets set for monthly gains",
            "description": "\n<pre>\n   (Updates with late trading details)\n\n        *\n      Latam FX set for longest win streak since 2009\n\n\n        *\n      <location value=\"LC/ar\" idsrc=\"xmltag.org\" >Argentina</location> stocks set for biggest monthly drop since 2024\n\n\n        *\n      <location value=\"LC/br\" idsrc=\"xmltag.org\" >Brazil's</location> inflation overshoots forecasts in mid-February\n\n\n        *\n      <location value=\"LC/co\" idsrc=\"xmltag.org\" >Colombia</location> to propose 50% reciprocal tariff on some Ecuadorean goods\n\n\n\n    By <person>Pranav Kashyap</person> and <person>Purvi Agarwal</person>\n       <chron>Feb 27</chron> (Reuters) - Latin American currencies were mixed on Friday while stocks moved broadly lower as risk appetite waned globally, though MSCI's indexes tracking both assets were poised for monthly gains.\n    The currencies index for the region was little changed, set for its seventh month of gains, its longest monthly winning streak since 2009.\n    The stocks gauge was on track to end its second straight month in the green.\n    However, the equity gauge was up only about 4% this month, after surging 15% in January, while the currencies index gained roughly 2%, compared with the previous month's 5% advance.\n<location value=\"LC/br\" idsrc=\"xmltag.org\" >Brazil's</location> real reversed declines to inch 0.1% higher. Data showed annual inflation cooled to 4.1%, from 4.5% in January, but was above the 3.8% expected by analysts.\n    However, the print is not expected to prevent the country's central bank from kicking off a monetary policy easing cycle in March, as indicated by policymakers recently.\n    This would be the central bank's first interest rate cut since 2024 if the expectations come true, bringing the Selic rate down from a near two-decade high of 15%.\n    &quot;Although this reading doesn't show a worsening in inflation year-on-year, it certainly shows that stickiness may be higher in services and core measures, in line with our scenario,&quot; said Citigroup analysts led by <person>Ernesto Revilla</person>.\n    &quot;This data strengthens our more hawkish monetary policy call of a 25-basis-point cut in the March meeting.&quot;\n\n    EQUITIES DIP SLIGHTLY\n    Most equities in the region were lower on the day as global risk appetite faltered.\n    <location value=\"LU/br..saopau\" idsrc=\"xmltag.org\" >Sao Paulo</location> stocks fell 1.2%, with some financial firms including Itau Unibanco falling 2%, tracking declines in global financial stocks.\n    Mexican stocks were the only outliers, up 0.4%.\n    AI chipmaker Nvidia's results on Wednesday failed to provide the boost some investors had bet on, with doubts on the AI-fueled rally and stretched tech valuations taking center stage.\nColombian equities sank 0.8%, setting them up for their worst week since <chron>March 2023</chron>. The index has shed nearly 7% over the last three sessions as trade tensions with <location value=\"LC/ec\" idsrc=\"xmltag.org\" >Ecuador</location> intensify.\n    Elsewhere, Chilean stocks slipped 1.6% and were set to break a half-year monthly winning streak, while the peso fell 0.7%. The local unemployment rate rose to 8.3% in the quarter through January.\n    February has been a data-heavy month across the region. Data showed convincing signs that <location value=\"LC/br\" idsrc=\"xmltag.org\" >Brazil's</location> economy is cooling, while <location value=\"LC/mx\" idsrc=\"xmltag.org\" >Mexico</location>, <location value=\"LC/co\" idsrc=\"xmltag.org\" >Colombia</location> and <location value=\"LC/ar\" idsrc=\"xmltag.org\" >Argentina</location> are gaining momentum. That divergence is starting to show up in policy paths, offering different carry-trade benefits.\nMeanwhile, <location value=\"LC/ar\" idsrc=\"xmltag.org\" >Argentina's</location> stock index slumped 4%, set for its biggest monthly fall in two years. It was largely weighed down by oil firm YPF, which fell 4.6% despite projecting a higher EBITDA in 2026.\n\n\n    Key Latin American stock indexes and currencies:\n\n Latin American market\n prices from Reuters\n\n\n\n\n\n\n\n MSCI Emerging Markets         1608.41      -0.67\n\n MSCI LatAm                    3238.26      -0.56\n Brazil Bovespa              188694.25      -1.21\n Mexico IPC                   71681.47       0.41\n Chile IPSA                   10877.74      -1.56\n Argentina Merval            2645710.3      -3.95\n                                     2\n Colombia COLCAP               2266.87      -0.75\n\n\n\n\n\n\n\n\n Brazil real                    5.1328       0.08\n Mexico peso                    17.223      -0.19\n Chile peso                      871.2      -0.73\n Colombia peso                  3765.5      -0.31\n Peru sol                       3.3549      -0.01\n Argentina peso (interbank)       1396       0.85\n\n Argentina peso (parallel)        1405\n                                                0\n\n\n\n\n(Reporting by <person>Pranav Kashyap</person> and <person>Purvi Agarwal</person> in Bengaluru; editing by <person>Barbara Lewis</person> and <person>Jonathan Ananda</person>)\n\n</pre>\n",
            "link": "https://www.fidelity.com/news/article/international/202602271545RTRSNEWSCOMBINED_L1N3ZN135_1",
            "pub_date": "2026-02-28 04:45:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Teledyne, M Subs- Teledyne Marine, M Subs to Collaborate on Autonomous Underwater Technologies",
            "description": "\n<p><chron>03:55 PM EST</chron>, <chron>02/27/2026</chron> (MT Newswires) -- <org value=\"TDY.NaE\" idsrc=\"xmltag.org\" >Teledyne Technologies'</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='TDY' fmr-param-security-type='Equity'>( TDY )</span>  marine division signed a memorandum of understanding to collaborate with M Subs, a UK-based company specializing in marine unmanned systems.</p><p>The collaboration aims to advance uncrewed underwater systems, sensing platforms, and mission-support technologies for the <org>UK Royal Navy</org> and other global naval customers, Teledyne Marine said Friday in a statement.</p><p>Price: 679.76, Change: +0.94, Percent Change: +0.14</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602271555MIDNIGHTUSEQUITY_A3575403",
            "pub_date": "2026-02-28 04:55:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "TRG Latin America Acquisitions Corp. Completes $200 Million Initial Public Offering",
            "description": "\n<p align=\"justify\"><location value=\"LU/us.ny.nyc\" idsrc=\"xmltag.org\" >NEW YORK, NEW YORK</location>, <chron>Feb.  27, 2026</chron>  (GLOBE NEWSWIRE) --  <org value=\"TRGSU.NaE\" idsrc=\"xmltag.org\" >TRG Latin America Acquisitions Corp.</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='TRGSU' fmr-param-security-type='Equity'>( TRGSU )</span> (“TRG” or the “Company”) announced today the closing of its initial public offering of 20,000,000 units, at a price of <money>$10.00</money> per unit, resulting in gross proceeds of <money>$200,000,000</money>. The units began trading on the <org>Nasdaq Stock Exchange</org> (“Nasdaq”) on <chron>February 26, 2026</chron> under the ticker symbol “TRGSU”. Each unit consists of one Class A ordinary share and one right entitling the holder thereof to receive one-tenth of one Class A ordinary share upon the consummation of an initial business combination. The Class A ordinary shares and rights comprising the units are expected to begin separate trading no later than the 52nd day following this date. Once the securities comprising the units begin separate trading, the Class A ordinary shares and rights are expected to be listed on Nasdaq under the symbols “TRGS” and “TRGSR,” respectively.</p>  <p align=\"justify\">Santander acted as sole book-running manager. The Company has granted the underwriter a 45-day option to purchase up to an additional 3,000,000 units at the initial public offering price to cover over-allotments, if any.</p>  <p align=\"justify\">The offering was made by means of a prospectus. Copies of the prospectus may be obtained from <org>Santander US Capital Markets LLC</org>, <location>437 Madison Avenue</location>, <location value=\"LU/us.ny.nyc\" idsrc=\"xmltag.org\" >New York, NY</location> 10022, Attention: ECM Syndicate, by email at equity-syndicate@santander.us, or by telephone at 833-818-1602.</p>  <p align=\"justify\">A registration statement relating to the securities has been filed with the <org>U.S. Securities and Exchange Commission</org> (“SEC”) and became effective on <chron>February 25, 2026</chron>. This press release shall not constitute an offer to sell or the solicitation of an offer to buy, nor shall there be any sale of these securities in any state or jurisdiction in which such offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of any such state or jurisdiction.</p>  <p><b>About <org value=\"TRGSU.NaE\" idsrc=\"xmltag.org\" >TRG Latin America Acquisitions Corp.</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='TRGSU' fmr-param-security-type='Equity'>( TRGSU )</span></b></p>  <p align=\"justify\">The Company is a blank check company incorporated as a <location value=\"LC/ky\" idsrc=\"xmltag.org\" >Cayman Islands</location> exempted company and formed for the purpose of effecting a merger, amalgamation, share exchange, asset acquisition, share purchase, reorganization or similar business combination with one or more businesses. While the Company may pursue a business combination in any business or industry, it intends to capitalize on the ability of its management team and initially focus its search on identifying a prospective target business that can benefit from its Chief Executive Officer and Chairman <person>Nicolas S. Rohatyn’s</person>, a co-founder, partner and member of The Rohatyn Group’s executive committee, and Chief Financial Officer <person>Miguel A. Gutierrez’s</person>, a co-founder, partner and head of private markets at <org>The Rohatyn Group</org>, historical areas of business expertise, with a particular focus on opportunities in <location value=\"LC/ar\" idsrc=\"xmltag.org\" >Argentina</location>. <person>Miguel Kiguel</person>, <person>Daniel Gerold</person>, and <person>Thomas Wolf</person> will be serving as board members.</p>  <p><b>Forward-Looking Statements</b></p>  <p align=\"justify\">This press release contains statements that constitute “forward-looking statements,” including with respect to the initial public offering and the anticipated use of the net proceeds. No assurance can be given that the net proceeds of the offering will be used as indicated. Forward-looking statements are subject to numerous conditions, many of which are beyond the control of the Company, including those set forth in the Risk Factors section of the Company’s registration statement and prospectus for the Company’s initial public offering filed with the <org>SEC</org>. Copies of these documents are available on the SEC’s website, www.sec.gov. The Company undertakes no obligation to update these statements for revisions or changes after the date of this release, except as required by law.</p>  <p><b>Investor Contact:</b></p>  <p>Investor Relations Team<br/>TRGIR@rohatyngroup.com</p>  Image: https://www.globenewswire.com/newsroom/ti?nf=OTY2MzA4NSM3NDU5OTY4IzUwMDE1ODkzNA==  <br/> Image: https://ml.globenewswire.com/media/MjhmZTAyMDgtMWRjZi00NzFlLWE3N2ItYWVmMTI3NzgzMmRkLTUwMDE1ODkzNC0yMDI2LTAyLTI3LWVu/tiny/TRG-Latin-America-Acquisitions.png\nSource: <org value=\"TRGSU.NaE\" idsrc=\"xmltag.org\" >TRG Latin America Acquisitions Corp.</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='TRGSU' fmr-param-security-type='Equity'>( TRGSU )</span>\n",
            "link": "https://www.fidelity.com/news/article/default/202602271600PRIMZONEFULLFEED9663085",
            "pub_date": "2026-02-28 05:00:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Exclusive-Warner Bros signs $110 billion deal with Paramount, its executive discloses in townhall",
            "description": "<p><chron>Feb 27</chron> (Reuters) - <org value=\"WBD.NaE\" idsrc=\"xmltag.org\" >Warner Bros Discovery</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='WBD' fmr-param-security-type='Equity'>( WBD )</span> has agreed to be acquired by <org value=\"PSKY.NaE\" idsrc=\"xmltag.org\" >Paramount Skydance</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='PSKY' fmr-param-security-type='Equity'>( PSKY )</span> in a <money>$110 billion</money> deal signed Friday morning, according to an audio clip of a global townhall by the company, which was reviewed by Reuters.</p>\n<p>&quot;<org value=\"NFLX.NaE\" idsrc=\"xmltag.org\" >Netflix</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NFLX' fmr-param-security-type='Equity'>( NFLX )</span> had the legal right to match the PSKY offer. As you all know, they ultimately decided not to do that. That then resulted in a signed agreement with PSKY as of this morning. So that's where everything stands,&quot; <person>Bruce Campbell</person>, <org>Warner Bros'</org> chief revenue and strategy officer, said in the townhall.</p>\n<p><org>Paramount</org> and <org>Warner Bros</org> did not immediately respond to requests for comment.</p>\n<p>The agreement caps a bidding war after <org value=\"NFLX.NaE\" idsrc=\"xmltag.org\" >Netflix</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NFLX' fmr-param-security-type='Equity'>( NFLX )</span> declined to match <org>Paramount's</org> latest <money>$31</money>-per-share offer, which was deemed superior by <org>Warner Bros</org> to the streaming pioneer's <money>$27.75</money>-per-share agreement for its studio and streaming assets.</p>\n<p><org>Paramount</org> shares jumped 24%, while <org value=\"NFLX.NaE\" idsrc=\"xmltag.org\" >Netflix</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NFLX' fmr-param-security-type='Equity'>( NFLX )</span> rose 13% as investors welcomed its decision to back out of the <org>Warner Bros</org> race.   'EU ANTITRUST APPROVAL LIKELY NOT A HURDLE' </p>\n<p><org>Paramount</org> is expected to easily win <org>European Union</org> antitrust approval, with any required divestments likely to be minor, Reuters reported on Friday, citing sources.</p>\n<p>However, the merger has drawn scrutiny from California State Attorney General <person>Rob Bonta</person>, who said that the state is investigating the <org>Paramount</org> deal and will be &quot;vigorous&quot; in its review.The deal - which includes some <money>$29 billion</money> in debt - is among <location value=\"LU/us.ca.hollyw\" idsrc=\"xmltag.org\" >Hollywood's</location> biggest media shake-ups and will create one of the largest film studios in the world, allowing <org>Paramount</org> to tap Warner's trove of intellectual property, including franchises such as &quot;Fantastic Beasts&quot; and &quot;The Matrix&quot;.</p>\n<p>It will also allow <org>Paramount</org> to bolster its streaming efforts, with a potential combination of HBO Max and Paramount+, enabling it to gain market share and tussle with market leader Netflix. </p>\n<p><org>Paramount</org> was in pursuit of <org>Warner Bros</org> since late last year when it launched a hostile campaign to wrestle the company from the streaming giant by consistently raising its offer. </p>\n<p>The company, led by billionaire <person>Larry Ellison's</person> son <person>David Ellison</person>, enticed Warner's board back to the bargaining table by raising the possibility of an improved cash offer.</p>\n<p>In its revised bid, <org>Paramount</org> raised the termination fee it would pay should the deal fail to gain regulatory approval to <money>$7 billion</money> from <money>$5.8 billion</money>.</p>\n<p><org>Paramount</org> paid the <money>$2.8 billion</money> termination fee that <org>Warner Bros</org> owed <org value=\"NFLX.NaE\" idsrc=\"xmltag.org\" >Netflix</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NFLX' fmr-param-security-type='Equity'>( NFLX )</span>, the streaming giant said in a regulatory filing on Friday.</p>\n<p>Activist investor <org>Ancora Holdings</org>, which owns a small stake in <org>Warner Bros</org>, had also stepped up pressure on the HBO owner to engage more with <org>Paramount</org>.</p>\n<p>Lawmakers on both sides of the political aisle have raised concerns that any deal to acquire <org>Warner Bros</org> could result in fewer choices and higher prices for consumers. </p>\n<p>Cinema operators are also concerned that combining large <location value=\"LU/us.ca.hollyw\" idsrc=\"xmltag.org\" >Hollywood</location> studios could cost jobs and reduce the number of movies released in theaters.  </p>\n<p> (Reporting by <person>Karol Badohal</person> in <location value=\"LC/pl\" idsrc=\"xmltag.org\" >Poland</location> and <person>Harshita Mary Varghese</person> in Bengaluru, additional reporting by <person>Jaspreet Singh</person> in Bengaluru; Editing by Arun Koyyur and Shinjini Ganguli)</p>\n",
            "link": "https://www.fidelity.com/news/article/top-news/202602271340RTRSNEWSCOMBINED_KBN3PH2BF-OUSBS_1",
            "pub_date": "2026-02-28 05:06:33",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "GLOBAL MARKETS-Stocks fall as investors take an AI breather, oil prices rise",
            "description": "\n<p>(Updates prices throughout with afternoon trading)</p>\n<p>*</p>\n<p>AI concerns hit tech stocks, <org value=\"NVDA.NaE\" idsrc=\"xmltag.org\" >Nvidia</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NVDA' fmr-param-security-type='Equity'>( NVDA )</span> down 3.5%</p>\n<p></p>\n<p>*</p>\n<p>U.S.-<location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location> tensions lift oil prices, crude up 2.6%</p>\n<p></p>\n<p>*</p>\n<p>Sterling falls after Labour's election defeat in\n<location value=\"LU/us.ny.manchr\" idsrc=\"xmltag.org\" >Manchester</location></p>\n<p></p>\n<p>By <person>Chibuike Oguh</person></p>\n<p><location value=\"LU/us.ny.nyc\" idsrc=\"xmltag.org\" >NEW YORK</location>, <chron>Feb 27</chron> (Reuters) - Global stocks edged lower\non Friday due to ongoing concerns about valuations and the\ndisruptive force of AI, while the potential for supply\ndisruptions due to tensions between the U.S. and <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location> lifted oil\nprices.</p>\n<p>Market sentiment has weakened as investors worry more about\nthe broader impact of AI on technology companies, even after AI\nchipmaker <org value=\"NVDA.NaE\" idsrc=\"xmltag.org\" >Nvidia</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NVDA' fmr-param-security-type='Equity'>( NVDA )</span> posted better-than-expected results.\nShares in <org value=\"NVDA.NaE\" idsrc=\"xmltag.org\" >Nvidia</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NVDA' fmr-param-security-type='Equity'>( NVDA )</span>, the world's most valuable company, were down\n3.5%, extending losses from the prior session.</p>\n<p><location>Wall Street</location> was lower, with the benchmark S&amp;P 500\ndown 0.77%, the Dow Jones Industrial Average falling\n1.33% and the Nasdaq Composite off by 1.2%.</p>\n<p>&quot;We're just in a stage in the market cycle where not just\nthe market but that particular industry group - semiconductors,\nthat's up more than 100% in a year - have priced in a lot of\ngood news. And now it's time for a breather,&quot; said <person>Talley Leger</person>,\nchief market strategist at <org>The Wealth Consulting Group</org>.</p>\n<p>Semiconductor stocks were down 1.9%.</p>\n<p>&quot;I love semiconductor companies,&quot; Leger said. &quot;As a group,\nthe share prices have achieved my return objectives so at this\nstage I have locked in and protected the gains in these stocks\nsince the April lows.&quot;</p>\n<p>MSCI's All Country World Index was down\n0.45% but was still on track for a 0.15% gain for the week and a\nnearly 1% rise in February.</p>\n<p><location value=\"LR/eur\" idsrc=\"xmltag.org\" >Europe's</location> STOXX 600 was up 0.1%.</p>\n<p>U.S.-<location value=\"LC/ir\" idsrc=\"xmltag.org\" >IRAN</location> TALKS CONTINUE</p>\n<p>Markets were also watching developments in U.S.-<location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location> nuclear\ntalks, as <location value=\"LU/us.dc.wash\" idsrc=\"xmltag.org\" >Washington</location> amassed more military resources in the\n<location value=\"LR/mde\" idsrc=\"xmltag.org\" >Middle East</location>.\nAn Omani mediator gave an optimistic summary of the latest\nnegotiations, but there were no obvious signs of a breakthrough\nthat could avert potential U.S. strikes. U.S. President Donald\nTrump on Friday said he was still unhappy with <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location>, threatening\nto use force if necessary to reach an agreement.\nThe U.S. and <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location> plan to resume negotiations after\nconsultations in their countries' capitals, Omani Foreign\nMinister <person>Sayyid Badr Albusaidi</person> said in a post on X after the\nday's meetings in <location value=\"LC/ch\" idsrc=\"xmltag.org\" >Switzerland</location>.</p>\n<p>U.S. crude rose 2.6% to <money>$66.93</money> a barrel, and Brent\nrose to <money>$72.58</money>, up 2.6%.</p>\n<p>In the bond market, the yield on benchmark U.S. 10-year\nnotes fell 5.7 basis points to 3.96%. The 2-year\nnote yield fell 6.7 basis points to 3.381%.</p>\n<p>In <location value=\"LR/eur\" idsrc=\"xmltag.org\" >Europe</location>, the yield on the benchmark German 10-year Bunds\nfell 1.1 basis points to 2.643%.</p>\n<p>STARMER FALTERS\nSterling was down 0.07% at <money>$1.34473</money> after British Prime\nMinister <person>Keir Starmer's</person> <org>Labour Party</org> suffered an election defeat\nin the Greater Manchester area, where it has dominated for\nalmost a century.\nJapanese data showed cooling inflation in <location value=\"LU/jp..tokyo\" idsrc=\"xmltag.org\" >Tokyo</location> and\nweaker-than-expected factory output, complicating the case for\npolicy rate increases by the central bank.</p>\n<p>The yen rose 0.1% to 156.96 against the dollar.</p>\n<p>The dollar index, which measures the greenback\nagainst a basket of currencies, was down 0.12% at 97.61. The\neuro rose 0.18% to <money>$1.1818</money> against the dollar.</p>\n<p>Spot gold rose 1.2% to <money>$5,249.28</money> an ounce. Spot\nsilver rose 5.57% to <money>$93.25</money> an ounce.</p>\n<p>(Reporting by <person>Chibuike Oguh</person> in <location value=\"LU/us.ny.nyc\" idsrc=\"xmltag.org\" >New York</location>; Editing by <person>Hugh Lawson</person>\nand <person>David Gaffen</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/international/202602271159RTRSNEWSCOMBINED_L1N3ZN0GI_1",
            "pub_date": "2026-02-28 00:59:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Sector Update: Tech",
            "description": "\n<p><chron>03:36 PM EST</chron>, <chron>02/27/2026</chron> (MT Newswires) -- Tech stocks fell late Friday afternoon with the State Street Technology Select Sector SPDR ETF (XLK) declining 1.5% and the State Street SPDR S&amp;P Semiconductor ETF (XSD) dropping 2%.</p><p>The Philadelphia Semiconductor index shed 1.2%.</p><p>In corporate news, <org value=\"ZS.NaE\" idsrc=\"xmltag.org\" >Zscaler</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='ZS' fmr-param-security-type='Equity'>( ZS )</span>  delivered strong fiscal Q2 results, beating the market's adjusted earnings and sales expectations. CFRA, an independent research provider, said that a slowdown in net new annual recurring revenue additions will be a &quot;key investor concern.&quot; <org value=\"ZS.NaE\" idsrc=\"xmltag.org\" >Zscaler</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='ZS' fmr-param-security-type='Equity'>( ZS )</span> shares fell 13%.</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/us-markets/202602271536MIDNIGHTUSEQUITY_A3575395",
            "pub_date": "2026-02-28 04:36:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "2328.io Announces Launch of International Crypto Payment Infrastructure for Online Businesses",
            "description": "\n<p> Image: 2328.io <br/></p>  <p><location value=\"LU/lc..castri\" idsrc=\"xmltag.org\" >CASTRIES, Saint Lucia</location>, <chron>Feb.  27, 2026</chron>  (GLOBE NEWSWIRE) -- 2328.io today announced the global launch of its infrastructure-grade cryptocurrency payment platform designed for online businesses operating in cross-border and digital-native markets.</p>  <p>The launch comes amid continued growth in stablecoin settlement volumes and increasing demand from online merchants for programmable digital payment systems. As businesses expand internationally, the need for structured crypto payment infrastructure that supports volatility management, automated reconciliation, and payout automation has become more prominent.</p>  <p>2328.io introduces a payment infrastructure model built around the principle:</p>  <p><strong>All Crypto Payments. Full Financial Control.</strong></p>  <p>Founded by a team active in crypto processing since 2017, 2328 brings operational experience in blockchain integration, transaction routing, monitoring systems, and financial workflow automation. The platform currently serves SaaS providers, digital platforms, and online service operators with international customer bases.</p>  <p>The system enables businesses to accept cryptocurrency and stablecoin payments across websites, Telegram bots, Discord bots, mobile and desktop applications, and POS software environments. Integration is available via hosted checkout or API-based implementation.</p>  <p><strong>Fast Launch with Structured Settlement</strong></p>  <p>2328 provides a configurable payment infrastructure that includes:</p>  <ul type=\"disc\"><li>Automatic conversion of incoming payments to USDT or USDC</li><li>Custodial wallet management</li><li>Internal crypto swap functionality</li><li>Adjustable payment accuracy thresholds</li><li>Currency-level configuration settings</li><li>Network-level validation within supported blockchain ecosystems<br/><br/></li></ul>  <p>Invoices may be generated in fiat currencies with automatic recalculation into selected crypto assets or issued directly in cryptocurrency. Each transaction is linked to structured settlement logic, allowing integration into backend accounting systems.</p>  <p><strong>Flexible Integration Architecture</strong></p>  <p>The platform supports multiple integration approaches:</p>  <ul type=\"disc\"><li>Hosted Checkout for rapid deployment</li><li>H2H (Host-to-Host) API for backend-level customization</li><li>Static wallet assignment for balance-based models</li><li>Bulk API payouts for automated disbursement workflows<br/><br/></li></ul>  <p>Bulk payout functionality enables batch withdrawals in supported digital assets with optional stablecoin conversion prior to distribution. This supports platforms operating affiliate programs, marketplace settlements, and exchange withdrawals.</p>  <p>The infrastructure is designed to scale alongside transaction growth without requiring architectural migration.</p>  <p><strong>Global Operational Framework</strong></p>  <p>2328 operates as an international technology company specializing in cryptocurrency payment infrastructure and digital settlement automation.</p>  <p>The distributed team includes blockchain engineers, fintech system architects, and information security specialists. The platform interface is available in eight languages: English, Arabic, Spanish, French, German, Portuguese, Simplified Chinese, and Russian.</p>  <p><strong>Use Cases</strong></p>  <p>2328 infrastructure is designed for:</p>  <ul type=\"disc\"><li>E-commerce platforms</li><li>SaaS businesses</li><li>Marketplaces</li><li>Exchange services</li><li>Digital service providers<br/><br/></li></ul>  <p>Processing fees begin at 0.3%, subject to transaction volume and operational profile.</p>  <p><strong>About 2328</strong></p>  <p>2328 is an international technology company developing cryptocurrency payment infrastructure and financial automation systems for digital businesses.</p>  <p>The company’s mission is to make cryptocurrency payments a practical and accessible financial instrument globally, supporting structured digital revenue models across international markets.</p>  <p>Company details<br/>Media contact name: <person>Jenny Shard</person><br/>Email: hello@2328.io<br/>Website: https://2328.io</p>  <p><em>Disclaimer: This sponsored content is provided by the content provider and does not necessarily reflect the views of this media platform or its publisher. The information is shared for general informational purposes only and should not be considered financial, investment, or trading advice. Cryptocurrency and mining-related activities carry risks, including the potential loss of capital, and readers are encouraged to conduct their own research and seek professional advice where appropriate. Speculate only with funds that you can afford to lose.The media platform and publisher assume no responsibility for any losses or claims arising from reliance on this content. GlobeNewswire does not endorse any content on this page.</em></p>  <p><strong>Legal Disclaimer:</strong> This article is provided on an <strong>“as-is” basis,</strong> without warranties or representations of any kind, express or implied. The media platform assumes no responsibility or liability for the accuracy, content, completeness, legality, or reliability of the information presented. Any complaints, claims, or copyright concerns related to this article should be directed to the content provider mentioned above.</p>  <p>A photo accompanying this announcement is available at https://www.globenewswire.com/NewsRoom/AttachmentNg/19a318bf-cd89-4532-b259-5b7105dcd604</p>  Image: https://www.globenewswire.com/newsroom/ti?nf=OTY2MzEzOCM3NDYwMDI3IzUwMDE1OTE0NA==  <br/> Image: https://ml.globenewswire.com/media/ZGQ1NWU1OTctYmUxYy00NGVhLTgyYzYtZDcyOGE4NWMzZmQ1LTUwMDE1OTE0NC0yMDI2LTAyLTI3LWVu/tiny/2328-io.png <div style=\"padding:0px;width: 100%;\"><div style=\"clear:both\"></div><div style=\"float: right;padding-left:20px\"><div><h5>2328.io</h5></div><div>  Image: https://ml.globenewswire.com/media/19a318bf-cd89-4532-b259-5b7105dcd604/medium/2328-io.png  </div><p></p><div> <h5>2328.io</h5></div></div></div>\nSource: 2328.io\n",
            "link": "https://www.fidelity.com/news/article/technology/202602271539PRIMZONEFULLFEED9663138",
            "pub_date": "2026-02-28 04:39:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Research Alert: CFRA Lowers Opinion On Shares Of Zoom Communications To Sell From Hold",
            "description": "\n<p><chron>03:30 PM EST</chron>, <chron>02/27/2026</chron> (MT Newswires) -- CFRA, an independent research provider, has provided MT Newswires with the following research alert. Analysts at CFRA have summarized their opinion as follows:</p><p>We lower our 12-month target price by <money>$25</money> to <money>$65</money>, applying an EV/revenue multiple of 2.3x to our FY 27 (Jan.) estimate, a discount to its three-year historical average multiple at 3.7x. We raise our FY 27 EPS estimate by <money>$0.04</money> to <money>$5.91</money> and set FY 28's at <money>$6.12</money>. The Online business, while stabilizing, continues to see only slight growth, and guidance suggests that this segment will remain relatively flat, with only modest increases anticipated for FY 27. The company noted that price increases are not expected to be an ongoing lever for growth, indicating that future revenue improvement will rely more heavily on adding value and product innovation rather than pricing actions. Finally, the ongoing transition from on-prem to cloud for large enterprise customers remains incomplete, with approximately 150 million seats still on-prem. This indicates a slower migration pace and ongoing challenges in capturing full market potential.</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/investing-ideas/202602271530MIDNIGHTUSEQUITY_A3575394",
            "pub_date": "2026-02-28 04:30:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Generational Group Advises JMPE Electrical Engineering in its Sale to Agathos AEC, a Portfolio Company of Hunter Forest Capital",
            "description": "\n<p>    <location value=\"LU/us.tx.dallas\" idsrc=\"xmltag.org\" >DALLAS</location>--(BUSINESS WIRE)--\n<org>Generational Group</org>, a leading mergers and acquisitions advisory firm for privately held businesses, is pleased to announce the sale of JMPE Electrical Engineering to Agathos AEC, a portfolio company of <org>Hunter Forest Capital</org>. The acquisition closed <chron>February 2, 2026</chron>.\n\n</p><p>\nBased in <location value=\"LU/us.ca.sntaba\" idsrc=\"xmltag.org\" >Santa Barbara, California</location>, JMPE Electrical Engineering is a full-spectrum electrical engineering and lighting design firm serving commercial, industrial, government, and residential clients. Founded in the mid 1990s, the company specializes in power, lighting and signal system design, distribution system engineering, short circuit and coordination studies, Title 24 lighting calculations, arc flash analysis and photovoltaic solar design, all aimed at delivering efficient, code-compliant solutions for built environments. With additional offices in <location value=\"LU/us.ca.bakeld\" idsrc=\"xmltag.org\" >Bakersfield</location> and <location value=\"LU/us.ca.sanria\" idsrc=\"xmltag.org\" >Santa Maria</location>, JMPE combines technical expertise with personalized service to support architects, facility managers and owners in achieving practical, energy-efficient electrical and lighting outcomes across diverse project types.\n\n</p><p>\nHeadquartered in <location value=\"LU/us.tx.galton\" idsrc=\"xmltag.org\" >Galveston, Texas</location>, Agathos AEC is currently executing a strategy to build a diversified, nationwide architecture and engineering design firm. The platform is actively seeking to partner with small, entrepreneurial firms that are at a critical inflection point and can benefit from the professional services brought to the table by the Agathos corporate team.\n\n</p><p>\nAgathos AEC is backed by <org>Hunter Forest Capital</org>, a private investment firm located in <location value=\"LU/us.il.chicgo\" idsrc=\"xmltag.org\" >Chicago, Illinois</location> that partners with growing companies in critical-needs industries to drive long-term operational and financial value, along with capital partners <org>Aldine Capital Partners</org>, <org>Petra Capital Partners</org>, <org>Pine Street Capital</org> and <org>Patriot Capital</org>.\n\n</p><p>\n<org>Generational Group</org> Executive Managing Director, M&amp;A, <location>Western Region</location> – <person>Lori Galloway</person>, and her team led by Managing Director, M&amp;A, <person>Mike Meredith</person>, with the support of Senior Vice President, M&amp;A, <person>Amy Wall</person> successfully closed the deal. Senior Managing Director, <person>Ashok Tandon</person> and Senior M&amp;A Advisor, <person>Ken Beckrich</person> established the initial relationship with JMPE Electrical Engineering.\n\n</p><p>\n<person>Mike Meredith</person> stated, “JMPE will be an excellent addition to the Agathos AEC platform.”\n\n</p><p>\n<person>Ryan Binkley</person>, CEO of <org>Generational Group</org>, stated, “This transaction highlights our approach to forming strong, collaborative relationships that support lasting value creation. By uniting partners around a clear direction, it sets the stage for continued progress and long-term success.”\n\n</p><p>\n<b>About <org>Generational Group</org></b>\n\n</p><p>\n<org>Generational Group</org>, headquartered in <location value=\"LU/us.tx.dallas\" idsrc=\"xmltag.org\" >Dallas, TX</location>, is a leading, award winning full-service M&amp;A advisory firm. Generational has over 300 professionals across 16 offices in <location value=\"LR/nam\" idsrc=\"xmltag.org\" >North America</location>. The firm empowers business owners to unlock the full value of their companies through a comprehensive suite of services—including strategic growth consulting, exit planning education, business valuation, value enhancement strategies, M&amp;A advisory, digital solutions, and wealth management.\n\n</p><p>\nCelebrating its 20<sup>th</sup> year, Generational has successfully closed over 1,800 transactions and has ranked #1 or #2 in all LSEG league tables for deals valued between <money>$25 million</money> and <money>$1 billion</money> in 2024 and 2025.\n\n</p><p>\nThe firm was named <b>2025 USA Investment Banking Firm of the Year</b> by the Global M&amp;A Network and recognized as <b>Investment Banking Firm of the Year</b> by The M&amp;A Advisor in both 2022, 2024, and 2025.\n\n</p><p><img alt=\"\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20260227402126r1&amp;sid=acqr8&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\" /><span class=\"bwct31415\" /></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\">https://www.businesswire.com/news/home/20260227402126/en/</span></p>\n<p>Source: <org>Generational Group</org></p>\n",
            "link": "https://www.fidelity.com/news/article/mergers-and-acquisitions/202602271540BIZWIRE_USPR_____20260227_BW402126",
            "pub_date": "2026-02-28 04:40:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US agency approves Charter Communications' $34.5 billion deal to buy Cox",
            "description": "\n<p><location value=\"LU/us.dc.wash\" idsrc=\"xmltag.org\" >WASHINGTON</location>, <chron>Feb 27</chron> (Reuters) - <org>The Federal\nCommunications Commission</org> said Friday it approved <org value=\"CHTR.NaE\" idsrc=\"xmltag.org\" >Charter\nCommunications'</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='CHTR' fmr-param-security-type='Equity'>( CHTR )</span> <money>$34.5 billion</money> acquisition of <org>Cox Communications</org>.</p>\n<p>The deal announced in <chron>March 2025</chron> combines two of the largest\nU.S. cable and broadband operators in their battle with\nstreaming giants and mobile carriers.</p>\n<p>The FCC said Spectrum-owner Charter will invest billions of\ndollars to upgrade its network and deliver high-speed service\nand the company committed to onshoring jobs. Charter also agreed\nto extend its <money>$20</money>/hour minimum starting wage to Cox workers.</p>\n<p>Reuters reported last year the deal would create the largest\nU.S. cable TV and broadband provider with around 38 million\nsubscribers, surpassing market leader <org value=\"CMCSA.NaE\" idsrc=\"xmltag.org\" >Comcast</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='CMCSA' fmr-param-security-type='Equity'>( CMCSA )</span>.</p>\n<p>(Reporting by <person>David Shepardson</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602271543RTRSNEWSCOMBINED_S0N3YS056_1",
            "pub_date": "2026-02-28 04:43:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Research Alert: CFRA Maintains Buy Opinion On Ads Of Vipshop Holdings",
            "description": "\n<p><chron>01:30 PM EST</chron>, <chron>02/27/2026</chron> (MT Newswires) -- CFRA, an independent research provider, has provided MT Newswires with the following research alert. Analysts at CFRA have summarized their opinion as follows:</p><p>We raise our target to <money>USD21</money> from <money>USD20</money>, on 7.8x our 2026 EPADS forecast, which represents a premium to the stock's three-year average forward P/E of 6.8x. We believe this multiple reasonably reflects (i) <org value=\"VIPS.NaE\" idsrc=\"xmltag.org\" >Vipshop's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='VIPS' fmr-param-security-type='Equity'>( VIPS )</span> strong profitability and well-managed operating expenses; (ii) double-digit growth from the loyal high-end super VIP customer base, which indicates high repeat purchase potential and overall growth; and (iii) an improving macroeconomic backdrop, including a gradual recovery in consumer spending sentiment. We keep our EPADS view at <money>CNY18.50</money> for 2026 and set 2027 at <money>CNY20.32</money>. In our view, <org value=\"VIPS.NaE\" idsrc=\"xmltag.org\" >Vipshop's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='VIPS' fmr-param-security-type='Equity'>( VIPS )</span> strategy, which emphasizes on sustainable growth and continued shareholder returns are able to offset near-term headwinds, positioning the company well for long-term value creation. Although slow consumer sentiment recovery remains a headwind for <location value=\"LC/cn\" idsrc=\"xmltag.org\" >China's</location> consumer market, we expect stable and modest consumer discretionary spending growth supported by Chinese government stimulus measures. Moreover, with the <chron>Chinese New Year</chron> falling in mid-February, we expect some consumption to be deferred, which will contribute to stronger sales in Q1 2026 on a Y/Y basis.</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/investing-ideas/202602271330MIDNIGHTUSEQUITY_A3575308",
            "pub_date": "2026-02-28 02:30:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US Equity Indexes Slump Amid Hot Inflation Print, Weakness in Tech Trade",
            "description": "\n<p><chron>03:25 PM EST</chron>, <chron>02/27/2026</chron> (MT Newswires) -- US equity indexes fell with government bond yields in the final leg of trading on Friday amid a hot producer price inflation print and as technology wobbled.</p><p>The Nasdaq Composite dropped 1.2% to 22,601.3, the S&amp;P 500 fell 0.8% to 6,855.2, and the Dow Jones Industrial Average declined 1.4% to 48,826.7. Financials and technology led the decliners.</p><p>The US Producer Price Index rose by 0.5% in January following a 0.4% increase in December, according to the <org>Bureau of Labor Statistics</org> on Friday, above the 0.3% gain expected in a <org>Bloomberg</org> survey. After excluding the more volatile food and energy prices, core PPI rose by 0.8%, more than the 0.3% gain anticipated and following a 0.6% jump in the previous month.</p><p>PPI was up 2.9% year-over-year in January after a 3.0% gain in December, while core prices rose by 3.6% following a 3.3% rise.</p><p>&quot;While one data point does not make a trend, and much of the increase was isolated to trade services, any further confirmation of a reacceleration of cost pressures will not only solidify the Fed's position on the sidelines for some time despite outside pressure and furthermore call into question earlier rate cuts, but increasingly raise the notion of whether or not policy has become too accommodative,&quot; a Stifel research note said.</p><p>Most US Treasury yields declined, with the two-year down 6.7 basis points to 3.38%. The 10-year yield dropped 5.3 basis points to 3.96%, heading for the lowest since late 2024.</p><p>In company news, Block (XYZ) shares soared 15%, among the top gainers on the S&amp;P 500, after the financial technology company posted higher Q4 adjusted net income and revenue. It also announced a plan to cut its current workforce by more than 40%.</p><p>&quot;Gross profit continues to grow, we continue to serve more and more customers, and profitability is improving,&quot; Block Co-founder <person>Jack Dorsey</person> wrote in a post. &quot;But something has changed. We're already seeing that the intelligence tools we're creating and using, paired with smaller and flatter teams, are enabling a new way of working which fundamentally changes what it means to build and run a company.&quot;</p><p>Shares of <org value=\"CRWV.NaE\" idsrc=\"xmltag.org\" >CoreWeave</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='CRWV' fmr-param-security-type='Equity'>( CRWV )</span>  sank 21% after the cloud infrastructure company focused on artificial intelligence reported a wider Q4 loss. Earnings missed, with sustained investment in growth ahead of compute coming online, a Macquarie note said while cutting <org value=\"CRWV.NaE\" idsrc=\"xmltag.org\" >CoreWeave's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='CRWV' fmr-param-security-type='Equity'>( CRWV )</span> price target to <money>$90</money> from <money>$115</money>. &quot;Massive investment needed ahead of monetization remains a recurring theme. Execution at this scale could be choppy.&quot;</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/us-markets/202602271525MIDNIGHTUSEQUITY_A3575388",
            "pub_date": "2026-02-28 04:25:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Market Chatter: OpenAI Looks to Secure $10 Billion More From Investors",
            "description": "\n<p><chron>03:24 PM EST</chron>, <chron>02/27/2026</chron> (MT Newswires) -- <org value=\"MSFT.NaE\" idsrc=\"xmltag.org\" >Microsoft</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='MSFT' fmr-param-security-type='Equity'>( MSFT )</span>-backed (MSFT) OpenAI is seeking an additional <money>$10 billion</money> from financial investors by the end of March, a move that would push the company's valuation to <money>$850 billion</money>, The Information reported Friday, citing a person familiar with the situation.</p><p>The funding would add to the <money>$110 billion</money> already secured from investors including SoftBank, <org value=\"AMZN.NaE\" idsrc=\"xmltag.org\" >Amazon.com</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AMZN' fmr-param-security-type='Equity'>( AMZN )</span>  and <org value=\"NVDA.NaE\" idsrc=\"xmltag.org\" >Nvidia</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NVDA' fmr-param-security-type='Equity'>( NVDA )</span> , the report said. The valuation includes a <money>$35 billion</money> tranche of funding from <org value=\"AMZN.NaE\" idsrc=\"xmltag.org\" >Amazon</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AMZN' fmr-param-security-type='Equity'>( AMZN )</span>, according to the report.</p><p>To prevent further dilution of shareholder value, OpenAI's nonprofit entity may sell several billion dollars of its stake to meet investor demand, the person told The Information, adding that chief executive <person>Sam Altman</person> does not hold equity in OpenAI and is not receiving shares as part of the transaction.</p><p>OpenAI didn't immediately reply to a request for comment from MT Newswires.</p><p>(Market Chatter news is derived from conversations with market professionals globally. This information is believed to be from reliable sources but may include rumor and speculation. Accuracy is not guaranteed.)</p><p>Price: 178.95, Change: -5.94, Percent Change: -3.22</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602271524MIDNIGHTUSEQUITY_A3575374",
            "pub_date": "2026-02-28 04:24:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Market Chatter: Tech Unions Oppose Pentagon Push on AI Guardrails",
            "description": "\n<p><chron>03:24 PM EST</chron>, <chron>02/27/2026</chron> (MT Newswires) -- Employees at <org value=\"AMZN.NaE\" idsrc=\"xmltag.org\" >Amazon.com</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AMZN' fmr-param-security-type='Equity'>( AMZN )</span> , <org value=\"GOOG.NaE\" idsrc=\"xmltag.org\" >Google</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='GOOG' fmr-param-security-type='Equity'>( GOOG )</span> , and <org value=\"MSFT.NaE\" idsrc=\"xmltag.org\" >Microsoft</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='MSFT' fmr-param-security-type='Equity'>( MSFT )</span>  are pressing their companies to back Anthropic in its dispute with the <org>US Department of Defense</org> and to reject contracts involving autonomous weapons or mass domestic surveillance, the Financial Times reported Friday.</p><p>In a letter seen by the Financial Times, tech worker groups said they would resist any effort to weaken Anthropic's safety guardrails after Chief Executive <person>Dario Amodei</person> rejected a &quot;final offer&quot; to continue supplying AI models to the US military.</p><p>The dispute escalated after Defense Secretary <person>Pete Hegseth</person> threatened to reassess Anthropic's government contracts, while Pentagon research chief <person>Emil Michael</person> indicated that talks could still proceed.</p><p>According to the report, the standoff could open the door for <org value=\"MSFT.NaE\" idsrc=\"xmltag.org\" >Microsoft</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='MSFT' fmr-param-security-type='Equity'>( MSFT )</span>-backed OpenAI and xAI to expand into classified Pentagon work, with <person>Sam Altman</person> attempting to mediate between Anthropic and defense officials.</p><p><org value=\"AMZN.NaE\" idsrc=\"xmltag.org\" >Amazon.com</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AMZN' fmr-param-security-type='Equity'>( AMZN )</span>, <org value=\"GOOG.NaE\" idsrc=\"xmltag.org\" >Google</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='GOOG' fmr-param-security-type='Equity'>( GOOG )</span> and <org value=\"MSFT.NaE\" idsrc=\"xmltag.org\" >Microsoft</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='MSFT' fmr-param-security-type='Equity'>( MSFT )</span> did not immediately respond to MT Newswires' request for comment.</p><p>(Market Chatter news is derived from conversations with market professionals globally. This information is believed to be from reliable sources but may include rumor and speculation. Accuracy is not guaranteed.)</p><p>Price: 209.58, Change: +1.66, Percent Change: +0.80</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602271524MIDNIGHTUSEQUITY_A3575392",
            "pub_date": "2026-02-28 04:24:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "NJIT to Launch Expanded AI and Cybersecurity Workforce Training in Partnership with Verizon",
            "description": "\n<p><location value=\"LU/us.nj.newark\" idsrc=\"xmltag.org\" >Newark, N.J.</location>, <chron>Feb.  27, 2026</chron>  (GLOBE NEWSWIRE) -- <org>New Jersey Institute of Technology</org> (NJIT) today announced applications are open for an ambitious expansion of their workforce development partnership with Verizon, supported by a grant from the telecom company. Managed by NJIT’s Learning and Development Initiative, this program, expected to launch in early April will provide no-cost, high-impact training in artificial intelligence, cybersecurity and IT to eligible <location value=\"LS/us.nj\" idsrc=\"xmltag.org\" >New Jersey</location> residents in order to bridge the digital skills gap.</p>     <p>Central to this new phase is the launch of a <org>Cybersecurity Community</org> of Practice, a collaborative ecosystem where participants, industry experts and NJIT graduate students engage in peer-to-peer learning and mentorship. This model ensures that students are integrated into a professional network from day one.</p>     <p>“We are excited to partner with NJIT to provide this invaluable digital skills training opportunity,” said <person>Donna Epps</person>, Verizon’s Chief Responsible Business Officer. “As the digital landscape evolves, Verizon is reshaping its commitments to help individuals build their skillset in the workforce’s most sought after digital areas like AI and cyber security to turn career ambitions into reality.”</p>     <p>The program offers a comprehensive curriculum designed for the modern economy:</p>     <p>   </p>  <ul><li><strong>CompTIA Tech + and A+ <org>Certification Prep</org>:</strong> Equipping participants with the foundational technical skills required for essential IT and telecommunications roles.</li><li><strong>NJIT AI Literacy Microcredential</strong><strong>:</strong> Ensuring all participants are fluent in the ethical and practical applications of artificial intelligence - a critical skill set for the future of work.</li><li><strong><org>Cybersecurity Community</org> of Practice:</strong> An opportunity for networking, real-world case studies and ongoing professional development.</li><li><strong>Format:</strong> Most training is offered online and laptops/internet are available for qualifying participants to assist with access. A variety of schedules are available to accommodate those who might have other obligations.</li></ul>  <p>   </p>  <p>“NJIT is New Jersey’s greatest producer of tech talent, and we are honored to collaborate with Verizon on a program that goes beyond traditional technical training,” said NJIT President <person>Teik C. Lim</person>. “By combining CompTIA A+ certification with our new AI Literacy microcredential and a robust Community of Practice, we are providing opportunities that match rapidly evolving technological needs of employers.”</p>  <p>For more information on this program and to review the application process, please visit https://ldi.njit.edu/verizon or email ldisupport@njit.edu.</p>  <p><strong>About Verizon<br/></strong>Verizon Communications Inc. powers and empowers how its millions of customers live, work and play, delivering on their demand for mobility, reliable network connectivity and security. Headquartered in <location value=\"LU/us.ny.nyc\" idsrc=\"xmltag.org\" >New York City</location>, serving countries worldwide and nearly all of the Fortune 500, Verizon generated revenues of <money>$134.8 billion</money> in 2024.</p>  <p><strong>About <org>New Jersey Institute of Technology</org><br/></strong><org>New Jersey Institute of Technology</org> (NJIT) is the greatest producer of technological talent and knowledge in <location value=\"LS/us.nj\" idsrc=\"xmltag.org\" >New Jersey</location> and is a nexus of innovation — a physical and intellectual focal point for innovative ideas, actions and people. <em><org>The Wall Street Journal</org></em> ranks NJIT No. 1 in <location value=\"LS/us.nj\" idsrc=\"xmltag.org\" >New Jersey</location> among public universities for both alumni salaries (No. 25 among all universities nationally) and value (No. 42 overall nationally). NJIT also is ranked No. 27 in the U.S. by The Princeton Review as a Best Value College, in addition to being rated among the top 40 public national universities and top 80 overall by <em><org>U.S. News &amp; World Report</org></em>.</p>  Image: https://www.globenewswire.com/newsroom/ti?nf=OTY2MjcxMSM3NDU4ODU0IzIwOTM5NTc=  <br/> Image: https://ml.globenewswire.com/media/NjY0YjI4ZGYtNmRjZC00OGY2LTg2NzAtMDc0YTM3ZmM4ODg2LTExMDU1MjgtMjAyNi0wMi0yNy1lbg==/tiny/New-Jersey-Institute-of-Techno.png <pre><person>Deric Raymond</person>\n<org>New Jersey Institute of Technology</org>\n973-642-7042\ndraymond@njit.edu\n</pre>\nSource: <org>New Jersey Institute of Technology</org>\n",
            "link": "https://www.fidelity.com/news/article/technology/202602271515PRIMZONEFULLFEED9662711",
            "pub_date": "2026-02-28 04:15:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Kinder Morgan's Backlog Supports Long-Term Growth, RBC Says",
            "description": "\n<p><chron>03:07 PM EST</chron>, <chron>02/27/2026</chron> (MT Newswires) -- <org value=\"KMI.NaE\" idsrc=\"xmltag.org\" >Kinder Morgan</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='KMI' fmr-param-security-type='Equity'>( KMI )</span>  sees stronger long-term cash flow visibility, underpinned by its roughly <money>$10 billion</money> project backlog, primarily focused on natural gas infrastructure supporting power generation and liquefied natural gas demand, <org>RBC Capital Markets</org> said in a note emailed Friday.</p><p>The brokerage noted that about <money>$9.1 billion</money> of the backlog is tied to natural gas projects, with nearly 80% supporting power generation and LNG demand.</p><p>RBC expects the backlog, which has an average in-service date of early 2028 and sub-6x earnings before interest, taxes, depreciation, and amortization build multiples, to drive just over a 4% adjusted EBITDA compound annual growth rate through 2030, according to the note.</p><p>RBC maintained its sector perform rating on the stock and raised its price target to <money>$32</money> from <money>$30</money>.</p><p>Price: 33.10, Change: +0.03, Percent Change: +0.11</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602271507MIDNIGHTUSEQUITY_A3575367",
            "pub_date": "2026-02-28 04:07:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Figma Stock Slides On AI Competition Amid Friday Market Rout",
            "description": "\n<p><strong><org value=\"FIG.NaE\" idsrc=\"xmltag.org\" >Figma Inc</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='FIG' fmr-param-security-type='Equity'>( FIG )</span></strong> shares are trading lower Friday afternoon, extending this week's volatility as investors rotated out of richly valued tech and financial names during a broad market selloff. </p>\n\n\n\n<p>The stock is among the <strong>Russell 1000's</strong> worst performers Friday, as risk assets recoiled on hotter-than-expected producer price data and mounting worries over AI-driven disruption in finance and software.</p>\n\n\n\n<p>Here&#8217;s what investors need to know.</p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><org value=\"FIG.NaE\" idsrc=\"xmltag.org\" >Figma</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='FIG' fmr-param-security-type='Equity'>( FIG )</span> stock is among today&#8217;s weakest performers. What&#8217;s pressuring FIG stock?</li>\n</ul>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Google Gemini Undercuts Figma Design Moat</strong></h2>\n\n\n\n<p>Selling pressure follows Thursday's move lower after <strong>Alphabet's</strong> <strong><org value=\"GOOG.NaE\" idsrc=\"xmltag.org\" >Google</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='GOOG' fmr-param-security-type='Equity'>( GOOG )</span></strong> introduced <person>Nano Banana</person> 2, a new <strong>Gemini</strong> image-generation model that delivers &quot;Pro-grade&quot; visuals at no cost inside the Gemini app. </p>\n\n\n\n<p>The free tool competes with paid creative suites and could shift some AI-driven design workflows away from <org value=\"FIG.NaE\" idsrc=\"xmltag.org\" >Figma's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='FIG' fmr-param-security-type='Equity'>( FIG )</span> browser-based collaboration platform, stoking fears over monetization and pricing power.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Earnings Beat Highlight Figma's Expanding AI</strong></h2>\n\n\n\n<p>The pullback comes despite solid fundamentals. Earlier this month, <org value=\"FIG.NaE\" idsrc=\"xmltag.org\" >Figma</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='FIG' fmr-param-security-type='Equity'>( FIG )</span> reported quarterly revenue of <money>$303.78 million</money>, topping <location>Wall Street</location> estimates and growing from <money>$216.95 million</money> a year ago, while earnings of <money>eight cents</money> per share edged past expectations. </p>\n\n\n\n<p>Management spotlighted new AI integrations, including &quot;Code to Canvas,&quot; developed with <strong>Anthropic</strong>, which converts AI-generated code into editable design layouts and aims to position <org value=\"FIG.NaE\" idsrc=\"xmltag.org\" >Figma</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='FIG' fmr-param-security-type='Equity'>( FIG )</span> as a bridge between rapid coding tools and human-centered design.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Broader Tech Pullback Adds Selling Pressure</strong></h2>\n\n\n\n<p>Analysts remain divided after the rally that preceded this week's drop, trimming price targets but largely keeping Neutral to Overweight ratings. </p>\n\n\n\n<p>For now, <org value=\"FIG.NaE\" idsrc=\"xmltag.org\" >Figma's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='FIG' fmr-param-security-type='Equity'>( FIG )</span> strong growth and AI roadmap are being overshadowed by competitive concerns around <org value=\"GOOG.NaE\" idsrc=\"xmltag.org\" >Google's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='GOOG' fmr-param-security-type='Equity'>( GOOG )</span> free Gemini offering and a wider risk-off mood that has hammered high-beta names across the market.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Moving Averages Signal Continued Downtrend</h2>\n\n\n\n<p><org value=\"FIG.NaE\" idsrc=\"xmltag.org\" >Figma</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='FIG' fmr-param-security-type='Equity'>( FIG )</span> hit a 52-week high near <money>$122</money> in late summer 2025 and has been in a steady downtrend since, with the stock making a series of lower highs and lows.</p>\n\n\n\n<p>Since that peak, the stock has made lower highs and lows, and the 20-, 50- and 200-day moving averages have rolled over and flattened as FIG trades close to its 52-week low near <money>$19.59</money>. </p>\n\n\n\n&lt;figure class=&quot;wp-block-image size-large&quot;&gt;<img loading=\"lazy\" decoding=\"async\" width=\"1024\" height=\"829\" src=\"https://editorial-assets.benzinga.com/wp-content/uploads/2026/02/27144327/FIG-price-moving-averages-chart-1024x829.png\" alt=\"\" class=\"wp-image-1331979\" srcset=\"https://editorial-assets.benzinga.com/wp-content/uploads/2026/02/27144327/FIG-price-moving-averages-chart-1024x829.png 1024w,https://editorial-assets.benzinga.com/wp-content/uploads/2026/02/27144327/FIG-price-moving-averages-chart-300x243.png 300w,https://editorial-assets.benzinga.com/wp-content/uploads/2026/02/27144327/FIG-price-moving-averages-chart-768x622.png 768w,https://editorial-assets.benzinga.com/wp-content/uploads/2026/02/27144327/FIG-price-moving-averages-chart.png 1314w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" />&lt;/figure&gt;\n\n\n\n<h2 class=\"wp-block-heading\">Analysts Maintain Buy Rating Consensus</h2>\n\n\n\n<p><strong>Analyst Consensus &amp; Recent Actions:</strong>&#160;The stock carries a Buy Rating with an&#160;average price target&#160;of <money>$33.40</money>. Recent analyst moves include:</p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong><org>RBC Capital</org></strong>: Sector Perform (Lowers Target to <money>$31.00</money>) (<chron>Feb. 19</chron>)</li>\n\n\n\n<li><strong>Stifel</strong>: Hold (Lowers Target to <money>$30.00</money>) (<chron>Feb. 19</chron>)</li>\n\n\n\n<li><strong>Wells Fargo</strong>: Overweight (Lowers Target to <money>$42.00</money>) (<chron>Feb. 19</chron>)</li>\n</ul>\n\n\n\n<h2 class=\"wp-block-heading\">Figma Shares Drop Friday</h2>\n\n\n\n<p><strong>FIG Price Action:</strong> <org value=\"FIG.NaE\" idsrc=\"xmltag.org\" >Figma</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='FIG' fmr-param-security-type='Equity'>( FIG )</span> shares were down 3.08% at <money>$29.29</money> at the time of publication on Friday, according to Benzinga Pro data.</p>\n\n\n\n<p><em>Image: Shutterstock</em></p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602271512BENZINGAFULLNGTH50943939",
            "pub_date": "2026-02-28 04:12:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        }
    ]
}