{
    "data": [
        {
            "title": "CIQ Launches RLC Pro, Redefining the Enterprise Linux Standard for the Next Generation of Infrastructure",
            "description": "\n<div class=\"xn-content\">\n<p><b>Commercially supported offering unifies open source availability and enterprise capabilities in one solution, eliminating infrastructure fragmentation and delivering long term support, FIPS and direct bug fixes as standard features.</b></p><p><span class=\"legendSpanClass\"><location value=\"LU/us.nv.reno\" idsrc=\"xmltag.org\" >RENO, Nev.</location></span>, <span class=\"legendSpanClass\"><chron>Feb. 26, 2026</chron></span> /PRNewswire/ -- CIQ, the founding support and services partner of Rocky Linux, today launched Rocky Linux from CIQ Pro (RLC Pro), a commercially supported Enterprise Linux subscription that transforms how organizations consume production-grade infrastructure and provides a strong foundation for next-generation software infrastructure, including AI, HPC and security hardened options. With Enterprise Linux binary compatibility, RLC Pro bundles long term support and lifecycle management, FIPS 140-3 validation, indemnification, security and support SLAs and customer-driven, direct bug fixes as necessary features, creating a clear path from community-based to mission-critical enterprise production.</p>\n    <div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder1\">\n                <p>\n\n                    <img src=\"https://mma.prnewswire.com/media/2832135/CIQ_Logo.jpg\" title=\"Powering the next generation of software infrastructure (PRNewsfoto/CIQ)\" alt=\"Powering the next generation of software infrastructure (PRNewsfoto/CIQ)\" />\n\n                </p>\n    </div>\n<p>RLC Pro represents a fundamental shift in what can be expected from enterprise operating systems and redefines the Enterprise Linux standard. CIQ believes that long term support, FIPS validation and direct bug fixes should be bundled as base features, not sold as expensive add-ons. For the first time, organizations get the commercial accountability and vendor support production infrastructure demands, bundled into one solution as the base offering from CIQ.</p><p>This addresses a long-standing market gap. Today, enterprises choosing open source solutions accept operational risk, spending engineering resources hunting through GitHub for stability solutions and managing security vulnerabilities without vendor backing. Those who choose commercial solutions often pay additional subscription fees to unlock the features they need on top of base licensing costs. This is orders of magnitude more difficult and risky when maintaining the operating system. RLC Pro eliminates the difficulty and risk by making these capabilities standard, delivering the support enterprises need, leaning on CIQ for faster bug fixes, vulnerability patches and escalated support as part of the base offering.</p><p>RLC Pro transforms what enterprises can accomplish by providing:</p><ul type=\"disc\"><li><b>Bundled long term support</b> enables platform teams to plan infrastructure on 3-5 year horizons without forced point-release upgrades. They can deploy once, maintain stability and focus engineering resources on business differentiation rather than operating system maintenance.</li><li><b>FIPS 140-3 validated packages</b> enable enterprises to deploy at scale in government, defense, financial services and healthcare by passing compliance audits without resource-intensive internal certification efforts.</li><li><b>Direct bug and security fixes</b> from CIQ's engineering team keep production systems running and SLAs met based on specific customer feedback. Engineers stop firefighting infrastructure issues and start shipping features faster.</li><li><b>Enterprise License Agreements</b> (ELAs) to cover your entire infrastructure: from core, to cloud and edge, RLC Pro has your back.</li></ul><p>Rocky Linux is one of the most widely deployed enterprise Linux distributions worldwide, with Extra Packages for Enterprise Linux (EPEL) telemetry showing more than 2.75 million actively deployed instances globally. As adoption has accelerated, so has enterprise demand for commercially backed support, long-term lifecycle guarantees and validated compliance capabilities. RLC Pro directly addresses that market need.</p><p>\"AI is driving a true inflection point for enterprise infrastructure,\" said <person>Gregory Kurtzer</person>, CEO of CIQ and Cofounder of Rocky Linux. \"RLC Pro brings together the infrastructure capabilities organizations need into a use-everywhere model that prioritizes efficiency, security and usability. We believe long term support, FIPS validation and direct, responsive engineering should be standard. When you hit a bug, we fix it. When you need a security remediation, we deliver it. And when you need a partner to ensure your infrastructure is running at its best, CIQ is there with you.\"</p><p>\"The real transformation here is what this enables enterprises to do,\" said <person>Bjorn Hovland</person>, President of CIQ. \"Deploy in regulated environments immediately. Plan infrastructure investments with confidence. Free engineering talent to build products instead of managing operating systems. RLC Pro doesn't just change how organizations consume Linux, it changes what they can accomplish with it.\"</p><p>RLC Pro is available today from CIQ and through <location>AWS Marketplace</location>, <location>Microsoft Azure Marketplace</location> and <location>Google Cloud Marketplace</location>. It will soon be available through the CIQ Portal, launching in the coming months.</p><p>To learn more about RLC Pro and CIQ's complete Enterprise Linux portfolio, read the CIQ blog post. Also, join <person>Brady Dibble</person>, Director of Product Management, for the upcoming webinar \"RLC Pro: Redefining what Enterprise Linux should be,\" on <chron>Thursday, March 12, 2026</chron> at <chron>11am PT</chron> / <chron>2pm ET</chron>.</p><p><b>About CIQ</b></p><p>CIQ is the founding support and services partner of Rocky Linux and the leader in enterprise Linux architecture for sovereign AI inferencing at scale. CIQ delivers a complete software infrastructure stack, from the operating system to orchestration, enabling enterprises, government agencies, research institutions and supercomputing centers worldwide to deploy AI and high-performance computing workloads with strategic independence and control. CIQ's product portfolio includes the Rocky Linux from CIQ Pro (RLC Pro) family of enterprise operating systems, Ascender Pro for IT automation, Fuzzball for cloud HPC orchestration, Warewulf Pro for cluster provisioning, and Apptainer, the leading container system for high-performance computing. Together, these products provide the secure, performant infrastructure foundation that modern AI deployments demand. For more information, visit ciq.com.</p><p><b>MEDIA CONTACT:<br /></b><person>Cristin Connelly</person><br />Cathey.co for CIQ<br />cristin@cathey.co</p>\n\n\n\n<p id=\"PURL\"><img title=\"Cision\" width=\"12\" height=\"12\" alt=\"Cision\" src=\"https://edge.prnewswire.com/c/img/favicon.png?sn=NY96221&amp;sd=2026-02-26\" /> View original content to download multimedia:https://www.prnewswire.com/news-releases/ciq-launches-rlc-pro-redefining-the-enterprise-linux-standard-for-the-next-generation-of-infrastructure-302697766.html</p><p>SOURCE CIQ</p></div>\n",
            "link": "https://www.fidelity.com/news/article/technology/202602261205PR_NEWS_USPR_____NY96221",
            "pub_date": "2026-02-27 01:05:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Research Alert: CFRA Keeps Hold Opinion On Ads Of Wpp",
            "description": "\n<p><chron>12:10 PM EST</chron>, <chron>02/26/2026</chron> (MT Newswires) -- CFRA, an independent research provider, has provided MT Newswires with the following research alert. Analysts at CFRA have summarized their opinion as follows:</p><p>We maintain our 3-STARS (Hold) rating but lower our 12-month target price to <money>USD20</money> (<money>USD23</money>), based on 2026 P/E of 6.2x. The multiple reflects a 1.5x discount to the 10-year historical mean, incorporating weaker near-term revenue visibility and structural AI-related pricing risk. We apply a modest premium to the parent multiple to reflect structural valuation differences in the ADS listing, including broader U.S. investor access and trading volumes. We raise our 2026 revenue forecast by 5.6% to <money>GBP13.7B</money> (<money>GBP13B</money>), aligned with updated management guidance for weaker first-half trends followed by improvement in the second half of 2026. We forecast 2027 revenue of <money>GBP13.9B</money>, up 1.5% Y/Y, assuming gradual stabilization in advertising demand and improved new business momentum. We also forecast 2026 EPS of <money>GBP0.64</money>  and 2027 EPS of <money>GBP0.65</money>, reflecting modest margin assumptions. We remain cautious on AI-driven competitive intensity, which could pressure pricing power and reduce long-term margins.</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/investing-ideas/202602261210MIDNIGHTUSEQUITY_A3573906",
            "pub_date": "2026-02-27 01:10:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "European Stocks Mixed in Thursday Trading; Economic Expectations Lower in EU, Euro Area",
            "description": "\n<p><chron>12:10 PM EST</chron>, <chron>02/26/2026</chron> (MT Newswires) -- The European stock markets were set to close mixed in Thursday trading as The Stoxx Europe was unchanged, <location value=\"LC/de\" idsrc=\"xmltag.org\" >Germany's</location> DAX rose 0.4%, the FTSE 100 was up 0.4%, <location value=\"LC/fr\" idsrc=\"xmltag.org\" >France's</location> CAC gained 0.7%, and the Swiss Market Index was down 0.5%.</p><p>The Economic Sentiment Indicator for February decreased in both the EU and the euro area, falling 1 point to 98.3 for each, according to the <org>European Commission</org>. The Employment Expectations Indicator also declined compared to January, with the EU 0.7 points lower to 98.5, and the euro area down 0.6 points to 97.6. Both indicators continue to remain below their long-term averages of 100.</p><p>And in corporate news, Stellantis reported early Thursday it swung to an H2 adjusted loss of <money>0.60 euros</money> (<money>$0.71</money>) per diluted share from an adjusted profit of <money>0.08 euros</money> a year earlier.</p><p>Net revenue for the half-year ended <chron>Dec. 31</chron> was <money>79.25 billion euros</money>, up from <money>71.86 billion euros</money> a year ago.</p><p>Shares of Stellantis rose 4.2% in <location value=\"LU/fr..paris\" idsrc=\"xmltag.org\" >Paris</location>.</p><p>For 2026, the automaker said it continues to expect revenue to rise by a mid-single digit and to see sequential improvements from H1 to H2.</p><p>BNP Paribas and Apollo Global Management are close to entering a partnership to arrange loans for corporate and private equity clients in <location value=\"LR/eur\" idsrc=\"xmltag.org\" >Europe</location>, <org>Bloomberg</org> reported Thursday, citing people with knowledge of the matter. Apollo and BNP did not immediately respond to a request to comment from MTNewswires.</p><p>Shares of BNP Paribas were down 0.1% in <location value=\"LU/fr..paris\" idsrc=\"xmltag.org\" >Paris</location>.</p><p>GSK said Thursday that <location value=\"LC/cn\" idsrc=\"xmltag.org\" >China's</location> drug regulator has accepted for priority review its new drug application for its experimental treatment, linerixibat, for patients with primary biliary cholangitis, a rare autoimmune liver disease.</p><p>The filing is supported by results from a phase 3 trial that met its primary and key secondary endpoints, showing meaningful and sustained improvement in itching and sleep disturbance compared with placebo, the company said.</p><p>Separately, GSK said <location value=\"LC/jp\" idsrc=\"xmltag.org\" >Japan</location> also accepted for review its new drug application for experimental chronic hepatitis B treatment, bepirovirsen, in adults.</p><p>Shares of GSK were down 2.1% in <location value=\"LU/gb.eng.london\" idsrc=\"xmltag.org\" >London</location>.</p><p>Nokia said Thursday it won an exclusive agreement to deploy network connectivity systems for 17 of Telefonica's new edge data centers in <location value=\"LC/es\" idsrc=\"xmltag.org\" >Spain</location>.</p><p>The company will supply data center switches and service routers to connect localized computing systems and link the nodes to external networks, the company said.</p><p>Shares of Nokia dropped 3% in <location value=\"LU/fi..helsin\" idsrc=\"xmltag.org\" >Helsinki</location>, while Telefonica shares were down 1% in <location value=\"LU/es..madrid\" idsrc=\"xmltag.org\" >Madrid</location>.</p><p>Eni reported Q4 earnings Thursday of <money>0.01 euro</money> (<money>$0.01</money>) per diluted share, down from <money>0.06 euro</money> a year earlier.</p><p>Sales from operations for the quarter ended <chron>Dec. 31</chron> were <money>20.62 billion euros</money>, down from <money>23.49 billion euros</money> a year earlier. Four analysts surveyed by FactSet expected <money>18.63 billion euros</money>.</p><p>Shares of the Italian oil and gas company gained 2.5% in <location value=\"LU/it.lo.milan\" idsrc=\"xmltag.org\" >Milan</location>.</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/international/202602261210MIDNIGHTUSEQUITY_A3573874",
            "pub_date": "2026-02-27 01:10:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "UK's FTSE 100 finishes at record high on Rolls-Royce, LSEG boost",
            "description": "\n<p>*</p>\n<p>FTSE 100 up 0.4%, FTSE 250 up 0.4%</p>\n<p></p>\n<p>*</p>\n<p>Rolls-Royce rises on strong earnings and raised targets</p>\n<p></p>\n<p>*</p>\n<p>Starmer faces close fight in <location value=\"LU/gb.eng.manchr\" idsrc=\"xmltag.org\" >Manchester</location> versus Reform,\nGreens</p>\n<p>(Updates to market close)</p>\n<p>By Tharuniyaa  Lakshmi</p>\n<p><chron>Feb 26</chron> (Reuters) - <location value=\"LC/gb\" idsrc=\"xmltag.org\" >Britain's</location> FTSE 100 hit a record high\non Thursday, supported by a rally in shares in Rolls-Royce after\nits forecast upgrade and in LSEG after its share buyback.</p>\n<p>Rolls-Royce rose 9.1% after reporting a 40% jump in\nannual profit, driven by strong demand for its aero-engines and\nrising power needs from data centres. British aerospace and\ndefence stocks rose to an all-time high following\nthe results.</p>\n<p>The blue-chip FTSE 100 index closed 0.4% higher at\n10,846.70 points, while the domestically focused mid-cap FTSE\n250 was also up 0.4%.</p>\n<p>The FTSE 100 has climbed 6% so far in February, on pace for\nits eighth straight monthly rise and outperforming its U.S. and\nEuropean peers, buoyed by investor bets on an additional <org>Bank of\nEngland</org> rate cut in March.</p>\n<p>&quot;It is likely that the UK index's outperformance is here to\nstay,&quot; <person>Axel Rudolph</person>, senior financial analyst at IG, said.</p>\n<p>Despite the UK blue-chip index's near 22% surge in 2025,\nmany of its companies remain on single-digit price-to-earnings\nratios, making them appealing to investors looking to cut\nexposure to highly valued U.S. tech, Rudolph added.</p>\n<p><org value=\"LDNXF.NaE\" idsrc=\"xmltag.org\" >London Stock Exchange Group</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='LDNXF' fmr-param-security-type='Equity'>( LDNXF )</span> jumped 6.7% after\nannouncing a share buyback plan at a time the company faces\npressure from activist investor Elliott Management and concerns\nthat AI will squeeze its business model.</p>\n<p>Information group <org value=\"RELX.NaE\" idsrc=\"xmltag.org\" >RELX</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='RELX' fmr-param-security-type='Equity'>( RELX )</span> gained 4.6% amid a broad\nrecovery in global software and data stocks which had been\nhammered earlier this month on AI disruption fears.</p>\n<p>AI bellwether <org value=\"NVDA.NaE\" idsrc=\"xmltag.org\" >Nvidia</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NVDA' fmr-param-security-type='Equity'>( NVDA )</span>, however, fell 5% as its\nupbeat results failed to lift sentiment for investors\nincreasingly concerned about the returns from massive spending\non AI.</p>\n<p>Investors also sifted through a slate of domestic corporate\nupdates.</p>\n<p><org value=\"HKMPF.NaE\" idsrc=\"xmltag.org\" >Hikma Pharmaceuticals</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='HKMPF' fmr-param-security-type='Equity'>( HKMPF )</span> slumped 15.8% to a\nmore-than-three-year low after the drugmaker forecast slower\nannual revenue growth.</p>\n<p>On the political front, Prime Minister <person>Keir Starmer</person> faces a\nbig test on Thursday when voters in <location value=\"LU/gb.eng.manchr\" idsrc=\"xmltag.org\" >Manchester</location> cast their\nballots for a new lawmaker in an election that polls say is too\nclose to call between the British leader's <org>Labour Party</org>,\npopulist Reform UK and the left-leaning Greens.\n(Reporting by Tharuniyaa Lakshmi in Bengaluru; Editing by <person>Leroy\nLeo</person> and <person>Andrew Heavens</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/international/202602261211RTRSNEWSCOMBINED_L6N3ZM113_1",
            "pub_date": "2026-02-27 01:11:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Penumbra Seen as 'Strategic and Financial Fit' for Boston Scientific, RBC Says",
            "description": "\n<p><chron>12:11 PM EST</chron>, <chron>02/26/2026</chron> (MT Newswires) -- Penumbra (PEN) is a strong &quot;strategic and financial&quot; fit for <org value=\"BSX.NaE\" idsrc=\"xmltag.org\" >Boston Scientific</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='BSX' fmr-param-security-type='Equity'>( BSX )</span>  and the pending merger is expected to support <org value=\"BSX.NaE\" idsrc=\"xmltag.org\" >Boston Scientific's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='BSX' fmr-param-security-type='Equity'>( BSX )</span> growth profile, <org>RBC Capital Markets</org> said.</p><p>The company's Q4 beat was driven by notable outperformance in embolization and access segments. Total revenue came in at about <money>$385 million</money>, up roughly 21% year on year. Adjusted EPS came in at <money>$1.18</money>, beating the consensus of <money>$1.11</money>, the brokerage said in a Wednesday note.</p><p>The investment firm expects 2026 adjusted EPS of <money>$5.19</money> and revenue of <money>$1.61 billion</money>.</p><p>RBC noted that Penumbra has a large addressable patient population for intervention and immersive health and it will continue to be a leader in the neurovascular segment.</p><p>The brokerage has a sector perform rating on the stock, with a <money>$374</money> price target.</p><p>Price: 339.99, Change: +1.32, Percent Change: +0.39</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602261211MIDNIGHTUSEQUITY_A3573850",
            "pub_date": "2026-02-27 01:11:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Snowflake Seen as 'AI Winner' as Companies Move More Data to AI Workflows, Wedbush Says",
            "description": "\n<p><chron>12:12 PM EST</chron>, <chron>02/26/2026</chron> (MT Newswires) -- Snowflake (SNOW) is seen as an &quot;AI winner&quot; as companies move more private and sensitive data into artificial intelligence workflows, which raises the need for data systems and can lift its core data warehouse usage, Wedbush said in a note Thursday.</p><p>Progress at Anthropic is being read the wrong way by the market, because better AI models can increase demand for data platforms that connect those models to governed company data, the investment firm said.</p><p>Snowflake's Q4 results backed that view, with total revenue of <money>$1.28 billion</money> and product revenue of <money>$1.23 billion</money>, up 30% from a year earlier, both above guidance and Street estimates, Wedbush said.</p><p>Backlog grew fast, with remaining performance obligations of <money>$9.772 billion</money>, up 42% from a year earlier, including a roughly <money>$400 million</money> deal and seven nine figure deals, Wedbush analysts noted.</p><p>Wedbush kept an outperform rating with a <money>$270</money> price target for Snowflake, citing better-than-expected fiscal 2027 outlook and about 27% higher product revenue forecast, helped by the Observe acquisition.</p><p>Price: 173.05, Change: +3.84, Percent Change: +2.27</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602261212MIDNIGHTUSEQUITY_A3573863",
            "pub_date": "2026-02-27 01:12:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Fed's Miran: Four quarter-point cuts still warranted this year, no \"all clear\" for job market",
            "description": "\n<p><location value=\"LU/us.dc.wash\" idsrc=\"xmltag.org\" >WASHINGTON</location>, <chron>Feb 26</chron> (Reuters) - Federal Reserve Governor <person>Stephen Miran</person> said strong job growth in January was &quot;a really good thing,&quot; but that the Fed should still cut a full percentage point from its policy rate this year because there were still risks to the labor market while inflation was no longer a problem.</p>\n<p>&quot;I think it's way too early to sort of sound an all clear that the labor market doesn't need more support from the Federal Reserve. I definitely think the labor market can be supported by the Federal Reserve further,&quot; with four cuts this year, Miran said on Fox Business's &quot;Mornings with Maria&quot;.</p>\n<p>&quot;I really do not think that we have an inflation problem,&quot; with recent inflation readings a percentage point above the Fed's target likely to slow.</p>\n<p></p>\n<p>(Reporting by <person>Howard Schneider</person>; Editing by <person>Chizu Nomiyama</person> )</p>\n",
            "link": "https://www.fidelity.com/news/article/us-economy/202602261004RTRSNEWSCOMBINED_KBN3PG1R3-OUSBS_1",
            "pub_date": "2026-02-26 23:04:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Corel Corporation Announces Strategic Transaction to Create Two Independent Companies",
            "description": "\n<p align=\"center\"><em><org>Vector Capital</org> to Acquire Corel’s Suite of Trusted Software Brands for Creativity and Productivity</em></p>  <p align=\"center\"><em>KKR to Retain Ownership of Parallels Business</em></p>  <p align=\"justify\"><location value=\"LU/ca.on.ottawa\" idsrc=\"xmltag.org\" >OTTAWA, Ontario</location>, <chron>Feb.  26, 2026</chron>  (GLOBE NEWSWIRE) -- <org>Corel Corporation</org> (“Corel”) today announced a definitive agreement that will separate its business into two independent companies. Under the terms of the definitive agreement, <org>Vector Capital Management, L.P.</org> (“Vector”), a leading private equity firm specializing in technology investments, will acquire Corel’s portfolio of creativity and productivity software and related brands. Parallels will remain under ownership of funds managed by KKR, a leading global investment firm. Financial terms of the transaction were not disclosed.</p>  <p align=\"justify\">Corel provides professional software for graphics, productivity, and digital workflow management, with a broad portfolio of desktop and digital tools, including trusted brands CorelDRAW, MindManager, and WinZip. The Parallels business offers cross-platform and virtualization software, including the well-known Parallels Desktop, enabling businesses and individuals to run Windows applications on Mac computers, and Parallels Workspace Solutions, delivering secure virtual applications and desktops across hybrid and cloud environments.</p>  <p align=\"justify\">By creating two independent organizations with dedicated teams and strategic focuses, Corel and Parallels will be best positioned to serve their respective customers and markets.</p>  <p align=\"justify\">Upon completion of the transaction, <person>Christa Quarles</person>, Chief Executive Officer of <org>Corel Corporation</org>, will continue to serve as Chief Executive Officer of Parallels and Prasannaa Ganesan, former Chief Operating Officer of Corel, will become Chief Executive Officer of Corel.</p>  <p align=\"justify\">“We are building on a strong year of growth at Parallels, with Parallels Workspace solutions delivering 49% net new annual recurring revenue growth in 2025, and Parallels Desktop now serving more than one million customers worldwide. Becoming an independent company will allow Parallels to sharpen our focus while continuing to deliver even greater value to our customers,” said <person>Christa Quarles</person>, Chief Executive Officer of Parallels. “I’m excited to work with our team to execute our strategy in this next phase.”</p>  <p align=\"justify\">“Corel has a strong portfolio of trusted and reliable software brands that enable its millions of users to create, ideate, and collaborate. We are excited to reunite with the Corel team and look forward to leveraging our deep familiarity with Corel’s business to drive growth through strategic M&amp;A, product innovation, and operational enhancement,” said <person>Alex Slusky</person>, Founding Partner of <org>Vector Capital</org>, which previously owned Corel and oversaw a significant period of operational development and strategic growth. “We are pleased to welcome Prasannaa back to the helm and are eager to work with him and Corel leadership to focus on disciplined execution, and long-term value creation opportunities.”</p>  <p align=\"justify\">“Corel has delighted and served its customers for decades, providing them with a differentiated portfolio of well-known and trusted software products that simply get the job done,” added Ganesan. “I am excited to return to Corel and to partner with Vector as we focus on supporting the company, building on its established foundation, and delivering reliable, high-quality professional software products to our global customer base.”</p>  <p align=\"justify\">The transaction is expected to close in <chron>May 2026</chron>, subject to customary closing conditions, including regulatory approvals.</p>  <p align=\"justify\"><org>Moelis &amp; Company LLC</org> served as lead financial advisor to Corel and <org>Kirkland &amp; Ellis LLP</org> as legal counsel in connection with the transaction. <org>Paul Hastings LLP</org> served as legal counsel to <org>Vector Capital</org>, with Alvarez &amp; Marsal serving as financial advisor.</p>  <p align=\"justify\"><strong>About Corel</strong><br/>Corel products enable knowledge workers around the world to do great work faster. Offering some of the industry's best-known software brands, we give individuals and teams the power to create, collaborate, and deliver impressive results. Our success is driven by an unwavering commitment to deliver a broad portfolio of innovative applications – including CorelDRAW, MindManager, and WinZip – to inspire users and help them achieve their goals. To learn more about Corel, please visit www.corel.com.</p>  <p><strong>About Parallels</strong></p>  <p align=\"justify\">Parallels is a global leader in cross-platform and virtualization solutions that make it simple for businesses and individuals to securely access applications and data on any device, anywhere.<br/><br/>Parallels operates two core businesses. Parallels Desktop enables individuals and organizations to run Windows applications on Mac computers, providing a seamless, native-like experience without changing devices or disrupting workflows. Parallels Workspace Solutions deliver simple, flexible, and secure virtual applications and desktops through Parallels RAS, Parallels DaaS, and Parallels Browser Isolation, offering a modern, cost-effective alternative to traditional VDI across hybrid and cloud environments.</p>  <p align=\"justify\">Together, Parallels helps customers reduce complexity, streamline IT operations, improve security, and deliver a seamless user experience across Windows, macOS, Linux, ChromeOS, iOS, Android, and the cloud and emerging application models. To learn more, visit www.parallels.com.</p>  <p align=\"justify\"><strong>About <org>Vector Capital</org></strong><br/><org>Vector Capital</org> is a leading, <location value=\"LU/us.ca.sanfrn\" idsrc=\"xmltag.org\" >San Francisco</location>-based investment firm focused on transformational investments in middle-market technology and technology-enabled businesses. Founded in 1997, Vector manages over <money>$4 billion</money> of capital across credit and private equity strategies on behalf of a high-quality group of global limited partners. For over 29 years, Vector has combined technology investments with operational transformation to deliver breakthrough results. For more information, visit www.vectorcapital.com.</p>  <p align=\"justify\"><strong>Media Contact</strong></p>  <p align=\"justify\">For Corel:<br/><person>Beatrice Vogel</person>, Director of Corporate Communications, beatrice.vogel@corel.com</p>  <p align=\"justify\">For <org>Vector Capital</org>:<br/><person>Nathaniel Garnick</person> / <person>Grace Cartwright</person><br/><org>Gasthalter &amp; Co.</org> <br/>(212) 257-4170<br/>vector@gasthalter.com</p>  <p align=\"justify\"><em>© 2026 <org>Corel Corporation</org>. All rights reserved. Corel, CorelDRAW, MindManager and WinZip are trademarks or registered trademarks of <org>Corel Corporation</org>. Parallels is a registered trademark of <org>Parallels International GmbH</org>. All other company, product and service names, logos, brands and any registered or unregistered trademarks mentioned are used for identification purposes only and remain the exclusive property of their respective owners. For all notices and legal information please visit </em><em>www.corel.com/en/legal-information/</em><em> and </em><em>www.parallels.com/about/legal/</em></p>  Image: https://www.globenewswire.com/newsroom/ti?nf=OTY2MjEzMSM3NDU2Nzc1IzIwOTI0ODk=  <br/> Image: https://ml.globenewswire.com/media/YTAxNmIzZjMtZDIyZi00NDE4LWI1YmYtMmU0ZTdhYjU0YmE5LTExMDQwNjAtMjAyNi0wMi0yNi1lbg==/tiny/Corel-Corporation.png <p> Image: Primary Logo </p>\nSource: <org>Corel Corporation</org>\n",
            "link": "https://www.fidelity.com/news/article/mergers-and-acquisitions/202602261200PRIMZONEFULLFEED9662131",
            "pub_date": "2026-02-27 01:00:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CricutÂ® Introduces the Next Generation of Creativity â Cricut Joyâ¢ 2 and Cricut ExploreÂ® 5",
            "description": "\n<p> Image: Explore 5 &amp; Joy 2 </p>  <p align=\"center\">A Media Snippet accompanying this announcement is available by clicking on this link.</p>  <p><location value=\"LU/us.ut.soudan\" idsrc=\"xmltag.org\" >SOUTH JORDAN, Utah</location>, <chron>Feb.  26, 2026</chron>  (GLOBE NEWSWIRE) -- Cricut®, Inc. is making personalization easier than ever with the introduction of two next-generation cutting machines: Cricut Joy™ 2 and Cricut Explore® 5. These machines represent the start of a new era for <org value=\"CRCT.NaE\" idsrc=\"xmltag.org\" >Cricut</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='CRCT' fmr-param-security-type='Equity'>( CRCT )</span> users, including a smaller, modern machine design, a dramatically simplified, guided software experience, and all the tools and materials needed to get started right in the box.</p>  <p><strong>Introducing Cricut Joy 2: Big Creativity, Small Footprint</strong><br/>Cricut Joy 2 is the next iteration of Cricut’s most compact cutting machine – it’s perfect for fast, fun, everyday projects like custom cards, labels, simple decals, and now, for the first time, full-color stickers thanks to its all-new Print Then Cut sensor.</p>  <p>Fitting in the palms of your hands, Cricut Joy 2 offers portability without compromise, enabling creativity in any space in your home. New bundles make it easy for crafters at every level to start making right away. Each bundle includes a cutting machine, popular materials, and essential tools, eliminating the guesswork of additional purchases and giving users everything needed to start — and keep — creating. With built-in savings, a simplified shopping experience, and the supplies to make up to 150 projects right out of the box*, it’s the best way to kickstart the creative journey with confidence and value.</p>  <p>Cricut Joy 2 will be offered in Blue, Coral, and an exclusive <person>Jade Green</person> color, available only at Michaels.</p>  <p><strong>Introducing Cricut Explore 5: More Compact and Made for Bigger Ideas</strong><br/>Cricut Explore 5 is the newest evolution of Cricut’s most popular cutting machine, redesigned to be <strong>30% more compact</strong> than the previous generation so it fits more naturally into modern homes — without sacrificing performance or capability.</p>  <p>Ideal for vinyl decals, custom apparel, full-color stickers, cards, and specialty projects like magnets and rubber stamps, Cricut Explore 5 is compatible with six tools* and features an improved writing and drawing experience with snap-in pen loading and a streamlined interface. Also available in new bundle options, crafters can choose the one that best fits their needs and be confident they'll have the supplies to hit the ground cutting.</p>  <p>Cricut Explore 5 will come in Taupe, and an exclusive Teal color available only at Michaels.</p>  <p>“<em>Our users have consistently told us they want products that are easier to use and more affordable. We listened and simplified the entire experience end-to-end,” </em>said <person>Ashish Arora</person>, CEO at <org value=\"CRCT.NaE\" idsrc=\"xmltag.org\" >Cricut</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='CRCT' fmr-param-security-type='Equity'>( CRCT )</span>.<em> “From the moment they open the box, everything required to be successful is included. We guide them through a reimagined onboarding and design experience with intuitive, guided flows that take the guesswork out of making and make it easier than ever to go from idea to finished project with confidence.” </em></p>  <p>“<em>At Michaels, we are passionate about inspiring creativity at every skill level, and our partnership with <org value=\"CRCT.NaE\" idsrc=\"xmltag.org\" >Cricut</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='CRCT' fmr-param-security-type='Equity'>( CRCT )</span> allows us to do just that in an exciting new way,</em>” said <person>Chuck Smith</person>, Senior Vice President and General Merchandise Manager at Michaels. “<em>We’re thrilled to collaborate on the launch of Cricut’s newest smart cutting machines—the Cricut Joy 2 and Cricut Explore 5—and to offer our customers exclusive colorways like the Jade Green Joy 2 and the Teal Explore 5, available only at Michaels. These machines combine innovation, ease of use, and style, and we can’t wait for our customers to bring their creative ideas to life with them.</em>”</p>  <p><strong>A Reimagined Design Experience</strong><br/>At the heart of this launch is a significantly enhanced Design Space platform — purpose‑built to reduce guesswork and help creators feel confident from the moment inspiration strikes.</p>  <p>New <strong>Guided Flows</strong> are designed to understand a user’s project intent—what they want to make—and provide step-by-step guidance to move from idea to finished project without confusion. Intuitive and contextual, the guided flows surface only what’s needed at each stage of the design process and help users understand exactly what materials, blanks, or tools are required.</p>  <p>Within guided flows, the Canvas is now automatically sized to reflect a user's selected project type, while <strong>Project Preview </strong>allows users to see their design on the intended blank (e.g., T-shirt, mug, phone case). These updates help give users confidence that their projects will turn out as desired.</p>  <p><org value=\"CRCT.NaE\" idsrc=\"xmltag.org\" >Cricut</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='CRCT' fmr-param-security-type='Equity'>( CRCT )</span> also introduced <strong>Create AI</strong>, a new feature in Design Space available only to paid subscribers that generates custom, cut-ready, single-layer AI designs. This allows users to turn their wildest ideas, like “a dinosaur with a unicorn horn riding a skateboard,” into project-ready artwork in seconds.</p>  <p>Together, these updates reinforce Cricut’s commitment to being the go-to creative platform where software and hardware work in harmony to support crafters at every stage of their journey while keeping the focus where it belongs: Creativity.</p>  <p><strong>Availability &amp; Pricing</strong><br/>Cricut Joy™ 2 and Cricut Explore® 5 will be available beginning <chron>February 27th</chron> in the U.S. and <location value=\"LC/ca\" idsrc=\"xmltag.org\" >Canada</location> at Cricut.com and Michaels, as well as in most international markets where <org value=\"CRCT.NaE\" idsrc=\"xmltag.org\" >Cricut</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='CRCT' fmr-param-security-type='Equity'>( CRCT )</span> is sold.*</p>  <p><strong>Price ranges:</strong><br/>Cricut Joy™ 2: <money>$99</money> – <money>$229 USD</money><br/>Cricut Explore 5®: <money>$199</money> – <money>$349 USD</money></p>  <p>For more information, visit www.cricut.com</p>  <p>*Product contents and colors vary by bundle; not available in all regions or all retailers. Specialty tools sold separately. Projects calculated based on 4 in x 6 in average size using included materials.</p>  <p><strong>About <org value=\"CRCT.NaE\" idsrc=\"xmltag.org\" >Cricut, Inc.</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='CRCT' fmr-param-security-type='Equity'>( CRCT )</span></strong><br/><org value=\"CRCT.NaE\" idsrc=\"xmltag.org\" >Cricut, Inc.</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='CRCT' fmr-param-security-type='Equity'>( CRCT )</span> is a creative platform company that makes it easy for users to create meaningful personal items. <org value=\"CRCT.NaE\" idsrc=\"xmltag.org\" >Cricut</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='CRCT' fmr-param-security-type='Equity'>( CRCT )</span> hardware and software work together as a connected platform for consumers to make beautiful, high-quality projects quickly and easily. These industry-leading products include a flagship line of smart cutting machines — the Cricut Maker® family, the Cricut Explore® family, and the Cricut Joy® family — accompanied by other unique tools like Cricut EasyPress®, the Infusible Ink™ system, and a diverse collection of materials. In addition to providing tools and materials, <org value=\"CRCT.NaE\" idsrc=\"xmltag.org\" >Cricut</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='CRCT' fmr-param-security-type='Equity'>( CRCT )</span> fosters a thriving community of millions of dedicated users worldwide.</p>  <p><strong>Press Contact</strong><br/>Cricut PR<br/>pr@cricut.com</p>  Image: https://www.globenewswire.com/newsroom/ti?nf=OTY2MTYwOCM3NDUyNDcxIzIyMDYzMzU=  <br/> Image: https://ml.globenewswire.com/media/ZDUxZDllZWUtMDQ4OS00NjA0LWEwNGItNjc2MGZhNzNhZTljLTEyMTc4ODgtMjAyNi0wMi0yNi1lbg==/tiny/Cricut-Inc-.png <p> Image: Primary Logo </p>\nSource: <org value=\"CRCT.NaE\" idsrc=\"xmltag.org\" >Cricut, Inc.</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='CRCT' fmr-param-security-type='Equity'>( CRCT )</span>\n",
            "link": "https://www.fidelity.com/news/article/technology/202602261200PRIMZONEFULLFEED9661608",
            "pub_date": "2026-02-27 01:00:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Research Alert: CFRA Upgrades Opinion On Shares Of Adss Of Iqiyi Inc. To Hold From Sell",
            "description": "\n<p><chron>11:45 AM EST</chron>, <chron>02/26/2026</chron> (MT Newswires) -- CFRA, an independent research provider, has provided MT Newswires with the following research alert. Analysts at CFRA have summarized their opinion as follows:</p><p>We upgrade our opinion to Hold from Sell as the recent share price decline has moved valuation to a fair level, in our view. We maintain our target price at <money>USD1.90</money>, implying a 2026 P/E of 18.4x (vs. 26x for its competitor, Netflix, and 24x for Bilibili). We think the discount is justified by its significantly weaker profitability with 1% operating margins, declining revenue trend in 2025, and heavy debt burden limiting financial flexibility. In 2025, revenue/non-GAAP net income of <money>CNY29.29B</money>/<money>CNY280M</money> came in higher than the consensus forecast of <money>CNY27.24B</money>/<money>CNY238M</money>. In Q4 2025, iQIYI showed sequential revenue stabilization but continued margin pressure, with total revenue growing 3% Y/Y to <money>CNY6.79B</money> after multiple quarters of decline. However, operating margins compressed significantly to 1% from 4% in the prior year. iQIYI increased content investments in Q4, with content costs rising 11% Y/Y to <money>CNY3.83B</money> to support a more robust original drama lineup. We keep our 2026 EPS at <money>CNY0.74</money> and set 2027 at <money>CNY1.01</money>.</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/investing-ideas/202602261145MIDNIGHTUSEQUITY_A3573871",
            "pub_date": "2026-02-27 00:45:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Research Alert: CFRA Maintains A Strong Buy Opinion On Shares Of Salesforce Inc.",
            "description": "\n<p><chron>11:55 AM EST</chron>, <chron>02/26/2026</chron> (MT Newswires) -- CFRA, an independent research provider, has provided MT Newswires with the following research alert. Analysts at CFRA have summarized their opinion as follows:</p><p>We cut our 12-month target price to <money>$240</money> from <money>$300</money> on lower revised P/E of about 16x our CY 27 EPS view, a deep discount to historical  averages. After better-than-expected Jan-Q results, we raise our FY 27 EPS estimate to <money>$13.19</money> from  <money>$12.90</money>  and FY 28 to <money>$14.77</money> from <money>$14.55</money>. We believe the market is overly focused on the deceleration in SF's legacy clouds while substantially underestimating the scale and velocity of its AI-driven Agentic Enterprise business. The current valuation at less than 14x reflects a high level of pessimism despite strong Agentforce growth and SF's attempt to support shares with a new <money>$50B</money> buyback. SF guides for a re-acceleration in organic subscription and support revenue growth in the 2H, with confidence based on Net New Average Order Value (NNAOV) growth outpacing AOV growth for the last two quarters (expected to continue in FY 27). The market  is not pricing in this scenario (we prefer to wait and see), but if it occurs, it will help support a re-rating in shares.</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/investing-ideas/202602261155MIDNIGHTUSEQUITY_A3573883",
            "pub_date": "2026-02-27 00:55:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Top Midday Stories: Nvidia Shares Fall After Earnings; Janus Henderson Receives Acquisition Offer From Victory",
            "description": "\n<p><chron>12:00 PM EST</chron>, <chron>02/26/2026</chron> (MT Newswires) -- The Nasdaq Composite fell 1.7% in late-morning trading Thursday, the S&amp;P 500 dropped 1%, and the Dow Jones Industrial Average eased 0.3% as <location>Wall Street</location> assessed results from <org value=\"NVDA.NaE\" idsrc=\"xmltag.org\" >Nvidia</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NVDA' fmr-param-security-type='Equity'>( NVDA )</span> .</p><p><org value=\"NVDA.NaE\" idsrc=\"xmltag.org\" >Nvidia</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NVDA' fmr-param-security-type='Equity'>( NVDA )</span> reported fiscal Q4 adjusted earnings late Wednesday of <money>$1.62</money> per diluted share, up from <money>$0.89</money> a year earlier and above the FactSet consensus estimate of <money>$1.54</money>. Revenue rose to <money>$68.13 billion</money> from <money>$39.33 billion</money>, topping the consensus of <money>$66.13 billion</money>. In Q1, the company expects revenue of <money>$78 billion</money>, plus or minus 2%. Analysts project <money>$72.93 billion</money>. The company is finalizing a partnership and investment deal with <org value=\"MSFT.NaE\" idsrc=\"xmltag.org\" >Microsoft</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='MSFT' fmr-param-security-type='Equity'>( MSFT )</span>-backed (MSFT) OpenAI, but there is no assurance that the transaction will be completed. <org value=\"NVDA.NaE\" idsrc=\"xmltag.org\" >Nvidia</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NVDA' fmr-param-security-type='Equity'>( NVDA )</span> shares fell 4.6% around midday, while <org value=\"MSFT.NaE\" idsrc=\"xmltag.org\" >Microsoft</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='MSFT' fmr-param-security-type='Equity'>( MSFT )</span> eased 0.3%.</p><p><org value=\"JHG.NaE\" idsrc=\"xmltag.org\" >Janus Henderson Group</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='JHG' fmr-param-security-type='Equity'>( JHG )</span>  was sent an acquisition offer from Victory Capital valued at <money>$57.04</money> per share, Victory said Thursday. The proposal includes <money>$30</money> in cash per share and a fixed exchange ratio of 0.350 Victory Capital shares based on its Wednesday closing price. Janus shares rose 5.7%.</p><p><org value=\"CRM.NaE\" idsrc=\"xmltag.org\" >Salesforce</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='CRM' fmr-param-security-type='Equity'>( CRM )</span>  reported fiscal Q4 adjusted earnings late Wednesday of <money>$3.81</money> per diluted share, up from <money>$2.78</money> a year earlier and above the FactSet consensus of <money>$3.05</money>. Revenue rose to <money>$11.2 billion</money> from <money>$9.99 billion</money>, topping the consensus of <money>$11.19 billion</money>. In Q1, the company expects adjusted EPS of <money>$3.11</money> to <money>$3.13</money> on revenue of <money>$11.03 billion</money> to <money>$11.08 billion</money>. Analysts project EPS of <money>$3.01</money> on revenue of <money>$11.01 billion</money>. <org value=\"CRM.NaE\" idsrc=\"xmltag.org\" >Salesforce</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='CRM' fmr-param-security-type='Equity'>( CRM )</span> shares rose 2.3%.</p><p>Suppliers to US aerospace and semiconductor firms are struggling with rare-earth shortages, particularly yttrium and scandium, which are vital for aerospace engines and chips and are almost entirely produced in <location value=\"LC/cn\" idsrc=\"xmltag.org\" >China</location>, Reuters reported. <org>GE Aerospace</org> (GE) shares fell 0.5%, RTX rose 1%, and <org value=\"HON.NaE\" idsrc=\"xmltag.org\" >Honeywell International</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='HON' fmr-param-security-type='Equity'>( HON )</span>  eased 0.2%.</p><p><org value=\"F.NaE\" idsrc=\"xmltag.org\" >Ford Motor</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='F' fmr-param-security-type='Equity'>( F )</span>  will provide an over-the-air update to a lighting system software glitch that led to the recall of almost 4.4 million vehicles. The company said clients could also visit a Ford dealer to fix the issue. Ford shares rose 0.7%.</p><p><org value=\"NEE.NaE\" idsrc=\"xmltag.org\" >NextEra Energy</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NEE' fmr-param-security-type='Equity'>( NEE )</span>  plans to sell <money>$2 billion</money> of equity units in a public offering. NextEra shares fell 1.4%.</p><p>Price: 186.67, Change: -8.96, Percent Change: -4.58</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/international/202602261200MIDNIGHTUSEQUITY_A3573866",
            "pub_date": "2026-02-27 01:00:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "TKF Burnside Real Estate Partners Announces Acquisition of White Plains Office Property",
            "description": "\n<p class=\"bwalignc\">\n<i>The purchase marks <location value=\"LU/us.ny.broeld\" idsrc=\"xmltag.org\" >Brookfield</location> veterans <person>Ric Clark</person> and Dennis Friedrich’s second acquisition under the newly founded firm</i>\n\n</p>\n<p>    <location value=\"LU/us.ny.nyc\" idsrc=\"xmltag.org\" >NEW YORK</location>--(BUSINESS WIRE)--\n<org>TKF Burnside Real Estate Partners</org>, the real estate investment and operating company founded by <person>Ric Clark</person> and <person>Dennis Friedrich</person>, announced it has acquired <location>360 Hamilton Avenue</location>, a 400,000 rentable square foot Class A office property located in <location value=\"LU/us.ny.whiins\" idsrc=\"xmltag.org\" >White Plains, NY</location>. <person>Dave Hou</person> of TKF Burnside represented the company in the transaction. <person>Kevin Welsh</person> and <person>Charles Han</person> of Newmark represented the undisclosed sellers, and <person>Chris Kramer</person> and <person>Tim Polglase</person> of Newmark represented TKF Burnside on the acquisition financing.\n\n</p><p id=\"news-body-cta\">This press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20260226498675/en/</p><p>\nThe property, conveniently located within short walking distance to the <location>White Plains Metro-North Station</location> and the city’s top restaurants, shopping and robust social scene, currently houses <org>Merrill Lynch, Skadden, Arps, Slate, Meagher &amp; Flom LLP</org>, <org>Heineken USA</org>, and Bank of America among other top-tier tenants. TKF Burnside plans to modernize and enhance the existing hospitality-level amenity offerings, supporting the building’s tenants in attracting and retaining top talent.\n\n</p><p>\n“As the <location value=\"LU/us.ny.nyc\" idsrc=\"xmltag.org\" >New York City</location> office market continues to rebound in a meaningful way, we’ve seen the momentum spread to the near-in business districts,” said <person>Ric Clark</person>, co-founder of TKF Burnside. “Office demand is evolving but one principal remains: companies follow talent and talent follows vibrant, connected communities. <location value=\"LU/us.ny.whiins\" idsrc=\"xmltag.org\" >White Plains</location> – with a rapidly expanding residential base and the restaurants, social energy, walkability and affordability that today’s workforce demands – is exactly where modern companies want to be and a great place to invest.”\n\n</p><p>\nWith this acquisition – the second in just over a year for the firm – TKF Burnside’s portfolio now spans nearly one million square feet across the greater <location value=\"LU/us.ny.nyc\" idsrc=\"xmltag.org\" >New York</location> metropolitan area.\n\n</p><p>\n“The acquisition of 360 Hamilton marks an important milestone in the growth of TKF Burnside’s investment and operating platform, building on the momentum of our recent acquisition of 1000 Woodbury on <location>Long Island</location>,” said <person>Dennis Friedrich</person>, co-founder of TKF Burnside. “This property strongly aligns with our strategy of investing in high-quality, amenitized assets located in dynamic, transit-oriented markets, whether that’s Manhattan’s central business district or a growing inner suburban market like <location value=\"LU/us.ny.whiins\" idsrc=\"xmltag.org\" >White Plains</location>, the central commercial hub of <location value=\"LU/us.ny.weheer\" idsrc=\"xmltag.org\" >Westchester County</location> and one of the shortest one-seat train rides into the Grand Central area.”\n\n</p><p>\n<b>About TKF Burnside\n<br /></b><org>TKF Burnside Real Estate Partners</org> is an accomplished real estate investment and operating company led by <person>Ric Clark</person> and <person>Dennis Friedrich</person>, both former C-suite executives and long-time colleagues at <location value=\"LU/us.ny.broeld\" idsrc=\"xmltag.org\" >Brookfield</location>, who together previously managed one of the largest global real estate portfolios (<money>$200B</money> AUM). With over 65+ years of combined experience and expertise, they operated, repositioned and developed iconic properties across a broad range of asset classes in five continents. TKF Burnside’s investment strategy is to acquire high-quality or high-potential undercapitalized and underperforming real estate assets with a focused turnaround strategy to enhance value and achieve outperformance within the office, multifamily, retail and mixed-use sectors.\n\n</p><p><img alt=\"\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20260226498675r1&amp;sid=acqr8&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\" /><span class=\"bwct31415\" /></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\">https://www.businesswire.com/news/home/20260226498675/en/</span></p>\n<p>Source: <org>TKF Burnside Real Estate Partners</org></p>\n",
            "link": "https://www.fidelity.com/news/article/mergers-and-acquisitions/202602261200BIZWIRE_USPR_____20260226_BW498675",
            "pub_date": "2026-02-27 01:00:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Fractional AI Announces Acquisition of Fabius",
            "description": "\n<div class=\"xn-content\">\n<p><span class=\"legendSpanClass\"><location value=\"LU/us.ca.sanfrn\" idsrc=\"xmltag.org\" >SAN FRANCISCO</location></span>, <span class=\"legendSpanClass\"><chron>Feb. 26, 2026</chron></span> /PRNewswire/ -- Fractional AI, the leader in applied AI, today announced its acquisition of Fabius, a Y-Combinator startup focused on automating sales and operational workflows using AI.</p>\n    <div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder1\">\n                <p>\n\n                    <img src=\"https://mma.prnewswire.com/media/2871189/Fractional_AI_Logo_Large.jpg\" title=\"Fractional AI Logo (PRNewsfoto/Fractional AI)\" alt=\"Fractional AI Logo (PRNewsfoto/Fractional AI)\" />\n\n                </p>\n    </div>\n<p>As enterprise demand for production AI systems continues to accelerate, Fractional AI has experienced rapid growth partnering with the world's largest PE firms to transform their portfolio companies with bespoke AI software. The acquisition strengthens Fractional's position as the fastest growing AI-native service provider.</p><p>\"At Fractional, we build AI systems that integrate into how businesses actually run to drive real impact,\" said Chris <span>Taylor, co-founder and CEO of Fractional AI</span>. \"Fabius shares that mindset, and together we're expanding the scope and scale of what we can deliver to our clients.\"</p><p>Founded in 2020 and part of YC's Winter 2023 cohort, Fabius brings deep experience applying early advances in generative and embedding-based models to real-world services workflows, complementing Fractional's execution-led approach to designing AI systems that deliver measurable business outcomes.</p><p>\"At Fabius, we saw that the most impactful AI systems are those built directly into how a company delivers its core offering,\" said <person>Neil Madsen</person>,<span> co-founder and CEO of Fabius</span>. \"Fractional shares that philosophy of translating AI into durable operational advantage. We're excited to help scale that impact.\"</p><p><b>About Fractional AI</b></p><p>Fractional AI builds custom generative AI solutions that help companies move from experimentation into production. An OpenAI partner, Fractional AI works with enterprises and private equity-backed companies to design and deploy applied AI systems that integrate into real workflows, support critical decisions, and create lasting competitive advantage</p>\n\n\n\n<p id=\"PURL\"><img title=\"Cision\" width=\"12\" height=\"12\" alt=\"Cision\" src=\"https://edge.prnewswire.com/c/img/favicon.png?sn=SF96072&amp;sd=2026-02-26\" /> View original content to download multimedia:https://www.prnewswire.com/news-releases/fractional-ai-announces-acquisition-of-fabius-302697651.html</p><p>SOURCE Fractional AI</p></div>\n",
            "link": "https://www.fidelity.com/news/article/mergers-and-acquisitions/202602261200PR_NEWS_USPR_____SF96072",
            "pub_date": "2026-02-27 01:00:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "LoanBud Launches AI-Powered Platform to Verify SBA Financeability Before Businesses Go to Market",
            "description": "\n<div class=\"xn-content\">\n<p class=\"prntac\"><b><i>AI-powered intake and human review surface SBA eligibility issues early, reducing deal risk and delays</i></b></p><p><span class=\"legendSpanClass\"><location value=\"LU/us.ny.nyc\" idsrc=\"xmltag.org\" >NEW YORK</location></span>, <span class=\"legendSpanClass\"><chron>Feb. 26, 2026</chron></span> /PRNewswire/ -- LoanBud, a financial technology company modernizing access to <org>Small Business Administration</org> (SBA) financing, today announced the launch of its <b>LoanBud Prequalification Platform (LoanBud.io)</b>, a first-of-its-kind solution that prequalifies businesses for SBA financing prior to listing—bringing financing validation to the start of the sale process instead of the end.</p>\n    <div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder1\">\n                <p>\n\n                    <img src=\"https://mma.prnewswire.com/media/2841865/LoanBud_Logo.jpg\" title=\"LoanBud (PRNewsfoto/LoanBud)\" alt=\"LoanBud (PRNewsfoto/LoanBud)\" />\n\n                </p>\n    </div>\n<p>Financing uncertainty is one of the most common reasons small business acquisition deals slow down, retrade, or collapse. LoanBud's Prequalification Platform moves SBA eligibility upstream by combining structured document intake with AI-assisted analysis to quickly identify whether a business is likely to qualify for SBA financing and to estimate potential loan capacity for qualified buyers.</p><p>\"Too often, financing is introduced after the deal momentum is already built, and that's when surprises show up,\" said Burke Purcell, CEO of LoanBud. \"The LoanBud Prequalification Platform brings structure, speed, and transparency to the front end of the process so brokers, sellers, and buyers can invest time and resources with greater confidence.\"</p><p>LoanBud's software combines structured intake, optical character recognition (OCR), and AI-assisted analysis to accelerate early-stage diligence. Sellers and brokers upload tax returns, financial statements and the confidential information memorandum (CIM). The platform extracts key data, flags missing items and inconsistencies, and helps LoanBud's SBA financing team complete an initial eligibility review more efficiently.</p><p>Product features include:</p><ul type=\"disc\"><li>Guided document checklist that keeps sellers and brokers on track and reduces back-and-forth.</li><li>OCR-powered extraction from tax returns, profit-and-loss statements, balance sheets and deal documents to accelerate early diligence.</li><li>AI-assisted CIM review that summarizes the business model, key risks and transferability considerations.</li><li>Automated first-pass financial spread and cash-flow normalization to support SBA sizing discussions.</li><li>Deal Readiness Report that flags gaps (missing financials, debt schedule issues, inconsistencies) with clear next steps.</li></ul><p>Most submissions receive an initial determination within one to two business days, along with structured feedback and key conditions, subject to buyer qualifications and lender underwriting. Updated financial statements may be requested periodically. Rather than waiting for a buyer to initiate underwriting, sellers can address financeability questions upfront, allowing listings to enter the market with more certainty and fewer unexpected issues.</p><p>The platform also provides brokers with a centralized workspace to manage listings end to end, including secure document uploads, real-time visibility into prequalification status and a structured workflow to keep deals moving. Once a business is prequalified, the broker receives a unique application URL to share with interested buyers. Buyers can then apply for financing tied to that specific business, and LoanBud routes the request through its SBA lender partner network.</p><p>To learn more or submit a business listing for prequalification, visit <b>LoanBud.io</b>.</p><p><b>About LoanBud<br /></b>LoanBud is a financial technology platform modernizing access to SBA financing for small business acquisitions, expansion, working capital, and owner-occupied commercial real estate. Through its national marketplace of 50+ SBA lenders and proprietary prequalification infrastructure, LoanBud helps entrepreneurs, brokers, and sellers navigate SBA-backed transactions with greater clarity and efficiency. LoanBud is not a lender; it operates a marketplace that connects buyers and sellers with SBA lenders through its network of approved lenders. Learn more at <b>LoanBud.io</b>.</p>\n\n\n\n<p id=\"PURL\"><img title=\"Cision\" width=\"12\" height=\"12\" alt=\"Cision\" src=\"https://edge.prnewswire.com/c/img/favicon.png?sn=NY96829&amp;sd=2026-02-26\" /> View original content to download multimedia:https://www.prnewswire.com/news-releases/loanbud-launches-ai-powered-platform-to-verify-sba-financeability-before-businesses-go-to-market-302698649.html</p><p>SOURCE LoanBud</p></div>\n",
            "link": "https://www.fidelity.com/news/article/technology/202602261137PR_NEWS_USPR_____NY96829",
            "pub_date": "2026-02-27 00:37:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "eClinical Solutions Highlights 2025 Achievements and Announces Latest Innovations to Accelerate and Future-Proof Clinical Trials",
            "description": "\n<p class=\"bwalignc\">\n<i>Working with top global pharmaceutical sponsors, company doubles down on agentic AI and RBQM investments to bend the clinical development efficiency curve</i>\n\n</p>\n<p>    <location value=\"LU/us.ma.boston\" idsrc=\"xmltag.org\" >BOSTON</location>--(BUSINESS WIRE)--\neClinical <org>Solutions LLC</org>, a global provider of digital clinical software and services, today announced 2025 milestones along with new 2026 innovation to support the end-to-end clinical research lifecycle, bringing breakthrough therapies to patients faster. Last year the company added over 20 net new customers to its portfolio of biopharma and CRO clients, which now includes 18 of the top 50 pharmaceutical companies in the world, supporting clinical trial leaders with an AI-first, risk-based approach.\n\n</p><p>\nNotably, eClinical Solutions focused on evolving elluminate as a clinical data intelligence platform to improve trial efficiency, debuting elluminate agents. The agents are fueled by data products with shared context and workflows with agentic, assistive, and task-oriented AI, and a data foundation with grounding guardrails and policies. Additionally, the company launched a digitized Integrated Data Review Plan (IDRP), positioning eClinical Solutions as the first company to centralize digital data review within a single platform, and announced an industry collaboration with ZS, pairing eClinical Solutions’ elluminate RBQM (risk-based quality management) technology with ZS’ RBQM consulting and custom-built solution expertise to create a unified integrated quality risk management (IQRM) experience for sponsors.\n\n</p><p>\nOther key company highlights from 2025 included industry recognition in Everest Group's Tech Provider Spotlight: Risk-Based Quality Management (RBQM) report, highlighting eClinical Solutions’ elluminate RBQM capabilities. eClinical Solutions also won the 2025 <org>Top Workplace USA</org> Award: Remote Work and the 2025 Top Workplaces Culture Excellence Award: Work-Life Flexibility, for the fourth consecutive year. Finally, the <org>Society for Clinical Data Management</org> (SCDM) awarded eClinical Solutions with the SCDM Innovation Award for Advancements in Health Insight Generation and elected <person>Dawn Kaminski</person>, Vice President of Business Development Operations at eClinical Solutions as Executive Secretary of the <org>SCDM Board</org> for 2026.\n\n</p><p>\nBuilding on 2025 momentum, the company has unveiled new updates to the elluminate platform this year aimed at supporting sponsors’ objectives - from ensuring ease of compliance with the revised ICH E6 R(3) guidelines to expanding agentic AI efficiencies:\n\n</p><ul class=\"bwlistdisc\">\n<li>\n<b>Agentic data review automation:</b> The Explain Agent in Data Central uses clinical data and protocol-aware intelligence to interpret charts in real time, highlight meaningful patterns, and recommend next steps, eliminating hours of manual navigation by delivering instant, explainable insights where reviewers work.\n\n</li>\n<li>\n<b>End-to-end RBQM traceability:</b> RACT integration into review objectives plus RBQM Snapshots to preserve evidence over time, improve audit readiness, and strengthen follow-up execution.\n\n</li>\n<li>\n<b>Faster, more consistent RBQM setup: </b>Study-level RBQM configuration with linkage to global KRIs/QTLs and the ability to auto-pull KRIs/QTLs from RACT, reducing manual effort and accelerating study startup.\n\n</li>\n<li>\n<b>Guided centralized monitoring experience</b>: In-context KRI/QTL/risk signal review - thresholds, recommendations, related observations - directly from the RBQM Overview to drive faster, more consistent decisions.\n\n</li>\n<li>\n<b>Agentic SDTM mapping automation from spec to executable code</b>: Automated and agentic-AI-powered specification generation, plus transparent code generation - Python/R/SAS - with traceability from spec through execution logs to accelerate submission-ready datasets.\n\n</li>\n</ul><p>\n“Insight from clients and partners at ENGAGE 2025 and the data from our 2025 <org>Industry Outlook Survey</org> reaffirmed our conviction of creating a strong data intelligence foundation through the elluminate platform that elicits scalable innovation, from embedding intelligence to risk-based approaches,” said Raj Indupuri, CEO and co-founder of eClinical Solutions. “As we look at our next phase of growth, we’re hyper-focused on driving return on investment for our clients and leaning into agentic AI in 2026, for the next era of clinical trial automation.”\n\n</p><p>\n<b>About eClinical <org>Solutions LLC</org>\n<br /></b>eClinical Solutions’ industry-leading clinical data intelligence platform, elluminate<sup>®</sup>, and biometrics services experts help biopharma researchers at large, mid-size, and emerging life sciences organizations develop tomorrow’s breakthroughs with today’s resources. eClinical is a privately-held, purpose-driven company with a global workforce and winner of the 2025 <org>Top Workplace USA</org> Award: Remote Work, the 2025 Top Workplaces Culture Excellence Award: Work-Life Flexibility, and Great Place To Work<sup>®</sup> India Certification™. Learn more at www.eclinicalsol.com and follow eClinical Solutions on LinkedIn.\n\n</p><p><img alt=\"\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20260226417788r1&amp;sid=acqr8&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\" /><span class=\"bwct31415\" /></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\">https://www.businesswire.com/news/home/20260226417788/en/</span></p>\n<p>Source: eClinical <org>Solutions LLC</org></p>\n",
            "link": "https://www.fidelity.com/news/article/technology/202602261140BIZWIRE_USPR_____20260226_BW417788",
            "pub_date": "2026-02-27 00:40:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Research Alert: CFRA Maintains Hold Opinion On Shares Of Pinnacle West Capital Corporation",
            "description": "\n<p><chron>09:35 AM EST</chron>, <chron>02/26/2026</chron> (MT Newswires) -- CFRA, an independent research provider, has provided MT Newswires with the following research alert. Analysts at CFRA have summarized their opinion as follows:</p><p>Following PNW's Q4 earnings print, we adjust our 12-month target to <money>$105</money> from <money>$100</money>, valuing shares at 18x our 2027 EPS outlook of <money>$5.83</money> (2026 EPS view reiterated at <money>$4.69</money>). In Q4, PNW benefited from robust economic activity in <location value=\"LS/us.az\" idsrc=\"xmltag.org\" >Arizona</location>, posting 5% weather-normalized retail sales growth and 2.4% customer growth in 2025, with commercial and industrial sales demonstrating particular strength at 7.5% growth led by new manufacturing facilities and data center development. An exceptionally hot summer drove APS to set three all-time peak demand records, with system peak demand rising over 5% to 8.6GW. Looking ahead, the pending 2025 APS rate case represents a critical catalyst, as PNW seeks a <money>$580M</money> sales increase and 10.70% authorized ROE while proposing a Formula Rate Adjustment Mechanism that would enable more timely rate updates to address historical regulatory lags, with new rates expected in the second half of 2026. PNW's <money>$10.35B</money> capital investment plan aims to capture substantial load growth opportunities.</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/investing-ideas/202602260935MIDNIGHTUSEQUITY_A3573639",
            "pub_date": "2026-02-26 22:35:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Nutanix's AMD Partnership Likely Sets Valuation Floor, Morgan Stanley Says",
            "description": "\n<p><chron>11:40 AM EST</chron>, <chron>02/26/2026</chron> (MT Newswires) -- <org value=\"NTNX.NaE\" idsrc=\"xmltag.org\" >Nutanix's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NTNX' fmr-param-security-type='Equity'>( NTNX )</span>  <money>$250 million</money> investment and partnership with <org value=\"AMD.NaE\" idsrc=\"xmltag.org\" >Advanced Micro Devices</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AMD' fmr-param-security-type='Equity'>( AMD )</span>  to build an edge inference solution could set a floor on valuation, Morgan Stanley said in a note Thursday.</p><p>While the commercial impact is several quarters away, a strategic equity investment at about <money>$36</money> likely signals a floor on valuation despite the limited revenue visibility, the report said.</p><p>The note also pointed to supply-chain issues on CPU availability and higher memory prices that impacted customers' ability to procure servers towards the second-half of Q2.</p><p>That led the company to cut its revenue growth expectations while Q2 revenue came in ahead of market expectations, it said.</p><p>&quot;While revenue gets pushed out, bookings growth is sustaining in the mid-teens and new customer acquisition remains robust,&quot; the report said.</p><p>Morgan Stanley cut its price target to <money>$53</money> from <money>$56</money> while maintaining its equal weight rating on <org value=\"NTNX.NaE\" idsrc=\"xmltag.org\" >Nutanix</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NTNX' fmr-param-security-type='Equity'>( NTNX )</span>.</p><p>Price: 40.12, Change: +1.68, Percent Change: +4.36</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602261140MIDNIGHTUSEQUITY_A3573816",
            "pub_date": "2026-02-27 00:40:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Market Chatter: PayPal Not Currently in Talks to be Acquired by Stripe",
            "description": "\n<p><chron>11:41 AM EST</chron>, <chron>02/26/2026</chron> (MT Newswires) -- <org value=\"PYPL.NaE\" idsrc=\"xmltag.org\" >PayPal Holdings</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='PYPL' fmr-param-security-type='Equity'>( PYPL )</span>  is not currently holding talks to sell itself to Stripe or any other company, Semafor reported Thursday, citing people familiar with the matter.</p><p>The report said <org value=\"PYPL.NaE\" idsrc=\"xmltag.org\" >PayPal</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='PYPL' fmr-param-security-type='Equity'>( PYPL )</span> has been working for months with bankers to brace for the possibility of activist pressure or an unsolicited takeover approach.</p><p><org value=\"PYPL.NaE\" idsrc=\"xmltag.org\" >PayPal</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='PYPL' fmr-param-security-type='Equity'>( PYPL )</span> didn't immediately reply to a request for comment from MT Newswires.</p><p>(Market Chatter news is derived from conversations with market professionals globally. This information is believed to be from reliable sources but may include rumor and speculation. Accuracy is not guaranteed.)</p><p>Price: 45.55, Change: -1.75, Percent Change: -3.69</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602261141MIDNIGHTUSEQUITY_A3573845",
            "pub_date": "2026-02-27 00:41:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Warner Bros' TV decline puts pressure on Netflix deal",
            "description": "\n<p>*</p>\n<p><org>Warner Bros'</org> TV revenue and income decline significantly</p>\n<p></p>\n<p>*</p>\n<p>Discovery Global's standalone value impacted by revenue\nand\nincome drop</p>\n<p></p>\n<p>*</p>\n<p><org value=\"NFLX.NaE\" idsrc=\"xmltag.org\" >Netflix</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NFLX' fmr-param-security-type='Equity'>( NFLX )</span> has four days to revise offer if <org>Paramount's</org> bid\nis\nfavored</p>\n<p></p>\n<p>*</p>\n<p><org>Warner Bros</org> adds 3.5 million streaming subscribers in Q4</p>\n<p>(Adds conference call details, bullets)</p>\n<p>By <person>Dawn Chmielewski</person></p>\n<p><chron>Feb 26</chron> (Reuters) -</p>\n<p><org value=\"WBD.NaE\" idsrc=\"xmltag.org\" >Warner Bros Discovery</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='WBD' fmr-param-security-type='Equity'>( WBD )</span> heaped an additional burden on\n<org value=\"NFLX.NaE\" idsrc=\"xmltag.org\" >Netflix's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NFLX' fmr-param-security-type='Equity'>( NFLX )</span> <money>$82.7 billion</money> bid for the movie studio and\nHBO.</p>\n<p>The entertainment company behind the buzzy series &quot;Heated\nRivalry&quot; and the film &quot;<location>Wuthering Heights</location>&quot; reported\nfourth-quarter earnings Thursday that showed profit at its cable\nchannels is deteriorating at a fast pace.</p>\n<p>The networks, which include CNN, the Discovery Network and\nTNT, are not part of</p>\n<p><org value=\"NFLX.NaE\" idsrc=\"xmltag.org\" >Netflix's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NFLX' fmr-param-security-type='Equity'>( NFLX )</span> deal</p>\n<p>. But their worth as a separately traded company is a key\ncomponent in valuing the streaming service's offer for the\n<org>Warner Bros</org> film and TV studios, its library, HBO and the HBO\nMax streaming service.</p>\n<p>Rival <org value=\"PSKY.NaE\" idsrc=\"xmltag.org\" >Paramount Skydance</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='PSKY' fmr-param-security-type='Equity'>( PSKY )</span></p>\n<p>raised its proposal</p>\n<p>to buy all of <org>Warner Bros</org> to <money>$110 billion</money>. On Tuesday, the\nWarner board said it is negotiating with the rival bidder to\ndetermine whether the revised proposal could result in a deal\nsuperior to <org value=\"NFLX.NaE\" idsrc=\"xmltag.org\" >Netflix's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NFLX' fmr-param-security-type='Equity'>( NFLX )</span> offer.</p>\n<p><org>Warner Bros</org> Chief Executive <person>David Zaslav</person> did not address the\ndiscussions on a call with investors Thursday. Instead, he\nhighlighted his role in sparking a bidding war for the coveted\nassets.</p>\n<p>&quot;We engaged with four bidders, which led to eight price\nincreases, and have thus far achieved a 63% increase in value\nversus the first offer received in September, delivering\nsignificant value to WBD shareholders throughout the process,&quot;\nZaslav told investors.</p>\n<p>Warner's board had previously determined <org value=\"NFLX.NaE\" idsrc=\"xmltag.org\" >Netflix's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NFLX' fmr-param-security-type='Equity'>( NFLX )</span> offer was\nsuperior to <org>Paramount's</org> because investors would also receive the\nvalue of its planned spin-off of the television group, Discovery\nGlobal.\nThe division's revenue fell to <money>$4.2 billion</money>, down 12% from a\nyear earlier, and adjusted income dropped to <money>$1.4 billion</money>, a 27%\nplunge from the same quarter a year earlier. Such declines\naffect the value of the TV networks as a standalone business,\nDiscovery Global.</p>\n<p>Its</p>\n<p>closest comparison</p>\n<p>is Versant Media, the cable and digital assets separated\nfrom <org value=\"CMCSA.NaE\" idsrc=\"xmltag.org\" >Comcast</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='CMCSA' fmr-param-security-type='Equity'>( CMCSA )</span> earlier this year. Versant's enterprise is worth\nroughly 3 times its 2025 forecast EBITDA of <money>$2.1 billion</money>. On the\nsame yardstick, Discovery Global's market capitalization would\nbe approximately <money>$3 billion</money> or a little over <money>$1</money> per share,\nassuming <money>$17 billion</money> in net debt.</p>\n<p>Add that to <org value=\"NFLX.NaE\" idsrc=\"xmltag.org\" >Netflix's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NFLX' fmr-param-security-type='Equity'>( NFLX )</span> cash offer of <money>$27.75</money> per share and it\ncomes in shy of <org>Paramount's</org> bid of <money>$31</money>.</p>\n<p>Warner CFO <person>Gunnar Wiedenfels</person> declined to address that\ncomparison. <org value=\"NFLX.NaE\" idsrc=\"xmltag.org\" >Netflix</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NFLX' fmr-param-security-type='Equity'>( NFLX )</span> did not immediately reply to a request for\ncomment.\nHBO Max continued to grow, helped by series like &quot;Heated\nRivalry&quot; and &quot;It: Welcome to Derry.&quot; <org>Warner Bros</org> added 3.5\nmillion streaming subscribers in the quarter, bringing its total\nnumber worldwide to 131.6 million.</p>\n<p>The streaming group's revenue rose 5% to nearly <money>$2.8\nbillion</money>, but adjusted earnings fell 4% to <money>$393 million</money> due to\nthe end of an unspecified distribution deal.</p>\n<p>&quot;The best thing for WBD shareholders is that it is being\nsold, because its fundamentals continue to deteriorate,&quot; wrote\nNeedham &amp; Co senior research analyst <person>Laura Martin</person>.</p>\n<p>Warner's stock was largely unchanged in early morning\ntrading.\nZaslav also highlighted the success of the <org>Warner Bros</org> film\nslate, including &quot;<location>Wuthering Heights</location>,&quot; &quot;A Minecraft Movie&quot; and\n&quot;Superman.&quot;\n&quot;We love the motion picture business,&quot; Zaslav said on the call.\n&quot;We at the company believe so deeply in the motion picture\nbusiness, putting movies on the screen for shared experience ...\nOur commitment to the motion picture business is the core of our\ncompany.&quot;</p>\n<p><org value=\"NFLX.NaE\" idsrc=\"xmltag.org\" >Netflix</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NFLX' fmr-param-security-type='Equity'>( NFLX )</span> Chief Executive <person>Ted Sarandos</person> has defended his deal\nfor the studio and HBO by affirming his commitment to</p>\n<p>releasing movies in theaters</p>\n<p>, a strategy that was never part of <org value=\"NFLX.NaE\" idsrc=\"xmltag.org\" >Netflix's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NFLX' fmr-param-security-type='Equity'>( NFLX )</span> DNA.</p>\n<p>Should <org>Warner Bros</org> board declare that <org>Paramount's</org> deal is\nsuperior, <org value=\"NFLX.NaE\" idsrc=\"xmltag.org\" >Netflix</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NFLX' fmr-param-security-type='Equity'>( NFLX )</span> has four business days to revise its offer.\n(Reporting by <person>Dawn Chmielewski</person> in <location value=\"LU/us.ca.losang\" idsrc=\"xmltag.org\" >Los Angeles</location> and <person>Harshita Mary\nVarghese</person> in Bengaluru; Editing by <person>Jennifer Saba</person>, <person>Edwina Gibbs</person>\nand <person>Nick Zieminski</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602261127RTRSNEWSCOMBINED_L6N3ZM0X2_1",
            "pub_date": "2026-02-27 00:27:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "BOYD GAMING TO SELL SAM'S TOWN SHREVEPORT TO BALLY'S CORPORATION",
            "description": "\n<div class=\"xn-content\">\n<p><span class=\"legendSpanClass\"><location value=\"LU/us.nv.lasveg\" idsrc=\"xmltag.org\" >LAS VEGAS</location></span>, <span class=\"legendSpanClass\"><chron>Feb. 26, 2026</chron></span> /PRNewswire/ -- <org value=\"BYD.NaE\" idsrc=\"xmltag.org\" >Boyd Gaming Corporation</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='BYD' fmr-param-security-type='Equity'>( BYD )</span> <b></b> announced that it has entered into a definitive agreement to sell Sam's <location>Town Hotel &amp;</location> <span>Casino</span> in <location value=\"LU/us.la.shrort\" idsrc=\"xmltag.org\" >Shreveport, Louisiana</location>, (\"Sam's Town Shreveport\") to Bally's Corporation <b></b>. </p>\n    <div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder1\">\n                <p>\n\n                    <img src=\"https://mma.prnewswire.com/media/2920741/Boyd_Gaming_Logo.jpg\" title=\"\" alt=\"\" />\n\n                </p>\n    </div>\n<p>Located adjacent to Bally's <location value=\"LU/us.la.shrort\" idsrc=\"xmltag.org\" >Shreveport</location> <span>Casino</span> &amp; Hotel in downtown <location value=\"LU/us.la.shrort\" idsrc=\"xmltag.org\" >Shreveport</location>, Sam's Town Shreveport features a 29,000-square-foot <span>casino</span> with 750 slot machines and 14 table games, a 514-room hotel, multiple restaurants, a live entertainment venue, and convention and meeting space.</p><p>The transaction is expected to close in the third quarter of 2026, subject to the satisfaction of customary closing conditions and the receipt of required regulatory approvals.  Terms of the transaction were not disclosed.</p><p><person>Soo Kim</person>, Executive Chairman of Bally's Corporation, said: \"As an existing operator in <location value=\"LU/us.la.shrort\" idsrc=\"xmltag.org\" >Shreveport</location>, we know this market well and understand what makes it special – from its loyal customer base to its important role in the region's broader gaming and entertainment landscape. The acquisition of Sam's Town Shreveport reflects our confidence in the community and our long-term commitment to growing our presence here. We see meaningful opportunities to reinvest in the market and further strengthen <location value=\"LU/us.la.shrort\" idsrc=\"xmltag.org\" >Shreveport's</location> position as a premier destination for gaming and entertainment. We look forward to sharing more about our broader vision and plans for the property and the market in the near future.\"</p><p><person>Keith Smith</person>, President and Chief Executive Officer of <org value=\"BYD.NaE\" idsrc=\"xmltag.org\" >Boyd Gaming</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='BYD' fmr-param-security-type='Equity'>( BYD )</span>, said: \"The sale of our Sam's Town Shreveport property is consistent with our continued focus on refining our operating model and our nationwide property portfolio. Sam's Town Shreveport has been a part of our Company since 2004, and we appreciate all of the contributions of its team members, past and present, in providing great service to our guests throughout the last two decades.\"</p><p><b><u>Forward-looking Statements and Company Information<br /></u></b>This press release contains forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended. Such statements contain words such as \"may,\" \"will,\" \"might,\" \"expect,\" \"believe,\" \"anticipate,\" \"could,\" \"would,\" \"estimate,\" \"continue,\" \"pursue,\" or the negative thereof or comparable terminology, and may include (without limitation) information regarding expectations, goals or intentions regarding future performance. These forward-looking statements are based on the current beliefs and expectations of management and involve risks and uncertainties that could cause actual results to differ materially from those expressed in the forward-looking statements. All forward-looking statements in this press release are made as of the date hereof, based on information available as of the date hereof, and neither <org value=\"BYD.NaE\" idsrc=\"xmltag.org\" >Boyd Gaming Corporation</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='BYD' fmr-param-security-type='Equity'>( BYD )</span> nor Bally's Corporation assumes obligation to update any forward-looking statement.</p><p><b><u>About <org value=\"BYD.NaE\" idsrc=\"xmltag.org\" >Boyd Gaming</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='BYD' fmr-param-security-type='Equity'>( BYD )</span><br /></u></b>Founded in 1975, <org value=\"BYD.NaE\" idsrc=\"xmltag.org\" >Boyd Gaming Corporation</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='BYD' fmr-param-security-type='Equity'>( BYD )</span> <b></b> is a leading geographically diversified operator of 27 gaming entertainment properties in 11 states. The Company also manages a tribal <span>casino</span> in northern <location value=\"LS/us.ca\" idsrc=\"xmltag.org\" >California</location>, and owns and operates Boyd Interactive, a B2B and B2C online <span>casino</span> gaming business. <org value=\"BYD.NaE\" idsrc=\"xmltag.org\" >Boyd Gaming's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='BYD' fmr-param-security-type='Equity'>( BYD )</span> nationwide portfolio is connected through Boyd Rewards, recognized as the nation's favorite <span>casino</span> loyalty program by readers of <location value=\"LC/us\" idsrc=\"xmltag.org\" >USA</location> Today.  Named by <org>Forbes magazine</org> as one of \"America's Best Companies,\" and led by one of the most experienced teams in the industry, <org value=\"BYD.NaE\" idsrc=\"xmltag.org\" >Boyd Gaming</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='BYD' fmr-param-security-type='Equity'>( BYD )</span> is dedicated to delivering an outstanding entertainment experience and memorable guest service. For additional Company information and press releases, visit https://www.boydgaming.com.</p><p><b><u>About Bally's Corporation<br /></u></b>Bally's <b></b> is a fast-growing global entertainment brand with 19 <span>casinos</span> across 11 US states and one <span>casino</span> in <location value=\"LU/gb.eng.newtle\" idsrc=\"xmltag.org\" >Newcastle, UK</location>, along with a golf course in <location value=\"LS/us.ny\" idsrc=\"xmltag.org\" >New York</location> and a horse racetrack in <location value=\"LS/us.co\" idsrc=\"xmltag.org\" >Colorado</location>. Bally's also owns Bally Bet, a first-in-class sports <span>betting</span> and igaming platform licensed in 14 jurisdictions in <location value=\"LR/nam\" idsrc=\"xmltag.org\" >North America</location>. Bally's holds a majority interest in Bally's <org>Intralot S.A.</org> <b>(ATSE: BYLOT)</b>, a leading lottery solutions supplier and gaming operator active in 39 jurisdictions nationwide. Bally's <span>casino</span> operations include approximately 17,700 slot machines, 630 table games, and 3,950 hotel rooms. Bally's also has rights to developable land in <location value=\"LU/us.nv.lasveg\" idsrc=\"xmltag.org\" >Las Vegas</location> at the site of the former Tropicana Las Vegas, has been awarded a license to build a full-scale <span>casino</span> and resort in The <location value=\"LU/us.ny.bronx\" idsrc=\"xmltag.org\" >Bronx, New York</location> and is developing an integrated destination resort in <location value=\"LU/us.il.chicgo\" idsrc=\"xmltag.org\" >Chicago, Illinois</location>. Bally's has approximately 10,800 employees across the world, recognized for their innovation, energy, and dedication to creating thrilling gaming experiences.</p><p> </p>\n<div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder2\">\n                <p>\n\n                    <img src=\"https://mma.prnewswire.com/media/2920756/Ballys_logo__1.jpg\" title=\"\" alt=\"\" />\n\n                </p>\n</div>\n\n\n\n<p id=\"PURL\"><img title=\"Cision\" width=\"12\" height=\"12\" alt=\"Cision\" src=\"https://edge.prnewswire.com/c/img/favicon.png?sn=LA96166&amp;sd=2026-02-26\" /> View original content to download multimedia:https://www.prnewswire.com/news-releases/boyd-gaming-to-sell-sams-town-shreveport-to-ballys-corporation-302697846.html</p><p>SOURCE <org value=\"BYD.NaE\" idsrc=\"xmltag.org\" >Boyd Gaming Corporation</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='BYD' fmr-param-security-type='Equity'>( BYD )</span></p></div>\n",
            "link": "https://www.fidelity.com/news/article/mergers-and-acquisitions/202602261130PR_NEWS_USPR_____LA96166",
            "pub_date": "2026-02-27 00:30:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "February Kansas City Fed Manufacturing Index Posts Larger-Than-Expected Rise",
            "description": "\n<p><chron>11:10 AM EST</chron>, <chron>02/26/2026</chron> (MT Newswires) -- The Kansas City Fed monthly manufacturing index rose to a reading of 5 in February from 0 in January, higher than expectations for an increase to 2 in a survey compiled by <org>Bloomberg</org>.</p><p>The increase follows expansion in readings for the other regional manufacturing data released so far. The ISM's national manufacturing reading will be released on <chron>March 2</chron>.</p><p>Within the <location value=\"LU/us.mo.kancty\" idsrc=\"xmltag.org\" >Kansas City</location> data, there were index gains for production, shipments, new orders, inventories, while readings for prices received for finished goods and the number of employees declined.</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/us-economy/202602261110MIDNIGHTUSEQUITY_A3573818",
            "pub_date": "2026-02-27 00:10:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Buy Now Pay Later Market to reach US$ 212.2 billion by 2033 Expands amid Digital Commerce Growth and Consumer Preference Shifts | Persistence Market Research",
            "description": "\n<div class=\"xn-content\">\n<p><span class=\"legendSpanClass\"><location value=\"LU/gb.eng.london\" idsrc=\"xmltag.org\" >LONDON</location></span>, <span class=\"legendSpanClass\"><chron>Feb. 26, 2026</chron></span> /PRNewswire/ -- <org>Persistence Market Research</org>, a leading management consulting firm, has released this update on the buy now pay later (BNPL) market. These increasingly popular payment solutions let consumers purchase goods or services instantly and settle the cost in future installments, transforming how global consumers shop and merchants sell.</p>\n    <div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder1\">\n                <p>\n\n                    <img src=\"https://mma.prnewswire.com/media/2876873/Persistence_Market_Research_Logo.jpg\" title=\"Persistence Market Research Logo (PRNewsfoto/Persistence Market Research Pvt. Ltd.)\" alt=\"Persistence Market Research Logo (PRNewsfoto/Persistence Market Research Pvt. Ltd.)\" />\n\n                </p>\n    </div>\n<p>The global buy now pay later market is growing rapidly, expected to be valued at approximately <money>US$ 48.7 billion</money> in 2026 and projected to reach <money>US$ 212.2 billion</money> by 2033, exhibiting a CAGR of around 23.4% through the forecast period. This expansion stems from rising consumer demand for flexible, debt-light payment methods and robust integration of BNPL services across digital checkout platforms. BNPL solutions are embedded in e-commerce ecosystems and retail environments alike, unlocking new buying power for consumers and boosting merchant conversion. Market dynamics also reflect growing point-of-sale adoption and strategic <span>fintech</span> partnerships strengthening service reach and appeal.</p><p><b>Request a Sample Now: </b>https://www.persistencemarketresearch.com/samples/35349</p><p><b><u>Rising Consumer Preference for Flexible Payments</u></b></p><p>The accelerating adoption of BNPL services is closely tied to shifting consumer payment behavior. Modern shoppers, especially Millennials and Generation Z, increasingly prefer interest-free installments and minimal upfront costs, providing a debt-light alternative to traditional credit cards. BNPL's seamless integration into online checkout flows and fast approval processes cater to mobile-first buyers and reduce friction at purchase points. Retailers embedding BNPL options have reported higher conversion rates and larger average basket values, reinforcing its appeal for both buyers and sellers. E-commerce expansion further fuels BNPL demand, especially in high-ticket categories like electronics and fashion, where consumers appreciate the ability to manage payments over time without incurring immediate financial strain. As digital wallets and in-app payment experiences evolve, BNPL is becoming a staple of online shopping journeys and in-store experiences via integrated point-of-sale solutions.</p><p><b><u>Key Highlights</u></b></p><ul type=\"disc\"><li>The buy now pay later market is valued at <money>US$ 48.7 billion</money> in 2026 and projected to reach <money>US$ 212.2 billion</money> by 2033, expanding at a CAGR of 23.4%.</li><li><location value=\"LR/nam\" idsrc=\"xmltag.org\" >North America</location> leads with 31% market share, supported by deep U.S. e-commerce penetration and strong merchant integration across major retail platforms.</li><li><location value=\"LR/asp\" idsrc=\"xmltag.org\" >Asia Pacific</location> is the fastest-growing region, driven by <location value=\"LC/in\" idsrc=\"xmltag.org\" >India's</location> expanding <span>fintech</span> ecosystem, <location value=\"LC/cn\" idsrc=\"xmltag.org\" >China's</location> embedded digital credit infrastructure, and <location value=\"LR/asp\" idsrc=\"xmltag.org\" >Southeast Asia's</location> rising mobile-first consumer base.</li><li>The online channel dominates with 67% share, reflecting BNPL's seamless checkout integration and strong alignment with global e-commerce growth.</li><li>The POS channel is the fastest-growing segment, fueled by QR-based and tap-to-pay BNPL expansion across physical retail, healthcare, and hospitality environments.</li><li>Regulatory developments, particularly in the U.S. and <location value=\"LC/in\" idsrc=\"xmltag.org\" >India</location>, are formalizing digital lending frameworks, strengthening consumer protection and long-term market credibility.</li></ul><p><b><u>Expansion Beyond Traditional Retail</u></b></p><p>While retail remains the dominant end-use segment, BNPL adoption is spreading into new verticals such as automotive services, healthcare financing, and experiential purchases. Automotive dealers and service providers are increasingly enabling installment payments for parts and services, and some healthcare providers are offering BNPL for elective procedures and out-of-pocket medical bills. This diversification broadens the market's addressable base and introduces BNPL to consumer segments previously underserved by short-term credit. Integration with digital identity wallets and super apps is another growth catalyst, promising BNPL accessibility at scale and improved user experiences. Partnerships between BNPL platforms and major e-commerce or payment ecosystems enhance reach and engagement, allowing more consumers to access flexible financing at the point of sale.</p><p><b><u>Key Highlight: PayPal &amp; Rainforest Launch Embedded PayPal Pay Later Integration</u></b></p><ul type=\"disc\"><li>In February, 2026, Rainforest announced the launch of a new embedded payments integration with PayPal, enabling vertical software platforms using Rainforest to seamlessly offer PayPal, Venmo, and PayPal Pay Later (Buy Now Pay Later) within their checkout experience. This integration allows merchants to provide BNPL alongside cards, Apple Pay, and bank-based payment methods through a single implementation.</li><li>The collaboration is designed to help software platforms transition transaction volume away from offline methods such as cash and checks into digital payment flows. By embedding PayPal Pay Later directly into platform checkouts, merchants can provide customers with greater payment flexibility while maintaining a unified and streamlined payment experience.</li><li>A key feature of the integration is its single API and consolidated reporting structure, which eliminates the need for separate onboarding or multiple systems to manage payment methods. Merchants benefit from simplified reconciliation and operational efficiency, while end customers gain access to trusted and convenient payment options within one seamless interface.</li><li>PayPal highlighted vertical software platforms as a strategic growth area, emphasizing that as commerce increasingly moves into software-driven environments, merchants require embedded solutions that deliver choice, convenience, and trust. The integration strengthens PayPal's presence in embedded finance while expanding the reach of its Buy Now Pay Later offering across new digital commerce ecosystems.</li></ul><p>This development signals a continued shift in the Buy Now Pay Later market toward embedded, platform-based distribution models, where BNPL is integrated directly into vertical SaaS ecosystems rather than offered solely through traditional e-commerce channels.</p><p><b>Request For Customization:</b> https://www.persistencemarketresearch.com/request-customization/35349</p><p><b><u>Segmentation Insights: Online Dominates While POS Accelerates In-Store Adoption</u></b></p><p>The online channel leads the global buy now pay later market, accounting for approximately 67% of market share, driven by deep integration within e-commerce checkout ecosystems and seamless API embedding across merchant platforms. Digital-native providers such as Klarna, Afterpay, <org>Affirm, Inc.</org>, and Zip Co., Ltd. continue expanding partnerships with global retailers to reduce the nearly 70% average cart abandonment rate through instant credit approvals and frictionless installment displays at checkout. The point-of-sale (POS) channel is the fastest-growing segment, gaining traction across physical retail, healthcare billing, and hospitality through QR-based and tap-to-pay BNPL integrations. Recent omnichannel expansion strategies by major providers to unify online and in-store installment visibility are accelerating adoption, positioning POS as a critical next-phase growth lever.</p><p><b><u>Regional Insights: North America Dominates While Asia Pacific Accelerates Digital Credit Expansion</u></b></p><p><location value=\"LR/nam\" idsrc=\"xmltag.org\" >North America</location> leads the market, accounting for approximately 31% of market share, driven primarily by <location value=\"LC/us\" idsrc=\"xmltag.org\" >the United States'</location> vast e-commerce transaction base exceeding <money>US$ 1 trillion</money> annually. Deep merchant penetration across major online and offline retailers, combined with strong competitive presence from providers such as <org>Affirm, Inc.</org>, PayPal (Pay Later), and <org>Perpay Inc.</org>, reinforces regional leadership. Regulatory clarity from the <org>Consumer Financial Protection Bureau</org> under evolving Truth in Lending Act interpretations is strengthening consumer confidence, supporting structured and sustainable long-term growth across the region. <location value=\"LR/asp\" idsrc=\"xmltag.org\" >Asia Pacific</location> is the fastest-growing BNPL region, projected to expand at a CAGR significantly above the global average through 2033, fueled by mobile-first commerce ecosystems and large underbanked populations. <location value=\"LC/cn\" idsrc=\"xmltag.org\" >China's</location> embedded digital credit infrastructure, led by <org>Ant Group</org> and JD.com, anchors transaction volume, while <location value=\"LC/in\" idsrc=\"xmltag.org\" >India's</location> rapidly expanding <span>fintech</span> ecosystem, supported by regulatory oversight from the <org>Reserve Bank of India</org>, is driving formalization and adoption. Southeast Asian markets including <location value=\"LC/id\" idsrc=\"xmltag.org\" >Indonesia</location>, <location value=\"LC/vn\" idsrc=\"xmltag.org\" >Vietnam</location>, and <location value=\"LC/ph\" idsrc=\"xmltag.org\" >the Philippines</location> are witnessing accelerated uptake as smartphone penetration rises and first-time credit access expands through mobile-centric BNPL platforms.</p><p><b>Market Segmentation</b></p><p><b>By Channel</b></p><ul type=\"disc\"><li>Online</li><li>POS (Point of Sale)</li></ul><p><b>By End-user</b></p><ul type=\"disc\"><li>Retail<br />- Consumer Electronics<br />- Fashion and Garment<br />- Others</li></ul><ul type=\"disc\"><li>Healthcare</li><li><org>Leisure and Entertainment</org></li><li>Automotive</li><li>Others</li></ul><p><b>By Enterprise Size</b></p><ul type=\"disc\"><li><org>Large Enterprises</org></li><li><org>Small and Medium Enterprises</org></li></ul><p><b>Buy Now: </b>https://www.persistencemarketresearch.com/checkout/35349</p><p><b><u>Key Players and Business Strategies</u></b></p><p>Leading players in the buy now pay later market include <org>Afterpay Limited</org>, <org>Affirm, Inc.</org>, PayPal Holdings, Inc., <org>Klarna Inc.</org>, and <org>Splitit Payments, Ltd</org>, <org>Klarna Inc.</org>, Openpay, <org>HSBC Group</org>, <org>LatitudePay Financial Services</org>, Zip Co., Ltd., Slice, OlaMoney Postpaid, Simpl, MobiKwik ZIP, Amazon Pay Later, Sezzle Inc., <org>Paidy Inc.</org> (PayPal), <org>Laybuy Group Holdings</org>, Scalapay S.r.l., Tabby</p><ul type=\"disc\"><li>Afterpay and Affirm focus on expanding merchant integrations and consumer reach through partnerships with major retailers.</li><li>PayPal leverages its broad payments ecosystem to embed BNPL options for millions of existing users.</li><li>Klarna invests in brand partnerships and personalized financial experiences to strengthen user engagement.</li><li>Splitit emphasizes flexible installment solutions without new credit accounts, appealing to credit-averse consumers.</li></ul><p>Strategies across the sector emphasize technological integration, merchant network expansion, regional localization, and enhanced risk management to balance growth with financial sustainability.</p><p><u>𝐄𝐱𝐩𝐥𝐨𝐫𝐞 </u><u>𝐑𝐞𝐥𝐚𝐭𝐞𝐝 </u><u>𝐑𝐞𝐩𝐨𝐫𝐭𝐬 &amp; </u><u>𝐆𝐚𝐢𝐧 </u><u>𝐃𝐞𝐞𝐩𝐞𝐫 </u><u>𝐈𝐧𝐬𝐢𝐠𝐡𝐭𝐬:</u><br />Consumer Mobile Payments Market by Mode of Payment (Remote, Proximity), Technology (Near Field Communication, Direct Mobile Billing, Mobile Web Payment, USSD, QR Codes, Other), End-use Industry (<org>Retail, Hospitality &amp; Tourism</org>, IT &amp; Telecommunication, BFSI, <org>Media &amp; Entertainment</org>, Healthcare, Airline, Others), and Regional Analysis for 2026-2033</p><p>Online Payment <span>Fraud</span> Detection Market by Component (Solutions, Services), Deployment (On-premises, Cloud-based), Vertical (BFSI, IT and Telecom, Retail and Consumer Packaged Goods, Government, Real Estate and Construction), and Regional Analysis</p><p>Super <person>Apps Market</person> by Service Offering (Payments, Financial Services, E-Commerce, Food Delivery, Messaging &amp; Social, Government Services, Others), Platform (Monolithic Apps, Mini-App Platforms, Aggregator Models, White-Label Platforms), End-User (Consumers, Small &amp; Medium Businesses, <org>Large Enterprises</org>, Government Entities), and Regional Analysis for 2026 - 2033</p><p>Mobile Payment Transaction Market by Technology (Near Field Communication, Direct Mobile Billing, Mobile Web Payment, USSD, QR Codes, Other), Application (Merchandise, Money Transfer, <person>Bill Payment</person>, Ticketing, Other), and Regional Analysis for 2025 - 2032</p><p>Banking as a Service Market by Component (Platform, API), Enterprise Size (Small, Large, Medium), End-user (Banking and Financial Institutions, <span>Fintech</span> Companies), and Regional Analysis for 2025 - 2032</p><p>Embedded Banking Services Market by Deployment Mode (Cloud, On-Premises), Application (Payment Processing, Lending Services, Investment Management, Insurance Services), End-use (Financial Institutions, Retailers, <org>Small and Medium Enterprises</org>, Technology Companies), and Regional Analysis for 2025 - 2032</p><p>Smart Cities Market by Component (Hardware, Software, Services), Application (Smart Security, <location>Smart Building</location>, Smart Transportation, Smart Governance, Smart Energy, <org>Smart Healthcare</org>, Smart Education), and Regional Analysis for 2025 - 2032</p><p>Digital Commerce Applications Market by Solution Type (Online Storefront / eCommerce Platform, Mobile Commerce Application, Marketplace Solutions, Digital Payments Integration, Order Management (OMS), Customer Experience &amp; Personalization, Security &amp; <span>Fraud</span> Prevention, Misc.), Enterprise Size (<org>Large Enterprises</org>, <org>Small &amp; Medium Enterprises</org> (SMEs)), Deployment Mode (Cloud, On-Premises, Hybrid), End Use Industry (Retail &amp; eTail, Consumer Goods, BFSI, Telecom &amp; IT Services, Healthcare &amp; Pharmaceuticals, Manufacturing, Misc.) and Regional Analysis for 2026 - 2033</p><p>Mobile Payment Technologies Market by Technology Type (Near Field Communication, Direct Mobile Billing, Mobile Web Payment, USSD, QR Codes, Other), Industry (Hospitality and Tourism Sector, BFSI, <org>Media and Entertainment</org>, Retail Sector, Health care, Education, IT &amp; Telecommunication, Others), and Regional Analysis for 2026 - 2033</p><p>Europe Gift Card Market by Product Type (E-gift Cards, Physical Cards), Functional Attribute (<location>Closed Loop</location>, <location>Universal Accepted Open Loop</location>), Industry Vertical (Retail, Corporate Institutions), Merchant, and Country Analysis for 2025 – 2032</p><p><b>About Persistence Market Research</b>:</p><p>At <org>Persistence Market Research</org>, we are pioneers in <org>Market Research</org> and Consulting, bringing you the most dynamic insights into market trends, consumer behaviors, and competitive intelligence! For over a decade, we've been at the forefront of delivering game-changing analytics and research that drive businesses toward growth.</p><p>Our extensive market report database is a go-to resource for Fortune 500 companies, savvy business investors, media and entertainment channels, and academic institutions, empowering them to navigate the global and regional business landscape with confidence. With thousands of statistics and in-depth analyses covering over 20 diverse industries across 25 major countries, we provide the insights you need to succeed in today's competitive environment.</p><p><b>Contact<br /></b><person>Ritika Khandelwal</person><br /><org>Persistence Market Research</org><br />Second Floor, <location>150 Fleet Street</location>, <location value=\"LU/gb.eng.london\" idsrc=\"xmltag.org\" >London</location>, EC4A 2DQ<br />+44 203-837-5656<br /><location value=\"LC/gb\" idsrc=\"xmltag.org\" >United Kingdom</location><br /><location value=\"LC/us\" idsrc=\"xmltag.org\" >USA</location> Phone - +1 646-878-6329<br />Email: sales@persistencemarketresearch.com</p><p>Logo: https://mma.prnewswire.com/media/2876873/Persistence_Market_Research_Logo.jpg </p>\n\n\n\n<p id=\"PURL\"><img title=\"Cision\" width=\"12\" height=\"12\" alt=\"Cision\" src=\"https://edge.prnewswire.com/c/img/favicon.png?sn=IO96681&amp;sd=2026-02-26\" /> View original content to download multimedia:https://www.prnewswire.com/news-releases/buy-now-pay-later-market-to-reach-us-212-2-billion-by-2033-expands-amid-digital-commerce-growth-and-consumer-preference-shifts--persistence-market-research-302698606.html</p><p>SOURCE <org>Persistence Market Research Pvt. Ltd.</org></p></div>\n",
            "link": "https://www.fidelity.com/news/article/technology/202602261103PR_NEWS_USPR_____IO96681",
            "pub_date": "2026-02-27 00:03:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Moso Networks Sets the Pace for Private 5G Deployment at MWC Barcelona 2026",
            "description": "\n<div class=\"xn-content\">\n<p class=\"prntac\"><i>Market-leading new features, proven deployments, and premium capabilities</i></p><p><span class=\"legendSpanClass\"><location value=\"LU/us.ca.sacmto\" idsrc=\"xmltag.org\" >SACRAMENTO, Calif.</location></span>, <span class=\"legendSpanClass\"><chron>Feb. 26, 2026</chron></span> /PRNewswire/ -- Moso Networks, a leader in private 5G infrastructure and management solutions, today announced its participation in MWC Barcelona 2026 Booth CS34, where it will demonstrate how private 5G has moved decisively from proof of concept to production—powered by real-world deployments and market-leading innovation.</p>\n    <div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder1\">\n                <p>\n\n                    <img src=\"https://mma.prnewswire.com/media/2921364/MosoLabs_Moso_Networks_5G_outdoor_small_cell.jpg\" title=\"Moso Networks' next generation 5G outdoor (5GOD2) small cell for private networks.\" alt=\"Moso Networks' next generation 5G outdoor (5GOD2) small cell for private networks.\" />\n\n                </p>\n    </div>\n<p>Industry analysts see private 5G as one of the fastest-growing enterprise networking segments, with forecasts as high as <money>$8 billion</money> in annual spend by 2026, representing 30%–45% year-over-year growth as deployments move from trials to mission-critical operations.</p><p>As this transition accelerates, Moso Networks is taking a leadership position—delivering advanced private 5G capabilities that are deployable today, accessible by businesses of any size, proven in the field, and built for real enterprise operations.</p><p><b>Market-Leading Private 5G Solutions—First to Market, Built to Scale<br /></b>Moso Networks set the early pace in private 5G innovation — delivering the industry's first Qualcomm<sup>®</sup>-based 3GPP Release 16 small cells purpose-built specifically for enterprise private networks, followed by Chorus – developed together with Ataya – the first AP-only private 5G solution designed to simplify deployment and accelerate enterprise adoption by eliminating traditional cellular complexity.</p><p>Building on its private 5G leadership, Moso delivers advanced capabilities engineered for production-scale, mission-critical deployments — combining predictable performance, spectrum flexibility, and operational resilience in a streamlined, cost-efficient architecture.</p><ul type=\"disc\"><li><b>5G LAN (3GPP Release 16)</b> – Enables enterprise LAN services over 5G with traffic segmentation, local switching, and seamless VLAN integration.</li><li><b>Network Slicing</b> – Delivers application-aware traffic isolation with dedicated QoS and resource prioritization for critical workloads.</li><li><b>Dual-Carrier n77 + CBRS Support in a Single Small Cell</b> – Supports simultaneous licensed and CBRS operation to increase flexibility and capacity.</li><li><b>CBRS SAS Grant Backup &amp; Fast Failover</b> –Improves spectrum resiliency and operational continuity in challenging CBRS environments</li><li><b>Integrated Spectrum Analyzer</b> – Provides built-in spectrum visibility and interference detection to speed deployment and site validation.</li></ul><p>Together, these capabilities reinforce Moso's position as a technology leader—delivering premium private 5G features without the premium price tag.</p><p><b>From Pilot to Production: Private 5G Proven in the Field</b></p><p>In Booth CS34, Moso Networks will highlight live, production deployments that demonstrate how private 5G delivers measurable outcomes when designed for simplicity, reliability, and operational scale.</p><ul type=\"disc\"><li>Mission-critical connectivity at <b><location>Tucson International Airport</location></b></li><li>Industrial operations at the <b><location>Port of Tacoma</location></b></li><li>Streaming for live broadcasting at the <b>Kentucky Derby</b></li></ul><p>These deployments reinforce a critical industry truth: private 5G succeeds through ecosystem collaboration where companies innovate and combine radios, core software, systems integration, and operational expertise.</p><p>In addition to these deployments, Moso's solutions will be showcased with other partners including:</p><ul type=\"disc\"><li>Ataya – Chorus, powered by Moso Networks radios, is the simplest, fastest and most economical way to deploy Private 5G. With a P5G access point (Moso radio + Ataya data plane core function) and an Internet connection, this easily scales from small to large enterprise deployments. <b>Hall5, 5M34R</b></li><li>Canoga Perkins - Canoga Perkins showcases 5G TSN and FRER, delivering mission‑critical connectivity and hitless failover with Private 5G network powered by SyncMetra and Moso Networks radios. <b>Hall 7 Stand 7A22Ex</b></li><li><org>Khasm Labs</org> - The Khasm KEEN Private 5G Solution, powered by <org>Moso Networks and Khasm Labs</org>, delivers a complete, ready-to-go private 5G network in a compact and scalable form factor. <b>Booth CS34</b></li></ul><p>\"At MWC Barcelona 2026, we're showing that private 5G leadership isn't about who talks the loudest—it's about who delivers what matters most: reliable, resilient connectivity across devices, applications, and operations all under your control,\" said <person>Stephen Leotis</person>, founder and CEO of Moso Networks. \"Our customers don't want complexity. They want performance, control, and confidence. That's what Moso delivers.\"</p><p><b>Meet Moso Networks at MWC Barcelona 2026</b></p><p>Visit Moso Networks at MWC Barcelona 2026 Booth CS34 to see how private 5G leaders are deploying advanced capabilities today—without complexity, without surprises, and without compromise.</p><p><b>About Moso Networks<br /></b>Moso Networks is a US-based, leading provider of private 5G and neutral host network solutions designed to meet the needs of businesses and industries worldwide. Leveraging its expertise in wireless communication technology, the company delivers secure, reliable, and innovative hardware and management software that empower organizations to unlock the full potential of private 5G connectivity. For more information, visit www.mosonetworks.com.</p>\n<div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder2\">\n                <p>\n\n                    <img src=\"https://mma.prnewswire.com/media/2219634/MosoLabs_logo_Logo.jpg\" title=\"MosoLabs logo (PRNewsfoto/MosoLabs)\" alt=\"MosoLabs logo (PRNewsfoto/MosoLabs)\" />\n\n                </p>\n</div>\n\n\n\n<p id=\"PURL\"><img title=\"Cision\" width=\"12\" height=\"12\" alt=\"Cision\" src=\"https://edge.prnewswire.com/c/img/favicon.png?sn=NE96797&amp;sd=2026-02-26\" /> View original content to download multimedia:https://www.prnewswire.com/news-releases/moso-networks-sets-the-pace-for-private-5g-deployment-at-mwc-barcelona-2026-302698623.html</p><p>SOURCE MosoLabs</p></div>\n",
            "link": "https://www.fidelity.com/news/article/technology/202602261111PR_NEWS_USPR_____NE96797",
            "pub_date": "2026-02-27 00:11:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "European Equities Traded in the US as American Depositary Receipts Sharply Lower in Thursday Trading",
            "description": "\n<p><chron>11:02 AM EST</chron>, <chron>02/26/2026</chron> (MT Newswires) -- European equities traded in the US as American depositary receipts were sharply lower late Thursday morning, declining 1.10% to 1,842.23 on the S&amp;P Europe Select ADR Index.</p><p>From continental <location value=\"LR/eur\" idsrc=\"xmltag.org\" >Europe</location>, the gainers were led by internet browser company Opera (OPRA) and software firm SAP (SAP), which climbed 22% and 3.6%, respectively. They were followed by oil and gas company Eni (E) and accommodations booking site trivago (TRVG), which advanced 1.7% and 1.2%, respectively.</p><p>The decliners from continental <location value=\"LR/eur\" idsrc=\"xmltag.org\" >Europe</location> were led by biopharmaceutical companies <org value=\"CLLS.NaE\" idsrc=\"xmltag.org\" >Cellectis</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='CLLS' fmr-param-security-type='Equity'>( CLLS )</span>  and argenx (ARGX), which dropped 5.4% and 5.1%, respectively. They were followed by biopharmaceutical company <org value=\"DBVT.NaE\" idsrc=\"xmltag.org\" >DBV Technologies</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='DBVT' fmr-param-security-type='Equity'>( DBVT )</span>  and semiconductor company <org value=\"SQNS.NaE\" idsrc=\"xmltag.org\" >Sequans Communications</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='SQNS' fmr-param-security-type='Equity'>( SQNS )</span> , which lost 2.8% and 1.9%, respectively.</p><p>From the UK and <location value=\"LC/ie\" idsrc=\"xmltag.org\" >Ireland</location>, the gainers were led by communications company <org value=\"WPP.NaE\" idsrc=\"xmltag.org\" >WPP</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='WPP' fmr-param-security-type='Equity'>( WPP )</span>  and software firm <org value=\"DAVA.NaE\" idsrc=\"xmltag.org\" >Endava</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='DAVA' fmr-param-security-type='Equity'>( DAVA )</span> , which rose 5.6% and 3.8%, respectively. They were followed by biopharmaceutical company <org value=\"BDRX.NaE\" idsrc=\"xmltag.org\" >Biodexa Pharmaceuticals</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='BDRX' fmr-param-security-type='Equity'>( BDRX )</span>  and cruise line operator Carnival (CUK), which was up 2.7% and 2.5%, respectively.</p><p>The decliners from the UK and <location value=\"LC/ie\" idsrc=\"xmltag.org\" >Ireland</location> were led by biopharmaceutical companies <org value=\"MREO.NaE\" idsrc=\"xmltag.org\" >Mereo BioPharma Group</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='MREO' fmr-param-security-type='Equity'>( MREO )</span>  and <org value=\"BCYC.NaE\" idsrc=\"xmltag.org\" >Bicycle Therapeutics</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='BCYC' fmr-param-security-type='Equity'>( BCYC )</span> , which fell 3.5% and 2.6%, respectively. They were followed by biopharmaceutical company <org value=\"AMRN.NaE\" idsrc=\"xmltag.org\" >Amarin</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AMRN' fmr-param-security-type='Equity'>( AMRN )</span>  and telecommunications operator <org value=\"VOD.NaE\" idsrc=\"xmltag.org\" >Vodafone Group</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='VOD' fmr-param-security-type='Equity'>( VOD )</span> , which were down 2.5% and 1.9%, respectively.</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/international/202602261102MIDNIGHTUSEQUITY_A3573795",
            "pub_date": "2026-02-27 00:02:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Market Chatter: Barclays, Apollo's Atlas Among Firms With Exposure to Collapsed UK Lender MFS",
            "description": "\n<p><chron>11:13 AM EST</chron>, <chron>02/26/2026</chron> (MT Newswires) -- <org value=\"BCS.NaE\" idsrc=\"xmltag.org\" >Barclays</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='BCS' fmr-param-security-type='Equity'>( BCS )</span>  and <org>Atlas SP Partners</org>, the structured-credit arm of <org value=\"APO.NaE\" idsrc=\"xmltag.org\" >Apollo Global Management</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='APO' fmr-param-security-type='Equity'>( APO )</span> , each lent hundreds of millions of dollars to Market Financial Solutions, a UK mortgage-finance company that went into insolvency Wednesday, <org>Bloomberg</org> reported Thursday, citing people familiar with the matter.</p><p><org>Banco Santander (SAN) and Castlelake LP</org> also made loans to MFS, which unraveled amid allegations of financial irregularities, the people reportedly told <org>Bloomberg</org>.</p><p><org value=\"BCS.NaE\" idsrc=\"xmltag.org\" >Barclays</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='BCS' fmr-param-security-type='Equity'>( BCS )</span>, Apollo and Santander didn't immediately reply to requests for comment from MT Newswires.</p><p>(Market Chatter news is derived from conversations with market professionals globally. This information is believed to be from reliable sources but may include rumor and speculation. Accuracy is not guaranteed.)</p><p>Price: 25.49, Change: -0.15, Percent Change: -0.57</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602261113MIDNIGHTUSEQUITY_A3573805",
            "pub_date": "2026-02-27 00:13:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "--Street Color: PayPal, Stripe Not Currently in Discussions, Semafor Reports",
            "description": "\n<p><chron>11:14 AM EST</chron>, <chron>02/26/2026</chron> (MT Newswires) --</p><p>Price: 46.25, Change: -1.05, Percent Change: -2.21</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602261114MIDNIGHTUSEQUITY_A3573828",
            "pub_date": "2026-02-27 00:14:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CoreSite Miami and Virginia Data Centers Welcome New Community IX Internet Exchanges",
            "description": "\n<p class=\"bwalignc\">\n<i>Internet Exchange Provider Establishes FL-IX and CIX-NoVA Internet Exchanges in CoreSite Facilities, Expanding Reach in Southeastern U.S. Markets</i>\n\n</p>\n<p>    <location value=\"LU/us.co.denver\" idsrc=\"xmltag.org\" >DENVER</location>--(BUSINESS WIRE)--\nCoreSite, an <org value=\"AMT.NaE\" idsrc=\"xmltag.org\" >American Tower</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AMT' fmr-param-security-type='Equity'>( AMT )</span> company empowering critical business and AI workloads that impact everyday life through interconnected data center solutions, today announced Community IX, the largest member-run Internet Exchange Provider on the <location>East Coast</location> of the U.S., will establish its Florida Internet Exchange (FL-IX) and Northern Virginia Internet Exchange (CIX-NoVA) in the data center operator’s <location value=\"LU/us.fl.miami\" idsrc=\"xmltag.org\" >Miami</location> (MI1) and <location value=\"LS/us.va\" idsrc=\"xmltag.org\" >Northern Virginia</location> (VA1) facilities to provide efficient, ubiquitous and transparent Internet exchange services. The presence of FL-IX and CIX-NoVA in strategic CoreSite facilities will expand interconnection capabilities for Community IX members in these high-impact regions that enable Internet service providers (ISPs), content providers and enterprises to quickly, cost effectively and easily exchange IP traffic.\n\n</p><p>\nCoreSite’s colocation services support Community IX’s exchanges to significantly enhance internet infrastructure to potentially lower connectivity costs and improve network performance for businesses, consumers and government agencies. With shared customers, the CoreSite-Community IX collaboration creates a robust connectivity ecosystem, allowing businesses and providers to achieve low-latency, reliable connections via a cross connect. The inclusion of FL-IX and CIX-NoVA in CoreSite’s facilities highlights the companies’ shared commitment to delivering high-performing connections across the Southeastern U.S.\n\n</p><p>\nCIX-NoVA was launched in <chron>August 2025</chron> and marks Community IX’s first presence in <location value=\"LS/us.va\" idsrc=\"xmltag.org\" >Northern Virginia</location>, the world’s largest data center and connectivity market. Service is initially being offered through data centers in <location value=\"LU/us.va.ashurn\" idsrc=\"xmltag.org\" >Ashburn</location> and <location value=\"LU/us.va.reston\" idsrc=\"xmltag.org\" >Reston</location>. FL-IX serves <location value=\"LS/us.fl\" idsrc=\"xmltag.org\" >Southern Florida</location> and is <location value=\"LS/us.fl\" idsrc=\"xmltag.org\" >Florida's</location> largest peering exchange. Both exchanges offer market-leading port pricing for 10G and 100G port speeds in all data center locations, with 400G available in all CIX-NoVA locations and select FL-IX locations.\n\n</p><p>\nThe leading-edge platforms expand CoreSite’s existing relationship with Community IX as the internet exchange provider also operates its Atlanta Internet Exchange (CIX-ATL) in CoreSite’s <location value=\"LU/us.ga.atlnta\" idsrc=\"xmltag.org\" >Atlanta</location> (AT1) facility, providing the same high level of IP traffic exchange in metro <location value=\"LU/us.ga.atlnta\" idsrc=\"xmltag.org\" >Atlanta</location> since 2020.\n\n</p><p>\n“Community IX is committed to improving the quality of interconnection between networks and delivering a cost-effective, community-driven service to our members,” said <person>Randy Epstein</person>, Co-Founder and Executive Director of Community IX. “CoreSite’s trusted infrastructure and expansive customer ecosystem create a strong foundation for our exchange services and support our non-profit approach. This collaboration helps us to provide low-cost, highest quality network interconnections that power businesses and optimize performance.”\n\n</p><p>\nWith internet exchange points deployed in MI1 and VA1, Community IX also gains access to other critical interconnection points, including the NAP of Americas through MI1 and Equinix 41715 Filigree through VA1. CoreSite’s inter-site connectivity also extends access to a broader data center ecosystem, allowing customers that utilize FL-IX and CIX-NoVA via VA1 and MI1 to connect with CoreSite’s other data center environments in <location value=\"LS/us.va\" idsrc=\"xmltag.org\" >Northern Virginia</location>, <location value=\"LU/us.dc.wash\" idsrc=\"xmltag.org\" >Washington, DC</location> and <location value=\"LU/us.fl.miami\" idsrc=\"xmltag.org\" >Miami</location>.\n\n</p><p>\n“CoreSite values partners like Community IX that provide platforms that connect organizations and help build dynamic ecosystems that empower today’s businesses,” said <person>Chris Malayter</person>, VP of Networking and Interconnection at CoreSite. “Our interconnected, reliable facilities ensure the speed and stability of connections that enable businesses to thrive in a fast-paced, modern business landscape.”\n\n</p><p>\nWith the addition of FL-IX and CIX-NoVA in CoreSite’s MI1 and VA1 facilities, Community IX offers 25+ sites in the <location value=\"LS/us.fl\" idsrc=\"xmltag.org\" >Southern Florida</location>, <location value=\"LS/us.va\" idsrc=\"xmltag.org\" >Northern Virginia</location> and <location value=\"LU/us.ga.atlnta\" idsrc=\"xmltag.org\" >Atlanta</location> markets, supporting 225+ connected networks with 35Tbps+ of connected capacity.\n\n</p><p>\n<b><i>About CoreSite</i></b>\n\n</p><p>\nCoreSite, an <org value=\"AMT.NaE\" idsrc=\"xmltag.org\" >American Tower</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AMT' fmr-param-security-type='Equity'>( AMT )</span> company , is a leading interconnection data center platform that empowers businesses to future-proof their digital transformation initiatives. For more than 20 years, CoreSite’s purpose-built, highly interconnected data center campuses and team of experts have delivered the cloud-enabled, resilient and flexible digital ecosystems required for customers to quickly scale and interoperate their businesses to support the increasing demands of critical workloads, like AI and high-density applications. For more information, visit CoreSite.com and follow CoreSite on our Connect[ED] blog, LinkedIn and YouTube channels.\n\n</p><p>\n<b><i>About Community IX</i></b>\n\n</p><p>\nCommunity IX operates the FL-IX and CIX-ATL Internet Exchanges, providing efficient, neutral, and transparent Internet exchange services to network operators throughout the <location value=\"LC/us\" idsrc=\"xmltag.org\" >Southeastern United States</location>. With a mission to enhance the Internet ecosystem through collaboration and cost-effective connectivity, Community IX serves hundreds of networks, including ISPs, content providers, cloud services and enterprise. Combined peak traffic levels currently exceed 5Tbps, with over 30Tbps of port capacity installed.\n\n</p><p>\n<b><i>Forward-Looking Statements</i></b>\n\n</p><p>\nThis press release contains statements about future events and expectations, or “forward-looking statements,” all of which are inherently uncertain. We have based those forward-looking statements on management’s current expectations and assumptions and not on historical facts. These forward-looking statements involve a number of risks and uncertainties. For important factors that may cause actual results to differ materially from those indicated in our forward-looking statements, we refer you to the information set forth under the caption “Risk Factors” in Item 1A of American Tower’s most recent annual report on Form 10-K, and other risks described in documents <org value=\"AMT.NaE\" idsrc=\"xmltag.org\" >American Tower</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AMT' fmr-param-security-type='Equity'>( AMT )</span> subsequently files from time to time with the <org>Securities and Exchange Commission</org>. Neither we nor <org value=\"AMT.NaE\" idsrc=\"xmltag.org\" >American Tower</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AMT' fmr-param-security-type='Equity'>( AMT )</span> undertake any obligation to update the information contained in this press release to reflect subsequently occurring events or circumstances.\n\n</p><p><img alt=\"\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20260226624759r1&amp;sid=acqr8&amp;distro=nx&amp;lang=en\" style=\"width:0;height:0\" /><span class=\"bwct31415\" /></p><p id=\"mmgallerylink\"><span id=\"mmgallerylink-phrase\">View source version on businesswire.com: </span><span id=\"mmgallerylink-link\">https://www.businesswire.com/news/home/20260226624759/en/</span></p>\n<p>Source: CoreSite</p>\n",
            "link": "https://www.fidelity.com/news/article/technology/202602261100BIZWIRE_USPR_____20260226_BW624759",
            "pub_date": "2026-02-27 00:00:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Breker Verification Systems and Moores Lab AI Partner to Create First AI-Driven SoC Verification Solution",
            "description": "\n<ul type=\"disc\"><li><em>Test Suite Synthesis, agentic AI integration will enable automated specification test generation across range of SoC designs on varied verification platforms</em></li><li><em>AI-driven synthesis verification flow prototype to be demonstrated during DVCon U.S. in March</em></li><li><em>Joint Breker, <org>Moores Lab</org></em> <sup><em>AI</em></sup><em> reception at DVCon U.S. Monday evening followed by AI in verification panel</em><br/></li></ul>  <p><location value=\"LU/us.ca.sanjse\" idsrc=\"xmltag.org\" >SAN JOSE, Calif.</location>, <chron>Feb.  26, 2026</chron>  (GLOBE NEWSWIRE) -- <org>Breker Verification Systems</org> and <org>Moores Lab</org> <sup>AI</sup> today formalized a partnership to create the first AI-driven SoC verification flow integrating Breker’s Trek Test Suite Synthesis with <org>Moores Lab</org> agentic AI technology.</p>  <p>The solution leverages Breker’s vast experience in test generation for complex system design scenarios with the agentic AI VerifAgent™ product from <org>Moores Lab</org> <sup>AI</sup>. It seamlessly enables automated multicore, multitool, C or transaction level modeling (TLM) test generation for complex SoC scenarios from manually composed specifications.</p>  <p>The flow uses agentic AI to read a specification and generate appropriate scenario models for test synthesis that will produce combined C and SystemVerilog tests that can be run on simulation and emulation platforms targeting high-coverage SoC scenarios.</p>  <p>A prototype of the AI-driven verification flow will be demonstrated in Breker’s Booth (#203) and the <org>Moores Lab</org> <sup>AI</sup> Booth (#101) during DVCon U.S. <chron>March 2 through March 4</chron> at the <location>Hyatt Regency</location> in <location value=\"LU/us.ca.sanara\" idsrc=\"xmltag.org\" >Santa Clara</location>.</p>  <p>“SoC verification requires highly complex scenario tests that find unpredictable corner cases across advanced, multi-core architectures,” says <person>David Kelf</person>, CEO of Breker Verification Systems. “The Moores Lab <sup>AI</sup> VerifAgent technology is an excellent complement to our proven Trek synthesis products that leverages our deep verification experience to drive the first AI SoC verification solution.”</p>  <p>“Breker has long been a pioneer in portable stimulus and system-level verification innovation,” notes Shelly Henry, CEO of <org>Moores Lab</org><sup> AI</sup>. “Integrating VerifAgent with the Breker solutions creates a powerful synergy that enables engineering teams to verify increasingly complex silicon much faster and with greater confidence. We’re excited to partner with Breker to bring AI-driven transformation to SoC-level verification workflows.” </p>  <p><strong>Combining Test Suite Synthesis with Agentic AI</strong><br/>Test Suite Synthesis generates high coverage tests efficiently for complex SoC-specific scenarios using various verification approaches, while agentic AI can accelerate the understanding of specifications to automatically derive verification plans and scenario models.</p>  <p>Combining the two can drive an automated verification solution that enables test generation for complex SoC scenarios from a manually composed specification that may be applied across a broad range of designs on varied verification platforms.</p>  <p><strong>Availability</strong><br/>The AI-driven verification flow will be developed throughout 2026.</p>  <p>For more information, visit: http://www.breker.com or info@brekersystems.com, or www.mooreslab.ai or info@mooreslab.ai.</p>  <p><strong><org>Breker and Moores Lab</org></strong><sup><strong> AI</strong></sup> <strong>at DVCon U.S. </strong><br/>In addition to the AI-driven verification flow prototype, Breker will exhibit and demonstrate its RISC-V CoreAssurance and SoCReady SystemVIP and Trek Test Suite Synthesis solutions at DVCon U.S. To arrange a demonstration or private meeting, send email to info@brekersystems.com.</p>  <p><org>Moores Lab</org><sup> AI</sup> will showcase the VerifAgent product and discuss its product roadmap for agentic AI-driven silicon engineering at DVCon U.S. Email info@mooreslab.ai to schedule an on-site meeting.</p>  <p>On <chron>Monday, March 2</chron>, <org>Breker and Moores Lab</org> <sup>AI</sup> will host an evening reception at DVCon in the <location>Hyatt Regency Hotel Cypress</location> room beginning at <chron>6:30 p.m.</chron> and followed by a panel discussion on AI-driven SoC verification.</p>  <p><strong>About Breker Verification Systems</strong><br/>Breker Verification Systems solves complex semiconductor challenges across the functional verification process from streamlining UVM-based testbench composition to execution for IP block verification, significantly enhancing SoC integration and firmware verification with automated solutions that provide test content portability and reuse. Breker’s solutions include a SystemVIP library of scenarios for RISC-V and Arm, core and SoC testing, coherency, security and other critical areas. Breker solutions easily layer into existing environments and operate across simulation, emulation, prototyping, and post-silicon execution platforms. Its Trek family is production-proven at leading semiconductor companies worldwide and enables design managers and verification engineers to realize measurable productivity gains, speed coverage closure and easy verification knowledge reuse. As a leader in the development of the Accellera Portable Stimulus Standard (PSS), privately held Breker has a reputation for dramatically reducing verification schedules in advanced development environments. Case studies that feature Analog Devices, Broadcom, IBM and other companies leveraging Breker’s solutions are available on the Breker website.</p>  <p><strong>Engage with Breker at:</strong><br/><strong>Website:</strong> https://www.brekersystems.com/<br/><strong>LinkedIn:</strong> https://www.linkedin.com/company/breker-verification-systems/<br/><strong>X:</strong> @BrekerSystems</p>  <p><strong>About <org>Moores Lab</org></strong> <sup><strong>AI</strong></sup><br/><org>Moores Lab</org> <sup>AI</sup> is building the next generation of AI tools for semiconductor design and verification. Its agentic AI platform transforms the chip development lifecycle by drastically reducing engineering time and cost, without changing existing flows, tools, or documentation. <org>Moores Lab</org> <sup>AI</sup> is headquartered in <location value=\"LU/us.tx.austin\" idsrc=\"xmltag.org\" >Austin, Texas</location>, and proudly develops its products entirely in the United States. </p>  <p>For more information, visit www.mooreslab.ai or on social media:<br/>LinkedIn: https://www.linkedin.com/company/mooreslabai/<br/>X: @MooresLabAI</p>  <p><em>TrekSoC, TrekSoC-Si, TrekBox and SoC Scenario Modeling are trademarks of Breker Verification Systems. Breker Verification Systems acknowledges trademarks or registered trademarks of other organizations for their respective products.</em></p>  <p>For more information, contact:<br/><person>Nanette Collins</person><br/>Public Relations for Breker Verification Systems<br/>nanette@nvc.com</p>  <p><person>Shelly Henry</person><br/><org>Moores Lab</org><sup> A</sup><sup>I</sup><br/>media@mooreslab.ai</p>  Image: https://www.globenewswire.com/newsroom/ti?nf=OTY2MTYyOCM3NDU1NjY1IzIwODk5MTA=  <br/> Image: https://ml.globenewswire.com/media/NGM5OWY4NzUtMDg5OC00MmIyLWJkODYtMDU0Y2QxYTkyNGRkLTExMDE0ODEtMjAyNi0wMi0yNi1lbg==/tiny/Breker-Verification-Systems.png <p> Image: Primary Logo </p>\nSource: Breker Verification Systems\n",
            "link": "https://www.fidelity.com/news/article/technology/202602261100PRIMZONEFULLFEED9661628",
            "pub_date": "2026-02-27 00:00:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Acorn, Provider of Monitoring and Control Solutions for Generators, Cell Towers, Data Centers and Utilities, Hosts Q4 Earnings Call Thursday, March 5 at 11am ET",
            "description": "\n<p><location value=\"LU/us.de.wilmtn\" idsrc=\"xmltag.org\" >WILMINGTON, Del.</location>, <chron>Feb.  26, 2026</chron>  (GLOBE NEWSWIRE) -- <strong>Acorn Energy, Inc.</strong> , provider of remote monitoring and control solutions for critical infrastructure assets, will report its fourth quarter and 2025 results premarket on <chron>Thursday, March 5</chron><sup>th</sup> and host a conference call at <chron>11:00 a.m. ET</chron>.</p>  <p><person>Jan Loeb</person>, President &amp; CEO, and <person>Tracy Clifford</person>, CFO &amp; COO of OmniMetrix, will answer investor questions following their prepared remarks. All investors are encouraged to participate.</p> <table style=\"border-collapse: collapse; width:100%; border-collapse:collapse ;\"><tr><td colspan=\"2\" style=\"max-width:40%; min-width:40%;;vertical-align: top ; \"><strong>Conference Call &amp; Replay</strong><br/></td></tr><tr><td style=\"max-width:40%; width:40%; min-width:40%;;vertical-align: top ; \">Date/Time:</td><td style=\"max-width:60%; width:60%; min-width:60%;;vertical-align: top ; \"><strong><chron>Thursday, March 5th</chron> at </strong><strong><chron>11:00am ET</chron></strong></td></tr><tr><td style=\"vertical-align: top ; \">Dial-in Number:</td><td style=\"vertical-align: top ; \"><strong>1-844-834-0644 </strong>or 1-412-317-5190 (Int'l)</td></tr><tr><td style=\"vertical-align: top ; \">Online Replay/Transcript:</td><td style=\"vertical-align: top ; \">Audio file/transcript will be posted <strong>online here</strong></td></tr><tr><td style=\"vertical-align: top ; \">Questions can also be submitted via email to:</td><td style=\"vertical-align: top ; \">acfn@catalyst-ir.com</td></tr><tr><td style=\"vertical-align: top ; \"> </td><td style=\"vertical-align: top ; \"> </td></tr></table> <p><strong>About Acorn </strong>(www.acornenergy.com) and <strong>OmniMetrix™</strong> (www.omnimetrix.net)<br/>Acorn’s 99%-owned OmniMetrix subsidiary is a pioneer and leader in wireless remote monitoring and control solutions for critical infrastructure including standby generators, cell towers, gas pipelines, data centers and utility networks. OmniMetrix serves tens of thousands of commercial and residential endpoints, including over 25 Fortune/Global 500 companies in sectors including telecom, manufacturing, healthcare, data centers, retail, public transportation, energy distribution and government facilities, as well as residential customers through generator dealers.</p>  <p>OmniMetrix’s industry-leading, cost-effective solutions make critical systems more reliable and also enable automated “demand response” electric grid support via enrolled backup generators.</p> <table style=\"border-collapse: collapse; width:100%; border-collapse:collapse ;\"><tr><td colspan=\"2\" style=\"max-width:11%; min-width:11%;;vertical-align: top ; \"><strong>Engage With Us</strong><br/></td></tr><tr><td style=\"max-width:11%; width:11%; min-width:11%;;vertical-align: top ; \">X:</td><td style=\"max-width:89%; width:89%; min-width:89%;;vertical-align: top ; \">@Acorn_IR and @OmniMetrix</td></tr><tr><td style=\"vertical-align: top ; \">StockTwits:</td><td style=\"vertical-align: top ; \">@Acorn_Energy</td></tr><tr><td style=\"vertical-align: top ; \"> </td><td style=\"vertical-align: top ; \"> </td></tr></table> <p><strong>Investor Relations Contacts</strong><br/>Catalyst IR <br/><person>William Jones</person>, 267-987-2082<br/><person>David Collins</person>, 212-924-9800<br/>acfn@catalyst-ir.com</p>  Image: https://www.globenewswire.com/newsroom/ti?nf=OTY2MjE5NiM3NDU3NDQ2IzIwOTA2NTE=  <br/> Image: https://ml.globenewswire.com/media/ZjIyZTk5YWYtYjgwMi00NjUyLTg2Y2MtMDYwMmIzYjdjOTIwLTExMDIyMjItMjAyNi0wMi0yNi1lbg==/tiny/Acorn-Energy-Inc-.png <p> Image: Primary Logo </p>\nSource: Acorn Energy, Inc.\n",
            "link": "https://www.fidelity.com/news/article/technology/202602261100PRIMZONEFULLFEED9662196",
            "pub_date": "2026-02-27 00:00:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Redwire Shares Are Ripping Higher Today: What's Happening?",
            "description": "\n<p><strong><org value=\"RDW.NaE\" idsrc=\"xmltag.org\" >Redwire Corporation</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='RDW' fmr-param-security-type='Equity'>( RDW )</span></strong> shares were initially trading lower, but have since bounced and are now moving higher Thursday on the heels of the company&#8217;s fourth-quarter financial results.</p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><org value=\"RDW.NaE\" idsrc=\"xmltag.org\" >Redwire</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='RDW' fmr-param-security-type='Equity'>( RDW )</span> shares are powering higher.&#160;What&#8217;s driving RDW stock higher?</li>\n</ul>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Revenue Growth Offsets EPS Miss</strong></h2>\n\n\n\n<p><org value=\"RDW.NaE\" idsrc=\"xmltag.org\" >Redwire</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='RDW' fmr-param-security-type='Equity'>( RDW )</span> reported a loss of <money>58 cents</money> per share, missing the consensus estimate for a <money>19-cent</money> loss. Revenue totaled <money>$108.79 million</money>, beating the consensus estimate of <money>$102.36 million</money>, rising from <money>$69.56 million</money> in the same period last year.</p>\n\n\n\n<p>Fourth-quarter revenue increased 56.4% year-over-year. The company reported a Book-to-Bill ratio of 1.52 for the quarter.</p>\n\n\n\n<p><org value=\"RDW.NaE\" idsrc=\"xmltag.org\" >Redwire</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='RDW' fmr-param-security-type='Equity'>( RDW )</span> ended 2025 with total liquidity of <money>$130.2 million</money>, representing a 103.2% increase over the end of 2024.</p>\n\n\n\n<p>&quot;2025 marked the transformation of <org value=\"RDW.NaE\" idsrc=\"xmltag.org\" >Redwire</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='RDW' fmr-param-security-type='Equity'>( RDW )</span> into an integrated, multi-domain space and defense tech company. This evolution is reflected in our new structure, which we believe will enable us to maintain strong positioning and continue our growth trajectory across both established and rapidly emerging domains,&quot; said CEO <strong><person>Peter Cannito</person></strong>.</p>\n\n\n\n<p>Looking ahead, <org value=\"RDW.NaE\" idsrc=\"xmltag.org\" >Redwire</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='RDW' fmr-param-security-type='Equity'>( RDW )</span> expects full-year revenue in the range of <money>$450 million</money> to <money>$500 million</money> versus estimates of <money>$460.91 million</money>. The company&#8217;s full-year guidance is ahead of expectations at the midpoint, which may be helping boost shares on Thursday.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Redwire Stock Climbs</h2>\n\n\n\n<p><strong>RDW Price Action:</strong> At the time of writing, <org value=\"RDW.NaE\" idsrc=\"xmltag.org\" >Redwire</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='RDW' fmr-param-security-type='Equity'>( RDW )</span> shares are trading 11.72% higher at <money>$9.62</money>, according to data from Benzinga Pro.</p>\n\n\n\n<p><em>Image via Shutterstock</em></p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602261059BENZINGAFULLNGTH50894842",
            "pub_date": "2026-02-26 23:59:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Apple seeks dismissal of fraud lawsuit over Siri AI, Epic injunction",
            "description": "\n<p>*</p>\n<p><org value=\"AAPL.NaE\" idsrc=\"xmltag.org\" >Apple</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AAPL' fmr-param-security-type='Equity'>( AAPL )</span> denies knowingly overstating Siri AI capabilities</p>\n<p></p>\n<p>*</p>\n<p><org value=\"AAPL.NaE\" idsrc=\"xmltag.org\" >Apple</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AAPL' fmr-param-security-type='Equity'>( AAPL )</span> says it didn't guarantee compliance with Epic\ninjunction</p>\n<p></p>\n<p>*</p>\n<p>Claim losses could reach hundreds of billions of dollars</p>\n<p></p>\n<p>*</p>\n<p>Lawyers for sharheolders not available for comment</p>\n<p></p>\n<p>By <person>Jonathan Stempel</person></p>\n<p><chron>Feb 26</chron> (Reuters) - <org value=\"AAPL.NaE\" idsrc=\"xmltag.org\" >Apple</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AAPL' fmr-param-security-type='Equity'>( AAPL )</span> urged a federal judge\nto dismiss a proposed class action claiming it defrauded\nshareholders twice, by overstating the artificial intelligence\ncapabilities of its Siri voice assistant and falsely\nrepresenting its compliance with an injunction governing\ncommissions on app sales.</p>\n<p>In a Wednesday filing in the <location value=\"LU/us.ca.sanjse\" idsrc=\"xmltag.org\" >San Jose, California</location>, federal\ncourt, <org value=\"AAPL.NaE\" idsrc=\"xmltag.org\" >Apple</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AAPL' fmr-param-security-type='Equity'>( AAPL )</span> said there was no proof it knew when discussing AI\nat a <chron>June 2024</chron> conference that it would take longer than\nexpected to incorporate two advanced AI features into Siri,\npotentially hurting iPhone 16 sales.\nThe company delayed some Siri upgrades the following March, and\nChief Executive <person>Tim Cook</person> said two months later that developing a\n&quot;more personal&quot; Siri was &quot;taking a bit longer than we thought.&quot;</p>\n<p><org value=\"AAPL.NaE\" idsrc=\"xmltag.org\" >Apple</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AAPL' fmr-param-security-type='Equity'>( AAPL )</span> also said it provided no assurance that its procedures\ndesigned to comply with a 2021 injunction, in a case brought by\nEpic Games, to let app users pay developers directly rather than\nhave the company charge the developers hefty commissions would\nbe foolproof.</p>\n<p>&quot;It is no secret that <org value=\"AAPL.NaE\" idsrc=\"xmltag.org\" >Apple</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AAPL' fmr-param-security-type='Equity'>( AAPL )</span> faced challenges and weathered\nups and downs in its stock price in 2025, like many major\ncompanies,&quot; <org value=\"AAPL.NaE\" idsrc=\"xmltag.org\" >Apple</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AAPL' fmr-param-security-type='Equity'>( AAPL )</span> said. &quot;But plaintiff takes a massive and\nunsupported leap by claiming that securities fraud caused the\ntemporary price drops.&quot;\nThe lawsuit covers <org value=\"AAPL.NaE\" idsrc=\"xmltag.org\" >Apple</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AAPL' fmr-param-security-type='Equity'>( AAPL )</span> shareholders who suffered potentially\nhundreds of billions of dollars of losses in the <location value=\"LU/us.ca.cupino\" idsrc=\"xmltag.org\" >Cupertino,\nCalifornia</location>-based company's stock between <chron>May 3, 2024</chron> and <chron>May 1,\n2025</chron>, the day after a judge said <org value=\"AAPL.NaE\" idsrc=\"xmltag.org\" >Apple</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AAPL' fmr-param-security-type='Equity'>( AAPL )</span> was violating the\ninjunction.</p>\n<p>Lawyers for shareholders led by <location value=\"LC/kr\" idsrc=\"xmltag.org\" >South Korea's</location> National\nPension Service, the world's third largest pension fund with\nclose to <money>$1 trillion</money> of assets, did not immediately respond to\nrequests for comment.</p>\n<p><org value=\"AAPL.NaE\" idsrc=\"xmltag.org\" >Apple's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AAPL' fmr-param-security-type='Equity'>( AAPL )</span> injunction required the company to provide app users\nwith external links for purchases, so developers wouldn't owe\n30% commissions for purchases in its <org>App Store</org>.\nThe judge overseeing that case rebuked <org value=\"AAPL.NaE\" idsrc=\"xmltag.org\" >Apple</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AAPL' fmr-param-security-type='Equity'>( AAPL )</span> for creating a new\nsystem that charged a 27% commission on some external sales. A\nfederal appeals court partially reversed her sanctions in\nDecember.</p>\n<p>(Reporting by <person>Jonathan Stempel</person> in <location value=\"LU/us.ny.nyc\" idsrc=\"xmltag.org\" >New York</location>; Editing by <person>Franklin\nPaul</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602261059RTRSNEWSCOMBINED_L6N3ZM0WB_1",
            "pub_date": "2026-02-26 23:59:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US STOCKS-S&P 500, Nasdaq fall as Nvidia results fail to impress, stalling tech rally",
            "description": "\n<p>*</p>\n<p>Indexes: Dow up 0.25%, S&amp;P 500 down 0.37%, Nasdaq down\n0.87%</p>\n<p></p>\n<p>*</p>\n<p><org value=\"TTD.NaE\" idsrc=\"xmltag.org\" >Trade Desk</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='TTD' fmr-param-security-type='Equity'>( TTD )</span> plunges after Q1 revenue forecast below\nestimates</p>\n<p></p>\n<p>*</p>\n<p><person>J.M. Smucker</person> jumps on Q3 beat, deal with Elliott</p>\n<p>(Updates after markets open)</p>\n<p>By <person>Shashwat Chauhan</person> and <person>Ragini Mathur</person></p>\n<p><chron>Feb 26</chron> (Reuters) - The S&amp;P 500 and the Nasdaq dipped on\nThursday as the recent rally in technology stocks ground to a\nhalt with <org value=\"NVDA.NaE\" idsrc=\"xmltag.org\" >Nvidia</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NVDA' fmr-param-security-type='Equity'>( NVDA )</span> declining despite its stellar quarterly\nresults, reigniting concerns regarding the AI trade.</p>\n<p><org value=\"NVDA.NaE\" idsrc=\"xmltag.org\" >Nvidia</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NVDA' fmr-param-security-type='Equity'>( NVDA )</span> dropped 3.6% despite posting\nbetter-than-expected results for the January quarter and\nforecasting current-quarter revenue above market estimates.</p>\n<p>&quot;Investors have been wary of the AI trade and its\nimplications as we look out over the next couple of years and\neven though <org value=\"NVDA.NaE\" idsrc=\"xmltag.org\" >Nvidia</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NVDA' fmr-param-security-type='Equity'>( NVDA )</span> did deliver strong numbers, it wasn't enough\nto convince investors to push the stock higher,&quot; said <person>Jeff\nSchulze</person>, head of economic and market strategy at ClearBridge\nInvestments.</p>\n<p>The Philadelphia SE Semiconductor Index lost 3% after\nhitting a record high in the last session, while most megacap\nand growth stocks were lower with Alphabet among the\nbiggest decliners, down 2.2%.</p>\n<p>Meanwhile, the S&amp;P 500 software and services index\ngained 2%, rebounding as <org value=\"CRM.NaE\" idsrc=\"xmltag.org\" >Salesforce</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='CRM' fmr-param-security-type='Equity'>( CRM )</span> climbed\n3% despite guiding fiscal 2027 revenue below <location>Wall Street</location>\nexpectations.</p>\n<p>Several sectors including software, financial brokerage,\ndata analytics and legal services, real estate services and\ntrucking clocked heavy losses earlier this year amid growing AI\ndisruption fears.</p>\n<p>The S&amp;P 500 and the Nasdaq closed at two-week\nhighs on Wednesday, fueled by a rally in heavyweight technology\nstocks.</p>\n<p>At <chron>10:11 a.m. ET</chron>, the Dow Jones Industrial Average\nrose 121.68 points, or 0.25%, to 49,603.83, the S&amp;P 500\nlost 25.72 points, or 0.37%, to 6,920.41 and the Nasdaq\nComposite lost 201.10 points, or 0.87%, to 22,950.98.</p>\n<p>The information technology index and the\ncommunication services index were the biggest\ndecliners among the 11 major S&amp;P sectors.</p>\n<p>Financials gained 1.4%, helping offset some\nlosses. Big banks including <org value=\"JPM.NaE\" idsrc=\"xmltag.org\" >JPMorgan Chase</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='JPM' fmr-param-security-type='Equity'>( JPM )</span>, <org value=\"BAC.NaE\" idsrc=\"xmltag.org\" >Bank of\nAmerica</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='BAC' fmr-param-security-type='Equity'>( BAC )</span> and <org value=\"WFC.NaE\" idsrc=\"xmltag.org\" >Wells Fargo</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='WFC' fmr-param-security-type='Equity'>( WFC )</span> all rose nearly 1% each.</p>\n<p>Investors also monitored the latest round of U.S.-<location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location>\ntalks in <location value=\"LU/ch..geneva\" idsrc=\"xmltag.org\" >Geneva</location> aimed at resolving their longstanding nuclear\ndispute and averting new U.S. strikes on <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location> following a\nlarge-scale military buildup.</p>\n<p>Crude oil prices were down around 1%, with the energy stocks\nindex down 0.1%.</p>\n<p>February has been a choppy month for U.S. equities, with the\nmain indexes swinging sharply between gains and losses as\nsentiment towards AI and technology stocks waver, with investors\nquestioning if massive planned AI spending is actually paying\noff.</p>\n<p>Among other stocks, <org value=\"TTD.NaE\" idsrc=\"xmltag.org\" >Trade Desk</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='TTD' fmr-param-security-type='Equity'>( TTD )</span> fell 6% after the\nadvertising technology firm forecast first-quarter revenue below\nestimates amid mounting pressure from larger rivals.</p>\n<p><person>J.M. Smucker</person> jumped 6.6% after the Uncrustables\nmaker beat third-quarter profit and sales estimates. The company\nalso said it had appointed two new directors to its board, after\nreaching a &quot;constructive engagement&quot; with investor <org>Elliott\nInvestment Management</org>.</p>\n<p><org value=\"AI.NaE\" idsrc=\"xmltag.org\" >C3.ai</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AI' fmr-param-security-type='Equity'>( AI )</span> fell 16.7% after the software provider forecast\ncurrent-quarter sales below estimates and said it was cutting\n26% of its global workforce.</p>\n<p><org>Celsius Holding</org> jumped 14.3% after the energy drink\nmaker reported fourth-quarter revenue above estimates.</p>\n<p>Advancing issues outnumbered decliners by a 1.17-to-1 ratio\non the <org>NYSE</org> and by a 1.03-to-1 ratio on the Nasdaq.</p>\n<p>The S&amp;P 500 posted 26 new 52-week highs and one new low\nwhile the Nasdaq Composite recorded 54 new highs and 55 new\nlows.\n(Reporting by <person>Shashwat Chauhan</person> and <person>Ragini Mathur</person> in Bengaluru;\nEditing by Devika Syamnath)</p>\n",
            "link": "https://www.fidelity.com/news/article/us-markets/202602261032RTRSNEWSCOMBINED_L4N3ZM1D7_1",
            "pub_date": "2026-02-26 23:32:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Asian Equities Traded in US as ADRs Drop in Thursday Trading",
            "description": "\n<p><chron>10:37 AM EST</chron>, <chron>02/26/2026</chron> (MT Newswires) -- Asian equities traded in the US as American depositary receipts fell Thursday morning with the S&amp;P Asia 50 ADR Index declining 1.7% to 2,942.66.</p><p>From <location value=\"LR/asp\" idsrc=\"xmltag.org\" >North Asia</location>, the gainers were led by LCD maker <org value=\"LPL.NaE\" idsrc=\"xmltag.org\" >LG Display</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='LPL' fmr-param-security-type='Equity'>( LPL )</span>  and pet-focused platform <org value=\"BQ.NaE\" idsrc=\"xmltag.org\" >Boqii</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='BQ' fmr-param-security-type='Equity'>( BQ )</span> , which rose 4% and 3% respectively. They were followed by used car marketplace <org value=\"UXIN.NaE\" idsrc=\"xmltag.org\" >Uxin</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='UXIN' fmr-param-security-type='Equity'>( UXIN )</span>  and casino and resort operator <org value=\"MLCO.NaE\" idsrc=\"xmltag.org\" >Melco Resorts &amp; Entertainment</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='MLCO' fmr-param-security-type='Equity'>( MLCO )</span> , which were up 2.2% and 1.9% respectively.</p><p>The decliners from <location value=\"LR/asp\" idsrc=\"xmltag.org\" >North Asia</location> were led by consumer lender <org value=\"DXF.NaE\" idsrc=\"xmltag.org\" >Eason Technology</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='DXF' fmr-param-security-type='Equity'>( DXF )</span>  and lender <org value=\"CNF.NaE\" idsrc=\"xmltag.org\" >CNFinance</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='CNF' fmr-param-security-type='Equity'>( CNF )</span> , which shed 9.2% and 7.3% respectively. They were followed by online entertainment service iQIYI (IQ) and fashion platform <org value=\"MOGU.NaE\" idsrc=\"xmltag.org\" >MOGU</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='MOGU' fmr-param-security-type='Equity'>( MOGU )</span> , which were down 6.2% and 5.6% respectively.</p><p>From <location value=\"LR/asp\" idsrc=\"xmltag.org\" >South Asia</location>, the gainers were led by IT services provided <org value=\"INFY.NaE\" idsrc=\"xmltag.org\" >Infosys</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='INFY' fmr-param-security-type='Equity'>( INFY )</span>  and tech conglomerate Sea (SE), which advanced 2.6% and 2.2% respectively. They were followed by IT company <org value=\"WIT.NaE\" idsrc=\"xmltag.org\" >Wipro</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='WIT' fmr-param-security-type='Equity'>( WIT )</span>  and telecommunications operator <org value=\"PHI.NaE\" idsrc=\"xmltag.org\" >PLDT</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='PHI' fmr-param-security-type='Equity'>( PHI )</span> , which increased 2.1% and 0.4% respectively.</p><p>The decliners from <location value=\"LR/asp\" idsrc=\"xmltag.org\" >South Asia</location> were led by pharmaceutical company Dr. Reddy's Laboratories (RDY), which dropped 0.8%, followed by lender <org value=\"IBN.NaE\" idsrc=\"xmltag.org\" >ICICI Bank</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='IBN' fmr-param-security-type='Equity'>( IBN )</span>  and telecommunications operator Telekom Indonesia (TLK), which lost 0.4% and 0.3% respectively.</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/international/202602261037MIDNIGHTUSEQUITY_A3573751",
            "pub_date": "2026-02-26 23:37:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "American Airlines Stock Rises On $1 Billion Miami Investment",
            "description": "\n<p><strong><org value=\"AAL.NaE\" idsrc=\"xmltag.org\" >American Airlines Group Inc</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AAL' fmr-param-security-type='Equity'>( AAL )</span></strong> shares are trading higher Thursday morning after the company announced a <money>$1 billion</money> investment to expand its facilities at <strong><location>Miami International Airport</location></strong>. Here&#8217;s what investors need to know.</p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><org value=\"AAL.NaE\" idsrc=\"xmltag.org\" >American Airlines Group</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AAL' fmr-param-security-type='Equity'>( AAL )</span> stock is showing exceptional strength. Why is AAL stock surging?</li>\n</ul>\n\n\n\n<h2 class=\"wp-block-heading\">American Airlines Expands Miami Hub</h2>\n\n\n\n<p><org value=\"AAL.NaE\" idsrc=\"xmltag.org\" >American Airlines</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AAL' fmr-param-security-type='Equity'>( AAL )</span> announced plans to construct a new three-level concourse D extension at <location>Miami International Airport</location>, which will accommodate larger aircraft and include 17 new gates. </p>\n\n\n\n<p>The project is set to break ground in 2027, aiming to enhance customer experience by eliminating outside boarding and facilitating international travel with direct access to customs.</p>\n\n\n\n<p>The investment comes as the airline faces challenges, including rising crude oil prices impacting operational costs. Despite these headwinds, CEO <strong><person>Robert Isom</person></strong> emphasized the project&#8217;s transformational potential for customer experience and operational efficiency.</p>\n\n\n\n<h2 class=\"wp-block-heading\">American Airlines&#8217; Mixed Technicals</h2>\n\n\n\n<p><org value=\"AAL.NaE\" idsrc=\"xmltag.org\" >American Airlines</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AAL' fmr-param-security-type='Equity'>( AAL )</span> has traded in a wide 52-week range, bottoming at <money>$9.07</money> in spring 2025 and later climbing to a high of <money>$16.26</money>. After that rally, the stock pulled back and became choppier into early 2026. </p>\n\n\n\n<p>It's now hovering around its 20-day and 50-day moving averages while staying above the 200-day average, suggesting consolidation within a longer-term uptrend.</p>\n\n\n\n&lt;figure class=&quot;wp-block-image size-large&quot;&gt;<img loading=\"lazy\" decoding=\"async\" width=\"1024\" height=\"829\" src=\"https://editorial-assets.benzinga.com/wp-content/uploads/2026/02/26095810/AAL-price-moving-averages-chart-1024x829.png\" alt=\"\" class=\"wp-image-1329497\" srcset=\"https://editorial-assets.benzinga.com/wp-content/uploads/2026/02/26095810/AAL-price-moving-averages-chart-1024x829.png 1024w,https://editorial-assets.benzinga.com/wp-content/uploads/2026/02/26095810/AAL-price-moving-averages-chart-300x243.png 300w,https://editorial-assets.benzinga.com/wp-content/uploads/2026/02/26095810/AAL-price-moving-averages-chart-768x622.png 768w,https://editorial-assets.benzinga.com/wp-content/uploads/2026/02/26095810/AAL-price-moving-averages-chart.png 1314w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" />&lt;/figure&gt;\n\n\n\n<h2 class=\"wp-block-heading\">Analysts Maintain Bullish AAL Outlook</h2>\n\n\n\n<p><strong>Analyst Consensus &amp; Recent Actions:</strong>&#160;The stock carries a Buy Rating with an&#160;average price target&#160;of <money>$16.64</money>. Recent analyst moves include:</p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>TD Cowen</strong>: Buy (Lowers Target to <money>$17.00</money>) (<chron>Jan. 30</chron>)</li>\n\n\n\n<li><strong>JP Morgan</strong>: Overweight (Raises Target to <money>$22.00</money>) (<chron>Jan. 28</chron>)</li>\n\n\n\n<li><strong>Barclays</strong>: Equal-Weight (Raises Target to <money>$16.00</money>) (<chron>Jan. 12</chron>)</li>\n</ul>\n\n\n\n<h2 class=\"wp-block-heading\">AAL Shares Climb Thursday</h2>\n\n\n\n<p><strong>AAL Price Action:</strong> <org value=\"AAL.NaE\" idsrc=\"xmltag.org\" >American Airlines Group</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AAL' fmr-param-security-type='Equity'>( AAL )</span> shares were up 4.80% at <money>$13.96</money> at the time of publication on Thursday, according to Benzinga Pro data.</p>\n\n\n\n<p><em>Image: Shutterstock</em></p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602261041BENZINGAFULLNGTH50893732",
            "pub_date": "2026-02-26 23:41:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "FTC says Walmart agreed to $100 million judgment to settle deceptive earnings charges",
            "description": "\n<p><location value=\"LU/us.dc.wash\" idsrc=\"xmltag.org\" >WASHINGTON</location>, <chron>Feb 26</chron> (Reuters) - <org value=\"WMT.NaE\" idsrc=\"xmltag.org\" >Walmart</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='WMT' fmr-param-security-type='Equity'>( WMT )</span> has agreed to pay <money>$100 million</money> to settle charges the company caused delivery drivers to lose tens of millions of dollars in earnings, the <org>U.S. Federal Trade Commission</org> said in a statement on Thursday.</p>\n<p>The FTC, along with 11 states, had alleged in a complaint that <org value=\"WMT.NaE\" idsrc=\"xmltag.org\" >Walmart</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='WMT' fmr-param-security-type='Equity'>( WMT )</span> deceived customers by falsely claiming all customer tips would go to drivers and also showed inflated base pay and tip amounts to drivers in its Spark Driver delivery program, according to the statement.</p>\n<p>The FTC also said that in addition to the judgment, <org value=\"WMT.NaE\" idsrc=\"xmltag.org\" >Walmart</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='WMT' fmr-param-security-type='Equity'>( WMT )</span> is barred from further misrepresenting earnings in delivery offers it makes to Spark drivers.</p>\n<p>\"Labor markets cannot function efficiently without truthful and non-misleading information about earnings and other material terms,\" <person>Christopher Mufarrige</person>, Director of the <org>FTC's Bureau of Consumer Protection</org>, said in the statement.</p>\n<p>The FTC warned that protecting workers was a top priority and called on companies offering gig work to be transparent and accurate and implement robust compliance systems.</p>\n<p><org value=\"WMT.NaE\" idsrc=\"xmltag.org\" >Walmart</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='WMT' fmr-param-security-type='Equity'>( WMT )</span> did not immediately respond to a request for comment. </p>\n<p>(Reporting by <person>Daphne Psaledakis</person> and <person>Katharine Jackson</person>; editing by <person>Michelle Nichols</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602261041RTRSNEWSCOMBINED_KBN3PG1YA-OUSBS_1",
            "pub_date": "2026-02-26 23:41:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US weekly jobless claims increase marginally as labor market stabilizes",
            "description": "<p><location value=\"LU/us.dc.wash\" idsrc=\"xmltag.org\" >WASHINGTON</location>, <chron>Feb 26</chron> (Reuters) - The number of Americans filing new applications for jobless benefits increased slightly last week and the unemployment rate appeared to hold steady in February amid a stable labor market.</p>\n<p>The weekly jobless claims report from the <org>Labor Department</org> on Thursday suggested the labor market remained in a &quot;low hire, low fire&quot; state, and supported economists' expectations that the Federal Reserve would not cut interest rates before Fed Chair <person>Jerome Powell's</person> term ends in May. </p>\n<p>The labor market is regaining its footing after hitting a soft patch last year amid uncertainty economists attributed to President <person>Donald Trump's</person> broad tariffs.</p>\n<p>&quot;The data show no sign of the layoffs we would expect in a weakening labor market during the early days of a hypothetical recession,&quot; said <person>Carl Weinberg</person>, chief economist at High Frequency Economics. &quot;That will jolly up traders who believe the Fed will not cut rates anytime soon, given a steady labor market and inflation above target.&quot;</p>\n<p>Initial claims for state unemployment benefits rose 4,000 to a seasonally adjusted  212,000 for the week ended <chron>February 21</chron>. Economists polled by Reuters had forecast 215,000 claims for the latest week. Last week's claims included the Presidents' Day holiday, which could have impacted the data. Still, claims were below the levels seen during the same period last year.</p>\n<p><org>The U.S. Supreme Court</org> last Friday struck down the tariffs, which Trump pursued under a law meant for use in national emergencies. Trump swiftly imposed a 10% global tariff for 150 days to replace some of the emergency duties, before raising the rate to 15% over the weekend.</p>\n<p>Economists said the latest moves created near-term uncertainty, but anticipated minimal economic impact. </p>\n<p>Lingering uncertainty from the since-invalidated import duties was blamed for a general hesitancy among businesses to increase hiring. A rapid adoption of artificial intelligence is adding another layer of caution, economists said.</p>\n<p>LOW HIRING IS THE MOST WORRYING ASPECT</p>\n<p>&quot;The low hiring rate is still the most concerning aspect of the labor market, but the trend in continued claims suggests employers aren't pulling back further,&quot; said <person>Nancy Vanden Houten</person>, lead U.S. economist at Oxford Economics.</p>\n<p>The number of people receiving unemployment benefits after an initial week of aid, a proxy for hiring, dropped 31,000 to a seasonally adjusted 1.833 million during the week ended <chron>February 14</chron>, the claims report showed. The so-called continuing claims covered the period during which the government surveyed households for February's unemployment rate. </p>\n<p>Continued claims rose modestly between the January and February survey weeks. The jobless rate eased to 4.3% in January from 4.4% in December. The Chicago Fed forecast the unemployment rate steady at 4.28% in February, which would round up to 4.3%.</p>\n<p>While the labor market is stabilizing, consumers remain anxious about their employment prospects. </p>\n<p>A survey from the Conference Board this week showed the share of consumers who viewed jobs as &quot;hard to get&quot; increased to a five-year high in February, though households also believed the availability of jobs had improved.</p>\n<p>The median duration of unemployment is near four-year highs, and jobs remain scarce for young college graduates, labor market data shows. Unemployed recent college graduates do not show in the claims data because they have limited or no work history, making them ineligible to file for jobless benefits.</p>\n<p>Continuing claims could be falling because some people have exhausted their eligibility, limited to 26 weeks in most states.</p>\n<p>&quot;The relationship between continuing claims and unemployment is far from airtight, given that the long-term unemployed, new entrants to the labor market, and those re-entering from inactivity, all are ineligible to claim,&quot; said <person>Oliver Allen</person>, senior U.S. economist at Pantheon Macroeconomics. </p>\n<p>Allen added that the Conference Board survey's &quot;hard to get&quot; jobs measure was &quot;a very reliable indicator in the past,&quot; and pointed &quot;to the unemployment rate rising again soon.&quot;</p>\n<p>(Reporting by Lucia Mutikani; Editing by <person>Chizu Nomiyama</person> and <person>Andrea Ricci</person> )</p>\n",
            "link": "https://www.fidelity.com/news/article/us-economy/202602260841RTRSNEWSCOMBINED_KBN3PG1NF-OUSBS_1",
            "pub_date": "2026-02-26 21:41:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Research Alert: CFRA Maintains Strong Buy Opinion On Shares Of Nvidia Corporation",
            "description": "\n<p><chron>05:05 AM EST</chron>, <chron>02/26/2026</chron> (MT Newswires) -- CFRA, an independent research provider, has provided MT Newswires with the following research alert. Analysts at CFRA have summarized their opinion as follows:</p><p>We keep our <money>$250</money> target, on a P/E of ~24x our CY 27 EPS view of <money>$10.31</money>, above peers/below historical. We lift our FY 27 EPS  to <money>$8.15</money> from <money>$7.80</money> and  FY 28  to <money>$10.31</money> from <money>$10.00</money>. We believe that NVDA's growth is being supported by rising hyperscaler capex (over half of sales), but we think investors need to see greater signs of successful AI monetization from its customer base in a year where CEO Jensen Huang sees Agentic AI at an inflection point. The bar undoubtedly increases, as NVDA makes the case that compute equals revenue for their customers to justify the higher spend. We do expect sequential growth to slow in 2H (tougher comps) but think this is already discounted in shares, while Physical AI/Sovereign AI offers long term upside. We no longer assume NVDA will gain considerable traction in <location value=\"LC/cn\" idsrc=\"xmltag.org\" >China</location> while Rubin appears on pace to ramp in 2H. We think investors continue to underestimate NVDA's content growth potential but also acknowledge bottleneck risks from memory/power.</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/investing-ideas/202602260505MIDNIGHTUSEQUITY_A3572921",
            "pub_date": "2026-02-26 18:05:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Musk touts California robotaxis but Tesla does nothing to get permits",
            "description": "<p><location value=\"LU/us.ca.losang\" idsrc=\"xmltag.org\" >LOS ANGELES</location>, <chron>Feb 26</chron> (Reuters) - For more than a year, <person>Elon Musk</person> has repeatedly said Tesla is months away from launching a driverless robotaxi service in <location value=\"LS/us.ca\" idsrc=\"xmltag.org\" >California</location> - once state regulators give their blessing.</p>\n<p>Tesla did nothing to secure that approval in 2025, according to previously unreported state <org>Department of Motor Vehicles</org> records and a state spokesperson. Tesla logged zero miles of autonomous test driving on California roads last year for the sixth year in a row, the records show.</p>\n<p>Documenting test miles is critical in <location value=\"LS/us.ca\" idsrc=\"xmltag.org\" >California's</location> regulatory system for robotaxis, which requires companies to progress through a series of permits before being allowed to operate a driverless ride-hailing service such as Alphabet's Waymo.</p>\n<p>Much of Tesla's <money>$1.5 trillion</money> market value is tied to investors' belief that it will soon operate a vast fleet of robotaxis and sell millions of autonomous-driving software subscriptions. Operating driverless vehicles in <location value=\"LS/us.ca\" idsrc=\"xmltag.org\" >California</location> - the largest U.S. auto market - is a linchpin of those ambitions.</p>\n<p><person>Bryant Walker Smith</person>, a <org>University of South Carolina</org> law professor and autonomous-driving expert who has consulted for the California DMV, said Tesla is implying that \"they are ready and regulators are not,\" while the reality is that \"regulators are ready, and they are not.\"</p>\n<p>Tesla did not respond to requests for comment. On an earnings call in October, Musk told analysts that the company is &quot;paranoid about safety&quot; and that it takes a &quot;cautious approach&quot; to new markets. &quot;We probably could just let it loose in these cities,&quot; he said, &quot;but we just don't want to take a chance.&quot;</p>\n<p>So far, Tesla operates only a small pilot robotaxi service in <location value=\"LU/us.tx.austin\" idsrc=\"xmltag.org\" >Austin, Texas</location>, which has far fewer regulatory barriers than <location value=\"LS/us.ca\" idsrc=\"xmltag.org\" >California</location>.</p>\n<p>In the <location value=\"LU/us.ca.sanfrn\" idsrc=\"xmltag.org\" >San Francisco Bay Area</location>, the company last July started operating what it called a \"robotaxi\" service that was not a robotaxi service at all. Instead, it is a chauffeur service with human drivers who use Tesla's \"Full Self-Driving\" driver-assistance software, which is not fully autonomous, according to the state regulator authorizing the service and Tesla's disclosures to customers.</p>\n<p>In order to operate fully self-driving vehicles in <location value=\"LS/us.ca\" idsrc=\"xmltag.org\" >California</location>, like Waymo, Tesla would first need to obtain permits to test and operate driverless vehicles from the state's <org>DMV and Public Utilities Commission</org>, which regulates commercial ride-hailing.</p>\n<p>Tesla so far has only the entry-level DMV permit, which allows testing driverless vehicles only with a human safety monitor in the driver's seat. A DMV spokesperson said Tesla has not applied for any additional permits.</p>\n<p>Tesla would need to log at least 50,000 miles (80,467 km) of autonomous driving on public roads in <location value=\"LS/us.ca\" idsrc=\"xmltag.org\" >California</location> with a safety driver before applying for a different permit allowing testing without one, according to proposed DMV regulations expected to be finalized later this year.</p>\n<p>Tesla has not logged any miles with state regulators since 2019 and has documented only 562 miles in total since 2016. </p>\n<p>Waymo, by comparison, logged more than 13 million testing miles and secured seven different regulatory approvals between 2014 and 2023, when it received approval to charge passengers for rides in driverless robotaxis. Waymo is one of three companies with <location value=\"LS/us.ca\" idsrc=\"xmltag.org\" >California</location> permits to commercially operate driverless vehicles and the only one approved to operate a robotaxi fleet anything like what Musk envisions.</p>\n<p>In written comments last year, Tesla criticized some of the California DMV's proposed revisions to autonomous-driving rules, questioning the need for testing on state roads and minimum-mile requirements. The company also complained about &quot;overly burdensome reporting requirements&quot; for crashes and other system failures.</p>\n<p>Musk has often suggested <location value=\"LS/us.ca\" idsrc=\"xmltag.org\" >California</location> regulations are the main impediment to deploying robotaxis there. On an <chron>October 2024</chron> earnings call, he said <location value=\"LS/us.ca\" idsrc=\"xmltag.org\" >California</location> has \"quite a long regulatory approval process.\"</p>\n<p>\"I'd be shocked if we don't get approved next year,\" he added, \"but it's just not something we totally control.\"</p>\n<p></p>\n<p>(Reporting by <person>Chris Kirkham</person> in <location value=\"LU/us.ca.losang\" idsrc=\"xmltag.org\" >Los Angeles</location>; Editing by <person>Brian Thevenot</person> and <person>Matthew Lewis</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/top-news/202602260605RTRSNEWSCOMBINED_KBN3PG187-OUSBS_1",
            "pub_date": "2026-02-26 23:40:53",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US weekly jobless claims increase slightly as labor market steadies",
            "description": "<p><location value=\"LU/us.dc.wash\" idsrc=\"xmltag.org\" >WASHINGTON</location>, <chron>Feb 26</chron> (Reuters) - The number of Americans filing new applications for jobless benefits increased slightly last week and the unemployment rate appeared to hold steady in February amid a stable labor market.</p>\n<p>The weekly jobless claims report from the <org>Labor Department</org> on Thursday suggested the labor market remained in a &quot;low hire, low fire&quot; state, and supported economists' expectations that the Federal Reserve would not cut interest rates before Fed Chair <person>Jerome Powell's</person> term ends in May. </p>\n<p>The labor market is regaining its footing after hitting a soft patch last year amid uncertainty economists attributed to President <person>Donald Trump's</person> broad tariffs.</p>\n<p>&quot;The data show no sign of the layoffs we would expect in a weakening labor market during the early days of a hypothetical recession,&quot; said <person>Carl Weinberg</person>, chief economist at High Frequency Economics. &quot;That will jolly up traders who believe the Fed will not cut rates anytime soon, given a steady labor market and inflation above target.&quot;</p>\n<p>Initial claims for state unemployment benefits rose 4,000 to a seasonally adjusted  212,000 for the week ended <chron>February 21</chron>. Economists polled by Reuters had forecast 215,000 claims for the latest week. Last week's claims included the Presidents' Day holiday, which could have impacted the data. Still, claims were below the levels seen during the same period last year.</p>\n<p><org>The U.S. Supreme Court</org> last Friday struck down the tariffs, which Trump pursued under a law meant for use in national emergencies. Trump swiftly imposed a 10% global tariff for 150 days to replace some of the emergency duties, before raising the rate to 15% over the weekend.</p>\n<p>Economists said the latest moves created near-term uncertainty, but anticipated minimal economic impact. </p>\n<p>Lingering uncertainty from the since-invalidated import duties was blamed for a general hesitancy among businesses to increase hiring. A rapid adoption of artificial intelligence is adding another layer of caution, economists said.</p>\n<p>LOW HIRING IS THE MOST WORRYING ASPECT</p>\n<p>&quot;The low hiring rate is still the most concerning aspect of the labor market, but the trend in continued claims suggests employers aren't pulling back further,&quot; said <person>Nancy Vanden Houten</person>, lead U.S. economist at Oxford Economics.</p>\n<p>The number of people receiving unemployment benefits after an initial week of aid, a proxy for hiring, dropped 31,000 to a seasonally adjusted 1.833 million during the week ended <chron>February 14</chron>, the claims report showed. The so-called continuing claims covered the period during which the government surveyed households for February's unemployment rate. </p>\n<p>Continued claims rose modestly between the January and February survey weeks. The jobless rate eased to 4.3% in January from 4.4% in December. The Chicago Fed forecast the unemployment rate steady at 4.28% in February, which would round up to 4.3%.</p>\n<p>While the labor market is stabilizing, consumers remain anxious about their employment prospects. </p>\n<p>A survey from the Conference Board this week showed the share of consumers who viewed jobs as &quot;hard to get&quot; increased to a five-year high in February, though households also believed the availability of jobs had improved.</p>\n<p>The median duration of unemployment is near four-year highs, and jobs remain scarce for young college graduates, labor market data shows. Unemployed recent college graduates do not show in the claims data because they have limited or no work history, making them ineligible to file for jobless benefits.</p>\n<p>Continuing claims could be falling because some people have exhausted their eligibility, limited to 26 weeks in most states.</p>\n<p>&quot;The relationship between continuing claims and unemployment is far from airtight, given that the long-term unemployed, new entrants to the labor market, and those re-entering from inactivity, all are ineligible to claim,&quot; said <person>Oliver Allen</person>, senior U.S. economist at Pantheon Macroeconomics. </p>\n<p>Allen added that the Conference Board survey's &quot;hard to get&quot; jobs measure was &quot;a very reliable indicator in the past,&quot; and pointed &quot;to the unemployment rate rising again soon.&quot;</p>\n<p>(Reporting by Lucia Mutikani; Editing by <person>Chizu Nomiyama</person> and <person>Andrea Ricci</person> )</p>\n",
            "link": "https://www.fidelity.com/news/article/top-news/202602260841RTRSNEWSCOMBINED_KBN3PG1NF-OUSBS_1",
            "pub_date": "2026-02-26 23:40:52",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        }
    ]
}