{
    "data": [
        {
            "title": "Newly-listed MetaOptics Ltd delivers strong year-on-year revenue growth of 891%, and remains well-capitalised for growth with cash position of S$8.8 million",
            "description": "\n<div class=\"xn-content\">\n<p><span class=\"legendSpanClass\"><location value=\"LC/sg\" idsrc=\"xmltag.org\" >SINGAPORE</location></span>, <span class=\"legendSpanClass\"><chron>Feb. 28, 2026</chron></span> /PRNewswire/ -- <b><org >MetaOptics Ltd</org> (Catalist: 9MT) (\"<org >MetaOptics</org>\" or the \"Company\", and together with its subsidiaries, the \"Group\") </b>which listed recently in <chron>September 2025</chron>, is pleased to announce its inaugural financial results for the financial year ended <chron>31 December 2025</chron> (\"<b>FY2025</b>\").</p>\n<div><table border=\"0\" cellspacing=\"0\" cellpadding=\"1\" class=\"prnbcc\"><tr><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\" nowrap=\"nowrap\"><br /></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\" nowrap=\"nowrap\"><br /></td><td class=\"prngen3\" colspan=\"1\" rowspan=\"1\" nowrap=\"nowrap\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>2025</b></span></p></td><td class=\"prngen3\" colspan=\"1\" rowspan=\"1\" nowrap=\"nowrap\"><p class=\"prnml4\"><span class=\"prnews_span\">2024</span></p></td><td class=\"prngen4\" colspan=\"1\" rowspan=\"1\" nowrap=\"nowrap\"><p class=\"prnml4\"><span class=\"prnews_span\">+/-</span></p></td></tr><tr><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\" nowrap=\"nowrap\"><br /></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\" nowrap=\"nowrap\"><br /></td><td class=\"prngen4\" colspan=\"1\" rowspan=\"1\" nowrap=\"nowrap\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>S$</b></span></p></td><td class=\"prngen4\" colspan=\"1\" rowspan=\"1\" nowrap=\"nowrap\"><p class=\"prnml4\"><span class=\"prnews_span\">S$</span></p></td><td class=\"prngen4\" colspan=\"1\" rowspan=\"1\" nowrap=\"nowrap\"><p class=\"prnml4\"><span class=\"prnews_span\">%</span></p></td></tr><tr><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\" nowrap=\"nowrap\"><br /></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\" nowrap=\"nowrap\"><br /></td><td class=\"prngen4\" colspan=\"1\" rowspan=\"1\" nowrap=\"nowrap\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>Unaudited</b></span></p></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\" nowrap=\"nowrap\"><br /></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\" nowrap=\"nowrap\"><br /></td></tr><tr><td class=\"prnpr2 prnpl2 prnvab prncbts prnrbrb1 prnbbbs prnsblb1\" colspan=\"1\" rowspan=\"1\" nowrap=\"nowrap\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>Revenue</b></span></p></td><td class=\"prngen6\" colspan=\"1\" rowspan=\"1\" nowrap=\"nowrap\"><br /></td><td class=\"prngen6\" colspan=\"1\" rowspan=\"1\" nowrap=\"nowrap\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>787,388</b></span></p></td><td class=\"prngen6\" colspan=\"1\" rowspan=\"1\" nowrap=\"nowrap\"><p class=\"prnml4\"><span class=\"prnews_span\">79,440</span></p></td><td class=\"prngen6\" colspan=\"1\" rowspan=\"1\" nowrap=\"nowrap\"><p class=\"prnml4\"><span class=\"prnews_span\">891</span></p></td></tr><tr><td class=\"prngen7\" colspan=\"1\" rowspan=\"1\" nowrap=\"nowrap\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>Gross profit </b></span></p></td><td class=\"prngen8\" colspan=\"1\" rowspan=\"1\" nowrap=\"nowrap\"><br /></td><td class=\"prngen8\" colspan=\"1\" rowspan=\"1\" nowrap=\"nowrap\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>159,826</b></span></p></td><td class=\"prngen8\" colspan=\"1\" rowspan=\"1\" nowrap=\"nowrap\"><p class=\"prnml4\"><span class=\"prnews_span\">26,569</span></p></td><td class=\"prngen8\" colspan=\"1\" rowspan=\"1\" nowrap=\"nowrap\"><p class=\"prnml4\"><span class=\"prnews_span\">502</span></p></td></tr><tr><td class=\"prngen7\" colspan=\"1\" rowspan=\"1\" nowrap=\"nowrap\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>Loss </b><b>after income tax and total <br />     comprehensive loss</b></span></p></td><td class=\"prngen8\" colspan=\"1\" rowspan=\"1\" nowrap=\"nowrap\"><br /></td><td class=\"prngen9\" colspan=\"1\" rowspan=\"1\" nowrap=\"nowrap\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>(5,445,573)</b></span></p></td><td class=\"prngen9\" colspan=\"1\" rowspan=\"1\" nowrap=\"nowrap\"><p class=\"prnml4\"><span class=\"prnews_span\">(1,950,882)</span></p></td><td class=\"prngen8\" colspan=\"1\" rowspan=\"1\" nowrap=\"nowrap\"><p class=\"prnml4\"><span class=\"prnews_span\">179</span></p></td></tr><tr><td class=\"prngen7\" colspan=\"1\" rowspan=\"1\" nowrap=\"nowrap\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>Loss per share for loss attributable to <br />     the equity holders of the Group:</b></span></p></td><td class=\"prngen8\" colspan=\"1\" rowspan=\"1\" nowrap=\"nowrap\"><br /></td><td class=\"prngen8\" colspan=\"1\" rowspan=\"1\" nowrap=\"nowrap\"><br /></td><td class=\"prngen8\" colspan=\"1\" rowspan=\"1\" nowrap=\"nowrap\"><br /></td><td class=\"prngen8\" colspan=\"1\" rowspan=\"1\" nowrap=\"nowrap\"><br /></td></tr><tr><td class=\"prnpr2 prnpl2 prnvab prnsbtb1 prnrbrb1 prnsbbb1 prnsblb1\" colspan=\"1\" rowspan=\"1\" nowrap=\"nowrap\"><p class=\"prnml4\"><span class=\"prnews_span\">- Basic and diluted loss per share (in <br />     cents)</span></p></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\" nowrap=\"nowrap\"><br /></td><td class=\"prngen11\" colspan=\"1\" rowspan=\"1\" nowrap=\"nowrap\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>(2.54)</b></span></p></td><td class=\"prngen11\" colspan=\"1\" rowspan=\"1\" nowrap=\"nowrap\"><p class=\"prnml4\"><span class=\"prnews_span\">(1.01)</span></p></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\" nowrap=\"nowrap\"><p class=\"prnml4\"><span class=\"prnews_span\">152</span></p></td></tr></table></div><p>The Company delivered significant year-on-year increase in revenue by 891% to <money>S$0.8 million</money> in FY2025, primarily due to delivery of a direct laser writer to a customer in <location value=\"LC/tw\" idsrc=\"xmltag.org\" >Taiwan</location>, as announced by the Company on <chron>24 September 2025</chron>, enabling metalens prototyping and fabrication in the region's semiconductor supply chain, as well as higher sales of metalenses and modules to customers globally, to facilitate customers' evaluation of metalens solutions and integration into their applications.</p><p>The net loss for FY2025 of <money>S$5.4 million</money> was primarily attributable to the following areas:</p><p>(i) <b>Expenses incurred as the Group seeks platforms for growth. </b>One-off professional fees of approximately <money>S$2.4 million</money> was incurred in FY2025, in connection with the Company's listing on Catalist of the SGX-ST in <chron>September 2025</chron>, and the proposed dual listing of the Company on the <org>NASDAQ stock exchange</org> as announced on <chron>17 November 2025</chron>;</p><p>(ii) Approximately <money>S$1 million</money> in non-cash expenses including finance expenses and depreciation and amortisation; and</p><p>(iii) <b>Enhanced research and development efforts</b>. Research and development expenses of approximately <money>S$1.8 million</money> was incurred in FY2025 in connection with and to drive new product launches, including the launch of the Group's latest proprietary metalens-powered consumer electronics prototypes and generation-2 products at the recently held CES 2026, which are expected to further strengthen the Group's competitive position, in view of the strong customer feedback and traction.</p><p><b><i>Positioning the Group for growth</i></b></p><p>As part of its succession planning and strategic expansion plans, the Group has also appointed Mr <person>Aloysius Chua Hao Peng</person> (\"<b>Aloysius</b>\") as Executive Director and Chief Executive Officer, to further drive and lead strategic initiatives and growth of the Group's 4 business groups encompassing:</p><p><b>(i) </b><b>Metalens equipment<br /></b>- Focuses on the sale of advanced metalens production machines, including the direct laser writer, metalens automatic tester, and metalens automatic assembler</p><p><b>(ii) </b><b>Metalens foundry<br /></b>- Manufacturing and fabrication of customised metalenses, including in <location value=\"LC/us\" idsrc=\"xmltag.org\" >the United States</location> as a strategic growth base, enabling the Group to provide its metalens design &amp; manufacturing expertise to world class clients and partners across <location value=\"LC/us\" idsrc=\"xmltag.org\" >the United States</location> in the fields of 5G smart phones, data communications, data centres, fiber optics, AI semiconductor manufacturing, and consumer electronics</p><p><b>(iii) </b><b>Metalens products<br /></b>- Design and development of the IoT powered products specifically the metalens 5G smartphone, pico projectors, and smart glasses incorporating metalens with 3D gesture recognition</p><p><b>(iv) </b><b><org >MetaOptics</org> artificial intelligence (\"AI\")<br /></b>- Development of 3D biometric, gesture recognition, imaging and IoT algorithms to optimise the implementation and performance of metalens technology</p><p>Mr Thng Chong Kim, as Executive Chairman, continues to oversee management performance, strategic planning and business development, including the recent expansion to <location value=\"LC/us\" idsrc=\"xmltag.org\" >the United States</location> with the recent incorporation of the subsidiary in <location value=\"LC/us\" idsrc=\"xmltag.org\" >the United States</location>, and membership in Stanford Engineering's <org>SystemX Alliance</org> program, supporting the Group's strategy to deliver high-performance metaoptics solutions to customers across <location value=\"LR/nam\" idsrc=\"xmltag.org\" >North America</location>.</p><p>The Group remains well-capitalised, with a cash balance of approximately <money>S$2.9 million</money> and <money>S$4.8 million</money> unutilised from the net proceeds raised in connection with the IPO and placement exercise undertaken in <chron>December 2025</chron>, respectively, providing a strong cash base totalling <money>S$8.8 million</money> allowing the Group to execute its commercial rollout globally and support customers' requirements with high performance metalens solutions.</p><p><b><span id=\"spanHghlt4a31\">By Order of the Board</span></b></p><p>Thng Chong Kim<br />Executive Chairman<br /><chron>28 February 2026</chron></p><p><u><b>About <org >MetaOptics Ltd</org></b></u></p><p><org >MetaOptics Ltd</org> (Catalist: 9MT) is a leading-edge semiconductor optics company pioneering glass-based metalens solutions enhanced by AI-driven image processing. Using advanced optical design and a scalable 12-inch DUV lithography process, it powers next-generation applications in CPO, mobile, AR VR, automotive and other emerging markets. Headquartered in <location value=\"LC/sg\" idsrc=\"xmltag.org\" >Singapore</location>, <org >MetaOptics</org> aims to deliver high-performance optics with the reliability and scalability demanded by today's most innovative technology brands. Find out more at www.metaoptics.sg.</p>\n\n\n\n<p id=\"PURL\"><img title=\"Cision\" width=\"12\" height=\"12\" alt=\"Cision\" src=\"https://edge.prnewswire.com/c/img/favicon.png?sn=CN98449&amp;sd=2026-02-28\" /> View original content:https://www.prnewswire.com/news-releases/newly-listed-metaoptics-ltd-delivers-strong-year-on-year-revenue-growth-of-891-and-remains-well-capitalised-for-growth-with-cash-position-of-s8-8-million-302700170.html</p><p>SOURCE <org >METAOPTICS LTD</org></p></div>\n",
            "link": "https://www.fidelity.com/news/article/technology/202602280621PR_NEWS_USPR_____CN98449",
            "pub_date": "2026-02-28 19:21:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "UBS plans to keep Ermotti on as CEO for longer, NZZ reports",
            "description": "\n<p><location value=\"LU/at..vienna\" idsrc=\"xmltag.org\" >VIENNA</location>, <chron>Feb 28</chron> (Reuters) - The board of directors of\nSwiss banking giant UBS plans to keep Chief Executive\n<person>Sergio Ermotti</person> on for longer than originally planned, Swiss\nnewspaper Neue Zuercher Zeitung reported on Saturday.</p>\n<p>Ermotti, who oversaw the Swiss bank's 2023 emergency\ntakeover of Credit Suisse, is set to step down by the middle of\n2027, although that timeline is not finalised, two sources with\nknowledge of the matter told Reuters last month.</p>\n<p>However, the board led by Chairman <person>Colm Kelleher</person>, wants to\nkeep Ermotti beyond that date to guide UBS's pushback against\nthe Swiss government's plans for tighter regulation, the NZZ\nreported, citing people familiar with the matter.</p>\n<p>&quot;As we have repeatedly said, Sergio P. Ermotti will remain\nGroup CEO until at least early 2027,&quot; a UBS spokesperson said\nwhen asked by Reuters about the NZZ report, adding that it was\n&quot;premature to speculate about the timing of Sergio stepping\ndown&quot;.</p>\n<p>&quot;When the time comes to decide on a successor, the Board\nwill be able to draw on a strong bench of internal candidates,\nbut will of course fulfill its fiduciary duty by also evaluating\nexternal candidates,&quot; the spokesperson added.</p>\n<p></p>\n<p>MEASURES TO PREVENT FINANCIAL CRISES</p>\n<p>In June, the Swiss government proposed measures aimed at\npreventing future banking crises following the 2023 collapse of\nCredit Suisse. The plans could require UBS to hold up to <money>$24\nbillion</money> in additional capital.</p>\n<p>Other proposals include that UBS can no longer count\nsoftware and deferred tax assets towards its Common Equity Tier\n1 capital, whiles its foreign units must be fully backed with\nCET1 capital.</p>\n<p>UBS has rejected the proposals, arguing they would make\n<location value=\"LC/ch\" idsrc=\"xmltag.org\" >Switzerland</location> less competitive.</p>\n<p>NZZ said the bank was looking at different potential\noutcomes of that discussion, and that it might determine whether\nthe bank remains based in <location value=\"LC/ch\" idsrc=\"xmltag.org\" >Switzerland</location> or moves its headquarters\nabroad.</p>\n<p>&quot;We will do everything we can to ensure that UBS can\ncontinue to operate successfully as a global bank from\n<location value=\"LC/ch\" idsrc=\"xmltag.org\" >Switzerland</location>. Nevertheless, the Board of Directors is obliged to\nprepare for all scenarios,&quot; the spokesperson said.\n(Reporting by <person>Francois Murphy</person>, Editing by <person>Louise Heavens</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602280615RTRSNEWSCOMBINED_L1N3ZO04A_1",
            "pub_date": "2026-02-28 19:15:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US Equity Indexes Slump As Block Layoffs Trigger Fears of Wider Job Losses to AI",
            "description": "\n<p><chron>04:59 PM EST</chron>, <chron>02/27/2026</chron> (MT Newswires) -- US equity indexes fell on Friday as a layoff announcement at Block prompted fears of wider job displacement in favor of AI, sending Treasury yields to fresh lows on the year.</p><p>The Nasdaq Composite dropped 0.9% to 22,668.21, the S&amp;P 500 fell 0.4% to 6,878.88, and the Dow Jones Industrial Average declined 1.1% to 48,977.92.</p><p>Financials and technology were the sole decliners, while health care, consumer staples, and real estate led the gainers.</p><p>Block (XYZ) shares soared 17%, among the top gainers on the S&amp;P 500, after the financial technology company posted higher Q4 adjusted net income and revenue. It also announced a plan to cut its current workforce by more than 40%.</p><p>&quot;Gross profit continues to grow, we continue to serve more and more customers, and profitability is improving,&quot; Block Co-founder <person>Jack Dorsey</person> wrote in a post. &quot;But something has changed. We're already seeing that the intelligence tools we're creating and using, paired with smaller and flatter teams, are enabling a new way of working which fundamentally changes what it means to build and run a company.&quot;</p><p>Shares of <org value=\"CRWV.NaE\" idsrc=\"xmltag.org\" >CoreWeave</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='CRWV' fmr-param-security-type='Equity'>( CRWV )</span>  sank 19% after the cloud infrastructure company focused on artificial intelligence reported a wider Q4 loss. Earnings missed, with sustained investment in growth ahead of compute coming online, a Macquarie note said while cutting <org value=\"CRWV.NaE\" idsrc=\"xmltag.org\" >CoreWeave's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='CRWV' fmr-param-security-type='Equity'>( CRWV )</span> price target to <money>$90</money> from <money>$115</money>. &quot;Massive investment needed ahead of monetization remains a recurring theme. Execution at this scale could be choppy.&quot;</p><p><org value=\"ZS.NaE\" idsrc=\"xmltag.org\" >Zscaler</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='ZS' fmr-param-security-type='Equity'>( ZS )</span>  delivered strong fiscal Q2 results, beating the Street's adjusted earnings and sales expectations; but, CFRA, an independent research provider, told MT Newswires that a slowdown in net new annual recurring revenue additions will be a &quot;key investor concern.&quot; Shares of the cloud security company slumped 12%, the steepest decline in the Nasdaq.</p><p>In economic news, the US producer price index rose by 0.5% in January following a 0.4% increase in December, according to the <org>Bureau of Labor Statistics</org> on Friday, above the 0.3% gain expected in a <org>Bloomberg</org> survey. After excluding the more volatile food and energy prices, core PPI rose by 0.8%, more than the 0.3% gain anticipated and following a 0.6% jump in the previous month.</p><p>PPI was up 2.9% year-over-year in January after a 3.0% gain in December, while core prices rose by 3.6% following a 3.3% rise.</p><p>Services costs jumped 0.8% in the first month of the year, marking the largest gain since July, as trade as well as transportation and warehousing costs increased, according to a Stifel research note.</p><p>A sizable upswing in producer prices underscores the Federal Reserve's unfinished battle with inflation, and the flaws in the Federal Open Market Committee's &quot;longstanding passive and light-handed approach,&quot; the research note said.</p><p>&quot;While one data point does not make a trend, and much of the increase was isolated to trade services, any further confirmation of a reacceleration of cost pressures will not only solidify the Fed's position on the sidelines for some time despite outside pressure and, furthermore, call into question earlier rate cuts, but increasingly raise the notion of whether or not policy has become too accommodative,&quot; the note added.</p><p>Morgan Stanley economists forecast the core personal consumption expenditures price index, the Federal Reserve's preferred inflation measure, grew 0.52% month-over-month in January following the hotter-than-expected PPI print, from previous guidance of 0.49%. &quot;Our upward revision is explained by stronger domestic airfares (within transportation services), healthcare, and nonprofits serving households,&quot; according to a research note.</p><p>US Treasury yields declined, with the two-year down 6.3 basis points to 3.39%. The 10-year yield dropped 6.2 basis points to 3.96%, the lowest since November.</p><p>In energy markets, West Texas Intermediate crude oil futures jumped 3.2% to <money>$67.28</money> a barrel as a third round of indirect talks in <location value=\"LU/ch..geneva\" idsrc=\"xmltag.org\" >Geneva, Switzerland</location>, between <location value=\"LC/us\" idsrc=\"xmltag.org\" >the United States</location> and <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location> ended with an agreement to meet again next week.</p><p>&quot;A resolution to the central issue of Iranian domestic uranium enrichment remains elusive and will likely be the make-or-break factor in determining whether there will be another military confrontation,&quot; <person>Helima Croft</person>, head of global commodity strategy and MENA research at <org>RBC Capital Markets</org>, wrote in a research note. &quot;Despite the constructive soundbites, there are no indications that <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location> is willing to give up domestic enrichment.&quot;</p><p>In precious metals, gold futures rose 1.7% to <money>$5,281.5</money> per troy ounce, and silver futures jumped 7.9% to <money>$93.88</money> per troy ounce.</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/us-markets/202602271659MIDNIGHTUSEQUITY_A3575436",
            "pub_date": "2026-02-28 05:59:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Analyst Expectations For Docebo's Future",
            "description": "\n<p>In the latest quarter, 5 analysts provided ratings for <org value=\"DCBO.NaE\" idsrc=\"xmltag.org\" >Docebo</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='DCBO' fmr-param-security-type='Equity'>( DCBO )</span> , showcasing a mix of bullish and bearish perspectives.</p>\n<p>The following table encapsulates their recent ratings, offering a glimpse into the evolving sentiments over the past 30 days and comparing them to the preceding months.</p>\n<table>\n<thead>\n<tr>\n<th></th>\n<th align=\"right\"><strong>Bullish</strong></th>\n<th align=\"right\"><strong>Somewhat Bullish</strong></th>\n<th align=\"right\"><strong>Indifferent</strong></th>\n<th align=\"right\"><strong>Somewhat Bearish</strong></th>\n<th align=\"right\"><strong>Bearish</strong></th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td><strong>Total Ratings</strong></td>\n<td align=\"right\">2</td>\n<td align=\"right\">3</td>\n<td align=\"right\">0</td>\n<td align=\"right\">0</td>\n<td align=\"right\">0</td>\n</tr>\n<tr>\n<td><strong>Last 30D</strong></td>\n<td align=\"right\">1</td>\n<td align=\"right\">0</td>\n<td align=\"right\">0</td>\n<td align=\"right\">0</td>\n<td align=\"right\">0</td>\n</tr>\n<tr>\n<td><strong>1M Ago</strong></td>\n<td align=\"right\">1</td>\n<td align=\"right\">1</td>\n<td align=\"right\">0</td>\n<td align=\"right\">0</td>\n<td align=\"right\">0</td>\n</tr>\n<tr>\n<td><strong>2M Ago</strong></td>\n<td align=\"right\">0</td>\n<td align=\"right\">1</td>\n<td align=\"right\">0</td>\n<td align=\"right\">0</td>\n<td align=\"right\">0</td>\n</tr>\n<tr>\n<td><strong>3M Ago</strong></td>\n<td align=\"right\">0</td>\n<td align=\"right\">1</td>\n<td align=\"right\">0</td>\n<td align=\"right\">0</td>\n<td align=\"right\">0</td>\n</tr>\n</tbody>\n</table>\n\n<p>Providing deeper insights, analysts have established 12-month price targets, indicating an average target of <money>$32.8</money>, along with a high estimate of <money>$38.00</money> and a low estimate of <money>$28.00</money>. This current average represents a 10.14% decrease from the previous average price target of <money>$36.50</money>. </p>\n<p><img src=\"https://www.benzinga.com/files/images/story/2026/1772229634_0.png\" alt=\"price target chart\" /></p>\n\n<h2>Understanding Analyst Ratings: A Comprehensive Breakdown</h2>\n<p>The perception of <org value=\"DCBO.NaE\" idsrc=\"xmltag.org\" >Docebo</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='DCBO' fmr-param-security-type='Equity'>( DCBO )</span> by financial experts is analyzed through recent analyst actions. The following summary presents key analysts, their recent evaluations, and adjustments to ratings and price targets.</p>\n<table>\n<thead>\n<tr>\n<th>Analyst</th>\n<th>Analyst Firm</th>\n<th>Action Taken</th>\n<th>Rating</th>\n<th>Current Price Target</th>\n<th>Prior Price Target</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td><person>Ryan MacDonald</person></td>\n<td>Needham</td>\n<td>Lowers</td>\n<td>Buy</td>\n<td><money>$31.00</money></td>\n<td><money>$38.00</money></td>\n</tr>\n<tr>\n<td>Kevin Krishnaratne</td>\n<td>Scotiabank</td>\n<td>Lowers</td>\n<td>Sector Outperform</td>\n<td><money>$32.00</money></td>\n<td><money>$35.00</money></td>\n</tr>\n<tr>\n<td><person>Ryan MacDonald</person></td>\n<td>Needham</td>\n<td>Maintains</td>\n<td>Buy</td>\n<td><money>$38.00</money></td>\n<td><money>$38.00</money></td>\n</tr>\n<tr>\n<td><person>Matthew Vanvliet</person></td>\n<td>Cantor Fitzgerald</td>\n<td>Lowers</td>\n<td>Overweight</td>\n<td><money>$28.00</money></td>\n<td><money>$35.00</money></td>\n</tr>\n<tr>\n<td><person>Matt VanVliet</person></td>\n<td>Cantor Fitzgerald</td>\n<td>Announces</td>\n<td>Overweight</td>\n<td><money>$35.00</money></td>\n<td>-</td>\n</tr>\n</tbody>\n</table>\n\n<h3>Key Insights:</h3>\n<ul>\n<li><strong>Action Taken:</strong> Analysts frequently update their recommendations based on evolving market conditions and company performance. Whether they 'Maintain', 'Raise' or 'Lower' their stance, it reflects their reaction to recent developments related to <org value=\"DCBO.NaE\" idsrc=\"xmltag.org\" >Docebo</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='DCBO' fmr-param-security-type='Equity'>( DCBO )</span>. This information provides a snapshot of how analysts perceive the current state of the company.</li>\n<li><strong>Rating:</strong> Offering a comprehensive view, analysts assess stocks qualitatively, spanning from 'Outperform' to 'Underperform'. These ratings convey expectations for the relative performance of <org value=\"DCBO.NaE\" idsrc=\"xmltag.org\" >Docebo</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='DCBO' fmr-param-security-type='Equity'>( DCBO )</span> compared to the broader market.</li>\n<li><strong>Price Targets:</strong> Analysts explore the dynamics of price targets, providing estimates for the future value of <org value=\"DCBO.NaE\" idsrc=\"xmltag.org\" >Docebo's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='DCBO' fmr-param-security-type='Equity'>( DCBO )</span> stock. This examination reveals shifts in analysts' expectations over time.</li>\n</ul>\n<p>Assessing these analyst evaluations alongside crucial financial indicators can provide a comprehensive overview of <org value=\"DCBO.NaE\" idsrc=\"xmltag.org\" >Docebo's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='DCBO' fmr-param-security-type='Equity'>( DCBO )</span> market position. Stay informed and make well-judged decisions with the assistance of our Ratings Table.</p>\n<p><strong>Stay up to date on <org value=\"DCBO.NaE\" idsrc=\"xmltag.org\" >Docebo</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='DCBO' fmr-param-security-type='Equity'>( DCBO )</span> analyst ratings.</strong></p>\n<p>If you are interested in following small-cap stock news and performance you can start by tracking it here.</p>\n<h2>Delving into <org value=\"DCBO.NaE\" idsrc=\"xmltag.org\" >Docebo's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='DCBO' fmr-param-security-type='Equity'>( DCBO )</span> Background</h2>\n<p><org value=\"DCBO.NaE\" idsrc=\"xmltag.org\" >Docebo Inc</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='DCBO' fmr-param-security-type='Equity'>( DCBO )</span> is a provider of cloud-based learning management systems. The solutions provided by the company allow learning administrators to deliver scalable and flexible personalized learning experiences, from formal training to social learning to multiple internal, external, and blended audiences. The group provides an easy-to-use, configurable, and affordable learning platform with the end-to-end capabilities and critical functionality needed to train both internal and external workforces, partners, and customers. The majority of the revenue is derived from customers based in <location value=\"LR/nam\" idsrc=\"xmltag.org\" >North America</location>.</p>\n<h3>Financial Milestones: Docebo's Journey</h3>\n<p><strong>Market Capitalization Analysis:</strong> Reflecting a smaller scale, the company's market capitalization is positioned below industry averages. This could be attributed to factors such as growth expectations or operational capacity.</p>\n<p><strong>Revenue Growth:</strong> <org value=\"DCBO.NaE\" idsrc=\"xmltag.org\" >Docebo's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='DCBO' fmr-param-security-type='Equity'>( DCBO )</span> remarkable performance in 3M is evident. As of <chron>30 September, 2025</chron>, the company achieved an impressive revenue growth rate of <strong>11.16%</strong>. This signifies a substantial increase in the company's top-line earnings. When compared to others in the Information Technology sector, the company faces challenges, achieving a growth rate lower than the average among peers.</p>\n<p><strong>Net Margin:</strong> The company's net margin is a standout performer, exceeding industry averages. With an impressive net margin of <strong>9.91%,</strong> the company showcases strong profitability and effective cost control.</p>\n<p><strong>Return on Equity (ROE):</strong> <org value=\"DCBO.NaE\" idsrc=\"xmltag.org\" >Docebo's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='DCBO' fmr-param-security-type='Equity'>( DCBO )</span> ROE is below industry standards, pointing towards difficulties in efficiently utilizing equity capital. With an ROE of <strong>15.29%,</strong> the company may encounter challenges in delivering satisfactory returns for shareholders.</p>\n<p><strong>Return on Assets (ROA):</strong> <org value=\"DCBO.NaE\" idsrc=\"xmltag.org\" >Docebo's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='DCBO' fmr-param-security-type='Equity'>( DCBO )</span> financial strength is reflected in its exceptional ROA, which exceeds industry averages. With a remarkable ROA of <strong>3.55%,</strong> the company showcases efficient use of assets and strong financial health.</p>\n<p><strong>Debt Management:</strong> <org value=\"DCBO.NaE\" idsrc=\"xmltag.org\" >Docebo's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='DCBO' fmr-param-security-type='Equity'>( DCBO )</span> debt-to-equity ratio is below the industry average at <strong>0.06</strong>, reflecting a lower dependency on debt financing and a more conservative financial approach.</p>\n<h2>What Are Analyst Ratings?</h2>\n<p>Within the domain of banking and financial systems, analysts specialize in reporting for specific stocks or defined sectors. Their work involves attending company conference calls and meetings, researching company financial statements, and communicating with insiders to publish &quot;analyst ratings&quot; for stocks. Analysts typically assess and rate each stock once per quarter.</p>\n<p>Some analysts publish their predictions for metrics such as growth estimates, earnings, and revenue to provide additional guidance with their ratings. When using analyst ratings, it is important to keep in mind that stock and sector analysts are also human and are only offering their opinions to investors.</p>\n<p>This article was generated by Benzinga's automated content engine and reviewed by an editor.</p>\n",
            "link": "https://www.fidelity.com/news/article/technology/202602271700BENZINGAFULLNGTH50948754",
            "pub_date": "2026-02-28 06:00:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "REUTERS NEWS SCHEDULE AT 6 a.m. ET/ 11:00 a.m. GMT",
            "description": "\n<p>Here are the top stories and upcoming coverage plans for Reuters\ntext service as of <chron>6 a.m. ET</chron>/ <chron>11:00 a.m. GMT</chron>. For a full\nschedule of news and events, go to our editorial calendar on\nReuters Connect.</p>\n<p></p>\n<p>TOP STORIES</p>\n<p></p>\n<p>GLOBAL</p>\n<p></p>\n<p><location value=\"LC/ir\" idsrc=\"xmltag.org\" >IRAN</location>-CRISIS/</p>\n<p><location value=\"LC/il\" idsrc=\"xmltag.org\" >Israel</location> and US launch strikes on <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location>, targeting its\nleadership</p>\n<p><location value=\"LU/us.dc.wash\" idsrc=\"xmltag.org\" >WASHINGTON</location>/<location value=\"LU/ae..dubai\" idsrc=\"xmltag.org\" >DUBAI</location>/<location value=\"LU/eg..cairo\" idsrc=\"xmltag.org\" >CAIRO</location>- <location value=\"LC/us\" idsrc=\"xmltag.org\" >The United States</location> and <location value=\"LC/il\" idsrc=\"xmltag.org\" >Israel</location>\nlaunched strikes on <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location> on Saturday, plunging the <location value=\"LR/mde\" idsrc=\"xmltag.org\" >Middle East</location>\ninto a new conflict that President <person>Donald Trump</person> said would end a\nsecurity threat to <location value=\"LC/us\" idsrc=\"xmltag.org\" >the United States</location> and give Iranians a chance\nto topple their rulers.</p>\n<p></p>\n<p><location value=\"LC/af\" idsrc=\"xmltag.org\" >AFGHANISTAN</location>-<location value=\"LC/pk\" idsrc=\"xmltag.org\" >PAKISTAN</location>/</p>\n<p><location value=\"LC/pk\" idsrc=\"xmltag.org\" >Pakistan</location>, Afghan Taliban forces clash as diplomatic efforts\nintensify</p>\n<p><location value=\"LU/af..kabul\" idsrc=\"xmltag.org\" >KABUL</location>- Fighting between <location value=\"LC/pk\" idsrc=\"xmltag.org\" >Pakistan</location> and <location value=\"LC/af\" idsrc=\"xmltag.org\" >Afghanistan's</location> Taliban\nmilitary entered its third day on Saturday, following overnight\nclashes as the international community expressed increasing\nconcern about the conflict and called for urgent talks.</p>\n<p></p>\n<p>U.S.</p>\n<p></p>\n<p><location value=\"LC/ir\" idsrc=\"xmltag.org\" >IRAN</location>-CRISIS/<location value=\"LC/us\" idsrc=\"xmltag.org\" >USA</location>-TRUMP</p>\n<p>Trump warns some Americans may die amid US strikes in <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location></p>\n<p><location value=\"LU/us.dc.wash\" idsrc=\"xmltag.org\" >WASHINGTON</location>- U.S. President Donald Trump said on Saturday\nthat <location value=\"LC/us\" idsrc=\"xmltag.org\" >the United States</location> had begun &quot;major combat operations&quot; in\n<location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location>, warning that there may be U.S. casualties.</p>\n<p></p>\n<p><location value=\"LC/ir\" idsrc=\"xmltag.org\" >IRAN</location>-CRISIS/<location value=\"LC/us\" idsrc=\"xmltag.org\" >USA</location>-HEGESTH</p>\n<p>Top US general, Hegseth monitoring <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location> strikes from Trump\nresort, person familiar says</p>\n<p><location value=\"LU/us.dc.wash\" idsrc=\"xmltag.org\" >WASHINGTON</location>- Pentagon chief <person>Pete Hegseth</person> and Chairman of the\nJoint Chiefs of Staff General <person>Dan Caine</person> are monitoring the U.S.\noperation in <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location> from President <person>Donald Trump's</person> Mar-a-Lago\nresort in <location value=\"LS/us.fl\" idsrc=\"xmltag.org\" >Florida</location>, where Trump is currently located, a person\nfamiliar with the matter told Reuters.</p>\n<p></p>\n<p>BUSINESS</p>\n<p></p>\n<p><location value=\"LC/ir\" idsrc=\"xmltag.org\" >IRAN</location>-CRISIS/AIRLINES</p>\n<p>Airlines suspend <location value=\"LR/mde\" idsrc=\"xmltag.org\" >Middle East</location> flights after US, <location value=\"LC/il\" idsrc=\"xmltag.org\" >Israel</location>\nstrikes on <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location></p>\n<p><location value=\"LU/ae..dubai\" idsrc=\"xmltag.org\" >DUBAI</location>- Global airlines suspended flights across the <location value=\"LR/mde\" idsrc=\"xmltag.org\" >Middle\nEast</location> on Saturday after <location value=\"LC/us\" idsrc=\"xmltag.org\" >the United States</location> and <location value=\"LC/il\" idsrc=\"xmltag.org\" >Israel</location> launched\nstrikes on <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location>, plunging the region into a renewed military\nconfrontation.</p>\n<p></p>\n<p>OPEC-OIL/OUTPUT</p>\n<p>OPEC+ may consider larger oil output boost, sources say\nafter <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location> strike</p>\n<p><location value=\"LU/gb.eng.london\" idsrc=\"xmltag.org\" >LONDON</location>/<location value=\"LU/ru..moscow\" idsrc=\"xmltag.org\" >MOSCOW</location>- OPEC+ may consider a larger than planned\noutput increase on Sunday, two sources close to talks said, and\n<location value=\"LC/sa\" idsrc=\"xmltag.org\" >Saudi Arabia</location> and the UAE have already raised exports in\nanticipation of possible oil disruption from U.S.-Israeli\nstrikes on <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location> carried out on Saturday.</p>\n<p></p>\n<p>SPORTS</p>\n<p></p>\n<p>CRICKET-<location value=\"LC/in\" idsrc=\"xmltag.org\" >INDIA</location>/RANJI</p>\n<p>Cricket-Jammu and <location value=\"LU/pk..kashmr\" idsrc=\"xmltag.org\" >Kashmir</location> win <location value=\"LC/in\" idsrc=\"xmltag.org\" >India's</location> Ranji Trophy for first\ntime</p>\n<p><chron>Feb 28</chron>- Jammu and <location value=\"LU/pk..kashmr\" idsrc=\"xmltag.org\" >Kashmir</location> claimed their maiden Ranji Trophy\non Saturday after a draw with eight-times champions Karnataka in\nthe final of <location value=\"LC/in\" idsrc=\"xmltag.org\" >India's</location> premier domestic first-class competition,\nsecuring the win on the basis of their first-innings lead.</p>\n<p></p>\n<p>MOTOR-F1-ENGINES/</p>\n<p>Motor racing-FIA and F1 manufacturers reach compromise on\nengine controversy</p>\n<p><location value=\"LU/gb.eng.london\" idsrc=\"xmltag.org\" >LONDON</location>- Formula One's governing body and manufacturers have\nreached a compromise solution to tackle an engine controversy\nthat had threatened to overshadow next week's start of the\nseason in <location value=\"LC/au\" idsrc=\"xmltag.org\" >Australia</location>.</p>\n<p></p>\n<p>UPCOMING</p>\n<p>BUSINESS / ECONOMICS</p>\n<p>BERKSHIRE-ANNUAL REPORT/</p>\n<p>Berkshire Hathaway CEO Abel to release first shareholder\nletter</p>\n<p>Berkshire Hathaway will release the first annual shareholder\nletter by Chief Executive <person>Greg Abel</person>, who replaced <person>Warren Buffett</person>\nin that role on <chron>January 1</chron>.  Investors will review Abel's outlook\nfor the conglomerate, its investments and its huge cash\nholdings, as well as how his leadership and actions may differ\nfrom his predecessors.  The letter will be accompanied by\nBerkshire's annual report and financial results for the fourth\nquarter of 2025 and the full year</p>\n<p>28 Feb <chron>08:00 ET</chron> / <chron>13:00 GMT</chron></p>\n<p>BERKSHIRE-RESULTS/</p>\n<p>Berkshire Hathaway to release fourth-quarter, full-year\nresults</p>\n<p>Berkshire Hathaway will release its fourth-quarter and\nfull-year results.  Investors will look for how well Berkshire's\ninsurance businesses are handling greater competition and\nfalling interest rates, and the extent to which economic\nuncertainty may weigh on Berkshire's retail and manufacturing\nbusinesses.  Investors will also seek greater clarity on how\nBerkshire is deploying its huge cash stake, including whether it\nresumed stock buybacks .  Results will be accompanied by the\nfirst annual shareholder letter by Chief Executive <person>Greg Abel</person>,\nwho replaced <person>Warren Buffett</person> in that role on <chron>January 1</chron>.</p>\n<p>28 Feb <chron>08:00 ET</chron> / <chron>13:00 GMT</chron></p>\n<p><location value=\"LC/kz\" idsrc=\"xmltag.org\" >KAZAKHSTAN</location>-INFLATION/</p>\n<p><location value=\"LC/kz\" idsrc=\"xmltag.org\" >Kazakhstan</location> monthly inflation</p>\n<p><location value=\"LC/kz\" idsrc=\"xmltag.org\" >Kazakhstan</location> to publish monthly inflation data</p>\n<p>1 Mar</p>\n<p>ARTS / CULTURE / ENTERTAINMENT</p>\n<p>AWARDS-BRITS/ (TV)</p>\n<p>BRIT Awards take place in <location value=\"LU/gb.eng.manchr\" idsrc=\"xmltag.org\" >Manchester</location></p>\n<p><location value=\"LU/gb.eng.manchr\" idsrc=\"xmltag.org\" >Manchester</location> hosts <location value=\"LC/gb\" idsrc=\"xmltag.org\" >Britain's</location> pop music honours, the BRIT\nAwards.</p>\n<p>28 Feb <chron>14:00 ET</chron> / <chron>19:00 GMT</chron></p>\n<p>SPORTS</p>\n<p>SOCCER-<location value=\"LC/ar\" idsrc=\"xmltag.org\" >ARGENTINA</location>-BOJ-GIM/ (TV)</p>\n<p>Soccer - <location value=\"LC/ar\" idsrc=\"xmltag.org\" >Argentina</location> - Primera Division - Torneo Apertura -\nBoca Juniors v Gimnasia La Plata</p>\n<p>Boca Juniors play Gimnasia La Plata in the Argentina LPF\nTorneo Apertura.</p>\n<p>28 Feb <chron>15:45 ET</chron> / <chron>20:45 GMT</chron></p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602280600RTRSNEWSCOMBINED_L4N3ZO05D_1",
            "pub_date": "2026-02-28 19:00:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "London's Heathrow warns of cancelled and delayed flights due to Middle East airspace closures",
            "description": "\n<p><location value=\"LU/gb.eng.london\" idsrc=\"xmltag.org\" >LONDON</location>, <chron>Feb 28</chron> (Reuters) - <location>Heathrow Airport</location> said on\nSaturday that a small number of flights had been cancelled or\ndelayed due to the ongoing situation in the <location value=\"LR/mde\" idsrc=\"xmltag.org\" >Middle East</location> and\nresulting airspace closures in the region.</p>\n<p>(Reporting by Sam Tabahriti; Editing by <person>Aidan Lewis</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602280603RTRSNEWSCOMBINED_L8N3ZO0CQ_1",
            "pub_date": "2026-02-28 19:03:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "British Airways cancels Tel Aviv, Bahrain flights until March 3 over Middle East tensions",
            "description": "\n<p><location value=\"LU/gb.eng.london\" idsrc=\"xmltag.org\" >LONDON</location>, <chron>Feb 28</chron> (Reuters) - <org>British Airways</org> said on\nSaturday it has cancelled flights to <location value=\"LU/il..telavv\" idsrc=\"xmltag.org\" >Tel Aviv</location> and <location value=\"LC/bh\" idsrc=\"xmltag.org\" >Bahrain</location> until\n<chron>March 3</chron> due to the situation in the <location value=\"LR/mde\" idsrc=\"xmltag.org\" >Middle East</location>, following\nstrikes by <location value=\"LC/us\" idsrc=\"xmltag.org\" >the United States</location> and <location value=\"LC/il\" idsrc=\"xmltag.org\" >Israel</location> against <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location>.</p>\n<p>&quot;We are closely monitoring the situation and have taken the\noperational decision to cancel our flights to <location value=\"LU/il..telavv\" idsrc=\"xmltag.org\" >Tel Aviv</location> and\n<location value=\"LC/bh\" idsrc=\"xmltag.org\" >Bahrain</location> up to and including 03 March and have cancelled today's\nservice to <location value=\"LU/jo..amman\" idsrc=\"xmltag.org\" >Amman</location>,&quot; the airline said in a statement.</p>\n<p>&quot;Safety is always our top priority, and we're contacting our\ncustomers to advise them of their travel options.&quot;</p>\n<p>(Reporting by Sam Tabahriti; Editing by <person>Aidan Lewis</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602280537RTRSNEWSCOMBINED_L8N3ZO0B6_1",
            "pub_date": "2026-02-28 18:37:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Aegean Airlines suspends flights to and from Tel Aviv, Beirut",
            "description": "\n<p><location value=\"LU/gr..athens\" idsrc=\"xmltag.org\" >ATHENS</location>, <chron>Feb 28</chron> (Reuters) - Aegean Airlines,\n<location value=\"LC/gr\" idsrc=\"xmltag.org\" >Greece's</location> largest carrier, is suspending flights to and from <location value=\"LU/il..telavv\" idsrc=\"xmltag.org\" >Tel\nAviv</location> in <location value=\"LC/il\" idsrc=\"xmltag.org\" >Israel</location>, <location value=\"LU/lb..beirut\" idsrc=\"xmltag.org\" >Beirut</location> in <location value=\"LC/lb\" idsrc=\"xmltag.org\" >Lebanon</location> and Erbil in <location value=\"LC/iq\" idsrc=\"xmltag.org\" >Iraq</location> until <chron>March\n2</chron> after <location value=\"LC/il\" idsrc=\"xmltag.org\" >Israel</location> and the U.S. launched strikes on <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location>, a company\nspokesperson said on Saturday.\n(Reporting by <person>Lefteris Papadimas</person>; Editing by <person>Aidan Lewis</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602280525RTRSNEWSCOMBINED_L8N3ZO05S_1",
            "pub_date": "2026-02-28 18:25:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Nasdaq, S&P 500 Fall After Hot PPI Report; Both Indexes Log Monthly Declines",
            "description": "\n<p><chron>04:57 PM EST</chron>, <chron>02/27/2026</chron> (MT Newswires) -- The Nasdaq Composite and the S&amp;P 500 suffered back-to-back declines on Friday following a hot producer prices report, while both benchmarks logged their steepest monthly declines in almost a year.</p><p>The Nasdaq fell 0.9% to close at 22,668.2, while the S&amp;P 500 dipped 0.4% to 6,878.9. The Dow Jones Industrial Average ended 1.1% lower at 48,977.9. Barring technology and financials, all sectors were in the green, led by health care.</p><p>In economic news, US producer prices rose at the fastest pace in four months in January as growth in the services index hit the highest since July, government data showed.</p><p>&quot;A sizable upswing in producer prices underscores the (Federal Reserve's) unfinished battle with inflation, and furthermore, the flaws in the (Federal Open Market Committee's) longstanding passive and light-handed approach,&quot; Stifel said in a note to clients.</p><p>This month, the Nasdaq dropped 3.4%, while the S&amp;P 500 shed 0.9% -- both marking their biggest monthly losses since March. The Dow gained 0.2%. All three key indexes posted weekly declines.</p><p>&quot;Equity markets had another choppy week, desperately trying to figure out what the AI buildout actually means for the economy and the market going forward,&quot; <org>BMO Capital Markets</org> Senior Economist <person>Robert Kavcic</person> said in a note.</p><p>West Texas Intermediate crude oil was up 3.1% at <money>$67.22</money> a barrel in Friday late-afternoon trade.</p><p>The latest round of negotiations between the US and <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location> failed to result in a deal, with further talks scheduled ahead, <org>ING Bank</org> said in a report.</p><p>&quot;We are moving dangerously close towards President (<person>Donald) Trump's</person> deadline for a deal,&quot; the firm said. &quot;The market is pricing in a large risk premium due to this uncertainty; we believe as much as (<money>$10</money> a barrel).&quot;</p><p>Meanwhile, the <org>Organization of the Petroleum Exporting Countries</org> and allies are expected to resume output increases in April on Sunday following a three-month pause, analysts said.</p><p>US Treasury yields were lower, with the 10-year rate last down five basis points at 3.96% and the two-year rate falling 4.9 basis points to 3.39%.</p><p>In company news, OpenAI said it secured <money>$110 billion</money> in new funding, including investments from tech heavyweights <org value=\"NVDA.NaE\" idsrc=\"xmltag.org\" >Nvidia</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NVDA' fmr-param-security-type='Equity'>( NVDA )</span>  and <org value=\"AMZN.NaE\" idsrc=\"xmltag.org\" >Amazon.com</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AMZN' fmr-param-security-type='Equity'>( AMZN )</span> , as the ChatGPT parent aims to expand its infrastructure amid rising demand for artificial intelligence.</p><p><org value=\"NVDA.NaE\" idsrc=\"xmltag.org\" >Nvidia</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NVDA' fmr-param-security-type='Equity'>( NVDA )</span> shares slumped 4.2%, among the third-biggest drop on the Dow, while <org value=\"AMZN.NaE\" idsrc=\"xmltag.org\" >Amazon</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AMZN' fmr-param-security-type='Equity'>( AMZN )</span> rose 1%.</p><p>Dell Technologies (DELL) shares surged about 22%, the top gainer on the S&amp;P 500. The company's fiscal 2027 outlook was surprisingly strong amid a shortage of memory chips and the expected impact of price increases, <org>BofA Securities</org> said in a note e-mailed Friday. The brokerage raised its price objective on the Dell stock to <money>$155</money> from <money>$135</money>, while reiterating its buy rating.</p><p><org value=\"PSKY.NaE\" idsrc=\"xmltag.org\" >Paramount Skydance</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='PSKY' fmr-param-security-type='Equity'>( PSKY )</span>  shares jumped nearly 21%, the second top gainer on the S&amp;P 500, while <org value=\"NFLX.NaE\" idsrc=\"xmltag.org\" >Netflix</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NFLX' fmr-param-security-type='Equity'>( NFLX )</span>  surged almost 14%, among the best performers on the index.</p><p>Late Thursday, <org value=\"NFLX.NaE\" idsrc=\"xmltag.org\" >Netflix</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NFLX' fmr-param-security-type='Equity'>( NFLX )</span> said it abandoned its plan to acquire <org value=\"WBD.NaE\" idsrc=\"xmltag.org\" >Warner Bros. Discovery</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='WBD' fmr-param-security-type='Equity'>( WBD )</span> , handing the deal to <org>Paramount</org>, but still walking away with a <money>$2.8 billion</money> breakup fee.</p><p><org>Warner Bros</org>. shares fell 2.2%.</p><p>Gold was last up 1.7% at <money>$5,279.70</money> per troy ounce, while silver jumped 7.6% to <money>$94.28</money> per ounce.</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/us-markets/202602271657MIDNIGHTUSEQUITY_A3575443",
            "pub_date": "2026-02-28 05:57:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CANADA STOCKS-TSX ends lower but posts biggest monthly gain since 2020",
            "description": "\n<p>*</p>\n<p>TSX ends down 0.5% at 34,339.99,</p>\n<p></p>\n<p>*</p>\n<p>Posts 7.6% monthly gain</p>\n<p></p>\n<p>*</p>\n<p>Tech falls 2.5%, financials end 1.9% lower</p>\n<p></p>\n<p>*</p>\n<p>Energy adds 1.2% as oil settles up 2.8%</p>\n<p>(Updates at market close)</p>\n<p>By <person>Fergal Smith</person></p>\n<p><chron>Feb 27</chron> (Reuters) - <location value=\"LC/ca\" idsrc=\"xmltag.org\" >Canada's</location> main stock index gave back\nsome of its monthly gain on Friday as declines for financial and\ntechnology shares offset gains for resource stocks, while\ndomestic data showed the economy contracting in the fourth\nquarter.</p>\n<p>The S&amp;P/TSX composite index ended down 161.97\npoints, or 0.5%, at 34,339.99, after posting a record closing\nhigh in the three previous days.</p>\n<p><location>Wall Street</location> also lost ground as worries about credit losses\nand artificial intelligence disruption weighed.</p>\n<p>&quot;There is a lot of debate about AI disruption, spending.\nSome of that is finding its way into financials today as there\nare some worries that private credit issues may be starting to\nemerge,&quot; said Angelo Kourkafas, senior global investment\nstrategist at Edward Jones.</p>\n<p>&quot;On the flip side you have materials and energy that are\ndoing the heavy lifting for the TSX as investors rotate into\nreal asset businesses that are less likely to be disrupted by\nAI.&quot;</p>\n<p>For the month, the TSX added 7.6%, marking its biggest\nmonthly gain since <chron>November 2020</chron>, as metal mining shares\nbenefited from higher gold prices and stronger-than-expected\nbank earnings boosted financials.</p>\n<p>The <location value=\"LU/ca.on.tornto\" idsrc=\"xmltag.org\" >Toronto</location> market has advanced for 10 straight months, the\nlongest such winning streak since 2017.</p>\n<p><location value=\"LC/ca\" idsrc=\"xmltag.org\" >Canada's</location> gross domestic product fell at an annualized pace\nof 0.6% in the October-December quarter as manufacturers dipped\nheavily into inventories to meet demand, closing out the slowest\nyear of growth for the country since 2020.</p>\n<p>The technology sector lost 2.5% on Friday, with\nshares of e-commerce company <org value=\"SHOP.NaE\" idsrc=\"xmltag.org\" >Shopify Inc</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='SHOP' fmr-param-security-type='Equity'>( SHOP )</span> ending 4.3%\nlower.</p>\n<p>Financials fell 1.9%, while consumer discretionary\nwas down 1% as shares of apparel company <org value=\"ATZAF.NaE\" idsrc=\"xmltag.org\" >Aritzia</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='ATZAF' fmr-param-security-type='Equity'>( ATZAF )</span>\ndropped 7.8%.\nThree of 10 major sectors notched gains, including energy\n. It added 1.2% as the price of oil settled 2.8%\nhigher at <money>$67.02</money> a barrel.</p>\n<p>Traders braced for oil supply disruptions as nuclear talks\nbetween <location value=\"LC/us\" idsrc=\"xmltag.org\" >the United States</location> and <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location> had yet to reach an\nagreement.\nThe materials group, which includes metal mining shares, was up\n1% as the price of gold advanced 1.4%, benefiting from\nsafe-haven demand.\n(Reporting by <person>Fergal Smith</person> and <person>Utkarsh Tushar Hathi</person>; Editing by\n<person>Shailesh Kuber</person> and <person>Nick Zieminski</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/international/202602271651RTRSNEWSCOMBINED_L6N3ZN164_1",
            "pub_date": "2026-02-28 05:51:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Airlines suspend Middle East flights after US, Israel strikes on Iran",
            "description": "\n<p>*    Airspace closures affect routes between <location value=\"LR/eur\" idsrc=\"xmltag.org\" >Europe</location> and <location value=\"LR/asp\" idsrc=\"xmltag.org\" >Asia</location></p>\n<p></p>\n<p>*    Lufthansa, <org value=\"WZZAF.NaE\" idsrc=\"xmltag.org\" >Wizz Air</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='WZZAF' fmr-param-security-type='Equity'>( WZZAF )</span>, others halt flights to affected\nregions</p>\n<p><location value=\"LU/ae..dubai\" idsrc=\"xmltag.org\" >DUBAI</location>, <chron>Feb 28</chron> (Reuters) - Global airlines\nsuspended flights across the <location value=\"LR/mde\" idsrc=\"xmltag.org\" >Middle East</location> on Saturday after <location value=\"LC/us\" idsrc=\"xmltag.org\" >the\nUnited States</location> and <location value=\"LC/il\" idsrc=\"xmltag.org\" >Israel</location> launched strikes on <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location>, plunging the\nregion into a renewed military confrontation.</p>\n<p>Flight maps showed the airspace over <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location> virtually empty as\n<location value=\"LC/il\" idsrc=\"xmltag.org\" >Israel</location> said it struck <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location> and the U.S. military initiated a\nseries of strikes against targets in the country. <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location>\nretaliated with a salvo of missiles.</p>\n<p>The escalation dimmed hopes for a diplomatic solution to\n<location value=\"LU/ir..tehran\" idsrc=\"xmltag.org\" >Tehran's</location> nuclear dispute with the West and reignited conflict\nafter weeks of U.S. military buildup in the region.</p>\n<p>It marks the latest upheaval for air travel in the usually\nbusy region amid escalating tensions in the <location value=\"LR/mde\" idsrc=\"xmltag.org\" >Middle East</location>. With\nRussian and Ukrainian airspace closed to most airlines due to\nyears of war, the <location value=\"LR/mde\" idsrc=\"xmltag.org\" >Middle East</location> has become a more important route\nfor flights between <location value=\"LR/eur\" idsrc=\"xmltag.org\" >Europe</location> and <location value=\"LR/asp\" idsrc=\"xmltag.org\" >Asia</location>.</p>\n<p>Conflict zones are an increasing operational burden on\nairlines as aerial attacks raise worries about accidental or\ndeliberate shoot-downs of commercial air traffic. Longer flight\ntimes also require more fuel, adding to their costs.</p>\n<p><location value=\"LC/il\" idsrc=\"xmltag.org\" >Israel</location>, <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location>, <location value=\"LC/iq\" idsrc=\"xmltag.org\" >Iraq</location> and <location value=\"LC/jo\" idsrc=\"xmltag.org\" >Jordan</location> closed their airspace\nfollowing the attacks and a map of the region on Flightradar24\nshowed airplanes avoiding these areas.</p>\n<p>LUFTHANSA, WIZZ AIR SUSPEND FLIGHTS</p>\n<p>A number of <org>Qatar Airways</org> flights departed on Saturday\nmorning, circled over <location value=\"LC/kw\" idsrc=\"xmltag.org\" >Kuwait</location> or <location value=\"LC/sa\" idsrc=\"xmltag.org\" >Saudi Arabia</location> before returning to\nQatari airspace and were circling off <location value=\"LU/qa..doha\" idsrc=\"xmltag.org\" >Doha</location>, according to\nFlightradar24.</p>\n<p><org>The Russian Ministry of Transport</org> said on Saturday that\nRussian air carriers had suspended flights to <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location> and <location value=\"LC/il\" idsrc=\"xmltag.org\" >Israel</location>.</p>\n<p><location value=\"LC/de\" idsrc=\"xmltag.org\" >Germany's</location> Lufthansa said it was suspending flights\nto and from <location value=\"LU/ae..dubai\" idsrc=\"xmltag.org\" >Dubai</location> on Saturday and Sunday and halting temporarily\nthe <location value=\"LU/il..telavv\" idsrc=\"xmltag.org\" >Tel Aviv</location>, <location value=\"LU/lb..beirut\" idsrc=\"xmltag.org\" >Beirut</location> and <location value=\"LC/om\" idsrc=\"xmltag.org\" >Oman</location> routes until <chron>March 7</chron>. Air <location value=\"LC/fr\" idsrc=\"xmltag.org\" >France</location>\ncancelled flights to and From Tel Aviv and <location value=\"LU/lb..beirut\" idsrc=\"xmltag.org\" >Beirut</location>.</p>\n<p>Iberia also cancelled flights to <location value=\"LU/il..telavv\" idsrc=\"xmltag.org\" >Tel Aviv</location>, while <org value=\"WZZAF.NaE\" idsrc=\"xmltag.org\" >Wizz Air</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='WZZAF' fmr-param-security-type='Equity'>( WZZAF )</span>\nsuspended flights to and from <location value=\"LC/il\" idsrc=\"xmltag.org\" >Israel</location>, <location value=\"LU/ae..dubai\" idsrc=\"xmltag.org\" >Dubai</location>, <location value=\"LU/ae..abudha\" idsrc=\"xmltag.org\" >Abu Dhabi</location>\nand <location value=\"LU/jo..amman\" idsrc=\"xmltag.org\" >Amman</location> with immediate effect until the same date, it said.</p>\n<p><location value=\"LC/kw\" idsrc=\"xmltag.org\" >Kuwait's</location> aviation authority said it was halting all flights\nto <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location> until further notice, according to the state news\nagency, while <org>Oman Air</org> said it had suspended all flights to\n<location value=\"LU/iq..bagdad\" idsrc=\"xmltag.org\" >Baghdad</location> due to the regional developments.</p>\n<p>The <location value=\"LC/ae\" idsrc=\"xmltag.org\" >United Arab Emirates</location> &quot;partially and temporarily&quot; closed\nits airspace as a precaution, its state news agency said.</p>\n<p>&quot;Due to the temporary closure of several airspace in the\nregion on 28 February, some flydubai flights have been\nimpacted,&quot; a spokesperson for the Emirati carrier said.</p>\n<p>KLM, the Dutch arm of Air France-KLM, has brought\nforward the suspension of its <location value=\"LU/nl..amster\" idsrc=\"xmltag.org\" >Amsterdam</location>-<location value=\"LU/il..telavv\" idsrc=\"xmltag.org\" >Tel Aviv</location> service,\ncancelling the flight scheduled for Saturday after strikes in\n<location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location>, a spokesperson said.</p>\n<p>The airline had announced on Wednesday that flights would be\nhalted from <chron>Sunday, March 1</chron>. Only one flight to <location value=\"LU/il..telavv\" idsrc=\"xmltag.org\" >Tel Aviv</location> had\nbeen scheduled for Saturday.</p>\n<p><org>Virgin Atlantic</org> said it had decided to temporarily avoid\nIraqi airspace, resulting in some re-routing of its flights.\n<org>Qatar Airways</org> said it had halted air traffic temporarily as a\nprecaution.</p>\n<p></p>\n<p>(Reporting by <person>Federico Maccioni</person>; Editing by <person>Adam Jourdan</person>,\n<person>Josephine Mason</person> and <person>Janet Lawrence</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602280453RTRSNEWSCOMBINED_L6N3ZO04B_1",
            "pub_date": "2026-02-28 17:53:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "REUTERS NEWS SCHEDULE AT 6 am GMT/1 am ET",
            "description": "\n<p>Here are the top stories and upcoming coverage plans for Reuters\ntext service as of <chron>6 am GMT</chron>/<chron>1 am ET</chron> For a full schedule of news\nand events, go to our editorial calendar on Reuters Connect.</p>\n<p></p>\n<p>TOP STORIES</p>\n<p>GLOBAL</p>\n<p><location value=\"LC/af\" idsrc=\"xmltag.org\" >AFGHANISTAN</location>-<location value=\"LC/pk\" idsrc=\"xmltag.org\" >PAKISTAN</location>/</p>\n<p>Afghan Taliban open to talks after <location value=\"LC/pk\" idsrc=\"xmltag.org\" >Pakistan</location> bombs <location value=\"LU/af..kabul\" idsrc=\"xmltag.org\" >Kabul</location>,\n<location value=\"LU/af..kandhr\" idsrc=\"xmltag.org\" >Kandahar</location></p>\n<p><location value=\"LU/af..kabul\" idsrc=\"xmltag.org\" >KABUL</location>/<location value=\"LU/pk..islbad\" idsrc=\"xmltag.org\" >ISLAMABAD</location>, <chron>Feb 27</chron> (Reuters) - <location value=\"LC/af\" idsrc=\"xmltag.org\" >Afghanistan's</location> Taliban\nrulers said on Friday they were willing to negotiate after\n<location value=\"LC/pk\" idsrc=\"xmltag.org\" >Pakistan</location> bombed their forces in major cities and said the\nallies-turned-foes were in &quot;open war.&quot;</p>\n<p></p>\n<p><location value=\"LC/ir\" idsrc=\"xmltag.org\" >IRAN</location>-CRISIS-TRUMP-TALKS/</p>\n<p>Trump says of <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location>: 'Sometimes you have to use force'</p>\n<p><location value=\"LU/us.dc.wash\" idsrc=\"xmltag.org\" >WASHINGTON</location>, <chron>Feb 27</chron> (Reuters) - U.S. President Donald Trump\nexpressed disappointment on Friday about U.S. negotiations with\n<location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location> over its nuclear program and warned that &quot;sometimes you\nhave to use force,&quot; amid a massive military presence in the\nregion that could presage strikes on the <org>Islamic Republic</org>.</p>\n<p></p>\n<p>U.S.</p>\n<p><location value=\"LC/us\" idsrc=\"xmltag.org\" >USA</location>-TRUMP-EPSTEIN-CLINTONS/</p>\n<p><person>Bill Clinton</person> to lawmakers investigating Epstein: 'I saw\nnothing'</p>\n<p><chron>Feb 27</chron> (Reuters) - <person>Bill Clinton</person> told lawmakers on Friday\nthat he &quot;saw nothing that gave me pause&quot; when he spent time with\n<person>Jeffrey Epstein</person>, as the former president gave closed-door\ntestimony about his relationship with the late sex offender.</p>\n<p></p>\n<p><location value=\"LC/us\" idsrc=\"xmltag.org\" >USA</location>-SCOUTING-MILITARY/</p>\n<p>Scouting America reaches accord with Pentagon to maintain\nmilitary support</p>\n<p><chron>Feb 27</chron> (Reuters) - Scouting America has reached an accord\nwith the Pentagon that aims to rid its policies and programs of\n&quot;radical woke ideology&quot; and restore membership &quot;based solely on\nbiological sex at birth,&quot; Defense Secretary <person>Pete Hegseth</person> said on\nFriday.</p>\n<p></p>\n<p>BUSINESS</p>\n<p>WARNER-BROS-DIS-M-A-PARAMOUNT-SKYDAN-<location value=\"LS/us.ca\" idsrc=\"xmltag.org\" >CALIFORNIA</location>/</p>\n<p><location value=\"LS/us.ca\" idsrc=\"xmltag.org\" >California</location> now the biggest obstacle to <org>Paramount's</org> <org>Warner\nBros</org> takeover</p>\n<p><chron>Feb 27</chron> (Reuters) - <location value=\"LS/us.ca\" idsrc=\"xmltag.org\" >California</location> has a lot to lose if Paramount\nSkydance buys Warner Bros Discovery and could stand in the way\nof a deal, while <org>Paramount's</org> deep political connections to the\nTrump administration are expected to smooth the path to federal\nregulatory approval.</p>\n<p></p>\n<p><location value=\"LC/us\" idsrc=\"xmltag.org\" >USA</location>-PENTAGON-ANTHROPIC-TRUMP/</p>\n<p>Trump directs US agencies to toss Anthropic's AI as Pentagon\ncalls startup a supply risk</p>\n<p><location value=\"LU/us.dc.wash\" idsrc=\"xmltag.org\" >WASHINGTON</location>, <chron>Feb 27</chron> (Reuters) - U.S. President Donald Trump\nsaid on Friday he is directing the government to stop work with\nAnthropic, and the Pentagon said it would declare the startup a\nsupply-chain risk, dealing a major blow to the artificial\nintelligence lab after a showdown about technology guardrails.</p>\n<p></p>\n<p>SPORTS</p>\n<p>SOCCER-CHAMPIONS-DRAW/</p>\n<p>Soccer-Real Madrid and Man City to meet again in <org>Champions\nLeague</org> last 16</p>\n<p>NYON, <location value=\"LC/ch\" idsrc=\"xmltag.org\" >Switzerland</location>, <chron>Feb 27</chron> (Reuters) - <location value=\"LU/us.ca.manchr\" idsrc=\"xmltag.org\" >Manchester</location> City and\nReal Madrid will renew their familiar rivalry after being drawn\ntogether in the <org>Champions League</org> knockout phase for the sixth\ntime since 2019-20 following Friday's draw for the last 16,\nquarter-finals and semi-finals.</p>\n<p></p>\n<p>PARALYMPICS-2026/</p>\n<p>Paralympics-More nations skip Milano Cortina opening\nceremony as boycott grows</p>\n<p><location value=\"LU/it.lo.milan\" idsrc=\"xmltag.org\" >MILAN</location>, <chron>Feb 27</chron> - A week before the Paralympics open in\nVerona, a growing list of countries plans to skip the ceremony\nin protest at the inclusion of Russian athletes under their own\nflag, an escalating boycott that threatens to overshadow the\nstart of the Games.</p>\n<p></p>\n<p></p>\n<p>UPCOMING</p>\n<p>DISASTERS / ACCIDENTS</p>\n<p><location value=\"LC/gr\" idsrc=\"xmltag.org\" >GREECE</location>-TRAINS/CRASH- ANNIVERSARY (PIX) (TV)</p>\n<p>Greeks rally to mark anniversary of deadly 2023 train crash,\nferries, trains come to a halt</p>\n<p>Greeks rally in <location value=\"LU/gr..athens\" idsrc=\"xmltag.org\" >Athens</location> and other cities across the country\nto mark the anniversary of a 2023 train crash, the country's\nworst rail disaster on record, that killed 57 people, most of\nthem students. Ferries and trains will come to a halt as\ntransport workers are expected to join the demonstrations weeks\nbefore a criminal trial begins over the so-called Tempi tragedy\nthat became an emblem of the neglect of <location value=\"LC/gr\" idsrc=\"xmltag.org\" >Greece's</location> infrastructure\nin the decades before the crash.</p>\n<p>28 Feb <chron>05:00 ET</chron> / <chron>10:00 GMT</chron></p>\n<p>BUSINESS / ECONOMICS</p>\n<p>BERKSHIRE-ANNUAL REPORT/</p>\n<p>Berkshire Hathaway CEO Abel to release first shareholder\nletter</p>\n<p>Berkshire Hathaway will release the first annual shareholder\nletter by Chief Executive <person>Greg Abel</person>, who replaced <person>Warren Buffett</person>\nin that role on <chron>January 1</chron>.  Investors will review Abel's outlook\nfor the conglomerate, its investments and its huge cash\nholdings, as well as how his leadership and actions may differ\nfrom his predecessors.  The letter will be accompanied by\nBerkshire's annual report and financial results for the fourth\nquarter of 2025 and the full year</p>\n<p>28 Feb <chron>08:00 ET</chron> / <chron>13:00 GMT</chron></p>\n<p>BERKSHIRE-RESULTS/</p>\n<p>Berkshire Hathaway to release fourth-quarter, full-year\nresults</p>\n<p>Berkshire Hathaway will release its fourth-quarter and\nfull-year results.  Investors will look for how well Berkshire's\ninsurance businesses are handling greater competition and\nfalling interest rates, and the extent to which economic\nuncertainty may weigh on Berkshire's retail and manufacturing\nbusinesses.  Investors will also seek greater clarity on how\nBerkshire is deploying its huge cash stake, including whether it\nresumed stock buybacks .  Results will be accompanied by the\nfirst annual shareholder letter by Chief Executive <person>Greg Abel</person>,\nwho replaced <person>Warren Buffett</person> in that role on <chron>January 1</chron>.</p>\n<p>28 Feb <chron>08:00 ET</chron> / <chron>13:00 GMT</chron></p>\n<p>ARTS / CULTURE / ENTERTAINMENT</p>\n<p>AWARDS-BRITS/ (TV)</p>\n<p>BRIT Awards take place in <location value=\"LU/gb.eng.manchr\" idsrc=\"xmltag.org\" >Manchester</location></p>\n<p><location value=\"LU/gb.eng.manchr\" idsrc=\"xmltag.org\" >Manchester</location> hosts <location value=\"LC/gb\" idsrc=\"xmltag.org\" >Britain's</location> pop music honours, the BRIT\nAwards.</p>\n<p>28 Feb <chron>14:00 ET</chron> / <chron>19:00 GMT</chron></p>\n<p>SPORTS</p>\n<p>SOCCER-<location value=\"LC/ar\" idsrc=\"xmltag.org\" >ARGENTINA</location>-BOJ-GIM/ (TV)</p>\n<p>Soccer - <location value=\"LC/ar\" idsrc=\"xmltag.org\" >Argentina</location> - Primera Division - Torneo Apertura -\nBoca Juniors v Gimnasia La Plata</p>\n<p>Boca Juniors play Gimnasia La Plata in the Argentina LPF\nTorneo Apertura.</p>\n<p>28 Feb <chron>15:45 ET</chron> / <chron>20:45 GMT</chron></p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602280100RTRSNEWSCOMBINED_L4N3ZO01V_1",
            "pub_date": "2026-02-28 14:00:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Chilean lithium miner SQM's fourth-quarter profit jumps 53%",
            "description": "\n<p><chron>Feb 27</chron> (Reuters) - Chilean lithium producer SQM on Friday reported a rise in fourth-quarter net profit, as a stronger pricing environment lifted average lithium prices and boosted results.</p>\n<p>The world's second-largest lithium producer said net income for the quarter was <money>$183.8 million</money>, up 53% from a year earlier.</p>\n<p>Revenue for the quarter rose 23.3% to <money>$1.32 billion</money>, from <money>$1.07 billion</money> in the same period last year.</p>\n<p>Gross profit for the quarter climbed 52.7% to <money>$448.5 million</money>.</p>\n<p>&quot;Our fourth quarter 2025 results reflected record-high sales volumes across both of our lithium businesses, Nova Andino Litio (formerly SQM Salar) and our International Lithium Division,&quot; SQM CEO <person>Ricardo Ramos</person> said. &quot;In <chron>November 2025</chron>, we began to see early signs of an improved supply-demand balance, driven by stronger-than-expected demand from energy storage systems (ESS).&quot;  </p>\n<p>The company is increasing refining of lithium carbonate from lithium sulfate in <location value=\"LC/cn\" idsrc=\"xmltag.org\" >China</location> through tolling agreements, Ramos said. </p>\n<p>For the full year, SQM posted net income of <money>$588.1 million</money>, compared with a loss of <money>$404.4 million</money> in 2024, while revenue rose 1.0% to <money>$4.58 billion</money>.</p>\n<p>SQM, one of only two companies producing lithium in <location value=\"LC/cl\" idsrc=\"xmltag.org\" >Chile</location>, also makes fertilizers and industrial chemicals.  </p>\n<p>Lithium prices have cooled from record highs in 2022 as supply growth outpaced demand, pressuring margins for global producers including SQM and rivals such as U.S.-based Albemarle.  </p>\n<p>Still, demand for the battery metal is expected to rise in the coming years in line with growth in electric vehicles and battery storage.</p>\n<p></p>\n<p> (Reporting by Mihika Sharma ; Writing by <person>Kylie Madry</person>; Editing by <person>Sam Holmes</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602272336RTRSNEWSCOMBINED_KBN3PI03U-OUSBS_1",
            "pub_date": "2026-02-28 12:36:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "OpenAI reaches deal to deploy AI models on U.S. Department of War classified network",
            "description": "\n<p><chron>Feb 27</chron> (Reuters) - OpenAI CEO <person>Sam Altman</person> said on Friday it has reached an agreement with the <org>U.S. Department of War</org> to deploy its AI models on classified cloud networks.</p>\n<p>&quot;In all of our interactions, the DoW displayed a deep respect for safety and a desire to partner to achieve the best possible outcome,&quot; Altman said in a post on X.</p>\n<p></p>\n<p> (Reporting by <person>Devika Nair</person> in Bengaluru; Editing by <person>Sam Holmes</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602272215RTRSNEWSCOMBINED_KBN3PI02U-OUSBS_1",
            "pub_date": "2026-02-28 11:15:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Nvidia plans new chip to speed AI processing, WSJ reports",
            "description": "\n<p><chron>Feb 27</chron> (Reuters) - <org value=\"NVDA.NaE\" idsrc=\"xmltag.org\" >Nvidia</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NVDA' fmr-param-security-type='Equity'>( NVDA )</span> plans to launch a new processor designed to help OpenAI and other customers build faster, more efficient AI systems, the <org>Wall Street Journal</org> reported on Friday, citing people familiar with the matter. </p>\n<p>Reuters could not immediately verify the report.  </p>\n<p></p>\n<p> (Reporting by Mihika Sharma in Bengaluru; Editing by <person>Tom Hogue</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602272222RTRSNEWSCOMBINED_KBN3PI02Y-OUSBS_1",
            "pub_date": "2026-02-28 11:22:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "California treasurer urges Trump to honor SCOTUS tariff ruling",
            "description": "\n<block>\n<p><location value=\"LS/us.ca\" idsrc=\"xmltag.org\" >California's</location> treasurer and state controller joined officials from nine other states in sending a letter to President <person>Donald Trump</person> Thursday urging him to adhere to the <org>U.S. Supreme Court's</org> ruling on tariffs.</p><p>The high court by a 6-3 vote on <chron>Feb. 20</chron> <u>struck down</u> the sweeping tariffs Trump had imposed in 2025 in a series of executive orders that caused massive swings in the stock market. The ruling conversely <u>should &quot;be accretive</u> to growth expectations and somewhat disinflationary,&quot; <person>Jeff Lipton</person>, The Bond Buyer's market intelligence analyst said in a column the day of the ruling.</p><p>California Treasurer <person>Fiona Ma</person> and State Controller <person>Malia Cohen</person> were signatories along with 13 other state financial officers on the letter that asked Trump to adhere to the ruling, ensure that any structural tariff action proceeds only with clear congressional authorization and remedy the economic damage resulting from tariffs inconsistent with the court's guidance.</p><p>The majority opinion found the tariffs exceed the powers given to the president by <org>Congress</org> under a 1977 law providing the chief of state with the authority to regulate commerce only during national emergencies created by foreign threats. The constitution vests the power to levy taxes and duties with <org>Congress</org>. </p><p>&quot;President Trump's trade policies have injected uncertainty into economies that undermine responsible state budgeting and long-term investment, and it raises real costs for manufacturers and consumers while disrupting supply chains,&quot; Ma said. &quot;That's why we must follow the court's decision and restore order — so states can plan responsibly, markets can function with predictability and businesses and families aren't forced to shoulder the cost of policy whiplash.&quot;</p><p>The 15% global tariff Trump threatened after the ruling was handed down would represent a structural change to the American tax base, the letter states, asserting such a decision belongs to <org>Congress</org>.</p><p>&quot;As the state's chief fiscal officer, I believe durable economic growth depends on stability, predictability and respect for constitutional boundaries,&quot; Cohen said. &quot;We must restore clarity to protect taxpayers, safeguard state revenues and ensure accountability so that those who have borne these costs will be made whole.&quot;</p><p>Officials from <location value=\"LS/us.wa\" idsrc=\"xmltag.org\" >Washington</location>, <location value=\"LS/us.or\" idsrc=\"xmltag.org\" >Oregon</location>, <location value=\"LS/us.mn\" idsrc=\"xmltag.org\" >Minnesota</location>, <location value=\"LS/us.co\" idsrc=\"xmltag.org\" >Colorado</location>, <location value=\"LS/us.nv\" idsrc=\"xmltag.org\" >Nevada</location>, <location value=\"LS/us.il\" idsrc=\"xmltag.org\" >Illinois</location>, <location value=\"LS/us.md\" idsrc=\"xmltag.org\" >Maryland</location>, <location value=\"LS/us.vt\" idsrc=\"xmltag.org\" >Vermont</location> and <location value=\"LS/us.ct\" idsrc=\"xmltag.org\" >Connecticut</location> also signed the letter. </p><p>&quot;As we have previously emphasized in public statements, durable economic growth depends on predictability,&quot; the letter says. &quot;Trade policy must be stable and clearly grounded in law if markets, employers and state governments are to plan effectively.&quot;</p><p><location value=\"LS/us.ca\" idsrc=\"xmltag.org\" >California</location> Attorney General <person>Rob Bonta</person> and officials from other states had argued in <u>lawsuits</u> that it was unlawful for Trump to impose tariffs without the consent of <org>Congress</org>.</p><p>&quot;While this is great news,&quot; Bonta said when the ruling was handed down, &quot;we must not forget the chaos that sent businesses, consumers and global economies reeling. At a time when more and more families are struggling with affordability and having trouble paying for the basics — their utilities, groceries, gas — the administration seems intent on making it more expensive for Californians and Americans to live.&quot;</p><p>The letter also asked Trump to establish a clear and timely mechanism to reimburse American taxpayers, businesses and affected industries for tariffs imposed without proper constitutional ground, including restitution for demonstrable financial losses borne by the states.</p><p>The minority opinion by Justice <person>Brett Kavanaugh</person> raised questions as to whether the federal government will have to provide refunds to importers, which he estimated could cost more than <money>$200 billion</money>. </p><p>More than 900 companies have <u>sued</u> the U.S. over Trump's tariffs in the <org>U.S. Court of International Trade</org>, seeking refunds for duties slapped on countries worldwide that they were forced to absorb, the Financial Times reported.</p>\n</block>\n",
            "link": "https://www.fidelity.com/news/article/us-economy/202602271410SM______BNDBUYER_0000019c-a063-d9fc-a39f-feeb7e0c0001_110.1",
            "pub_date": "2026-02-28 03:10:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Trump directs US agencies to toss Anthropic's AI as Pentagon calls startup a supply risk",
            "description": "\n<p>By Andrea Shalal, <person>Jeffrey Dastin</person> and <person>Ryan Patrick Jones</person></p>\n<p><location value=\"LU/us.dc.wash\" idsrc=\"xmltag.org\" >WASHINGTON</location>, <chron>Feb 27</chron> (Reuters) - U.S. President Donald Trump said on Friday he is directing the government to stop work with Anthropic and the Pentagon said it will declare the startup a supply-chain risk, dealing a major blow to the artificial intelligence lab after a showdown about technology guardrails.</p>\n<p>Trump added there would be a six-month phase-out for the <org>Defense Department</org> and other agencies that use the company's products. If Anthropic does not help with the transition, Trump said, he would use &quot;the <org>Full Power</org> of the Presidency to make them comply, with major civil and criminal consequences to follow.&quot;</p>\n<p>Spokespeople for Anthropic, which won up to <money>$200 million</money> from the Pentagon in a contract last year, did not immediately respond to a request for comment.</p>\n<p>The planned designation as a supply-chain risk, announced by Defense Secretary <person>Pete Hegseth</person>, means that contractors could be barred from deploying Anthropic's AI as part of work for the Pentagon. The defense industrial base includes tens of thousands of contractors, including major public companies.</p>\n<p>The designation is typically reserved for suppliers from adversary nations. Such action was taken to remove Chinese tech giant Huawei from the Pentagon's supply chains: Starting in 2017, the U.S. restricted <org>Defense Department</org> use of Huawei equipment, prohibited federal agencies from purchasing its technology, and halted federal grant and loan funds for Huawei equipment.</p>\n<p>Anthropic could launch a court challenge to the designation, which poses an existential threat to its business with the government and may harm its private-sector relationships, according to <person>Franklin Turner</person>, an attorney who specializes in government contracts.</p>\n<p>&quot;Blacklisting Anthropic is the contractual equivalent of nuclear war,&quot; he said.</p>\n<p>WEAPONS, SURVEILLANCE CONCERNS</p>\n<p>The Pentagon had set a Friday deadline to resolve an escalating feud with <location value=\"LU/us.ca.sanfrn\" idsrc=\"xmltag.org\" >San Francisco</location>-based Anthropic over how the military could use AI at war.</p>\n<p>AI leader Anthropic has raced to win fierce competition to sell novel technology to businesses and government, particularly for national security, ahead of a widely expected initial public offering. The company has said it has not finalized an IPO decision.</p>\n<p>At the same time, the battle over technological guardrails had raised concerns that the <org>Defense Department</org> would follow U.S. law but few other constraints when deploying AI for national-security missions, regardless of safety or ethics terms required by the technology's developers.</p>\n<p>Anthropic had sought guarantees that its AI would not be used for fully autonomous weapons or for mass domestic surveillance - applications in which the Pentagon has said it had no interest.</p>\n<p>Anthropic was the first frontier AI lab to put its models on classified networks via cloud provider <org value=\"AMZN.NaE\" idsrc=\"xmltag.org\" >Amazon.com</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AMZN' fmr-param-security-type='Equity'>( AMZN )</span> and the first to build customized models for national security customers, the startup has said.</p>\n<p>Its product Claude is in use across the intelligence community and armed services.</p>\n<p>U.S. Senator <person>Mark Warner</person>, a Democrat and vice chairman of the <org>Select Committee on Intelligence</org>, criticized the action taken by Trump, a Republican.</p>\n<p>&quot;The president's directive to halt the use of a leading American AI company across the federal government, combined with inflammatory rhetoric attacking that company, raises serious concerns about whether national security decisions are being driven by careful analysis or political considerations.&quot;</p>\n<p>Tech companies and the Pentagon have repeatedly locked horns since at least 2018, when employees at Alphabet's Google protested against the Pentagon's use of the company's AI to analyze drone footage. A rapprochement ensued with companies including <org value=\"AMZN.NaE\" idsrc=\"xmltag.org\" >Amazon</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AMZN' fmr-param-security-type='Equity'>( AMZN )</span> and <org value=\"MSFT.NaE\" idsrc=\"xmltag.org\" >Microsoft</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='MSFT' fmr-param-security-type='Equity'>( MSFT )</span> jousting for defense business, while several big-tech CEOs pledged cooperation last year with the Trump administration.</p>\n<p>But theoretical &quot;killer robots&quot; have remained a concern held by human-rights and technology activists. At the same time, <location value=\"LC/ua\" idsrc=\"xmltag.org\" >Ukraine</location> and <location value=\"LU/il..gaza\" idsrc=\"xmltag.org\" >Gaza</location> have become theaters for increasingly automated systems on the battlefield. </p>\n<p> (Reporting by <person>Jeffrey Dastin</person> in <location value=\"LU/us.ca.sanfrn\" idsrc=\"xmltag.org\" >San Francisco</location>, <person>Ryan Patrick Jones</person> in <location value=\"LU/ca.on.tornto\" idsrc=\"xmltag.org\" >Toronto</location>, Andrea Shalal, <person>Mike Stone</person> and <person>Chris Sanders</person> in <location value=\"LU/us.dc.wash\" idsrc=\"xmltag.org\" >Washington</location>, <person>Jack Queen</person> in <location value=\"LU/us.ny.nyc\" idsrc=\"xmltag.org\" >New York</location> and <person>Ismail Shakil</person> in <location value=\"LU/ca.on.ottawa\" idsrc=\"xmltag.org\" >Ottawa</location>; Writing by <person>Daphne Psaledakis</person>; Editing by <person>Caitlin Webber</person>, <person>Matthew Lewis</person> and <person>Edmund Klamann</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/top-news/202602271924RTRSNEWSCOMBINED_KBN3PH2IK-OUSBS_1",
            "pub_date": "2026-02-28 09:51:18",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Anthropic says it will challenge Pentagon's supply chain risk designation in court",
            "description": "\n<p><chron>Feb 27</chron> (Reuters) - Anthropic said on Friday it will challenge in court the Pentagon's decision to declare the AI firm a supply-chain risk, hours after U.S. President Donald Trump also directed every federal agency to stop work with the company.</p>\n<p></p>\n<p> (Reporting by <person>Chris Thomas</person> and <person>Mrinmay Dey</person> in <location value=\"LU/mx.sm.mexcty\" idsrc=\"xmltag.org\" >Mexico City</location>; Editing by <person>Tom Hogue</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602272035RTRSNEWSCOMBINED_KBN3PI01V-OUSBS_1",
            "pub_date": "2026-02-28 09:35:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Paramount to buy Warner Bros Discovery in $110 billion deal; Netflix out of race",
            "description": "<p><chron>Feb 27</chron> (Reuters) - <org value=\"WBD.NaE\" idsrc=\"xmltag.org\" >Warner Bros Discovery</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='WBD' fmr-param-security-type='Equity'>( WBD )</span> has agreed to be acquired by <org value=\"PSKY.NaE\" idsrc=\"xmltag.org\" >Paramount Skydance</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='PSKY' fmr-param-security-type='Equity'>( PSKY )</span> in a <money>$110 billion</money> deal, ending a high-stakes bidding war after <org value=\"NFLX.NaE\" idsrc=\"xmltag.org\" >Netflix</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NFLX' fmr-param-security-type='Equity'>( NFLX )</span> walked away from its agreement with the HBO Max owner.</p>\n<p>The deal, with an equity value of <money>$81 billion</money>, is expected to close in the third quarter of 2026, the companies said on Friday. Reuters first reported on <org value=\"WBD.NaE\" idsrc=\"xmltag.org\" >Warner Bros Discovery</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='WBD' fmr-param-security-type='Equity'>( WBD )</span> and <org>Paramount</org> signing a deal earlier in the day, citing an audio clip of a global townhall held by the company.</p>\n<p>The merger would create a media powerhouse, combining major studios and networks such as CNN and <org>CBS</org> to compete more aggressively, as streaming has upended the industry by drawing audiences away from traditional linear TV.</p>\n<p>The combined company will boast a film library of over 15,000 titles and popular franchises such as &quot;Game of Thrones,&quot; &quot;Mission Impossible,&quot; &quot;<person>Harry Potter</person>,&quot; and the DC Universe, the companies said in a statement. </p>\n<p><org value=\"NFLX.NaE\" idsrc=\"xmltag.org\" >Netflix</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NFLX' fmr-param-security-type='Equity'>( NFLX )</span> on Thursday declined to match <org>Paramount's</org> latest <money>$31</money>-per-share offer, which <org>Warner Bros</org> deemed superior to the streaming pioneer's <money>$27.75</money>-per-share agreement for its studio and streaming assets. </p>\n<p><org>Warner Bros</org> received the contracts from <org>Paramount</org> on Saturday and within the following two days on non-stop negotiation, it concluded that <org>Paramount's</org> offer was superior, according to a source familiar with negotiations.</p>\n<p><org>Warner Bros</org> did not immediately respond to a Reuters request for comment.</p>\n<p>Shares of <org>Paramount</org> were up around 3% in extended trading, while those of <org value=\"NFLX.NaE\" idsrc=\"xmltag.org\" >Netflix</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NFLX' fmr-param-security-type='Equity'>( NFLX )</span> were down 1%.</p>\n<p><org>Warner Bros</org> shareholders are expected to vote on the proposed merger in early spring of 2026, the companies said.</p>\n<p>The acquisition will be funded by <money>$47 billion</money> in equity from the <org>Ellison Family and RedBird Capital Partners</org>, with additional debt commitments of <money>$54 billion</money> from Bank of America, Citigroup and Apollo. <org>Paramount</org> also plans a rights offering of up to <money>$3.25 billion</money> of Class B stock for existing shareholders.</p>\n<p><org>Paramount</org> and <org>Warner Bros</org> said they expect more than <money>$6 billion</money> in savings, driven by technology integration, corporate efficiencies and streamlining operations. </p>\n<p>While <org>Paramount</org> has won the bidding war for <org value=\"WBD.NaE\" idsrc=\"xmltag.org\" >Warner Bros Discovery</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='WBD' fmr-param-security-type='Equity'>( WBD )</span>, the merger has drawn scrutiny. <location value=\"LS/us.ca\" idsrc=\"xmltag.org\" >California</location> regulators are preparing a vigorous review of the <money>$110 billion</money> deal, which could reshape <location value=\"LU/us.ca.hollyw\" idsrc=\"xmltag.org\" >Hollywood</location>.</p>\n<p><org>Paramount</org>, led by billionaire <person>Larry Ellison's</person> son <person>David Ellison</person>, has deep political connections to the Trump administration, which could help it to get more favorable treatment, some analysts have said.</p>\n<p>California State Attorney General <person>Rob Bonta</person> said on Thursday that <location value=\"LS/us.ca\" idsrc=\"xmltag.org\" >California</location> is already investigating the deal and will be &quot;vigorous&quot; in its review.</p>\n<p><org>Paramount</org> has been in pursuit of <org>Warner Bros</org> since late last year when it launched a hostile campaign to wrest the company from the streaming giant by consistently raising its offer. </p>\n<p>The company, led by billionaire <person>Larry Ellison's</person> son <person>David Ellison</person>, enticed Warner's board back to the bargaining table by raising the possibility of an improved cash offer.</p>\n<p>In its revised bid, <org>Paramount</org> raised the termination fee it would pay should the deal fail to gain regulatory approval to <money>$7 billion</money> from <money>$5.8 billion</money>.</p>\n<p><org>Paramount</org> paid the <money>$2.80 billion</money> termination fee that <org>Warner Bros</org> owed <org value=\"NFLX.NaE\" idsrc=\"xmltag.org\" >Netflix</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NFLX' fmr-param-security-type='Equity'>( NFLX )</span>, the streaming giant said in a regulatory filing on Friday.</p>\n<p>&quot;<org value=\"NFLX.NaE\" idsrc=\"xmltag.org\" >Netflix</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NFLX' fmr-param-security-type='Equity'>( NFLX )</span> is the biggest winner in the <org value=\"WBD.NaE\" idsrc=\"xmltag.org\" >Warner Bros Discovery</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='WBD' fmr-param-security-type='Equity'>( WBD )</span> sweepstakes. <org value=\"NFLX.NaE\" idsrc=\"xmltag.org\" >Netflix</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NFLX' fmr-param-security-type='Equity'>( NFLX )</span> earns a termination fee paid by <org>Paramount</org>. By driving a bidding war, <org value=\"NFLX.NaE\" idsrc=\"xmltag.org\" >Netflix</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NFLX' fmr-param-security-type='Equity'>( NFLX )</span> raised the price <org>Paramount</org> had to pay, which will ultimately burden Paramount-WBD with more debt,&quot; Emarketer analyst <person>Ross Benes</person> said.</p>\n<p>'EU ANTITRUST APPROVAL LIKELY NOT A HURDLE'</p>\n<p><org>Paramount</org> is expected to easily win <org>European Union</org> antitrust approval, with any required divestments likely to be minor, Reuters reported on Friday, citing sources.</p>\n<p>The deal is among <location value=\"LU/us.ca.hollyw\" idsrc=\"xmltag.org\" >Hollywood's</location> biggest media shake-ups and will create one of the largest film studios in the world, allowing <org>Paramount</org> to tap Warner's trove of intellectual property, including franchises such as &quot;Fantastic Beasts&quot; and &quot;The Matrix&quot;.  </p>\n<p>The new company has pledged to maintain both studios, and produce a minimum of 30 theatrical films annually.</p>\n<p>Lawmakers on both sides of the political aisle have, however, raised concerns that any deal to acquire <org>Warner Bros</org> could result in fewer choices and higher prices for consumers. </p>\n<p>Cinema operators are also concerned that combining large <location value=\"LU/us.ca.hollyw\" idsrc=\"xmltag.org\" >Hollywood</location> studios could cost jobs and reduce the number of movies released in theaters.</p>\n<p>&quot;The loss of competition would be a disaster for writers, consumers and the entire entertainment industry. This merger must be blocked,&quot; the <org>Writers Guild of America</org>, a union representing thousands of television and film writers along with other media workers, said in a statement. </p>\n<p> (Reporting by <person>Karol Badohal</person> in <location value=\"LC/pl\" idsrc=\"xmltag.org\" >Poland</location>, <person>Harshita Mary Varghese</person> and <person>Jaspreet Singh</person> in Bengaluru, <person>Dawn Chmielewski</person> in <location value=\"LU/us.ca.losang\" idsrc=\"xmltag.org\" >Los Angeles</location> and <person>Milana Vinn</person> in <location value=\"LU/us.ny.nyc\" idsrc=\"xmltag.org\" >New York</location>; Editing by Arun Koyyur and Shinjini Ganguli)</p>\n",
            "link": "https://www.fidelity.com/news/article/top-news/202602271637RTRSNEWSCOMBINED_KBN3PH2KR-OUSBS_1",
            "pub_date": "2026-02-28 09:15:44",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "BRIEF-AGT Food And Ingredients IPO Consists Of A Treasury Offering Of 18,478,212 Common Shares At A Price Of $23 Per Share",
            "description": "\n<p><chron>Feb 27</chron> (Reuters) -</p>\n<p>* AGT FOOD AND INGREDIENTS: IPO CONSISTS OF A TREASURY\nOFFERING OF\n18,478,212 COMMON SHARES AT A PRICE OF <money>$23</money> PER SHARE</p>\n<p>* AGT FOOD AND INGREDIENTS: SECONDARY OFFERING OF 1,065,288\nCOMMON\nSHARES AT OFFERING PRICE, FOR AGGREGATE GROSS PROCEEDS OF AROUND\n<money>$24.5 MILLION</money></p>\n<p>* AGT FOOD AND INGREDIENTS: FAIRFAX AFFILIATES TO BUY ON\nPRIVATE\nPLACEMENT BASIS 8.7 MILLION SHARES FOR ABOUT <money>$200 MILLION</money>\nSource text:\nFurther company coverage: [ ]</p>\n",
            "link": "https://www.fidelity.com/news/article/default/202602271951RTRSNEWSCOMBINED_FWN3ZN2A7_1",
            "pub_date": "2026-02-28 08:51:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "EQV Ventures Acquisition Corp. Shareholders Approve Business Combination with Presidio",
            "description": "\n<p align=\"center\"><i>Transaction expected to close on or about <chron>March 4, 2026</chron></i></p>  <p><location value=\"LU/us.tx.ftwort\" idsrc=\"xmltag.org\" >Fort Worth, TX</location>, <chron>Feb.  27, 2026</chron>  (GLOBE NEWSWIRE) -- EQV Ventures Acquisition Corp. (“EQV”), a special purpose acquisition company sponsored by <org>EQV Group</org>, is pleased to announce that in an extraordinary general meeting held today, EQV shareholders voted to approve the previously announced business combination with <org>Presidio Investment Holdings LLC</org> (“Presidio” or the “Company”), a differentiated oil and gas operator focused on the acquisition and optimization of mature, producing oil and natural gas assets in <location value=\"LC/us\" idsrc=\"xmltag.org\" >the United States</location>. A Form 8-K disclosing the full voting results will be filed with the <org>Securities and Exchange Commission</org>.</p>  <p align=\"justify\">The closing of the business combination is expected to occur on or about <chron>March 4, 2026</chron>, subject to the satisfaction or waiver of all closing conditions, with shares of the combined entity expected to trade on <org>NYSE</org> under the symbol “FTW” on <chron>March 5, 2026</chron>.</p>  <p align=\"justify\">Shortly following the closing of the Transaction and upon approval of the combined company Board of Directors, Presidio expects to provide formal dividend timing details aligned with its previously announced dividend framework and broader shareholder return strategy, which highlights Presidio’s differentiation as an E&amp;P company with a capital-light platform with minimal reinvestment requirements, enabling a greater portion of cash flow to be returned directly to shareholders. The strategy is underpinned by accretive acquisitions, supported by a favorable M&amp;A environment for purchasing non-core assets at attractive returns.</p>  <p><b>About Presidio</b></p>  <p align=\"justify\">Headquartered in <location value=\"LU/us.tx.ftwort\" idsrc=\"xmltag.org\" >Fort Worth, TX</location>, <location value=\"LU/us.tx.predio\" idsrc=\"xmltag.org\" >Presidio</location> is a leading operator of mature oil and gas wells across the Mid-Continent. The Company is focused exclusively on optimizing existing production and generating sustainable cash flow from low-decline, producing assets.</p>  <p align=\"justify\">Dividends are not guaranteed and may be adjusted, suspended, or discontinued at the discretion of the Board of Directors based on liquidity, legal surplus, business conditions, commodity price volatility, market conditions and other factors.</p>  <p><b>About EQV Ventures Acquisition Corp.</b></p>  <p align=\"justify\">EQV is a blank check company incorporated as a <location value=\"LC/ky\" idsrc=\"xmltag.org\" >Cayman Islands</location> exempted company for the purpose of effecting a merger, amalgamation, share exchange, asset acquisition, share purchase, reorganization or similar business combination with one or more businesses or entities. EQV’s sponsor is an affiliate of <org>EQV Group</org>, which was formed in 2022 and is an active acquirer and operator of proved developed producing oil and gas properties, and currently owns and operates more than 3,500 wells across 10 states.</p>  <p><b>Forward-Looking Statements</b></p>  <p align=\"justify\">This press release includes “forward-looking statements.” These include EQV’s, Presidio Pubco Inc’s (“Pubco”), EQV Resources LLC’s (“EQVR”) or Presidio’s or their management teams’ expectations, hopes, beliefs, intentions or strategies regarding the future. Forward-looking statements may be identified by the use of words such as “estimate,” “plan,” “project,” “forecast,” “intend,” “expect,” “anticipate,” “believe,” “seek,” “potential,” “budget,” “may,” “will,” “could,” “should,” “continue” or other similar expressions that predict or indicate future events or trends or that are not statements of historical matters. These forward-looking statements include, but are not limited to, statements regarding Pubco’s, Presidio’s, EQVR’s and EQV’s expectations with respect to future performance, the timing and amount of any dividend payments; the ability to successfully complete acquisitions on attractive terms, or at all, the capitalization of EQV or Pubco after giving effect to the proposed Business Combination and expectations with respect to the future performance and the success of Pubco following the consummation of the proposed Business Combination. These statements are based on various assumptions, whether or not identified in this press release, and on the current expectations of Pubco’s, Presidio’s, EQVR’s and EQV’s management and are not predictions of actual performance. These forward-looking statements are provided for illustrative purposes only and are not intended to serve as, and must not be relied upon by any investors as, a guarantee, an assurance, a prediction or a definitive statement of fact or probability. Actual events and circumstances are difficult or impossible to predict and will differ from assumptions. Many actual events and circumstances are beyond the control of Pubco, <location value=\"LU/us.tx.predio\" idsrc=\"xmltag.org\" >Presidio</location>, EQVR and EQV. These forward-looking statements are subject to a number of risks and uncertainties, including changes in business, market, financial, political and legal conditions; benefits from hedges and expected production; the inability of the parties to successfully or timely consummate the proposed Business Combination, including the risk that any regulatory approvals are not obtained, are delayed or are subject to unanticipated conditions that could adversely affect Pubco or the expected benefits of the proposed Business Combination; failure to realize the anticipated benefits of the proposed Business Combination, which may be affected by, among other things, competition, the ability of Pubco to grow and manage growth profitably, maintain key relationships and retain its management and key employees; risks related to the uncertainty of the projected financial information with respect to <location value=\"LU/us.tx.predio\" idsrc=\"xmltag.org\" >Presidio</location> or Pubco; risks related to Presidio’s current growth strategy; the occurrence of any event, change or other circumstances that could give rise to the termination of any definitive agreements with respect to the proposed Business Combination; the outcome of any legal proceedings that may be instituted against any of the parties to the potential Business Combination following its announcement and any definitive agreements with respect thereto; changes to the proposed structure of the proposed Business Combination that may be required or appropriate as a result of applicable laws or regulations or as a condition to obtaining regulatory approval of the proposed Business Combination; risks that <location value=\"LU/us.tx.predio\" idsrc=\"xmltag.org\" >Presidio</location> or Pubco may not achieve their expectations; the ability to meet stock exchange listing standards following the proposed Business Combination; the risk that the proposed Business Combination disrupts the current plans and operations of <location value=\"LU/us.tx.predio\" idsrc=\"xmltag.org\" >Presidio</location>; costs related to the potential Business Combination; changes in laws and regulations; risks related to the domestication of EQV as a <location value=\"LS/us.de\" idsrc=\"xmltag.org\" >Delaware</location> corporation; risks related to Pubco’s ability to pay expected dividends; the extent of participation in rollover agreements; the amount of redemption requests made by EQV’s public equity holders; and the ability of EQV or Pubco to issue equity or equity-linked securities or issue debt securities or enter into debt financing arrangements in connection with the proposed Business Combination or in the future. Additional information concerning these and other factors that may impact such forward-looking statements can be found in filings and potential filings by <location value=\"LU/us.tx.predio\" idsrc=\"xmltag.org\" >Presidio</location>, EQV, EQVR or Pubco resulting from the proposed Business Combination with the <org>SEC</org>, including under the heading “Risk Factors” in the Registration Statement on Form S-4 filed by <location value=\"LU/us.tx.predio\" idsrc=\"xmltag.org\" >Presidio</location>, EQVR and <location value=\"LU/us.tx.predio\" idsrc=\"xmltag.org\" >Presidio</location>. If any of these risks materialize or any assumptions prove incorrect, actual results could differ materially from the results implied by these forward-looking statements. There may be additional risks that none of Pubco, <location value=\"LU/us.tx.predio\" idsrc=\"xmltag.org\" >Presidio</location>, EQVR nor EQV presently know or that Pubco, <location value=\"LU/us.tx.predio\" idsrc=\"xmltag.org\" >Presidio</location>, EQVR or EQV currently believe are immaterial that could also cause actual results to differ from those contained in the forward-looking statements. These forward-looking statements are provided for illustrative purposes only and are not intended to serve as and must not be relied on by investors as a guarantee, an assurance, a prediction or a definitive statement of fact or probability.</p>  <p align=\"justify\">In addition, forward-looking statements reﬂect Pubco’s, Presidio’s, EQVR’s and EQV’s expectations, plans or forecasts of future events and views as of the date they are made. Pubco, <location value=\"LU/us.tx.predio\" idsrc=\"xmltag.org\" >Presidio</location>, EQVR and EQV anticipate that subsequent events and developments will cause Pubco’s, Presidio’s, EQVR’s and EQV’s assessments to change. However, while Pubco, <location value=\"LU/us.tx.predio\" idsrc=\"xmltag.org\" >Presidio</location>, EQVR and EQV may elect to update these forward-looking statements at some point in the future, Pubco, <location value=\"LU/us.tx.predio\" idsrc=\"xmltag.org\" >Presidio</location>, EQVR and EQV specifically disclaim any obligation to do so, except as required by law. These forward-looking statements should not be relied upon as representing Pubco’s, Presidio’s, EQVR’s or EQV’s assessments as of any date subsequent to the date they are made. Accordingly, undue reliance should not be placed upon the forward-looking statements. None of Pubco, <location value=\"LU/us.tx.predio\" idsrc=\"xmltag.org\" >Presidio</location>, EQVR or EQV, or any of their respective affiliates have any obligation to update these forward-looking statements other than as required by law.</p>  <p><b>No Offer or Solicitation</b></p>  <p align=\"justify\">This press release shall not constitute a solicitation of any proxy, vote, consent or approval in any jurisdiction in connection with the proposed Business Combination and shall not constitute an offer to sell or a solicitation of an offer to buy the securities of EQV, PIH, EQVR or Pubco, nor shall there be any sale of any such securities in any state or jurisdiction in which such offer, solicitation, or sale would be unlawful prior to registration or qualification under the securities laws of such state or jurisdiction. No offer of securities shall be made except by means of a prospectus meeting the requirements of the Securities Act of 1933, as amended. This press release is restricted by law; it is not intended for distribution to, or use by any person in, any jurisdiction in where such distribution or use would be contrary to local law or regulation.</p>  <p><b>Presidio Media and Investor Contact</b>:</p>  <p>Presidio@icrinc.com</p>  <p><b>For EQV:</b></p>  <p>IR@eqvventures.com </p>  <p>Source: EQV Ventures Acquisition Corp.</p>  Image: https://www.globenewswire.com/newsroom/ti?nf=OTY2MzMwMiM3NDYwNDk3IzUwMDEyNjg5Mw==  <br/> Image: https://ml.globenewswire.com/media/OWIyNWY5ZDctZmUwMi00ZmVkLTk1YmMtODM4M2UwZTViN2MyLTUwMDEyNjg5My0yMDI2LTAyLTI4LWVu/tiny/EQV-Ventures-Acquisition-Corp-.png <p> Image: Primary Logo </p>\nSource: EQV Ventures Acquisition Corp.\n",
            "link": "https://www.fidelity.com/news/article/mergers-and-acquisitions/202602272000PRIMZONEFULLFEED9663302",
            "pub_date": "2026-02-28 09:00:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Trump directs US agencies to toss Anthropic's AI as Pentagon calls startup a supply risk",
            "description": "\n<p>*</p>\n<p>Pentagon labels Anthropic a supply-chain risk, affecting\ndefense\ncontractors</p>\n<p></p>\n<p>*</p>\n<p>Trump threatens further action if Anthropic is not helpful</p>\n<p></p>\n<p>*</p>\n<p>President's post orders six-month phase-out of Anthropic\ntechnology across government</p>\n<p>(Adds legal expert comment in paragraphs 7-8, background)</p>\n<p>By Andrea Shalal, <person>Jeffrey Dastin</person> and <person>Ryan Patrick Jones</person></p>\n<p><location value=\"LU/us.dc.wash\" idsrc=\"xmltag.org\" >WASHINGTON</location>, <chron>Feb 27</chron> (Reuters) - U.S. President Donald\nTrump said on Friday he is directing the government to stop work\nwith Anthropic and the Pentagon said it will declare the startup\na supply-chain risk, dealing a major blow to the artificial\nintelligence lab after a showdown about technology guardrails.</p>\n<p>Trump added there would be a six-month phase-out for the\n<org>Defense Department</org> and other agencies that use the company's\nproducts. If Anthropic does not help with the transition, Trump\nsaid, he would use &quot;the <org>Full Power</org> of the Presidency to make\nthem comply, with major civil and criminal consequences to\nfollow.&quot;</p>\n<p>Spokespeople for Anthropic, which won up to <money>$200 million</money>\nfrom the Pentagon in a contract last year, did not immediately\nrespond to a request for comment.\nThe planned designation as a supply-chain risk, announced by\nDefense Secretary <person>Pete Hegseth</person>, means that contractors could be\nbarred from deploying Anthropic's AI as part of work for the\nPentagon. The defense industrial base includes tens of thousands\nof contractors, including major public companies.\nThe designation is typically reserved for suppliers from\nadversary nations. Such action was taken to remove Chinese tech\ngiant Huawei from the Pentagon's supply chains: Starting in\n2017, the U.S. restricted <org>Defense Department</org> use of Huawei\nequipment, prohibited federal agencies from purchasing its\ntechnology, and halted federal grant and loan funds for Huawei\nequipment.</p>\n<p>Anthropic could launch a court challenge to the designation,\nwhich poses an existential threat to its business with the\ngovernment and may harm its private-sector relationships,\naccording to <person>Franklin Turner</person>, an attorney who specializes in\ngovernment contracts.</p>\n<p>&quot;Blacklisting Anthropic is the contractual equivalent of\nnuclear war,&quot; he said.</p>\n<p></p>\n<p>WEAPONS, SURVEILLANCE CONCERNS\nThe Pentagon had set a Friday deadline to resolve an escalating\nfeud with <location value=\"LU/us.ca.sanfrn\" idsrc=\"xmltag.org\" >San Francisco</location>-based Anthropic over how the military\ncould use AI at war.\nAI leader Anthropic has raced to win fierce competition to sell\nnovel technology to businesses and government, particularly for\nnational security, ahead of a widely expected initial public\noffering. The company has said it has not finalized an IPO\ndecision.</p>\n<p>At the same time, the battle over technological guardrails\nhad raised concerns that the <org>Defense Department</org> would follow\nU.S. law but few other constraints when deploying AI for\nnational-security missions, regardless of safety or ethics terms\nrequired by the technology's developers.</p>\n<p>Anthropic had sought guarantees that its AI would not be\nused for fully autonomous weapons or for mass domestic\nsurveillance - applications in which the Pentagon has said it\nhad no interest.</p>\n<p>Anthropic was the first frontier AI lab to put its models on\nclassified networks via cloud provider <org value=\"AMZN.NaE\" idsrc=\"xmltag.org\" >Amazon.com</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AMZN' fmr-param-security-type='Equity'>( AMZN )</span> and\nthe first to build customized models for national security\ncustomers, the startup has said.</p>\n<p>Its product Claude is in use across the intelligence\ncommunity and armed services.</p>\n<p>U.S. Senator <person>Mark Warner</person>, a Democrat and vice chairman of\nthe <org>Select Committee on Intelligence</org>, criticized the action\ntaken by Trump, a Republican.</p>\n<p>&quot;The president's directive to halt the use of a leading\nAmerican AI company across the federal government, combined with\ninflammatory rhetoric attacking that company, raises serious\nconcerns about whether national security decisions are being\ndriven by careful analysis or political considerations.&quot;</p>\n<p>Tech companies and the Pentagon have repeatedly locked horns\nsince at least 2018, when employees at Alphabet's\nGoogle protested against the Pentagon's use of the company's AI\nto analyze drone footage. A rapprochement ensued with companies\nincluding <org value=\"AMZN.NaE\" idsrc=\"xmltag.org\" >Amazon</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AMZN' fmr-param-security-type='Equity'>( AMZN )</span> and <org value=\"MSFT.NaE\" idsrc=\"xmltag.org\" >Microsoft</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='MSFT' fmr-param-security-type='Equity'>( MSFT )</span> jousting for defense\nbusiness, while several big-tech CEOs pledged cooperation last\nyear with the Trump administration.</p>\n<p>But theoretical &quot;killer robots&quot; have remained a concern held\nby human-rights and technology activists. At the same time,\n<location value=\"LC/ua\" idsrc=\"xmltag.org\" >Ukraine</location> and <location value=\"LU/il..gaza\" idsrc=\"xmltag.org\" >Gaza</location> have become theaters for increasingly automated\nsystems on the battlefield.</p>\n<p>(Reporting by <person>Jeffrey Dastin</person> in <location value=\"LU/us.ca.sanfrn\" idsrc=\"xmltag.org\" >San Francisco</location>, <person>Ryan Patrick\nJones</person> in <location value=\"LU/ca.on.tornto\" idsrc=\"xmltag.org\" >Toronto</location>, Andrea Shalal, <person>Mike Stone</person> and <person>Chris Sanders</person> in\n<location value=\"LU/us.dc.wash\" idsrc=\"xmltag.org\" >Washington</location>, <person>Jack Queen</person> in <location value=\"LU/us.ny.nyc\" idsrc=\"xmltag.org\" >New York</location> and <person>Ismail Shakil</person> in <location value=\"LU/ca.on.ottawa\" idsrc=\"xmltag.org\" >Ottawa</location>;\nWriting by <person>Daphne Psaledakis</person>; Editing by <person>Caitlin Webber</person>, <person>Matthew\nLewis</person> and <person>Edmund Klamann</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602271924RTRSNEWSCOMBINED_L1N3ZN16U_1",
            "pub_date": "2026-02-28 08:24:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Trump directs US agencies to toss Anthropic's AI as Pentagon calls startup a supply risk",
            "description": "\n<p>By Andrea Shalal, <person>Jeffrey Dastin</person> and <person>Ryan Patrick Jones</person></p>\n<p><location value=\"LU/us.dc.wash\" idsrc=\"xmltag.org\" >WASHINGTON</location>, <chron>Feb 27</chron> (Reuters) - U.S. President Donald Trump said on Friday he is directing the government to stop work with Anthropic and the Pentagon said it will declare the startup a supply-chain risk, dealing a major blow to the artificial intelligence lab after a showdown about technology guardrails.</p>\n<p>Trump added there would be a six-month phase-out for the <org>Defense Department</org> and other agencies that use the company's products. If Anthropic does not help with the transition, Trump said, he would use &quot;the <org>Full Power</org> of the Presidency to make them comply, with major civil and criminal consequences to follow.&quot;</p>\n<p>Spokespeople for Anthropic, which won up to <money>$200 million</money> from the Pentagon in a contract last year, did not immediately respond to a request for comment.</p>\n<p>The planned designation as a supply-chain risk, announced by Defense Secretary <person>Pete Hegseth</person>, means that contractors could be barred from deploying Anthropic's AI as part of work for the Pentagon. The defense industrial base includes tens of thousands of contractors, including major public companies.</p>\n<p>The designation is typically reserved for suppliers from adversary nations. Such action was taken to remove Chinese tech giant Huawei from the Pentagon's supply chains: Starting in 2017, the U.S. restricted <org>Defense Department</org> use of Huawei equipment, prohibited federal agencies from purchasing its technology, and halted federal grant and loan funds for Huawei equipment.</p>\n<p>Anthropic could launch a court challenge to the designation, which poses an existential threat to its business with the government and may harm its private-sector relationships, according to <person>Franklin Turner</person>, an attorney who specializes in government contracts.</p>\n<p>&quot;Blacklisting Anthropic is the contractual equivalent of nuclear war,&quot; he said.</p>\n<p>WEAPONS, SURVEILLANCE CONCERNS</p>\n<p>The Pentagon had set a Friday deadline to resolve an escalating feud with <location value=\"LU/us.ca.sanfrn\" idsrc=\"xmltag.org\" >San Francisco</location>-based Anthropic over how the military could use AI at war.</p>\n<p>AI leader Anthropic has raced to win fierce competition to sell novel technology to businesses and government, particularly for national security, ahead of a widely expected initial public offering. The company has said it has not finalized an IPO decision.</p>\n<p>At the same time, the battle over technological guardrails had raised concerns that the <org>Defense Department</org> would follow U.S. law but few other constraints when deploying AI for national-security missions, regardless of safety or ethics terms required by the technology's developers.</p>\n<p>Anthropic had sought guarantees that its AI would not be used for fully autonomous weapons or for mass domestic surveillance - applications in which the Pentagon has said it had no interest.</p>\n<p>Anthropic was the first frontier AI lab to put its models on classified networks via cloud provider <org value=\"AMZN.NaE\" idsrc=\"xmltag.org\" >Amazon.com</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AMZN' fmr-param-security-type='Equity'>( AMZN )</span> and the first to build customized models for national security customers, the startup has said.</p>\n<p>Its product Claude is in use across the intelligence community and armed services.</p>\n<p>U.S. Senator <person>Mark Warner</person>, a Democrat and vice chairman of the <org>Select Committee on Intelligence</org>, criticized the action taken by Trump, a Republican.</p>\n<p>&quot;The president's directive to halt the use of a leading American AI company across the federal government, combined with inflammatory rhetoric attacking that company, raises serious concerns about whether national security decisions are being driven by careful analysis or political considerations.&quot;</p>\n<p>Tech companies and the Pentagon have repeatedly locked horns since at least 2018, when employees at Alphabet's Google protested against the Pentagon's use of the company's AI to analyze drone footage. A rapprochement ensued with companies including <org value=\"AMZN.NaE\" idsrc=\"xmltag.org\" >Amazon</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AMZN' fmr-param-security-type='Equity'>( AMZN )</span> and <org value=\"MSFT.NaE\" idsrc=\"xmltag.org\" >Microsoft</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='MSFT' fmr-param-security-type='Equity'>( MSFT )</span> jousting for defense business, while several big-tech CEOs pledged cooperation last year with the Trump administration.</p>\n<p>But theoretical &quot;killer robots&quot; have remained a concern held by human-rights and technology activists. At the same time, <location value=\"LC/ua\" idsrc=\"xmltag.org\" >Ukraine</location> and <location value=\"LU/il..gaza\" idsrc=\"xmltag.org\" >Gaza</location> have become theaters for increasingly automated systems on the battlefield. </p>\n<p> (Reporting by <person>Jeffrey Dastin</person> in <location value=\"LU/us.ca.sanfrn\" idsrc=\"xmltag.org\" >San Francisco</location>, <person>Ryan Patrick Jones</person> in <location value=\"LU/ca.on.tornto\" idsrc=\"xmltag.org\" >Toronto</location>, Andrea Shalal, <person>Mike Stone</person> and <person>Chris Sanders</person> in <location value=\"LU/us.dc.wash\" idsrc=\"xmltag.org\" >Washington</location>, <person>Jack Queen</person> in <location value=\"LU/us.ny.nyc\" idsrc=\"xmltag.org\" >New York</location> and <person>Ismail Shakil</person> in <location value=\"LU/ca.on.ottawa\" idsrc=\"xmltag.org\" >Ottawa</location>; Writing by <person>Daphne Psaledakis</person>; Editing by <person>Caitlin Webber</person>, <person>Matthew Lewis</person> and <person>Edmund Klamann</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602271924RTRSNEWSCOMBINED_KBN3PH2IK-OUSBS_1",
            "pub_date": "2026-02-28 08:24:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "TSX Closer: Index Slumps Off a Record High, But Losses Capped On Commodity Prices and Investment In Canada",
            "description": "\n<p><chron>04:15 PM EST</chron>, <chron>02/27/2026</chron> (MT Newswires) -- <org>The Toronto Stock Exchange</org> slumped Friday, mostly on some profit taking after it set six record closes over the prior seven sessions, but losses on the resources-heavy index were capped by higher commodity prices, while investors continue to welcome news of a swing in foreign direct investment into a rare surplus.</p><p>The S&amp;P/TSX Composite Index closed down 161.97 points, or 0.5%, to 34,339.99,  falling off the 17th record close of 2026 set Thursday, with sectors mixed over Friday's session. For a second successive day, Info Tech led decliners , down 2.5%, while Financials was down near 2%. Telecom led gainers, up 1.65%, with Energy, up 1.15% and the Battery Metals Index, up 1.1%, next.</p><p><org>BMO Capital Markets</org> Chief Economist <person>Douglas Porter</person> in his regular Friday 'Talking Points' note noted even as the Canadian economy remains &quot;challenged by relentless trade uncertainty&quot;, the TSX continues to &quot;find its own path&quot;. Prior to Friday's stumble, the index managed to rise more than 1% this week to hit an record high above 34,500 and was up 8% in the first two months of the year. Porter noted a rebound in gold and firmer oil prices assisted, but Q1 bank earnings were also &quot;greeted favourably&quot;. He also noted economy-wide profits rose more than 6% in 2025, topping nominal GDP growth of 4.3% on the year. More broadly, <location value=\"LC/ca\" idsrc=\"xmltag.org\" >Canada</location> may be benefitting from a diversification push away from U.S. markets, where valuations are rich, Porter said.</p><p>Porter cited as just as one small sample of the shift into <location value=\"LC/ca\" idsrc=\"xmltag.org\" >Canada</location> in the past year a &quot;welcome&quot; swing in foreign direct investment into a rare surplus. For Q4 alone, quarterly net FDI inflows were <money>$11.6 billion</money>, driven by M&amp;A activity. Looking at the four-quarter trend reveals that for the first time in more than a decade, and only the second time in the past 18 years, <location value=\"LC/ca\" idsrc=\"xmltag.org\" >Canada</location> had a net inflow in FDI in 2025 of <money>$17.3 billion</money>, Porter noted. For perspective, Porter said that alone would have funded more than half of the current account deficit of <money>$30.4 billion</money> last year. He noted there are three major types of FDI: M&amp;A, greenfield investments, and reinvested earnings. In 2025, the latter remained in a large outflow position of <money>$47 billion</money> &quot;and is normally in a deficit because of <location value=\"LC/ca\" idsrc=\"xmltag.org\" >Canada's</location> large stock of outstanding investments abroad&quot; while M&amp;A was in a large offsetting surplus. Net new FDI investments were, thus,  in a surplus of <money>$17.6 billion</money> for the year, &quot;which is encouraging news for an economy looking for new growth avenues&quot;, Porter added.</p><p>Of commodities, gold rose to the highest in a month Friday following a report U.S. wholesale inflation rose above expectations in January. Gold for April delivery was last seen up <money>US$86.50</money> to to <money>US$5,280.70</money> per ounce, the highest since the record close of <money>US$5,354.80</money> on <chron>Jan. 29</chron>.</p><p>Also, West Texas Intermediate crude oil rose to a six-month high as a third round of talks between the U.S. and <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location> ended with an agreement to meet again next week amid reports <location value=\"LC/ir\" idsrc=\"xmltag.org\" >Iran</location> is balking at U.S. demands it abandon its uranium enrichment program, raising worries President Trump will decide to strike at the OPEC+ member. WTI crude oil for April delivery closed up <money>US$1.81</money> to settle at <money>US$67.02</money> per barrel, the highest since <chron>Aug. 1</chron>, while <person>April Brent</person> crude was up <money>US$1.81</money> to <money>US$72.56</money>.</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/international/202602271615MIDNIGHTUSEQUITY_A3575347",
            "pub_date": "2026-02-28 05:15:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Trump Media considers spinning off Truth Social into public company, reports wider annual loss",
            "description": "\n<p><chron>Feb 27</chron> (Reuters) - <org value=\"DJT.NaE\" idsrc=\"xmltag.org\" >Trump Media &amp; Technology Group</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='DJT' fmr-param-security-type='Equity'>( DJT )</span>\n, founded by U.S. President Donald Trump, is considering\nspinning off its social media platform Truth Social into a\npublicly traded company.</p>\n<p>The company is in discussions with TAE Technologies and\nTexas Ventures Acquisition III about the proposed transaction,\nthe company said on Friday.</p>\n<p>Under the proposal, shares in the spun-off company would be\ndistributed to eligible TMTG shareholders, after which the new\nentity would merge with a special purpose acquisition company.</p>\n<p>This would separate TMTG's social media and digital media\nassets from its recently announced fusion energy venture,\neffectively splitting the company into two publicly traded\nbusinesses with distinct strategies.</p>\n<p>The Truth Social-parent's net loss widened to <money>$712.3 million</money>\nin 2025 from <money>$400.9 million</money> a year earlier, mostly reflecting\nunrealized losses from the company's purchase of bitcoin and\nCronos.</p>\n<p>TMTG ended 2025 with about <money>$2.5 billion</money> in financial assets,\nmore than triple the <money>$776.8 million</money> it had a year earlier, the\ncompany said. Net sales edged up to <money>$3.68 million</money> from <money>$3.62\nmillion</money> in 2024.</p>\n<p>Founded by Trump and known for its Truth Social platform\naimed at conservative audiences, TMTG has faced challenges\nscaling its media business amid competition from larger social\nnetworks and uneven user growth.</p>\n<p>It is now seeking to reposition itself beyond its core Truth\nSocial platform and tap investor interest in emerging energy\ntechnologies.</p>\n<p>TMTG said no definitive agreement has been reached on the\nspin-off and discussions are ongoing.\nIn December, TMTG agreed to merge with TAE in an all-stock deal\nvalued at more than <money>$6 billion</money>, marking a pivot toward fusion\nenergy and the creation of a publicly traded company focused on\ndeveloping utility-scale power plants to help meet rising\nelectricity demand, including from AI data centers.</p>\n<p>TAE Technologies is a <location value=\"LS/us.ca\" idsrc=\"xmltag.org\" >California</location>-based private company\ndeveloping advanced nuclear fusion technology that has raised\nmore than <money>$1 billion</money> from investors, including Alphabet's\nGoogle and <org value=\"CVX.NaE\" idsrc=\"xmltag.org\" >Chevron</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='CVX' fmr-param-security-type='Equity'>( CVX )</span>.</p>\n<p>The startup focuses on a form of fusion designed to produce\nelectricity without releasing large amounts of neutron\nradiation, reducing radioactive waste.\n(Reporting by <person>Akash Sriram</person> and Anhata Rooprai in Bengaluru;\nEditing by <person>Jonathan Ananda</person> and <person>Rod Nickel</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602271901RTRSNEWSCOMBINED_L4N3ZN1VT_1",
            "pub_date": "2026-02-28 08:01:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Trump Media considers spinning off Truth Social into public company, reports wider annual loss",
            "description": "\n<p><chron>Feb 27</chron> (Reuters) - Trump Media &amp; Technology Group, founded by U.S. President Donald Trump, is considering spinning off its social media platform Truth Social into a publicly traded company.</p>\n<p>The company is in discussions with TAE Technologies and Texas Ventures Acquisition III about the proposed transaction, the company said on Friday.</p>\n<p>Under the proposal, shares in the spun-off company would be distributed to eligible TMTG shareholders, after which the new entity would merge with a special purpose acquisition company.</p>\n<p>This would separate TMTG's social media and digital media assets from its recently announced fusion energy venture, effectively splitting the company into two publicly traded businesses with distinct strategies.</p>\n<p>The Truth Social-parent's net loss widened to <money>$712.3 million</money> in 2025 from <money>$400.9 million</money> a year earlier, mostly reflecting unrealized losses from the company's purchase of bitcoin and Cronos.</p>\n<p>TMTG ended 2025 with about <money>$2.5 billion</money> in financial assets, more than triple the <money>$776.8 million</money> it had a year earlier, the company said. Net sales edged up to <money>$3.68 million</money> from <money>$3.62 million</money> in 2024.</p>\n<p>Founded by Trump and known for its Truth Social platform aimed at conservative audiences, TMTG has faced challenges scaling its media business amid competition from larger social networks and uneven user growth.</p>\n<p>It is now seeking to reposition itself beyond its core Truth Social platform and tap investor interest in emerging energy technologies.</p>\n<p>TMTG said no definitive agreement has been reached on the spin-off and discussions are ongoing.</p>\n<p>In December, TMTG agreed to merge with TAE in an all-stock deal valued at more than <money>$6 billion</money>, marking a pivot toward fusion energy and the creation of a publicly traded company focused on developing utility-scale power plants to help meet rising electricity demand, including from AI data centers.</p>\n<p>TAE Technologies is a <location value=\"LS/us.ca\" idsrc=\"xmltag.org\" >California</location>-based private company developing advanced nuclear fusion technology that has raised more than <money>$1 billion</money> from investors, including Alphabet's Google and Chevron.</p>\n<p>The startup focuses on a form of fusion designed to produce electricity without releasing large amounts of neutron radiation, reducing radioactive waste.</p>\n<p>(Reporting by <person>Akash Sriram</person> and Anhata Rooprai in Bengaluru; Editing by <person>Jonathan Ananda</person> and <person>Rod Nickel</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602271901RTRSNEWSCOMBINED_KBN3PH2CX-OUSBS_1",
            "pub_date": "2026-02-28 08:01:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Dominican Republic has over 150 million tons of rare earth deposits, president says",
            "description": "\n<p><location value=\"LU/do..sdomig\" idsrc=\"xmltag.org\" >SANTO DOMINGO</location>, <chron>Feb 27</chron> (Reuters) - The <location value=\"LC/do\" idsrc=\"xmltag.org\" >Dominican Republic</location> has identified rare earth deposits that could position the <location value=\"LR/car\" idsrc=\"xmltag.org\" >Caribbean</location> nation as a significant future supplier of minerals critical to high-tech industries, President <person>Luis Abinader</person> said on Friday.</p>\n<p>Preliminary studies indicate gross deposits exceeding 150 million tons of rare earth elements, comprising 17 metals that can be used in semiconductors, aerospace applications, and military equipment, according to a government statement.</p>\n<p>During his annual State of the Nation address to <org>Congress</org>, Abinader set a goal to finish assessing mineral deposits this year and certify reserves by early next year, a necessary step for large-scale extraction and refining.</p>\n<p>It is unclear how much of the 150 million tons could be viable for commercialization.</p>\n<p>The president linked development of the deposits to a broader strategy of energy transformation and &quot;responsible use of natural resources,&quot; which he said would strengthen Dominican sovereignty, reduce external dependence, cut emissions and boost competitiveness.</p>\n<p><location value=\"LC/us\" idsrc=\"xmltag.org\" >The United States</location> has signaled strong interest in the Dominican deposits, located in the border province of Pedernales.</p>\n<p>U.S. Secretary of State <person>Marco Rubio</person> said in February last year that the world will need access to such resources to develop key technologies in this century, and stressed that the rare earths &quot;belong to the <location value=\"LC/do\" idsrc=\"xmltag.org\" >Dominican Republic</location> and its people,&quot; while offering U.S. support as a partner in their development. </p>\n<p></p>\n<p>(Reporting by <person>Paul Mathiasen</person> in Santo DomingoEditing by <person>Rod Nickel</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602271842RTRSNEWSCOMBINED_KBN3PH2P7-OUSBS_1",
            "pub_date": "2026-02-28 07:42:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Paramount to buy Warner Bros Discovery in $110 billion deal as Netflix bows out of race",
            "description": "<p><chron>Feb 27</chron> (Reuters) - Warner Bros Discovery has agreed to be acquired by Paramount Skydance in a <money>$110 billion</money> deal, ending a high-stakes bidding war after Netflix walked away from its agreement with the HBO Max owner.</p>\n<p>The deal, with an equity value of <money>$81 billion</money>, is expected to close in the third quarter of 2026, the companies said on Friday. Reuters first reported on Warner Bros Discovery and <org>Paramount</org> signing a deal earlier in the day, citing an audio clip of a global townhall held by the company.</p>\n<p>The merger would create a media powerhouse, combining major studios and networks such as CNN and <org>CBS</org> to compete more aggressively, as streaming has upended the industry by drawing audiences away from traditional linear TV.</p>\n<p>The combined company will boast a film library of over 15,000 titles and popular franchises such as &quot;Game of Thrones,&quot; &quot;Mission Impossible,&quot; &quot;<person>Harry Potter</person>,&quot; and the DC Universe, the companies said in a statement. </p>\n<p>Netflix on Thursday declined to match <org>Paramount's</org> latest <money>$31</money>-per-share offer, which <org>Warner Bros</org> deemed superior to the streaming pioneer's <money>$27.75</money>-per-share agreement for its studio and streaming assets. </p>\n<p><org>Warner Bros</org> received the contracts from <org>Paramount</org> on Saturday and within the following two days on non-stop negotiation, it concluded that <org>Paramount's</org> offer was superior, according to a source familiar with negotiations.</p>\n<p><org>Warner Bros</org> did not immediately respond to a Reuters request for comment.</p>\n<p>Shares of <org>Paramount</org> were up around 3% in extended trading, while those of Netflix were down 1%.</p>\n<p><org>Warner Bros</org> shareholders are expected to vote on the proposed merger in early spring of 2026, the companies said.</p>\n<p>The acquisition will be funded by <money>$47 billion</money> in equity from the <org>Ellison Family and RedBird Capital Partners</org>, with additional debt commitments of <money>$54 billion</money> from Bank of America, Citigroup and Apollo. <org>Paramount</org> also plans a rights offering of up to <money>$3.25 billion</money> of Class B stock for existing shareholders.</p>\n<p><org>Paramount</org> and <org>Warner Bros</org> said they expect more than <money>$6 billion</money> in savings, driven by technology integration, corporate efficiencies and streamlining operations. </p>\n<p>While <org>Paramount</org> has won the bidding war for Warner Bros Discovery, the merger has drawn scrutiny. <location value=\"LS/us.ca\" idsrc=\"xmltag.org\" >California</location> regulators are preparing a vigorous review of the <money>$110 billion</money> deal, which could reshape <location value=\"LU/us.ca.hollyw\" idsrc=\"xmltag.org\" >Hollywood</location>.</p>\n<p><org>Paramount</org>, led by billionaire <person>Larry Ellison's</person> son <person>David Ellison</person>, has deep political connections to the Trump administration, which could help it to get more favorable treatment, some analysts have said.</p>\n<p>California State Attorney General <person>Rob Bonta</person> said on Thursday that <location value=\"LS/us.ca\" idsrc=\"xmltag.org\" >California</location> is already investigating the deal and will be &quot;vigorous&quot; in its review.</p>\n<p><org>Paramount</org> has been in pursuit of <org>Warner Bros</org> since late last year when it launched a hostile campaign to wrest the company from the streaming giant by consistently raising its offer. </p>\n<p>The company, led by billionaire <person>Larry Ellison's</person> son <person>David Ellison</person>, enticed Warner's board back to the bargaining table by raising the possibility of an improved cash offer.</p>\n<p>In its revised bid, <org>Paramount</org> raised the termination fee it would pay should the deal fail to gain regulatory approval to <money>$7 billion</money> from <money>$5.8 billion</money>.</p>\n<p><org>Paramount</org> paid the <money>$2.80 billion</money> termination fee that <org>Warner Bros</org> owed Netflix, the streaming giant said in a regulatory filing on Friday.</p>\n<p>&quot;Netflix is the biggest winner in the Warner Bros Discovery sweepstakes. Netflix earns a termination fee paid by <org>Paramount</org>. By driving a bidding war, Netflix raised the price <org>Paramount</org> had to pay, which will ultimately burden Paramount-WBD with more debt,&quot; Emarketer analyst <person>Ross Benes</person> said.</p>\n<p>'EU ANTITRUST APPROVAL LIKELY NOT A HURDLE'</p>\n<p><org>Paramount</org> is expected to easily win <org>European Union</org> antitrust approval, with any required divestments likely to be minor, Reuters reported on Friday, citing sources.</p>\n<p>The deal is among <location value=\"LU/us.ca.hollyw\" idsrc=\"xmltag.org\" >Hollywood's</location> biggest media shake-ups and will create one of the largest film studios in the world, allowing <org>Paramount</org> to tap Warner's trove of intellectual property, including franchises such as &quot;Fantastic Beasts&quot; and &quot;The Matrix&quot;.  </p>\n<p>The new company has pledged to maintain both studios, and produce a minimum of 30 theatrical films annually.</p>\n<p>Lawmakers on both sides of the political aisle have, however, raised concerns that any deal to acquire <org>Warner Bros</org> could result in fewer choices and higher prices for consumers. </p>\n<p>Cinema operators are also concerned that combining large <location value=\"LU/us.ca.hollyw\" idsrc=\"xmltag.org\" >Hollywood</location> studios could cost jobs and reduce the number of movies released in theaters.</p>\n<p>&quot;The loss of competition would be a disaster for writers, consumers and the entire entertainment industry. This merger must be blocked,&quot; the <org>Writers Guild of America</org>, a union representing thousands of television and film writers along with other media workers, said in a statement. </p>\n<p> (Reporting by <person>Karol Badohal</person> in <location value=\"LC/pl\" idsrc=\"xmltag.org\" >Poland</location>, <person>Harshita Mary Varghese</person> and <person>Jaspreet Singh</person> in Bengaluru, <person>Dawn Chmielewski</person> in <location value=\"LU/us.ca.losang\" idsrc=\"xmltag.org\" >Los Angeles</location> and <person>Milana Vinn</person> in <location value=\"LU/us.ny.nyc\" idsrc=\"xmltag.org\" >New York</location>; Editing by Arun Koyyur and Shinjini Ganguli)</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602271857RTRSNEWSCOMBINED_KBN3PH2KR-OUSTP_1",
            "pub_date": "2026-02-28 07:57:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "First Commerce Bancorp, Inc. Announces Conclusion of Tender Offer for its Common Stock",
            "description": "\n<p><strong id=\"dateline\"><location value=\"LU/us.nj.lakood\" idsrc=\"xmltag.org\" >LAKEWOOD, NJ</location> / ACCESS Newswire / <chron>February 27, 2026</chron> / </strong><org>First Commerce Bancorp, Inc.</org>, (OTCID:CMRB) (the &quot;Company&quot;) today announced the conclusion of its previously initiated tender offer to repurchase up to 3,000,000 shares of the Company's common stock (&quot;Shares&quot;) at a purchase price of <money>$7.00</money> per Share (the &quot;Tender Offer&quot;). The conclusion of the Tender Offer has occurred with the close of business today, <chron>Friday, February 27, 2026</chron>, at <chron>5:00 P.M. EST</chron>.</p><p><org>Performance Trust Capital Partners, LLC</org>, served as Deal Manager for the Tender Offer. <org>Computershare, Inc.</org> served as the Depositary for the Tender Offer while <org>Georgeson, LLC</org> acted as the Company's Information Agent for the Tender Offer.</p><p>Based on a preliminary count by the Depository and Deal Manager for the Tender Offer, a total of 2,974,738 shares have been validly tendered and not properly withdrawn pursuant to the tender offer, representing approximately 14.9% of the outstanding Shares. All Shares validly tendered cannot be withdrawn and no additional tenders will be accepted.</p><p>This press release is for informational purposes only and is neither an offer to purchase nor a solicitation of an acceptance of securities. No offer, solicitation, purchase, or sale will be made in any jurisdiction in which such offer, solicitation, or sale would be unlawful. The Tender Offer is being made solely pursuant to the terms and conditions set forth in the Offer to Purchase dated <chron>January 28, 2026</chron> (the &quot;Offer to Purchase&quot;), and accompanying materials. Shareholders should read such Offer to Purchase and related materials carefully and in their entirety because they contain important information, including the various terms and conditions of the tender offer.</p><p>This press release contains &quot;forward-looking statements&quot;. Forward-looking statements contain words such as &quot;anticipate,&quot; &quot;believe,&quot; &quot;can,&quot; &quot;would,&quot; &quot;should,&quot; &quot;could,&quot; &quot;may,&quot; &quot;predict,&quot; &quot;seek,&quot; &quot;potential,&quot; &quot;will,&quot; &quot;estimate,&quot; &quot;target,&quot; &quot;plan,&quot; &quot;project,&quot; &quot;continuing,&quot; &quot;ongoing,&quot; &quot;expect,&quot; &quot;intend&quot; or similar expressions that relate to the Company's strategy, plans or intentions. Forward-looking statements involve certain important risks, uncertainties and other factors, any of which could cause actual results to differ materially from those in such statements. Such factors include, without limitation, the &quot;Risk Factors&quot; referenced in the Offer to Purchase and the following additional factors: ability to execute our business strategy; business and economic conditions; economic, market, operational, liquidity, credit and interest rate risks associated with the Company's business; effects of any changes in trade, monetary and fiscal policies and laws; effects of inflation as well as interest rate, securities market and monetary supply fluctuations; changes in consumer spending, borrowings and savings habits; the Company's ability to achieve organic loan and deposit growth and the composition of such growth; changes in sources and uses of funds; increased competition in the financial services industry; the effect of changes in accounting policies and practices; the share price of the Company's stock; ability to maintain or increase market share and control expenses; costs and effects of changes in laws and regulations and of other legal and regulatory developments; technological changes; the timely development and acceptance of new products and services; ability to implement or improve operational management and other internal risk controls and processes and reporting system and procedures; changes in estimates of future loan reserve requirements based upon the periodic review thereof under relevant regulatory and accounting requirements; widespread natural and other disasters, dislocations, political instability, acts of war or terrorist activities, cyberattacks or international hostilities; impact of reputational risk; and success at managing the risks involved in the foregoing items. The Company can give no assurance that any goal or plan or expectation set forth in forward-looking statements can be achieved and readers are cautioned not to place undue reliance on such statements. The forward-looking statements are made as of the date of this press release, and the Company does not intend, and assumes no obligation, to update any forward-looking statement to reflect events or circumstances after the date on which the statement is made or to reflect the occurrence of unanticipated events or circumstances, except as required by applicable law.</p><p>Press Contact:</p><p>Donald Mindiak<br /><org>First Commerce Bancorp, Inc.</org><br /><location value=\"LU/us.nj.lakood\" idsrc=\"xmltag.org\" >Lakewood, NJ</location> 08701<br />(732) 364-0032<br />dmindiak@firstcommercebk.com<br />http://firstcommercebk.com</p><p><strong>SOURCE:</strong> <org>First Commerce Bancorp, Inc.</org></p><br /><br />View the original press release on ACCESS Newswire<br /><br />\n      <img src=\"https://app.accessnewswire.com/img.ashx?id=1142390\" width=\"0\" height=\"0\"/>\n",
            "link": "https://www.fidelity.com/news/article/mergers-and-acquisitions/202602271900ACCESSWRNAPR_____1142390",
            "pub_date": "2026-02-28 08:00:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Trump touts economy, energy in Texas, mum on his favorite in Republican Senate race",
            "description": "<p><location value=\"LU/us.tx.corsti\" idsrc=\"xmltag.org\" >CORPUS CHRISTI, Texas</location>, <chron>Feb 27</chron> (Reuters) - U.S. President Donald Trump touted his economic and fossil fuel agenda in southern <location value=\"LS/us.tx\" idsrc=\"xmltag.org\" >Texas</location> on Friday but was coy about which of three Republican candidates he would back in the state's looming <org>U.S. Senate</org> primary.</p>\n<p>Trump has stayed out of his party's messy <org>U.S. Senate</org> contest ahead of Tuesday's vote. But his visit to <location value=\"LU/us.tx.corsti\" idsrc=\"xmltag.org\" >Corpus Christi</location> placed him near several competitive <org>U.S. House of Representatives</org> districts where Hispanic voters, an important constituency for Republicans nationally, could determine the outcome in November's midterm elections.</p>\n<p>The trip followed a warning from a <location value=\"LS/us.tx\" idsrc=\"xmltag.org\" >Texas</location> Republican who said her recent loss in a state legislature race, despite Trump's endorsement, was a &quot;wake-up call&quot; for the party.</p>\n<p>Trump, wearing a red Make America Great Again hat, spoke to several hundred supporters at a waterfront rally in front of a ship he said had carried Venezuelan oil.</p>\n<p>He made references to &quot;new friend and partner <location value=\"LC/ve\" idsrc=\"xmltag.org\" >Venezuela</location>,&quot; nearly two months after he ordered the U.S. military to arrest Venezuelan President <person>Nicolas Maduro</person> and seize control of the country's oil.</p>\n<p>Trump boasted about his single-minded determination to increase production of fossil fuels blamed for climate change, saying his policies had led to lower gasoline prices and helped boost economic growth. Gas prices are about 4% lower since January last year.</p>\n<p>&quot;We're witnessing a historic American energy boom like we've never seen,&quot; Trump said.</p>\n<p>The president's event springboarded off his State of the Union address, which sought to draw sharp contrasts with Democrats on affordability and immigration enforcement as they aim to gain control of <org>Congress</org> later this year.</p>\n<p>The <location value=\"LU/us.tx.corsti\" idsrc=\"xmltag.org\" >Corpus Christi</location> area is the top exporter of liquefied natural gas in the U.S., with 42% of the product nationwide passing through its port.</p>\n<p>TRUMP MUM ON ENDORSEMENT</p>\n<p>Midterm elections are historically seen as a check on the sitting president, and Trump has warned his agenda will be derailed if his party loses power. But first, Republicans in the deeply conservative state must settle on who they want to represent them in November's general election. </p>\n<p>Public opinion polls show Senator <person>John Cornyn</person>, in office since 2002, trailing two challengers - <location value=\"LS/us.tx\" idsrc=\"xmltag.org\" >Texas</location> Attorney General <person>Ken Paxton</person> and U.S. Representative <person>Wesley Hunt</person> - in <location value=\"LS/us.tx\" idsrc=\"xmltag.org\" >Texas'</location> most cutthroat contest.</p>\n<p>Trump told reporters shortly after arriving that he had &quot;pretty much&quot; decided who to support but would not announce the name.</p>\n<p>During the rally, Trump called both Cornyn and Paxton &quot;great&quot; and said there was &quot;a little bit of a race&quot; between the men.</p>\n<p>&quot;It's going to be an interesting one,&quot; Trump said.</p>\n<p>As he has done several times before, Trump also raised the prospect of seeking an unconstitutional third term as president.</p>\n<p>CAN FORCED REDISTRICTING RESCUE REPUBLICANS?</p>\n<p>At the president's urging last year, <location value=\"LS/us.tx\" idsrc=\"xmltag.org\" >Texas</location> Republicans launched a redistricting fight aimed at improving the party's prospects in U.S. House races. With the new map in effect, Republicans could gain up to five more seats across the state. </p>\n<p>Hispanic voters in south <location value=\"LS/us.tx\" idsrc=\"xmltag.org\" >Texas</location> are key to the party's electoral success, said <location value=\"LU/us.tx.corsti\" idsrc=\"xmltag.org\" >Corpus Christi's</location> state Senator <person>Adam Hinojosa</person>, the first Republican to represent the <location>Rio Grande Valley</location> in the <org>Texas Senate</org> since 1874.</p>\n<p>&quot;We need the job opportunities, we need to make sure that our families are taken care of, we need to be able to afford all of the groceries and things to have a decent lifestyle,&quot; Hinojosa said in an interview.</p>\n<p>Crediting Trump's border policy and pro-oil agenda, Hinojosa said he thought the president's visit would help energize the Republican base.</p>\n<p>Trump has prioritized maximizing U.S. fossil fuel production by rolling back environmental regulations and streamlining permitting for energy projects, benefiting places like southern <location value=\"LS/us.tx\" idsrc=\"xmltag.org\" >Texas</location>.</p>\n<p>Even so, a recent Reuters/Ipsos poll found that 36% of people nationwide approved of Trump's handling of the economy while 56% disapproved. </p>\n<p><person>Mary Campbell</person>, who attended Friday's rally and has two Christmas trees she keeps decorated for Trump year-round, said she was \"very happy with the border&quot; under his presidency. But the economy, she said, \"could use a little more help.\"</p>\n<p>\"I'm sad that prices are not quite controlled yet, but hopefully we're working in that direction,\" Campbell, of <location value=\"LU/us.tx.corsti\" idsrc=\"xmltag.org\" >Corpus Christi</location>, said. \"I have five kids, so you know, I watch some of them struggling.\"</p>\n<p>(Reporting by <person>Bo Erickson</person>, <person>Jarrett Renshaw</person> and <person>Nolan McCaskill</person>; Writing by <person>Bo Erickson</person> and <person>Steve Holland</person>; Editing by <person>Colleen Jenkins</person>, <person>Chris Reese</person>, <person>Rod Nickel</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/us-economy/202602271815RTRSNEWSCOMBINED_KBN3PH15Q-OUSWD_1",
            "pub_date": "2026-02-28 07:15:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "FedEx customers sue company for tariff refunds after US Supreme Court ruling",
            "description": "\n<p>*</p>\n<p><org value=\"FDX.NaE\" idsrc=\"xmltag.org\" >FedEx</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='FDX' fmr-param-security-type='Equity'>( FDX )</span> sued for refunds after <org>Supreme Court</org> tariff ruling</p>\n<p></p>\n<p>*</p>\n<p><org value=\"FDX.NaE\" idsrc=\"xmltag.org\" >FedEx</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='FDX' fmr-param-security-type='Equity'>( FDX )</span> promises refunds if it receives tariff refunds</p>\n<p></p>\n<p>*</p>\n<p>Thousands of companies, including <org value=\"HAS.NaE\" idsrc=\"xmltag.org\" >Hasbro</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='HAS' fmr-param-security-type='Equity'>( HAS )</span>, sue for tariff\nrefunds</p>\n<p></p>\n<p>By <person>Mike Scarcella</person></p>\n<p><location value=\"LU/us.dc.wash\" idsrc=\"xmltag.org\" >WASHINGTON</location>, <chron>Feb 27</chron> (Reuters) - <org value=\"FDX.NaE\" idsrc=\"xmltag.org\" >FedEx</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='FDX' fmr-param-security-type='Equity'>( FDX )</span> was sued in\nfederal court on Friday on behalf of customers seeking refunds\nfrom the global shipping company after the <org>U.S. Supreme Court</org>\nruled this month that President <person>Donald Trump</person> unlawfully imposed\nbillions of dollars in emergency tariffs on imported goods.\nThe proposed class action in the federal court in <location value=\"LU/us.fl.miami\" idsrc=\"xmltag.org\" >Miami,\nFlorida</location>, seeks compensation for potentially millions of shippers\nwho paid import duties and related fees on products that they\nsaid should have entered <location value=\"LC/us\" idsrc=\"xmltag.org\" >the United States</location> duty-free.</p>\n<p><org value=\"FDX.NaE\" idsrc=\"xmltag.org\" >FedEx</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='FDX' fmr-param-security-type='Equity'>( FDX )</span> said in a statement on Friday: \"If refunds are issued\nto <org value=\"FDX.NaE\" idsrc=\"xmltag.org\" >FedEx</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='FDX' fmr-param-security-type='Equity'>( FDX )</span>, we will issue refunds to the shippers and consumers\nwho originally bore those charges.\"</p>\n<p>Friday's lawsuit said <org value=\"FDX.NaE\" idsrc=\"xmltag.org\" >FedEx's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='FDX' fmr-param-security-type='Equity'>( FDX )</span> promise was not legally\nenforceable. \"Our goal is to return to American consumers every\npenny they were improperly charged,\" said <person>John Yanchunis</person>, a\nlawyer for plaintiff <person>Matthew Reiser</person>, a <location value=\"LU/us.fl.miami\" idsrc=\"xmltag.org\" >Miami</location> resident.\n<org value=\"FDX.NaE\" idsrc=\"xmltag.org\" >FedEx</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='FDX' fmr-param-security-type='Equity'>( FDX )</span> is among at least 2,000 companies already suing the\nfederal government in the <org>U.S. Court of International Trade</org> to\nrecover tariffs they paid on imported goods under the\nInternational Emergency Economic Powers Act, known as IEEPA. <org>The\nU.S. Supreme Court</org> ruled on <chron>February 20</chron> in a 6-3 decision that\nTrump overstepped his authority by using the emergency\npowers law to impose sweeping tariffs.</p>\n<p>Reiser, the plaintiff in Friday's lawsuit, said <org value=\"FDX.NaE\" idsrc=\"xmltag.org\" >FedEx</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='FDX' fmr-param-security-type='Equity'>( FDX )</span> billed\nhim <money>$36</money> - <money>$21</money> in IEEPA duties and <money>$15</money> in brokerage and clearance\nfees - for his purchase of tennis shoes from a German retailer.\nThe lawsuit said no duty should have been required.\nOn Friday, toymaker <org value=\"HAS.NaE\" idsrc=\"xmltag.org\" >Hasbro</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='HAS' fmr-param-security-type='Equity'>( HAS )</span> joined the thousands of\ncompanies suing the government for tariff refunds in the <org>U.S.\nCourt of International Trade</org>. French beauty group L'Oreal\n, British vacuum manufacturer Dyson and contact lens\nmaker <org value=\"BLCO.NaE\" idsrc=\"xmltag.org\" >Bausch + Lomb</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='BLCO' fmr-param-security-type='Equity'>( BLCO )</span> also have filed lawsuits, in\naddition to retailers such as Costco and J. Crew.\n(Reporting by <person>Mike Scarcella</person>; Editing by <person>David Bario</person> and <person>Ethan\nSmith</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602271823RTRSNEWSCOMBINED_L6N3ZN19Z_1",
            "pub_date": "2026-02-28 07:23:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "FedEx customers sue company for tariff refunds after US Supreme Court ruling",
            "description": "<p><location value=\"LU/us.dc.wash\" idsrc=\"xmltag.org\" >WASHINGTON</location>, <chron>Feb 27</chron> (Reuters) - <org value=\"FDX.NaE\" idsrc=\"xmltag.org\" >FedEx</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='FDX' fmr-param-security-type='Equity'>( FDX )</span> was sued in federal court on Friday on behalf of customers seeking refunds from the global shipping company after the <org>U.S. Supreme Court</org> ruled this month that President <person>Donald Trump</person> unlawfully imposed billions of dollars in emergency tariffs on imported goods.</p>\n<p>The proposed class action in the federal court in <location value=\"LU/us.fl.miami\" idsrc=\"xmltag.org\" >Miami, Florida</location>, seeks compensation for potentially millions of shippers who paid import duties and related fees on products that they said should have entered <location value=\"LC/us\" idsrc=\"xmltag.org\" >the United States</location> duty-free.</p>\n<p><org value=\"FDX.NaE\" idsrc=\"xmltag.org\" >FedEx</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='FDX' fmr-param-security-type='Equity'>( FDX )</span> said in a statement on Friday: \"If refunds are issued to <org value=\"FDX.NaE\" idsrc=\"xmltag.org\" >FedEx</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='FDX' fmr-param-security-type='Equity'>( FDX )</span>, we will issue refunds to the shippers and consumers who originally bore those charges.\"</p>\n<p>Friday's lawsuit said <org value=\"FDX.NaE\" idsrc=\"xmltag.org\" >FedEx's</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='FDX' fmr-param-security-type='Equity'>( FDX )</span> promise was not legally enforceable. \"Our goal is to return to American consumers every penny they were improperly charged,\" said <person>John Yanchunis</person>, a lawyer for plaintiff Matthew Reiser, a <location value=\"LU/us.fl.miami\" idsrc=\"xmltag.org\" >Miami</location> resident.</p>\n<p><org value=\"FDX.NaE\" idsrc=\"xmltag.org\" >FedEx</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='FDX' fmr-param-security-type='Equity'>( FDX )</span> is among at least 2,000 companies already suing the federal government in the <org>U.S. Court of International Trade</org> to recover tariffs they paid on imported goods under the International Emergency Economic Powers Act, known as IEEPA. <org>The U.S. Supreme Court</org> ruled on <chron>February 20</chron> in a 6-3 decision that Trump overstepped his authority by using the emergency powers law to impose sweeping tariffs.</p>\n<p>Reiser, the plaintiff in Friday's lawsuit, said <org value=\"FDX.NaE\" idsrc=\"xmltag.org\" >FedEx</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='FDX' fmr-param-security-type='Equity'>( FDX )</span> billed him <money>$36</money> - <money>$21</money> in IEEPA duties and <money>$15</money> in brokerage and clearance fees - for his purchase of tennis shoes from a German retailer. The lawsuit said no duty should have been required.</p>\n<p>On Friday, toymaker <org value=\"HAS.NaE\" idsrc=\"xmltag.org\" >Hasbro</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='HAS' fmr-param-security-type='Equity'>( HAS )</span> joined the thousands of companies suing the government for tariff refunds in the <org>U.S. Court of International Trade</org>. French beauty group L'Oreal, British vacuum manufacturer Dyson and contact lens maker <org value=\"BLCO.NaE\" idsrc=\"xmltag.org\" >Bausch + Lomb</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='BLCO' fmr-param-security-type='Equity'>( BLCO )</span> also have filed lawsuits, in addition to retailers such as Costco and J. Crew.</p>\n<p></p>\n<p>(Reporting by <person>Mike Scarcella</person>; Editing by <person>David Bario</person> and <person>Ethan Smith</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602271825RTRSNEWSCOMBINED_KBN3PH2OY-OUSBS_1",
            "pub_date": "2026-02-28 07:25:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Realloys Insider Sold Shares Worth $256,547, According to a Recent SEC Filing",
            "description": "\n<p><chron>06:02 PM EST</chron>, <chron>02/27/2026</chron> (MT Newswires) -- Robert L Winspear, Director, Chief Financial Officer, on <chron>February 26, 2026</chron>, sold 17,000 shares in <org value=\"ALOY.NaE\" idsrc=\"xmltag.org\" >Realloys</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='ALOY' fmr-param-security-type='Equity'>( ALOY )</span>  for <money>$256,547</money>. Following the Form 4 filing with the <org>SEC</org>, Winspear has control over a total of 126,250 common shares of the company, with 126,250 controlled indirectly.</p><p>SEC Filing:</p><p>https://www.sec.gov/Archives/edgar/data/1567900/000110856526000002/xslF345X05/primary_doc.xml</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602271802MIDNIGHTUSEQUITY_A3575504",
            "pub_date": "2026-02-28 07:02:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "BRIEF-Moody's Says Warner Bros. Discovery's Ratings Remain On Review For Downgrade After Paramount Deal",
            "description": "\n<p><chron>Feb 27</chron> (Reuters) - Moody's:</p>\n<p>* MOODY'S RATINGS SAYS WARNER BROS. DISCOVERY, INC.'S\nRATINGS\nREMAIN ON REVIEW FOR DOWNGRADE AFTER THE PARAMOUNT ACQUISITION\nANNOUNCEMENT\nSource text:\nFurther company coverage:</p>\n",
            "link": "https://www.fidelity.com/news/article/mergers-and-acquisitions/202602271805RTRSNEWSCOMBINED_FWN3ZN2GA_1",
            "pub_date": "2026-02-28 07:05:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Research Alert: CFRA Lowers Opinion On Shares Of Adtran Holdings To Sell From Hold",
            "description": "\n<p><chron>03:50 PM EST</chron>, <chron>02/27/2026</chron> (MT Newswires) -- CFRA, an independent research provider, has provided MT Newswires with the following research alert. Analysts at CFRA have summarized their opinion as follows:</p><p>We trim our 12-month target price by <money>$1</money> to <money>$9</money>, applying an EV/revenue multiple of 1.0x to our 2026 estimate, comparable to its three-year historical average multiple of 1.1x. We raise our 2026 EPS estimate by <money>$0.05</money> to <money>$0.48</money> and set 2027's at <money>$0.73</money>. The legislative environment for Huawei replacement in the EU is currently non-compulsory, meaning the transition away from Huawei will take years and may slow market activity until more stringent requirements are enacted. In addition, tightening supply conditions in key components such as memory and optics were highlighted, which could impact costs and supply chain dynamics. Finally, in some European markets, broadband deployment cycles are still at early stages, meaning revenue realization from these projects may be delayed, and some carriers have not started deployments yet.</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/investing-ideas/202602271550MIDNIGHTUSEQUITY_A3575407",
            "pub_date": "2026-02-28 04:50:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "BRIEF-Writer's Guild Of America Says 'Paramount Skydance/ Warner Bros. Discovery Merger Must Be Blocked'",
            "description": "\n<p><chron>Feb 27</chron> (Reuters) - <org value=\"PSKY.NaE\" idsrc=\"xmltag.org\" >Paramount Skydance Corp</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='PSKY' fmr-param-security-type='Equity'>( PSKY )</span>:</p>\n<p>* WRITER'S GUILD OF AMERICA: &quot;<org value=\"PSKY.NaE\" idsrc=\"xmltag.org\" >PARAMOUNT SKYDANCE</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='PSKY' fmr-param-security-type='Equity'>( PSKY )</span>/ <org>WARNER\nBROS</org>.\nDISCOVERY MERGER MUST BE BLOCKED&quot;- STATEMENT</p>\n<p>* WRITER'S GUILD OF AMERICA ON PARAMOUNT/ WBD MERGER: &quot;LOSS\nOF\nCOMPETITION WOULD BE A DISASTER FOR WRITERS, CONSUMERS &amp; ENTIRE\nENTERTAINMENT INDUSTRY&quot;\nFurther company coverage:</p>\n",
            "link": "https://www.fidelity.com/news/article/mergers-and-acquisitions/202602271756RTRSNEWSCOMBINED_FWN3ZN2A6_1",
            "pub_date": "2026-02-28 06:56:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Judge blocks Virginia law restricting social media for children",
            "description": "\n<p>*</p>\n<p>Judge cites First Amendment in issuing injunction</p>\n<p></p>\n<p>*</p>\n<p>Judge found law both overinclusive and underinclusive</p>\n<p></p>\n<p>*</p>\n<p><location value=\"LS/us.va\" idsrc=\"xmltag.org\" >Virginia</location> pledges to help parents protect children</p>\n<p></p>\n<p>By <person>Jonathan Stempel</person></p>\n<p><chron>Feb 27</chron> (Reuters) - A federal judge on Friday blocked\n<location value=\"LS/us.va\" idsrc=\"xmltag.org\" >Virginia</location> from enforcing a new law that aimed to protect children\nfrom being addicted to social media by requiring age\nverification and limiting use by those under 16 to one hour per\nday.\nU.S. District Judge <person>Patricia Tolliver Giles</person> in <location value=\"LU/us.va.alxdra\" idsrc=\"xmltag.org\" >Alexandria,\nVirginia</location>, said the technology trade group NetChoice was likely\nto establish that the law unconstitutionally infringed the free\nspeech rights of adults, children and its dozens of members,\nincluding Google, <org value=\"META.NaE\" idsrc=\"xmltag.org\" >Meta Platforms</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='META' fmr-param-security-type='Equity'>( META )</span>, <org value=\"NFLX.NaE\" idsrc=\"xmltag.org\" >Netflix</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='NFLX' fmr-param-security-type='Equity'>( NFLX )</span>\n, <person>Reddit and Elon Musk's</person> X.</p>\n<p>The judge issued a preliminary injunction against the law\nknown as Senate Bill 854, which had been signed last May by\nthen-Governor <person>Glenn Youngkin</person>, a Republican, and took effect on\n<chron>January 1, 2026</chron>.\nNetChoice has also challenged similar laws in states, including\n<location value=\"LS/us.ca\" idsrc=\"xmltag.org\" >California</location>.</p>\n<p><location value=\"LS/us.va\" idsrc=\"xmltag.org\" >Virginia</location> argued that the law was reasonably tailored to\nprotect children from the &quot;addictive features&quot; of social media,\nand address a mental health crisis among youth.</p>\n<p>But the judge said that notwithstanding <location value=\"LS/us.va\" idsrc=\"xmltag.org\" >Virginia's</location> interest\nin protecting children, the law was both overinclusive by\nrequiring everyone, including adults, to verify their age, and\nunderinclusive by exempting potentially addictive interactive\ngaming from coverage.</p>\n<p>She also said the law treats &quot;functionally equivalent&quot;\nspeech differently by preventing children from watching, for\nexample, science, history and church programming lasting more\nthan an hour that they could watch elsewhere, including\nstreaming platforms.</p>\n<p>&quot;The court recognizes the Commonwealth's compelling interest\nin protecting its youth from the harms associated with the\naddictive aspects of social media,&quot; wrote Giles, an appointee of\nformer Democratic President <person>Joe Biden</person>. &quot;However, it cannot\ninfringe on First Amendment rights, including those of the same\nyouth it aims to protect.&quot;</p>\n<p><person>Rae Pickett</person>, a spokesperson for <location value=\"LS/us.va\" idsrc=\"xmltag.org\" >Virginia's</location> Democratic\nAttorney General <person>Jay Jones</person>, said after the decision: &quot;We look\nforward to continuing to enforce laws that empower parents to\nprotect their children from the proven harms that can come\nthrough social media.&quot;</p>\n<p><person>Paul Taske</person>, co-director of the NetChoice Litigation Center,\nwelcomed the decision.</p>\n<p>&quot;This ruling reaffirms that the government cannot ration\naccess to lawful speech - even if it has noble intentions,&quot; he\nsaid in a statement. &quot;Fundamentally, parents must stay in the\ndriver's seat when it comes to decisions about their families.&quot;\n(Reporting by <person>Jonathan Stempel</person> in <location value=\"LU/us.ny.nyc\" idsrc=\"xmltag.org\" >New York</location>; Additional reporting\nby <person>Nate Raymond</person> in <location value=\"LU/us.ma.boston\" idsrc=\"xmltag.org\" >Boston</location>; Editing by <person>Nick Zieminski</person> and <person>Ethan\nSmith</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602271758RTRSNEWSCOMBINED_L1N3ZN1BK_1",
            "pub_date": "2026-02-28 06:58:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Trump directs US agencies to toss Anthropic's AI as Pentagon calls startup a supply risk",
            "description": "\n<p>By Andrea Shalal, <person>Jeffrey Dastin</person> and <person>Ryan Patrick Jones</person></p>\n<p><location value=\"LU/us.dc.wash\" idsrc=\"xmltag.org\" >WASHINGTON</location>, <chron>Feb 27</chron> (Reuters) - U.S. President Donald Trump said on Friday he is directing every federal agency to stop work with artificial intelligence lab Anthropic while the Pentagon declared it a supply-chain risk, capping a weeks-long fight over technology guardrails in an apparent blow to the startup's business.</p>\n<p>In a post on Truth Social, Trump said, &quot;I am directing <org>EVERY Federal Agency</org> in the <org>United States Government</org> to IMMEDIATELY CEASE all use of Anthropic's technology. We don't need it, we don't want it, and will not do business with them again!&quot;</p>\n<p>He added there would be a six-month phaseout for the <org>Defense Department</org> and other agencies that use the company's products.</p>\n<p>Meanwhile, the Pentagon's supply-chain risk designation, typically reserved for companies in adversary nations, means that defense contractors could be barred from deploying Anthropic's AI as part of work for the Pentagon. The defense industrial base includes tens of thousands of contractors, including major public companies.</p>\n<p>The actions were pegged to a Friday deadline that the Pentagon set to resolve an escalating feud with <location value=\"LU/us.ca.sanfrn\" idsrc=\"xmltag.org\" >San Francisco</location>-based Anthropic, over concerns about how the military could use AI at war.</p>\n<p>Spokespeople for Anthropic, which won a <money>$200 million</money> ceiling Pentagon contract last year, did not immediately respond to a request for comment.</p>\n<p>Trump's announcement stopped short of the Pentagon's threat that it could invoke the Defense Production Act to require Anthropic's compliance. But the U.S. president vowed further action if Anthropic did not cooperate going forward.</p>\n<p>Trump warned he would use &quot;the Full Power of the Presidency to make them comply, with major civil and criminal consequences to follow&quot; if Anthropic did not help with the phaseout of its technology.</p>\n<p>WEAPONS, SURVEILLANCE CONCERNS</p>\n<p>The setback comes as AI leader Anthropic raced to win a fierce competition selling novel technology to businesses and government, particularly for national security, ahead of its widely expected initial public offering. The company has said it has not finalized an IPO decision.</p>\n<p>At the same time, the battle over technological guardrails had raised concerns that the <org>Department of Defense</org> would follow U.S. law but little other constraint when deploying AI for national-security missions, regardless of safety or ethics service terms embraced by the technology's developers.</p>\n<p>Anthropic had sought guarantees that its AI would not be used for fully autonomous weapons or for mass domestic surveillance - applications in which the Pentagon has said it had no interest. </p>\n<p>Anthropic was the first frontier AI lab to put its models on classified networks via cloud provider <org value=\"AMZN.NaE\" idsrc=\"xmltag.org\" >Amazon.com</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AMZN' fmr-param-security-type='Equity'>( AMZN )</span> and the first to build customized models for national security customers, the startup has said.</p>\n<p>Its product Claude is in use across the intelligence community and armed services.</p>\n<p>U.S. Senator <person>Mark Warner</person>, a Democrat and vice chairman of the <org>Select Committee on Intelligence</org>, criticized the action taken by Trump, a Republican.</p>\n<p>\"The president's directive to halt the use of a leading American AI company across the federal government, combined with inflammatory rhetoric attacking that company, raises serious concerns about whether national security decisions are being driven by careful analysis or political considerations.&quot;</p>\n<p>The conflict is the latest eruption in a saga that dates back at least to 2018. That year, employees at Alphabet's Google protested the Pentagon's use of the company's AI to analyze drone footage, straining relations between <location>Silicon Valley</location> and <location value=\"LU/us.dc.wash\" idsrc=\"xmltag.org\" >Washington</location>. A rapprochement ensued, with companies including <org value=\"AMZN.NaE\" idsrc=\"xmltag.org\" >Amazon</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AMZN' fmr-param-security-type='Equity'>( AMZN )</span> and <org value=\"MSFT.NaE\" idsrc=\"xmltag.org\" >Microsoft</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='MSFT' fmr-param-security-type='Equity'>( MSFT )</span> jousting for defense business, and still more CEOs pledging cooperation last year with the Trump administration.</p>\n<p>But theoretical &quot;killer robots&quot; have remained a concern held by human-rights and technology activists. At the same time, <location value=\"LC/ua\" idsrc=\"xmltag.org\" >Ukraine</location> and <location value=\"LU/il..gaza\" idsrc=\"xmltag.org\" >Gaza</location> have become theaters for increasingly automated systems on the battlefield. </p>\n<p>(Reporting by <person>Jeffrey Dastin</person> in <location value=\"LU/us.ca.sanfrn\" idsrc=\"xmltag.org\" >San Francisco</location>, <person>Ryan Patrick Jones</person> in <location value=\"LU/ca.on.tornto\" idsrc=\"xmltag.org\" >Toronto</location>, Andrea Shalal in <location value=\"LU/us.dc.wash\" idsrc=\"xmltag.org\" >Washington</location> and <person>Ismail Shakil</person> in <location value=\"LU/ca.on.ottawa\" idsrc=\"xmltag.org\" >Ottawa</location>; Writing by <person>Daphne Psaledakis</person>; Editing by <person>Caitlin Webber</person> and <person>Matthew Lewis</person>)</p>\n",
            "link": "https://www.fidelity.com/news/article/top-news/202602271642RTRSNEWSCOMBINED_KBN3PH2IK-OUSBS_1",
            "pub_date": "2026-02-28 07:11:27",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Arteris Insider Sold Shares Worth $1,545,260, According to a Recent SEC Filing",
            "description": "\n<p><chron>05:31 PM EST</chron>, <chron>02/27/2026</chron> (MT Newswires) -- <person>Saiyed Atiq Raza</person>, Director, on <chron>February 25, 2026</chron>, sold 90,279 shares in <org value=\"AIP.NaE\" idsrc=\"xmltag.org\" >Arteris</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='AIP' fmr-param-security-type='Equity'>( AIP )</span>  for <money>$1,545,260</money>. Following the Form 4 filing with the <org>SEC</org>, Raza has control over a total of 520,560 common shares of the company, with 20,839 shares held directly and 499,721 controlled indirectly.</p><p>SEC Filing:</p><p>https://www.sec.gov/Archives/edgar/data/1667011/000118456326000001/xslF345X05/primarydocument.xml</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602271731MIDNIGHTUSEQUITY_A3575488",
            "pub_date": "2026-02-28 06:31:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Live Oak Bancshares Insider Sold Shares Worth $786,999, According to a Recent SEC Filing",
            "description": "\n<p><chron>05:36 PM EST</chron>, <chron>02/27/2026</chron> (MT Newswires) -- James S Mahan III, 10% Owner, Director, Chief Executive Officer, on <chron>February 25, 2026</chron>, sold 20,000 shares in <org value=\"LOB.NaE\" idsrc=\"xmltag.org\" >Live Oak Bancshares</org> <span fmr-attach-component='fmr.qnr.components.snapshot.Mini' fmr-param-symbol='LOB' fmr-param-security-type='Equity'>( LOB )</span>  for <money>$786,999</money>. Following the Form 4 filing with the <org>SEC</org>, Mahan has control over a total of 6,414,875 voting common shares of the company, with 6,414,875 controlled indirectly.</p><p>SEC Filing:</p><p>https://www.sec.gov/Archives/edgar/data/1462120/000103674326000009/xslF345X05/wk-form4_1772231660.xml</p>\n<p/>\n<p class=\"shirttail\">MT Newswires does not provide investment advice. Unauthorized reproduction is strictly prohibited.</p>\n",
            "link": "https://www.fidelity.com/news/article/company-news/202602271736MIDNIGHTUSEQUITY_A3575492",
            "pub_date": "2026-02-28 06:36:00",
            "source": "fidelity",
            "kind": 1,
            "language": "en"
        }
    ]
}