{
    "data": [
        {
            "id": 5757563,
            "title": "Let's not throw the DEI baby out with the bathwater",
            "description": "<p>Conservative attacks on diversity, equity and inclusion accelerated sharply following the Supreme Court’s <a href=\"https://www.supremecourt.gov/opinions/22pdf/20-1199_hgdj.pdf\" rel=\"noreferrer noopener\" target=\"_blank\">2023 decision</a> ending the use of race in admissions in higher education. Writing for the majority, Chief Justice John Roberts declared that the educational benefits of diversity are not “sufficiently coherent” to pass constitutional muster.   </p>\n<p>In the last two years, critics have blamed DEI for just about everything, from the <a href=\"https://www.forbes.com/sites/janicegassam/2024/03/27/baltimore-bridge-collapse-creates-more-dei-attacks-how-allies-can-push-back/\" rel=\"noreferrer noopener\" target=\"_blank\">collapse of the Francis Scott Key Memorial Bridge</a> to the scale of the <a href=\"https://www.npr.org/2025/01/10/nx-s1-5252757/california-wildfires-dei-diversity-influencers-firefighters\" rel=\"noreferrer noopener\" target=\"_blank\">Los Angeles wildfires</a>. President Trump even suggested that DEI hires at the Federal Aviation Administration may have <a href=\"https://www.fox5dc.com/news/trump-blames-dei-dc-plane-crash\" rel=\"noreferrer noopener\" target=\"_blank\">caused last year’s fatal midair collision</a> between an American Airlines jet and a military helicopter. </p>\n<p>From the moment he returned to office, Trump has waged an all-out assault on “<a href=\"https://www.whitehouse.gov/presidential-actions/2025/01/ending-radical-and-wasteful-government-dei-programs-and-preferencing/?utm_source=chatgpt.com\" rel=\"noreferrer noopener\" target=\"_blank\">illegal and immoral discrimination programs</a>, going by the name ‘diversity, equity, and inclusion.’” His administration has <a href=\"https://time.com/7342386/trump-government-cuts-foreign-aid-health-climate-workers/\" rel=\"noreferrer noopener\" target=\"_blank\">closed DEI offices and programs</a> across the federal government, <a href=\"https://www.cnn.com/2025/03/26/business/dei-fcc-media#:~:text=The%20Trump%20administration%20has%20dismantled,is%20the%20point%2C%20Goldstein%20said.\" rel=\"noreferrer noopener\" target=\"_blank\">pressured private companies</a> to follow suit, and weaponized federal funding and civil rights investigations to <a href=\"https://thehill.com/homenews/education/5703373-trump-colleges-dei/\" rel=\"noreferrer noopener\" target=\"_blank\">compel colleges and universities</a> to abandon “racial preferences” in admissions, financial aid and hiring. At least <a href=\"https://www.campusreform.org/article/campus-reforms-anti-dei-legislation-tracker/27589\" rel=\"noreferrer noopener\" target=\"_blank\">22 states have piled on</a> with their own anti-DEI legislation. </p>\n<p>In “<a href=\"https://yalebooks.yale.edu/book/9780300279894/the-diversity-principle/\" rel=\"noreferrer noopener\" target=\"_blank\">The Diversity Principle: The Story of a Transformative Idea</a>,” David B. Oppenheimer, a clinical professor of law at the University of California, Berkeley, challenges Roberts’s view by tracing claims over the last two centuries that <a href=\"https://www.law.berkeley.edu/event/the-diversity-principle-with-professor-david-oppenheimer/\" rel=\"noreferrer noopener\" target=\"_blank\">diverse groups outperform homogeneous ones</a> in “solving problems, making discoveries, teaching and learning from each other and improving democratic discourse.”</p>\n<p>The Supreme Court began to focus on the educational benefits of diversity in 1978, he reminds us, when Allen Bakke, a White man, alleged he had been denied admission to the University of California at Davis medical school in favor of less qualified minority applicants.  </p>\n<p>In <a href=\"https://supreme.justia.com/cases/federal/us/438/265/\" rel=\"noreferrer noopener\" target=\"_blank\">Regents of the University of California v. Bakke</a>, four justices wanted to strike down the university’s quota system as a violation of the 1964 Civil Rights Act. The four liberal justices voted to uphold the system as a means to remedy the effects of societal discrimination.</p>\n<p>Relying heavily on a brief authored by former Solicitor General Archibald Cox in an earlier case, Justice Lewis Powell held that universities have a First Amendment interest in assembling diverse student bodies <a href=\"https://www.californialawreview.org/print/diversity-to-deradicalize#:~:text=The%20conventional%20answer%20is%20that,democracy%20and%20the%20capitalist%20system.\" rel=\"noreferrer noopener\" target=\"_blank\">to foster the “robust exchange of ideas”</a> central to their mission.  </p>\n<p>Although Powell’s reasoning stood alone, later decisions adopted it, making the “diversity principle” the constitutional foundation for affirmative action. Over time, it became the basis for DEI programs in business, government and the military as well as higher education. </p>\n<p>Powell’s critics think the educational-benefits rationale is a more “fragile basis” than the need to remedy past discrimination for a policy as important and controversial as affirmative action.</p>\n<p>In our view, both Justice Powell and his critics were right.</p>\n<p>As Oppenheimer demonstrates, numerous studies indicate that diversity enhances group performance. He also points to research showing that “surface-level diversity that is easily identifiable (such as racial and gender diversity) is beneficial,” in part because members of homogeneous groups may be less willing to voice dissenting views.</p>\n<p>In what came to be known as the “business case” for diversity, studies by McKinsey &amp; Company and others found a strong positive relationship between diversity at the executive level and higher corporate earnings. As recently as 2022, 80 percent of Fortune 500 companies cited the <a href=\"https://www.chicagobooth.edu/review/do-diverse-leadership-teams-produce-better-performance\" rel=\"noreferrer noopener\" target=\"_blank\">expectation of improved performance</a> as their principal justification for diversity-related hiring.</p>\n<p>Oppenheimer acknowledges, however, that “not every study supports the proposition that diversity produces value.” A <a href=\"https://www.chicagobooth.edu/review/do-diverse-leadership-teams-produce-better-performance\" rel=\"noreferrer noopener\" target=\"_blank\">2024 study</a>, for example, argues that better financial performance leads to greater diversity, not the other way around. </p>\n<p>In higher education, diversity of all kinds — including race, gender, sexual orientation, socioeconomic, geographic and viewpoint — can benefit students’ learning. But we also agree with the four liberal justices in Bakke that the need to remedy societal discrimination offers a stronger constitutional basis for affirmative action and DEI programs.</p>\n<p>Critics of DEI bristle whenever anyone asserts that racism in the U.S. is systemic. But as Oppenheimer demonstrates, the evidence that past and present discrimination produces “interrelated and compounding disadvantages” is overwhelming. Disparities in housing, education, health care and wealth have built up over decades.</p>\n<p>The <a href=\"https://www.washingtonpost.com/business/2026/02/21/black-homeownership-singletary/\" rel=\"noreferrer noopener\" target=\"_blank\">home ownership rate</a> for Black Americans, for example, is 43.6 percent; for whites, it is 70.3 percent. The gap is the result of decades of discrimination. Between the 1940s and passage of the <a href=\"https://www.justice.gov/crt/fair-housing-act-1\" rel=\"noreferrer noopener\" target=\"_blank\">1968 Fair Housing Act</a>, Blacks found it extremely difficult to secure mortgage assistance from the federal government, especially in white neighborhoods. Getting loans from private lenders was even harder and for a much longer period. </p>\n<p>Since homeownership is the primary means for most American families to build intergenerational wealth, Black families have fewer resources to start businesses or purchase homes in neighborhoods with good schools.</p>\n<p>DEI initiatives seek to level the playing field — to make up for the many disadvantages that underrepresented minorities continue to face. In our judgment, the rationale for affirmative action offered by <a href=\"https://www.presidency.ucsb.edu/documents/commencement-address-howard-university-fulfill-these-rights\" rel=\"noreferrer noopener\" target=\"_blank\">Lyndon Johnson in 1965</a> remains persuasive: “You do not take a person who, for years, has been hobbled by chains and liberate him, bring him up to the starting line of a race and then say, ‘you are free to compete with all the others,’ and still justly believe that you have been completely fair.”</p>\n<p>Nonetheless, as Oppenheimer acknowledges, “there can be serious problems with DEI programs.” Diversity training can be “ineffective, or even counterproductive.” Requiring applicants for faculty positions to submit diversity statements can be “performative, or even McCarthy-like loyalty oaths.” And, in our view, heavy-handed approaches to DEI can contribute to a stifling progressive orthodoxy.  </p>\n<p>But we concur with Oppenheimer that tearing down DEI is not the answer. The better approach, as <a href=\"https://blackpast.org/african-american-history/1995-william-jefferson-clinton-mend-it-dont-end-it/#:~:text=In%20July%201995%2C%20President%20Bill,.%E2%80%9D%20That%20speech%20appears%20below:\" rel=\"noreferrer noopener\" target=\"_blank\">Bill Clinton once said</a> of affirmative action, is to “mend it, not end it.”   </p>\n<p><em>Glenn C. Altschuler is the Thomas and Dorothy Litwin Emeritus Professor of American Studies at Cornell University. David Wippman is emeritus president of Hamilton College.</em></p>",
            "kind": 1,
            "link": "https://thehill.com/opinion/judiciary/5757563-conservative-attacks-diversity-equity-inclusion/",
            "pub_date": "2026-03-01 21:27:02",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5761360,
            "title": "Trump threatens Iran with 'force never seen before;' Israel launches new strikes",
            "description": "<p>President Trump on Sunday threatened Iran with “force never seen before” after the U.S and Israel’s strikes on the country, with Israeli forces also launching a new set of strikes Sunday. </p>\n<p>“Iran just stated that they are going to hit very hard today, harder than they have ever hit before. THEY BETTER NOT DO THAT, HOWEVER, BECAUSE IF THEY DO, WE WILL HIT THEM WITH A FORCE THAT HAS NEVER BEEN SEEN BEFORE! Thank you for your attention to this matter!” Trump said in an early morning <a href=\"https://truthsocial.com/@realDonaldTrump/posts/116152251973821428\">post to Truth Social.</a></p>\n<p>On Saturday morning, the U.S. and Israel launched strikes amid simmering tensions in the region. Shortly after the strikes, Iran retaliated by launching drones and ballistic missiles at Israel and other <a href=\"https://thehill.com/policy/defense/5760747-trump-iran-regime-change/\">Gulf countries.</a></p>\n<p>Trump said Saturday the American bombing campaign in Iran could <a href=\"https://thehill.com/homenews/administration/5760879-operation-epic-fury-iran/\">continue into</a> the next week or go on for as long as “necessary.”</p>\n<p>“The heavy and pinpoint bombing, however, will continue, uninterrupted throughout the week or, as long as necessary to achieve our objective of PEACE THROUGHOUT THE MIDDLE EAST AND, INDEED, THE WORLD!” Trump said Saturday evening on Truth Social, also announcing that the Iranian Supreme Leader Ayatollah Ali Khamenei <a href=\"https://thehill.com/homenews/administration/5760879-operation-epic-fury-iran/\">was dead.</a></p>\n<p>On Sunday morning, Secretary of Iran’s Supreme National Security Council Ali Larijani <a href=\"https://x.com/alilarijani_ir/status/2028037732270756076?s=46&amp;t=yvJsmV0mu2913uNCsjBAcQ\">wrote on social media</a> that the Middle Eastern country will “hit” the U.S. “with a force that they have never experienced before.” </p>\n<p>In its own Sunday post on the social platform X, the Israel Defense Forces said that it was “striking targets belonging to the Iranian terror regime in the heart of Tehran.”</p>\n<p>“Over the past day, the [Israeli Air Force (IAF)] conducted large-scale strikes to establish aerial superiority and pave the path to Tehran,” the Israeli military continued in the post, <a href=\"https://x.com/IDF/status/2028036311110566149\">which featured video of buildings</a> being blown up with the caption of “Dismantlement of a headquarters of the Iranian terror regime.”</p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/administration/5761360-trump-iran-retaliation-israel-strikes/",
            "pub_date": "2026-03-01 20:56:36",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5760945,
            "title": "Live updates: Iran strikes stretch into second day as Trump warns against retaliation",
            "description": "<div class=\"wp-block-group\"><div class=\"wp-block-group__inner-container is-layout-constrained wp-block-group-is-layout-constrained\">\n<p>President Trump is <a href=\"https://thehill.com/policy/international/5760207-trump-urges-iran-regime-change/\">urging for regime change</a> in Iran as Israel launches a second round of strikes in the Middle Eastern country Sunday. </p>\n<p>Israel Defense Forced announced via <a href=\"https://x.com/IAFsite/status/2028060148984320445?s=20\">social media </a>Sunday that it knocked out missile launchers and an unmanned aircraft. At least 200 people have been killed after the U.S. and Israel <a href=\"https://thehill.com/policy/defense/5760747-trump-iran-regime-change/\">launched joint strikes</a> Saturday. </p>\n<p>Overnight, the president <a href=\"https://truthsocial.com/@realDonaldTrump/posts/116152251973821428\">threatened to strike Iran</a> “with a force that has never been seen before” if Tehran retaliates “very hard” against the U.S. </p>\n<p>Trump announced earlier Saturday that Iranian Supreme Leader Ayatollah Ali Khamenei was <a href=\"https://thehill.com/policy/international/5760795-us-israel-strike-iran-khamenei/\">killed</a>, and multiple outlets reported that the death of Iran’s <a href=\"https://thehill.com/policy/international/5760920-trump-iran-regime-change/\">decades-long leader</a> was caused by the strikes. <a href=\"https://thehill.com/policy/international/5760920-trump-iran-regime-change/\">Here’s what you need to know. </a></p>\n<p>Meanwhile, on Capitol Hill, <a href=\"https://thehill.com/homenews/house/5760620-schneider-supports-war-powers-resolution/\">questions are swirling </a>around Democrats’ push for a war powers vote seeking to limit Trump’s use of force in the Middle Eastern country. </p>\n<p>Later Sunday, the president is set to leave his Palm Beach Mar-a-Lago resort and return to the White House. </p>\n<p>Follow live below.</p>\n</div></div>",
            "kind": 1,
            "link": "https://thehill.com/homenews/administration/5760945-live-updates-trump-iran-strikes-regime-change/",
            "pub_date": "2026-03-01 20:31:47",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5761330,
            "title": "3 dead, 14 injured in downtown Austin mass shooting",
            "description": "<p>AUSTIN (KXAN) — Three people have died, and 14 were injured in a shooting on West Sixth Street overnight Saturday into Sunday, according to Austin-Travis County EMS. </p>\n<p>Austin Police officers responded to the popular street to calls about a man shooting at Buford’s Bar.</p>\n<p>APD Chief Lisa Davis said three officers shot back toward the suspect, who died. The suspect has not yet been identified, but was described as a man.</p>\n<p>ATCEMS said medics took 14 people to the hospital following the shooting. Of those 14, three were in critical condition as of the last report.</p>\n<p>“I’m very thankful for the speed with which our public safety officials responded to this,” said Austin Mayor Kirk Watson. “I don’t think there’s any question that it saved lives.”</p>\n<p>Chief Davis said officers and ATCEMS medics were able to respond quickly to the area because of customary staging over on East Sixth Street. ATCEMS Chief Robert Luckirtz said his medics were on scene within 57 seconds of getting the call at 1:59 a.m.</p>\n<p>Federal partners also responded to the scene.</p>\n<p><em>KXAN will update this story as more information becomes available. </em></p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/state-watch/5761330-3-dead-14-injured-in-downtown-austin-mass-shooting/",
            "pub_date": "2026-03-01 20:31:46",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5760612,
            "title": "Generational change becomes focal point in Texas, North Carolina Democratic battles",
            "description": "<p>Several Democratic primaries in <a data-id=\"https://thehill.com/newsletters/morning-report/5758443-texas-primaries-trump-clinton/\" data-type=\"link\" href=\"https://thehill.com/newsletters/morning-report/5758443-texas-primaries-trump-clinton/\">Texas</a> and <a data-id=\"https://thehill.com/homenews/campaign/5729942-texas-north-carolina-illinois-ohio-senate-races/\" data-type=\"link\" href=\"https://thehill.com/homenews/campaign/5729942-texas-north-carolina-illinois-ohio-senate-races/\">North Carolina</a> are teeing up generational battles in the party.</p>\n<p>Rep. Al Green (D-Texas), 78, is facing a challenge from newly-elected 37-year-old Rep. Christian Menefee (D-Texas) in Texas’s redrawn 18th Congressional District in the Houston area. </p>\n<p>Rep. Valerie Foushee (D-N.C.), 69, is fending off a primary challenge from 32-year-old Durham County Commissioner Nida Allam in North Carolina’s 4th Congressional District. </p>\n<p>Both contests could offer clues about whether Democratic voters want to see generational change in their officeholders.</p>\n<p>Democrats have been mired in a fierce debate over generational change and experience ever since former President Biden’s presidential debate against President Trump in 2024 brought the issue of age and fitness front and center for the party.</p>\n<p>Since Trump’s defeat of Vice President Kamala Harris in 2024, a growing number of Democrats have urged older incumbents to retire from Congress, arguing it’s time to pass the baton.</p>\n<p>Nowhere has the issue of age played out more than in Houston’s 18th Congressional District, where two older lawmakers, — Democratic Reps. Sheila Jackson Lee, 74, and Sylvester Turner, 70, died in office over just two years.</p>\n<p>Now Green – a prominent critic of Trump who was ejected for the second year in a row from a Trump address to a joint session of Congress on Tuesday– is being pressed to make the case that he deserves to be reelected for another term despite his age. </p>\n<p>Activist David Hogg, who has pushed for generational change in the party, said he wished Green and Menefee could both serve, blaming redistricting by the Texas GOP.</p>\n<p>At the same time, he is backing the younger candidate.</p>\n<p>“We cannot risk determining whether or not we have the majority in the House. We cannot leave that up to Greg Abbott and God forbid, a situation where Al Green unfortunately passes away in his seat,” said Hogg, whose group Leaders We Deserve is backing both Menefee and Allam.  “There is no way of not acting like age is not a factor here.” </p>\n<p>Menefee told NBC News in an interview <a href=\"https://www.nbcnews.com/politics/2026-election/redistricting-pits-democratic-colleagues-allies-texas-rcna258971\">published this week</a> that he wasn’t focusing on the issue of age but said he’s the only one in his contest who has “stood up to the Trump administration.” </p>\n<p>Green and his allies, meanwhile, have argued wisdom and experience are an asset to the congressman. Green has been especially vocal against pro-crypto group Fairshake’s involvement in the primary, <a href=\"https://thehill.com/policy/technology/5737785-al-green-crypto-superpac-reelection-bid-texas/\">vowing in a video statement</a> this month “they cannot buy the new 18th Congressional District.” </p>\n<p>Fairshake, a network of pro-crypto super PACs that are boosting certain Democrats and Republicans, has several prominent GOP donors such as tech billionaire Marc Andreessen. </p>\n<p>Protect Progress, a Fairshake-affiliated super PAC, announced earlier this month it would be spending $1.5 million to oust Green from his seat, pointing out he’s opposed key pieces of pro-crypto legislation. </p>\n<p>“Don’t get it twisted!” said Bishop James Dixon II, president of the NAACP’s Houston chapter, at a recent campaign event with Green. </p>\n<p>“An aged man with a cane is not a man that’s weak, that’s a man that’s strong!” Dixon said, noting the Biblical story of Moses parting the Red Sea with his staff. </p>\n<p>During that same event, Green pointed out that he was unafraid to take on Trump during his recent State of the Union address, in which he raised a sign saying “Black people are not apes” in response to a social media video Trump reposted that depicted former President Obama and former first lady Michelle Obama as apes. Green was later ejected from the House chamber over the sign. </p>\n<p>“It was easy to write, but it was not easy to present, because you know you’re standing before the world when you do it, and you know that you already have colleagues who are antithetical to such a demonstration taking place,” Green said. </p>\n<p>In North Carolina, Foushee and Allam are set for a rematch.</p>\n<p>Allam told The Hill she felt compelled to run again this cycle because she said Foushee was not fighting back hard enough against the Trump administration amid the Department of Government Efficiency’s cuts impacting the district and its hardline immigration crackdown. </p>\n<p>“…To have our representative solely just put out a tweet or a strongly worded letter, when so many families were hurting, I couldn’t idly sit by and … look at my residents in good faith and say, ‘Well, you have to wait three years for help,’” Allam said. </p>\n<p>Allam is backed by Sen. Bernie Sanders (I-Vt.) and the Working Families Party. A member of the Congressional Progressive Caucus, Fouchee also has endorsements from a mix of progressive and more establishment Democrats, including former Gov. Roy Cooper (D) and current Gov. Josh Stein (D). </p>\n<p>Foushee said she deserved another term in Congress and cast herself as a progressive fixture in the district, noting her co-sponsoring of the Green New Deal and Medicare for All Act.  </p>\n<p>“My constituents have clearly voiced to me that they want Congress to pass progressive policies to push this country forward, not simply replacing elected officials with younger ones without results,” Foushee told The Hill in a statement. </p>\n<p>“I respect our primary system but do not think this critical moment is the proper time to replace principled leadership with untested lip service,” Foushee added. </p>\n<p>The Tuesday primaries are a microcosm of a broader, long-running debate within the party over its direction heading into 2026 and beyond and whether it’s the time for new wave of newer and younger candidates to take the mantle.  </p>\n<p>While some older incumbents are barreling forward with their reelection efforts, a number of older, prominent members of Congress in both chambers like Rep. Nancy Pelosi (D-Calif.), Rep. Steny Hoyer (D-N.Y.), Sen. Jeanne Shaheen (D-N.H.) and others are stepping down, with some citing generational change.  </p>\n<p>While recent polling has suggested Green is at risk of losing reelection next week, Democrats in North Carolina believe that, while the primary may be closer than expected, Foushee is likely to win. </p>\n<p>“It’s a bit harder for a progressive to primary [Foushee] because it’s not like she’s a Joe Manchin or a Fetterman, where she has a more moderate voting record. She is very progressive,” Mally Smith, who served as former Vice President Harris’ North Carolina political director during her 2024 White House bid and is not working on either campaign. </p>\n<p>“They might have some differing views here [and] there, but they’re broadly ideologically similar,” he added. </p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/campaign/5760612-democratic-primaries-generational-change/",
            "pub_date": "2026-03-01 19:31:01",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5760020,
            "title": "How US strikes on Iran could trigger a wider war with its proxies",
            "description": "<p>The ongoing U.S. strikes on Iran could have a ripple effect across the region, triggering a barrage of attacks from Tehran’s proxy groups on American troops, allies and interests. </p>\n<p>The likes of Hezbollah in Lebanon, the Houthis in Yemen and various Shiite militias in Iraq could be called on to target U.S. service members, civilians, ships, embassies and frequented hotels in the Middle East, threatening a wider regional war, experts say.</p>\n<p>Hezbollah, considered the most powerful of Iran’s proxies, is of particular concern to counterterrorism experts given its significant stockpiles of rockets and missiles — even after Israel last year sought to decapitate its leadership.</p>\n<p>“It’s one of the more formidable non-state actors in the world, and so they still have capabilities to make life difficult,” said Colin Clarke, the executive director of The Soufan Center. “The Hezbollah threat, I think, is the one that at least in the West, we probably worry about most.”</p>\n<p>But Hezbollah isn’t the only Iran-backed actor that can cause serious damage. A former senior U.S. intelligence official, speaking on condition of anonymity, told The Hill on Friday that the Trump administration should be more worried about the Houthi rebels in Yemen, which the U.S. targeted <a href=\"https://thehill.com/policy/international/5196985-us-launches-decisive-and-powerful-strikes-against-houthis-in-yemen/\">during “Operation Rough Rider”</a> last year. </p>\n<p>As part of Rough Rider, Washington from March to May 2025 launched a major air and naval campaign against the Houthis following renewed Red Sea shipping attacks. But the campaign had difficulty destroying the group’s underground arsenal of missiles, drones and launchers, and the Houthis quickly resumed attacks on commercial shipping. </p>\n<p>“I would be more concerned about the Houthis going after oil infrastructure and then direct shots against the Israelis,” the official said.</p>\n<p>The U.S. and Israel began bombing Iran early Saturday morning after a <a href=\"https://thehill.com/policy/international/5757110-us-iran-talks-oman-complete/\">third round of indirect nuclear talks</a> between Washington and Tehran in Geneva, Switzerland, failed to satisfy the Trump administration. </p>\n<p>Oman’s foreign minister Badr al-Busaidi, who mediated the talks, claimed that Iran had agreed to give up its enriched uranium and allow U.S. inspectors access to nuclear sites.</p>\n<p>But the Trump administration — demanding that Iran end uranium enrichment in addition to limiting its arsenal of ballistic missiles and cut off its support of regional proxy groups that are designated as terrorist organizations by Washington — decided it was through with negotiations and launched Operation Epic Fury.</p>\n<p>Intended to spur regime change for Tehran, the military operation began with waves of strikes at 1:15 a.m. EST, utilizing Washington’s <a href=\"https://thehill.com/policy/defense/5715910-us-military-iran-options/\">massive military buildup</a> in the Middle East — the largest regional deployment since the invasion of Iraq in 2003 — to hit Islamic Revolutionary Guard Corps (IRGC) command and control facilities, ballistic missile and drone launch sites, military airfields and Iranian air defense systems.</p>\n<p>Trump said Iran’s Supreme Leader Ayatollah Ali Khamenei <a href=\"https://thehill.com/policy/international/5760795-us-israel-strike-iran-khamenei/\">was killed</a> in a post Saturday afternoon, adding the U.S. bombing will continue “uninterrupted throughout the week or, as long as necessary.” </p>\n<p>Experts fear the U.S. attack on Iran could trigger a wave of retaliation against Israel and U.S. forces in the region, as well as on civilians.</p>\n<p>Case in point, Saudi Arabia, Qatar, the United Arab Emirates, Bahrain, Jordan and Kuwait all appeared to have been<a href=\"https://thehill.com/policy/international/5760555-gulf-unity-pushing-back-iran/\"> targeted by Iranian attacks</a> later on Saturday. All countries host U.S. bases or forces in the region.</p>\n<p>Iran reportedly managed a strike against a service center of the U.S. Fifth Fleet naval base in Bahrain, and Qatar reportedly intercepted Iranian ballistic missiles targeting the Al-Udeid airbase in Doha, which hosts the U.S. Central Command. </p>\n<p>Brett Velicovich, a former Army intelligence special operations soldier who served multiple tours in Iraq and Afghanistan, said if the U.S. opts for a sustained operation rather than quick strikes, Iran “would probably try and unleash their proxies to strike down targets in the region.”</p>\n<p>“If we’ve got some sustained operation like we did in Iraq and Afghanistan, which would be a major mistake, that would then give proxies the ammunition religiously to convince more people to help them and that’s really where the danger is,” said Velicovich, who now helps run the drone company Powerus. </p>\n<p>He hypothesized that the groups would attempt to shoot American drones and maritime assets — a capability the Houthis have already demonstrated — assassinate diplomats, conduct kidnappings, and carry out other methods to “attempt to stoke a bit of chaos” in places where Iranians are prevalent, such as Qatar or the UAE.</p>\n<p>“The reality is the Iranians do have their hands in a lot of different places,” he said.</p>\n<p>Clarke, of the Soufan Center, said he was concerned about U.S. embassies in Europe and hotels being prime targets for Iranian proxy groups.</p>\n<p>“They often attempt to target civilians. So really, the target’s head is limitless from that perspective,” he said in an interview, adding that if there “true Hezbollah sleeper cells around the world, again, I think this would be the time when Iran would seek to use those, because the threat is existential.” </p>\n<p>The ex-senior intelligence official said the U.S. and other Western countries are monitoring for signs that Iran might direct proxies to conduct retaliatory strikes.</p>\n<p>“It’s a function of capability and intent. And in some cases, a lot of times, you have capability, but no intent. In this case, I would be looking at intent to actually execute and be part of this,’ they said. </p>\n<p>Javed Ali, the former senior director for counterterrorism at the National Security Council, said he is worried about the relationship between Iran and Hezbollah, an Iran-backed Shiite militia, which has been at war with Israel since Oct. 7, 2023, as Hezbollah “has always been the most capable group” within Tehran’s so-called Axis of Resistance. </p>\n<p>“I think there is a serious threat of terrorism in the region,” he said in an interview with The Hill. “How much of a global terrorist attack capability does Hezbollah still have? That’s an open question.” </p>\n<p>Ali, who is now a professor at the University of Michigan, said the most dangerous organization within Iran, from a terrorist perspective, is the Quds Force, a secretive unit of Iran’s IRGC, as they have trained, equipped and partnered with the Axis of Resistance now for decades. </p>\n<p>“To me, that is Iran’s ace in the hole when it comes to unconventional warfare, and they haven’t used it against the United States, at least not outside of Iraq,” he said. </p>\n<p>Not everyone is as convinced that Iran’s proxies pose a significant risk to U.S. forces and interests. </p>\n<p>Velicovich said Iranian proxies may prove to be ineffective after being hammered over the past few years by Israeli strikes.</p>\n<p>And Ret. Adm. William Fallon, a former commander of U.S. Central Command, told The Hill that Hezbollah has been quiet as of late and is “not in a great position” to strike American troops. </p>\n<p>“I don’t think any of them are in shape to do much right now,” he said. “Hezbollah’s got a lot of rockets [but] most of them are aimed at Israel. They’re pretty much on the defensive, looking out for themselves.”</p>\n<p>As for proxies in Iraq and Syria, “I think [the U.S.] has pretty well reduced our footprint in both of those places,” Fallon added.</p>",
            "kind": 1,
            "link": "https://thehill.com/policy/defense/5760020-us-strike-iran-proxy-threat/",
            "pub_date": "2026-03-01 19:31:01",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5759381,
            "title": "Trump tariff refund fight in motion as small businesses take helm",
            "description": "<p>The <a data-id=\"https://thehill.com/regulation/court-battles/5747881-supreme-court-tariff-refunds/\" data-type=\"link\" href=\"https://thehill.com/regulation/court-battles/5747881-supreme-court-tariff-refunds/\">fight for tariff refunds</a> following the Supreme Court’s <a data-id=\"https://thehill.com/homenews/5747935-trump-tariffs-supreme-court-ruling/\" data-type=\"link\" href=\"https://thehill.com/homenews/5747935-trump-tariffs-supreme-court-ruling/\">decision to void</a> President Trump’s sweeping levies is underway. </p>\n<p>A Michigan auto parts store and New York wine importer are leading the charge, and they’re moving fast. </p>\n<p>Hundreds of small businesses and major corporations alike have rushed to court to reclaim the unlawfully collected funds, as the Trump administration awaits instruction on a roadmap for next steps.   </p>\n<p>“Our goal is simple: No unnecessary expense. No unnecessary disruption. No 900-case pileup,” Liberty Justice Center, which represents the wine importer, VOS Selections, said this week. </p>\n<p>Here’s where things stand.</p>\n<h2 class=\"wp-block-heading\">Who will lead: Wine importer or auto parts store?</h2>\n<p>VOS Selections, which imports sake and spirits, has already made moves to secure its refund with the four small businesses it sued alongside. </p>\n<p>Victor Schwartz, VOS Selections’ founder, said hours after the Supreme Court’s decision last Friday that the ruling marked a “turning point” for thousands of small businesses nationwide. </p>\n<p>Though his company is owed a refund in the “low six figures,” the tariffs made a major impact on his business’s cash flow — a disadvantage many small businesses likely faced, he said. </p>\n<p>“As you could understand, cash flow is the lifeblood of a company,” said Schwartz.<br/> <br/>The Trump administration long ago guaranteed VOS Selections and the other original plaintiffs refunds if they emerged victorious.  </p>\n<p>The administration has said it won’t object to refunds for other businesses. But still, the process may be more complicated. </p>\n<p>In an email Thursday, Liberty Justice Center urged that most businesses do not need to take immediate action now, and if litigation does become necessary, their claims will still be viable. </p>\n<p>The nonprofit, public interest litigation firm emphasized its focus on ensuring a “uniform, court-supervised refund process” that would be applied across the board.  </p>\n<p>“We are working to prevent a scenario in which thousands of small businesses are forced to file separate lawsuits simply to recover unlawfully collected duties,” the email read. </p>\n<p>That hasn’t stopped hundreds of businesses from filing suit, anyways.  </p>\n<p>In one major move, FedEx, the global shipping company, <a href=\"https://thehill.com/business/5752347-fedex-trump-administration-tariff-refunds-supreme-court-ruling/\">sued the Trump administration</a> Tuesday for a “full refund” on the import taxes it paid since the emergency tariffs went into place. Soon after, the company vowed to give those funds back to those who initially bore the charges: Shippers and consumers. </p>\n<p>“When that will happen and the exact process for requesting and issuing refunds will depend in part on future guidance from the government and the court,” the company said in a statement Thursday.  </p>\n<p>As companies like FedEx line up, it remains unclear whether the wine importer will continue to be the face. </p>\n<p>A Muskegon, Mich., auto parts store has emerged as a contender to take the baton. </p>\n<p>For months, other companies’ lawsuits were consolidated with AGS Company Automotive Solutions’ case, effectively making it the lead docket. </p>\n<p>That is, until Dec. 23, when Mark Barnett, the chief judge of the U.S. Court of International Trade, halted new cases. </p>\n<h2 class=\"wp-block-heading\">DOJ not stepping on gas</h2>\n<p>With the Supreme Court ruling now in, AGS is pushing to lift the pause. </p>\n<p>On Wednesday, the auto parts store asked for a hearing “as soon as practicable.” The store’s lawyers said they’d be ready to go as soon as the next day, but the court did not oblige. </p>\n<p>AGS had told the court that “a delay in lifting the stay favors defendants and prejudices Plaintiffs further.” </p>\n<p>Schwartz’s business, meanwhile, is back at the intermediate appeals court. </p>\n<p>VOS Selections has urged the swift return of its “mandate,” the formal document ending the appeals process that enables the lower court to regain jurisdiction .<br/>  </p>\n<p>Though the government has 25 days to ask the Supreme Court to rehear the case, and the justices won’t issue its judgment until 32 days have passed, the businesses argue that there is “no impediment” to moving forward now. The appeals court can issue its mandate at any time, they contend. </p>\n<p>“The mandate did not issue in the ordinary course here only because of this Court’s order staying the mandate’s issuance until the Supreme Court entered its judgment,” their lawyers wrote. “Because that has now happened, this mandate should issue forthwith.”  </p>\n<p>As the businesses step on the gas, the Justice Department is content with letting things unfold more slowly. </p>\n<p>In an <u><a href=\"https://storage.courtlistener.com/recap/gov.uscourts.cafc.23105/gov.uscourts.cafc.23105.171.0_1.pdf\">update filed Friday night</a></u>, the administration called the demand for speed “ill-conceived.” If anything, the proceedings should be put on hold for 90 days so the political branches can consider the options, the government argued.</p>\n<p>“Complexity in the future counsels appropriately careful process, not breakneck speed,” the Justice Department wrote.</p>\n<p>Trump himself has signaled he expects the process to take some time, telling reporters after the ruling that the refund process may be tied up in the courts for years given no roadmap was laid out by the court. </p>\n<p>On Friday, he posited that the high court should even give its decision another go, though the Supreme Court hasn’t reheard a plenary case in nearly 70 years.”Is a Rehearing or Readjudication of this case possible???” the president<a href=\"https://x.com/atrupar/status/2027489938120536349\"> wrote on Truth Social</a>.</p>\n<h2 class=\"wp-block-heading\">Dems make move of their own</h2>\n<p>As the courts parse refunds, Democrats have sought to take matters into their own hands.  </p>\n<p>Illinois Gov. J.B. Pritzker (D) wrote in a letter to Trump he <a href=\"https://x.com/JBPritzker/status/2024976736849432935\">shared publicly Friday</a> that he invoiced the administration for $8.6 billion, a refund of $1,700 for every family in the state.  </p>\n<p>“The Supreme Court has ruled that this is yet one more unconstitutional act by you and your administration,” he said. “This letter and the attached invoice stand as an official notice that compensation is owed to the people of Illinois, and if you do not comply we will pursue further action.”  </p>\n<p>New York Gov. Kathy Hochul (D) and Maryland Gov. Wes Moore (D) made <a href=\"https://www.governor.ny.gov/news/governor-hochul-calls-trump-administration-refund-135-billion-tariff-payments-new-yorkers\">similar</a> <a href=\"https://governor.maryland.gov/news/press/pages/Governor-Moore,-Comptroller-Lierman,-Treasurer-Davis-Demand-Reimbursement-from-President-Trump-for-Illegal-Tariffs.aspx\">demands</a>, as California Gov. Gavin Newsom (D) urged the president that it’s “<a href=\"https://www.gov.ca.gov/2026/02/20/governor-newsom-calls-for-immediate-tariff-refund-checks-following-supreme-court-ruling-against-trump/\">time to pay the piper</a>.” </p>\n<p>In Congress, Sens. Ed Markey (D-Mass.), Ron Wyden (D-Ore.) and Jeanne Shaheen (D-N.H.) introduced legislation that would require prompt, full refunds of Trump’s emergency tariffs, plus interest, rather than wait for a court to figure out a process. </p>\n<p>Some 19 other Democrats are co-sponsoring the bill, which would force U.S. Customs and Border Protection to front the costs and pay interest on the refunded amount within 180 days of enactment.  </p>\n<p>Small businesses would be prioritized under the legislation, and CBP would be directed to report each month on the status of refunds. </p>\n<p>“It’s Main Street and working families that paid Trump’s tariff taxes, and we must ensure they get their money back—not big corporations,” Markey said in a press release Monday.</p>",
            "kind": 1,
            "link": "https://thehill.com/regulation/court-battles/5759381-trump-tariffs-fight-refunds-supreme-court/",
            "pub_date": "2026-03-01 19:31:00",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5761137,
            "title": "Lawmakers, world leaders react to Khamenei's death after Iran strikes",
            "description": "<p>The death of Ayatollah Ali Khamenei on Saturday following joint U.S.-Israeli strikes on Iran was met with praise from some lawmakers and world leaders, and left others condemning the Trump administration and declaring its actions illegal. </p>\n<p>Rep. Yassamin Ansari (D-Ariz.), the only Iranian American member of Congress, called Khamenei the “epitome of evil” and said, “No one should mourn him and his death is a relief.”</p>\n<p>“But removing one man does not dismantle a brutal regime,” she <a href=\"https://x.com/repyassansari/status/2027859516256297046?s=46\">wrote</a> on the social platform X. “Military force alone will not secure a democratic future for the Iranian people, and it risks putting U.S. troops in further danger if there is no serious plan for what comes next. An action of this magnitude demands strategy, clarity, and a credible path forward.”</p>\n<p>Former Rep. Marjorie Taylor Greene (R-Ga.) accused President Trump of focusing his attention on Iran rather than on the cost of living and said Saturday’s attack did not align with his “America First” policy. </p>\n<p>“Great Mr President. Good job,” she wrote in a lengthy <a href=\"https://x.com/FmrRepMTG/status/2027873558903537854\">statement</a> on X, attaching a screenshot of Trump’s Truth Social post confirming Khamenei’s death. “You’re a billionaire and the American people, not the Iranian people, who voted for you are not billionaires.”</p>\n<p>Sen. Bernie Sanders (I-Vt.) called the “Trump-Netanyahu war,” referring to Israeli Prime Minister Benjamin Netanyahu, one that “is unconstitutional and violates international law.”</p>\n<p>“It endangers the lives of U.S. troops and people across the region,” Sanders <a href=\"https://x.com/BernieSanders/status/2027830212231131326\">wrote on X</a>. “We’ve lived through the lies of Vietnam and Iraq. No more endless wars. Congress must pass a War Powers Resolution immediately.”</p>\n<p>Sen. Lindsey Graham (R-S.C.), a longtime war hawk and critic of Iran’s regime, said he was “so proud of President Trump and his team.” He <a href=\"https://x.com/LindseyGrahamSC/status/2027868358146986247\">wrote on X</a> that Trump was “moving into a league of his own as a Republican foreign policy president” and has “become the gold standard for foreign policy achievements as a Republican president.”</p>\n<p>Reza Pahlavi, the exiled Iranian crown prince and son of Iran’s last shah Mohammad Reza Pahlavi, said Khamenei “has been erased from the pages of history” and the regime that usurped his father “has effectively come to an end and will soon be consigned to the dustbin of history.”</p>\n<p>“This marks the beginning of our great national celebration; but it is not the end of the road,” he wrote in a <a href=\"https://x.com/pahlavireza/status/2027863020039225702?s=46\">translated X post</a>. “Stay vigilant and prepared. The time for a massive and decisive presence in the streets is very near.”</p>\n<p>Ukraine’s <a href=\"https://x.com/Ukraine/status/2027866821085352116\">official X account</a>, meanwhile, shared a post that read, “nothing beats the death of a dictator.”</p>\n<p>Australian Prime Minister Anthony Albanese told reporters that Khamenei “will not be mourned.”</p>\n<p>“Ayatollah Ali Khamenei was responsible for the regime’s ballistic missile and nuclear program, support for armed proxies and its brutal acts of violence and intimidation against its own people,” Albanese said, according to the <a href=\"https://www.timesofisrael.com/liveblog_entry/irans-khamenei-will-not-be-mourned-says-australian-pm-albanese/\">Times of Israel</a>. </p>",
            "kind": 1,
            "link": "https://thehill.com/policy/international/5761137-ayatollah-khamenei-death-reaction/",
            "pub_date": "2026-03-01 12:26:51",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5760920,
            "title": "US-Israeli strikes on Iran result in Khamenei's death: Five things to know",
            "description": "<p>Iran now stands without its supreme leader for 36 years, Ayatollah Ali Khamenei, after <a href=\"https://thehill.com/policy/international/5760207-trump-urges-iran-regime-change/\">joint strikes</a> from the U.S. and Israel on Saturday <a href=\"https://thehill.com/policy/international/5760795-us-israel-strike-iran-khamenei/\">killed him</a> and attacked military command posts and missile sites across the country.</p>\n<p>President Trump announced the strikes at 2:30 a.m. EST in a video shared on Truth Social. The mission, dubbed “Operation Epic Fury,” has resulted in the deaths of at least 200 Iranians and injured about 750 more, Iran’s Red Crescent told state media.</p>\n<p>News of Khamenei’s death initially came from Israeli Prime Minister Benjamin Netanyahu, who claimed an Israeli strike killed the supreme leader in his compound in Tehran. Trump later confirmed his death in a post on Truth Social.</p>\n<p>Here are five things to know in the aftermath of Khamenei’s death:</p>\n<h2 class=\"wp-block-heading\">Trump pushes Iranians to embrace regime change</h2>\n<p>Trump, in his announcement that the U.S. attacked Iran, told Iranian citizens that the government “will be yours to take.” He added that it could be “your only chance for generations.” The regime Khamenei inherited had been in power since 1979 following the Iranian Revolution. </p>\n<p>The president had already been calling for regime change during Iran’s crackdown on anti-government protests last month. In an interview with Politico, he called Khamenei a “<a href=\"https://thehill.com/policy/international/5694156-donald-trump-regime-change-iran/\">sick man</a>.”</p>\n<p>Critics who spoke out before and after Saturday’s attack slammed the notion of regime change, comparing it to the term’s usage during the wars in Afghanistan and Iraq in the early 2000s. New American-backed governments could not fill the power vacuum, leaving room for militant groups to take over and foment harsher conditions for citizens in those countries and others.</p>\n<h2 class=\"wp-block-heading\">Questions linger about Iran’s future after Khamenei’s death</h2>\n<p>It remains unclear who will become Iran’s third supreme leader, as no potential candidates have stepped forward in the hours after Khamenei was confirmed dead. Khamenei was Iran’s second supreme leader, succeeding Ayatollah Ruhollah Khomeini after his death in 1989. Khomeini came into power when the Islamic Republic of Iran took hold of the government a decade earlier. </p>\n<p>Before his death, no one was selected to succeed Khamenei, though <a href=\"https://www.reuters.com/article/us-iran-election-leader-idUSKBN0TW0OV20151213/\">Reuters reported in 2015</a> that a successor was chosen but their name would not be disclosed. </p>\n<p>Iranian President Masoud Pezeshkian reportedly survived Saturday’s attack. Israel <a href=\"https://x.com/IDF/status/2027853320015241252\">reported</a> that its strikes killed seven members of Iran’s senior defense leadership.</p>\n<h2 class=\"wp-block-heading\">US hit a weakened Iran </h2>\n<p>The U.S. previously weakened Iran after it struck three of the country’s nuclear sites in a joint-operation with Israel last June. Trump claimed the sites were “obliterated” and he defended himself after an intelligence assessment reported that one of the sites was mostly destroyed while the other two were not. </p>\n<p>Saturday’s attack was preceded by crippling attacks to Iran’s military and its proxy network. Trump, during his first term in 2020, took credit for the drone strike that killed prominent Iranian Gen. Qassem Soleimani.</p>\n<p>Iran’s proxies in the Middle East have faced various crippling blows. Hezbollah’s leader Hassan Nasrallah <a href=\"https://thehill.com/policy/defense/4904897-israel-hezbollah-beirut-strike-hassan-nasrallah-killed/\">was killed</a> in an Israeli airstrike in Beirut in September 2024. Israel killed brothers and leaders of Hamas <a href=\"https://thehill.com/policy/defense/4938572-yahya-sinwar-killed-israeli-operation/\">Yahya Sinwar</a> in October 2024 and <a href=\"https://thehill.com/policy/international/5321958-israel-says-it-has-killed-hamas-leader-who-is-mohammed-sinwar/\">Mohammed Sinwar</a> in May 2025. A few months later, Yemeni Prime Minister Ahmed al-Rahawi, who ran the Houthi-led government, <a href=\"https://thehill.com/policy/international/5478923-israel-yemen-strikes-houthi-prime-minister-killed/\">was also killed</a> in an Israeli airstrike.</p>\n<h2 class=\"wp-block-heading\">Trump says military strikes will continue</h2>\n<p>Trump’s announcement that Khamenei was dead also indicated that U.S. strikes on Iran will persist, though he <a href=\"https://thehill.com/homenews/administration/5760879-operation-epic-fury-iran/\">left the timetable open</a> as to how long it could last.</p>\n<p>“The heavy and pinpoint bombing, however, will continue, uninterrupted throughout the week or, as long as necessary to achieve our objective of PEACE THROUGHOUT THE MIDDLE EAST AND, INDEED, THE WORLD!” Trump wrote.</p>\n<p>The president’s remark differs from the outcome of U.S. strikes on Venezuela in January. After U.S. forces captured President Nicolás Maduro, U.S. strikes ceased as both sides started conversations about the country’s oil production and the possibility of new relations between both countries. </p>\n<h2 class=\"wp-block-heading\">Democrats are pushing back, demanding vote on war powers</h2>\n<p>Democrats have largely condemned the Trump administration for carrying out the attack on Iran, with many saying it was done without congressional authorization and violated the Constitution. </p>\n<p>Reps. Thomas Massie (R-Ky.) and Ro Khanna (D-Calif.) said they will force the House to vote on a resolution to prohibit military force against Iran without congressional approval. Most Democrats and one other Republican, Rep. Warren Davidson (Ohio), have said they will back the resolution.</p>\n<p>Reps. Mike Lawler (R-N.Y.) and Josh Gottheimer (D-N.J.), however, said they <a href=\"https://thehill.com/homenews/house/5748330-lawler-gottheimer-oppose-iran-strike/\">will not back</a> a war powers resolution. Last week, they both said the resolution would “restrict the flexibility needed to respond to real and evolving threats and risks signaling weakness at a dangerous moment.”</p>\n<p>Lawler on Saturday <a href=\"https://thehill.com/homenews/house/5760786-lawler-rips-massie-war-powers/\">slammed the resolution</a> attempt further, accusing Democrats of not understanding the War Powers Act. He also cited former presidents Obama and Biden carrying out strikes on countries without congressional approval, and said the last congressional approval to go to war was when the U.S. entered World War II in 1941. </p>",
            "kind": 1,
            "link": "https://thehill.com/policy/international/5760920-trump-iran-regime-change/",
            "pub_date": "2026-03-01 11:26:57",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5761077,
            "title": "Hegseth calls Iran strikes 'most lethal' aerial operation in history",
            "description": "<p>Defense Secretary Pete Hegseth late on Saturday broke his silence about the <a href=\"https://thehill.com/policy/defense/5760747-trump-iran-regime-change/\">U.S. strikes on Iran</a>, which he described as the “most lethal, most complex, and most-precision aerial operation in history.”</p>\n<p>“The Iranian regime had their chance, yet refused to make a deal — and now they are suffering the consequences,” Hegseth said in a <a href=\"https://x.com/SecWar/status/2027893692112248981\">post on the social platform X</a>. “For almost fifty years, Iran has targeted and killed Americans, always seeking the world’s most powerful weapons to further their radical cause. Last night, unlike any previous president, President Trump began dealing with this cancer.”</p>\n<p>He added that any Iranian missiles targeting American people in the aftermath of the mission, officially dubbed “Operation Epic Fury,” will not be tolerated. He also promised that the Iranian navy “will be destroyed.”</p>\n<p>“The United States did not start this conflict, but we will finish it,” Hegseth warned. “If you kill or threaten Americans anywhere in the world — as Iran has — then we will hunt you down, and we will kill you.”</p>\n<p>The Defense secretary’s comments come after the United States and Israel <a href=\"https://thehill.com/policy/defense/5760058-us-israel-launch-strikes-on-iran/\" rel=\"noreferrer noopener\" target=\"_blank\">launched waves of strikes</a> early Saturday morning against Iran following weeks of tensions between Washington and Tehran. Iran swiftly retaliated, firing drones and ballistic missiles at Israel and also attacking targets in Gulf countries such as Saudi Arabia, Qatar, the United Arab Emirates and Bahrain.</p>\n<p>Trump later confirmed that Supreme Leader Ayatollah Ali Khamenei, who has ruled over Iran for more than three decades, <a href=\"https://thehill.com/policy/international/5760795-us-israel-strike-iran-khamenei/\">was killed</a>.</p>\n<p>The White House <a href=\"https://x.com/WhiteHouse/status/2027838386342334802\">posted several photos</a> on its official X account showing Trump monitoring the military operation from his Mar-a-Lago resort in Palm Beach, Fla. Another photo shows Vice President Vance in the White House Situation Room with some Cabinet secretaries. While Hegseth doesn’t appear in the photos, <a href=\"https://www.reuters.com/world/us/top-us-general-hegseth-monitoring-iran-strikes-trump-resort-person-familiar-says-2026-02-28/\">Reuters reported</a> that he was present at Trump’s resort monitoring the strikes.</p>\n<p>“Our warriors are the best in the world, and they are fully unleashed to achieve our objectives. May God’s providence protect them in this vital mission,” the secretary’s post concluded.</p>",
            "kind": 1,
            "link": "https://thehill.com/policy/defense/5761077-us-strikes-iran-hegseth-trump/",
            "pub_date": "2026-03-01 10:55:55",
            "source": "thehill",
            "language": "en"
        }
    ]
}