{
    "data": [
        {
            "id": 5759842,
            "title": "President Trump touts oil and gas production in Texas visit",
            "description": "<p>CORPUS CHRISTI, Texas (Nexstar) — President Trump <a href=\"https://thehill.com/homenews/administration/5759646-texas-senate-primary-trump/\">touched down</a> on Texas soil <a href=\"https://www.kxan.com/news/texas-politics/a-brief-history-of-donald-trump-and-texas/\" rel=\"noreferrer noopener\" target=\"_blank\">for the second time</a> since returning to the White House.</p>\n<p>Trump visited the Port of Corpus Christi where he delivered remarks to applaud his economic and energy policies. The president reflected on the past year of his second term. He said he took over a country that was “dead” and has unlocked its potential.</p>\n<p>“I ended the Biden export ban, and I told our great Texas energy workers to very simply drill, baby, drill,” Trump said to a crowd of supporters. Trump touted the rise in oil production and gas exports and lower prices at the gas pump. </p>\n<p><a data-id=\"https://gasprices.aaa.com/?state=TX\" data-type=\"link\" href=\"https://gasprices.aaa.com/?state=TX\" rel=\"noreferrer noopener\" target=\"_blank\">According to AAA</a>, the current average price of regular gasoline in Texas is $2.60. <a data-id=\"https://www.eia.gov/dnav/pet/pet_pri_gnd_dcus_stx_a.htm#:~:text=Table_title:%20This%20page%20uses%20JavaScipt%20Table_content:%20header:,%7C%20:%201.807%20%7C%20:%203.463%20%7C\" data-type=\"link\" href=\"https://www.eia.gov/dnav/pet/pet_pri_gnd_dcus_stx_a.htm#:~:text=Table_title:%20This%20page%20uses%20JavaScipt%20Table_content:%20header:,%7C%20:%201.807%20%7C%20:%203.463%20%7C\" rel=\"noreferrer noopener\" target=\"_blank\">The average price of regular gasoline in 2022,</a> the middle of President Joe Biden’s term, was $3.47.</p>\n<p>Todd Staples, the president of the Texas Oil and Gas Association said the president’s visit to Corpus Christi underscores the fact that energy dominance begins in Texas. </p>\n<p>“The Lone Star State has reached a high-water mark in crude oil and natural gas production, benefitting American consumers by dramatically increasing supply and lowering prices at home and exporting the remainder to allies and trading partners,” Staples said in a statement.</p>\n<p>But Ed Hirs, an energy fellow at the University of Houston, said Trump’s policies have increased the cost of doing business. Hirs points to tariffs on steel and aluminum, which raised the cost of building energy infrastructure and drilling wells. He said the oil industry is spending more and getting less in revenue.</p>\n<p>“We’re getting $20 a barrel less than we were before the president took office, and we’re spending $3 to $5 to $10 a barrel more,” Hirs said.</p>\n<p>Hirs said that resulted in layoffs in the oil industry. The Texas Oil and Gas Association reported in January this year that upstream oil and gas employment remained flat in 2025, referencing data from the Texas Workforce Commission. </p>\n<p>“Even as companies adjust to lower prices and shifting market conditions, the Texas oil and natural gas industry employs hundreds of thousands of Texans across the value chain because of the industry’s regional breadth and diverse activities, from LNG exports to pipeline construction,” Staples said in his statement. </p>\n<p>Hirs did say that liquefied natural gas (LNG) exports did fairly well this year. </p>\n<p>“We have been able to help our European allies go without the natural gas from Russia,” Hirs said. </p>\n<p>Energy Secretary Chris Wright traveled to Corpus Christi a day ahead of the president to sign an order that expands the amount of LNG exported from the Cheniere Energy’s Corpus Christi LNG terminal. This will allow Corpus Christi LNG to be the second-largest exporter of LNG in the United States.</p>\n<p>“This creates jobs and wealth in the United States, and it better energizes our allies abroad and lifts everyone up,” Wright told a group of reporters.</p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/nexstar_media_wire/5759842-president-trump-touts-oil-and-gas-production-in-texas-visit/",
            "pub_date": "2026-02-28 11:35:56",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5759942,
            "title": "Warren accuses Trump, Hegseth of trying 'extort' Anthropic into removing AI guardrails",
            "description": "<p>Sen. Elizabeth Warren (D-Mass.) on Friday accused President Trump and Secretary of Defense Pete Hegseth of attempting to “extort” the company <a href=\"https://thehill.com/policy/technology/5759399-trump-bans-anthropic-tech/\">Anthropic</a> into removing guardrails for its AI programs.</p>\n<p>Warren, the ranking member of the Senate Banking, Housing and Urban Affairs Committee, said in a statement that the attempt would remove “common sense guardrails that protect Americans from mass surveillance and fully autonomous weapons, with no human decision-makers, that can kill with impunity.”</p>\n<p>“Congress needs to put in place restrictions to stop this Administration from using bipartisan national security authorities to bully and punish American companies that won’t advance their authoritarian agenda,” she added. </p>\n<p>Warren called on Hegseth to “immediately” testify before members of Congress and explain “this extraordinary abuse of power and address the serious adverse national security consequences of his decision.” </p>\n<p>Anthropic was one of several companies that signed a $200 million contract with the Pentagon last summer. The deal was in jeopardy due to Anthropic’s policy preventing its AI model Claude from being used for fully autonomous lethal weapons or mass domestic surveillance.</p>\n<p>Trump earlier on Friday directed federal agencies to “immediately cease” using Anthropic technology as a feud erupts between the company and the Pentagon. Hegseth said the Defense Department (DOD) was labeling the company a <a href=\"https://thehill.com/policy/defense/5759630-pentagon-designates-anthropic-risk/\">supply chain risk</a> to national security, banning any U.S. military contractor, partner or supplier from working with Anthropic.</p>\n<p>Warren’s fellow Bay State Democrat, Sen. Ed Markey, said the administration’s label “is a reckless and unprecedented attempt to destroy an American AI company.”</p>\n<p>“This is not a routine classification — it is an attempt to cripple an American firm for requesting legitimate safeguards on use of its AI model,” Markey said in a <a href=\"https://www.markey.senate.gov/news/press-releases/markey-demands-immediate-congressional-action-to-reverse-dod-designation-of-anthropic-a-supply-chain-risk\">statement</a>. “That is unacceptable. I’m calling for immediate congressional action to reverse this decision.”</p>\n<p>Anthropic called the label “<a href=\"https://thehill.com/policy/technology/5759929-pentagon-anthropic-supply-chain-risk/\">legally unsound</a>” and said it sets a “dangerous precedent.”</p>\n<p>“Designating Anthropic as a supply chain risk would be an unprecedented action—one historically reserved for US adversaries, never before publicly applied to an American company,” Anthropic said in a statement. “We are deeply saddened by these developments.”</p>\n<p>Earlier Friday, Trump accused Anthropic of being run by “Leftwing nut jobs” who tried to “STRONG-ARM the Department of War, and force them to obey their Terms of Service instead of our Constitution.”</p>\n<p>Anthropic and the Pentagon negotiated the AI company’s terms of service, with the DOD having <a href=\"https://thehill.com/policy/defense/5758772-pentagon-emil-michael-anthropic-dario-amodei-criticism/\">threatened to cancel</a> its contract with the company if it does not agree to its terms by Friday afternoon.</p>\n<p>Trump’s announcement came as the DOD delivered its last and final offer to Anthropic on Wednesday night, requesting that the company allow the department to access Claude for “all lawful purposes.”  </p>\n<p>Anthropic said Thursday that “<a href=\"https://thehill.com/policy/technology/5758006-anthropic-pentagon-ai-talks-stall/\" rel=\"noreferrer noopener\" target=\"_blank\">virtually no progress</a>” had been made over the model’s terms of use. The company’s CEO Dario Amodei noted in a separate statement that they could not “in good conscience” accept the Pentagon’s terms.   </p>\n<p><em>Julia Shapero contributed.</em></p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/senate/5759942-warren-accuses-trump-extortion-anthropic/",
            "pub_date": "2026-02-28 11:10:53",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5759842,
            "title": "President Trump touts oil and gas production in Texas visit",
            "description": "<p>CORPUS CHRISTI, Texas (Nexstar) — President Trump <a href=\"https://thehill.com/homenews/administration/5759646-texas-senate-primary-trump/\">touched down</a> on Texas soil <a href=\"https://www.kxan.com/news/texas-politics/a-brief-history-of-donald-trump-and-texas/\" rel=\"noreferrer noopener\" target=\"_blank\">for the second time</a> since returning to the White House.</p>\n<p>Trump visited the Port of Corpus Christi where he delivered remarks to applaud his economic and energy policies. The president reflected on the past year of his second term. He said he took over a country that was “dead” and has unlocked its potential.</p>\n<p>“I ended the Biden export ban, and I told our great Texas energy workers to very simply drill, baby, drill,” Trump said to a crowd of supporters. Trump touted the rise in oil production and gas exports and lower prices at the gas pump. </p>\n<p><a data-id=\"https://gasprices.aaa.com/?state=TX\" data-type=\"link\" href=\"https://gasprices.aaa.com/?state=TX\" rel=\"noreferrer noopener\" target=\"_blank\">According to AAA</a>, the current average price of regular gasoline in Texas is $2.60. <a data-id=\"https://www.eia.gov/dnav/pet/pet_pri_gnd_dcus_stx_a.htm#:~:text=Table_title:%20This%20page%20uses%20JavaScipt%20Table_content:%20header:,%7C%20:%201.807%20%7C%20:%203.463%20%7C\" data-type=\"link\" href=\"https://www.eia.gov/dnav/pet/pet_pri_gnd_dcus_stx_a.htm#:~:text=Table_title:%20This%20page%20uses%20JavaScipt%20Table_content:%20header:,%7C%20:%201.807%20%7C%20:%203.463%20%7C\" rel=\"noreferrer noopener\" target=\"_blank\">The average price of regular gasoline in 2022,</a> the middle of President Joe Biden’s term, was $3.47.</p>\n<p>Todd Staples, the president of the Texas Oil and Gas Association said the president’s visit to Corpus Christi underscores the fact that energy dominance begins in Texas. </p>\n<p>“The Lone Star State has reached a high-water mark in crude oil and natural gas production, benefitting American consumers by dramatically increasing supply and lowering prices at home and exporting the remainder to allies and trading partners,” Staples said in a statement.</p>\n<p>But Ed Hirs, an energy fellow at the University of Houston, said Trump’s policies have increased the cost of doing business. Hirs points to tariffs on steel and aluminum, which raised the cost of building energy infrastructure and drilling wells. He said the oil industry is spending more and getting less in revenue.</p>\n<p>“We’re getting $20 a barrel less than we were before the president took office, and we’re spending $3 to $5 to $10 a barrel more,” Hirs said.</p>\n<p>Hirs said that resulted in layoffs in the oil industry. The Texas Oil and Gas Association reported in January this year that upstream oil and gas employment remained flat in 2025, referencing data from the Texas Workforce Commission. </p>\n<p>“Even as companies adjust to lower prices and shifting market conditions, the Texas oil and natural gas industry employs hundreds of thousands of Texans across the value chain because of the industry’s regional breadth and diverse activities, from LNG exports to pipeline construction,” Staples said in his statement. </p>\n<p>Hirs did say that liquefied natural gas (LNG) exports did fairly well this year. </p>\n<p>“We have been able to help our European allies go without the natural gas from Russia,” Hirs said. </p>\n<p>Energy Secretary Chris Wright traveled to Corpus Christi a day ahead of the president to sign an order that expands the amount of LNG exported from the Cheniere Energy’s Corpus Christi LNG terminal. This will allow Corpus Christi LNG to be the second-largest exporter of LNG in the United States.</p>\n<p>“This creates jobs and wealth in the United States, and it better energizes our allies abroad and lifts everyone up,” Wright told a group of reporters.</p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/5759842-president-trump-touts-oil-and-gas-production-in-texas-visit/",
            "pub_date": "2026-02-28 11:10:52",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5759929,
            "title": "Anthropic calls supply chain risk designation 'unprecedented,' 'legally unsound'",
            "description": "<p>Anthropic called the Pentagon’s decision Friday to designate the AI company as a <a data-id=\"https://thehill.com/policy/defense/5759630-pentagon-designates-anthropic-risk/\" data-type=\"link\" href=\"https://thehill.com/policy/defense/5759630-pentagon-designates-anthropic-risk/\">supply chain risk</a> an “unprecedented action,” arguing it is “legally unsound” and would “set a dangerous precedent.”</p>\n<p>“Designating Anthropic as a supply chain risk would be an unprecedented action—one historically reserved for US adversaries, never before publicly applied to an American company,” Anthropic said in a statement. “We are deeply saddened by these developments.”</p>\n<p>“We believe this designation would both be legally unsound and set a dangerous precedent for any American company that negotiates with the government,” it added.</p>\n<p>Defense Secretary Pete Hegseth said Friday that the Pentagon was labeling Anthropic as a supply chain risk <a data-id=\"https://thehill.com/policy/technology/5759399-trump-bans-anthropic-tech/\" data-type=\"link\" href=\"https://thehill.com/policy/technology/5759399-trump-bans-anthropic-tech/\">following a dispute</a> over the company’s terms of use for its AI models.</p>\n<p>The Defense Department (DOD) pushed for language that would allow it to use the technology for “all lawful purposes,” while Anthropic argued that there needed to be restrictions on mass domestic surveillance and fully autonomous lethal weapons.</p>\n<p>Hegseth, who made the announcement on the social platform X, said that “no contractor, supplier, or partner that does business with the United States military may conduct any commercial activity with Anthropic” as a result of the designation. </p>\n<p>His announcement came shortly after President Trump said he was directing federal agencies to “immediately cease” using the company’s technology.</p>\n<p>“The Leftwing nut jobs at Anthropic have made a DISASTROUS MISTAKE trying to STRONG-ARM the Department of War, and force them to obey their Terms of Service instead of our Constitution,” the president wrote in a post on Truth Social.</p>\n<p>However, Anthropic noted in its statement late Friday that it had “not yet received direct communication” from the Pentagon or the White House about the status of negotiations.</p>\n<p>“We have tried in good faith to reach an agreement with the Department of War, making clear that we support all lawful uses of AI for national security aside from the two narrow exceptions above,” the company said. “To the best of our knowledge, these exceptions have not affected a single government mission to date.”</p>\n<p>The AI firm added that it plans to challenge any supply chain risk designation in court.</p>\n<p>Despite Hegseth’s comments, it also argued that the Defense secretary “does not have the statutory authority” to bar anyone who does business with the military from doing business with Anthropic.</p>\n<p>Instead, it suggested the law can only extend to the use of its AI models as part of DOD contracts and “cannot affect how contractors use Claude to serve other customers.”</p>\n<p>“No amount of intimidation or punishment from the Department of War will change our position on mass domestic surveillance or fully autonomous weapons,” Anthropic added.</p>",
            "kind": 1,
            "link": "https://thehill.com/policy/technology/5759929-pentagon-anthropic-supply-chain-risk/",
            "pub_date": "2026-02-28 10:46:26",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5759831,
            "title": "Trump told Patel he wasn't pleased with FBI director's Olympic partying: Report",
            "description": "<p>President Trump told FBI Director Kash Patel that he was disappointed by Patel’s behavior while <a href=\"https://thehill.com/homenews/administration/5750666-kash-patel-team-usa-backlash/\">partying</a> with the U.S. men’s hockey team during the Winter Olympics in Milan, Italy, <a href=\"https://www.nbcnews.com/politics/trump-administration/trump-fbi-director-kash-patel-olympics-hijinks-rcna260835\">NBC News</a> reported Friday. </p>\n<p>The team had won the gold medal after defeating Canada 2-1 in overtime. Patel, a hockey fan, was seen yelling, banging on a table and gulping down a bottle of beer during the locker room celebration on Sunday. Video of the incident, <a href=\"https://x.com/WilliamTurton/status/2025716894636929264\">first shared by ProPublica</a>, went viral.</p>\n<p id=\"anchor-7e6762\">Trump, who doesn’t drink alcohol, told Patel that he was not happy with the incident and disliked Patel using a government aircraft to fly to Milan, a person familiar with the matter told NBC News.</p>\n<p id=\"anchor-e43693\">White House spokesperson Abigail Jackson did not address the reported incident in a statement to The Hill, instead crediting Patel with lowering crime rates in the U.S.</p>\n<p>“This is a direct result of the President’s law and order agenda which is being successfully implemented by his law and order team, including FBI Director Kash Patel,” Jackson said. “The President has full confidence in his Administration.”</p>\n<p>The Hill also reached out to the FBI for comment.</p>\n<p id=\"anchor-e21211\">Patel <a href=\"https://thehill.com/homenews/administration/5750297-patel-joins-us-hockey-gold/\">dismissed criticism</a> over his behavior on Sunday in <a href=\"https://x.com/Kash_Patel/status/2025736412125855918\">a post</a> on the social platform X addressed to “the very concerned media.”</p>\n<p>“Yes, I love America and was extremely humbled when my friends, the newly minted Gold Medal winners on Team USA, invited me into the locker room to celebrate this historic moment with the boys- Greatest country on earth and greatest sport on earth,” he wrote. </p>\n<p>The FBI previously pushed back on questions about Patel using a government aircraft to fly to Milan. The agency said Patel went to Italy to meet “with regional partners and security teams,” with these travel plans having been planned months in advance.</p>\n<p>Democrats criticized Patel’s visit, with Xochitl Hinojosa, spokesperson for the Department of Justice under former President Biden, saying his attendance contradicts several other ongoing matters requiring FBI focus.</p>\n<p>“There was a threat at the president’s residence at MAL [Mar-a-Lago], Americans in Mexico are facing major threats by cartel members, Nancy Guthrie is still missing, and our FBI Director thinks he’s a frat bro?!” she <a href=\"https://x.com/XochitlHinojosa/status/2025731516236480756?s=20\" rel=\"noreferrer noopener\" target=\"_blank\">wrote on X</a>.</p>\n<p>But as others called the trip inappropriate, media figures on the right praised Patel. Fox News host Will Cain wrote on X that despite “what the Left is trying to turn this into…every proud American is smiling through every second of this video.”</p>\n<p>Former U.S. Women’s National Team soccer captain Megan Rapinoe questioned why Patel was with the team and why the team members spoke with Trump on the phone about being at his State of the Union address on Tuesday.</p>\n<p>“I would have never, as a captain or a leader on my team … I think that would have been clear to our staffs, and to the larger organization and support staff, those people would never be allowed in our locker rooms,” Rapinoe said on this week’s episode of her podcast with her partner, former professional basketball player Sue Bird, “A Touch More.”</p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/administration/5759831-patel-trump-locker-room-party/",
            "pub_date": "2026-02-28 09:06:36",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5759707,
            "title": "More Iranians face executions over protests: UN rights chief",
            "description": "<p>United Nations High Commissioner for Human Rights Volker Türk on Friday warned that more Iranians face the risk of being executed after <a href=\"https://thehill.com/policy/defense/5693657-iran-protests-trump-red-lines/\" rel=\"noreferrer noopener\" target=\"_blank\">widespread anti-government protests</a> last month.</p>\n<p>“I am horrified by reports that at least eight people, including two children, have been sentenced to death in connection with the protests,” Türk <a href=\"https://www.youtube.com/watch?v=GDOLXQpWIK0\" rel=\"noreferrer noopener\" target=\"_blank\">said in a speech</a> to the U.N. Human Rights Council in Geneva. “Another 30 are reportedly at risk of the same sentence.”</p>\n<p>“I urge independent, impartial and transparent investigations, fair trial guarantees, and an immediate moratorium on the death penalty,” he added. </p>\n<p>President Trump warned Iran against executing citizens amid the protests last month. Türk, in his speech Friday, said there has been a “new wave of protests at universities, making it clear that the underlying grievances remain.” He added that hundreds of people remain missing, calling the overall situation in Iran “volatile.”</p>\n<p>Türk said he was “extremely alarmed” about the possibility of “<a href=\"https://thehill.com/homenews/administration/5759142-trump-iran-strike-decision/\" rel=\"noreferrer noopener\" target=\"_blank\">regional military escalation</a>.” He called on “the voice of reason” to prevail.</p>\n<p>U.S. and Iranian diplomats held talks mediated in Oman on Thursday that yielded “<a href=\"https://thehill.com/policy/international/5757110-us-iran-talks-oman-complete/\" rel=\"noreferrer noopener\" target=\"_blank\">significant progress</a>,” Omani Foreign Minister Badr al-Busaidi described. Negotiations have focused on Iran’s nuclear program, but al-Busaidi said Iran offered to stop <a href=\"https://thehill.com/policy/international/5759623-iran-nuclear-deal-stockpiling/\" rel=\"noreferrer noopener\" target=\"_blank\">stockpiling enriched uranium</a> as part of a deal.</p>\n<p>“Now we are talking about zero stockpiling and that is very, very important because if you cannot stockpile material that is enriched, then there is no way you can actually create a bomb,” al-Busaidi told Margaret Brennan of CBS News’s “Face the Nation.”</p>\n<p>International nuclear inspectors could then inspect Iran’s facilities. Iran currently has a stockpile of between 300 and 400 kilograms of 60 percent-enriched uranium, which experts warn can be converted into a nuclear weapon.</p>\n<p>Iranian Foreign Minister Abbas Araghchi said Thursday’s talks ended with a “mutual understanding that we will continue to engage in a more detailed manner” on various issues central to the negotiations, namely the nuclear program but also “sanctions termination.”</p>\n<p>But Araghchi also said, without elaboration, that the U.S. needs to drop its “<a href=\"https://thehill.com/policy/international/5759214-iran-us-nuclear-talks/\" rel=\"noreferrer noopener\" target=\"_blank\">excessive demands</a>” amid talks.</p>\n<p>The positivity has not translated to the White House, where Trump said he is not happy with the direction of the negotiations and has not made a final decision on if he will strike Iran. Trump has threatened to strike Iran militarily during the protests last month, and last week he gave the country a 10-day timeline, ending Sunday, to come back to the negotiating table with a deal.</p>\n<p>“It would be nice if we could do it without, but sometimes you have to do it with,” Trump told reporters Friday before leaving the White House for an event in Texas. “We have the greatest military anywhere in the world, there’s nothing close. I’d love not to use it, but sometimes you have to.”</p>",
            "kind": 1,
            "link": "https://thehill.com/policy/international/5759707-iran-protests-death-sentences/",
            "pub_date": "2026-02-28 08:46:39",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5759772,
            "title": "RFK Jr. tells Joe Rogan he was not 'particularly happy' with Trump's glyphosate order",
            "description": "<p>Health and Human Services Secretary Robert F. Kennedy Jr. said in an interview that aired Friday that President Trump’s order <a href=\"https://thehill.com/policy/energy-environment/5745981-glyphosate-trump-order-maha-opposition/\" rel=\"noreferrer noopener\" target=\"_blank\">bolstering the controversial herbicide glyphosate</a> was “not something that I was particularly happy with.”</p>\n<p>Kennedy’s remarks to podcaster Joe Rogan departed somewhat from <a href=\"https://www.youtube.com/watch?v=wk7DQom821s\" rel=\"noreferrer noopener\" target=\"_blank\">his previous defense</a> of Trump’s move — though the Health secretary also expressed sympathy for the president’s position.</p>\n<p>“It’s not a good thing to have in your food so … it’s not something that I was particularly happy with. Let me put it that way, mildly,” he said.</p>\n<p>“But I also understand the president’s point of view,” he added. “If you ban glyphosate overnight, or if you got rid of it … it would destroy the American food system.”</p>\n<p>Kennedy <a href=\"https://thehill.com/policy/healthcare/5750676-kennedy-doubles-down-on-defense-of-trump-glyphosate-order-amid-maha-backlash/\" rel=\"noreferrer noopener\" target=\"_blank\">previously defended</a> Trump’s order, which said that pesticide companies should have “immunity” on glyphosate.</p>\n<p>“I support President Trump’s Executive Order to bring agricultural chemical production back to the United States and end our near-total reliance on adversarial nations,” he wrote in a post   Sunday night on social platform X.</p>\n<p>The nation’s top health official and his allies in the “Make America Healthy Again” movement have been <a href=\"https://thehill.com/policy/energy-environment/5685317-maha-pesticides-glyphosate-roundup-bayer-rfk-jr/\" rel=\"noreferrer noopener\" target=\"_blank\">critical of pesticides</a>, especially glyphosate.</p>\n<p>Trump’s order <a href=\"https://thehill.com/policy/healthcare/5753291-trump-mha-glyphosate-controversy/\" rel=\"noreferrer noopener\" target=\"_blank\">ignited a furor</a> among supporters of the group, which has been affiliated with the president.</p>\n<p>Glyphosate has been the key ingredient in Roundup weedkiller. Thousands of lawsuits have alleged that it is linked to cancer. </p>\n<p>Bayer, which owns Roundup-maker Monsanto, says that the chemical is not harmful. The company recently announced a settlement agreement with plaintiffs suing over the glyphosate.</p>",
            "kind": 1,
            "link": "https://thehill.com/policy/energy-environment/5759772-rfk-jr-joe-rogan-trump-glyphosate-order-maha/",
            "pub_date": "2026-02-28 08:06:49",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5759750,
            "title": "Bill Clinton gets bipartisan praise for cooperating in historic deposition on Epstein",
            "description": "<p>Both Republicans and Democrats said former President Clinton was “very cooperative” in a historic deposition with the House Oversight and Government Reform Committee on Friday that set a new precedent for how congressional investigators treat former presidents.</p>\n<p>“He did attempt to respond to every single question asked, even when his attorney told him to shut up,” House Oversight Committee Chair James Comer (R-Ky.) said after the deposition.</p>\n<p>“This was historical,” Comer said. “I believe that in the history of Congress, the two highest ranked officials to ever be deposed by Congress would be President Bill Clinton and Secretary of State Hillary Clinton.”</p>\n<p>Comer said the panel “picked up some new facts” and that lawmakers asked the Clintons where they should go from here in their Jeffrey Epstein investigation.</p>\n<p>“We’re going to bring more people in. We’re not finished,” Comer said.</p>\n<p>Comer has previously said it is “very possible” that Commerce Secretary Howard Lutnick will be asked to testify on Epstein. And he alluded to calls from some Republican members of the committee to scrutinize women who were both victims of Epstein and helped funnel young women to him.</p>\n<p>“I think one of the issues we have can you be a victim and a victimizer?” Comer said.</p>\n<p>Bill Clinton, who had spent time with Epstein and flew on his plane in the 1990s and early 2000s, said in his opening statement that he “did nothing wrong” and had “no idea of the crimes” Epstein was committing. He noted he was no longer associated with Epstein by the time he was convicted of sex crimes in 2008. </p>\n<p>“As someone who grew up in a home with domestic abuse, not only would I not have flown on his plane if I had any inkling of what he was doing — I would have turned him in myself and led the call for justice for his crimes, not sweetheart deals,” Clinton said.</p>\n<p>Comer said that going forward, the panel will be most interested in individuals who spent time with Epstein after his first conviction.</p>\n<p>Some Republicans on the panel dismissed Clinton’s denials.</p>\n<p>“Riiight. This gaslighting is top shelf. Slick Willie is at it again,” Rep. Lauren Boebert (R-Colo.) <a href=\"https://x.com/RepBoebert/status/2027492769380409622?s=20\" rel=\"noreferrer noopener\" target=\"_blank\">posted on social platform X</a>.</p>\n<p>The former president and former Secretary of State Hillary Clinton, who was deposed on Thursday, sat for depositions about seven months after being subpoenaed by the committee in its investigation into matters surrounding Epstein. They first resisted, saying they had no knowledge of his criminal activities and arguing the subpoenas were invalid, before relenting this month as they faced being held in contempt of Congress for refusing to comply with a congressional subpoena.</p>\n<p>Hillary Clinton <a href=\"https://thehill.com/homenews/house/5756577-clintons-questioned-epstein-links/\" rel=\"noreferrer noopener\" target=\"_blank\">testified before the committee</a> Thursday, telling lawmakers she did not recall ever meeting Epstein and had no information about Epstein’s criminal activities.</p>\n<p>Both Republicans and Democrats said Friday that Bill Clinton answered lawmakers’ questions in good faith, even as the former president had warned he would often say he did not recall: “That might be unsatisfying. But I’m not going to say something I’m not sure of. This was all a long time ago.”</p>\n<p>There was some praise across the aisle from Rep. Nancy Mace (R-S.C.) to Rep. Melanie Stansbury (D-N.M.): “Representative Stansbury had a lot of courageous questions. She showed bravery today.”</p>\n<p>But Rep. Wesley Bell (D-Mo.) said Republicans were “unprofessional.”</p>\n<p>“When we hear members from other side coming into a deposition with conclusions, get no evidence to support those conclusions, and then announce to the world that these conclusions must be true. That is unprofessional. It’s unethical,” Bell said.</p>\n<p>Rep. Anna Paulina Luna (R-Fla.) told reporters that she believes Epstein was an “intelligence asset and running some form of a honey pot operation” and that she believes “President Clinton as well as the secretary were potentially targets of that operation.” Other members did not echo those assertions.</p>\n<p>A full transcript and video of the deposition is expected to be released, which Democrats are urging to happen quickly. Comer said the panel has just one employee who does the videography and is working to prepare the video, and both sides have to approve a transcript before it is publicly released.</p>\n<p>Democrats are saying that by compelling Clinton’s testimony, the deposition has changed the dynamic between Congress and the president; and they are calling for the same standard for President Trump.</p>\n<p>“Before this, we had the Trump rule. Trump defied, as all of you know, a congressional subpoena with the Jan. 6 Committee. He said, ‘presidents don’t have to testify,’” Rep. Ro Khanna (D-Calif.) said in a press conference before the deposition. “Now we have the Clinton rule, which is that presidents and their families have to testify when Congress issues a subpoena, and that means that Donald Trump needs to come before our committee and explain what he knew about Epstein and explain why we have not had a full release of the documents.”</p>\n<p>Back in Washington, Trump <a href=\"https://thehill.com/homenews/5759183-trump-says-hes-not-happy-to-see-bill-clinton-deposed-over-epstein-files/\" rel=\"noreferrer noopener\" target=\"_blank\">acknowledged the precedent</a> set by the deposition taking place — and how that could affect him in the future.</p>\n<p>“I don’t like seeing him deposed, but they certainly went after me a lot more than that,” Trump told reporters before departing the White House for Texas.</p>\n<p>Comer addressed Democrats’ calls for Trump to testify, defending the president by giving reporters a readout of a line of questioning by Rep. Robert Garcia (Calif.), the top Democrat on the panel.</p>\n<p>“Ranking member Garcia asked President Clinton, quote, ‘Should President Trump be called to answer questions from this committee?’ And President Clinton said, ‘That’s for you to decide.’ And the president went on to say that the President Trump has never said anything to me to make me think he was involved,” Comer said during a break in the questioning.</p>\n<p>Asked about that, Garcia said: “I think the best response is for you to view the complete record of what actually he said.”</p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/house/5759750-bill-clinton-epstein-deposition/",
            "pub_date": "2026-02-28 08:06:48",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5759771,
            "title": "Duffy's wife knocks Trump's Venezuela policy: 'We're getting a little too cozy'",
            "description": "<p>Fox News host Rachel Campos-Duffy, who is also the wife of Transportation Secretary Sean Duffy, criticized President Trump for getting “too cozy” with acting Venezuelan President Delcy Rodríguez, calling the leader a “communist.”  </p>\n<p>“We’re getting a little too cozy with Delcy Rodríguez. This is a hardcore communist. She can never be trusted,” Campos-Duffy <a href=\"https://x.com/RCamposDuffy/status/2027384011006353633?s=20\">said Friday on Fox News</a>. “She is detested by the Venezuelan people. </p>\n<p>“María Corina will win that election,” she added, referring to Venezuela’s opposition leader Maria Corina Machado.</p>\n<p>Rodríguez became acting president of the South American nation after the U.S. <a href=\"https://thehill.com/policy/defense/5671368-us-forces-capture-maduro/\">captured and arrested</a> ex-leader Nicolás Maduro and his wife last month, who both <a href=\"https://thehill.com/regulation/court-battles/5673103-maduro-pleads-not-guilty/\">pleaded not guilty</a> to drug-trafficking and weapons-related charges. </p>\n<p>Earlier this month, Rodríguez drew criticism for saying that <a href=\"https://thehill.com/homenews/administration/5741326-trump-delcy-rodriguez-venezuela-maduro-ouster/\">Maduro was still the rightful leader</a> of Venezuela. But Trump responded that the two “have a great relationship” and that “politically, maybe she has to say that.” </p>\n<p>Trump’s latest comments signal he’s maintained a close relationship with Rodríguez since calling her a “<a href=\"https://www.politico.com/news/2026/01/14/trump-delcy-rodriguez-venezuela-00730397\">terrific person</a>” following their phone call after Maduro was removed.</p>\n<p>“This partnership between the United States of America and Venezuela will be a spectacular one FOR ALL,” Trump <a href=\"https://truthsocial.com/@realDonaldTrump/posts/115895806350456434\">said on Truth Social</a> on Jan. 14. “Venezuela will soon be great and prosperous again, perhaps more so than ever before!” </p>\n<p>Rodríguez <a href=\"https://x.com/delcyrodriguezv/status/2011557862380871974\">described</a> the phone call as a “long and courteous conversation.”</p>\n<p>The Trump administration has sought to tap into Venezuela’s abundant oil reserves since taking Maduro and his wife into custody. </p>\n<p>Energy Secretary Chris Wright told <a href=\"https://www.nbcnews.com/world/venezuela/maduro-legitimate-president-venezuela-delcy-rodriguez-interview-trump-rcna258687\">NBC News</a> that working with Rodríguez has “been an amazing cooperation,” and that she has “delivered information.” He added that she had “made enormous positive changes” to Venezuela’s petroleum policies. </p>\n<p>Campos-Duffy has been outspokenly supportive of Machado. When Maduro was first captured, Campos-Duffy <a href=\"https://www.mediamatters.org/rachel-campos-duffy/fox-host-rachel-campos-duffy-suggests-trump-administration-should-install-maria\">said</a> in an interview with fellow Fox News host Lawrence Jones that “we would be better off” by putting “the woman who won the election back in office.” </p>\n<p>Machado wanted to be a part of the nation’s 2024 election cycle but was banned from participating. Instead, she backed the opposing party, led by Edmundo González, who claimed the election Maduro won was rigged. Some <a href=\"https://thehill.com/policy/international/4811599-venezuela-maduro-election-tally/\">data</a> showed González beat Maduro by more than double the votes.</p>\n<p>Campos-Duffy sat for an <a href=\"https://www.foxnews.com/video/6387811908112\">interview with Machado</a> shortly after she returned from a White House visit, where she gifted Trump her own Nobel Peace Prize medal for ending Maduro’s authoritarian reign of Venezuela.</p>\n<p>Initially, following the military operation where Maduro was captured, Trump said Machado didn’t have the “respect” of the Venezuelan people. But Machado has <a href=\"https://thehill.com/policy/international/5717234-maria-corina-machado-venezuela-presidency/\">said she will be president</a> of Venezuela “when the time comes.” </p>\n<p>“She respects President Trump. She respects President Trump so much… she knows where the bodies are buried here and I think she will work closely with Marco Rubio and with President Trump to put this country back on track,” Campos-Duffy said in her interview with Jones. “I’m very worried about the fact that we cannot trust Delcy Rodríguez. She is a bad, bad lady.”</p>",
            "kind": 1,
            "link": "https://thehill.com/policy/international/5759771-campos-duffy-venezuela-trump/",
            "pub_date": "2026-02-28 08:06:48",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5759573,
            "title": "Stephen A. Smith on White House bid: 'Come up with a way for me to keep my money'",
            "description": "<p>Sports commentator Stephen A. Smith on Thursday addressed rumors that he could <a href=\"https://thehill.com/homenews/campaign/5737806-stephen-a-smith-2028-trump/\" rel=\"noreferrer noopener\" target=\"_blank\">launch a bid</a> to run for president in 2028 but said he needs to think up of a way for him to keep his money.</p>\n<p>“I’m telling you, if there was a way for me to be on that big debate stage and I didn’t have to give up my money to be on that debate stage, my brother, you look out,” Smith said in an interview on “<a href=\"https://www.youtube.com/watch?v=a1FYZA84f6U\" rel=\"noreferrer noopener\" target=\"_blank\">The Rubin Report</a>” podcast with host Dave Rubin.</p>\n<p>Rubin asked Smith if he was doing a “media play” to see if running is a viable option or if he is serious about tossing his hat in the race.</p>\n<p>“What I’m saying, Mr. Rubin, is this: Come up with a way for me to keep my money,” he exclaimed. “And I’m like, ‘I’ll show up!'”</p>\n<p>The two talked about Smith’s politics, referring to himself as socially liberal and fiscally conservative. He said he would run as a Democrat. </p>\n<p>“Well, first of all, I’ve never considered myself conservative when it came to social issues, anything outside of fiscal issues,” Smith said when Rubin asked why he would run as a Democrat. “I’ve always considered myself a liberal.”</p>\n<p>He said he was pro-choice despite being against abortion because he doesn’t “believe in telling a woman what to do with her body.” Smith added that he is also supportive of the LGBTQ community and said free-market capitalism and national security are issues that “matter” to him</p>\n<p>Smith made similar remarks during an <a href=\"https://thehill.com/blogs/in-the-know/5620799-stephen-smith-politics-2028/\" rel=\"noreferrer noopener\" target=\"_blank\">interview with The Hill</a> in November. He said at the time, which he has repeated since, that he is not ruling out a run and a chance to be on the debate stage next year.</p>\n<p>“I love what I do, and I’m not willing to give up my money,” said Smith, <a href=\"https://www.nytimes.com/athletic/6634775/2025/09/17/stephen-a-smith-espn-politics-sirius/\" rel=\"noreferrer noopener\" target=\"_blank\">who reportedly makes</a> $40 million a year.</p>\n<p>Smith has floated the idea of running for president in 2028 for several months now, becoming more outspoken about current politics and the divisions between Democrats and Republicans. </p>\n<p>On Wednesday, he said President Trump played Democrats “<a href=\"https://thehill.com/homenews/media/5757144-donald-trump-democrats-immigration-stephen-a-smith/\" rel=\"noreferrer noopener\" target=\"_blank\">like a fiddle</a>” when the president pressed Democrats on the issue of immigration during his State of the Union address the night before.</p>\n<p>Smith accused Democrats of hating Trump so much and expressing their “own personal feelings and animus towards him.”</p>\n<p>“And every time you do that, he smiles and mocks you and has a field day,” the commentator said.</p>",
            "kind": 1,
            "link": "https://thehill.com/blogs/in-the-know/5759573-smith-money-presidential-bid/",
            "pub_date": "2026-02-28 07:41:07",
            "source": "thehill",
            "language": "en"
        }
    ]
}