{
    "data": [
        {
            "id": 5755893,
            "title": "Georgia is becoming Iran's sanctions evasion hub",
            "description": "<p>Tbilisi’s TV Tower <a href=\"https://oc-media.org/tbilisi-marks-irans-islamic-revolution-amidst-ongoing-government-crackdown/\" rel=\"noreferrer noopener\" target=\"_blank\">lit up</a> in the colors of the Islamic Republic on Feb. 11 to mark the anniversary of the 1979 revolution that brought Iran’s theocratic rulers to power. The streets in Tbilisi tell a different story: Ordinary Georgians have <a href=\"https://www.foxnews.com/world/georgian-demonstrators-watch-iran-closely-own-protests-grind?msockid=397a971568a9680b0c0f816169f96962\" rel=\"noreferrer noopener\" target=\"_blank\">rallied</a> behind the Iranian people in their struggle against the clerical regime. </p>\n<p>These Georgians fear their own increasingly authoritarian ruling party, Georgian Dream, is becoming more like Tehran’s dictatorship. But that has not stopped Georgian Dream from pursuing closer ties with Iran, handing Tehran an avenue to circumvent U.S. sanctions.</p>\n<p>A new <a href=\"https://civicidea.ge/en/behind-the-barrels-iranian-oil-and-political-ties-in-georgia/\" rel=\"noreferrer noopener\" target=\"_blank\">report</a> by the Georgian NGO Civic IDEA provides a clear snapshot of this burgeoning relationship. It finds that 72 companies registered in Georgia imported Iranian oil and petroleum products from 2022 to 2025. These importers include companies linked to Georgian Dream donors, state tenders, and public officials, including a former Georgian Dream member of Parliament.</p>\n<p>Iran’s strategic objective is to ensure access to foreign markets despite American sanctions. <a href=\"https://www.tabnak.ir/fa/news/737581/%DA%A9%D8%B4%D9%88%D8%B1%DB%8C-%DA%A9%D9%87-%D8%AF%D8%B1%D9%88%D8%A7%D8%B2%D9%87-%D9%88%D8%B1%D9%88%D8%AF-%D8%A7%DB%8C%D8%B1%D8%A7%D9%86-%D8%A8%D9%87-%D8%A8%D8%A7%D8%B2%D8%A7%D8%B1-%D8%A7%D8%B1%D9%88%D9%BE%D8%A7%D8%B3%D8%AA\" rel=\"noreferrer noopener\" target=\"_blank\">Iranian officials describe</a> Georgia as a favorable route for exporting Iranian goods to the European Union. In late 2021, Iran, Azerbaijan and Georgia <a href=\"https://forbes.ge/irani-azerbaijani-da-saqarthvelo-akhali-satranzito-marshrutis-sheqmnaze-shethankhmdnen/\" rel=\"noreferrer noopener\" target=\"_blank\">agreed to cultivate</a> a transit corridor linking Iran’s Persian Gulf ports to Georgia’s Black Sea ports of Batumi and Poti. In addition to moving licit goods, this corridor can facilitate sanctions-busting by obscuring the Iranian origin of illicit cargoes.</p>\n<p>After Georgian Dream assumed power in 2012, the country’s annual trade with Iran <a href=\"https://transparency.ge/en/post/georgia-politically-and-economically-moving-closer-iran\" rel=\"noreferrer noopener\" target=\"_blank\">nearly tripled</a> to $322 million by 2024. The vast majority, $285 million, consisted of imports from Iran. Meanwhile, the number of Iranian companies registered in Georgia has <a href=\"https://www.transparency.ge/en/post/georgia-politically-and-economically-moving-closer-iran#:~:text=companies%20in%20Georgia%20%E2%80%93-,four%20times%20more,-than%20the%20number\" rel=\"noreferrer noopener\" target=\"_blank\">exploded</a>, reaching <a href=\"https://www.rferl.org/a/iran-businesses-georgia-sanctions-evasion/33568509.html\" rel=\"noreferrer noopener\" target=\"_blank\">nearly 13,000</a> as of 2025.</p>\n<p>Many of those Iranian firms are <a href=\"https://www.radiotavisupleba.ge/a/%E1%83%98%E1%83%A0%E1%83%90%E1%83%9C%E1%83%A3%E1%83%9A%E1%83%98-%E1%83%99%E1%83%9D%E1%83%9B%E1%83%9E%E1%83%90%E1%83%9C%E1%83%98%E1%83%94%E1%83%91%E1%83%98-%E1%83%A4%E1%83%98%E1%83%A5%E1%83%AA%E1%83%98%E1%83%A3%E1%83%A0-%E1%83%9B%E1%83%98%E1%83%A1%E1%83%90%E1%83%9B%E1%83%90%E1%83%A0%E1%83%97%E1%83%94%E1%83%91%E1%83%96%E1%83%94/33554602.html\" rel=\"noreferrer noopener\" target=\"_blank\">tied</a> to a small number of addresses, often indicative of illicit activity. For example, some 700 Iranian companies were registered at one address in Tbilisi, while another 800 were registered in Dunta, a small rural village in western Georgia, roughly 105 miles from the capital. Iranian consultancies openly <a href=\"https://www.rferl.org/a/iran-businesses-georgia-sanctions-evasion/33568509.html\" rel=\"noreferrer noopener\" target=\"_blank\">coach</a> clients to register companies near Georgian ports and rebrand goods as “Made in Georgia.”</p>\n<p>In one sanctions-busting scheme <a href=\"https://home.treasury.gov/news/press-releases/jl2287\" rel=\"noreferrer noopener\" target=\"_blank\">revealed</a> by the U.S. Treasury Department in 2014, several Iranian individuals <a href=\"https://civicidea.ge/wp-content/uploads/2025/07/Iran-ENG.pdf\" rel=\"noreferrer noopener\" target=\"_blank\">established multiple companies in Georgia</a> and surreptitiously acquired a 70 percent stake in Georgia’s InvestBank. They used that bank for transactions totaling roughly $8 million with Iranian banks that were under U.S. sanctions.</p>\n<p>At the time, the U.S. Treasury praised the Georgian government for working “closely” with Washington to counter illicit Iranian activity. But as U.S.-Georgian relations have frayed amid democratic backsliding by Georgian Dream, that cooperation is under greater strain.</p>\n<p>Meanwhile, Tbilisi has pursued closer political ties with Iran. In May 2024, Georgian Prime Minister Irakli Kobakhidze attended the <a href=\"https://1tv.ge/lang/en/news/pm-fm-attend-funeral-service-of-irans-late-president/\" rel=\"noreferrer noopener\" target=\"_blank\">funeral</a> of Iran’s former president, Ebrahim Raisi, <a href=\"https://www.nytimes.com/2024/05/22/world/middleeast/iran-president-raisi-funeral.html\" rel=\"noreferrer noopener\" target=\"_blank\">alongside</a> officials from Hamas, Hezbollah, the Taliban, and Russia. Kobakhidze <a href=\"https://georgia.mfa.gov.ir/en/newsview/750557/Prime-Minister-of-Georgia-Meets-with-President-of-Iran\" rel=\"noreferrer noopener\" target=\"_blank\">returned</a> the following July for the inauguration of Iran’s new president, Masoud Pezeshkian.</p>\n<p>The next year, Georgian Deputy Prime Minister Aleksandre Khvtisiashvili <a href=\"https://oc-media.org/georgian-official-attends-iranian-embassy-event-commemorating-those-killed-in-iran-israel-war/\" rel=\"noreferrer noopener\" target=\"_blank\">attended</a> an event at the Iranian embassy commemorating what Tehran described as “martyrs” killed in the 12-Day War between Iran and Israel. According to the embassy, Khvtisiashvili “made entries in the condolence book at the Embassy” and “expressed condolences and solidarity to Iran,” drawing a <a href=\"https://www.radiotavisupleba.ge/a/33462165.html?ref=oc-media.org\" rel=\"noreferrer noopener\" target=\"_blank\">protest</a> from Israel.</p>\n<p>Researchers have also <a href=\"https://dfrlab.org/2023/04/27/iran-linked-website-targets-georgias-ethnic-azerbaijani-community-with-anti-west-content/\" rel=\"noreferrer noopener\" target=\"_blank\">documented</a> Iran-linked media activity targeting minority communities in Georgia with anti-Western messaging and narratives sympathetic to Tehran and Moscow. These influence operations matter because they reduce friction: The more Tehran can shape perceptions and polarize communities, the easier it is to operate commercially and politically.</p>\n<p>The United States is <a href=\"https://www.fdd.org/analysis/2026/02/13/vance-visit-to-armenia-and-azerbaijan-signals-u-s-push-into-region-dominated-by-russia/\" rel=\"noreferrer noopener\" target=\"_blank\">investing</a> political capital in the South Caucasus by brokering deals, financing infrastructure, and trying to build transit and energy corridors that bypass Russia and Iran. But Georgia, once America’s closest friend in the region, is undermining that strategy by creating a permissive hub for adversary influence and sanctions evasion. </p>\n<p>Washington should make clear that Tbilisi will face consequences. The Treasury Department should aggressively penalize Georgia-based individuals and entities involved in sanctions-evasion, especially where <a href=\"https://civicidea.ge/en/behind-the-barrels-iranian-oil-and-political-ties-in-georgia/\" rel=\"noreferrer noopener\" target=\"_blank\">those networks overlap</a> with persons connected to Georgia Dream.</p>\n<p>In concert, the U.S. should pair sanctions enforcement with renewed pressure on Tbilisi over its democratic backsliding. These are not separate problems. The environment that enables Georgian Dream to <a href=\"https://freedomhouse.org/country/georgia/freedom-world/2025\" rel=\"noreferrer noopener\" target=\"_blank\">crush</a> watchdogs, intimidate media, and concentrate power is the same environment that makes sanctions evasion easier to operationalize and harder to investigate.</p>\n<p>To add teeth to U.S. diplomatic warnings, Washington should expand and strictly enforce targeted sanctions against Georgia Dream officials, propagandists, and financiers involved in corruption, electoral manipulation, and human rights abuses. For starters, Treasury should build on its <a href=\"https://ofac.treasury.gov/recent-actions/20241227\" rel=\"noreferrer noopener\" target=\"_blank\">2024 designation</a> of Bidzina Ivanishvili, the billionaire who rules Georgia behind the scenes, by tracking and targeting his assets, which he likely has <a href=\"https://www.bbc.com/news/articles/cj91xgylkwlo\" rel=\"noreferrer noopener\" target=\"_blank\">attempted</a> to shield.</p>\n<p>The tower lighting was a message. The U.S. needs to send Georgia a strong message back — not just with words, but with action.</p>\n<p><em>Keti Korkiya is a research analyst in the Russia Program at the Foundation for Defense of Democracies.</em></p>",
            "kind": 1,
            "link": "https://thehill.com/opinion/international/5755893-georgia-dream-iran-ties/",
            "pub_date": "2026-02-27 01:36:17",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5756578,
            "title": "NJ mayor demands probe after ICE chase leads to chain-reaction collision",
            "description": "<p>NEW JERSEY (<a href=\"https://pix11.com/news/local-news/nj-mayor-demands-probe-after-ice-chase-leads-to-chain-reaction-collision/\" rel=\"noreferrer noopener\" target=\"_blank\">WPIX</a>) – A high-speed pursuit involving federal immigration agents ended in a chain-reaction crash Wednesday in Newark, sending several people, including schoolchildren, to the hospital and prompting calls for a state investigation.</p>\n<p>Newark Mayor Ras Baraka said U.S. Immigration and Customs Enforcement (ICE) agents caused the crash by illegally chasing a man through city streets Wednesday morning.</p>\n<p>The pursuit ended when vehicles connected to the operation collided with three civilian cars, witnesses and city officials said.</p>\n<div class=\"nlp-ignore-block article-content rich-text\">\n\n</div>\n<p>Shamad Davis, who witnessed the incident, said immigration agents began chasing a man driving a work van at high speed before the situation spiraled into a crash.</p>\n<p>“He flew up the hill and they started chasing him,” Davis said. “Next thing you know, it was a full collision and all three cars were totaled.”</p>\n<p>Three young siblings riding in a Lyft on their way to school were inside one of the vehicles struck during the crash, according to Newark Public Safety officials. Davis said the children appeared shaken and injured after the collision.</p>\n<p>“One was hysterical and couldn’t control herself,” he said. “Another complained her head was hurting, and the boy said his ankle was injured.”</p>\n<p>Video from the scene showed the children’s mother angrily confronting masked federal agents as emergency crews treated victims nearby. A crowd of residents gathered, shouting at immigration officers as tensions escalated.</p>\n<figure class=\"wp-block-image size-full\"><img alt=\"Chase involving ICE vehicles results in crash in Newark\" class=\"wp-image-747655\" decoding=\"async\" src=\"https://www.nxsmediawire.com/wp-content/uploads/sites/107/2026/02/ICE-CHASE.png?strip=1\"/><figcaption class=\"wp-element-caption\">A high-speed pursuit involving federal immigration agents ended in a chain-reaction crash Wednesday in Newark’s South Ward, sending several people, including schoolchildren, to the hospital and prompting calls for a state investigation. (WPIX)</figcaption></figure>\n<p>Immigrant advocates criticized federal enforcement tactics, arguing civil immigration matters should not involve dangerous vehicle pursuits.</p>\n<p>“It’s not up to ICE to be chasing people around,” said Amy Torres, executive director of the New Jersey Alliance for Immigrant Justice. “Whether someone has charges or convictions is a matter for the criminal legal system.”</p>\n<p>The man targeted by agents was seen being taken to a hospital on a stretcher. It’s unclear what happened following his hospitalization. Authorities said no life-threatening injuries were reported.</p>\n<p>Torres noted that a similar immigration-related pursuit earlier this month in Georgia ended in a fatal crash involving a Savannah schoolteacher, raising broader concerns about enforcement practices.</p>\n<p>Baraka said the city plans to submit police reports and evidence to the New Jersey attorney general’s office, urging an investigation into what he described as an illegal pursuit.</p>\n<p>“We’re going to use the police report and information we have and ask the governor and attorney general to take action and pursue this,” the mayor said.</p>\n<div class=\"nlp-ignore-block article-content rich-text\">\n\n</div>\n<p>Hours after the crash, Baraka signed an executive order banning immigration enforcement operations inside Newark city buildings without a judicial warrant. The order also directs city employees to report suspected unauthorized federal enforcement activity.</p>\n<p>Nexstar’s WPIX reached out to federal immigration officials who have not publicly commented on the incident as of Wednesday night.</p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/state-watch/5756578-ice-car-crash-new-jersey/",
            "pub_date": "2026-02-27 01:36:17",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5756715,
            "title": "Columbia says immigration officials detained a student after misrepresenting reason for entering school building",
            "description": "<p>Columbia University said Thursday that federal immigration officials detained a student after misrepresenting their purpose for entering a school building. </p>\n<p>Columbia <a data-id=\"https://president.columbia.edu/news/important-update-columbia-university\" data-type=\"link\" href=\"https://president.columbia.edu/news/important-update-columbia-university\">said that early this morning</a> federal agents from the Department of Homeland Security (DHS) went into a residential building owned by the university and detained a student. </p>\n<p>“Our understanding at this time is that the federal agents made misrepresentations to gain entry to the building to search for a ‘missing person.’ We are working to gather more details,” said Claire Shipman, acting president of the university. </p>\n<p>She added that DHS officers need a judicial warrant or subpoena to enter non-public buildings, writing, “An administrative warrant is not sufficient.” </p>\n<p>“If law enforcement agents seek entry to non-public areas of the University, ask the agents to wait to enter any non-public areas until contacting Public Safety. Public Safety will contact the Office of the General Counsel to coordinate the University’s response. Do not allow them to enter or accept service of a warrant or subpoena,” Shipman said. </p>\n<p>Columbia said it is working to gather more information and provide legal support to the student’s family. </p>\n<p>The Hill has reached out to DHS for comment.  </p>\n<p>The incident comes a year after the <a href=\"https://thehill.com/regulation/court-battles/5398448-mahmoud-khalil-trump-administration-detention-example/\" rel=\"noreferrer noopener\" target=\"_blank\">high-profile arrest</a> of Mahmoud Khalil, a recent graduate of the university and one of the leaders of its pro-Palestinian movement. He has since been released, but <a data-id=\"https://thehill.com/regulation/court-battles/5690897-appeals-court-rules-against-khalil/\" data-type=\"link\" href=\"https://thehill.com/regulation/court-battles/5690897-appeals-court-rules-against-khalil/\">his legal fight is not over</a>, and the government is still threatening to deport him.</p>\n<p>In July, <a data-id=\"https://thehill.com/homenews/ap/ap-u-s-news/ap-columbia-trump-deal-federal-funding/\" data-type=\"link\" href=\"https://thehill.com/homenews/ap/ap-u-s-news/ap-columbia-trump-deal-federal-funding/\">Columbia reached an agreement</a> with the Trump administration to pay more than $220 million in order to restore frozen federal research funding.</p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/education/5756715-columbia-immigration-dhs-student-arrest/",
            "pub_date": "2026-02-27 01:26:01",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5756632,
            "title": "NYPD arrests man for allegedly assaulting officers during snowball fight",
            "description": "<p>The New York City Police Department arrested a 27-year-old man for allegedly assaulting officers with snow and ice on Monday during a <a href=\"https://thehill.com/homenews/state-watch/5753113-mayor-mayor-nypd-snowball/\">massive snowball fight</a> in Washington Square Park on Monday.</p>\n<p>Gusmane Coulibaly was taken into custody Thursday morning, the NYPD said, noting he was also arrested less than three weeks ago for attempted robbery in the transit system.</p>\n<p>The arrest is the latest development in a political rift that has emerged between New York City Mayor Zohran Mamdani (D) and Police Commissioner Tisch after video circulated on social media showing NYPD officers getting pelted with snowballs and snow chunks on Monday after they were called in to control an escalating citywide snowball fight during a historic blizzard. </p>\n<p>Encounters with police officers were caught on video. Some began showing the officers apparently brushing off the snowballs they faced as they walked through the park, but others showed the increasingly tense dynamic as larger chunks of snow and snowballs came hurling in their direction, including at their faces and necks, and a crowd began chasing them. </p>\n<p>While the officers largely did not engage with the individuals, a couple officers were seen shoving people off of them as they retreated. The police later said two officers were taken to a nearby hospital for treatment. </p>\n<p>Tisch responded to footage of the incident by condemning the “individuals attacking cops” and characterizing the behavior as “disgraceful” and “criminal,” as she said her detectives were investigating the situation. </p>\n<p>Mamdani at first urged the public to treat police officers with respect, thanking them for their help during the blizzard. But he characterized the footage as “kids throwing snowballs” and later said he didn’t think anyone should be charged in connection to the fight.</p>\n<p>Mamdani’s response earned broad condemnation from critics, including the largest police union, which blasted Mamdani’s “failure of leadership.”</p>\n<p>“By ignoring their injuries and dismissing the incident, the mayor has sent a disgraceful message to every police officer who serves this city, and a dangerous message to every person who might be looking to attack a police officer in the future,” Patrick Hendry, president of the Police Benevolent Association, said in a statement Tuesday.</p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/state-watch/5756632-nyc-snowball-fight-arrest/",
            "pub_date": "2026-02-27 01:16:53",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5756686,
            "title": "Huckabee: Carlson saying Israel pushing around Trump 'offensive'",
            "description": "<p>U.S. Ambassador to Israel Mike Huckabee said Wednesday that it was “offensive” for conservative pundit Tucker Carlson to suggest in a recent interview that President Trump was taking cues from the Israeli government on foreign policy.</p>\n<p>“It’s very offensive to think that President Trump is, as Tucker Carlson characterized it, somebody who is being pushed around by Israel. That is the most nonsensical thing,” Huckabee told News Nation’s Leland Vittert on “<a href=\"https://www.newsnationnow.com/on-balance-with-leland-vittert/\">On Balance</a>.”</p>\n<p>Carlson and Huckabee both made <a href=\"https://thehill.com/policy/international/5749053-huckabee-israel-middle-east-takeover-carlson-interview/\">several provocative remarks</a> during an interview at Ben Gurion Airport in Tel Aviv, Israel, earlier this month.</p>\n<p>The <a href=\"https://thehill.com/homenews/ap/ap-international/ap-us-ambassador-causes-uproar-by-claiming-israel-has-a-right-to-much-of-the-middle-east/\">heated sit-down</a> came amid <a href=\"https://thehill.com/homenews/house/5428783-republicans-israel-gaza/\">a rift within the Republican Party</a> over Israel that has widened since the war in Gaza began. While the GOP has historically been united in support of the U.S. ally, some members of the far right have recently pushed for a more isolationist approach.</p>\n<p>Carlson has long accused U.S. officials — including Huckabee — of prioritizing Israel’s interests over America’s. His critics, in turn, have <a href=\"https://thehill.com/homenews/media/5592049-tucker-carlson-conservative-civil-war/\">condemned his commentary</a> on Israel as echoing antisemitic themes and conspiracy theories.</p>\n<p>“I don’t know where this is coming from,” Huckabee responded after Vittert asked about the “anti-Israel cancer” spreading through the party. “I don’t know if it’s because of the influence of significant amounts of money from Arab countries. I don’t know. I think it would be nice if we did know.”</p>\n<p>“But what I do fully understand is that this is divisive to the Republican Party, divisive to America, and it’s based on lies and half-truths, and that’s what’s concerning to me,” he added.</p>\n<p>Huckabee labeled some of Carlson’s comments in the interview as “alarming and very, very disrespectful and disparaging” toward Trump. He said he hoped Carlson apologized during a reported visit to the White House on Wednesday.</p>\n<p>“Look, it doesn’t matter what Tucker Carlson thinks about me. I’m expendable,” Huckabee said.</p>\n<p>“It does matter what he thinks about President Trump and his administration and President Trump’s leadership is the world leader and the head of both foreign policy and domestic policy,” he continued.</p>\n<p>Trump <a href=\"https://thehill.com/policy/international/5746010-trump-board-of-peace-takeaways/\">convened the first meeting</a> of his <a href=\"https://thehill.com/policy/international/5745297-trump-funding-board-of-peace/\">Board of Peace</a> last week, a group of world leaders tasked with supervising postwar restoration efforts in Gaza, including the disarmament of Hamas, as part of the second phase of the president’s <a href=\"https://thehill.com/policy/international/5688828-trump-gaza-peace-plan-phase2/\">20-point peace plan</a>.</p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/administration/5756686-huckabee-offensive-carlson-trump-israel/",
            "pub_date": "2026-02-27 01:16:53",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5756722,
            "title": "FBI fires agents who worked on Trump Mar-a-Lago investigation",
            "description": "<p>The FBI has fired additional agents who worked on cases involving President Trump, including several who worked on the Mar-a-Lago documents case. </p>\n<p>A source who confirmed the firings to The Hill said at least 10 agents were removed Wednesday. </p>\n<p>The dismissals are just the latest in a wave of firing of FBI and Justice Department personnel who worked on the cases involving Trump. </p>\n<p>The FBI Agents Association blasted the move as weakening the bureau. </p>\n<p>“The FBIAA condemns today’s unlawful termination of FBI Special Agents, which—like other firings by Director Patel—violates the due process rights of those who risk their lives to protect our country,” the group said in a statement. </p>\n<p>“These actions weaken the Bureau by stripping away critical expertise and destabilizing the workforce, undermining trust in leadership and jeopardizing the Bureau’s ability to meet its recruitment goals—ultimately putting the nation at greater risk.”</p>\n<p>Trump was charged with violating the Espionage Act and obstruction of justice after he was found to have 300 documents with classified markings in his Florida estate. The case asserted Trump likewise ordered the documents moved to hide them from authorities and his own lawyer. </p>\n<p>The FBI previously fired agents who worked on the case charging Trump for his conduct related to Jan. 6.</p>\n<p>The Justice Department has similarly engaged in sweeping firings of prosecutors who worked on the Trump cases, as well as those who brought charges against rioters who stormed the Capitol that day. </p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/administration/5756722-fbi-trump-case-agent-firings/",
            "pub_date": "2026-02-27 01:16:52",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5756617,
            "title": "Rove says he'd bet on Talarico to win Texas Senate primary",
            "description": "<p>Republican strategist Karl Rove said Thursday that he would bet on Texas state Rep. James Talarico (D) to win the key Democratic U.S. Senate primary over Rep. Jasmine Crockett (D-Texas), a race that is being closely watched by political observers.</p>\n<p>“Polling in a primary is difficult, particularly in a state like Texas, because we don’t have party registration. You can vote in any primary you want. So, it’s very difficult to go about — So, if you look at the recent Dem[ocratic] polls, 43-47 Crockett over Talarico, 56-44 Crockett over Talarico, 38-37, Texas [Public] Opinion Research,” Rove said on Fox News’s “America’s Newsroom.”</p>\n<p>“Most of these polls were conducted before the [Stephen] Colbert incident, and he’s now gotten a large number of views [because] of that. If I were a betting man, I’d bet on Talarico,” he added, referencing the “Late Show” host <a data-id=\"https://thehill.com/homenews/campaign/5744369-cbs-late-show-controversy/\" data-type=\"link\" href=\"https://thehill.com/homenews/campaign/5744369-cbs-late-show-controversy/\">saying</a> CBS told him not to air Talarico’s appearance on his show.</p>\n<p>Crockett had a double-digit <a data-id=\"https://thehill.com/homenews/campaign/5755382-jasmine-crockett-leads-texas-senate/\" data-type=\"link\" href=\"https://thehill.com/homenews/campaign/5755382-jasmine-crockett-leads-texas-senate/\">lead</a> over Talarico in a recent University of Texas/Texas Politics Project Poll. The poll found Crockett ahead of Talarico, 56 to 44 percent, among likely Democratic primary voters in Texas.</p>\n<p>Democrats have sought to score electoral wins in Texas in recent years, but have come up short in many instances including former Rep. Beto O’Rourke’s (D-Texas) unsuccessful challenge against conservative stalwart Sen. Ted Cruz (R-Texas) in 2018.</p>\n<p>Both Talarico and Crockett are vying for Sen. John Cornyn’s (R-Texas) seat. </p>\n<p>On Monday, Cornyn <a data-id=\"https://thehill.com/homenews/campaign/5752512-cornyn-warns-texas-crack-red-wall/\" data-type=\"link\" href=\"https://thehill.com/homenews/campaign/5752512-cornyn-warns-texas-crack-red-wall/\">said</a> a Democrat taking his seat would be “the first crack in the red wall.” He said that either Talarico or Crocket “absolutely” has a shot of winning in the Lone Star State, especially in the case that they face off against Texas Attorney General Ken Paxton (R) in November.</p>\n<p>Republicans are currently dealing with issues such as affordability, files linked to convicted sex offender Jeffrey Epstein and backlash toward President Trump’s immigration agenda heading into this year’s midterm elections.</p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/campaign/5756617-texas-democrat-senate-primary-karl-rove-james-talarico/",
            "pub_date": "2026-02-27 01:06:03",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5755103,
            "title": "The American Dream gap: Why politicians aren't fixing the economy",
            "description": "<p>The American Dream is one of our nation’s most cherished ideals, and yet the public increasingly believes it is <a href=\"https://www.nytimes.com/2026/01/26/us/politics/affordability-poll.html?smid=nytcore-android-share\" rel=\"noreferrer noopener\" target=\"_blank\">out of reach for most people</a>. Even the Wall Street Journal acknowledges that <a href=\"https://www.wsj.com/economy/wsj-norc-economic-poll-73bce003?\" rel=\"noreferrer noopener\" target=\"_blank\">America is becoming a nation of economic pessimists</a>.</p>\n<p>If Americans are so unhappy about their economic prospects, why aren’t our politicians doing more to help citizens earn — and afford — more? While research shows that members of Congress tend to be <a href=\"https://www.cambridge.org/core/journals/perspectives-on-politics/article/conducting-the-heavenly-chorus-constituent-contact-and-provoked-petitioning-in-congress/2533A46180DE8CE40CE1993362A4B2AD\" rel=\"noreferrer noopener\" target=\"_blank\">sensitive to opinion in their districts</a>, ever concerned about their prospects for reelection, conventional accounts of public opinion misread the public’s perspectives. </p>\n<p>It is true that, on average, Americans have grown more pessimistic about economic opportunity in recent years. But most Republican citizens still believe in the American Dream. It is Democrats who have become much more skeptical, driving economic pessimism. This has insulated many Republican members of Congress, most of whom represent safe Republican districts, from the electoral challenge that might otherwise motivate them to craft legislation to assist low- and middle-income Americans.</p>\n<p>To be clear, nearly all Americans revere the American Dream as an ideal. However, <a href=\"https://www.ipsos.com/sites/default/files/ct/news/documents/2025-07/WTF-American-Dream-Topline-7-10-2025.pdf\" rel=\"noreferrer noopener\" target=\"_blank\">in a recent Ipsos survey,</a> nearly half of Americans said that “The American Dream isn’t attainable for someone like me.” In response to the statement “In America, if you work hard, you will succeed no matter what,” only a little over half of Americans agreed.</p>\n<p>Underlying these averages of beliefs about upward mobility are striking, and consequential, partisan differences. Republicans were 20 percentage points more likely than Democrats to agree that hard workers “succeed no matter what.” A Wall Street Journal/NORC survey found that <a href=\"https://www.wsj.com/economy/wsj-norc-economic-poll-73bce003\" rel=\"noreferrer noopener\" target=\"_blank\">90 percent of Democrats, but only 55 percent of Republicans</a>, were pessimistic about their economic future. </p>\n<p>Confusingly, as the income gap between the two parties has shrunk, what some refer to as “class de-polarization,” the partisan disagreement over the American Dream has grown. </p>\n<p>In my book, “<a href=\"https://www.russellsage.org/publications/book/debating-american-dream\" rel=\"noreferrer noopener\" target=\"_blank\">Debating the American Dream: How Explanations for Inequality Polarize Politics</a>,” I examine survey data over several decades. In 1999, Pew asked a representative sample of Americans to choose between the statements “most people who want to get ahead can make it if they’re willing to work hard” versus “hard work and determination are no guarantee of success for most people.” Approximately 80 percent of Republicans chose the first statement, and over 70 percent of Democrats did as well. </p>\n<p>Answering the exact same question more than two decades later, during Biden’s presidency, Republicans’ faith in hard work had fallen somewhat to 70 percent, while Democrats’ had sunk to 40 percent. Similar survey questions tell the same story.</p>\n<p>In sum, while everyone has grown more pessimistic, Democrats’ faith in the American Dream has fallen farther, faster. In previous decades, factors such as a person’s income, race or sex may have played a more important role in shaping their view of the American Dream. But, today, partisanship overshadows other factors. This generates wild swings in economic policy depending on which party controls our government: Those who question the fairness of the economy seek progressive reforms, and the true believers claw them back. </p>\n<p>It is important to keep in mind that the American Dream sets a high standard: if you work hard and play by the rules, you should expect to be able to afford a house, a car, health care and a good education for your children. If we take the standard seriously, our nation does not provide the American Dream to its people. </p>\n<p>Low- and middle-income workers <a href=\"https://www.weforum.org/stories/2022/09/working-hours-america-income-economy/\" rel=\"noreferrer noopener\" target=\"_blank\">work nearly as many hours as high-income workers</a> and face considerably more <a href=\"https://www.lisep.org/content/the-working-poor-how-time-scarcity-halts-the-pursuit-of-the-american-dream\" rel=\"noreferrer noopener\" target=\"_blank\">time scarcity</a>. Yet, 25 percent of U.S. households do not earn enough to <a href=\"https://www.pewresearch.org/short-reads/2025/05/07/growing-share-of-us-adults-say-their-personal-finances-will-be-worse-a-year-from-now/\" rel=\"noreferrer noopener\" target=\"_blank\">pay their bills</a> and many struggle to <a href=\"https://livingwage.mit.edu/\" rel=\"noreferrer noopener\" target=\"_blank\">cover their basic needs.</a> Median income households find themselves <a href=\"https://www.bankrate.com/mortgages/american-dream-of-homeownership-turning-into-luxury/\" rel=\"noreferrer noopener\" target=\"_blank\">priced out of 75 percent of the housing market</a>.</p>\n<p>What is to be done? Both parties are historically unpopular, with a <a href=\"https://news.gallup.com/poll/700499/new-high-identify-political-independents.aspx\" rel=\"noreferrer noopener\" target=\"_blank\">record number of Americans identifying as independents</a>. The Republican Party currently holds power in Washington, but there are not enough American Dream optimists left for them to retain it with their current economic agenda.</p>\n<p>It is worth remembering that Trump won the nomination back in 2016 because <a href=\"https://onlinelibrary.wiley.com/doi/full/10.1111/1468-4446.12323?\" rel=\"noreferrer noopener\" target=\"_blank\">he ran as an economic populist, although he has not governed as one.</a> The Democratic Party receives points for at least trying to assist everyday Americans but <a href=\"https://www.nytimes.com/2026/01/27/opinion/democrats-trump-midterms-future.html\" rel=\"noreferrer noopener\" target=\"_blank\">loses points for being perceived as weak and out of touch</a>.</p>\n<p>Those who are deeply concerned about economic fairness and opportunity — within both parties — should hold our leaders’ feet to the fire. We have important elections approaching in the coming months. Now would be the time to insist politicians forge some compromises to address wage stagnation, affordability and extreme levels of wealth inequality. Bipartisan economic reforms will improve Americans’ well-being, and strengthen both parties.</p>\n<p><em>Elizabeth Suhay is professor of government in the School of Public Affairs at American University. She is the author of “Debating the American Dream: How Explanations for Inequality Polarize Politics” and former chair of the American Political Science Association’s Class and Inequality section.</em></p>",
            "kind": 1,
            "link": "https://thehill.com/opinion/campaign/5755103-debating-american-dream-inequality/",
            "pub_date": "2026-02-27 01:06:03",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5756657,
            "title": "Democrats will force vote next week to limit Trump's war powers in Iran",
            "description": "<p>House Democrats will force a vote next week to curb President Trump’s war powers in Iran. </p>\n<p>The resolution is expected to fail, given the overwhelming opposition from Republicans and a small handful of Jewish Democrats. But party leaders want to get all lawmakers on the record by using a procedural move to sidestep GOP leaders and force the vote.</p>\n<p>“The Iranian regime is brutal and destabilizing, seen most recently in the killing of thousands of protestors,” a number of top Democrats said Thursday in a joint statement. “However, undertaking a war of choice in the Middle East, without a full understanding of all the attendant risks to our servicemembers and to escalation, is reckless.”</p>\n<p>The announcement arrives as Trump and other top administration officials are ramping up their threats against Tehran, both rhetorically and with a massive buildup of the U.S. armed forces in the Middle East, including two aircraft carrier strike groups. </p>\n<p>Negotiators for Iran and the U.S. are expected to meet in Geneva on Thursday in search of a deal on Tehran’s nuclear program. But the accumulation of U.S. forces in the region has led to widespread speculation that Trump intends to use them. </p>\n<p>The House resolution, sponsored by Reps. Ro Khanna (D-Calif.) and Thomas Massie (R-Ky.), would require Trump to win approval from Congress before launching any strikes. </p>\n<p>Khanna had initially planned to force a vote on the measure this week, but he pushed that timeline given the week’s abbreviated schedule, which was squeezed by inclement weather on Monday and an early recess to accommodate the Democrats’ annual retreat on Wednesday. </p>\n<p>The measure has a tough path to passage. Massie is the only Republican to say he’ll support it. And at least two Democrats — Reps. Josh Gottheimer (N.J.) and Jared Moskowitz (Fla.), both of whom are close Israel allies — have also announced their opposition. </p>\n<p>Supporters of the resolution remain undeterred. They’re pushing the measure as a way to reassert the constitutional power of Congress to wage war, arguing that any strikes on Iran without such approval would violate that separation of powers.  </p>\n<p>“We maintain that any such action would be unconstitutional without consultation with and authorization from Congress,” the Democrats said.</p>\n<p>The statement was endorsed by a number of top lawmakers, including House Minority Leader Hakeem Jeffries (N.Y.), Democratic Whip Katherine Clark (Mass.) and Democratic Caucus Chairman Pete Aguilar (Calif.). The top Democrats on key committees also signed on, including Reps. Jim Himes (Conn.), the ranking member of the Intelligence Committee; Greg Meeks (N.Y.), the top Democrat on the Foreign Affairs Committee; and Adam Smith (Wash.), the ranking member of the Armed Services Committee. </p>\n<p>Khanna, who also endorsed the statement, told The Hill earlier in the week that he would force the vote next week.</p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/house/5756657-democrats-trump-iran-war-powers/",
            "pub_date": "2026-02-27 00:56:36",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5755665,
            "title": "Live updates: Hillary Clinton says she 'had no idea' of Epstein's criminal activities; US, Iran talk in Geneva",
            "description": "<p>In New York, former Secretary of State Hillary Clinton will tell the House Oversight and Government Reform Committee in a <a href=\"https://thehill.com/homenews/house/5755536-clintons-depositions-epstein-investigation/\" rel=\"noreferrer noopener\" target=\"_blank\">closed-door deposition</a> that she “had no idea” of the criminal activities of convicted sex offender Jeffrey Epstein and his associate, Ghislaine Maxwell, according to the opening statement she released Thursday morning.</p>\n<p>Her husband, former President Clinton, will meet with the committee on Friday.</p>\n<p>Trump administration envoys are in Geneva for <a data-id=\"https://thehill.com/policy/international/5755742-trump-iran-nuclear-threat/\" data-type=\"link\" href=\"https://thehill.com/policy/international/5755742-trump-iran-nuclear-threat/\">another round of critical talks</a> with Iranian and Omani officials on the Islamic republic’s nuclear program.</p>\n<p>Secretary of State Marco Rubio said Wednesday he was hoping for “productive” conversations and that “diplomacy is always on the table.” Oman’s foreign ministry <a href=\"https://x.com/FMofOman/status/2026951058874929659\" rel=\"noreferrer noopener\" target=\"_blank\">said on social platform X</a> the talks were ongoing, with “a constructive spirit.”</p>\n<p>As the U.S. sets the stage for potential military action in the Middle Eastern country, however, a group of bipartisan senators has indicated it will push forward a <a href=\"https://thehill.com/homenews/senate/5755623-democrats-divided-over-iran-response/\" rel=\"noreferrer noopener\" target=\"_blank\">war powers resolution</a> seeking to rein in President Trump.</p>\n<p>On Capitol Hill, Department of Homeland Security funding talks remain stalled, as Senate Majority Leader John Thune is starting to <a href=\"https://thehill.com/homenews/senate/5755667-trump-thune-voting-bill-talking-filibuster/\" rel=\"noreferrer noopener\" target=\"_blank\">feel increasing pressure</a> to act on the GOP’s SAVE Act — which would require proof of citizenship when registering to vote.</p>\n<p>Trump will hold private meetings and receive an intelligence briefing on Thursday, while Vice President Vance will travel to Plover, Wis.</p>\n<p>Follow live below. </p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/administration/5755665-live-updates-trump-iran-hillary-clinton/",
            "pub_date": "2026-02-27 00:56:35",
            "source": "thehill",
            "language": "en"
        }
    ]
}