{
    "data": [
        {
            "id": 5759394,
            "title": "Schumer, Jeffries review White House proposal to end DHS shutdown",
            "description": "<p>Senate Democratic Leader Chuck Schumer (N.Y.) and House Democratic Leader Hakeem Jeffries (N.Y.) announced Friday that they are reviewing a counteroffer from the White House on how to end the shutdown of the Department of Homeland Security (DHS), which is about to stretch into its third week.</p>\n<p>“We have received the White House’s counteroffer and are reviewing it closely. Democrats remain committed to keep fighting for real reforms to rein in ICE and stop the violence,” spokespeople for Schumer and Jeffries said in a joint statement.</p>\n<p>Democrats submitted their last offer to the White House on Monday, Feb. 16, and had not heard anything from White House negotiators since then.</p>\n<p>“We sent them a proposal a week ago Monday, still haven’t heard back. Crickets,” Schumer told reporters during a press conference Wednesday.</p>\n<p>“All they have to do is agree to our simple ideas that every police department — just about — in America follows and we’ll get it all done,” Schumer said.</p>\n<p>Republicans had dismissed that offer as little more than a rehash of the demands Democrats had previously laid out.</p>\n<p>Democrats want to require federal immigration enforcement officers to obtain judicial warrants before entering homes to make arrests and to bar officers from wearing face masks.</p>\n<p>They also want to end roving Immigration and Customs Enforcement (ICE) patrols and establish a universal code of conduct for officers to set use-of-force standards. They say they will not approve any additional funding for DHS withint these reforms.</p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/senate/5759394-schumer-jeffries-white-house-dhs-shutdown/",
            "pub_date": "2026-02-28 05:16:21",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5759399,
            "title": "Trump orders federal agencies to 'immediately cease' using Anthropic technology",
            "description": "<p>President Trump on Friday directed federal agencies to “immediately cease” using Anthropic technology amid an <a data-id=\"https://thehill.com/policy/technology/5758006-anthropic-pentagon-ai-talks-stall/\" data-type=\"link\" href=\"https://thehill.com/policy/technology/5758006-anthropic-pentagon-ai-talks-stall/\">escalating feud</a> between the AI company and the Pentagon.</p>\n<p>“THE UNITED STATES OF AMERICA WILL NEVER ALLOW A RADICAL LEFT, WOKE COMPANY TO DICTATE HOW OUR GREAT MILITARY FIGHTS AND WINS WARS! That decision belongs to YOUR COMMANDER-IN-CHIEF, and the tremendous leaders I appoint to run our Military,” Trump wrote <a data-id=\"https://truthsocial.com/@realDonaldTrump/posts/116144552969293195\" data-type=\"link\" href=\"https://truthsocial.com/@realDonaldTrump/posts/116144552969293195\">in a post</a> on Truth Social.</p>\n<p>“The Leftwing nut jobs at Anthropic have made a DISASTROUS MISTAKE trying to STRONG-ARM the Department of War, and force them to obey their Terms of Service instead of our Constitution,” he continued. “Their selfishness is putting AMERICAN LIVES at risk, our Troops in danger, and our National Security in JEOPARDY.”</p>\n<p>“We don’t need it, we don’t want it, and will not do business with them again!” he added.  </p>\n<p>Trump’s post comes as the Pentagon and Anthropic have been locked in negotiations over the AI firm’s terms of service, with the Department of Defense (DOD) <a data-id=\"https://thehill.com/policy/defense/5758772-pentagon-emil-michael-anthropic-dario-amodei-criticism/\" data-type=\"link\" href=\"https://thehill.com/policy/defense/5758772-pentagon-emil-michael-anthropic-dario-amodei-criticism/\">threatening to cancel</a> its contract with the company if it does not agree to its terms by Friday afternoon.</p>\n<p>The president said there would be a six-month phase-out period for agencies using the company’s products.  </p>\n<p>He warned Anthropic to “get their act together, and be helpful during this phase out period,” threatening to “use the Full Power of the Presidency to make them comply, with major civil and criminal consequences to follow.” </p>\n<p>“WE will decide the fate of our Country — NOT some out-of-control, Radical Left AI company run by people who have no idea what the real World is all about,” the president said in the post.  </p>\n<p>The Hill has reached out to Anthropic for comment. The Pentagon told The Hill it had nothing further to provide. </p>\n<p>Trump’s announcement came as the DOD delivered its last and final offer to Anthropic Wednesday night, requesting that the company allow the department to access its AI model, Claude, for “all lawful purposes.”  </p>\n<p>Anthropic <a href=\"https://thehill.com/policy/technology/5758006-anthropic-pentagon-ai-talks-stall/\" rel=\"noreferrer noopener\" target=\"_blank\">s</a>aid Thursday that <a href=\"https://thehill.com/policy/technology/5758006-anthropic-pentagon-ai-talks-stall/\" rel=\"noreferrer noopener\" target=\"_blank\">“virtually no progress”</a> had been made in discussions with the Pentagon over the terms of use of the model. The company’s CEO Dario Amodei noted in a separate statement that they could not “in good conscience accede” to the DOD’s terms.   </p>\n<p>“New language framed as compromise was paired with legalese that would allow those safeguards to be disregarded at will,” an Anthropic spokesperson told The Hill on Thursday. “Despite DOW’s recent public statements, these narrow safeguards have been the crux of our negotiations for months.” </p>\n<p>Anthropic is one of several companies that inked a $200 million contract with the Pentagon last summer, a deal that is now in jeopardy as the company’s usage policy prevents Claude from being utilized for fully autonomous lethal weapons or mass domestic surveillance of Americans. Those are the two red lines at the crux of the spat with the Pentagon.  </p>\n<p><em>Updated at 4:15 p.m. EST</em></p>",
            "kind": 1,
            "link": "https://thehill.com/policy/technology/5759399-trump-bans-anthropic-tech/",
            "pub_date": "2026-02-28 05:16:20",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5759402,
            "title": "Hegseth cancels troop attendance at top-ranked schools",
            "description": "<p>Defense Secretary Pete Hegseth ordered the cancellation of members of the military attending some of the country’s top-ranked colleges and universities on Friday, beginning academic year 2026-2027, arguing the schools are teaching the “enemy’s wicked ideologies” to service members. </p>\n<p>Hegseth, who attended Harvard University for postgraduate studies, said the move would affect institutions like Princeton University, Columbia University, MIT, Brown University, Yale University and “others.” </p>\n<p>“We demand that senior service colleges work to sharpen our war fighters on genuine national security issues, not social justice activism. We demand curriculums grounded in the founding principles of this republic, principles that champion the enduring ideals of peace through strength and putting American interests first,” Hegseth said in a video posted on social platform X. </p>\n<p>“We demand universities that invest back into our nation’s prosperity rather than our greatest adversaries,” the Pentagon chief <a href=\"https://x.com/SecWar/status/2027474502876070386?s=20\" rel=\"noreferrer noopener\" target=\"_blank\">said</a> in the 4-minute clip. “It’s common sense.” </p>\n<p>Earlier this month, Hegseth <a href=\"https://thehill.com/policy/defense/5742833-hegseth-targets-universities-culture-war/\" rel=\"noreferrer noopener\" target=\"_blank\">announced</a> that the Pentagon would cut all academic ties with Harvard starting in the 2026/2027 school year, contending the country’s oldest university is “one of the red-hot centers of hate-America activism.”</p>\n<p>The move marks another chapter in Hegseth’s culture war against academia since taking the helm at the Pentagon. </p>\n<p>On Friday, Hegseth said he would direct a formal “top to bottom” review of the U.S. war colleges to ensure they are “once again bastions of strategic thought, wholly dedicated to the singular mission of developing the most lethal and effective leaders and war fighters the world has ever known.” </p>\n<p>War colleges provide professional military education to high-ranking officers, Pentagon civilians and international partners, with a focus ranging from joint operations to national security and strategy. </p>\n<p>“We’re going to hold ourselves accountable as well,” Hegseth said in the video. </p>\n<p>“As a final message to our warriors, the Ivy League faculty lounges may loathe you, the so-called elite of academia may mock your patriotism and disdain your sacrifice, but never forget that we the War Department have your back.”</p>",
            "kind": 1,
            "link": "https://thehill.com/policy/defense/5759402-pentagon-cancels-attendance-ivy-league/",
            "pub_date": "2026-02-28 05:16:20",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5759312,
            "title": "European health agency recommends approving Moderna's combined flu, COVID vaccine",
            "description": "<p>The European Medicines Agency (EMA) announced Friday it has recommended Moderna’s combined mRNA COVID-19 and flu vaccine be granted market authorization in the European Union, marking the first time the combined respiratory viral vaccine will be approved.</p>\n<p>“EMA has recommended granting a marketing authorisation in the European Union (EU) for mCombriax, a messenger RNA vaccine for protecting people aged 50 years and older against COVID-19 and seasonal influenza (flu),” the EMA said in a <a href=\"https://www.ema.europa.eu/en/news/first-combined-covid-19-influenza-vaccine-people-50-years-older\">statement</a>.</p>\n<p>Moderna began developing its combined COVID and flu vaccine, called mCombriax, in 2021, <a href=\"https://thehill.com/policy/healthcare/4713642-moderna-sees-positive-results-in-covid-flu-vaccine-trial/\">reporting positive results</a> from Phase 3 trials in 2024. Full authorization will also make this the first mRNA flu shot approved globally.</p>\n<p>“The [EMA’s Committee for Medicinal Products for Human Use] positive opinion represents an important milestone for respiratory virus vaccination and for Moderna, with the introduction of the world’s first flu plus COVID combination vaccine. If approved, this would be Moderna’s fourth marketed product in Europe,” Modern CEO Stéphane Bancel said in a press release.</p>\n<p>“Combination vaccines have the potential to simplify vaccination and support improved health outcomes. We appreciate the EMA’s rigorous scientific review.”</p>\n<p>In the U.S., progress toward approval stalled last year when Moderna announced it had voluntarily pulled its submission for the combined COVID and flu vaccine. The company recently faced a hurdle regarding its mRNA flu vaccine candidate when the Food and Drug Administration refused to review its application, before the agency <a href=\"https://thehill.com/policy/healthcare/5743393-fda-moderna-flu-vaccine-review/\">reversed this decision</a> a week later.</p>\n<p>The EMA’s recommendation does not mean the vaccine will hit the European market just yet. As the agency noted, the recommendation must now go to the European Commission for the adoption of a decision on an EU‑wide marketing authorization.</p>",
            "kind": 1,
            "link": "https://thehill.com/policy/healthcare/5759312-ema-recommends-moderna-covid-flu/",
            "pub_date": "2026-02-28 04:42:02",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5759319,
            "title": "Megan Rapinoe: I would have never allowed Kash Patel in locker room",
            "description": "<p>U.S. Women’s National Team’s former captain Megan Rapinoe spoke out against President Trump’s recent comments on the Olympic U.S. women’s hockey team. </p>\n<p>The president made the remarks after the men’s hockey team’s recent win in the gold medal Olympic game against Canada. FBI Director Kash Patel joined the athletes in the locker room after the victory and put Trump on speakerphone, who invited the men to the White House and joked that, “We’re going to have to bring the women’s team” or else he would “be impeached.”</p>\n<p>During an episode this week of her podcast with former professional basketball player Sue Bird, “A Touch More with Sue &amp; Megan,” Rapino questioned Patel’s and Trump’s interactions with the team. </p>\n<p>“I would have never, as a captain or a leader on my team … I think that would have been clear to our staffs, and to the larger organization and support staff, those people would never be allowed in our locker rooms,” Rapino said. </p>\n<p>Bird responded to the reactions from the male athletes, who joined in on laughing at the president’s comment. She noted that one player could be heard saying “two for two,” in apparent reference to the fact that both teams won gold. </p>\n<p>“Even if you are a Trump supporter, you voted for him, you’re excited in that moment … he just bashed your friends, he just dismissed the achievement of these women that you’ve been supporting,” Bird said. </p>\n<p>Trump’s comments drew pushback from across the country and from the athletes on the women’s team, who had won gold in days prior. </p>\n<p>The team’s captain, Hilary Knight, <a href=\"https://thehill.com/homenews/administration/5756125-us-womens-hockey-captain-hilary-knight-trump-state-of-the-union-joke/\">called</a> the president’s joke “distasteful and unfortunate.”</p>\n<p>Trump honored the men’s team during his State of the Union address, <a href=\"https://thehill.com/homenews/administration/5754008-trump-awards-state-union/\">awarding</a> goaltender Connor Hellebuyck with the Presidential Medal of Freedom. The women’s team was <a href=\"https://thehill.com/homenews/administration/5756125-us-womens-hockey-captain-hilary-knight-trump-state-of-the-union-joke/\">unable to participate</a> in the address due to scheduling conflicts, a USA Hockey spokesperson said.  </p>\n<p>The president said the women’s team would be visiting the White House “soon” during his speech before Congress on Tuesday. A visit has not yet been announced. </p>",
            "kind": 1,
            "link": "https://thehill.com/blogs/in-the-know/5759319-megan-rapinoe-trump-womens-hockey-olympics/",
            "pub_date": "2026-02-28 04:31:37",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5759214,
            "title": "Iran: US must drop 'excessive demands' in nuclear talks",
            "description": "<p>Iranian Foreign Minister Abbas Araghchi on Friday said the U.S. needs to drop its “excessive demands” while the two countries hold talks regarding Iran’s nuclear program, as President Trump <a href=\"https://thehill.com/homenews/administration/5759142-trump-iran-strike-decision/\">considers military action</a> if a deal is not reached.</p>\n<p>Araghchi made the remark during a phone conversation with his Egyptian counterpart Badr Abdel Ati, the <a href=\"https://www.isna.ir/news/1404120804587/%DA%AF%D9%81%D8%AA-%D9%88%DA%AF%D9%88%DB%8C-%D9%88%D8%B2%DB%8C%D8%B1%D8%A7%D9%86-%D8%AE%D8%A7%D8%B1%D8%AC%D9%87-%D8%A7%DB%8C%D8%B1%D8%A7%D9%86-%D9%88-%D9%85%D8%B5%D8%B1-%D8%AF%D8%B1%D8%A8%D8%A7%D8%B1%D9%87-%D9%85%D8%B3%D8%A7%D8%A6%D9%84-%D9%85%D9%86%D8%B7%D9%82%D9%87-%D9%88-%D9%85%D8%B0%D8%A7%DA%A9%D8%B1%D8%A7%D8%AA\">ISNA</a> news agency reported. He said the path toward a deal “requires seriousness and realism on the part of the other side and avoidance of any miscalculation and excessive demands.”</p>\n<p>Iran’s top diplomat did not elaborate on what those “demands” were.</p>\n<p>“[Talks on Thursday] concluded with the mutual understanding that we will continue to engage in a more detailed manner on matters that are essential to any deal –– including sanctions termination and nuclear-related steps,” the diplomat added.</p>\n<p>Araghchi noted that more negotiations will be held parallel to meetings between technical teams in Vienna, Austria, in the coming days.</p>\n<p>Omani Foreign Minister Badr al-Busaidi on Thursday said talks between the U.S. and Iran showed “<a href=\"https://thehill.com/policy/international/5757110-us-iran-talks-oman-complete/\">significant progress</a>.” </p>\n<p>The negotiations follow rising tensions between the two countries, with Trump on Tuesday accusing Iran of rebuilding its nuclear program despite the U.S. having “obliterated,” in Trump’s words, the program after U.S. strikes in June.</p>\n<p>The president withdrew from the 2015 nuclear deal with Iran during his first term. Iran hawks in the U.S. claimed the nuclear deal stripped restrictions on the program, allowing for uranium enrichment. Iran has defended its nuclear program and argued that it is for peaceful purposes.</p>\n<p>Trump threatened military action against Iran last month after thousands of anti-government protesters were killed. He’s called for a change in Iran’s leadership and said he is considering a “limited strike.” Last week, Trump gave the Iranians a 10-day timeline to come back to the negotiating table with a deal, otherwise there will be an “unfortunate outcome.”</p>\n<p>That timeline is set to end on Sunday.</p>\n<p>The president has also amassed a naval presence off Iran’s coast as the Middle Eastern country carries out military drill exercises, including some with Russian troops. Iran’s Ayatollah Ali Khamenei has warned that U.S. warships will sink if the strikes hit his country. </p>\n<p>Trump and Vice President Vance have both said they prefer to see a diplomatic solution. Vance told <a href=\"https://www.washingtonpost.com/politics/2026/02/26/vance-no-chance-us-will-be-drawn-out-war-middle-east/\">The Washington Post</a> in an interview on Thursday that there’s “<a href=\"https://thehill.com/homenews/administration/5758310-vance-defends-iran-strikes/\">no chance</a>” that any U.S. action on Iran would lead to a longer conflict akin to the U.S. wars in Afghanistan and Iraq. </p>\n<p>“I do think we have to avoid repeating the mistakes of the past,” Vance said. “I also think that we have to avoid overlearning the lessons of the past. Just because one president screwed up a military conflict doesn’t mean we can never engage in military conflict again. We’ve got to be careful about it, but I think the president is being careful.”</p>",
            "kind": 1,
            "link": "https://thehill.com/policy/international/5759214-iran-us-nuclear-talks/",
            "pub_date": "2026-02-28 04:20:59",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5758451,
            "title": "Watch live: Trump delivers remarks on energy policy in Texas ahead of primaries",
            "description": "<p>President Trump will give remarks on energy and the economy from Texas on Friday afternoon, just days before voters in the <a data-id=\"https://thehill.com/homenews/campaign/5757641-trump-texas-senate-gop-primary/\" data-type=\"link\" href=\"https://thehill.com/homenews/campaign/5757641-trump-texas-senate-gop-primary/\">Lone Star State</a> hit the polls in one of the nation’s first 2026 midterm primary elections.</p>\n<p>While Trump is visiting the state in an official capacity, observers are eagerly waiting to see if he <a data-id=\"https://thehill.com/homenews/campaign/5717394-trump-texas-republican-senate-endorsement/\" data-type=\"link\" href=\"https://thehill.com/homenews/campaign/5717394-trump-texas-republican-senate-endorsement/\">issues an endorsement</a> in the <a data-id=\"https://thehill.com/homenews/campaign/5755015-texas-senate-primary-spending/\" data-type=\"link\" href=\"https://thehill.com/homenews/campaign/5755015-texas-senate-primary-spending/\">highly contested</a> Texas Senate race. Incumbent GOP Sen. John Cornyn (Texas) is hoping to hold out against challengers Attorney General Ken Paxton (R) and Rep. Wesley Hunt (R-Texas.) — and Democratic candidates Rep. Jasmine Crockett and state Rep. James Talarico are feeling <a data-id=\"https://thehill.com/homenews/campaign/5752512-cornyn-warns-texas-crack-red-wall/\" data-type=\"link\" href=\"https://thehill.com/homenews/campaign/5752512-cornyn-warns-texas-crack-red-wall/\">increasingly optimistic</a> about flipping the seat.</p>\n<p>The president will also receive an energy briefing ahead of his speech.</p>\n<p>The event in Corpus Christi, Texas, is scheduled to begin at 4:35 p.m. EST.</p>\n<p>Watch the live video above.</p>",
            "kind": 1,
            "link": "https://thehill.com/video-clips/5758451-watch-live-donald-trump-texas-energy-economy/",
            "pub_date": "2026-02-28 04:11:46",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5757739,
            "title": "Live updates: Bill Clinton says he had 'no idea' of Epstein's crimes; Trump talks Cuba, Iran as he heads to Texas",
            "description": "<p>Former President Clinton is sitting for <a href=\"https://thehill.com/homenews/house/5758483-bill-clinton-closed-door-testimony-epstein-files-house-oversight/\" rel=\"noreferrer noopener\" target=\"_blank\">a deposition in New York</a> before the House Oversight and Government Reform Committee in its probe of convicted sex offender Jeffrey Epstein.</p>\n<p>Ahead of his closed-door testimony, he released an opening statement <a href=\"https://x.com/BillClinton/status/2027424128559452573\" rel=\"noreferrer noopener\" target=\"_blank\">on social media</a>, saying he had “no idea of the crimes Epstein was committing” and “saw nothing that ever gave” him pause.</p>\n<p>Trump is on his way to Corpus Christi, Texas, on Friday afternoon on a visit related to energy policy. His <a href=\"https://thehill.com/homenews/campaign/5757641-trump-texas-senate-gop-primary/\" rel=\"noreferrer noopener\" target=\"_blank\">presence looms large</a> in the Lone Star State, where he has yet to make a coveted endorsement in a three-way GOP Senate primary. But he’s invited state Attorney General Ken Paxton, Sen. John Cornyn and Rep. Wesley Hunt to <a href=\"https://thehill.com/homenews/campaign/5758707-cornyn-paxton-hunt-texas-senate-trump-event/\" rel=\"noreferrer noopener\" target=\"_blank\">attend the event</a>. Senate Majority Leader John Thune (R-S.D.) <a href=\"https://thehill.com/homenews/state-watch/5758488-john-thune-texas-senate-race-democrats/\" rel=\"noreferrer noopener\" target=\"_blank\">warned Republicans could lose</a> the seat.</p>\n<p>In a gaggle as he left the White House, Trump <a href=\"https://thehill.com/policy/international/5759118-cuba-friendly-takeover-trump/\" rel=\"noreferrer noopener\" target=\"_blank\">suggested</a> the U.S. could carry out a “friendly takeover” of Cuba and said he has not made a final decision on whether he will strike Iran, but he said <a href=\"https://thehill.com/homenews/administration/5759142-trump-iran-strike-decision/\" rel=\"noreferrer noopener\" target=\"_blank\">he was not happy</a> with the way Tehran was negotiating in talks with the U.S. over its nuclear program</p>\n<p>On Capitol Hill, some Republican lawmakers are <a href=\"https://hp.taboola.com/nexstar-thehill/log/3/click?pi=%2F&amp;ri=cf39b845b4e35fac3b6d11132c7b9b68&amp;sd=v2_01a7b8b0b87561cde9e1d6fa8c276a24_df8dfe4a-8af5-4527-a8e1-3a5b80c24788-tuctd57353a_1772198469_1772199425_CIi3jgYQw91eGM_qyPrJMyAGKAMw4QE4kaQOQMqRD0i0xdsDULcEWABgoB9ojNnH0eiTntKsAXABgAEAiAEA&amp;ui=df8dfe4a-8af5-4527-a8e1-3a5b80c24788-tuctd57353a&amp;ii=~~V1~~1797347118963188270~~Xl6k7qiKAMNJTl5yNAx9CA&amp;it=text&amp;pt=home&amp;li=rbox-h2v&amp;sig=920eec12c94137fdc13a4568e7a1fc8ebef07bef38e0&amp;st=f&amp;vi=1772199490895&lt;i=trecs&amp;r=457&amp;ppb=CMEE&amp;cpb=EhIyMDI2MDIyNi05LVJFTEVBU0UYwdXb0wYgACoZdXMudGFib29sYXN5bmRpY2F0aW9uLmNvbTIIdHJjMTAxMTU4gPCSmAZAkaQOSMqRD1C0xdsDWLcEYwjXFhDVHxgjZGMImbIBELXjARgkZGMI3AoQoBAYFmRjCJ5BEJZYGDZkYwj5__________8BEPn__________wEYB2RjCNIDEOAGGAhkYwiWFBCcHBgYZGMI96wBEIzcARgJZGMIqIUBEO6oARg6ZGMIrKQBENvPARgMZGMI4f__________ARDh__________8BGB9kYwjR__________8BENH__________wEYL2R4AYABAogB1bjsR5ABHJgB4ujE-skz2wEQAdwB&amp;cv=20260226-9-RELEASE&amp;route=US%3AUS%3AV&amp;pc=1&amp;url=https%3A%2F%2Fthehill.com%2Fhomenews%2Fhouse%2F5758046-republicans-stock-trading-ban-trump-state-of-the-union%2F%3Ftbref%3Dhp\" rel=\"noreferrer noopener\" target=\"_blank\">growing increasingly frustrated</a> with House GOP leadership over not moving quickly enough on a stock trading ban after Trump endorsed the push at Tuesday’s State of the Union.<strong> </strong></p>\n<p>Follow live below.</p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/administration/5757739-live-updates-trump-texas-bill-clinton-epstein/",
            "pub_date": "2026-02-28 04:01:30",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5759183,
            "title": "Trump says he's 'not happy' to see Bill Clinton deposed over Epstein files",
            "description": "<p>President Trump told reporters on Friday that he was “not happy” to see former President Bill Clinton deposed as the former president was testifying behind closed doors to the House Oversight Committee as apart of the panel’s investigation into files linked to the late sex offender Jeffrey Epstein.</p>\n<p>“I don’t like seeing him deposed, but they certainly went after me a lot more than that,” Trump told reporters before departing the White House for a trip to Texas.</p>\n<p>“Look, I like him, and I don’t like seeing him deposed,” he added.</p>\n<p>Trump’s comments come after Clinton told lawmakers on the House Oversight Committee during a deposition near his home in Chappaqua, N.Y. that he “did nothing wrong” and had “no idea of the crimes” Epstein was committing.</p>\n<p>“Though my brief acquaintance with Epstein ended years before his crimes came to light, and though I never witnessed during our interactions any indication of what was truly going on, I am here to offer what little I know so that it might prevent anything like this from ever happening again,” Clinton said in a prepared opening statement posted on social media.</p>\n<p>The former president went on to say that he “no idea of the crimes Epstein was committing” and “saw nothing that ever gave me pause.”</p>\n<p>“I saw nothing, and I did nothing wrong,” Clinton said.</p>\n<p>Clinton had a documented friendship with Epstein in the 1990s through about 2003. Epstein visited the White House during the Clinton administration, the former president flew on Epstein’s plane multiple times and photos have emerged of the two of them. Clinton has said he never visited Epstein’s island.</p>\n<p>Trump has struck a conciliatory tone toward Clinton in relation to the Epstein files, saying in an interview earlier this month that it “bothers” him that someone is going after the former president.</p>\n<p>His deposition comes a day after former first lady Hillary Clinton, who ran against Trump for the presidency in 2016, testified before the committee in which she deferred a bulk of her questions to her husband, the former president.</p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/5759183-trump-says-hes-not-happy-to-see-bill-clinton-deposed-over-epstein-files/",
            "pub_date": "2026-02-28 03:41:29",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5759228,
            "title": "O'Reilly calls on DOJ to 'make an example' of De Niro",
            "description": "<p>Conservative pundit Bill O’Reilly called on the Department of Justice to “make an example” of actor Robert De Niro by investigating and possibly jailing him for his recent commentary against President Trump.</p>\n<p>In an <a href=\"https://thehill.com/blogs/in-the-know/5752360-de-niro-trump-never-leaving/\">interview with Nicole Wallace</a>, the host of MS NOW’s “The Best People” podcast, released Monday, De Niro, an Oscar-winning actor know for starring in “The Godfather Part II,” said that Trump “will never leave” office and it’s up to Americans to “get rid of him.” </p>\n<p>“We have to make him leave,” the actor told Wallace.</p>\n<p>O’Reilly responded to De Niro’s remarks on Thursday, saying he couldn’t help but interpret De Niro’s repetition of “we got to get rid of him” during the interview as a threat against Trump’s life. </p>\n<p>“What do you mean by that? He’s elected. Seventy-seven million people voted for him. What’s ‘we got to get rid of him’? Are you talking about impeachment? What are you talking about?” O’Reilly <a href=\"https://www.mediaite.com/media/news/bill-oreilly-calls-for-trump-doj-to-interrogate-and-possibly-jail-robert-de-niro-for-5-years-make-an-example-of-him/\">said</a> after showing a clip from the interview on his show “No Spin News.”</p>\n<p>During his show, O’Reilly cited a piece of legislation that makes any “knowingly and willfully” made threat against the president or vice president a federal crime. He emphasized the two failed attempts to take Trump’s life as further evidence to the potential gravity of De Niro’s comments. </p>\n<p>“I’d make an example of this guy, De Niro,” O’Reilly said. “And I wouldn’t do it for vindictive or politics. I wouldn’t do that. But enough’s enough on the threats.” </p>\n<p>“He better have a lawyer,” O’Reilly added. He also said he hopes the Secret Service will pull the actor in for an interrogation.</p>\n<p>De Niro has been a loud voice and fierce advocate against Trump, viewing some of the president’s actions as serious threats to democracy. In his interview with Wallace, he <a href=\"https://thehill.com/blogs/in-the-know/5752360-de-niro-trump-never-leaving/\">suggested</a> potentially organizing at polling locations to monitor the midterm elections and encouraged more people to show up to “No Kings” demonstrations. </p>\n<p>De Niro was also the main headliner for a rebuttal event to Trump’s Tuesday evening State of the Union address, organized by Courier Newsroom and other progressive groups.<br/><br/>“I feel betrayed by my country,” De Niro said at the event. “It doesn’t have to be perfect but it does need to return to the values that gave us our strength and humanity.”</p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/5759228-de-niro-trump-oreilly-response/",
            "pub_date": "2026-02-28 03:41:29",
            "source": "thehill",
            "language": "en"
        }
    ]
}