{
    "data": [
        {
            "id": 5760058,
            "title": "US, Israel begin strikes on Iran; Trump urges regime change",
            "description": "<p>The United States and Israel on Saturday launched strikes on Iran after weeks of threats from President Trump, who has demanded Tehran scrap its nuclear program or face a new round of attacks.</p>\n<p>“A short time ago, the United States military began major combat operations in Iran,” Trump said in a video <a href=\"https://truthsocial.com/@realDonaldTrump/116147082884192486\">posted to Truth Social</a> at 2:30 a.m. “Our objective is to defend the American people by eliminating imminent threats from the Iranian regime, a vicious group of very hard, terrible people.”</p>\n<p>The president urged members of Iran’s military to lay down their arms and called on Iranians to topple the hardline regime that has controlled the country since the Islamic Revolution in 1979. </p>\n<p>“Bombs will be dropping everywhere. When we are finished, take over your government. It will be yours to take; this will be probably your only chance for generations,” Trump said. “America is backing you with overwhelming strength and devastating force. Now is the time to seize control of your destiny.” </p>\n<p>American embassies in Israel and Qatar issued shelter-in-place orders for U.S. citizens in those countries. </p>\n<p>Israel launched “preemptive” attacks against Iran and declared a state of emergency throughout the country, Israeli Defense Minister Israel Katz said on Saturday. </p>\n<p>“As a result, missile and drone launches against the State of Israel and its civilian population are expected in the very near term,” Katz <a href=\"https://x.com/israelarabic/status/2027630436671705469?s=46\">said in a statement</a>. </p>\n<p>The targets of the strikes were not immediately clear, however, The New York Times reported that Tehran residents witnessed smoke rising from the area where major government buildings, including the presidential palace and National Security Council, are located. </p>\n<p>The U.S. Central Command declined to comment. The Hill has reached out to the Pentagon. </p>\n<p>The attacks come just over a day after talks in Geneva wrapped up between U.S. and Iranian negotiators, mediated by Oman. </p>\n<p>Trump said on Friday that he was not happy about how the negotiations went, though he told reporters he remained undecided on strikes. </p>\n<p>Oman’s foreign minister told CBS’s “Face the Nation” on Friday that Iran has agreed to “zero stockpiling” of nuclear material in the talks, which he described as a breakthrough. </p>\n<p>For weeks, Trump has been publicly weighing military action. Joint Chiefs Chair Gen. Dan Caine <a href=\"https://thehill.com/homenews/administration/5751562-general-caine-iran-military-action/\">has reportedly warned of the risks</a> of strikes, while hawks including Sen. Lindsey Graham (R-S.C.) have pushed for military action with the goal of regime change. </p>\n<p>Reports emerged earlier this week that Trump was <a href=\"https://thehill.com/homenews/administration/5747382-trump-limited-strike-iran/?tbref=hp\">leaning toward limited strikes</a>, at least at first, in the hope of extracting concessions from Iran. </p>\n<p>The U.S. military has built up an enormous presence near Iran in recent weeks, dispatching F-35s, F-22s, refueling aircraft, positioning air defense systems and positioning two aircraft strikes groups in the region. </p>\n<p>Trump in the video posted Saturday morning reiterated his claims that Iran was seeking to rebuild its nuclear program and develop missiles that could reach America. </p>\n<p>“This regime will soon learn that no one should challenge the strength and might of the United States armed forces,” he said. </p>\n<p>“My administration has taken every possible step to minimize the risk to US personnel in the region,” he added. “Even so, and I do not make this statement lightly, the Iranian regime seeks to kill. The lives of courageous American heroes may be lost and we may have casualties, that often happens in war, but we’re doing this, not for now, we’re doing this for the future and it is a noble mission.”</p>\n<p><em>Updated: 2:56 a.m. EST</em></p>",
            "kind": 1,
            "link": "https://thehill.com/policy/defense/5760058-us-israel-launch-strikes-on-iran/",
            "pub_date": "2026-02-28 16:16:10",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5759982,
            "title": "Biden knocks Trump's State of the Union speech: 'Is he still talking?'",
            "description": "<p>Former President Biden on Friday knocked President Trump for his <a href=\"https://thehill.com/homenews/administration/5754101-trump-state-union-address-takeaways/\">record-length</a> State of the Union address, asking if his successor is “still talking.”</p>\n<p>Biden gave a critique about Trump and his record while celebrating six years since the former president won the 2020 South Carolina Democratic primary at a party held by the South Carolina Democratic Party. It is believed that Biden’s South Carolina victory was instrumental in putting him on the path to the 2020 nomination.</p>\n<p>“By the way did you see Trump give the State of Union?” Biden asked, which was met with boos. “Is he still talking? I don’t know. But folks, it’s unbelievable. The guy talks for almost two hours, but never mentions the anniversary of [Russian President Vladimir] Putin invading Ukraine. Never once.”</p>\n<p>Biden claimed that when he left office “border crossings in the United States were lower than the day that I entered an office inherited from Trump.”</p>\n<p>“On the day I left office, I handed Trump the strongest economy in the world. In the world, that’s not hyperbole,” the former president added. “That’s a fact.”</p>\n<p>Biden also said the U.S. is in the midst of “dark days,” facing threats that are “amplified in the ways we have never seen before.”</p>\n<p>“Our children are watching and I’m worried about what they are hearing so we have to be unapologetic for fighting for our country,” he said. </p>\n<p>Trump praised his administration’s accomplishments during his address on Tuesday. He took credit for a stronger economy than what he inherited from Biden and applauded his deportation agenda amid major Democratic pushback.</p>\n<p>Over one year into Trump’s second term, a <a href=\"https://thehill.com/homenews/administration/5721162-biden-trump-effectiveness-survey/\">slim majority</a> of Americans believe Biden handled the presidency better. Harvard University and The Harris Poll found last month that 51 percent of Americans think Trump is doing a worse job than Biden compared to 49 percent who said Trump is better than his predecessor.</p>\n<p>Both presidents were underwater in the eyes of respondents. Trump was seen unfavorably by 8 percent more respondents than those who viewed him favorably. The gap for Biden was 10 percent.</p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/administration/5759982-biden-criticizes-trump-sotu/",
            "pub_date": "2026-02-28 12:16:41",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5759963,
            "title": "US designates Iran as 'state sponsor of wrongful detention'",
            "description": "<p>The U.S. on Friday designated Iran as a “state sponsor of wrongful detention” and demanded that the country release any Americans in its detention. </p>\n<p>Secretary of State Marco Rubio issued the designation <a href=\"https://thehill.com/homenews/administration/5759142-trump-iran-strike-decision/\">amid escalating tensions</a> between the two countries and as President Trump considers launching strikes on Iran. Rubio cited Iran’s consolidation of power following the Iranian Revolution “by endorsing the hostage taking of U.S. embassy staff,” referring to the Iran Hostage Crisis.</p>\n<p>“For decades, Iran has continued to cruelly detain innocent Americans, as well as citizens of other nations, to use as political leverage against other states,” Rubio said in a <a href=\"https://www.state.gov/releases/office-of-the-spokesperson/2026/02/iran-designated-as-a-state-sponsor-of-wrongful-detention/\">statement</a>. “This abhorrent practice must end.”</p>\n<p>Rubio warned Iran that if it does not stop taking hostages, the U.S. will “be forced to consider additonal measures, including a potential geographic travel restriction on the use of U.S. passports to, through, or from Iran.” He added that Americans in Iran should “leave immediately” and that Americans should not visit the country “for any reason.”</p>\n<p>The designation does not levy penalties on Iran. The U.S. holds this travel restriction in place for North Korea, only allowing U.S. citizens to travel to North Korea with “special validation” passports issued by the State Department. </p>\n<p>The nonprofit group Hostage Aid Worldwide estimates that at least four Americans are in Iranian custody as of August 2025. Before then, former President Biden <a href=\"https://thehill.com/policy/international/4201036-bidens-new-deal-with-iran-draws-fierce-blowback/\">secured a deal</a> to release five American hostages in exchange for $6 billion in unfrozen funds going toward Tehran in 2023.</p>\n<p>Tensions have risen between the U.S. and Iran following widespread anti-government protests last month. Trump voiced his support for the demonstrators, called for new leadership in Tehran and sent several warships to the country’s coast. He warned that he would take military action if Iranian officials executed protesters, later saying he is considering a limited strike.</p>\n<p>On Friday, United Nations High Commissioner for Human Rights Volker Türk said at least eight people, including two children, were <a href=\"https://thehill.com/policy/international/5759707-iran-protests-death-sentences/\">sentenced to death</a> in connection with the protests, with another 30 also at risk of being sentenced to die. </p>\n<p>Negotiations kicked off earlier this month over the future of Iran’s nuclear program. These talks have produced little to no results, with Trump calling on Iran to strike a deal within a 10-day timeframe expected to end on Sunday. The third round of talks in Geneva, Switzerland, on Thursday failed to reach an agreement.</p>\n<p>“We haven’t made a final decision [on strikes],” Trump told reporters Friday. “We’re not exactly happy with the way they’re negotiating. They cannot have nuclear weapons. We’re not thrilled with the way they’re negotiating, so we’ll see how it all works out.”</p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/administration/5759963-us-designates-iran-hostages/",
            "pub_date": "2026-02-28 11:46:34",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5759842,
            "title": "President Trump touts oil and gas production in Texas visit",
            "description": "<p>CORPUS CHRISTI, Texas (Nexstar) — President Trump <a href=\"https://thehill.com/homenews/administration/5759646-texas-senate-primary-trump/\">touched down</a> on Texas soil <a href=\"https://www.kxan.com/news/texas-politics/a-brief-history-of-donald-trump-and-texas/\" rel=\"noreferrer noopener\" target=\"_blank\">for the second time</a> since returning to the White House.</p>\n<p>Trump visited the Port of Corpus Christi where he delivered remarks to applaud his economic and energy policies. The president reflected on the past year of his second term. He said he took over a country that was “dead” and has unlocked its potential.</p>\n<p>“I ended the Biden export ban, and I told our great Texas energy workers to very simply drill, baby, drill,” Trump said to a crowd of supporters. Trump touted the rise in oil production and gas exports and lower prices at the gas pump. </p>\n<p><a data-id=\"https://gasprices.aaa.com/?state=TX\" data-type=\"link\" href=\"https://gasprices.aaa.com/?state=TX\" rel=\"noreferrer noopener\" target=\"_blank\">According to AAA</a>, the current average price of regular gasoline in Texas is $2.60. <a data-id=\"https://www.eia.gov/dnav/pet/pet_pri_gnd_dcus_stx_a.htm#:~:text=Table_title:%20This%20page%20uses%20JavaScipt%20Table_content:%20header:,%7C%20:%201.807%20%7C%20:%203.463%20%7C\" data-type=\"link\" href=\"https://www.eia.gov/dnav/pet/pet_pri_gnd_dcus_stx_a.htm#:~:text=Table_title:%20This%20page%20uses%20JavaScipt%20Table_content:%20header:,%7C%20:%201.807%20%7C%20:%203.463%20%7C\" rel=\"noreferrer noopener\" target=\"_blank\">The average price of regular gasoline in 2022,</a> the middle of President Joe Biden’s term, was $3.47.</p>\n<p>Todd Staples, the president of the Texas Oil and Gas Association said the president’s visit to Corpus Christi underscores the fact that energy dominance begins in Texas. </p>\n<p>“The Lone Star State has reached a high-water mark in crude oil and natural gas production, benefitting American consumers by dramatically increasing supply and lowering prices at home and exporting the remainder to allies and trading partners,” Staples said in a statement.</p>\n<p>But Ed Hirs, an energy fellow at the University of Houston, said Trump’s policies have increased the cost of doing business. Hirs points to tariffs on steel and aluminum, which raised the cost of building energy infrastructure and drilling wells. He said the oil industry is spending more and getting less in revenue.</p>\n<p>“We’re getting $20 a barrel less than we were before the president took office, and we’re spending $3 to $5 to $10 a barrel more,” Hirs said.</p>\n<p>Hirs said that resulted in layoffs in the oil industry. The Texas Oil and Gas Association reported in January this year that upstream oil and gas employment remained flat in 2025, referencing data from the Texas Workforce Commission. </p>\n<p>“Even as companies adjust to lower prices and shifting market conditions, the Texas oil and natural gas industry employs hundreds of thousands of Texans across the value chain because of the industry’s regional breadth and diverse activities, from LNG exports to pipeline construction,” Staples said in his statement. </p>\n<p>Hirs did say that liquefied natural gas (LNG) exports did fairly well this year. </p>\n<p>“We have been able to help our European allies go without the natural gas from Russia,” Hirs said. </p>\n<p>Energy Secretary Chris Wright traveled to Corpus Christi a day ahead of the president to sign an order that expands the amount of LNG exported from the Cheniere Energy’s Corpus Christi LNG terminal. This will allow Corpus Christi LNG to be the second-largest exporter of LNG in the United States.</p>\n<p>“This creates jobs and wealth in the United States, and it better energizes our allies abroad and lifts everyone up,” Wright told a group of reporters.</p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/nexstar_media_wire/5759842-president-trump-touts-oil-and-gas-production-in-texas-visit/",
            "pub_date": "2026-02-28 11:35:56",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5759942,
            "title": "Warren accuses Trump, Hegseth of trying 'extort' Anthropic into removing AI guardrails",
            "description": "<p>Sen. Elizabeth Warren (D-Mass.) on Friday accused President Trump and Secretary of Defense Pete Hegseth of attempting to “extort” the company <a href=\"https://thehill.com/policy/technology/5759399-trump-bans-anthropic-tech/\">Anthropic</a> into removing guardrails for its AI programs.</p>\n<p>Warren, the ranking member of the Senate Banking, Housing and Urban Affairs Committee, said in a statement that the attempt would remove “common sense guardrails that protect Americans from mass surveillance and fully autonomous weapons, with no human decision-makers, that can kill with impunity.”</p>\n<p>“Congress needs to put in place restrictions to stop this Administration from using bipartisan national security authorities to bully and punish American companies that won’t advance their authoritarian agenda,” she added. </p>\n<p>Warren called on Hegseth to “immediately” testify before members of Congress and explain “this extraordinary abuse of power and address the serious adverse national security consequences of his decision.” </p>\n<p>Anthropic was one of several companies that signed a $200 million contract with the Pentagon last summer. The deal was in jeopardy due to Anthropic’s policy preventing its AI model Claude from being used for fully autonomous lethal weapons or mass domestic surveillance.</p>\n<p>Trump earlier on Friday directed federal agencies to “immediately cease” using Anthropic technology as a feud erupts between the company and the Pentagon. Hegseth said the Defense Department (DOD) was labeling the company a <a href=\"https://thehill.com/policy/defense/5759630-pentagon-designates-anthropic-risk/\">supply chain risk</a> to national security, banning any U.S. military contractor, partner or supplier from working with Anthropic.</p>\n<p>Warren’s fellow Bay State Democrat, Sen. Ed Markey, said the administration’s label “is a reckless and unprecedented attempt to destroy an American AI company.”</p>\n<p>“This is not a routine classification — it is an attempt to cripple an American firm for requesting legitimate safeguards on use of its AI model,” Markey said in a <a href=\"https://www.markey.senate.gov/news/press-releases/markey-demands-immediate-congressional-action-to-reverse-dod-designation-of-anthropic-a-supply-chain-risk\">statement</a>. “That is unacceptable. I’m calling for immediate congressional action to reverse this decision.”</p>\n<p>Anthropic called the label “<a href=\"https://thehill.com/policy/technology/5759929-pentagon-anthropic-supply-chain-risk/\">legally unsound</a>” and said it sets a “dangerous precedent.”</p>\n<p>“Designating Anthropic as a supply chain risk would be an unprecedented action—one historically reserved for US adversaries, never before publicly applied to an American company,” Anthropic said in a statement. “We are deeply saddened by these developments.”</p>\n<p>Earlier Friday, Trump accused Anthropic of being run by “Leftwing nut jobs” who tried to “STRONG-ARM the Department of War, and force them to obey their Terms of Service instead of our Constitution.”</p>\n<p>Anthropic and the Pentagon negotiated the AI company’s terms of service, with the DOD having <a href=\"https://thehill.com/policy/defense/5758772-pentagon-emil-michael-anthropic-dario-amodei-criticism/\">threatened to cancel</a> its contract with the company if it does not agree to its terms by Friday afternoon.</p>\n<p>Trump’s announcement came as the DOD delivered its last and final offer to Anthropic on Wednesday night, requesting that the company allow the department to access Claude for “all lawful purposes.”  </p>\n<p>Anthropic said Thursday that “<a href=\"https://thehill.com/policy/technology/5758006-anthropic-pentagon-ai-talks-stall/\" rel=\"noreferrer noopener\" target=\"_blank\">virtually no progress</a>” had been made over the model’s terms of use. The company’s CEO Dario Amodei noted in a separate statement that they could not “in good conscience” accept the Pentagon’s terms.   </p>\n<p><em>Julia Shapero contributed.</em></p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/senate/5759942-warren-accuses-trump-extortion-anthropic/",
            "pub_date": "2026-02-28 11:10:53",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5759842,
            "title": "President Trump touts oil and gas production in Texas visit",
            "description": "<p>CORPUS CHRISTI, Texas (Nexstar) — President Trump <a href=\"https://thehill.com/homenews/administration/5759646-texas-senate-primary-trump/\">touched down</a> on Texas soil <a href=\"https://www.kxan.com/news/texas-politics/a-brief-history-of-donald-trump-and-texas/\" rel=\"noreferrer noopener\" target=\"_blank\">for the second time</a> since returning to the White House.</p>\n<p>Trump visited the Port of Corpus Christi where he delivered remarks to applaud his economic and energy policies. The president reflected on the past year of his second term. He said he took over a country that was “dead” and has unlocked its potential.</p>\n<p>“I ended the Biden export ban, and I told our great Texas energy workers to very simply drill, baby, drill,” Trump said to a crowd of supporters. Trump touted the rise in oil production and gas exports and lower prices at the gas pump. </p>\n<p><a data-id=\"https://gasprices.aaa.com/?state=TX\" data-type=\"link\" href=\"https://gasprices.aaa.com/?state=TX\" rel=\"noreferrer noopener\" target=\"_blank\">According to AAA</a>, the current average price of regular gasoline in Texas is $2.60. <a data-id=\"https://www.eia.gov/dnav/pet/pet_pri_gnd_dcus_stx_a.htm#:~:text=Table_title:%20This%20page%20uses%20JavaScipt%20Table_content:%20header:,%7C%20:%201.807%20%7C%20:%203.463%20%7C\" data-type=\"link\" href=\"https://www.eia.gov/dnav/pet/pet_pri_gnd_dcus_stx_a.htm#:~:text=Table_title:%20This%20page%20uses%20JavaScipt%20Table_content:%20header:,%7C%20:%201.807%20%7C%20:%203.463%20%7C\" rel=\"noreferrer noopener\" target=\"_blank\">The average price of regular gasoline in 2022,</a> the middle of President Joe Biden’s term, was $3.47.</p>\n<p>Todd Staples, the president of the Texas Oil and Gas Association said the president’s visit to Corpus Christi underscores the fact that energy dominance begins in Texas. </p>\n<p>“The Lone Star State has reached a high-water mark in crude oil and natural gas production, benefitting American consumers by dramatically increasing supply and lowering prices at home and exporting the remainder to allies and trading partners,” Staples said in a statement.</p>\n<p>But Ed Hirs, an energy fellow at the University of Houston, said Trump’s policies have increased the cost of doing business. Hirs points to tariffs on steel and aluminum, which raised the cost of building energy infrastructure and drilling wells. He said the oil industry is spending more and getting less in revenue.</p>\n<p>“We’re getting $20 a barrel less than we were before the president took office, and we’re spending $3 to $5 to $10 a barrel more,” Hirs said.</p>\n<p>Hirs said that resulted in layoffs in the oil industry. The Texas Oil and Gas Association reported in January this year that upstream oil and gas employment remained flat in 2025, referencing data from the Texas Workforce Commission. </p>\n<p>“Even as companies adjust to lower prices and shifting market conditions, the Texas oil and natural gas industry employs hundreds of thousands of Texans across the value chain because of the industry’s regional breadth and diverse activities, from LNG exports to pipeline construction,” Staples said in his statement. </p>\n<p>Hirs did say that liquefied natural gas (LNG) exports did fairly well this year. </p>\n<p>“We have been able to help our European allies go without the natural gas from Russia,” Hirs said. </p>\n<p>Energy Secretary Chris Wright traveled to Corpus Christi a day ahead of the president to sign an order that expands the amount of LNG exported from the Cheniere Energy’s Corpus Christi LNG terminal. This will allow Corpus Christi LNG to be the second-largest exporter of LNG in the United States.</p>\n<p>“This creates jobs and wealth in the United States, and it better energizes our allies abroad and lifts everyone up,” Wright told a group of reporters.</p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/5759842-president-trump-touts-oil-and-gas-production-in-texas-visit/",
            "pub_date": "2026-02-28 11:10:52",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5759929,
            "title": "Anthropic calls supply chain risk designation 'unprecedented,' 'legally unsound'",
            "description": "<p>Anthropic called the Pentagon’s decision Friday to designate the AI company as a <a data-id=\"https://thehill.com/policy/defense/5759630-pentagon-designates-anthropic-risk/\" data-type=\"link\" href=\"https://thehill.com/policy/defense/5759630-pentagon-designates-anthropic-risk/\">supply chain risk</a> an “unprecedented action,” arguing it is “legally unsound” and would “set a dangerous precedent.”</p>\n<p>“Designating Anthropic as a supply chain risk would be an unprecedented action—one historically reserved for US adversaries, never before publicly applied to an American company,” Anthropic said in a statement. “We are deeply saddened by these developments.”</p>\n<p>“We believe this designation would both be legally unsound and set a dangerous precedent for any American company that negotiates with the government,” it added.</p>\n<p>Defense Secretary Pete Hegseth said Friday that the Pentagon was labeling Anthropic as a supply chain risk <a data-id=\"https://thehill.com/policy/technology/5759399-trump-bans-anthropic-tech/\" data-type=\"link\" href=\"https://thehill.com/policy/technology/5759399-trump-bans-anthropic-tech/\">following a dispute</a> over the company’s terms of use for its AI models.</p>\n<p>The Defense Department (DOD) pushed for language that would allow it to use the technology for “all lawful purposes,” while Anthropic argued that there needed to be restrictions on mass domestic surveillance and fully autonomous lethal weapons.</p>\n<p>Hegseth, who made the announcement on the social platform X, said that “no contractor, supplier, or partner that does business with the United States military may conduct any commercial activity with Anthropic” as a result of the designation. </p>\n<p>His announcement came shortly after President Trump said he was directing federal agencies to “immediately cease” using the company’s technology.</p>\n<p>“The Leftwing nut jobs at Anthropic have made a DISASTROUS MISTAKE trying to STRONG-ARM the Department of War, and force them to obey their Terms of Service instead of our Constitution,” the president wrote in a post on Truth Social.</p>\n<p>However, Anthropic noted in its statement late Friday that it had “not yet received direct communication” from the Pentagon or the White House about the status of negotiations.</p>\n<p>“We have tried in good faith to reach an agreement with the Department of War, making clear that we support all lawful uses of AI for national security aside from the two narrow exceptions above,” the company said. “To the best of our knowledge, these exceptions have not affected a single government mission to date.”</p>\n<p>The AI firm added that it plans to challenge any supply chain risk designation in court.</p>\n<p>Despite Hegseth’s comments, it also argued that the Defense secretary “does not have the statutory authority” to bar anyone who does business with the military from doing business with Anthropic.</p>\n<p>Instead, it suggested the law can only extend to the use of its AI models as part of DOD contracts and “cannot affect how contractors use Claude to serve other customers.”</p>\n<p>“No amount of intimidation or punishment from the Department of War will change our position on mass domestic surveillance or fully autonomous weapons,” Anthropic added.</p>",
            "kind": 1,
            "link": "https://thehill.com/policy/technology/5759929-pentagon-anthropic-supply-chain-risk/",
            "pub_date": "2026-02-28 10:46:26",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5759831,
            "title": "Trump told Patel he wasn't pleased with FBI director's Olympic partying: Report",
            "description": "<p>President Trump told FBI Director Kash Patel that he was disappointed by Patel’s behavior while <a href=\"https://thehill.com/homenews/administration/5750666-kash-patel-team-usa-backlash/\">partying</a> with the U.S. men’s hockey team during the Winter Olympics in Milan, Italy, <a href=\"https://www.nbcnews.com/politics/trump-administration/trump-fbi-director-kash-patel-olympics-hijinks-rcna260835\">NBC News</a> reported Friday. </p>\n<p>The team had won the gold medal after defeating Canada 2-1 in overtime. Patel, a hockey fan, was seen yelling, banging on a table and gulping down a bottle of beer during the locker room celebration on Sunday. Video of the incident, <a href=\"https://x.com/WilliamTurton/status/2025716894636929264\">first shared by ProPublica</a>, went viral.</p>\n<p id=\"anchor-7e6762\">Trump, who doesn’t drink alcohol, told Patel that he was not happy with the incident and disliked Patel using a government aircraft to fly to Milan, a person familiar with the matter told NBC News.</p>\n<p id=\"anchor-e43693\">White House spokesperson Abigail Jackson did not address the reported incident in a statement to The Hill, instead crediting Patel with lowering crime rates in the U.S.</p>\n<p>“This is a direct result of the President’s law and order agenda which is being successfully implemented by his law and order team, including FBI Director Kash Patel,” Jackson said. “The President has full confidence in his Administration.”</p>\n<p>The Hill also reached out to the FBI for comment.</p>\n<p id=\"anchor-e21211\">Patel <a href=\"https://thehill.com/homenews/administration/5750297-patel-joins-us-hockey-gold/\">dismissed criticism</a> over his behavior on Sunday in <a href=\"https://x.com/Kash_Patel/status/2025736412125855918\">a post</a> on the social platform X addressed to “the very concerned media.”</p>\n<p>“Yes, I love America and was extremely humbled when my friends, the newly minted Gold Medal winners on Team USA, invited me into the locker room to celebrate this historic moment with the boys- Greatest country on earth and greatest sport on earth,” he wrote. </p>\n<p>The FBI previously pushed back on questions about Patel using a government aircraft to fly to Milan. The agency said Patel went to Italy to meet “with regional partners and security teams,” with these travel plans having been planned months in advance.</p>\n<p>Democrats criticized Patel’s visit, with Xochitl Hinojosa, spokesperson for the Department of Justice under former President Biden, saying his attendance contradicts several other ongoing matters requiring FBI focus.</p>\n<p>“There was a threat at the president’s residence at MAL [Mar-a-Lago], Americans in Mexico are facing major threats by cartel members, Nancy Guthrie is still missing, and our FBI Director thinks he’s a frat bro?!” she <a href=\"https://x.com/XochitlHinojosa/status/2025731516236480756?s=20\" rel=\"noreferrer noopener\" target=\"_blank\">wrote on X</a>.</p>\n<p>But as others called the trip inappropriate, media figures on the right praised Patel. Fox News host Will Cain wrote on X that despite “what the Left is trying to turn this into…every proud American is smiling through every second of this video.”</p>\n<p>Former U.S. Women’s National Team soccer captain Megan Rapinoe questioned why Patel was with the team and why the team members spoke with Trump on the phone about being at his State of the Union address on Tuesday.</p>\n<p>“I would have never, as a captain or a leader on my team … I think that would have been clear to our staffs, and to the larger organization and support staff, those people would never be allowed in our locker rooms,” Rapinoe said on this week’s episode of her podcast with her partner, former professional basketball player Sue Bird, “A Touch More.”</p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/administration/5759831-patel-trump-locker-room-party/",
            "pub_date": "2026-02-28 09:06:36",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5759707,
            "title": "More Iranians face executions over protests: UN rights chief",
            "description": "<p>United Nations High Commissioner for Human Rights Volker Türk on Friday warned that more Iranians face the risk of being executed after <a href=\"https://thehill.com/policy/defense/5693657-iran-protests-trump-red-lines/\" rel=\"noreferrer noopener\" target=\"_blank\">widespread anti-government protests</a> last month.</p>\n<p>“I am horrified by reports that at least eight people, including two children, have been sentenced to death in connection with the protests,” Türk <a href=\"https://www.youtube.com/watch?v=GDOLXQpWIK0\" rel=\"noreferrer noopener\" target=\"_blank\">said in a speech</a> to the U.N. Human Rights Council in Geneva. “Another 30 are reportedly at risk of the same sentence.”</p>\n<p>“I urge independent, impartial and transparent investigations, fair trial guarantees, and an immediate moratorium on the death penalty,” he added. </p>\n<p>President Trump warned Iran against executing citizens amid the protests last month. Türk, in his speech Friday, said there has been a “new wave of protests at universities, making it clear that the underlying grievances remain.” He added that hundreds of people remain missing, calling the overall situation in Iran “volatile.”</p>\n<p>Türk said he was “extremely alarmed” about the possibility of “<a href=\"https://thehill.com/homenews/administration/5759142-trump-iran-strike-decision/\" rel=\"noreferrer noopener\" target=\"_blank\">regional military escalation</a>.” He called on “the voice of reason” to prevail.</p>\n<p>U.S. and Iranian diplomats held talks mediated in Oman on Thursday that yielded “<a href=\"https://thehill.com/policy/international/5757110-us-iran-talks-oman-complete/\" rel=\"noreferrer noopener\" target=\"_blank\">significant progress</a>,” Omani Foreign Minister Badr al-Busaidi described. Negotiations have focused on Iran’s nuclear program, but al-Busaidi said Iran offered to stop <a href=\"https://thehill.com/policy/international/5759623-iran-nuclear-deal-stockpiling/\" rel=\"noreferrer noopener\" target=\"_blank\">stockpiling enriched uranium</a> as part of a deal.</p>\n<p>“Now we are talking about zero stockpiling and that is very, very important because if you cannot stockpile material that is enriched, then there is no way you can actually create a bomb,” al-Busaidi told Margaret Brennan of CBS News’s “Face the Nation.”</p>\n<p>International nuclear inspectors could then inspect Iran’s facilities. Iran currently has a stockpile of between 300 and 400 kilograms of 60 percent-enriched uranium, which experts warn can be converted into a nuclear weapon.</p>\n<p>Iranian Foreign Minister Abbas Araghchi said Thursday’s talks ended with a “mutual understanding that we will continue to engage in a more detailed manner” on various issues central to the negotiations, namely the nuclear program but also “sanctions termination.”</p>\n<p>But Araghchi also said, without elaboration, that the U.S. needs to drop its “<a href=\"https://thehill.com/policy/international/5759214-iran-us-nuclear-talks/\" rel=\"noreferrer noopener\" target=\"_blank\">excessive demands</a>” amid talks.</p>\n<p>The positivity has not translated to the White House, where Trump said he is not happy with the direction of the negotiations and has not made a final decision on if he will strike Iran. Trump has threatened to strike Iran militarily during the protests last month, and last week he gave the country a 10-day timeline, ending Sunday, to come back to the negotiating table with a deal.</p>\n<p>“It would be nice if we could do it without, but sometimes you have to do it with,” Trump told reporters Friday before leaving the White House for an event in Texas. “We have the greatest military anywhere in the world, there’s nothing close. I’d love not to use it, but sometimes you have to.”</p>",
            "kind": 1,
            "link": "https://thehill.com/policy/international/5759707-iran-protests-death-sentences/",
            "pub_date": "2026-02-28 08:46:39",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5759772,
            "title": "RFK Jr. tells Joe Rogan he was not 'particularly happy' with Trump's glyphosate order",
            "description": "<p>Health and Human Services Secretary Robert F. Kennedy Jr. said in an interview that aired Friday that President Trump’s order <a href=\"https://thehill.com/policy/energy-environment/5745981-glyphosate-trump-order-maha-opposition/\" rel=\"noreferrer noopener\" target=\"_blank\">bolstering the controversial herbicide glyphosate</a> was “not something that I was particularly happy with.”</p>\n<p>Kennedy’s remarks to podcaster Joe Rogan departed somewhat from <a href=\"https://www.youtube.com/watch?v=wk7DQom821s\" rel=\"noreferrer noopener\" target=\"_blank\">his previous defense</a> of Trump’s move — though the Health secretary also expressed sympathy for the president’s position.</p>\n<p>“It’s not a good thing to have in your food so … it’s not something that I was particularly happy with. Let me put it that way, mildly,” he said.</p>\n<p>“But I also understand the president’s point of view,” he added. “If you ban glyphosate overnight, or if you got rid of it … it would destroy the American food system.”</p>\n<p>Kennedy <a href=\"https://thehill.com/policy/healthcare/5750676-kennedy-doubles-down-on-defense-of-trump-glyphosate-order-amid-maha-backlash/\" rel=\"noreferrer noopener\" target=\"_blank\">previously defended</a> Trump’s order, which said that pesticide companies should have “immunity” on glyphosate.</p>\n<p>“I support President Trump’s Executive Order to bring agricultural chemical production back to the United States and end our near-total reliance on adversarial nations,” he wrote in a post   Sunday night on social platform X.</p>\n<p>The nation’s top health official and his allies in the “Make America Healthy Again” movement have been <a href=\"https://thehill.com/policy/energy-environment/5685317-maha-pesticides-glyphosate-roundup-bayer-rfk-jr/\" rel=\"noreferrer noopener\" target=\"_blank\">critical of pesticides</a>, especially glyphosate.</p>\n<p>Trump’s order <a href=\"https://thehill.com/policy/healthcare/5753291-trump-mha-glyphosate-controversy/\" rel=\"noreferrer noopener\" target=\"_blank\">ignited a furor</a> among supporters of the group, which has been affiliated with the president.</p>\n<p>Glyphosate has been the key ingredient in Roundup weedkiller. Thousands of lawsuits have alleged that it is linked to cancer. </p>\n<p>Bayer, which owns Roundup-maker Monsanto, says that the chemical is not harmful. The company recently announced a settlement agreement with plaintiffs suing over the glyphosate.</p>",
            "kind": 1,
            "link": "https://thehill.com/policy/energy-environment/5759772-rfk-jr-joe-rogan-trump-glyphosate-order-maha/",
            "pub_date": "2026-02-28 08:06:49",
            "source": "thehill",
            "language": "en"
        }
    ]
}