{
    "data": [
        {
            "id": 5127297,
            "title": "Raskin warns ICE raids could sweep up ‘innocent citizens,’ demands answers",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>Rep. Jamie Raskin (D-Md.) has warned that Immigration and Customs Enforcement (ICE) raids could sweep up “innocent citizens.”</p>\n<p>“If you’re not out looking for criminals based on crimes committed, but undocumented immigrants based on their looks, you’re going to sweep up a lot of innocent people, including innocent citizens,” said the Maryland Democrat, <a href=\"https://www.nbcnews.com/news/latino/rep-jamie-raskin-demands-details-us-citizens-caught-ice-enforcement-rcna190649\">according to a statement</a> obtained by NBC News.</p>\n\n<p>“We’ve already seen cases of racial and ethnic profiling leading to the unlawful detention of U.S. citizens. That’s why I’m demanding answers about some of these profoundly troubling stories we’ve heard about citizens being targeted, detained and questioned,” he added.</p>\n<p>Raskin and Rep. Pramila Jayapal (D-Wash.) also sought <a href=\"https://democrats-judiciary.house.gov/uploadedfiles/2025-02-04_raskin_jayapal_to_noem_dhs_vitello_ice.pdf\">answers</a> from acting ICE Director Caleb Vitello and Department of Homeland Security (DHS) Secretary Kristi Noem on “troubling reports that U.S. citizens have been detained during immigration enforcement operations” in a Tuesday letter, of which NBC News obtained a copy first.</p>\n<p>“A recent NBC News article highlighted multiple incidents in which American citizens were wrongfully detained during immigration enforcement raids,” the two progressive Democrats wrote. “Additionally, Telemundo Puerto Rico recently reported on three U.S. citizens in Milwaukee—a toddler, his mother, and grandmother—who were detained and transported to an immigration detention center. </p>\n<p>ICE has denied the Milwaukee incident, claiming it was “completely false,” according to the <a href=\"https://www.jsonline.com/story/news/local/2025/01/31/ice-denies-detaining-puerto-rican-family-in-milwaukee/78091053007/\">Milwaukee Journal Sentinel</a>. </p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>“These reports raise serious questions about the actions of Department of Homeland Security (DHS) and Immigration and Customs Enforcement (ICE) personnel when conducting immigration enforcement,” Raskin and Jayapal said.</p>\n<p>The Hill has reached out to DHS and ICE for comment.</p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/homenews/house/5127297-raskin-ice-raids-ccitizens-demands-answers/",
            "pub_date": "2025-02-05 12:01:03",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5127282,
            "title": "Texas House Republican says US could use drones against cartels to ‘save American lives’",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>Rep. Brian Babin (R-Texas), co-chair of the Border Security Caucus, said on Tuesday the United States “could” use drones against the cartels if it meant saving American lives.</p>\n<p>NewsNation <a href=\"https://www.newsnationnow.com/us-news/immigration/ice-agents-escalating-threats-violence/\">reported this weekend</a> that cartels have authorized the use of weaponized drone explosives against border patrol agents and other U.S. law enforcement at the southern border.</p>\n\n<p>In an interview Tuesday on NewsNation’s “The Hill,” anchor Blake Burman asked Babin whether he thinks the situation “gets to the point where drones from the U.S. are used against the cartels.</p>\n<p>“It certainly could. I’m not saying it will,” Babin responded, noting that the U.S. knows where the drug labs are and where “a lot of these bad guys live.”</p>\n<p>“It could come down to that,” he added.</p>\n<p>Babin said he was grateful President Trump had designated the cartels as foreign terrorist organizations, saying “all is fair” when countering groups with that designation.</p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>“Everything’s on the table, and we could absolutely take that type of action against them, to save American lives, to save our property, to save our sovereignty,” he said.</p>\n<p> <em>The Hill is owned by Nexstar Media Group, which also owns NewsNation.</em></p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/homenews/house/5127282-brian-babin-drones-cartels/",
            "pub_date": "2025-02-05 11:25:55",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5127259,
            "title": "Grassley pushes for Senate committee vote on Patel as early as next week",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>Senate Judiciary Committee Chair Chuck Grassley (R-Iowa) said he’s eyeing next week for a final committee vote on Kash Patel’s nomination to lead the FBI, rejecting Senate Democrats’ request for a second formal hearing with the nominee.</p>\n<p>“Further hearings on his nomination are unnecessary,” Grassley said in a statement Tuesday.</p>\n\n<p>Grassley said Patel already testified for more than five hours before the committee, shared “thousands of pages of records and media appearances,” and provided 147 pages of answers to senators’ written questions.</p>\n<p>“The Senate Judiciary Committee will not fall for Democrats’ delay tactics,” Grassley added. “I intend to hold a final committee vote on Patel’s nomination as soon as next week.”</p>\n<p>Earlier on Tuesday, Senate Democrats on the committee <a href=\"https://x.com/JudiciaryDems/status/1886903667502076328/photo/1\">wrote to Grassley</a> to ask him to hold a second hearing for Patel. They said they wanted Patel to “clarify apparent falsehoods in his testimony” during the first hearing and wanted time to assess Patel’s grand jury testimony in connection to the federal investigation into President Trump’s retention of classified documents.</p>\n<p>They also said they wanted Patel to address “the recent removals and reassignments of FBI career civil servants.”</p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>“No one was convinced by the Minority’s baseless efforts to mischaracterize and malign Kash Patel,” Grassley said. “It’s additionally outrageous to assert that a nominee should come before the Senate to answer for government actions that occurred <em>prior to </em>their time at an agency.”</p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/homenews/senate/5127259-grassley-senate-committee-vote-patel/",
            "pub_date": "2025-02-05 10:50:59",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5127164,
            "title": "5 takeaways from the Trump, Netanyahu joint presser",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<p>President Trump on Tuesday doubled down on his proposal for Palestinians to leave the Gaza Strip and announced that the U.S. will take over the tiny territory in a joint press conference alongside Israeli Prime Minister Benjamin Netanyahu.</p>\n<p>The press conference culminated after a day of remarks by Trump on the future of Gaza, that saw an unprecedented overhaul of U.S. foreign policy on the Israeli-Palestinian conflict. Trump also spoke from the Oval Office while signing executive orders and then alongside Netanyahu during a White House visit.</p>\n\n<p>Here are 5 takeaways from his remarks and joint press conference.</p>\n<h2 class=\"wp-block-heading\">Trump on Gaza: ‘Level it out’</h2>\n<p>Among Trump’s most exceptional remarks<strong> </strong>is his proposal for U.S. takeover in Gaza, pitching that ownership would bring stability to the Middle East, and for Palestinians to move out of the Gaza Strip, possibly into Egypt and Jordan despite those countries rejecting the deal.</p>\n<p>“The US will take over the Gaza Strip, and we will do a job – whether we’ll own it and be responsible for dismantling all of the dangerous unexploded bombs and other weapons on the site, level the site, and get rid of the destroyed buildings, level it out,” Trump said.</p>\n<p>“Create an economic development that will supply unlimited numbers of jobs and housing for the people of the area, do a real job, do something different,” he said.</p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>Trump did not respond when questioned on what authority would allow the U.S. to take over Gaza, but said he’s seeking a “long term ownership” that he thinks can be stability to the Middle East. He said he envisioned “the worlds’ people” living in Gaza, adding that it will be an “international, unbelievable place” that includes Palestinians and others. </p>\n<p>Gaza is not a sovereign land and is considered under international law to be occupied territory.</p>\n\n<h2 class=\"wp-block-heading\">Trump dismisses statehood as condition for Saudis</h2>\n<p>Trump is throwing cold water on Saudi Arabia’s public remarks that establishment of a Palestinian state is non-negotiable in opening ties with Israel. </p>\n<p>“They are demanding one thing. You know what it is? Peace,” Trump said in remarks from the Oval Office alongside Netanyahu.</p>\n<p>Trump is laser focused on brokering diplomatic relations between Saudi Arabia and Israel under the banner of his Abraham Accords, an unfinished goal from his first term in office and viewed as a game changer in Middle East power dynamics to push back on Iran. </p>\n<div class=\"civic-science-article-container civic-science-more-14 civic-is-mr3\" data-civicscience-widget=\"3f127ebd-287e-0b64-a901-d55ec286348a\" id=\"civsci-id-civsci-id-596708068\"></div>\n<p>“I think the administration will be looking towards building on the end of the Gaza war, ultimately to promote regional normalization,” a senior administration official told reporters.</p>\n<h2 class=\"wp-block-heading\">Future of Palestinians governing Gaza doubted</h2>\n<p>U.S. and Israeli mediators are beginning talks on phase two of a three-phase ceasefire deal that is expected to go into effect on March 1 – although that deadline can be extended as long as both Israel and Hamas are engaged in talks. </p>\n<p>The second phase of the deal is expected to include a civilian Palestinian governing body administering the strip, the withdrawal of Israeli troops, reconstruction and an agreement to end the war. </p>\n\n<p>But Trump doubted whether the Palestinian Authority, the ruling body in the West Bank, could administer the Gaza Strip.</p>\n<p>“Well it’s had a pretty hard time wouldn’t you say. I’d say it’s had a pretty bad time of it,” he said. </p>\n<p>The second phase would see Hamas release more hostages it kidnapped from Israel, including American Edan Alexander, kidnapped while serving in the Israel Defense Forces (IDF). </p>\n\n<h2 class=\"wp-block-heading\">Trump talks Ukraine, Iran</h2>\n<p>Trump suggested that he thinks an end to the war in Ukraine is near, saying his administration is trying “very hard” to end it.</p>\n<p>“We are having very good talks, very constructive talks on Ukraine and we are talking to the Russians, talking to the Ukrainian leadership,” he said, </p>\n<p>He doubled down on his argument that the war in Ukraine wouldn’t have happened if he was president when Russian President Vladimir Putin invaded.</p>\n\n<p>“We’re having very good talks and I think something will be, hopefully dramatically, it will rise about everything. You have to, you can’t let this continue,” he said.</p>\n<p>Additionally, Trump and Netanyahu discussed the significance of Iran not having access to a nuclear weapon, hours after the president signed an executive order to apply maximum pressure on Iran.</p>\n<p>“I want Iran to be peaceful and successful, I hated doing it,” Trump said earlier in the Oval Office of signing the order. “They cannot have a nuclear weapon and if I think that they will have a nuclear weapon… I think that will be very unfortunate for them.”</p>\n\n<p>When asked in Oval Office earlier on Tuesday if he would green-light Netanyahu if he asked for help in striking at Iran’s nuclear facilities, Trump replied, “I don’t know that that’s what he’s going to be asking for, I have no idea that he is.”</p>\n<h2 class=\"wp-block-heading\">Congress intervenes in Israel weapon sales</h2>\n<p>In an unusual move, Congress has put a hold on Trump’s plans to announce a $1 billion arms sale package for Israel. </p>\n<p>The four top lawmakers on the House Foreign Affairs Committee and the Senate Foreign Relations Committee have the power to individually block arms sales orders when over a certain dollar amount. Two congressional aides confirmed that a member of this group exercised the hold. </p>\n\n<p>The Wall Street Journal, citing U.S. officials, reported that the $1 billion arms sale package includes 4,700 1,000-pound bombs, worth more than $700 million, as well as armored bulldozers built by Caterpillar, worth more than $300 million. </p>\n<p>Arms sales to Israel are historically bipartisan, even as Democrats have increasingly raised alarm over Israel’s war conduct in the Gaza Strip and Netanyahu’s policies toward Palestinians.</p>\n<p>But the move comes as Democrats have floundered in pushing back against Trump’s agenda since taking office.</p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/policy/international/5127164-trump-netanyahu-joint-presser/",
            "pub_date": "2025-02-05 09:25:59",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5127162,
            "title": "USAID workers placed on administrative leave ‘until further notice’",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<p>Employees at the U.S. Agency for International Development (USAID) are being placed on administrative leave with pay “until further notice,” according to letters reviewed by The Hill.</p>\n<p>Employees must be available by phone and email during business hours, according to the notice, which provides an email for them to contact “to end that.” </p>\n\n<p>The letters come after most USAID employees lost access to internal systems over the weekend as Elon Musk’s Department of Government Efficiency (DOGE) put the agency through a “woodchipper.”</p>\n<p>One USAID employee said they felt “helpless” after receiving the letter.</p>\n<p>Another said they were “disappointed that our lawmakers in the majority seem complicit or at least tacitly approve.”</p>\n<p>One employee who lost access Monday said they had not received a copy of the letter to their personal email.</p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>The letter was sent by Pete Marocco, who Secretary of State Marco Rubio reportedly tapped Tuesday to run USAID. </p>\n<p>Neither USAID nor the White House immediately responded to requests for comment from The Hill and questions about how many USAID employees received these letters.</p>\n\n<p><em>Developing.</em></p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/homenews/5127162-usaid-workers-placed-on-administrative-leave-until-further-notice/",
            "pub_date": "2025-02-05 09:21:00",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5127110,
            "title": "Musk meets with Netanyahu, his son Yair",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>Tech billionaire Elon Musk met with Israeli Prime Minister Benjamin Netanyahu and his son Yair Netanyahu.</p>\n<p>“So grateful to spend time with these two geniuses,” Yair Netanyahu <a href=\"https://www.instagram.com/p/DFqRcaZRjjJ/\" rel=\"noreferrer noopener\" target=\"_blank\">captioned a</a> Tuesday Instagram post featuring a photo of his father and Musk.</p>\n<p>The White House hosted the Israeli <a href=\"https://thehill.com/homenews/administration/5126689-trump-palestinians-resettlement/\">prime minister on Tuesday</a>. During <a href=\"https://thehill.com/homenews/administration/trumps-first-100-days/5124446-live-updates-gabbard-rfk-jr-usaid-trump-house-senate/\">a press conference</a> later in the day, Benjamin Netanyahu <a href=\"https://www.youtube.com/watch?v=67PWzshwO00\">referred to Trump</a> as “the greatest friend Israel has ever had in the White House.”</p>\n<p><a href=\"https://thehill.com/policy/international/5102610-benjamin-netanyahu-elon-musk-salute/\" rel=\"noreferrer noopener\" target=\"_blank\">In late January</a>, the elder Netanyahu defended Musk, who has been especially close with Trump in the last year, in the wake of him being accused of doing a Nazi salute amid an event after the president’s inauguration.</p>\n<p>“@elonmusk is being falsely smeared,” he <a href=\"https://thehill.com/policy/international/5102610-benjamin-netanyahu-elon-musk-salute/\">said in a post on the social platform</a> X, which Musk owns.</p>\n<p>“Elon is a great friend of Israel. He visited Israel after the October 7 massacre in which Hamas terrorists committed the worst atrocity against the Jewish people since the Holocaust,” he added.</p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/policy/international/5127110-musk-meets-netanyahu-son-yair/",
            "pub_date": "2025-02-05 09:10:57",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5127126,
            "title": "Newsom to meet with Trump at White House on Wednesday",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>Gov. Gavin Newsom (D) is set to meet with President Trump at the White House on Wednesday, an official told The Hill. </p>\n<p>The governor will be the first Democrat to go to the White House to have a sit-down with Trump since the inauguration. </p>\n<p>They were recently together in California when the president traveled to the state to assess wildfire damages in the Los Angeles area. </p>\n<p>The two leaders shared a surprisingly <a href=\"https://thehill.com/homenews/administration/5106055-trump-newsom-friendly-california-wildfires/\">friendly greeting</a> as Trump landed in the Golden State., despite having sparred for weeks. The president has blamed California’s leaders for the wildfires that burned much of January, killing 29 people and destroying over 15,000 structures.</p>\n<p>Since his visit, Trump ordered the release of water in Southern California and the U.S. Army Corps of Engineers opened two dams, allowing the flow of billions of gallons of water.</p>\n<p>“Photo of beautiful water flow that I just opened in California. Today, 1.6 billion gallons and, in 3 days, it will be 5.2 billion gallons. Everybody should be happy about this long fought Victory! I only wish they listened to me six years ago – There would have been no fire!” Trump said on <a href=\"https://truthsocial.com/@realDonaldTrump/113925591427889253\">Truth Social</a> last week.</p>\n<script type=\"text/javascript\">window.NREUM||(NREUM={});NREUM.info={\"beacon\":\"bam.nr-data.net\",\"licenseKey\":\"bb199f70cb\",\"applicationID\":\"738543775\",\"transactionName\":\"MQNTMhdXDxECABBZDAhJchMWQg4PTBMLQxdIFl4VEQ==\",\"queueTime\":0,\"applicationTime\":2322,\"atts\":\"HURERF9NHE5BAkYKGBsb\",\"errorBeacon\":\"bam.nr-data.net\",\"agent\":\"\"}</script>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/homenews/administration/5127126-gavin-newsom-trump-white-house/",
            "pub_date": "2025-02-05 09:05:54",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5126838,
            "title": "Senate confirms Pam Bondi to lead Justice Department",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>The Senate on Wednesday voted to confirm Pam Bondi as the next attorney general, giving her control of a Justice Department embroiled in controversy.</p>\n<p>Bondi, a two-term attorney general in Florida, has been lauded for her prosecutorial experience and work battling the opioid epidemic in the sunshine state.</p>\n\n<p>But she is also a former attorney for President Trump who worked on his 2020 election challenge and has been highly critical of the criminal investigations into him, even calling for “prosecutors to be prosecuted.”</p>\n<p>Her nomination <a href=\"https://thehill.com/policy/national-security/5087783-trump-pick-justice-department/\" rel=\"noreferrer noopener\" target=\"_blank\">inspired scrutiny from Democrats</a> over whether she will maintain an independent Justice Department.</p>\n<p>“If confirmed, I will work to restore confidence and integrity to the Department of Justice — and each of its components. Under my watch, the partisan weaponization of the Department of Justice will end,” Bondi said at her confirmation hearing.</p>\n<p>Democrats overseeing her nomination were unconvinced.</p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>“President Trump has said time and again that he expects the Justice Department to seek ‘retribution’ on his behalf. With Ms. Bondi, I’m afraid, the President has finally found someone who passes his loyalty test,” Sen. Dick Durbin (Ill.), the top Democrat on the panel, said during a Monday floor speech.</p>\n<p>Bondi <a href=\"https://thehill.com/policy/national-security/5087783-trump-pick-justice-department/\">refused to answer</a> a number of questions she dismissed as hypotheticals, sidestepping inquiries about whether she would appoint a special counsel if Trump was accused of doing something illegal. She also <a href=\"https://thehill.com/homenews/senate/5087363-pam-bondi-jack-smith-trump-investigation/\" rel=\"noreferrer noopener\" target=\"_blank\">declined to say whether she would investigate</a> special counsel Jack Smith.</p>\n\n<p>She also <a href=\"https://thehill.com/regulation/court-battles/5086766-ag-nominee-pam-bondi-trump-2020-election/\" rel=\"noreferrer noopener\" target=\"_blank\">declined to acknowledge</a> that Trump lost the 2020 election, instead saying only that President Biden, still in office at the time, was the sitting president after a “peaceful transition of power.”</p>\n<p>“President Biden is the President of the United States. He was duly sworn in, and he is the President of the United States. There was a peaceful transition of power. President Trump left office and was overwhelmingly elected in 2024,” Bondi said.</p>\n<p>In a floor speech Tuesday, Senate Judiciary Chair Chuck Grassley (R-Iowa) noted that numerous Democrats had noted Bondi was qualified for the role.</p>\n<div class=\"civic-science-article-container civic-science-more-14 civic-is-mr3\" data-civicscience-widget=\"3f127ebd-287e-0b64-a901-d55ec286348a\" id=\"civsci-id-civsci-id-596708068\"></div>\n<p>“If my colleagues will not cross the aisle to vote for this qualified nominee, they’ll show that Senate Democrats are intent on opposing President’s Trump’s Cabinet picks for purely partisan reasons,” he said.</p>\n<p>Bondi takes the reins of the department at a critical time.</p>\n<p>The Justice Department has <a href=\"https://thehill.com/homenews/administration/5109360-doj-fires-prosecutors-who-worked-on-trump-criminal-cases/\" rel=\"noreferrer noopener\" target=\"_blank\">fired or reassigned a number of career staff</a>, including dismissing a dozen prosecutors that worked on Smith’s team.</p>\n\n<p>FBI agents that worked on Trump’s two criminal cases were also <a href=\"https://thehill.com/homenews/administration/5119963-trump-administration-forces-out-fbi-officials/\" rel=\"noreferrer noopener\" target=\"_blank\">escorted out of the building</a> last week.</p>\n<p>Prosecutors who worked on the more than 1,500 cases of those that stormed the Capitol on Jan. 6 were also let go from the U.S. Attorney’s Office in D.C.</p>\n<p>And Deputy Attorney General Emil Bove, formerly Trump’s criminal defense attorney, has demanded the FBI turn over information on the role thousands of FBI agents played in those cases.</p>\n\n<p>Bondi received a letter from Durbin Tuesday asking whether she was aware of “the removal, resignation, or reassignment of any career civil servant” and asking for her communications with the Trump transition team as well as current DOJ leadership.</p>\n<p>Bondi’s confirmation comes as senators are still <a href=\"https://thehill.com/policy/national-security/5117436-kash-patel-fbi-confirmation-hearing/\" rel=\"noreferrer noopener\" target=\"_blank\">weighing the nomination</a> of Kash Patel to lead the FBI, with Bondi facing numerous questions about how she would deal with any abuse of power by Patel.</p>\n<p>“If he is confirmed, and if I am confirmed — he will follow the law if I am the attorney general of the United States of America. And I don’t believe he would do anything otherwise,” she said.</p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/regulation/court-battles/5126838-pam-bondi-ag-justice-department-confirmed/",
            "pub_date": "2025-02-05 08:56:02",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5127002,
            "title": "Robert Kraft’s son launches campaign for Boston mayor",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>The son of New England Patriots owner Robert Kraft, Josh Kraft, <a href=\"https://joshforboston.com/?fbclid=PAZXh0bgNhZW0CMTEAAaZaUKlWRjnO_4-cjE1yI8AMwbQkjgRBEoHvVKlcOYCEL0Aq0QJgBTSEHGY_aem_2uNhpmqkVLjV0Nt5vMlIEQ\">has launched</a> a campaign to be Boston’s mayor.</p>\n<p>“I love with this city with its many unique neighborhoods, and its people. The people of Boston are hard working, humble, and above all, proud of this city, no matter which neighborhood they come from,” the younger Kraft said in a post on Facebook Tuesday.</p>\n\n<p>“Serving Boston has been my passion and a great source of joy and purpose in my life, which is why I am running for Mayor,” <a href=\"https://www.facebook.com/p/Josh-Kraft-100086781917525/\">he added</a>. “I hope you will join my campaign to bring more housing and more opportunity to Boston.”</p>\n<p>Josh Kraft, who is running as a Democrat, according to his campaign website, has a father <a href=\"https://thehill.com/blogs/in-the-know/4937718-patriots-owner-trump-drunk-fraternity-brother-become-president/\">with historically close ties to</a> President Trump. According to <a href=\"https://www.facebook.com/p/Josh-Kraft-100086781917525/\">his Facebook page</a>, the younger Kraft is the New England Patriots Foundation president. </p>\n<p>“I’ve spent my entire career working in and around the neighborhoods of Boston – from Roslindale to East Boston, from Mattapan to Charlestown, from South Boston to Roxbury, first as employee and then as CEO of the Boys and Girls Clubs of Boston,” Josh Kraft’s Facebook post reads.</p>\n<p>Robert Kraft, in October, equated President Trump to a “drunk fraternity brother” during his first time in the White House, noting their previous longtime friendship.</p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>“I couldn’t believe it,” Robert Kraft told Charlamagne tha God on “The Breakfast Club” radio program. “It was like having someone who’s a drunk fraternity brother become [president of the United States.]”</p>\n<p>Earlier in the interview, Kraft said he’s a Democrat but that Trump “became a social friend in the early 90s” when he was going down to Florida.</p>\n\n<p>“And then when my wife of blessed memory died 13 years ago, he was one of four or five people who reached out to me and was really, really nice,” Kraft continued. “The only donation I ever gave to him was he called me when he got elected. And I made a strong donation to his inauguration.”</p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/homenews/state-watch/5127002-robert-krafts-son-launches-campaign-for-boston-mayor/",
            "pub_date": "2025-02-05 08:31:02",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5127009,
            "title": "United resumes flights from U.S. to Israel",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>United Airlines announced on Tuesday it plans to restart flights to Israel next month, making it the first major U.S. airline to do so this year.</p>\n<p>On March 15, United will resume service from Newark to Tel Aviv, and it will add a second daily flight starting March 29, the airline said in a statement.</p>\n\n<p>“This resumption follows a detailed assessment of operational considerations for the region and close work with the unions who represent our flight attendants and pilots,” the statement read.</p>\n<p>“United has a longstanding commitment to serving Tel Aviv, and this return will make United the first U.S. airline to resume service this year,” the statement added.</p>\n<p>United will “continue to evaluate” whether to restore additional daily flights “based on demand,” the statement said.</p>\n<p>United <a href=\"https://thehill.com/regulation/transportation/4804585-united-airlines-delta-cancel-flights-tel-aviv/\">suspended service to Tel Aviv last summer</a> amid rising tensions in the region. </p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>The announcement of its resumption of flight service comes less than a month after Israel and Hamas <a href=\"https://thehill.com/policy/defense/5092533-trump-israel-gaza-ceasefire/\">struck a fragile three-phase ceasefire</a> agreement that would return hostages in exchange for prisoners and establish a path to a permanent ceasefire.</p>\n<p>Delta announced last week it would resume daily flights from JFK in New York to Tel Aviv starting on April 1.</p>\n\n<p>“Delta’s decision to resume service follows a comprehensive security review, conducted in close coordination with government and private-sector partners. The airline continues to prioritize the safety of its customers and crews and has implemented additional precautions for operations to and from Tel Aviv,” Delta said in its announcement last week.</p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/policy/international/5127009-united-airlines-resume-israel-flights/",
            "pub_date": "2025-02-05 08:16:03",
            "source": "thehill",
            "language": "en"
        }
    ]
}