{
    "data": [
        {
            "id": 5125050,
            "title": "Trump ‘does not have the authority to abolish’ USAID: Congressional Research Service",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>The Congressional Research Service, a federal agency tasked with legislative research and analysis, published a <a href=\"https://crsreports.congress.gov/product/pdf/IN/IN12500\">Monday report</a> declaring President Trump does not have the “authority” to abolish USAID.</p>\n<p>“Because Congress established USAID as an independent establishment (defined in 5 U.S.C. 104) within the executive branch, the President does not have the authority to abolish it; congressional authorization  would be required to abolish, move, or consolidate USAID,” wrote author Emily M. McCabe, a specialist in foreign assistance and foreign policy.</p>\n\n<p>McCabe cited portions of the Foreign Affairs Reform and Restructuring Act of 1998 which temporarily granted the president authority to “reorganize” the agency but argued the power to do so expired in 1999. </p>\n<p>“Congress has not granted the President further authority to abolish, move, or consolidate USAID since,” she wrote.</p>\n<p>She also noted that the agency has long been under the “direct authority and foreign policy guidance of the Secretary of State.” Trump recently appointed Secretary of State Marco Rubio to serve as <a href=\"https://thehill.com/homenews/administration/5123282-marco-rubio-usaid-take-over/\">acting head</a> of the agency while staffers fretted over expected <a href=\"https://thehill.com/policy/technology/5122676-usaid-shutdown-elon-musk-doge/\">operational cuts</a> from the Department of Government Efficiency following a <a href=\"https://thehill.com/policy/international/5097273-trump-executive-order-foreign-development/\">freeze</a> on foreign assistance. </p>\n<p>McCabe’s analysis noted past administrations have altered the functions of USAID, including shifting certain functions from USAID to the State Department, but not before notifying and consulting with the appropriate congressional committees. </p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>“As USAID’s internal organization is not set in statute, Administrations have sometimes changed USAID’s  internal structure, often reflecting a President’s foreign policy priorities and foreign assistance initiatives,” McCabe outlined. </p>\n<p>“In these cases, the Administration is to notify and consult with ‘appropriate congressional committees’ in advance of such changes pursuant to procedures included in annual Department of State, Foreign Operations, and Related Programs (SFOPS) appropriations bills (for FY2024 SFOPS, see Section 7063 of P.L. 118-47).”</p>\n\n<p>Her report flagged that in the coming weeks, lawmakers may seek to gain more information about the Trump administration’s proposed changes and its impact on federal funding. </p>\n<p>“Some Members have raised concerns regarding President Trump’s executive order pausing foreign assistance and actions taken to halt programs and dismiss agency leaders,” McCabe wrote. </p>\n<p>“The Administration’s actions to subsume USAID into the State Department may deepen such concerns and raise new questions among Members about the Administration’s compliance with congressional reporting and consultation requirements and the Administration’s use of funds appropriated to USAID and its programs.”</p>\n<p>She stated House and Senate Appropriations Committees and House Foreign Affairs and Senate Foreign Relations Committees, in particular, might choose to probe through congressional hearings, letters, and informal communications. </p>\n<p>“Such oversight activities may shape how both the appropriators and authorizers approach USAID, State, and relevant programs in annual appropriations bills and consideration of potential legislation providing authorizations or restrictions,” she concluded.</p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/homenews/administration/5125050-trump-does-not-have-the-authority-to-abolish-usaid-congressional-research-service/",
            "pub_date": "2025-02-05 03:15:53",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5125975,
            "title": "Trump team extends timeline for Gaza reconstruction",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>Trump administration officials say the five-year timeline laid out in later phases of a peace deal between Israel and Hamas is too short, estimating the timeline will be at least twice that.</p>\n<p>While officials were cautious about explicitly backing Trump’s suggestion to “clean out” Palestinians from the Gaza Strip and house them elsewhere during reconstruction, they suggested the territory may be uninhabitable in the interim and called for “creative” regional solutions. </p>\n\n<p>“Phase three, the reconstruction, is not going to go the way that agreement talks about, which is a five-year program,” Steve Witkoff, Trump’s special envoy for the Middle East told reporters, referring to the three-phase ceasefire deal negotiated by the Biden administration. </p>\n<p>Trump’s team says reconstruction is likely to take between 10 and 15 years. </p>\n<p>A senior administration official said Trump “looks at the Gaza Strip and sees it as a demolition site” and “sees it as impractical for it to be rebuilt within three to five years, believes it will take at least 10 to 15 and thinks it’s inhumane to force people to live in an uninhabitable plot of land with unexploded ordnance and rubble.”</p>\n<p>The remarks come ahead of a meeting between Trump and Israeli Prime Minister Benjamin Netanyahu at the White House on Tuesday. </p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>Trump <a href=\"https://thehill.com/policy/international/5107238-trump-gaza-strip-cnn/\">said last week</a> that he would like both Jordan and Egypt, which borders Gaza, to help house people at least temporarily outside of the war-torn strip. </p>\n<p>“You’re talking about a million and a half people, and we just clean out that whole thing,” Trump told reporters aboard Air Force One. </p>\n\n<p>“Almost everything’s demolished, and people are dying there, so I’d rather get involved with some of the Arab nations and build housing in a different location where I think they could maybe live in peace for a change.”</p>\n<p>Arab leaders in the region have said efforts to displace Palestinians or move them into neighboring countries are a non-starter. Egypt and Jordan, countries with peace treaties with Israel, oppose absorbing Palestinians claiming it poses a security risk, is destabilizing, and threatens to provoke mass opposition on the Arab street.</p>\n<p>Five Arab foreign ministers and a senior Palestinian official <a href=\"https://www.axios.com/2025/02/03/gaza-palestinians-reconstruction-rubio-egypt-letter\">sent a joint letter</a> to Secretary of State Marco Rubio opposing plans to displace Palestinians from Gaza, Axios reported. </p>\n<div class=\"civic-science-article-container civic-science-more-14 civic-is-mr3\" data-civicscience-widget=\"3f127ebd-287e-0b64-a901-d55ec286348a\" id=\"civsci-id-civsci-id-596708068\"></div>\n<p>But Trump’s team said they are trying to be transparent over the scale of reconstruction, and the need to share the burden. </p>\n<p>“I would push back on that characterization of ‘cleaning out Gaza,'” Mike Waltz, Trump’s national security advisor, told reporters Tuesday. </p>\n<p>“Trump is looking at this from a humanitarian standpoint. There are piles of rubble, we have to realistically look at how to rebuild Gaza. We are talking 10-15 years to rebuild. We have to work through and that’s what we’ll work through with Prime Minister Netanyahu,” Waltz added. </p>\n\n<p>The ceasefire deal is made up of three phases. Israel and Hamas are currently adhering to the first phase of the deal. </p>\n<p>A senior administration official said that the White House message, during a meeting with Arab ambassadors in Washington, was to try and find creative solutions that “would be humane and will provide dignity for the Palestinian people.” </p>\n<p>“I was there speaking with them, and what we’ve asked for is to work together with our Arab partners and friends in the region and with Israel, to all come together for creative solutions to this challenge,” the official said.</p>\n\n<p>“This is not going to be something that the United States is going to solve alone and that we’re going to impose on Arab [nations] and Israel, but rather, we’re asking our friends and partners and allies to come together as we look for what solutions we can provide that would be humane and will provide dignity for the Palestinian people.”</p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/policy/international/5125975-trump-team-extends-timeline-for-gaza-reconstruction/",
            "pub_date": "2025-02-05 03:15:53",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5126073,
            "title": "OPM employees file suit to block use of new email system",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>Two Office of Personnel Management employees are asking a court to block the agency from using computer systems and emails connected with its buyout offers to federal employees.</p>\n<p>It’s the latest battle in a suit that alleges OPM violated the law by sending out emails purporting to be from “<a href=\"https://thehill.com/mailto:hr@opm.gov\">hr@opm.gov</a>” – assembling a new dataset without accounting for how it would protect federal workers’ sensitive personal information.</p>\n\n<p>Asking federal employees to reply to that email appears to have been a first step in OPM’s work to assemble a list of federal employee emails ahead of offering the <a href=\"https://thehill.com/homenews/administration/5112001-trump-federal-workers-buyouts/\">“Fork in the Road” buyout package</a> to nearly all employees — a brainchild of Elon Musk.</p>\n<p>“The evidence suggests that, at some point after 20 January 2025, OPM allowed unknown individuals to simply bypass its existing systems and security protocols and install one or more new systems to ingest and store vast quantities of PII about Executive Branch employees…for the stated purpose of being able to communicate directly with those individuals without involving other agencies,” the suit states, using an abbreviation for personally identifiable information.</p>\n<p>“Absent a prohibition from this Court, OPM will continue to operate computer systems containing vast quantities of PII which are more susceptible to cyberattacks than the preexisting OPM systems, and OPM will continue to insist that Executive Branch employees send yet more information to those systems.” </p>\n<p>OPM did not respond to request for comment.</p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>The request for a restraining order against the use of the new system comes as the federal government is pushing employees to respond to the buyout offer by Feb. 6.</p>\n<p>The agency has also been accused of allowing employees outside OPM install a server, a nod to a Reddit post.</p>\n\n<p>If granted, OPM would be forced to disconnect its server until it can construct a plan for how to protect employees data, a requirement of the E-Government Act of 2002.</p>\n<p>The federal government did not previously have the capability to mass email all federal employees, as most communications come directly from the departments where employees work.</p>\n<p>House Oversight Democrats <a href=\"https://thehill.com/homenews/administration/5125573-opm-server-installation-controversy/\">earlier Tuesday said</a> that “acquiring such a capability securely and in compliance with federal cybersecurity, privacy, and procurement laws would likely not have been possible in such a short timeframe.”</p>\n<p>They asked for a list of employees that installed the equipment, the authority under which they were hired, and whether they faced background investigations — a nod to a Reddit post saying employees outside OPM installed the server.</p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/homenews/administration/5126073-opm-email-system-battle/",
            "pub_date": "2025-02-05 03:10:58",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5125951,
            "title": "Greenland looks to ban foreign political donations",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>Greenland’s <a data-id=\"https://thehill.com/policy/international/5100318-trump-greenland-denmark-european-parliament/\" data-type=\"link\" href=\"https://thehill.com/policy/international/5100318-trump-greenland-denmark-european-parliament/\">parliament</a> on Tuesday debated whether it would ban political donations from foreign or anonymous contributors.</p>\n<p>The island territory’s Inatsisartut examined a proposal that would ban a political party from receiving domestic private contributions higher than 200,000 Danish kroner — which is nearly $28,000. It would also ban an individual contributor from exceeding 20,000 kroner, or $2,770, <a href=\"https://apnews.com/article/greenland-denmark-trump-parliament-contributions-us-884cd19482adc9135e2870cb059c8dae\">The Associated Press reported.</a></p>\n\n<p>The move comes as President Trump and his administration <a data-id=\"https://thehill.com/homenews/administration/5072954-trump-greenland-acquisition-concerns/\" data-type=\"link\" href=\"https://thehill.com/homenews/administration/5072954-trump-greenland-acquisition-concerns/\">seek to acquire</a> Greenland, which is currently owned by Denmark. Trump has <a data-id=\"https://thehill.com/policy/defense/5074900-trump-provokes-anxieties-with-greenland-panama-canal-military-talk/\" data-type=\"link\" href=\"https://thehill.com/policy/defense/5074900-trump-provokes-anxieties-with-greenland-panama-canal-military-talk/\">not ruled out</a> using military force to <a data-id=\"https://thehill.com/homenews/administration/5097789-trump-greenland-international-security/\" data-type=\"link\" href=\"https://thehill.com/homenews/administration/5097789-trump-greenland-international-security/\">take over the land</a>, <a data-id=\"https://thehill.com/policy/international/5076153-mike-waltz-donald-trump-greenland-expansion/\" data-type=\"link\" href=\"https://thehill.com/policy/international/5076153-mike-waltz-donald-trump-greenland-expansion/\">arguing</a> that it is <a data-id=\"https://thehill.com/homenews/administration/5053319-trump-greenland-purchase/\" data-type=\"link\" href=\"https://thehill.com/homenews/administration/5053319-trump-greenland-purchase/\">essential</a> for national security.</p>\n<p>Just days ago, Secretary of State Marco Rubio said it was <a href=\"https://thehill.com/policy/international/5117893-marco-rubio-greenland-trump/\">“not a joke”</a> that the president wants to acquire the Arctic island. </p>\n<p>Lawmakers in Greenland argue the bill must be examined “in the light of geopolitical interests” and the “current situation where representatives of an allied great power have expressed interest in taking over and controlling Greenland,” the AP reported.</p>\n<p>Politicians in Greenland and from Denmark — which recently <a data-id=\"https://thehill.com/policy/defense/5110298-denmark-military-spending-greenland-donald-trump-acquisition/\" data-type=\"link\" href=\"https://thehill.com/policy/defense/5110298-denmark-military-spending-greenland-donald-trump-acquisition/\">upped its military spending</a> allocated for the territory — have <a data-id=\"https://thehill.com/policy/international/5091212-greenland-donald-trump-expansion-proposal/\" data-type=\"link\" href=\"https://thehill.com/policy/international/5091212-greenland-donald-trump-expansion-proposal/\">stressed</a> that the land is <a href=\"https://thehill.com/policy/international/5071666-greenland-denmark-trump-jr-visit/\">not for sale</a>, even as Trump continues to say what an asset it would be for the U.S. </p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>Trump reportedly had <a href=\"https://thehill.com/policy/international/5105602-donald-trump-greenland-denmark/\">a “fiery” call</a> with Danish Prime Minister Mette Frederiksen about ownership and control of the land late last month.</p>\n<p>If parliament agrees to the spending proposal Tuesday, it will likely become law and be enacted straight away, as the party controlling government has a majority in parliament, <a data-id=\"https://www.theguardian.com/world/2025/feb/03/greenland-plans-to-ban-foreign-political-funding-over-trump-led-election-fears\" data-type=\"link\" href=\"https://www.theguardian.com/world/2025/feb/03/greenland-plans-to-ban-foreign-political-funding-over-trump-led-election-fears\">The Guardian reported.</a></p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/policy/international/5125951-greenland-foreign-political-donations-ban/",
            "pub_date": "2025-02-05 03:05:54",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5125843,
            "title": "Hawley makes push to allow parents to sue tech companies",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>Sen. Josh Hawley (R-Mo.) said Tuesday he will introduce legislation to empower parents to sue leading social media companies over alleged harms to children and teens.</p>\n<p>“Social media platforms don’t change because they don’t have any incentive, which is a very polite way of saying, there’s no hammer on these people. They do whatever they want to do because they know nobody can effectively hold them accountable,” Hawley said during a Senate Judiciary Hearing on fentanyl Tuesday. </p>\n\n<p>Hawley delivered the remarks after hearing from Bridgette Norring, who testified before the committee to discuss the loss of her son, Devin, who died at the age of 19 after buying a fentanyl-laced pill through social media.</p>\n<p>“They’re making billions of dollars on their social media platforms, they’re killing our kids. They’re exposing them to all kinds of ungodly material, and they won’t do anything about it because we can’t hold them accountable,” Hawley said.</p>\n<p>“And I just want to say to members of this body that has got to change. It is time to give parents the right to sue these platforms,” he continued. “No company in America has the liability shield that these companies have.” </p>\n<p>Hawley has been <a data-id=\"https://thehill.com/policy/technology/5119211-big-tech-on-the-rise-one-year-after-senate-beat-down/\" data-type=\"link\" href=\"https://thehill.com/policy/technology/5119211-big-tech-on-the-rise-one-year-after-senate-beat-down/\">a fierce critic</a> of Big Tech’s impact on kids’ safety and privacy in recent years.</p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>The Missouri senator said empowering parents with the right to sue technology companies is vital as other methods like changing the rules on reporting do not stop the companies from taking what he believes is real action. </p>\n<p>“I will introduce legislation this Congress to allow parents…to go to court and sue these companies,” he said. </p>\n\n<p>Section 230 of the Communications Decency Act largely protects social media companies from being sued over the content people post to their sites. It was not immediately clear what Hawley’s bill will include to circumvent this. </p>\n<p>Hawley introduced a bill in 2023 that would limit tech companies’ legal immunity under Section 230, but this did not pass. </p>\n<p>Just over a year ago, Hawley made headlines for his grilling of Meta CEO Mark Zuckerberg, who appeared before the Judiciary Committee alongside the leaders of four other popular social media networks. Amid pressure from Hawley, Zuckerberg eventually apologized to the families present at the hearing. </p>\n<p>The hearing put a spotlight on alleged harms that come from these platforms and amped up pressure on both the companies and policymakers to do more to protect children and teens. </p>\n<p>Still, by the end of last year, much of the legislation of kids’ online safety did not make it past the finish line amid pushback, largely from House Republicans concerned about censorship. </p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/policy/technology/5125843-hawley-makes-push-to-allow-parents-to-sue-tech-companies/",
            "pub_date": "2025-02-05 03:05:52",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5124685,
            "title": "Want to cut government waste? Pay congressional staffers more.",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<p>If President Trump and his Department of Government Efficiency are to succeed in reforming and reducing the size and power of the federal bureaucracy, they will need good intelligence. They will need to know the details of programs, the existence of unpublicized offices, the allocation of human and financial resources, the redundancies within and across agencies and, perhaps most importantly, who are the important people within them.</p>\n<p>The administrative state has grown into such a behemoth that very few people know “where the bodies are buried” unless they work within one of those bureaucracies. Outside of those executive branch departments and agencies, very few specialists grasp the full extent of what should be known in order to make those agencies leaner, more efficient and more responsive to the will of elected officials. </p>\n\n<p>There are analysts at the Government Accountability Office who audit said agencies in response to the directives of Congress. But insofar as Congress is limited in its possession of the necessary “intelligence,” it has a correspondingly inadequate ability to specify the investigations and evaluations that GAO should conduct.</p>\n<p>Congressional limitations are the central problem here. The ability of our elected representatives to make optimally informed decisions about programs and budgets is constrained by the limited capabilities and numbers of congressional staff. </p>\n<p>A typical House member’s office has two legislative assistants and a legislative director. Each legislative assistant has a portfolio that includes multiple subject areas, most of which are unrelated to one another — for example, someone might have health policy, Social Security, transportation, homeland security, education and veterans affairs. It is impossible for such an assistant to develop serious expertise in all these subjects and their corresponding government agencies. This is partly because most legislative assistants are very young — usually just a few years into their careers — and because they have no experience working in the executive branch. Members of Congress must then rely on their committee staff, who are more senior and the most knowledgeable of all. </p>\n<p>Given the inexperience and paucity of trusted staffers capable of overseeing executive branch bureaucracies, the ability of Congress to gather the intelligence it needs to shape the nation’s laws is grossly suboptimal. And the fact that Congress depends on lobbyists to supply so much of the intelligence it receives makes it difficult for all concerned to evaluate the degree to which that information is biased. </p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>The usual pattern for congressional staff is to serve several years on the Hill and then “graduate” to private-sector jobs or service in the executive branch. Both destinations offer much better salaries. One almost never sees executive branch officials move to congressional offices, because few Hill staff positions pay a family-friendly salary. Yet it is exactly former executive branch officials who are needed on congressional staffs — officials who have served long enough to know the lay of the land as well as the personnel who are likely to be responsive or resistant to the president’s agenda.</p><!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://thehill.com/submitting-opinion-content/\"><img alt=\"\" class=\"wp-image-4329764\" decoding=\"async\" height=\"121\" loading=\"lazy\" sizes=\"(max-width: 899px) 100vw, 600px\" src=\"https://thehill.com/wp-content/uploads/sites/2/2023/11/op2.png?w=600\" srcset=\"https://thehill.com/wp-content/uploads/sites/2/2023/11/op2.png?resize=600,121 600w, https://thehill.com/wp-content/uploads/sites/2/2023/11/op2.png?resize=300,61 300w, https://thehill.com/wp-content/uploads/sites/2/2023/11/op2.png?resize=50,10 50w\" width=\"600\"/></a></figure>\n<p>This situation is aggravated by false economies trumpeted by some members of Congress who proudly declare that they are “saving taxpayer dollars” by having such lean staffs stuck with substandard salaries. They live in fear that, should they actually pay their staff wages commensurate with the skill and responsibilities these jobs so obviously require, demagogues would accuse them of building an “imperial Congress” that rewards the politically connected. If there is anything in government as penny-wise and pound foolish as this “saving of money,” it would be hard to find.</p>\n\n<p>If the president and DOGE are serious about reducing the power, intrusiveness, waste, fraud and bloat of the administrative state, they would do well to encourage our congressional leaders to improve Congress’s ability to be a check and balance against the federal bureaucracy and to recruit sympathetic members of executive branch agencies who should not have to take a pay cut to render an inestimable national service.</p>\n<p><em>Dr. John Lenczowski is founder, president emeritus and chancellor of the Institute of World Politics. Previously, he served as President Ronald Reagan’s principal adviser on Soviet affairs, as well as a congressional and State Department staffer.</em></p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/opinion/campaign/5124685-want-to-cut-government-waste-pay-congressional-staffers-more/",
            "pub_date": "2025-02-05 03:01:11",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5124116,
            "title": "Trump’s astonishingly wrongheaded notions about trade and tariffs",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>President Trump has been right about many things. But when it comes to tariffs, he’s wrong about nearly everything. And not just a little wrong, he’s astonishingly wrong. And the great mystery is he has several good economists around him who know he’s wrong and surely have tried to explain it to him — apparently to no avail.</p>\n<p>But if he would listen to them, here’s what they would tell him.</p>\n\n<p><strong>Trade balances don’t matter.</strong> <a href=\"https://www.cfr.org/backgrounder/us-trade-deficit-how-much-does-it-matter\" rel=\"noreferrer noopener\" target=\"_blank\">Trump has long been obsessed</a> with the U.S. trade deficit. Most economists aren’t. For decades the U.S. has bought more from other countries than other countries have bought from us, which means we always have an annual trade deficit. <a href=\"https://www.census.gov/foreign-trade/balance/c0004.html\" rel=\"noreferrer noopener\" target=\"_blank\">According to the Census Bureau</a>, the U.S. trade deficit was $436 billion in 2000, $635 billion in 2010, and $1.06 trillion in 2023. About the only time the trade deficit goes down is when people have less money to spend because the country is in an economic recession.</p>\n<p>But doesn’t that mean other countries (e.g., China) are “winning,” as Trump says, while the U.S. is losing? No, and to understand why, consider a household. Your household may have lots of trade deficits: with the grocery store, gas station, department stores, pharmacy and restaurants. You buy from them, but they don’t buy from you. Do you consider yourself losing? That system works because your household produces enough wealth (i.e., income) to pay those bills. And when you make more money, you’re likely to spend even more, increasing your trade deficits.</p>\n<p>Countries are no different. The U.S. is the wealthiest country in the world. <a href=\"https://fred.stlouisfed.org/series/GDP\" rel=\"noreferrer noopener\" target=\"_blank\">Our gross domestic product</a> — the sum of all goods and services produced in the U.S. — goes up every year except in recessions. GDP was about $10.5 trillion in 2000, $15.3 trillion in 2010, and nearly $30 trillion in 2024. The U.S. — i.e., companies and individuals — creates wealth and we spend it on things we want and need, just like your household.</p>\n<p>Incidentally, some states likely have trade deficits or trade surpluses with other states, but you never hear about that because nobody cares.</p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p><strong>Americans, not foreign countries, pay the tariffs.</strong> It is a mystery why Trump keeps claiming other countries pay our tariffs. <a href=\"https://www.nytimes.com/2025/02/02/business/economy/trump-tariffs-what-to-know.html\" rel=\"noreferrer noopener\" target=\"_blank\">The New York Times writes</a>, “Many U.S. companies have expressed frustration with Mr. Trump’s frequent assertions that foreign countries pay for tariffs.” He couldn’t be more wrong. A tariff is a tax the U.S. imposes on imports to the U.S., and U.S. consumers and companies pay those tariffs when the products arrive at customs.</p>\n<p><a href=\"https://taxfoundation.org/blog/who-really-pays-tariffs/\" rel=\"noreferrer noopener\" target=\"_blank\">Here’s the Tax Foundation</a>: “When the US imposes tariffs on imports, US businesses directly pay import taxes to the US government on their purchases from abroad.” Got that? Tariffs are a tax increase on U.S. businesses. Those increases are often passed on to consumers, meaning they will pay higher prices. In short, Donald Trump is raising your taxes.</p>\n\n<p>That’s why Democratic presidential candidate <a href=\"https://www.nbcnews.com/politics/2024-election/harris-calls-trumps-tariff-proposals-sales-tax-american-people-rcna172627\" rel=\"noreferrer noopener\" target=\"_blank\">Kamala Harris equated Trump’s proposed tariffs to a sales tax</a>. They work the same. Consumers will pay more.</p>\n<p>Sometimes a foreign company will reduce its prices to partially offset the tariff. And sometimes U.S. companies importing those goods or services will eat part or all the additional costs, reducing profits. But <a href=\"https://www.cnn.com/2025/02/02/politics/us-tariffs-americans-pay-imports/index.html\" rel=\"noreferrer noopener\" target=\"_blank\">consumers will see many prices rise</a>.</p>\n<p>And that’s why you’ve likely seen news stories suggesting Trump’s <a href=\"https://www.yahoo.com/news/us-businesses-brace-inflation-fear-083218031.html\" rel=\"noreferrer noopener\" target=\"_blank\">tariffs could boost inflation</a>. Some prices will go up, which may persuade the Federal Reserve Bank to not lower interest rates — or maybe even raise them.</p>\n<div class=\"civic-science-article-container civic-science-more-14 civic-is-mr3\" data-civicscience-widget=\"3f127ebd-287e-0b64-a901-d55ec286348a\" id=\"civsci-id-civsci-id-596708068\"></div>\n<p>Don’t miss the irony. Trump wants the Fed to cut interest rates even as he imposes tariffs that could keep prices higher than otherwise, which would prevent the Fed from lowering interest rates.</p>\n<p><strong>Tariffs won’t replace other taxes.</strong> <a href=\"https://www.foxbusiness.com/media/trump-proposes-abolishment-federal-income-tax-bringing-us-back-richest-period-history\" rel=\"noreferrer noopener\" target=\"_blank\">Trump likes to point out</a> that tariffs were the primary source of government revenue in the 1800s. But, of course, this isn’t the 1800s.</p>\n<p><a href=\"https://crsreports.congress.gov/product/pdf/IF/IF11030\" rel=\"noreferrer noopener\" target=\"_blank\">According to the Congressional Research Service</a>, “Over the past 70 years, tariffs have never accounted for much more than 2% of total federal revenue.” Tariffs brought in only $77 billion, or 1.57 percent of total revenue, in 2024. More importantly, that’s only 1.14 percent of total <a href=\"https://fiscaldata.treasury.gov/americas-finance-guide/federal-spending/#:~:text=The%20federal%20government%20spends%20money,)%2C%20resulting%20in%20a%20deficit.\" rel=\"noreferrer noopener\" target=\"_blank\">2024 federal spending of $6.75 trillion</a>.</p>\n\n<p>Trump has flirted with the notion, whether seriously or not, that tariff revenue might <a href=\"https://www.foxbusiness.com/media/trump-proposes-abolishment-federal-income-tax-bringing-us-back-richest-period-history\" rel=\"noreferrer noopener\" target=\"_blank\">replace other taxes like the income tax</a>. But <a href=\"https://fiscaldata.treasury.gov/americas-finance-guide/government-revenue/\" rel=\"noreferrer noopener\" target=\"_blank\">federal revenue from the individual income tax</a> was $2.43 trillion in 2024 — about 32 times the $77 billion the government received in tariffs. Even with significant spending cuts and increased tariff revenue, tariffs will be only a small fraction of the needed federal revenue.</p>\n<p>The White House and Trump can expect to hear complaints from the thousands of U.S. businesses that will have to pay Trump’s tariffs, the thousands of U.S. businesses hit by retaliatory tariffs imposed by Canada, Mexico and China, and from investors who see their assets tank as the stock market understandably prices in lower economic growth — or even a recession.</p>\n<p>The best solution is for Trump to claim his targeted countries have made concessions, however minor, and end this trade war. And maybe he will. Because the last thing he wants is to be the one to Make America Poor Again.</p>\n\n<p><em><em><u><a href=\"https://twitter.com/MerrillMatthews\" rel=\"noreferrer noopener\" target=\"_blank\">Merrill Matthews</a></u></em></em> <em>is a public policy and political analyst and the co-author of “On the Edge: America Faces the Entitlements Cliff.”</em></p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/opinion/5124116-trump-wrong-about-tariffs/",
            "pub_date": "2025-02-05 02:35:57",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5125936,
            "title": "Collins to back OMB nominee Russell Vought, paving way for confirmation",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>Senate Appropriations Chair Susan Collins (R-Maine) told The Hill Tuesday that she plans to vote for Russell Vought, President Trump’s pick to head the White House budget office, paving the way for Vought’s likely confirmation later this week.</p>\n<p>“Yes, I’m going to support it,” she said of Vought’s nomination to head the Office of Management and Budget (OMB).</p>\n\n<p>Collins believes that senators should give presidents deference to pick senior executive branch officials as long as they are qualified for the job, according to a source familiar with her views.</p>\n<p>Vought served as OMB director from 2019 to 2020, during Trump’s first term</p>\n<p>He has <a href=\"https://thehill.com/homenews/senate/5100443-russell-vought-confirmation-hearing-trump-funding/\" rel=\"noreferrer noopener\" target=\"_blank\">come under criticism from Democrats</a> for supporting the view that the president has the constitutional authority to impound funds appropriated for Congress, but he acknowledged during his confirmation hearing that courts have upheld the Impoundment Control Act, which Congress passed to stop president’s from holding up congressionally authorized funds.</p>\n<p>Vought has also been criticized for contributing to Project 2025, the conservative blueprint for reforming the federal government, which has aligned with Trump’s executive actions to freeze and evaluate spending during his first two and a half weeks in office.</p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>His nomination <a href=\"https://thehill.com/business/budget/5116461-republicans-advance-omb-russell-vought-democrats-boycott/\" rel=\"noreferrer noopener\" target=\"_blank\">passed out of the Budget Committee</a> last week on an 11-0 vote after Democrats boycotted the meeting to protest a freeze the OMB placed on federal grants and loans. </p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/homenews/senate/5125936-susan-collins-russell-vought-omb/",
            "pub_date": "2025-02-05 02:35:56",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5125724,
            "title": "Dem AGs warn federal workers about ‘misleading’ Trump buyout offers",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>A coalition of Democratic attorneys general issued warnings to federal workers in their states Monday about the Trump administration’s buyout offers, calling the program “misleading.”</p>\n<p>The 11 attorneys general, led by New York Attorney General Letitia James (D), cautioned that the benefits touted as part of the “deferred resignation” program being offered to nearly all full-time federal employees <a href=\"https://ag.ny.gov/press-release/2025/attorney-general-james-and-eleven-attorneys-general-warn-federal-employees-about\">may not be assured.</a></p>\n\n<p>“President Trump’s so-called buyout offers are nothing more than the latest attack on federal workers and the services they provide,” James said. “These supposed offers are not guaranteed.”</p>\n<p>The Trump administration says federal workers who accept the buyout will be paid until the end of September and retain their benefits <a href=\"https://thehill.com/homenews/administration/5119883-trump-benefits-buyout-eligibility/\">so long as they resign by Thursday</a>. The offer was extended to an estimated 2 million federal employees, and <a href=\"https://thehill.com/homenews/administration/5125600-trump-administration-buyout-federal-employees/\">at least 20,000 federal employees have accepted</a> the offer so far, a source told The Hill. </p>\n<p>The attorneys general urged federal employees to follow the guidance of their unions to protect their rights. </p>\n<p>Arizona Attorney General Kris Mayes (D) decried the offer as <a href=\"https://www.azag.gov/press-release/attorney-general-mayes-warns-federal-employees-about-misleading-buyout-offer#:~:text=%22Federal%20employees%20in%20Arizona%20need,to%20follow%20your%20union's%20guidance.\">“completely unreliable,”</a> while Michigan Attorney General Dana Nessel (D) urged workers to “<a href=\"https://content.govdelivery.com/accounts/MIAG/bulletins/3d08db7\">read the fine print</a> before signing.”</p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>California Attorney General Rob Bonta (D) said the buyouts are a “<a href=\"https://oag.ca.gov/news/press-releases/attorney-general-bonta-warns-federal-employees-about-questionable-buyout-offer\">pointed attack</a> aimed at dismantling our federal workforce and sowing chaos for Americans that rely on a functioning government.”</p>\n<p>And New Jersey’s attorney general, Matthew Platkin (D),<a href=\"https://www.njoag.gov/attorney-general-matthew-j-platkin-joins-11-attorneys-general-to-warn-federal-employees-about-misleading-buyout-offer/\"> took direct aim</a> at billionaire Elon Musk, whom Trump has tapped to cut the federal workforce via the Department of Government Efficiency.</p>\n\n<p>“President Trump has allowed an unelected billionaire with no constitutional authority to intimidate the civil servants who keep our government running in an attempt to push them out of their jobs,” Platkin said, noting that federal workers’ protections don’t change when a new president takes office. </p>\n<p>Democratic attorneys general have banded together several times since Trump took office, seeking to form a line of defense against <a href=\"https://thehill.com/regulation/court-battles/5111429-democratic-states-attorneys-general-sue-trump-administration/\">various executive actions</a>.</p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/regulation/court-battles/5125724-trump-administration-buyout-offer/",
            "pub_date": "2025-02-05 02:35:56",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5125858,
            "title": "Burgum begins to implement Trump’s ‘energy emergency’ declaration",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>Shortly after being sworn in to lead the Interior Department, Secretary Doug Burgum announced steps he would take to implement Trump’s declaration of <a href=\"https://thehill.com/policy/energy-environment/5096946-trump-declares-energy-emergency/\">an energy emergency</a>.</p>\n<p>In one of a series of secretarial orders he announced, Burgum said he would direct Interior’s bureaus and offices to identify emergency and other legal authorities that can be used to speed up energy and mineral production and processing. </p>\n\n<p>The order said that this should include, but not be limited to, offshore energy and energy on public lands.</p>\n<p>On his first day in office, Trump declared that the nation was facing an energy emergency — unlocking additional powers to promote energy development. At the same time, however, he moved <a href=\"https://thehill.com/policy/energy-environment/5105492-trump-administration-pauses-renewable-energy-approvals-public-lands-waters/\">to block</a> wind projects.</p>\n<p>Trump has repeatedly criticized renewable energy, especially wind, and has pledged to “drill baby, drill.”</p>\n<p>On Tuesday, Burgum also issued orders implementing additional Trump executive orders, including directing offices to identify regulations that can potentially be repealed to conform with Trump’s recent order that for every regulation there needs to be 10 deregulatory actions. </p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>Burgum also issued an order to implement Trump’s reversal of former President Biden’s <a href=\"https://thehill.com/policy/energy-environment/5070107-biden-drilling-ban-impact/\">move to bar</a> drilling off the East and West Coasts and parts of Alaska’s coast.</p>\n<p>“Today marks the beginning of an exciting chapter for the Department of the Interior,” Burgum said in a written statement. “We are committed to working collaboratively to unlock America’s full potential in energy dominance and economic development to make life more affordable for every American family while showing the world the power of America’s natural resources and innovation.” </p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/policy/energy-environment/5125858-burgum-trump-energy-emergency/",
            "pub_date": "2025-02-05 02:31:10",
            "source": "thehill",
            "language": "en"
        }
    ]
}