{
    "data": [
        {
            "id": 5125559,
            "title": "Watch live: Cassidy to discuss vote to advance RFK Jr.",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>Sen. Bill Cassidy (R-La.) is set to explain his <a data-id=\"https://thehill.com/homenews/senate/5123633-kennedy-nomination-advances/\" data-type=\"link\" href=\"https://thehill.com/homenews/senate/5123633-kennedy-nomination-advances/\">vote to advance</a> Robert F. Kennedy Jr.’s nomination <a data-id=\"https://thehill.com/policy/healthcare/4991324-trump-nominates-kennedy-health-department/\" data-type=\"link\" href=\"https://thehill.com/policy/healthcare/4991324-trump-nominates-kennedy-health-department/\">to serve</a> as Health and Human Services secretary.</p>\n<p>Cassidy <a data-id=\"https://thehill.com/policy/healthcare/5119803-cassidy-vote-kennedy-hhs/\" data-type=\"link\" href=\"https://thehill.com/policy/healthcare/5119803-cassidy-vote-kennedy-hhs/\">cast the key vote</a> earlier Tuesday during a Senate Finance Committee hearing. The nomination will now soon be considered by the full Senate.</p>\n\n<p>The Louisiana Republican, a physician who voted to convict President Trump in his 2021 impeachment trial, had publicly fretted over his vote, describing it as difficult. </p>\n<p>In a statement after the vote, Cassidy said he had “intense conversations” with Kennedy over the weekend and even this morning, and said he also spoke with Vice President Vance. </p>\n<p>“With the serious commitments I’ve received from the administration and the opportunity to make progress on the issues we agree on like healthy foods and a pro-American agenda, I will vote yes,” Cassidy said.</p>\n<p>He is set to give a speech on the Senate floor Tuesday.</p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>Watch above.</p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/video-clips/5125559-watch-live-cassidy-to-discuss-vote-to-advance-rfk-jr/",
            "pub_date": "2025-02-05 01:01:14",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5125457,
            "title": "NFL has no plans to end DEI policies, Goodell says",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>The National Football League (NFL) has no plans to end diversity, equity and inclusion (DEI) policies, according to the league’s Commissioner Roger Goodell, who said the initiatives make the sport better. </p>\n<p>“We got into diversity efforts because we felt it was the right thing for the National Football League, and we’re going to continue those efforts because we’ve not only convinced ourselves, I think we’ve proven to ourselves that it does make the NFL better,” Goodell told reporters on Monday. </p>\n\n<p>“We’re not in this because it’s a trend to get into it or a trend to get out of it. Our efforts are fundamental in trying to attract the best possible talent into the National Football League both on and off the field,” he added during his state of the league address. </p>\n<p>President Trump has made it one of his priorities to remove DEI policies and efforts from the federal government. He signed an executive order to <a href=\"https://thehill.com/homenews/administration/5104168-trump-attacks-diversity-equity-inclusion/\">end such practices</a> shortly after assuming office. A variety of corporations, even before Trump took office, moved in a similar direction, ending DEI policies. </p>\n<p>In late January, Target <a href=\"https://thehill.com/homenews/race-politics/5105514-target-dei-programs-trump/\">rolled back</a> its DEI policies and a program that emphasized offering products from Black- and minority-owned businesses. The program was created following the killing of George Floyd in 2020. Target joined the likes of Tractor Supply Co, McDonald’s and Walmart. </p>\n<p>Goodell referred to the Rooney Rule, which was introduced in 2003 and requires teams to interview at least one minority candidate for a head coaching gig, when emphasizing the NFL’s commitment to DEI. </p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>“There’s no requirement to hire a particular individual on the basis of race or gender. It’s simply on the basis of looking at a canvas of candidates that reflect our communities, and to look at the kind of talent that exists there and then you make the best decision on who is hired,” Goodell said on Monday. </p>\n<p>“And so many of us, including the National Football League at our office, are doing that voluntarily at all levels because it has benefited us; and I hear that from companies on a global basis is that, that’s a very strong hiring practice that we are adopting also,” he added. </p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/blogs/in-the-know/5125457-nfl-diversity-equity-inclusion/",
            "pub_date": "2025-02-05 01:01:09",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5123096,
            "title": "Democrats a permanent minority? Their ideology problem is only getting worse.",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>Democrats’ demographic problem is ideological: They’re becoming more liberal, but America remains more conservative. </p>\n<p>What’s more, one of Democrats’ traditionally most important groups, young voters, is becoming more conservative, too. If they continue, these trends will lead Democrats into long-term minority status. </p>\n\n<p>According to a recent Gallup <a href=\"https://news.gallup.com/poll/655157/gop-holds-edge-party-affiliation-third-straight-year.aspx?utm_source=gallup_brand&amp;utm_medium=email&amp;utm_campaign=front_page_3_january_01212025&amp;utm_term=information&amp;utm_content=image_imagelink_1\" rel=\"noreferrer noopener\" target=\"_blank\">poll</a>, for the third year in a row, Republicans led Democrats among voters who identified with one of the two parties or leaned toward it. In 2024, the Republicans’ lead was 46-45 percent; in 2023, it was 45-43 percent and in 2022, it was 45-44 percent. </p>\n<p>Prior to these three years, the last time Gallup found Republicans leading in this metric was 1991; the last time Republicans were even tied was 2011.</p>\n<p>If this is bad news for Democrats, there’s still worse. <a href=\"https://news.gallup.com/poll/655190/political-parties-historically-polarized-ideologically.aspx?utm_source=gallup_brand&amp;utm_medium=email&amp;utm_campaign=front_page_3_january_01212025&amp;utm_term=information&amp;utm_content=full_story_textlink_7\" rel=\"noreferrer noopener\" target=\"_blank\">Gallup also found</a> that liberals are still America’s smallest ideological group — 25 percent of the public versus 37 percent conservatives and 34 percent moderates — even as Democrats become decidedly more liberal. In 2024, Gallup found that liberals comprised 55 percent of the party — an all-time high.</p>\n<p>Liberals’ rise within the Democrat party has been remarkably fast. Despite their stereotype, had never been a majority among Democrats until 2018. As recently as 2011, liberals were just 39 percent of Democrats; as recently as 2002, they were just 29 percent; in 1997, only 27 percent of Democrats were liberals. </p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>In just one generation, then, liberals have doubled their percentage within the Democratic Party. </p>\n<p>In politics, it is always dangerous to move away from the leading ideological group; it is even more so when you are moving so strongly toward the smallest ideological minority. Yet Democrats’ plight is worse still.</p>\n\n<p>Over the last three years, Republicans have made notable gains with many demographic groups — from 27 percent to 36 percent among Hispanics and from 12 percent to 17 percent among Blacks. However, their improvement from 33 percent to 39 percent of young voters is especially significant. Not only has this been a particularly strong Democrat bloc historically, but age cohorts exhibit a pattern of becoming more conservative over time.</p>\n<p>Presidential <a href=\"https://www.cnn.com/election/2024/exit-polls/national-results/general/president/0\" rel=\"noreferrer noopener\" target=\"_blank\">exit polling in 2024</a> showed that Kamala Harris’s largest lead among voters based on age was her 11-point margin among 18- to 29-year-olds. With 30 to 44-year-olds, Harris’s lead was just four points. And among 45 to 64-year-olds and 65-and-older voters, she lost.</p>\n<p>The danger in losing ground among younger voters now is that when this group moves up the age scale, they could become even more conservative than voters in today’s older cohorts — groups Democrats are already losing.  </p>\n<div class=\"civic-science-article-container civic-science-more-14 civic-is-mr3\" data-civicscience-widget=\"3f127ebd-287e-0b64-a901-d55ec286348a\" id=\"civsci-id-civsci-id-596708068\"></div>\n<p>In essence, Democrats need big majorities among younger voters to offset later future losses as they age. And older cohorts are especially important, because they comprise such a large portion of the electorate: in 2024, those 45 and older were 63 percent of voters, while those 18-44 were just 37 percent.</p>\n<p>Democrats find themselves stuck between two negative trends: increasingly dependent on America’s smallest ideological minority for support, while their most supportive age cohort is less liberal and likely to become even more conservative.</p>\n<p>Obviously, the political answer for Democrats is to become more moderate. But as recent actions show, they’re not budging from their losing leftist ideology. If anything, they’re becoming more adamantly liberal.</p>\n\n<p>An early example came right after Trump’s victory when Democratic <a href=\"https://www.nbcnews.com/politics/2024-election/democratic-governors-vow-protect-states-trump-policies-rcna179295\" rel=\"noreferrer noopener\" target=\"_blank\">officials</a> pronounced resistance to the incoming Trump administration — on actions like <a href=\"https://www.politico.com/news/2024/11/23/democrat-attorneys-general-trump-mass-deportations-00191332\" rel=\"noreferrer noopener\" target=\"_blank\">illegal immigration</a>, <a href=\"https://earth.org/us-states-poised-to-lead-the-way-on-climate-during-second-trump-term/\" rel=\"noreferrer noopener\" target=\"_blank\">environmental extremism</a> and <a href=\"https://www.fox32chicago.com/news/pritzker-vows-illinois-boost-sex-changes-trump-victory\" rel=\"noreferrer noopener\" target=\"_blank\">transgender surgeries</a> on children. The same indication has manifested itself in two early House votes.</p>\n<p>The first was the <a href=\"https://www.congress.gov/bill/119th-congress/senate-bill/5\" rel=\"noreferrer noopener\" target=\"_blank\">Laken Riley Act</a>, to strengthen law enforcement’s hand against illegal immigrants who commit crimes. Although it passed on Jan. 25 with bipartisan support, only 23 percent of House Democrats voted for it. The second was the Protection of Women and Girls in Sports Act, which <a href=\"https://clerk.house.gov/Votes/202512\" rel=\"noreferrer noopener\" target=\"_blank\">passed Jan. 14</a> with only two of 215 Democrats voting for it.</p>\n<p>The reason for Democrats’ seemingly oblivious political positioning is clear from the earlier <a href=\"https://news.gallup.com/poll/655190/political-parties-historically-polarized-ideologically.aspx?utm_source=gallup_brand&amp;utm_medium=email&amp;utm_campaign=front_page_3_january_01212025&amp;utm_term=information&amp;utm_content=full_story_textlink_7\" rel=\"noreferrer noopener\" target=\"_blank\">polling data</a>. Liberals make up 55 percent of their supporters; moderates are only 34 percent and self-identified conservatives only 9 percent. Democrats cannot just walk away from politically poor liberal positions because the liberal majority in their party will not let them.</p>\n\n<p>Democrats’ problems are deeper than they seem. It is one thing to lose an election. It is another altogether to lose an electorate. Democrats’ current trajectory leads toward long-term minority status. And it’s not clear who or what could pull their own majority back from the brink or their party away from its base.</p>\n<p><em>J.T. Young is the author of the <u><a href=\"https://amplifypublishinggroup.com/author/james-t-young/\" rel=\"noreferrer noopener\" target=\"_blank\"><em>recent </em>book</a></u>, “Unprecedented Assault: How Big Government Unleashed America’s Socialist Left” from RealClear Publishing. He has over three decades’ experience working in Congress, the Department of Treasury, the Office of Management, and Budget, and representing a Fortune 20 company.</em></p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/opinion/campaign/5123096-democrats-ideological-shift/",
            "pub_date": "2025-02-05 01:01:09",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5125374,
            "title": "Neo-Nazi group leader convicted of planning to attack Maryland power grid",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>Brandon Russell, the founder of a Florida-based neo-Nazi group, was convicted on Monday of conspiring to plan an attack on Maryland’s power grid.</p>\n<p>Russell encouraged his former girlfriend Sarah Beth Clendaniel, of Maryland, to carry out various “sniper attacks” on electrical substations near Baltimore, The Associated Press reported.</p>\n\n<p>Prosecutors allege the attacks could have caused damage to the region’s power grid and were intended to cause chaos in the majority-Black city to further Russell’s “racially or ethnically motivated violent extremist beliefs.”</p>\n<p>“Hate-fueled violence has no place in a civilized society. Brandon Russell went well beyond his First Amendment rights, orchestrating a terrorist plot that would have harmed thousands of innocent people,” Erek L. Barron, a U.S. Attorney for the District of Maryland said in a Department of Justice release.</p>\n<p>Russell was convicted of one count of conspiracy to damage an energy facility. He was convicted in U.S. District Court in Baltimore after the jury deliberated for less than an hour.</p>\n<p>Russell and Clendaniel were arrested in 2023 before an attack was carried out, but prosecutors accused them of “taking steps” to fulfill their threats.</p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>Russell, who appeared cheerful throughout the trial, co-founded the neo-Nazi group Atomwaffen Division, which is German for “atomic weapon,” the AP reported.</p>\n<p>Russell’s attorney said the defendant was in Florida and had no plans to travel to Maryland to carry out the attack.</p>\n\n<p>It wasn’t Russell’s first law enforcement encounter. In 2017, he pleaded guilty to possession of an unregistered destructive device and improper storage of explosive materials after police searched his home and found neo-Nazi materials.</p>\n<p>Clendaneil pleaded guilty last May and <a href=\"https://thehill.com/policy/energy-environment/4901399-prison-sentence-white-supremacist-grid-attack-plot/\">was sentenced</a> to 18 years in prison for the conspiracy.</p>\n<p>The plot by the pair is one of several by far-right extremist groups that aim to target electrical grids. While none have come to fruition, there are <a href=\"https://thehill.com/policy/energy-environment/4869943-extremists-attempt-attacks-electrical-infrastructure/\">real vulnerabilities within the grid</a> that could be taken advantage of and cause serious damage to the grid and human life.</p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/policy/energy-environment/5125374-neo-nazi-group-leader-convicted-conspiracy-maryland-power-grid/",
            "pub_date": "2025-02-05 00:55:51",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5125559,
            "title": "Watch live: Cassidy to discuss vote to advance RFK Jr.",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<p>Sen. Bill Cassidy (R-La.) is set to explain his vote to advance Robert F. Kennedy Jr.’s nomination to serve as Health and Human Services secretary.</p>\n<p>Cassidy cast the key vote earlier Tuesday during a Senate Finance Committee hearing. The nomination will now soon be considered by the full Senate.</p>\n<p>The Louisiana Republican, a physician who voted to convict President Trump in his 2021 impeachment trial, had publicly fretted over his vote, describing it as difficult. </p>\n<p>In a statement after the vote, Cassidy said he had “intense conversations” with Kennedy over the weekend and even this morning, and said he also spoke with Vance. </p>\n<p>“With the serious commitments I’ve received from the administration and the opportunity to make progress on the issues we agree on like healthy foods and a pro-American agenda, I will vote yes,” Cassidy said.</p>\n<p>He’s set to give a speech on the Senate floor Tuesday.</p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/homenews/5125559-watch-live-cassidy-to-discuss-vote-to-advance-rfk-jr/",
            "pub_date": "2025-02-05 00:55:51",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5125231,
            "title": "Few prominent political figures viewed favorably: Gallup",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>Americans are more likely to view the <a data-id=\"https://thehill.com/homenews/campaign/5055295-political-winners-losers-2024-election/\" data-type=\"link\" href=\"https://thehill.com/homenews/campaign/5055295-political-winners-losers-2024-election/\">nation’s top politicians</a> in an unfavorable light than a favorable one, according to a new survey.</p>\n<p>In the Gallup poll, <a data-id=\"https://news.gallup.com/poll/656111/few-major-political-figures-rated-positively-balance.aspx\" data-type=\"link\" href=\"https://news.gallup.com/poll/656111/few-major-political-figures-rated-positively-balance.aspx\">released Tuesday</a>, respondents were asked about their view of 14 well-known political figures from the White House to Congress to President Trump’s <a data-id=\"https://thehill.com/homenews/administration/5099360-trump-cabinet-nominees/\" data-type=\"link\" href=\"https://thehill.com/homenews/administration/5099360-trump-cabinet-nominees/\">picks to fill his Cabinet</a> and administration. </p>\n\n<p>The survey takers were largely split on their <a data-id=\"https://thehill.com/homenews/administration/5093247-donald-trump-agenda-personality-survey/\" data-type=\"link\" href=\"https://thehill.com/homenews/administration/5093247-donald-trump-agenda-personality-survey/\">support for Trump</a>, with 48 percent having a favorable opinion of the president. Roughly 50 percent held the opposite view, the poll shows. Another 2 percent did not have an opinion on the commander-in-chief.</p>\n<p>Trump, Vice President Vance, House Speaker Mike Johnson (R-La.), Senate Majority Leader John Thune (R-S.D.), Tulsi Gabbard — the president’s <a data-id=\"https://thehill.com/homenews/senate/5119772-white-house-tulsi-gabbard-confirmation-hearing/\" data-type=\"link\" href=\"https://thehill.com/homenews/senate/5119772-white-house-tulsi-gabbard-confirmation-hearing/\">pick to lead national intelligence</a> — and tech billionaire Elon Musk all received similar ratings, per the survey.</p>\n<p>Secretary of State Marco Rubio, House Minority Leader Hakeem Jeffries (D-N.Y.) and Robert F. Kennedy Jr., Trump’s <a data-id=\"https://thehill.com/homenews/senate/5123633-kennedy-nomination-advances/\" data-type=\"link\" href=\"https://thehill.com/homenews/senate/5123633-kennedy-nomination-advances/\">nominee to head</a> the Department of Health and Human Services (HHS).  each garnered more favorable ratings, about 7 or 8 percent higher, than unfavorable ones, in the latest poll.</p>\n<p>At least one in four adults in the U.S. said they did not know Jeffries or Rubio well enough to have a favorable opinion. Almost half said the same about Thune and Gabbard, the data shows.</p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>Among those featured in the survey, Trump holds the highest favorability rating at 48 percent. His 50 percent unfavorable rating is also one of the highest, falling just below Speaker Emerita Nancy Pelosi (D-Calif.), 56 percent, and former Vice President Harris’s 53 percent.</p>\n<p>Kennedy brought in the second highest favorability rating in the survey, with 46 percent. Musk trails slightly with 43 percent favorability, followed by Vance and Harris, who are tied with 42 percent.</p>\n\n<p>Among the listed figures, the poll shows that Defense Secretary Pete Hegseth, Gabbard and Thune are relatively unknown, while Trump, Harris, Pelosi and Musk are much more widely recognized.</p>\n<p>The Gallup survey was conducted from Jan. 21-27 among 1,001 respondents. It has a margin of error of plus or minus 4 percentage points. </p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/blogs/blog-briefing-room/5125231-political-figures-favorability-ratings-gallup/",
            "pub_date": "2025-02-05 00:50:58",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5125278,
            "title": "Netanyahu has failed the Oct. 7 hostages — Trump must save them ",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>Four hundred eighty-six days ago, my three-year-old great-niece Abigail watched Hamas terrorists brutally murder her parents. Then she was kidnapped and disappeared into Gaza for 51 days.</p>\n<p>From the moment I learned Abigail had been taken, I vowed to do everything possible to bring her home and fight for the release of all the 246 people <a href=\"https://www.wsj.com/world/middle-east/hamas-hostages-israel-gaza-41432124\" rel=\"noreferrer noopener\" target=\"_blank\">stolen on Oct. 7, 2023</a> — many of them taken in their pajamas from their beds.</p>\n\n<p>I’ve shared Abigail’s tragic story in media interviews, with world leaders, and in meetings across the globe. I’ve shown them her photo, her striking brown eyes filled with innocence. Every day, I looked into those eyes, making the promise to do everything I could to bring her home. </p>\n<p>A few weeks after Oct. 7, I was in Washington, meeting with six female Republican senators. I asked them to be Abigail’s voice since her parents were gone. Sen. Susan Collins (R-Maine) took Abigail’s photo and showed the world what the face of a hostage looked like — her face, her eyes.</p>\n<p>I met with President Biden and members of his administration — CIA Director Bill Burns, Defense Secretary Lloyd Austin, national security adviser Jake Sullivan, Secretary of State Antony Blinken, special envoy Brett McGurk and other key leaders on Capitol Hill. I watched as tears welled in the eyes of these powerful men as I shared Abigail’s story. In their eyes, I saw not just empathy, but the weight of the responsibility they carried in that moment. </p>\n<p>I sat in Doha with Prime Minister Mohammed bin Abdulrahman Al-Thani after Abigail’s release. As I shared the details of her kidnapping and freedom, I watched this powerful leader, a father himself, wipe away tears, moved by the depth of Abigail’s tragedy. </p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>By November 2023, Abigail and 104 other women and children <a href=\"https://www.cnn.com/2023/11/26/politics/abigail-edan-jake-sullivan-national-security-adviser-israel-gaza-hostages-cnntv/index.html\" rel=\"noreferrer noopener\" target=\"_blank\">had been released</a>, but the deal soon broke down. This left more than 100 others still trapped in Hamas’s grasp. A new deal was proposed, but there was <a href=\"https://apnews.com/article/israel-palestinians-hamas-war-news-06-24-2024-f5de2ed8288ac3cdb02c4e9e2fbaeda1\" rel=\"noreferrer noopener\" target=\"_blank\">no political will</a> from Prime Minister Benjamin Netanyahu or Hamas to sign it. It wasn’t until President Trump took charge that the push for hostages’ release gained real momentum. Even before his inauguration, he made it clear that the hostages must be freed, or there would be <a href=\"https://www.youtube.com/watch?v=7wee-nL08ZQ\" rel=\"noreferrer noopener\" target=\"_blank\">“hell to pay.”</a></p>\n<p>On Jan. 20, 2025, at Arena One in Washington, D.C., Trump’s special envoy, Steve Witkoff, <a href=\"https://www.youtube.com/watch?v=KPlg_N90jqw\" rel=\"noreferrer noopener\" target=\"_blank\">introduced the hostage families.</a> He vowed to bring every last one home. When I stepped onto the stage following Special Presidential Envoy for Hostage Affairs Adam Boehler, I saw a packed house and the Trump family. I looked into their eyes and saw both the pain for our suffering and the unwavering support for our cause. As I shook Trump’s hand, I simply said, “Thank you. I know you can bring all of our hostages home right away.” He met my gaze, nodded in agreement, and I knew at that moment that his commitment was real. </p>\n\n<p>Trump and Witkoff made possible <a href=\"https://www.state.gov/release-of-keith-siegel-and-hostages-in-gaza/\" rel=\"noreferrer noopener\" target=\"_blank\">the release</a> of nine women, five Thai workers, and four men — among them, 66-year-old American grandfather Keith Siegel. These individuals had endured nearly 500 days of torture and starvation but walked free.  </p>\n<p>I’ll never forget the terrified eyes of 29-year-old Arbel Yehud, pushed by angry, masked captors toward the Red Cross car after enduring months of isolation and suffering. Or the hollow gaze of Yarden Bibas, tortured by Hamas after losing his wife, Shiri, and their two small children. The image of Shiri’s panicked eyes, clutching Kfir and Ariel before being torn from their home, will haunt me forever. </p>\n<p>In Hostage Square in Israel, <a href=\"https://www.theguardian.com/world/2025/jan/25/they-survived-hell-israel-hails-the-homecoming-of-freed-female-soldiers\" rel=\"noreferrer noopener\" target=\"_blank\">crowds of Israelis gather</a> to celebrate the survivors’ homecomings. There are tears of joy, warm hugs and a feeling with each free person that hope for the release of all the hostages is alive. With this, we are all reminded that the fight continues. Over 80 hostages are <a href=\"https://www.pbs.org/newshour/world/excitement-and-anxiety-in-israel-over-expected-release-of-high-profile-male-hostages\" rel=\"noreferrer noopener\" target=\"_blank\">still in captivity</a>. Among them are two Americans: Sagui Dekel-Chen, a young father of three, and Edan Alexander, a 21-year-old who has been held for 486 days. </p>\n<div class=\"civic-science-article-container civic-science-more-14 civic-is-mr3\" data-civicscience-widget=\"3f127ebd-287e-0b64-a901-d55ec286348a\" id=\"civsci-id-civsci-id-596708068\"></div>\n<p>Recently, Edan’s grandmother Adva gave me a photo of him. I’ve looked at that photo countless times, and every time, it breaks me. In his eyes, I see my own young son — free to live his life, while Edan is still imprisoned, unable to experience the life my son takes for granted. </p>\n<p>In July 2024, Biden invited U.S. hostage families to <a href=\"https://www.axios.com/2024/07/12/families-us-hostages-gaza-ask-meet-netanyahu\" rel=\"noreferrer noopener\" target=\"_blank\">meet with him and Netanyahu.</a> During that meeting, I looked into both Biden’s sparkling blue eyes and Netanyahu’s steely ones, asking about their commitment to our families.  </p>\n<p>Biden pledged to do everything possible for the rapid release of the hostages. Netanyahu said the deal was close and that he was ready to sign it. But six months passed, and Netanyahu failed to follow through.  </p>\n\n<p>Hostages like American Hersh Goldberg Polin, who were on the list to be released, were <a href=\"https://abcnews.go.com/International/who-were-6-hostages-killed-gaza-funerals-israel-hersh-goldberg-polin/story?id=113322975\" rel=\"noreferrer noopener\" target=\"_blank\">executed in captivity</a>. Despite the promises, the agreement was never carried out, and innocent lives that could have been saved were lost. The prime minister told us the deal was “almost ready,” but it was never signed. </p>\n<p>Netanyahu <a href=\"https://www.nbcnews.com/politics/white-house/donald-trump-israeli-prime-minister-benjamin-netanyahu-meeting-rcna190449\" rel=\"noreferrer noopener\" target=\"_blank\">meets with Trump</a> at the White House today. I hope and pray that Trump looks him in the eye and says, “With my deal, not only will I ensure all the American hostages are released, but I will bring home every single hostage. Steve Witkoff and my team will stay in the region and work with the Qataris and Egyptians to ensure that Hamas releases every last hostage.”</p>\n<p>And I hope Trump continues, “I am the Deal Maker. If anyone goes back on the deal, there will be hell to pay.” </p>\n\n<p><em>Liz Hirsh Naftali is a hostage release advocate and humanitarian ambassador and author of </em><a href=\"https://www.amazon.com/Saving-Abigail-Abduction-Three-Year-Old-Hostage/dp/B0DGSQ6Q7N\" rel=\"noreferrer noopener\" target=\"_blank\"><em>“Saving Abigail”</em></a><em></em> </p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/opinion/international/5125278-hostage-release-trump-netanyahu/",
            "pub_date": "2025-02-05 00:45:55",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5125472,
            "title": "Higher education groups sue Trump over anti-diversity orders",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>Higher education groups are suing the Trump administration over its executive orders eliminating diversity, equity and inclusion (DEI) positions in government and his threatening the loss of funding to institutions over the issue.  </p>\n<p>The National Association of Diversity Officers in Higher Education and the American Association of University Professors, along with the city of Baltimore and a restaurant group, are asking the courts to block the implementation of the executive orders due to President Trump allegedly exceeding his authority under the Constitution.  </p>\n\n<p>The executive orders Trump signed seek to remove all DEI programs and positions from the federal government and institutions connected to the government that receive federal funding. </p>\n<p>“In the United States, there is no king. The President can exercise only those powers the Constitution grants to the executive, and only in ways that do not violate the rights the Constitution grants to the American people. In his crusade to erase diversity, equity, inclusion, and accessibility from our country, President Trump cannot usurp Congress’s exclusive power of the purse, nor can he silence those who disagree with him by threatening them with the loss of federal funds and other enforcement actions,” the suit reads.  </p>\n<p>Trump has threatened civil investigations and loss of funding to get institutions to comply and has called for investigation into DEI <a href=\"https://thehill.com/homenews/education/5103461-trump-anti-dei-colleges-universities-endowments/\" rel=\"noreferrer noopener\" target=\"_blank\">against schools with endowments over $1 billion</a>. </p>\n<p>The Department of Education and other agencies will have to recommend “appropriate measures to encourage the private sector to end illegal discrimination and preferences, including DEI.”   </p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>The Hill has reached out to the Justice Department for comment.  </p>\n<p>Dozens of employees with the Education Department have been <a href=\"https://thehill.com/homenews/education/5123000-education-department-dei-trump/\" rel=\"noreferrer noopener\" target=\"_blank\">put on administrative leave</a> due to Trump’s DEI executive orders, with the union representing the staffers saying many of them attended a DEI training hosted in 2019 during his first term.  </p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/homenews/education/5125472-higher-education-trump-anti-diversity-dei/",
            "pub_date": "2025-02-05 00:40:58",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5123881,
            "title": "Active seniors: America’s gerontocracy problem",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>The past three presidential inaugurations have set a dubious record: Each saw the oldest man in history sworn into America’s highest office.</p>\n<p>In 2017, Donald Trump, aged 70, became the oldest president to begin a term, comfortably surpassed in 2021 by 78-year-old Joe Biden. And when Trump took the oath of office again last month, he was 159 days older than Biden was four years ago.</p>\n\n<p>Biden’s age and cognitive condition were central elements of the early election campaign. They weighed so heavily that he was forced to withdraw from the race in July, clearing the path for Vice President Kamala Harris to take on Trump, who had attacked Biden relentlessly as “Sleepy Joe.”</p>\n<p>The issue was given additional piquancy by the public deterioration of Sen. Dianne Feinstein (D-Cali.), elected to a fifth term in 2018 at age 85. Within two years, rumors of her cognitive decline and short-term memory loss were ubiquitous. In early 2023, Feinstein announced she would not seek reelection and then spent two months in the hospital with shingles. Her absence from the Senate Judiciary Committee delayed a number of confirmation hearings. When Feinstein returned, she was visibly frail and dependent on staff, and she died in September at the age of 90. There was a general feeling that her public decline was both damaging and undignified.</p>\n<p>Meanwhile, there are serious anxieties about the lack of political engagement by younger voters. They often feel that mainstream politics neither represents nor serves them, and they consistently vote in smaller numbers than any other age group.</p>\n<p>Younger politicians, more in tune with the concerns of voters of the same age cohort, have often been seen as a solution. When Rep. Alexandria Ocasio-Cortez (D-N.Y.) won a House seat in 2018, she was at 29 the youngest woman ever elected to Congress, with star power and a potent platform.</p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>While Trump is the oldest president ever sworn into office, 40-year-old Vice President JD Vance is the third-youngest to take on the role (after John Breckinridge, James Buchanan’s running mate, and Richard Nixon). Trump has also nominated relatively young candidates for major executive branch roles: Secretary of Defense Pete Hegseth is 44; Tulsi Gabbard, the nominee for director of National Intelligence, is 43; and the presumptive ambassador to the United Nations is 40-year-old Elise Stefanik. The new White House Press Secretary, Karoline Leavitt, is 27.</p>\n<p>This leavening of youth stands out against a stubborn backdrop of gerontocrats. Senate Judiciary Chair Chuck Grassley (R-Iowa) is 91. His colleague, Senate Foreign Relations Chair Jim Risch (R-Idaho) is 81. The ranking member of the latter committee, Sen. Jeanne Shaheen (D-N.H.), is 77. Senate Minority Leader Chuck Schumer (D-N.Y.) is 75 and his deputy, Sen. Dick Durbin (D-Ill.), is 80.</p>\n\n<p>In the executive branch, Linda McMahon, proposed as secretary of Education, is 76; Robert F. Kennedy Jr., nominee to run Health and Human Services, is 71; and Secretary of the Interior Doug Burgum is 68.</p>\n<p>This is partly a structural issue. The Senate relies heavily on seniority for leadership and committee assignments, an in-built bias towards older legislators. But choices are being made too: When House Democrats selected the ranking member of the Oversight Committee, Ocasio-Cortez lost out to Rep. Gerry Connolly (D-Va.), who will soon be 75.</p>\n<p>The ideal polity would strike a balance between hard-won experience and youthful vigor. The lack of youth engagement in the political process is a serious matter. We cannot simply roll our eyes: it is hardly surprising that some younger voters feel little affinity with a system in which the third man in the presidential order of succession is Grassley, who was born the same year President Franklin D. Roosevelt took office.</p>\n<div class=\"civic-science-article-container civic-science-more-14 civic-is-mr3\" data-civicscience-widget=\"3f127ebd-287e-0b64-a901-d55ec286348a\" id=\"civsci-id-civsci-id-596708068\"></div>\n<p>Some favor term limits for members of the House and, especially, the Senate. This would certainly increase turnover; nine of the 100 senators have served more than 25 years.</p>\n<p>Perhaps, though, that approaches the issue from the wrong end. While a few legislators and — one could argue — presidents outstay their welcome, the real problem is the dearth of younger leaders. Eighty-eight senators are over 50, while less than 10 percent of the House is under 40.</p>\n<p>Effective and legitimate legislative and executive branches should reflect a sense of the nation they serve, without needing to replicate it exactly. Turnout among voters aged 18 to 24 <a href=\"https://www.statista.com/statistics/1096299/voter-turnout-presidential-elections-by-age-historical/\" rel=\"noreferrer noopener\" target=\"_blank\">rose sharply</a> in the 2020 presidential election but <a href=\"https://circle.tufts.edu/2024-election#overall-youth-turnout-down-from-2020-but-strong-in-battleground-states\" rel=\"noreferrer noopener\" target=\"_blank\">fell back</a> in 2024; it remains the lowest of the age cohorts and well below the national average.</p>\n\n<p>Much has been made of the role of Barron Trump, the president’s 18-year-old son, in helping his father reach younger voters. He is said to have recommended Trump’s appearance on <a href=\"https://youtu.be/hBMoPUAeLnY?si=xRMUxeFK0ojG6fuz\" rel=\"noreferrer noopener\" target=\"_blank\">The Joe Rogan Experience</a>, which has a <a href=\"https://www.newsweek.com/donald-trump-joe-rogan-podcast-1975331\" rel=\"noreferrer noopener\" target=\"_blank\">strong following among young men</a>. You do not need to wear a MAGA hat to see the value in thinking differently about communicating with potential voters.</p><!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://thehill.com/submitting-opinion-content/\"><img alt=\"\" class=\"wp-image-4329764\" decoding=\"async\" height=\"121\" loading=\"lazy\" sizes=\"(max-width: 899px) 100vw, 600px\" src=\"https://thehill.com/wp-content/uploads/sites/2/2023/11/op2.png?w=600\" srcset=\"https://thehill.com/wp-content/uploads/sites/2/2023/11/op2.png?resize=600,121 600w, https://thehill.com/wp-content/uploads/sites/2/2023/11/op2.png?resize=300,61 300w, https://thehill.com/wp-content/uploads/sites/2/2023/11/op2.png?resize=50,10 50w\" width=\"600\"/></a></figure>\n<p>If younger people are not visible in politics, it is less likely that younger voters will engage, and the reverse is true. Whether term limits or informal persuasion within the parties is necessary to ease politicians into retirement when the time comes is a matter of taste, but it can be part of a broader shift. A larger cohort of able younger legislators and officials will exercise their own pressure from below.</p>\n<p>Politics should not feel like “Logan’s Run,” with men and women dispatched to the Carousel when they reach a certain age, but senescence cannot be the dominant feature either. If Vance moves to the Oval Office after Trump’s term, he would be the third-youngest president in history. Things can change quickly, but the next election is a long way away.</p>\n\n<p><em>Eliot Wilson is a freelance writer on politics and international affairs and the co-founder of Pivot Point Group. He was senior official in the U.K. House of Commons from 2005 to 2016, including serving as a clerk of the Defence Committee and secretary of the U.K. delegation to the NATO Parliamentary Assembly.</em></p>\n<script type=\"text/javascript\">window.NREUM||(NREUM={});NREUM.info={\"beacon\":\"bam.nr-data.net\",\"licenseKey\":\"bb199f70cb\",\"applicationID\":\"738543775\",\"transactionName\":\"MQNTMhdXDxECABBZDAhJchMWQg4PTBMLQxdIFl4VEQ==\",\"queueTime\":0,\"applicationTime\":1944,\"atts\":\"HURERF9NHE5BAkYKGBsb\",\"errorBeacon\":\"bam.nr-data.net\",\"agent\":\"\"}</script>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/opinion/campaign/5123881-active-seniors-americas-gerontocracy-problem/",
            "pub_date": "2025-02-05 00:31:07",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5125327,
            "title": "Climate change-fueled extreme weather could cost real estate market $1T+: Study",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>The impacts of climate change could cost real estate nearly $1.5 trillion in value, according to a <a href=\"https://firststreet.org/research-library/property-prices-in-peril\">study</a> published Monday by climate risk modeler First Street.</p>\n<p>Researchers write that climate change is both driving up insurance costs and affecting consumer preferences, which combined create a “feedback loop” where populations move in accordance with climate risk rather than existing property values. Insurance as a share of mortgage payments has soared over the past 10 years, going from around 8 percent in 2013 to 20 percent in 2022, according to the report.</p>\n<p>This is expected to throw a wrench into decades of growth in the Sun Belt region in particular, where three states — Texas, Florida and California — have comprised nearly half of all natural disaster-related costs over the past four decades. </p>\n<p>The report projects that more than 55 million Americans will move to less climate-vulnerable regions of the country over the next 30 years, including 5.2 million this year. During the same 30-year period, the report projects that 70,026 neighborhoods nationwide will lose property value due to climate-related vulnerabilities, a net loss of $1.47 trillion.</p>\n<p>The heaviest spikes in insurance premiums will be largely concentrated in the Sun Belt, according to the report, with Miami highest at 322 percent, followed by Jacksonville, Fla., with 226 percent and Tampa, Fla., with 213 percent. New Orleans, with a spike of 196 percent, is the only major metropolitan area outside the Sun Belt in the top five for premium increases.</p>\n<p>Insurers in particular have been increasingly reactive to the risks of climate change such as more intense wildfires and climate change. Major home insurers have recently pulled out of California and Florida, the latter of which also has high rates of fraud and litigation. California <a href=\"https://thehill.com/policy/energy-environment/5061625-california-insurers-regulations-high-risk-areas-coverage/\">enacted</a> a state regulation at the end of last year that will require insurers to offer coverage in wildfire-prone areas.</p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/policy/energy-environment/5125327-climate-change-real-estate-loss-study/",
            "pub_date": "2025-02-05 00:10:55",
            "source": "thehill",
            "language": "en"
        }
    ]
}