{
    "data": [
        {
            "id": 5753138,
            "title": "Falling crime and a strong border haven't lifted Trump's ratings — why not?",
            "description": "<blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\">\n<p>Stand in a grocery store checkout line, and the last few years show up on the receipt.</p>\n<p>Inflation has cooled dramatically from its peak. Economists are right about that. Prices are no longer rising at the pace they were two years ago. But the total at the bottom of the receipt still hits hard. Lower inflation means slower increases — not a return to earlier costs. Families reorganized budgets. They absorbed the shock, and the memory of strain remains.</p>\n<p>Now consider the broader picture. On paper, the shifts of the past year are significant. Inflation has fallen sharply. The stock market has returned to record territory. Unemployment remains historically low. Gas prices are down from the highs that rattled households.</p>\n<p>At the southern border, the operational reality looks markedly different from four years ago, when major enforcement policies were reversed and programs like “Remain in Mexico” were ended. At that time, incentives shifted, crossings surged and the system strained visibly. Americans watched images of overwhelmed facilities and chaotic crossings and formed an impression that ran deep.</p>\n<p>Today, encounters are dramatically lower. Enforcement is much tighter. The border is more controlled than it has been in years. The difference is operational and measurable.</p>\n<p>Violent crime tells a similar story. After the pandemic-era spike that sent homicide rates soaring, national data and reporting from major metropolitan areas show one of the steepest year-over-year declines in decades. In several large cities, murders have fallen at double-digit rates. Lives that might have been lost were not. Neighborhoods that felt unstable are experiencing relief.</p>\n<p>These are consequential reversals. And yet presidential approval remains underwater.</p>\n<p>For President Trump, this disconnect between measurable progress and public approval reveals something deeper about how leadership is processed in modern America.</p>\n<p>The old equation was straightforward: Improve conditions, and voters will reward you. Restore order, and confidence will follow. Deliver economic stability, and approval rises.</p>\n<p>But that equation is no longer automatic.</p>\n<p>Most Americans are not blind to improvement. They understand the border is more controlled than during the period of peak disorder. They see crime statistics trending downward. They know inflation is no longer surging. But acknowledgment is not the same as trust. </p>\n<p>Instability leaves an imprint. Families adjust finances. Communities adapt to disruption. Voters form conclusions about competence and direction long before conditions stabilize. When order returns, it does not erase memory overnight.</p>\n<p>Then there’s tone. Trump isn’t merely a policy actor — he is a polarizing presence. Supporters view confrontation as strength. Opponents experience it as provocation. The intensity of opposition toward him is extraordinary, and his rhetoric has consistently supplied fuel for it.</p>\n<p>Tone does not negate policy gains, but it shapes whether those gains expand confidence beyond the base. Escalation energizes loyalty, but it rarely broadens trust.</p>\n<p>Republican leaders often operate within that same confrontational current. Democratic leaders face a different temptation: to treat improvement as irrelevant if acknowledging it risks validating an opponent. When border encounters drop sharply, the instinct is often to emphasize what remains broken rather than what has changed. When crime falls, the response is to question the data or shift focus elsewhere.</p>\n<p>Both instincts narrow the field. One mistakes intensity for persuasion. The other mistakes resistance for principle.</p>\n<p>The result is a paradox. A president can preside over falling homicide rates, sharply reduced border encounters, cooling inflation, and strong employment, and still struggle to expand approval beyond hardened lines.</p>\n<p>The improvements remain significant. Lower homicide rates save lives. Reduced border encounters alter operational realities. Cooling inflation eases pressure. Strong employment expands opportunity.</p>\n<p>But results do not interpret themselves.</p>\n<p>Leadership is not only about producing results. It’s about helping people make sense of them. It’s about connecting statistics to lived experience. It’s about projecting steadiness in posture as well as policy.</p>\n<p>In a polarized era, performance alone does not carry the day. Story matters more than statistics. For Republicans, that means translating policy wins into the language of stability rather than grievance and allowing governance, at least occasionally, to step out of campaign mode.</p>\n<p>For Democrats, it means competing on future vision rather than permanent alarm. When measurable improvements occur, acknowledging them strengthens credibility rather than weakening opposition.</p>\n<p>American history offers perspective. The country has endured volatility before. Markets rebound. Crime recedes. Border flows shift. Institutions adjust.</p>\n<p>The open question is whether leaders adjust with the same discipline. Progress matters. But today, people follow more than performance. They follow the story that helps them make sense of change, and the tone that tells them whether stability is real.</p>\n<p>Governing well remains essential. Helping a divided nation believe what has improved may be the harder task.</p>\n<p><em>Jeff Evans is a political consultant, leadership communications advisor, and author of </em><a href=\"https://www.amazon.com/Storytelling-Leadership-Influence-Leaders-Meaning-ebook/dp/B0GDQDYLJ9\" rel=\"noreferrer noopener\" target=\"_blank\">“<em>Storytelling for Leadership and Influence</em>.”</a></p>\n</blockquote>",
            "kind": 1,
            "link": "https://thehill.com/opinion/white-house/5753138-inflation-border-crime-leadership/",
            "pub_date": "2026-02-26 20:51:43",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5754969,
            "title": "Orban and Fico: Putin's NATO pawns",
            "description": "<p>Hungarian Prime Minister Viktor Orban — fighting for his political life ahead of Hungary’s April 12 elections — is once again attacking Ukraine.</p>\n<p>This time, he is callously blackmailing Ukrainian President Volodymyr Zelensky by <a href=\"https://www.reuters.com/business/energy/slovakia-threatens-stop-electricity-ukraine-unless-kyiv-resumes-piping-russian-2026-02-21/\" rel=\"noreferrer noopener\" target=\"_blank\">refusing to backstop Ukraine’s electrical grid</a> if needed, unless Kyiv agrees to let Russian oil flow once again through the Druzhba oil pipeline.</p>\n<p>Ukraine’s answer? It sent <a href=\"https://www.kyivpost.com/post/70609\" rel=\"noreferrer noopener\" target=\"_blank\">35-plus drones</a> 930 miles deep inside of Russia to strike the Kaleykino oil pumping facility — a critical node of the Druzhba pipeline — destroying multiple “pump lines and crude oil storage reservoirs.”</p>\n<p>Earlier, <a href=\"https://www.pbs.org/newshour/world/hungarys-foreign-minister-says-country-will-block-key-eu-loan-to-ukraine-until-russian-oil-shipments-resume\" rel=\"noreferrer noopener\" target=\"_blank\">Orban had threatened to block</a> a $106 billion European Union loan to Ukraine unless his demands were met.</p>\n<p>As the now-ubiquitous saying goes Hungary fooled around and found out. Four years into defending Ukraine, Zelensky does not have the patience to deal with a whiny Orban. Russian oil will not be flowing anytime soon to Hungary, nor to Slovakia where Robert Fico, the country’s prime minister, was making similar threats.</p>\n<p>As a result, Orban is in even more electoral trouble. His party <a href=\"https://www.bloomberg.com/news/articles/2026-02-25/orban-s-poll-support-crumbles-as-hungary-opposition-widens-lead?embedded-checkout=true\" rel=\"noreferrer noopener\" target=\"_blank\">poll numbers are plunging</a>. Tisza, a Hungarian political party started by Peter Magyar, is leading Orban’s governing Fidesz party 55 percent to 35 percent among decided voters, according to a new poll released yesterday. </p>\n<p>Desperate for a way out, Orban is now attempting to campaign against Zelensky instead of Magyar. He is accusing Ukraine of imposing an oil blockade on Hungary and Slovakia, as if it were happening in a vacuum. It isn’t.</p>\n<p>The Druzhba pipeline runs through Ukraine. When it was flowing, those oil sales to Budapest and Bratislava were funding Russian President Vladimir Putin’s war machine that was attacking Ukraine daily.</p>\n<p>“We will not give in to blackmail!” <a href=\"https://x.com/PM_ViktorOrban/status/2026662954679074851?s=20\" rel=\"noreferrer noopener\" target=\"_blank\">screeched Orban yesterday on X</a>. That is ironic, since Hungary has been blackmailing Ukraine, NATO and the European Union ever since Putin launched his invasion on Feb. 24, 2022.</p>\n<p>Orbán –– laughably –– is also trying to convince Hungarian voters that Ukraine is preparing kinetic strikes against “Hungary’s energy system.” He has ordered Hungarian troops deployed to “repel potential attacks” against energy infrastructure. Hungarian voters should be wary of a possible false-flag attack.</p>\n<p>But Ukraine is not at war with Hungary, even if the latter has been in a soft war against Ukraine benefiting Putin — if not at his behest. Soon after Putin’s 2022 invasion of Ukraine, Hungarian Foreign Minister Peter <a href=\"https://www.politico.eu/article/hungary-foreign-minister-peter-szijjarto-weapon-transit-ukraine/\" rel=\"noreferrer noopener\" target=\"_blank\">Szijjarto announced that Hungary</a> would not allow NATO to transit weapons and munitions via its territory to Ukraine. His excuse at the time was that Russia might target those deliveries inside of Hungary. </p>\n<p>That was nonsense, of course. Hungary is a NATO member-state and fully militarily protected by Article Five, the alliance’s collective defense guarantee.</p>\n<p>Not long after that, <a href=\"https://www.atlanticcouncil.org/blogs/new-atlanticist/hungary-has-approved-finland-joining-nato-but-its-delays-raise-deeper-concerns/\" rel=\"noreferrer noopener\" target=\"_blank\">Orban began to play games</a> over Finland and Sweden’s bids to join NATO in March 2022. He succeeded in delaying the process for nearly two years by effectively blackmailing the EU for economic concessions. </p>\n<p>Initially, in early 2023, we wrote it off as <a href=\"https://thehill.com/opinion/national-security/3868742-is-winning-not-an-option-in-ukraine/\" rel=\"noreferrer noopener\" target=\"_blank\">Orban being opportunistic</a> — just as Turkish President Recep Erdoğan was. Now, however, in retrospect, it feels far more nefarious.</p>\n<p>Orban’s words and actions — like Fico’s — are, wittingly or not, aiding and abetting Russia’s kinetic war against Ukraine and the <a href=\"https://www.csis.org/analysis/russias-shadow-war-against-west\" rel=\"noreferrer noopener\" target=\"_blank\">Kremlin’s ongoing hybrid war</a> against NATO.</p>\n<p>To that end, consider the totality of Orban’s actions. In December 2022, he <a href=\"https://www.euronews.com/business/2022/12/06/eu-ministers-delay-key-votes-on-tax-deal-and-ukraine-aid-over-hungary-impasse\" rel=\"noreferrer noopener\" target=\"_blank\">blocked an €18 billion EU aid package</a> for Ukraine. In May 2023, <a href=\"https://apnews.com/article/hungary-blocks-military-aid-ukraine-0f9108a3ca67440342feac3c03170507\" rel=\"noreferrer noopener\" target=\"_blank\">Hungary stopped</a> the disbursement of €500 million from the EU’s European Peace Facility.</p>\n<p>In December 2023, <a href=\"https://www.bbc.com/news/world-europe-67724357\" rel=\"noreferrer noopener\" target=\"_blank\">Orbán vetoed a €50 billion</a> aid package for Kyiv. In March 2025, he <a href=\"https://www.reuters.com/world/europe/hungary-pm-orban-financing-ukraine-would-ruin-europe-2025-03-07/\" rel=\"noreferrer noopener\" target=\"_blank\">refused to sign an EU statement</a> “voicing support for Ukraine.”</p>\n<p>Essentially, Orban has been Moscow’s man in Brussels. He hides behind economic excuses, claiming Europe cannot afford this war, as he champions Putin’s interests in the West.</p>\n<p>Nor has Orban been alone. Since his electoral victory in October 2023, Fico has acted as Orban’s “<a data-id=\"https://en.wikipedia.org/wiki/Mini-Me\" data-type=\"link\" href=\"https://en.wikipedia.org/wiki/Mini-Me\" rel=\"noreferrer noopener\" target=\"_blank\">mini-me</a>.” Later that same month, <a href=\"https://www.bloomberg.com/news/articles/2023-10-05/slovakia-freezes-state-military-aid-to-kyiv-after-election-upset\" rel=\"noreferrer noopener\" target=\"_blank\">Fico stopped all military aid</a> to Ukraine. In October 2024, <a href=\"https://www.politico.eu/article/nato-ukraine-slovakia-robert-fico-military-defense-alliance/\" rel=\"noreferrer noopener\" target=\"_blank\">Slovakia blocked Kyiv’s NATO</a> membership bid. </p>\n<p>One year later, Fico announced that Bratislava would not participate in any <a href=\"https://www.reuters.com/world/slovakia-will-not-be-part-eu-scheme-ukraines-military-needs-pm-fico-says-2025-10-26/\" rel=\"noreferrer noopener\" target=\"_blank\">EU financing of the war in Ukraine</a>. Then, earlier this week –– a day before the fourth anniversary of Putin’s invasion –– Fico announced that <a href=\"https://www.theguardian.com/world/2026/feb/23/eu-leaders-accuse-hungary-sabotaging-support-ukraine\" rel=\"noreferrer noopener\" target=\"_blank\">Slovakia was cutting emergency assistance</a> to Ukraine, including backstopping electricity.</p>\n<p>So let’s call them what they are: Putin’s pawns. Both central European leaders would gladly continue to crassly trade cheap Russian oil for Ukrainian lives. </p>\n<p>The historical irony is that both Hungary and Slovakia — when it was part of Czechoslovakia — learned what it is like to be invaded by Russia. In the last hundred years, it has happened to Hungary twice –– in 1944 and 1956 –– and once to Czechoslovakia in 1968, to crush what was known as the “<a href=\"https://www.britannica.com/event/Prague-Spring\" rel=\"noreferrer noopener\" target=\"_blank\">Prague Spring</a>.”</p>\n<p>It is time NATO and the EU to suspended Hungary’s and Slovakia’s memberships. Both countries are endangering the very alliances they are obligated to protect and are openly doing so to the benefit of Putin for cheap energy, if not more.</p>\n<p><em><a href=\"https://x.com/MCTothSTL\" rel=\"noreferrer noopener\" target=\"_blank\">Mark Toth</a> writes on national security and foreign policy.</em> <em><a href=\"https://x.com/JESweet2022\" rel=\"noreferrer noopener\" target=\"_blank\">Col. (Ret.) Jonathan Sweet</a> served 30 years as a military intelligence officer and led the US European Command Intelligence Engagement Division from 2012 to 2014.  They are the co-founders of INTREP360 and the <a href=\"https://intrep360.substack.com/\" rel=\"noreferrer noopener\" target=\"_blank\">INTREP360 Intelligence Report</a> on Substack.</em></p>",
            "kind": 1,
            "link": "https://thehill.com/opinion/national-security/5754969-slovakia-fico-hungary-orban-putin/",
            "pub_date": "2026-02-26 20:15:54",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5755283,
            "title": "Instagram launches new tool alerting parents about suicide, self-harm searches",
            "description": "<p>Instagram is launching a new tool that will alert parents if their teens repeatedly try to search for terms associated with suicide and self-harm on the platform.</p>\n<p>The tool, which will roll out in the U.S. and several other countries next week, will flag for parents if their children conduct multiple searches with phrases promoting suicide or self-harm or phrases that suggest they want to harm themselves, as well as terms like “suicide” and “self-harm.”</p>\n<p>Parents will receive the alerts via email, text or WhatsApp and through an in-app notification, in addition to being presented with the option to view resources about how to approach the topic with their teens, Instagram said in a blog post Thursday.</p>\n<p>“Our goal is to empower parents to step in if their teen’s searches suggest they may need support,” the company wrote. “We also want to avoid sending these notifications unnecessarily, which, if done too much, could make the notifications less useful overall.”</p>\n<p>Instagram underscored that the platform currently blocks searches clearly associated with suicide and self-harm, in addition to barring posts that promote or glorify suicide or self-harm and limiting the content that teens can see on these issues.</p>\n<p>The social media company also said it is building a similar parental alert system for some of its AI experiences, which would notify parents if their teens attempted to engage in conversations about suicide or self-harm with its AI.</p>\n<p>The latest teen safety tools come as tech firms face increased scrutiny over how they protect young users on their platforms.</p>\n<p>Instagram is currently on trial alongside Google’s YouTube in Los Angeles over allegations that they purposefully designed their products to addict children. Snap and TikTok, both initially part of the case, settled shortly before the trial got underway.</p>\n<p>The trial in Los Angeles is the first of several set to proceed this year as part of a pair of cases at the state and federal level that consolidated thousands of lawsuits brought by individuals, school districts and states against the social media companies.</p>\n<p>Amid the rise of AI, tech firms are also feeling the heat over whether they have sufficient protections in place for children using their AI chatbots. Several families have sued AI companies over the past year, alleging the products drove their children to self-harm or suicide.</p>",
            "kind": 1,
            "link": "https://thehill.com/policy/technology/5755283-instagram-launches-new-tool-alerting-parents-about-suicide-self-harm-searches/",
            "pub_date": "2026-02-26 20:15:54",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5756107,
            "title": "Trump keeps world guessing on Iran",
            "description": "<p><strong><em>Morning Report is The Hill’s a.m. newsletter. </em></strong><a href=\"http://www.thehill.com/signup\"><strong><em>Subscribe here</em></strong></a><strong><em>.</em></strong></p>\n<p>In today’s issue:</p>\n<p>▪ High-stakes Iran talks taking place in Geneva</p>\n<p>▪ FBI purge tied to Trump classified docs case</p>\n<p>▪ Hillary Clinton testifies in Epstein probe</p>\n<p>▪ Trump’s call to action for GOP</p>\n<p><strong>President Trump</strong> is pushing for a diplomatic solution with Iran while justifying the possibility of taking military action, keeping the international community on its toes about his ultimate plan.</p>\n<p>U.S. and Iranian negotiators are meeting again in Geneva, Switzerland, today for the third round of talks on restricting Iran’s nuclear program. The stakes are even higher for these discussions, as the clock is ticking on the president’s timeline for reaching a deal.</p>\n<p>Trump hasn’t publicly given a specific deadline for Iran to reach a deal or else face military force, but he said last week that he expected a deal should be attainable within 10 to 15 days, suggesting the U.S. would strike Iran if that couldn’t happen.</p>\n<p>He doubled down during his State of the Union address on his dual stance of hoping for diplomacy to prevail but being willing to attack. His warning that Iran is <a href=\"https://thehill.com/homenews/administration/5753940-iran-icbm-development-trump/\">developing long-range missiles</a> capable of reaching U.S. territory along with building up its nuclear capabilities following the U.S. strike last summer drew particular attention.</p>\n<p><em>“They’ve already developed missiles that can threaten Europe and our bases overseas, and they’re working to build missiles that will soon reach the United States of America,”</em> Trump said.<em> “After Midnight Hammer, they were warned to make no future attempts to rebuild their weapons program, and in particular nuclear weapons, yet they continue. They’re starting it all over.”</em></p>\n<p>Adding more pressure on Iran to strike a deal, the Treasury Department <a href=\"https://thehill.com/homenews/administration/5755158-us-iran-sanctions-oil-nuclear-program/\">imposed new sanctions</a> Wednesday on Iranian individuals, companies and ships accused of enabling the country’s illicit oil sales and ballistic missile program.</p>\n<p><strong>Vice President Vance</strong> <a href=\"https://thehill.com/homenews/administration/5754746-vance-us-seeks-iran-diplomacy/?tbref=hp\">reiterated the president’s position</a> during an interview with Fox News on Wednesday, saying the White House is pursuing the “preferred route of diplomacy.” But he warned the U.S. wants to reach a point where Iran “cannot threaten the world” with nuclear weapons.</p>\n<p><em>“I think most Americans understand that you can’t let the craziest and worst regime in the world have nuclear weapons. That’s what the president is accomplishing, that’s what the president has set as our goal,”</em> he said.</p>\n<p>Top Senate Democrats exiting a briefing hours before the State of the Union on Tuesday called on the administration to <a href=\"https://thehill.com/homenews/senate/5753437-trump-iran-military-strikes/\">present its case</a> to the American people for why striking Iran may be necessary.</p>\n<p>Questions remain about what kind of deal could be reached between the two sides.</p>\n<p>Trump during his first term removed the U.S. from the Joint Comprehensive Plan of Action, an agreement negotiated during the Obama administration to limit Iran’s enrichment of uranium, arguing it was a weak deal.</p>\n<p>Axios reported that special envoy <strong>Steve Witkoff</strong>, who will be present at the talks in Geneva, told a private gathering Tuesday that a deal with Iran <a href=\"https://www.axios.com/2026/02/25/witkoff-iran-deal-indefinite-geneva-talks\">must remain in effect indefinitely</a>, and not include “sunset provisions,” as the Obama-era deal did.</p>\n<p><em>“We start with the Iranians with the premise that there is no sunset provision. Whether we get a deal or not, our premise is: You have to behave for the rest of your lives,”</em> he said.</p>\n<p>Trump has used a diplomacy-or-force strategy with other countries, including Venezuela. He spoke with former Venezuelan leader <strong>Nicolás Maduro </strong>by phone in November and seemed to be pursuing diplomacy, before the U.S. conducted a stunning raid to capture him months later.</p>\n<p>The president often declines to give details about his foreign policy intentions, maintaining that it would be ill-advised to telegraph what the U.S. is planning.</p>\n<p>▪ <a href=\"https://thehill.com/policy/international/5755742-trump-iran-nuclear-threat/\">The Hill</a>:<em> Trump builds case for war with Iran ahead of pivotal talks.</em></p>\n<p>▪ <a href=\"https://www.nytimes.com/2026/02/26/us/politics/trump-iran-strike.html\" rel=\"noreferrer noopener\" target=\"_blank\">The New York Times</a>: <em>Iran strike could be symbolic.</em></p>\n<p>▪ <a href=\"https://thehill.com/?p=5755623/\">The Hill</a>: <em>Democrats conflicted on Trump’s Iran push.</em></p>\n<hr class=\"wp-block-separator has-alpha-channel-opacity\"/>\n<h2 class=\"wp-block-heading\">Smart Take with Blake Burman</h2>\n<p>Top negotiators between the U.S. and Iran are set to meet in Switzerland today. The talks come after Trump said in his State of the Union address that Iran won’t vow to end its nuclear weapons ambitions. Former U.N. Ambassador <strong>John Bolton</strong> says he thinks the talks won’t be fruitful. </p>\n<p>“I think the Iranian government is very worried about what may come next. They’re liable to say almost anything tomorrow in Geneva to try and buy more time to avoid a military strike,” Bolton <a href=\"https://thehill.com/video/bolton-on-trump%e2%80%99s-approach-to-cuba-iran/11556221/\" rel=\"noreferrer noopener\" target=\"_blank\">told me</a> Wednesday night. “I think this is an absolute waste of oxygen,” he added.</p>\n<p>The timing here could very well be crucial. The commander in chief last week said he thinks 10-15 days is “enough time” for Iran to reach a deal. U.S. military assets are on the move all across the Middle East. Now, the question becomes whether today’s talks can move the needle in any meaningful way.</p>\n<figure class=\"wp-block-image size-large\"><a href=\"https://thehill.com/video/bolton-on-trump%e2%80%99s-approach-to-cuba-iran/11556221/\"><img alt=\"\" class=\"wp-image-5755902\" decoding=\"async\" height=\"213\" loading=\"lazy\" sizes=\"auto, (max-width: 899px) 100vw, 384px\" src=\"https://thehill.com/wp-content/uploads/sites/2/2026/02/BlakeBurman_02252026_NewsNation.png?w=384\" srcset=\"https://thehill.com/wp-content/uploads/sites/2/2026/02/BlakeBurman_02252026_NewsNation.png?resize=384,213 384w, https://thehill.com/wp-content/uploads/sites/2/2026/02/BlakeBurman_02252026_NewsNation.png?resize=160,90 160w, https://thehill.com/wp-content/uploads/sites/2/2026/02/BlakeBurman_02252026_NewsNation.png?resize=300,166 300w, https://thehill.com/wp-content/uploads/sites/2/2026/02/BlakeBurman_02252026_NewsNation.png?resize=50,28 50w\" width=\"384\"/></a></figure>\n<p><em>Burman hosts “The Hill” weeknights, 6p/5c on NewsNation.</em></p>\n<hr class=\"wp-block-separator has-alpha-channel-opacity\"/>\n<h2 class=\"wp-block-heading\">3 Things to Know Today</h2>\n<ol class=\"wp-block-list\" start=\"1\">\n<li><strong>The Department of Justice said it is reviewing</strong> whether any documents from the Epstein files were <a href=\"https://www.wsj.com/us-news/law/doj-to-review-whether-epstein-files-about-trump-were-improperly-withheld-bc8af73c\" rel=\"noreferrer noopener\" target=\"_blank\">improperly withheld</a> from the public. That includes notes from an interview with a woman who made allegations against Trump.</li>\n<li><strong>Former Vice President Kamala Harris said she might run</strong> again for president in 2028. Her comments come as <a href=\"https://thehill.com/blogs/in-the-know/5754536-kamala-harris-2028/?tbref=hp\">speculation has mounted</a> around her future and as she has led in a few polls of a hypothetical Democratic field.</li>\n<li><strong>The Trump administration will pause </strong>certain Medicaid funding to Minnesota amid the <a href=\"https://thehill.com/policy/healthcare/5755651-vance-oz-minnesota-medicaid-funds-fraud/\">investigation of fraud</a> in the state. The president previously froze funding to child care providers in Minnesota.</li>\n</ol>\n<h2 class=\"wp-block-heading\">Leading the Day</h2>\n<figure class=\"wp-block-image size-large\"><img alt=\"\" class=\"wp-image-5755789\" decoding=\"async\" height=\"720\" loading=\"lazy\" sizes=\"auto, (max-width: 899px) 100vw, 876px\" src=\"https://thehill.com/wp-content/uploads/sites/2/2026/02/Leading-Hillary-Clinton_021826_AP_Rafiq-Maqbool.jpg?resize=1280,720\" srcset=\"https://thehill.com/wp-content/uploads/sites/2/2026/02/Leading-Hillary-Clinton_021826_AP_Rafiq-Maqbool.jpg 1400w, https://thehill.com/wp-content/uploads/sites/2/2026/02/Leading-Hillary-Clinton_021826_AP_Rafiq-Maqbool.jpg?resize=160,90 160w, https://thehill.com/wp-content/uploads/sites/2/2026/02/Leading-Hillary-Clinton_021826_AP_Rafiq-Maqbool.jpg?resize=300,169 300w, https://thehill.com/wp-content/uploads/sites/2/2026/02/Leading-Hillary-Clinton_021826_AP_Rafiq-Maqbool.jpg?resize=768,432 768w, https://thehill.com/wp-content/uploads/sites/2/2026/02/Leading-Hillary-Clinton_021826_AP_Rafiq-Maqbool.jpg?resize=1280,720 1280w, https://thehill.com/wp-content/uploads/sites/2/2026/02/Leading-Hillary-Clinton_021826_AP_Rafiq-Maqbool.jpg?resize=645,363 645w, https://thehill.com/wp-content/uploads/sites/2/2026/02/Leading-Hillary-Clinton_021826_AP_Rafiq-Maqbool.jpg?resize=320,180 320w, https://thehill.com/wp-content/uploads/sites/2/2026/02/Leading-Hillary-Clinton_021826_AP_Rafiq-Maqbool.jpg?resize=256,144 256w, https://thehill.com/wp-content/uploads/sites/2/2026/02/Leading-Hillary-Clinton_021826_AP_Rafiq-Maqbool.jpg?resize=512,288 512w, https://thehill.com/wp-content/uploads/sites/2/2026/02/Leading-Hillary-Clinton_021826_AP_Rafiq-Maqbool.jpg?resize=640,360 640w, https://thehill.com/wp-content/uploads/sites/2/2026/02/Leading-Hillary-Clinton_021826_AP_Rafiq-Maqbool.jpg?resize=876,492 876w, https://thehill.com/wp-content/uploads/sites/2/2026/02/Leading-Hillary-Clinton_021826_AP_Rafiq-Maqbool.jpg?resize=960,540 960w, https://thehill.com/wp-content/uploads/sites/2/2026/02/Leading-Hillary-Clinton_021826_AP_Rafiq-Maqbool.jpg?resize=50,28 50w\" width=\"1280\"/><figcaption class=\"wp-element-caption\">Former US Secretary of State Hillary Clinton speaks at the inaugural Mumbai Climate Week in Mumbai, Feb. 18, 2026. ( Rafiq Maqbool, Associated Press)</figcaption></figure>\n<p><strong>CLINTONS SET FOR DEPOSITION</strong>: Former Secretary of State <strong>Hillary Clinton</strong> is set to testify today before the House Oversight and Government Reform Committee in its investigation into <strong>Jeffrey Epstein</strong>, capping off a back-and-forth saga in which congressional Republicans threatened to hold her in contempt.</p>\n<p>The former first lady and former <strong>President Clinton</strong>, who is scheduled to speak with the panel Friday, will testify behind closed doors far from the halls of the Capitol, with committee members traveling to Chappaqua, N.Y., where the Clintons have a home, for the depositions. They will be the most high-profile figures to appear before the committee in its investigation so far.</p>\n<p>How much the committee will learn from their testimonies is unclear. Neither Clinton has been accused of any wrongdoing in relation to their ties to Epstein.</p>\n<p>The couple resisted the idea of appearing before the House panel, arguing they didn’t have any relevant information to share. They pointed to others who received subpoenas from the committee but were excused from testifying through the same argument.</p>\n<p>Oversight Chair <strong>James Comer</strong> (R-Ky.) rejected that argument and moved to <a href=\"https://thehill.com/homenews/house/5698621-clinton-contempt-house-oversight/\">hold the couple in contempt</a>. As the full House seemed likely to pass the contempt resolutions with support even from some Democrats, the Clintons <a href=\"https://thehill.com/homenews/administration/5721434-clintons-congressional-testimony-investigation/\">reversed course</a> and agreed to testify. The contempt effort was pulled thereafter.</p>\n<p>The Clintons called for their testimonies to take place in public, but Comer said the private depositions would go forward.</p>\n<p>Their appearances are taking place as others with ties to the disgraced financier face intensifying public scrutiny.</p>\n<p>Former Treasury Secretary <strong>Larry Summers</strong> announced Wednesday he would <a href=\"https://thehill.com/homenews/education/5754818-summers-epstein-ties-harvard-resigns/\">resign from his positions</a> at Harvard University and retire from his professorship at the end of the year. That came after disclosures from the Epstein files revealed Summers asked Epstein for romantic advice and made sexist remarks toward women to him.</p>\n<p>Summers stepped back from various public roles in the aftermath of the revelations but remained a tenured professor.</p>\n<p><strong>Bill Gates</strong> is also addressing criticism over his associations with Epstein, <a data-id=\"https://thehill.com/policy/healthcare/5754399-gates-epstein-affairs-apology/\" data-type=\"link\" href=\"https://thehill.com/policy/healthcare/5754399-gates-epstein-affairs-apology/\">apologizing for their relationship</a> at a town hall with staffers at the Gates Foundation on Tuesday. He said he never did nor saw anything “illicit” and did not spend any time with Epstein’s victims or the women around him.</p>\n<p>Advocates for the release of the Epstein files are continuing their push for greater disclosure despite the Department of Justice (DOJ) declaring last month that it had released the last batch of files required to be made public under the law.</p>\n<p>Multiple outlets have reported that dozens of FBI records are <a href=\"https://www.cnn.com/2026/02/24/us/epstein-files-trump-accuser-missing-files-invs\">seemingly missing</a> from the files, including interviews with a woman who made allegations against Trump.</p>\n<p>▪ <a href=\"https://thehill.com/homenews/house/5755536-clintons-depositions-epstein-investigation/\">The Hill</a>: <em>Clintons to appear for high-profile depositions.</em></p>\n<p>▪ <a href=\"https://www.cnbc.com/2026/02/25/epstein-files-richard-axel-quits-columbia-university-brain-institute.html\">CNBC</a>: <em>Nobel winner steps back from Columbia University over Epstein friendship.</em></p>\n<p><strong>FBI PURGE</strong>: Roughly 10 FBI employees have been fired as part of the agency’s ongoing purge of staff who were involved in the investigations into the president.</p>\n<p>Multiple outlets reported that those dismissed had worked on the probe into Trump’s retention of classified and sensitive documents at Mar-a-Lago. The news came after Reuters reported that the FBI had <a href=\"https://www.reuters.com/world/us/fbi-obtained-kash-patel-susie-wiles-phone-records-during-biden-administration-2026-02-25/\" rel=\"noreferrer noopener\" target=\"_blank\">subpoenaed the phone records</a> of now-FBI Director <strong>Kash Patel</strong> and now-White House chief of staff <strong>Susie Wiles</strong> when they were both private citizens in 2022 and 2023.</p>\n<p>The New York Times reported people with knowledge of the move said the 10 ousted FBI officials, some of whom are veteran agents, <a href=\"https://www.nytimes.com/2026/02/25/us/politics/patel-fbi-firings-trump-classified-records.html\" rel=\"noreferrer noopener\" target=\"_blank\">aren’t expected to be the last</a> ones dismissed. The outlet noted it remains unclear if the employees have been accused of any wrongdoing.</p>\n<p>Current and former officials told the Times the firings are likely to heighten growing resentment against Patel for removing rank-and-file employees without evidence of wrongdoing.</p>\n<p><strong>WHAT’S NEXT</strong>: The president heaped significant pressure onto congressional Republicans in his address Tuesday with his calls for action on legislation while the GOP still has unified control of the federal government.</p>\n<p>One of the key pieces of legislation Trump declared his support for was the SAVE America Act, which has been a centerpiece of conservative activism in recent weeks. The legislation would require individuals to provide documentation such as a birth certificate or passport to register to vote and a photo ID to cast a ballot nationwide.</p>\n<p>The bill has already passed in the House but is currently stalled in the Senate, where current rules require it to receive at least 60 votes to advance past a filibuster. With Democrats overwhelmingly opposed to it, the chances of that are slim.</p>\n<p>Some conservatives have pushed for Senate Majority Leader <strong>John Thune</strong> (R-S.D.) to get around that by changing Senate rules to return to a “talking filibuster,” under which Democrats would be required to speak continuously on the floor to delay a vote. Thune has brushed off that idea, saying that he doesn’t support it and there aren’t enough votes from Republicans to change it.</p>\n<p>But The Hill’s <a href=\"https://thehill.com/?p=5755667\">Al Weaver reports</a> Thune is under renewed pressure after Trump spoke extensively about his claims of voter fraud during his speech and specifically called on the Senate GOP leader to take action.</p>\n<p>Thune said he plans to bring the legislation up for a vote soon but couldn’t promise the result.</p>\n<p>Meanwhile, House Speaker <strong>Mike Johnson</strong> (R-La.) is also in a tough spot in the lower chamber with the new legislative proposals Trump made during the speech, including one to offer Americans who don’t have a retirement savings plan through their employer access to the same one that federal workers have.</p>\n<p>Treasury Secretary <strong>Scott Bessent</strong> said the proposal can <a href=\"https://thehill.com/policy/healthcare/5754278-bessent-trump-retirement-plans-reconciliation/\">advance through the budget reconciliation</a> process, which only requires a simple majority in the Senate rather than 60 votes.</p>\n<p>But Johnson may only have a narrow window to advance much of Trump’s legislative agenda with the midterms coming up and history suggesting the majority party is likely to lose seats in Congress in November, The Hill’s <a href=\"https://thehill.com/homenews/house/5755712-trump-state-of-the-union-johnson-reconciliation/\">Mike Lillis and Sudiksha Kochi report</a>.</p>\n<p>The chances of quickly bringing an end to the shutdown of the Department of Homeland Security (DHS) may also have narrowed after Trump urged Republicans to hold their ground in negotiations with Democrats. He called for a quick reopening of DHS as he’s showed no signs of being willing to yield to Democrats’ extensive demands for immigration enforcement reforms.</p>\n<p>▪ <a href=\"https://thehill.com/policy/healthcare/5754643-house-leader-affordability-crisis/?tbref=hp\">The Hill</a>: <em>House Dem leader says Trump speech ‘riddled with dirty rotten lies.’</em></p>\n<p>▪ <a href=\"https://thehill.com/homenews/house/5755666-ilhan-omar-guest-arrest/\">The Hill</a>: <em>Rep. <strong>Ilhan Omar</strong> (D-Minn.) says her guest was arrested during the address.</em></p>\n<p><strong>MEANS TESTING</strong>: The president’s nominee for U.S. surgeon general faced intense grilling on Capitol Hill on Wednesday over her qualifications to be the country’s top public health spokesperson.</p>\n<p><strong>Casey Means</strong> appeared before the Senate Health, Education, Labor and Pensions Committee about four months after her initial hearing was rescheduled because she went into labor hours before it was due to start. The sister of <strong>Calley Means</strong>, who is one of the top advisers to Health and Human Services Secretary <strong>Robert F. Kennedy Jr.</strong>, the Stanford School of Medicine graduate would be an unprecedented choice as surgeon general if she is confirmed.</p>\n<p>Casey Means didn’t complete her medical residency and doesn’t have an active medical license. She is a prominent social media influencer popular among those in the “Make America Healthy Again” movement.</p>\n<p>The hearing was contentious on several occasions, including when Means refused to say if she would encourage mothers to vaccinate their children against measles. Democrats also accused her of a conflict of interest through products she has endorsed online.</p>\n<p>Former surgeons general have spoken out against Means’s nomination, including the president’s own former surgeon general from his first term, <strong>Jerome Adams</strong>.</p>\n<p>The hearing also became heated during a confrontation between Sens. <strong>Markwayne Mullin</strong> (R-Okla.) and <strong>Bernie Sanders</strong> (I-Vt.) <a href=\"https://thehill.com/policy/healthcare/5754724-mullen-sanders-obamacare-clash/\">over the health care system</a> and the Affordable Care Act.</p>\n<p>▪ <a href=\"https://thehill.com/policy/healthcare/5755656-casey-means-senate-confirmation-hearing-takeaways/\">The Hill</a>: <em>Takeaways from the hearing.</em></p>\n<h2 class=\"wp-block-heading\">Where &amp; When</h2>\n<ul class=\"wp-block-list\">\n<li><strong>The president</strong> will participate in executive time at 9 a.m. He will have an intelligence briefing at 11 a.m. and participate in a private meeting at 3 p.m.</li>\n<li><strong>The House </strong>will convene at 9:30 a.m. for a pro forma session.</li>\n<li><strong>The Senate </strong>will meet at 10 a.m.</li>\n</ul>\n<h2 class=\"wp-block-heading\">Zoom In</h2>\n<figure class=\"wp-block-image size-large\"><img alt=\"\" class=\"wp-image-5755792\" decoding=\"async\" height=\"720\" loading=\"lazy\" sizes=\"auto, (max-width: 899px) 100vw, 876px\" src=\"https://thehill.com/wp-content/uploads/sites/2/2026/02/Zoom-In-Warner-Bros_120525_AP_Jae-C-Hong.jpg?resize=1280,720\" srcset=\"https://thehill.com/wp-content/uploads/sites/2/2026/02/Zoom-In-Warner-Bros_120525_AP_Jae-C-Hong.jpg 1400w, https://thehill.com/wp-content/uploads/sites/2/2026/02/Zoom-In-Warner-Bros_120525_AP_Jae-C-Hong.jpg?resize=160,90 160w, https://thehill.com/wp-content/uploads/sites/2/2026/02/Zoom-In-Warner-Bros_120525_AP_Jae-C-Hong.jpg?resize=300,169 300w, https://thehill.com/wp-content/uploads/sites/2/2026/02/Zoom-In-Warner-Bros_120525_AP_Jae-C-Hong.jpg?resize=768,432 768w, https://thehill.com/wp-content/uploads/sites/2/2026/02/Zoom-In-Warner-Bros_120525_AP_Jae-C-Hong.jpg?resize=1280,720 1280w, https://thehill.com/wp-content/uploads/sites/2/2026/02/Zoom-In-Warner-Bros_120525_AP_Jae-C-Hong.jpg?resize=645,363 645w, https://thehill.com/wp-content/uploads/sites/2/2026/02/Zoom-In-Warner-Bros_120525_AP_Jae-C-Hong.jpg?resize=320,180 320w, https://thehill.com/wp-content/uploads/sites/2/2026/02/Zoom-In-Warner-Bros_120525_AP_Jae-C-Hong.jpg?resize=256,144 256w, https://thehill.com/wp-content/uploads/sites/2/2026/02/Zoom-In-Warner-Bros_120525_AP_Jae-C-Hong.jpg?resize=512,288 512w, https://thehill.com/wp-content/uploads/sites/2/2026/02/Zoom-In-Warner-Bros_120525_AP_Jae-C-Hong.jpg?resize=640,360 640w, https://thehill.com/wp-content/uploads/sites/2/2026/02/Zoom-In-Warner-Bros_120525_AP_Jae-C-Hong.jpg?resize=876,492 876w, https://thehill.com/wp-content/uploads/sites/2/2026/02/Zoom-In-Warner-Bros_120525_AP_Jae-C-Hong.jpg?resize=960,540 960w, https://thehill.com/wp-content/uploads/sites/2/2026/02/Zoom-In-Warner-Bros_120525_AP_Jae-C-Hong.jpg?resize=50,28 50w\" width=\"1280\"/><figcaption class=\"wp-element-caption\">The Warner Bros. water tower is seen at Warner Bros. Studios in Burbank, Calif., Dec. 5, 2025. (Jae C. Hong, Associated Press file)</figcaption></figure>\n<p><strong>MONOPOLY QUESTIONS</strong>: The departure of the DOJ’s top antitrust official is raising scrutiny over the Trump administration’s approach to antimonopoly cases and controversial mergers.</p>\n<p><strong>Gail Slater</strong> announced earlier this month that she would <a href=\"https://thehill.com/homenews/administration/5735535-gail-slater-leaves-doj-antitrust/\">step down as the head</a> of the DOJ’s antitrust division amid tensions with other administration officials.</p>\n<p>Her initial selection to lead the division raised some alarms among Big Tech companies and other large corporations about aggressive antitrust enforcement, but attention is now turning to several high-profile deals after her resignation, The Hill’s <a href=\"https://thehill.com/policy/technology/5754590-trump-doj-antitrust-mergers-gail-slater/\">Dominick Mastrangelo and Julia Shapero report</a>.</p>\n<p><em>“It feels like the support for populist antitrust enforcement is kind of gone from the Trump administration. Slater was kind of seen as the leader of that philosophy and clearly that’s been pushed aside,”</em> said <strong>Owen Tedford</strong>, senior research analyst at Beacon Policy Advisors.</p>\n<p>One of the biggest pending mergers concerns Warner Bros. Discovery, which has reached a deal to be acquired by Netflix. Trump has criticized the deal, which has raised questions about Trump potentially meddling in the DOJ’s antitrust work.</p>\n<p>It comes as Paramount Skydance, which is owned by Trump ally<strong> David Ellison</strong>, is pursuing a bid for a hostile takeover of Warner Bros. Discovery. Ellison was a guest of Sen. <strong>Lindsey Graham</strong> (R-S.C.) at the State of the Union.</p>\n<p>Meanwhile, Netflix CEO <strong>Ted Sarandos</strong> will visit the White House on Thursday for meetings about the deal, <a href=\"https://www.politico.com/news/2026/02/25/netflix-sarandos-white-house-warner-00798285\" rel=\"noreferrer noopener\" target=\"_blank\">Politico reported</a>.</p>\n<p>The DOJ is also currently pursuing a case against Ticketmaster and its parent company, LiveNation, over allegations that it has blocked competition in the entertainment industry. The case is set to go to trial next week.</p>\n<p>And the DOJ may take up a massive merger in local news as Nexstar Media Group, which owns The Hill, <a href=\"https://thehill.com/homenews/senate/5732004-fcc-broadcast-ownership-nexstar-tegna-hearing/\">attempts to acquire</a> television group Tegna for $7 billion.</p>\n<p>▪ <a href=\"https://www.theverge.com/policy/883155/doj-antitrust-division-gail-slater-live-nation-ticketmaster-trial\">The Verge</a>: <em>Will Trump take on Ticketmaster?</em></p>\n<h2 class=\"wp-block-heading\">Elsewhere</h2>\n<figure class=\"wp-block-image size-large\"><img alt=\"\" class=\"wp-image-5755788\" decoding=\"async\" height=\"720\" loading=\"lazy\" sizes=\"auto, (max-width: 899px) 100vw, 876px\" src=\"https://thehill.com/wp-content/uploads/sites/2/2026/02/Elsewhere-Cuba_092921_AP_Ramon-Espinosa.jpg?resize=1280,720\" srcset=\"https://thehill.com/wp-content/uploads/sites/2/2026/02/Elsewhere-Cuba_092921_AP_Ramon-Espinosa.jpg 1400w, https://thehill.com/wp-content/uploads/sites/2/2026/02/Elsewhere-Cuba_092921_AP_Ramon-Espinosa.jpg?resize=160,90 160w, https://thehill.com/wp-content/uploads/sites/2/2026/02/Elsewhere-Cuba_092921_AP_Ramon-Espinosa.jpg?resize=300,169 300w, https://thehill.com/wp-content/uploads/sites/2/2026/02/Elsewhere-Cuba_092921_AP_Ramon-Espinosa.jpg?resize=768,432 768w, https://thehill.com/wp-content/uploads/sites/2/2026/02/Elsewhere-Cuba_092921_AP_Ramon-Espinosa.jpg?resize=1280,720 1280w, https://thehill.com/wp-content/uploads/sites/2/2026/02/Elsewhere-Cuba_092921_AP_Ramon-Espinosa.jpg?resize=645,363 645w, https://thehill.com/wp-content/uploads/sites/2/2026/02/Elsewhere-Cuba_092921_AP_Ramon-Espinosa.jpg?resize=320,180 320w, https://thehill.com/wp-content/uploads/sites/2/2026/02/Elsewhere-Cuba_092921_AP_Ramon-Espinosa.jpg?resize=256,144 256w, https://thehill.com/wp-content/uploads/sites/2/2026/02/Elsewhere-Cuba_092921_AP_Ramon-Espinosa.jpg?resize=512,288 512w, https://thehill.com/wp-content/uploads/sites/2/2026/02/Elsewhere-Cuba_092921_AP_Ramon-Espinosa.jpg?resize=640,360 640w, https://thehill.com/wp-content/uploads/sites/2/2026/02/Elsewhere-Cuba_092921_AP_Ramon-Espinosa.jpg?resize=876,492 876w, https://thehill.com/wp-content/uploads/sites/2/2026/02/Elsewhere-Cuba_092921_AP_Ramon-Espinosa.jpg?resize=960,540 960w, https://thehill.com/wp-content/uploads/sites/2/2026/02/Elsewhere-Cuba_092921_AP_Ramon-Espinosa.jpg?resize=50,28 50w\" width=\"1280\"/><figcaption class=\"wp-element-caption\">A Cuban flag from a Cuban Border Patrol boat flies as the Coast Guard Sentinel-class cutter Charles Sexton arrives to deliver Cuban deportees to the authorities at Orozco Bay in Artemisa, Cuba, in 2021. (Ramon Espinosa, Associated Press file)</figcaption></figure>\n<p><strong>CUBA CONFRONTATION</strong>: Four people aboard a U.S. speedboat have been shot and killed after a confrontation with Cuban border security officers, the island country’s Interior Ministry said Wednesday.</p>\n<p>The ministry said five border guards intercepted the speedboat about 1 nautical mile northeast of Cayo Falcones, in Villa Clara province. When the unit of guards approached the boat, the crew opened fire on them, injuring the commander of the Cuban vessel, according to the ministry.</p>\n<p>The four individuals were killed as a result of the incident, while six others on the speedboat were injured and are receiving medical assistance.</p>\n<p>The Cuban government is investigating, while Vance told reporters he received a briefing on the incident from Secretary of State <strong>Marco Rubio</strong>.</p>\n<p><em>“Certainly a situation that we’re monitoring, hopefully it’s not as bad as we fear it could be but can’t say more because I just don’t know more,”</em> Vance said.</p>\n<p>The shooting came as tensions have risen between the U.S. and Cuba in recent months, particularly in the aftermath of the raid to capture Maduro. The U.S. has placed trade restrictions on Cuba and warned it would punish other countries that provide the Cuban government with oil.</p>\n<p>▪ <a href=\"https://thehill.com/policy/international/5755310-massachusetts-democrats-press-trump-on-cuba-policy-amid-crisis/?tbref=hp\">The Hill</a>: <em>Massachusetts Democrats question Trump on Cuba policy.</em></p>\n<p>▪ <a href=\"https://thehill.com/?p=5755412\">The Hill</a>: <em>New volatile chapter in Mexico’s drug war.</em></p>\n<p><strong>OFFICIAL EXITING</strong>: A top Treasury official is reportedly <a href=\"https://www.washingtonpost.com/business/2026/02/25/sanctions-chief-treasury/\" rel=\"noreferrer noopener\" target=\"_blank\">leaving his position after raising issues</a> with the White House’s plan to crack down on alleged fraud in the Somali community in Minnesota.</p>\n<p>The Washington Post reported <strong>John Hurley</strong>, a Trump donor who has been serving as undersecretary of the Treasury for terrorism and financial intelligence, has told people in recent weeks he plans to leave.</p>\n<p>Hurley recently expressed concerns to the Treasury secretary about a project enhancing federal monitoring of international payments from the Minneapolis area, people familiar with the matter told the outlet.</p>\n<p>The president has railed against the alleged fraud and pointed the finger at the Somali community during his State of the Union address. The controversy became a key aspect of the standoff between federal and state officials as the Trump administration surged immigration enforcement agents in the area last month.</p>\n<p>Hurley pushed back on the report, telling the Post that his team has been the “tip of the spear pushing back to stop Somali fraud in Minnesota.”</p>\n<h2 class=\"wp-block-heading\">Opinion</h2>\n<ul class=\"wp-block-list\">\n<li><strong>8 years after Parkland, school safety still demands action from Congress</strong>, Reps. <a href=\"https://thehill.com/opinion/criminal-justice/5754105-school-safety-reform-congress/\">Jared Moskowitz (D-Fla.) and Brian Fitzpatrick (R-Pa.) and Tony Montalto write</a> in The Hill.</li>\n<li><strong>Congress must define a new 21st century tariff doctrine</strong>, <a href=\"https://thehill.com/opinion/international/5753118-21st-century-tariff-doctrine/\">Orit Frenkel writes</a> in The Hill.</li>\n</ul>\n<h2 class=\"wp-block-heading\">The Closer</h2>\n<figure class=\"wp-block-image size-large\"><img alt=\"\" class=\"wp-image-5755793\" decoding=\"async\" height=\"720\" loading=\"lazy\" sizes=\"auto, (max-width: 899px) 100vw, 876px\" src=\"https://thehill.com/wp-content/uploads/sites/2/2026/02/Closer-SOTU_022426_AP_Mark-Schiefelbein.jpg?resize=1280,720\" srcset=\"https://thehill.com/wp-content/uploads/sites/2/2026/02/Closer-SOTU_022426_AP_Mark-Schiefelbein.jpg 1400w, https://thehill.com/wp-content/uploads/sites/2/2026/02/Closer-SOTU_022426_AP_Mark-Schiefelbein.jpg?resize=160,90 160w, https://thehill.com/wp-content/uploads/sites/2/2026/02/Closer-SOTU_022426_AP_Mark-Schiefelbein.jpg?resize=300,169 300w, https://thehill.com/wp-content/uploads/sites/2/2026/02/Closer-SOTU_022426_AP_Mark-Schiefelbein.jpg?resize=768,432 768w, https://thehill.com/wp-content/uploads/sites/2/2026/02/Closer-SOTU_022426_AP_Mark-Schiefelbein.jpg?resize=1280,720 1280w, https://thehill.com/wp-content/uploads/sites/2/2026/02/Closer-SOTU_022426_AP_Mark-Schiefelbein.jpg?resize=645,363 645w, https://thehill.com/wp-content/uploads/sites/2/2026/02/Closer-SOTU_022426_AP_Mark-Schiefelbein.jpg?resize=320,180 320w, https://thehill.com/wp-content/uploads/sites/2/2026/02/Closer-SOTU_022426_AP_Mark-Schiefelbein.jpg?resize=256,144 256w, https://thehill.com/wp-content/uploads/sites/2/2026/02/Closer-SOTU_022426_AP_Mark-Schiefelbein.jpg?resize=512,288 512w, https://thehill.com/wp-content/uploads/sites/2/2026/02/Closer-SOTU_022426_AP_Mark-Schiefelbein.jpg?resize=640,360 640w, https://thehill.com/wp-content/uploads/sites/2/2026/02/Closer-SOTU_022426_AP_Mark-Schiefelbein.jpg?resize=876,492 876w, https://thehill.com/wp-content/uploads/sites/2/2026/02/Closer-SOTU_022426_AP_Mark-Schiefelbein.jpg?resize=960,540 960w, https://thehill.com/wp-content/uploads/sites/2/2026/02/Closer-SOTU_022426_AP_Mark-Schiefelbein.jpg?resize=50,28 50w\" width=\"1280\"/><figcaption class=\"wp-element-caption\">President Trump delivers the State of the Union address to a joint session of Congress in the House chamber at the U.S. Capitol in Washington, Feb. 24, 2026. (Mark Schiefelbein, Associated Press)</figcaption></figure>\n<p><em>And finally … </em>It’s Thursday, which means it’s time for the weekly news quiz!</p>\n<p>With the State of the Union speech last Tuesday, this week’s quiz will address your knowledge on the history of the speech and those who have given it.</p>\n<p>Be sure to email your responses to <strong>jgans@thehill.com</strong> — please add “Quiz” to your subject line. Winners who submit correct answers will receive deserved newsletter fame on Friday.</p>\n<p><strong>George Washington started the tradition of delivering remarks to Congress annually. But for more than 100 years, the State of the Union wasn’t a speech delivered to Congress but was given in writing to be read aloud. Which president restarted the speech custom?</strong></p>\n<p>1. Abraham Lincoln</p>\n<p>2. Woodrow Wilson</p>\n<p>3. Franklin Roosevelt</p>\n<p>4. John F. Kennedy</p>\n<p><strong>Trump broke the record for the longest State of the Union address on Tuesday, speaking for nearly 110 minutes. Whose record did he beat?</strong></p>\n<p>1. Jimmy Carter</p>\n<p>2. Ronald Reagan</p>\n<p>3. Bill Clinton</p>\n<p>4. Joe Biden</p>\n<p><strong>Which of these individuals did not deliver both a State of the Union and a response to the State of the Union on separate occasions?</strong></p>\n<p>1. Gerald Ford</p>\n<p>2. Ronald Reagan</p>\n<p>3. George H.W. Bush</p>\n<p>4. Joe Biden</p>\n<p><strong>Which Cabinet position has most commonly served as the designated survivor?</strong></p>\n<p>1. Veterans Affairs</p>\n<p>2. Housing and Urban Development</p>\n<p>3. Homeland Security</p>\n<p>4. Interior</p>",
            "kind": 1,
            "link": "https://thehill.com/newsletters/morning-report/5756107-trump-iran-geneva-talks/",
            "pub_date": "2026-02-26 19:55:40",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5755623,
            "title": "Democrats conflicted over Trump's Iran push",
            "description": "<p>Democrats in both chambers of Congress are conflicted over how to respond to President Trump’s deployment of military forces against Iran, with some open to launching limited strikes against the regime and others worried about triggering another war in the Middle East.</p>\n<p>Pro-Israel Democrats in particular see reasons for the administration to threaten military force to prevent Iran from acquiring a nuclear weapon capable of reaching Tel Aviv or U.S. bases in the region.</p>\n<p>Democrats who attended a classified briefing from Secretary of State Marco Rubio and CIA Director John Ratcliffe on Tuesday said the information they received about Iran is “very serious.”</p>\n<p>“I can’t talk about the briefing, it’s classified. But what they talked about is very serious, and the administration could come clean and tell the American people their goals,” Senate Democratic Leader Chuck Schumer (N.Y.) told reporters Wednesday.</p>\n<p>Sen. Tim Kaine (D-Va.) said that colleagues who attended the briefing appeared alarmed over what they heard from senior administration officials.   </p>\n<p>“I can tell from their facial expressions they’re nervous, but they’ve been discreet about what they’ve shared,” he said of members of the Gang of Eight who received the classified briefing on Iran this week.</p>\n<p>Trump told lawmakers at his State of the Union address on Tuesday evening that Iran is building a nuclear weapon that could soon have the range to hit targets in the United States.</p>\n<p>“They’ve already developed missiles that can threaten Europe and our bases overseas, and they’re working to build missiles that will soon reach the United States of America,” he said.</p>\n<p>He said that Iran has ignored U.S. warnings to cease development of a nuclear weapon after U.S. Air Force and Navy bombers struck three nuclear facilities in the country last year.</p>\n<p>“They want to start all over again and are at this moment again pursuing their sinister ambitions,” Trump said.</p>\n<p>Some centrist Democrats are keeping their options open, hoping to learn more about what national security threats the Pentagon is seeking to neutralize.</p>\n<p>“I’m trying to figure out the objective here, or what the president is trying to do next,” said Sen. Maria Cantwell (D-Wash.).</p>\n<p>Sen. Catherine Cortez Masto (D-Nev.) said Trump needs to make a direct appeal to Congress before launching military strikes.</p>\n<p>“I think he needs to come to us and give us his plan,” she said when asked about whether she would support a limited strike against Iran.</p>\n<p>On the other side of the Capitol, at least two House Democrats say they will oppose a bipartisan war powers resolution to curb Trump’s authority to deploy military forces against Iran without approval from Congress.</p>\n<p>Reps. Josh Gottheimer (D-N.J.) and Jared Moskowitz (D-Fla.), two staunch allies of Israel, argue that Trump should have broad power to confront Iran given its support for terrorist groups around the region and its push to attain nuclear weapons.</p>\n<p>“We know that Tehran is still pursuing a nuclear weapon and, since the June conflict, has moved aggressively to rebuild its ballistic missile capabilities — a direct threat to our brave service members and key democratic allies,” Gottheimer said in a joint statement with Republican Rep. Mike Lawler (N.Y.).</p>\n<p>Moskowitz told Jewish Insider that he doesn’t want to take any of Trump’s military options off the table.</p>\n<p>“I am not willing to preemptively tell the supreme leader that he has nothing to worry about, no reason to negotiate because you are totally safe, and that the people of Iran can’t depend on us,” Moskowitz said of the war powers resolution.</p>\n<p>But other Democrats fear any strike against Iran, which has a far stronger military than Venezuela — Trump’s previous target — could spiral into a broader regional conflict and result in a significant number of U.S. casualties.</p>\n<p>“Everything we know from what he said and what we’re hearing is that Donald Trump clearly did not learn the lessons about what happened in Iraq, where we lost about 7,000 Americans, hundreds of thousands of Iraqis and lost trillions of dollars,” said Sen. Chris Van Hollen (D-Md.).</p>\n<p>“He’s never put forward a rationale for why America should go to war against Iran because he doesn’t have one,” he added.</p>\n<p>Kaine, who has sponsored a Senate war powers resolution to prevent the Trump administration from going to war against Iran, says he hopes to bring the measure back to the floor for a vote soon.</p>\n<p>He said Trump’s claim that Iran poses an imminent threat to the United States and its allies is “completely inaccurate.”</p>\n<p>“Months ago, he was saying that Iran’s nuclear program was obliterated,” Kaine said, pointing to Trump’s claims after Operation Midnight Hammer targeted Iranian nuclear facilities in June.</p>\n<p>“We shouldn’t be sending our sons and daughters into a war in Iran. We do not need our kids going into another war in the Middle East,” he said.</p>\n<p>The Senate passed a war powers resolution during Trump’s first term to restrict the president’s use of military force against Iran without congressional approval. That measure passed by a vote of 55-45 in February 2020.</p>\n<p>Every Senate Democrat voted for that measure, along with eight Republicans — Sens. Lamar Alexander (Tenn.), Bill Cassidy (La.), Susan Collins (Maine), Mike Lee (Utah), Jerry Moran (Kan.), Lisa Murkowski (Alaska), Rand Paul (Ky.) and Todd Young (Ind.).</p>\n<p>Senate Democrats say it’s difficult to assess the threat Iran now poses to U.S national security because the Trump administration has provided little information to lawmakers to justify the recent buildup of naval forces in the Persian Gulf, the Arabian Sea, the Red Sea and the Mediterranean Sea.</p>\n<p>“First of all, I think they have to define what the objective is. We’ve had no real briefing, information or anything else. So it’s hard to justify something without rationale,” said Sen. Jack Reed (D-R.I.), the ranking member of the Senate Armed Services Committee.</p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/senate/5755623-democrats-divided-over-iran-response/",
            "pub_date": "2026-02-26 19:06:38",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5754758,
            "title": "Where redistricting battles stand in key states as midterms ramp up",
            "description": "<p>Several court challenges, roadblocks in Maryland’s upper chamber and a late special legislative session in Florida are injecting uncertainty into a handful of states looking to pass new congressional maps ahead of November’s midterms, as both Democrats and Republicans look to clinch the House majority. </p>\n<p>Democrats took major hits in Virginia and Maryland in recent weeks, with a Virginia judge blocking the party from moving forward with its April redistricting referendum, and the top Maryland Senate Democrat has made it clear he’s not interested in passing new lines.</p>\n<p>However, in a blow to the GOP, a federal court this week allowed Utah to utilize a map that could give Democrats a rare pickup opportunity this November. Meanwhile, Republicans in Florida will have one last bite at the apple in April, when the Legislature will convene in an effort to pass a GOP-favored map.</p>\n<p>These developments are playing out as several states, including Texas — which ignited the redistricting arms race last year— are set to start holding their primaries in the coming weeks. </p>\n<p>Here’s where redistricting stands in a handful of key states: </p>\n<h2 class=\"wp-block-heading\"><strong>Virginia</strong></h2>\n<p>The redistricting process in Virginia has become tumultuous as the party looks to pass a 10-1 Democratic gerrymander in the state, which currently has a 6-5 Democratic edge in its congressional delegation. </p>\n<p>Virginia Democrats were hoping to hold<strong> </strong>an April 21 referendum on new maps approved by the state House asking voters to allow the state to bypass its redistricting commission before 2030, when congressional lines were initially slated to be redrawn.</p>\n<p>A local judge last month, however, <a href=\"https://thehill.com/homenews/campaign/5709183-virginia-democrats-redistricting-ruling/\" rel=\"noreferrer noopener\" target=\"_blank\">blocked the party</a> from moving forward with its referendum, saying Democrats could not hold the election in time for the November midterms. The Virginia Supreme Court <a href=\"https://thehill.com/homenews/campaign/5737289-democrats-redistricting-referendum-virginia/\" rel=\"noreferrer noopener\" target=\"_blank\">ultimately allowed the Democrats to move forward</a> with its plans for a special election while litigation over the referendum works its way through the courts.</p>\n<p>But then, the local judge, Tazewell County Circuit Judge Jack Hurley Jr., threw another wrench in Democrats’ plans, when he temporarily blocked the referendum from proceeding after several national GOP groups <a href=\"https://thehill.com/regulation/court-battles/5747297-virginia-redistricting-referendum-blocked-tazewell-judge/\" rel=\"noreferrer noopener\" target=\"_blank\">pushed for an emergency injunction</a>.</p>\n<p>Democrats have signaled they intend to appeal that decision. The 2026 primary has already been pushed back from June until August amid Democrats’ redistricting push.</p>\n<h2 class=\"wp-block-heading\"><strong>Maryland</strong></h2>\n<p>Maryland Gov. Wes Moore (D) and national Democrats’ last-minute push for new House maps in the Old Line State has largely come up short.</p>\n<p>Democrats in the state’s lower chamber <a href=\"https://thehill.com/homenews/state-watch/5719665-maryland-democrats-redistricting-map/\" rel=\"noreferrer noopener\" target=\"_blank\">passed an 8-0 Democratic gerrymander</a> earlier this month, which teed up a November referendum asking voters if lawmakers can keep the congressional lines in place until after the 2030 U.S. census.  </p>\n<p>But efforts to convince Maryland Senate President Bill Ferguson (D), who’s remained  adamantly against mid-decade redistricting, have been unsuccessful.</p>\n<p>Ferguson has reason to be wary: The Democratic Party tried to usher through an 8-0 map after the 2020 U.S. census, but a court later struck it down in 2022 as a partisan gerrymander. </p>\n<p>“It takes at least three to four months for a trial-level court to play out, and then whatever decision happens likely leads to an appeal,” Ferguson told reporters last week, regarding potential litigation if Democrats were to push ahead with redistricting, <a href=\"https://marylandmatters.org/2026/02/20/ferguson-window-of-opportunity-has-closed-on-redistricting-efforts/\" rel=\"noreferrer noopener\" target=\"_blank\">according to Maryland Matters</a>. </p>\n<p>“We are not going to wait until June to reopen a filing deadline for new maps, new precincts, new local boards,” he added. </p>\n<p>Moore, however, <a href=\"https://thehill.com/homenews/state-watch/5751307-moore-vows-redistricting-maryland/\" rel=\"noreferrer noopener\" target=\"_blank\">has vowed to continue</a> his push for a new map even as the candidate filing deadline passed this week. The state currently has a 7-1 Democratic edge in its congressional delegation, with Rep. Andy Harris as the lone Maryland Republican. </p>\n<h2 class=\"wp-block-heading\"><strong>Utah</strong></h2>\n<p>Democrats in ruby-red Utah are poised to gain a new congressional seat after the state was forced to redraw its maps for the midterms.  </p>\n<p>Unlike redistricting efforts in Texas and California, where maps were redrawn to boost party margins, Utah’s new maps are the result of a court order. A state judge <a href=\"https://thehill.com/regulation/court-battles/utah-redistricting-court/\" rel=\"noreferrer noopener\" target=\"_blank\">last year tossed</a> GOP-drawn lines, ruling that state legislators <a href=\"https://thehill.com/homenews/state-watch/5489323-utah-redistricting-battle-democrats/\" rel=\"noreferrer noopener\" target=\"_blank\">had disregarded</a> partisan gerrymandering safeguards.</p>\n<p>The Utah GOP has fought hard to block the new map, which could offer Democrats a rare pickup opportunity — a blue-leaning district around Salt Lake County — in a state that voted for President Trump by more than 20 points in 2024 and where Republicans control all four congressional districts.  </p>\n<p>The Utah Supreme Court this month dismissed an effort to stay the map, and a federal panel this week <a href=\"https://thehill.com/regulation/court-battles/5751219-utah-court-rejects-gop-house-map/\" rel=\"noreferrer noopener\" target=\"_blank\">rejected another bid</a> that could have sent the maps back to the state Legislature, where Republicans hold a supermajority in both chambers.  </p>\n<p>Barring the possibility that the case makes its way to the U.S. Supreme Court, the maps are set to take hold for the midterms, with primaries set for June 23.  </p>\n<p>The Democratic National Committee hailed this week’s ruling as a “victory for fair representation” in Utah, while Republicans have panned the judge who kick-started the redistricting back-and-forth.  </p>\n<p>Meanwhile, Utah Republicans have <a href=\"https://thehill.com/homenews/campaign/5740222-utah-republican-redistricting-initiative/\" rel=\"noreferrer noopener\" target=\"_blank\">said they have the support</a> they need to put forward a ballot initiative in November that would effectively repeal the state’s independent redistricting commission.</p>\n<h2 class=\"wp-block-heading\"><strong>Florida</strong></h2>\n<p>Florida Republicans have signaled they hope to join the ranks of states that have redistricted to net their party more seats in the House ahead of the November midterms. </p>\n<p>A Florida House redistricting panel has already convened to start the process, and Florida Gov. Ron DeSantis (R) has called for a <a href=\"https://thehill.com/homenews/campaign/5677005-desantis-florida-redistricting-session/\" rel=\"noreferrer noopener\" target=\"_blank\">spring special legislative session</a> focused on redistricting in the Sunshine State. </p>\n<p>The session is expected to begin in April, as officials wait for a highly anticipated Supreme Court ruling over Louisiana’s congressional map and the Voting Rights Act, a decision DeSantis said could impact how any new lines are handled in Florida. </p>\n<p>Florida voters this month <a href=\"https://thehill.com/homenews/campaign/5725343-desantis-redistricting-challenge-florida/\" rel=\"noreferrer noopener\" target=\"_blank\">filed a petition</a> arguing that DeSantis doesn’t have the authority to order the state House to redraw maps, and experts expect additional legal obstacles could be on the horizon if the state moves forward.  </p>\n<p>Republicans currently have a 20-8 advantage in the state’s House congressional delegation, but redistricting could diminish Florida Democrats’ power even further by giving the GOP as many as <a href=\"https://thehill.com/homenews/campaign/5682775-florida-republicans-redistricting-threat/\" rel=\"noreferrer noopener\" target=\"_blank\">five more seats</a> for the midterms.   </p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/campaign/5754758-virginia-maryland-utah-florida-redistricting-update/",
            "pub_date": "2026-02-26 19:06:37",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5754590,
            "title": "Slater's departure at DOJ signals new era for antitrust under Trump",
            "description": "<p>The abrupt departure of the Department of Justice’s (DOJ) top antitrust enforcer is raising questions about the Trump administration’s approach to major anti-monopoly cases and controversial mergers.</p>\n<p>Gail Slater <a data-id=\"https://thehill.com/homenews/administration/5735535-gail-slater-leaves-doj-antitrust/\" data-type=\"link\" href=\"https://thehill.com/homenews/administration/5735535-gail-slater-leaves-doj-antitrust/\">announced her plans to resign</a> earlier this month after less than a year leading the DOJ’s antitrust division, marking an abrupt end to a tenure that was repeatedly plagued by tensions with top Trump officials.  </p>\n<p>Slater’s nomination spurred alarm among tech companies and other corporate giants, who faced aggressive antitrust enforcement during the first Trump administration.</p>\n<p>Now, with Slater on her way out, attention is turning to several high-profile deals awaiting Trump administration approval  — and the president’s own influence over antitrust policy.</p>\n<p>“It feels like the support for populist antitrust enforcement is kind of gone from the Trump administration. Slater was kind of seen as the leader of that philosophy and clearly that’s been pushed aside,” said Owen Tedford, a senior research analyst at Beacon Policy Advisors.  </p>\n<p>Previously a top adviser to Vice President Vance, Slater was confirmed as assistant attorney general for the antitrust division last spring.  </p>\n<p>Her nomination was one of several moves by the Trump administration that initially signaled a continuation of aggressive antitrust enforcement, particularly against major tech firms.</p>\n<p>Trump and his allies have repeatedly attacked major tech platforms and have warned that companies like Google and Meta have used their power to influence voters against conservatives, as Trump has warned with mainstream media companies.  </p>\n<p>In nominating Slater, Trump argued on social media that “Big Tech has run wild for years,” noting he was “proud to fight these abuses in my First Term, and our Department of Justice’s antitrust team will continue that work under Gail’s leadership.” </p>\n<p>Her unexpected exit came against a backdrop of increased consolidation of major American businesses and immediate tensions between Slater and top DOJ officials.  </p>\n<p>A $14 billion merger between Hewlett Packard Enterprise and Juniper Networks proved to be an early point of contention when two top antitrust officials were fired in July amid an internal dispute over the handling of that merger. </p>\n<p>While the DOJ initially sued to block the acquisition, it later settled the case, with Slater reportedly being overruled in the decision. </p>\n<p>One of the ex-officials, Roger Alford, later slammed senior DOJ leadership for allegedly allowing politically connected lobbyists to influence decisionmaking. </p>\n<p>“It felt like it was just reaching a boiling point where either Slater was going to have to perhaps relent on some of her personal political philosophies or go this route of deciding to leave the administration instead,” Tedford added. </p>\n<p>The DOJ’s antitrust division has several high-profile legal battles ahead.  </p>\n<p>The department is pursuing a case against Ticketmaster and its parent company, Live Nation, accusing the firms of blocking competition in the live entertainment industry, and that case is set to go to trial next week.  </p>\n<p>The department is also expected to consider several key deals that executives at some of the world’s largest media companies have been angling for in the coming months. </p>\n<p>Warner Bros. Discovery <a data-id=\"https://thehill.com/homenews/media/5754397-warner-bros-paramount-netflix-deal/\" data-type=\"link\" href=\"https://thehill.com/homenews/media/5754397-warner-bros-paramount-netflix-deal/\">struck a deal</a> late last year to sell its sprawling movie and television studios to Netflix, an agreement valued at more than $70 billion that has raised questions about the streamer’s growing market share and content production priorities.  </p>\n<p>President Trump has criticized the deal, and this week <a data-id=\"https://thehill.com/homenews/media/5750810-netflix-warner-brothers-ted-sarandos-trump-rice/\" data-type=\"link\" href=\"https://thehill.com/homenews/media/5750810-netflix-warner-brothers-ted-sarandos-trump-rice/\">urged Netflix</a> to fire Susan Rice, a longtime Democratic political operative who sits on the company’s board, over comments she made that were critical of his administration or the company would “face the consequences.”  </p>\n<p>Some observers say Trump meddling in such deals complicates the work of the DOJ’s antitrust division in a way not seen during previous administrations.  </p>\n<p>“Netflix leadership is saying this is a business deal not a political deal, but we’re entering uncharted territory here,” said Corey Martin, a corporate lawyer specializing in media deals. “It seems like everything [in the media sector] is becoming political whether we want it to or not.” </p>\n<p>The increased pressure on the Netflix-Warner Bros. Discovery deal comes as Paramount Skydance, the Hollywood behemoth owned by Trump ally David Ellison, mounts a hostile bid for the company’s entire portfolio, including its linear television assets like CNN.  </p>\n<p>Trump has said he would like to see CNN operate under new leadership and spoken glowingly about changes the Ellison family has implemented at Paramount.  </p>\n<p>The DOJ could also consider a <a data-id=\"https://thehill.com/homenews/senate/5732004-fcc-broadcast-ownership-nexstar-tegna-hearing/\" data-type=\"link\" href=\"https://thehill.com/homenews/senate/5732004-fcc-broadcast-ownership-nexstar-tegna-hearing/\">massive merger</a> in the local news business, where broadcaster Nexstar Media Group, which owns The Hill, is eyeing a $7 billion acquisition of fellow television group Tegna.  </p>\n<p>Reilly Steel, a professor of law at Columbia University, argued media mergers are the most consequential of any that Trump’s DOJ will consider soon.  </p>\n<p>“This is the way information is conveyed to the public. If you control the media, you control the informational environment and the narrative,” Steel said. “It has enormous implications for our democracy [more] than your standard consumer product markets.”   </p>\n<p>Several Democratic lawmakers have raised concerns about improper political influence at the DOJ on a range of issues.  </p>\n<p>In a letter to Attorney General Pam Bondi earlier this month, Sens. Cory Booker (D-N.J.) and Dick Durbin (D-Ill.) suggested Slater’s departure “reinforces a troubling pattern in which senior Antitrust Division officials appear to be sidelined when their enforcement decisions conflict with the interests of President Trump or his allies.” </p>\n<p>Without the former antitrust head, they warned that the case against Ticketmaster is at “extreme risk of political interference” and the agency’s review of the Warner Bros. deal is “vulnerable to undue influence at a critical moment.” </p>\n<p>Slater was replaced by Omeed Assefi, a former Trump White House official who served as Slater’s deputy during her time in the position and has taken over as acting assistant attorney general for antitrust. </p>\n<p>“She was seen as somebody who was going to uphold the rule of law and push back against the kind of favor courting model that has been prevailing at the DOJ with companies trying to grease their deals through with lobbying and appealing to Trump’s agenda,” noted Rebecca Haw Allensworth, a law professor at Vanderbilt University focused on antitrust issues. </p>\n<p>Now, Tedford suggested there may be “increasing acceptance of outside lobbying by Trump-connected ex-officials.” </p>\n<p>“I don’t know that any hire is a golden ticket, but there’s clearly some who are starting to build a track record of successfully working these agencies and getting deals through,” he said. </p>",
            "kind": 1,
            "link": "https://thehill.com/policy/technology/5754590-trump-doj-antitrust-mergers-gail-slater/",
            "pub_date": "2026-02-26 19:06:37",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5755981,
            "title": "Whitmer defends trans rights after Trump SOTU: 'No matter who comes after you, I'll stand in the way'",
            "description": "<p>Michigan Gov. Gretchen Whitmer (D) on Wednesday defended transgender rights in her State of the State address, a day after President Trump criticized gender transition in his State of the Union address.</p>\n<p>“In Michigan, everyone deserves to be who they are and love who they love. I want to take a moment and speak directly to our gay and trans neighbors, family and friends: I want you to know that you are welcome in Michigan,” Whitmer said in <a href=\"https://www.youtube.com/watch?v=9KQRmHPd0iE\">her address.</a></p>\n<p>“You belong, you matter, and no matter who comes after you, I’ll stand in the way. In Michigan, we look out for each other. That’s why I’ll always fight for your freedom and your safety, and I’ll veto any legislation that diminishes your humanity. I got your back,” she added.</p>\n<p>Whitmer’s words stand in contrast to comments from Trump a day before, in which he lambasted the concept of gender transition for children, a topic that has been heavily criticized by the right.</p>\n<p>“Surely we can all agree, no state can be allowed to rip children from their parents’ arms and transition them to a new gender against the parents’ will. Who would believe that we’re even talking about it? We must ban it, and we must ban it immediately,” Trump said.</p>\n<p>Trump signed an executive order on his first day back in office last year to recognize male and female as the only sexes and ordered federal agencies to stop promoting the <a href=\"https://thehill.com/homenews/administration/5097278-trump-executive-order-gender-transition/\" rel=\"noreferrer noopener\" target=\"_blank\">concept of gender transition.</a></p>\n<p>The order stemmed from a wider Trump campaign promise to get rid of “transgender insanity” in the U.S. and go back on diversity and inclusion initiatives from the prior administration.</p>\n<p>Whitmer is among a pack of notable Democrats whose names have been floated as possible 2028 <a href=\"https://thehill.com/homenews/state-watch/5718752-whitmer-substack-bipartisan-solutions/\" rel=\"noreferrer noopener\" target=\"_blank\">presidential candidates</a>, including Kentucky Gov. Andy Beshear, California Gov. Gavin Newsom and Illinois Gov. JB Pritzker.</p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/lgbtq/5755981-whitmer-transgender-rights-state-of-the-state/",
            "pub_date": "2026-02-26 12:15:28",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5755938,
            "title": "Whitmer says US-Canada bridge Trump threatened to block 'will open'",
            "description": "<p>Michigan Gov. Gretchen Whitmer (D) said Wednesday that a bridge between the U.S. and Canada that President Trump previously threatened to block from opening is set to go ahead.</p>\n<p>“For the first time in over a century, a new bridge connecting Michigan to Canada, the Gordie Howe International Bridge, will open,” the governor declared during the Michigan State of the State address.</p>\n<p><a href=\"https://thehill.com/homenews/administration/5730570-bridge-opening-trade-talks/\">Earlier this month</a>, Trump threatened to prevent the opening of the Gordie Howe International Bridge and pushed the U.S.’s neighbors to the north to enter trade talks.</p>\n<p>“I will not allow this bridge to open until the United States is fully compensated for everything we have given them, and also, importantly, Canada treats the United States with the Fairness and Respect that we deserve,” Trump said, talking about the Gordie Howe International Bridge, planned to link Detroit, Mich., and Windsor, Ontario. </p>\n<p>Construction on the bridge began in 2018, with it set to open later this year.</p>\n<p>In recent years, Trump has ruffled <a href=\"https://thehill.com/homenews/administration/5286023-trump-carney-canada-51st/\">Canadian feathers</a> with talk of Canada <a href=\"https://thehill.com/homenews/administration/5072230-trudeau-trump-canada/\">being a part of the </a>U.S. and his tariff policy, straining a relationship between the two North American neighbors that has been historically warm. </p>\n<p>Canadian Prime Minister Mark Carney said a day after Trump’s bridge threat that he had a “positive” <a href=\"https://thehill.com/policy/international/5732140-us-canada-bridge-dispute/\">conversation with Trump.</a></p>\n<p>“We discussed the bridge. I explained that Canada, of course, paid for the construction of the bridge, over $4 billion, that the ownership is shared between the state of Michigan and the government of Canada and that in the construction of the bridge — obviously there’s Canadian steel, Canadian workers — but also U.S. steel, U.S. workers that are involved. This is a great example of cooperation between our countries,” Carney said at the time.</p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/state-watch/5755938-michigan-canada-bridge-trump-threat/",
            "pub_date": "2026-02-26 10:21:00",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5755831,
            "title": "Former Air Force pilot who provided 'defense services' to Chinese military arrested: DOJ",
            "description": "<p>The Department of Justice (DOJ) said Wednesday that a former Air Force pilot was arrested because he gave “defense services” to <a href=\"https://www.justice.gov/opa/pr/former-us-air-force-pilot-arrested-providing-defense-services-chinese-military\">Chinese military forces.</a></p>\n<p>In a press release Wednesday, the DOJ said 65-year-old Gerald Eddie Brown Jr., had been arrested in Jeffersonville, Ind., that day. The department said that Brown, a former Air Force officer and pilot, had been charged “for providing and conspiring to provide defense services to Chinese military pilots without authorization, in violation of the Arms Export Control Act (AECA).”</p>\n<p>“The United States Air Force trained Major Brown to be an elite fighter pilot and entrusted him with the defense of our Nation. He now stands charged with training Chinese military pilots,” Assistant Attorney General for National Security John Eisenberg said in the Wednesday DOJ release.</p>\n<p>“When U.S. persons — whether military or civilian — provide training to a foreign military, that activity is illegal unless they have a license from the State Department. The National Security Division will use all tools at its disposal to protect our military advantages and hold to account those who would violate the AECA.”</p>\n<p>The DOJ said that Brown had worked with foreigners and Americans so that he could give combat aircraft training to Chinese Air Force soldiers “since at least in or around August 2023,” according to a criminal complaint. </p>\n<p>Brown’s Air Force career lasted 24 years, according to the DOJ, and he left active duty 30 years ago. He previously headed up combat missions and “sensitive units” that had jurisdiction over nuclear weapons delivery systems, per the department.</p>",
            "kind": 1,
            "link": "https://thehill.com/policy/defense/5755831-former-air-force-pilot-arrested/",
            "pub_date": "2026-02-26 08:45:32",
            "source": "thehill",
            "language": "en"
        }
    ]
}