{
    "data": [
        {
            "id": 5757400,
            "title": "Trump's war on fraud is political genius",
            "description": "<p>President Trump is serious about fraud. As he should be — nothing more quickly undermines faith in our government, or enthusiasm for our safety net, than evidence that taxpayers are being ripped off.  </p>\n<p>And, boy, are they being ripped off. </p>\n<p>During the <a href=\"https://apnews.com/article/donald-trump-transcript-state-of-union-2026-c13e2a07df999b464b733f4a6e84dbd4\" rel=\"noreferrer noopener\" target=\"_blank\">State of the Union address</a> on Tuesday, the president said, “I am officially announcing the war on fraud, to be led by our great Vice President [JD] Vance. He’ll get it done.” </p>\n<p>He also said, “And [if] we’re able to find enough of that fraud, we will actually have a balanced budget overnight. It’ll go very quickly. That’s the kind of money you’re talking about.” </p>\n<p>That is optimistic, for sure. Our deficit this year is estimated at <a href=\"https://bipartisanpolicy.org/report/deficit-tracker/\" rel=\"noreferrer noopener\" target=\"_blank\">nearly $2 trillion</a> — two thousand billions of dollars. Welfare fraud is almost certainly less than half that amount. But Trump is still right that the amount of government payments being hijacked by crooks is stunning. </p>\n<p>In 2024, when Joe Biden was still president, <a href=\"https://www.gao.gov/products/gao-24-105833\" rel=\"noreferrer noopener\" target=\"_blank\">the Government Accountability Office reported</a> that “the federal government could lose between $233 billion and $521 billion annually to fraud.” In other words, up to half a trillion dollars was being stolen each year! That estimate was based on a survey of spending done in the years between 2018 and 2022, in the wake of the massive COVID relief programs authorized by Congress. </p>\n<p>Note that this horrendous sum does not include <a href=\"https://www.gao.gov/products/gao-24-105833\" rel=\"noreferrer noopener\" target=\"_blank\">“improper payments”</a>; that’s a whole different (and also enormous) category, according to the Government Accountability Office.  </p>\n<p>GAO reported that “No area of the federal government is immune to fraud” and suggested that “a government-wide approach is required to address it.” That suggestion went unheeded. </p>\n<p>Theft undermining our welfare programs is not new — it has just gotten worse. </p>\n<p>During the COVID years, Congress approved <a href=\"https://www.nytimes.com/interactive/2022/03/11/us/how-covid-stimulus-money-was-spent.html\" rel=\"noreferrer noopener\" target=\"_blank\">more than $5 trillion</a> in payments to keep the economy afloat, and pushed money out the door as rapidly as possible to maintain employment and spending. The flood of barely supervised outlays in programs like the Small Business Administration’s Paycheck Protection Program, Economic Injury Disaster Loan Program and the Unemployment Insurance programs was practically an invitation to steal.   </p>\n<p>Confidence in the government has been trending downward for decades, under both Republicans and Democrats. It is currently near an all-time low. While there are doubtless many reasons that <a href=\"https://www.pewresearch.org/politics/2025/12/04/public-trust-in-government-1958-2025/\" rel=\"noreferrer noopener\" target=\"_blank\">voters no longer trust their leaders</a>, surely revelations of massive welfare fraud do not help.</p>\n<p>Politically, attacking the pilferage of dollars meant to help sick children or provide housing for single low-income moms is a no-brainer. <a href=\"https://www.reuters.com/legal/government/what-is-minnesota-social-welfare-scandal-that-has-drawn-trumps-ire-2026-01-14/\" rel=\"noreferrer noopener\" target=\"_blank\">As we saw in Minneapolis</a>, voters are incensed to find that their well-meant money is being stolen, and they blame the government officials who oversee the programs and allow the thievery to go on. After the discovery that billions of dollars had been stolen from state coffers, Tim Walz <a href=\"https://www.pbs.org/newshour/politics/minnesota-gov-tim-walz-wont-run-for-a-third-term\" rel=\"noreferrer noopener\" target=\"_blank\">decided he could not run for a third term</a> as Minnesota’s governor. He was right; the blowback from voters was swift and merciless. </p>\n<p>Since <a href=\"https://www.urban.org/policy-centers/cross-center-initiatives/state-and-local-finance-initiative/state-and-local-backgrounders/public-welfare-expenditures#:~:text=As%20such%2C%20while%20state%20and,%2C%20and%20Wyoming%20($1%2C577)\" rel=\"noreferrer noopener\" target=\"_blank\">blue states like California, Illinois and New York</a> tend to embrace expansive welfare programs, hoping to win votes with taxpayer largesse, Democrats will be under scrutiny for allowing money to go missing. Republicans will highlight the mismanagement, adding to critiques that Democrats are poor administrators and especially feckless about fiscal management. </p>\n<p>But unlike the federal deficit, the theft of welfare hits close to home.  </p>\n<p>Alhough Trump officially tapped his VP Tuesday night to direct the anti-fraud effort, it isn’t his first move on that front. Earlier this month, he <a href=\"https://www.courthousenews.com/trumps-fraud-enforcement-assistant-ag-nom-will-get-public-hearing-in-senate-judiciary/\" rel=\"noreferrer noopener\" target=\"_blank\">set up a new division</a> in the Department of Justice to tackle the theft of government payments. And at the end of last year, he <a href=\"https://www.foxnews.com/politics/trump-demands-california-hand-recipient-lists-10b-paused-fraud-concerns\" rel=\"noreferrer noopener\" target=\"_blank\">demanded</a> states supply extensive information about recipients and payments.</p>\n<p>Vance will spearhead the anti-fraud campaign, and he has already thrown down the gauntlet. The vice president, along with Medicare and Medicaid Services chief Mehmet Oz, <a href=\"https://www.nbcnews.com/politics/jd-vance/vance-trump-war-fraud-suspending-medicaid-payments-minnesota-rcna260655\" rel=\"noreferrer noopener\" target=\"_blank\">just announced a pause on federal Medicaid reimbursements</a> to Minnesota, where billions meant for day care centers and autism treatments were stolen. </p>\n<p>Team Trump is withholding some $259 million in Medicaid reimbursements while an investigation, based on a recent audit, goes forward. Vance is demanding that Minnesota address its fraud problem before receiving more funds from Uncle Sam.</p>\n<p>That seems reasonable. Why should taxpayers across the country hand over their hard-earned cash to crooks? </p>\n<p>This isn’t a hypothetical. As NBC <a href=\"https://www.nbcnews.com/politics/jd-vance/vance-trump-war-fraud-suspending-medicaid-payments-minnesota-rcna260655\" rel=\"noreferrer noopener\" target=\"_blank\">reports</a>, “The Justice Department has charged 98 people there, 85 of whom are Somali, with $1 billion in fraud.” As the scandal has widened, some put the <a href=\"https://www.heritage.org/welfare/commentary/somali-welfare-fraud-minnesota-has-cost-american-taxpayers-billions\" rel=\"noreferrer noopener\" target=\"_blank\">total lost as high as $9 billion</a>. (Trump misspoke when he mentioned a figure of <a href=\"https://www.youtube.com/watch?v=8PQ7l905aVM\" rel=\"noreferrer noopener\" target=\"_blank\">$19 billion</a> in his address on Tuesday.)</p>\n<p>Walz responded to the holdup of Medicaid payments by trying to turn the spotlight back on ICE activities in his state, <a href=\"https://www.nbcnews.com/politics/jd-vance/vance-trump-war-fraud-suspending-medicaid-payments-minnesota-rcna260655\" rel=\"noreferrer noopener\" target=\"_blank\">saying</a>, ”This has nothing to do with fraud. The agents Trump allegedly sent to investigate fraud are shooting protesters and arresting children.” </p>\n<p>Nice try, Tim. Unrest over the <a href=\"https://www.pbs.org/newshour/nation/a-look-at-shootings-by-federal-immigration-officers\" rel=\"noreferrer noopener\" target=\"_blank\">tragic killing of two civilians in your state by ICE</a> may have conveniently diverted the spotlight from your welfare fraud scandal, but it is not going away. </p>\n<p>Vance will no doubt pursue fraud allegations in California and New York, among other states, where Republicans will hope to hold onto a few essential House seats in the wake of damaging redistricting by Democrats. Govs. Gavin Newsom (D) and Kathy Hochul (D) have already pushed back, both touting <a href=\"https://calmatters.org/politics/2026/01/california-welfare-fraud-improvement/\" rel=\"noreferrer noopener\" target=\"_blank\">prior</a> <a href=\"https://www.governor.ny.gov/news/money-your-pockets-governor-hochul-highlights-proposals-bring-down-costs-auto-insurance-rates\" rel=\"noreferrer noopener\" target=\"_blank\">efforts</a> to clean up stealing in their states.</p>\n<p>Given the enormity of both states’ welfare operations, and their reportedly lax standards regulating who can access those payments, my guess is Newsom and Hochul will be on the hot seat in coming months. That will be good for Republicans — and for taxpayers. </p>\n<p><em>Liz Peek is a former partner of major bracket Wall Street firm Wertheim and Company.</em></p>",
            "kind": 1,
            "link": "https://thehill.com/opinion/white-house/5757400-trump-vp-vance-anti-fraud/",
            "pub_date": "2026-02-27 21:11:13",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5757696,
            "title": "Whole Hog Politics: A gusher of turnout in Texas, but who will benefit?",
            "description": "<p>[<strong><em>Watch Whole Hog Politics live</em></strong><em>: Join us today at 9 a.m. ET at </em><a href=\"https://nam11.safelinks.protection.outlook.com/?url=http%3A%2F%2Fthehill.com%2F&amp;data=05%7C02%7Ciswanson%40thehill.com%7C563b0d016f5348f6e30508de757ba9e5%7C9e5488e2e83844f6886cc7608242767e%7C1%7C0%7C639077371501539329%7CUnknown%7CTWFpbGZsb3d8eyJFbXB0eU1hcGkiOnRydWUsIlYiOiIwLjAuMDAwMCIsIlAiOiJXaW4zMiIsIkFOIjoiTWFpbCIsIldUIjoyfQ%3D%3D%7C0%7C%7C%7C&amp;sdata=JXpbZ3KRSt%2FvXYL4m6HMh8AAY0lRHskM0f%2BOg3JPJec%3D&amp;reserved=0\" rel=\"noreferrer noopener\" target=\"_blank\"><em>TheHill.com</em></a><em> as <strong>Chris Stirewalt</strong> and host <strong>Bill Sammon </strong>break down this week’s political news and answer questions from a live online audience.</em>]<br/><br/>The midterms start in earnest on Tuesday, and they’re beginning with a bang: Texas has a double-barreled Senate primary that has been expensive and ugly. How the parties move forward next week will significantly shape the question of whether the Republican Senate majority really is in jeopardy or not.</p>\n<p>And nobody knows what’s going to happen — on the Democratic side, at least.</p>\n<p>The Republicans have been replaying the siege of the Alamo for the past year, as incumbent Sen. <strong>John Cornyn</strong> has tried to outlast the siege by state Attorney General <strong>Ken Paxton</strong>. The arrival of a third high-visibility candidate, Houston-area Rep. <strong>Wesley Hunt</strong>, meant that a May 26 runoff between the top two was always going to be the likeliest outcome.</p>\n<p><strong>President Trump</strong> has stayed out of the race so far but is scheduled to campaign in Texas at the end of next week. Will he clarify his preference among the top two finishers or let them continue to fight it out and spend bales of cash? If the runoff features <a href=\"https://www.joemygod.com/2026/02/cornyn-attack-ad-calls-paxton-crooked-wife-cheater-accuses-him-of-being-secretly-pro-lgbtq-video/\" rel=\"noreferrer noopener\" target=\"_blank\">ads like the ones we’ve seen in the first round</a>, front-runner Paxton could emerge into the general election more damaged than any Texas statewide Republican candidate in memory. </p>\n<p>It’s not unlike the story playing out along the Rio Grande as Democrats hope Republican Rep. <strong>Tony Gonzales </strong>survives his primary amid <a href=\"https://thehill.com/homenews/house/5753328-gonzales-pressure-affair-allegations-johnson/\" rel=\"noreferrer noopener\" target=\"_blank\">a jaw-dropping scandal</a> involving the suicide by self-immolation of a staffer who claimed to have been having an affair with the congressman. While losing a House race would be an embarrassment for Texas Republicans after their audacious mid-decade redistricting, very few people in politics expect Republicans to remain in the House majority after the midterms.</p>\n<p>The Senate, though, still favors Republicans, but only slightly, and only if Republicans avoid candidates with heavy baggage, like Paxton, whose history of scandal is matched by his penchant for polarizing politics.</p>\n<p>Of course, it’s hard to say much with great confidence. Not only is there essentially no reliable, fresh polling in Texas this cycle — when <a href=\"https://texaspolitics.utexas.edu/blog/competition-remains-fierce-in-both-u-s-senate-primaries-in-texas-according-to-latest-ut-texas-politics-project-poll-2\" rel=\"noreferrer noopener\" target=\"_blank\">a YouGov survey</a> conducted over a two-week period online is the best you’ve got in the last week of the campaign, you ain’t got much — it would be hard to know how to even set the parameters for a poll given the huge turnout so far.</p>\n<p>Today is the last day of early voting, but by Thursday, some 270,000 more Republicans had already voted early than in 2022. That’s not so surprising, given that there wasn’t a hot Senate race on the ballot that year and Gov. <strong>Greg Abbott </strong>was easily weathering a slew of primary challengers to his right. Could Paxton win outright Tuesday? Yep. Could Hunt sneak into the top two? Sure. With turnout this high, it’s hard to say.</p>\n<p>But on the Democratic side? Wowzers.</p>\n<p>As of Thursday, <a href=\"https://votehub.com/early-vote-tracker-tx-primary-26?utm_source=substack&amp;utm_medium=email&amp;state=tx-sen-26-dem\" rel=\"noreferrer noopener\" target=\"_blank\">868,118 ballots had already been cast</a> in Democratic primaries, almost triple the number from four years ago. To have Democratic turnout running nearly 140,000 votes ahead of Republicans in a state where the GOP holds every statewide office and huge majorities in both houses of the Legislature is really something.</p>\n<p>Part of that surge is due to the fact that Democrats everywhere are fired up to vote, winning special elections from coast to coast. But part of it is also that Texas Democrats have stumbled into a hornets’ nest of a primary between Rep. <strong>Jasmine Crockett</strong>, the trash-talking progressive from Dallas, and state Rep. <strong>James Talarico</strong>, the moderate-sounding liberal from the Austin area. </p>\n<p>The aforementioned junky poll has Crockett trouncing Talarico by a dozen points, but he has <a href=\"https://x.com/jt_ennis/status/2026761177171468380\" rel=\"noreferrer noopener\" target=\"_blank\">his own internal poll</a> that puts him 4 points <em>ahead</em>. Both polls were taken before the imbroglio over Talarico’s scheduled appearance on <strong>Stephen Colbert</strong>’s TV show, and neither inspires much confidence in their predictive power. Even good, nonpartisan pollsters would struggle with a turnout surge like this.</p>\n<p>Republicans are hoping for Crockett in the same way Democrats are rooting for Paxton, as evidenced by Abbott’s <a href=\"https://www.nytimes.com/2026/02/25/us/greg-abbott-jasmine-crockett-texas-primary-ads.html?utm_source=substack&amp;utm_medium=email\" rel=\"noreferrer noopener\" target=\"_blank\">mischievous interference in the Democratic race</a>, dumping a bunch of money to elevate the polarizing congresswoman for her similarities to progressive icons like Sen. <strong>Bernie Sanders </strong>(I-Vt.) and New York City Mayor <strong>Zohran Mamdani</strong>. Abbott is a shoo-in for his own race, so why not try to boost the weaker candidate for Senate?</p>\n<p>Crockett v. Cornyn would be basically no race at all. Crockett v. Paxton is a race Republicans still believe they can solidly win. Talarico v. Cornyn is probably also a solid Republican rating. But Talarico v. Paxton? That one has some real <strong>Roy Moore </strong>energy and rightly has Republicans frightened to think about what it would take to get their damaged nominee over the finish line. </p>\n<p>Even if Talarico ends up being just another <strong>Beto O’Rourke</strong>, Paxton isn’t nearly as good of a nominee as even Sen. <strong>Ted Cruz</strong> was in their 2018 match-up. And right now, the political climate looks even worse for Republicans than it did at this point in the first Trump midterm. </p>\n<p>High turnout and high stakes — that’s a Texas-sized start to the 2026 midterms.</p>\n<p>[<strong>Programming alert:</strong> Watch “<a href=\"https://x.com/thehillsunday/status/1979289066324791751?s=46&amp;t=Zd3W0ly33_L7lQTR75bKPA\" rel=\"noreferrer noopener\" target=\"_blank\">The Hill Sunday with Chris Stirewalt</a>” — Midterm season is finally here, as primary voters in Texas, North Carolina and Arkansas head to the polls on Tuesday. Republican National Committee Chair <strong>Joe Gruters </strong>and Texas Democratic Party Chair <strong>Kendall Scudder </strong>weigh in. Plus, Sen. <strong>Todd Young </strong>(R-Ind.) on his push to increase domestic ship production. And, as always, we’ll be sure to cover all the latest political news with expert analysis from our best-in-the-business panel of journalists. Be sure to catch us on NewsNation at 10 a.m. ET / 9 a.m. CT or your local CW station.]</p>\n<hr class=\"wp-block-separator has-alpha-channel-opacity\"/>\n<p><em>Holy croakano! We welcome your feedback, so please email us with your tips, corrections, reactions, amplifications, etc. at WholeHogPolitics@TheHill.com. If you’d like to be considered for publication, please include your real name and hometown. If you don’t want your comments to be made public, please specify.</em></p>\n<hr class=\"wp-block-separator has-alpha-channel-opacity\"/>\n<p><strong>NUTRITIONAL INFORMATION </strong></p>\n<p><strong>Trump Job Performance</strong></p>\n<p><strong>Average Approval: </strong>38.2%</p>\n<p><strong>Average Disapproval: </strong>60%</p>\n<p><strong>Net Score: </strong>-21.8</p>\n<p><strong>Change from one week ago: </strong> ↓ 1.8 points (- 20 points)</p>\n<p><strong>Change from one month ago:  </strong>↓ 1.6 points (-20.2 points)</p>\n<p>[<em>Average includes: Reuters/Ipsos 40% approve – 58% disapprove; Emerson College 43%</em> <em>approve – 55% disapprove; American Research Group 36% approve – 62% disapprove; CNN/SSRS 36% approve – 63% disapprove; AP/NORC 36% approve – 62% disapprove</em>]</p>\n<p><strong>Independents variable </strong></p>\n<p><em>Do you approve or disapprove of the way Donald Trump is handling his job as president? (Among unaffiliated voters)</em></p>\n<p><strong>Approve Disapprove</strong></p>\n<p><strong>Now: </strong>26% 73%</p>\n<p><strong>One year ago: </strong>41% 59%</p>\n<p>[<em>CNN/SSRS surveys of </em><a href=\"https://www.cnn.com/2026/02/23/politics/trump-approval-rating-independents-cnn-poll\" rel=\"noreferrer noopener\" target=\"_blank\"><em>2,496 adults, Feb. 17-20, 2026</em></a><em>, and </em><a href=\"https://s3.documentcloud.org/documents/25548460/cnn-poll-public-remains-negative-on-trump-ahead-of-address-to-congress.pdf\" rel=\"noreferrer noopener\" target=\"_blank\"><em>2,212 adults, Feb. 24-28, 2025</em></a>]</p>\n<hr class=\"wp-block-separator has-alpha-channel-opacity\"/>\n<p><strong>ON THE SIDE: ‘THE MAN WHO STOLE INFINITY’</strong></p>\n<p><a href=\"https://www.quantamagazine.org/the-man-who-stole-infinity-20260225/?src=longreads\" rel=\"noreferrer noopener\" target=\"_blank\">Quanta Magazine</a>: “When <strong>Demian Goos</strong> followed <strong>Karin Richter</strong> into her office on March 12 of last year, the first thing he noticed was the bust. It sat atop a tall pedestal in the corner of the room, depicting a bald, elderly gentleman with a stoic countenance. Goos saw no trace of the anxious, lonely man who had obsessed him for over a year. Instead, this was <strong>Georg Cantor </strong>as history saw him. An intellectual giant: steadfast, strong-willed, determined to bring about a mathematical revolution over the clamorous objections of his peers. … Goos began flipping through, contemplating the letters with the relish of an archaeologist entering a long-lost tomb. Then he reached a particular page and froze. He struggled to catch his breath. … It was the date: November 30, 1873. … The letter that proved once and for all that Cantor’s famous 1874 paper, the one that would go on to reshape all of mathematics, had been an act of plagiarism.”</p>\n<hr class=\"wp-block-separator has-alpha-channel-opacity\"/>\n<p><strong>PRIME CUTS </strong></p>\n<p><strong>Voter ID push could backfire on GOP:</strong> <a href=\"https://www.theatlantic.com/politics/2026/02/save-america-act-turnout/686145/\" rel=\"noreferrer noopener\" target=\"_blank\">The Atlantic</a>: “For decades, the politics of voter-ID battles were based on a simple premise: The voters most likely to be screened out by such restrictions were probably Democrats. In 2024, however, that fact stopped being true. Trump beat Kamala Harris among voters who didn’t regularly participate in elections. In the low-turnout, off-cycle elections that have happened since then, Democrats have overperformed dramatically, suggesting that their advantage with the most educated, plugged-in voters remains strong. In other words, the politics of voter ID have not caught up to its new partisan implications. Making voting more difficult would most likely hurt Republicans’ chances, yet they’re pushing hard to make that happen; meanwhile, Democrats, who insist that Trump and a MAGA Congress are existential threats to American democracy, refuse on principle to help Republicans sabotage themselves.”</p>\n<p><strong>Trump allies seek emergency declaration on elections: </strong><a href=\"https://nam11.safelinks.protection.outlook.com/?url=https%3A%2F%2Fwww.washingtonpost.com%2Fpolitics%2F2026%2F02%2F26%2Ftrump-elections-executive-order-activists%2F%3Futm_source%3Dalert%26utm_medium%3Demail%26utm_campaign%3Dwp_news_alert_revere%26location%3Dalert&amp;data=05%7C02%7Ciswanson%40thehill.com%7C563b0d016f5348f6e30508de757ba9e5%7C9e5488e2e83844f6886cc7608242767e%7C1%7C0%7C639077371501985037%7CUnknown%7CTWFpbGZsb3d8eyJFbXB0eU1hcGkiOnRydWUsIlYiOiIwLjAuMDAwMCIsIlAiOiJXaW4zMiIsIkFOIjoiTWFpbCIsIldUIjoyfQ%3D%3D%7C0%7C%7C%7C&amp;sdata=BrHXWeBtZ4UczGk9PI6lElsX9Tx%2BYyc0KqsLJTuHJxM%3D&amp;reserved=0\">Washington Post</a>: “Pro-Trump activists who say they are in coordination with the White House are circulating a 17-page draft executive order that claims China interfered in the 2020 election as a basis to declare a national emergency that would unlock extraordinary presidential power over voting. … <strong>Peter Ticktin</strong>, a Florida lawyer … is advocating for the draft executive order. Ticktin attended the New York Military Academy with Trump and was part of his legal team that filed an unsuccessful 2022 lawsuit accusing Democrats of conspiring to damage him with allegations that his 2016 campaign colluded with Russia. ‘But here we have a situation where the president is aware that there are foreign interests that are interfering in our election processes,’ Ticktin went on. ‘That causes a national emergency where the president has to be able to deal with it.’ The emergency would empower the president to ban mail ballots and voting machines as the vectors of foreign interference, Ticktin argued.”</p>\n<p><strong>Panic setting in for California Democrats:</strong> <a href=\"https://nam11.safelinks.protection.outlook.com/?url=https%3A%2F%2Fwww.nytimes.com%2F2026%2F02%2F26%2Fus%2Fcalifornia-governor-democratic-political-machine.html&amp;data=05%7C02%7Ciswanson%40thehill.com%7C563b0d016f5348f6e30508de757ba9e5%7C9e5488e2e83844f6886cc7608242767e%7C1%7C0%7C639077371502004455%7CUnknown%7CTWFpbGZsb3d8eyJFbXB0eU1hcGkiOnRydWUsIlYiOiIwLjAuMDAwMCIsIlAiOiJXaW4zMiIsIkFOIjoiTWFpbCIsIldUIjoyfQ%3D%3D%7C0%7C%7C%7C&amp;sdata=HPghGiw%2B5cVIiSYbVGpuv1asM3FGdU1dayV%2F9WMG%2Fnw%3D&amp;reserved=0\">New York Times</a>: “[The] dominance of the San Francisco machine in California is coming to an end. … But the end of the dynastic dominance has also left California Democrats without a clear favorite to lead the state, the nation’s most populous. … At least nine Democrats are running, with no one seizing a substantial lead. And it is unusually close to the June 2 primary for the governor’s race to be this unsettled. … California has not elected a Republican to statewide office in 20 years, and registered Democrats outnumber registered Republicans almost two to one. So the possibility of a Republican primary sweep has Democrats in a mild panic. … In an earlier era, a strong party boss might have hashed things out behind closed doors. But many of the candidates still see reasons to remain hopeful.”</p>\n<hr class=\"wp-block-separator has-alpha-channel-opacity\"/>\n<p><strong>SHORT ORDER</strong></p>\n<p>Dems move out to 8-point lead on generic ballot — <a href=\"https://emersoncollegepolling.com/february-2026-national-poll-trump-approval-steady-as-disapproval-rises-vance-leads-gop-field-while-democrats-hold-midterm-edge/\" rel=\"noreferrer noopener\" target=\"_blank\">Emerson College Polling</a> </p>\n<p>14-point advantage on voter enthusiasm is Dems’ largest since 2006 — <a href=\"https://nam11.safelinks.protection.outlook.com/?url=https%3A%2F%2Fwww.washingtonpost.com%2Fpolitics%2F2026%2F02%2F25%2Fpoll-democrats-trump-republicans-midterms%2F%3Futm_source%3Dsubstack%26utm_medium%3Demail&amp;data=05%7C02%7Ciswanson%40thehill.com%7C563b0d016f5348f6e30508de757ba9e5%7C9e5488e2e83844f6886cc7608242767e%7C1%7C0%7C639077371502043133%7CUnknown%7CTWFpbGZsb3d8eyJFbXB0eU1hcGkiOnRydWUsIlYiOiIwLjAuMDAwMCIsIlAiOiJXaW4zMiIsIkFOIjoiTWFpbCIsIldUIjoyfQ%3D%3D%7C0%7C%7C%7C&amp;sdata=MgU37aF9oCQ%2BxRbCqwCOJ7U5B48%2F12xbbD0R3qoiqHI%3D&amp;reserved=0\">Washington Post</a></p>\n<p>Vance or Rubio? Trump plays pundit with advisers over 2028 — <a href=\"https://www.axios.com/2026/02/22/vance-rubio-2028-trump-question?utm_source=newsletter&amp;utm_medium=email&amp;utm_campaign=newsletter_axiosam&amp;stream=top\" rel=\"noreferrer noopener\" target=\"_blank\">Axios</a></p>\n<p>Newsom, Buttigieg, Harris, Ocasio-Cortez and Shapiro fill out top five for 2028 Dems — <a href=\"https://emersoncollegepolling.com/february-2026-national-poll-trump-approval-steady-as-disapproval-rises-vance-leads-gop-field-while-democrats-hold-midterm-edge/\" rel=\"noreferrer noopener\" target=\"_blank\">Emerson College Polling</a>  </p>\n<p>Q Poll shows Pennsylvanians like Shapiro as governor, dubious about him as potential president — <a href=\"https://thehill.com/homenews/campaign/5755336-governor-shapiro-2028-election/?tbref=hp\" rel=\"noreferrer noopener\" target=\"_blank\">The Hill</a></p>\n<p>Shapiro ducks on Fetterman reelection endorsement — <a href=\"https://www.abc27.com/pennsylvania/shapiro-talks-ice-in-pennsylvania-relationship-with-fetterman-trump-on-abcs-this-week/\" rel=\"noreferrer noopener\" target=\"_blank\">WHTM</a></p>\n<p>Internal poll puts state Sen. <strong>Zach Wahls </strong>way ahead in Iowa Dems’ Senate primary to replace Ernst — <a href=\"https://www.newsweek.com/zach-wahls-chances-of-beating-josh-turek-in-iowa-senate-race-poll-11582588\" rel=\"noreferrer noopener\" target=\"_blank\">Newsweek</a></p>\n<p>Candidate filing date passes, but Maryland Gov. <strong>Wes Moore</strong> (D) not giving up on gerrymander bid — <a href=\"https://foxbaltimore.com/news/local/moores-redistricting-push-stalls-as-maryland-candidate-filing-deadline-arrives?utm_source=substack&amp;utm_medium=email\" rel=\"noreferrer noopener\" target=\"_blank\">WBFF</a></p>\n<p>All six Virginia House Democrats back April gerrymander amendment — <a href=\"https://punchbowl.news/article/campaigns/va-dems-map/\" rel=\"noreferrer noopener\" target=\"_blank\">Punchbowl News</a></p>\n<p>MAGA’s bid to punish Indiana Republicans who blocked gerrymander fizzles — <a href=\"https://www.the-downballot.com/p/morning-digest-trumps-crusade-to?utm_source=post-email-title&amp;publication_id=2418217&amp;post_id=189080653&amp;utm_campaign=email-post-title&amp;isFreemail=false&amp;r=2k455&amp;triedRedirect=true&amp;utm_medium=email\" rel=\"noreferrer noopener\" target=\"_blank\">The Downballot</a> </p>\n<p>Conservative Wisconsin House Speaker who fought Trump over 2020 results calls it quits — <a href=\"https://www.wmtv15news.com/2026/02/20/robin-vos-retirement-marks-end-an-era-sparks-divided-reaction/\" rel=\"noreferrer noopener\" target=\"_blank\">WMTV</a></p>\n<hr class=\"wp-block-separator has-alpha-channel-opacity\"/>\n<p><strong>TABLE TALK: ENTITLED TO HIS WINNINGS </strong></p>\n<p>“It’s almost like the government has, you know, 19 elderly employees for every actual employee” — <em>Think tank tax expert, <strong>Alan Cole,</strong> 37, </em><a href=\"https://www.wsj.com/finance/investing/the-tax-nerd-who-bet-his-life-savings-against-doge-6b59eda2?st=w63bSo&amp;reflink=article_copyURL_share\" rel=\"noreferrer noopener\" target=\"_blank\"><em>to The Wall Street Journal</em></a><em> explaining how his understanding of Social Security and Medicaid funding helped him win $128,000 by betting his life savings that federal spending would increase despite DOGE cuts</em>.</p>\n<hr class=\"wp-block-separator has-alpha-channel-opacity\"/>\n<p>You should email us! Write to <strong>WholeHogPolitics@TheHill.com</strong> with your tips, kudos, criticisms, insights, rediscovered words, wonderful names, recipes, and, always, good jokes. Please include your real name—at least first and last—and hometown. Make sure to let us know in the email if you want to keep your submission private. My colleague, <strong>Meera Sehgal</strong>, and I will look for your emails and then share the most interesting ones and my responses here. Clickety clack!</p>\n<hr class=\"wp-block-separator has-alpha-channel-opacity\"/>\n<p><strong>FOR DESSERT: YET, NO JUSTICE FOR COSMO KRAMER </strong></p>\n<p><a href=\"https://www.cbsnews.com/newyork/news/long-island-ny-pb4wego-license-plate/\" rel=\"noreferrer noopener\" target=\"_blank\">CBS News</a>: “<strong>Seth Bykofsky</strong>‘s #1 fight since January has been to keep his custom license plate, which reads ‘PB4WEGO.’ On Jan. 23, Bykofsky posted on social media [that] the New York state Department of Motor Vehicles had pulled his custom plate, calling it ‘objectionable.’ A letter he shared from the DMV said he ‘must destroy your old plates’ and replace them with new, standard plates the state provided. Bykofsky had a wee objection to the plate being called objectionable. ‘Is this simple plea … an incitement to riot? Have we inflamed the very soul of toddlers everywhere, struggling, against all odds, to hold it in? Other than to evoke a smile, a passing thumbs up, or a wink and a nod from motorists and pedestrians alike, where is the groundswell of objection to the public display of benign jest,’ Bykofksy wrote on social media.  His story did not whizz past [New York Gov. <strong>Kathy Hochul</strong>], who intervened on his behalf. She called his plate ‘a public service.’”</p>",
            "kind": 1,
            "link": "https://thehill.com/newsletters/whole-hog-politics/5757696-paxton-cornyn-runoff-battle/",
            "pub_date": "2026-02-27 21:11:13",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5758483,
            "title": "Bill Clinton to sit for closed-door deposition in Epstein investigation",
            "description": "<p>Former President Clinton will appear for a <a data-id=\"https://thehill.com/homenews/house/5755536-clintons-depositions-epstein-investigation/\" data-type=\"link\" href=\"https://thehill.com/homenews/house/5755536-clintons-depositions-epstein-investigation/\">closed-door deposition</a> before the House Oversight Committee on Friday, a day after former Secretary of State Hillary Clinton’s <a data-id=\"https://thehill.com/homenews/house/5756577-clintons-questioned-epstein-links/\" data-type=\"link\" href=\"https://thehill.com/homenews/house/5756577-clintons-questioned-epstein-links/\">gave her testimony</a> amid the committee’s probe of convicted sex offender Jeffrey Epstein.</p>\n<p>The hearings are being held in Chappaqua, N.Y. Both of the Clintons appear in files tied to Epstein that <a data-id=\"https://thehill.com/homenews/administration/5715028-epstein-documents-publicly-available/\" data-type=\"link\" href=\"https://thehill.com/homenews/administration/5715028-epstein-documents-publicly-available/\">were released</a> by the Justice Department <a data-id=\"https://thehill.com/homenews/5614156-trump-signs-epstein-transparency-act/\" data-type=\"link\" href=\"https://thehill.com/homenews/5614156-trump-signs-epstein-transparency-act/\">under a law</a> signed by President Trump last year. The couple denies any knowledge of the disgraced financier’s crimes.</p>\n<p>The former president and first lady <a data-id=\"https://thehill.com/homenews/administration/5721434-clintons-congressional-testimony-investigation/\" data-type=\"link\" href=\"https://thehill.com/homenews/administration/5721434-clintons-congressional-testimony-investigation/\">agreed to testify</a> in New York after the committee, with the support of some Democratic members, threatened to lead <a data-id=\"https://thehill.com/homenews/house/5718848-clintons-reject-deposition-offer/\" data-type=\"link\" href=\"https://thehill.com/homenews/house/5718848-clintons-reject-deposition-offer/\">contempt of Congress proceedings </a>against them for defying the terms of a subpoena. </p>\n<p>The Clintons had called for a <a href=\"https://thehill.com/homenews/house/5724172-hillary-clinton-public-deposition-epstein-probe/\">public hearing</a> and accused the chair of adding last-minute terms for their depositions. </p>\n<p>Epstein visited the White House several times during the Clinton administration, according to visitor logs, and the ex-president appeared in flight logs on his private jets after leaving office. </p>\n<p><a data-id=\"https://thehill.com/homenews/house/5646208-epstein-clinton-trump-photos/\" data-type=\"link\" href=\"https://thehill.com/homenews/house/5646208-epstein-clinton-trump-photos/\">Photos</a> included in the <a data-id=\"https://thehill.com/homenews/administration/5660274-bill-clinton-jeffrey-epstein-files-democrats-trump/\" data-type=\"link\" href=\"https://thehill.com/homenews/administration/5660274-bill-clinton-jeffrey-epstein-files-democrats-trump/\">DOJ’s document releases</a> show the former president next to women on a plane and in a hot tub. Another picture depicts Clinton and <a data-id=\"https://thehill.com/homenews/ap/ap-u-s-news/a-timeline-of-the-jeffrey-epstein-ghislaine-maxwell-scandal/\" data-type=\"link\" href=\"https://thehill.com/homenews/ap/ap-u-s-news/a-timeline-of-the-jeffrey-epstein-ghislaine-maxwell-scandal/\">Epstein’s associate</a> Ghislaine Maxwell in a pool together. </p>\n<p>“Traveling on Epstein’s plane was not worth the years of questioning afterward,” he wrote in a 2024 autobiography. “I wish I had never met him.”</p>\n<p>The former secretary of state repeated her denials of any knowledge about Epstein’s criminal activities and Maxwell in <a data-id=\"https://thehill.com/homenews/house/5758013-hillary-clinton-epstein-deposition/\" data-type=\"link\" href=\"https://thehill.com/homenews/house/5758013-hillary-clinton-epstein-deposition/\">over six hours of testimony</a> on Thursday. She told reporters outside of the hearing that she “answered every one of their questions as fully as I could based on what I knew.”</p>\n<p>In a <a href=\"https://x.com/HillaryClinton/status/2027053057100693779/photo/1\">prepared opening statement</a> shared on social media before her deposition, the former first lady repeated statements from the sworn deposition she shared with the committee earlier this year, writing, “I had no idea about their criminal activities.”</p>\n<p>“I do not ever recall ever encountering Mr. Epstein,” Hillary Clinton wrote. “I never flew on his plane or visited his island, homes or offices. I have nothing to add to that.”</p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/house/5758483-bill-clinton-closed-door-testimony-epstein-files-house-oversight/",
            "pub_date": "2026-02-27 21:11:12",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5758473,
            "title": "Democratic senator presses Noem on suspension of global entry, TSA PreCheck",
            "description": "<p>Sen. Jacky Rosen (D-Nev.) is pressing Department of Homeland Secretary Kristi Noem to reopen the <a data-id=\"https://thehill.com/homenews/administration/5752442-trump-dhs-global-entry-program/\" data-type=\"link\" href=\"https://thehill.com/homenews/administration/5752442-trump-dhs-global-entry-program/\">Global Entry program</a> and to back off a new threat to suspend the Transportation Security Administration’s (TSA) <a data-id=\"https://thehill.com/policy/transportation/5750551-dhs-reverses-tsa-precheck-shutdown-global-entry-suspended/\" data-type=\"link\" href=\"https://thehill.com/policy/transportation/5750551-dhs-reverses-tsa-precheck-shutdown-global-entry-suspended/\">PreCheck program</a> amid the DHS shutdown, which is stretching into its third week.</p>\n<p>Rosen, who represents major tourist hub Las Vegas, is concerned about the shutdown’s cascading <a data-id=\"https://thehill.com/policy/transportation/5739852-tsa-shutdown-impacts-air-travel/\" data-type=\"link\" href=\"https://thehill.com/policy/transportation/5739852-tsa-shutdown-impacts-air-travel/\">effects on air travel</a> and the economy and she is accusing Noem of playing politics with two programs that are intended to make it easier for low-risk fliers to travel.</p>\n<p>She warned the senior Trump administration official that suspending the Global Entry program and threatening to suspend TSA PreCheck is “counterproductive” and “unnecessary.”</p>\n<p>“The Global Entry program facilitates lawful international travel, strengthens security, improves the traveler experience, and supports U.S. economic activity,” Rosen wrote in a Feb. 26 letter to Noem obtained by The Hill.</p>\n<p>“As such, it should be immediately reopened and the related … PreCheck program should remain open as well,” she added.</p>\n<p>Global Entry allows members of the program to pass through customs more quickly when entering the country while TSA PreCheck enables pre-vetted travelers to move faster through security lines at airports.</p>\n<p>The Nevada Democrat called Noem’s decision to shut down Global Entry “part of a troubling trend of you and Special Government Employee (SGE) Corey Lewandowski using your authority to pick and choose what government services to provide, withhold, or threaten to withhold to maximize the Administration’s political leverage and create uncertainty.”</p>\n<p>Lewandowski, former Trump’s former campaign manager, is Noem’s top adviser at DHS.</p>\n<p>Rosen noted that Lewandowski is serving as a special government employee and said he has served in that role “beyond the statutorily allowed period of time.”</p>\n<p>The department announced last weekend that it had suspended Global Entry and PreCheck because of staffing issues <a data-id=\"https://thehill.com/homenews/house/5738280-dhs-funding-shutdown-democrats-ice/\" data-type=\"link\" href=\"https://thehill.com/homenews/house/5738280-dhs-funding-shutdown-democrats-ice/\">related to lapsed funding</a>.</p>\n<p>Noem immediately reversed the decision to stop PreCheck services in the face of strong public pushback. But on Wednesday, she told CNN that DHS may suspend the program again to prioritize standard security lanes.  </p>\n<p>Rosen suggested Noem is playing politics by threatening to pause PreCheck again, “despite no demonstrated need to do so.”</p>\n<p>“Given these concerns, I urge DHS to immediately reopen Global Entry and ensure that PreCheck remains available to travelers,” the senator wrote. “I also request a detailed explanation of the decision-making process that led to the suspension of TSA PreCheck and Global Entry, including the legal authority relied upon, the operational or budgetary assessments conducted, the officials who authorized the action, and the rationale for restoring PreCheck while leaving Global Entry closed.”</p>\n<p>She asked Noem to respond by March 2 and to provide the department’s plan and timeline for fully restoring Global Entry services.</p>\n<p>Rosen also copied the DHS inspector general on the letter.</p>\n<p>She told The Hill that she’s concerned about the broader economic effects of hampering air travel.</p>\n<p>“You’re going to shut down trillions of dollars. You shut down our economy by shutting down our airspace. You’re going to get your revenge alright because you’re going to cause the economy to collapse,” Rosen warned. “Good luck with that one.”</p>\n<p>“We don’t have enough people traveling, we don’t have enough shifts at the hotels, restaurants, bars. What about the people who sell toilet paper, paper towels and soap in the bathrooms there?” she continued. “You cascade all the way down. People make less, they spend less in their neighborhoods.”</p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/senate/5758473-rosen-noem-dhs-shutdown-global-entry-tsa-precheck/",
            "pub_date": "2026-02-27 21:05:57",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5758488,
            "title": "Thune warns Texas Senate seat could flip to Democrats",
            "description": "<p>Senate Majority Leader John Thune (R-S.D.) is warning that the Texas Senate seat long held by Sen. John Cornyn (R) could <a data-id=\"https://thehill.com/homenews/campaign/5752512-cornyn-warns-texas-crack-red-wall/\" data-type=\"link\" href=\"https://thehill.com/homenews/campaign/5752512-cornyn-warns-texas-crack-red-wall/\">flip to Democrats</a> in the <a data-id=\"https://thehill.com/homenews/campaign/5757641-trump-texas-senate-gop-primary/\" data-type=\"link\" href=\"https://thehill.com/homenews/campaign/5757641-trump-texas-senate-gop-primary/\">November election</a> if the incumbent is defeated in the GOP primary.</p>\n<p>“Honestly, if you look at the polling in a general election setting, I don’t think it’s outside the realm of possibility that the seat [flips], depending on who the Democrats nominate,” Thune told Politico earlier this week.</p>\n<p>His blunt warning about Republicans hanging onto the Texas Senate seat comes just a few days before Cornyn is set to face off against Texas Attorney General Ken Paxton and Rep. Wesley Hunt (R-Texas) in Tuesday’s primary. A run-off election will be held on May 26 if no candidate wins a majority.</p>\n<p>Republican senators said that Thune has worked behind the scenes to push President Trump <a data-id=\"https://thehill.com/homenews/campaign/5741247-donald-trump-texas-senate-primary/\" data-type=\"link\" href=\"https://thehill.com/homenews/campaign/5741247-donald-trump-texas-senate-primary/\">to endorse</a> Cornyn but so far without success.</p>\n<p>Trump will travel to Texas Friday where he plans to promote his energy and economic policies.</p>\n<p>Cornyn and his allies have <a data-id=\"https://thehill.com/homenews/campaign/5755015-texas-senate-primary-spending/\" data-type=\"link\" href=\"https://thehill.com/homenews/campaign/5755015-texas-senate-primary-spending/\">spent</a> $64 million defending the incumbent in the race while Paxton’s and Hunt’s allies have spent approximately $24 million.</p>\n<p>Some Republicans fear that Paxton, who is <a data-id=\"https://thehill.com/homenews/campaign/5729642-paxton-cornyn-hypothetical-runoff/\" data-type=\"link\" href=\"https://thehill.com/homenews/campaign/5729642-paxton-cornyn-hypothetical-runoff/\">leading Cornyn in some polls</a>, would prove to be a <a data-id=\"https://thehill.com/homenews/campaign/5744208-cornyn-warns-of-massacre-if-paxton-beats-him-in-texas-gop-primary/\" data-type=\"link\" href=\"https://thehill.com/homenews/campaign/5744208-cornyn-warns-of-massacre-if-paxton-beats-him-in-texas-gop-primary/\">divisive candidate</a> in a general election and could turn off independents or spur a big enough Democratic turnout to flip the seat.</p>\n<p>However, Republican strategists generally believe that Texas state Rep. James Talarico (D) would need to be the Democratic nominee to give Democrats a likely <a data-id=\"https://thehill.com/homenews/campaign/5744369-cbs-late-show-controversy/\" data-type=\"link\" href=\"https://thehill.com/homenews/campaign/5744369-cbs-late-show-controversy/\">chance of winning</a> a race against Paxton.</p>\n<p>A recent University of Texas/Texas Politics Project poll found Rep. Jasmine Crockett (D-Texas) <a data-id=\"https://thehill.com/homenews/campaign/5755382-jasmine-crockett-leads-texas-senate/\" data-type=\"link\" href=\"https://thehill.com/homenews/campaign/5755382-jasmine-crockett-leads-texas-senate/\">leading Talarico</a> 56 percent to 44 percent in a survey of 369 voters conducted from Feb. 2-16.</p>\n<p>The survey also showed Paxton narrowly leading Cornyn 36 percent to 34 percent in a three-way poll with Hunt, who garnered 26-percent support.</p>\n<p>A separate poll from the Hobby School of Public Affairs at the University of Houston published earlier this month showed Paxton in the lead with 38 percent support from likely Republican voters and Cornyn with 31-percent support. Hunt brought in 17 percent support.</p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/state-watch/5758488-john-thune-texas-senate-race-democrats/",
            "pub_date": "2026-02-27 21:05:57",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5756601,
            "title": "'Preferred pronouns' have no place in a rape trial",
            "description": "<p>If a certain crime can only be committed by a male, can there be justice for the accuser when the male defendant is called “she?”</p>\n<p>A case in Madera County, California, winding its way to trial, will soon decide guilt or innocence of the defendant, Tremaine Carroll, a trans-identifying male. It will also test how far the U.S. criminal justice system will go to affirm the beliefs of men who profess female identities when they stand accused of the overwhelmingly male crime of rape. </p>\n<p>Outside the U.S., compelled use of female pronouns to describe accused male sex-offenders has been widely reported, resulting in such verbal abominations at trial and in rulings as “<a href=\"https://www.dailymail.co.uk/news/article-12035403/Her-penis-NSW-District-Court-judge-Alister-Adadees-comments-child-sex-offender-criticised.html\">her penis</a>.” But this case may be the first in the U.S. to compel the use of female pronouns to describe a man accused of rape.</p>\n<p>Carroll is a felon in the California prison system. Since the state’s <a href=\"https://leginfo.legislature.ca.gov/faces/billTextClient.xhtml?bill_id=201920200SB132\">Transgender Respect, Agency, and Dignity Act took effect in 2021</a>, men in California prisons, including violent felons like Carroll charged with sex offenses who have intact genitals, can request transfer to women’s prisons based on self-identification as transgender. After serving more than twenty-two years in the men’s prison, Carroll was thus transferred to a California women’s correctional facility in 2021 — because he claimed to be a woman. </p>\n<p>Besides being a violent felon, Carroll is also one of four trans-identified male inmates hand-selected by the American Civil Liberties Union to <a href=\"https://static1.squarespace.com/static/5f232ea74d8342386a7ebc52/t/627ae5341fb9965df6503ecd/1652221238536/Memo+to+support+motion+to+intervene.pdf\">intervene</a> in a <a href=\"https://womensliberationfront.org/chandler-v-cdcr-women\">lawsuit</a> brought by <a href=\"https://womensliberationfront.org/\">my organization</a> on behalf of six female inmates. We charge (among other things) that placing males in women’s facilities subjects female inmates to cruel and unusual punishment under the Constitution’s Eighth Amendment, including sexual assaults, attempted rapes, voyeurism and a pervasive climate of sexual intimidation. </p>\n<p>Awkwardly for the ACLU, Carroll was eventually returned to the men’s facility after being accused of raping two female inmates within a 24-hour period.</p>\n<p><a href=\"https://womensliberationfront.org/news/update-court-transcript-shows-california-da-forced-to-call-alleged-male-rapist-sheher\">A hearing</a> took place on Dec. 16 to decide whether the court would compel the prosecution and witnesses in Carroll’s rape trial to refer to him by she/her pronouns. Representing the people of California, Deputy District Attorney Eric DuTemple objected that to do so would undermine the charge. Carroll, he noted, “is a biological male with male genitalia who is currently housed in a male prison and is accused of committing two rapes against two females, a crime that can only be committed by a biological male. … [T]he court compelling us to use that language, which is contrary to the facts, could indicate approval for the defendant’s legal position.”</p>\n<p>Forced usage of these pronouns also certainly runs contrary to our legal theory of the case — that the defendant is using the pronouns simply to get into a female prison so he can carry on such unlawful sexual contacts or rapes.</p>\n<p>The defense most succinctly described what was at stake in the judge’s ruling, stating, “This case really is about setting a precedent across the board” for referring to transgender litigants. The use of incorrect “she/her” pronouns would lead to confusion at trial and in court hearings. It would also be disrespectful and traumatic to the victims in any such future cases, forcing them to police their own language while testifying about being raped.</p>\n<p>In this case, to call Carroll “she” would deprive the people of California of justice. “She” refers to a female, and no female could commit the crime of which Carroll is accused, which involves vaginal penetration by a penis. It would also be an affront to his female accusers, who know full well the sex of their attacker. </p>\n<p>Judge Katherine Rigby rejected the argument that using she/her pronouns would interfere with the prosecution’s rape charge, leaning heavily on nonbinding discussion in a California case that observing a litigant’s professed “gender identity” is a matter of “respect, courtesy, and dignity” and protections for “gender identity” in California judicial canons. And so in a trial involving forcible rape — a crime only a male could commit — she ordered the prosecution to refer to the defendant by female pronouns.</p>\n<p>But Rigby deferred ruling on how witnesses can refer to the defendant. Perhaps she understood that the principles of “respect, courtesy, and dignity” are inconsistent with requiring a witness to refer to the man she has accused of raping her as anything other than a man. </p>\n<p>The point at which she will have to make that decision is now approaching. A hearing to set the trial date will occur on March 6, and additional motions on the pronoun issue can be expected. </p>\n<p>Should this case go to trial, justice can only be served by reversing the order requiring the prosecution to use female pronouns and by allowing witnesses to testify freely, in truthful terms, unrestricted by gender circumlocutions. </p>\n<p>A trial is a process for arriving at truth. Should the court subvert the hard truth of Carroll’s sex — which is foundational to the rape charge against him — to the subjective feeling of gender identity, the trial risks becoming instead a taxpayer-funded exercise in affirmation of the accused at the expense of justice for his accusers.</p>\n<p><em>N.K. Stade is board treasurer for the Women’s Liberation Front.</em></p>",
            "kind": 1,
            "link": "https://thehill.com/opinion/criminal-justice/5756601-preferred-pronouns-have-no-place-in-a-rape-trial/",
            "pub_date": "2026-02-27 20:45:54",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5753204,
            "title": "I had serious jaw surgery — and they refused to give me pain meds",
            "description": "<p>Years ago, <a href=\"https://www.foxnews.com/opinion/liberty-vittert-opioid-crisis-patients-life-threatening-pain\" rel=\"noreferrer noopener\" target=\"_blank\">I wrote</a> about the opioid crisis and the dangers of punishing legitimate pain patients in our rush to address addiction. I warned that we were reacting too strongly to the problem, swinging too far in the opposite direction. </p>\n<p>I never imagined I would become an exhibit for that warning.</p>\n<p>I recently underwent extensive maxillofacial surgery — jaw bone removal for osteomyelitis. The doctor even said, “You’ll be in real pain” — that’s when you know it’s gonna be bad. My surgeon’s office called the day before to go over my pre-operative care and also to inform me they would not be prescribing any opioid pain medication.</p>\n<p>Why not? Because I had an existing prescription  for a different opioid — even though it was one that had run out and was sitting, unused, in a medicine cabinet at my parent’s house four states away. They told me to “just use that” for my post-surgical pain.</p>\n<p>Never mind that the other opioid medication had been prescribed at a very specific dose for a completely different reason. Never mind that I was going to be in severe pain after having my jaw reconstructed. The answer was no. </p>\n<p>When I pushed back, they made me feel like I was drug-seeking simply for asking for appropriate post-surgical pain management.</p>\n<p>I am not the first person to have such a thing happen. After I wrote a piece about this six years ago I received many emails from readers who had received similar treatment — even people undergoing terminal cancer. Recently, a close friend — a prominent plastic surgeon who has spent her career caring for patients — developed a severe infection in her wisdom teeth. She too was denied stronger pain medication. Let me repeat that — a prominent plastic surgeon who clearly understands pain management was told simply, “Take ibuprofen.”</p>\n<p>This is medical malpractice hiding behind the guise of policy for good. </p>\n<p>I know the opioid crisis is devastatingly real. I live in West Virginia, a state that has been devastated by opiates. In 2025, approximately 73,000 Americans died from opioid overdoses. But the data tell that these deaths are not coming from your surgeon’s prescription pad.</p>\n<p>According to the CDC, 92 percent of opioid overdose deaths involved synthetic opioids — that is, illicitly manufactured fentanyl and street drugs. Prescription opioid deaths have been rapidly declining for years, dropping to around 13,000 in 2023 and remaining <a href=\"http://wonder.cdc.gov/\" rel=\"noreferrer noopener\" target=\"_blank\">relatively stable</a>.</p>\n<p>In the U.S., if fentanyl involvement in overdoses had remained constant rather than skyrocketing, we would have approximately <a href=\"https://www.sciencedirect.com/science/article/pii/S2667193X25002364\" rel=\"noreferrer noopener\" target=\"_blank\">260,000 more deceased people living among us today</a> — about four times the number who attended the Super Bowl in person this year.</p>\n<p>You want to know what’s killing us? In 2024, <a href=\"https://www.cnn.com/2025/02/03/politics/us-canada-trade-fentanyl-fact-check/index.html\" rel=\"noreferrer noopener\" target=\"_blank\">22,000 lbs</a> of fentanyl was seized at U.S. borders. For context, just two milligrams of fentanyl — an amount that fits on the tip of a pencil — is enough to be lethal. So the amount seized is the equivalent of 5 billion lethal doses — enough to kill every man, woman, and child in the U.S. 15 times over. And that is just what was seized — much more gets through each year.</p>\n<p>The Centers for Disease Control guidelines acknowledge that its recommendations have been misapplied in harmful ways, including “rigid application of opioid dosage thresholds” and actions that “contributed to patient harm, including untreated and undertreated pain, serious withdrawal symptoms, worsening pain outcomes, psychological distress, overdose, and suicidal ideation and behavior.”</p>\n<p>What’s really happening is that doctors are terrified, and they are hurting people because of it. </p>\n<p>We have created a system where doctors are more afraid of prescribing appropriately than they are of leaving patients to suffer. They are scared scrutiny from federal authorities and state medical board investigators. They fear being labeled as “pill mill” doctors. They have watched colleagues face prosecution and they have reacted by taking the safest route — prescribing nothing or prescribing inadequately.</p>\n<p>Meanwhile, assumptions that appropriate prescribing will lead to addiction is totally unproven. Studies show that roughly <a href=\"https://pmc.ncbi.nlm.nih.gov/articles/PMC7440649/\" rel=\"noreferrer noopener\" target=\"_blank\">94 percent of patients</a> don’t even try to refill their opioid prescriptions. They take what they need, and then they stop.</p>\n<p>When I left the surgeon’s office, groggy from the anaesthesia, jaw throbbing, being told I couldn’t have appropriate pain medication, I thought about the thousands of patients going through the same thing — sent home from surgery, from emergency rooms, from dental procedures, to suffer needlessly because we have overcorrected.</p>\n<p>The opioid crisis is real. The prescription-to-addiction pipeline was real and required intervention. But we have now created a new crisis in the form of systematic undertreatment of acute pain in America. We have turned appropriate medical care into a guilty act.</p>\n<p>What about the elderly woman after hip replacement or the construction worker after a serious accident? They suffer in silence, told their pain “isn’t that bad” or that they should “tough it out.”</p>\n<p>This isn’t health care. It is abandonment.</p>\n<p>The data are clear: prescription opioids are not driving the overdose crisis. Illicit fentanyl is. And it’s time we direct our outrage and resources toward the flood of deadly synthetic opioids pouring across our borders from abroad. Because right now, we’re fighting yesterday’s war while innocent patients pay the price.</p>\n<p><em>Liberty Vittert is a professor of data science at Washington University in St. Louis and the resident on-air statistician for NewsNation, a sister company of The Hill.</em></p>",
            "kind": 1,
            "link": "https://thehill.com/opinion/healthcare/5753204-doctors-fear-prescribing-opioids/",
            "pub_date": "2026-02-27 20:16:01",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5758443,
            "title": "Where things stand in Texas ahead of the primary",
            "description": "<p><strong><em>Morning Report is The Hill’s a.m. newsletter. </em></strong><a href=\"http://www.thehill.com/signup\"><strong><em>Subscribe here</em></strong></a><strong><em>.</em></strong></p>\n<p>In today’s issue:</p>\n<p>▪ Texas primaries in home-stretch</p>\n<p>▪ Bill Clinton sets precedent with testimony</p>\n<p>▪ Netflix out, paving Paramount takeover of WBD</p>\n<p>▪ Pentagon’s war of words against Anthropic</p>\n<p><strong>President Trump</strong> heads to Texas today amid final campaigning in two of the country’s most closely watched electoral contests before midterm primaries in the Lone Star State next week.</p>\n<p>Texas’s elections kick off a series of primaries throughout the country over the next six months, and the marquee Senate battle is capturing the political spotlight.</p>\n<p>The race has already set a record as the <a href=\"https://thehill.com/homenews/campaign/5755015-texas-senate-primary-spending/\">most expensive Senate primary</a> in U.S. history, with $110 million spent in campaign advertising. Most of that spending has been on the GOP side.</p>\n<p>Polling shows a close race among the three Republican candidates, with Texas Attorney General <strong>Ken Paxton</strong> holding a slight lead in the <a href=\"https://polls.decisiondeskhq.com/averages/primary-ballot-test/2026-tx-us-senate-gop/texas/republicans-lv-rv-adults-independents\">Decision Desk HQ (DDHQ) polling average</a>, an advantage he’s held for months over incumbent Sen. <strong>John Cornyn</strong> (R). Paxton is narrowly ahead in the average with 36.5 percent support, closely followed by Cornyn with 32.2 percent and Rep. <strong>Wesley Hunt</strong> (R) in third with 18 percent.</p>\n<p>On the Democratic side, state Rep. <strong>James Talarico</strong> and Rep. <strong>Jasmine Crockett</strong> are <a href=\"https://polls.decisiondeskhq.com/averages/primary-ballot-test/2026-tx-us-senate-dem/texas/lv-rv-adults-independents-democrats\">neck and neck</a> in the DDHQ polling average, with 44.4 percent support for Talarico to Crockett’s 44.1 percent.</p>\n<p>But polling has been much more limited than on the Republican side. A few of the polls have also been affiliated with a campaign or its supporters, including a few showing Talarico ahead, and are viewed with some skepticism as to their reliability.</p>\n<p>Cornyn is locked in the race of his political life as he tries to fend off primary challenges from Paxton and Hunt. Both have sought to brand the GOP senator as a “RINO,” or Republican in name only, and as insufficiently supportive of the president, while Cornyn has pushed back in stressing his conservative bona fides.</p>\n<p>Although Cornyn has been an institution unto himself in Texas politics, having served in his Senate seat for more than two decades, he faces a significant uphill battle to clinching renomination.</p>\n<p>Texas election law requires a candidate to receive a majority of the vote to win a primary outright, so the top two candidates appear almost certain to advance to a runoff in May.</p>\n<p>The race has gotten increasingly intense as the primary approaches, though Cornyn and Paxton are longtime rivals and have been trading barbs with each other for months.</p>\n<p>Cornyn has attacked Paxton for various controversies concerning both his public and private life, including an indictment on security fraud charges he faced and an <a href=\"https://thehill.com/homenews/state-watch/4207133-ken-paxton-acquitted-in-texas-impeachment-trial/\">unsuccessful impeachment effort</a> over accusations of bribery. The <a href=\"https://thehill.com/homenews/ap/ap-top-headlines/ap-texas-ag-ken-paxton-reaches-deal-to-end-securities-fraud-charges-after-9-years/\">indictment was dismissed</a> after he reached a deal with prosecutors to pay restitution.</p>\n<p>Paxton has hit back at Cornyn for a few instances in which the senator broke with his party, including when he supported former <strong>President Biden</strong>’s <a href=\"https://thehill.com/homenews/senate/3534316-senate-advances-gun-safety-bill-overcoming-filibuster/\">bipartisan gun safety law</a> passed after the Uvalde, Texas, shooting, and he accused him of being disloyal to Trump.</p>\n<p>But Cornyn’s campaign escalated its offensive on Paxton to a new level this week in slamming him over <a href=\"https://x.com/JacobRubashkin/status/2026676061644173678?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E2026676061644173678%7Ctwgr%5Ec04417fed15df193cfb6fa65d1a8af43b5324bff%7Ctwcon%5Es1_&amp;ref_url=https%3A%2F%2Fwww.mediaite.com%2Fmedia%2Fnews%2Fcrooked-ken-paxton-cheated-on-his-wife-scathing-new-ad-goes-there-in-effort-to-stop-fraud-from-sinking-texas-gop%2F\">an alleged extramarital affair</a>. Paxton and his wife are currently in the process of getting a divorce.</p>\n<p><em>“Unlike John Cornyn, who’s become a desperate shell of a man clinging to power, my campaign is not about attacking someone else’s family,”</em> Paxton said in a <a href=\"https://x.com/KenPaxtonTX/status/2027101165553586430?s=20\">post on the social platform X</a>, including a new ad of his own featuring his daughter praising him and his values.</p>\n<p>The remaining X factor in the race is whether the president will weigh in to give what would likely be a highly influential endorsement to any candidate. He’s previously praised all three candidates but hasn’t revealed any preference.</p>\n<p>Trump’s visit to Corpus Christi, Texas, today is on official business, but political observers will be watching for any hint of whom he may be supporting next week, The Hill’s <a href=\"https://thehill.com/?p=5757641\">Julia Mueller and Julia Manchester report</a>.</p>\n<p>▪ <a href=\"https://thehill.com/homenews/campaign/5720732-texas-senate-democrats-infighting/\">Politico</a>: <em>Republicans freaking out over Texas race.</em></p>\n<p>Meanwhile, Crockett and Talarico, who are both seen as rising stars within the Democratic Party, are battling for the chance to pull off what would be a major upset in the general election.</p>\n<p>Texas has consistently voted Republican for years on the federal and state level, but both candidates have expressed optimism about the chances of flipping it blue, though they’d have different approaches in doing so.</p>\n<p>Crockett has gained national attention for her strong pushback against Trump and his Republican allies, sometimes using catchy phrases that go viral online. One of the most prominent instances came in 2024 <a href=\"https://thehill.com/blogs/in-the-know/4677117-jasmine-crockett-trademark-bleach-blonde-bad-built-butch-body-marjorie-taylor-greene/\">during a faceoff</a> with former Rep. <strong>Marjorie Taylor Greene</strong> (R-Ga.).</p>\n<p>Talarico, a Presbyterian seminarian, has taken a different approach, seeking to present a more conciliatory message to those who may have voted for Trump and other Republicans in the past.</p>\n<p>The race became heated earlier this month over comments Talarico <a href=\"https://thehill.com/homenews/campaign/5720732-texas-senate-democrats-infighting/\">allegedly made</a> about Crockett and former Rep. <strong>Colin Allred</strong> (D-Texas).</p>\n<p>Polls have shown a tight race, with Crockett leading in a few of the most recent public, independent polls.</p>\n<p>One important factor will be how much Talarico’s appearance on <strong>Stephen Colbert</strong>’s “Late Show” and the controversy surrounding the decision not to air it on television will affect the race.</p>\n<p>Talarico saw a <a href=\"https://thehill.com/homenews/campaign/5744369-cbs-late-show-controversy/\">significant fundraising boost</a> following the interview, which aired on YouTube, and polling since then has been limited.</p>\n<p>With only two major candidates in the Democratic race, one is likely to get more than 50 percent support and clinch the nomination, preventing a runoff.</p>\n<p>Both candidates have argued their approach is the right one to give Democrats a fighting chance in Texas. The time to choose one of two significantly diverging paths arrives Tuesday.</p>\n<p>▪ <a href=\"https://thehill.com/homenews/campaign/5757044-cardi-b-endorses-jasmine-crockett/\">The Hill</a>: <strong><em>Cardi B</em></strong><em> tells followers to support Crockett.</em></p>\n<hr class=\"wp-block-separator has-alpha-channel-opacity\"/>\n<h2 class=\"wp-block-heading\">Smart Take with Blake Burman</h2>\n<p>In a surprise to reporters in Chappaqua, N.Y., last night, <strong>Hillary Clinton</strong> spoke after her deposition with the House Oversight and Government Reform Committee and even took reporters’ questions. Clinton maintained she “did not know <strong>Jeffrey Epstein</strong>” and criticized the committee for asking about other issues, <a href=\"https://thehill.com/homenews/house/5758013-hillary-clinton-epstein-deposition/\">including UFOs</a>. I asked <strong>Richard Goodstein</strong>, a former Clinton adviser, what he thinks former <strong>President Clinton</strong> might say today. </p>\n<p>“Look, Epstein was a donor to Democratic causes, so he ended up, you’d see pictures of him in the White House when Clinton was there. I had pictures like that too. And then he took Epstein’s plane on these foundation missions. That’s what he’s going to say,” <a href=\"https://thehill.com/video/hillary-clinton-testifies-on-epstein/11560227/\" rel=\"noreferrer noopener\" target=\"_blank\">Goodstein told me</a>.</p>\n<p>After months of negotiations, the Clintons called for their testimony to be public. Given we saw Hillary Clinton go before reporters, you’d have to imagine the former president follows suit. No matter what happens today, the videos of the depositions are expected in the coming days.</p>\n<figure class=\"wp-block-image size-large\"><a href=\"https://thehill.com/video/hillary-clinton-testifies-on-epstein/11560227/\"><img alt=\"\" class=\"wp-image-5758239\" decoding=\"async\" height=\"214\" loading=\"lazy\" sizes=\"auto, (max-width: 899px) 100vw, 384px\" src=\"https://thehill.com/wp-content/uploads/sites/2/2026/02/BlakeBurman_02262026_NewsNation.png?w=384\" srcset=\"https://thehill.com/wp-content/uploads/sites/2/2026/02/BlakeBurman_02262026_NewsNation.png?resize=384,214 384w, https://thehill.com/wp-content/uploads/sites/2/2026/02/BlakeBurman_02262026_NewsNation.png?resize=160,90 160w, https://thehill.com/wp-content/uploads/sites/2/2026/02/BlakeBurman_02262026_NewsNation.png?resize=300,167 300w, https://thehill.com/wp-content/uploads/sites/2/2026/02/BlakeBurman_02262026_NewsNation.png?resize=256,144 256w, https://thehill.com/wp-content/uploads/sites/2/2026/02/BlakeBurman_02262026_NewsNation.png?resize=50,28 50w\" width=\"384\"/></a></figure>\n<p><em>Burman hosts “The Hill” weeknights, 6p/5c on NewsNation.</em></p>\n<hr class=\"wp-block-separator has-alpha-channel-opacity\"/>\n<h2 class=\"wp-block-heading\">3 Things to Know Today</h2>\n<ol class=\"wp-block-list\" start=\"1\">\n<li><strong>Paramount has won the battle to acquire</strong> Warner Bros. Discovery after Netflix said it <a href=\"https://thehill.com/homenews/media/5757985-netflix-declines-warner-discovery/\">wouldn’t match the company’s bid</a>. The merger now will need approval from the Department of Justice to go through.</li>\n<li><strong>At least two individuals involved</strong> in the <a href=\"https://thehill.com/policy/international/5758064-us-citizens-shootout-cuba-boat/\">shooting with Cuban forces</a> on Wednesday were U.S. citizens, a U.S. official told The Hill’s sister network NewsNation. One individual died, while the other was injured.</li>\n<li><strong>Pakistan has declared “open war”</strong> on Afghanistan after the Pakistani defense minister said <a href=\"https://www.wsj.com/world/asia/pakistan-declares-open-war-with-afghanistan-after-cross-border-attacks-f09a7fce?mod=hp_lead_pos2\" rel=\"noreferrer noopener\" target=\"_blank\">patience has “run out”</a> on repeated attacks by Afghan forces and the Pakistani Taliban. Pakistan launched a series of airstrikes in various regions of Afghanistan in response.</li>\n</ol>\n<h2 class=\"wp-block-heading\">Leading the Day</h2>\n<figure class=\"wp-block-image size-large\"><img alt=\"\" class=\"wp-image-5758089\" decoding=\"async\" height=\"720\" loading=\"lazy\" sizes=\"auto, (max-width: 899px) 100vw, 876px\" src=\"https://thehill.com/wp-content/uploads/sites/2/2026/02/Leading-Bill-Clinton_092425_AP_Andres-Kudacki.jpg?resize=1280,720\" srcset=\"https://thehill.com/wp-content/uploads/sites/2/2026/02/Leading-Bill-Clinton_092425_AP_Andres-Kudacki.jpg 1400w, https://thehill.com/wp-content/uploads/sites/2/2026/02/Leading-Bill-Clinton_092425_AP_Andres-Kudacki.jpg?resize=160,90 160w, https://thehill.com/wp-content/uploads/sites/2/2026/02/Leading-Bill-Clinton_092425_AP_Andres-Kudacki.jpg?resize=300,169 300w, https://thehill.com/wp-content/uploads/sites/2/2026/02/Leading-Bill-Clinton_092425_AP_Andres-Kudacki.jpg?resize=768,432 768w, https://thehill.com/wp-content/uploads/sites/2/2026/02/Leading-Bill-Clinton_092425_AP_Andres-Kudacki.jpg?resize=1280,720 1280w, https://thehill.com/wp-content/uploads/sites/2/2026/02/Leading-Bill-Clinton_092425_AP_Andres-Kudacki.jpg?resize=645,363 645w, https://thehill.com/wp-content/uploads/sites/2/2026/02/Leading-Bill-Clinton_092425_AP_Andres-Kudacki.jpg?resize=320,180 320w, https://thehill.com/wp-content/uploads/sites/2/2026/02/Leading-Bill-Clinton_092425_AP_Andres-Kudacki.jpg?resize=256,144 256w, https://thehill.com/wp-content/uploads/sites/2/2026/02/Leading-Bill-Clinton_092425_AP_Andres-Kudacki.jpg?resize=512,288 512w, https://thehill.com/wp-content/uploads/sites/2/2026/02/Leading-Bill-Clinton_092425_AP_Andres-Kudacki.jpg?resize=640,360 640w, https://thehill.com/wp-content/uploads/sites/2/2026/02/Leading-Bill-Clinton_092425_AP_Andres-Kudacki.jpg?resize=876,492 876w, https://thehill.com/wp-content/uploads/sites/2/2026/02/Leading-Bill-Clinton_092425_AP_Andres-Kudacki.jpg?resize=960,540 960w, https://thehill.com/wp-content/uploads/sites/2/2026/02/Leading-Bill-Clinton_092425_AP_Andres-Kudacki.jpg?resize=50,28 50w\" width=\"1280\"/><figcaption class=\"wp-element-caption\">Former President Clinton speaks during the Clinton Global Initiative on Sept. 24, 2025, in New York. (Andres Kudacki, Associated Press file)</figcaption></figure>\n<p><strong>SETTING PRECEDENT</strong>: House Democrats are eyeing precedent being set Friday when former <strong>President Clinton</strong> testifies in the Oversight and Government Reform Committee’s investigation into <strong>Jeffrey Epstein</strong>.</p>\n<p>While it’s unclear how much Clinton will have to say about the investigation itself, Democrats have not hidden the fact they believe receiving testimony from a former president will help pave the path to eventually bring Trump before Congress, especially under a future Democratic House majority.</p>\n<p>Democrats aren’t wasting any time in making the argument.</p>\n<p><em>“This committee has now set a new precedent about talking to presidents and former presidents,” </em>Rep. <strong>Robert Garcia </strong>(Calif.), the top Democrat on the Oversight panel, <a href=\"https://thehill.com/homenews/house/5757651-oversight-democrat-trump-testify-epstein/\" rel=\"noreferrer noopener\" target=\"_blank\">told reporters</a> Thursday. <em>“We’re demanding immediately that we ask President Trump to testify in front of our committee and be deposed in front of Oversight Republicans and Democrats.”</em></p>\n<p>Trump was subpoenaed in the investigation of the House committee investigating the Jan. 6, 2021, Capitol riot, but the subpoena was later withdrawn. Democrats, many of whom supported requiring Clinton to testify, hope Friday’s testimony will help compel Trump to testify in future investigations whenever Democrats retake the House and get subpoena power again.</p>\n<p>A former president testifying before Congress is <a href=\"https://www.senate.gov/committees/SittingPresidentsVicePresidentsWhoHaveTestifiedBeforeCongressionalCommittees.htm\">not entirely unprecedented</a>, but is extremely rare. The last president to do so was <strong>Gerald Ford</strong>, who appeared for the noncontroversial topic of celebrating the bicentennial of the Constitution in the 1980s.</p>\n<p>Clinton’s agreement to sit for a deposition came after an extensive back-and-forth that he and his wife, former Secretary of State <strong>Hillary Clinton</strong>, had with committee Chair <strong>James Comer</strong> (R-Ky.).</p>\n<p>Although the Clintons said they didn’t have any additional information to share relevant to the panel’s investigation, Comer and the committee went forward with a threat to hold them in contempt to compel their testimony.</p>\n<p>After it became clear that the full House was likely to pass the contempt resolutions, the Clintons reversed course and agreed.</p>\n<p>Though Bill Clinton’s name has appeared in some documents from the Epstein files, he hasn’t been accused of any wrongdoing.</p>\n<p>Hillary Clinton said during her testimony before the committee Thursday that she had <a href=\"https://thehill.com/homenews/house/5756577-clintons-questioned-epstein-links/\">no information to share</a> about the criminal activities of Epstein and his associate <strong>Ghislaine Maxwell </strong>and doesn’t remember ever meeting Epstein.</p>\n<p>Meanwhile, Republican senators are pressuring the Department of Justice (DOJ) to release all the files related to Epstein following multiple reports that some documents have remained concealed, The Hill’s <a href=\"https://thehill.com/homenews/senate/5757945-trump-epstein-files-release/\">Alexander Bolton reports</a>. This is despite top DOJ leaders saying last month that they released all documents required under the law.</p>\n<p>The documents seemingly include FBI interviews with a woman who accused Trump of sexually assaulting her decades ago.</p>\n<p>▪ <a href=\"https://thehill.com/?p=5757970/\">The Hill</a>: <em>The new Epstein files controversy, explained.</em></p>\n<p>▪ <a href=\"https://thehill.com/homenews/house/5756788-comer/\">The Hill</a>: <em>Comer says Commerce Secretary <strong>Howard Lutnick</strong> may be called to testify.</em></p>\n<p>▪ <a href=\"https://www.nytimes.com/2026/02/26/business/world-economic-forum-davos-epstein-brende.html\" rel=\"noreferrer noopener\" target=\"_blank\">The New York Times</a>: <em>World Economic Forum head steps down over Epstein ties.</em></p>\n<p>▪ <a href=\"https://www.nytimes.com/2026/02/26/nyregion/epstein-cooperating-witnesses-redaction-error.html\" rel=\"noreferrer noopener\" target=\"_blank\">The New York Times</a>: <em>Cooperating witnesses exposed in Epstein files.</em></p>\n<p><strong>ANOTHER DRONE SHOT DOWN</strong>: The U.S. military has shot down a Customs and Border Protection drone with a laser in Texas, <a href=\"https://thehill.com/policy/defense/5758344-texas-airspace-closure-drone/\" rel=\"noreferrer noopener\" target=\"_blank\">causing the closure of airspace</a> near the U.S.-Mexico border.</p>\n<p>This is second such incident involving a laser fired in Texas that prompted the closure of nearby airspace after an instance earlier this month in which the air traffic from the El Paso airport was briefly shut down for a few hours.</p>\n<p><strong>PROGRESS MADE?</strong> Omani Foreign Minister <strong>Badr al-Busaidi</strong> said U.S. and Iranian officials made “significant progress” in their talks to avoid a military conflict and reach a deal on Iran’s nuclear program.</p>\n<p>The officials met Thursday for the most recent round of discussions in Geneva, Switzerland, as the Trump administration considers the possibility of a strike on Iran if diplomacy fails. Oman has served as a mediator in the talks.</p>\n<p>Al-Busaidi said both sides will consult with their respective capitals, but technical discussions are expected to continue next week in Vienna. Trump has said he would prefer a diplomatic solution while refusing to take the possibility of a military strike off the table.</p>\n<p>House Democrats will force a vote next week to curb Trump’s authority to attack Iran without congressional authorization. But the resolution is <a href=\"https://thehill.com/homenews/house/5756657-democrats-trump-iran-war-powers/\">expected to fail</a> in the face of widespread opposition from most Republicans and a handful of Democrats.</p>\n<p>▪ <a href=\"https://thehill.com/homenews/senate/5756532-trump-iran-strikes-regime-change/?tbref=hp\">The Hill</a>: <em>Senate GOP leader says any strike on Iran should cause regime change.</em></p>\n<p><strong>WALTZ ON</strong>: A federal judge <a href=\"https://thehill.com/regulation/court-battles/5756822-judge-declines-halt-trump-white-house-construction/\">declined to pause</a> the president’s construction of a ballroom in the East Wing of the White House, ruling against preservationists who sued to block it, at least for now.</p>\n<p>U.S. District Judge <strong>Richard Leon</strong> ruled against the National Trust for Historic Preservation on the grounds that it didn’t properly challenge the $400 million project, but he said he would reevaluate if the organization amended its complaint.</p>\n<p>The trust and the government originally focused on Trump’s authority to tear down the East Wing and construct a new one, but Leon ruled the preservationists failed to bring the proper claim to test Trump’s authority to proceed without congressional approval.</p>\n<p><em>“To be fair, the President’s source of legal authority to construct the ballroom was not apparent before the National Trust brought its motion,”</em> Leon wrote.</p>\n<p>Trump praised the ruling in a post on Truth Social, calling it “great news” for the country and White House.</p>\n<p>▪ <a href=\"https://thehill.com/regulation/court-battles/5756356-supreme-court-tps-syria-trump/\">The Hill</a>: <em>Admin asks court to end temporary protections for Syrians.</em></p>\n<p><strong>MORTGAGE RATE DROP</strong>: Mortgage rates <a href=\"https://thehill.com/business/5757035-mortgage-rates-fall-below-6/\">fell below 6 percent</a> for the first time in more than three years, giving homebuyers a key opening.</p>\n<p>The 30-year fixed-rate mortgage averaged 5.98 percent on Thursday, a drop of 0.03 points from last week, according to <a href=\"https://www.freddiemac.com/pmms\">Freddie Mac</a>. The development comes as inflation also <a href=\"https://thehill.com/business/5736294-january-2026-inflation-report-cpi/\">fell to 2.4 percent</a> last month, slightly lower than economists were expecting.</p>\n<p>Trump touted falling mortgage rates in his State of the Union address Tuesday.</p>\n<p>Housing sales remained at a <a href=\"https://thehill.com/business/home-sales-30-year-low/\">30-year low</a> last year, continuing a steady annual decline dating back to 2022.</p>\n<p>▪ <a href=\"https://www.nytimes.com/2026/02/25/realestate/buyers-market-mortage-rates.html\">The New York Times</a>: <em>Housing market tilting back toward buyers.</em></p>\n<h2 class=\"wp-block-heading\">When &amp; Where</h2>\n<ul class=\"wp-block-list\">\n<li><strong>The president</strong> will travel to Corpus Cristi, Texas, where he will receive an energy briefing at 4:05 p.m. and deliver remarks on energy at 4:35 p.m. He will participate in a local TV interview later and then depart to go to Palm Beach, Fla. for the weekend.</li>\n<li><strong>The House and Senate </strong>won’t meet today.</li>\n</ul>\n<h2 class=\"wp-block-heading\">Zoom In</h2>\n<figure class=\"wp-block-image size-large\"><img alt=\"\" class=\"wp-image-5334928\" decoding=\"async\" height=\"720\" loading=\"lazy\" src=\"https://thehill.com/wp-content/uploads/sites/2/2025/06/GettyImages-2194823703.jpg?resize=1097,720\" width=\"1097\"/><figcaption class=\"wp-element-caption\">Anthropic CEO Dario Amodei attends the 55th Annual Meeting of the World Economic Forum in Davos, Switzerland, on Jan. 23, 2025. </figcaption></figure>\n<p><strong>‘GOD COMPLEX’</strong>: A top Pentagon official lashed out at Anthropic on Thursday night after the company rejected an ultimatum from officials to agree to terms on the use of its AI model, Claude.</p>\n<p>Defense Secretary <strong>Pete Hegseth</strong> gave a deadline of Friday afternoon for Anthropic to agree to the department’s terms or risk a $200 million contract being canceled. But Anthropic CEO <strong>Dario Amodei</strong> said the company wouldn’t agree and hopes the Pentagon changes its position.</p>\n<p>The company and the Pentagon have been <a href=\"https://thehill.com/policy/defense/5752960-pentagon-threatens-anthropic-contract/\" rel=\"noreferrer noopener\" target=\"_blank\">engaged in a standoff</a> over the use of Claude. The firm’s policy prohibits the usage of Claude for mass surveillance or to develop weapons that can be used without human oversight. </p>\n<p>But the Pentagon has insisted that Anthropic agree to the terms, which would allow the Pentagon to use the firm’s AI models for “all lawful uses.”</p>\n<p>Following Amodei’s announcement, Under Secretary of Defense for Research and Engineering<strong> Emil Michael </strong>slammed the tech CEO as a “liar” with a “God-complex.”</p>\n<p><em>“He wants nothing more than to try to personally control the US Military and is ok putting our nation’s safety at risk,”</em> he said in a <a href=\"https://x.com/uswremichael/status/2027211708201058578?s=46\" rel=\"noreferrer noopener\" target=\"_blank\">post on X</a>. <em>“The </em><em>@DeptofWar</em><em> will ALWAYS adhere to the law but not bend to whims of any one for-profit tech company.”</em></p>\n<p><em>“Not hard to believe that ⁦</em><em>@AnthropicAI</em><em>⁩ dropped their own safety policy but thinks they should dictate ours,”</em> he said in <a href=\"https://x.com/uswremichael/status/2027218087976546810?s=46\" rel=\"noreferrer noopener\" target=\"_blank\">another post</a>, linking to a story about Anthropic removing a central safety pledge.</p>\n<p>The Pentagon warned Anthropic on Tuesday that it could invoke the Defense Production Act (DPA), which gives the president widespread authority to control domestic industries for national defense.</p>\n<p>Experts <a href=\"https://thehill.com/policy/technology/5757667-pentagon-threatens-anthropic-dpa/\" rel=\"noreferrer noopener\" target=\"_blank\">told The Hill’s Julia Shapero and Filip Timotija</a> that invoking the DPA on Anthropic would be unusual and isn’t what the law was intended for.</p>\n<p>▪ <a href=\"https://thehill.com/policy/defense/5756397-pentagon-removes-joint-chiefs-director/\">The Hill</a>: <em>Pentagon removes director of Joint Staff.</em></p>\n<p>▪ <a href=\"https://thehill.com/policy/technology/5755283-instagram-launches-new-tool-alerting-parents-about-suicide-self-harm-searches/\">The Hill</a>: <em>Instagram launches new child safety tool.</em></p>\n<h2 class=\"wp-block-heading\">Elsewhere</h2>\n<figure class=\"wp-block-image size-large\"><img alt=\"\" class=\"wp-image-5758088\" decoding=\"async\" height=\"720\" loading=\"lazy\" sizes=\"auto, (max-width: 899px) 100vw, 876px\" src=\"https://thehill.com/wp-content/uploads/sites/2/2026/02/Elsewhere-Columbia_021023_AP_Ted-Shaffrey.jpg?resize=1280,720\" srcset=\"https://thehill.com/wp-content/uploads/sites/2/2026/02/Elsewhere-Columbia_021023_AP_Ted-Shaffrey.jpg 1400w, https://thehill.com/wp-content/uploads/sites/2/2026/02/Elsewhere-Columbia_021023_AP_Ted-Shaffrey.jpg?resize=160,90 160w, https://thehill.com/wp-content/uploads/sites/2/2026/02/Elsewhere-Columbia_021023_AP_Ted-Shaffrey.jpg?resize=300,169 300w, https://thehill.com/wp-content/uploads/sites/2/2026/02/Elsewhere-Columbia_021023_AP_Ted-Shaffrey.jpg?resize=768,432 768w, https://thehill.com/wp-content/uploads/sites/2/2026/02/Elsewhere-Columbia_021023_AP_Ted-Shaffrey.jpg?resize=1280,720 1280w, https://thehill.com/wp-content/uploads/sites/2/2026/02/Elsewhere-Columbia_021023_AP_Ted-Shaffrey.jpg?resize=645,363 645w, https://thehill.com/wp-content/uploads/sites/2/2026/02/Elsewhere-Columbia_021023_AP_Ted-Shaffrey.jpg?resize=320,180 320w, https://thehill.com/wp-content/uploads/sites/2/2026/02/Elsewhere-Columbia_021023_AP_Ted-Shaffrey.jpg?resize=256,144 256w, https://thehill.com/wp-content/uploads/sites/2/2026/02/Elsewhere-Columbia_021023_AP_Ted-Shaffrey.jpg?resize=512,288 512w, https://thehill.com/wp-content/uploads/sites/2/2026/02/Elsewhere-Columbia_021023_AP_Ted-Shaffrey.jpg?resize=640,360 640w, https://thehill.com/wp-content/uploads/sites/2/2026/02/Elsewhere-Columbia_021023_AP_Ted-Shaffrey.jpg?resize=876,492 876w, https://thehill.com/wp-content/uploads/sites/2/2026/02/Elsewhere-Columbia_021023_AP_Ted-Shaffrey.jpg?resize=960,540 960w, https://thehill.com/wp-content/uploads/sites/2/2026/02/Elsewhere-Columbia_021023_AP_Ted-Shaffrey.jpg?resize=50,28 50w\" width=\"1280\"/><figcaption class=\"wp-element-caption\">Students relax on the front steps of Low Memorial Library on the Columbia University campus, in New York City, Feb. 10, 2023. (Ted Shaffrey, Associated Press file)</figcaption></figure>\n<p><strong>STUDENT RELEASED</strong>: A Columbia University student <a href=\"https://thehill.com/homenews/education/5757727-columbia-student-aghayeva-trump-ice-dhs/\">has been released</a> after being detained by federal agents who entered a residential building under false pretenses.</p>\n<p>Columbia said Thursday that federal immigration authorities <a href=\"https://thehill.com/homenews/education/5756715-columbia-immigration-dhs-student-arrest/\">detained the student</a>, identified as senior <strong>Ellie Aghayeva</strong>, after misrepresenting their purpose for entering the building.</p>\n<p><em>“Our understanding at this time is that the federal agents made misrepresentations to gain entry to the building to search for a ‘missing person,’”</em> acting university President <strong>Claire Shipman</strong> said in a statement.</p>\n<p>Aghayeva later posted on her Instagram story that the Department of Homeland Security “illegally arrested me” and asked for help.</p>\n<p>But Aghayeva was let go after New York City Mayor <strong>Zohran Mamdani</strong> (D) <a href=\"https://thehill.com/homenews/education/5757505-dhs-detainment-mamdani-trump-meeting-ice-columbia/\">expressed concerns</a> to Trump during a meeting, and the president said she would be released “imminently.”</p>\n<p>Columbia said it doesn’t allow federal agents into nonpublic buildings without a warrant.</p>\n<p>While the situation has seemingly been defused, it’s the latest incident in a series of controversial arrests at academic institutions, including the detainment of Columbia graduate <strong>Mahmoud Khalil</strong> last year.</p>\n<p>▪ <a href=\"https://thehill.com/homenews/education/5754978-anti-ice-out-student-protests-virginia-texas-florida/\">The Hill</a>: <em>High school walkouts over immigration enforcement stir debates.</em></p>\n<p><strong>OLYMPIC CONTROVERSY</strong>: A joke by the president to the U.S. men’s Olympic hockey team is sparking pushback online and from at least one player of the women’s team.</p>\n<p>Trump called the men’s team after they won the gold medal at the games last weekend, inviting them to the White House. He said he would have to invite the women’s team, which also won gold, as well and would be impeached if he didn’t do so, eliciting laughter from the men’s team.</p>\n<p><strong>Hilary Knight</strong>, the captain of the women’s team, <a href=\"https://thehill.com/homenews/administration/5756125-us-womens-hockey-captain-hilary-knight-trump-state-of-the-union-joke/\" rel=\"noreferrer noopener\" target=\"_blank\">told reporters</a> she thought the joke was “distasteful and unfortunate.” She said it shouldn’t overshadow the team’s accomplishments.</p>\n<p>Meanwhile, another controversy is brewing, concerning a <a href=\"https://apnews.com/article/olympics-hockey-trump-743d42c4ad45a0eb36e281f70a505661\" rel=\"noreferrer noopener\" target=\"_blank\">doctored TikTok video shared</a> by the White House that made it seem like men’s hockey player <strong>Brady Tkachuk</strong> was disparaging Canadians after winning the gold medal. Tkachuk pushed back, saying he wouldn’t say what the video portrayed him saying.</p>\n<h2 class=\"wp-block-heading\">Opinion</h2>\n<ul class=\"wp-block-list\">\n<li><strong>Americans don’t need announcements, they need lower drug prices</strong>, <a href=\"https://thehill.com/opinion/healthcare/5755590-fixing-pharmacy-bill-system/\">Sen. Ruben Gallego (D-Ariz.) writes</a> in The Hill.</li>\n<li><strong>Orban and Fico: Putin’s NATO pawns</strong>, <a href=\"https://thehill.com/opinion/national-security/5754969-slovakia-fico-hungary-orban-putin/\">Mark Toth and Jonathan Sweet write</a> in The Hill.</li>\n</ul>\n<h2 class=\"wp-block-heading\">The Closer</h2>\n<figure class=\"wp-block-image size-large\"><img alt=\"\" class=\"wp-image-5758091\" decoding=\"async\" height=\"720\" loading=\"lazy\" sizes=\"auto, (max-width: 899px) 100vw, 876px\" src=\"https://thehill.com/wp-content/uploads/sites/2/2026/02/Quiz-SOTU_040217_AP_Uncredited.jpg?resize=1280,720\" srcset=\"https://thehill.com/wp-content/uploads/sites/2/2026/02/Quiz-SOTU_040217_AP_Uncredited.jpg 1400w, https://thehill.com/wp-content/uploads/sites/2/2026/02/Quiz-SOTU_040217_AP_Uncredited.jpg?resize=160,90 160w, https://thehill.com/wp-content/uploads/sites/2/2026/02/Quiz-SOTU_040217_AP_Uncredited.jpg?resize=300,169 300w, https://thehill.com/wp-content/uploads/sites/2/2026/02/Quiz-SOTU_040217_AP_Uncredited.jpg?resize=768,432 768w, https://thehill.com/wp-content/uploads/sites/2/2026/02/Quiz-SOTU_040217_AP_Uncredited.jpg?resize=1280,720 1280w, https://thehill.com/wp-content/uploads/sites/2/2026/02/Quiz-SOTU_040217_AP_Uncredited.jpg?resize=645,363 645w, https://thehill.com/wp-content/uploads/sites/2/2026/02/Quiz-SOTU_040217_AP_Uncredited.jpg?resize=320,180 320w, https://thehill.com/wp-content/uploads/sites/2/2026/02/Quiz-SOTU_040217_AP_Uncredited.jpg?resize=256,144 256w, https://thehill.com/wp-content/uploads/sites/2/2026/02/Quiz-SOTU_040217_AP_Uncredited.jpg?resize=512,288 512w, https://thehill.com/wp-content/uploads/sites/2/2026/02/Quiz-SOTU_040217_AP_Uncredited.jpg?resize=640,360 640w, https://thehill.com/wp-content/uploads/sites/2/2026/02/Quiz-SOTU_040217_AP_Uncredited.jpg?resize=876,492 876w, https://thehill.com/wp-content/uploads/sites/2/2026/02/Quiz-SOTU_040217_AP_Uncredited.jpg?resize=960,540 960w, https://thehill.com/wp-content/uploads/sites/2/2026/02/Quiz-SOTU_040217_AP_Uncredited.jpg?resize=50,28 50w\" width=\"1280\"/><figcaption class=\"wp-element-caption\">President Woodrow Wilson delivers a declaration of war to the joint session of Congress, in Washington, April 2, 1917. (Associated Press)</figcaption></figure>\n<p><em>And finally … </em>👏👏👏 Congrats to this week’s <strong>Morning Report quiz winners</strong>! They knew their stuff about the history of the president’s annual speech to Congress.</p>\n<p>Here’s who went 4/4: <strong>Richard Baznik, Stan Wasser, Michael Salanik, Chuck Schoenenberger, Melissa McBurney, Rick Schmidtke, Carmine Petracca, Jess Elger, Pam Manges, Linda L. Field, William Chittam, Jenessa Wagner, Luther Berg, Ned Sauthoff, William Moore, John Ciorciari, Robert Bradley, Mark R. Williamson, Sari Wisch, Steve James </strong>and <strong>Savannah Petracca</strong>.</p>\n<p><strong>Woodrow Wilson</strong> restored the custom of the president delivering the State of the Union speech in person before Congress when he took office in 1913. Every president has delivered an in-person address since then.</p>\n<p>Trump <a href=\"https://www.presidency.ucsb.edu/documents/presidential-documents-archive-guidebook/annual-messages-congress-the-state-the-union-0\">surpassed the previous record</a> held by <strong>Bill Clinton</strong>, who spoke for about one hour and 29 minutes in his 2000 address. Trump also surpassed his own record from last year for longest congressional address, which was about 100 minutes. The first address by the president to Congress technically isn’t considered a State of the Union.</p>\n<p><strong>Ronald Reagan</strong> was the only president listed who never gave a response to a State of the Union. Gerald Ford, George H.W. Bush, Bill Clinton and Joe Biden all gave a response before eventually becoming president and giving the address themselves.</p>\n<p>The <strong>secretary of Interior</strong> has <a href=\"https://www.presidency.ucsb.edu/documents/presidential-documents-archive-guidebook/annual-messages-congress-the-state-the-union-1\">most commonly been the designated survivor</a> at seven times. The secretaries of Veterans Affairs and Agriculture are tied for second with six times each.</p>",
            "kind": 1,
            "link": "https://thehill.com/newsletters/morning-report/5758443-texas-primaries-trump-clinton/",
            "pub_date": "2026-02-27 20:01:29",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5758046,
            "title": "Some Republicans increasingly frustrated stock trading ban touted by Trump is stalled",
            "description": "<p>Some House Republicans are growing increasingly frustrated with leadership for not moving the ball quickly enough on a stock trading ban, an issue that has vexed Congress for years despite repeated bipartisan calls for reform.</p>\n<p>Last month, the House Administration Committee advanced a bill by Chairman Bryan Steil (R-Wis.) that would allow members of Congress, their spouses and their dependent children to hold onto the stocks they already own but prevent them from buying new ones. No action, however, has been taken on the bill since.</p>\n<p>And the lack of movement has pushed some rank-and-file Republicans to renew calls for a stock trading ban, especially after President Trump urged Congress to pass legislation on the matter during his State of the Union address Tuesday night.</p>\n<p>“If you have a strong bipartisan majority in Congress (supporting the issue), if you have overwhelming support from the public. You have the president of the United States specifically referencing it in the State of the Union, why pray tell is it not put on the floor?” Rep. Brian Fitzpatrick (R-Pa.) said.</p>\n<p>He added that a stock trading ban is long “overdue.”</p>\n<p>“It’s very frustrating,” Fitzpatrick said. “This should have been the first thing we took up.”</p>\n<p>Steil’s bill isn’t the only stock trading ban that’s been introduced.</p>\n<p>Fitzpatrick had endorsed a bipartisan bill last year sponsored by Reps. Chip Roy (R-Texas) and Seth Magaziner (D-R.I.), dubbed the “Restore Trust in Congress Act,” that would bar lawmakers, their spouses, dependent children and trustees from owning, buying or selling individual stocks.</p>\n<p>Rep. Anna Paulina Luna (R-Fla.) had introduced a discharge petition to force a vote on Roy and Magaziner’s bill; however, leadership ended up advancing Steil’s bill, dubbed the “Stop Insider Trading Act,” through committee.</p>\n<p>Trump urged members of Congress during his speech on Tuesday to pass Steil’s legislation “without delay.”</p>\n<p>Luna, referencing Trump’s speech, wrote on<a href=\"https://x.com/RepLuna/status/2026529605696274879\"> the social platform X</a>, “PASS THE STOP INSIDER TRADING ACT NOW!”</p>\n<p>“This is going to be a great vote. Banning insider trading needs to happen!” Luna wrote in a follow-up tweet.</p>\n<p>Speaker Mike Johnson (R-La.) told reporters on Wednesday that Steil’s bill will get a House vote “soon,” according to<a href=\"https://news.bgov.com/bloomberg-government-news/johnson-expects-vote-on-trump-backed-stock-buying-ban-soon?taid=699f1a469bba4c0001379f8c&amp;utm_campaign=trueanthem&amp;utm_medium=social&amp;utm_source=twitter\"> Bloomberg News.</a></p>\n<p>But complicating matters for Johnson is whether he has enough votes for the bill to pass. </p>\n<p>Johnson is currently operating with a 218-214 majority, meaning he can afford only one Republican defection and still pass party-line legislation. Virtually every Democrat will oppose Steil’s bill because the minority party is pushing for any ban to include the president, vice president and their families.</p>\n<p>Rep. Tim Burchett (R-Tenn.) said he’s leaning towards opposing Steil’s bill, which he argues falls short of addressing the issue. He also said he doesn’t see the Senate taking up the bill, even if it did pass the House.</p>\n<p>“I think if they do, they’re going to pass something that’s totally different than what we have,” Burchett said. “And we don’t agree on it, and then they all giggle and laugh in both parties as it fails and they continue on their insider stock trading.”</p>\n<p>When asked why there’s been a stalled effort on a stock trading ban overall, Burchett said, “glaciers sprint past Congress.”</p>\n<p>“We move at a very record slow pace,” he said. “We always have, since I’ve been there under Democrats and under Republicans.”</p>\n<p>Fitzpatrick said he would support Steil’s bill because he believes it’s “incremental progress,” but he added that he doesn’t think it goes “far enough” to “fix the system.”</p>\n<p>Meanwhile, House Democrats introduced a discharge petition last month to force action on a bill banning members of Congress, the president, the vice president and their immediate families from owning, holding and trading stocks. Magaziner had introduced the bill last year, with support from House Minority Leader Hakeem Jeffries (D-N.Y.).</p>\n<p>Democrats have blasted Steil’s bill, arguing that it doesn’t extend to the executive branch and allows members to still sell their existing stocks.</p>\n<p>“I want something to be very clear: That this bill that has been introduced by Republican leadership is not a congressional stock trading ban,” Rep. Alexandria Ocasio-Cortez (D-N.Y.) told reporters last month. “It was written by and for the absolute wealthiest members of Congress to look like they are passing a ban, but … it actually creates a ton of new [avenues] by which they can own, buy and sell stock in even greater shadows from public opinion. … They can call it whatever they want, but it is not a stock trading ban.”</p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/house/5758046-republicans-stock-trading-ban-trump-state-of-the-union/",
            "pub_date": "2026-02-27 19:11:42",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5757970,
            "title": "The big new controversy over the Epstein files, explained",
            "description": "<p>When the Department of Justice released more than 3 million pages of documents relating to the convicted sexual predator Jeffrey Epstein on Jan. 30, the sheer volume of the material was dizzying.</p>\n<p>It always seemed plausible that important elements of the release would take time to emerge as reporters and researchers dug into the massive trawl.</p>\n<p>This is exactly what has happened. Major news outlets this week picked up on reporting, which first came from an independent journalist, about potentially vital documents that appear not to have been made publicly available.</p>\n<p>It’s a complicated story. Here’s what you need to know.</p>\n<h2 class=\"wp-block-heading\"><strong>What is the core of the controversy?</strong></h2>\n<p>Documents outlining three of four FBI interviews apparently related to a woman who accused President Trump, as well as Epstein, of sexually assaulting her decades ago, seem to be missing from the latest release. </p>\n<p>The woman made the claims in 2019, but they date back to the 1980s, when she was a minor.</p>\n<p>Her allegation against Trump is uncorroborated. The president has denied all wrongdoing in relation to his friendship with Epstein, which ended roughly two decades ago.</p>\n<p>Also, The Guardian late on Thursday <a href=\"https://www.theguardian.com/us-news/2026/feb/26/trump-epstein-files-fbi\">published a story</a> in which it said its reporters had obtained the missing documents and that the woman’s claims “at times appear outlandish.”</p>\n<h2 class=\"wp-block-heading\"><strong>What’s the broader explanation? </strong></h2>\n<p>The latest release of the Epstein files includes a 2021 catalogue of material provided to Ghislaine Maxwell’s legal team. </p>\n<p>Maxwell, Epstein’s sometime-girlfriend, was tried and convicted of sex trafficking charges at the end of that year. The <a href=\"https://www.justice.gov/epstein/files/DataSet\" rel=\"noreferrer noopener\" target=\"_blank\">data set</a> lists “non-testifying witness material.”</p>\n<p>It includes anonymized reference to four interviews relating to one person, who has the case number 3501.045.</p>\n<p>Of those four interviews, only one appears to have been publicly released. </p>\n<p>In that interview, the woman makes detailed allegations of rape by Epstein but makes no allegation of abuse against Trump. </p>\n<p>The president is mentioned only in relation to a friend sending the woman a photograph. In her interview with FBI agents, the woman notes she still has this photo saved in her cellphone messages but asks if she can crop it so it shows only Epstein.</p>\n<p>When she was asked why she wanted to crop the photo, she hesitated, and the notes reflect that her “attorney advised [she] was concerned about implicating additional individuals, and specifically any that were well known, due to fear of retaliation.” The photo, according to the FBI account of the interview, was “a widely distributed photograph” of Epstein and Trump.</p>\n<p>The strand of the Epstein story centering on this woman was first brought to light by independent journalist Roger Sollenberger.</p>\n<p>Sollenberger, and subsequently outlets including NPR, The New York Times and CNN, have traced details about the woman in question that match a woman who made the serious but unproven allegation of sexual assault against Trump.</p>\n<p>Some commentators have pointed to the fact that four interviews took place as a sign that investigators believed the woman to be credible. But her credibility would not, in itself, prove any specific claim to be true. Furthermore, The Guardian’s story noted that it had “identified a woman matching the biographical details in the FBI records. She has faced several fraud and theft charges in Washington and, in 2023, a felony charge for the exploitation of an elderly person in Georgia. It is not clear how those cases were resolved.”</p>\n<h2 class=\"wp-block-heading\"><strong>What does the DOJ and the White House have to say?</strong></h2>\n<p>The Department of Justice (DOJ) is adamant that it has done nothing wrong and is not hiding anything for nefarious reasons.</p>\n<p>In one social media post earlier this week, the DOJ said that “NOTHING has been deleted.” The <a href=\"https://x.com/DOJRR47/status/2026366459375497413?s=20\" rel=\"noreferrer noopener\" target=\"_blank\">post asserted</a>: “ALL responsive documents have been produced unless a document falls within one of the following categories: duplicates, privileged, or part of an ongoing federal investigation.”</p>\n<p>This has not quelled disquiet around the story, however.</p>\n<p>The Hill <a href=\"https://thehill.com/homenews/senate/5757945-trump-epstein-files-release/\">reported</a> on Thursday that several Republican senators were putting pressure on the DOJ to release all possible files. Sen. John Kennedy (R-La.), asked whether material containing this woman’s allegations should be held back, replied: “I don’t know how else to say it: Release the documents.”</p>\n<p>On Wednesday, the DOJ said that it was conducting a review because “several individuals and news outlets have recently flagged files related to documents produced to Ghislaine Maxwell.” </p>\n<p>It <a href=\"https://x.com/DOJRR47/status/2026769082159112295?s=20\" rel=\"noreferrer noopener\" target=\"_blank\">added that if any file</a> was discovered to have been kept out of the public eye when it should not have been, “the Department will of course publish it, consistent with the law.”</p>\n<p>Trump has not addressed this specific element of the controversy in any in-depth way, but, <a href=\"https://thehill.com/homenews/5746028-trump-responds-prince-andrew-arrest/\" rel=\"noreferrer noopener\" target=\"_blank\">speaking with reporters</a> last week, he claimed he had “been totally exonerated” in the Epstein matter. </p>\n<p>White House statements to multiple news outlets this week have echoed that claim.</p>\n<h2 class=\"wp-block-heading\"><strong>What about Democrats</strong>?</h2>\n<p>Democrats, especially those serving on the House Oversight and Government Reform Committee, which has been probing the Epstein matter, have been scathing.</p>\n<p>On Wednesday, the House Oversight Democrats’s <a href=\"https://x.com/OversightDems/status/2026781758897717280?s=20\" rel=\"noreferrer noopener\" target=\"_blank\">account on the social platform X</a> asserted: “The Department of Justice continues to change its story. The facts are clear: documents related to a survivor who accused Donald Trump and Jeffery Epstein of abuse when she was a minor are missing from the released files.” </p>\n<p>Rep. Robert Garcia (D-Calif.), the committee’s ranking member, told MS NOW on Tuesday that he had gone to the Department of Justice in person to probe the matter further.</p>\n<p>“Those additional documents <a href=\"https://x.com/RepRobertGarcia/status/2026421331844280785?s=20\" rel=\"noreferrer noopener\" target=\"_blank\">seem to be missing</a>,” Garcia said, “and that’s something that I confirmed as of yesterday in my visit to the Department of Justice. The idea that there is a possible cover-up or that we are hiding actual documentation of an alleged crime by the President of the United States … is incredibly serious.”</p>\n<h2 class=\"wp-block-heading\"><strong>Where does the story go from here?</strong></h2>\n<p>The focus on the story has become so intense that pressure for disclosure of the interview notes is intense. However, the new reporting from The Guardian may dilute at least some of that pressure.</p>\n<p>Meanwhile, the problem for those pressing for disclosure is, if the DOJ says it has valid reasons for not making the interviews public, it is hard to definitively prove them wrong.</p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/administration/5757970-epstein-files-missing-interviews/",
            "pub_date": "2026-02-27 19:11:42",
            "source": "thehill",
            "language": "en"
        }
    ]
}