{
    "data": [
        {
            "id": 5759741,
            "title": "Democrats seek a campaign message that goes beyond anti-Trump",
            "description": "<p>LEESBURG, VA — House Democrats promising to flip the chamber in this year’s midterms are fighting to avoid a pitfall they see as hazardous to their goal.</p>\n<p>The message, they say, can’t just be anti-Trump.</p>\n<p>While the president’s <a href=\"https://thehill.com/homenews/administration/5751721-trump-approval-ratings-state-of-union/\">approval ratings</a> are well under water — and <a href=\"https://www.cnn.com/2026/02/23/politics/trump-approval-rating-independents-cnn-poll\">polls indicate</a> that key constituencies have soured on him after a tumultuous first year back in office — Democrats say they can’t lean on that unpopularity to secure victory in November. Instead, they’re racing to cobble together a menu of specific policy priorities to act as both the centerpiece of their campaign message and the heart of their early legislative agenda if they win control of the Speaker’s gavel in 2027. </p>\n<p>“This cycle isn’t just about what we’re up against. We’ve got to present a real plan to the American people,” Rep. Greg Stanton (D-Ariz.) said.</p>\n<p>That task was the focus of the Democrats’ annual issues conference this week in Northern Virginia, where lawmakers huddled for three days in search of the 2026 equivalent of the “Six for ‘06” message that helped them seize the House exactly two decades ago. </p>\n<p>If the details are fuzzy, the core theme is not.</p>\n<p>“Affordability is the message,” Rep. Lauren Underwood (Ill.), a vice-chair of the Democrats’ messaging arm, told reporters at the retreat. </p>\n<p>Beneath the umbrella of affordability, Democrats are focusing on five different areas where they see Americans being hit hardest by rising costs — and think Republicans are most vulnerable. Those are: Health care; housing; groceries; electricity and other utilities; and caregiving, including childcare and eldercare.</p>\n<p>What specific proposals they tack into their final messaging package remains a work in progress. But Democrats of all stripes made clear that they’re taking pains to be proactive and aggressive in proposing economic reforms that tackle kitchen-table concerns, rather than merely attacking Trump.</p>\n<p>“We’ve got to make sure we build out the policies and programs that we’ve talked about this week, and make sure we roll those out for the American people so they see that we’ve got,” said Rep. Glenn Ivey (D-Md.). “Not just the opposition to Trump and what he’s doing, but we’ve got an affirmative agenda.”</p>\n<p>By coincidence, this year’s conference came directly on the heels of Trump’s State of the Union address, which he delivered to Congress on Tuesday night. If the back-to-back events created some logistical hassles for the conferencing Democrats, it also lent them plenty of fodder for challenging the president’s policy record during his first year back in office.</p>\n<p>More than a few Democrats highlighted Trump’s domestic message during the speech, which painted a glowing picture of a booming economy under his watch and claimed cost reductions on consumer staples even for items, like beef and electricity, that have seen costs soar. His one mention of “affordability” was made to blame Democrats for sending inflation through the roof under former President Biden, thereby creating the cost-of-living crisis.</p>\n<p>“The same people in this chamber who voted for those disasters suddenly used the word affordability — a word, they just used it because somebody gave it to them, knowing full well that they caused and created the increased prices that all of our citizens had to endure,” he said. “You caused that problem.”</p>\n<p>The finger pointing drew a fierce response from the Democrats in Leesburg, who accused the wealthy president of being out of touch with working-class people. </p>\n<p>“We have a cost-of-living emergency in America. The affordability crisis is crushing the hopes and dreams of the American people, and what was Donald Trump’s response? He mocked Americans in the term ‘affordability,’” Rep. Ted Lieu (Calif.), the vice chairman of the Democratic Caucus, said on the first day of the conference.</p>\n<p>“He was mocking people who are experiencing monthly bills that were far too high.”</p>\n<p>It’s not that Democrats think Trump will be a non-factor in the midterms. To the contrary, they see his low approval ratings as a boon to their party. And they went out of their way this week to highlight polls indicating that the president’s support among minority voters — which had risen dramatically in 2024 — was now cratering a year into his second term. That includes Asian, Black and Hispanic voters, who seem to be shifting away from the president. </p>\n<p>A <a href=\"https://www.cnn.com/2026/02/23/politics/trump-approval-rating-independents-cnn-poll\">CNN poll</a> released this week found that his support among Hispanics, for instance, has fallen from 41 percent to 22 percent over the last year. </p>\n<p>“He is less popular than burnt rice and beans in our community, and his collapse in Hispanic support will have reverberations across House seats this November,” Rep. Darren Soto (D-Fla.), a member of the Congressional Hispanic Caucus, told reporters in Virginia.</p>\n<p>Still, even the Democrats from the minority caucuses are cautioning that an anti-Trump message isn’t enough to secure the House in November. To win those voters back to the Democratic column will take a promise of specific legislation tailor-made to address the anxieties — economic and otherwise — of those communities. </p>\n<p>“It’s not enough for us to just say, ‘Hey, we told you so.’ We’ve also got to say, ‘Here’s what we’re going to do as Democrats,” said Rep. Ami Bera (D-Calif.), a member of the Congressional Asian Pacific-American Caucus. “That’s the opportunity that Donald Trump has created for Democrats.” </p>\n<p>If Democrats are in the early stages of compiling their campaign contract to voters, they did offer strong clues as to what might be included. </p>\n<p>Premium subsidies under ObamaCare, for instance, expired at the start of the year and are poised to be a major issue heading into the midterms. </p>\n<p>“Health care is a winning issue for Democrats,” Underwood said. </p>\n<p>Easing the cost of childcare and elder care is another issue that polls well for Democrats, who are eyeing an aggressive legislative response to include a permanent extension of the child tax credit and a bill capping childcare at $15 a day.</p>\n<p>“This is an existential financial problem for working families, and Democrats continue to be the only party that is taking it seriously,” said Rep. Katherine Clark (Mass.), the Democratic whip. “It’s going to be at the heart of our agenda in the House majority.” </p>\n<p>Rep. Emanuel Cleaver (D-Mo.), a longtime housing advocate, used the annual retreat to make the case that, if Democrats win the House, they should make H.R.-1 — the bill that’s symbolically their top priority — “a big pile of the housing legislation that we haven’t been able to get through.” </p>\n<p>“For most people in the country, they are able to see that housing — affordable housing — is one of the top domestic issues they face,” said Cleaver, a senior member of the Congressional Black Caucus. “We are also facing the reality that discrimination is still a major issue for African Americans.” </p>\n<p>One notable omission this year was campaign finance reform. In the last two Congress’s that Democrats have controlled the House — a period, under former Speaker Nancy Pelosi (D-Calif.), that spanned from 2019 to 2023 — Democrats’ had made campaign finance their very top priority, the issue featured as H.R.-1 in both the 116th and 117th Congresses. At this conference, it was never mentioned in three days of press conferences. </p>\n<p>Some Democrats said the issue remains important, but given the tumult of Trump’s second term, they’ve simply had to focus their energies elsewhere. </p>\n<p>“Other things drowned it out. Times change,” Cleaver said. “That doesn’t mean that we’ve lost the commitment. But we’re overwhelmed.”</p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/house/5759741-democrats-campaign-message-trump-affordability/",
            "pub_date": "2026-02-28 19:11:37",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5758935,
            "title": "Pell Grant funding shortfall on the horizon as nearly 2 million more students qualify",
            "description": "<p>Pell Grants, the federal <a href=\"https://thehill.com/homenews/education/5525572-college-tuition-federal-aid/\">financial aid program</a> that helps low-income Americans afford college and has enjoyed broad bipartisan support, are projected to have big funding shortfalls that could jeopardize the education of thousands of students.  </p>\n<p>The grants, which have recently seen expanded eligibility, give low-income students a chance to go to college without incurring debt. But the program itself is in financial difficulties with a projected shortfall of billions of dollars that could lead to trouble for students as soon as 2028.   </p>\n<p>By the end of this fiscal year, the Congressional Budget Office (CBO) projects the Pell Grant program will be $5 billion in debt. Over the next 10 years, that number jumps to between $104 billion and $132 billion if nothing is done about the issue.  </p>\n<p>The projections come even after lawmakers gave the program a one-time boost of $10.5 billion in President Trump’s One Big Beautiful Bill Act last year.  </p>\n<p>The Committee for a Responsible Federal Budget said interruptions to full Pell Grant awards would begin as soon as the 2028-2029 school year, according to these projections. </p>\n<p>“The current Pell Grant funding shortfall is this time primarily driven by an increase in eligible students for the program, which is due to changes to the Pell eligibility formula, and that was because of the FAFSA Simplification Act, which was passed back in 2021,” said Megan Walter, senior policy analyst at the National Association of Student Financial Aid Administrators. </p>\n<p>“So, beginning with the 24-25 award year, more students were eligible for Pell than normal, and sometimes for more than they were eligible for in the past … It’s also due to Congress not increasing discretionary funding for the program in recent years,” she added. “In short, they expanded eligibility without allocating more funding to the program, which is going to create a shortfall every time.” </p>\n<p>Lawmakers also added new short-term workforce Pell Grants, which the CBO projects could cost an additional $2 billion over the next decade. </p>\n<p>In the 2025-2026 school year, almost 7.5 million students, around 40 percent of them going to college, received Pell Grants.  </p>\n<p>An analysis by the National College Attainment Network (NCAN) said the FAFSA Simplification Act gave Pell Grant eligibility to another 1.7 million students, a 27 percent jump.  </p>\n<p>“I think the streamlined process also demonstrates that there’s really strong demand for college and post-secondary education, despite the national narrative and there’s also bipartisan support for the program. It was expanded to include short term workforce training programs. It was expanded to include students who are incarcerated, so members of Congress from both parties want to make this program available to more students, and that does come with a price tag,” said Catherine Brown, senior director of policy and advocacy at NCAN. </p>\n<p>The Hill has reached out to the Education Department for comment.</p>\n<p>There are numerous ways lawmakers could go about addressing the shortfall.  </p>\n<p>The Trump administration has previously suggested cutting the maximum award amount to $5,710. It currently sits at $7,395.  </p>\n<p>Other options would be increasing the number of credits to be considered a full-time student to receive the maximum Pell Grant award or only allowing the full award for eight semesters instead of 12.  </p>\n<p>But, Walter said, “None of those changes have been enacted in response to the current shortfall or past shortfalls, so no idea if they would actually do any of that, and I don’t know those would make significant enough changes to really make up” the gap.</p>\n<p>A popular preference by advocates is full, mandatory funding of the Pell Grants to stabilize the program. </p>\n<p>“I think the best scenario and long-term solution would be full mandatory funding,” Walter said. </p>\n<p>The bright spot for the program is the long-standing bipartisan support, which advocates believe make it unlikely for the program to be completely cut or sufficiently downsized.   </p>\n<p>The Hill has reached out to Rep. Tim Walberg (R-Mich.), chairman of the House Education and the Workforce Committee, and Rep. Bobby Scott (D-Va.), ranking member of the House committee, for comment. </p>\n<p>“In reconciliation, House Republicans proposed targeted reforms to reduce the shortfall and encourage completion — a responsible approach that recognizes fiscal realities,” Walberg said in a statement to Inside Higher Ed.  </p>\n<p> “We will continue to advocate for concrete solutions to ensure Pell remains strong and focused on students with the greatest need,” he added. </p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/education/5758935-pell-grant-funding-shortfall-college-students/",
            "pub_date": "2026-02-28 19:11:37",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5759555,
            "title": "DHS funding impasse deepens as lawmakers blow by first payday",
            "description": "<p>The impasse over funding the Department of Homeland Security (DHS) is showing no signs of easing as lawmakers barreled past the first reduced paychecks for agency employees on Friday and the <a href=\"https://thehill.com/homenews/senate/5759394-schumer-jeffries-white-house-dhs-shutdown/\">shutdown of the agency</a> hits the two-week mark.</p>\n<p>Lawmakers have spun their wheels for a full month over how to fund DHS for the remainder of fiscal year 2026, with talks between the White House and Democratic negotiators showing scant progress despite the increasing chances of employees missing payday.</p>\n<p>The desire to pay federal workers on time is normally a key pressure point in government shutdowns, and with the first missed payday behind them — and most DHS employees reporting to work regardless of the funding lapse — both sides are worried that there is little on the immediate horizon that can break the stalemate.</p>\n<p>“How can you get a win on both sides?” Sen. John Hickenlooper (D-Colo.) said. “I just haven’t figured that out yet.” </p>\n<p>Democrats made their last counteroffer to Republicans on Feb. 16, one that went unanswered for nearly two weeks before the White House formally responded late Thursday night. </p>\n<p>“[On Thursday], the White House made another serious counter offer,” a White House official said. “Democrats need to make a move to end the shutdown before more Americans are harmed by a lack of funding for critical services like disaster relief.”</p>\n<p>Spokespeople for Senate Minority Leader Chuck Schumer (D-N.Y.) and House Minority Leader Hakeem Jeffries (D-N.Y.) said in a statement that they are “reviewing [the offer] closely.”</p>\n<p>“Democrats remain committed to keep fighting for real reforms to rein in ICE and stop the violence,” they said in a statement. </p>\n<p>Both sides have aired similar complaints throughout the discussions: that the opposite party is not negotiating in good faith and has not made meaningful concessions.</p>\n<p>Republicans have argued that Democrats, who are feeling the political wind at their backs, are uninterested in a deal and would rather have immigration enforcement as a midterms issue than solve the problem. They’ve also dismissed the Feb. 16 counterproposal an near- carbon copy of Democrats’ opening list of demands.</p>\n<p>“We’ve got to have a partner that actually wants to make a deal. It seems like the Democrats have concluded that this is may be good politics for them,” Senate Majority Leader John Thune (R-S.D.) told reporters on Thursday. “It’s not for the people whose lives are affected on a daily basis, so we’ll keep pressing to try and get folks to the table.”</p>\n<p>Thune added that the two sides are continuing to trade paper in the hopes of “finding a sweet spot.” </p>\n<p>Democrats, meanwhile, have held steady on their demands, which were spurred by the immigration crackdown in Minneapolis that culminated with immigration agents fatally shooting two U.S. citizens. They insist they won’t send any more money to DHS unless it is accompanied by reforms to how the administration carries out immigration enforcement.</p>\n<p>Headlining those demands are tightening warrant requirements for immigration arrests, banning immigration agents from covering their faces while carrying out operations, and ending roving patrols in communities.</p>\n<p>Buoying the Democratic argument are polls that largely show that President Trump is underwater on the issue. According to a recent ABC News/Washington Post poll, 58 percent of respondents said they disapprove of Trump’s handling of immigration — a figure that’s only increased during his time in office. </p>\n<p>In addition, respondents said that they oppose the tactics Immigration and Customs Enforcement uses by a 2-1 margin (62 percent to 31 percent). </p>\n<p>Schumer told reporters last week that discussions were stagnant. </p>\n<p>“So far, we’ve heard crickets from them. Nothing. They’re not negotiating,” Schumer said before the White House sent its latest proposal. “They’re just trying to pass paper back and forth with no new changes.”</p>\n<p>Despite the political state-of-play, Republicans maintain that they have little reason to give in at this point, due largely to the $75 billion passed in the “big, beautiful bill” last year that keeps border operations going for the foreseeable future and covers ICE. </p>\n<p>That leaves the Transportation Security Administration (TSA), the Federal Emergency Management Agency (FEMA), the Secret Service and the Coast Guard hung out to dry in the interim, forcing them to work without pay. </p>\n<p>Lawmakers are most acutely concerned about the impact on TSA, worried about the possibility of employees refusing to come to work if they don’t receive paychecks.</p>\n<p>“There’s certainly potential for that,” Sen. John Kennedy (R-La.) said about the possibility of the shutdown lasting well into the future. “What I expect to happen is … regrettably, for airline flights to be impacted.”</p>\n<p>“I don’t know what the response will be of TSA, but TSA folks are good people too and you can’t ask somebody to work indefinitely without being paid,” Kennedy continued. “It’s just going to have an impact on performance. It’s inevitable.” </p>\n<p>Travel issues cropped up in recent days after DHS announced last weekend plans to suspend the Global Entry and TSA PreCheck programs. The decision was reversed for Precheck, but Global Entry remains shuttered for the time being. </p>\n<p>DHS Secretary Kristi Noem also indicated on Wednesday that PreCheck could still be shut down if the impasse continues — with lawmakers expecting the administration to potentially pull more levers in the coming days and weeks to make the shutdown more painful. </p>\n<p>“They’re going to eventually run out of money for those important agencies, so I think they’re being responsible,” said Sen. Eric Schmitt (R-Mo.). “But eventually, it’s going to start affecting passengers.” </p>\n<p><em>Julia Manchester contributed.</em></p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/senate/5759555-dhs-funding-shutdown-paychecks/",
            "pub_date": "2026-02-28 19:11:36",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5760058,
            "title": "US, Israel begin strikes on Iran; Trump urges regime change",
            "description": "<p>The United States and Israel on Saturday launched strikes on Iran after weeks of threats from President Trump, who has demanded Tehran scrap its nuclear program or face a new round of attacks.</p>\n<p>“A short time ago, the United States military began major combat operations in Iran,” Trump said in a video <a href=\"https://truthsocial.com/@realDonaldTrump/116147082884192486\">posted to Truth Social</a> at 2:30 a.m. “Our objective is to defend the American people by eliminating imminent threats from the Iranian regime, a vicious group of very hard, terrible people.”</p>\n<p>The president urged members of Iran’s military to lay down their arms and called on Iranians to topple the hardline regime that has controlled the country since the Islamic Revolution in 1979. </p>\n<p>“Bombs will be dropping everywhere. When we are finished, take over your government. It will be yours to take; this will be probably your only chance for generations,” Trump said. “America is backing you with overwhelming strength and devastating force. Now is the time to seize control of your destiny.” </p>\n<p>American embassies in Israel and Qatar issued shelter-in-place orders for U.S. citizens in those countries. </p>\n<p>Israel launched “preemptive” attacks against Iran and declared a state of emergency throughout the country, Israeli Defense Minister Israel Katz said on Saturday. </p>\n<p>“As a result, missile and drone launches against the State of Israel and its civilian population are expected in the very near term,” Katz <a href=\"https://x.com/israelarabic/status/2027630436671705469?s=46\">said in a statement</a>. </p>\n<p>The targets of the strikes were not immediately clear, however, The New York Times reported that Tehran residents witnessed smoke rising from the area where major government buildings, including the presidential palace and National Security Council, are located. </p>\n<p>The U.S. Central Command declined to comment. The Hill has reached out to the Pentagon. </p>\n<p>The attacks come just over a day after talks in Geneva wrapped up between U.S. and Iranian negotiators, mediated by Oman. </p>\n<p>Trump said on Friday that he was not happy about how the negotiations went, though he told reporters he remained undecided on strikes. </p>\n<p>Oman’s foreign minister told CBS’s “Face the Nation” on Friday that Iran has agreed to “zero stockpiling” of nuclear material in the talks, which he described as a breakthrough. </p>\n<p>For weeks, Trump has been publicly weighing military action. Joint Chiefs Chair Gen. Dan Caine <a href=\"https://thehill.com/homenews/administration/5751562-general-caine-iran-military-action/\">has reportedly warned of the risks</a> of strikes, while hawks including Sen. Lindsey Graham (R-S.C.) have pushed for military action with the goal of regime change. </p>\n<p>Reports emerged earlier this week that Trump was <a href=\"https://thehill.com/homenews/administration/5747382-trump-limited-strike-iran/?tbref=hp\">leaning toward limited strikes</a>, at least at first, in the hope of extracting concessions from Iran. </p>\n<p>The U.S. military has built up an enormous presence near Iran in recent weeks, dispatching F-35s, F-22s, refueling aircraft, positioning air defense systems and positioning two aircraft strikes groups in the region. </p>\n<p>Trump in the video posted Saturday morning reiterated his claims that Iran was seeking to rebuild its nuclear program and develop missiles that could reach America. </p>\n<p>“This regime will soon learn that no one should challenge the strength and might of the United States armed forces,” he said. </p>\n<p>“My administration has taken every possible step to minimize the risk to US personnel in the region,” he added. “Even so, and I do not make this statement lightly, the Iranian regime seeks to kill. The lives of courageous American heroes may be lost and we may have casualties, that often happens in war, but we’re doing this, not for now, we’re doing this for the future and it is a noble mission.”</p>\n<p><em>Updated: 2:56 a.m. EST</em></p>",
            "kind": 1,
            "link": "https://thehill.com/policy/defense/5760058-us-israel-launch-strikes-on-iran/",
            "pub_date": "2026-02-28 16:16:10",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5759982,
            "title": "Biden knocks Trump's State of the Union speech: 'Is he still talking?'",
            "description": "<p>Former President Biden on Friday knocked President Trump for his <a href=\"https://thehill.com/homenews/administration/5754101-trump-state-union-address-takeaways/\">record-length</a> State of the Union address, asking if his successor is “still talking.”</p>\n<p>Biden gave a critique about Trump and his record while celebrating six years since the former president won the 2020 South Carolina Democratic primary at a party held by the South Carolina Democratic Party. It is believed that Biden’s South Carolina victory was instrumental in putting him on the path to the 2020 nomination.</p>\n<p>“By the way did you see Trump give the State of Union?” Biden asked, which was met with boos. “Is he still talking? I don’t know. But folks, it’s unbelievable. The guy talks for almost two hours, but never mentions the anniversary of [Russian President Vladimir] Putin invading Ukraine. Never once.”</p>\n<p>Biden claimed that when he left office “border crossings in the United States were lower than the day that I entered an office inherited from Trump.”</p>\n<p>“On the day I left office, I handed Trump the strongest economy in the world. In the world, that’s not hyperbole,” the former president added. “That’s a fact.”</p>\n<p>Biden also said the U.S. is in the midst of “dark days,” facing threats that are “amplified in the ways we have never seen before.”</p>\n<p>“Our children are watching and I’m worried about what they are hearing so we have to be unapologetic for fighting for our country,” he said. </p>\n<p>Trump praised his administration’s accomplishments during his address on Tuesday. He took credit for a stronger economy than what he inherited from Biden and applauded his deportation agenda amid major Democratic pushback.</p>\n<p>Over one year into Trump’s second term, a <a href=\"https://thehill.com/homenews/administration/5721162-biden-trump-effectiveness-survey/\">slim majority</a> of Americans believe Biden handled the presidency better. Harvard University and The Harris Poll found last month that 51 percent of Americans think Trump is doing a worse job than Biden compared to 49 percent who said Trump is better than his predecessor.</p>\n<p>Both presidents were underwater in the eyes of respondents. Trump was seen unfavorably by 8 percent more respondents than those who viewed him favorably. The gap for Biden was 10 percent.</p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/administration/5759982-biden-criticizes-trump-sotu/",
            "pub_date": "2026-02-28 12:16:41",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5759963,
            "title": "US designates Iran as 'state sponsor of wrongful detention'",
            "description": "<p>The U.S. on Friday designated Iran as a “state sponsor of wrongful detention” and demanded that the country release any Americans in its detention. </p>\n<p>Secretary of State Marco Rubio issued the designation <a href=\"https://thehill.com/homenews/administration/5759142-trump-iran-strike-decision/\">amid escalating tensions</a> between the two countries and as President Trump considers launching strikes on Iran. Rubio cited Iran’s consolidation of power following the Iranian Revolution “by endorsing the hostage taking of U.S. embassy staff,” referring to the Iran Hostage Crisis.</p>\n<p>“For decades, Iran has continued to cruelly detain innocent Americans, as well as citizens of other nations, to use as political leverage against other states,” Rubio said in a <a href=\"https://www.state.gov/releases/office-of-the-spokesperson/2026/02/iran-designated-as-a-state-sponsor-of-wrongful-detention/\">statement</a>. “This abhorrent practice must end.”</p>\n<p>Rubio warned Iran that if it does not stop taking hostages, the U.S. will “be forced to consider additonal measures, including a potential geographic travel restriction on the use of U.S. passports to, through, or from Iran.” He added that Americans in Iran should “leave immediately” and that Americans should not visit the country “for any reason.”</p>\n<p>The designation does not levy penalties on Iran. The U.S. holds this travel restriction in place for North Korea, only allowing U.S. citizens to travel to North Korea with “special validation” passports issued by the State Department. </p>\n<p>The nonprofit group Hostage Aid Worldwide estimates that at least four Americans are in Iranian custody as of August 2025. Before then, former President Biden <a href=\"https://thehill.com/policy/international/4201036-bidens-new-deal-with-iran-draws-fierce-blowback/\">secured a deal</a> to release five American hostages in exchange for $6 billion in unfrozen funds going toward Tehran in 2023.</p>\n<p>Tensions have risen between the U.S. and Iran following widespread anti-government protests last month. Trump voiced his support for the demonstrators, called for new leadership in Tehran and sent several warships to the country’s coast. He warned that he would take military action if Iranian officials executed protesters, later saying he is considering a limited strike.</p>\n<p>On Friday, United Nations High Commissioner for Human Rights Volker Türk said at least eight people, including two children, were <a href=\"https://thehill.com/policy/international/5759707-iran-protests-death-sentences/\">sentenced to death</a> in connection with the protests, with another 30 also at risk of being sentenced to die. </p>\n<p>Negotiations kicked off earlier this month over the future of Iran’s nuclear program. These talks have produced little to no results, with Trump calling on Iran to strike a deal within a 10-day timeframe expected to end on Sunday. The third round of talks in Geneva, Switzerland, on Thursday failed to reach an agreement.</p>\n<p>“We haven’t made a final decision [on strikes],” Trump told reporters Friday. “We’re not exactly happy with the way they’re negotiating. They cannot have nuclear weapons. We’re not thrilled with the way they’re negotiating, so we’ll see how it all works out.”</p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/administration/5759963-us-designates-iran-hostages/",
            "pub_date": "2026-02-28 11:46:34",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5759842,
            "title": "President Trump touts oil and gas production in Texas visit",
            "description": "<p>CORPUS CHRISTI, Texas (Nexstar) — President Trump <a href=\"https://thehill.com/homenews/administration/5759646-texas-senate-primary-trump/\">touched down</a> on Texas soil <a href=\"https://www.kxan.com/news/texas-politics/a-brief-history-of-donald-trump-and-texas/\" rel=\"noreferrer noopener\" target=\"_blank\">for the second time</a> since returning to the White House.</p>\n<p>Trump visited the Port of Corpus Christi where he delivered remarks to applaud his economic and energy policies. The president reflected on the past year of his second term. He said he took over a country that was “dead” and has unlocked its potential.</p>\n<p>“I ended the Biden export ban, and I told our great Texas energy workers to very simply drill, baby, drill,” Trump said to a crowd of supporters. Trump touted the rise in oil production and gas exports and lower prices at the gas pump. </p>\n<p><a data-id=\"https://gasprices.aaa.com/?state=TX\" data-type=\"link\" href=\"https://gasprices.aaa.com/?state=TX\" rel=\"noreferrer noopener\" target=\"_blank\">According to AAA</a>, the current average price of regular gasoline in Texas is $2.60. <a data-id=\"https://www.eia.gov/dnav/pet/pet_pri_gnd_dcus_stx_a.htm#:~:text=Table_title:%20This%20page%20uses%20JavaScipt%20Table_content:%20header:,%7C%20:%201.807%20%7C%20:%203.463%20%7C\" data-type=\"link\" href=\"https://www.eia.gov/dnav/pet/pet_pri_gnd_dcus_stx_a.htm#:~:text=Table_title:%20This%20page%20uses%20JavaScipt%20Table_content:%20header:,%7C%20:%201.807%20%7C%20:%203.463%20%7C\" rel=\"noreferrer noopener\" target=\"_blank\">The average price of regular gasoline in 2022,</a> the middle of President Joe Biden’s term, was $3.47.</p>\n<p>Todd Staples, the president of the Texas Oil and Gas Association said the president’s visit to Corpus Christi underscores the fact that energy dominance begins in Texas. </p>\n<p>“The Lone Star State has reached a high-water mark in crude oil and natural gas production, benefitting American consumers by dramatically increasing supply and lowering prices at home and exporting the remainder to allies and trading partners,” Staples said in a statement.</p>\n<p>But Ed Hirs, an energy fellow at the University of Houston, said Trump’s policies have increased the cost of doing business. Hirs points to tariffs on steel and aluminum, which raised the cost of building energy infrastructure and drilling wells. He said the oil industry is spending more and getting less in revenue.</p>\n<p>“We’re getting $20 a barrel less than we were before the president took office, and we’re spending $3 to $5 to $10 a barrel more,” Hirs said.</p>\n<p>Hirs said that resulted in layoffs in the oil industry. The Texas Oil and Gas Association reported in January this year that upstream oil and gas employment remained flat in 2025, referencing data from the Texas Workforce Commission. </p>\n<p>“Even as companies adjust to lower prices and shifting market conditions, the Texas oil and natural gas industry employs hundreds of thousands of Texans across the value chain because of the industry’s regional breadth and diverse activities, from LNG exports to pipeline construction,” Staples said in his statement. </p>\n<p>Hirs did say that liquefied natural gas (LNG) exports did fairly well this year. </p>\n<p>“We have been able to help our European allies go without the natural gas from Russia,” Hirs said. </p>\n<p>Energy Secretary Chris Wright traveled to Corpus Christi a day ahead of the president to sign an order that expands the amount of LNG exported from the Cheniere Energy’s Corpus Christi LNG terminal. This will allow Corpus Christi LNG to be the second-largest exporter of LNG in the United States.</p>\n<p>“This creates jobs and wealth in the United States, and it better energizes our allies abroad and lifts everyone up,” Wright told a group of reporters.</p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/nexstar_media_wire/5759842-president-trump-touts-oil-and-gas-production-in-texas-visit/",
            "pub_date": "2026-02-28 11:35:56",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5759942,
            "title": "Warren accuses Trump, Hegseth of trying 'extort' Anthropic into removing AI guardrails",
            "description": "<p>Sen. Elizabeth Warren (D-Mass.) on Friday accused President Trump and Secretary of Defense Pete Hegseth of attempting to “extort” the company <a href=\"https://thehill.com/policy/technology/5759399-trump-bans-anthropic-tech/\">Anthropic</a> into removing guardrails for its AI programs.</p>\n<p>Warren, the ranking member of the Senate Banking, Housing and Urban Affairs Committee, said in a statement that the attempt would remove “common sense guardrails that protect Americans from mass surveillance and fully autonomous weapons, with no human decision-makers, that can kill with impunity.”</p>\n<p>“Congress needs to put in place restrictions to stop this Administration from using bipartisan national security authorities to bully and punish American companies that won’t advance their authoritarian agenda,” she added. </p>\n<p>Warren called on Hegseth to “immediately” testify before members of Congress and explain “this extraordinary abuse of power and address the serious adverse national security consequences of his decision.” </p>\n<p>Anthropic was one of several companies that signed a $200 million contract with the Pentagon last summer. The deal was in jeopardy due to Anthropic’s policy preventing its AI model Claude from being used for fully autonomous lethal weapons or mass domestic surveillance.</p>\n<p>Trump earlier on Friday directed federal agencies to “immediately cease” using Anthropic technology as a feud erupts between the company and the Pentagon. Hegseth said the Defense Department (DOD) was labeling the company a <a href=\"https://thehill.com/policy/defense/5759630-pentagon-designates-anthropic-risk/\">supply chain risk</a> to national security, banning any U.S. military contractor, partner or supplier from working with Anthropic.</p>\n<p>Warren’s fellow Bay State Democrat, Sen. Ed Markey, said the administration’s label “is a reckless and unprecedented attempt to destroy an American AI company.”</p>\n<p>“This is not a routine classification — it is an attempt to cripple an American firm for requesting legitimate safeguards on use of its AI model,” Markey said in a <a href=\"https://www.markey.senate.gov/news/press-releases/markey-demands-immediate-congressional-action-to-reverse-dod-designation-of-anthropic-a-supply-chain-risk\">statement</a>. “That is unacceptable. I’m calling for immediate congressional action to reverse this decision.”</p>\n<p>Anthropic called the label “<a href=\"https://thehill.com/policy/technology/5759929-pentagon-anthropic-supply-chain-risk/\">legally unsound</a>” and said it sets a “dangerous precedent.”</p>\n<p>“Designating Anthropic as a supply chain risk would be an unprecedented action—one historically reserved for US adversaries, never before publicly applied to an American company,” Anthropic said in a statement. “We are deeply saddened by these developments.”</p>\n<p>Earlier Friday, Trump accused Anthropic of being run by “Leftwing nut jobs” who tried to “STRONG-ARM the Department of War, and force them to obey their Terms of Service instead of our Constitution.”</p>\n<p>Anthropic and the Pentagon negotiated the AI company’s terms of service, with the DOD having <a href=\"https://thehill.com/policy/defense/5758772-pentagon-emil-michael-anthropic-dario-amodei-criticism/\">threatened to cancel</a> its contract with the company if it does not agree to its terms by Friday afternoon.</p>\n<p>Trump’s announcement came as the DOD delivered its last and final offer to Anthropic on Wednesday night, requesting that the company allow the department to access Claude for “all lawful purposes.”  </p>\n<p>Anthropic said Thursday that “<a href=\"https://thehill.com/policy/technology/5758006-anthropic-pentagon-ai-talks-stall/\" rel=\"noreferrer noopener\" target=\"_blank\">virtually no progress</a>” had been made over the model’s terms of use. The company’s CEO Dario Amodei noted in a separate statement that they could not “in good conscience” accept the Pentagon’s terms.   </p>\n<p><em>Julia Shapero contributed.</em></p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/senate/5759942-warren-accuses-trump-extortion-anthropic/",
            "pub_date": "2026-02-28 11:10:53",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5759842,
            "title": "President Trump touts oil and gas production in Texas visit",
            "description": "<p>CORPUS CHRISTI, Texas (Nexstar) — President Trump <a href=\"https://thehill.com/homenews/administration/5759646-texas-senate-primary-trump/\">touched down</a> on Texas soil <a href=\"https://www.kxan.com/news/texas-politics/a-brief-history-of-donald-trump-and-texas/\" rel=\"noreferrer noopener\" target=\"_blank\">for the second time</a> since returning to the White House.</p>\n<p>Trump visited the Port of Corpus Christi where he delivered remarks to applaud his economic and energy policies. The president reflected on the past year of his second term. He said he took over a country that was “dead” and has unlocked its potential.</p>\n<p>“I ended the Biden export ban, and I told our great Texas energy workers to very simply drill, baby, drill,” Trump said to a crowd of supporters. Trump touted the rise in oil production and gas exports and lower prices at the gas pump. </p>\n<p><a data-id=\"https://gasprices.aaa.com/?state=TX\" data-type=\"link\" href=\"https://gasprices.aaa.com/?state=TX\" rel=\"noreferrer noopener\" target=\"_blank\">According to AAA</a>, the current average price of regular gasoline in Texas is $2.60. <a data-id=\"https://www.eia.gov/dnav/pet/pet_pri_gnd_dcus_stx_a.htm#:~:text=Table_title:%20This%20page%20uses%20JavaScipt%20Table_content:%20header:,%7C%20:%201.807%20%7C%20:%203.463%20%7C\" data-type=\"link\" href=\"https://www.eia.gov/dnav/pet/pet_pri_gnd_dcus_stx_a.htm#:~:text=Table_title:%20This%20page%20uses%20JavaScipt%20Table_content:%20header:,%7C%20:%201.807%20%7C%20:%203.463%20%7C\" rel=\"noreferrer noopener\" target=\"_blank\">The average price of regular gasoline in 2022,</a> the middle of President Joe Biden’s term, was $3.47.</p>\n<p>Todd Staples, the president of the Texas Oil and Gas Association said the president’s visit to Corpus Christi underscores the fact that energy dominance begins in Texas. </p>\n<p>“The Lone Star State has reached a high-water mark in crude oil and natural gas production, benefitting American consumers by dramatically increasing supply and lowering prices at home and exporting the remainder to allies and trading partners,” Staples said in a statement.</p>\n<p>But Ed Hirs, an energy fellow at the University of Houston, said Trump’s policies have increased the cost of doing business. Hirs points to tariffs on steel and aluminum, which raised the cost of building energy infrastructure and drilling wells. He said the oil industry is spending more and getting less in revenue.</p>\n<p>“We’re getting $20 a barrel less than we were before the president took office, and we’re spending $3 to $5 to $10 a barrel more,” Hirs said.</p>\n<p>Hirs said that resulted in layoffs in the oil industry. The Texas Oil and Gas Association reported in January this year that upstream oil and gas employment remained flat in 2025, referencing data from the Texas Workforce Commission. </p>\n<p>“Even as companies adjust to lower prices and shifting market conditions, the Texas oil and natural gas industry employs hundreds of thousands of Texans across the value chain because of the industry’s regional breadth and diverse activities, from LNG exports to pipeline construction,” Staples said in his statement. </p>\n<p>Hirs did say that liquefied natural gas (LNG) exports did fairly well this year. </p>\n<p>“We have been able to help our European allies go without the natural gas from Russia,” Hirs said. </p>\n<p>Energy Secretary Chris Wright traveled to Corpus Christi a day ahead of the president to sign an order that expands the amount of LNG exported from the Cheniere Energy’s Corpus Christi LNG terminal. This will allow Corpus Christi LNG to be the second-largest exporter of LNG in the United States.</p>\n<p>“This creates jobs and wealth in the United States, and it better energizes our allies abroad and lifts everyone up,” Wright told a group of reporters.</p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/5759842-president-trump-touts-oil-and-gas-production-in-texas-visit/",
            "pub_date": "2026-02-28 11:10:52",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5759929,
            "title": "Anthropic calls supply chain risk designation 'unprecedented,' 'legally unsound'",
            "description": "<p>Anthropic called the Pentagon’s decision Friday to designate the AI company as a <a data-id=\"https://thehill.com/policy/defense/5759630-pentagon-designates-anthropic-risk/\" data-type=\"link\" href=\"https://thehill.com/policy/defense/5759630-pentagon-designates-anthropic-risk/\">supply chain risk</a> an “unprecedented action,” arguing it is “legally unsound” and would “set a dangerous precedent.”</p>\n<p>“Designating Anthropic as a supply chain risk would be an unprecedented action—one historically reserved for US adversaries, never before publicly applied to an American company,” Anthropic said in a statement. “We are deeply saddened by these developments.”</p>\n<p>“We believe this designation would both be legally unsound and set a dangerous precedent for any American company that negotiates with the government,” it added.</p>\n<p>Defense Secretary Pete Hegseth said Friday that the Pentagon was labeling Anthropic as a supply chain risk <a data-id=\"https://thehill.com/policy/technology/5759399-trump-bans-anthropic-tech/\" data-type=\"link\" href=\"https://thehill.com/policy/technology/5759399-trump-bans-anthropic-tech/\">following a dispute</a> over the company’s terms of use for its AI models.</p>\n<p>The Defense Department (DOD) pushed for language that would allow it to use the technology for “all lawful purposes,” while Anthropic argued that there needed to be restrictions on mass domestic surveillance and fully autonomous lethal weapons.</p>\n<p>Hegseth, who made the announcement on the social platform X, said that “no contractor, supplier, or partner that does business with the United States military may conduct any commercial activity with Anthropic” as a result of the designation. </p>\n<p>His announcement came shortly after President Trump said he was directing federal agencies to “immediately cease” using the company’s technology.</p>\n<p>“The Leftwing nut jobs at Anthropic have made a DISASTROUS MISTAKE trying to STRONG-ARM the Department of War, and force them to obey their Terms of Service instead of our Constitution,” the president wrote in a post on Truth Social.</p>\n<p>However, Anthropic noted in its statement late Friday that it had “not yet received direct communication” from the Pentagon or the White House about the status of negotiations.</p>\n<p>“We have tried in good faith to reach an agreement with the Department of War, making clear that we support all lawful uses of AI for national security aside from the two narrow exceptions above,” the company said. “To the best of our knowledge, these exceptions have not affected a single government mission to date.”</p>\n<p>The AI firm added that it plans to challenge any supply chain risk designation in court.</p>\n<p>Despite Hegseth’s comments, it also argued that the Defense secretary “does not have the statutory authority” to bar anyone who does business with the military from doing business with Anthropic.</p>\n<p>Instead, it suggested the law can only extend to the use of its AI models as part of DOD contracts and “cannot affect how contractors use Claude to serve other customers.”</p>\n<p>“No amount of intimidation or punishment from the Department of War will change our position on mass domestic surveillance or fully autonomous weapons,” Anthropic added.</p>",
            "kind": 1,
            "link": "https://thehill.com/policy/technology/5759929-pentagon-anthropic-supply-chain-risk/",
            "pub_date": "2026-02-28 10:46:26",
            "source": "thehill",
            "language": "en"
        }
    ]
}