{
    "data": [
        {
            "id": 5756632,
            "title": "NYPD arrests man for allegedly assaulting officers during snowball fight",
            "description": "<p>The New York City Police Department arrested a 27-year-old man for allegedly assaulting officers with snow and ice on Monday during a <a href=\"https://thehill.com/homenews/state-watch/5753113-mayor-mayor-nypd-snowball/\">massive snowball fight</a> in Washington Square Park on Monday.</p>\n<p>Gusmane Coulibaly was taken into custody Thursday morning, the NYPD said, noting he was also arrested less than three weeks ago for attempted robbery in the transit system.</p>\n<p>The arrest is the latest development in a political rift that has emerged between New York City Mayor Zohran Mamdani (D) and Police Commissioner Tisch after video circulated on social media showing NYPD officers getting pelted with snowballs and snow chunks on Monday after they were called in to control an escalating citywide snowball fight during a historic blizzard. </p>\n<p>Encounters with police officers were caught on video. Some began showing the officers apparently brushing off the snowballs they faced as they walked through the park, but others showed the increasingly tense dynamic as larger chunks of snow and snowballs came hurling in their direction, including at their faces and necks, and a crowd began chasing them. </p>\n<p>While the officers largely did not engage with the individuals, a couple officers were seen shoving people off of them as they retreated. The police later said two officers were taken to a nearby hospital for treatment. </p>\n<p>Tisch responded to footage of the incident by condemning the “individuals attacking cops” and characterizing the behavior as “disgraceful” and “criminal,” as she said her detectives were investigating the situation. </p>\n<p>Mamdani at first urged the public to treat police officers with respect, thanking them for their help during the blizzard. But he characterized the footage as “kids throwing snowballs” and later said he didn’t think anyone should be charged in connection to the fight.</p>\n<p>Mamdani’s response earned broad condemnation from critics, including the largest police union, which blasted Mamdani’s “failure of leadership.”</p>\n<p>“By ignoring their injuries and dismissing the incident, the mayor has sent a disgraceful message to every police officer who serves this city, and a dangerous message to every person who might be looking to attack a police officer in the future,” Patrick Hendry, president of the Police Benevolent Association, said in a statement Tuesday.</p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/state-watch/5756632-nyc-snowball-fight-arrest/",
            "pub_date": "2026-02-27 01:16:53",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5756686,
            "title": "Huckabee: Carlson saying Israel pushing around Trump 'offensive'",
            "description": "<p>U.S. Ambassador to Israel Mike Huckabee said Wednesday that it was “offensive” for conservative pundit Tucker Carlson to suggest in a recent interview that President Trump was taking cues from the Israeli government on foreign policy.</p>\n<p>“It’s very offensive to think that President Trump is, as Tucker Carlson characterized it, somebody who is being pushed around by Israel. That is the most nonsensical thing,” Huckabee told News Nation’s Leland Vittert on “<a href=\"https://www.newsnationnow.com/on-balance-with-leland-vittert/\">On Balance</a>.”</p>\n<p>Carlson and Huckabee both made <a href=\"https://thehill.com/policy/international/5749053-huckabee-israel-middle-east-takeover-carlson-interview/\">several provocative remarks</a> during an interview at Ben Gurion Airport in Tel Aviv, Israel, earlier this month.</p>\n<p>The <a href=\"https://thehill.com/homenews/ap/ap-international/ap-us-ambassador-causes-uproar-by-claiming-israel-has-a-right-to-much-of-the-middle-east/\">heated sit-down</a> came amid <a href=\"https://thehill.com/homenews/house/5428783-republicans-israel-gaza/\">a rift within the Republican Party</a> over Israel that has widened since the war in Gaza began. While the GOP has historically been united in support of the U.S. ally, some members of the far right have recently pushed for a more isolationist approach.</p>\n<p>Carlson has long accused U.S. officials — including Huckabee — of prioritizing Israel’s interests over America’s. His critics, in turn, have <a href=\"https://thehill.com/homenews/media/5592049-tucker-carlson-conservative-civil-war/\">condemned his commentary</a> on Israel as echoing antisemitic themes and conspiracy theories.</p>\n<p>“I don’t know where this is coming from,” Huckabee responded after Vittert asked about the “anti-Israel cancer” spreading through the party. “I don’t know if it’s because of the influence of significant amounts of money from Arab countries. I don’t know. I think it would be nice if we did know.”</p>\n<p>“But what I do fully understand is that this is divisive to the Republican Party, divisive to America, and it’s based on lies and half-truths, and that’s what’s concerning to me,” he added.</p>\n<p>Huckabee labeled some of Carlson’s comments in the interview as “alarming and very, very disrespectful and disparaging” toward Trump. He said he hoped Carlson apologized during a reported visit to the White House on Wednesday.</p>\n<p>“Look, it doesn’t matter what Tucker Carlson thinks about me. I’m expendable,” Huckabee said.</p>\n<p>“It does matter what he thinks about President Trump and his administration and President Trump’s leadership is the world leader and the head of both foreign policy and domestic policy,” he continued.</p>\n<p>Trump <a href=\"https://thehill.com/policy/international/5746010-trump-board-of-peace-takeaways/\">convened the first meeting</a> of his <a href=\"https://thehill.com/policy/international/5745297-trump-funding-board-of-peace/\">Board of Peace</a> last week, a group of world leaders tasked with supervising postwar restoration efforts in Gaza, including the disarmament of Hamas, as part of the second phase of the president’s <a href=\"https://thehill.com/policy/international/5688828-trump-gaza-peace-plan-phase2/\">20-point peace plan</a>.</p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/administration/5756686-huckabee-offensive-carlson-trump-israel/",
            "pub_date": "2026-02-27 01:16:53",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5756722,
            "title": "FBI fires agents who worked on Trump Mar-a-Lago investigation",
            "description": "<p>The FBI has fired additional agents who worked on cases involving President Trump, including several who worked on the Mar-a-Lago documents case. </p>\n<p>A source who confirmed the firings to The Hill said at least 10 agents were removed Wednesday. </p>\n<p>The dismissals are just the latest in a wave of firing of FBI and Justice Department personnel who worked on the cases involving Trump. </p>\n<p>The FBI Agents Association blasted the move as weakening the bureau. </p>\n<p>“The FBIAA condemns today’s unlawful termination of FBI Special Agents, which—like other firings by Director Patel—violates the due process rights of those who risk their lives to protect our country,” the group said in a statement. </p>\n<p>“These actions weaken the Bureau by stripping away critical expertise and destabilizing the workforce, undermining trust in leadership and jeopardizing the Bureau’s ability to meet its recruitment goals—ultimately putting the nation at greater risk.”</p>\n<p>Trump was charged with violating the Espionage Act and obstruction of justice after he was found to have 300 documents with classified markings in his Florida estate. The case asserted Trump likewise ordered the documents moved to hide them from authorities and his own lawyer. </p>\n<p>The FBI previously fired agents who worked on the case charging Trump for his conduct related to Jan. 6.</p>\n<p>The Justice Department has similarly engaged in sweeping firings of prosecutors who worked on the Trump cases, as well as those who brought charges against rioters who stormed the Capitol that day. </p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/administration/5756722-fbi-trump-case-agent-firings/",
            "pub_date": "2026-02-27 01:16:52",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5756617,
            "title": "Rove says he'd bet on Talarico to win Texas Senate primary",
            "description": "<p>Republican strategist Karl Rove said Thursday that he would bet on Texas state Rep. James Talarico (D) to win the key Democratic U.S. Senate primary over Rep. Jasmine Crockett (D-Texas), a race that is being closely watched by political observers.</p>\n<p>“Polling in a primary is difficult, particularly in a state like Texas, because we don’t have party registration. You can vote in any primary you want. So, it’s very difficult to go about — So, if you look at the recent Dem[ocratic] polls, 43-47 Crockett over Talarico, 56-44 Crockett over Talarico, 38-37, Texas [Public] Opinion Research,” Rove said on Fox News’s “America’s Newsroom.”</p>\n<p>“Most of these polls were conducted before the [Stephen] Colbert incident, and he’s now gotten a large number of views [because] of that. If I were a betting man, I’d bet on Talarico,” he added, referencing the “Late Show” host <a data-id=\"https://thehill.com/homenews/campaign/5744369-cbs-late-show-controversy/\" data-type=\"link\" href=\"https://thehill.com/homenews/campaign/5744369-cbs-late-show-controversy/\">saying</a> CBS told him not to air Talarico’s appearance on his show.</p>\n<p>Crockett had a double-digit <a data-id=\"https://thehill.com/homenews/campaign/5755382-jasmine-crockett-leads-texas-senate/\" data-type=\"link\" href=\"https://thehill.com/homenews/campaign/5755382-jasmine-crockett-leads-texas-senate/\">lead</a> over Talarico in a recent University of Texas/Texas Politics Project Poll. The poll found Crockett ahead of Talarico, 56 to 44 percent, among likely Democratic primary voters in Texas.</p>\n<p>Democrats have sought to score electoral wins in Texas in recent years, but have come up short in many instances including former Rep. Beto O’Rourke’s (D-Texas) unsuccessful challenge against conservative stalwart Sen. Ted Cruz (R-Texas) in 2018.</p>\n<p>Both Talarico and Crockett are vying for Sen. John Cornyn’s (R-Texas) seat. </p>\n<p>On Monday, Cornyn <a data-id=\"https://thehill.com/homenews/campaign/5752512-cornyn-warns-texas-crack-red-wall/\" data-type=\"link\" href=\"https://thehill.com/homenews/campaign/5752512-cornyn-warns-texas-crack-red-wall/\">said</a> a Democrat taking his seat would be “the first crack in the red wall.” He said that either Talarico or Crocket “absolutely” has a shot of winning in the Lone Star State, especially in the case that they face off against Texas Attorney General Ken Paxton (R) in November.</p>\n<p>Republicans are currently dealing with issues such as affordability, files linked to convicted sex offender Jeffrey Epstein and backlash toward President Trump’s immigration agenda heading into this year’s midterm elections.</p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/campaign/5756617-texas-democrat-senate-primary-karl-rove-james-talarico/",
            "pub_date": "2026-02-27 01:06:03",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5755103,
            "title": "The American Dream gap: Why politicians aren't fixing the economy",
            "description": "<p>The American Dream is one of our nation’s most cherished ideals, and yet the public increasingly believes it is <a href=\"https://www.nytimes.com/2026/01/26/us/politics/affordability-poll.html?smid=nytcore-android-share\" rel=\"noreferrer noopener\" target=\"_blank\">out of reach for most people</a>. Even the Wall Street Journal acknowledges that <a href=\"https://www.wsj.com/economy/wsj-norc-economic-poll-73bce003?\" rel=\"noreferrer noopener\" target=\"_blank\">America is becoming a nation of economic pessimists</a>.</p>\n<p>If Americans are so unhappy about their economic prospects, why aren’t our politicians doing more to help citizens earn — and afford — more? While research shows that members of Congress tend to be <a href=\"https://www.cambridge.org/core/journals/perspectives-on-politics/article/conducting-the-heavenly-chorus-constituent-contact-and-provoked-petitioning-in-congress/2533A46180DE8CE40CE1993362A4B2AD\" rel=\"noreferrer noopener\" target=\"_blank\">sensitive to opinion in their districts</a>, ever concerned about their prospects for reelection, conventional accounts of public opinion misread the public’s perspectives. </p>\n<p>It is true that, on average, Americans have grown more pessimistic about economic opportunity in recent years. But most Republican citizens still believe in the American Dream. It is Democrats who have become much more skeptical, driving economic pessimism. This has insulated many Republican members of Congress, most of whom represent safe Republican districts, from the electoral challenge that might otherwise motivate them to craft legislation to assist low- and middle-income Americans.</p>\n<p>To be clear, nearly all Americans revere the American Dream as an ideal. However, <a href=\"https://www.ipsos.com/sites/default/files/ct/news/documents/2025-07/WTF-American-Dream-Topline-7-10-2025.pdf\" rel=\"noreferrer noopener\" target=\"_blank\">in a recent Ipsos survey,</a> nearly half of Americans said that “The American Dream isn’t attainable for someone like me.” In response to the statement “In America, if you work hard, you will succeed no matter what,” only a little over half of Americans agreed.</p>\n<p>Underlying these averages of beliefs about upward mobility are striking, and consequential, partisan differences. Republicans were 20 percentage points more likely than Democrats to agree that hard workers “succeed no matter what.” A Wall Street Journal/NORC survey found that <a href=\"https://www.wsj.com/economy/wsj-norc-economic-poll-73bce003\" rel=\"noreferrer noopener\" target=\"_blank\">90 percent of Democrats, but only 55 percent of Republicans</a>, were pessimistic about their economic future. </p>\n<p>Confusingly, as the income gap between the two parties has shrunk, what some refer to as “class de-polarization,” the partisan disagreement over the American Dream has grown. </p>\n<p>In my book, “<a href=\"https://www.russellsage.org/publications/book/debating-american-dream\" rel=\"noreferrer noopener\" target=\"_blank\">Debating the American Dream: How Explanations for Inequality Polarize Politics</a>,” I examine survey data over several decades. In 1999, Pew asked a representative sample of Americans to choose between the statements “most people who want to get ahead can make it if they’re willing to work hard” versus “hard work and determination are no guarantee of success for most people.” Approximately 80 percent of Republicans chose the first statement, and over 70 percent of Democrats did as well. </p>\n<p>Answering the exact same question more than two decades later, during Biden’s presidency, Republicans’ faith in hard work had fallen somewhat to 70 percent, while Democrats’ had sunk to 40 percent. Similar survey questions tell the same story.</p>\n<p>In sum, while everyone has grown more pessimistic, Democrats’ faith in the American Dream has fallen farther, faster. In previous decades, factors such as a person’s income, race or sex may have played a more important role in shaping their view of the American Dream. But, today, partisanship overshadows other factors. This generates wild swings in economic policy depending on which party controls our government: Those who question the fairness of the economy seek progressive reforms, and the true believers claw them back. </p>\n<p>It is important to keep in mind that the American Dream sets a high standard: if you work hard and play by the rules, you should expect to be able to afford a house, a car, health care and a good education for your children. If we take the standard seriously, our nation does not provide the American Dream to its people. </p>\n<p>Low- and middle-income workers <a href=\"https://www.weforum.org/stories/2022/09/working-hours-america-income-economy/\" rel=\"noreferrer noopener\" target=\"_blank\">work nearly as many hours as high-income workers</a> and face considerably more <a href=\"https://www.lisep.org/content/the-working-poor-how-time-scarcity-halts-the-pursuit-of-the-american-dream\" rel=\"noreferrer noopener\" target=\"_blank\">time scarcity</a>. Yet, 25 percent of U.S. households do not earn enough to <a href=\"https://www.pewresearch.org/short-reads/2025/05/07/growing-share-of-us-adults-say-their-personal-finances-will-be-worse-a-year-from-now/\" rel=\"noreferrer noopener\" target=\"_blank\">pay their bills</a> and many struggle to <a href=\"https://livingwage.mit.edu/\" rel=\"noreferrer noopener\" target=\"_blank\">cover their basic needs.</a> Median income households find themselves <a href=\"https://www.bankrate.com/mortgages/american-dream-of-homeownership-turning-into-luxury/\" rel=\"noreferrer noopener\" target=\"_blank\">priced out of 75 percent of the housing market</a>.</p>\n<p>What is to be done? Both parties are historically unpopular, with a <a href=\"https://news.gallup.com/poll/700499/new-high-identify-political-independents.aspx\" rel=\"noreferrer noopener\" target=\"_blank\">record number of Americans identifying as independents</a>. The Republican Party currently holds power in Washington, but there are not enough American Dream optimists left for them to retain it with their current economic agenda.</p>\n<p>It is worth remembering that Trump won the nomination back in 2016 because <a href=\"https://onlinelibrary.wiley.com/doi/full/10.1111/1468-4446.12323?\" rel=\"noreferrer noopener\" target=\"_blank\">he ran as an economic populist, although he has not governed as one.</a> The Democratic Party receives points for at least trying to assist everyday Americans but <a href=\"https://www.nytimes.com/2026/01/27/opinion/democrats-trump-midterms-future.html\" rel=\"noreferrer noopener\" target=\"_blank\">loses points for being perceived as weak and out of touch</a>.</p>\n<p>Those who are deeply concerned about economic fairness and opportunity — within both parties — should hold our leaders’ feet to the fire. We have important elections approaching in the coming months. Now would be the time to insist politicians forge some compromises to address wage stagnation, affordability and extreme levels of wealth inequality. Bipartisan economic reforms will improve Americans’ well-being, and strengthen both parties.</p>\n<p><em>Elizabeth Suhay is professor of government in the School of Public Affairs at American University. She is the author of “Debating the American Dream: How Explanations for Inequality Polarize Politics” and former chair of the American Political Science Association’s Class and Inequality section.</em></p>",
            "kind": 1,
            "link": "https://thehill.com/opinion/campaign/5755103-debating-american-dream-inequality/",
            "pub_date": "2026-02-27 01:06:03",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5756657,
            "title": "Democrats will force vote next week to limit Trump's war powers in Iran",
            "description": "<p>House Democrats will force a vote next week to curb President Trump’s war powers in Iran. </p>\n<p>The resolution is expected to fail, given the overwhelming opposition from Republicans and a small handful of Jewish Democrats. But party leaders want to get all lawmakers on the record by using a procedural move to sidestep GOP leaders and force the vote.</p>\n<p>“The Iranian regime is brutal and destabilizing, seen most recently in the killing of thousands of protestors,” a number of top Democrats said Thursday in a joint statement. “However, undertaking a war of choice in the Middle East, without a full understanding of all the attendant risks to our servicemembers and to escalation, is reckless.”</p>\n<p>The announcement arrives as Trump and other top administration officials are ramping up their threats against Tehran, both rhetorically and with a massive buildup of the U.S. armed forces in the Middle East, including two aircraft carrier strike groups. </p>\n<p>Negotiators for Iran and the U.S. are expected to meet in Geneva on Thursday in search of a deal on Tehran’s nuclear program. But the accumulation of U.S. forces in the region has led to widespread speculation that Trump intends to use them. </p>\n<p>The House resolution, sponsored by Reps. Ro Khanna (D-Calif.) and Thomas Massie (R-Ky.), would require Trump to win approval from Congress before launching any strikes. </p>\n<p>Khanna had initially planned to force a vote on the measure this week, but he pushed that timeline given the week’s abbreviated schedule, which was squeezed by inclement weather on Monday and an early recess to accommodate the Democrats’ annual retreat on Wednesday. </p>\n<p>The measure has a tough path to passage. Massie is the only Republican to say he’ll support it. And at least two Democrats — Reps. Josh Gottheimer (N.J.) and Jared Moskowitz (Fla.), both of whom are close Israel allies — have also announced their opposition. </p>\n<p>Supporters of the resolution remain undeterred. They’re pushing the measure as a way to reassert the constitutional power of Congress to wage war, arguing that any strikes on Iran without such approval would violate that separation of powers.  </p>\n<p>“We maintain that any such action would be unconstitutional without consultation with and authorization from Congress,” the Democrats said.</p>\n<p>The statement was endorsed by a number of top lawmakers, including House Minority Leader Hakeem Jeffries (N.Y.), Democratic Whip Katherine Clark (Mass.) and Democratic Caucus Chairman Pete Aguilar (Calif.). The top Democrats on key committees also signed on, including Reps. Jim Himes (Conn.), the ranking member of the Intelligence Committee; Greg Meeks (N.Y.), the top Democrat on the Foreign Affairs Committee; and Adam Smith (Wash.), the ranking member of the Armed Services Committee. </p>\n<p>Khanna, who also endorsed the statement, told The Hill earlier in the week that he would force the vote next week.</p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/house/5756657-democrats-trump-iran-war-powers/",
            "pub_date": "2026-02-27 00:56:36",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5755665,
            "title": "Live updates: Hillary Clinton says she 'had no idea' of Epstein's criminal activities; US, Iran talk in Geneva",
            "description": "<p>In New York, former Secretary of State Hillary Clinton will tell the House Oversight and Government Reform Committee in a <a href=\"https://thehill.com/homenews/house/5755536-clintons-depositions-epstein-investigation/\" rel=\"noreferrer noopener\" target=\"_blank\">closed-door deposition</a> that she “had no idea” of the criminal activities of convicted sex offender Jeffrey Epstein and his associate, Ghislaine Maxwell, according to the opening statement she released Thursday morning.</p>\n<p>Her husband, former President Clinton, will meet with the committee on Friday.</p>\n<p>Trump administration envoys are in Geneva for <a data-id=\"https://thehill.com/policy/international/5755742-trump-iran-nuclear-threat/\" data-type=\"link\" href=\"https://thehill.com/policy/international/5755742-trump-iran-nuclear-threat/\">another round of critical talks</a> with Iranian and Omani officials on the Islamic republic’s nuclear program.</p>\n<p>Secretary of State Marco Rubio said Wednesday he was hoping for “productive” conversations and that “diplomacy is always on the table.” Oman’s foreign ministry <a href=\"https://x.com/FMofOman/status/2026951058874929659\" rel=\"noreferrer noopener\" target=\"_blank\">said on social platform X</a> the talks were ongoing, with “a constructive spirit.”</p>\n<p>As the U.S. sets the stage for potential military action in the Middle Eastern country, however, a group of bipartisan senators has indicated it will push forward a <a href=\"https://thehill.com/homenews/senate/5755623-democrats-divided-over-iran-response/\" rel=\"noreferrer noopener\" target=\"_blank\">war powers resolution</a> seeking to rein in President Trump.</p>\n<p>On Capitol Hill, Department of Homeland Security funding talks remain stalled, as Senate Majority Leader John Thune is starting to <a href=\"https://thehill.com/homenews/senate/5755667-trump-thune-voting-bill-talking-filibuster/\" rel=\"noreferrer noopener\" target=\"_blank\">feel increasing pressure</a> to act on the GOP’s SAVE Act — which would require proof of citizenship when registering to vote.</p>\n<p>Trump will hold private meetings and receive an intelligence briefing on Thursday, while Vice President Vance will travel to Plover, Wis.</p>\n<p>Follow live below. </p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/administration/5755665-live-updates-trump-iran-hillary-clinton/",
            "pub_date": "2026-02-27 00:56:35",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5756629,
            "title": "Graham: Iran facing 'Berlin Wall moment'",
            "description": "<p>Sen. Lindsey Graham (R-S.C.) said Thursday that President Trump’s <a href=\"https://thehill.com/policy/international/5755742-trump-iran-nuclear-threat/\">actions toward Iran</a> could result in a modern day version of the Berlin Wall’s fall. </p>\n<p>“It is my strong view that history is watching every move we make. If we follow through by sending help to the protesters risking their lives, we will have a 21st Century Berlin Wall moment,” Graham, a foreign policy hawk, wrote in a <a href=\"https://www.foxnews.com/opinion/sen-lindsey-graham-iran-facing-berlin-wall-moment-history-watching-us-now\">Fox News opinion piece.</a></p>\n<p>“Ronald Reagan’s determination to stand up to communism paid dividends for the entire world when the Soviet Union crumbled under its own weight,” he added. “What followed was a new birth of freedom around the globe, liberating millions who knew nothing but oppression.”</p>\n<p>U.S. officials, led by Jared Kushner and special envoy Steve Witkoff, are <a href=\"https://thehill.com/homenews/administration/5755665-live-updates-trump-iran-hillary-clinton/\">holding peace talks</a> with Omani and Iranian officials Thursday after Trump warned Tuesday he will not allow Iran to develop a nuclear weapon amid the U.S.’s <a href=\"https://thehill.com/policy/defense/5715910-us-military-iran-options/\">massive military build-up</a> near the Middle Eastern country. </p>\n<p>“They want to make a deal, but we haven’t heard those secret words, ‘We will never have a nuclear weapon,’” the president said during his <a href=\"https://thehill.com/homenews/administration/5754101-trump-state-union-address-takeaways/\">State of the Union address</a>. “My preference, my preference is to solve this problem through diplomacy. But one thing is certain, I will never allow the world’s No. 1 sponsor of terror, which they are by far, to have a nuclear weapon.”</p>\n<p>The Treasury Department on Wednesday also <a href=\"https://thehill.com/homenews/administration/5755158-us-iran-sanctions-oil-nuclear-program/\">imposed new sanctions</a> on Iranian individuals, companies and ships accused of enabling the country’s illicit oil sales and ballistic missile programs. </p>\n<p>Secretary of State Marco Rubio said Wednesday that while Iran is not currently enriching uranium, the country is “trying to get to the point where they ultimately can.” Trump said last June that U.S. strikes <a href=\"https://thehill.com/homenews/administration/5363831-iran-nuclear-site-damage-trump-iran/\">obliterated three Iranian nuclear sites</a>, including the Fordow site deep in a mountain south of Tehran. </p>\n<p>Rubio also noted that Iran “possesses a very large number of ballistic missiles, particularly short-range ballistic missiles” that threaten the U.S., its allies and military bases in the United Arab Emirates, Qatar and Bahrain. Trump said Tuesday that Iran has missiles that can threaten Europe and is working to build ones capable of reaching the U.S. </p>\n<p>But Abbas Araghchi, the Iranian foreign minister, denied the president’s claims Wednesday.</p>\n<p>“We are not developing long-range missiles,” Araghchi said in an interview with India Today TV, <a href=\"https://www.iranintl.com/en/202602258497\">according to Iran International</a>. “We have limited range to below 2000kms intentionally. We don’t want it to be a global threat. We only have [them] to defend ourselves. Our missiles build deterrence.”</p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/senate/5756629-graham-trump-iran-berlin-wall-moment/",
            "pub_date": "2026-02-27 00:56:35",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5756580,
            "title": "Maduro lawyer says US won't let Venezuela pay legal defense fees",
            "description": "<p>An attorney for deposed Venezuelan leader Nicolas Maduro said the Trump administration is blocking his access to funds needed to pay his attorney, risking leaving him without counsel.</p>\n<p>Before Maduro was <a data-id=\"https://thehill.com/homenews/senate/5745110-ted-cruz-regime-change-iran-venezuela-cuba/\" data-type=\"link\" href=\"https://thehill.com/homenews/senate/5745110-ted-cruz-regime-change-iran-venezuela-cuba/\">forcibly removed</a> from his home in a U.S. military option, he was among a slew of Venezuelan officials facing sanctions from the U.S. Office of Foreign Assets Control (OFAC).</p>\n<p>But an attorney for Maduro, Barry Pollack, said while the U.S. for three hours granted a license that would allow Maduro and his wife Cilia Flores de Maduro to access Venezuelan funds, it swiftly reversed that decision for Maduro.</p>\n<p>“Counsel explained that the government of Venezuela has an obligation to pay Mr. Maduro’s fees, Mr. Maduro has a legitimate expectation that the government of Venezuela would do so, and Mr. Maduro cannot otherwise afford counsel. Accordingly, by its failure to allow the government of Venezuela to pay Mr. Maduro’s defense costs, OFAC is interfering with Mr. Maduro’s ability to retain counsel and, therefore, his right under the Sixth Amendment to counsel of his choice,” Pollack wrote.</p>\n<p>“If OFAC fails to act on the request to reinstate the original license, or denies that request, Mr. Maduro will file a formal motion in the coming days seeking relief from the Court.”</p>\n<p>The Treasury Department did not immediately respond to request for comment and the Trump administration has not yet responded to the letter in court.</p>\n<p>Maduro was <a href=\"https://thehill.com/homenews/administration/5670837-trump-operation-captures-maduro/\">indicted</a> on Jan.3 shortly after his capture on narco-terrorism charges.</p>\n<p>However, while the indictment accuses Maduro of involvement with six different terrorism and drug trafficking groups, in some cases it offers few details about those connections or makes only passing references to the organizations.</p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/5756580-trump-blocks-maduro-funds/",
            "pub_date": "2026-02-27 00:40:58",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5753260,
            "title": "Don't just freeze federal assistance to fight fraud — fix the program",
            "description": "<p>The federal government <a href=\"https://www.theguardian.com/us-news/2026/jan/26/trump-administration-childcare-funding-freeze\" rel=\"noreferrer noopener\" target=\"_blank\">recently froze</a> Temporary Assistance for Needy Families funding in five states, including New York, Illinois and Minnesota, citing the need to crack down on fraud. </p>\n<p>Headlines have been <a href=\"https://www.youtube.com/watch?v=jpWHWDV5ZrU\" rel=\"noreferrer noopener\" target=\"_blank\">dominated by scandal</a>: phantom day cares, faked receipts, and misuse of taxpayer dollars. But these scandals are not an aberration. They are the predictable result of a system that measures compliance instead of outcomes. And while Washington focuses on the fraud we can see, it is ignoring the failure we cannot see.</p>\n<p>The real scandal of the American welfare system isn’t just that money is being stolen — it is that the money we do spend isn’t helping people escape poverty. Rather, it is trapping them in poverty.</p>\n<p>This year marks the 30th anniversary of the Temporary Assistance for Needy Families welfare program, signed into <a href=\"https://www.congress.gov/bill/104th-congress/house-bill/3734\" rel=\"noreferrer noopener\" target=\"_blank\">law by President Clinton in 1996</a> with the promise to <a href=\"https://www.cbpp.org/research/income-security/temporary-assistance-for-needy-families\" rel=\"noreferrer noopener\" target=\"_blank\">“end welfare as we know it.”</a> Three decades later, must admit that we replaced one trap with another. We exchanged a system of dependency for a system of compliance — paying states to keep caseloads low while failing to ask whether families are actually better off. </p>\n<p>Consider “Tanya,” a composite of the millions navigating this system. A full-time warehouse worker in Ohio, Tanya turns to the program for a bridge when her hours are cut. Instead, she finds a maze designed to police her poverty. Her experience is not unusual; it is a documented feature of how Temporary Assistance for Needy Families operates nationwide. </p>\n<p>The current congressional debate, centered on the “<a href=\"https://www.congress.gov/bill/119th-congress/house-bill/2354/text\" rel=\"noreferrer noopener\" target=\"_blank\">Restoring ‘Temporary’ to TANF Act,</a>” misses the forest for the trees. We are obsessed with auditing receipts to exclude the wrong people trying to access the money, but we never ask whether the right people are moving forward. </p>\n<p>In Tanya’s case, the system works exactly as designed — and that is the problem. When she receives a modest raise, she hits a “<a href=\"https://www.unitedwaycleveland.org/benefits-cliff-challenges-and-solutions/\" rel=\"noreferrer noopener\" target=\"_blank\">benefits cliff</a>.” Her child-care support is cut so sharply that her net income actually drops. Faced with an impossible choice, she has to decide whether to refuse the promotion or fall further behind. </p>\n<p>In short, we are punishing success because our accountability metrics are broken. </p>\n<p>Since 1996, Temporary Assistance for Needy Families has rewarded states for <a href=\"https://www.chapinhall.org/research/overall-tanf-caseload-declined-between-2010-and-2022/\" rel=\"noreferrer noopener\" target=\"_blank\">shrinking caseloads</a>, not for reducing poverty. In practice, states are rewarded for exits, regardless of the reason. If a family leaves because they found a high-paying job, that is a success. But if a family is kicked off for missing a filing deadline and sinks into homelessness, that is also counted as a “success” under the current statute. The system is indifferent to whether a family is rising out of poverty or simply falling off the radar.</p>\n<p>The 2026 funding freeze, while necessary to stop criminal fraud, is insufficient as a reform. We cannot “restore integrity” to a system that lacks a coherent purpose. Real reform requires shifting from compliance-based to outcome-based accountability — measuring whether families are moving forward, not merely moving off the rolls.</p>\n<p>First, we must abandon work participation rates as a proxy for success and begin measuring economic mobility directly. Bills like the “<a href=\"https://www.congress.gov/bill/119th-congress/senate-bill/1567/text\" rel=\"noreferrer noopener\" target=\"_blank\">JOBS for Success Act</a>” have hinted at this idea, but we must go further. States should be rewarded when recipients see wage growth, retain employment for 12 months or gain credentials. We have the data to do this; we simply aren’t using it.</p>\n<p>Second, we must replace the benefit ledge with a ramp. Transitional benefits that phase out gradually as income rises would ensure that work always pays. Critics may argue this is too expensive, but a system that tracks verified employment outcomes is far more secure than one that tracks receipts. It is easy to fake a generic invoice; it is much harder to fake IRS-verified wage growth.</p>\n<p>If we want to stop fraud, we must stop building systems so complex that they invite exploitation. If we want to help families, we must stop forcing mothers like our hypothetical Tanya to choose between stability and upward mobility.</p>\n<p>The January 2026 freeze should mark the end of “cash policing.” Congress must use this moment not merely to restore funding, but to rewrite the rules — replacing a system that manages poverty with one that enables families to escape it.</p>\n<p><em>Parth Patel is a social policy professional with more than five years of experience in human services and a background in public finance. He holds dual master’s degrees in public administration and governmental accounting.</em></p>",
            "kind": 1,
            "link": "https://thehill.com/opinion/congress-blog/economy-budget/5753260-tanf-funding-freeze-scandal/",
            "pub_date": "2026-02-27 00:40:58",
            "source": "thehill",
            "language": "en"
        }
    ]
}