{
    "data": [
        {
            "id": 5758358,
            "title": "The 22nd Amendment at age 75: is it seriously under challenge?",
            "description": "<p><a href=\"https://www.archives.gov/exhibits/running-for-office/larger-image.php?image=44.1&amp;TB_iframe=true#:~:text=The%2022nd%20Amendment%20to%20the,as%20President%20after%20two%20terms.\">Feb. 27</a> marks the 75th anniversary of the <a href=\"https://constitutioncenter.org/the-constitution/amendments/amendment-xxii\">22nd Amendment to the Constitution</a>, when Minnesota’s ratification gave the three-quarters of the 48 states required by <a href=\"https://www.archives.gov/federal-register/constitution/article-v.html\">Article V</a>. Now it is back in the public consciousness as President Trump’s supporters take aim at its limitations.</p>\n<p>The intention is straightforward: “<a href=\"https://constitution.congress.gov/constitution/amendment-22/\">No person shall be elected to the office of the President more than twice</a>.” Furthermore, “no person who has held the office of President, or acted as President, for more than two years of a term to which some other person was elected President shall be elected to the office of the President more than once.”</p>\n<p>This wasn’t theoretical. Harry Truman had been elected as Franklin Roosevelt’s vice president in 1944, but had only served 82 days when Roosevelt died in April 1945. That gave him virtually all of Roosevelt’s <a href=\"https://www.history.com/articles/fdr-four-term-president-22-amendment\">fourth four-year term</a>.</p>\n<p>Presidential tenure became a campaign issue in the 1946 midterm elections: Republicans gained 55 seats in the House and 12 in the Senate to take control of Congress for the first time since 1932.</p>\n<p>Everything led back to Roosevelt. In 1940, he was approaching the end of his second term. George Washington had chosen to step down after eight years as president, and his model had become a moral and constitutional, if unofficial, exemplar.</p>\n<p>Ulysses S. Grant came close to winning the Republican nomination for a third time in 1880; incredibly, despite a paralyzing stroke in 1919, Woodrow Wilson considered seeking a third term in 1920 and even entertained the idea of a comeback in 1924. But no-one had got as far as the ballot.</p>\n<p>FDR’s third term was recognized as exceptional: the storm clouds of war were gathering and the Democrats played safe, Roosevelt winning 38 states.</p>\n<p>1944 was different. Roosevelt was only <a href=\"https://www.history.com/articles/franklin-d-roosevelt-health-final-term\">62 but he was suffering from congestive heart failure and hypertension</a>. The president was dying, so nominating a vice presidential candidate was almost certainly choosing the 33rd president of the U.S.</p>\n<p>The incumbent vice president, Henry Wallace, was a cerebral agriculturalist who opposed segregation. He was unacceptably liberal for Democrat bosses, so he was replaced at the party’s convention with Missouri Sen. Harry S. Truman, whom Roosevelt barely knew.</p>\n<p>The pair <a href=\"https://www.presidency.ucsb.edu/statistics/elections/1944\">won in November 1944</a>, but Roosevelt was already fading by then. He and Truman <a href=\"https://www.whitehousehistory.org/the-life-and-presidency-of-harry-s-truman\">met alone only twice as President and Vice President</a> before Roosevelt had a massive stroke and died on April 12, 1945. Four months earlier, Truman had been a middleweight senator of only 10 years’ standing. Now he was president.</p>\n<p>A <a href=\"https://s3.amazonaws.com/NARAprodstorage/opastorage/live/67/4118/1411867/content/arcmedia/congress/08276.pdf\">joint resolution</a> stipulating presidential term limits was introduced on the first day of the 80th Congress in 1947. Agreed on March 21 by Republicans and enough Democrats to matter, the text was sent to the states for ratification.</p>\n<p>It would not be a swift process. Although Maine and Michigan ratified the amendment on March 31, 1947, it would take three years and 343 days before the Minnesota Legislature’s decision passed the Article V threshold —  then a record length of time.</p>\n<p>The 22nd Amendment has rarely been a source of deep controversy. President Ronald Reagan retained approval ratings generally above 50 percent right to the end of his presidency, and <a href=\"https://www.washingtonpost.com/archive/politics/1986/06/16/short-sighted-amendment/236a7677-5e32-4013-b2a7-1909e55a1db9/\">came to think</a> the amendment was “a mistake”; but he was 77 by the end of his second term and his health was declining.</p>\n<p>President Bill Clinton was more grudging, <a href=\"https://www.rollingstone.com/politics/politics-news/bill-clinton-the-rolling-stone-interview-2-40256/\">telling Rolling Stone</a> in 2000, “Oh, I probably would have run again.” Asked if he thought he would have won, he replied “Yes I do. But it’s hard to say, because it’s entirely academic.”</p>\n<p>Trump has <a href=\"https://thehill.com/homenews/house/4988568-trump-third-term-house-republicans/\">publicly toyed</a> with the idea that his tenure might not have to end in 2029. He markets <a href=\"https://www.trumpstore.com/trump-2028-hat\">“Trump 2028” baseball caps</a>, and constitutional and criminal lawyer Alan Dershowitz has <a href=\"https://www.wsj.com/politics/elections/trump-told-by-alan-dershowitz-constitutionality-of-third-term-is-unclear-33133eb8?mod=hp_featst_pos3\">argued</a> that “it’s not clear if a president can become a third term president and it’s not clear if it’s permissible.” Trump himself clearly relishes the horror and outrage the suggestion inspires in his opponents.</p>\n<p>How could its provisions be overcome? Some point to its prohibition against being “elected to the office of the President more than twice,” arguing that Trump could succeed to the presidency by becoming the running-mate of a puppet candidate who would resign after being inaugurated. More improbable still, Trump might somehow become Speaker of the House of Representatives — second in the order of succession — and thence climb back to the White House by succeeding or somehow being deemed “acting as president.”</p>\n<p>It would take a vivid imagination to suppose the authors of the 22nd Amendment meant anything other than a simple two-term limit. There is no reason to think the word “elected” was chosen as a loophole for a future would-be autocrat to exploit, as both originalists and textualists would surely have to agree. Only a strict constructionist might find a coherent path through.</p>\n<p>It is impossible to predict what Trump will do when the primaries for 2028 draw near, for the simple reason that, as I <a href=\"https://thehill.com/opinion/finance/5260979-looking-for-logic-in-trumps-tariffs-is-a-fools-errand/\">have said before</a>, he himself does not know what he will do next. An attempt to defy the 22nd Amendment would ultimately be adjudicated by the Supreme Court. Six of its members, including Chief Justice John Roberts, were nominated by Republican presidents, three by Trump himself.</p>\n<p>The court’s recent decisions in cases like <a href=\"https://www.supremecourt.gov/opinions/23pdf/603us1r57_6k47.pdf\">Trump v. United States</a> and <a href=\"https://www.supremecourt.gov/opinions/24pdf/25a169_5h25.pdf\">Noem v. Vasquez Perdomo</a> have indicated sympathy with the administration’s maximalist interpretation of executive power, although its recent ruling against tariffs in <a href=\"https://www.supremecourt.gov/opinions/25pdf/24-1287_4gcj.pdf\">Learning Resources, Inc. v. Trump</a> ameliorated that. But to contort the prima facie meaning of an amendment so overtly? </p>\n<p>The 22nd Amendment has stood strong and firm for 75 years — but for how much longer?</p>\n<p><em>Eliot Wilson is a freelance writer on politics and international affairs and the co-founder of Pivot Point Group. He was senior official in the U.K. House of Commons from 2005 to 2016, including serving as a clerk of the Defence Committee and secretary of the U.K. delegation to the NATO Parliamentary Assembly.</em></p>",
            "kind": 1,
            "link": "https://thehill.com/opinion/white-house/5758358-75th-anniversary-22nd-amendment/",
            "pub_date": "2026-02-28 01:41:04",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5758945,
            "title": "Atlantic reporter says Crockett campaign ejected her from event",
            "description": "<p>Atlantic journalist Elaine Godfrey reported in a piece published on Friday that she had been ejected from a campaign event for Rep. Jasmine Crockett (D-Texas), one of the two Democrats vying for Texas Senate this year – a claim Crockett’s campaign has denied.  </p>\n<p><a href=\"https://www.theatlantic.com/politics/2026/02/texas-senate-democratic-primary-talarico-crockett/686154/?gift=zYCTBrO_7y7KHmiTPdBdgy4WhHAIcXijFBHeV034_ys\">In the piece</a>, Godfrey said a woman with a “badge” had asked her to leave the Crockett campaign event in Lubbock, Texas. </p>\n<p>“They just said, ‘Elaine from Atlantic, white girl with a hat and notepad. She’s interviewing people in the crowd. She’s a top-notch hater and will spin. She needs to leave,’” the woman told Godfrey, according to the Atlantic report.</p>\n<p>Godfrey said she agreed to leave, and was then escorted by guards to a highway near the event. </p>\n<p>The congresswoman in an interview with CBS News denied that her campaign had ejected the reporter. </p>\n<p>“I’ll just say that it’s silly season,” Crockett <a href=\"https://x.com/shawnamizelle/status/2026850494849622342\">told CBS News</a> on Wednesday. She did not mention Godfrey by the name in the interview.  </p>\n<p>“I will say that, you know, there is a specific journalist who is — she has a history of being less than truthful, and frankly, there’s no evidence of anything that she’s talking about. I’ve not seen anything,” Crockett said. </p>\n<p>Crockett also claimed that Godfrey had been sued for defamation and lost. The Atlantic reputed that account on X. </p>\n<p>“We are not sure who this video is describing: Elaine Godfrey has never been sued for defamation, and she was in fact removed from a campaign rally in Lubbock this week,” Anna Bross, senior vice president of communications at The Atlantic, <a href=\"https://x.com/AnnaCBross/status/2027150296405737976\">wrote on X.</a> </p>\n<p>A Crockett campaign spokesperson did not immediately respond to a request for comment from The Hill.   </p>\n<p>In her story in the Atlantic, Godfrey wrote that a Crockett campaign spokesperson did not respond to a request for comment about the incident. </p>\n<p>The series of events sparked criticism of Crockett from some Democrats. </p>\n<p>“Kicking out a reporter is bad. Blatantly lying about it is even worse,” “Pod Save America” podcast co-host Jon Favreau, who served as a speechwriter to former President Obama, <a href=\"https://x.com/jonfavs/status/2027389423692939762\">wrote on X.</a>  </p>\n<p>Democratic strategist Max Burns <a href=\"https://x.com/themaxburns/status/2027410414531653707\">suggested on X</a> that “the more the press consciously frames Crockett as violating the ‘rules’ of the game, the more her supporters rally,” drawing parallels to “Trump’s MAGA core strategy.” </p>\n<p>Godfrey’s piece came after Semafor <a href=\"https://www.semafor.com/article/02/24/2026/texas-senate-candidate-jasmine-crockett-escalates-her-war-on-the-press\">reported</a> on the incident<a href=\"https://www.semafor.com/article/02/24/2026/texas-senate-candidate-jasmine-crockett-escalates-her-war-on-the-press\"> </a>this week. The outlet also said that Crockett’s campaign had called the Capitol Police on a CNN reporter for possible trespassing when he attempted to visit a campaign office location. CNN and Crockett’s team declined to comment on the matter for Semafor’s piece. </p>\n<p>“The Atlantic confirms our story in more detail. Crockett and her spokesperson pretty brazenly lied here. A bizarre move knowing, as I told them, that the Atlantic was going to publish their piece pretty soon anyway,” Semafor’s Max Tani <a href=\"https://x.com/maxwelltani/status/2027169064389337257\">wrote on X.</a></p>\n<p>The controversy comes as Crockett campaigns in the closely watched Democratic primary for Senate in Texas, as her party grows bullish about its chances of flipping incumbent Sen. Jon Cornyn’s (R) seat in the red stronghold. </p>\n<p>One recent survey from the University of Texas/Texas Politics Project found Crockett up by double-digits over her rival, Democrat James Talarico, in a race that’s been seen as a clash between competing approaches for the party in a state that went to Trump by double digits in 2024. </p>\n<p></p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/campaign/5758945-atlantic-journalist-removed-campaign-rally/",
            "pub_date": "2026-02-28 01:16:18",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5758942,
            "title": "'I did nothing wrong': Bill Clinton denies knowledge of Epstein abuse in deposition",
            "description": "<p>Former President Clinton said he “did nothing wrong” and had “no idea of the crimes” Jeffrey Epstein was committing as he kicked off a deposition with the House Oversight and Government Reform Committee on Friday.</p>\n<p>“Though my brief acquaintance with Epstein ended years before his crimes came to light, and though I never witnessed during our interactions any indication of what was truly going on, I am here to offer what little I know so that it might prevent anything like this from ever happening again,” Clinton said in a <a href=\"https://x.com/BillClinton/status/2027424128559452573/photo/1\">prepared opening statement</a> posted on social media.</p>\n<p>He went on to say that he had “no idea of the crimes Epstein was committing,” and “saw nothing that ever gave me pause.”</p>\n<p>“I saw nothing, and I did nothing wrong,” Clinton said.</p>\n<p>Clinton is sitting for a deposition with the committee in Chappaqua, N.Y., after he and his wife, former Secretary of State Hillary Clinton, reversed course and agreed to interviews as they faced being held in contempt of Congress for defying a congressional subpoena.</p>\n<p>Hillary Clinton on Thursday sat for an hours-long deposition with the committee, in which she told the panel that <a href=\"https://thehill.com/homenews/house/5756577-clintons-questioned-epstein-links/\">she did not recall ever meeting</a> Epstein, only knew Ghislaine Maxwell as a casual acquaintance, and had no knowledge of their criminal activities. </p>\n<p>The former president bristled at his wife being called to appear.</p>\n<p>“But before we start, I have to get personal. You made Hillary come in. She had nothing to do with Jeffrey Epstein. Nothing,” Clinton said. “Whether you subpoenaed 10 people or 10,000, including her was simply not right.”</p>\n<p>Bill Clinton, however, had a documented friendship with Epstein in the 1990s through about 2003. Epstein visited the White House during the Clinton administration; Clinton flew on Epstein’s plane multiple times; and photos have emerged of Clinton and Epstein. Clinton has said that he never visited Epstein’s island.</p>\n<p>“As someone who grew up in a home with domestic abuse, not only would I not have flown on his plane if I had any inkling of what he was doing—I would have turned him in myself and led the call for justice for his crimes, not sweetheart deals,” Clinton said.</p>\n<p>“No matter how many photos you show me, I have two things at the end of the day matter more than your interpretation of those 20-year-old photos,” Clinton added. “I know what I saw, and more importantly, what I didn’t see. I know what I did, and more importantly, what I didn’t do.”</p>\n<p>Hillary Clinton told reporters on Thursday that she was confident that her husband did not know anything about Epstein’s crimes, noting the chronology of their connection. Bill Clinton’s relationship with Epstein ended “several years” before the late financier was convicted of procuring a minor for prostitution in 2008.</p>\n<p>Bill Clinton noted that too.</p>\n<p>“We are only here because he hid it from everyone so well for so long. And by the time it came to light with his 2008 guilty plea, I had long stopped associating with him,” Clinton said.</p>\n<p>House Oversight Committee Chair James Comer (R-Ky.) said that Hillary Clinton’s deposition will inform their line of questioning of the former president.</p>\n<p>“Yesterday, Ms. Clinton deferred a lot of questions to her husband today. There were at least a dozen times when she said, ‘You’ll have to ask my husband that, I can’t answer that,’” Comer said in a press conference ahead of the deposition. “So, we already had a big portfolio of questions for him, and that increased yesterday.”</p>\n<p>Democrats on the Oversight panel have warned that by compelling a former president to comply with a congressional subpoena, Republicans have set a new precedent — one that could lead to Democrats eventually forcing President Trump to testify when they are back in power. </p>\n<p>Oversight ranking member Robert Garcia (D-Calif.) and other Democrats are calling for Trump to testify to the committee about documents they allege are missing from the Department of Justice’s disclosure of the so-called Epstein Files, which include unverified allegations of sexual abuse against Trump. The DOJ said Wednesday that it is <a href=\"https://thehill.com/homenews/administration/5756249-doj-investigates-withheld-fbi-interviews/\">reviewing the files</a> that appear to be missing.</p>\n<p>“Before this, we had the Trump rule. Trump defied, as all of you know, a congressional subpoena with the January 6 Committee. He said, presidents don’t have to testify,” Rep. Ro Khanna (D-Calif.) said in a press conference before the deposition. “Now we have the Clinton rule, which is that presidents and their families have to testify when Congress issues a subpoena, and that means that Donald Trump needs to come before our committee and explain what he knew about Epstein and explain why we have not had a full release of the documents.”</p>\n<p>The Oversight panel had voted on a bipartisan basis to subpoena the Clintons and several other former government officials last year, and spent months negotiating with the Clintons over how they could provide testimony about their links to Epstein.</p>\n<p>As they attempted to avoid depositions, the Clintons argued that they had already provided the committee with all the information they had about Epstein and Maxwell, provided sworn statements that they had no knowledge of their criminal activities, and argued that the subpoenas were invalid. </p>\n<p>Later, they <a href=\"https://thehill.com/homenews/house/5718848-clintons-reject-deposition-offer/\">sought</a> to have Hillary Clinton provide a sworn statement instead of testifying, and sought to limit the former president’s deposition to a four-hour interview. </p>\n<p>In January, nine <a href=\"https://thehill.com/homenews/house/5699996-democrats-clintons-contempt-vote/\">Democrats on the panel voted</a> with Republicans to hold the former president in contempt of Congress over the refusal to sit for a deposition, while three Democrats voted to hold Hillary Clinton in contempt of Congress.</p>\n<p>Hillary Clinton on Thursday also bristled at Rep. Lauren Boebert (R-Colo.) <a href=\"https://thehill.com/homenews/house/5757287-hillary-clinton-deposition-boebert-photo/\">leaking a photo of her during the deposition</a>, in violation of agreed-upon rules, and about Republican members asking about UFOs and the Pizzagate conspiracy theory.</p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/house/5758942-bill-clinton-jeffrey-epstein-deposition/",
            "pub_date": "2026-02-28 01:16:17",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5758898,
            "title": "Altman says OpenAI agrees with Anthropic's red lines in Pentagon dispute",
            "description": "<p>OpenAI CEO Sam Altman said Friday that he agrees with Anthropic’s red lines in its increasingly contentious negotiations with the Pentagon over the terms of use for the company’s AI models.</p>\n<p>As the feud between Anthropic and the Defense Department (DOD) has reached a boiling point, the AI firm has refused to budge on lifting restrictions on two issues — mass surveillance and lethal autonomous weapons.</p>\n<p>The Pentagon has pushed for the company to agree to language that allows for “all lawful uses” of its technology. The DOD has given Anthropic until Friday at 5:01 p.m. ET to agree to its terms.</p>\n<p>If the company does not, the department is threatening to cancel a $200 million contract, in addition to warning it could label the AI firm a “supply chain risk” or invoke the Defense Production Act (DPA), a federal power typically reserved for wartime or emergencies. </p>\n<p>“I don’t personally think the Pentagon should be threatening DPA against these companies,” Altman told CNBC’s “Squawk Box” on Friday morning.</p>\n<p>“But I also think that companies that choose to work with the Pentagon, as long as it is going to comply with legal protections and the few red lines that the field, we have, I think we share with Anthropic and that other companies also independently agree with, I think it is important to do that,” he continued.</p>\n<p>“For all the differences I have with Anthropic, I mostly trust them as a company, and I think they really do care about safety, and I’ve been happy that they’ve been supporting our warfighters,” the OpenAI CEO added.</p>\n<p>OpenAI and Anthropic are major competitors in the commercial AI race, a rivalry highlighted by Anthropic’s Super Bowl ad knocking OpenAI’s plan to introduce advertising to it’s free ChatGPT tool. Altman and Amodei notably declined to clasp hands during a group photo shoot at India’s AI summit last week. </p>\n<p>Ahead of the Friday deadline, Anthropic CEO Dario Amodei said in a lengthy statement that the company “cannot in good conscience accede” to the Pentagon’s terms.</p>\n<p>“Anthropic understands that the Department of War, not private companies, makes military decisions,” he wrote in the statement released late Thursday. “We have never raised objections to particular military operations nor attempted to limit use of our technology in an ad hoc manner.”</p>\n<p>“However, in a narrow set of cases, we believe AI can undermine, rather than defend, democratic values,” he added. “Some uses are also simply outside the bounds of what today’s technology can safely and reliably do.”</p>\n<p>The Pentagon has argued that it has “no interest” in using AI to conduct mass surveillance or develop autonomous weapons.</p>\n<p>Following Amodei’s statement Thursday, Under Secretary of War Emil Michael accused the Anthropic CEO of having a “God-complex.”</p>\n<p>“He wants nothing more than to try to personally control the US Military and is ok putting our nation’s safety at risk,” he wrote in a post on the social platform X. “The @DeptofWar will ALWAYS adhere to the law but not bend to whims of any one for-profit tech company.”</p>",
            "kind": 1,
            "link": "https://thehill.com/policy/technology/5758898-altman-backs-anthropic-pentagon-stand/",
            "pub_date": "2026-02-28 01:10:55",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5758838,
            "title": "'Say no to pajamas': Florida airport issues 'ban' on PJs, but it was 'all in fun'",
            "description": "<p>TAMPA, Fla. (<a href=\"https://fox8.com/news/had-enough-airport-says-its-time-to-ban-pajamas/\">WJW</a>) – “It’s time to ban pajamas at Tampa International Airport.”</p>\n<p>A Florida airport <a href=\"https://x.com/FlyTPA/status/2027037182091731286/photo/1\">said on social media Thursday</a> that it wanted to prohibit people from wearing PJs, but it wasn’t being serious.</p>\n<div class=\"nlp-ignore-block article-content rich-text\">\n\n</div>\n<p>In a cheeky social media post, the airport claimed to have already banned Crocs and given “everyone the amazing opportunity to experience the world’s first Crocs-free airport.”</p>\n<p>“Pajamas. At the airport. In the middle of the day,” the airport wrote in a <a href=\"https://x.com/FlyTPA/status/2027037182091731286/photo/1\" rel=\"noreferrer noopener\" target=\"_blank\">social media post</a>. “We’ve seen enough, we’ve had enough,” adding that “the madness stops today.” </p>\n<p>“Help Tampa International Airport become the first Crocs-free and pajama-free airport,” the post continued. “Do your part. Say no to pajamas at TPA.”</p>\n<div class=\"nlp-ignore-block article-content rich-text\">\n\n</div>\n<p>Of course, travelers looking for comfort may have a different opinion on the matter. Commenters on the post added some reasons they’re traveling in comfort.</p>\n<p>“I realize that in the days of yore, people dressed up for air travel. This was also the first cabin then. People only care about price. The PJs stay,” <a href=\"https://x.com/FlyTPA/status/2027037182091731286/photo/1\" rel=\"noreferrer noopener\" target=\"_blank\">one wrote</a>.</p>\n<p>“I can’t support this, having sat at the terminal from 10 PM until nearly 4 AM on a flight delay,” <a href=\"https://x.com/FlyTPA/status/2027037182091731286/photo/1\" rel=\"noreferrer noopener\" target=\"_blank\">wrote another</a>. According to FlightAware, there were nearly 1,800 <a href=\"https://www.flightaware.com/live/cancelled/today\" rel=\"noreferrer noopener\" target=\"_blank\">delays in the U.S. before noon on Thursday</a>.</p>\n<p><a href=\"https://x.com/FlyTPA/status/2027037182091731286/photo/1\" rel=\"noreferrer noopener\" target=\"_blank\">Another commenter said</a>, “I think a lot of people have also had enough. Of airports and airlines. We’re treated like cattle with rare exceptions, stuffed into tiny little seats. … We pay exorbitant prices for food and drink at the airport and then receive peanuts and a biscuit for a meal on the plane.”</p>\n<p>Beau Zimmer, an airport spokesperson, told The Associated Press the post was part of the airport’s longstanding social media persona — a tongue-in-cheek voice it has cultivated since its early days on Twitter, before the platform rebranded as X. The account has attracted a loyal global following, he said.</p>\n<p>“Our regular social media followers just eat this stuff up,” Zimmer said. “But obviously, this is all in fun, and we encourage our travelers to be comfortable.”</p>\n<p>Nexstar’s WJW sister station, WFLA, got a statement from Tampa International Airport as well.</p>\n<p>“Tampa International Airport regularly shares lighthearted, satirical social media content as part of our ongoing effort to engage with our followers. Today’s post about ‘banning’ pajamas was another playful nod to day-of-travel fashion debates. We encourage our passengers to travel comfortably and appreciate our loyal followers who enjoy the online humor.”</p>\n<p>U.S. Transportation Secretary Sean Duffy reacted to the post with a GIF of actor John Krasinski from the TV show “The Office” looking into the camera and saying, “Yes!”</p>\n<p>Last year, before holiday travel, Duffy <a href=\"https://www.livenowfox.com/news/transportation-secretary-americans-ditch-pajamas-slippers-airport-travel-holidays\" rel=\"noreferrer noopener\" target=\"_blank\">issued a plea</a>.</p>\n<p>“I call this, just maybe dressing with some respect. You know, whether it’s a pair of jeans and a decent shirt,” he said in <a href=\"https://www.livenowfox.com/news/transportation-secretary-americans-ditch-pajamas-slippers-airport-travel-holidays\" rel=\"noreferrer noopener\" target=\"_blank\">November 2025</a>. “I would encourage people to maybe dress a little bit better, which encourages, encourages us to maybe behave a little better. Let’s try not to wear slippers and pajamas as we come to the airport.” </p>\n<p><em>The Associated Press contributed to this report. </em></p>",
            "kind": 1,
            "link": "https://thehill.com/policy/transportation/5758838-florida-airport-pjs-ban/",
            "pub_date": "2026-02-28 01:10:54",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5758890,
            "title": "Boebert on Hillary Clinton deposition photo leak: 'The Democrats were breaking the rules, too'",
            "description": "<p>Rep. Lauren Boebert (R-Colo.) is defending her decision on Thursday to share a picture of former Secretary of State Hillary Clinton during her closed-door <a href=\"https://thehill.com/homenews/house/5756577-clintons-questioned-epstein-links/\">deposition</a> before the House Oversight and Government Reform Committee. </p>\n<p>Boebert said she shared the image, which was taken before the hearing began, with right-wing podcaster Benny Johnson after receiving permission from the committee’s staff. Johnson then <a href=\"https://x.com/bennyjohnson/status/2027165683016933479?s=20\">posted</a> the image on social media. </p>\n<p>In an interview with NewsNation’s Chris Cuomo on Thursday, Boebert deflected blame on to Democratic committee members who shared updates about Clinton’s deposition with reporters. </p>\n<p>“However, there were Democrats and those at the minority party that were releasing information about the hearing throughout the day, topics that were discussed were being leaked to the media,” Boebert said. “And so there was a lot of things that were coming out of that room, but regardless, it was a photo.”</p>\n<p>Boebert said committee members later agreed that no one would take photos during the deposition. </p>\n<p>The committee subpoenaed Clinton’s testimony as part of its probe into convicted sex offender Jeffrey Epstein. The former secretary of State and former President Bill Clinton had battled for months about the deposition.</p>\n<p>Hillary Clinton <a href=\"https://thehill.com/homenews/house/5756577-clintons-questioned-epstein-links/\">repeatedly denied</a> any knowledge about Epstein’s crimes during her six-hour deposition in Chappaqua, N.Y. The former first lady told reporters she only knew Ghislaine Maxwell, Epstein’s associate who was convicted on sex trafficking crimes, “casually as an acquaintance.” </p>\n<p>Bill Clinton is set to <a href=\"https://thehill.com/homenews/house/5758483-bill-clinton-closed-door-testimony-epstein-files-house-oversight/\">testify</a> before the committee on Friday. The former president has previously gone on record about his relationship with Epstein, addressing his inclusion on the flight logs of the sexual predator’s private jet in a 2024 memoir. </p>\n<p>“Traveling on Epstein’s plane was not worth the years of questioning afterward,” he wrote in a 2024 autobiography. “I wish I had never met him.”</p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/house/5758890-boebert-on-hillary-clinton-deposition-photo-leak-the-democrats-were-breaking-the-rules-too/",
            "pub_date": "2026-02-28 00:56:50",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5756846,
            "title": "Mexico's chaos is disrupting North American free trade",
            "description": "<p>A specter is haunting Mexico’s investment climate — the specter of regulatory and tax uncertainty. </p>\n<p>Mexico’s structural and geographic advantages are <a href=\"https://www.dallasfed.org/research/economics/2024/1205\" rel=\"noreferrer noopener\" target=\"_blank\">well-known</a> and have generated considerable investment interest for decades. The renegotiation of the North American Free Trade Agreement to the United States-Mexico-Canada Agreement, combined with the drive to rewire supply chains and push for economic security, has witnessed a <a href=\"https://www.csis.org/analysis/nearshoring-without-growth-why-investment-uncertainty-holding-mexico-back\" rel=\"noreferrer noopener\" target=\"_blank\">boom</a> in foreign direct investment in Mexico. </p>\n<p>However, policy choices by the Sheinbaum government risk undermining the country’s investment proposition and stymieing economic growth. And as tariffs alter trading patterns elsewhere and Mexico solidifies its role as the United States’ <a href=\"https://www.csis.org/analysis/mexico-now-top-importer-us-goods\" rel=\"noreferrer noopener\" target=\"_blank\">top overall trade partner</a>, investment uncertainty will have cross-border spillover effects that impact North American supply chains as well as related efforts to reduce geopolitical disruptions and vulnerabilities to China’s coercion. </p>\n<p>Following an explosion of social and infrastructure <a href=\"https://www.americasquarterly.org/article/amlos-bet-on-mexicos-south-is-paying-off-for-now/\" rel=\"noreferrer noopener\" target=\"_blank\">spending</a> in the final years of her predecessor’s administration, the Mexican government is under pressure to reduce fiscal deficits and shore up the country’s finances. In recent years, this has manifested in an aggressive campaign to raise fiscal revenues by taxing companies, sometimes claiming retroactive fees on cases settled under previous administrations. The Mexican government has pursued claims against dozens of large companies for back taxes and other penalties. </p>\n<p>The uncertainty unleashed by Mexico City’s policy choices cuts directly against rule of law and stability. The results are visible in anemic economic growth projections for 2026. Much of Mexico’s trade with the U.S. remains tariff free under the USMCA; nevertheless, the country’s GDP growth estimate for this year is a paltry <a href=\"https://www.scotiabank.com/ca/en/about/economics/economics-publications/post.other-publications.latam-insights.latam-insights--january-6--2026-.html#:~:text=For%202025%2C%20the%20IMF%20estimates,1.3%25%20and%20Scotiabank's%200.6%25.\" rel=\"noreferrer noopener\" target=\"_blank\">0.6</a> to <a href=\"https://www.scotiabank.com/ca/en/about/economics/economics-publications/post.other-publications.latam-insights.latam-insights--january-6--2026-.html#:~:text=For%202025%2C%20the%20IMF%20estimates,1.3%25%20and%20Scotiabank's%200.6%25.\" rel=\"noreferrer noopener\" target=\"_blank\">1.5</a> percent. The binding <a href=\"https://www.csis.org/analysis/nearshoring-without-growth-why-investment-uncertainty-holding-mexico-back\" rel=\"noreferrer noopener\" target=\"_blank\">constraint</a> is <a href=\"https://www.csis.org/analysis/nearshoring-without-growth-why-investment-uncertainty-holding-mexico-back\" rel=\"noreferrer noopener\" target=\"_blank\">investment</a>. Total investment in Mexico, defined as the sum of private, public and foreign investment, declined by roughly <a href=\"https://elpais.com/mexico/opinion/2025-11-30/mexico-necesita-concretar-los-planes.html\" rel=\"noreferrer noopener\" target=\"_blank\">10 percent</a> in 2025. </p>\n<p>Mexico’s <a href=\"https://www.csis.org/analysis/nearshoring-without-growth-why-investment-uncertainty-holding-mexico-back\" rel=\"noreferrer noopener\" target=\"_blank\">policies</a> in the fiscal space set a dangerous precedent for investment in North America. They also ensure that the structural and geographic advantages the country enjoys <a href=\"https://www.csis.org/analysis/nearshoring-without-growth-why-investment-uncertainty-holding-mexico-back\" rel=\"noreferrer noopener\" target=\"_blank\">fail to materialize</a> into durable economic gains. </p>\n<p>When the rules applied today do not clearly apply to tomorrow, and when enforcement fails to respect basic tenets of transparency, predictability and non-retroactivity, firms leave capital on the sidelines to hedge against contingencies. In some cases, major changes have been introduced with <a href=\"https://ustr.gov/sites/default/files/files/Press/Reports/2025NTE.pdf\" rel=\"noreferrer noopener\" target=\"_blank\">little notice</a> and no meaningful implementation period, creating immediate operational disruptions across North American supply chains. </p>\n<p>To compound these matters, Mexico’s <a href=\"https://www.csis.org/events/justice-ballot-impact-mexicos-judicial-reform-rule-law-and-business-environment\" rel=\"noreferrer noopener\" target=\"_blank\">judicial overhaul</a>, under which every justice in the country is popularly elected, with an initial round of elections in 2025 and a second in 2027, has consolidated the ruling Morena Party’s <a href=\"https://www.csis.org/analysis/no-checks-power-effects-mexicos-judicial-reform-foreign-investment-and-usmca/\" rel=\"noreferrer noopener\" target=\"_blank\">control</a> over all branches of Mexico’s government.</p>\n<p>Companies must pursue remediation in a court system increasingly favoring a Mexican state pursuing occasionally predatory policies. Aggressive audits and the denial of refund requests serve to intimidate companies and send the message that payment is the path of least resistance. The result is that expansion plans are put on hold, and profits are immobilized to remain in reserve as a hedge against enforcement risk.  </p>\n<p>Not even Mexico’s vaunted special economic zones have been spared. Long recognized as responsible for driving much of the country’s export-oriented growth and increasing its competitiveness, companies report the Mexican government ignoring tax deductions and exemptions recognized under previous Mexican administrations and even engaging in <a href=\"https://www.cta.tech/media/bicb4rey/cta-comments-on-the-usmca-joint-review.pdf\" rel=\"noreferrer noopener\" target=\"_blank\">double taxation</a> against some companies operating in these manufacturing-oriented zones.  </p>\n<p>As my organization <a href=\"https://www.csis.org/analysis/nearshoring-without-growth-why-investment-uncertainty-holding-mexico-back\" rel=\"noreferrer noopener\" target=\"_blank\">noted</a> in a recent analysis: “Industry submissions to the U.S. Trade Representative illustrate this dynamic, with firms reporting retroactive reinterpretations of value-added tax rules, in some instances extending back nearly a decade.” To complicate matters, retroactivity has been <a href=\"https://www.jornada.com.mx/noticia/2025/10/01/politica/pospone-corte-discusion-sobre-doble-cobro-tributario-a-maquiladoras\" rel=\"noreferrer noopener\" target=\"_blank\">supported</a> by Mexican justices before. </p>\n<p>Mexico’s policy choices are inevitably a North America problem. During the <a href=\"https://www.csis.org/analysis/usmca-review-2026\" rel=\"noreferrer noopener\" target=\"_blank\">upcoming USMCA review</a>, Mexico’s investment climate and the impacts on U.S. and Canadian companies will be under intense scrutiny. Indeed, in recent testimony before the U.S. Congress, United States Trade Representative Jamieson Greer <a href=\"https://ustr.gov/about/policy-offices/press-office/press-releases/2025/december/ambassador-greer-reported-congress-operation-united-states-mexico-canada-agreement\" rel=\"noreferrer noopener\" target=\"_blank\">referenced</a> investment uncertainty casting a shadow over the future of the USMCA. Mexico’s policy choices, by extension, risk tainting broader perceptions of North America as an investment destination. </p>\n<p>Since much of this pain is self-inflicted, the solutions are well known. To be sure, tax enforcement has been a challenge for multiple Mexican administrations, but the fiscal shortfall cannot and should not come from squeezing companies operating in North America under established rules and prior agreements reached with previous governments. Instead, the Morena Party should work to reduce informality in Mexico’s economy and enforce compliance against wealthy individuals who have evaded payment for years — some of whom are even <a href=\"https://www.washingtonpost.com/es/post-opinion/2019/09/24/manuel-bartlett-sus-empresas-propiedades-e-historia/\" rel=\"noreferrer noopener\" target=\"_blank\">major figures</a> within the party itself. </p>\n<p>Uncertain audits, aggressive tax claims and shifting rules may seem like quick fixes to wring resources from companies, but they will not solve Morena’s fiscal woes and will likely only damage Mexico’s long-term reputation. Only a regulatory climate capable of generating conditions for further investment can help Mexico reach its full potential. </p>\n<p><em>Ryan C. Berg, Ph.D. is director of the Americas Program at the Center for Strategic &amp; International Studies.</em></p>",
            "kind": 1,
            "link": "https://thehill.com/opinion/international/5756846-mexico-investment-uncertainty-impact/",
            "pub_date": "2026-02-28 00:35:58",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5758819,
            "title": "Senate Democrats demand tariff refunds begin 'immediately'",
            "description": "<p>Senate Minority Leader Chuck Schumer (D-N.Y.) and other Democrats are demanding <a data-id=\"https://thehill.com/regulation/court-battles/5747881-supreme-court-tariff-refunds/\" data-type=\"link\" href=\"https://thehill.com/regulation/court-battles/5747881-supreme-court-tariff-refunds/\">refunds </a>for their constituents after the Supreme Court <a href=\"https://thehill.com/regulation/court-battles/5687657-scotus-rejects-trump-emergency-tariffs/\">struck down the bulk</a> of President Trump’s tariff agenda last week.</p>\n<p>Their request came in a <a data-id=\"https://www.democrats.senate.gov/imo/media/doc/20260227_letter_to_treasury_on_tariff_refunds_finalpdf.pdf\" data-type=\"link\" href=\"https://www.democrats.senate.gov/imo/media/doc/20260227_letter_to_treasury_on_tariff_refunds_finalpdf.pdf\">Friday letter</a> addressed to Treasury Secretary Scott Bessent. The group of senators referenced Bessent’s previous <a href=\"https://thehill.com/homenews/administration/5683246-trump-tariffs-treasury-refunds/\">assurance</a> in January that refunds “won’t be a problem” if the high court <a data-id=\"https://thehill.com/homenews/5747935-trump-tariffs-supreme-court-ruling/\" data-type=\"link\" href=\"https://thehill.com/homenews/5747935-trump-tariffs-supreme-court-ruling/\">ruled against</a> Trump’s tariffs.</p>\n<p>“The Court has said it. In a 6-3 ruling, it found that the president exceeded his legal authority,” the group wrote in the letter. “You need to give the people their money back.”</p>\n<p>Schumer and the co-signers asked U.S. Customs and Border Protection (CBP) to “immediately” launch the refund process within the next 90 days. Additionally, the letter urged the Trump administration to prioritize the needs of those hit hardest by these tariffs, including <a data-id=\"https://thehill.com/regulation/court-battles/5753191-small-businesses-win-trump-tariffs/\" data-type=\"link\" href=\"https://thehill.com/regulation/court-battles/5753191-small-businesses-win-trump-tariffs/\">small businesses</a>. </p>\n<p>“The Supreme Court’s ruling was not, as you characterized it, ‘a loss for the American people.’ It was a reaffirmation that no president is above the law,” they wrote.</p>\n<p>“The true loss for the American people would be an administration that collected over $130 billion in illegal taxes and then refused — with a smile and a shrug — to give it back,” the letter continues. “If this administration does not act, Congress will.”</p>\n<p>The Democrats’ demands come <a data-id=\"https://thehill.com/business/5632091-companies-challenge-trump-tariffs/\" data-type=\"link\" href=\"https://thehill.com/business/5632091-companies-challenge-trump-tariffs/\">amid lawsuits</a> from several large companies, from Costco to Revlon to <a data-id=\"https://thehill.com/business/5752347-fedex-trump-administration-tariff-refunds-supreme-court-ruling/\" data-type=\"link\" href=\"https://thehill.com/business/5752347-fedex-trump-administration-tariff-refunds-supreme-court-ruling/\">FedEx</a>, to seek refunds for their losses due to Trump’s sweeping import taxes.</p>\n<p>Additionally, Maryland officials <a href=\"https://thehill.com/homenews/state-watch/5758687-supreme-court-rules-trump-tariffs/\">separately demanded</a> refunds for their states’ businesses and constituents in a letter sent to the Trump administration on Friday morning. </p>\n<p>Following the Supreme Court’s <a data-id=\"https://thehill.com/regulation/court-battles/5747353-read-supreme-court-trump-tariffs-ruling/\" data-type=\"link\" href=\"https://thehill.com/regulation/court-battles/5747353-read-supreme-court-trump-tariffs-ruling/\">ruling last week</a>, Gov. Wes Moore (D-Md.) <a data-id=\"https://thehill.com/homenews/state-watch/5758687-supreme-court-rules-trump-tariffs/\" data-type=\"link\" href=\"https://thehill.com/homenews/state-watch/5758687-supreme-court-rules-trump-tariffs/\">said in a Friday press release</a> that “the Trump Administration needs to do what’s right and pay Marylanders back,” <a data-id=\"https://thehill.com/homenews/senate/5747530-elizabeth-warren-supreme-court-trump-tariff-refunds/\" data-type=\"link\" href=\"https://thehill.com/homenews/senate/5747530-elizabeth-warren-supreme-court-trump-tariff-refunds/\">following</a> in the <a data-id=\"https://thehill.com/homenews/state-watch/5754391-new-york-kathy-hochul-tariff-refunds-trump-supreme-court/\" data-type=\"link\" href=\"https://thehill.com/homenews/state-watch/5754391-new-york-kathy-hochul-tariff-refunds-trump-supreme-court/\">footsteps</a> of <a data-id=\"https://thehill.com/business/5755462-kirsten-gillibrand-new-york-13b-tariff-refunds/\" data-type=\"link\" href=\"https://thehill.com/business/5755462-kirsten-gillibrand-new-york-13b-tariff-refunds/\">other Democrats</a> including Sens. Elizabeth Warren (Mass.) and Kirsten Gillibrand (N.Y.), as well as New York Gov. Kathy Hochul <a data-id=\"https://thehill.com/homenews/state-watch/5748630-pritzker-demands-trump-tariff-refunds/\" data-type=\"link\" href=\"https://thehill.com/homenews/state-watch/5748630-pritzker-demands-trump-tariff-refunds/\">and</a> Illinois Gov. JB Pritzker.</p>\n<p>Trump has made tariffs a cornerstone of his administration’s economic policies. The president doubled down on these measures in the aftermath of the high court’s decision, <a href=\"https://thehill.com/homenews/administration/5748682-trump-imposes-global-tariff/\">imposing</a> 10 percent global tariffs under a Trade Act provision. </p>\n<p>Senate Finance Committee Ranking Member Ron Wyden (D-Ore.), who co-signed Friday’s letter, responded to the <a data-id=\"https://thehill.com/business/5748016-trump-imposes-new-tariffs/\" data-type=\"link\" href=\"https://thehill.com/business/5748016-trump-imposes-new-tariffs/\">new global tariffs</a> last week on the social platform X.</p>\n<p>“We’re all going to have to keep paying higher prices because the president is throwing a tantrum,” Wyden <a href=\"https://x.com/RonWyden/status/2024928560540971197\">posted online</a>. </p>\n<p>Another co-signer, Sen. Tim Kaine (D-Va.), noted congressional efforts to repeal Trump’s tariffs in a <a href=\"https://x.com/SenTimKaine/status/2027410037405032717?s=20\">video</a> posted to his X account on Friday. </p>\n<p>Bipartisan votes in the <a href=\"https://thehill.com/homenews/senate/5581377-trump-tariffs-senate-republicans/\">Senate</a> and <a href=\"https://thehill.com/homenews/house/5734340-trump-tariffs-canada-republicans-rebuke/\">House</a> in the last several months have urged the Trump administration to peel back some of its import taxes on goods from Canada and other international trading partners. </p>\n<p>“Clearly, he doesn’t want to stop hurting everyday people, but we’re going to do what we can to push back against that strategy, as well,” Kaine said, referencing the <a data-id=\"https://thehill.com/homenews/administration/5752082-us-tariffs-10-percent-global-trump-administration/\" data-type=\"link\" href=\"https://thehill.com/homenews/administration/5752082-us-tariffs-10-percent-global-trump-administration/\">new levies</a>.</p>\n<p>“But it’s good news that the Supreme Court tied the president’s hands, upheld clear statutory command of Congress and let the president know he isn’t a king, but he’s supposed to follow the law,” he added.</p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/senate/5758819-senate-democrats-tariff-refunds-trump-administration/",
            "pub_date": "2026-02-28 00:31:05",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5758747,
            "title": "FedEx says it will return any refunds it gets from Trump tariffs to customers",
            "description": "<p>Delivery giant FedEx said it will return to customers any refunds it gets from President Trump’s tariffs after the <a href=\"https://thehill.com/regulation/court-battles/5687657-scotus-rejects-trump-emergency-tariffs/\">Supreme Court ruled them unlawful</a> last week. </p>\n<p>FedEx is among more than 1,000 companies that have <a href=\"https://www.courtlistener.com/docket/72314557/2/federal-express-corporation-v-united-states/\">filed lawsuits</a> with the U.S. Court of International Trade to recoup the costs of Trump’s tariffs, mostly filed before the Supreme Court ruling. </p>\n<p>“If refunds are issued to FedEx, we will issue refunds to the shippers and consumers who originally bore those charges,” FedEx said in a statement on Thursday. “When that will happen and the exact process for requesting and issuing refunds will depend in part on future guidance from the government and the court.”</p>\n<p>In their ruling, the Supreme Court did not specify a means nor a timeline for when the Trump administration must distribute refunds to companies that incurred the costs of tariffs. Senate Democrats on Monday <a href=\"https://thehill.com/homenews/senate/5751002-senate-democrats-trump-tariff-refunds/\">rolled out legislation</a> with a 180-day deadline for the Trump administration to pay back the $175 billion it collected through tariffs. </p>\n<p>“Senate Democrats will continue fighting to rein in Donald Trump’s price-hiking trade and economic policies,” said Sen. Ron Wyden (D-Ore.), one of the lead sponsors of the legislation. “A crucial first step is helping people who need it most, by putting money back in the pockets of small businesses and manufacturers as soon as possible.”</p>\n<p>The Supreme Court’s decision means the president can no longer use the International Emergency Economic Powers Act to impose tariffs, but almost immediately following the ruling, Trump <a href=\"https://thehill.com/business/5751317-supreme-court-strikes-trump-tariffs/\">announced</a> that he would impose tariffs using other trade tools. This included the announcement of a 10 percent universal tariff he imposed through Section 122 of the Trade Act, which expire in 150 days without congressional approval. </p>\n<p>“In order to protect our country, a president can actually charge more tariffs than I was charging in the past period of a year under the various tariffs authorities,” Trump told reporters after the ruling last week, adding, “we can use other of the statutes, other of the tariff authorities, which have also been confirmed and are fully allowed.”</p>",
            "kind": 1,
            "link": "https://thehill.com/business/5758747-fedex-trump-tariffs-reimburse-customers/",
            "pub_date": "2026-02-28 00:31:05",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5758826,
            "title": "Scouting America changing policies to maintain military support, Hegseth says",
            "description": "<p>Scouting America has agreed to change several of its policies to maintain financial backing from the Pentagon, including that membership in the organization will be based solely on “biological sex at birth and not gender identity,” Defense Secretary Pete Hegseth said Friday morning. </p>\n<p>Hegseth, who has threatened to cut ties with Scouting America over its policies of inclusion, said in a video posted on X that the group has agreed to comply with President Trump’s executive order titled “Ending Illegal Discrimination and Restoring Merit-Based Opportunity.” </p>\n<p>He said the group will review and replace “politicized, divisive and discriminatory language,” end its Citizenship in Society merit badge, introduce a Military Service merit badge and waive registration fees for children of active duty, guard and reserve families, the Pentagon chief said in a 6-minute video. </p>\n<p>“Scouting will also make clear that biological boys and girls will not be allowed to occupy or share intimate spaces together, toilets, showers, tents, anywhere like that,” Hegseth said. </p>\n<p>Scouting America, which is based in Texas, allowed gay youth in 2013 and said that it would begin accepting transgender students in 2017. Girls of all ages were allowed to join the organization starting in 2019. Co-ed explorer and venturing programs have operated for decades. </p>\n<p>Hegseth’s announcement comes as the Pentagon said earlier this month it <a href=\"https://thehill.com/policy/defense/5720505-scouting-america-pentagon-agreement-near/\" rel=\"noreferrer noopener\" target=\"_blank\">was close to an agreement</a> with Scounting America, previously called Boy Scouts, after reviewing its partnership over the past several months, saying the group has made choices in the last decade that “run counter to the values of this administration and this Department of War, including an embrace of DEl and other social justice, gender-fluid ideological stances.”</p>\n<p>Scouting America said in a statement to The Hill that it would implement the changes, including “reinforcing our commitment to Scouting’s foundational ideas: leadership, character, duty to God, duty to country and service.” </p>\n<p>“Throughout this engagement, Scouting America held firm on the core commitments that define us. We maintained our name as ‘Scouting America’ and preserved our service to the more than 200,000 girls who participate in our programs,” the group said in a lengthy statement. </p>\n<p>“Girls have been an integral part of Scouting since the 1960s and have served as leaders and program developers for decades. That commitment is unwavering.”  </p>\n<p>The connection between Scouting American and the U.S. military is deep, as the U.S. military has sponsored Scout troops and supported their activities on military bases for decades. The military has long backed the organization’s National Boy Scout Jamboree. </p>\n<p>Hegseth said the department’s support for Scouting America will be contingent upon making and maintaining the proposed changes in the next six months. After six months, the Pentagon will review its progress and reassess its support.</p>\n<p>“If we’re unsatisfied with scouting America’s progress toward and commitment to the agreed upon reforms, we will find them in violation of the president’s executive order and cease our support,” Hegseth said. “We hope that doesn’t happen, but it could.” </p>\n<p>The Pentagon chief said he thinks the organization should go back to being the Boy Scouts. </p>\n<p>“A group that develops boys into men. Maybe someday,” he said.</p>",
            "kind": 1,
            "link": "https://thehill.com/policy/defense/5758826-scouting-america-pentagon-agreement/",
            "pub_date": "2026-02-28 00:26:03",
            "source": "thehill",
            "language": "en"
        }
    ]
}