{
    "data": [
        {
            "id": 5125168,
            "title": "New DNC chair: Democratic Party ‘not dead’",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>Democratic National Committee Chair <a href=\"https://thehill.com/homenews/campaign/5120961-ken-martin-new-dnc-chair-what-to-know/\">Ken Martin</a> said the party was “not dead” despite the party’s loss of the White House and Senate majority in last fall’s elections. </p>\n<p>“We’re not dead as a party. We’re still alive and kicking, and we’re going to fight for our values, and we’re going to fight for American values at this time, when people are seeing what Donald Trump and the Republicans are doing at this time,” Martin said during a Monday appearance on MSNBC’s “The Rachel Maddow Show.”</p>\n\n<p>Martin won the race to become the next DNC chair on Saturday in a highly-contested race. Democrats are looking to Martin to<a href=\"https://thehill.com/homenews/campaign/5019903-dnc-chair-candidate-martin-recenter-agenda/\"> reestablish</a> the party’s presence in states across the nation as preparations for midterm elections kickoff. </p>\n<p>“There’s so many people that have struggled throughout this country over the last several years who are feeling forgotten, left behind, feeling like our party is not fighting for them anymore. And so, what we need to do in this moment when the stakes are so high, right, is to stand up and fight back,” Martin said during the interview.</p>\n<p>“Give people a sense that we’re willing to advocate for their best lives and to make sure that we’re doing everything we can to build for better days to come, for not only Americans but for this world, frankly. There’s a lot at stake right now, and Americans are relying on our party right now to stand up to the excesses and extremes of the Trump administration right now,” he added.</p>\n<p>Martin, well known for his tenure as Minnesota Democratic Farmer Labor party chair said he’s playing the long game when it comes to election bids and legislative wins.</p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>“We don’t have to win every single battle, but we do need to win the war. And what I mean by that is we have to give people a sense of who they are. And this is really a question of which side are they on, which side are we on, right? And the contrast is very clear,” he told Maddow.</p>\n<p>“The Trump administration and his billionaire Cabinet is on the side of the robber barons. This current crop of robber barons, which are trying to profit off the backs of hard-working men and women in this country,” he added.</p>\n\n<p>“I know whose side I’m on. I know whose side the Democratic Party is on, and we’re on the side of hard-working men and women who just want the country to not forget about them, to make sure that we are center in their lives and focusing again, on making the American Dream real for all Americans.”</p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/homenews/administration/5125168-dnc-chair-ken-martin-rebuild/",
            "pub_date": "2025-02-04 23:20:49",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5125130,
            "title": "Amber Ruffin to headline White House Correspondents’ Association dinner",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>Amber Ruffin is taking center stage at this spring’s White House Correspondents’ Association (WHCA) dinner, the first time the high-profile Washington event is being held during President Trump’s second term in office. </p>\n<p>The comedian and writer — who’s part of CNN’s comedic news show “Have I Got News For You” — will headline the annual black-tie fête on April 26, the WHCA announced Tuesday.</p>\n\n<p>Group President Eugene Daniels lauded 46-year-old Ruffin, who also serves as a writer on “Late Night with Seth Meyers,” as a “perfect fit for the dinner this year” who has the “ability to walk the line between blistering commentary and humor all while provoking her audience to think about the important issues of the day.”</p>\n<p>Ruffin’s “unique talents are the ideal fit for this current political and cultural climate,” Daniels said. </p>\n<p>Trump — who has frequently sparred with the media and <a href=\"https://thehill.com/homenews/administration/400433-trump-attacks-reporters-as-enemy-of-the-people-says-they-cause-wars/\" rel=\"noreferrer noopener\" target=\"_blank\">has launched</a> blistering attacks on members of the press — bucked tradition and declined to attend the WHCA dinner throughout his first term. The sitting president is typically the focus — and punchline — for the entertainers who have served as emcees for the journalist-, celebrity- and lawmaker-filled Correspondents’ dinner.</p>\n<p>The WHCA has said that proceeds from its buzzy event benefit its work, “including awards recognizing excellence in the profession and scholarships for journalism students.”</p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>In 2019, Trump said he <a href=\"https://thehill.com/homenews/administration/437542-trump-to-skip-white-house-correspondents-dinner-again/\" rel=\"noreferrer noopener\" target=\"_blank\">was skipping</a> the WHCA gala and would instead hold a rally. </p>\n<p>“The dinner is boring and so negative that we’re going to hold a very positive rally,” he said at the time. </p>\n\n<p>That year, Trump <a href=\"https://thehill.com/homenews/administration/440229-trump-tells-officials-not-to-attend-white-house-correspondents-dinner/\" rel=\"noreferrer noopener\" target=\"_blank\">also directed</a> administration officials not to attend the dinner. </p>\n<p>The White House didn’t immediately respond when asked if Trump was planning on attending this year’s dinner.</p>\n<p><em>—Alex Gangitano contributed. </em></p>\n<script type=\"text/javascript\">window.NREUM||(NREUM={});NREUM.info={\"beacon\":\"bam.nr-data.net\",\"licenseKey\":\"bb199f70cb\",\"applicationID\":\"738543775\",\"transactionName\":\"MQNTMhdXDxECABBZDAhJchMWQg4PTBMLQxdIFl4VEQ==\",\"queueTime\":0,\"applicationTime\":2293,\"atts\":\"HURERF9NHE5BAkYKGBsb\",\"errorBeacon\":\"bam.nr-data.net\",\"agent\":\"\"}</script>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/blogs/in-the-know/5125130-amber-ruffin-white-house-correspondents-association-dinner-trump/",
            "pub_date": "2025-02-04 23:11:01",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5124942,
            "title": "Church vandalized by Proud Boys now controls group’s trademark, judge rules",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>The Proud Boys are barred from selling merchandise using the right-wing extremist group’s name or symbols without permission from a Black church once vandalized by its members after a Washington judge on Monday <a href=\"https://www.documentcloud.org/documents/25512616-2024-cab-004147/#document/p1\">revoked their control</a> over the trademark. </p>\n<p>Judge Tanya Jones Bosier of the Superior Court of the District of Columbia turned control of the trademark “Proud Boys” over to the Metropolitan African Methodist Episcopal Church, which was attacked by members of the group, including former leader Enrique Tarrio, after a December 2020 rally supporting President Trump.</p>\n\n<p>The church previously won a $2.8 million default judgment against the Proud Boys in 2023 but sought control of the group’s trademarked name when it failed to pay up.</p>\n<p>Now, the church can attempt to seize any money the Proud Boys make via “any sale, transfer, disposition, or license” of the group’s name or signature logos, including a black and yellow laurel wreath, according to the order. </p>\n<p>In a lengthy <a href=\"https://x.com/NobleOne/status/1886782313742135707\">statement published to the social platform X</a>, Tarrio called for the judge’s impeachment and suggested the church should be audited, asserting “retribution is inevitable.”</p>\n<p>“Their actions are a betrayal of justice, reminiscent of Judas’s treachery,” Tarrio said, referencing the biblical figure who betrayed Jesus. “I hold in contempt any motions, judgments, and orders issued against me.”</p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>The vandalization of the church — specifically the destruction of a Black Lives Matter banner it had on display — proved pivotal. Tarrio was arrested for burning the banner days before Jan. 6, 2021, and was ordered out of the city, preventing him from joining other Proud Boys at the Capitol that day. </p>\n<p>The violence between Proud Boys and anti-Trump protesters on Dec. 12, 2020, the night the church was attacked, also marked a turning point in the right-wing group’s relationship with police. Prosecutors described that night as a critical precursor to the Capitol attack.</p>\n\n<p>Tarrio, who was convicted of sedition and sentenced to 22 years in prison over Jan. 6, <a href=\"https://thehill.com/regulation/court-battles/5096927-trump-commutes-sentence-proud-boys-leader-enrique-tarrio/\" rel=\"noreferrer noopener\" target=\"_blank\">received a full and unconditional pardon</a> from Trump as part of the sweeping clemency he granted to those charged in connection with the riot. Other leaders in the group saw their sentences for sedition or different serious felonies commuted to time served.</p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/regulation/court-battles/5124942-proud-boys-trademark-church-vandalized/",
            "pub_date": "2025-02-04 23:05:56",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5123599,
            "title": "Harboring undocumented immigrants? You could face decades in prison.",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>The current administration is very serious about enforcing our immigration laws, and <a href=\"https://www.ice.gov/doclib/news/guidelines-civilimmigrationlaw.pdf\" rel=\"noreferrer noopener\" target=\"_blank\">unlike the previous administration</a>, it has not placed any restrictions on which provisions can be enforced. As border czar Tom Homan <a href=\"https://thenationaldesk.com/news/americas-news-now/homan-doubles-down-on-ice-activity-in-schools-if-they-dont-like-it-change-the-law-illegal-immigrants-immigration-border-czar-mexico-aliens-security-abc-news-this-week\" rel=\"noreferrer noopener\" target=\"_blank\">has said</a>, “We’re enforcing the laws that Congress enacted and a president signed.”  </p>\n<p>Most of the provisions in the <a href=\"https://www.uscis.gov/laws-and-policy/legislation/immigration-and-nationality-act\" rel=\"noreferrer noopener\" target=\"_blank\">Immigration and Nationality Act</a> pertain to civil offenses, such as deportability and eligibility for relief from deportation. But the law also includes criminal provisions — including ones that make giving prohibited assistance to undocumented immigrants a <a href=\"https://www.thefederalcriminalattorneys.com/classification-system-federal-felonies\" rel=\"noreferrer noopener\" target=\"_blank\">felony</a>. </p>\n\n<p>Individuals who help undocumented immigrants need to know that they may be committing a serious criminal offense that can result in severe consequences, including substantial fines and lengthy prison sentences. In extreme cases, offenders may face life imprisonment, or even the death penalty.</p>\n<p>This does not mean that you can’t help someone who might be an undocumented immigrant without subjecting yourself to prosecution. The main criminal provisions that pertain to assisting undocumented migrants can be found in <a href=\"https://uscode.house.gov/view.xhtml?req=granuleid:USC-prelim-title8-section1324&amp;num=0&amp;edition=prelim\" rel=\"noreferrer noopener\" target=\"_blank\">8 U.S.C. § 1324(a)(1)(A)</a>, which includes the following offenses: </p>\n<p><strong>Smuggling:</strong> Bringing or attempting to bring a person into the United States at any place other than a port of entry knowing that he/she is an alien is a criminal offense. </p>\n<p>For instance, in January 2025, Isai Orona was sentenced to four and a half years in federal prison for <a href=\"https://nypost.com/2025/01/23/us-news/smuggler-sentenced-after-confessing-he-transported-more-than-2500-illegal-immigrants-into-the-us/?utm_source=chatgpt.com\" rel=\"noreferrer noopener\" target=\"_blank\">smuggling more than 2,500 undocumented immigrants</a> into the United States. He had a network of drivers and 12 different cars for transporting the illegal crossers. The judge also ordered him to pay a $250,000 fine. </p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p><strong>Transporting:</strong> It is a criminal offense to provide transportation within the United States for an alien knowing “or in reckless disregard of the fact that [the] alien has come to, entered, or remains in the United States in violation of law.” </p>\n<p>The type of conduct this provision <a href=\"https://www.nolo.com/legal-encyclopedia/is-illegal-transport-undocumented-immigrant-within-the-us.html\" rel=\"noreferrer noopener\" target=\"_blank\">was meant to address</a> is that of a driver who is paid to pick up undocumented immigrants right after they’ve made an illegal crossing, taking them into the interior of the country. It should not apply to someone who gives a ride to a friend or neighbor without knowing he/she is an undocumented immigrant.  </p>\n\n<p><strong>Harboring: </strong>It is a criminal offense to conceal, harbor or shield an alien from detection “knowing or in reckless disregard of the fact that [the] alien has come to, entered, or remains in the United States in violation of law.”  </p>\n<p>To warrant a <a href=\"https://mcbeanlaw.com/harboring-an-undocumented-individual-what-you-need-to-know/\" rel=\"noreferrer noopener\" target=\"_blank\">conviction</a>, the defendant’s actions must have facilitated the undocumented immigrant’s ability to remain here unlawfully, but that requirement can be interpreted differently by different people. </p>\n<p>Here is an example of applying the provision the way it should be applied: A man named Lopez had six homes that he rented to undocumented immigrants. He didn’t just provide them with a place to stay; he also helped them with job applications and arranging <a href=\"https://sedaghatlaw.com/sham-marriage-green-card-consequences/\" rel=\"noreferrer noopener\" target=\"_blank\">sham marriages</a> so they could obtain green cards. Lopez significantly facilitated the ability of undocumented immigrants to stay in the U.S. unlawfully.  </p>\n<div class=\"civic-science-article-container civic-science-more-14 civic-is-mr3\" data-civicscience-widget=\"3f127ebd-287e-0b64-a901-d55ec286348a\" id=\"civsci-id-civsci-id-596708068\"></div>\n<p><strong>Encouraging:</strong> It is a criminal offense to encourage or induce an alien “to come to, enter, or reside in the United States while knowing or in reckless disregard of the fact that the alien’s entry or presence is or will be in violation of law.” </p>\n<p>The ACLU <a href=\"https://www.aclu.org/news/free-speech/this-law-could-criminalize-everyday-conversations-about-immigration\" rel=\"noreferrer noopener\" target=\"_blank\">claimed</a> that this provision could criminalize everyday conversations such as: </p>\n<ul>\n<li>“A grandmother who tells her undocumented grandchild that she doesn’t want them to leave her. </li>\n</ul>\n<ul>\n<li>A doctor advising a patient with an expiring student visa that the patient needs medical treatment that is only offered in the United States. </li>\n</ul>\n<ul>\n<li>A professor advocating for <a href=\"https://www.aclu.org/know-your-rights/know-your-rights-about-daca\" rel=\"noreferrer noopener\" target=\"_blank\">DACA</a> recipients to remain in the country no matter what so that Congress will be pressured to grant a path towards citizenship, while pointing out how her university’s policy of accepting DREAMers has enriched her teaching experience.” </li>\n</ul>\n<p>The Supreme Court <a href=\"https://crsreports.congress.gov/product/pdf/LSB/LSB11003\" rel=\"noreferrer noopener\" target=\"_blank\">upheld this provision</a> when it was challenged for allegedly violating free speech and being overly broad, because it only forbids “the purposeful solicitation and facilitation of specific acts that violate federal law.”  </p>\n\n<p>Telling an undocumented immigrant that you don’t want him or her to leave, or giving that person reasons to stay, should not be interpreted as a purposeful solicitation or facilitation of specific acts that violate federal law.  </p>\n<p>The <a href=\"https://www.ussc.gov/about-page\" rel=\"noreferrer noopener\" target=\"_blank\">U.S. Sentencing Commission</a> provides information on maximum sentences for violating 8 U.S.C. § 1324(a)(1)(A) in its <a href=\"https://www.ussc.gov/sites/default/files/pdf/training/primers/2024_Primer_Immigration.pdf\" rel=\"noreferrer noopener\" target=\"_blank\">Primer on Immigration Offenses</a>.  </p>\n<p>The statutory maximum for bringing or attempting to bring an undocumented immigrant into the United States is 10 years. The statutory maximum for transporting, harboring or encouraging a migrant to make an illegal entry without being paid for doing it is five years. The maximum increases to 10 years if any of these offenses is committed for financial gain. The maximum increases to 20 years if the offense causes serious bodily injury or places the life of another person in jeopardy. And it becomes life in prison or death if the offense causes the death of another person. </p>\n\n<p>The maximum penalty may be enhanced an additional 10 years if the offense is commercial transportation of large groups in a life-threatening manner or the offense resulted in a life- </p><!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://thehill.com/submitting-opinion-content/\"><img alt=\"\" class=\"wp-image-4329764\" decoding=\"async\" height=\"121\" loading=\"lazy\" sizes=\"(max-width: 899px) 100vw, 600px\" src=\"https://thehill.com/wp-content/uploads/sites/2/2023/11/op2.png?w=600\" srcset=\"https://thehill.com/wp-content/uploads/sites/2/2023/11/op2.png?resize=600,121 600w, https://thehill.com/wp-content/uploads/sites/2/2023/11/op2.png?resize=300,61 300w, https://thehill.com/wp-content/uploads/sites/2/2023/11/op2.png?resize=50,10 50w\" width=\"600\"/></a></figure>\n<p>threatening health risk to people in the United States. In addition, individuals convicted of these offenses may be subject to <a href=\"https://www.justice.gov/afp/types-federal-forfeiture\" rel=\"noreferrer noopener\" target=\"_blank\">forfeiture</a> of the vessel, motor vehicle or aircraft that was used in the commission of the offense. </p>\n<p>The possibility of innocently becoming engaged in criminal activity shouldn’t stop anyone from helping people who might be undocumented immigrants. Such conduct isn’t likely to result in being prosecuted for a criminal offense. But, it is necessary to be aware that providing prohibited assistance<em> </em>to an undocumented immigrant can have severe legal consequences — and to know what types of assistance are prohibited.  </p>\n\n<p><a href=\"https://nolanhillop-eds.blogspot.com/\" rel=\"noreferrer noopener\" target=\"_blank\"><em>Nolan Rappaport</em></a><em> was detailed to the House Judiciary Committee as an Executive Branch Immigration Law Expert for three years. He subsequently served as an immigration counsel for the Subcommittee on Immigration, Border Security and Claims for four years. Prior to working on the Judiciary Committee, he wrote decisions for the Board of Immigration Appeals for 20 years</em>.  </p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/opinion/immigration/5123599-enforcing-immigration-laws-crimes/",
            "pub_date": "2025-02-04 23:05:55",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5125069,
            "title": "Musk: Trump ‘will succeed’ in dismantling Education Department",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>Elon Musk, the tech billionaire tech whom President Trump has tapped as the head of his new Department of Government Efficiency (DOGE), boasted on X Monday night that Trump “will succeed” in the GOP goal of dismantling the Department of Education.  </p>\n<p>“Reagan campaigned on ending the federal Dept of Education, which was created by Carter in 1979, but it was bigger when Reagan left office than when he started!” Musk said in response to a report from The Washington Post that Trump is eyeing an executive order to dismantle the agency.  </p>\n\n<p>“Not this time. President @realDonaldTrump will succeed,” he added. </p>\n<p>Completely shutting down the Department of Education would require legislative action, but it is likely Trump could take some actions to hamper the agency’s power in the meantime.  </p>\n<p>Employees of DOGE are reportedly probing data from the department while it puts <a href=\"https://thehill.com/homenews/education/5123000-education-department-dei-trump/\" rel=\"noreferrer noopener\" target=\"_blank\">dozens of employees</a> on administrative leave, citing Trump’s diversity, equity and inclusion (DEI) executive order and guidance from the Office of Personnel Management, which has told agencies to rid themselves of individuals associated with DEI.    </p>\n<p>The union for the employees is alleging the leaves are based on individuals who went to a DEI training that was hosted during Trump’s first term and encouraged by his then-secretary of the department.  </p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>Monday reports from The Wall Street Journal and The Washington Post say Trump is eyeing an executive order to weaken the department, but that more action is likely not to come until after Linda McMahon, Trump’s pick for Education secretary, has her confirmation hearing, which has not been scheduled yet.  </p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/homenews/education/5125069-department-of-education-trump-musk-doge/",
            "pub_date": "2025-02-04 22:51:04",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5125070,
            "title": "Krugman accuses New York Times of ‘sanewashing’ Trump",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>Former New York Times columnist Paul Krugman knocked mainstream news outlets for softening coverage of President Trump. </p>\n<p>“The conventional news media are invaluable,” Krugman said during an appearance on MSNBC on Monday. “I depend upon the reporting from my old employer and depend upon reporting from other news organizations. But there’s definitely sanewashing that goes on. Definitely an unwillingness to just flatly report the … we have crazy stuff.”</p>\n\n<p>Krugman left the Times late last year to launch an independent newsletter after more than two decades at the news outlet. </p>\n<p>Krugman said his new project allows him to be “able to talk about this stuff without trying to sound moderate and sensible, because these are not moderate and sensible times.”</p>\n<p>The journalist’s comments were <a data-id=\"https://www.mediaite.com/tv/ex-new-york-times-columnist-paul-krugman-accuses-former-employer-of-sanewashing-trump/\" data-type=\"link\" href=\"https://www.mediaite.com/tv/ex-new-york-times-columnist-paul-krugman-accuses-former-employer-of-sanewashing-trump/\">first highlighted by Mediate. </a></p>\n<p>Trump’s re-election last year came at a time when public polling shows widespread distrust of news outlets among American voters and amid new questions in the media about how best to cover the president.</p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>Krugman has been sharply critical of Trump in recent years over his economic policies, <a data-id=\"https://thehill.com/homenews/administration/5108708-krugman-trump-immigration-policy-economic-consequences/\" data-type=\"link\" href=\"https://thehill.com/homenews/administration/5108708-krugman-trump-immigration-policy-economic-consequences/\">writing recently</a> that his immigration agenda will “hobble” major industries like food production and construction.</p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/homenews/media/5125070-paul-krugman-trump-coverage-sanewashing/",
            "pub_date": "2025-02-04 22:51:04",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5125087,
            "title": "Canadian ambassador to UN on Trump rhetoric: ‘We deserve to be treated with respect’",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>Canadian ambassador to the United Nations Bob Rae criticized President Trump over his recent comments and actions regarding Canada, saying the country deserves to be “treated with respect.”</p>\n<p>Rae joined Fox News’s Bret Baier for “Special Report” on Monday, just days after the president signed an executive order that imposed a <a href=\"https://thehill.com/homenews/administration/5121102-trump-tariffs-china-canada-mexico/\">25 percent tariff</a> on Canada. Trump and Canadian Prime Minister Justin Trudeau later <a href=\"https://thehill.com/homenews/administration/5124026-trump-trudeau-canada-tariff-delay/\">came to an agreement</a> to hold the tariffs for a month, but the trade war and its impact on the countries has caused much concern across the country.</p>\n\n<p>“The concern that I think all Canadians have, it’s not a personal thing about President Trump, the concern we have is that we don’t want any administration making and taking decisions that are going to create insecurity, uncertainty and real collapses in the market … in a way that’s quite arbitrary,” <a href=\"https://www.mediaite.com/tv/were-not-the-51st-state-canadian-ambassador-decries-trumps-lack-of-respect-for-northern-neighbor/\">Rae said.</a></p>\n<p>Rae said Canadian officials are looking to have a “reasonable and sensible” discussion about how to move forward.</p>\n<p>Trump’s order also impacts Mexico and China. The president has <a href=\"https://thehill.com/business/5123332-trump-mexico-canada-tariffs/\">defended the tariffs</a> as a means to encourage U.S. trading partners to help stop the flow of migrants and fentanyl across the southern and northern borders.</p>\n<p>In remarks from the Oval Office on Monday, Trump doubled down on his proposal that <a href=\"https://thehill.com/homenews/administration/5123538-trump-canada-51st-state/\">Canada join</a> the United States as the 51st state of the U.S. The comment has drawn sharp criticism from Canadian officials, who state the country is sovereign and has no plans to merge with the U.S.</p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>“We’re not the 51st state. We’re a sovereign, independent country,” Rae said. “Our leader deserves to be treated with respect and we deserve to be treated with respect, and that’s the way we want to proceed</p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/policy/international/5125087-united-nations-canada-donald-trump/",
            "pub_date": "2025-02-04 22:51:04",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5125017,
            "title": "Watch live: Senate panel to vote on RFK Jr. nomination for HHS secretary",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>The Senate Finance Committee is meeting Tuesday morning <a data-id=\"https://thehill.com/homenews/senate/5124466-gabbard-rfk-jr-confirmation-committee-votes/\" data-type=\"link\" href=\"https://thehill.com/homenews/senate/5124466-gabbard-rfk-jr-confirmation-committee-votes/\">to vote</a> on whether to advance Robert F. Kennedy Jr.’s nomination to head the Department of Health and Human Services (HHS).</p>\n<p>Kennedy has faced an uphill battle after <a data-id=\"https://thehill.com/policy/healthcare/4991324-trump-nominates-kennedy-health-department/\" data-type=\"link\" href=\"https://thehill.com/policy/healthcare/4991324-trump-nominates-kennedy-health-department/\">being tapped</a> by President Trump to helm HHS. In two fiery confirmation hearings before the Senate <a data-id=\"https://thehill.com/homenews/administration/5114603-robert-f-kennedy-jr-vaccine-conspiracy-theories/\" data-type=\"link\" href=\"https://thehill.com/homenews/administration/5114603-robert-f-kennedy-jr-vaccine-conspiracy-theories/\">Finance</a> and <a data-id=\"https://thehill.com/policy/healthcare/5117209-robert-kennedy-senate-hearing/\" data-type=\"link\" href=\"https://thehill.com/policy/healthcare/5117209-robert-kennedy-senate-hearing/\">Health, Education, Labor and Pensions </a>(HELP) committees, the environmental lawyer was pressed on his anti-vaccine rhetoric and past abortion stance.</p>\n<p>Kennedy — who is unlikely to receive any Democratic support — has a singular focus: winning the support of Sen. Bill Cassidy (R-La.), who could single-handedly <a href=\"https://thehill.com/policy/healthcare/5119803-cassidy-vote-kennedy-hhs/\" rel=\"noreferrer noopener\" target=\"_blank\">end his confirmation hopes</a>. </p>\n<p>The meeting is set to begin Tuesday morning at 10 a.m. EST.</p>\n<p>Watch the live video above.</p>\n<script type=\"text/javascript\">window.NREUM||(NREUM={});NREUM.info={\"beacon\":\"bam.nr-data.net\",\"licenseKey\":\"bb199f70cb\",\"applicationID\":\"738543775\",\"transactionName\":\"MQNTMhdXDxECABBZDAhJchMWQg4PTBMLQxdIFl4VEQ==\",\"queueTime\":0,\"applicationTime\":5026,\"atts\":\"HURERF9NHE5BAkYKGBsb\",\"errorBeacon\":\"bam.nr-data.net\",\"agent\":\"\"}</script>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/video-clips/5125017-watch-live-robert-f-kennedy-jr-hhs-senate-finance-committee-vote/",
            "pub_date": "2025-02-04 22:41:04",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5122915,
            "title": "How Trump’s tariffs on Canada would protect the U.S. from China ",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>Late Monday, President Donald Trump and Prime Minister Justin Trudeau separately <a href=\"https://apnews.com/article/trump-tariffs-canada-mexico-china-sheinbaum-trudeau-017efa8c3343b8d2a9444f7e65356ae9\">announced</a> 30-day pauses on tariffs they had threatened to impose. The Canadian leader announced various measures, including the appointment of a fentanyl czar and the deployment of personnel to the border, to stop the flow of the deadly opioid to the U.S.</p>\n<p>On Saturday, Canada<a href=\"https://www.bbc.com/news/articles/cn4z23kndlyo\" rel=\"noreferrer noopener\" target=\"_blank\"> announced “far-reaching” tariffs of 25 percent on American goods</a>, moments after the U.S. had imposed similar measures on Canada.  </p>\n\n<p>President Trump was imposing American tariffs on Canada as part of a broader package. </p>\n<p>“Today, I have implemented a 25 percent tariff on imports from … Canada (10 percent on Canadian Energy), and a 10 percent additional Tariff on China,”<a href=\"https://x.com/realdonaldtrump/status/1885821495080825305?s=61\" rel=\"noreferrer noopener\" target=\"_blank\"> Trump announced on X</a> Saturday afternoon. “This was done through the International Emergency Economic Powers Act because of the major threat of illegal aliens and deadly drugs killing our Citizens, including fentanyl.”</p>\n<p>“We don’t want to be here, we didn’t ask for this,” <a href=\"https://www.bbc.com/news/articles/cn4z23kndlyo\" rel=\"noreferrer noopener\" target=\"_blank\">said</a> Prime Minister Justin Trudeau at a press conference on Saturday, when he announced Canada’s retaliation. But only in the most technical sense was the Canadian leader correct. At some point, it was virtually inevitable that Washington would lose patience with foot-dragging in Ottawa.</p>\n<p>Trump or no Trump, the U.S. was bound to do something. </p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>“Canadians were very worried about President Trump’s statement that he would impose tariffs on their country in response to its weak control of its southern border and lack of restrictions on the export of fentanyl to the U.S.,” Charles Burton, an Ottawa-based security expert, and former Canadian diplomat, told me on Sunday. “Canadian politicians should not have been surprised by President Trump’s tariffs this weekend.”  </p>\n<p>Canadians had good reason to be concerned. On Nov. 25, Donald Trump<a href=\"https://truthsocial.com/@realDonaldTrump/posts/113546215051155542\" rel=\"noreferrer noopener\" target=\"_blank\"> in a Truth Social posting had promised</a> on the first day of his presidency to “sign all necessary documents to charge Mexico and Canada a 25 percent tariff on ALL products coming into the United States, and its ridiculous Open Borders.”</p>\n\n<p>Furthermore, he pledged that the new measures would last a long time: “This Tariff will remain in effect until such time as drugs, in particular fentanyl, and all illegal aliens stop this invasion of our country!” </p>\n<p>The then-incoming president had a point. “As everyone is aware, thousands of people are pouring through Mexico and Canada, bringing Crime and Drugs at levels never seen before,” Trump correctly wrote.</p>\n<p>People were certainly aware of the migrant flows from Mexico, which on Monday bought a temporary reprieve from Trump’s threatened tariffs. But the traffic from Canada has largely escaped attention. Although far more people cross the southern border, “the world’s longest undefended border” — the one the U.S. shares with its neighbor to the north — has become the favored route of some dangerous elements. </p>\n<div class=\"civic-science-article-container civic-science-more-14 civic-is-mr3\" data-civicscience-widget=\"3f127ebd-287e-0b64-a901-d55ec286348a\" id=\"civsci-id-civsci-id-596708068\"></div>\n<p>The statistics are stunning. U.S. Border Patrol in Fiscal Year 2024 <a href=\"https://www.cbsnews.com/boston/news/illegal-crossings-northern-us-border-terror-suspects-arrested/\" rel=\"noreferrer noopener\" target=\"_blank\">apprehended</a> 155 suspects on the terror watchlist arriving from Mexico and 358 watchlist suspects coming from Canada.  </p>\n<p>“It was a flood we had not seen before,”<a href=\"https://www.cbsnews.com/boston/news/illegal-crossings-northern-us-border-terror-suspects-arrested/\" rel=\"noreferrer noopener\" target=\"_blank\"> </a><a href=\"https://www.cbsnews.com/boston/news/illegal-crossings-northern-us-border-terror-suspects-arrested/\" rel=\"noreferrer noopener\" target=\"_blank\">said Erik Lavallee</a>, the Border Patrol agent in charge of the Beecher Falls Station in Vermont, to the CBS Boston affiliate last March. “It was an exponential shift, something we were not expecting and it just hit us hard.” </p>\n<p>Other parties have been taking advantage of America’s open border with Canada. Last February, for instance, Border Patrol apprehended three Chinese nationals trying to sneak into Maine at night near Fort Fairfield. A fourth Chinese national, already in immigration proceedings, was arrested on the U.S. side, apparently there by prearrangement to pick up the trio.</p>\n\n<p>These migrants should be viewed with suspicion. If they wanted to live in a free society, they would have looked for a Border Patrol agent to surrender to, so they could put themselves in the asylum waiting line and get benefits from generous localities. But because these migrants were trying to avoid detection, they were obviously coming to the U.S. for no good. </p>\n<p>Trump was right to link tariffs to border security. “If we are going to control immigration then we have to take a more strategic view of global trade flows,” Alan Tonelson, a trade expert who blogs at<a href=\"https://alantonelson.wordpress.com/\" rel=\"noreferrer noopener\" target=\"_blank\"> RealityChek</a>, told me in the middle of last year.</p>\n<p>“Tariffing trade partners Canada and Mexico is justified to press them to prevent illegal immigrants and opioids from entering the United States through their territories, but ultimately these issues will be settled by other, targeted measures,” said Tonelson before Trump’s tariff imposition. “In any event, we need a comprehensive rewrite of the three-country USMCA free-trade deal.”</p>\n\n<p>Trade and investment now connect Canada, Mexico and the U.S. into an integrated market, which means new American tariffs will damage all three economies. Yet Washington has little choice but to secure the northern border.</p>\n<p>“China has completely infiltrated the Canadian political system and has been allowed to use Canadian soil as a launching pad for a sustained assault on America,” says Burton. At some point — we may already be there — America will have to prioritize national security concerns over trade considerations.  </p>\n<p>“In addition to the problems Trump identified, he cannot be happy that Canada’s loose banking regulations have made it a haven for money laundering,” Burton, now at the Sinopsis think tank, notes. “Transnational criminal enterprises involved in drug smuggling therefore find Canada a highly desirable venue to base operations.” </p>\n\n<p>“Canada can no longer take the United States for granted,”<a href=\"https://x.com/jeancharest_/status/1882552730784534772?s=61\" rel=\"noreferrer noopener\" target=\"_blank\"> wrote Jean Charest</a>, the former Canadian deputy prime minister, on Jan. 23. “President Trump is forcing us to take a hard look at ourselves — how we manage our economy, work across provinces, and define our place in the world.”</p>\n<p>Trump, who has set his sights on expanding America’s boundaries, keeps on talking about annexing Canada as<a href=\"https://www.foxnews.com/politics/trump-says-canada-would-have-no-tariffs-51st-state-observers-brace-trade-war\" rel=\"noreferrer noopener\" target=\"_blank\"> “our Cherished 51st State,”</a> holding out the prospect of tariff-free trade if Ottawa agrees to surrender sovereignty.  </p>\n<p>Trade friction is not ideal, of course, but Trump had to do something. Trudeau until Monday afternoon was not serious about dealing with America’s legitimate national security concerns. </p>\n\n<p><em>Gordon G. Chang is the author of “Plan Red: China’s Project to Destroy America” and “The Coming Collapse of China.” Follow him on X<a href=\"http://twitter.com/GordonGChang\" rel=\"noreferrer noopener\" target=\"_blank\"> </a></em><em><u><a href=\"http://twitter.com/GordonGChang\" rel=\"noreferrer noopener\" target=\"_blank\">@GordonGChang</a></u></em><em>.  </em></p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/opinion/international/5122915-canada-trump-tariffs-border-security/",
            "pub_date": "2025-02-04 22:31:13",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5124446,
            "title": "Live updates: Gabbard and RFK Jr.’s moments of truth; USAID on the chopping block",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>As part of the Trump administration’s crusade for “government efficiency,” Secretary of State Marco Rubio is being put in charge of the U.S. Agency for International Development (USAID) as the White House <a href=\"https://thehill.com/homenews/administration/5123282-marco-rubio-usaid-take-over/\">mulls the future of the agency</a>. </p>\n<p>USAID has for decades administered billions of dollars of humanitarian and development assistance around the world. </p>\n<p>USAID offices were closed Monday and employees were told to work remotely. Dozens of senior officials have been furloughed and hundreds of contract employees laid off. The apparent move to shutter the agency — and the chaos surrounding it on Monday — enraged Democrats.</p>\n<p>Meanwhile, former Rep. Tulsi Gabbard (Hawaii), President Trump’s pick for director of national intelligence, and Health and Human Services secretary nominee Robert F. Kennedy Jr. are facing crucial tests today as Senate committees decide whether to advance their nominations to the floor, <a href=\"https://thehill.com/?p=5124466\">The Hill’s Al Weaver reports</a>. </p>\n<p>Also, Benjamin Netanyahu is in Washington meeting with President Trump about a future for Gaza.</p>\n<p>Read on for updates on these stories and more.</p>\n<div class=\"5124446\" id=\"wpcom-liveblog-container\"></div>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/homenews/administration/trumps-first-100-days/5124446-live-updates-gabbard-rfk-jr-usaid-trump-house-senate/",
            "pub_date": "2025-02-04 22:15:55",
            "source": "thehill",
            "language": "en"
        }
    ]
}