{
    "data": [
        {
            "id": 5756657,
            "title": "Democrats will force vote next week to limit Trump's war powers in Iran",
            "description": "<p>House Democrats will force a vote next week to curb President Trump’s war powers in Iran. </p>\n<p>The resolution is expected to fail, given the overwhelming opposition from Republicans and a small handful of Jewish Democrats. But party leaders want to get all lawmakers on the record by using a procedural move to sidestep GOP leaders and force the vote.</p>\n<p>“The Iranian regime is brutal and destabilizing, seen most recently in the killing of thousands of protestors,” a number of top Democrats said Thursday in a joint statement. “However, undertaking a war of choice in the Middle East, without a full understanding of all the attendant risks to our servicemembers and to escalation, is reckless.”</p>\n<p>The announcement arrives as Trump and other top administration officials are ramping up their threats against Tehran, both rhetorically and with a massive buildup of the U.S. armed forces in the Middle East, including two aircraft carrier strike groups. </p>\n<p>Negotiators for Iran and the U.S. are expected to meet in Geneva on Thursday in search of a deal on Tehran’s nuclear program. But the accumulation of U.S. forces in the region has led to widespread speculation that Trump intends to use them. </p>\n<p>The House resolution, sponsored by Reps. Ro Khanna (D-Calif.) and Thomas Massie (R-Ky.), would require Trump to win approval from Congress before launching any strikes. </p>\n<p>Khanna had initially planned to force a vote on the measure this week, but he pushed that timeline given the week’s abbreviated schedule, which was squeezed by inclement weather on Monday and an early recess to accommodate the Democrats’ annual retreat on Wednesday. </p>\n<p>The measure has a tough path to passage. Massie is the only Republican to say he’ll support it. And at least two Democrats — Reps. Josh Gottheimer (N.J.) and Jared Moskowitz (Fla.), both of whom are close Israel allies — have also announced their opposition. </p>\n<p>Supporters of the resolution remain undeterred. They’re pushing the measure as a way to reassert the constitutional power of Congress to wage war, arguing that any strikes on Iran without such approval would violate that separation of powers.  </p>\n<p>“We maintain that any such action would be unconstitutional without consultation with and authorization from Congress,” the Democrats said.</p>\n<p>The statement was endorsed by a number of top lawmakers, including House Minority Leader Hakeem Jeffries (N.Y.), Democratic Whip Katherine Clark (Mass.) and Democratic Caucus Chairman Pete Aguilar (Calif.). The top Democrats on key committees also signed on, including Reps. Jim Himes (Conn.), the ranking member of the Intelligence Committee; Greg Meeks (N.Y.), the top Democrat on the Foreign Affairs Committee; and Adam Smith (Wash.), the ranking member of the Armed Services Committee. </p>\n<p>Khanna, who also endorsed the statement, told The Hill earlier in the week that he would force the vote next week.</p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/house/5756657-democrats-trump-iran-war-powers/",
            "pub_date": "2026-02-27 00:56:36",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5755665,
            "title": "Live updates: Hillary Clinton says she 'had no idea' of Epstein's criminal activities; US, Iran talk in Geneva",
            "description": "<p>In New York, former Secretary of State Hillary Clinton will tell the House Oversight and Government Reform Committee in a <a href=\"https://thehill.com/homenews/house/5755536-clintons-depositions-epstein-investigation/\" rel=\"noreferrer noopener\" target=\"_blank\">closed-door deposition</a> that she “had no idea” of the criminal activities of convicted sex offender Jeffrey Epstein and his associate, Ghislaine Maxwell, according to the opening statement she released Thursday morning.</p>\n<p>Her husband, former President Clinton, will meet with the committee on Friday.</p>\n<p>Trump administration envoys are in Geneva for <a data-id=\"https://thehill.com/policy/international/5755742-trump-iran-nuclear-threat/\" data-type=\"link\" href=\"https://thehill.com/policy/international/5755742-trump-iran-nuclear-threat/\">another round of critical talks</a> with Iranian and Omani officials on the Islamic republic’s nuclear program.</p>\n<p>Secretary of State Marco Rubio said Wednesday he was hoping for “productive” conversations and that “diplomacy is always on the table.” Oman’s foreign ministry <a href=\"https://x.com/FMofOman/status/2026951058874929659\" rel=\"noreferrer noopener\" target=\"_blank\">said on social platform X</a> the talks were ongoing, with “a constructive spirit.”</p>\n<p>As the U.S. sets the stage for potential military action in the Middle Eastern country, however, a group of bipartisan senators has indicated it will push forward a <a href=\"https://thehill.com/homenews/senate/5755623-democrats-divided-over-iran-response/\" rel=\"noreferrer noopener\" target=\"_blank\">war powers resolution</a> seeking to rein in President Trump.</p>\n<p>On Capitol Hill, Department of Homeland Security funding talks remain stalled, as Senate Majority Leader John Thune is starting to <a href=\"https://thehill.com/homenews/senate/5755667-trump-thune-voting-bill-talking-filibuster/\" rel=\"noreferrer noopener\" target=\"_blank\">feel increasing pressure</a> to act on the GOP’s SAVE Act — which would require proof of citizenship when registering to vote.</p>\n<p>Trump will hold private meetings and receive an intelligence briefing on Thursday, while Vice President Vance will travel to Plover, Wis.</p>\n<p>Follow live below. </p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/administration/5755665-live-updates-trump-iran-hillary-clinton/",
            "pub_date": "2026-02-27 00:56:35",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5756629,
            "title": "Graham: Iran facing 'Berlin Wall moment'",
            "description": "<p>Sen. Lindsey Graham (R-S.C.) said Thursday that President Trump’s <a href=\"https://thehill.com/policy/international/5755742-trump-iran-nuclear-threat/\">actions toward Iran</a> could result in a modern day version of the Berlin Wall’s fall. </p>\n<p>“It is my strong view that history is watching every move we make. If we follow through by sending help to the protesters risking their lives, we will have a 21st Century Berlin Wall moment,” Graham, a foreign policy hawk, wrote in a <a href=\"https://www.foxnews.com/opinion/sen-lindsey-graham-iran-facing-berlin-wall-moment-history-watching-us-now\">Fox News opinion piece.</a></p>\n<p>“Ronald Reagan’s determination to stand up to communism paid dividends for the entire world when the Soviet Union crumbled under its own weight,” he added. “What followed was a new birth of freedom around the globe, liberating millions who knew nothing but oppression.”</p>\n<p>U.S. officials, led by Jared Kushner and special envoy Steve Witkoff, are <a href=\"https://thehill.com/homenews/administration/5755665-live-updates-trump-iran-hillary-clinton/\">holding peace talks</a> with Omani and Iranian officials Thursday after Trump warned Tuesday he will not allow Iran to develop a nuclear weapon amid the U.S.’s <a href=\"https://thehill.com/policy/defense/5715910-us-military-iran-options/\">massive military build-up</a> near the Middle Eastern country. </p>\n<p>“They want to make a deal, but we haven’t heard those secret words, ‘We will never have a nuclear weapon,’” the president said during his <a href=\"https://thehill.com/homenews/administration/5754101-trump-state-union-address-takeaways/\">State of the Union address</a>. “My preference, my preference is to solve this problem through diplomacy. But one thing is certain, I will never allow the world’s No. 1 sponsor of terror, which they are by far, to have a nuclear weapon.”</p>\n<p>The Treasury Department on Wednesday also <a href=\"https://thehill.com/homenews/administration/5755158-us-iran-sanctions-oil-nuclear-program/\">imposed new sanctions</a> on Iranian individuals, companies and ships accused of enabling the country’s illicit oil sales and ballistic missile programs. </p>\n<p>Secretary of State Marco Rubio said Wednesday that while Iran is not currently enriching uranium, the country is “trying to get to the point where they ultimately can.” Trump said last June that U.S. strikes <a href=\"https://thehill.com/homenews/administration/5363831-iran-nuclear-site-damage-trump-iran/\">obliterated three Iranian nuclear sites</a>, including the Fordow site deep in a mountain south of Tehran. </p>\n<p>Rubio also noted that Iran “possesses a very large number of ballistic missiles, particularly short-range ballistic missiles” that threaten the U.S., its allies and military bases in the United Arab Emirates, Qatar and Bahrain. Trump said Tuesday that Iran has missiles that can threaten Europe and is working to build ones capable of reaching the U.S. </p>\n<p>But Abbas Araghchi, the Iranian foreign minister, denied the president’s claims Wednesday.</p>\n<p>“We are not developing long-range missiles,” Araghchi said in an interview with India Today TV, <a href=\"https://www.iranintl.com/en/202602258497\">according to Iran International</a>. “We have limited range to below 2000kms intentionally. We don’t want it to be a global threat. We only have [them] to defend ourselves. Our missiles build deterrence.”</p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/senate/5756629-graham-trump-iran-berlin-wall-moment/",
            "pub_date": "2026-02-27 00:56:35",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5756580,
            "title": "Maduro lawyer says US won't let Venezuela pay legal defense fees",
            "description": "<p>An attorney for deposed Venezuelan leader Nicolas Maduro said the Trump administration is blocking his access to funds needed to pay his attorney, risking leaving him without counsel.</p>\n<p>Before Maduro was <a data-id=\"https://thehill.com/homenews/senate/5745110-ted-cruz-regime-change-iran-venezuela-cuba/\" data-type=\"link\" href=\"https://thehill.com/homenews/senate/5745110-ted-cruz-regime-change-iran-venezuela-cuba/\">forcibly removed</a> from his home in a U.S. military option, he was among a slew of Venezuelan officials facing sanctions from the U.S. Office of Foreign Assets Control (OFAC).</p>\n<p>But an attorney for Maduro, Barry Pollack, said while the U.S. for three hours granted a license that would allow Maduro and his wife Cilia Flores de Maduro to access Venezuelan funds, it swiftly reversed that decision for Maduro.</p>\n<p>“Counsel explained that the government of Venezuela has an obligation to pay Mr. Maduro’s fees, Mr. Maduro has a legitimate expectation that the government of Venezuela would do so, and Mr. Maduro cannot otherwise afford counsel. Accordingly, by its failure to allow the government of Venezuela to pay Mr. Maduro’s defense costs, OFAC is interfering with Mr. Maduro’s ability to retain counsel and, therefore, his right under the Sixth Amendment to counsel of his choice,” Pollack wrote.</p>\n<p>“If OFAC fails to act on the request to reinstate the original license, or denies that request, Mr. Maduro will file a formal motion in the coming days seeking relief from the Court.”</p>\n<p>The Treasury Department did not immediately respond to request for comment and the Trump administration has not yet responded to the letter in court.</p>\n<p>Maduro was <a href=\"https://thehill.com/homenews/administration/5670837-trump-operation-captures-maduro/\">indicted</a> on Jan.3 shortly after his capture on narco-terrorism charges.</p>\n<p>However, while the indictment accuses Maduro of involvement with six different terrorism and drug trafficking groups, in some cases it offers few details about those connections or makes only passing references to the organizations.</p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/5756580-trump-blocks-maduro-funds/",
            "pub_date": "2026-02-27 00:40:58",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5753260,
            "title": "Don't just freeze federal assistance to fight fraud — fix the program",
            "description": "<p>The federal government <a href=\"https://www.theguardian.com/us-news/2026/jan/26/trump-administration-childcare-funding-freeze\" rel=\"noreferrer noopener\" target=\"_blank\">recently froze</a> Temporary Assistance for Needy Families funding in five states, including New York, Illinois and Minnesota, citing the need to crack down on fraud. </p>\n<p>Headlines have been <a href=\"https://www.youtube.com/watch?v=jpWHWDV5ZrU\" rel=\"noreferrer noopener\" target=\"_blank\">dominated by scandal</a>: phantom day cares, faked receipts, and misuse of taxpayer dollars. But these scandals are not an aberration. They are the predictable result of a system that measures compliance instead of outcomes. And while Washington focuses on the fraud we can see, it is ignoring the failure we cannot see.</p>\n<p>The real scandal of the American welfare system isn’t just that money is being stolen — it is that the money we do spend isn’t helping people escape poverty. Rather, it is trapping them in poverty.</p>\n<p>This year marks the 30th anniversary of the Temporary Assistance for Needy Families welfare program, signed into <a href=\"https://www.congress.gov/bill/104th-congress/house-bill/3734\" rel=\"noreferrer noopener\" target=\"_blank\">law by President Clinton in 1996</a> with the promise to <a href=\"https://www.cbpp.org/research/income-security/temporary-assistance-for-needy-families\" rel=\"noreferrer noopener\" target=\"_blank\">“end welfare as we know it.”</a> Three decades later, must admit that we replaced one trap with another. We exchanged a system of dependency for a system of compliance — paying states to keep caseloads low while failing to ask whether families are actually better off. </p>\n<p>Consider “Tanya,” a composite of the millions navigating this system. A full-time warehouse worker in Ohio, Tanya turns to the program for a bridge when her hours are cut. Instead, she finds a maze designed to police her poverty. Her experience is not unusual; it is a documented feature of how Temporary Assistance for Needy Families operates nationwide. </p>\n<p>The current congressional debate, centered on the “<a href=\"https://www.congress.gov/bill/119th-congress/house-bill/2354/text\" rel=\"noreferrer noopener\" target=\"_blank\">Restoring ‘Temporary’ to TANF Act,</a>” misses the forest for the trees. We are obsessed with auditing receipts to exclude the wrong people trying to access the money, but we never ask whether the right people are moving forward. </p>\n<p>In Tanya’s case, the system works exactly as designed — and that is the problem. When she receives a modest raise, she hits a “<a href=\"https://www.unitedwaycleveland.org/benefits-cliff-challenges-and-solutions/\" rel=\"noreferrer noopener\" target=\"_blank\">benefits cliff</a>.” Her child-care support is cut so sharply that her net income actually drops. Faced with an impossible choice, she has to decide whether to refuse the promotion or fall further behind. </p>\n<p>In short, we are punishing success because our accountability metrics are broken. </p>\n<p>Since 1996, Temporary Assistance for Needy Families has rewarded states for <a href=\"https://www.chapinhall.org/research/overall-tanf-caseload-declined-between-2010-and-2022/\" rel=\"noreferrer noopener\" target=\"_blank\">shrinking caseloads</a>, not for reducing poverty. In practice, states are rewarded for exits, regardless of the reason. If a family leaves because they found a high-paying job, that is a success. But if a family is kicked off for missing a filing deadline and sinks into homelessness, that is also counted as a “success” under the current statute. The system is indifferent to whether a family is rising out of poverty or simply falling off the radar.</p>\n<p>The 2026 funding freeze, while necessary to stop criminal fraud, is insufficient as a reform. We cannot “restore integrity” to a system that lacks a coherent purpose. Real reform requires shifting from compliance-based to outcome-based accountability — measuring whether families are moving forward, not merely moving off the rolls.</p>\n<p>First, we must abandon work participation rates as a proxy for success and begin measuring economic mobility directly. Bills like the “<a href=\"https://www.congress.gov/bill/119th-congress/senate-bill/1567/text\" rel=\"noreferrer noopener\" target=\"_blank\">JOBS for Success Act</a>” have hinted at this idea, but we must go further. States should be rewarded when recipients see wage growth, retain employment for 12 months or gain credentials. We have the data to do this; we simply aren’t using it.</p>\n<p>Second, we must replace the benefit ledge with a ramp. Transitional benefits that phase out gradually as income rises would ensure that work always pays. Critics may argue this is too expensive, but a system that tracks verified employment outcomes is far more secure than one that tracks receipts. It is easy to fake a generic invoice; it is much harder to fake IRS-verified wage growth.</p>\n<p>If we want to stop fraud, we must stop building systems so complex that they invite exploitation. If we want to help families, we must stop forcing mothers like our hypothetical Tanya to choose between stability and upward mobility.</p>\n<p>The January 2026 freeze should mark the end of “cash policing.” Congress must use this moment not merely to restore funding, but to rewrite the rules — replacing a system that manages poverty with one that enables families to escape it.</p>\n<p><em>Parth Patel is a social policy professional with more than five years of experience in human services and a background in public finance. He holds dual master’s degrees in public administration and governmental accounting.</em></p>",
            "kind": 1,
            "link": "https://thehill.com/opinion/congress-blog/economy-budget/5753260-tanf-funding-freeze-scandal/",
            "pub_date": "2026-02-27 00:40:58",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5756511,
            "title": "Kalshi accuses MrBeast video editor of insider trading",
            "description": "<p>An editor for the popular YouTube creator MrBeast has been fined and suspended by prediction market platform Kalshi over suspected insider trading. </p>\n<p>The company’s disciplinary committee found that Artem Kaptur violated its policies when Kaptur placed bets last August and September related to the YouTube channel where he worked. </p>\n<p>“Specifically, the Committee found reasonable cause to conclude Kaptur traded while employed by or legally affiliated with a Source Agency for “Mr. Beast” contracts, and that he traded on material, non-public information he obtained because of this employment in violation of Kalshi Rule 5.17(y),” the committee wrote in its <a href=\"https://kalshi-public-docs.s3.amazonaws.com/regulatory/notices/Notice%20of%20Disciplinary%20Action%20(2.25.2026)%20(1).pdf\">report</a>. “Further, the Committee found Kaptur failed to cooperate with the investigation, in violation of Kalshi Rule 3.6(a).”</p>\n<p>Kalshi fined Kaptur over $20,000 and issued a two-year suspension from accessing the platform. The fine includes $5,397.58 in profits from the alleged insider trades and $15,000 in penalties. </p>\n<p>The trading platform allows users to bet on a wide range of topics, including the men’s college basketball champion, which Democratic candidate will win the Texas Senate primary race and the highest temperature in New York City on a given day. </p>\n<p>Kalshi’s site hosts several trades related to MrBeast, a YouTube channel started by Jimmy Donaldson, which has the most subscribers among all individual accounts on the platform. Kalshi users can place bets on when Donaldson will get married, the length of his next video and his content’s viewership numbers. </p>\n<p>A spokesperson for Donaldson’s company, Beast Industries, <a href=\"https://www.npr.org/2026/02/25/nx-s1-5726050/kalshi-insider-trading-enforcement-actions\">told NPR</a> it has “no tolerance” for insider trading, saying the company has rules against trading on markets related to MrBeast content. </p>\n<p>The Commodity Futures Trading Commission (CFTC), an independent agency that regulates the U.S. derivatives markets, said in a Wednesday <a href=\"https://www.cftc.gov/PressRoom/PressReleases/9185-26\">report</a> that Kaptur “potentially violated prohibitions on misappropriation of confidential information in breach of a pre-existing duty of trust and confidence to the source of the information,” also known as insider trading.</p>\n<p>The CFTC noted that it “has full authority to police illegal trading practices,” including insider trading violations. The Commission also noted another enforcement case involving a little-known GOP candidate in the California governor’s race who was fined by Kalshi for trading on his own candidacy. </p>\n<p>“I just bet $100 that I, Kyle Langford will be the next Governor of California, join me,” The Republican candidate <a data-id=\"https://x.com/KyleLangfordCA/status/1926349137760362572\" data-type=\"link\" href=\"https://x.com/KyleLangfordCA/status/1926349137760362572\">said on the social media platform X</a>.</p>\n<p>Langford received a 5-year suspension from Kalshi and was fined over $2,000 by the platform. </p>\n<p>The CFTC has also come <a href=\"https://thehill.com/homenews/state-watch/5741800-cox-challenges-cftc-prediction-markets/\">under fire</a> for its fight against state laws that would place restrictions on prediction markets. </p>\n<p>CTFC Chair Mike Selig said the commission would challenge any state that sought to “challenge our authority in this space,” adding, “We will see you in court.”</p>\n<p>“These prediction markets you are breathlessly defending are gambling—pure and simple. They are destroying the lives of families and countless Americans, especially young men. They have no place in Utah,” Gov. Brian Cox (R-Utah) <a href=\"https://thehill.com/homenews/state-watch/5741800-cox-challenges-cftc-prediction-markets/\">wrote</a> in an X post earlier this month.</p>",
            "kind": 1,
            "link": "https://thehill.com/business/5756511-mrbeast-editor-fined-insider-trading-kalshi/",
            "pub_date": "2026-02-27 00:40:57",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5756431,
            "title": "Crowds line up for Jesse Jackson's memorial services in Chicago",
            "description": "<p>CHICAGO (AP) — Crowds of mourners lined up in Chicago as cross-country <a href=\"https://apnews.com/article/jesse-jackson-memorial-funeral-south-carolina-washington-dc690a5153483549898d1dfc548015bb\">memorial services</a> for the Rev. Jesse Jackson Sr. began Thursday in the city the late civil rights leader called home.</p>\n<p>The protege of the Rev. Martin Luther King Jr. and <a href=\"https://apnews.com/article/jesse-jackson-legacy-politics-race-ethnicity-7c88b376fbfc94697f2b57797edb24bf\">two-time presidential candidate</a> will lie in repose for two days at the headquarters of the Rainbow PUSH Coalition before events in Washington, D.C., and <a href=\"https://apnews.com/article/jesse-jackson-lie-state-south-carolina-memorial-30e29a259b5f843c087e9201bd08b5c4\">South Carolina</a>, where he was born.</p>\n<p>Family members wiped away tears as the casket was brought into the stately brick building. Flowers lined the sidewalks where people waiting to enter watched a large video screen playing excerpts of Jackson’s notable speeches.</p>\n<p>“The outpouring of love and support received from around the globe has been abundant and deeply felt,” Jackson’s family members said in a recent statement.</p>\n<p>Jackson <a href=\"https://apnews.com/article/jesse-jackson-dies-43abb84d2ffc76d967f9a5596ebd0be1\">died last week</a> at age 84 after battling a <a href=\"https://apnews.com/article/chicago-jesse-jackson-hospital-c3a34dc716b6d90c61459f226f266f48\">rare neurological disorder</a> that affected his mobility and ability to speak in his later years.</p>\n<p>Remembrances have already poured in <a href=\"https://apnews.com/article/jesse-jackson-famous-quotes-keep-hope-alive-76e116cbbfe5fc67adf34d86b72393b7\">from around the globe,</a> and several U.S. states, including Minnesota, Iowa and North Carolina, are flying flags at half-staff in his honor.</p>\n<p>But perhaps nowhere has his death been felt as strongly as in the nation’s third-largest city, where Jackson lived for decades and raised his six children, including a son who is a congressman.</p>\n<p>Bouquets have been left outside the family’s Tudor-style home on the city’s South Side for days. Public schools have offered condolences, and city trains have used digital screens to display Jackson’s portrait and his well-known mantra, “I am Somebody!”</p>\n<p><a href=\"https://apnews.com/article/jesse-jackson-dead-8ed88b7da0b911ed842f3c219cee77e8\">His causes</a>, both in the United States and abroad, were countless: Advocating for the poor and underrepresented on issues including voting rights, job opportunities, education and health care. He scored diplomatic victories with world leaders, and through his Rainbow PUSH Coalition, he channeled cries for Black pride and self-determination into corporate boardrooms, pressuring executives to make America a more open and equitable society.</p>\n<p>“We honor him, and his hard-earned legacy as a freedom fighter, philosopher, and faithful shepherd of his family and community here in Chicago,” Mayor Brandon Johnson said in a statement.</p>\n<p>Next week, Jackson will <a href=\"https://apnews.com/article/jesse-jackson-funeral-plans-capitol-rotunda-2910a8ff9df4531f9fa4ed76404a9887\">lie in honor at the South Carolina Statehouse</a>, followed by public services. According to Rainbow PUSH’s agenda, Gov. Henry McMaster is expected to deliver remarks, however the governor’s office said Thursday that his participation wasn’t yet confirmed. Jackson spent his childhood and started his activism in South Carolina.</p>\n<p>Details on services in Washington have not yet been made public. However, he will not lie in honor at the United States Capitol rotunda after a <a href=\"https://apnews.com/article/jesse-jackson-funeral-plans-capitol-rotunda-2910a8ff9df4531f9fa4ed76404a9887\">request for the commemoration was denied</a> by the House Speaker Mike Johnson’s office.</p>\n<p>The two weeks of events will wrap up next week with a large celebration of life gathering at a Chicago megachurch and finally, homegoing services at the headquarters of the Rainbow PUSH Coalition.</p>\n<p>Family members said the services will be open to all.</p>\n<p>“His life is broad enough to cover the full spectrum of what it means to be American,” his eldest son, <a href=\"https://apnews.com/article/primary-illinois-chicago-jesse-jackson-election-ca6fd203e953a9c6352026542309572f\">Jesse Jackson Jr</a>., told reporters recently. “We only ask people to come and be respectful in context of the extraordinary life he lived.”</p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/state-watch/5756431-crowds-line-up-for-jesse-jacksons-memorial-services-in-chicago/",
            "pub_date": "2026-02-27 00:25:58",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5756577,
            "title": "Oversight panel deposes Hillary Clinton in Epstein investigation",
            "description": "<p>The House Oversight and Government Reform Committee has kicked off its deposition of former Secretary of State Hillary Clinton in its investigation into the late sex offender Jeffrey Epstein. </p>\n<p>The deposition, taking place Thursday in Chappaqua, New York, comes after the former first lady and former President Bill Clinton reversed course earlier this month and agreed to sit for depositions to avoid being held in contempt of Congress for defying a Congressional subpoena. </p>\n<p>The former president, who had a documented friendship with Epstein and flew on his plane a few times in the early 2000s, is scheduled to sit for a deposition on Friday. </p>\n<p>“No one’s accusing, at this moment, the Clintons of any wrongdoing. They’re going to have due process,” House Oversight Committee chairman James Comer (R-Ky.) said in a press conference before the deposition started. </p>\n<p>“But we have a lot of questions,” Comer continued. “And the purpose of the whole investigation is to try to understand many things about Epstein. How did he accumulate so much wealth? How was he able to surround himself with some of the most powerful men in the world? Was he an asset for our government or any other government?”</p>\n<p>The Hill’s partners at NewsNation reported that the Clintons and the committee agreed to focus on five topic areas in the deposition: How the government handled its inquiry into Epstein and Maxwell; the circumstances surrounding Epstein’s death; how the government can tackle sex trafficking; how Epstein and Maxwell worked with powerful figures to protect themselves; and possible ethics rules violations by public officials.</p>\n<p>Clinton spokesman Angel Ureña on social media prodded Comer and made a reference to no Republicans attending a deposition with Epstein’s former employer, billionaire Les Wexner, in Ohio last week — which Comer had missed due to oral surgery.</p>\n<p>“We congratulate the Republicans for showing up today and tomorrow for their first deposition in their Epstein investigation. Glad none of them had pre-scheduled oral surgery,” he <a href=\"https://x.com/angelurena/status/2027044530629874058\">posted on X</a>. “We hope they actually ask questions about Epstein. Up until this point, they haven’t asked a single one.”</p>\n<p>Hillary Clinton has said she cannot recall ever speaking to Epstein and met his co-conspirator Ghislane Maxwell a few times.</p>\n<p>Asked about that, Comer said: “There are a lot of questions pertaining to Secretary Clinton, with respect to Epstein and his involvement in the Clinton initiative and her relationship with Ghislane Maxwell.”</p>\n<p>Republican members in attendance at the deposition included Reps. Anna Paulina Luna (Fla.), Nancy Mace (S.C.), Lauren Boebert (Colo.), William Timmons (S.C.), John McGuire (Va.), Michael Cloud (Texas) and Eric Burlison (Mo.).</p>\n<p>On the Democratic side, Ranking Member Robert Garcia (Calif.) is expedited to attend along with some other Democratic members of the panel.</p>\n<p>The Oversight panel had voted on a bipartisan basis to subpoena the Clintons and several other former government officials last year, and spent months negotiating with the Clintons over how they could provide testimony about their links to Epstein.</p>\n<p>As they attempted to avoid depositions, the Clintons previous Clintons argued that they had already provided the committee with all the information they had about Epstein Maxwell, provided sworn statements that they had no knowledge of their criminal activities, and argued that the subpoenas were invalid. </p>\n<p>Later, they <a href=\"https://thehill.com/homenews/house/5718848-clintons-reject-deposition-offer/\">sought</a> to have Hillary Clinton provide a sworn statement instead of testifying, and sought to limit the former president’s deposition to a four-hour interview. </p>\n<p>In January, <a href=\"https://thehill.com/homenews/house/5699996-democrats-clintons-contempt-vote/\">three Democrats on the panel voted</a> with Republicans to hold Hillary Clinton in contempt of Congress over the refusal to sit for a deposition. Nine Democrats voted to hold former President Clinton in contempt of Congress.</p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/house/5756577-clintons-questioned-epstein-links/",
            "pub_date": "2026-02-27 00:25:58",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5756250,
            "title": "Watch live: Vance seeks to sell Trump agenda in Wisconsin",
            "description": "<p>Vice President Vance is traveling to Wisconsin on Thursday, the latest stop in the Trump administration’s tour to sell President Trump’s <a data-id=\"https://thehill.com/homenews/administration/5751474-trump-state-of-the-union/\" data-type=\"link\" href=\"https://thehill.com/homenews/administration/5751474-trump-state-of-the-union/\">domestic and economic agenda</a> ahead of the <a data-id=\"https://thehill.com/homenews/administration/5715851-trump-warns-midterm-losses/\" data-type=\"link\" href=\"https://thehill.com/homenews/administration/5715851-trump-warns-midterm-losses/\">November midterm elections</a>.</p>\n<p>Vance, after visiting a machining facility, will give remarks in Plover, Wis. His comments come just over a day after Trump gave a record-long <a data-id=\"https://thehill.com/homenews/administration/5754101-trump-state-union-address-takeaways/\" data-type=\"link\" href=\"https://thehill.com/homenews/administration/5754101-trump-state-union-address-takeaways/\">State of the Union address</a> and following the Supreme Court’s <a data-id=\"https://thehill.com/homenews/5747935-trump-tariffs-supreme-court-ruling/\" data-type=\"link\" href=\"https://thehill.com/homenews/5747935-trump-tariffs-supreme-court-ruling/\">recent blow</a> to the president’s sweeping tariffs.</p>\n<p>Rep. Derrick Van Orden (R) — whose represents the region in Congress — is expected to attend.</p>\n<p>The event is scheduled to begin at 12 p.m. EST.</p>\n<p>Watch the live video above.</p>",
            "kind": 1,
            "link": "https://thehill.com/video-clips/5756250-watch-live-jd-vance-wisconsin-trump-agenda/",
            "pub_date": "2026-02-27 00:25:57",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5756532,
            "title": "Thune: Iran strikes should result in regime change",
            "description": "<p>Senate Majority Leader John Thune (R-S.D.) said Thursday that any military strikes against Iran should result in regime change to effect real change in a country that has long been hostile to the United States and its allies, particularly Israel.</p>\n<p>“In my view, if you’re going to do something there, you better well make it about getting new leadership and regime change,” Thune told reporters.</p>\n<p>“If you’re going to take some sort of action, I think you want to achieve a result that actually brings about the transformational change that I think we want in the region” Thune said.</p>\n<p>The GOP leader made his comments amid growing expectations on Capitol Hill that President Trump will order strikes against Iran in the next few days or weeks if negotiations led by special envoys Jared Kushner and Steve Witkoff fail to produce a deal to end Iran’s nuclear weapons program.</p>\n<p>The Trump administration has destroyers and aircraft carriers in the Persian Gulf, the Arabian Sea, and the Mediterranean Sea to prepare for a possible strike on Iran.</p>\n<p>“The president I don’t think, to my knowledge, has made any decisions  but I think they’re gaming out what contingencies might look like and what’s in our national security interests. Of course, first and foremost is to prevent them from having a nuclear capability but there are also other threats that they represent in the region,” Thune said.</p>\n<p>Trump told lawmakers at the State of the Union address on Tuesday that Iran has resumed its nuclear weapons program and could soon develop a ballistic missile capable of reaching the United States.</p>\n<p>Sen. Ted Cruz (R-Texas), who has spoken to Trump recently, has urged him to take advantage of what he and foreign policy experts view as the growing weakness of Iran’s regime in the aftermath of a bloody crackdown on anti-government protesters.</p>\n<p>“I said, ‘Listen, the regime has never been weaker. They are teetering,’” Cruz told CNBC in an interview Tuesday, recounted, recounting his conversation with Trump.</p>\n<p>“We are at a moment … where in the next six months we could realistically see the regimes in Iran, Venezuela and Cuba all fall and we could see them replaced with governments that want to be friendly with America,” he said.</p>\n<p>“If that happened, that would be the biggest geopolitical shift since the fall of the Berlin Wall,” Cruz argued.</p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/senate/5756532-trump-iran-strikes-regime-change/",
            "pub_date": "2026-02-27 00:16:03",
            "source": "thehill",
            "language": "en"
        }
    ]
}