{
    "data": [
        {
            "id": 5125588,
            "title": "Trump just keeps getting away with it",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>Every time I think Donald Trump has gone too far, every time I think he has finally crossed a bright line and won’t recover … he proves me wrong.</p>\n<p>Every time he steps into the spotlight, it’s like watching someone juggle live grenades. You think, “This is it — he’s finally going to blow himself up.” But, time and again, he walks away unscathed, grinning like the rules don’t apply to him.</p>\n\n<p>And, for Trump, they don’t.</p>\n<p>When he was running for president the first time, <a href=\"https://abcnews.go.com/Politics/donald-trump-cheering-jersey-911/story?id=35355447\" rel=\"noreferrer noopener\" target=\"_blank\">he told</a> George Stephanopoulos on ABC News that on 9/11, “there were people that were cheering on the other side of New Jersey, where you have large Arab populations. They were cheering as the World Trade Center came down. I know it might be not politically correct for you to talk about it, but there were people cheering as that building came down — as those buildings came down”</p>\n<p>Since there was absolutely no evidence to support what Trump was saying, I thought no one would take him seriously after that, that his fledgling political career would end before it really began. I was wrong.</p>\n<p>He mocked Sen. John McCain (R-Ariz.), a man who endured torture as a prisoner of war, by saying he wasn’t a war hero because “he got captured.” I was convinced that a cheap shot like that would end Trump’s political aspirations. I was wrong again.</p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>He <a href=\"https://www.bbc.com/news/world-us-canada-34930042\" rel=\"noreferrer noopener\" target=\"_blank\">made fun of</a> a journalist with a disability. I thought he’d surely pay a price for that. He didn’t.</p>\n<p>He survived the “Access Hollywood” tape where he was heard saying “when you’re a star … you can do anything. … Grab ’em by the p—-. You can do anything.”</p>\n\n<p>One month later, he was elected president.</p>\n<p>Eight years after that, on his first day back in the White House, he pardoned or commuted sentences for more than 1,500 people convicted of crimes in connection with the riot at the Capitol on Jan. 6, 2021 — including some thugs who viciously attacked police that day.</p>\n<p>This certainly was a bridge too far, I figured. Even Republicans, especially the party’s leadership in Congress, wouldn’t stand for something that irresponsible. Wrong yet again.</p>\n<div class=\"civic-science-article-container civic-science-more-14 civic-is-mr3\" data-civicscience-widget=\"3f127ebd-287e-0b64-a901-d55ec286348a\" id=\"civsci-id-civsci-id-596708068\"></div>\n<p>Then, just when you figure the man can’t cross any more bright lines, without so much as a shred of evidence he linked diversity programs at the Federal Aviation Administration to the collision of a regional jet and an Army helicopter that claimed 67 lives.</p>\n<p>As the New York Times <a href=\"https://www.nytimes.com/2025/01/30/us/politics/trump-plane-crash-dei-faa-diversity.html\" rel=\"noreferrer noopener\" target=\"_blank\">put it</a>, “President Trump’s remarks, suggesting that diversity in hiring and other Biden administration policies somehow caused the disaster, reflected his instinct to immediately frame major events through his political or ideological lens.”</p>\n<p>How many bright lines can Teflon Donald cross without paying a price? How many live grenades can he juggle before one blows up in his face? Can he say or do anything — absolutely anything — that would render him politically impotent? How can he not only survive all of it, but actually thrive?</p>\n\n<p>Let’s put it this way: It’s not only the MAGA faithful that are convinced we were heading in the wrong direction and that Trump could set things right. A lot of Americans were willing to put up with a certain amount of Trump-induced chaos to turn things around. (Whether he actually does turn things around is another matter. Stay tuned.)</p>\n<p>Trump didn’t create the anger and distrust running through America — he tapped into it. He saw that many Americans were tired of politicians who seemed more interested in “getting along” than fighting for them. Trump was a wrecking ball aimed at the establishment and, for a lot of people, that’s exactly what they wanted.</p>\n<p>His supporters think he’s one of them — except he’s a billionaire and they’re not, and he lives a luxurious life at Mar-a-Lago and they don’t. But he says what they wish they could say, does what they wish they could do, and sticks it to the people they resent: the media, the elites, the “politically correct.”</p>\n\n<p>Every time he crosses a line and gets away with it, they cheer because it’s like they’re getting away with it too.</p>\n<p>If they gave out gold medals for demolishing political norms, Trump would have a whole bunch hanging around his neck. If any other politician shattered so many political norms, he’d be greeting shoppers at Walmart — if he could even land the job.</p>\n<p>But for Donald Trump, crossing bright lines and juggling live grenades are just another day at the office.</p>\n\n<p><a href=\"http://bernardgoldberg.com/\" rel=\"noreferrer noopener\" target=\"_blank\"><em>Bernard Goldberg</em></a><em> is an Emmy and an Alfred I. duPont-Columbia University award-winning writer and journalist. He is the author of five books and publishes exclusive weekly columns, audio commentaries and Q&amp;As on his </em><a href=\"https://bernardgoldberg.substack.com/\" rel=\"noreferrer noopener\" target=\"_blank\"><em>Substack page</em></a><em>. Follow him </em><a href=\"https://twitter.com/BernardGoldberg\" rel=\"noreferrer noopener\" target=\"_blank\"><em>@BernardGoldberg</em></a>.</p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/opinion/campaign/5125588-trump-just-keeps-getting-away-with-it/",
            "pub_date": "2025-02-06 00:05:57",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5127896,
            "title": "Fans boo US national anthem before NHL, NBA games in Canada after Trump pauses tariffs",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>Fans booed the U.S. national anthem before NHL and NBA games held in Canada on Tuesday, just after Canadian Prime Minister Justin Trudeau and President Trump <a href=\"https://thehill.com/homenews/administration/5124026-trump-trudeau-canada-tariff-delay/\">came to an agreement</a> to delay tariffs.</p>\n<p>When “The Star-Spangled Banner” began at Rogers Arena in Vancouver before the Canucks hosted the Colorado Avalanche, the <a href=\"https://thehill.com/homenews/5121556-watch-fans-boo-us-national-anthem-nhl-game-canada/\">crowd burst</a> into boos.</p>\n\n<p>A few fans also booed before the NBA’s Toronto Raptors game against the New York Knicks, <a href=\"https://apnews.com/article/fans-boo-anthem-toronto-52a3c5add9de9239bc219c7496679b1c\">The Associated Press reported.</a></p>\n<p>At both sporting events, Canadian fans cheered for the singing of “O Canada.”</p>\n<p>Several fans also booed in Winnipeg, where the Jets hosted the Carolina Hurricanes for an NHL game and in Ottawa, Calgary and Vancouver, the AP reported.</p>\n<p>The Canadian criticism comes just days after Trump announced his 25 percent tariff plan. The plan has been met with sharp criticism and Canadian opposition.</p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>The president has defended the tariffs as a means to encourage U.S. trading partners to help stop the flow of fentanyl and migrants across the borders.</p>\n<p>Trump has also doubled down on his proposal that Canada should join the U.S. as its 51st state.</p>\n\n<p>The proposal has drawn <a href=\"https://thehill.com/policy/international/5124695-canadian-lawmaker-rips-trump-for-51st-state-comments-the-mans-a-liar/\">sharp criticism</a> from various Canadian officials who say the country will not be joining the U.S. and is ready to go “pound for pound” in an expected trade war.</p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/homenews/5127896-canada-fans-boo-us-national-anthem/",
            "pub_date": "2025-02-06 00:05:55",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5127883,
            "title": "Fired Democrat NLRB member sues Trump over ouster ",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>Gwynne Wilcox, a Democratic member of the <a data-id=\"https://thehill.com/regulation/labor/559690-biden-to-tap-seiu-lawyer-to-serve-on-nlrb/\" data-type=\"link\" href=\"https://thehill.com/business/4491063-corporate-giants-aim-to-hobble-national-labor-relations-board/\">National Labor Relations Board</a> (NLRB) fired by President Trump, sued him on Wednesday over the ouster. </p>\n<p>Wilcox’s attorneys claim Trump’s firing was a “blatant violation” of NLRB members’ removal protections contained within the National Labor Relations Act (NLRA). </p>\n\n<p>Some legal experts believe that the firings, along with Trump’s removal of <a href=\"https://thehill.com/homenews/administration/5113039-trump-fires-democrats-eo-commissioners/\" rel=\"noreferrer noopener\" target=\"_blank\">two Democratic members</a> from the Equal Employment Opportunity Commission, could tee up the overturning of a key Supreme Court precedent that for nearly a century has enabled Congress to prevent the president from removing members of multi-member independent agencies without cause.</p>\n<p>“The President’s action against Ms. Wilcox is part of a string of openly illegal firings in the early days of the second Trump administration that are apparently designed to test Congress’s power to create independent agencies like the Board,” <a href=\"https://storage.courtlistener.com/recap/gov.uscourts.dcd.277129/gov.uscourts.dcd.277129.1.0.pdf\" rel=\"noreferrer noopener\" target=\"_blank\">the lawsuit states.</a> </p>\n<p>“Although Ms. Wilcox has no desire to aid the President in establishing a test case, she is also cognizant of the fact that, if no challenge is made, the President will have effectively succeeded in rendering the NLRA’s protections—and, by extension, that of other independent agencies—nugatory,” it continued. </p>\n<p>The NLRB declined to comment on the lawsuit.</p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>President Biden first nominated Wilcox, a union lawyer, <a href=\"https://thehill.com/regulation/labor/559690-biden-to-tap-seiu-lawyer-to-serve-on-nlrb/\" rel=\"noreferrer noopener\" target=\"_blank\">to the NLRB beginning in 2021</a>. In September 2023, Congress confirmed her for a second term lasting five years. Before serving on the NLRB, Wilcox was a partner at Levy Ratner, P.C., a labor and employment law firm and associate general counsel of 1199SEIU United Healthcare Workers East. </p>\n<p>Trump fired Wilcox on his <a data-id=\"https://thehill.com/homenews/administration/5098445-trump-executive-orders-first-day/\" data-type=\"link\" href=\"https://thehill.com/homenews/administration/5098445-trump-executive-orders-first-day/\">first day in office</a>, which left the NLRB with just two members, meaning it doesn’t have a quorum to conduct its normal business.  </p>\n\n<p>Calling the president’s removal “unprecedented and illegal,” Wilcox’s attorneys noted their client was the first Black woman to serve on the board and is the first to be removed from office since its inception in 1935. Their lawsuit was filed in federal court in Washington, D.C.</p>\n<p>Federal law provides that the president can only remove NLRB members in cases of “neglect of duty or malfeasance in office, but for no other cause,” and they must also be given “notice and hearing.” </p>\n<p>“Under the NLRA’s plain language, Ms. Wilcox has a clear legal entitlement to retain her position as a member of the National Labor Relations Board,” Wilcox’s attorneys wrote. </p>\n<p>In addition to her firing, Trump also ousted NLRB general counsel Jennifer Abruzzo, effectively instituting a sweeping shift in the independent agency that enforces U.S. labor laws. The agency has been battling with large corporations, which have <a href=\"https://thehill.com/business/4491063-corporate-giants-aim-to-hobble-national-labor-relations-board/\" rel=\"noreferrer noopener\" target=\"_blank\">increasingly mounted legal efforts</a> seeking to dismantle the agency as unconstitutional.</p>\n<p>Trump’s firings are part of a blitz of sweeping actions he has taken during his <a data-id=\"https://thehill.com/homenews/administration/5105634-trump-first-week-takeawys/\" data-type=\"link\" href=\"https://thehill.com/homenews/administration/5105634-trump-first-week-takeawys/\">first few weeks in office</a> that are reshaping the federal government. The case is one of roughly three dozen lawsuits that have been filed across the country challenging the various actions. </p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/regulation/court-battles/5127883-donald-trump-ousted-nlrb-member-lawsuit/",
            "pub_date": "2025-02-06 00:01:12",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5127787,
            "title": "Trump invites Indian PM Modi to White House",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>President Trump has invited Indian Prime Minister Narendra Modi to the White House next week for a working visit, a White House official confirmed to The Hill. </p>\n<p>Modi will travel to Washington D.C. for a two-day visit. The invite comes just days after a recent phone call between the two leaders.</p>\n\n<p>The “productive call” touched on expanding U.S.-India cooperation on a number of global issues, which included security in the Indo-Pacific, the Middle East, and Europe. </p>\n<p>The phone call also saw Trump emphasize “the importance of India increasing its procurement of American-made security equipment and moving towards a fair bilateral trading relationship,” the White House said in a statement.</p>\n<p>“He is going to be coming to the White House, over next month, probably February. We have a very good relationship with India,” Trump told reporters aboard Air Force One in January.</p>\n<p>The confirmation of the visit follows news that a U.S. military plane with at least 100 migrants aboard landed in India on Wednesday.</p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>An Air Force C-17 plane landed at about 3:30 a.m. ET in Amritsar, India, according to the Defense Department. India previously said it would repatriate all Indians who entered the U.S. illegally. </p>\n<p>The visit also comes as Trump has increasingly threatened the BRICS countries, which includes Brazil, India, Russia, China and South Africa, with steep tariffs if they move to create a new currency that aims to rival the dollar.</p>\n\n<p>The Quad alliance, which includes the U.S., India, Australia and Japan, a bloc formed to counter Chinese clout in the Indo-Pacific, is also expected to come up in talks between the two leaders. India is set to host the Quad leaders’ summit in 2025.</p>\n<p>The Indian prime minister, who was reelected to a third term last year, but with greatly reduced power in parliament, has shared a warm relationship with Trump. Trump attended a massive rally with Modi in Houston in 2019, and <a href=\"https://thehill.com/homenews/administration/482388-trump-to-travel-to-india-in-late-february/\" rel=\"noreferrer noopener\" target=\"_blank\">visited India in February 2020</a>, where thousands of people watched the two leaders speak in Ahmedabad.</p>\n<p>Trump has previously described Modi as “fantastic” while describing India as a “very big abuser” in trade. His first term saw the Trump administration in 2019 cancel special trade privileges with India, responding India placing tariffs of its own on more than two dozen U.S. goods.</p>\n<p>Former President Biden hosted Modi for a state dinner in 2023, with more than 70 Democratic members of Congress signing a <a href=\"https://jayapal.house.gov/2023/06/20/jayapal-van-hollen-lead-bicameral-letter-with-over-70-members-urging-president-biden-to-discuss-upholding-human-rights-and-democratic-values-during-upcoming-meeting-with-indian-pm-modi/\">letter</a> urging Biden to discuss human rights and democratic values during his visit.</p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/homenews/administration/5127787-trump-invites-modi-white-house/",
            "pub_date": "2025-02-05 23:50:57",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5127880,
            "title": "Warren finds common ground with Trump over debanking concerns",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>Sen. Elizabeth Warren (D-Mass.) seems to have found common ground with President Trump and Republican lawmakers <a data-id=\"https://thehill.com/business/5102823-trump-banks-discrimination-conservatives/\" data-type=\"link\" href=\"https://thehill.com/business/5102823-trump-banks-discrimination-conservatives/\">over “debanking” concerns</a>, urging the president Tuesday to take action to prevent Americans from being improperly locked out of the financial system. </p>\n<p>The top Democrat on the Senate Banking Committee called on Trump to support the Consumer Financial Protection Bureau’s (CFPB) efforts to combat debanking — the closure of bank accounts that financial institutions consider risky, often with little or no notice.    </p>\n\n<p>“I write to request that you take action on preventing the debanking of too many Americans across the country, including consumers unfairly locked out of the financial system due to overdraft fees, religious affiliation, or political beliefs,” Warren wrote in a letter to Trump. </p>\n<p>“Your Administration can help to address this problem by supporting the ongoing efforts of the Consumer Financial Protection Bureau (CFPB), the main agency in our government working to stop unfair debanking, and directing other agencies to use their authorities to bring an end to this practice,” she added. </p>\n<p>Her call to support the CFPB comes after Trump tapped Treasury Secretary Scott Bessent to serve as acting director of the agency Monday. Bessent reportedly halted staff to halt all work, according to The Wall Street Journal. </p>\n<p>GOP lawmakers have long opposed the CFPB, which they argue has overstepped its regulatory authority.  </p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>Warren argued Tuesday that Bessent’s order to halt work at the agency “will only impede efforts to stop debanking.” She pointed to several proposed or finalized rules from the CFPB that would bar debanking based on political or religious affiliation and provide debanked customers notice and the ability to appeal account closures. </p>\n<p>The Massachusetts Democrat said her staff has identified thousands debanking-related complaints in the past three years, with more than half of those complaints lodged against four major banks — Bank of America, JPMorgan Chase, Wells Fargo and Citigroup. </p>\n\n<p>The letter marks a rare moment of alignment between the progressive senator and Trump. The president took aim at debanking, and Bank of America in particular, during a virtual appearance at the World Economic Forum in Davos, Switzerland. </p>\n<p>During an exchange with Bank of America CEO Brian Moynihan, Trump accused his bank and other financial institutions of refusing to do business with conservatives. </p>\n<p>“I hope you start opening your bank to conservatives, because many conservatives complain that the banks are not allowing them to do business within the bank, and that included a place called Bank of America,” Trump said. </p>\n<p>GOP lawmakers quickly jumped on the bandwagon, with House Oversight Committee Chair James Comer (R-Ky.) <a data-id=\"https://thehill.com/business/5105371-crypto-debanking-investigation/\" data-type=\"link\" href=\"https://thehill.com/business/5105371-crypto-debanking-investigation/\">opening an investigation</a> into debanking and Senate Banking Committee Chair Tim Scott (R-S.C.) announcing a hearing on the topic. </p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/policy/technology/5127880-trump-elizabeth-warren-debanking-concerns/",
            "pub_date": "2025-02-05 23:45:52",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5127821,
            "title": "USPS to resume accepting packages from China, Hong Kong",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>The U.S. Postal Service (USPS) announce it will resume accepting packages from China and Hong Kong, reversing course after saying it would not take in parcels following <a href=\"https://thehill.com/homenews/administration/5121102-trump-tariffs-china-canada-mexico/\">newly-imposed tariffs</a> on China. </p>\n<p>The USPS said in a <a href=\"https://about.usps.com/newsroom/service-alerts/international/suspension-of-inbound-parcels-from-china-and-hong-kong.htm\">notice</a> on Wednesday that it “will continue accepting all international inbound mail and packages from China and Hong Kong Posts.” </p>\n\n<p>The postal service added it was working “closely” with Customs and Border Protection (CBP) to “implement an efficient collection mechanism for the new China tariffs to ensure the least disruption to package delivery.” </p>\n<p>The U-turn came as USPS said on Tuesday it would pause accepting parcels from China and Hong Kong “until further notice” as the Trump administration’s tariffs against Beijing went into effect just past midnight on Tuesday. </p>\n<p>On Saturday, Trump <a href=\"https://thehill.com/homenews/administration/5121102-trump-tariffs-china-canada-mexico/\">signed tariffs</a> against Canada, Mexico and China, the three biggest U.S. trading partners. It imposed a 10 percent tariff on goods coming from China. Tariffs against Mexico and Canada, which were set to be 25 percent, were <a href=\"https://thehill.com/homenews/administration/5122864-trump-mexico-delay-tariffs/\">called off</a> after Trump spoke with leaders of both countries on Monday. </p>\n<p>Beijing responded <a href=\"https://thehill.com/homenews/administration/5124874-china-united-states-retaliatory-tariffs/\">on Tuesday, retaliating</a> with its own set of sweeping tariffs impacting critical elements, including oil, coal and natural gas. It set a 15 percent tariff on liquefied natural gas and coal along with a 10 percent one crude oil,  agricultural machinery and pickup trucks. </p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>Trump’s tariff on China included ending the “de minimis” trade loophole, which permitted shipping packages that are worth less than $800 without paying tax. China’s e-commerce companies Temu and Shein could be affected by the tariff. </p>\n<p>The number of shipments coming to the U.S. that requested the de minimis exemption went up by over 600 percent, going from around 139 million a year in 2015 to more than 1.36 billion during the fiscal year 2024, according to CBP <a href=\"https://www.cbp.gov/newsroom/national-media-release/cbp-proposes-new-rule-strengthen-enforcement-and-limit-duty\">data</a>.</p>\n\n<p>The de minimis value <a href=\"https://www.cbp.gov/newsroom/national-media-release/de-minimis-value-increases-800\">increased</a> from $200 to $800 in late 2016 with the rise of e-commerce businesses and more low-value packages entering the country.</p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/policy/international/5127821-usps-china-packages-tariffs/",
            "pub_date": "2025-02-05 23:35:55",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5127666,
            "title": "Google removes weapons development, surveillance pledges from AI ethics policy",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>Google has updated its ethical policies on artificial intelligence, eliminating a pledge to not use AI technology for weapons development and surveillance.</p>\n<p>According to a now-archived version of Google’s AI principles <a href=\"https://web.archive.org/web/20250130075626/https:/ai.google/responsibility/principles/\">seen on the Wayback Machine</a>, the section titled “Applications we will not pursue” previously included weapons and other technology aimed at injuring people, along with technologies that “gather or use information for surveillance.” </p>\n\n<p>As of Tuesday, the section was no longer listed on <a href=\"https://ai.google/responsibility/principles/\">Google’s AI principles page. </a></p>\n<p>The Hill reached out to Google for comment. </p>\n<p>In a blog post Tuesday, Google head of AI, Demis Hassabis and senior vice president for technology and society James Manyikaexplained the company’s experience and research over the years, along with guidance from other AI firms, “have deepened our understanding of AI’s potential and risks.”</p>\n<p>“Since we first published our AI principles in 2018, the technology has evolved rapidly,” Manyika and Hassabis wrote, adding, “It has moved from a niche research topic in the lab to a technology that is becoming as pervasive as mobile phones and the internet itself; one with numerous beneficial uses for society and people around the world, supported by a vibrant AI ecosystem of developers.”</p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>Google said in the blog post that it will continue to “stay consistent with widely accepted principles of international law and human rights,” and evaluate whether the benefits “substantially outweigh potential risks.” </p>\n<p>The new policy language also pledged to identity andassesst AI risks through research, expert opinion and “red teaming,” during which a company tests its cybersecurity effectiveness by conducting a simulated attack.</p>\n\n<p>The AI race has ramped among domestic and international companies in recent years as Google and other leading tech firms increase their investments into the emerging technology. </p>\n<p>As Washington increasingly embraces the use of AI, some policymakers have expressed concerns the technology could be used for harm when in the hands of bad actors. </p>\n<p>The federal government is still trying to harness the benefits of its use, even in the military. </p>\n<p>The Defense Department announced late last year a new office focused on accelerating and adopting AI technology for the military to deploy autonomous weapons in the near future. </p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/policy/technology/5127666-google-ai-ethical-rules-updated/",
            "pub_date": "2025-02-05 23:35:53",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5127659,
            "title": "Watch live: House Democrats give remarks as shutdown clock begins",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>House Democratic leaders will hold a press conference Wednesday morning as their GOP colleagues <a data-id=\"https://thehill.com/homenews/house/5127330-house-republicans-trump-agenda-scramble/\" data-type=\"link\" href=\"https://thehill.com/homenews/house/5127330-house-republicans-trump-agenda-scramble/\">grapple with internal divisions</a> ahead of <a data-id=\"https://thehill.com/business/budget/5126799-shutdown-fears-trump-moves-democrats/\" data-type=\"link\" href=\"https://thehill.com/business/budget/5126799-shutdown-fears-trump-moves-democrats/\">another looming shutdown</a>.</p>\n<p>House Minority Leader Hakeem Jeffries (D-N.Y.) has <a data-id=\"https://thehill.com/homenews/house/5123216-jeffries-government-shutdown-trump-orders/\" data-type=\"link\" href=\"https://thehill.com/homenews/house/5123216-jeffries-government-shutdown-trump-orders/\">vowed to use the budget fight</a> as a vehicle to block some of President Trump’s efforts to <a data-id=\"https://thehill.com/policy/healthcare/5118716-trump-administration-funding-freeze-public-health/\" data-type=\"link\" href=\"https://thehill.com/policy/healthcare/5118716-trump-administration-funding-freeze-public-health/\">gut federal programs</a> and <a data-id=\"https://thehill.com/business/5126025-republicans-congressional-budget-tax-bill/\" data-type=\"link\" href=\"https://thehill.com/business/5126025-republicans-congressional-budget-tax-bill/\">issue tax cuts</a>. The move likely raises the chance of a shutdown, with government funding set to lapse on March 14.</p>\n<p>The press conference will be led by House Democratic Caucus Chair Pete Aguilar (D-Calif.) and Vice Chair Ted Lieu (D-Calif.). </p>\n<p>Their remarks are scheduled to begin at 11 a.m. EST.</p>\n<p>Watch the live video above.</p>\n<script type=\"text/javascript\">window.NREUM||(NREUM={});NREUM.info={\"beacon\":\"bam.nr-data.net\",\"licenseKey\":\"bb199f70cb\",\"applicationID\":\"738543775\",\"transactionName\":\"MQNTMhdXDxECABBZDAhJchMWQg4PTBMLQxdIFl4VEQ==\",\"queueTime\":0,\"applicationTime\":4497,\"atts\":\"HURERF9NHE5BAkYKGBsb\",\"errorBeacon\":\"bam.nr-data.net\",\"agent\":\"\"}</script>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/homenews/5127659-watch-live-house-democrats-shutdown-looming/",
            "pub_date": "2025-02-05 23:31:10",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5125279,
            "title": "A bold, bipartisan strategy to secure Greenland’s future ",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>When President Trump <a href=\"https://www.npr.org/2025/01/26/nx-s1-5275375/trump-greenland-canada-israel-gaza\" rel=\"noreferrer noopener\" target=\"_blank\">again</a> proposed buying Greenland, the world laughed. But beneath the headlines was a spot-on strategic instinct. Greenland is a rapidly rising geopolitical heavyweight the U.S. cannot afford to ignore.  </p>\n<p>As Russia expands its Arctic military footprint and China pours billions into securing long-term access to the Arctic region, Greenland is steadily moving toward independence. The real question isn’t whether the U.S. should engage, but how — and whether we will act before Beijing or Moscow fills the void. </p>\n\n<p>To secure U.S. leadership in the Arctic, Congress must move beyond symbolic gestures and adopt a bold, bipartisan strategy that deepens U.S.-Greenland ties, strengthens Arctic security, and lays the groundwork for Greenland’s eventual NATO membership.  </p>\n<p>Russia and China aren’t waiting around in the Arctic, and neither should the U.S. Moscow is <a href=\"https://www.reuters.com/graphics/ARCTIC-SECURITY/zgvobmblrpd/\" rel=\"noreferrer noopener\" target=\"_blank\">ramping up its military presence</a> with new bases, nuclear-capable missiles and its most capable naval fleet. At the same time, Beijing is <a href=\"https://media.defense.gov/2021/Jan/05/2002560338/-1/-1/0/ARCTIC%20BLUEPRINT%202021%20FINAL.PDF/ARCTIC%20BLUEPRINT%202021%20FINAL.PDF\" rel=\"noreferrer noopener\" target=\"_blank\">building more nuclear-powered icebreakers</a>, pouring billions into <a href=\"https://www.npr.org/2024/08/02/nx-s1-5052089/pentagon-sounds-alarm-over-russia-china-cooperation-in-the-arctic\" rel=\"noreferrer noopener\" target=\"_blank\">dual-use Arctic research and infrastructure</a> and sailing its Navy further north.  </p>\n<p>Right in the middle of it all is Greenland — a resource-rich island with enormous strategic value to the U.S. and NATO.  </p>\n<p>To bolster defense, lawmakers should direct the Department of Defense to assess the feasibility of forward-basing elements of a <a href=\"https://seapowermagazine.org/admiral-cool-to-notion-of-separate-arctic-fleet/?print=print\" rel=\"noreferrer noopener\" target=\"_blank\">U.S. Arctic Fleet</a> in Greenland, incorporating this review into the 2026 National Defense Authorization Act. Washington should also work with Copenhagen and Nuuk to invest in joint military infrastructure, including port expansions and improved airstrips, to support NATO operations in the High North.</p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>To improve intelligence-sharing, Congress should fund the establishment of a NATO Arctic Intelligence Fusion Center in Nuuk, modeled after <a href=\"https://web.ifc.bices.org/\" rel=\"noreferrer noopener\" target=\"_blank\">similar initiatives</a> in Eastern Europe. This would provide real-time surveillance of Russian and Chinese activity, giving the U.S. and its allies better situational awareness in an increasingly navigable and contested Arctic region. </p>\n<p>Meanwhile, Greenland’s independence efforts will require a roadmap for transitioning from Danish military protection to self-defense. Congress should direct the Defense Department to develop a plan that helps Greenland build its own defense capabilities — ensuring it can secure its borders and contribute to regional stability. </p>\n\n<p>Greenland isn’t just an Arctic stronghold — it’s sitting on a <a href=\"https://apnews.com/article/greenland-trump-climate-change-minerals-trade-bab5bb60ba52f6073f056fb271c43215\" rel=\"noreferrer noopener\" target=\"_blank\">goldmine of rare earth elements</a>, crucial for U.S. defense systems, semiconductors, and renewable energy technology. With China controlling more than 70 percent of global rare earth production, the U.S. needs an alternative supply chain before it’s too late. </p>\n<p>Congress should introduce the U.S.-Greenland Rare Earth Security Act<em>,</em> which would offer tax incentives and loan guarantees for U.S. companies investing in Greenland’s mining sector. Expanding the <a href=\"https://crsreports.congress.gov/product/pdf/R/R43767\" rel=\"noreferrer noopener\" target=\"_blank\">Defense Production Act </a>to prioritize Greenland as a strategic supplier of critical minerals would further reduce America’s reliance on Beijing. </p>\n<p>A U.S.-Greenland Strategic Minerals Partnership could streamline regulatory cooperation, fast-track mining projects and promote environmentally responsible extraction — ensuring Greenland benefits economically while reinforcing U.S. supply chain security. This is a win-win: Greenland gains independence from Danish subsidies, and the U.S. secures a reliable source of rare earth elements. </p>\n<div class=\"civic-science-article-container civic-science-more-14 civic-is-mr3\" data-civicscience-widget=\"3f127ebd-287e-0b64-a901-d55ec286348a\" id=\"civsci-id-civsci-id-596708068\"></div>\n<p>Greenland is moving <a href=\"https://www.politico.eu/article/greenland-prime-minister-mute-egede-independence-denmark-colonialism-donald-trump-arctic/\" rel=\"noreferrer noopener\" target=\"_blank\">toward independence</a>, but it doesn’t want to be absorbed by another country. Instead, it wants strategic partnerships that allow it to stand <a href=\"https://www.politico.eu/article/greenland-poll-mute-egede-donald-trump-takeover-united-states/\" rel=\"noreferrer noopener\" target=\"_blank\">on its own</a>. That’s where a compact of free association comes in.</p>\n<p>Modeled after U.S. agreements with Pacific nations like Palau and the Marshall Islands, <a href=\"https://nationalinterest.org/feature/its-time-us-greenland-free-association-agreement-213327/\" rel=\"noreferrer noopener\" target=\"_blank\">a compact of free association with Greenland </a>would formalize military, economic and diplomatic ties without compromising Greenland’s sovereignty. Congress should request a State, Interior, and Defense Department feasibility study to assess the benefits of such a compact, laying the groundwork for introducing the U.S.-Greenland COFA Authorization Act<em> </em>to begin formal negotiations. </p>\n<p>To ensure Greenland’s transition to independence is successful, Congress should also create a Greenland Independence Transition Fund, which would provide targeted investments in governance, infrastructure and workforce development — helping Greenland reduce reliance on Danish subsidies while preparing for NATO integration. </p>\n\n<p>The U.S. can’t just treat Greenland as a security asset — it needs to invest in Greenland’s economic future. Congress should support expanding the U.S. consulate in Nuuk, increasing diplomatic staff focused on trade, education, and Arctic governance. Launching a U.S.-Greenland Business Council and U.S.-Greenland Arctic Innovation Fund would encourage American companies to invest in Greenland’s renewable energy, fisheries, and infrastructure projects.  </p>\n<p><a href=\"https://link.springer.com/chapter/10.1007/978-3-031-26051-3_10\" rel=\"noreferrer noopener\" target=\"_blank\">Investing in education</a> and workforce development will also be critical. Congress should establish a U.S.-Greenland Education Exchange Initiative <em>— </em>modeled after the <a href=\"https://us.fulbrightonline.org/\" rel=\"noreferrer noopener\" target=\"_blank\">Fulbright Program</a><em> — </em>STEM<em> </em>scholarships, teacher training partnerships and vocational programs in critical industries like mining and energy.  </p>\n<p>Congress has an opportunity to lead now. Holding House Foreign Affairs Committee hearings on Greenland’s strategic role, introducing the U.S.-Greenland COFA Authorization Act, and organizing a congressional delegation to Greenland should be immediate priorities in 2025. </p>\n\n<p>This bold, bipartisan strategy ensures that as Greenland moves toward independence, it does so as a committed U.S. ally — aligned with Western values and fully integrated into NATO. The window of opportunity is closing, and America must lead now. </p>\n<p><em>Walter Berbrick is a senior military analyst with Netsimco, a Saalex Company. He is the former founding director of the Arctic Studies Group and Newport Arctic Scholars Initiative at the U.S. Naval War College. He served in senior Arctic policy roles at the State Department and Pentagon and is the co-author of the “Newport Manual on Arctic Security.” </em></p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/opinion/international/5125279-greenland-strategic-geopolitical-power/",
            "pub_date": "2025-02-05 23:31:05",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5127802,
            "title": "Canadian lawmaker on Trump tariff delay: ‘He choked’",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>Canadian Member of Parliament Charlie Angus said President Trump “choked” as his tariff plan for Canada was <a href=\"https://thehill.com/homenews/administration/5124026-trump-trudeau-canada-tariff-delay/\">ultimately delayed</a> before going into action.</p>\n<p>“He blinked,” Angus told MediasTouch, <a href=\"https://www.huffpost.com/entry/charlie-angus-trump_n_67a32b28e4b05f0a510c0c61\">highlighted by HuffPost</a>. “He choked.”</p>\n\n<p>Just days after Trump signed an executive order that imposed a 25 percent tariff on Canada, he reached an agreement with Prime Minister Justin Trudeau to hold the tariffs for a month.</p>\n<p>Trump said Canada agreed to secure the northern border through a $1.3 billion plan and combat the flow of fentanyl into the U.S.</p>\n<p>Angus has been <a href=\"https://thehill.com/policy/international/5124695-canadian-lawmaker-rips-trump-for-51st-state-comments-the-mans-a-liar/\">an outspoken critic</a> of Trump’s tariff plan, as well as his remarks on incorporating the Canadian people into the U.S. by making the country America’s 51st state.</p>\n<p>Angus noted the Canadian people are much more united than American citizens currently and the country is ready to go “pound for pound” with the U.S. if Trump plunges the countries into a trade war.</p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>While speaking <a href=\"https://www.youtube.com/watch?v=yUHayD3Z4nQ\">with the outlet</a>, Angus said Canadians are already taking steps to show Trump the impact of not buying American products or stopping exports to the U.S.</p>\n<p>He rallied Canadian allies as Trump continues to say he wants to gain control of the Panama Canal and Greenland, and said they need to stand united.</p>\n\n<p>“We know it’s going to hurt, but I’m telling my friends in Buffalo, I’m telling my friends in Kentucky, I’m telling my friends in Michigan that, get ready, because the pain is coming your way, too,” Anus said. “Because we will fight back. Punch for punch, pound for pound, dollar for dollar, because it’s about our freedom as a nation.”</p>\n<p>After Trump and Trudeau struck the agreement, Angus argued it happened because the president was already seeing the impacts from Canadians.</p>\n<p>“We’re nice people, but you have really, seriously poked the polar bear,” he said. “So, Donald, come back at us a second time. It’s gonna hurt even more.”</p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/policy/international/5127802-canada-trump-tariffs-delay/",
            "pub_date": "2025-02-05 23:26:01",
            "source": "thehill",
            "language": "en"
        }
    ]
}