{
    "data": [
        {
            "id": 5757287,
            "title": "Democrats fume after Boebert leaks deposition photo of Hillary Clinton: 'Clown show'",
            "description": "<p>Democrats on the House Oversight and Government Reform Committee tore into Republicans on the panel after Rep. Lauren Boebert (R-Colo.) leaked a photo from inside former Secretary of State Hillary Clinton’s deposition on Thursday.</p>\n<p>Clinton is testifying as part of the panel’s probe into the convicted sex offender Jeffrey Epstein.</p>\n<p>Ranking member Robert Garcia (D-Calif.) said Clinton, who said she <a href=\"https://thehill.com/homenews/house/5756577-clintons-questioned-epstein-links/\" rel=\"noreferrer noopener\" target=\"_blank\">did not recall</a> ever meeting Epstein, was “completely cooperating with the deposition and the committee” and “answering questions in full faith and in good faith.”</p>\n<p>“What is not acceptable is Oversight Republicans breaking their own committee rules that they established with the Secretary and her team,” Garcia said in statements to the press during a break in the deposition. “It was gracious of the Secretary and her team to continue the deposition.”</p>\n<p>“We are sitting through an incredibly unserious clown show of a deposition where members of Congress and the Republican Party are more concerned about getting their photo op of Secretary Clinton than actually getting to the truth and holding anyone accountable,” Rep. Yassamin Ansari (D-Ariz.) said.</p>\n<p>The panel’s deposition of Clinton was paused after conservative influencer Benny Johnson <a href=\"https://x.com/bennyjohnson/status/2027067846417690630\" rel=\"noreferrer noopener\" target=\"_blank\">posted a photo</a> of Clinton in the deposition on social media, which he said came from Boebert.</p>\n<p>A Clinton adviser told the press that the hearing was paused because of the photo, which he said was a violation of the rules read at the start of the deposition.</p>\n<p>Johnson <a href=\"https://x.com/bennyjohnson/status/2027080800961720538\" rel=\"noreferrer noopener\" target=\"_blank\">balked at the photo</a> leading to a pause in the deposition, noting that the Clintons had asked to testify in a public setting and that the full deposition would later be released to the public. House Oversight Committee Chair James Comer (R-Ky.) said there will be video of the deposition that both sides will have an opportunity to review.</p>\n<p>Asked about the photo when returning to the deposition after a break, Boebert made a reference to the FBI’s investigation into a private email server Clinton used while secretary of State, which dominated the final stretch of her 2016 presidential campaign.</p>\n<p>“I just returned to my hotel room and installed the BleachBit software … So, I guess in regards to taking photos, I do not recall,” Boebert quipped.</p>\n<p>Garcia said that “everybody was very taken aback by the committee rules being essentially not enforced and certainly just broken immediately.”</p>\n<p> He said that after the photo leaked, Clinton’s team continued to ask to let the press into the room because it is important to her that any release of her deposition not be edited.</p>\n<p>Any repercussions for the leak, he said, should come from the Republican majority and Comer.</p>\n<p>“What we’re seeing is political theater. What we’re seeing is folks that are looking for headlines and tweets as opposed to doing the business of going about getting justice for the victims,” said Rep. Wesley Bell (D-Mo.), a former prosecutor. He added: “We have not learned one new thing.”</p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/house/5757287-hillary-clinton-deposition-boebert-photo/",
            "pub_date": "2026-02-27 05:06:08",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5757526,
            "title": "Second GOP lawmaker backs Iran war powers act, barring 'new information'",
            "description": "<p>Rep. Warren Davidson (Ohio) on Thursday became the second House Republican to pledge support for a resolution aimed at limiting President Trump’s ability to take unilateral military action in Iran.</p>\n<p>Davidson wrote in a post on the social platform X that he has requested a classified briefing on the “mission in Iran,” but he intended to back the <a href=\"https://massie.house.gov/uploadedfiles/iranwpr.pdf\" rel=\"noreferrer noopener\" target=\"_blank\">war powers resolution</a> when it reaches the House floor next week, barring “new information.”</p>\n<p>“War requires Congressional authorization. These are actions short of war, but no case has been made,” Davidson <a href=\"https://x.com/WarrenDavidson/status/2027036899945107794?s=20\" rel=\"noreferrer noopener\" target=\"_blank\">wrote on X</a>.</p>\n<p>House Democrats are expected to <a href=\"https://thehill.com/homenews/house/5756657-democrats-trump-iran-war-powers/\" rel=\"noreferrer noopener\" target=\"_blank\">force a vote</a> next week designed to stop Trump from <a href=\"https://thehill.com/homenews/administration/5747382-trump-limited-strike-iran/\" rel=\"noreferrer noopener\" target=\"_blank\">launching strikes</a> without first obtaining congressional approval as the administration <a href=\"https://thehill.com/homenews/administration/5755158-us-iran-sanctions-oil-nuclear-program/\" rel=\"noreferrer noopener\" target=\"_blank\">ramps up pressure</a> on Tehran over its nuclear program.</p>\n<p>The resolution’s prospects <a href=\"https://thehill.com/homenews/house/5753315-trump-iran-military-force-resolution-fails/\" rel=\"noreferrer noopener\" target=\"_blank\">remain uncertain</a>, with Davidson and co-sponsor Rep. Thomas Massie (Ky.) being the only House Republicans to publicly back it.</p>\n<p>Meanwhile, at least two Democrats — Reps. Josh Gottheimer (N.J.) and Jared Moskowitz (Fla.) — have indicated they will <a href=\"https://thehill.com/homenews/house/5748330-lawler-gottheimer-oppose-iran-strike/\" rel=\"noreferrer noopener\" target=\"_blank\">break with their party</a> and vote against it.</p>\n<p>Gottheimer, a staunch Israel ally, has defended his stance by arguing that Trump needs flexibility in addressing Iranian threats, noting the regime’s support of terrorist proxies and efforts to develop a nuclear weapon.</p>\n<p>“So long as ‘Death to America’ remains the rallying cry of the Iranian regime, Iran will remain a persistent and serious threat to our men and women in uniform, our allies, and global stability,” Gottheimer said in <a href=\"https://lawler.house.gov/news/documentsingle.aspx?DocumentID=5528\" rel=\"noreferrer noopener\" target=\"_blank\">a joint statement</a> with Rep. Mike Lawler (R-N.Y.) last week.</p>\n<p>“We respect and defend Congress’s constitutional role in matters of war. Oversight and debate are absolutely vital. However, this resolution would restrict the flexibility needed to respond to real and evolving threats and risks, signaling weakness at a dangerous moment,” they added.</p>\n<p>Trump did not take the possibility of <a href=\"https://thehill.com/homenews/senate/5756532-trump-iran-strikes-regime-change/\" rel=\"noreferrer noopener\" target=\"_blank\">military action</a> off the table in his <a href=\"https://thehill.com/video-clips/5752399-watch-live-donald-trump-state-of-the-union-address-2026/\" rel=\"noreferrer noopener\" target=\"_blank\">State of the Union address</a> on Tuesday, even as he pushed for a <a href=\"https://thehill.com/homenews/administration/5754746-vance-us-seeks-iran-diplomacy/\" rel=\"noreferrer noopener\" target=\"_blank\">diplomatic outcome</a> in the ongoing, indirect talks between U.S. and Iranian officials.</p>\n<p>“We are in negotiations with them. They want to make a deal, but we haven’t heard those secret words: We will never have a nuclear weapon,” Trump said during his speech.</p>\n<p>Omani Foreign Minister Badr al-Busaidi said Thursday that “significant progress” had been made and plans for another round of “technical level” discussions in Vienna next week were in the works.</p>\n<p>“We have finished the day after significant progress in the negotiation between the United States and Iran. We will resume soon after consultation in the respective capitals,” al-Busaidi <a href=\"https://x.com/badralbusaidi/status/2027089708392579576\" rel=\"noreferrer noopener\" target=\"_blank\">wrote on X</a>.</p>\n<p>The war powers resolution would not be the first time Davidson aligned with Massie on a largely party-line vote. The two fiscal conservatives were the only House Republicans to initially <a href=\"https://thehill.com/homenews/house/5313198-house-passes-trump-big-beautiful-bill/\" rel=\"noreferrer noopener\" target=\"_blank\">vote against</a> the One Big Beautiful Bill Act last summer over concerns about deficit spending.</p>\n<p>Davidson <a href=\"https://thehill.com/homenews/house/5382760-warren-davidson-trump-big-beautiful-bill/\">ultimately voted for</a> the Senate’s version of the massive spending and policy bill, but Massie did not.</p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/house/5757526-davidson-massie-back-resolution-iran/",
            "pub_date": "2026-02-27 05:06:07",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5757505,
            "title": "Mamdani says Trump told him ICE-detained Columbia student 'will be released imminently'",
            "description": "<p>New York City Mayor Zohran Mamdani said Thursday that President Trump had assured him in a phone call of the forthcoming release of a Columbia University student who had been detained on campus earlier in the day.</p>\n<p>“In our meeting earlier, I shared my concerns about Columbia student Elaina Aghayeva, who was detained by ICE this morning. He has just informed me that she will be released imminently,” Mamdani <a data-id=\"https://x.com/nycmayor/status/2027115998944305457\" data-type=\"link\" href=\"https://x.com/nycmayor/status/2027115998944305457\">wrote on X Thursday</a>.  </p>\n<p><a href=\"https://thehill.com/homenews/education/5756715-columbia-immigration-dhs-student-arrest/\">Columbia had said</a> federal agents “made misrepresentations to gain entry to the building” in order to arrest Aghayeva. The university says it does not let federal agents into non-public buildings without a judicial warrant. </p>\n<p><em>DEVELOPING…</em></p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/education/5757505-dhs-detainment-mamdani-trump-meeting-ice-columbia/",
            "pub_date": "2026-02-27 04:51:07",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5757345,
            "title": "Burgum: Sanders data centers moratorium would be like waving 'surrender flag' to China",
            "description": "<p>Interior Secretary Doug Burgum on Thursday slammed Sen. Bernie Sanders’s (I-Vt.) proposal for a <a href=\"https://thehill.com/policy/technology/5652830-concerns-ai-data-centers/\">national moratorium on data centers</a>, deeming the idea as an intentional “surrender” to China amid their rapid development of artificial intelligence.</p>\n<p>“A moratorium on data centers would — would be like, we might as well wave the surrender flag to China right now. I mean, it is, again — that’d be complete capitulation,” Burgum said during an appearance on Fox Business Network’s “<a href=\"https://www.foxbusiness.com/video/6389974377112\">Mornings with Maria</a>.” </p>\n<p>The Interior secretary added that “adversaries” are the only ones that want the United States to stop building data centers.</p>\n<p>“These data centers, again, they’re not a data center in the traditional sense, these are a place where you manufacture intelligence. We have to manufacture intelligence,” he added.</p>\n<p>In the war for global dominance in technology, China has remained a top sparring partner for the U.S.</p>\n<p>China is home to the world’s largest data center, the China Telecom-Inner Mongolia Information Park, which spans 10.7 million square feet. The country has also managed to produce <a href=\"https://merics.org/en/comment/china-commercializing-energy-efficient-underwater-data-centers#:~:text=China%20has%20unveiled%20the%20world's%20first%20commercial,capable%20of%20holding%20up%20to%20500%20servers\">under-sea</a> data centers to boost cooling efficiency by 40 to 60 percent, with other major data center hubs in Shanghai, Beijing, Guangzhou, Shenzhen and Chengdu.</p>\n<p>Nevada is home to the data center with among the world’s largest capacity for power. <a href=\"https://www.switch.com/tahoe-reno/\">The Citadel</a> covers 7.2 million square feet and can deliver up to 650 megawatts of power.</p>\n<p>Despite the benefits of large language models, Sanders has railed against widespread initiatives to develop data centers across the country. </p>\n<p>In a Monday <a href=\"https://www.sanders.senate.gov/press-releases/news-sanders-yes-we-need-a-moratorium-on-data-center-construction/\">statement</a>, Sanders said data centers will have a “profound impact on land and water use, and will drive up electricity costs.” </p>\n<p>“Concerns about the very real environmental impact of data centers, however, are not the only reasons to support a moratorium,” the Vermont senator said. </p>\n<p>“Let’s be clear. AI will likely have a catastrophic impact on the lives of working-class Americans, eliminating tens of millions of blue- and white-collar jobs in every sector of our economy,” he added, reiterating support for Denver’s recent citywide moratorium on data centers.</p>\n<p>President Trump on Tuesday addressed the issue of higher electricity costs associated with data centers by announcing big tech leaders’ commitment to “<a href=\"https://thehill.com/policy/energy-environment/5752778-trump-state-of-the-union-electricity-pledges-big-tech/\">rate payer protection pledges</a>,” under which companies would pay increased electricity costs in areas where <a href=\"https://thehill.com/policy/technology/5711639-trump-data-centers-consumer-impact/\">new data centers</a> are built. </p>",
            "kind": 1,
            "link": "https://thehill.com/policy/technology/5757345-interior-secretary-slams-sanders/",
            "pub_date": "2026-02-27 04:41:02",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5757150,
            "title": "Sanctioned UN human rights investigator's family sues Trump administration",
            "description": "<p>The family of a sanctioned United Nations human rights investigator on Wednesday sued the Trump administration for sanctioning her over her criticism of Israel’s military actions in Gaza, arguing that the sanctions violate her First Amendment rights.</p>\n<p>U.N. Special Rapporteur Francesca Albanese’s husband, Massimiliano Cali, filed the lawsuit in the U.S. District Court of Washington. They argued that Albanese’s work surrounding the Israeli-Palestinian conflict, along with her work with the International Criminal Court (ICC), “is core First Amendment activity.”</p>\n<p>“At its heart, this case concerns whether Defendants can sanction a person — ruining their life and the lives of their loved ones, including their citizen daughter — because Defendants disagree with their recommendations or fear their persuasiveness,” according to the filing.</p>\n<p>Cali, who filed the lawsuit on behalf of himself, Albanese and their child, also argued that the sanctions have negatively impacted their ability to access their home in Washington, D.C. Cali said his wife also lost access to her bank account and the ability to travel to the U.S.</p>\n<p>“Sanctions, used appropriately, are a powerful tool to disrupt and undermine the activities of terrorists, criminals and authoritarian regimes,” he said in the complaint. “Sanctions are abused, however, when they seek to silence disfavored points of view and to violate the constitutional rights of people the government does not like.”</p>\n<p>The lawsuit also argues that the sanctions violated her Fourth and Fifth Amendment rights in seizing her property without due process and violating sanction laws. </p>\n<p>“I have experienced enormous hardship,” Albanese told <a href=\"https://www.nytimes.com/2026/02/26/us/francesca-albanese-lawsuit-trump-sanctions-israel-gaza.html\">The New York Times</a> in an interview on Thursday, noting that her family worries about risking committing a felony by supporting her. “There is a criminalization of my motherhood and the family bonds I have.”</p>\n<p>The State Department accused Albanese of being an open supporter of “antisemitism, terrorism, and has engaged in lawfare against our nation and our interests, including against major American companies vital to the world economy.”</p>\n<p>“Our sanctions are legal and appropriate,” the department said in a statement to The Hill. “The United States will continue to condemn and oppose her biased and malicious activities, which have long made her unfit for her role. This lawsuit itself is baseless lawfare, and Albanese is a disgrace.” </p>\n<p>The Hill has reached out to the White House for comment. The Department of Justice declined to comment.</p>\n<p>Albanese has been the rapporteur for the Palestinian territories since 2022. She has long advocated for the Palestinian people in the Gaza Strip and the West Bank, and has called for holding Israeli leaders accountable. She has accused Israel of being an apartheid state and said the country has committed genocide in Gaza.</p>\n<p>In July 2025, Secretary of State Marco Rubio issued sanctions on Albanese pursuant to President Trump’s executive order sanctioning the ICC. Rubio accused Albanese of antisemitism and “open contempt for the United States, Israel, and the West.” Albanese has denied supporting terrorism and rejected that her criticism of Israel is antisemitic.</p>\n<p>“That bias has been apparent across the span of her career, including recommending that the ICC, without a legitimate basis, issue arrest warrants targeting Israeli Prime Minister Benjamin Netanyahu and former Defense Minister Yoav Gallant,” Rubio said in a <a href=\"https://www.state.gov/releases/office-of-the-spokesperson/2025/07/sanctioning-lawfare-that-targets-u-s-and-israeli-persons\">statement </a>at the time. </p>\n<p>Stéphane Dujarric, a spokesperson for U.N. Secretary-General António Guterres, slammed the sanctions as setting a “<a href=\"https://thehill.com/policy/international/5395305-united-nations-us-sanctions-francesca-albanese/\">dangerous precedent</a>.” </p>\n<p>“Special Rapporteurs do not report to the Secretary-General, and he has no authority over them or their work,” Dujarric said at the time. “That being said, Member States are perfectly entitled to their views and to disagree with the reports by the Special Rapporteurs, but we encourage them to engage with the UN human rights architecture. The use of unilateral sanctions against special rapporteurs, or any other UN expert or official is unacceptable.”</p>\n<p><em>The Associated Press contributed.</em><a href=\"https://apnews.com/world-news/israel-hamas-war-tracking-the-gaza-ceasefire\"></a></p>",
            "kind": 1,
            "link": "https://thehill.com/regulation/court-battles/5757150-albanese-lawsuit-first-amendment-trump-sanctions/",
            "pub_date": "2026-02-27 04:41:02",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5757184,
            "title": "Here are the states putting flags at half-staff for Jesse Jackson",
            "description": "<p>As mourners <a href=\"https://thehill.com/blogs/in-the-know/5743831-jesse-jackson-funeral-services/\">pay their respects</a> Thursday to the Rev. Jesse L. Jackson as he lies in state at his Rainbow PUSH Coalition’s Chicago headquarters, a number of states have lowered or will lower their flags to half-staff in honor of the <a href=\"https://thehill.com/homenews/campaign/5604376-jesse-jackson-civil-rights-leader-dies/\">deceased civil rights activist</a>.</p>\n<p>The governors of at least a dozen states, including Jackson’s birth state of <a href=\"https://governor.sc.gov/news/2026-02/reverend-jesse-jackson-sr-lie-state-south-carolina-statehouse\">South Carolina</a>, his adopted home state of <a href=\"https://www.illinois.gov/news/release.html?releaseid=32217\">Illinois</a>, <a href=\"https://www.colorado.gov/governor/news/governor-polis-orders-flags-half-staff-honor-jesse-jackson\">Colorado</a>, <a href=\"https://portal.ct.gov/governor/news/press-releases/2026/02-2026/governor-lamont-directs-flags-to-half-staff-on-march-7-in-honor-of-jesse-jackson?language=en_US\">Connecticut</a>, <a href=\"https://news.delaware.gov/2026/02/17/governor-meyer-orders-the-lowering-of-flags-to-honor-the-lives-of-george-bunting-and-john-viola-rev-jesse-jackson-2/\">Delaware</a>, <a href=\"https://www.kentucky.gov/Pages/Activity-stream.aspx?n=GovernorBeshear&amp;prId=2690\">Kentucky</a>, <a href=\"https://governor.iowa.gov/press-release/2026-02-24/gov-reynolds-orders-flags-half-staff-honor-remembrance-rev-jesse-jackson\">Iowa</a>, <a href=\"https://www.michigan.gov/whitmer/news/press-releases/2026/02/25/whitmer-lowers-flags-to-honor-rev-jesse-jackson-sr\">Michigan</a>, <a href=\"https://mn.gov/governor/newsroom/press-releases/?id=726268\">Minnesota</a>, <a href=\"https://www.governor.ny.gov/news/governor-hochul-directs-state-flags-half-staff-honor-civil-rights-leader-reverend-jesse\">New York</a>, <a href=\"https://www.doa.nc.gov/news/press-releases/2026/02/18/lowering-us-and-nc-flags-half-staff-honor-civil-rights-activist-rev-jesse-l-jackson\">North Carolina</a> and <a href=\"https://www.pa.gov/governor/newsroom/2026-press-releases/gov--shapiro-orders-flags-to-half-staff-in-honor-of-reverend-jes\">Pennsylvania</a>, ordered the lowering of state flags after his death. Some, such as New York Gov. Kathy Hochul (D) ordered it the week of his death, while others, such as Michigan Gov. Gretchen Whitmer (D), ordered flags to be lowered this week. </p>\n<p>In South Carolina, Gov. Henry McMaster (R) directed the flags atop the Statehouse be lowered to half-staff from sunrise to sunset on Mar. 2, the day Jackson will lie in state there. </p>\n<p>Jackson, 84, died earlier this month after a lengthy battle with the neurodegenerative disorder progressive supranuclear palsy. He is survived by his wife, Jacqueline Lavinia Brown, and six children: Santita Jackson, former Rep. Jesse Jackson Jr. (D-Ill.), Jonathan Luther Jackson, Yusef DuBois Jackson, Jacqueline Lavinia Jackson Jr. and Ashley Jackson. </p>\n<p>“A native son of South Carolina, and an icon of the civil rights movement, the Reverend Jesse Jackson was a prominent voice in our nation’s political and cultural dialogue,” McMaster <a href=\"https://www.facebook.com/HenryMcMaster/posts/a-native-son-of-south-carolina-and-an-icon-of-the-civil-rights-movement-the-reve/1438078651012448/\">wrote on Facebook</a> the day Jackson passed.</p>\n<p>Jackson, a mentee of the Rev. Martin Luther King Jr., was one of the preeminent leaders of the Civil Rights Movement in the 1960s. He later ran for the Democratic nomination for president in 1984 and 1988, finishing in third and second place in those primaries, respectively. </p>\n<p>His death was met with mourning from across the political spectrum, with many paying tribute to his work throughout the decades. </p>\n<p>“Yesterday, we lost a giant who spent his life on the frontlines of the Civil Rights Movement. He broke down barriers, he inspired generations and he kept hope alive,” Illinois Gov. J.B. Pritzker (D) <a href=\"https://www.facebook.com/reel/1681901792791992\">said on Feb. 18</a>. </p>\n<p>Jackson will lie in state at Rainbow PUSH headquarters Thursday and Friday, before services in South Carolina and Washington, D.C., next week, <a href=\"https://www.rainbowpush.org/reverend_jesse_louis_jackson_sr_celebration_of_life_services\">according to his coalition</a>. There will then be a celebration of life at the House of Hope in Chicago on Mar. 6, followed by homegoing services at Rainbow PUSH headquarters.</p>\n<p>“These homegoing services are welcome to all, Democrat, Republican, liberal and conservative, right-wing, left-wing because his life is broad enough to cover the full spectrum of what it means to be American,” Jesse Jackson Jr. said at a press conference last week. “We only ask people to come and be respectful in the context of the extraordinary life he lived.”</p>\n<p><em>Sarah Davis contributed reporting. </em></p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/state-watch/5757184-here-are-the-states-putting-flags-at-half-staff-for-jesse-jackson/",
            "pub_date": "2026-02-27 04:41:01",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5757028,
            "title": "Astronaut Mike Fincke reveals he was crew member with medical issue",
            "description": "<p>(<a href=\"https://www.newsnationnow.com/space/astronaut-mike-fincke-medical-issue/\">NewsNation</a>) — Astronaut <a data-id=\"https://thehill.com/homenews/ap/ap-international/ap-ailing-astronaut-returns-to-earth-early-in-nasas-first-medical-evacuation-2/\" data-type=\"link\" href=\"https://thehill.com/homenews/ap/ap-international/ap-ailing-astronaut-returns-to-earth-early-in-nasas-first-medical-evacuation-2/\">Mike Fincke</a> revealed that he had a medical event that caused the early return of the International Space Station’s (ISS) Crew-11.</p>\n<p>The mission included fellow NASA astronaut Zena Cardman, Japanese Aerospace Exploration Agency astronaut Kimiya Yui and Roscosmos cosmonaut Oleg Platonov, along with Fincke.</p>\n<p>Fincke said that he <a data-id=\"https://thehill.com/homenews/space/nasa-spacewalk-space-station/\" data-type=\"link\" href=\"https://thehill.com/homenews/space/nasa-spacewalk-space-station/\">experienced a medical event</a> while on board the ISS and was stabilized by his crewmates, working with guidance from NASA flight surgeons.</p>\n<p>NASA determined the safest course of action was to <a href=\"https://thehill.com/homenews/space/5690484-nasa-medical-evacuation-splashdown/\" rel=\"noreferrer noopener\" target=\"_blank\">bring the crew home early</a>, with the team leaving after five and a half months in space and splashing down on Earth on Jan. 15.</p>\n<p>At the time of the return, NASA did not release any information on what medical event caused the change in plans or which astronaut was affected for privacy reasons. </p>\n<p>Fincke clarified the situation was not a medical emergency but said that it was deemed best for him to return to Earth to take advantage of advanced medical imaging not accessible on the ISS.</p>\n<p>“I’m doing very well and continuing standard post-flight reconditioning at NASA’s Johnson Space Center in Houston. Spaceflight is an incredible privilege, and sometimes it reminds us just how human we are,” Fincke said. “Thank you all for your support.”</p>\n<p>Fincke did not share details about the nature of his medical event.</p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/space/5757028-nasa-astronaut-mike-fincke-medical-issue/",
            "pub_date": "2026-02-27 04:36:10",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5757113,
            "title": "Virginia Democrats in House backing redistricting proposal",
            "description": "<p>Virginia Democrats in the U.S. House are urging voters to support a constitutional amendment that would permit redistricting ahead of the midterm elections after a state judge recently imposed a <a href=\"https://thehill.com/regulation/court-battles/5747297-virginia-redistricting-referendum-blocked-tazewell-judge/\" rel=\"noreferrer noopener\" target=\"_blank\">temporarily block</a> on the referendum.</p>\n<p>The judge’s emergency injunction remains in effect until March 18, past the beginning of the early voting period starting on March 6. Final votes on this new map, which would swing up to four additional House seats in Democrats’ favor, are scheduled for April 21. </p>\n<p>The state Supreme Court previously <a href=\"https://thehill.com/homenews/campaign/5737289-democrats-redistricting-referendum-virginia/\" rel=\"noreferrer noopener\" target=\"_blank\">permitted this ballot measure</a> to move forward earlier this month amid continuing litigation after a separate <a href=\"https://thehill.com/homenews/campaign/5709183-virginia-democrats-redistricting-ruling/\" rel=\"noreferrer noopener\" target=\"_blank\">lower court blocked</a> the referendum, ruling that Democrats had defied the state’s redistricting procedures.  </p>\n<p>All six Democrats in the state’s 11-seat House delegation expressed their support for the ballot measure <a href=\"https://punchbowl.news/va-fed-delegation-joint-response/?utm_source=Sailthru&amp;utm_medium=email&amp;utm_campaign=2/26/26%20AM:&amp;utm_term=Punchbowl%20AM%20and%20Active%20Subscribers%20from%20Memberful%20Combined\" rel=\"noreferrer noopener\" target=\"_blank\">in a Thursday letter</a> published by Punchbowl News.</p>\n<p>The legislators noted that the amendment is “not a permanent change” and will expire in 2030. </p>\n<p>The group criticized new maps in states such as North Carolina and Texas, which favor Republicans, saying these changes are “part of a broader pattern” of the Trump administration acting in ways that “abuse its power and avoid accountability.”</p>\n<p>“That is the reality facing Virginia,” the legislators wrote. “As the elected representatives of communities across this Commonwealth, we cannot ignore what it means for the millions of people we serve.”</p>\n<p>The group included Virginia Democratic Reps. Bobby Scott, Don Beyer, Jennifer McClellan, Suhas Subramanyam, Eugene Vindman and James Walkinshaw. </p>\n<p>“Virginians now face a choice: do nothing while our voice in Congress is overridden by the schemes in MAGA-controlled states, or respond with a temporary, voter-approved step to level the playing field and ensure the nationwide map is not structurally rigged ahead of the 2026 election,” the group wrote. </p>\n<p>The amendment has received pushback from GOP representatives, who currently fill five seats in the state’s congressional delegation. </p>\n<p>Rep. Robert Wittman (R-Va.), whose district would be impacted by changes in the new Democratic-drawn maps, has <a href=\"https://punchbowl.news/article/house/wittman-spanberger/\" rel=\"noreferrer noopener\" target=\"_blank\">previously clashed</a> with Democratic state officials over this issue. </p>\n<p>During a delegation meeting at the end of last year, the representative challenged Gov. Abigail Spanberger (D), who was governor-elect at the time, calling the redistricting move “unconstitutional.”</p>\n<p>The Virginia ballot measure comes as several other states seek to make changes to their congressional maps. <a href=\"https://thehill.com/homenews/state-watch/5579923-prop-50-california-congressional-maps/\" rel=\"noreferrer noopener\" target=\"_blank\">Proposition 50</a> won voters’ support in a major win for Democrats in California last November.</p>\n<p>Additionally, Rep. Nancy Pelosi (D-Calif.) and House Minority Leader Hakeem Jeffries (D-N.Y.) have pushed for Maryland’s state delegation to pursue redistricting efforts <a href=\"https://thehill.com/homenews/5743923-jeffries-maryland-senate-redistricting-bill-ferguson/\" rel=\"noreferrer noopener\" target=\"_blank\">over the opposition</a> of the state senate’s Democratic leader.</p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/house/5757113-redistricting-amendment-virginia-democrats/",
            "pub_date": "2026-02-27 04:36:10",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5757271,
            "title": "Walz unveils anti-fraud package after Trump administration freezes Minnesota Medicaid funds",
            "description": "<p>Minnesota Gov. Tim Walz (D) on Thursday unveiled a <a href=\"https://content.govdelivery.com/attachments/MNGOV/2026/02/26/file_attachments/3566317/Anti-Fraud%20Fact%20Sheet.pdf\">legislative package</a> intended to mitigate fraud a day after the Trump administration <a href=\"https://thehill.com/policy/healthcare/5755651-vance-oz-minnesota-medicaid-funds-fraud/\">paused</a> $259.5 million in Medicaid funds for the North Star State. </p>\n<p>Walz’s package would create a new statute that increases penalties for public fraud by 20 percent and extends statutes of limitations to seven years for certain fraud-related crimes.</p>\n<p>It also establishes an Office of Inspector General aimed at statewide fraud prevention in the wake of a $250 million fraud scheme where the nonprofit Feeding Our Future falsely claimed to be providing meals to thousands of schoolchildren with federal funds.</p>\n<p>During a Thursday press conference, Walz addressed the Trump administration’s decision to pull back Medicaid funds amid concerns of rampant fraud.</p>\n<p>“How does taking and punishing children and elderly have anything to do with fighting fraud when that’s not where this issue is taking place?” Walz said. </p>\n<p>The Minnesota governor, who campaigned as the Democratic vice presidential nominee in 2024, suggested the funding rollback was tied to political retribution and deemed the administration’s attempt to lower the rate of scams as “absolutely not serious.”</p>\n<p>“If you’re serious about fighting fraud, you can help us work on this package, get this package passed,” Walz told reporters after previously citing the state’s Medicaid <a href=\"https://mn.gov/dhs/assets/2025-medicaid-error-notification_tcm1053-720555.pdf\">error rates</a>, which sit at 2.1 percent.</p>\n<p>The <a href=\"https://www.cms.gov/newsroom/fact-sheets/fiscal-year-2025-improper-payments-fact-sheet\">national average</a> was recently over 6 percent.</p>\n<p>On Thursday, Walz said he believes Minnesota has met all the requirements outlined by the Trump administration to unfreeze Medicaid funds, noting that cuts will be “devastating” for veterans, families with young kids, individuals with disabilities and working people.</p>\n<p>Walz is set to tesitify before House Oversight Committee on Wednesday on the general subject of fraud.</p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/state-watch/5757271-walz-unveils-anti-fraud-package-after-trump-administration-freezes-minnesota-medicaid-funds/",
            "pub_date": "2026-02-27 04:21:06",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5757071,
            "title": "Reconciliation bill subsidizes fossil fuels by $3.5B each year, Democratic report finds",
            "description": "<p>Republicans’ One Big Beautiful Bill Act subsidizes fossil fuels by an average of $3.5 billion each year, according to a new report from Senate Budget Committee Democrats.</p>\n<p><a href=\"https://www.budget.senate.gov/imo/media/doc/report_one_big_fossil_fuel_handout_republicans_further_subsidize_the_dirty_fossil_fuel_industry.pdf\" rel=\"noreferrer noopener\" target=\"_blank\">An analysis</a> that was <a href=\"https://www.jct.gov/publications/2025/jcx-35-25/\" rel=\"noreferrer noopener\" target=\"_blank\">first shared</a> with The Hill <a href=\"https://www.cbo.gov/publication/61570\" rel=\"noreferrer noopener\" target=\"_blank\">tabulated both</a> official <a href=\"https://www.resources.org/common-resources/if-then-new-cuts-to-oil-and-gas-royalty-rates-in-budget-reconciliation-will-reduce-federal-revenues/\" rel=\"noreferrer noopener\" target=\"_blank\">and unofficial</a> estimates of <a href=\"https://oilchange.org/publications/paying-for-climate-chaos-us-subsidies-fossil-fuels/\" rel=\"noreferrer noopener\" target=\"_blank\">the impacts</a> of the bill’s <a href=\"https://thehill.com/policy/energy-environment/5382468-gop-megabill-fossil-fuels-climate-change-green-energy-tax-credits/\" rel=\"noreferrer noopener\" target=\"_blank\">pro-fossil fuel policies</a> and averaged them over a 10-year period.</p>\n<p>The report only looks at provisions that specifically help the fossil fuel industry and does not include <a href=\"https://thehill.com/business/5381924-trump-tax-cuts-bill-breakdown/\" rel=\"noreferrer noopener\" target=\"_blank\">general corporate tax cuts</a> that are likely to bolster those firms as well as others.</p>\n<p>It points to industry savings from tax breaks, fee reductions for producing fuels on public lands and in public waters and funding for the industry, among other policies.</p>\n<p>Sen. Jeff Merkley (D-Ore.) argued that the measure, which President Trump <a data-id=\"https://thehill.com/homenews/administration/5384512-trump-signs-big-beautiful-bill/\" data-type=\"link\" href=\"https://thehill.com/homenews/administration/5384512-trump-signs-big-beautiful-bill/\" rel=\"noreferrer noopener\" target=\"_blank\">signed into law in July</a>, prioritizes corporations, including fossil fuel companies, over everyday Americans.</p>\n<p>“In 2024, Donald Trump stood before a room of wealthy oil executives and promised to protect their interests if they spent $1 billion to help elect him. He has now upheld his end of the bargain — slashing health care and food assistance for struggling families in the Republicans’ Big, Ugly Betrayal bill to deliver a massive $3.5 billion tax giveaway per year to the fossil fuel industry,” Merkley, the top Democrat on the Senate Budget Committee, said in a written statement. </p>\n<p>“President Trump and Republicans are handing billions of dollars to the corporations responsible for poisoning our planet and profiting off the cost-of-living crisis facing hardworking Americans,” he added.</p>\n<p>Republicans have argued that the bill will bolster the economy.</p>\n<p>“This bill will fuel massive economic growth,” Trump said upon signing it, specifically touting its help for coal.</p>\n<p>Reached for comment on the Democrats’ report, White House spokesperson Taylor Rogers touted the administration’s pro-fossil fuel policies.</p>\n<p>“Thanks to President Trump’s energy dominance agenda, American oil production has hit record highs and gas prices are at multi-year lows. After four years of Democrats waging war on America’s energy independence, the President has stopped costly and unpopular Green New Scam handouts while delivering on his promises to unleash American energy,” Rogers said. </p>\n<p>“President Trump is protecting our national security by boosting our domestic fossil fuel production to reduce our dependence on foreign adversaries, secure our vital supply chains, and ensure we have the necessary resources to meet both our energy and defense needs,” she added.</p>\n<p>The White House also noted that the fossil fuel spending pales in comparison to green subsidies that were passed as part of the Democrats’ Inflation Reduction Act. The 2022 Democratic bill included a total of <u><a href=\"https://earthjustice.org/article/the-biggest-climate-spending-bill-ever-just-turned-two-heres-what-it-has-achieved\" rel=\"noreferrer noopener\" target=\"_blank\">$391 billion</a></u> over 10 years for low-carbon energy and other efforts to combat climate change.</p>\n<p>The new report highlights estimates from authorities such as Congress’s Joint Committee on Taxation. It points to the joint committee’s estimate that the bill’s increase in tax credits for sequestering and using carbon dioxide to pump more oil could be worth a total of $14.2 billion over 10 years. </p>\n<p>It also points to an estimate from climate think tank Resources For the Future that reductions in royalties for producing oil and gas on public lands and in public waters will <a href=\"https://www.resources.org/common-resources/if-then-new-cuts-to-oil-and-gas-royalty-rates-in-budget-reconciliation-will-reduce-federal-revenues/\" rel=\"noreferrer noopener\" target=\"_blank\">save the industry</a> billions more. The estimate finds that federal revenues will be cut by $6 billion over 10 years.</p>\n<p>The Democrats extrapolate that this means a total of $12 billion in savings, as revenues are split between states and the federal government, though the think tank’s own estimates of state losses appear to be a bit lower.</p>\n<p>It also highlights estimates of the cost of policies like the $1.5 billion in <a href=\"https://thehill.com/policy/energy-environment/5378898-gop-megabill-coal-subsidy-steel-trump/\" rel=\"noreferrer noopener\" target=\"_blank\">tax credits for coal</a>.</p>\n<p>The One Big Beautiful Bill Act, Trump’s signature economic policy legislation, was passed with only Republican support last year. It cut taxes, axed subsidies for renewable energy and tightened requirements for <a href=\"https://www.google.com/search?q=site%3AThehill.com+what%27s+in+the+big+beautiful+bill&amp;oq=site%3AThehill.com+what%27s+in+the+big+beautiful+bill&amp;gs_lcrp=EgZjaHJvbWUyBggAEEUYOTIGCAEQRRg60gEINzAxNGowajGoAgCwAgA&amp;sourceid=chrome&amp;ie=UTF-8&amp;sei=t5agaaybMcit5NoP9tTs-Qc\" rel=\"noreferrer noopener\" target=\"_blank\">Medicaid and SNAP recipients</a>.</p>",
            "kind": 1,
            "link": "https://thehill.com/policy/energy-environment/5757071-big-beautiful-bill-fossil-fuels/",
            "pub_date": "2026-02-27 04:15:56",
            "source": "thehill",
            "language": "en"
        }
    ]
}