{
    "data": [
        {
            "id": 5125938,
            "title": "Left-leaning physicians group sues over federal websites scrubbing health information",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>The physicians’ advocacy group Doctors for America is suing federal agencies for removing information from their websites that health care professionals and researchers regularly use.</p>\n<p>The left-leaning nonprofit group filed its lawsuit in the U.S. District Court of D.C. It is suing the Office of Personnel Management (OPM), the Centers for Disease Control and Prevention (CDC), the Food and Drug Administration (FDA) and the Department of Health and Human Services (HHS).</p>\n\n<p>Public Citizen Litigation Group is representing the organization.</p>\n<p>After President Trump signed an executive order stating that the U.S. will only <a href=\"https://thehill.com/homenews/administration/5097278-trump-executive-order-gender-transition/\">recognize two sexes</a>, federal health agencies began scrubbing their websites of materials which the executive order said “promote gender ideology.” </p>\n<p>This led to some websites erroneously being taken down as federal employees scrambled to comply with the order, with several web pages focusing on HIV/AIDS temporarily being taken down.</p>\n<p>The complaint states, “The removal of the webpages and datasets creates a dangerous gap in the scientific data available to monitor and respond to disease outbreaks, deprives physicians of resources that guide clinical practice, and takes away key resources for communicating and engaging with patients.”</p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>The suit cited several key websites that have been taken down since Trump’s “gender ideology” executive order was issued, including the Youth Risk Behavioral Surveillance System, the data and statistics webpage for Adolescent and School Health and the webpages for the Social Vulnerability Index.</p>\n<p>“These federal agencies exist to serve the American people by protecting public health,” said Zach Shelley, Public Citizen Litigation Group attorney and lead counsel on the case. “Removing this vital information flouts that mandate. Our lawsuit seeks to hold them to their responsibilities to the people of this country.”</p>\n\n<p>Several websites that provide guidance on prescribing PrEP for HIV and monitoring for the disease were further cited as key resources that U.S. physicians look to that have been taken down.</p>\n<p>“Like many of my colleagues, I am both a doctor who takes care of patients and a researcher. Removing critical clinical information and datasets from the websites of CDC, FDA, and HHS not only puts the health of our patients at risk, but also endangers research that improves the health and health care of the American public,” said Reshma Ramachandran, a member of the Doctors for America board of directors.</p>\n<p>Doctors for America is alleging three counts against OPM, the CDC, HHS and the FDA. It alleges OPM’s actions have exceeded its legal authority; that both the CDC and HHS have violated the Paperwork Reduction Act and the Administrative Procedure Act (APA); and that the FDA also violated the APA.</p>\n<p>The group is asking that a federal judge declare the agencies’ actions to be unlawful and that the agencies restore the webpages and datasets which have been taken down.</p>\n<p>The Hill has reached out to the federal agencies named in the lawsuit for comment.</p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/homenews/5125938-doctors-for-america-lawsuit-federal-agencies-health-information-websites/",
            "pub_date": "2025-02-05 04:35:48",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5125957,
            "title": "DEI leaders scramble to counter Trump actions",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>Diversity, equity and inclusion (DEI) proponents are scrambling to find ways to counter President Trump as he moves to dismantle some of the programs and policies intended to bolster their movement.</p>\n<p>Trump has signed multiple executive orders aimed at terminating DEI efforts in the federal government, including the military, and most recently took aim at DEI following the fatal plane crash at Reagan National Airport.</p>\n\n<p>Now Democrats and others who see DEI as essential to maintaining diversity in the ranks of government and other sectors are struggling to find ways to combat the administration’s aggressive tactics.</p>\n<p>“It is restoring barriers to equality, to opportunity and to access. When you take those things out, you are undermining the ability of the government … and you are ensuring that there is discrimination, that there is unfairness, that there is inequality,” Andrea Abrams, executive director of American Pride Rises (APR), told The Hill.</p>\n<p>Trump and Republicans have argued DEI is a discriminatory practice that wrongfully employs minorities while overlooking qualified candidates. </p>\n<p>In his inauguration speech, Trump said his administration would “forge a society that is colorblind and merit-based.” He doubled down on this in his executive orders, where he labeled “so-called” DEI programs “dangerous, demeaning, and immoral race- and sex-based preferences.”</p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>Advocates have pushed back on such assertions, instead saying the role of DEI is to help hedge discriminatory practices and outcomes toward protected communities noted under equal employment opportunity policies.</p>\n<p>“The objective of these programs is to try and mitigate some of the still rampant, ongoing discrimination that’s faced by people from certain communities,” said Dante King, an author and DEI proponent.</p>\n\n<p>King added that the backlash to DEI, though years in the making, stems from the last decade of gains Black Americans have witnessed, including the elections of former President Obama and Vice President Harris and the appointment of Supreme Court Justice Ketanji Brown Jackson. </p>\n<p>“I think that there is a lot of white backlash because who we see as once being enslaved have been able to ascend to a position of influence and prominence, to be able to hold this white man — this famous, very rich, wealthy white man — accountable,” King said. “Black people were brought here as subjects of America, and it was never intended that we would hold any other types of positions. And so one of the things that I’ve been saying is that white people are okay with the racial diversity as long as it is in the context of subjugation and inferiority.”</p>\n<p>Advocates often point to <a href=\"https://dei360.org/diversity-as-a-revenue-engine-what-16-studies-reveal/\" rel=\"noreferrer noopener\" target=\"_blank\">numerous studies that have</a> shown that companies profit from DEI programs both culturally and economically.  They have also been working to remind employers that Trump’s orders cannot supersede federal law. </p>\n<div class=\"civic-science-article-container civic-science-more-14 civic-is-mr3\" data-civicscience-widget=\"3f127ebd-287e-0b64-a901-d55ec286348a\" id=\"civsci-id-civsci-id-596708068\"></div>\n<p>As advocates work to spread this message, they’ve also stepped up their legal challenges to Trump. </p>\n<p>On Monday, groups representing university diversity officers and professors, restaurant workers and Baltimore city officials filed a lawsuit against Trump and multiple federal agencies in the US District Court for the District of Maryland.</p>\n<p>The suit claims Trump’s order is too vague and threatens First Amendment and due process rights. </p>\n\n<p>“These executive orders are political theater, but they’re also really dangerous because they attempt to undermine existing law,” said Alphonso David, president and CEO of the Global Black Economic Forum. </p>\n<p>Trump, he added, “is trying to redefine race and its troubled relationship with this country, and he’s trying to ignore that systemic discrimination exists.”</p>\n<p>The White House defended its approach to DEI in a statement.</p>\n\n<p>“Minorities in America have recognized the Democrat Party’s empty promises and failed policies,” said Harrison Fields, principal deputy press secretary at the White House. “That’s why President Trump earned historic support from Black, Latino, Asian, and Arab Americans by prioritizing secure borders, economic opportunity, and an America First foreign policy. Meanwhile, the Left’s divisive focus on DEI policies undermines decades of progress toward true equality. The Trump administration rejects this backward thinking and will pursue an agenda that lifts everyone up with the chance to achieve the American Dream.”</p>\n<p>Davids said legislators must focus on strengthening those laws rather than introducing new bills.</p>\n<p>“This is not about advancing new policies. This is about complying with existing ones,” he said, emphasizing that it is still illegal for employers to discriminate on the basis of race, sex, ethnicity or disability. </p>\n\n<p>But lawmakers have to make sure their work is reaching more than just the streets of D.C., said democratic strategist Antjuan Seawright.</p>\n<p>“I think it will be malpractice to centralize this fight geographically to Washington,” said Seawright. Instead, he said, legislators have to make sure they’re educating Americans around the nation of the work they are doing, especially as 2026 midterm campaigning gets underway.</p>\n<p>“Throughout our history, particularly as Black Americans, Washington has never been the only battlefield we’ve had to fight on,” Seawright said. “We have to hyper-localize these discussions and fights because they’re taking place not just in Washington but all over the country.”</p>\n\n<p>Seawright added that the work to protect DEI cannot rest only upon Black legislators, such as the Congressional Black Caucus, if Democrats want to ensure change. </p>\n<p>“The CBC has always been on the front line pushing the envelope for change, so that won’t change, but we have to be careful making this just a CBC fight, because CBC represents more than just Black Americans, they represent all Americans from all walks of life,” Seawright said. </p>\n<p>“This has to be a broader fight. I think the CBC, the CHC and the Asian American Pacific Islander caucus, and every other community caucus has just as much of a responsibility to lead the fight on this.” </p>\n\n<p>In some ways, Seawright added, Republicans have to stand up to the president as well. </p>\n<p>“This impacts all of us, because every American has benefited in some way, shape or form, from the fertilization of diversity, equity and inclusion to the American soil,” said Seawright. </p>\n<p>Abrams, of APR, added that corporations have to take a stance as well.</p>\n<p>Meta, McDonalds, Walmart, Lowe’s and Target are all among a plethora of corporations to announce they would no longer continue their DEI programs.</p>\n<p>“They want to back down publicly while continuing to do these things quietly, because they know it works,” Abrams said. “We need to demand that these corporations stop trying to have it both ways, stop trying to continue to benefit from DEI behind closed doors. If you’re going to benefit from, then you have a responsibility to stand up in this moment and not to be bullied.”</p>\n<p>It will fall on consumers rather than politicians, Abrams added, to hold these corporations accountable. </p>\n<p>“This is not a moment where we need to panic and feel overwhelmed, but we have to remember what has come before, where we are right now, how much power we actually do have,” Abrams said. </p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/homenews/race-politics/5125957-trump-attacks-dei/",
            "pub_date": "2025-02-05 04:31:01",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5126002,
            "title": "GOP senator: USAID vital to countering China’s efforts in Africa, South America",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>Sen. Roger Wicker (R-Miss.) expressed skepticism about the Trump administration’s efforts to fold the U.S. Agency for International Development (USAID) into the State Department, saying it is central to combatting China’s growing influence.</p>\n<p>“I have felt for a long time that USAID is, is our way to combat the Belt and Road Initiative, which is China’s effort to really gain influence around the world, including Africa and South America in the Western Hemisphere,” Wicker told reporters Tuesday, in comments <a data-id=\"https://www.mediaite.com/politics/republican-senator-argues-usaid-is-essential-to-combat-china-globally-as-elon-musk-guts-the-agency/\" data-type=\"link\" href=\"https://www.mediaite.com/politics/republican-senator-argues-usaid-is-essential-to-combat-china-globally-as-elon-musk-guts-the-agency/\" rel=\"noreferrer noopener\" target=\"_blank\">highlighted by Mediaite</a>.</p>\n\n<p>“So we need an aid program to match the Chinese effort, but it needs to be done in a way that the policymakers of the United States have decided ought to be done. And so I’m eager to see an audit and see the sort of mismanagement that the secretary of State has told us about today.”</p>\n<p>Asked by a reporter about Congress not being notified of changes at USAID, he said he needed more time to ask questions to gain a clear understanding of President Trump and Elon Musk’s vision.</p>\n<p>“Well, things are moving very fast in these the first two weeks of the administration. It is something that … that I had not been notified about. But again, this is just foreign relations and appropriations,” he said. “And I would not necessarily have been notified. But we check again. Things are happening fast. And we’re we’re going to find out a lot more. There’s good communication.”</p>\n<p>“And I would not necessarily have been notified. But we check again. Things are happening fast. And we’re we’re going to find out a lot more. There’s good communication.”</p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>Congressional Research Service <a data-id=\"https://thehill.com/homenews/administration/5125050-trump-does-not-have-the-authority-to-abolish-usaid-congressional-research-service/\" data-type=\"link\" href=\"https://thehill.com/homenews/administration/5125050-trump-does-not-have-the-authority-to-abolish-usaid-congressional-research-service/\" rel=\"noreferrer noopener\" target=\"_blank\">has joined</a> many Democrats in saying Trump does not have the authority to close the agency, while others remain concerned about misappropriated funds supporting initiatives across the globe.</p>\n<p>“They have basically evolved into an agency that believes that they’re not even a U.S. government agency, that they are out — they’re a global charity, that they take the taxpayer money, and they spend it as a global charity irrespective of whether it is in the national interest or not in the national interest,” Secretary of State Marco Rubio said <a data-id=\"https://thehill.com/policy/international/5124933-marco-rubio-usaid-overhaul-rank-insubordination/\" data-type=\"link\" href=\"https://thehill.com/policy/international/5124933-marco-rubio-usaid-overhaul-rank-insubordination/\" rel=\"noreferrer noopener\" target=\"_blank\">in an interview</a> with Fox News.</p>\n\n<p>“If there’s massive fraud, if the funds aren’t being directed where the Congress has appropriated and the president signed, we need to know about that,” Wicker told the reporters. </p>\n<p>It’s unclear how congressional committees plan to move forward amid the swift efforts to restructure USAID. </p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/homenews/senate/5126002-roger-wicker-usaid-china-influence/",
            "pub_date": "2025-02-05 04:25:50",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5126273,
            "title": "Senate preparing to move first on budget package amid House stalemate",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>Senate Budget Committee Chair Lindsey Graham (R-S.C.) will brief Republican senators Wednesday about moving first on a budget resolution to lay the groundwork for a package focused on border security, energy and defense that could pass the Senate with a simple majority while House Republicans remain deadlocked on how to move forward.</p>\n<p>Graham and other Republican senators are eager to get started on phase one of Trump’s agenda by moving a budget reconciliation package that would include about $100 billion in funding to secure the U.S.-Mexico border, reforms to expand oil and gas drilling and a substantial plus-up in defense spending.</p>\n\n<p>Their plan would move legislation to extend the expiring 2017 tax cuts in a second budget reconciliation package later this year.</p>\n<p>Senate Republican Whip John Barrasso (R-Wyo.) said that House Republicans “right now” are “not able to move at the level we’d like them to move.”</p>\n<p>“We do have a bill ready to go here and Sen. Graham is going to be briefing the conference on that tomorrow at lunch,” Barrasso.</p>\n<p>House Republicans this week were <a href=\"https://thehill.com/homenews/house/5124454-gop-trump-agenda-vote-delay/\" rel=\"noreferrer noopener\" target=\"_blank\">forced to delay an initial vote</a> on their version of the legislation amid jockeying among Republicans over how deep the spending cuts it should include.</p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>Barrasso said Senate Republicans will head to Florida this weekend and will meet with President Trump Friday night to gauge his interest in the Senate moving before the House on a budget reconciliation package to enact at least half of his legislative agenda.</p>\n<p>He said GOP senators will “see if he’d like us to move forward” on a package focused on border security, energy and defense.</p>\n\n<p>The Wyoming senator said Graham will update GOP colleagues “on where he is in terms of putting together the budget for the reconciliation.”</p>\n<p>“What he’s been working on, of course, is … the immediacy of border security, energy security, defense, national security. Those parts of things,” he said.</p>\n<p>Speaker Mike Johnson (R-La.), however, told reporters Tuesday afternoon that the plan is still for the House, not the Senate, to move forward on a budget package that would encompass border security, energy, defense and tax legislation.</p>\n<div class=\"civic-science-article-container civic-science-more-14 civic-is-mr3\" data-civicscience-widget=\"3f127ebd-287e-0b64-a901-d55ec286348a\" id=\"civsci-id-civsci-id-596708068\"></div>\n<p>“The Senate will not take the lead. We’ll take the lead. We’re right on schedule,” he said.</p>\n<p>Johnson noted that he will meet with Republican members of the House Budget Committee Tuesday evening to discuss a path forward.</p>\n<p>“It’s not yet determined whether we’ll be marking up this week or not,” he said. “We’re having an important meeting tonight with key figures on the committee and others to sort through it. But this is the deliberative process.”</p>\n\n<p>“We’re well within the margins of time that we have to work on and I’m very optimistic about it. We’ve made a lot of progress,” he said.</p>\n<p>A source familiar with the House schedule told The Hill Tuesday that the budget resolution would be delayed in the House.</p>\n<p>“There will not be a budget resolution markup this week,” the source said. “Leadership provided an ambitious timeline, and the House is doing the best it can to meet that.”</p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/homenews/senate/5126273-senate-budget-package-house-stalemate/",
            "pub_date": "2025-02-05 04:16:02",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5126204,
            "title": "Democrats call for investigation into Musk access of Treasury payment systems",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>Two Senate Democrats called for an investigation Tuesday into tech billionaire Elon Musk’s access of Department of Treasury payment systems.</p>\n<p>“We write to ask that the Government Accountability Office (GAO) conduct an investigation of reports indicating that Treasury Secretary Scott Bessent granted Elon Musk and other ‘Department of Government Efficiency’ employees unprecedented access to the federal government’s payment systems on January 31, 2025,” a <a href=\"https://www.banking.senate.gov/imo/media/doc/letter_to_gao_on_musk_and_treasury.pdf\">letter from</a> Sens. Ron Wyden (D-Ore.) and Elizabeth Warren (D-Mass.) to the Government Accountability Office’s (GAO) head Gene Dodaro reads.</p>\n\n<p>“These reports are deeply troubling. These critical systems process trillions of dollars of transactions each year and contain sensitive personal and financial information for tens of millions of Americans,” Wyden and Warren continued.</p>\n<p>David Lebryk, a top Treasury Department nonpolitical career official, <a href=\"https://thehill.com/homenews/administration/5119996-david-lebryk-retirement-treasury-doge-musk/\">retired at the end of last </a>week in the wake of him butting heads with Musk allies on government payment systems, a source previously told The Hill. </p>\n<p>Lebryk’s retirement followed a clash over a request from Musk’s Department of Government Efficiency (DOGE) for access to a payment system used by Treasury officials to disburse funds.</p>\n<p>Warren <a href=\"https://thehill.com/policy/technology/5123220-elizabeth-warren-letter-treasury-secretary/\">also sent a letter</a> to Treasury Secretary Scott Bessent on Monday pushing to know what access Musk had been given to the federal payments system, as well as safeguards put in place to guard Americans’ private data and prevent abuses.</p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>“In addition, the access provided to Mr. Musk and his team has important privacy implications for millions of Americans,” the Oregon and Massachusetts Democrats said. “The Treasury payment systems include ‘sensitive personal information about the millions of Americans who receive Social Security checks, tax refunds and other payments from the federal government.’ It is not clear why these individuals were granted unfettered access to such data, what they could do with it once inside these systems.”</p>\n<p>The Hill has reached out to the White House, the GAO and the Treasury Department for comment.</p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/homenews/senate/5126204-democrats-call-for-investigation-into-musk-access-of-treasury-payment-systems/",
            "pub_date": "2025-02-05 04:10:52",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5124487,
            "title": "Project 2025’s World Bank plan would backfire on America",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>Project 2025’s call for U.S. <a href=\"https://www.devex.com/news/devex-newswire-trump-wastes-no-time-on-foreign-aid-climate-and-health-109083\">withdrawal from the World Bank</a> threatens to hand America’s competitors a historic victory. While the blueprint correctly diagnoses the bank’s inefficiencies, its prescription would be catastrophic for U.S. interests. </p>\n<p>Having moved from World Bank leadership to private sector corporate affairs, I can attest that it needs urgent reform — but abandoning it would be a strategic blunder of the highest order.</p>\n\n<p>The World Bank, for all its faults, remains America’s most powerful tool for global development leadership. When I led health reforms in countries from Armenia to Romania, I saw firsthand how its technical expertise and convening power advanced both development goals and American interests. In almost every case, countries chose the World Bank over other partners because of its unique ability to mobilize resources and expertise at scale.</p>\n<p>However, Project 2025’s criticism isn’t entirely wrong. The bank’s operating model desperately needs modernization. Drawing from my private sector experience, three market-based reforms could transform the institution’s effectiveness while preserving American leadership.</p>\n<p>First, revolutionize the workforce strategy. While private sector companies embrace flexible contracting to match staffing with evolving needs, the World Bank remains wedded to lifetime tenure for most positions. This rigidity wastes resources and stifles innovation. The bank should adopt private sector-style staffing models that prioritize impact over job security, while maintaining core institutional knowledge.</p>\n<p>Second, implement systematic market segmentation. The World Bank’s current country-by-country approach to defining priorities is inefficient and often politically driven. Instead, it should develop a comprehensive market taxonomy — similar to how private companies segment markets — to determine where and how to invest resources. This would prevent the wasteful tendency to try everything everywhere and enable more strategic resource allocation.</p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>Third, rationalize the development finance landscape. Multiple agencies offering similar services with different terms creates inefficiency and enables “double-dipping” by borrowers. The U.S. should lead efforts to coordinate development partners and establish clear divisions of labor, similar to how private sector companies form strategic alliances to maximize impact.</p>\n<p>Critics might argue these reforms are too difficult to implement in a multilateral institution. But the alternative — U.S. withdrawal — would create a dangerous vacuum. China, through initiatives like the <a href=\"https://crsreports.congress.gov/product/pdf/IF/IF10154/17\" rel=\"noreferrer noopener\" target=\"_blank\">Asian Infrastructure Investment Bank</a> and the <a href=\"https://www.cfr.org/backgrounder/chinas-massive-belt-and-road-initiative\" rel=\"noreferrer noopener\" target=\"_blank\">Belt and Road Initiative</a>, stands ready to fill any void left by American retreat. The resulting loss of U.S. influence would far outweigh any short-term savings from withdrawal.</p><!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://thehill.com/submitting-opinion-content/\"><img alt=\"\" class=\"wp-image-4329764\" decoding=\"async\" height=\"121\" loading=\"lazy\" sizes=\"(max-width: 899px) 100vw, 600px\" src=\"https://thehill.com/wp-content/uploads/sites/2/2023/11/op2.png?w=600\" srcset=\"https://thehill.com/wp-content/uploads/sites/2/2023/11/op2.png?resize=600,121 600w, https://thehill.com/wp-content/uploads/sites/2/2023/11/op2.png?resize=300,61 300w, https://thehill.com/wp-content/uploads/sites/2/2023/11/op2.png?resize=50,10 50w\" width=\"600\"/></a></figure>\n\n<p>The new administration, currently debating World Bank funding, should instead use America’s position as the bank’s largest shareholder to drive these reforms. By modernizing the World Bank rather than abandoning it, the U.S. can maintain its global leadership while ensuring development dollars deliver maximum impact.</p>\n<p>The World Bank isn’t perfect, but it’s an invaluable instrument of American soft power and global development. The solution isn’t to destroy it, but to transform it. In an era of intensifying great power competition, that’s not just good development policy — it’s smart foreign policy.</p>\n<p><em>Dr. Adanna Chukwuma is a physician and development strategist with leadership experience in the World Bank and Fortune 500 companies. She holds degrees from Oxford and Harvard Universities and is a fellow of the OpEd Project.</em></p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/opinion/5124487-world-bank-reform-strategic/",
            "pub_date": "2025-02-05 04:01:06",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5124446,
            "title": "Live updates: Senate panels advance Gabbard, RFK Jr.; federal employees sue over Trump moves",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>Senate panels on Tuesday advanced the nominations of Tulsi Gabbard to be director of national intelligence and Robert F. Kennedy to lead the Department of Health and Human Services.</p>\n<p>Both votes were strictly along party-lines, but likely pave the way for two of President Trump’s most controversial nominees to be confirmed.</p>\n\n<p>Also on Tuesday, federal employees filed a number of lawsuits against Trump moves.</p>\n<p>Two Office of Personnel Management (OPM) employees are <a href=\"https://thehill.com/homenews/administration/5126073-opm-email-system-battle/?tbref=hp\" rel=\"noreferrer noopener\" target=\"_blank\">asking a court to block the agency</a> from using computer systems and emails connected with its buyout offers to federal employees.</p>\n<p>And 16 current agents are suing the FBI and the Department of Justice (DOJ), saying their review of those who worked on the cases of some 1,500 Jan. 6 defendants is a preparation to retaliate against agents.</p>\n<p>Also, Benjamin Netanyahu is in Washington meeting with President Trump about a future for Gaza.</p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>Read on for updates on these stories and more.</p>\n<div class=\"5124446\" id=\"wpcom-liveblog-container\"></div>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/homenews/administration/trumps-first-100-days/5124446-live-updates-gabbard-rfk-jr-usaid-trump-house-senate/mlite/",
            "pub_date": "2025-02-05 03:55:49",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5126182,
            "title": "Trump to sign executive order banning transgender athletes from women’s sports",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>President Trump is expected to sign an executive order Wednesday <a data-id=\"https://thehill.com/homenews/campaign/4936727-trump-bans-transgender-athletes/\" data-type=\"link\" href=\"https://thehill.com/homenews/campaign/4936727-trump-bans-transgender-athletes/\">banning transgender athletes</a> from competing in girls’ and women’s sports, the latest in a <a data-id=\"https://thehill.com/homenews/administration/5093503-trump-executive-orders-incoming/\" data-type=\"link\" href=\"https://thehill.com/homenews/administration/5093503-trump-executive-orders-incoming/\">string of executive actions </a>from the new administration to take aim at LGBTQ rights. </p>\n<p>The order, which Trump is expected to sign Wednesday afternoon, coincides with National Girls and Women in Sports Day, which is recognized annually in February to celebrate the accomplishments of female athletes. The Women’s Sports Foundation, which co-founded National Girls and Women in Sports Day in 1987, has <a href=\"https://www.womenssportsfoundation.org/media_statement/wsf-statement-in-response-to-the-department-of-educations-notice-of-proposed-rulemaking/\">opposed categorical bans</a> on transgender athletes, claiming such policies “limit opportunities and harm the development of both cisgender and transgender girls and women.” </p>\n\n<p>The organization did not immediately return a request for comment on Trump’s forthcoming order. </p>\n<p>On the campaign trail, Trump promised repeatedly to <a data-id=\"https://thehill.com/homenews/ap/ap-business/ap-trump-orders-reflect-his-promises-to-roll-back-transgender-protections-and-end-dei-programs/\" data-type=\"link\" href=\"https://thehill.com/homenews/ap/ap-business/ap-trump-orders-reflect-his-promises-to-roll-back-transgender-protections-and-end-dei-programs/\">ban transgender athletes from sports</a> if he were reelected. During a town hall event in Georgia in October, Trump signaled he would do so through an executive order. </p>\n<p>“The president bans it,” Trump said in response to a question about how he would handle “the transgender issue” in women’s sports. “You just don’t let it happen. Not a big deal.” </p>\n<p>Most Americans believe transgender athletes should not be allowed to compete on sports teams that match their gender identity, <a href=\"https://news.gallup.com/poll/507023/say-birth-gender-dictate-sports-participation.aspx\">a 2023 Gallup poll found</a>. According to <a href=\"https://apnews.com/projects/election-results-2024/votecast/\">AP VoteCast</a>, a survey of 120,000 voters nationwide, more than half of voters in the 2024 elections — including a majority of Trump voters — said support for trans rights in government and society has gone too far. </p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>The exact number of transgender athletes participating in school sports in the U.S. is unknown. While more than half of states have adopted policies to stop them from competing, lawmakers have often <a href=\"https://apnews.com/article/lawmakers-unable-to-cite-local-trans-girls-sports-914a982545e943ecc1e265e8c41042e7\">struggled to cite specific examples</a> of trans athletes in their states. </p>\n<p>In rejecting Utah’s 2022 transgender athlete ban, Republican Gov. Spencer Cox wrote <a href=\"https://governor.utah.gov/press/gov-cox-why-im-vetoing-hb11/\">in a veto message</a> that the state’s high school activities association had identified only four trans student-athletes that year, none of them the subject of complaints from students, families or administrators. </p>\n\n<p>“Four kids and only one of them playing girls sports. That’s what all of this is about,” Cox wrote at the time. “Four kids who aren’t dominating or winning trophies or taking scholarships. Four kids who are just trying to find some friends and feel like they are a part of something. Four kids trying to get through each day.”</p>\n<p>“Rarely has so much fear and anger been directed at so few,” he added.</p>\n<p>In December, NCAA President Charlie Baker, a former Republican governor of Massachusetts, told a Senate panel that there are <a href=\"https://thehill.com/homenews/lgbtq/5046662-ncaa-president-transgender-athletes-college-sports/\">fewer than 10 transgender athletes</a> he is aware of who currently compete in college sports, accounting for less than .002 percent of NCAA athletes nationwide. </p>\n<div class=\"civic-science-article-container civic-science-more-14 civic-is-mr3\" data-civicscience-widget=\"3f127ebd-287e-0b64-a901-d55ec286348a\" id=\"civsci-id-civsci-id-596708068\"></div>\n<p>Baker, who has faced mounting pressure from Republicans and conservative organizations to ban transgender athletes from college sports, said he would not adopt such a policy because federal courts have consistently sided with participation, but he would be open to with Congress to create a “federal standard” for eligibility. </p>\n<p>The National Association of Intercollegiate Athletics, which oversees collegiate sports at 241 mostly small colleges across the country, approved a policy <a href=\"https://thehill.com/homenews/state-watch/4581383-small-college-association-bans-transgender-athletes-from-womens-sports/\">barring most transgender women</a> from competition in April. </p>\n<p>House Republicans, with <a href=\"https://thehill.com/homenews/house/5085485-cuellar-gonzalez-transgender-athletes-bill/\">support from two Democrats</a>, passed legislation in January to ban transgender athletes from competing in women’s sports. </p>\n\n<p>Wednesday’s executive order is the latest move from Trump and his administration to <a data-id=\"https://thehill.com/homenews/administration/5099118-trump-executive-order-trans-rights/\" data-type=\"link\" href=\"https://thehill.com/homenews/administration/5099118-trump-executive-order-trans-rights/\">roll back transgender rights</a>.  </p>\n<p>The president, during his first few days back in office, signed orders declaring the government <a data-id=\"https://thehill.com/homenews/administration/5097278-trump-executive-order-gender-transition/\" data-type=\"link\" href=\"https://thehill.com/homenews/administration/5097278-trump-executive-order-gender-transition/\">recognizes only two sexes</a>, barring transgender people from <a data-id=\"https://thehill.com/policy/defense/5111819-trump-executive-order-transgender-military/\" data-type=\"link\" href=\"https://thehill.com/policy/defense/5111819-trump-executive-order-transgender-military/\">serving openly</a> in the military, threatening <a data-id=\"https://thehill.com/homenews/education/5113202-trump-schools-executive-order-crt-gender-ideology/\" data-type=\"link\" href=\"https://thehill.com/homenews/education/5113202-trump-schools-executive-order-crt-gender-ideology/\">funding for schools</a> that teach “radical gender ideology” and curbing federal support for <a data-id=\"https://thehill.com/homenews/lgbtq/5112282-trump-issues-executive-order-to-ban-gender-affirming-care-for-minors/\" data-type=\"link\" href=\"https://thehill.com/homenews/lgbtq/5112282-trump-issues-executive-order-to-ban-gender-affirming-care-for-minors/\">gender-affirming care</a> for transgender young people. </p>\n<p><em>Brett Samuels contributed.</em></p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/homenews/administration/5126182-donald-trump-executive-order-transgender-sports-ban/",
            "pub_date": "2025-02-05 03:51:01",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5126109,
            "title": "1 in 3 NY voters would reelect Hochul: Survey",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>Just 1 in 3 New York voters say they would vote to reelect Gov. Kathy Hochul (D-N.Y.), a new survey found.</p>\n<p>According to the survey, <a href=\"https://scri.siena.edu/wp-content/uploads/2025/02/SNY-February-2025-Poll-Release-FINAL-1.pdf?mkt_tok=NTU2LVlFRS05NjkAAAGYcN_s2u-RTKwT0RID6wipLOv-_kqipfIo4bKjbvSh-DjR05RHBZsbkaqR9N6F9iYM7kHrO0bAeUvoDscQkV7AmA-ks6QOZ51ejfVL5kuf2bRX\">released Monday</a> by Siena College’s Research Institute, 31 percent of New York voters say they would reelect Hochul while 57 percent say they want to vote for “someone else.”</p>\n\n<p>The results are similar to a survey conducted in December 2024, where Hochul also received a largely negative favorability rating. Currently, just 55 percent of Democrats view her favorably.</p>\n<p>New Yorkers rated President Trump more favorably than the governor, the survey found.</p>\n<div class=\"ns-block-custom-html\">\n<div class=\"flourish-embed flourish-chart\" data-src=\"visualisation/21470450\"><script src=\"https://public.flourish.studio/resources/embed.js\"></script><noscript><img alt=\"chart visualization\" decoding=\"async\" src=\"https://public.flourish.studio/visualisation/21470450/thumbnail\" width=\"100%\"/></noscript></div>\n</div>\n<p>Hochul has not received a positive favorability rating from the survey since January 2024.</p>\n<p>“Governor Hochul’s favorability and job approval ratings continue to languish in negative territory,” Siena College pollster Steven Greenberg said. “Currently 57 percent of voters — including 41 percent of Democrats — would prefer ‘someone else’ as their next governor.”</p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>The survey found that just 22 percent of New Yorkers think Hochul’s administration has improved the state’s fiscal condition while 52 percent say she has not.</p>\n<p>Still, eight of 10 of Hochul’s budget proposals in her State of the State were supported by large majorities, the survey found.</p>\n\n<p>The poll was conducted Jan. 27-30 among 803 registered New York state voters and has a margin of error of 4.2 percentage points.</p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/homenews/state-watch/5126109-1-in-3-ny-voters-would-reelect-hochul-survey/",
            "pub_date": "2025-02-05 03:51:01",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5124446,
            "title": "Live updates: Senate panels advance Gabbard, RFK Jr.; federal employees sue over Trump moves",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>A Senate panel on Tuesday <a href=\"https://thehill.com/homenews/senate/5123633-kennedy-nomination-advances/\" rel=\"noreferrer noopener\" target=\"_blank\">advanced the nomination</a> of Robert F. Kennedy Jr. to serve as secretary of Health and Human Services.</p>\n<p>The 14-13 vote was strictly along party lines.</p>\n\n<p>The vote on Kennedy was the first of two crucial tests for President Trump’s nominees on Tuesday. Tulsi Gabbard <a href=\"https://thehill.com/homenews/senate/5124466-gabbard-rfk-jr-confirmation-committee-votes/\" rel=\"noreferrer noopener\" target=\"_blank\">faces a vote before the Senate Intelligence Committee</a> this afternoon.</p>\n<p>Meanwhile, as part of the Trump administration’s crusade for “government efficiency,” Secretary of State Marco Rubio is being put in charge of the U.S. Agency for International Development (USAID) as the White House <a href=\"https://thehill.com/homenews/administration/5123282-marco-rubio-usaid-take-over/\">mulls the future of the agency</a>.</p>\n<p>USAID has for decades administered billions of dollars of humanitarian and development assistance around the world. </p>\n<p>USAID offices were closed Monday and employees were told to work remotely. Dozens of senior officials have been furloughed and hundreds of contract employees laid off. The apparent move to shutter the agency — and the chaos surrounding it on Monday — enraged Democrats.</p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>Also, Benjamin Netanyahu is in Washington meeting with President Trump about a future for Gaza.</p>\n<p>Read on for updates on these stories and more.</p>\n<div class=\"5124446\" id=\"wpcom-liveblog-container\"></div>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/homenews/administration/trumps-first-100-days/5124446-live-updates-gabbard-rfk-jr-usaid-trump-house-senate/",
            "pub_date": "2025-02-05 03:50:59",
            "source": "thehill",
            "language": "en"
        }
    ]
}