{
    "data": [
        {
            "id": 5759142,
            "title": "Trump 'not thrilled' with Iran talks; says no final decision made on strikes",
            "description": "<p>President Trump told reporters on Friday he has not made a final decision on whether he will strike Iran, but said he was not happy with the way Tehran was negotiating in talks with the U.S. over its nuclear program. </p>\n<p>“We haven’t made a final decision [on strikes.] We’re not exactly happy with the way they’re negotiating. They cannot have nuclear weapons. We’re not thrilled with the way they’re negotiating, so we’ll see how it all works out,” Trump told reporters as he prepared to depart the White House for a trip to Texas. </p>\n<p>When asked whether a U.S. strike on Iran would result in regime change in Iran, Trump said he has not been told that thus far.</p>\n<p>“Nobody knows that. There might be and there might not be. It would be nice if we could do it without, but sometimes you have to do it with,” the president said. </p>\n<p>“We have the greatest military anywhere in the world, there’s nothing close. I’d love not to use it, but sometimes you have to,” he continued. </p>\n<p>Trump also noted there was a risk in having another drawn out conflict in the Middle East if he were to strike Tehran. </p>\n<p>“I guess you could say there’s always a risk. When there’s war, there’s a risk in everything both good and bad,” he said. </p>\n<p>Trump’s latest comments come as speculation over whether he will decide to strike Iran has intensified over recent weeks as U.S. military might builds around the Middle East.</p>\n<p>On Friday, the State Department announced it was authorizing the departure of non-emergency U.S. government personnel and family members of government personnel from Israel, the West Bank, and Gaza “out of an abundance of caution due to safety risks.”</p>\n<p>Additionally, the State Department announced Secretary of State Marco Rubio would be visiting Israel next week, but made the unusual move of announcing members of the press would not be traveling with him.</p>\n<p>Iranian and U.S. officials engaged in a third round of negotiations in Switzerland on Thursday. Despite the talks, both sides have failed to reach an agreement on a new nuclear deal.</p>\n<p>In a statement posted to social platform X, Iranian Foreign Minister Abbas Araghchi said the latest talks were the “most intense so far.”</p>\n<p>“It concluded with the mutual understanding that we will continue to engage in a more detailed manner on matters that are essential to any deal — including sanctions termination and nuclear-related steps,” Araghchi said.</p>\n<p>The Iranian official said technical teams will meet in Vienna in the “coming days.”</p>\n<p>Oman’s foreign minister, Badr al-Busaidi, has been moderating the conversation and is set to meet with Vice President Vance in Washington on Friday.</p>\n<p><em>Updated 1:52 p.m. EST</em></p>\n<p></p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/administration/5759142-trump-iran-strike-decision/",
            "pub_date": "2026-02-28 03:00:58",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5759118,
            "title": "Trump floats 'friendly takeover' of Cuba",
            "description": "<p>President Trump on Friday suggested the U.S. could carry out a “friendly takeover” of Cuba, as the president has used a fuel blockade to increase the pressure on the communist regime in Havana.</p>\n<p>“The Cuban government is talking with us. They’re in a big deal of trouble, as you know. They have no money, no anything right now,” Trump told reporters. “Maybe we’ll have a friendly takeover of Cuba. We could very well end up having a friendly takeover Cuba.”</p>\n<p>Trump imposed a fuel blockade on the island in an executive order at the end of January in a push to collapse the regime, which relies heavily on energy and food imports. </p>\n<p>The United Nations’ top official for Cuba <a href=\"https://news.un.org/en/story/2026/02/1167046\" rel=\"noreferrer noopener\" target=\"_blank\">warned on Wednesday</a> that daily life on the island is “becoming fragile” with increased strains on healthcare, water services and food distribution.</p>\n<p>U.S. officials reportedly met on Thursday with the grandson of 94-year-old former president Raul Castro, considered the de facto leader of the totalitarian regime, on the sidelines of a conference in the Caribbean attended by Secretary of State Marco Rubio. </p>\n<p>Castro’s grandson, Raúl Guillermo Rodriguez Castro, serves as his grandfather’s bodyguard and is believed to oversee Cuba’s armed forces’s conglomerate, known as GAESA, which controls much of the island’s economy. The Miami Herald <a href=\"https://www.miamiherald.com/news/nation-world/world/americas/cuba/article314747226.html#storylink=cpy\" rel=\"noreferrer noopener\" target=\"_blank\">reported that in 2024,</a> GAESA had about $18 billion in assets and in unknown bank accounts. </p>\n<p>The Cuban government has instituted emergency measures to deal with the U.S. fuel quarantine and is said to have between six and seven weeks of fuel left before falling into a major blackout. </p>\n<p>Trump’s remarks come after a deadly confrontation Wednesday between the Cuban Coast Guard and a group of U.S. citizens, permanent residents and visa holders. At least four people aboard a boat were killed and others wounded, taken into custody and accused of “terrorism” against the island. </p>\n<p>Both governments have made statements seeming to cool tensions over the incident, emphasizing both sides are cooperating in clarifying what the Cuban government called “regrettable events.”</p>",
            "kind": 1,
            "link": "https://thehill.com/policy/international/5759118-cuba-friendly-takeover-trump/",
            "pub_date": "2026-02-28 02:51:41",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5759106,
            "title": "Hundreds of Google, OpenAI employees back Anthropic in Pentagon fight",
            "description": "<p>Hundreds of<strong> </strong>employees at Google and OpenAI are backing artificial intelligence technology company Anthropic, which faces a Friday evening deadline to give the Pentagon permission to use its AI system as it wishes or face repercussions from the department. </p>\n<p>Employees <a href=\"https://notdivided.org/\" rel=\"noreferrer noopener\" target=\"_blank\">who signed a letter</a> alleged the Pentagon was trying to “get them to agree to what Anthropic has refused,” which could imply the Pentagon has inquired with the top AI companies about similar access to their technology. The letter is still accepting signatures.</p>\n<p>“We hope our leaders will put aside their differences and stand together to continue to refuse the Department of War’s current demands for permission to use our models for domestic mass surveillance and autonomously killing people without human oversight,” reads the letter, signed by more than 430 employees.</p>\n<p>The Pentagon has <a href=\"https://thehill.com/policy/technology/5757667-pentagon-threatens-anthropic-dpa/\" rel=\"noreferrer noopener\" target=\"_blank\">remained in a standoff</a> with Anthropic for weeks over military access to its AI model Claude, which the company has made so that it cannot be used to conduct mass surveillance or develop lethal autonomous weapons.</p>\n<p>The Pentagon put a 5:01 p.m. EST Friday deadline for the company to grant the Pentagon access to Claude and threatened to enact the Defense Production Act (DPA), rescind a $200 million contract and label the company as a “supply chain risk” if it does not comply. </p>\n<p>Anthropic CEO Dario Amodei said in a <a href=\"https://thehill.com/policy/technology/5757667-pentagon-threatens-anthropic-dpa/\" rel=\"noreferrer noopener\" target=\"_blank\">Thursday statement</a> that his company “cannot in good conscience accede to their request.” Sean Parnell, chief Pentagon spokesperson, responded Thursday that the department has “<a href=\"https://thehill.com/policy/technology/5757667-pentagon-threatens-anthropic-dpa/\" rel=\"noreferrer noopener\" target=\"_blank\">no interest</a>” in using AI to conduct mass surveillance of U.S. citizens nor to develop and operate autonomous weapons. </p>\n<p>OpenAI CEO Sam Altman said Friday that <a href=\"https://thehill.com/policy/technology/5758898-altman-backs-anthropic-pentagon-stand/\" rel=\"noreferrer noopener\" target=\"_blank\">he agrees with Anthropic’s red lines</a> for its AI model. The companies are competitors in the AI industry. </p>\n<p>“I don’t personally think the Pentagon should be threatening DPA against these companies,” Altman told CNBC’s “Squawk Box” Friday morning. “As long as it is going to comply with legal protections and the few red lines that the field, we have, I think we share with Anthropic and that other companies also independently agree with, I think it is important to do that.” </p>\n<p>More than 100 employees on Google’s AI team signed an internal letter they sent to Jeff Dean, the chief scientist of Google DeepMind, according to a <a href=\"https://www.nytimes.com/2026/02/26/technology/google-deepmind-letter-pentagon.html\" rel=\"noreferrer noopener\" target=\"_blank\">New York Times report</a>. The report said employees who signed the letter didn’t want Google to allow military access to Google’s Gemini AI to surveil U.S. citizens or to steer autonomous lethal weapons. </p>\n<p>“Please do everything in your power to stop any deal which crosses these basic red lines,” the employees reportedly wrote. “We love working at Google and want to be proud of our work.”</p>",
            "kind": 1,
            "link": "https://thehill.com/policy/technology/5759106-google-openai-anthropic-pentagon-ai/",
            "pub_date": "2026-02-28 02:41:21",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5758397,
            "title": "The empty chair in the boardroom: Zelensky skips Trump's Peace Board meeting",
            "description": "<p>“It is very difficult for me to imagine how we and Russia can be together in this or that council,” Ukrainian President Volodymyr Zelensky <a href=\"https://www.aa.com.tr/en/russia-ukraine-war/zelenskyy-questions-ukraine-s-inclusion-in-board-of-peace-amid-possible-russia-belarus-participation/3805357\" rel=\"noreferrer noopener\" target=\"_blank\">noted this month</a>, effectively snubbing the invitation to Donald Trump’s inaugural <a href=\"https://www.fdd.org/analysis/2026/02/19/trump-hosts-inaugural-board-of-peace-meeting/\" rel=\"noreferrer noopener\" target=\"_blank\">Board of Peace</a> meeting in Washington. His absence was the most defining feature of the summit.</p>\n<p>While leaders like Hungary’s Viktor Orban and Argentina’s Javier Milei gathered to toast a new era of “commercial diplomacy,” the man whose nation’s fate topped the agenda was notably elsewhere. By refusing to show up, Zelensky is signaling that sovereign survival cannot be bought or sold like a distressed asset in a real estate merger.</p>\n<p>This represents a fundamental departure from eight decades of international relations. We are moving away from the messy, rule-based multilateralism of the UN and toward a model that treats global security as a corporate acquisition. The Board — where permanent seats reportedly carry a <a href=\"https://www.sbs.com.au/news/article/trump-launches-board-of-peace-with-gaza-aid-promise/p22ck786f\" rel=\"noreferrer noopener\" target=\"_blank\">$1 billion entry fee</a> — is the ultimate expression of this shift. It is a world where consensus is replaced by “the close,” and where the White House’s firm June deadline to end the conflict is treated as a non-negotiable structural constraint.</p>\n<p>Washington focused on the optics of the boardroom, Zelensky spent his energy on the “Geneva track” and the <a href=\"https://www.president.gov.ua/en/news/vistup-prezidenta-ukrayini-na-myunhenskij-bezpekovij-konfere-102861\" rel=\"noreferrer noopener\" target=\"_blank\">Munich Security Conference</a>. As his negotiating team returned to Kyiv from the trilateral Geneva talks, Zelensky’s message was clear: he will not allow the war’s endgame to be dictated by an American midterm election calendar.</p>\n<p>To force compliance, the administration has used “carrots and sticks,” including the temporary suspension of vital intelligence aid last year to signal that Kyiv must “play ball.” Yet, Zelensky has pushed back, calling the timing of a political referendum <a href=\"https://www.swissinfo.ch/eng/international-geneva/volodymyr-zelensky-denounces-excessive-pressure-from-donald-trump-on-kiev-and-not-on-moscow/90960201\" rel=\"noreferrer noopener\" target=\"_blank\">foolish</a> and insisting that democracy cannot be rushed to satisfy a corporate schedule.</p>\n<p>The vacuum in Washington was filled by the shadow of the <a href=\"https://gvwire.com/2026/02/17/russia-confirms-12-trillion-economic-proposal-linked-to-ukraine-deal/\" rel=\"noreferrer noopener\" target=\"_blank\">“Dmitriev package.”</a> Orchestrated by <a href=\"https://www.pbs.org/newshour/world/who-is-kirill-dmitriev-the-russian-envoy-who-helped-craft-the-ukraine-peace-proposal\" rel=\"noreferrer noopener\" target=\"_blank\">Kirill Dmitriev</a> of the Russian Direct Investment Fund, this proposal envisions a $12 trillion economic “win-win.” The plan suggests liquidating frozen Russian assets to fund reconstruction — led by American firms — while creating a U.S.-Russia mechanism for rare-earth minerals and energy. For the Trump administration, this is the ultimate deal: it offloads the cost of peace to the private sector and integrates Russia into a U.S.-led economic web.</p>\n<p>But for Ukraine, it is a poison pill. The package reportedly includes a permanent cap on Ukraine’s armed forces at 600,000 personnel and a 20-year NATO moratorium. At Munich, Zelensky warned that the world is <a href=\"https://www.msn.com/en-us/news/insight/zelensky-rejects-concessions-warns-of-munich-repeat/gm-11C6029434?gemSnapshotKey=11C6029434-snapshot-0&amp;ocid=MD12O1\" rel=\"noreferrer noopener\" target=\"_blank\">repeating the mistakes of 1938</a>, asking only Ukraine to make concessions while the Kremlin remains largely exempt from similar pressure. The <a href=\"https://bostonglobalforum.org/news/president-volodymyr-zelenskyy-2022-world-leader-for-peace-and-security-award-recipient-receives-warm-welcome-at-munich-security-conference-2026/\" rel=\"noreferrer noopener\" target=\"_blank\">Munich Security Report 2026</a> theme of “Under Destruction” feels less like a warning and more like a description of the current American strategy.</p>\n<p>The tragedy of the Boardroom approach is that it treats history as if it were a balance sheet. For Trump, the goal is “The Close” — a definitive end to the drain on American resources before voters head to the polls. But for Zelensky, the stakes are existential. If he accepts the “Dmitriev Package,” he is not just signing a peace treaty; he is signing a management agreement for a country that will essentially become a joint-stock company controlled by its former invader and its current patron. </p>\n<p>This is why he is prioritizing the “Geneva track” over the Washington cameras. He knows that once a nation’s sovereignty is commodified, it is rarely ever reclaimed.</p>\n<p>Furthermore, this “pay-to-play” security model risks alienating the very European allies who have held the line since 2022. By effectively treating European security as a bilateral matter between Washington and Moscow, the U.S. is signaling that the era of ironclad alliances is over. In its place is a transactional world where safety is a subscription service. If you don’t pay your “billions,” your security guarantees might just be canceled like a lapsed cable plan. This is a terrifying precedent for small nations everywhere who rely on the rule of law rather than the depth of their checkbooks.</p>\n<p>The critical flaw in this boardroom approach is that it prioritizes the absence of war over the presence of security. While the Board of Peace successfully announced <a href=\"https://apnews.com/article/trump-board-of-peace-first-meeting-22e587df67e27cd1e1d96e446cb88378\" rel=\"noreferrer noopener\" target=\"_blank\">pledges for Gaza reconstruction</a>, the Ukraine crisis involves “ancient fires of nationalism” that cannot be extinguished with a checkbook. By treating European security as a bilateral matter between Washington and Moscow, the U.S. risks hollowing out the very alliances that have maintained global order.</p>\n<p>Zelensky’s empty chair was a silent protest against a world where sovereign futures are settled like real estate mergers. He is gambling that by holding out for a “just” peace in Geneva, he can prevent Ukraine from becoming a mere subsidiary in a larger American-Russian partnership. The question remains whether a peace built on personal leverage and entry fees can survive the test of time.</p>\n<p>We are witnessing the birth of “Subscription Security,” where guarantees are only as good as the next payment and alliances are as fleeting as a press release. If the Board of Peace succeeds in turning Ukraine into a corporate subsidiary, it won’t just be the end of the war; it will be the end of the post-war world as we know it. In this new era, the most expensive thing on the menu is, quite clearly, a nation’s conscience.</p>\n<p><em>Imran Khalid is a physician and has a master’s degree in international relations.</em></p>",
            "kind": 1,
            "link": "https://thehill.com/opinion/international/5758397-board-of-peace-criticized/",
            "pub_date": "2026-02-28 02:41:21",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5759048,
            "title": "Texas to correct errors in Bible-infused curriculum",
            "description": "<p>The Texas State Board of Education voted to approve changes to the <a href=\"https://thehill.com/homenews/education/4998583-texas-bible-lessons-public-schools/\">Bible-infused curriculum</a> some schools are offering in the state, fixing errors caught by teachers in its first year in circulation.  </p>\n<p>The curriculum, which is optional for schools although those who adopt it receive extra state funding, was found to have over a thousand errors, including grammatical mistakes copyright and imaging problems and some factual errors.  </p>\n<p>The board approved the change to the “Bluebonnet Learning” curriculum in a 9-6 vote at Wednesday’s meeting.  </p>\n<p>While some board members said there were over 4,000 changes needed to the curriculum, according to the Associated Press, the Texas Education Agency (TEA) argued that is an inflated number. </p>\n<p>In a statement to The Hill, TEA said there were around 1,900 changes needed to the curriculum, alleging the issues were largely along grammatical and copyright problems rather than factual errors.  </p>\n<p>The TEA said the process of submitting changes to the board causes some errors to get counted multiple times.  </p>\n<p>“For example, if a lesson text is missing a comma in the teacher guide, student reader or other piece of collateral – even though it’s only one change (adding the comma) – the IMRA process requires that each change be submitted individually, meaning that one addition of a comma would be tracked as three separate changes,” the agency said in a statement.  </p>\n<p>“My concern is that we have failed students this school year who have been utilizing this product,” said Democratic board member Tiffany Clark, the Associated Press reported, adding even a typo in a math problem could cause issues in a classroom.  </p>\n<p>It is unknown how many schools adopted the curriculum, but the AP reported around 300 districts said they would use it back in August.  </p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/education/5759048-texas-bible-curriculum-errors/",
            "pub_date": "2026-02-28 02:11:03",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5756951,
            "title": "The Trump administration is disappearing climate change data",
            "description": "<p>On Feb. 12, the Trump administration <a href=\"https://nam11.safelinks.protection.outlook.com/?url=https%3A%2F%2Fwww.epa.gov%2Fregulations-emissions-vehicles-and-engines%2Ffinal-rule-rescission-greenhouse-gas-endangerment&amp;data=05%7C02%7CDTodd%40thehill.com%7C9576598c3d604d53690d08de76130317%7C9e5488e2e83844f6886cc7608242767e%7C1%7C0%7C639078021199900592%7CUnknown%7CTWFpbGZsb3d8eyJFbXB0eU1hcGkiOnRydWUsIlYiOiIwLjAuMDAwMCIsIlAiOiJXaW4zMiIsIkFOIjoiTWFpbCIsIldUIjoyfQ%3D%3D%7C0%7C%7C%7C&amp;sdata=VjL%2BAekNbvjerRo%2FPaD%2B1yNbH8jF6QChQNNOGqzboaw%3D&amp;reserved=0\" rel=\"noreferrer noopener\" target=\"_blank\">repealed the landmark 2009 Greenhouse Gas Endangerment Finding</a>, flouting decades of scientific consensus. This rule doesn’t just gut the EPA’s ability to regulate greenhouse gas emissions, it also blocks our ability to know anything about cars’ and companies’ emissions, <a href=\"https://nam11.safelinks.protection.outlook.com/?url=https%3A%2F%2Fwww.epa.gov%2Fregulations-emissions-vehicles-and-engines%2Ffinal-rule-rescission-greenhouse-gas-endangerment&amp;data=05%7C02%7CDTodd%40thehill.com%7C9576598c3d604d53690d08de76130317%7C9e5488e2e83844f6886cc7608242767e%7C1%7C0%7C639078021199936699%7CUnknown%7CTWFpbGZsb3d8eyJFbXB0eU1hcGkiOnRydWUsIlYiOiIwLjAuMDAwMCIsIlAiOiJXaW4zMiIsIkFOIjoiTWFpbCIsIldUIjoyfQ%3D%3D%7C0%7C%7C%7C&amp;sdata=6dXUvh9thcHlHNHHGVDZHFdB6vm9oBbhih25fvaRdVE%3D&amp;reserved=0\" rel=\"noreferrer noopener\" target=\"_blank\">ensuring automakers</a> “no longer have any future obligations for the measurement, control, and reporting of GHG emissions for any highway engine and vehicle.”  </p>\n<p>The Trump administration’s efforts to block data are not isolated. Between the repeal of the Endangerment Finding and the proposed repeal of the <a href=\"https://nam11.safelinks.protection.outlook.com/?url=https%3A%2F%2Fwww.epa.gov%2Fghgreporting&amp;data=05%7C02%7CDTodd%40thehill.com%7C9576598c3d604d53690d08de76130317%7C9e5488e2e83844f6886cc7608242767e%7C1%7C0%7C639078021199963680%7CUnknown%7CTWFpbGZsb3d8eyJFbXB0eU1hcGkiOnRydWUsIlYiOiIwLjAuMDAwMCIsIlAiOiJXaW4zMiIsIkFOIjoiTWFpbCIsIldUIjoyfQ%3D%3D%7C0%7C%7C%7C&amp;sdata=ky152fmM%2FZoqvcnUkgtYaiLHiHTJyezafS1p1JXVmRw%3D&amp;reserved=0\" rel=\"noreferrer noopener\" target=\"_blank\">Greenhouse Gas Reporting Program</a>, expected to be finalized any day, the Trump administration has entirely turned out the lights on greenhouse gas emissions data. That may sound like the administration doesn’t care about data, but its extensive efforts to hide and halt federal data actually show how critically important they are. </p>\n<p>The <a href=\"https://www.epa.gov/ghgreporting\" rel=\"noreferrer noopener\" target=\"_blank\">Greenhouse Gas Reporting Program</a> was just that — a program to gather and publicly report data about greenhouse gas emissions in the United States. But the EPA is reconsidering a rule that calls for an end to gathering greenhouse gas emissions data for <a href=\"https://www.epa.gov/system/files/documents/2025-09/reconsideration-of-ghgrp-proposal-fact-sheet.pdf\" rel=\"noreferrer noopener\" target=\"_blank\">46 of 47 industries</a>, and suspends data collection for the 47th industry until 2034. </p>\n<p>The Greenhouse Gas Reporting Program didn’t require facilities to lower their emissions. It didn’t require expensive emissions reductions technologies. All the program did was produce data, and <a href=\"https://envirodatagov.org/wp-content/uploads/2025/11/EDGI-GHGRP-Public-Comment.pdf\" rel=\"noreferrer noopener\" target=\"_blank\">it cost next to nothing</a>. But the program was axed because, as it turns out, data is powerful. </p>\n<p>It’s no wonder that the EPA decided to do away with greenhouse gas emissions data for the public and policymakers alike. The Trump administration wants to “<a href=\"https://www.donaldjtrump.com/agenda47/agenda47-america-must-have-the-1-lowest-cost-energy-and-electricity-on-earth\" rel=\"noreferrer noopener\" target=\"_blank\">DRILL, BABY, DRILL</a>” while the world <a href=\"https://www.science.org/doi/10.1126/science.abn7950\" rel=\"noreferrer noopener\" target=\"_blank\">teeters on the edge of multiple climate tipping points</a> and other world leaders widely <a href=\"https://unfccc.int/process-and-meetings/the-paris-agreement\" rel=\"noreferrer noopener\" target=\"_blank\">recognize the need to curb carbon emissions</a> immediately. So, data about our role in climate change must go. </p>\n<p>It is hard to say climate change is <a href=\"https://envirodatagov.org/epa-scrubs-information-about-climate-change-indicators-and-impacts/\" rel=\"noreferrer noopener\" target=\"_blank\">caused solely by natural variation</a> when the data show otherwise. It is hard to say <a href=\"https://www.federalregister.gov/d/2025-14572/p-40\" rel=\"noreferrer noopener\" target=\"_blank\">there’s nothing we can do about it</a> when the data show otherwise. It is hard to convince people of a lie when there is data that shows the truth. And the Trump administration knows this.  </p>\n<p>Our country relies on federal data to understand and address issues in our environment, health and society. Without data, we cannot assess current or anticipate future conditions. Without data, we cannot effectively identify or measure, let alone mitigate problems. </p>\n<p>For the past year, the federal government has threatened the existence, accessibility and integrity of federal data. It has pulled down critical data, like the <a href=\"https://www.epa.gov/rmp/how-access-risk-management-plan-information\" rel=\"noreferrer noopener\" target=\"_blank\">EPA’s Risk Management Plans</a> (preserved <a href=\"https://edgi-cloud.fly.dev/db/risk_management_plans/homepage\" rel=\"noreferrer noopener\" target=\"_blank\">here</a>) that provided communities with information about the hazardous chemicals stored and used in nearby facilities. It has discontinued data, like the <a href=\"https://www.ncei.noaa.gov/access/billions/\" rel=\"noreferrer noopener\" target=\"_blank\">National Oceanic and Atmospheric Administration’s Billion Dollar Disasters</a>, which helped show the economic impact of climate disasters. </p>\n<p>The federal government has also removed ways of accessing and using data, like <a href=\"https://blog.ucs.org/stacy-woods/the-trump-administrations-deletion-of-environmental-justice-data-does-real-harm/\" rel=\"noreferrer noopener\" target=\"_blank\">taking down federal tools to quantify or visualize disproportionate environmental impacts</a> on certain groups of people, with a <a href=\"https://www.atsdr.cdc.gov/place-health/php/eji/index.html\" rel=\"noreferrer noopener\" target=\"_blank\">court ordering one of them to be restored</a>. The federal government has even <a href=\"https://journalistsresource.org/home/federal-health-data-modification-lancet/\" rel=\"noreferrer noopener\" target=\"_blank\">manipulated data</a> and <a href=\"https://climate.law.columbia.edu/content/department-energy-report-includes-false-claims-about-climate-change\" rel=\"noreferrer noopener\" target=\"_blank\">misrepresented scientific findings</a> in consequential reports. </p>\n<p>The Trump administration employs three methods to hide data from the public: deregulation such as gutting the Greenhouse Gas Report Program, defunding in the manner of <a href=\"https://www.npr.org/2025/05/02/nx-s1-5385272/epa-environmental-protection-agency-cuts-trump-zeldin\" rel=\"noreferrer noopener\" target=\"_blank\">EPA’s drastic staff cuts</a>, and outright deletion, like in the case of the <a href=\"https://screening-tools.com/fema-future-risk\" rel=\"noreferrer noopener\" target=\"_blank\">Federal Emergency Management Agency’s Future Risk Index</a>. </p>\n<p>We in civil society need to push back and intervene in each of these mechanisms. We need to push back on deregulation through effective public comments, which give litigators a strong official record to challenge agencies’ deregulatory moves. We need to advocate Congress to fund our agencies and their critical programs and assert public pressure on agencies to lift hiring freezes and rebuild staff. And we need to protect our existing data by preserving it in public repositories with civil society stewards. And that’s just the work we need to do to defend what we’ve had in the past, let alone the imperative of building a more robust and resilient data ecosystem for the future. </p>\n<p>Protecting data is about more than data. It’s about protecting the public’s right to data, our right to information, our right to knowledge. Protecting data is about preserving a fundamental pillar of democracy. </p>\n<p><em>Gretchen Gehrke, Ph.D., is co-founder of the </em><em><u><a href=\"https://envirodatagov.org/\" rel=\"noreferrer noopener\" target=\"_blank\">Environmental Data and Governance Initiative</a></u></em><em> and of the </em><em><u><a href=\"https://screening-tools.com/\" rel=\"noreferrer noopener\" target=\"_blank\">Public Environmental Data Partners</a></u></em><em> coalition.</em></p>",
            "kind": 1,
            "link": "https://thehill.com/opinion/energy-environment/5756951-federal-data-threatened-trump-era/",
            "pub_date": "2026-02-28 02:11:02",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5759007,
            "title": "House Democrat: 'Good for Anthropic' in rejecting Pentagon demands",
            "description": "<p>Rep. Ro Khanna (D-Calif.) praised the artificial intelligence company Anthropic for rejecting the Pentagon’s demands in how its AI technology is used by Friday evening. </p>\n<p>The company and the U.S. government have been in <a href=\"https://thehill.com/policy/technology/5757667-pentagon-threatens-anthropic-dpa/\">battle</a> for weeks over Anthropic’s AI policy, which blocks its AI model Claude from being used to conduct mass surveillance or develop lethal autonomous weapons.</p>\n<p>The company <a href=\"https://thehill.com/policy/technology/5758006-anthropic-pentagon-ai-talks-stall/\">said in a statement </a>Thursday that it “cannot in good conscience accede to their request.” </p>\n<p>“Good for Anthropic,” Khanna, who represents the nation’s technology capital, Silicon Valley, said in a Friday interview with Fox Business Network host Maria Bartiromo. “I don’t want technology used by a federal government to have mass surveillance on American citizens. That’s common sense.</p>\n<p>“I mean, think about if you had a Democratic president, would you want them to have tools of AI to figure out whether you have a gun, to figure out what church you’re going to?” he told Bartiromo. “It is scary. And I hope we can come together and say, no, we don’t want mass surveillance.”</p>\n<p>Khanna’s comments come as Anthropic <a href=\"https://thehill.com/policy/technology/5757667-pentagon-threatens-anthropic-dpa/\">faces a Friday 5:01 p.m. deadline</a> to agree to the Pentagon’s terms. It threatened Tuesday that it would implement the Defense Production Act (DPA), which gives the president broad authority to control domestic industries for national defense purposes. The threat drew <a href=\"https://thehill.com/policy/technology/5757667-pentagon-threatens-anthropic-dpa/\">criticism from experts</a>.</p>\n<p>“It’s the wrong purpose of the tool,” Mark Dalton, senior policy director for technology and innovation at the R Street Institute, told The Hill on Thursday. “The DPA exists for a capacity reason, like it’s an industrial capacity policy, and to use it as leverage is, I think, irresponsible.”</p>\n<p>If Anthropic doesn’t comply by Friday, it also faces losing a $200 million contract from the Pentagon and being labeled a “supply chain risk.” </p>\n<p>Chief Pentagon spokesperson Sean Parnell said Thursday the department has “no interest in using AI to conduct mass surveillance of Americans (which is illegal) nor do we want to use AI to develop autonomous weapons that operate without human involvement.”</p>\n<p>“This is a simple, common-sense request that will prevent Anthropic from jeopardizing critical military operations and potentially putting our warfighters at risk,” he wrote in a post on X. “We will not let ANY company dictate the terms regarding how we make operational decisions.”</p>",
            "kind": 1,
            "link": "https://thehill.com/policy/technology/5759007-ro-khanna-anthropic-pentagon-ai/",
            "pub_date": "2026-02-28 02:01:44",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5759016,
            "title": "Trump eyeing mail-in ballot, voting machine ban ahead of midterms?",
            "description": "<p>Here’s the headline: Pro-Trump activists, who say they’re coordinating with the White House, are <a href=\"https://www.washingtonpost.com/politics/2026/02/26/trump-elections-executive-order-activists/\" rel=\"noreferrer noopener\" target=\"_blank\">circulating a draft executive order</a> urging President Trump to declare a national emergency over the 2020 election, based on the claim that China interfered, and use that emergency to take sweeping control over how Americans vote in the midterms.  </p>\n<p>Let’s slow that down.  </p>\n<p>The draft would empower a president to ban mail-in ballots and voting machines, arguing they’re vulnerable to foreign interference. But U.S. intelligence reviews in 2021 concluded that while China considered influence efforts, it did not carry them out<a href=\"https://sos.ga.gov/news/us-intelligence-officials-find-no-foreign-interference-election-systems\" rel=\"noreferrer noopener\" target=\"_blank\">. There is no credible evidence that foreign interference altered the 2020 outcome.</a> At all.  </p>\n<p>And here’s the constitutional reality: The Elections Clause explicitly gives states — not the president — authority over how elections are run. <a href=\"https://constitution.congress.gov/browse/article-1/section-4/\" rel=\"noreferrer noopener\" target=\"_blank\">Article I, Section 4</a> is clear. States set the rules. Congress can step in. The president has no role.  </p>\n<p>As Michael McNulty, policy director for the pro-democracy group Issue One, <a href=\"https://issueone.org/press/reported-white-house-move-to-take-over-elections-would-violate-the-constitution/\" rel=\"noreferrer noopener\" target=\"_blank\">put it</a>: “The Constitution is absolutely clear. The president does not have legal authority to unilaterally change election rules. Any attempt by the White House to do so would contradict the Constitution and would almost certainly be struck down by the courts.”  </p>\n<p>But this isn’t happening in a vacuum.  </p>\n<p>For months, there’s been a broader drive to cast doubt on the legitimacy of the 2026 midterms. In his State of the Union, the president <a href=\"https://www.pbs.org/newshour/politics/8-takeaways-from-trumps-2026-state-of-the-union-address\" rel=\"noreferrer noopener\" target=\"_blank\">falsely claimed</a> the “only way” Democrats get elected “is to cheat.” He’s pushing the SAVE Act in Congress and has openly floated acting alone if lawmakers don’t comply.  </p>\n<p>At the same time, we’ve seen federal law enforcement step into election spaces in ways that raise alarms, including an <a href=\"https://www.cbsnews.com/atlanta/news/judge-order-fulton-county-federal-government-mediation-seized-2020-election-records/\" rel=\"noreferrer noopener\" target=\"_blank\">FBI raid on election offices in Fulton County, Ga.</a> Intelligence chief Tulsi Gabbard was present, despite her office having no formal role in election administration. The message to local officials feels unmistakable: If we don’t like the outcome, we may come looking.  </p>\n<p>And here’s what often gets left out of the conversation about “massive fraud.” The Heritage Foundation — you know, the right-wing think tank<a href=\"https://static.heritage.org/project2025/2025_MandateForLeadership_FULL.pdf\" rel=\"noreferrer noopener\" target=\"_blank\"> famous for pulling together the controversial Project 2025</a>, tracked election fraud cases over 25 years and <a href=\"https://www.brookings.edu/articles/how-widespread-is-election-fraud-in-the-united-states-not-very/\" rel=\"noreferrer noopener\" target=\"_blank\">found a rate of .0000845 percent</a>, with no election outcome altered by ballot fraud. Both parties have lawyers inside counting rooms. To believe widespread fraud exists, you’d have to believe armies of Republican and Democratic attorneys are either incompetent or complicit. That’s not reality.  </p>\n<p>A recent Washington Post-ABC News pol<a href=\"https://wedefendthevote.org/new-poll-voters-strongly-oppose-trumps-plan-to-nationalize-elections/\" rel=\"noreferrer noopener\" target=\"_blank\">l shows a majority of Americans</a>, including independents, oppose a federal takeover of election administration.  </p>\n<p>This moment is bigger than one executive order. It’s about whether we normalize the idea that a president can declare an emergency whenever he doesn’t trust the outcome of an election. That’s not election security. That’s executive overreach.  </p>\n<p>Facts matter. The Constitution matters. And confidence in our elections depends on leaders respecting both, even when the results don’t go their way. </p>\n<p><em>Lindsey Granger is a NewsNation contributor and co-host of The Hill’s commentary show “Rising.” This column is an edited transcription of her on-air commentary.  </em> </p>",
            "kind": 1,
            "link": "https://thehill.com/opinion/lindseys-lens/5759016-executive-overreach-election-rules/",
            "pub_date": "2026-02-28 01:51:23",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5758358,
            "title": "The 22nd Amendment at age 75: is it seriously under challenge?",
            "description": "<p><a href=\"https://www.archives.gov/exhibits/running-for-office/larger-image.php?image=44.1&amp;TB_iframe=true#:~:text=The%2022nd%20Amendment%20to%20the,as%20President%20after%20two%20terms.\">Feb. 27</a> marks the 75th anniversary of the <a href=\"https://constitutioncenter.org/the-constitution/amendments/amendment-xxii\">22nd Amendment to the Constitution</a>, when Minnesota’s ratification gave the three-quarters of the 48 states required by <a href=\"https://www.archives.gov/federal-register/constitution/article-v.html\">Article V</a>. Now it is back in the public consciousness as President Trump’s supporters take aim at its limitations.</p>\n<p>The intention is straightforward: “<a href=\"https://constitution.congress.gov/constitution/amendment-22/\">No person shall be elected to the office of the President more than twice</a>.” Furthermore, “no person who has held the office of President, or acted as President, for more than two years of a term to which some other person was elected President shall be elected to the office of the President more than once.”</p>\n<p>This wasn’t theoretical. Harry Truman had been elected as Franklin Roosevelt’s vice president in 1944, but had only served 82 days when Roosevelt died in April 1945. That gave him virtually all of Roosevelt’s <a href=\"https://www.history.com/articles/fdr-four-term-president-22-amendment\">fourth four-year term</a>.</p>\n<p>Presidential tenure became a campaign issue in the 1946 midterm elections: Republicans gained 55 seats in the House and 12 in the Senate to take control of Congress for the first time since 1932.</p>\n<p>Everything led back to Roosevelt. In 1940, he was approaching the end of his second term. George Washington had chosen to step down after eight years as president, and his model had become a moral and constitutional, if unofficial, exemplar.</p>\n<p>Ulysses S. Grant came close to winning the Republican nomination for a third time in 1880; incredibly, despite a paralyzing stroke in 1919, Woodrow Wilson considered seeking a third term in 1920 and even entertained the idea of a comeback in 1924. But no-one had got as far as the ballot.</p>\n<p>FDR’s third term was recognized as exceptional: the storm clouds of war were gathering and the Democrats played safe, Roosevelt winning 38 states.</p>\n<p>1944 was different. Roosevelt was only <a href=\"https://www.history.com/articles/franklin-d-roosevelt-health-final-term\">62 but he was suffering from congestive heart failure and hypertension</a>. The president was dying, so nominating a vice presidential candidate was almost certainly choosing the 33rd president of the U.S.</p>\n<p>The incumbent vice president, Henry Wallace, was a cerebral agriculturalist who opposed segregation. He was unacceptably liberal for Democrat bosses, so he was replaced at the party’s convention with Missouri Sen. Harry S. Truman, whom Roosevelt barely knew.</p>\n<p>The pair <a href=\"https://www.presidency.ucsb.edu/statistics/elections/1944\">won in November 1944</a>, but Roosevelt was already fading by then. He and Truman <a href=\"https://www.whitehousehistory.org/the-life-and-presidency-of-harry-s-truman\">met alone only twice as President and Vice President</a> before Roosevelt had a massive stroke and died on April 12, 1945. Four months earlier, Truman had been a middleweight senator of only 10 years’ standing. Now he was president.</p>\n<p>A <a href=\"https://s3.amazonaws.com/NARAprodstorage/opastorage/live/67/4118/1411867/content/arcmedia/congress/08276.pdf\">joint resolution</a> stipulating presidential term limits was introduced on the first day of the 80th Congress in 1947. Agreed on March 21 by Republicans and enough Democrats to matter, the text was sent to the states for ratification.</p>\n<p>It would not be a swift process. Although Maine and Michigan ratified the amendment on March 31, 1947, it would take three years and 343 days before the Minnesota Legislature’s decision passed the Article V threshold —  then a record length of time.</p>\n<p>The 22nd Amendment has rarely been a source of deep controversy. President Ronald Reagan retained approval ratings generally above 50 percent right to the end of his presidency, and <a href=\"https://www.washingtonpost.com/archive/politics/1986/06/16/short-sighted-amendment/236a7677-5e32-4013-b2a7-1909e55a1db9/\">came to think</a> the amendment was “a mistake”; but he was 77 by the end of his second term and his health was declining.</p>\n<p>President Bill Clinton was more grudging, <a href=\"https://www.rollingstone.com/politics/politics-news/bill-clinton-the-rolling-stone-interview-2-40256/\">telling Rolling Stone</a> in 2000, “Oh, I probably would have run again.” Asked if he thought he would have won, he replied “Yes I do. But it’s hard to say, because it’s entirely academic.”</p>\n<p>Trump has <a href=\"https://thehill.com/homenews/house/4988568-trump-third-term-house-republicans/\">publicly toyed</a> with the idea that his tenure might not have to end in 2029. He markets <a href=\"https://www.trumpstore.com/trump-2028-hat\">“Trump 2028” baseball caps</a>, and constitutional and criminal lawyer Alan Dershowitz has <a href=\"https://www.wsj.com/politics/elections/trump-told-by-alan-dershowitz-constitutionality-of-third-term-is-unclear-33133eb8?mod=hp_featst_pos3\">argued</a> that “it’s not clear if a president can become a third term president and it’s not clear if it’s permissible.” Trump himself clearly relishes the horror and outrage the suggestion inspires in his opponents.</p>\n<p>How could its provisions be overcome? Some point to its prohibition against being “elected to the office of the President more than twice,” arguing that Trump could succeed to the presidency by becoming the running-mate of a puppet candidate who would resign after being inaugurated. More improbable still, Trump might somehow become Speaker of the House of Representatives — second in the order of succession — and thence climb back to the White House by succeeding or somehow being deemed “acting as president.”</p>\n<p>It would take a vivid imagination to suppose the authors of the 22nd Amendment meant anything other than a simple two-term limit. There is no reason to think the word “elected” was chosen as a loophole for a future would-be autocrat to exploit, as both originalists and textualists would surely have to agree. Only a strict constructionist might find a coherent path through.</p>\n<p>It is impossible to predict what Trump will do when the primaries for 2028 draw near, for the simple reason that, as I <a href=\"https://thehill.com/opinion/finance/5260979-looking-for-logic-in-trumps-tariffs-is-a-fools-errand/\">have said before</a>, he himself does not know what he will do next. An attempt to defy the 22nd Amendment would ultimately be adjudicated by the Supreme Court. Six of its members, including Chief Justice John Roberts, were nominated by Republican presidents, three by Trump himself.</p>\n<p>The court’s recent decisions in cases like <a href=\"https://www.supremecourt.gov/opinions/23pdf/603us1r57_6k47.pdf\">Trump v. United States</a> and <a href=\"https://www.supremecourt.gov/opinions/24pdf/25a169_5h25.pdf\">Noem v. Vasquez Perdomo</a> have indicated sympathy with the administration’s maximalist interpretation of executive power, although its recent ruling against tariffs in <a href=\"https://www.supremecourt.gov/opinions/25pdf/24-1287_4gcj.pdf\">Learning Resources, Inc. v. Trump</a> ameliorated that. But to contort the prima facie meaning of an amendment so overtly? </p>\n<p>The 22nd Amendment has stood strong and firm for 75 years — but for how much longer?</p>\n<p><em>Eliot Wilson is a freelance writer on politics and international affairs and the co-founder of Pivot Point Group. He was senior official in the U.K. House of Commons from 2005 to 2016, including serving as a clerk of the Defence Committee and secretary of the U.K. delegation to the NATO Parliamentary Assembly.</em></p>",
            "kind": 1,
            "link": "https://thehill.com/opinion/white-house/5758358-75th-anniversary-22nd-amendment/",
            "pub_date": "2026-02-28 01:41:04",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5758945,
            "title": "Atlantic reporter says Crockett campaign ejected her from event",
            "description": "<p>Atlantic journalist Elaine Godfrey reported in a piece published on Friday that she had been ejected from a campaign event for Rep. Jasmine Crockett (D-Texas), one of the two Democrats vying for Texas Senate this year – a claim Crockett’s campaign has denied.  </p>\n<p><a href=\"https://www.theatlantic.com/politics/2026/02/texas-senate-democratic-primary-talarico-crockett/686154/?gift=zYCTBrO_7y7KHmiTPdBdgy4WhHAIcXijFBHeV034_ys\">In the piece</a>, Godfrey said a woman with a “badge” had asked her to leave the Crockett campaign event in Lubbock, Texas. </p>\n<p>“They just said, ‘Elaine from Atlantic, white girl with a hat and notepad. She’s interviewing people in the crowd. She’s a top-notch hater and will spin. She needs to leave,’” the woman told Godfrey, according to the Atlantic report.</p>\n<p>Godfrey said she agreed to leave, and was then escorted by guards to a highway near the event. </p>\n<p>The congresswoman in an interview with CBS News denied that her campaign had ejected the reporter. </p>\n<p>“I’ll just say that it’s silly season,” Crockett <a href=\"https://x.com/shawnamizelle/status/2026850494849622342\">told CBS News</a> on Wednesday. She did not mention Godfrey by the name in the interview.  </p>\n<p>“I will say that, you know, there is a specific journalist who is — she has a history of being less than truthful, and frankly, there’s no evidence of anything that she’s talking about. I’ve not seen anything,” Crockett said. </p>\n<p>Crockett also claimed that Godfrey had been sued for defamation and lost. The Atlantic reputed that account on X. </p>\n<p>“We are not sure who this video is describing: Elaine Godfrey has never been sued for defamation, and she was in fact removed from a campaign rally in Lubbock this week,” Anna Bross, senior vice president of communications at The Atlantic, <a href=\"https://x.com/AnnaCBross/status/2027150296405737976\">wrote on X.</a> </p>\n<p>A Crockett campaign spokesperson did not immediately respond to a request for comment from The Hill.   </p>\n<p>In her story in the Atlantic, Godfrey wrote that a Crockett campaign spokesperson did not respond to a request for comment about the incident. </p>\n<p>The series of events sparked criticism of Crockett from some Democrats. </p>\n<p>“Kicking out a reporter is bad. Blatantly lying about it is even worse,” “Pod Save America” podcast co-host Jon Favreau, who served as a speechwriter to former President Obama, <a href=\"https://x.com/jonfavs/status/2027389423692939762\">wrote on X.</a>  </p>\n<p>Democratic strategist Max Burns <a href=\"https://x.com/themaxburns/status/2027410414531653707\">suggested on X</a> that “the more the press consciously frames Crockett as violating the ‘rules’ of the game, the more her supporters rally,” drawing parallels to “Trump’s MAGA core strategy.” </p>\n<p>Godfrey’s piece came after Semafor <a href=\"https://www.semafor.com/article/02/24/2026/texas-senate-candidate-jasmine-crockett-escalates-her-war-on-the-press\">reported</a> on the incident<a href=\"https://www.semafor.com/article/02/24/2026/texas-senate-candidate-jasmine-crockett-escalates-her-war-on-the-press\"> </a>this week. The outlet also said that Crockett’s campaign had called the Capitol Police on a CNN reporter for possible trespassing when he attempted to visit a campaign office location. CNN and Crockett’s team declined to comment on the matter for Semafor’s piece. </p>\n<p>“The Atlantic confirms our story in more detail. Crockett and her spokesperson pretty brazenly lied here. A bizarre move knowing, as I told them, that the Atlantic was going to publish their piece pretty soon anyway,” Semafor’s Max Tani <a href=\"https://x.com/maxwelltani/status/2027169064389337257\">wrote on X.</a></p>\n<p>The controversy comes as Crockett campaigns in the closely watched Democratic primary for Senate in Texas, as her party grows bullish about its chances of flipping incumbent Sen. Jon Cornyn’s (R) seat in the red stronghold. </p>\n<p>One recent survey from the University of Texas/Texas Politics Project found Crockett up by double-digits over her rival, Democrat James Talarico, in a race that’s been seen as a clash between competing approaches for the party in a state that went to Trump by double digits in 2024. </p>\n<p></p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/campaign/5758945-atlantic-journalist-removed-campaign-rally/",
            "pub_date": "2026-02-28 01:16:18",
            "source": "thehill",
            "language": "en"
        }
    ]
}