{
    "data": [
        {
            "id": 5125231,
            "title": "Few prominent political figures viewed favorably: Gallup",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>Americans are more likely to view the <a data-id=\"https://thehill.com/homenews/campaign/5055295-political-winners-losers-2024-election/\" data-type=\"link\" href=\"https://thehill.com/homenews/campaign/5055295-political-winners-losers-2024-election/\">nation’s top politicians</a> in an unfavorable light than a favorable one, according to a new survey.</p>\n<p>In the Gallup poll, <a data-id=\"https://news.gallup.com/poll/656111/few-major-political-figures-rated-positively-balance.aspx\" data-type=\"link\" href=\"https://news.gallup.com/poll/656111/few-major-political-figures-rated-positively-balance.aspx\">released Tuesday</a>, respondents were asked about their view of 14 well-known political figures from the White House to Congress to President Trump’s <a data-id=\"https://thehill.com/homenews/administration/5099360-trump-cabinet-nominees/\" data-type=\"link\" href=\"https://thehill.com/homenews/administration/5099360-trump-cabinet-nominees/\">picks to fill his Cabinet</a> and administration. </p>\n\n<p>The survey takers were largely split on their <a data-id=\"https://thehill.com/homenews/administration/5093247-donald-trump-agenda-personality-survey/\" data-type=\"link\" href=\"https://thehill.com/homenews/administration/5093247-donald-trump-agenda-personality-survey/\">support for Trump</a>, with 48 percent having a favorable opinion of the president. Roughly 50 percent held the opposite view, the poll shows. Another 2 percent did not have an opinion on the commander-in-chief.</p>\n<p>Trump, Vice President Vance, House Speaker Mike Johnson (R-La.), Senate Majority Leader John Thune (R-S.D.), Tulsi Gabbard — the president’s <a data-id=\"https://thehill.com/homenews/senate/5119772-white-house-tulsi-gabbard-confirmation-hearing/\" data-type=\"link\" href=\"https://thehill.com/homenews/senate/5119772-white-house-tulsi-gabbard-confirmation-hearing/\">pick to lead national intelligence</a> — and tech billionaire Elon Musk all received similar ratings, per the survey.</p>\n<p>Secretary of State Marco Rubio, House Minority Leader Hakeem Jeffries (D-N.Y.) and Robert F. Kennedy Jr., Trump’s <a data-id=\"https://thehill.com/homenews/senate/5123633-kennedy-nomination-advances/\" data-type=\"link\" href=\"https://thehill.com/homenews/senate/5123633-kennedy-nomination-advances/\">nominee to head</a> the Department of Health and Human Services (HHS).  each garnered more favorable ratings, about 7 or 8 percent higher, than unfavorable ones, in the latest poll.</p>\n<p>At least one in four adults in the U.S. said they did not know Jeffries or Rubio well enough to have a favorable opinion. Almost half said the same about Thune and Gabbard, the data shows.</p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>Among those featured in the survey, Trump holds the highest favorability rating at 48 percent. His 50 percent unfavorable rating is also one of the highest, falling just below Speaker Emerita Nancy Pelosi (D-Calif.), 56 percent, and former Vice President Harris’s 53 percent.</p>\n<p>Kennedy brought in the second highest favorability rating in the survey, with 46 percent. Musk trails slightly with 43 percent favorability, followed by Vance and Harris, who are tied with 42 percent.</p>\n\n<p>Among the listed figures, the poll shows that Defense Secretary Pete Hegseth, Gabbard and Thune are relatively unknown, while Trump, Harris, Pelosi and Musk are much more widely recognized.</p>\n<p>The Gallup survey was conducted from Jan. 21-27 among 1,001 respondents. It has a margin of error of plus or minus 4 percentage points. </p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/blogs/blog-briefing-room/5125231-political-figures-favorability-ratings-gallup/",
            "pub_date": "2025-02-05 00:50:58",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5125278,
            "title": "Netanyahu has failed the Oct. 7 hostages — Trump must save them ",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>Four hundred eighty-six days ago, my three-year-old great-niece Abigail watched Hamas terrorists brutally murder her parents. Then she was kidnapped and disappeared into Gaza for 51 days.</p>\n<p>From the moment I learned Abigail had been taken, I vowed to do everything possible to bring her home and fight for the release of all the 246 people <a href=\"https://www.wsj.com/world/middle-east/hamas-hostages-israel-gaza-41432124\" rel=\"noreferrer noopener\" target=\"_blank\">stolen on Oct. 7, 2023</a> — many of them taken in their pajamas from their beds.</p>\n\n<p>I’ve shared Abigail’s tragic story in media interviews, with world leaders, and in meetings across the globe. I’ve shown them her photo, her striking brown eyes filled with innocence. Every day, I looked into those eyes, making the promise to do everything I could to bring her home. </p>\n<p>A few weeks after Oct. 7, I was in Washington, meeting with six female Republican senators. I asked them to be Abigail’s voice since her parents were gone. Sen. Susan Collins (R-Maine) took Abigail’s photo and showed the world what the face of a hostage looked like — her face, her eyes.</p>\n<p>I met with President Biden and members of his administration — CIA Director Bill Burns, Defense Secretary Lloyd Austin, national security adviser Jake Sullivan, Secretary of State Antony Blinken, special envoy Brett McGurk and other key leaders on Capitol Hill. I watched as tears welled in the eyes of these powerful men as I shared Abigail’s story. In their eyes, I saw not just empathy, but the weight of the responsibility they carried in that moment. </p>\n<p>I sat in Doha with Prime Minister Mohammed bin Abdulrahman Al-Thani after Abigail’s release. As I shared the details of her kidnapping and freedom, I watched this powerful leader, a father himself, wipe away tears, moved by the depth of Abigail’s tragedy. </p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>By November 2023, Abigail and 104 other women and children <a href=\"https://www.cnn.com/2023/11/26/politics/abigail-edan-jake-sullivan-national-security-adviser-israel-gaza-hostages-cnntv/index.html\" rel=\"noreferrer noopener\" target=\"_blank\">had been released</a>, but the deal soon broke down. This left more than 100 others still trapped in Hamas’s grasp. A new deal was proposed, but there was <a href=\"https://apnews.com/article/israel-palestinians-hamas-war-news-06-24-2024-f5de2ed8288ac3cdb02c4e9e2fbaeda1\" rel=\"noreferrer noopener\" target=\"_blank\">no political will</a> from Prime Minister Benjamin Netanyahu or Hamas to sign it. It wasn’t until President Trump took charge that the push for hostages’ release gained real momentum. Even before his inauguration, he made it clear that the hostages must be freed, or there would be <a href=\"https://www.youtube.com/watch?v=7wee-nL08ZQ\" rel=\"noreferrer noopener\" target=\"_blank\">“hell to pay.”</a></p>\n<p>On Jan. 20, 2025, at Arena One in Washington, D.C., Trump’s special envoy, Steve Witkoff, <a href=\"https://www.youtube.com/watch?v=KPlg_N90jqw\" rel=\"noreferrer noopener\" target=\"_blank\">introduced the hostage families.</a> He vowed to bring every last one home. When I stepped onto the stage following Special Presidential Envoy for Hostage Affairs Adam Boehler, I saw a packed house and the Trump family. I looked into their eyes and saw both the pain for our suffering and the unwavering support for our cause. As I shook Trump’s hand, I simply said, “Thank you. I know you can bring all of our hostages home right away.” He met my gaze, nodded in agreement, and I knew at that moment that his commitment was real. </p>\n\n<p>Trump and Witkoff made possible <a href=\"https://www.state.gov/release-of-keith-siegel-and-hostages-in-gaza/\" rel=\"noreferrer noopener\" target=\"_blank\">the release</a> of nine women, five Thai workers, and four men — among them, 66-year-old American grandfather Keith Siegel. These individuals had endured nearly 500 days of torture and starvation but walked free.  </p>\n<p>I’ll never forget the terrified eyes of 29-year-old Arbel Yehud, pushed by angry, masked captors toward the Red Cross car after enduring months of isolation and suffering. Or the hollow gaze of Yarden Bibas, tortured by Hamas after losing his wife, Shiri, and their two small children. The image of Shiri’s panicked eyes, clutching Kfir and Ariel before being torn from their home, will haunt me forever. </p>\n<p>In Hostage Square in Israel, <a href=\"https://www.theguardian.com/world/2025/jan/25/they-survived-hell-israel-hails-the-homecoming-of-freed-female-soldiers\" rel=\"noreferrer noopener\" target=\"_blank\">crowds of Israelis gather</a> to celebrate the survivors’ homecomings. There are tears of joy, warm hugs and a feeling with each free person that hope for the release of all the hostages is alive. With this, we are all reminded that the fight continues. Over 80 hostages are <a href=\"https://www.pbs.org/newshour/world/excitement-and-anxiety-in-israel-over-expected-release-of-high-profile-male-hostages\" rel=\"noreferrer noopener\" target=\"_blank\">still in captivity</a>. Among them are two Americans: Sagui Dekel-Chen, a young father of three, and Edan Alexander, a 21-year-old who has been held for 486 days. </p>\n<div class=\"civic-science-article-container civic-science-more-14 civic-is-mr3\" data-civicscience-widget=\"3f127ebd-287e-0b64-a901-d55ec286348a\" id=\"civsci-id-civsci-id-596708068\"></div>\n<p>Recently, Edan’s grandmother Adva gave me a photo of him. I’ve looked at that photo countless times, and every time, it breaks me. In his eyes, I see my own young son — free to live his life, while Edan is still imprisoned, unable to experience the life my son takes for granted. </p>\n<p>In July 2024, Biden invited U.S. hostage families to <a href=\"https://www.axios.com/2024/07/12/families-us-hostages-gaza-ask-meet-netanyahu\" rel=\"noreferrer noopener\" target=\"_blank\">meet with him and Netanyahu.</a> During that meeting, I looked into both Biden’s sparkling blue eyes and Netanyahu’s steely ones, asking about their commitment to our families.  </p>\n<p>Biden pledged to do everything possible for the rapid release of the hostages. Netanyahu said the deal was close and that he was ready to sign it. But six months passed, and Netanyahu failed to follow through.  </p>\n\n<p>Hostages like American Hersh Goldberg Polin, who were on the list to be released, were <a href=\"https://abcnews.go.com/International/who-were-6-hostages-killed-gaza-funerals-israel-hersh-goldberg-polin/story?id=113322975\" rel=\"noreferrer noopener\" target=\"_blank\">executed in captivity</a>. Despite the promises, the agreement was never carried out, and innocent lives that could have been saved were lost. The prime minister told us the deal was “almost ready,” but it was never signed. </p>\n<p>Netanyahu <a href=\"https://www.nbcnews.com/politics/white-house/donald-trump-israeli-prime-minister-benjamin-netanyahu-meeting-rcna190449\" rel=\"noreferrer noopener\" target=\"_blank\">meets with Trump</a> at the White House today. I hope and pray that Trump looks him in the eye and says, “With my deal, not only will I ensure all the American hostages are released, but I will bring home every single hostage. Steve Witkoff and my team will stay in the region and work with the Qataris and Egyptians to ensure that Hamas releases every last hostage.”</p>\n<p>And I hope Trump continues, “I am the Deal Maker. If anyone goes back on the deal, there will be hell to pay.” </p>\n\n<p><em>Liz Hirsh Naftali is a hostage release advocate and humanitarian ambassador and author of </em><a href=\"https://www.amazon.com/Saving-Abigail-Abduction-Three-Year-Old-Hostage/dp/B0DGSQ6Q7N\" rel=\"noreferrer noopener\" target=\"_blank\"><em>“Saving Abigail”</em></a><em></em> </p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/opinion/international/5125278-hostage-release-trump-netanyahu/",
            "pub_date": "2025-02-05 00:45:55",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5125472,
            "title": "Higher education groups sue Trump over anti-diversity orders",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>Higher education groups are suing the Trump administration over its executive orders eliminating diversity, equity and inclusion (DEI) positions in government and his threatening the loss of funding to institutions over the issue.  </p>\n<p>The National Association of Diversity Officers in Higher Education and the American Association of University Professors, along with the city of Baltimore and a restaurant group, are asking the courts to block the implementation of the executive orders due to President Trump allegedly exceeding his authority under the Constitution.  </p>\n\n<p>The executive orders Trump signed seek to remove all DEI programs and positions from the federal government and institutions connected to the government that receive federal funding. </p>\n<p>“In the United States, there is no king. The President can exercise only those powers the Constitution grants to the executive, and only in ways that do not violate the rights the Constitution grants to the American people. In his crusade to erase diversity, equity, inclusion, and accessibility from our country, President Trump cannot usurp Congress’s exclusive power of the purse, nor can he silence those who disagree with him by threatening them with the loss of federal funds and other enforcement actions,” the suit reads.  </p>\n<p>Trump has threatened civil investigations and loss of funding to get institutions to comply and has called for investigation into DEI <a href=\"https://thehill.com/homenews/education/5103461-trump-anti-dei-colleges-universities-endowments/\" rel=\"noreferrer noopener\" target=\"_blank\">against schools with endowments over $1 billion</a>. </p>\n<p>The Department of Education and other agencies will have to recommend “appropriate measures to encourage the private sector to end illegal discrimination and preferences, including DEI.”   </p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>The Hill has reached out to the Justice Department for comment.  </p>\n<p>Dozens of employees with the Education Department have been <a href=\"https://thehill.com/homenews/education/5123000-education-department-dei-trump/\" rel=\"noreferrer noopener\" target=\"_blank\">put on administrative leave</a> due to Trump’s DEI executive orders, with the union representing the staffers saying many of them attended a DEI training hosted in 2019 during his first term.  </p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/homenews/education/5125472-higher-education-trump-anti-diversity-dei/",
            "pub_date": "2025-02-05 00:40:58",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5123881,
            "title": "Active seniors: America’s gerontocracy problem",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>The past three presidential inaugurations have set a dubious record: Each saw the oldest man in history sworn into America’s highest office.</p>\n<p>In 2017, Donald Trump, aged 70, became the oldest president to begin a term, comfortably surpassed in 2021 by 78-year-old Joe Biden. And when Trump took the oath of office again last month, he was 159 days older than Biden was four years ago.</p>\n\n<p>Biden’s age and cognitive condition were central elements of the early election campaign. They weighed so heavily that he was forced to withdraw from the race in July, clearing the path for Vice President Kamala Harris to take on Trump, who had attacked Biden relentlessly as “Sleepy Joe.”</p>\n<p>The issue was given additional piquancy by the public deterioration of Sen. Dianne Feinstein (D-Cali.), elected to a fifth term in 2018 at age 85. Within two years, rumors of her cognitive decline and short-term memory loss were ubiquitous. In early 2023, Feinstein announced she would not seek reelection and then spent two months in the hospital with shingles. Her absence from the Senate Judiciary Committee delayed a number of confirmation hearings. When Feinstein returned, she was visibly frail and dependent on staff, and she died in September at the age of 90. There was a general feeling that her public decline was both damaging and undignified.</p>\n<p>Meanwhile, there are serious anxieties about the lack of political engagement by younger voters. They often feel that mainstream politics neither represents nor serves them, and they consistently vote in smaller numbers than any other age group.</p>\n<p>Younger politicians, more in tune with the concerns of voters of the same age cohort, have often been seen as a solution. When Rep. Alexandria Ocasio-Cortez (D-N.Y.) won a House seat in 2018, she was at 29 the youngest woman ever elected to Congress, with star power and a potent platform.</p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>While Trump is the oldest president ever sworn into office, 40-year-old Vice President JD Vance is the third-youngest to take on the role (after John Breckinridge, James Buchanan’s running mate, and Richard Nixon). Trump has also nominated relatively young candidates for major executive branch roles: Secretary of Defense Pete Hegseth is 44; Tulsi Gabbard, the nominee for director of National Intelligence, is 43; and the presumptive ambassador to the United Nations is 40-year-old Elise Stefanik. The new White House Press Secretary, Karoline Leavitt, is 27.</p>\n<p>This leavening of youth stands out against a stubborn backdrop of gerontocrats. Senate Judiciary Chair Chuck Grassley (R-Iowa) is 91. His colleague, Senate Foreign Relations Chair Jim Risch (R-Idaho) is 81. The ranking member of the latter committee, Sen. Jeanne Shaheen (D-N.H.), is 77. Senate Minority Leader Chuck Schumer (D-N.Y.) is 75 and his deputy, Sen. Dick Durbin (D-Ill.), is 80.</p>\n\n<p>In the executive branch, Linda McMahon, proposed as secretary of Education, is 76; Robert F. Kennedy Jr., nominee to run Health and Human Services, is 71; and Secretary of the Interior Doug Burgum is 68.</p>\n<p>This is partly a structural issue. The Senate relies heavily on seniority for leadership and committee assignments, an in-built bias towards older legislators. But choices are being made too: When House Democrats selected the ranking member of the Oversight Committee, Ocasio-Cortez lost out to Rep. Gerry Connolly (D-Va.), who will soon be 75.</p>\n<p>The ideal polity would strike a balance between hard-won experience and youthful vigor. The lack of youth engagement in the political process is a serious matter. We cannot simply roll our eyes: it is hardly surprising that some younger voters feel little affinity with a system in which the third man in the presidential order of succession is Grassley, who was born the same year President Franklin D. Roosevelt took office.</p>\n<div class=\"civic-science-article-container civic-science-more-14 civic-is-mr3\" data-civicscience-widget=\"3f127ebd-287e-0b64-a901-d55ec286348a\" id=\"civsci-id-civsci-id-596708068\"></div>\n<p>Some favor term limits for members of the House and, especially, the Senate. This would certainly increase turnover; nine of the 100 senators have served more than 25 years.</p>\n<p>Perhaps, though, that approaches the issue from the wrong end. While a few legislators and — one could argue — presidents outstay their welcome, the real problem is the dearth of younger leaders. Eighty-eight senators are over 50, while less than 10 percent of the House is under 40.</p>\n<p>Effective and legitimate legislative and executive branches should reflect a sense of the nation they serve, without needing to replicate it exactly. Turnout among voters aged 18 to 24 <a href=\"https://www.statista.com/statistics/1096299/voter-turnout-presidential-elections-by-age-historical/\" rel=\"noreferrer noopener\" target=\"_blank\">rose sharply</a> in the 2020 presidential election but <a href=\"https://circle.tufts.edu/2024-election#overall-youth-turnout-down-from-2020-but-strong-in-battleground-states\" rel=\"noreferrer noopener\" target=\"_blank\">fell back</a> in 2024; it remains the lowest of the age cohorts and well below the national average.</p>\n\n<p>Much has been made of the role of Barron Trump, the president’s 18-year-old son, in helping his father reach younger voters. He is said to have recommended Trump’s appearance on <a href=\"https://youtu.be/hBMoPUAeLnY?si=xRMUxeFK0ojG6fuz\" rel=\"noreferrer noopener\" target=\"_blank\">The Joe Rogan Experience</a>, which has a <a href=\"https://www.newsweek.com/donald-trump-joe-rogan-podcast-1975331\" rel=\"noreferrer noopener\" target=\"_blank\">strong following among young men</a>. You do not need to wear a MAGA hat to see the value in thinking differently about communicating with potential voters.</p><!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://thehill.com/submitting-opinion-content/\"><img alt=\"\" class=\"wp-image-4329764\" decoding=\"async\" height=\"121\" loading=\"lazy\" sizes=\"(max-width: 899px) 100vw, 600px\" src=\"https://thehill.com/wp-content/uploads/sites/2/2023/11/op2.png?w=600\" srcset=\"https://thehill.com/wp-content/uploads/sites/2/2023/11/op2.png?resize=600,121 600w, https://thehill.com/wp-content/uploads/sites/2/2023/11/op2.png?resize=300,61 300w, https://thehill.com/wp-content/uploads/sites/2/2023/11/op2.png?resize=50,10 50w\" width=\"600\"/></a></figure>\n<p>If younger people are not visible in politics, it is less likely that younger voters will engage, and the reverse is true. Whether term limits or informal persuasion within the parties is necessary to ease politicians into retirement when the time comes is a matter of taste, but it can be part of a broader shift. A larger cohort of able younger legislators and officials will exercise their own pressure from below.</p>\n<p>Politics should not feel like “Logan’s Run,” with men and women dispatched to the Carousel when they reach a certain age, but senescence cannot be the dominant feature either. If Vance moves to the Oval Office after Trump’s term, he would be the third-youngest president in history. Things can change quickly, but the next election is a long way away.</p>\n\n<p><em>Eliot Wilson is a freelance writer on politics and international affairs and the co-founder of Pivot Point Group. He was senior official in the U.K. House of Commons from 2005 to 2016, including serving as a clerk of the Defence Committee and secretary of the U.K. delegation to the NATO Parliamentary Assembly.</em></p>\n<script type=\"text/javascript\">window.NREUM||(NREUM={});NREUM.info={\"beacon\":\"bam.nr-data.net\",\"licenseKey\":\"bb199f70cb\",\"applicationID\":\"738543775\",\"transactionName\":\"MQNTMhdXDxECABBZDAhJchMWQg4PTBMLQxdIFl4VEQ==\",\"queueTime\":0,\"applicationTime\":1944,\"atts\":\"HURERF9NHE5BAkYKGBsb\",\"errorBeacon\":\"bam.nr-data.net\",\"agent\":\"\"}</script>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/opinion/campaign/5123881-active-seniors-americas-gerontocracy-problem/",
            "pub_date": "2025-02-05 00:31:07",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5125327,
            "title": "Climate change-fueled extreme weather could cost real estate market $1T+: Study",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>The impacts of climate change could cost real estate nearly $1.5 trillion in value, according to a <a href=\"https://firststreet.org/research-library/property-prices-in-peril\">study</a> published Monday by climate risk modeler First Street.</p>\n<p>Researchers write that climate change is both driving up insurance costs and affecting consumer preferences, which combined create a “feedback loop” where populations move in accordance with climate risk rather than existing property values. Insurance as a share of mortgage payments has soared over the past 10 years, going from around 8 percent in 2013 to 20 percent in 2022, according to the report.</p>\n<p>This is expected to throw a wrench into decades of growth in the Sun Belt region in particular, where three states — Texas, Florida and California — have comprised nearly half of all natural disaster-related costs over the past four decades. </p>\n<p>The report projects that more than 55 million Americans will move to less climate-vulnerable regions of the country over the next 30 years, including 5.2 million this year. During the same 30-year period, the report projects that 70,026 neighborhoods nationwide will lose property value due to climate-related vulnerabilities, a net loss of $1.47 trillion.</p>\n<p>The heaviest spikes in insurance premiums will be largely concentrated in the Sun Belt, according to the report, with Miami highest at 322 percent, followed by Jacksonville, Fla., with 226 percent and Tampa, Fla., with 213 percent. New Orleans, with a spike of 196 percent, is the only major metropolitan area outside the Sun Belt in the top five for premium increases.</p>\n<p>Insurers in particular have been increasingly reactive to the risks of climate change such as more intense wildfires and climate change. Major home insurers have recently pulled out of California and Florida, the latter of which also has high rates of fraud and litigation. California <a href=\"https://thehill.com/policy/energy-environment/5061625-california-insurers-regulations-high-risk-areas-coverage/\">enacted</a> a state regulation at the end of last year that will require insurers to offer coverage in wildfire-prone areas.</p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/policy/energy-environment/5125327-climate-change-real-estate-loss-study/",
            "pub_date": "2025-02-05 00:10:55",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5125360,
            "title": "University of California student group alleges racial discrimination in admissions",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>A University of California student group sued the school system on Monday, alleging racial discrimination in admissions.  </p>\n<p>Students Against Racial Discrimination filed a suit saying the university system gives “discriminatory preferences to non-Asian racial minorities.” </p>\n\n<p>The suit says Asian American and white applicants are turned away while Black and Hispanic students “are often placed at significant academic disadvantage, and thus experience worse outcomes, because of the university’s use of racial preferences.” </p>\n<p>The student group is accusing the University of California of violating Title VI of the Civil Rights Act, the 14<sup>th</sup> Amendment and Proposition 206 in California, which forbids race as a factor in public education.  </p>\n<p>The suit points to actions taken by the system, such as encouraging its schools to adopt “holistic” admission policies that a previous chancellor said would help with low admission rates of minority students, comparing admission rates of Black applicants between 2010 and 2023 and the system allegedly shutting down resources outsiders could use to study this issue.</p>\n<p>“Trends in racial admissions patterns consistently show that the adoption of the holistic process favored black and Hispanic admissions and disfavored Asian-Americans and, to a lesser extent, whites,” the suit reads. </p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>One of the attorneys for the student group is Jonathan Mitchell, a prominent conservative attorney who regularly brings cases to the Supreme Court. </p>\n<p>The Hill has reached out to the University of California for comment.  </p>\n\n<p>The lawsuit comes after the Supreme Court <a href=\"https://thehill.com/regulation/court-battles/4061133-supreme-court-hands-down-fatal-blow-to-college-affirmative-action/\" rel=\"noreferrer noopener\" target=\"_blank\">ruled in 2023</a> that affirmative action could not be used in higher education. </p>\n<p>Schools have been <a href=\"https://thehill.com/homenews/education/4151787-biden-administration-releases-diversity-guidance-for-universities-after-supreme-courts-affirmative-action-ban/\" rel=\"noreferrer noopener\" target=\"_blank\">searching for other ways</a> to ensure diversity among their students, meaning that the fight over how race and ethnic information is used among colleges and universities is not over.  </p>\n<p>One likely next battleground will be around college scholarships that include a race or ethnicity portion, with <a href=\"https://thehill.com/homenews/education/5083087-mcdonalds-latino-scholarships-dei-lawsuit-diversity-trump/\" rel=\"noreferrer noopener\" target=\"_blank\">one lawsuit</a> already in the court system over the issue</p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/homenews/education/5125360-university-of-california-students-racial-discrimination/",
            "pub_date": "2025-02-05 00:10:54",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5123035,
            "title": "Even Mexico should recognize cartels as terrorist organizations",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>The undeclared war against the Mexican criminal cartels went hot again last Monday, when cartel <a href=\"https://foxsanantonio.com/newsletter-daily/border-patrol-agents-allegedly-shot-at-from-mexico-on-disputed-land-texas-dps-confirms-local-news-near-me-immigration-border-crisis-migrants\">gunmen opened fire on U.S. Border Patrol agents in Fronton, Texas</a>, during an illegal smuggling operation.</p>\n<p>Mexican cartels, terror organizations by any reasonable definition, now feel so emboldened they are shooting at American law enforcement on U.S. soil. This is precisely why President Trump’s <a href=\"https://foreignpolicy.com/2025/01/21/trump-drug-cartels-foreign-terrorist-organization-mexico-immigration-executive-order/\">decision to designate these cartels as foreign terrorist organizations</a> was not just necessary — it was long overdue.</p>\n\n<p>But the real question here is not why the U.S. designated these cartels as terrorists, but why Mexico has not. How can the Mexican government even pretend to claim sovereignty when up to <a href=\"https://thefederalist.com/2021/04/28/former-us-ambassador-to-mexico-cartels-control-up-to-40-percent-of-mexican-territory/\">40 percent</a> of its territory is under cartel control?</p>\n<p>For years, Mexico has either turned a blind eye or been too weak to confront these monstrous syndicates, allowing them to terrorize both Mexicans and Americans. Meanwhile, Trump’s bold move has redefined U.S. policy, marking the first time in a generation that the U.S. has stood up to Mexico’s inaction on cartels.</p>\n<p>The foreign terrorist organization designation <a href=\"https://www.texaspolicy.com/arming-america-to-win-designating-the-mexican-cartels-as-foreign-terrorist-organizations-ftos/\">is a game-changer</a>, as it unlocks critical tools for U.S. law enforcement to combat these terrorists — seizing assets, charging material support to terrorism, and even deploying Special Forces if necessary. This wasn’t possible before, and it is outrageous that it took so long for anyone in power to act.</p>\n<p>As <a href=\"https://www.texaspolicy.com/multimedia/article/the-hard-country-episode-26-trump-and-the-new-world\">others have argued</a>, Trump’s decisive action on cartels already makes his presidency one of the most consequential in a generation even if he accomplishes nothing else for the next four years.</p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>Yet while the U.S. is fighting back, Mexico remains paralyzed. In a typical move of deflection that no longer surprises anyone, <a href=\"https://www.gob.mx/presidencia/prensa/siempre-voy-a-defender-a-mexico-por-encima-de-todo-presidenta-claudia-sheinbaum-sobre-ordenes-ejecutivas-firmadas-por-el-presidente-de-eua-donald-trump?idiom=es-MX\">Mexican President Claudia Sheinbaum parroted empty slogans</a> about Mexico’s “sovereignty” and “independence” — but what sovereignty is left when cartels control up to 40 percent of your country’s territory?</p>\n<p>Mexico has spent years refusing to confront these cartels as the terrorist organizations they are — letting their citizens live in terror while longing for their government to act. A <a href=\"https://www.texaspolicy.com/press/results-from-tppfs-mexico-security-survey-highlight-growing-urgency-for-action-against-cartels-and-support-for-u-s-partnership\">recent survey by my organization</a> shows that 78 percent of Mexicans see their country’s security risks as unacceptable, yet Mexico’s government denies reality, playing the victim instead of stepping up.</p>\n\n<p>Why does Mexico refuse to call cartels what they are — terrorists? The answer is simple: money and corruption. Cartels are entrenched in every corner of Mexican society, from the streets to the halls of power.</p>\n<p>Andrés Manuel López-Obrador, Mexico’s last president, went so far as to admire drug lords, <a href=\"https://apnews.com/article/mexico-president-drug-cartels-violence-8f2c0ef01c2e4578c089d67adb02e447\">claiming they were more “respectful”</a> than white-collar criminals and <a href=\"https://www.theguardian.com/world/2023/may/31/mexico-president-peace-agreement-cartels\">proposing “social pacts”</a> with them.</p>\n<p>He also made it clear that Mexico would not tolerate any U.S. intervention in its fight against organized crime or drug traffickers. He frequently accused U.S. officials of overstepping, and in <a href=\"https://www.texaspolicy.com/amlo-sides-with-the-cartels/\">April 2023</a>, he boldly declared that he would use Mexico’s armed forces to protect trafficking cartels from U.S. action.</p>\n<div class=\"civic-science-article-container civic-science-more-14 civic-is-mr3\" data-civicscience-widget=\"3f127ebd-287e-0b64-a901-d55ec286348a\" id=\"civsci-id-civsci-id-596708068\"></div>\n<p>His “<a href=\"https://apnews.com/article/mexico-president-drug-cartels-violence-8f2c0ef01c2e4578c089d67adb02e447\">hugs, not bullets</a>” policy isn’t just weak — it’s a surrender to organized crime. How can the Mexican government claim to care about its people when it protects the very terrorists killing them? Why else would the government care so much about the fate of these drug traffickers unless it is colluding?</p>\n<p>Mexico’s refusal to label cartels as terrorists only highlights its political dysfunction and complicity. Trump deserves full credit for his decisive actions. It is time for Mexico to wake up and take responsibility. If it won’t, the U.S. will continue to do what Mexico refuses to — protect its own citizens and its borders.</p>\n<p>For too long, U.S. administrations have played nice with Mexico, afraid to upset the status quo. Under Trump, for the first time in a generation, there is accountability. The U.S. is defending its sovereignty — and Mexico is taken aback. </p>\n\n<p>It’s about time for Mexico to stop pretending that the cartels are anything but the terrorist organizations they are. If Mexico won’t do it, the U.S. will.</p>\n<p><em>Melissa Ford is a senior fellow for the Texas Public Policy Foundation’s Secure and Sovereign Texas campaign, which strives to keep our nation safe and free.</em></p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/opinion/national-security/5123035-us-designates-cartels-terrorist-organizations/",
            "pub_date": "2025-02-05 00:05:56",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5124862,
            "title": "Watch live: Rubio holds press conference with Costa Rican president",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>Secretary of State Marco Rubio is in <a data-id=\"https://thehill.com/homenews/ap/ap-international/ap-as-trump-threatens-mass-deportations-central-america-braces-for-an-influx-of-vulnerable-migrants/\" data-type=\"link\" href=\"https://thehill.com/homenews/ap/ap-international/ap-as-trump-threatens-mass-deportations-central-america-braces-for-an-influx-of-vulnerable-migrants/\">Costa Rica</a> Tuesday, where he will give remarks to the press alongside Costa Rican President Rodrigo Chavez.</p>\n<p>Rubio’s travel through Central America and the Caribbean in his first major trip <a data-id=\"https://thehill.com/policy/international/5096622-senate-confirms-marco-rubio-secretary/\" data-type=\"link\" href=\"https://thehill.com/policy/international/5096622-senate-confirms-marco-rubio-secretary/\">at the helm</a> of the State Department has been largely focused on curbing illegal immigration into the U.S. and addressing drug trafficking. He has also recently <a data-id=\"https://thehill.com/policy/international/5122307-rubio-warns-panama-over-canal-saying-current-status-is-unacceptable/\" data-type=\"link\" href=\"https://thehill.com/policy/international/5122307-rubio-warns-panama-over-canal-saying-current-status-is-unacceptable/\">visited Panama</a> and El Salvador and is slated to also make a trip to the Dominican Republic.</p>\n<p>His trip to Costa Rica’s <a data-id=\"https://thehill.com/policy/international/5103280-rubio-travel-panama/\" data-type=\"link\" href=\"https://thehill.com/policy/international/5103280-rubio-travel-panama/\">southern neighbor</a> came as President Trump has <a data-id=\"https://thehill.com/policy/defense/5074900-trump-provokes-anxieties-with-greenland-panama-canal-military-talk/\" data-type=\"link\" href=\"https://thehill.com/policy/defense/5074900-trump-provokes-anxieties-with-greenland-panama-canal-military-talk/\">proposed a plan</a> for the U.S. to <a data-id=\"https://thehill.com/policy/national-security/5054342-trump-proposes-taking-control-panama-canal/\" data-type=\"link\" href=\"https://thehill.com/policy/national-security/5054342-trump-proposes-taking-control-panama-canal/\">regain control</a> of the Panama Canal. Panama’s government, however, has <a data-id=\"https://thehill.com/policy/international/5118579-panama-president-rejects-negotiations-panama-canal/\" data-type=\"link\" href=\"https://thehill.com/policy/international/5118579-panama-president-rejects-negotiations-panama-canal/\">pushed back</a> on the efforts.</p>\n<p>The presser comes as the Trump administration has <a data-id=\"https://thehill.com/homenews/administration/5124147-trump-musk-usaid-attacks/\" data-type=\"link\" href=\"https://thehill.com/homenews/administration/5124147-trump-musk-usaid-attacks/\">seemingly moved to merge</a> the State Department and the U.S. Agency for International Development (USAID).</p>\n<p>The event in San Jose, Costa Rica, is scheduled to begin at 11:50 a.m. EST.</p>\n<p>Watch the live video above.</p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/video-clips/5124862-watch-live-rubio-holds-press-conference-with-costa-rican-president/",
            "pub_date": "2025-02-05 00:05:54",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5125246,
            "title": "Trump says ‘something really wrong’ with autism rates ahead RFK Jr vote",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>President Trump shared figures inflating the spike in autism in a post Tuesday morning promoting his pick to lead the Health and Human Services agency, highlighting a key data point in Robert F. Kennedy Jr.’s debunked theories around a link between autism and vaccines.</p>\n<p>“20 years ago, Autism in children was 1 in 10,000. NOW IT’S 1 in 34. WOW! Something’s really wrong. We need BOBBY!!! Thank You! DJT,” Trump said <a href=\"https://truthsocial.com/@realDonaldTrump/113946130240319294\" rel=\"noreferrer noopener\" target=\"_blank\">on Truth Social</a>.</p>\n\n<p>Autism diagnoses have been rising, though Trump misstated on Tuesday in his Truth Social post the extent of the increase. About 1 in 36 children now have a diagnosis of autism spectrum disorder (ASD), according to estimates from the Centers for Disease Control and Prevention (CDC), compared to about 1 in 150 in 2000.</p>\n<p>Trump has repeatedly <a href=\"https://thehill.com/policy/healthcare/5042497-trump-vaccines-autism-mandates-rfk-jr/\" rel=\"noreferrer noopener\" target=\"_blank\">drawn a false connection</a> between vaccines and autism rates— saying in December that he thinks there are “problems with vaccines”— and has suggested his administration, including Kennedy if confirmed, <a href=\"https://thehill.com/policy/healthcare/5030325-trump-rfk-jr-debunked-vaccine-autism-link-conspiracy-theory-hhs-cdc/\" rel=\"noreferrer noopener\" target=\"_blank\">would investigate</a> a debunked link between the two. </p>\n<p>The Senate Finance Committee <a href=\"https://thehill.com/homenews/senate/5123633-kennedy-nomination-advances/\">voted Tuesday morning</a> to advance Kennedy in a party-line vote, despite Democrats railing against his longtime promotion of vaccine misinformation. Sen. Bill Cassidy (R-La.), who <a href=\"https://thehill.com/policy/healthcare/5119803-cassidy-vote-kennedy-hhs/\">expressed reservations about Kennedy</a> during committee hearings last week, ultimately <a href=\"https://x.com/SenBillCassidy/status/1886797538256113893\">voted yes</a> on his confirmation. </p>\n<p>Kennedy has promoted the theory that childhood vaccines have led to an increase in autism and chronic illnesses, despite studies repeatedly showing otherwise. </p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>Experts have attributed the increase in autism rates to better awareness of symptoms in children and changing criteria to diagnose ASD in kids. </p>\n<p>Senate Democrats <a href=\"https://thehill.com/homenews/senate/5113645-kennedy-democrats-abortion-vaccines-hearing/\" rel=\"noreferrer noopener\" target=\"_blank\">grilled Kennedy last week</a> in his confirmation hearing over his controversial stances on vaccines and shifting position on abortion, but neither issue proved persuasive to the Senate Finance Republicans. Kennedy could still be voted down in a full Senate vote.</p>\n\n<p>Kennedy also has a financial stake in a lawsuit against pharmaceutical giant Merck over its vaccine that protects against human papillomavirus. He told Sen. Elizabeth Warren (D-Mass.) in the hearing last week that <a href=\"https://thehill.com/policy/healthcare/5119110-robert-f-kennedy-divest-vaccine-lawsuit/\" rel=\"noreferrer noopener\" target=\"_blank\">he will not profit</a> from the litigation, if confirmed.</p>\n<p>The White House kept the pressure up on GOP senators on Tuesday.</p>\n<p>“There are tens of millions of Americans who are hopeful that RFK Jr. will be the next HHS secretary and we expect all senate republicans to stand tough and strong and vote for him,” press secretary Karoline Leavitt told reporters.</p>\n<p><em>Nathaniel Weixel contributed to this report.</em></p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/policy/healthcare/5125246-trump-autism-vaccine-kennedy/",
            "pub_date": "2025-02-05 00:01:10",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5125254,
            "title": "UFC fighter says he’s ‘definitely not a Nazi’ after comments spark criticism",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>Ultimate Fighting Championship (UFC) fighter Bryce Mitchell distanced himself from his past comments about Adolf Hitler, saying he’s “definitely not a Nazi” after his comments sparked backlash, including from the promotion’s head, Dana White.  </p>\n<p>“I’m sorry I sounded insensitive,” Mitchell <a href=\"https://www.instagram.com/p/DFi3qTjS72Z/?utm_source=ig_web_copy_link\">wrote</a> in a Saturday statement on Instagram. “I definitely was not trying to offend anybody, but I know I did. I know that a lot of people died in the Holocaust, and that’s a fact. Hitler did a lot of evil things, I think we can all agree on that. I’m definitely not a Nazi, and definitely do not condone any of the evil things Hitler did.”</p>\n\n<p>In the first episode of his podcast “ArkanSanity,” Mitchell, a featherweight UFC martial artist, said Hitler was a “good guy” who defended his nation during World War II. He described the leader of the Third Reich, who was responsible for a genocide that killed millions, as “a guy I’d go fishing with.”</p>\n<p>“I really do think before Hitler got on meth, he was a guy I’d go fishing with. He fought for his country. He wanted to purify it by kicking the greedy Jews out that were destroying his country and turning them all into gays,” Mitchell said during the podcast. </p>\n<p>Mitchell was <a href=\"https://thehill.com/blogs/in-the-know/5120007-dana-white-hitler-salute-ufc/\">denounced by White</a> who called Hitler “one of the most disgusting and evil human beings to ever walk the Earth, and anyone that even tries to take an opposing position is a moron.” </p>\n<p>“I’ve heard a lot of dumb and ignorant s‑‑‑ said over the years, but this is probably the worst,” White said last Thursday. “First of all, when you talk about Hitler, he was responsible for the death of 6 million Jews, and it was his intent to completely eliminate the Jewish people. And that’s a guy you would want to go fishing with?” </p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>White said that Mitchell will not face any disciplinary measures, referring to “free speech.” </p>\n<p>Mitchell has a 17-3 professional record. The 30-year-old won his last bout in December against Kron Gracie.</p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/blogs/in-the-know/5125254-ufc-bryce-mitchell-hitler-remarks/",
            "pub_date": "2025-02-04 23:55:57",
            "source": "thehill",
            "language": "en"
        }
    ]
}