{
    "data": [
        {
            "id": 5760308,
            "title": "Democrats warn Trump could pull US into long Middle East war",
            "description": "<p>Democrats reacting to the U.S. air strikes on Iran are calling on President Trump to provide further information to Congress while warning the White House it could be dragging the U.S. into a wider war in the Middle East.</p>\n<p>Sen. Mark Warner (D-Va.), the ranking Democrat on the Senate Intelligence Committee, questioned the need for the attack in his statement, and warned the U.S. could be repeating “mistakes of the past” in a nod to the Iraq War launched by former President George W. Bush.</p>\n<p>“Iran’s leadership has long supported terrorism across the region, undermined regional stability, continued to advance its nuclear ambitions, and brutally repressed its own people,” Warner wrote. “But acknowledging those realities does not relieve any president of the responsibility to act within the law, with a clear strategy, and with Congress.</p>\n<p>“The American people have seen this playbook before – claims of urgency, misrepresented intelligence, and military action that pulls the United States into regime change and prolonged, costly nation-building” Warner wrote. “We owe it to our service members, and to every American family, to ensure that we are not repeating the mistakes of the past. The president owes the country clear answers: What is the objective? What is the strategy to prevent escalation? And how does this make Americans safer?”</p>\n<p>Warner said decisions of taking the U.S. to war should remain with Congress, and that Trump’s actions raise constitutional issues.</p>\n<p>“Congress must be fully briefed, and the administration must come forward with a clear legal justification, a defined end state, and a plan that avoids dragging the United States into yet another costly and unnecessary war,” he wrote.</p>\n<p>Sen. Ed Markey (D-Mass.) called the U.S. attack “illegal and unconstitutional” because it was not approved by Congress.</p>\n<p>“Trump’s illegal actions raise the threat of escalation into a wider regional war with grave risks for U.S. troops and civilians in the region,” he wrote in a statement.</p>\n<p>Markey also accused Trump of “consistently exaggerated the imminence of Iran’s nuclear threat,” while noting the president had insisted Iran’s nuclear program had been “obliterated” by strikes last summer.</p>\n<p>He called for an immediate vote on a war powers resolution that has been introduced by Sens. Tim Kaine (D-Va.) and Adam Schiff (D-Calif.).</p>\n<p>“A diplomatic solution remains the best way to permanently and verifiably prevent Iran from acquiring a nuclear weapon,” Market stated. “This is a crisis of Trump’s creation. Americans do not want another endless war in the Middle East.”</p>\n<p>Sen. Ruben Gallego (D-Ariz.) in a statement posted on X also warned of the possibility the U.S. could be drawn into a bigger war.</p>\n<p>“The Iranian people deserve freedom and dignity. But we cannot send our men and women to die at the whim of the President,” he wrote. “The regime’s actions shouldn’t become an excuse for a wider war that punishes civilians and puts our troops at risk.”</p>\n<p>Trump has been seeing support for his actions from a number of Republican lawmakers, however.</p>\n<p>And Sen. John Fetterman (D-Pa.) in a statement offered support for the action.</p>\n<p>“Operation Epic Fury. President Trump has been willing to do what’s right and necessary to produce real peace in the region. God bless the United States, our great military, and Israel,” <a href=\"https://x.com/SenFettermanPA/status/2027674658091204808\">he wrote</a>.</p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/senate/5760308-congress-demands-answers-on-iran-strike/",
            "pub_date": "2026-02-28 21:46:44",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5760274,
            "title": "World on edge as US, Israel strikes on Iran stoke fears of broader conflict",
            "description": "<p>Reactions from world leaders poured out early Saturday after the U.S. and Israel <a data-id=\"https://thehill.com/policy/international/5760207-trump-urges-iran-regime-change/\" data-type=\"link\" href=\"https://thehill.com/policy/international/5760207-trump-urges-iran-regime-change/\">launched strikes </a>on Iran.</p>\n<p>The initiation of “Operation Epic Fury,” which came after <a data-id=\"https://thehill.com/homenews/administration/5759142-trump-iran-strike-decision/\" data-type=\"link\" href=\"https://thehill.com/homenews/administration/5759142-trump-iran-strike-decision/\">weeks of threats</a> from President Trump over the Middle Eastern nation’s nuclear program, sparked support from allies but also stoked fear in many countries in the region about the possibility of a wider conflict.</p>\n<p>Omani foreign minister Badr al-Busaidi, who has <a data-id=\"https://thehill.com/policy/international/5760270-oman-negotiations-undermined-strikes/\" data-type=\"link\" href=\"https://thehill.com/policy/international/5760270-oman-negotiations-undermined-strikes/\">led indirect talks</a> between the U.S. and Iran in recent months, said he was “dismayed” by the news.”</p>\n<p>“I am dismayed. Active and serious negotiations have yet again been undermined,” Busaidi <a href=\"https://x.com/badralbusaidi/status/2027716606223388847?s=20\">posted</a> on the social platform X. </p>\n<p>“Neither the interests of the United States nor the cause of global peace are well served by this,” he continued. “And I pray for the innocents who will suffer. I urge the United States not to get sucked in further. This is not your war.”</p>\n<p>Busaidi met with Vice President Vance yesterday following the latest rounds of meetings between Iranian and American officials, in which he said “<a href=\"https://thehill.com/policy/international/5757110-us-iran-talks-oman-complete/\">significant progress</a>” had been made. Technical teams were set to meet in Vienna next week to continue nuclear talks.</p>\n<p>The <a data-id=\"https://thehill.com/policy/defense/5760058-us-israel-launch-strikes-on-iran/\" data-type=\"link\" href=\"https://thehill.com/policy/defense/5760058-us-israel-launch-strikes-on-iran/\">joint strikes</a> follow the Friday arrival of the USS Gerald R. Ford, the nation’s largest aircraft carrier, to Israel. Israeli Defense Minister Israel Katz <a href=\"https://x.com/IsraelArabic/status/2027630436671705469?s=20\">declared</a> a “special and immediate state of emergency” on Friday morning. </p>\n<p>“For 47 years, the Ayatollahs’ regime has chanted ‘Death to Israel,’ ‘Death to America.’ It has spilled our blood, murdered many Americans, and massacred its own people,” Israeli President Benjamin Netanyahu <a href=\"https://x.com/netanyahu/status/2027662108901412980\">posted</a> to X. </p>\n<p>“This murderous terrorist regime must not be allowed to arm itself with nuclear weapons that would enable it to threaten all of humanity,” he continued. “Our joint operation will create the conditions for the brave Iranian people to take their fate into their own hands.”</p>\n<p>Saudi Arabia condemned Iranian attacks on targets in the Persian Gulf in a statement shared with NewsNation, The Hill’s sister network.</p>\n<p>“The Kingdom of Saudi Arabia condemns and denounces in the strongest terms the treacherous Iranian aggression and the blatant violation of the sovereignty of each of the United Arab Emirates, the Kingdom of Bahrain, the State of Qatar, the State of Kuwait, and the Hashemite Kingdom of Jordan, affirming its full solidarity and standing by the side of the sister states, and placing all its capabilities at their disposal to support them in all measures they take, and warning of the grave consequences of the continued violation of the sovereignty of states and the principles of international law,” the country said in the statement. </p>\n<p>European Commission President Ursula von der Leyen called the attack on Iran “greatly concerning” in an X <a href=\"https://x.com/vonderleyen/status/2027691363811090828\">post</a> Saturday morning.</p>\n<p>“In close coordination with EU Member States, we will take all necessary steps to ensure that EU citizens in the region can count on our full support,” von der Leyen said. “We call on all parties to exercise maximum restraint, to protect civilians, and to fully respect international law.”</p>\n<p>Former Russian President Dmitry Medvedev also reacted to the military operation <a href=\"https://x.com/MedvedevRussiaE/status/2027671270125363682\">in a post online</a>, saying, “The peacekeeper is at it again.”</p>\n<p>“The talks with Iran were just a cover. Everyone knew that,” Medvedev wrote. “So who has more patience to wait for the enemy’s sorry end now? The US is just 249 years old. The Persian Empire was founded over 2500 years ago. Let’s see what happens in 100 years or so…”</p>\n<p>Canadian Prime Minister Mark Carney said his government is tracking the situation in Iran “closely” and urged Canadians currently in the country to “shelter in place.”</p>\n<p>“Canada supports the United States acting to prevent Iran from obtaining a nuclear weapon and to prevent its regime from further threatening international peace and security,” Carney <a href=\"https://x.com/MarkJCarney/status/2027721462233141679/photo/1\">posted</a> online.</p>\n<p>“The Canadian government urges the protection of all civilians in this conflict. We will take all possible measures to protect our nationals and Canadian diplomatic missions throughout the region,” he added.</p>\n<p>Trump in a video <a data-id=\"https://truthsocial.com/@realDonaldTrump/posts/116147082884192486\" data-type=\"link\" href=\"https://truthsocial.com/@realDonaldTrump/posts/116147082884192486\">posted to Truth Social</a> also encouraged the Iranian citizens to topple the regime. He later <a data-id=\"https://thehill.com/policy/international/5760238-trump-freedom-iranians-us-israel-strikes/\" data-type=\"link\" href=\"https://thehill.com/policy/international/5760238-trump-freedom-iranians-us-israel-strikes/\">told the Washington Post</a> that he wants the nation to be “safe” and “freedom for Iranians.</p>\n<p>Iran quickly responded to the attacks on Saturday, launching missiles toward Israel.</p>\n<p>“Netanyahu and Trump’s war on Iran is wholly unprovoked, illegal, and illegitimate,” Iranian Foreign Minister Abbas Araghchi <a data-id=\"https://x.com/araghchi/status/2027724061892043214\" data-type=\"link\" href=\"https://x.com/araghchi/status/2027724061892043214\">wrote on X</a>. “Trump has turned ‘America First’ into ‘Israel First’—which always means ‘America Last'”</p>\n<p>“Our Powerful Armed Forces are prepared for this day and will teach the aggressors the lesson they deserve,” he added.</p>\n<p>The Houthis, a militant group in Yemen backed by Iran, defended Tehran after the strikes and suggested the group would take action in response.</p>\n<p>“It is the duty of the Arab and Islamic nation—states, peoples, and all the free people of the world threatened by the barbaric, savage, and frenzied American policy—to take serious and effective action to confront this treacherous aggression and work immediately to stop it, and to declare all forms and types of solidarity with the Islamic Republic in Iran and with the right of its people to life, freedom, and dignity,” the group wrote in a statement obtained by NewsNation.</p>\n<p>Russia also condemned the strikes, <a data-id=\"https://apnews.com/article/russia-iran-us-israel-578a5791e81493edd09951898ae6f712\" data-type=\"link\" href=\"https://apnews.com/article/russia-iran-us-israel-578a5791e81493edd09951898ae6f712\">according to The Associated Press</a>, and called for a return to diplomacy.</p>\n<p>In a post to Telegram, Russia’s foreign ministry blasted the operation as “unprovoked act of armed aggression” against another U.N. member and accused the Trump administration of using Iran’s nuclear program as a cover for seeking regime change.</p>",
            "kind": 1,
            "link": "https://thehill.com/policy/international/5760274-world-reaction-us-israel-strikes-iran/",
            "pub_date": "2026-02-28 21:46:43",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5759752,
            "title": "A big change is coming to Social Security that beneficiaries may not notice",
            "description": "<p>(NEXSTAR) – The Social Security Administration (SSA) is rolling out a major change to the way it handles customer service.</p>\n<p>Instead of relying on local field offices, the Administration is moving to a centralized, national network to handle appointments, benefits questions and other issues.</p>\n<p>“We are utilizing technology to improve the customer experience and give our employees the tools they need to better serve the American people,” a spokesperson for the SSA told Nexstar. “The implementation of this internal-facing technology will occur on a rolling basis this year. Customers will not notice any changes aside from expanded appointment availability.” </p>\n<div class=\"nlp-ignore-block article-content rich-text\">\n\n</div>\n<p><a href=\"https://www.newsweek.com/social-security-recipients-face-shake-up-in-just-weeks-11558635\" rel=\"noreferrer noopener\" target=\"_blank\">Multiple outlets</a> are reporting that the transition will begin March 7, and, despite the SSA’s assurance of a seamless transition, there are those who have doubts.</p>\n<p>Some have <a href=\"https://federalnewsnetwork.com/management/2026/01/social-security-seeks-nationwide-system-to-manage-caseload-for-smaller-workforce/\">expressed concern</a> that an SSA employee potentially thousands of miles away from the caller may have difficulty with state-specific questions that were previously handled by a local office.</p>\n<h3 class=\"wp-block-heading\"><strong>The latest change for the SSA</strong></h3>\n<p>The centralized customer service approach follows a massive overhaul of the <a href=\"https://thehill.com/business/budget/5357818-social-securitys-go-broke-date-pushed-up-in-new-report/\" rel=\"noreferrer noopener\" target=\"_blank\">embattled</a> SSA in 2025.</p>\n<p>At least 7,000 SSA workers were laid off from the agency as part of downsizing efforts by Elon Musk’s DOGE and the Trump administration.</p>\n<p>“This change is coming out of necessity, as the administration has seen a sizable reduction in their workforce over the last year,” Alex Beene, who teaches financial literacy at the University of Tennessee at Martin, told <a href=\"https://www.newsweek.com/social-security-recipients-face-shake-up-in-just-weeks-11558635\" rel=\"noreferrer noopener\" target=\"_blank\">Newsweek</a>.</p>\n<p>The SSA maintains that the customer service change will not adversely affect beneficiaries, telling the Federal News Network that the Administration will “continue to provide the public with in-person service at our more than 1,200 field offices nationwide.”</p>\n<p>Meanwhile, a November internal field office operating plan shared with The Associated Press outlined a proposed target of 50% fewer field office visitors in fiscal year 2026 compared to fiscal year 2025, or no more than 15 million field office visits by members of the public. Agency field offices saw more than 31.6 million field office visits from SSA recipients from Oct. 1, 2024, to Sept. 30, 2025, according to the agency document.</p>\n<p>In January, Social Security Commissioner Frank J. Bisignano applauded the Administration’s streamlining efforts <a href=\"https://www.ssa.gov/news/en/press/releases/2026-01-15.html\" rel=\"noreferrer noopener\" target=\"_blank\">during a briefing</a>, saying that Americans now have 24-hour access to the SSA website, which was previously down for 29 hours each week. He added that telephone wait times for the SSA 800 number had dropped to single digits and that new technology allowed “90 percent of calls” to be resolved via self-service or callbacks.</p>\n<p>Roughly 71 million people are expected to collect Social Security benefits in 2026, according to the <a href=\"https://www.ssa.gov/cola/\" rel=\"noreferrer noopener\" target=\"_blank\">SSA</a>.</p>\n<p><em>The Associated Press contributed to this report.</em></p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/5759752-a-big-change-is-coming-to-social-security-that-beneficiaries-may-not-notice/",
            "pub_date": "2026-02-28 21:46:42",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5757040,
            "title": "Saving the SAVE Act — this one change can fix the American voting system",
            "description": "<p>For months, voter identification and proof of citizenship have been debated not only as policy proposals but as constitutional questions. Republicans argue that verifying voter eligibility is essential to election integrity. Democrats respond that such requirements risk disenfranchising voters. The <a href=\"https://www.congress.gov/bill/119th-congress/house-bill/22\" rel=\"noreferrer noopener\" target=\"_blank\">SAVE Act</a> represents the most direct federal effort to address that debate, by requiring documentary proof of U.S. citizenship to register for federal elections. </p>\n<p>I support the core premise behind the SAVE Act. American citizens should decide federal elections. Supporting that premise, however, does not eliminate the responsibility to evaluate the constitutional structure surrounding it. </p>\n<p>My hesitation in fully endorsing the SAVE Act stems from the 24th Amendment and the legal implications of how verification is implemented. The 24th Amendment <a href=\"https://constitutioncenter.org/the-constitution/amendments/amendment-xxiv\" rel=\"noreferrer noopener\" target=\"_blank\">prohibits poll taxes in federal elections</a>. If registering to vote requires documentary proof of citizenship, and obtaining that documentation requires payment — whether for a certified birth certificate, a passport or a REAL ID — the government risks attaching a financial condition to voting. </p>\n<p>Even relatively small administrative fees raise constitutional concerns when they function as mandatory prerequisites to ballot access. The relevant legal question is not whether documentation is reasonable, but whether any cost associated with it operates as a condition on a constitutionally protected right.</p>\n<p>Americans must present identification to open bank accounts, apply for SNAP benefits, enroll in Medicaid or Medicare, rent housing, secure employment, or board commercial flights. Identification functions as a baseline requirement across nearly every aspect of modern civic and economic life, a reality often overlooked by Democrats, who portray voter ID as uniquely burdensome. None of those activities, however, are protected by a constitutional amendment prohibiting financial barriers. Voting is. </p>\n<p>Because voting receives explicit protection, comparisons to identification requirements for other government services will not resolve the issue. The presence of identification standards elsewhere in federal law does not answer whether attaching a fee to voter registration implicates the 24th Amendment. </p>\n<p>But addressing the constitutional concern does not require abandoning the SAVE Act. If Congress mandates documentary proof of citizenship for registering to vote in federal elections, the federal and state governments should guarantee that eligible citizens can obtain qualifying documents at no cost. States could provide certified birth certificates for voting purposes at no charge. Federal agencies could waive passport documentation fees for limited verification use. REAL ID-compliant identification could be issued without administrative fees when used exclusively for voter registration. </p>\n<p>Once documentation is accessible without financial burden, the policy cannot plausibly be characterized as a poll tax. The constitutional objection would weaken substantially because the financial precondition would no longer exist. </p>\n<p>Public opinion further clarifies that no serious dispute regarding the SAVE Act can be grounded in broad voter opposition. Survey data over nearly two decades show bipartisan backing for voter identification requirements. In 2006, national polling indicated that approximately <a href=\"https://www.forbes.com/sites/alisondurkee/2021/06/21/80-of-americans-support-voter-id-rules-but-fewer-worried-about-fraud-poll-finds/\" rel=\"noreferrer noopener\" target=\"_blank\">80 percent of Americans</a> supported showing identification to vote. The lowest recorded level, in 2012, showed <a href=\"https://www.latimes.com/opinion/story/2026-02-10/voter-id-controversial\" rel=\"noreferrer noopener\" target=\"_blank\">77 percent overall support,</a> including 61 percent of Democrats. </p>\n<p>As recently as last year, Pew Research <a href=\"https://www.latimes.com/opinion/story/2026-02-10/voter-id-controversial\" rel=\"noreferrer noopener\" target=\"_blank\">reported</a> that 95 percent of Republicans and 71 percent of Democrats favored requiring government-issued identification for voting. Few election policies generate that level of cross-party agreement. </p>\n<p>For that reason, characterizing the SAVE Act as a revival of <a href=\"https://www.pbs.org/wgbh/americanexperience/features/freedom-riders-jim-crow-laws/\" rel=\"noreferrer noopener\" target=\"_blank\">Jim Crow laws</a> is historically and legally inaccurate. Jim Crow statutes were designed to exclude lawful voters through literacy tests, intimidation, arbitrary enforcement and selective application. A documentation requirement that verifies citizenship and is universally accessible without cost would not operate in that manner.</p>\n<p>Some Democrats defend expansive constitutional interpretations in other contexts through a living constitutional framework that allows rights to evolve with social practice, including the previously recognized federal right to abortion. Under that interpretive model, one could argue that voter identification reflects contemporary administrative norms rather than resembling historical poll taxes. But I do not approach constitutional interpretation through that lens.  </p>\n<p>An originalist framework requires examining the text and historical purpose of the 24th Amendment. That amendment was ratified to eliminate financial preconditions attached to voting in federal elections. Any modern requirement that effectively conditions registration on payment must be evaluated against that historical prohibition, regardless of contemporary administrative convenience. </p>\n<p>The debate, therefore, turns on implementation rather than ideology. If proof of citizenship is required, documentation must be provided at no cost to eligible voters. Once that safeguard is embedded in statutory design, the constitutional objection loses force. Opposition would then rest on policy preference rather than legal necessity. </p>\n<p>Federal elections demand both integrity and constitutional compliance. Citizenship verification aligns with the structure of representative government. Guaranteeing free access to required documentation aligns with the explicit command of the 24th Amendment. Careful legislative drafting can reconcile both principles without sacrificing either. </p>\n<p><em>Gregory Lyakhov is a nationally syndicated columnist and political commentator.</em></p>",
            "kind": 1,
            "link": "https://thehill.com/opinion/campaign/5757040-save-act-voter-id-debate/",
            "pub_date": "2026-02-28 21:16:45",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5760287,
            "title": "Lawmakers ramp up push for war powers resolution after US strikes Iran",
            "description": "<p>Lawmakers are calling on Congress to convene earlier than planned next week to vote on a war powers resolution in light of widespread U.S. attacks on Iran.</p>\n<p>“Donald Trump has launched a war on Iran and Congress must convene on Monday to vote on [Rep.] Thomas Massie’s [R-Ky.] and my war powers resolution to stop this war,” Rep. Ro Khanna (D-Calif.) said in a video posted on X, arguing Americans do not want to be embroiled in an overseas conflict. </p>\n<p>Rep. Greg Casar (D-Texas) also called on Congress to return.</p>\n<p>“Congress must do everything in its power to stop Trump’s illegal war, including reconvening for an immediate vote on a War Powers Resolution,” Casar wrote on X. “But we will also need millions of Americans to speak out and demand an end.”</p>\n<p>Last week, Rep. Warren Davidson (R-Ohio) became the second Republican to back Khanna’s resolution aimed at limiting Trump’s ability to take military action against Iran. </p>\n<p>Sen. Andy Kim (D-N.J.) called on senators to vote on Sen. Tim Kaine (D-Va.) war powers resolution. </p>\n<p>“Trump once again started a cycle of violence that has already escalated and could spiral out of control. This is unacceptable. The Senate should vote on Senator Kaine’s War Powers Resolution immediately. I stand ready to do so today,” Kim wrote in a post on X. </p>\n<p>The U.S. and Israel carried out strikes against Iran overnight, following weeks of speculation over whether an attack would occur amid <a href=\"https://thehill.com/policy/defense/5709342-iran-us-strike-tension-middle-east/\"> U.S. military buildup</a> in the region. </p>\n<p>The Trump administration held talks this week in Geneva with Iranian officials to negotiate the terms of a deal to limit Tehran’s nuclear program. Iranian and Omani officials left the meeting saying the talks were going in a positive direction but Trump said Friday he was “not thrilled” with the way they were going. </p>\n<p>Oman’s Foreign Minister Badr al-Busaidi, who was part of the talks, expressed dismay at the U.S. attack.</p>\n<p>“I am dismayed. Active and serious negotiations have yet again been undermined,” he wrote on X.</p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/administration/5760287-lawmakers-call-war-powers-vote/",
            "pub_date": "2026-02-28 21:16:44",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5760270,
            "title": "Oman foreign minister expresses dismay at US strikes on Iran: 'This is not your war'",
            "description": "<p>Oman Foreign Minister Badr al-Busaidi, who had been a key player in talks aimed at preventing a war between the U.S. and Iran, expressed dismay at the Saturday morning strikes by the U.S. and Israel.</p>\n<p>“I am dismayed. Active and serious negotiations have yet again been undermined,” he wrote on X.</p>\n<p>“Neither the interests of the United States nor the cause of global peace are well served by this. And I pray for the innocents who will suffer. I urge the United States not to get sucked in further. This is not your war,” he <a href=\"https://x.com/badralbusaidi/status/2027716606223388847\">wrote</a>.</p>\n<p>On Friday, hours before the strikes, the Omani foreign minister had played up progress in the talks.</p>\n<p>“Now we are talking about zero stockpiling and that is very, very important because if you cannot stockpile material that is enriched, then there is no way you can actually create a bomb,” al-Busaidi <a href=\"https://thehill.com/policy/international/5759623-iran-nuclear-deal-stockpiling/\">had told</a> <a href=\"https://thehill.com/people/margaret-brennan/\">Margaret Brennan </a>of CBS’s “Face the Nation” in an interview posted Friday. </p>\n<p>Iran holds a stockpile of between 300 and 400 kilograms of 60 percent enriched uranium that nuclear experts have warned can be converted to a nuclear weapon. </p>\n<p>Al-Busaidi said if there is a deal, international nuclear inspectors, likely from the International Atomic Energy Agency, could inspect Iran’s nuclear facilities at places like Isfahan and inspect the stockpiles. </p>\n<p>At the time, some saw the remarks from al-Busaidi, who met with Vice President Vance on Friday, as a last-ditch effort to stave off strikes by the U.S. on Iran amid signs President Trump was frustrated with the lack of progress with Tehran.</p>",
            "kind": 1,
            "link": "https://thehill.com/policy/international/5760270-oman-negotiations-undermined-strikes/",
            "pub_date": "2026-02-28 20:51:43",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5760207,
            "title": "Live updates: US, Israel launch strikes against Iran; Trump calls on Iranians to topple their government",
            "description": "<p>The U.S. and Israel early Saturday morning launched<a data-id=\"https://thehill.com/policy/defense/5760058-us-israel-launch-strikes-on-iran/\" data-type=\"link\" href=\"https://thehill.com/policy/defense/5760058-us-israel-launch-strikes-on-iran/\"> strikes against Iran</a>, while President Trump called on the Iranian people to seize the chance to topple their government. </p>\n<p>“A short time ago, the United States military began major combat operations in Iran,” he said in a video <a href=\"https://truthsocial.com/@realDonaldTrump/116147082884192486\">posted to Truth Social</a> at 2:30 a.m. EST. “Our objective is to defend the American people by eliminating imminent threats from the Iranian regime, a vicious group of very hard, terrible people.”</p>\n<p>The president urged members of Iran’s military to lay down their arms and called on Iranians to overturn the regime that has controlled the country since the Islamic Revolution in 1979.</p>\n<p>“It will be yours to take,” Trump said, arguing it would be “probably your only chance for generations.”</p>\n<p>Iran quickly retaliated, launching missiles and drones toward Israel, according to the Israeli Defense Forces (IDF). Iran’s Supreme Leader Ayatollah Ali Khamenei was reportedly moved to a secure location as the attacks unfolded, according to <a data-id=\"https://www.jpost.com/middle-east/iran-news/article-888251\" data-type=\"link\" href=\"https://www.jpost.com/middle-east/iran-news/article-888251\">multiple reports</a>.</p>\n<p>“Israel has a right to defend itself,” IDF officials <a data-id=\"https://x.com/IDF/status/2027662583344296185\" data-type=\"link\" href=\"https://x.com/IDF/status/2027662583344296185\">wrote</a> on social platform X.</p>\n<p>Follow live below.</p>",
            "kind": 1,
            "link": "https://thehill.com/policy/international/5760207-trump-urges-iran-regime-change/",
            "pub_date": "2026-02-28 20:11:36",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5760238,
            "title": "Trump says he wants 'freedom' for Iranians after strikes",
            "description": "<p>President Trump on Saturday expressed that he wants “freedom” for the Iranian people after the U.S. and Israel <a data-id=\"https://thehill.com/policy/defense/5760058-us-israel-launch-strikes-on-iran/\" data-type=\"link\" href=\"https://thehill.com/policy/defense/5760058-us-israel-launch-strikes-on-iran/\">carried out strikes</a> against Tehran.</p>\n<p>“All I want is freedom for the people,” Trump <a href=\"https://www.washingtonpost.com/world/2026/02/28/israel-strikes-iran-live-updates/?utm_campaign=wp_main&amp;utm_source=bluesky,threads,twitter&amp;utm_medium=social\">told the Washington Post</a> in a phone interview. </p>\n<p>“I want a safe nation, and that’s what we’re going to have,” he added.</p>\n<p>In a video <a data-id=\"https://truthsocial.com/@realDonaldTrump/posts/116147082884192486\" data-type=\"link\" href=\"https://truthsocial.com/@realDonaldTrump/posts/116147082884192486\">posted to Truth Social</a> overnight, the president announced “major combat operations” had begun in Iran and called for regime change.</p>\n<p>“Our objective is to defend the American people by eliminating imminent threats from the Iranian regime, a vicious group of very hard, terrible people,” he said.</p>\n<p>Trump also urged members of Iran’s military to lay down their arms and pressed Iranians to <a data-id=\"https://thehill.com/homenews/senate/5756532-trump-iran-strikes-regime-change/\" data-type=\"link\" href=\"https://thehill.com/homenews/senate/5756532-trump-iran-strikes-regime-change/\">topple the regime</a> led by Ayatollah Ali Khamenei, which has controlled the country since the Islamic Revolution in 1979.</p>\n<p>“Bombs will be dropping everywhere. When we are finished, take over your government. It will be yours to take; this will be probably your only chance for generations,” Trump said in the video. “America is backing you with overwhelming strength and devastating force.”</p>\n<p>He added, “Now is the time to seize control of your destiny.”</p>\n<p>The strikes follow weeks of speculation over whether the U.S. would attack Iran amid <a data-id=\"https://thehill.com/policy/defense/5709342-iran-us-strike-tension-middle-east/\" data-type=\"link\" href=\"https://thehill.com/policy/defense/5709342-iran-us-strike-tension-middle-east/\">U.S. military buildup</a> in the region. Washington and Tehran have been engaged in indirect negotiations over Iran’s nuclear program. </p>\n<p>Trump has <a data-id=\"https://thehill.com/homenews/administration/5759142-trump-iran-strike-decision/\" data-type=\"link\" href=\"https://thehill.com/homenews/administration/5759142-trump-iran-strike-decision/\">expressed frustration</a> over Iran <a data-id=\"https://thehill.com/policy/international/5759214-iran-us-nuclear-talks/\" data-type=\"link\" href=\"https://thehill.com/policy/international/5759214-iran-us-nuclear-talks/\">declining to commit</a> to not developing a nuclear weapon. </p>\n<p>The State Department on Friday <a data-id=\"https://thehill.com/homenews/administration/5759963-us-designates-iran-hostages/\" data-type=\"link\" href=\"https://thehill.com/homenews/administration/5759963-us-designates-iran-hostages/\">moved to designate</a> Iran as a state sponsor of wrongful detention and authorized the <a data-id=\"https://thehill.com/policy/international/5758535-jerusalem-non-emergency-personnel-recall-iran-strikes/\" data-type=\"link\" href=\"https://thehill.com/policy/international/5758535-jerusalem-non-emergency-personnel-recall-iran-strikes/\">departure of nonemergency government personnel</a> and their families from Israel earlier in the day as tensions rose in the region.</p>",
            "kind": 1,
            "link": "https://thehill.com/policy/international/5760238-trump-freedom-iranians-us-israel-strikes/",
            "pub_date": "2026-02-28 20:11:36",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5759741,
            "title": "Democrats seek a campaign message that goes beyond anti-Trump",
            "description": "<p>LEESBURG, VA — House Democrats promising to flip the chamber in this year’s midterms are fighting to avoid a pitfall they see as hazardous to their goal.</p>\n<p>The message, they say, can’t just be anti-Trump.</p>\n<p>While the president’s <a href=\"https://thehill.com/homenews/administration/5751721-trump-approval-ratings-state-of-union/\">approval ratings</a> are well under water — and <a href=\"https://www.cnn.com/2026/02/23/politics/trump-approval-rating-independents-cnn-poll\">polls indicate</a> that key constituencies have soured on him after a tumultuous first year back in office — Democrats say they can’t lean on that unpopularity to secure victory in November. Instead, they’re racing to cobble together a menu of specific policy priorities to act as both the centerpiece of their campaign message and the heart of their early legislative agenda if they win control of the Speaker’s gavel in 2027. </p>\n<p>“This cycle isn’t just about what we’re up against. We’ve got to present a real plan to the American people,” Rep. Greg Stanton (D-Ariz.) said.</p>\n<p>That task was the focus of the Democrats’ annual issues conference this week in Northern Virginia, where lawmakers huddled for three days in search of the 2026 equivalent of the “Six for ‘06” message that helped them seize the House exactly two decades ago. </p>\n<p>If the details are fuzzy, the core theme is not.</p>\n<p>“Affordability is the message,” Rep. Lauren Underwood (Ill.), a vice-chair of the Democrats’ messaging arm, told reporters at the retreat. </p>\n<p>Beneath the umbrella of affordability, Democrats are focusing on five different areas where they see Americans being hit hardest by rising costs — and think Republicans are most vulnerable. Those are: Health care; housing; groceries; electricity and other utilities; and caregiving, including childcare and eldercare.</p>\n<p>What specific proposals they tack into their final messaging package remains a work in progress. But Democrats of all stripes made clear that they’re taking pains to be proactive and aggressive in proposing economic reforms that tackle kitchen-table concerns, rather than merely attacking Trump.</p>\n<p>“We’ve got to make sure we build out the policies and programs that we’ve talked about this week, and make sure we roll those out for the American people so they see that we’ve got,” said Rep. Glenn Ivey (D-Md.). “Not just the opposition to Trump and what he’s doing, but we’ve got an affirmative agenda.”</p>\n<p>By coincidence, this year’s conference came directly on the heels of Trump’s State of the Union address, which he delivered to Congress on Tuesday night. If the back-to-back events created some logistical hassles for the conferencing Democrats, it also lent them plenty of fodder for challenging the president’s policy record during his first year back in office.</p>\n<p>More than a few Democrats highlighted Trump’s domestic message during the speech, which painted a glowing picture of a booming economy under his watch and claimed cost reductions on consumer staples even for items, like beef and electricity, that have seen costs soar. His one mention of “affordability” was made to blame Democrats for sending inflation through the roof under former President Biden, thereby creating the cost-of-living crisis.</p>\n<p>“The same people in this chamber who voted for those disasters suddenly used the word affordability — a word, they just used it because somebody gave it to them, knowing full well that they caused and created the increased prices that all of our citizens had to endure,” he said. “You caused that problem.”</p>\n<p>The finger pointing drew a fierce response from the Democrats in Leesburg, who accused the wealthy president of being out of touch with working-class people. </p>\n<p>“We have a cost-of-living emergency in America. The affordability crisis is crushing the hopes and dreams of the American people, and what was Donald Trump’s response? He mocked Americans in the term ‘affordability,’” Rep. Ted Lieu (Calif.), the vice chairman of the Democratic Caucus, said on the first day of the conference.</p>\n<p>“He was mocking people who are experiencing monthly bills that were far too high.”</p>\n<p>It’s not that Democrats think Trump will be a non-factor in the midterms. To the contrary, they see his low approval ratings as a boon to their party. And they went out of their way this week to highlight polls indicating that the president’s support among minority voters — which had risen dramatically in 2024 — was now cratering a year into his second term. That includes Asian, Black and Hispanic voters, who seem to be shifting away from the president. </p>\n<p>A <a href=\"https://www.cnn.com/2026/02/23/politics/trump-approval-rating-independents-cnn-poll\">CNN poll</a> released this week found that his support among Hispanics, for instance, has fallen from 41 percent to 22 percent over the last year. </p>\n<p>“He is less popular than burnt rice and beans in our community, and his collapse in Hispanic support will have reverberations across House seats this November,” Rep. Darren Soto (D-Fla.), a member of the Congressional Hispanic Caucus, told reporters in Virginia.</p>\n<p>Still, even the Democrats from the minority caucuses are cautioning that an anti-Trump message isn’t enough to secure the House in November. To win those voters back to the Democratic column will take a promise of specific legislation tailor-made to address the anxieties — economic and otherwise — of those communities. </p>\n<p>“It’s not enough for us to just say, ‘Hey, we told you so.’ We’ve also got to say, ‘Here’s what we’re going to do as Democrats,” said Rep. Ami Bera (D-Calif.), a member of the Congressional Asian Pacific-American Caucus. “That’s the opportunity that Donald Trump has created for Democrats.” </p>\n<p>If Democrats are in the early stages of compiling their campaign contract to voters, they did offer strong clues as to what might be included. </p>\n<p>Premium subsidies under ObamaCare, for instance, expired at the start of the year and are poised to be a major issue heading into the midterms. </p>\n<p>“Health care is a winning issue for Democrats,” Underwood said. </p>\n<p>Easing the cost of childcare and elder care is another issue that polls well for Democrats, who are eyeing an aggressive legislative response to include a permanent extension of the child tax credit and a bill capping childcare at $15 a day.</p>\n<p>“This is an existential financial problem for working families, and Democrats continue to be the only party that is taking it seriously,” said Rep. Katherine Clark (Mass.), the Democratic whip. “It’s going to be at the heart of our agenda in the House majority.” </p>\n<p>Rep. Emanuel Cleaver (D-Mo.), a longtime housing advocate, used the annual retreat to make the case that, if Democrats win the House, they should make H.R.-1 — the bill that’s symbolically their top priority — “a big pile of the housing legislation that we haven’t been able to get through.” </p>\n<p>“For most people in the country, they are able to see that housing — affordable housing — is one of the top domestic issues they face,” said Cleaver, a senior member of the Congressional Black Caucus. “We are also facing the reality that discrimination is still a major issue for African Americans.” </p>\n<p>One notable omission this year was campaign finance reform. In the last two Congress’s that Democrats have controlled the House — a period, under former Speaker Nancy Pelosi (D-Calif.), that spanned from 2019 to 2023 — Democrats’ had made campaign finance their very top priority, the issue featured as H.R.-1 in both the 116th and 117th Congresses. At this conference, it was never mentioned in three days of press conferences. </p>\n<p>Some Democrats said the issue remains important, but given the tumult of Trump’s second term, they’ve simply had to focus their energies elsewhere. </p>\n<p>“Other things drowned it out. Times change,” Cleaver said. “That doesn’t mean that we’ve lost the commitment. But we’re overwhelmed.”</p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/house/5759741-democrats-campaign-message-trump-affordability/",
            "pub_date": "2026-02-28 19:11:37",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5758935,
            "title": "Pell Grant funding shortfall on the horizon as nearly 2 million more students qualify",
            "description": "<p>Pell Grants, the federal <a href=\"https://thehill.com/homenews/education/5525572-college-tuition-federal-aid/\">financial aid program</a> that helps low-income Americans afford college and has enjoyed broad bipartisan support, are projected to have big funding shortfalls that could jeopardize the education of thousands of students.  </p>\n<p>The grants, which have recently seen expanded eligibility, give low-income students a chance to go to college without incurring debt. But the program itself is in financial difficulties with a projected shortfall of billions of dollars that could lead to trouble for students as soon as 2028.   </p>\n<p>By the end of this fiscal year, the Congressional Budget Office (CBO) projects the Pell Grant program will be $5 billion in debt. Over the next 10 years, that number jumps to between $104 billion and $132 billion if nothing is done about the issue.  </p>\n<p>The projections come even after lawmakers gave the program a one-time boost of $10.5 billion in President Trump’s One Big Beautiful Bill Act last year.  </p>\n<p>The Committee for a Responsible Federal Budget said interruptions to full Pell Grant awards would begin as soon as the 2028-2029 school year, according to these projections. </p>\n<p>“The current Pell Grant funding shortfall is this time primarily driven by an increase in eligible students for the program, which is due to changes to the Pell eligibility formula, and that was because of the FAFSA Simplification Act, which was passed back in 2021,” said Megan Walter, senior policy analyst at the National Association of Student Financial Aid Administrators. </p>\n<p>“So, beginning with the 24-25 award year, more students were eligible for Pell than normal, and sometimes for more than they were eligible for in the past … It’s also due to Congress not increasing discretionary funding for the program in recent years,” she added. “In short, they expanded eligibility without allocating more funding to the program, which is going to create a shortfall every time.” </p>\n<p>Lawmakers also added new short-term workforce Pell Grants, which the CBO projects could cost an additional $2 billion over the next decade. </p>\n<p>In the 2025-2026 school year, almost 7.5 million students, around 40 percent of them going to college, received Pell Grants.  </p>\n<p>An analysis by the National College Attainment Network (NCAN) said the FAFSA Simplification Act gave Pell Grant eligibility to another 1.7 million students, a 27 percent jump.  </p>\n<p>“I think the streamlined process also demonstrates that there’s really strong demand for college and post-secondary education, despite the national narrative and there’s also bipartisan support for the program. It was expanded to include short term workforce training programs. It was expanded to include students who are incarcerated, so members of Congress from both parties want to make this program available to more students, and that does come with a price tag,” said Catherine Brown, senior director of policy and advocacy at NCAN. </p>\n<p>The Hill has reached out to the Education Department for comment.</p>\n<p>There are numerous ways lawmakers could go about addressing the shortfall.  </p>\n<p>The Trump administration has previously suggested cutting the maximum award amount to $5,710. It currently sits at $7,395.  </p>\n<p>Other options would be increasing the number of credits to be considered a full-time student to receive the maximum Pell Grant award or only allowing the full award for eight semesters instead of 12.  </p>\n<p>But, Walter said, “None of those changes have been enacted in response to the current shortfall or past shortfalls, so no idea if they would actually do any of that, and I don’t know those would make significant enough changes to really make up” the gap.</p>\n<p>A popular preference by advocates is full, mandatory funding of the Pell Grants to stabilize the program. </p>\n<p>“I think the best scenario and long-term solution would be full mandatory funding,” Walter said. </p>\n<p>The bright spot for the program is the long-standing bipartisan support, which advocates believe make it unlikely for the program to be completely cut or sufficiently downsized.   </p>\n<p>The Hill has reached out to Rep. Tim Walberg (R-Mich.), chairman of the House Education and the Workforce Committee, and Rep. Bobby Scott (D-Va.), ranking member of the House committee, for comment. </p>\n<p>“In reconciliation, House Republicans proposed targeted reforms to reduce the shortfall and encourage completion — a responsible approach that recognizes fiscal realities,” Walberg said in a statement to Inside Higher Ed.  </p>\n<p> “We will continue to advocate for concrete solutions to ensure Pell remains strong and focused on students with the greatest need,” he added. </p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/education/5758935-pell-grant-funding-shortfall-college-students/",
            "pub_date": "2026-02-28 19:11:37",
            "source": "thehill",
            "language": "en"
        }
    ]
}