{
    "data": [
        {
            "id": 5127713,
            "title": "Steve Doocy on Trump Gaza takeover plan: ‘He knows the United States can’t invade another country’",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>Fox News host Steve Doocy cast doubt on President Trump’s comments <a data-id=\"https://thehill.com/policy/international/5127021-trump-us-takeover-gaza/\" data-type=\"link\" href=\"https://thehill.com/policy/international/5127021-trump-us-takeover-gaza/\">suggesting the U.S. take over Gaza</a>, a strip of land in the Middle East that has been plagued by war between Israel and Hamas for months.</p>\n<p>“I think this is just the tip … you know, this is the conversation starter because, obviously, the president knows when he says ‘we’ll take Gaza,’ He knows the United States can’t invade another country,” Doocy said Wednesday on “Fox &amp; Friends.” </p>\n\n<p>“The last thing he wants to do is put boots on the ground in Gaza. I mean, you know, he is always … in his first term, he was talking about he would like to get out of every war in the Middle East,” he added in comments <a data-id=\"https://www.mediaite.com/tv/the-united-states-cant-invade-another-country-steve-doocy-pours-cold-water-on-trumps-gaza-take-over-plan/\" data-type=\"link\" href=\"https://www.mediaite.com/tv/the-united-states-cant-invade-another-country-steve-doocy-pours-cold-water-on-trumps-gaza-take-over-plan/\">first highlighted by Mediate. </a></p>\n<p>Trump during a <a data-id=\"https://thehill.com/policy/international/5127164-trump-netanyahu-joint-presser/\" data-type=\"link\" href=\"https://thehill.com/policy/international/5127164-trump-netanyahu-joint-presser/\">joint press conference</a> Tuesday alongside Israeli Prime Minister Benjamin Netanyahu said of Gaza: “I think you’ll make that into an international, unbelievable place… I don’t want to be cute, I don’t want to be a wise guy, but the Riviera of the Middle East… this could be so magnificent.”</p>\n<p>“The U.S. will take over the Gaza Strip, and we will do a job — whether we’ll own it and be responsible for dismantling all of the dangerous unexploded bombs and other weapons on the site, level the site, and get rid of the destroyed buildings, level it out,” the president added.</p>\n<p>His comments sparked nearly instant backlash and condemnation <a data-id=\"https://thehill.com/policy/international/5127510-donald-trump-gaza-takeover-allies-adversaries-react/\" data-type=\"link\" href=\"https://thehill.com/policy/international/5127510-donald-trump-gaza-takeover-allies-adversaries-react/\">from the international community</a> and <a data-id=\"https://thehill.com/policy/international/5127616-gaza-donald-trump-democrats-ethnic-cleansing/\" data-type=\"link\" href=\"https://thehill.com/policy/international/5127616-gaza-donald-trump-democrats-ethnic-cleansing/\">Democratic lawmakers</a> alike.</p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>Doocy said he “was going to give Trump the benefit of the doubt” and floated the idea that Trump’s comment could have been “the first step in a negotiation.” </p>\n<p>“I think this was his opening salvo, first idea,” the cable news host said. “A lot of people saying you can’t do it. But maybe they could add to it and come up with something because the way it’s working is not working.”</p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/homenews/media/5127713-steve-doocy-donald-trump-gaza-takeover-reaction/",
            "pub_date": "2025-02-05 23:05:55",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5126586,
            "title": "Celebrities rail against Trump’s policies — but hesitate to say his name",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>After years of launching blistering attacks on President Trump, much of Hollywood appears to be casting him in a new “Harry Potter”-inspired role: He Who Must Not Be Named.</p>\n<p>Rather than blast Trump by name, many of his celebrity critics are instead zipping their lips when it comes to mentioning the 47th president.</p>\n\n<p><a href=\"https://thehill.com/blogs/in-the-know/5122358-lady-gaga-defends-transgender-community-during-grammys-acceptance-speech-trans-people-are-not-invisible/\" rel=\"noreferrer noopener\" target=\"_blank\">From Lady Gaga</a> <a href=\"https://thehill.com/blogs/in-the-know/5122573-alicia-keys-diversity-grammy-award/\" rel=\"noreferrer noopener\" target=\"_blank\">to Alicia Keys</a> <a href=\"https://thehill.com/blogs/in-the-know/5122326-shakira-dedicates-grammy-to-immigrants-you-are-loved/\" rel=\"noreferrer noopener\" target=\"_blank\">and Shakira</a>, plenty of stars took to the stage at Sunday’s Grammy Awards in Los Angeles to speak out about hot-button issues, including transgender rights, immigration and anti-diversity, equity and inclusion (DEI) efforts. But none of the music artists name-checked Trump while railing against some of his administration’s core focuses.</p>\n<p>Even Grammys host Trevor Noah <a href=\"https://thehill.com/blogs/in-the-know/5122250-trevor-noah-talks-tariffs-at-grammys-maple-syrup-is-about-to-be-50/\" rel=\"noreferrer noopener\" target=\"_blank\">offered up</a> a Trump-related punchline, minus actually speaking the president’s name.</p>\n<p>“Yesterday, Beyoncé announced her new tour,” Noah said on the CBS broadcast. “I will say though, Beyoncé, there’s tariffs. We can’t afford a new tour. Maple syrup is about to be $50,” Noah said, referring to tariffs on Canada, Mexico and China that had been threatened by Trump.</p>\n<p>“Everybody’s sort of radio silent in terms of mentioning Trump’s name,” noted Mark Harvey, an associate professor and the director of graduate business programs at the University of Saint Mary.</p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>The approach from many in the entertainment world just weeks into Trump’s second term is in stark contrast to Hollywood’s reaction to the commander in chief following his White House win in 2016. A day after Trump’s 2017 inauguration, a who’s who of Hollywood — including Madonna, Scarlett Johansson and America Ferrera — <a href=\"https://thehill.com/homenews/315466-womens-march-takes-over-dc/\" rel=\"noreferrer noopener\" target=\"_blank\">joined protesters</a> and denounced the new president at the Women’s March on Washington and in other U.S. cities.</p>\n<p>“There’s a night and day difference” between then and now, said Harvey.</p>\n\n<p>The first Trump era was marked by celebs making headlines as they assailed Trump on a regular basis. In 2016, singer <a href=\"https://thehill.com/blogs/blog-briefing-room/news/292448-cher-blasts-trump-i-just-wish-hed-fall-off-the-face-of-the/\" rel=\"noreferrer noopener\" target=\"_blank\">Cher dubbed</a> Trump a “f‑‑‑ing idiot,” saying she wished the then-GOP presidential nominee would “fall off the face of the Earth.” Comedian Kathy Griffin <a href=\"https://thehill.com/homenews/media/335660-kathy-griffin-beheads-trump-in-gory-photo/\" rel=\"noreferrer noopener\" target=\"_blank\">posed for</a> a controversial photo in 2017 with a bloodied, decapitated fake head meant to resemble the president. Robert De Niro received a standing ovation from the audience at the Tony Awards in 2018 after repeatedly declaring “f‑‑‑ Trump” onstage. </p>\n<p>But in interviews since his November reelection, performers have kept Trump’s name out of the conversation.</p>\n<p>“The main thing is I have so much compassion and love for so many people that are afraid today,” Lady Gaga said in <a href=\"https://thehill.com/blogs/in-the-know/5110928-lady-gaga-mayhem-trump-lgbtq/\" rel=\"noreferrer noopener\" target=\"_blank\">an interview</a> with Elle UK conducted just days after Trump’s win, which the “Born This Way” singer said she “prayed” wouldn’t happen.</p>\n<div class=\"civic-science-article-container civic-science-less-14 civic-is-mr3\" data-civicscience-widget=\"3f127ebd-287e-0b64-a901-d55ec286348a\" id=\"civsci-id-civsci-id-596708068\"></div>\n<p>Eva Longoria similarly <a href=\"https://thehill.com/blogs/in-the-know/4990187-eva-longoria-trump-america-dystopian-us/\" rel=\"noreferrer noopener\" target=\"_blank\">didn’t utter</a> Trump’s name while expressing dissatisfaction with him winning the 2024 race against then-Vice President Harris in a November interview with Marie Claire, saying, “The shocking part is not that he won.”</p>\n<p>“It’s that a convicted criminal who spews so much hate could hold the highest office,” said the former “Desperate Housewives” star, <a href=\"https://thehill.com/blogs/in-the-know/4788601-hollywood-kamala-harris-biden-trump-clooney-longoria-streisand/\" rel=\"noreferrer noopener\" target=\"_blank\">who campaigned</a> for Harris and spoke at the Democratic National Convention.</p>\n<p>These days, said Harvey, Hollywood seems to be reflecting an attitude of “we’ve been here before, we’ve seen this before.”</p>\n\n<p>“What we did last time wasn’t having an impact, so maybe we should do things differently now,” Harvey, the author of “Celebrity Influence: Politics, Persuasion and Issue-Based Advocacy,” said of what Trump’s bevy of star-studded critics could be thinking.</p>\n<p>Many famous faces, Harvey said, likely find themselves in a similar predicament right now as the Democratic Party itself. </p>\n<p>“If you compare 2016 to now — the slightest thing, every executive order, everything — had an outraged response. You could argue this was a justifiable outrage, but it also didn’t matter,” Harvey said.</p>\n\n<p>“[Celebrities] spoke out, and they felt probably by now that some of that was ineffective. I think they’re being more choosy about their outrage or how they’re going about this. This is going to have to be less about Donald Trump, and more about the issues.”</p>\n<p>It’s a reset that, knowingly or not, echoes a change in messaging that <a href=\"https://thehill.com/homenews/campaign/343559-new-dem-message-doesnt-mention-trump/\" rel=\"noreferrer noopener\" target=\"_blank\">Democrats adopted</a> as part of their 2018 agenda ahead of the midterm elections. In messaging documents released in 2017, Trump’s name was not mentioned a single time. </p>\n<p>“People need to know not only what we’re fighting against,” Sen. Chris Van Hollen (D-Md.) said at the time. “They need to know what we’re fighting for.”</p>\n\n<p>Some big names have been open about utilizing a Lord Voldemort-like approach to Trump’s name. In J.K. Rowling’s famed “Harry Potter” series, the villain is rarely referred to by his name by the other characters out of fear and worry of retribution. </p>\n<p>“I think it might be irresponsible to give him attention,” Stephen Colbert <a href=\"https://thehill.com/blogs/in-the-know/in-the-know/547700-colbert-theres-no-avoiding-trump-but-i-dont-like-saying-his/\" rel=\"noreferrer noopener\" target=\"_blank\">said of Trump</a> in 2021. </p>\n<p>While “there’s no avoiding him as a subject,” the “Late Show” host said of the then-ex-president, “He shouldn’t be [an] essential subject because I think that merely empowers him in some way. That’s why I don’t like saying his name, or showing his picture, if possible.”</p>\n\n<p>Colbert made an appeal to his show’s viewers to submit alternative name suggestions for Trump on social media using the hashtag #HeWhoShallBeNamed. The late-night host <a href=\"https://thehill.com/blogs/in-the-know/4254422-colbert-writers-strike-saying-trumps-name-again/\" rel=\"noreferrer noopener\" target=\"_blank\">began saying</a> “Trump” again on his CBS program in 2023. </p>\n<p>“The View” co-host Whoopi Goldberg <a href=\"https://thehill.com/blogs/in-the-know/372243-whoopi-goldberg-i-cant-even-say-trumps-name/\" rel=\"noreferrer noopener\" target=\"_blank\">also adopted</a> a personal “don’t speak his name” Trump policy on the ABC daytime talk show. </p>\n<p>“He’s the president. I’m still not going to say his name. That’s not going to change,” <a href=\"https://variety.com/2024/tv/news/the-view-whoopi-goldberg-refuses-trump-name-election-win-1236202564/\" rel=\"noreferrer noopener\" target=\"_blank\">Goldberg told</a> viewers a day after the 2024 presidential election.</p>\n\n<p>Harvey noted that there are only certain circumstances in which celebrities can exert political influence. While they may fill up movie theaters and concert halls, superstars “are not good at convincing people on issues that are highly polemic.”</p>\n<p>“Celebrities can’t get people to give up their guns. Celebrities can’t get people to change their mind on abortion,” Harvey said. “Do you think they’re going to change anybody’s mind on Donald Trump? Probably not.”</p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/blogs/in-the-know/5126586-hollywood-celebrities-trump-voldemort/",
            "pub_date": "2025-02-05 23:01:21",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5125825,
            "title": "4 ways Trump and Musk are shattering the basic rules of American government",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>Although the flood of executive actions coming from the desk of President Trump — and from Elon Musk, his unelected and unofficial co-president — are instilling widespread shock and fear, America was amply <a href=\"https://globalnews.ca/news/10989366/donald-trump-project-2025-executive-orders-comparison/\" rel=\"noreferrer noopener\" target=\"_blank\">forewarned</a>. </p>\n<p>For those who weren’t paying much attention, or chose to look the other way, or who continue to either shrug it all off or cheer them on, here is a civics refresher on what is at stake and why it matters for all of us, not just Democrats.</p>\n\n<p>The framers of the Constitution rejected an unlimited monarchy, in which power was believed to flow directly from the divine to the king and his blood heirs. By the time of the American Revolution, the authority of the British Parliament <a href=\"https://repositories.lib.utexas.edu/server/api/core/bitstreams/006efae3-6a5e-4082-8fc0-4f77911dc042/content\" rel=\"noreferrer noopener\" target=\"_blank\">had been established</a>, but the colonists resented King George III’s bullying behavior. So the framers established three co-equal branches of government — legislative, executive and judicial — each of which was designed to answer to the other two.</p>\n<p>In <a href=\"https://press-pubs.uchicago.edu/founders/documents/v1ch10s16.html\" rel=\"noreferrer noopener\" target=\"_blank\">Federalist No. 51</a>, James Madison explained that it was necessary to “partition … power among the several departments” so that “its several constituent parts may, by their mutual relations, be the means of keeping each other in their proper places.” He called it “a reflection on human nature, that such devices should be necessary to control the abuses of government.” Three distinct branches offered “the great security against a gradual concentration of the several powers in the same department” on the theory that “if men were angels,” Madison wrote, “no government would be necessary.”</p>\n<p>The Constitution’s design was thus as much about psychology as it was about politics. The Framers understood that part of human nature is to amass, entrench and ultimately abuse power, so there must be disincentives to protect against bad behavior.</p>\n<p>Every road has a speed limit, but drivers honor only some of them. If there’s no chance of a speeding ticket, most people ignore the rules. But once a speed-trap machine is installed in the bushes, drivers begin to slow down. It’s not the speed limit sign that does it — it’s the threat of a consequence for speeding.</p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>The same goes for the laws that bind presidents, which include legislation enacted by Congress, rulings by federal judges and the Constitution itself. What these laws say is far less important than whether the other branches “issue tickets” to a president who blows through them.</p>\n<p>Trump, just two weeks into his second term, has already made very clear that he expects no tickets for speeding in the Oval Office — not from the Constitution, not from Congress and possibly not even from the courts. Consider just four examples.</p>\n\n<p>For starters, Musk is an extra-constitutional actor with no constitutional or statutory authority to do what he is doing. He is <a href=\"https://www.cnn.com/2025/02/02/politics/usaid-officials-leave-musk-doge/index.html\" rel=\"noreferrer noopener\" target=\"_blank\">reportedly taking steps</a> to shut down the U.S. Agency for International Development altogether, as well as <a href=\"https://www.reuters.com/world/us/musk-aides-lock-government-workers-out-computer-systems-us-agency-sources-say-2025-01-31/\" rel=\"noreferrer noopener\" target=\"_blank\">locking career civil servants</a> out of computer systems and enabling his own team’s access to the personal data of the federal workforce. The three-branch system does not include a “fourth” branch for private billionaires; slapping a made-up label on Musk’s so-called “department” does not legalize Musk’s status.</p>\n<p>Second, Trump has also already flouted legislation enacted by Congress and signed into law by prior presidents. In firing <a href=\"https://www.usatoday.com/story/news/politics/2025/01/25/trump-inspectors-general-agencies/77945298007/\" rel=\"noreferrer noopener\" target=\"_blank\">17 inspectors general</a>, for example, he ignored a binding requirement under federal law that he give 30 days’ notice to Congress with a justification in advance.</p>\n<p>Trump also issued a memo <a href=\"https://apnews.com/article/state-department-trump-foreign-aid-bf047e17ef64cb42a1a1b7fdf05caffa\" rel=\"noreferrer noopener\" target=\"_blank\">freezing federal funding</a> on all “financial assistance programs” authorized by Congress. This is known as <a href=\"https://www.forbes.com/sites/alisondurkee/2025/01/28/can-trump-cancel-government-funds-through-impoundment-what-to-know-as-he-pauses-all-federal-assistance/\" rel=\"noreferrer noopener\" target=\"_blank\">impoundment</a>. When President Richard Nixon tried this, Congress passed the Impoundment Control Act, requiring presidents to get permission from Congress; if Congress doesn’t acquiesce, the funds get released after 45 days.</p>\n<div class=\"civic-science-article-container civic-science-more-14 civic-is-mr3\" data-civicscience-widget=\"3f127ebd-287e-0b64-a901-d55ec286348a\" id=\"civsci-id-civsci-id-596708068\"></div>\n<p>The Trump administration appears again to be taking the position that the Impoundment Act is unconstitutional. But that’s a question that’s for the courts, not the president, under the landmark 1803 ruling in <a href=\"https://www.oyez.org/cases/1789-1850/5us137\" rel=\"noreferrer noopener\" target=\"_blank\">Marbury v. Madison</a>. Trump also stopped federal spending under the Inflation Reduction Act of 2022 and the Infrastructure Investment and Jobs Act, Biden-era funding initiatives for infrastructure and climate.</p>\n<p>Third, Trump already seems to be treading precariously on the authority of the federal courts. On Jan. 27, U.S. District Judge Amit P. Mehta <a href=\"https://www.courthousenews.com/wp-content/uploads/2025/01/Mehta-lifts-dc-capitol-bar-oath-keepers.pdf\" rel=\"noreferrer noopener\" target=\"_blank\">reversed his prior order</a> barring nine of the Jan. 6 defendants from entering the U.S. Capitol after Trump had commuted their sentences. Mehta noted that everyone — the defendants, their lawyers and the U.S. Probation Offices — had agreed that even though the commutations released them from prison, the defendants were still subject to their terms of supervised release and the jurisdiction of the court. Stewart Rhodes, the founder of the Oath Keepers, even publicly stated that he would “report to [his] probation officer.”</p>\n<p>Trump’s Justice Department subsequently filed a motion stating that the defendants “are no longer subject to the terms of supervised release and probation.” In his order reversing himself, Judge Mehta noted that “the motion concludes not with a request for relief, but with an ‘indicat[ion] that the Order must be vacated.’” Translation: Trump declared what the law is and issued an order to a federal judge, not the other way around.</p>\n\n<p>Fourth, Trump is flagrantly ignoring the text of the Constitution and settled Supreme Court law. His rationale for the <a href=\"https://www.whitehouse.gov/presidential-actions/2025/01/protecting-the-meaning-and-value-of-american-citizenship/\" rel=\"noreferrer noopener\" target=\"_blank\">executive order</a> excluding certain categories of Americans from birthright citizenship was that “the Fourteenth Amendment has never been interpreted to extend citizenship universally to everyone born within the United States.” White House Press Secretary Karoline Leavitt <a href=\"https://www.msn.com/en-xl/politics/government/birthright-citizenship-is-unconstitutional-says-white-house-press-secretary/ar-AA1y25e2\" rel=\"noreferrer noopener\" target=\"_blank\">told reporters</a> that “birthright citizenship is unconstitutional.”</p>\n<p>But in <a href=\"https://www.thebulwark.com/p/trump-power-grab-executive-orders-birthright-citizenship-tiktok-constitution\" rel=\"noreferrer noopener\" target=\"_blank\">U.S. v. Wong King Ark</a>, the Supreme Court in 1898 rejected the argument Trump is making for limiting the Constitution’s birthright citizenship guarantee. If the Supreme Court doesn’t act to shore up its own authority, Trump could be setting a dangerous new precedent that he — not the high court — gets to decide what the Constitution means.</p>\n<p>The framers offered up way to stop this disturbing power grab in its tracks. It’s called impeachment. Yet while the Trump administration takes a wrecking ball to the Constitution, the people’s elected representatives in Congress are mostly standing meekly by, eschewing their constitutional authority to hold the executive branch accountable to the people. One day, the people may have had enough of all of them.</p>\n\n<p><a href=\"https://twitter.com/kimwehle\" rel=\"noreferrer noopener\" target=\"_blank\"><em>Kimberly Wehle</em></a><em> is author of the new book </em><a href=\"https://www.amazon.com/How-Pardon-Power-Works_and-Why/dp/1954907508/?_encoding=UTF8&amp;pd_rd_w=POyv6&amp;content-id=amzn1.sym.f76d456a-cb0d-44de-b7b0-670c26ce80ba&amp;pf_rd_p=f76d456a-cb0d-44de-b7b0-670c26ce80ba&amp;pf_rd_r=136-3333194-6622308&amp;pd_rd_wg=Z6ulj&amp;pd_rd_r=82df5ba2-dee9-4a62-bb9b-d463199696a9&amp;ref_=aufs_ap_sc_dsk\" rel=\"noreferrer noopener\" target=\"_blank\"><em>“Pardon Power: How the Pardon System Works — and Why.”</em></a></p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/opinion/white-house/5125825-4-ways-trump-and-musk-are-shattering-the-basic-rules-of-american-government/",
            "pub_date": "2025-02-05 23:01:19",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5127696,
            "title": "Trump floats nuclear peace deal with Iran",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>President Trump suggested early Wednesday that the U.S. strike a <a data-id=\"https://thehill.com/policy/defense/5049727-republicans-iran-pressure-nuclear-sites/\" data-type=\"link\" href=\"https://thehill.com/policy/defense/5049727-republicans-iran-pressure-nuclear-sites/\">nuclear peace deal</a> with Iran, reiterating his belief that the Islamic Republic should not have nuclear weapons.</p>\n<p>Still, Trump added that he wants to see the nation be “successful.”</p>\n\n<p>“I want Iran to be a great and successful Country, but one that cannot have a Nuclear Weapon. Reports that the United States, working in conjunction with Israel, is going to blow Iran into smithereens ARE GREATLY EXAGGERATED,” he <a data-id=\"https://truthsocial.com/@realDonaldTrump/posts/113950996936674770\" data-type=\"link\" href=\"https://truthsocial.com/@realDonaldTrump/posts/113950996936674770\">wrote</a> on Truth Social.</p>\n<p>“I would much prefer a Verified Nuclear Peace Agreement, which will let Iran peacefully grow and prosper,” he continued. “We should start working on it immediately, and have a big Middle East Celebration when it is signed and completed. God Bless the Middle East!”</p>\n<p>The commander-in-chief did not offer further details about the potential agreement. </p>\n<p>His comments come after Trump issued an executive order <a data-id=\"https://www.whitehouse.gov/presidential-actions/2025/02/national-security-presidential-memorandum-nspm-2/\" data-type=\"link\" href=\"https://www.whitehouse.gov/presidential-actions/2025/02/national-security-presidential-memorandum-nspm-2/\">intending to force</a> Iran’s oil exports to zero. The president also showed <a data-id=\"https://thehill.com/homenews/administration/5126429-trump-iran-assassinate/\" data-type=\"link\" href=\"https://thehill.com/homenews/administration/5126429-trump-iran-assassinate/\">openness to holding talks</a> with the nation but also warned that Iran would be “obliterated” if they <a data-id=\"https://thehill.com/regulation/court-battles/4981105-doj-iran-plot-trump/\" data-type=\"link\" href=\"https://thehill.com/regulation/court-battles/4981105-doj-iran-plot-trump/\">assassinated him</a>. </p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>“I’m going to sign it, but hopefully we’re not going to have to use it very much,” Trump said Tuesday. “We will see whether or not we can arrange or work out a deal with Iran.”</p>\n<p>“We don’t want to be tough on Iran. We don’t want to be tough on anybody,” he continued. “But they just can’t have a nuclear bomb.”</p>\n\n<p>Trump’s <a data-id=\"https://thehill.com/homenews/campaign/4910232-trump-biden-harris-iranian-attack/\" data-type=\"link\" href=\"https://thehill.com/homenews/campaign/4910232-trump-biden-harris-iranian-attack/\">tougher stance on Iran</a> resembles the approach during his first term. In 2018, he <a href=\"https://thehill.com/homenews/administration/386656-trump-pulls-us-out-of-iran-deal/\">withdrew</a> the U.S. from the Iran nuclear agreement that was formulated during former President Obama’s administration in 2015. Iran also pulled out of the agreement. </p>\n<p>The Islamic Republic has restarted enriching uranium. U.S. intelligence indicates that Iran has deployed a covert team of scientists looking for a faster pathway to developing the bomb if the country’s leadership approves of it, The New York Times <a href=\"https://www.nytimes.com/2025/02/03/us/politics/iran-nuclear-weapon.html\">reported</a> on Monday, citing current and former American officials. </p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/homenews/administration/5127696-donald-trump-nuclear-peace-deal-iran/",
            "pub_date": "2025-02-05 22:41:01",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5127703,
            "title": "Axelrod on Trump Gaza remarks: ‘Imagine how the Chinese interpret that as they eye Taiwan’",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>Democratic strategist David Axelrod said President Trump’s remarks about <a href=\"https://thehill.com/policy/international/5127510-donald-trump-gaza-takeover-allies-adversaries-react/\">taking over Gaza</a> may give China ideas “as they eye Taiwan.”</p>\n<p>On Tuesday, Trump met with Israeli Prime Minister Benjamin Netanyahu where <a href=\"https://thehill.com/homenews/administration/5126689-trump-palestinians-resettlement/\">he floated</a> the idea of the U.S. taking over the Gaza Strip. He suggested Americans should be responsible for cleaning up and rebuilding the destructed region.</p>\n\n<p>Axelrod joined CNN on Tuesday where he noted that world leaders typically don’t invade other countries because of the message it sends worldwide.</p>\n<p>He highlighted Trump’s <a href=\"https://thehill.com/policy/international/5014874-putin-trump-praise-intelligent-assassination-threats/\">2022 comment</a> when he called Russia’s move to invade Ukraine “genius.” If another country can “roll in” and take another, why wouldn’t they do it, Axelrod asked.</p>\n<p>“The reason you wouldn’t do it is because if everybody plays by those rules, you quickly devolve into global conflicts,” he said.</p>\n<p>“Imagine how the Chinese interpret that as they eye Taiwan,” Axelrod continued. “If the new rule is that you can take anything you want if you have the force to take it, we are in for a very, very tough time in … the very near future.”</p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>China has claimed that Taiwan is its own and <a href=\"https://thehill.com/policy/defense/4965559-taiwan-worried-trump-administration/\">is gearing up</a> to potentially attack to control the island in 2027. Trump has made several comments about Taiwan, saying that it should have to pay for protection from China. </p>\n<p>The president’s remarks about Gaza on Tuesday were some of his most extreme comments on the topic, particularly as the nearly 2 million Palestinians hope to have their own state after the Israel-Hamas war.</p>\n\n<p>Trump suggested that the U.S would develop the land there, though he did not give details on who would be able to live on the land.</p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/policy/international/5127703-david-axlerod-donald-trump-gaza-china-taiwan/",
            "pub_date": "2025-02-05 22:40:59",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5126152,
            "title": "Congress must stand up to Trump’s USAID power grab — before it’s too late ",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>President Trump’s toppling of the U.S. Agency for International Development this week offered the public its clearest view yet of the chaotic four years to come. Trump’s strategy of dismantling USAID amid a flurry of executive orders is almost certainly an <a href=\"https://thehill.com/policy/international/foreign-aid/5123972-lawmakers-legal-experts-warn-shuttering-usaid-is-unconstitutional/\" rel=\"noreferrer noopener\" target=\"_blank\">illegal exercise of powers </a>reserved for Congress.</p>\n<p>That doesn’t mean it won’t work. </p>\n\n<p>Trump’s first two weeks in office have been an unparalleled attack on the separation of executive and legislative power. Not only has Trump falsely claimed the power to <a href=\"https://www.pbs.org/newshour/politics/trump-orders-temporary-funding-freeze-that-could-affect-trillions-of-dollars\" rel=\"noreferrer noopener\" target=\"_blank\">“freeze” spending</a> already appropriated by Congress — effectively a line item veto on steroids — his closure of USAID is a direct attack on congressional authority. Even so, good luck finding a <a href=\"https://www.semafor.com/article/02/03/2025/usaids-breakup-sparks-little-outcry-from-even-pro-foreign-aid-republicans\" rel=\"noreferrer noopener\" target=\"_blank\">single Capitol Hill Republican</a> willing to defend Congress’s equal status in this governing partnership. </p>\n<p>Trump’s latest threat, to <a href=\"https://www.politico.com/news/2025/02/03/trump-finalizing-plans-shutter-education-department-00202225\" rel=\"noreferrer noopener\" target=\"_blank\">shutter the Department of Education,</a> is written in the language of a president convinced he stands above the constitutional order. Our congressional leaders must send a message to the White House by fiercely defending their legal authority to decide the future of USAID. As history has too often shown, powers seized by the White House are almost never given back to their original owners. </p>\n<p>Even in a political culture where truth evaporates at room temperature, the law is clear. Despite starting its life by executive order under President John F. Kennedy in 1961, <a href=\"https://thehill.com/homenews/administration/5124147-trump-musk-usaid-attacks/\" rel=\"noreferrer noopener\" target=\"_blank\">Congress codified USAID</a> as an official independent agency in the 1998 Foreign Affairs Reform and Restructuring Act. Republicans may think USAID is one big liberal slush fund, but it’s clearly up to Congress — not the White House — to determine the scope of the agency.  </p>\n<p>The specific threat posed by Trump’s power grab is one our Founders knew well. The issue was clearly on their mind during the drafting of the Constitution in 1787, having just fought a bloody war to free themselves from an overbearing executive. In fact, concerns about a president seizing legislative powers — especially the power of the purse — <a href=\"https://csac.history.wisc.edu/document-collections/constitutional-debates/executive-branch/\" rel=\"noreferrer noopener\" target=\"_blank\">dominated the media discourse of the day</a>. How little has changed.</p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>The scenes outside USAID headquarters this week may have lacked the drama of the Boston Massacre, but what was going on inside was equally revolutionary. It was there that Trump ally and megadonor Elon Musk directed officials to be locked out of their offices and refused entry to the building. “Spent the weekend feeding USAID into the wood chipper,” Musk would later <a href=\"https://thehill.com/policy/technology/5122676-usaid-shutdown-elon-musk-doge/\" rel=\"noreferrer noopener\" target=\"_blank\">gloat on X.</a></p>\n<p>Nobody in Republican circles seemed concerned that Musk, who faces no form of congressional oversight, had been given unrestricted access to the Treasury Department’s <a href=\"https://abcnews.go.com/US/treasury-dept-elon-musks-team-access-federal-payment/story?id=118380399\" rel=\"noreferrer noopener\" target=\"_blank\">sensitive payment system</a> as a means to further choke off USAID funds. Nor did a single Republican lawmaker speak up when Musk voiced the extreme legal theory that Trump could <a href=\"https://www.rollingstone.com/politics/political-commentary/trump-elon-musk-deleting-government-agencies-usaid-1235254897/\" rel=\"noreferrer noopener\" target=\"_blank\">dissolve any agency or department he wanted</a> without consulting Congress.  </p>\n\n<p>The framers of our Constitution wisely agreed that if the president had a problem with a law passed by Congress, he could persuade and cajole them to reform or repeal the law. It was, crucially, a transparent process meant to play out in full view of the public. Our founders both anticipated and explicitly took steps to prevent the type of unilateral action Trump just unleashed on USAID. Their only failing was expecting Congress to jealously guard its power instead of willingly surrendering it to the president. </p>\n<p>As is so common in Trumpian schemes, the end result is legal and organizational chaos. Secretary of State Marco Rubio on Monday declared himself <a href=\"https://www.cnn.com/2025/02/03/politics/usaid-washington-workers/index.html\" rel=\"noreferrer noopener\" target=\"_blank\">acting director of USAID</a> and announced a plan for the State Department to absorb whatever parts of USAID Musk doesn’t evaporate entirely. That must come with some bitterness for Rubio, who was once one of the Senate’s <a href=\"https://www.devex.com/news/us-sens-kaine-and-rubio-back-bill-to-diversify-usaid-funding-100491\" rel=\"noreferrer noopener\" target=\"_blank\">leading USAID expansionists</a>.</p>\n<p>Perhaps the Senate’s weak-willed Republicans think the federal courts will bail them out by ordering injunctions on Trump’s orders. That would certainly spare lawmakers the unpleasantness of disagreeing with Trump in public. But the Supreme Court’s recent <a href=\"https://www.aclu.org/press-releases/supreme-court-grants-trump-broad-immunity-for-official-acts-placing-presidents-above-the-law\" rel=\"noreferrer noopener\" target=\"_blank\">rulings broadly expanding executive power</a> aren’t reassuring. The courts simply can’t be counted on to uphold the constitutional balance of power. Congress will need to do this heavy lifting itself. </p>\n<p>Trump’s indefensible power grab at USAID, and his similar plans for the Department of Education, should give all lawmakers cause to reflect on their oath of office and what it means to serve our Constitution and our country. More than ever before, the American people need and deserve a strong Congress to check and balance Trump’s increasingly authoritarian White House.</p>\n<p><em>Max Burns is a veteran Democratic strategist and founder of Third Degree Strategies.</em>  </p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/opinion/congress-blog/5126152-trump-challenges-congressional-power-usaid/",
            "pub_date": "2025-02-05 22:31:10",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5127617,
            "title": "Watch live: House holds hearing on state of education as Trump weighs department cuts",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>The House Committee on Education and the Workforce is holding a hearing Wednesday morning to examine the <a data-id=\"https://thehill.com/homenews/education/5126566-public-education-satisfaction-gallup-poll/\" data-type=\"link\" href=\"https://thehill.com/homenews/education/5126566-public-education-satisfaction-gallup-poll/\">state of education</a> in the U.S., weeks after President Trump was sworn into the Oval Office for a second term.</p>\n<p>Trump has issued a bevy of executive orders since returning to the White House, including actions to <a data-id=\"https://thehill.com/homenews/education/5112965-trump-signs-order-to-boost-school-choice-programs/\" data-type=\"link\" href=\"https://thehill.com/homenews/education/5112965-trump-signs-order-to-boost-school-choice-programs/\">boost school choice programs</a> and to defund schools that <a data-id=\"https://thehill.com/homenews/education/5113202-trump-schools-executive-order-crt-gender-ideology/\" data-type=\"link\" href=\"https://thehill.com/homenews/education/5113202-trump-schools-executive-order-crt-gender-ideology/\">teach critical race theory</a>. The president is also eyeing executive actions that <a data-id=\"https://thehill.com/homenews/education/5126065-department-of-education-trump-musk-doge-doe-usaid/\" data-type=\"link\" href=\"https://thehill.com/homenews/education/5126065-department-of-education-trump-musk-doge-doe-usaid/\">would dismantle</a> the Education Department — a threat that has already placed dozens of staffers on leave.</p>\n<p>The event comes as Linda McMahon, Trump’s <a data-id=\"https://thehill.com/homenews/education/4999123-5-things-to-know-about-linda-mcmahon-trumps-pick-for-education-secretary/\" data-type=\"link\" href=\"https://thehill.com/homenews/education/4999123-5-things-to-know-about-linda-mcmahon-trumps-pick-for-education-secretary/\">nominee to lead</a> the department, has <a data-id=\"https://thehill.com/homenews/education/5114206-trump-education-executive-orders-linda-mcmahon/\" data-type=\"link\" href=\"https://thehill.com/homenews/education/5114206-trump-education-executive-orders-linda-mcmahon/\">yet to face</a> a Senate confirmation hearing or a vote.</p>\n<p>The hearing is scheduled to begin at 10:15 a.m. EST.</p>\n<p>Watch the live video above.</p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/video-clips/5127617-house-education-committee-hearing-watch-live/",
            "pub_date": "2025-02-05 22:20:58",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5127616,
            "title": "Democrats rip Trump Gaza takeover plan: ‘Openly calling for ethnic cleansing’",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>Democratic lawmakers sharply criticized President Trump’s <a href=\"https://thehill.com/policy/international/5127021-trump-us-takeover-gaza/\">plan</a> for the U.S. take over Gaza, calling it “ethnic cleansing.”</p>\n<p>Rep. Rashida Tlaib (D-Mich.) <a href=\"https://x.com/RepRashida/status/1886919833184325927\">said in a post on X</a> that Trump is “openly calling for ethnic cleansing while sitting next to a genocidal war criminal.”</p>\n\n<p>“He’s perfectly fine cutting off working Americans from federal funds while the funding to the Israeli government continues flowing,” Tlaib said, responding to a post that highlighted Trump’s meeting Tuesday with Israeli Prime Minister Benjamin Netanyahu.</p>\n<p>Trump <a href=\"https://thehill.com/policy/international/5127021-trump-us-takeover-gaza/\">floated the idea</a> of the U.S. taking over the Gaza Strip, saying the Americans should be responsible for cleaning up and rebuilding the war-torn region. They’re some of Trump’s most extreme comments on the topic, as nearly 2 million Palestinians hope to have their own state. Trump suggested the U.S. would develop the land there but didn’t give details on who would be able to live on the land.</p>\n<p>Tlaib, in <a href=\"https://x.com/RashidaTlaib/status/1886974021041877232\">a separate post</a>, said Palestinians “aren’t going anywhere.”</p>\n<p>“This president can only spew this fanatical bull—- because of bipartisan support in Congress for funding genocide and ethnic cleansing,” Tlaib said. “It’s time for my two-state solution colleagues to speak up.”</p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>Additionally, Sen. Chris Van Hollen (D-Md.)  argued that Trump is throwing a match on an “already very volatile situation,” noting that Middle Eastern countries have already met about the idea and did not approve of the U.S. taking over.</p>\n<p>“He just said that it will be U.S. policy to forcibly displace 2 million Palestinians from the Gaza Strip,” <a href=\"https://x.com/atrupar/status/1886944590319472857?utm_source=semafor\">Van Hollen said on MSNBC</a>. “That is ethnic cleansing by another name.”</p>\n\n<p>Sen. Chris Murphy (D-Conn.), meanwhile, argued that Trump has “totally lost it.”</p>\n<p>“A U.S. invasion of Gaza would lead to the slaughter of thousands of U.S. troops and decades of war in the Middle East,” <a href=\"https://x.com/ChrisMurphyCT/status/1886934775618834692\">Murphy said on X.</a> “It’s like a bad, sick joke.”</p>\n<p>Murphy attempted to shift attention away from Gaza and back to the U.S. government <a href=\"https://x.com/ChrisMurphyCT/status/1886943034174050438\">in another post.</a></p>\n<div class=\"civic-science-article-container civic-science-less-14 civic-is-mr3\" data-civicscience-widget=\"3f127ebd-287e-0b64-a901-d55ec286348a\" id=\"civsci-id-civsci-id-596708068\"></div>\n<p>“The media and the chattering class will focus on it for a few days and Trump will have succeeded in distracting everyone from the real story – the billionaires seizing government to steal from regular people,” he wrote.</p>\n<p>And Sen. Ruben Gallego (D-Ariz.) labeled Trump <a href=\"https://x.com/RubenGallego/status/1886942987021623729\">“a warmonger”</a> </p>\n<p>“Trump wants to invade Panama, Greenland and now Gaza.”</p>\n\n<p>The Hill has reached out to the White House for comment.</p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/policy/international/5127616-gaza-donald-trump-democrats-ethnic-cleansing/",
            "pub_date": "2025-02-05 22:05:54",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5127544,
            "title": "Watch live: House Oversight Committee hearing on government efficiency",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>The House Oversight Committee will hear testimony Wednesday morning from Iowa Gov. Kim Reynolds (R) about the Hawkeye State’s efforts to promote <a data-id=\"https://thehill.com/homenews/house/5025429-musk-ramaswamy-government-efficiency/\" data-type=\"link\" href=\"https://thehill.com/homenews/house/5025429-musk-ramaswamy-government-efficiency/\">government efficiency</a>.</p>\n<p>Reynolds announced last month that Iowa would <a data-id=\"https://thehill.com/homenews/state-watch/5087525-gov-kim-reynolds-announces-plan-for-iowa-doge/\" data-type=\"link\" href=\"https://thehill.com/homenews/state-watch/5087525-gov-kim-reynolds-announces-plan-for-iowa-doge/\">create its own</a> Department of Government Efficiency, in an effort to slash wasteful spending modeled after President Trump’s <a data-id=\"https://thehill.com/homenews/4988711-what-is-doge-the-new-department-musk-and-ramaswamy-will-lead-under-the-trump-administration/\" data-type=\"link\" href=\"https://thehill.com/homenews/4988711-what-is-doge-the-new-department-musk-and-ramaswamy-will-lead-under-the-trump-administration/\">latest federal agency</a> <a data-id=\"https://thehill.com/homenews/house/5025429-musk-ramaswamy-government-efficiency/\" data-type=\"link\" href=\"https://thehill.com/homenews/house/5025429-musk-ramaswamy-government-efficiency/\">helmed by</a> tech billionaire Elon Musk.</p>\n<p>Thomas A. Schatz, the president of Citizens Against Government Waste, will also be a witness.</p>\n<p>The “Rightsizing Government” hearing is scheduled to begin at 10 a.m. EST.</p>\n<p>Watch the live video above.</p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/video-clips/5127544-watch-live-house-oversight-committee-kim-reynolds-iowa-government-efficiency/",
            "pub_date": "2025-02-05 22:01:24",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5127507,
            "title": "Watch live: House GOP leaders discuss advancing Trump agenda",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>Speaker Mike Johnson and other House GOP leaders on Wednesday morning will discuss <a data-id=\"https://thehill.com/homenews/house/5127330-house-republicans-trump-agenda-scramble/\" data-type=\"link\" href=\"https://thehill.com/homenews/house/5127330-house-republicans-trump-agenda-scramble/\">their plan</a> to advance President Trump’s sprawling agenda.</p>\n<p>The press conference comes as Republican lawmakers scramble to find a solution to internal division over the Trump’s administration’s <a data-id=\"https://thehill.com/business/5126025-republicans-congressional-budget-tax-bill/\" data-type=\"link\" href=\"https://thehill.com/business/5126025-republicans-congressional-budget-tax-bill/\">tax and budget cut proposals</a> after they were <a href=\"https://thehill.com/homenews/house/5124454-gop-trump-agenda-vote-delay/\" rel=\"noreferrer noopener\" target=\"_blank\">forced to punt a key vote</a> this week — and as the Senate <a href=\"https://thehill.com/homenews/senate/5126273-senate-budget-package-house-stalemate/\" rel=\"noreferrer noopener\" target=\"_blank\">inches closer to moving ahead</a> with its alternative plan. </p>\n<p>The deadline to avert a government shutdown is March 14.</p>\n<p>Johnson said last month that he <a data-id=\"https://thehill.com/homenews/house/5068196-johnson-says-he-expects-to-pass-most-of-trumps-agenda-with-one-big-beautiful-bill-by-memorial-day/\" data-type=\"link\" href=\"https://thehill.com/homenews/house/5068196-johnson-says-he-expects-to-pass-most-of-trumps-agenda-with-one-big-beautiful-bill-by-memorial-day/\">plans to pass</a> most of the president’s agenda by Memorial Day, or May 26.</p>\n<p>Their remarks are scheduled to begin Wednesday morning at 10 a.m. EST.</p>\n<p>Watch the live video above.</p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/video-clips/5127507-watch-live-mike-johnson-house-gop-leadership-donald-trump-agenda/",
            "pub_date": "2025-02-05 22:01:19",
            "source": "thehill",
            "language": "en"
        }
    ]
}