{
    "data": [
        {
            "id": 5754919,
            "title": "The US must act now to secure the Baltic from Russia",
            "description": "<p>The Baltic Sea is again a dividing line of Europe. Once a maritime extension of the Iron Curtain that separated the continent into two rival spheres of influence, today Polish Deputy Prime Minister Radosław Sikorski calls it an <a href=\"https://www.polskieradio.pl/395/7784/artykul/3607295,baltic-region-where-%E2%80%98two-worlds-meet%E2%80%99-poland%E2%80%99s-foreign-minister-says\" rel=\"noreferrer noopener\" target=\"_blank\">intersection of different worlds</a> — the democratic West and autocratic Russia.</p>\n<p>Not only is the Baltic a political and ideological intersection, it’s a critical crossroads of energy, environmental, ecological and cyber domains that interconnects regional littoral states via subsea cables and pipelines. Many of these states have completely moved away from the import of Russian raw materials, making the Baltic Sea the energy-import corridor of Central and Eastern Europe.</p>\n<p>This is especially true for Poland, which sees the Baltic as essential to energy diversification and national security. The liquefied natural gas terminal at Swinoujscie and the Baltic Pipe, together with a planned <a href=\"https://notesfrompoland.com/2025/12/09/poland-to-launch-construction-of-first-nuclear-plant-after-eu-approves-e14bn-in-state-aid/\" rel=\"noreferrer noopener\" target=\"_blank\">nuclear power plant</a> and <a href=\"https://www.orlen.pl/en/about-the-company/media/press-releases/current/2025/February-2025/ORLEN-and-Northland-Power-Commence-Construction-of-Polands-First-Offshore-Wind-Farm#:~:text=Within%20this%20zone%2C%2078%20monopiles,compared%20to%20conventional%20power%20generation.\" rel=\"noreferrer noopener\" target=\"_blank\">off-shore wind farms</a> in towns along the Baltic or on the sea itself, mean that by 2040, 60 percent of Poland’s energy generated for domestic consumption will come from resource supply sources located there.</p>\n<p>Russia’s ongoing war against Ukraine, combined with intensifying military pressure and hybrid aggression against European Union and NATO states, has placed the Baltic Sea at the center of transatlantic security. It’s also at the center of Kremlin militarization efforts aiming to dominate a broad region of Europe stretching from the Arctic to Ukraine — forming what some experts are referring to as a new transatlantic <a href=\"https://theconversation.com/as-the-arctic-warms-up-the-race-to-control-the-region-is-growing-ever-hotter-273118\" rel=\"noreferrer noopener\" target=\"_blank\">“arc of crisis.”</a></p>\n<p>Russian military planners view <a href=\"https://www.diis.dk/en/research/russian-military-thinking-about-the-baltic-sea-and-the-arctic\" rel=\"noreferrer noopener\" target=\"_blank\">the Baltic and Arctic</a> as contiguous theatres of operation. Similar to <a href=\"https://kyivindependent.com/russias-arctic-shadow-war-how-moscows-most-probed-front-fuels-its-ukraine-invasion/\" rel=\"noreferrer noopener\" target=\"_blank\">the Arctic</a>, the Baltic Sea is used by the Kremlin to flex military muscle, including with partners <a href=\"https://www.defensenews.com/global/europe/2024/09/10/russia-launches-massive-naval-drills-with-china/\" rel=\"noreferrer noopener\" target=\"_blank\">China</a> and <a href=\"https://news.usni.org/2021/07/22/exclusive-photo-irans-largest-warship-now-in-the-baltic-sea-bound-for-russia\" rel=\"noreferrer noopener\" target=\"_blank\">Iran</a>. It remains susceptible to ongoing <a href=\"https://www.pism.pl/publications/nato-and-the-eu-respond-to-russian-maritime-sabotage\" rel=\"noreferrer noopener\" target=\"_blank\">sabotage operations of critical infrastructure</a> — since 2023, Russia damaged at least 11 undersea cables and pipelines — and the most important laboratory to practice hybrid war against NATO and the West. Russia’s <a href=\"https://www.atlanticcouncil.org/dispatches/the-us-is-taking-action-against-russias-shadow-fleet-in-the-baltic-sea-europe-should-follow-suit/\" rel=\"noreferrer noopener\" target=\"_blank\">“shadow fleet vessels”</a> pose not only an armed escalation threat, as some are being <a href=\"https://balticsentinel.eu/8256546/finnish-defense-minister-russia-started-using-warships-to-escort-shadow-fleet-tankers\" rel=\"noreferrer noopener\" target=\"_blank\">escorted by the Russian navy or air force</a>, but also a potential ecological crisis on the Baltic. </p>\n<p>Persistent activity threatening allied security and cohesion in the Baltic is indispensable to Vladimir Putin’s efforts of restoring Russia’s regional status and projecting power into adjacent theaters. The Baltic serves as a gateway for Russia into the Atlantic and, more broadly, onto the global stage. </p>\n<p>Given the importance of the Baltic Sea area to the balance of power in the Euro-Atlantic, it should be a major focus of U.S. foreign policy. America must work with like-minded partners and allies to protect the world from falling under the influence and control of Russia, China and Iran. It can do so in the Baltic by having a strategy in place with political, diplomatic, military and economic options to advance its posture in the region. </p>\n<p>Greater military engagement with NATO littoral Baltic Sea states can strengthen deterrence and sea denial strategy in critical areas, including air defense, mine sweeping and antisubmarine warfare, that can hold the region at risk should Russia behave more aggressively there. </p>\n<p>Working closely with Poland is key. Warsaw is tightening its <a href=\"https://nationalinterest.org/feature/a-curtain-of-iron-can-contain-russia-in-europe\" rel=\"noreferrer noopener\" target=\"_blank\">security links with Nordic and Baltic partners</a> while modernizing its naval assets to provide a capable force to defend interests in the Baltic. This is part of Warsaw’s ambitious northern framework policy, which by 2028 aims to host a regional <a href=\"https://dailymare.com/news/polmafor-poland-to-host-natos-new-regional-maritime-command,1852\" rel=\"noreferrer noopener\" target=\"_blank\">NATO maritime command</a> in Gdynia to strengthen the Baltic’s security architecture in cooperation with regional partners, including Germany and Sweden. </p>\n<p>In addition, the U.S. should consider resourcing exportable defense packages to Baltic Sea littoral states (radars, jammers) while enabling the U.S. Navy to rotate mobile hard-defense detachments into the region to work with allies to protect coastlines, commercial assets, and infrastructure and energy arteries. This should include frequent and continuous port calls or maritime operations by cruisers and destroyers as well as smaller ships that can bolster coastal defense capabilities. </p>\n<p>Helping partners ensure freedom of navigation on the Baltic Sea will directly impact trade and commerce, contributing to the prosperity of regional states as well as the U.S. The states in this region are among Europe’s most attractive, up-and-coming trade and business partners — Poland is the first post-communist country to reach <a href=\"https://www.polskieradio.pl/395/7786/artykul/3574113,poland-joins-elite-1-trillion-economy-club-as-growth-outpaces-major-powers\" rel=\"noreferrer noopener\" target=\"_blank\">$1 trillion GDP</a> per capita, joining an exclusive group of just 20 nations. </p>\n<p>Engaging in measures further securing the Baltic as Central and Eastern Europe’s energy-import corridor are in Washington’s interest. Regional states are consumers of U.S. liquefied natural gas, which accounts for about <a href=\"https://www.reuters.com/business/energy/us-share-europes-lng-imports-increased-60-january-2026-01-30/\" rel=\"noreferrer noopener\" target=\"_blank\">60 percent of Europe’s supply</a>. In 2025, Poland spent <a href=\"https://www.bssc.pl/2025/02/23/the-us-is-the-main-exporter-of-lng-china-is-the-leading-importer-the-eu-is-dependent-on-the-main-players/#:~:text=Corbeau%20predicts.,Chinese%20tariffs%20on%20American%20LNG.\" rel=\"noreferrer noopener\" target=\"_blank\">more than $1 billion</a> on American gas — it is seeking to secure more for itself and to be a regional <a href=\"https://www.reuters.com/business/energy/poland-talks-import-more-lng-us-supply-ukraine-slovakia-2025-11-05/\" rel=\"noreferrer noopener\" target=\"_blank\">distributor</a> to neighbors such as Ukraine and Slovakia. In diversifying its energy mix, Poland is working with American companies on developing nuclear energy, including <a href=\"https://www.iaea.org/newscenter/news/what-are-small-modular-reactors-smrs\" rel=\"noreferrer noopener\" target=\"_blank\">SMR technology</a>. </p>\n<p>Washington has a strategic interest that the Baltic Sea be a benign and stable security environment. Strong congressional bipartisan support exists toward the region and littoral states, which are seen as among America’s closest allies. For this reason, Congress should urge the Trump administration to draft a Baltic Sea strategy as a necessary element of the U.S. policy toolbox.</p>\n<p>A free and open Baltic will foster economic and other connectivity between Europe, North America and the world. Most importantly, it would counter Putin’s “arc of crisis” from further destabilizing the transatlantic space while advancing America’s interests.  </p>\n<p><em><u><a href=\"https://pism.pl/analysts/Pawel_Markiewicz_en\" rel=\"noreferrer noopener\" target=\"_blank\">Pawel Markiewicz</a></u> is a historian of 20th century Central and Eastern Europe. He currently serves as executive director of the Washington, D.C., office of the Polish Institute of International Affairs, and is adviser to the PISM director for U.S. operations.</em></p>",
            "kind": 1,
            "link": "https://thehill.com/opinion/international/5754919-baltic-sea-transatlantic-security/",
            "pub_date": "2026-02-26 22:40:37",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5756240,
            "title": "Most doubt Trump judgment on use of military force abroad amid Iran tensions: Poll",
            "description": "<p>A majority of Americans doubt President Trump’s judgment when it comes to using military force abroad, even as many say they are concerned about the threat Iran’s nuclear program poses to the U.S., according to a new survey.</p>\n<p>The latest <a href=\"https://apnorc.org/wp-content/uploads/2026/02/AP-NORC-February-2026-W2-Topline-_Iran.pdf\">AP-NORC Research Center poll</a>, released Thursday, found that 48 percent of respondents are “extremely” or “very” concerned about the threat of Iran’s nuclear program. Another 31 percent said they were moderately concerned while 19 percent were “not very” or “not concerned at all.”</p>\n<p>The results come as Washington and Tehran officials participate in a <a href=\"https://thehill.com/homenews/ap/ap-international/ap-us-and-iran-to-hold-a-third-round-of-nuclear-talks-as-more-american-forces-deploy-to-the-mideast/\">third round of indirect talks</a> mediated by Oman in Geneva, Switzerland. </p>\n<p>The Trump administration is pressuring Iran to constrain its nuclear program, saying the Middle Eastern nation cannot possess <a href=\"https://thehill.com/homenews/ap/ap-international/ap-israels-netanyahu-is-meeting-with-trump-this-week-to-push-for-a-far-broader-iran-deal/\">enrich uranium</a> or a nuclear weapon. Iranian officials have also rejected claims that they are working to develop <a href=\"https://thehill.com/homenews/administration/5753940-iran-icbm-development-trump/\">long-range missiles capable of reaching U.S. </a>territory — but have thus far insisted they will not give up their program.</p>\n<p>More than 60 percent of respondents say they view Iran as an enemy of the U.S. Another 28 percent said the nation was “not friendly,” but not necessarily an enemy and 7 percent said it is “friendly” or a “close ally,” according to the poll.</p>\n<p>Negotiations around its embattled nuclear program resumed months after Iran <a href=\"https://thehill.com/policy/international/5348689-iran-nuclear-deal-talks-suspended/\">withdrew from scheduled talks</a> with the U.S. last June following a <a href=\"https://thehill.com/homenews/ap/ap-international/ap-live-updates-israel-attacks-iran-2/\">deadly Israeli airstrike</a> that targeted Tehran’s nuclear scientists, ballistic missile sites and one of the country’s top enrichment facilities. The U.S. also <a data-id=\"https://thehill.com/policy/defense/5362470-us-iran-bombing-takeaways/\" data-type=\"link\" href=\"https://thehill.com/policy/defense/5362470-us-iran-bombing-takeaways/\">launched strikes</a> on three nuclear facilities in Iran over the summer.</p>\n<p>President Trump has maintained that he prefers a <a href=\"https://thehill.com/homenews/administration/5754746-vance-us-seeks-iran-diplomacy/\">diplomatic solution</a> to the impasse but has been steadily <a href=\"https://thehill.com/policy/defense/5737201-uss-gerald-r-ford-middle-east-us-iran/\">ramping up the U.S.’s military presence</a> in the Middle East region, giving himself more options if he decides to pursue what he has described as “<a href=\"https://thehill.com/policy/international/5747127-trump-iran-nuclear-deal-outcome-timeline/\">unfortunate</a>” consequences, including a <a href=\"https://thehill.com/homenews/administration/5747382-trump-limited-strike-iran/\">potential limited strike</a>.</p>\n<p>Trump reupped the threat during his record-long <a data-id=\"https://thehill.com/homenews/administration/5754101-trump-state-union-address-takeaways/\" data-type=\"link\" href=\"https://thehill.com/homenews/administration/5754101-trump-state-union-address-takeaways/\">State of the Union address</a> Tuesday.</p>\n<p>“After Midnight Hammer, they were warned to make no future attempts to rebuild their weapons program, and in particular nuclear weapons, yet they continue,”  the president said.  “They’re starting it all over.” </p>\n<p>“They want to make a deal, but we haven’t heard those secret words: We will never have a nuclear weapon,” he added.</p>\n<p>When it comes to Trump’s threat of force, 56 percent of adults said they have little or no trust that the president will “make the right decision” about international military action, compared to 27 percent who said the opposite, the survey found.</p>\n<p>The poll results also show skepticism about the administration’s handling of foreign affairs, with 56 percent expressing distrust in Trump’s job of maintaining relationships with U.S. allies and 55 percent said they lack confidence in how he approaches adversaries.</p>\n<p>The U.S. Treasury Department imposed a <a href=\"https://thehill.com/homenews/administration/5755158-us-iran-sanctions-oil-nuclear-program/\">fresh batch of sanctions</a> on Iranian individuals, companies and ships accused of enabling the country’s illicit oil sales and ballistic missile program on Wednesday, a day before negotiations resumed.</p>\n<p>The AP-NORC poll was conducted from Feb. 19-23 among 1,133 adults. It has a margin of error of 4 percentage points.</p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/administration/5756240-donald-trump-iran-tension-us-military-survey/",
            "pub_date": "2026-02-26 22:30:55",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5756220,
            "title": "World Economic Forum chief resigns after Epstein ties revealed",
            "description": "<p>Børge Brende resigned as president and CEO of the World Economic Forum (WEF) amid revelations regarding his ties to Jeffrey Epstein.</p>\n<p>Brende <a href=\"https://www.weforum.org/press/2026/02/press-statement-from-co-chairs-andre-hoffmann-and-larry-fink-on-behalf-of-the-board-of-trustees/\">wrote in a WEF release</a> he decided to step down “after careful consideration” from a role he has occupied since 2017. He did not mention the late convicted sex offender.</p>\n<p>“My time here, spanning 8½ years, has been profoundly rewarding,” Brende added. “We have seen a record number of partners join us, and we have had a very successful Annual Meeting in Davos behind us, where we engaged with governmental leaders from all over the world like never before. </p>\n<p>“I am grateful for the incredible collaboration with my colleagues, partners, and constituents, and I believe now is the right moment for the Forum to continue its important work without distractions.”</p>\n<p>The WEF <a href=\"https://thehill.com/business/5726336-brende-wef-epstein-emails-dinners-probe/\">launched a probe</a> into Brende earlier this month, after documents released by the Department of Justice revealed he attended multiple “business dinners” with Epstein and exchanged emails and <a href=\"https://www.justice.gov/epstein/files/DataSet%2010/EFTA01612631.pdf\">text messages</a> with the sex offender, years after he pleaded guilty in 2008 to procuring a child for prostitution and soliciting a prostitute.</p>\n<p>In <a href=\"https://www.justice.gov/epstein/files/DataSet%2011/EFTA02258065.pdf\">September 2018</a>, Brende emailed with Lesley Groff, an assistant to Epstein, regarding a dinner at the disgraced financier’s Manhattan home. He also emailed with an assistant to Epstein, whose name is redacted, regarding a dinner at the home in June 2019 — weeks before the convicted sex offender was <a href=\"https://www.justice.gov/usao-sdny/pr/jeffrey-epstein-charged-manhattan-federal-court-sex-trafficking-minors\">arrested and charged</a> with trafficking minors for sex.</p>\n<p>Brende and Epstein also <a href=\"https://www.justice.gov/epstein/files/DataSet%2010/EFTA01612631.pdf\">exchanged messages in 2019</a>, with the latter sending the former what appears to be a photo of a woman he called “mss piggy.” In June 2019, Brende told Epstein he just “met your friend POTUS,” seemingly referring to President Trump. The president has denied wrongdoing in connection to Epstein. </p>\n<p>André Hoffmann and Larry Fink, the co-chairs of the WEF, wrote in the release they have “sincere appreciation for Børge Brende’s significant contributions” to the organization. They announced that Alois Zwinggi, a longtime member of the WEF’s managing board, will serve as interim president and CEO. </p>\n<p>“The independent review conducted by outside counsel has concluded. The findings stated that there were no additional concerns beyond what has been previously disclosed,” Hoffman and Fink wrote, regarding the investigation into Brende. </p>\n<p>Brende is the <a href=\"https://thehill.com/homenews/education/5754818-summers-epstein-ties-harvard-resigns/\">latest in a string</a> of U.S. and global figures to face professional or criminal consequences for their ties to Epstein. In the U.K., Andrew Mountbatten-Windsor and former U.K. Ambassador to the U.S. Peter Mandelson were <a href=\"https://thehill.com/homenews/administration/5746654-royal-family-epstein-scandal/\">arrested this month</a> for <a href=\"https://thehill.com/policy/international/5751029-mandelson-arrested-epstein-ties/\">allegedly providing sensitive government information</a> to Epstein. </p>",
            "kind": 1,
            "link": "https://thehill.com/policy/international/5756220-epstein-brende-world-economic-forum-resigns/",
            "pub_date": "2026-02-26 22:30:55",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5755665,
            "title": "Live updates: US, Iran look for common ground in Geneva talks; Hillary Clinton faces Epstein questions",
            "description": "<p>Trump administration envoys are in Geneva, Switzerland, for <a data-id=\"https://thehill.com/policy/international/5755742-trump-iran-nuclear-threat/\" data-type=\"link\" href=\"https://thehill.com/policy/international/5755742-trump-iran-nuclear-threat/\">another round of critical talks</a> with Iranian and Omani officials on the Islamic republic’s nuclear program.</p>\n<p>Secretary of State Marco Rubio said Wednesday he was hoping for “productive” conversations and that “diplomacy is always on the table.” Oman’s foreign ministry <a href=\"https://x.com/FMofOman/status/2026951058874929659\" rel=\"noreferrer noopener\" target=\"_blank\">said on social platform X</a> the talks were ongoing, with “a constructive spirit.”</p>\n<p>As the U.S. sets the stage for potential military action in the Middle Eastern country, however, a group of bipartisan senators has indicated it will push forward a <a href=\"https://thehill.com/homenews/senate/5755623-democrats-divided-over-iran-response/\" rel=\"noreferrer noopener\" target=\"_blank\">war powers resolution</a> seeking to rein in President Trump.</p>\n<p>On Capitol Hill, Department of Homeland Security funding talks remain stalled, as Senate Majority Leader John Thune is starting to <a href=\"https://thehill.com/homenews/senate/5755667-trump-thune-voting-bill-talking-filibuster/\" rel=\"noreferrer noopener\" target=\"_blank\">feel increasing pressure</a> to act on the GOP’s SAVE Act — which would require proof of citizenship when registering to vote.</p>\n<p>In New York, former Secretary of State Hillary Clinton will sit for a <a href=\"https://thehill.com/homenews/house/5755536-clintons-depositions-epstein-investigation/\" rel=\"noreferrer noopener\" target=\"_blank\">closed-door deposition</a> before the House Oversight and Government Reform Committee on its probe into convicted sex offender Jeffrey Epstein. Her husband, former President Clinton, will meet with the committee on Friday.</p>\n<p>Trump will hold private meetings and receive an intelligence briefing on Thursday, while Vice President Vance will travel to Plover, Wis.</p>\n<p>Follow live below. </p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/administration/5755665-live-updates-trump-iran-hillary-clinton/",
            "pub_date": "2026-02-26 22:22:47",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5755042,
            "title": "Minneapolis chaos reveals a malevolent confusion over the First Amendment",
            "description": "<p>The <a href=\"https://www.ms.now/opinion/minneapolis-ice-metro-surge-trump-dhs\" rel=\"noreferrer noopener\" target=\"_blank\">lengthy drama that has played out in Minneapolis</a> in recent weeks has exposed yet again that too many Americans misunderstand what constitutes free expression. </p>\n<p>The First Amendment was designed by the framers to give citizens the rights to express themselves politically, religiously and culturally. Those protections allow people to express their thoughts and ideas. But that’s all the Constitution guarantees. </p>\n<p>Somewhere along the way, provocateurs bastardized the concept of free expression. They have confused unlawful incitement as “messaging” and falsely portrayed actual behavior as “free speech.” Apologists consciously obfuscate action and expression, lumping all approaches of dissent into the same category. </p>\n<p>A close reading of the First Amendment should remind Americans of the wording <a href=\"https://constitution.congress.gov/constitution/amendment-1/\" rel=\"noreferrer noopener\" target=\"_blank\">“peaceably to assemble.”</a> </p>\n<p>Even a former anchor at a high-profile news channel has intentionally mischaracterized what the First Amendment means. <a href=\"https://thehill.com/homenews/media/5737966-don-lemon-pleads-not-guilty/\" rel=\"noreferrer noopener\" target=\"_blank\">Don Lemon</a> intruded on private property and disrupted other citizens’ exercise of their rights, then tried to snooker the public with the claim that doing “journalism” allows such an invasion. Lemon’s stunt led to his arrest in Los Angeles by federal officials. Immediately, Mayor <a href=\"https://mayor.lacity.gov/news/mayor-bass-issues-statement-regarding-arrest-renowned-journalists-don-lemon-and-georgia-fort\" rel=\"noreferrer noopener\" target=\"_blank\">Karen Bass perpetuated the same inaccurate portrayal of Lemon’s actions</a>, proclaiming Lemon was “just doing his job.”</p>\n<p>Polarization happens when some citizens interpret free expression protections to include hostile action and incitement of unlawful behavior. Debate on issues ceases when mob behavior can be considered “expression” in a broad and unhealthy categorization. The forces of chaos thrive on these expansive interpretations of “expression” that justify dangerous behavior. </p>\n<p>Delineating what is constitutionally protected expression from uncivil conduct really isn’t that difficult to figure out, if the various parties want to promote reasoned discourse instead of chaotic behavior. Assembling, demonstrating, holding signs and chanting slogans are all just fine, if done on public property or your own property. All of those things are expressions.</p>\n<p>Blocking roads, vandalism, spitting, inciting violence, trespassing and organized interference with law enforcement officers are not OK. All of those things are actions — not expression or dissent. This should be simple enough to understand. </p>\n<p>There is no First Amendment “right” to try to nullify enforcement of federal law. President Dwight Eisenhower <a href=\"https://www.eisenhowerlibrary.gov/research/online-documents/civil-rights-little-rock-school-integration-crisis\" rel=\"noreferrer noopener\" target=\"_blank\">made that clear</a> to the governor of Arkansas in 1957, when the 101st Airborne was ordered to Little Rock to desegregate a school.</p>\n<p>But to the manipulators of mayhem and their overwrought true-believer followers, the false claim that action is the same as dissent serves a disruptive objective. Constitutional framer James Madison warned his countrymen about the dangers of mobs. He wrote in the <a href=\"https://founders.archives.gov/documents/Madison/01-10-02-0178\" rel=\"noreferrer noopener\" target=\"_blank\">Federalist Papers that mobs</a> were “adverse to the rights of other citizens, or to the permanent and aggregate interests of the community.” In 1838, a 28-year-old <a href=\"https://www.abrahamlincolnonline.org/lincoln/speeches/lyceum.htm\" rel=\"noreferrer noopener\" target=\"_blank\">Abraham Lincoln addressed a lyceum</a> in Springfield, Ill., telling his fellow citizens, “There is no grievance that is a fit object of redress by mob law.”</p>\n<p>Sensible Americans engage in productive dissent and free speech. Mobs promote civil disintegration and rage, and ultimately lead to anarchy. As British philosopher Edmund Burke <a href=\"https://www.irishphilosophy.com/2018/11/01/rage-and-frenzy/\" rel=\"noreferrer noopener\" target=\"_blank\">wrote two centuries ago</a>, “Rage and frenzy will pull down more in half an hour than prudence, deliberation and foresight can build in a hundred years.”</p>\n<p>It is unhelpful when government officials who should know better engage in the rhetoric of hysteria, demonizing political opponents and mischaracterizing disruptive behaviors as patriotic or somehow promoting justice. <a href=\"https://www.youtube.com/watch?v=MyMNyvO7xrk\" rel=\"noreferrer noopener\" target=\"_blank\">Minneapolis Mayor Jacob Frey broadly accused federal law enforcement</a> of trying “to silence dissent.” Perhaps some innocent citizens have been silenced, but it  is not silencing dissent to clear barricaded streets, stop vandalism or restrain people who are throwing projectiles. Rather, those are examples of addressing criminal behavior.</p>\n<p>The role of television news outlets in covering or even fueling disruptions is also worth noting. Much of the havoc carried out on the streets was designed particularly for the television cameras and news organizations playing along as publicists, dispensing emotion but providing too little context.</p>\n<p>Certainly, there is much blame to go around for the sad trajectory of events in Minneapolis. But it is safe to say that First Amendment ignorance has been a key part of this sad and, indeed, tragic episode. </p>\n<p>These intentional mischaracterizations of free expression, dispensed into the tense climate, did nothing to promote justice or patriotic dissent. Rather, the manipulation led to bedlam and a weakening of the rhetorical sphere in which such disputes should be resolved.  </p>\n<p><em><u><a href=\"https://twitter.com/Prof_McCall\" rel=\"noreferrer noopener\" target=\"_blank\">Jeffrey M. McCall</a></u> is a media critic and professor of communication at DePauw University. He has worked as a radio news director, a newspaper reporter and as a political media consultant.</em>   </p>",
            "kind": 1,
            "link": "https://thehill.com/opinion/white-house/5755042-first-amendment-rights-debate/",
            "pub_date": "2026-02-26 22:10:41",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5756249,
            "title": "DOJ reviewing whether any Epstein records withheld after reports of missing Trump-related documents",
            "description": "<p>The Justice Department will review whether it failed to publish several documents in the Epstein files after various media outlets reported several records related to accusations made against President Trump were removed from the tranche.</p>\n<p>The documents in question relate to accusations made by a woman who said as a minor she refused Trump’s sexual advances, prompting the president to respond violently and kick her out of the room. </p>\n<p>While the woman’s accusation was cataloged in the Epstein files, serial numbers tracking the various documents show that while the woman spoke to the FBI four times, roughly 50 pages related to the woman’s interviews were not publicly released; instead, only files detailing her accusations against Epstein were published.</p>\n<p>The White House has denied any wrongdoing by Trump, and Justice previously described the accusations as “salaciously insane” and argued they were found to have no credibility. It also had previously defended its handling of the release of documents.</p>\n<p>But in a shift, Justice on Wednesday said it would conduct the review.</p>\n<p>“Several individuals and news outlets have recently flagged files related to documents produced to Ghislaine Maxwell in discovery of her criminal case that they claim appear to be missing,” DOJ said in a <a href=\"https://x.com/DOJRR47/status/2026769082159112295?s=20\">statement Wednesday</a>.</p>\n<p>“As with all documents that have been flagged by the public, the Department is currently reviewing files within that category of the production. Should any document be found to have been improperly tagged in the review process and is responsive to the Act, the Department will of course publish it, consistent with the law.”</p>\n<p>Congressional Democrats are pledging to review the matter.</p>\n<p>“Yesterday, I reviewed unredacted evidence logs at the Department of Justice,” Rep. Robert Garcia (D-Calif.), ranking member of the Oversight Committee, said in a Tuesday statement.</p>\n<p>“Oversight Democrats can confirm that the DOJ appears to have illegally withheld FBI interviews with this survivor who accused President Trump of heinous crimes. Oversight Democrats will open a parallel investigation into this.” </p>\n<p>In a response the same day, DOJ again asserted nothing had been removed, saying, “NOTHING has been deleted…ALL responsive documents have been produced unless a document falls within one of the following categories: duplicates, privileged, or part of an ongoing federal investigation.</p>\n<p>But the pushback only prompted more questions from Oversight Democrats.</p>\n<p>“Records of FBI interviews with a survivor who alleged Trump sexually assaulted her as a child aren’t duplicates or shouldn’t be privileged. Are you saying there’s an active, ongoing federal investigation into President Trump?” the panel’s minority wrote on X.</p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/administration/5756249-doj-investigates-withheld-fbi-interviews/",
            "pub_date": "2026-02-26 22:10:40",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5755462,
            "title": "Gillibrand wants $130B tariff refund for Americans",
            "description": "<p>(NEXSTAR) — New York Democratic leaders want President Trump to <a data-id=\"https://thehill.com/homenews/5748171-us-tariff-revenue-refunds/\" data-type=\"link\" href=\"https://thehill.com/homenews/5748171-us-tariff-revenue-refunds/\">refund billions</a> after the Supreme Court ruling <a data-id=\"https://thehill.com/regulation/court-battles/5687657-scotus-rejects-trump-emergency-tariffs/\" data-type=\"link\" href=\"https://thehill.com/regulation/court-battles/5687657-scotus-rejects-trump-emergency-tariffs/\">struck down the bulk</a> of his tariffs on foreign trading partners.</p>\n<p>Sen. Kirsten Gillibrand (D-N.Y.) held a virtual press conference Wednesday to demand the administration send money back to small businesses and consumers, arguing that <a data-id=\"https://thehill.com/business/5737182-tariffs-trump-us-businesses-impact/\" data-type=\"link\" href=\"https://thehill.com/business/5737182-tariffs-trump-us-businesses-impact/\">American businesses and consumers</a> paid 96 percent of the costs for the “<a data-id=\"https://thehill.com/regulation/court-battles/5747353-read-supreme-court-trump-tariffs-ruling/\" data-type=\"link\" href=\"https://thehill.com/regulation/court-battles/5747353-read-supreme-court-trump-tariffs-ruling/\">illegal</a>” tariffs, generating some $130 billion in federal revenue. She demanded Treasury Secretary Scott Bessent <a data-id=\"https://thehill.com/regulation/court-battles/5747881-supreme-court-tariff-refunds/\" data-type=\"link\" href=\"https://thehill.com/regulation/court-battles/5747881-supreme-court-tariff-refunds/\">issue refunds</a> immediately.</p>\n<p>“That’s money that President Trump now owes back to the American people,” Gillibrand said. </p>\n<p>She added that tariffs and remarks from the president deeply offended Canadians, significantly reducing tourism that keeps businesses in New York afloat.</p>\n<p>To force the administration to issue refunds, the New York Democrat said companies should sue the trade commission. She also encouraged local businesses struggling without Canadian customers should write to Attorney General Letitia James (D) for legal support.</p>\n<p>“I imagine our attorney general will file a lawsuit,” she added. “I think it’s the best way for us to get our money back.”</p>\n<p>New York Gov. Kathy Hochul’s (D) office would not comment on the potential for a lawsuit but said the state government would explore all of its options to get refunds for New Yorkers.</p>\n<p>Officials presented different data points to estimate alleged economic damage. Gillibrand said the tariffs cost the average New York household about $4,200 per year. Meanwhile, a <a data-id=\"https://thehill.com/homenews/state-watch/5754391-new-york-kathy-hochul-tariff-refunds-trump-supreme-court/\" data-type=\"link\" href=\"https://thehill.com/homenews/state-watch/5754391-new-york-kathy-hochul-tariff-refunds-trump-supreme-court/\">statement from Hochul</a> on Tuesday cited the Yale Budget Lab, estimating $1,751 per household in new costs since the 2025 tariffs were enacted.</p>\n<p>Rochester business owner Ben Pearson manufactures science kits, according to Senate Minority Leader Chuck Schumer (D-N.Y.), and lost $1 million to tariffs — creating a deficit that forced him to reduce his workforce by 20 percent. Schumer invited Pearson to President Trump’s <a data-id=\"https://thehill.com/homenews/administration/5754101-trump-state-union-address-takeaways/\" data-type=\"link\" href=\"https://thehill.com/homenews/administration/5754101-trump-state-union-address-takeaways/\">State of the Union address</a> Tuesday night to demonstrate the financial strain in the state.</p>\n<p>“Upstate NY is paying the price for Trump’s cost-increasing policies, and it needs to stop,” Schumer said in a press release ahead of the <a data-id=\"https://thehill.com/homenews/administration/5754220-donald-trump-2026-state-of-the-union-record-speech/\" data-type=\"link\" href=\"https://thehill.com/homenews/administration/5754220-donald-trump-2026-state-of-the-union-record-speech/\">record-long speech</a>.</p>\n<p>After the address, conservatives in New York defended the president, targeting Hochul’s leadership instead. New York State Conservative Party Chair Gerard Kassar released a statement afterward praising Trump’s <a data-id=\"https://thehill.com/homenews/administration/5754028-trump-state-of-the-union-memorable-moments/\" data-type=\"link\" href=\"https://thehill.com/homenews/administration/5754028-trump-state-of-the-union-memorable-moments/\">State of the Union remarks</a>, arguing that he offered a sensible vision to counter progressive policies.</p>\n<p>Other than international travel, tariffs also disrupted agriculture, according to the governor. </p>\n<p>Hochul proposed a $30 million relief plan to help farmers offset the higher costs of equipment and fertilizer. According to her office, over 80 percent of agrochemical imports and 70 percent of farm machinery come from countries tariffed at 10 percent or more.</p>",
            "kind": 1,
            "link": "https://thehill.com/business/5755462-kirsten-gillibrand-new-york-13b-tariff-refunds/",
            "pub_date": "2026-02-26 21:51:06",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5756167,
            "title": "4 killed in speedboat were trying to infiltrate Cuba, officials say",
            "description": "<p>The Cuban government said late Wednesday that the 10 individuals involved in a <a href=\"https://thehill.com/policy/international/5755294-cuba-speedboat-shooting/\">confrontation with the island’s border security officers</a> were armed Cubans living in the U.S. attempting to infiltrate the country.</p>\n<p>The government said the majority of those onboard the boat “have a known history of criminal and violent activity,” <a href=\"https://apnews.com/article/cuba-us-florida-boat-shooting-68e07061282dc2470993f6539bd0bde2\">according to The Associated Press</a>. </p>\n<p>Earlier Wednesday, Cuba’s Interior Ministry <a href=\"https://x.com/EmbaCubaUS/status/2026732911114760673\">said</a> four people on the speedboat were killed and six were injured during a firefight with border security officers roughly 1 nautical mile northeast of Cayo Falcones, in the Villa Clara province. </p>\n<p>The ministry noted that the speedboat was registered in Florida. </p>\n<p>Secretary of State Marco Rubio told reporters Wednesday that Cuban authorities informed him of the incident earlier that morning. He noted that the U.S. Coast Guard, under the Department of Homeland Security, is investigating the incident along with the State Department. </p>\n<p>“We’re not going to base our conclusions on what they’ve told us,” Rubio remarked, referring to the Cuban government. “And I am very, very confident that we will know the full story of what happened here and we will know it soon, and then we’ll respond appropriately based on what that information tells us.”</p>\n<p>The secretary of state clarified that the individuals on the vessel were not U.S. government officials, and the State Department is working to determine whether they were American citizens or permanent residents. </p>\n<p>Vice President Vance also told reporters Wednesday that Rubio briefed him on the incident.</p>\n<p>“Certainly, a situation that we’re monitoring, hopefully it’s not as bad as we fear it could be but can’t say more because I just don’t know more,” Vance added. </p>\n<p>A spokesperson for Florida Gov. Ron DeSantis (R) told The Hill Wednesday that the governor was also brought up to speed. Cuba is roughly 90 miles south of Key West, Fla.</p>\n<p>Florida Attorney General James Uthmeier (R) also <a href=\"https://x.com/AGJamesUthmeier/status/2026750551338205242?s=20\">wrote on social media</a> Wednesday that he directed the state’s Office of Statewide Prosecution “to work with our federal, state, and law enforcement partners” to investigate the incident.</p>",
            "kind": 1,
            "link": "https://thehill.com/policy/international/5756167-cuba-speedboat-killing-security/",
            "pub_date": "2026-02-26 21:40:45",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5754891,
            "title": "Blue state public health cuts don't 'own the libs' — they endanger us all",
            "description": "<p>The Trump administration’s decision to <a href=\"https://www.nytimes.com/2026/02/09/health/trump-public-health-cuts-california.html\" rel=\"noreferrer noopener\" target=\"_blank\">slash $600 million in public health funding</a> from California, Colorado, Illinois and Minnesota isn’t just cruel or vindictive. It is breathtakingly stupid. </p>\n<p>According to <a href=\"https://www.nytimes.com/2026/02/09/health/trump-public-health-cuts-california.html\" rel=\"noreferrer noopener\" target=\"_blank\">documents reviewed by The New York Times</a>, the administration plans to rescind hundreds of millions in grants administered through the Centers for Disease Control and Prevention — funds that state and local health departments use for everything from hiring staff and modernizing data systems to managing disease outbreaks and preventing the spread of HIV. </p>\n<p>The rationale? These grants “<a href=\"https://www.usnews.com/news/health-news/articles/2026-02-11/trump-pulls-600m-in-public-health-funds-from-four-states\" rel=\"noreferrer noopener\" target=\"_blank\">do not reflect agency priorities</a>.” Translation: The states that receive them are run by Democrats. </p>\n<p>This is weaponization of public health funding for partisan retribution. It is government by grievance, policy by punishment, and it carries consequences that will reverberate far beyond the borders of the blue states that the administration seems so eager to penalize. </p>\n<p>Start with the most elementary fact of epidemiology: Infectious diseases do not recognize state borders or consult electoral maps. As former CDC chief medical officer Dr. Deb Houry pointedly noted, <a href=\"https://www.nytimes.com/2026/02/09/health/trump-public-health-cuts-california.html\" rel=\"noreferrer noopener\" target=\"_blank\">these cuts are happening “in the middle of a measles outbreak and other health threats</a>.”</p>\n<p>Measles, for those who need reminding, is <a href=\"https://www.who.int/news-room/fact-sheets/detail/measles\" rel=\"noreferrer noopener\" target=\"_blank\">one of the most contagious diseases</a> known to science. An outbreak that festers in a defunded California county doesn’t politely stop at the Nevada state line. It spreads — to Arizona, to Texas, to Florida, to every red state whose leaders might now be applauding this vindictive budget maneuver. </p>\n<p>This isn’t hypothetical. In December 2014, a measles outbreak that began at Disneyland in Anaheim, Calif., spread within weeks to <a href=\"https://www.cdc.gov/mmwr/preview/mmwrhtml/mm6406a5.htm\" rel=\"noreferrer noopener\" target=\"_blank\">six other states, Mexico and Canada</a>, ultimately infecting more than <a href=\"https://qmrawiki.org/case-studies/measles-outbreak-theme-park-southern-california-and-propagation-through-california\" rel=\"noreferrer noopener\" target=\"_blank\">147 people in the U.S. alone</a>. Among the hardest hit beyond California: <a href=\"https://www.cdc.gov/mmwr/preview/mmwrhtml/mm6406a5.htm\" rel=\"noreferrer noopener\" target=\"_blank\">Arizona, a red state, with seven linked cases, and deep-red Utah, with three</a>.</p>\n<p>The virus didn’t care that it was crossing from blue California into reliably conservative territory. It simply followed the unvaccinated. </p>\n<p>Nearly two dozen of the targeted grants were specifically aimed at curbing HIV and other sexually transmitted infections. Among the casualties: <a href=\"https://www.nytimes.com/2026/02/09/health/trump-public-health-cuts-california.html\" rel=\"noreferrer noopener\" target=\"_blank\">$5.2 million</a> from Lurie Children’s Hospital of Chicago for expanding HIV prevention therapy among Black women, and $<a href=\"https://www.usnews.com/news/health-news/articles/2026-02-11/trump-pulls-600m-in-public-health-funds-from-four-states\" rel=\"noreferrer noopener\" target=\"_blank\">371,000 from the Colorado Health Network</a> for outreach to Latino and African American men. </p>\n<p>These are precisely the kinds of community-based interventions that prevent localized health crises from becoming national ones. Gut them, and you aren’t owning the libs. You’re seeding the next epidemic. </p>\n<p>Then there’s the economic argument, which should matter even to those unmoved by humanitarian concerns. Illness is expensive. The CDC’s core public health infrastructure grants exist precisely because prevention is orders of magnitude cheaper than treatment.  </p>\n<p>California alone accounts for nearly two-thirds of the rescinded funding. <a href=\"https://www.gov.ca.gov/2025/04/23/california-is-now-the-4th-largest-economy-in-the-world/\" rel=\"noreferrer noopener\" target=\"_blank\">California is also the world’s fourth-largest economy</a>. When its public health infrastructure falters, the economic ripple effects don’t stay in Sacramento. They radiate through supply chains, labor markets and interstate commerce. </p>\n<p>The administration’s own stated rationale makes this worse, not better. The CDC’s website now declares that focusing on diseases that disproportionately affect certain populations “<a href=\"https://www.cdc.gov/about/cdc/index.html\" rel=\"noreferrer noopener\" target=\"_blank\">has not translated into measurable improved health for minority populations, and in many cases has undermined core American values</a>.” </p>\n<p>Set aside the Orwellian redefinition of “American values” as something incompatible with helping sick people. The practical effect of this ideology is to abandon the populations most vulnerable to infectious disease — which means abandoning the early-warning systems that protect everyone else. </p>\n<p>Diseases that circulate unchecked in marginalized communities eventually find their way into the general population. We learned this lesson with AIDS. We learned it again with COVID-19. Apparently, we need to learn it once more. </p>\n<p>There is also something deeply cruel about this approach to governance. Last month, Health and Human Services briefly <a href=\"https://www.statnews.com/2026/01/24/public-health-infrastructure-grants-cdc-paused-states/\" rel=\"noreferrer noopener\" target=\"_blank\">paused $5 billion in public health infrastructure grants</a> to ensure they were “aligned” with administration goals, only to reverse course within 24 hours after the ensuing uproar. Now comes $600 million in permanent cuts, targeted with surgical precision at states the president lost. This isn’t fiscal discipline: It’s a tantrum with a budget pen. </p>\n<p>Public health is, by definition, a collective enterprise. It works only when the entire system works — when every state has the resources to detect, track and contain threats before they spiral beyond control. Defunding four states doesn’t strengthen the remaining 46. It weakens them all. </p>\n<p>If this administration truly cared about American health and economic strength, it would invest more in public health infrastructure, not less — recognizing that disease surveillance in California protects families in Alabama, and HIV prevention in Illinois saves health care dollars in Mississippi.</p>\n<p>Instead, we get cruelty masquerading as policy. And when the next outbreak tears across state lines — because it will — the cost will be measured not in partisan points scored, but in American lives lost.</p>\n<p><em>Michelle A. Williams is a professor of epidemiology and population health at Stanford University School of Medicine and former dean of the Harvard T.H. Chan School of Public Health. Her book, “The Cure for Everything: The Epic Struggle for Public Health and a Radical Vision for Human Thriving,” was published by One World on Feb. 3, 2026.</em></p>",
            "kind": 1,
            "link": "https://thehill.com/opinion/healthcare/5754891-trump-cuts-public-health/",
            "pub_date": "2026-02-26 21:40:44",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5756103,
            "title": "Trump admin weighs requiring banks to collect citizenship info: Reports",
            "description": "<p>(<a href=\"https://www.newsnationnow.com/business/your-money/trump-banks-citizenship-info/\">NewsNation</a>) — The Trump administration is weighing a move that could require banks to collect <a data-id=\"https://thehill.com/regulation/court-battles/5716442-judge-blocks-trump-order-proof-of-citizenship/\" data-type=\"link\" href=\"https://thehill.com/regulation/court-battles/5716442-judge-blocks-trump-order-proof-of-citizenship/\">citizenship information</a> from customers, according to multiple reports.</p>\n<p>The potential action, reported by the <a data-id=\"https://www.wsj.com/politics/policy/trump-administration-considers-action-requiring-banks-to-collect-citizenship-info-8e26f6d2?st=6aADSk&amp;reflink=article_copyURL_share\" data-type=\"link\" href=\"https://www.wsj.com/politics/policy/trump-administration-considers-action-requiring-banks-to-collect-citizenship-info-8e26f6d2?st=6aADSk&amp;reflink=article_copyURL_share\" rel=\"noreferrer noopener\" target=\"_blank\">Wall Street Journal</a> and <a data-id=\"https://www.semafor.com/article/02/24/2026/trump-administration-weighs-citizenship-requirement-for-bank-account-holders\" data-type=\"link\" href=\"https://www.semafor.com/article/02/24/2026/trump-administration-weighs-citizenship-requirement-for-bank-account-holders\" rel=\"noreferrer noopener\" target=\"_blank\">Semafor</a>, could come as an executive order and may apply to both new and existing bank customers.</p>\n<p>While nothing has been finalized, such a decision would mark an escalation in the president’s <a data-id=\"https://www.newsnationnow.com/politics/ap-politics/ap-trumps-return-to-office-has-seen-sweeping-changes-to-immigration-enforcement/\" data-type=\"link\" href=\"https://thehill.com/homenews/administration/5693537-trump-immigration-crackdown-year-one/\" rel=\"noreferrer noopener\" target=\"_blank\">crackdown on illegal immigration</a> and could ultimately have banks requesting additional documentation, such as passports, from customers.</p>\n<p><a data-id=\"https://thehill.com/policy/transportation/5628287-flying-without-real-id-may-cost-you-45-under-new-tsa-program/\" data-type=\"link\" href=\"https://thehill.com/policy/transportation/5628287-flying-without-real-id-may-cost-you-45-under-new-tsa-program/\">REAL IDs</a> — which do not prove citizenship — would not be considered eligible, Semafor reported, citing people familiar with the talks.</p>\n<p>“Any reporting about potential policymaking that has not been officially announced by the White House is baseless speculation,” White House spokesman Kush Desai said in a statement to NewsNation.</p>\n<p>As it stands now, U.S. banks are not required to verify a customer’s citizenship status specifically, and there is no ban on opening accounts for noncitizens, the Journal noted.</p>\n<p>Banks do collect basic information — including a customer’s name, date of birth, address and identification number — under “<a data-id=\"https://www.helpwithmybank.gov/help-topics/bank-accounts/required-identification/id-types.html\" data-type=\"link\" href=\"https://www.helpwithmybank.gov/help-topics/bank-accounts/required-identification/id-types.html\" rel=\"noreferrer noopener\" target=\"_blank\">know your customer</a>” regulations meant to guard against illegal money laundering and terrorist financing. </p>\n<p>A move to require citizenship information would likely face pushback from the banking industry and could be complicated to implement, with one financial services lobbyist telling Semafor the idea is a “complete nightmare” logistically.</p>\n<p>The requirement could also pose challenges for U.S. citizens who may not have proof of citizenship readily available. Only about <a data-id=\"https://2021-2025.state.gov/return-to-pre-pandemic-passport-processing-times/\" data-type=\"link\" href=\"https://2021-2025.state.gov/return-to-pre-pandemic-passport-processing-times/\" rel=\"noreferrer noopener\" target=\"_blank\">half of Americans</a> have a valid passport, according to the State Department. </p>\n<p>Sen. Tom Cotton (R-Ark.) said he strongly supports President Trump taking action to “prevent illegal migrants from accessing our banking system” in a <a data-id=\"https://x.com/SenTomCotton/status/2026389585480044550/photo/1\" data-type=\"link\" href=\"https://x.com/SenTomCotton/status/2026389585480044550/photo/1\" rel=\"noreferrer noopener\" target=\"_blank\">post on social platform X</a> Tuesday.</p>\n<p>Cotton added that he plans to introduce legislation on the issue “shortly” and shared an October letter in which he asked Treasury Secretary Scott Bessent to investigate.</p>\n<p>One avenue the Trump administration is considering is having the Treasury Department’s Financial Crimes Enforcement Network collect the information, people familiar with the talks told the Journal.</p>\n<p>Discussions about the potential executive order have alarmed banks, which have questioned the legal basis for the proposal, according to the outlet.</p>",
            "kind": 1,
            "link": "https://thehill.com/business/5756103-donald-trump-proof-of-citizenship-banks/",
            "pub_date": "2026-02-26 21:30:53",
            "source": "thehill",
            "language": "en"
        }
    ]
}