{
    "data": [
        {
            "id": 5759048,
            "title": "Texas to correct errors in Bible-infused curriculum",
            "description": "<p>The Texas State Board of Education voted to approve changes to the <a href=\"https://thehill.com/homenews/education/4998583-texas-bible-lessons-public-schools/\">Bible-infused curriculum</a> some schools are offering in the state, fixing errors caught by teachers in its first year in circulation.  </p>\n<p>The curriculum, which is optional for schools although those who adopt it receive extra state funding, was found to have over a thousand errors, including grammatical mistakes copyright and imaging problems and some factual errors.  </p>\n<p>The board approved the change to the “Bluebonnet Learning” curriculum in a 9-6 vote at Wednesday’s meeting.  </p>\n<p>While some board members said there were over 4,000 changes needed to the curriculum, according to the Associated Press, the Texas Education Agency (TEA) argued that is an inflated number. </p>\n<p>In a statement to The Hill, TEA said there were around 1,900 changes needed to the curriculum, alleging the issues were largely along grammatical and copyright problems rather than factual errors.  </p>\n<p>The TEA said the process of submitting changes to the board causes some errors to get counted multiple times.  </p>\n<p>“For example, if a lesson text is missing a comma in the teacher guide, student reader or other piece of collateral – even though it’s only one change (adding the comma) – the IMRA process requires that each change be submitted individually, meaning that one addition of a comma would be tracked as three separate changes,” the agency said in a statement.  </p>\n<p>“My concern is that we have failed students this school year who have been utilizing this product,” said Democratic board member Tiffany Clark, the Associated Press reported, adding even a typo in a math problem could cause issues in a classroom.  </p>\n<p>It is unknown how many schools adopted the curriculum, but the AP reported around 300 districts said they would use it back in August.  </p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/education/5759048-texas-bible-curriculum-errors/",
            "pub_date": "2026-02-28 02:11:03",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5756951,
            "title": "The Trump administration is disappearing climate change data",
            "description": "<p>On Feb. 12, the Trump administration <a href=\"https://nam11.safelinks.protection.outlook.com/?url=https%3A%2F%2Fwww.epa.gov%2Fregulations-emissions-vehicles-and-engines%2Ffinal-rule-rescission-greenhouse-gas-endangerment&amp;data=05%7C02%7CDTodd%40thehill.com%7C9576598c3d604d53690d08de76130317%7C9e5488e2e83844f6886cc7608242767e%7C1%7C0%7C639078021199900592%7CUnknown%7CTWFpbGZsb3d8eyJFbXB0eU1hcGkiOnRydWUsIlYiOiIwLjAuMDAwMCIsIlAiOiJXaW4zMiIsIkFOIjoiTWFpbCIsIldUIjoyfQ%3D%3D%7C0%7C%7C%7C&amp;sdata=VjL%2BAekNbvjerRo%2FPaD%2B1yNbH8jF6QChQNNOGqzboaw%3D&amp;reserved=0\" rel=\"noreferrer noopener\" target=\"_blank\">repealed the landmark 2009 Greenhouse Gas Endangerment Finding</a>, flouting decades of scientific consensus. This rule doesn’t just gut the EPA’s ability to regulate greenhouse gas emissions, it also blocks our ability to know anything about cars’ and companies’ emissions, <a href=\"https://nam11.safelinks.protection.outlook.com/?url=https%3A%2F%2Fwww.epa.gov%2Fregulations-emissions-vehicles-and-engines%2Ffinal-rule-rescission-greenhouse-gas-endangerment&amp;data=05%7C02%7CDTodd%40thehill.com%7C9576598c3d604d53690d08de76130317%7C9e5488e2e83844f6886cc7608242767e%7C1%7C0%7C639078021199936699%7CUnknown%7CTWFpbGZsb3d8eyJFbXB0eU1hcGkiOnRydWUsIlYiOiIwLjAuMDAwMCIsIlAiOiJXaW4zMiIsIkFOIjoiTWFpbCIsIldUIjoyfQ%3D%3D%7C0%7C%7C%7C&amp;sdata=6dXUvh9thcHlHNHHGVDZHFdB6vm9oBbhih25fvaRdVE%3D&amp;reserved=0\" rel=\"noreferrer noopener\" target=\"_blank\">ensuring automakers</a> “no longer have any future obligations for the measurement, control, and reporting of GHG emissions for any highway engine and vehicle.”  </p>\n<p>The Trump administration’s efforts to block data are not isolated. Between the repeal of the Endangerment Finding and the proposed repeal of the <a href=\"https://nam11.safelinks.protection.outlook.com/?url=https%3A%2F%2Fwww.epa.gov%2Fghgreporting&amp;data=05%7C02%7CDTodd%40thehill.com%7C9576598c3d604d53690d08de76130317%7C9e5488e2e83844f6886cc7608242767e%7C1%7C0%7C639078021199963680%7CUnknown%7CTWFpbGZsb3d8eyJFbXB0eU1hcGkiOnRydWUsIlYiOiIwLjAuMDAwMCIsIlAiOiJXaW4zMiIsIkFOIjoiTWFpbCIsIldUIjoyfQ%3D%3D%7C0%7C%7C%7C&amp;sdata=ky152fmM%2FZoqvcnUkgtYaiLHiHTJyezafS1p1JXVmRw%3D&amp;reserved=0\" rel=\"noreferrer noopener\" target=\"_blank\">Greenhouse Gas Reporting Program</a>, expected to be finalized any day, the Trump administration has entirely turned out the lights on greenhouse gas emissions data. That may sound like the administration doesn’t care about data, but its extensive efforts to hide and halt federal data actually show how critically important they are. </p>\n<p>The <a href=\"https://www.epa.gov/ghgreporting\" rel=\"noreferrer noopener\" target=\"_blank\">Greenhouse Gas Reporting Program</a> was just that — a program to gather and publicly report data about greenhouse gas emissions in the United States. But the EPA is reconsidering a rule that calls for an end to gathering greenhouse gas emissions data for <a href=\"https://www.epa.gov/system/files/documents/2025-09/reconsideration-of-ghgrp-proposal-fact-sheet.pdf\" rel=\"noreferrer noopener\" target=\"_blank\">46 of 47 industries</a>, and suspends data collection for the 47th industry until 2034. </p>\n<p>The Greenhouse Gas Reporting Program didn’t require facilities to lower their emissions. It didn’t require expensive emissions reductions technologies. All the program did was produce data, and <a href=\"https://envirodatagov.org/wp-content/uploads/2025/11/EDGI-GHGRP-Public-Comment.pdf\" rel=\"noreferrer noopener\" target=\"_blank\">it cost next to nothing</a>. But the program was axed because, as it turns out, data is powerful. </p>\n<p>It’s no wonder that the EPA decided to do away with greenhouse gas emissions data for the public and policymakers alike. The Trump administration wants to “<a href=\"https://www.donaldjtrump.com/agenda47/agenda47-america-must-have-the-1-lowest-cost-energy-and-electricity-on-earth\" rel=\"noreferrer noopener\" target=\"_blank\">DRILL, BABY, DRILL</a>” while the world <a href=\"https://www.science.org/doi/10.1126/science.abn7950\" rel=\"noreferrer noopener\" target=\"_blank\">teeters on the edge of multiple climate tipping points</a> and other world leaders widely <a href=\"https://unfccc.int/process-and-meetings/the-paris-agreement\" rel=\"noreferrer noopener\" target=\"_blank\">recognize the need to curb carbon emissions</a> immediately. So, data about our role in climate change must go. </p>\n<p>It is hard to say climate change is <a href=\"https://envirodatagov.org/epa-scrubs-information-about-climate-change-indicators-and-impacts/\" rel=\"noreferrer noopener\" target=\"_blank\">caused solely by natural variation</a> when the data show otherwise. It is hard to say <a href=\"https://www.federalregister.gov/d/2025-14572/p-40\" rel=\"noreferrer noopener\" target=\"_blank\">there’s nothing we can do about it</a> when the data show otherwise. It is hard to convince people of a lie when there is data that shows the truth. And the Trump administration knows this.  </p>\n<p>Our country relies on federal data to understand and address issues in our environment, health and society. Without data, we cannot assess current or anticipate future conditions. Without data, we cannot effectively identify or measure, let alone mitigate problems. </p>\n<p>For the past year, the federal government has threatened the existence, accessibility and integrity of federal data. It has pulled down critical data, like the <a href=\"https://www.epa.gov/rmp/how-access-risk-management-plan-information\" rel=\"noreferrer noopener\" target=\"_blank\">EPA’s Risk Management Plans</a> (preserved <a href=\"https://edgi-cloud.fly.dev/db/risk_management_plans/homepage\" rel=\"noreferrer noopener\" target=\"_blank\">here</a>) that provided communities with information about the hazardous chemicals stored and used in nearby facilities. It has discontinued data, like the <a href=\"https://www.ncei.noaa.gov/access/billions/\" rel=\"noreferrer noopener\" target=\"_blank\">National Oceanic and Atmospheric Administration’s Billion Dollar Disasters</a>, which helped show the economic impact of climate disasters. </p>\n<p>The federal government has also removed ways of accessing and using data, like <a href=\"https://blog.ucs.org/stacy-woods/the-trump-administrations-deletion-of-environmental-justice-data-does-real-harm/\" rel=\"noreferrer noopener\" target=\"_blank\">taking down federal tools to quantify or visualize disproportionate environmental impacts</a> on certain groups of people, with a <a href=\"https://www.atsdr.cdc.gov/place-health/php/eji/index.html\" rel=\"noreferrer noopener\" target=\"_blank\">court ordering one of them to be restored</a>. The federal government has even <a href=\"https://journalistsresource.org/home/federal-health-data-modification-lancet/\" rel=\"noreferrer noopener\" target=\"_blank\">manipulated data</a> and <a href=\"https://climate.law.columbia.edu/content/department-energy-report-includes-false-claims-about-climate-change\" rel=\"noreferrer noopener\" target=\"_blank\">misrepresented scientific findings</a> in consequential reports. </p>\n<p>The Trump administration employs three methods to hide data from the public: deregulation such as gutting the Greenhouse Gas Report Program, defunding in the manner of <a href=\"https://www.npr.org/2025/05/02/nx-s1-5385272/epa-environmental-protection-agency-cuts-trump-zeldin\" rel=\"noreferrer noopener\" target=\"_blank\">EPA’s drastic staff cuts</a>, and outright deletion, like in the case of the <a href=\"https://screening-tools.com/fema-future-risk\" rel=\"noreferrer noopener\" target=\"_blank\">Federal Emergency Management Agency’s Future Risk Index</a>. </p>\n<p>We in civil society need to push back and intervene in each of these mechanisms. We need to push back on deregulation through effective public comments, which give litigators a strong official record to challenge agencies’ deregulatory moves. We need to advocate Congress to fund our agencies and their critical programs and assert public pressure on agencies to lift hiring freezes and rebuild staff. And we need to protect our existing data by preserving it in public repositories with civil society stewards. And that’s just the work we need to do to defend what we’ve had in the past, let alone the imperative of building a more robust and resilient data ecosystem for the future. </p>\n<p>Protecting data is about more than data. It’s about protecting the public’s right to data, our right to information, our right to knowledge. Protecting data is about preserving a fundamental pillar of democracy. </p>\n<p><em>Gretchen Gehrke, Ph.D., is co-founder of the </em><em><u><a href=\"https://envirodatagov.org/\" rel=\"noreferrer noopener\" target=\"_blank\">Environmental Data and Governance Initiative</a></u></em><em> and of the </em><em><u><a href=\"https://screening-tools.com/\" rel=\"noreferrer noopener\" target=\"_blank\">Public Environmental Data Partners</a></u></em><em> coalition.</em></p>",
            "kind": 1,
            "link": "https://thehill.com/opinion/energy-environment/5756951-federal-data-threatened-trump-era/",
            "pub_date": "2026-02-28 02:11:02",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5759007,
            "title": "House Democrat: 'Good for Anthropic' in rejecting Pentagon demands",
            "description": "<p>Rep. Ro Khanna (D-Calif.) praised the artificial intelligence company Anthropic for rejecting the Pentagon’s demands in how its AI technology is used by Friday evening. </p>\n<p>The company and the U.S. government have been in <a href=\"https://thehill.com/policy/technology/5757667-pentagon-threatens-anthropic-dpa/\">battle</a> for weeks over Anthropic’s AI policy, which blocks its AI model Claude from being used to conduct mass surveillance or develop lethal autonomous weapons.</p>\n<p>The company <a href=\"https://thehill.com/policy/technology/5758006-anthropic-pentagon-ai-talks-stall/\">said in a statement </a>Thursday that it “cannot in good conscience accede to their request.” </p>\n<p>“Good for Anthropic,” Khanna, who represents the nation’s technology capital, Silicon Valley, said in a Friday interview with Fox Business Network host Maria Bartiromo. “I don’t want technology used by a federal government to have mass surveillance on American citizens. That’s common sense.</p>\n<p>“I mean, think about if you had a Democratic president, would you want them to have tools of AI to figure out whether you have a gun, to figure out what church you’re going to?” he told Bartiromo. “It is scary. And I hope we can come together and say, no, we don’t want mass surveillance.”</p>\n<p>Khanna’s comments come as Anthropic <a href=\"https://thehill.com/policy/technology/5757667-pentagon-threatens-anthropic-dpa/\">faces a Friday 5:01 p.m. deadline</a> to agree to the Pentagon’s terms. It threatened Tuesday that it would implement the Defense Production Act (DPA), which gives the president broad authority to control domestic industries for national defense purposes. The threat drew <a href=\"https://thehill.com/policy/technology/5757667-pentagon-threatens-anthropic-dpa/\">criticism from experts</a>.</p>\n<p>“It’s the wrong purpose of the tool,” Mark Dalton, senior policy director for technology and innovation at the R Street Institute, told The Hill on Thursday. “The DPA exists for a capacity reason, like it’s an industrial capacity policy, and to use it as leverage is, I think, irresponsible.”</p>\n<p>If Anthropic doesn’t comply by Friday, it also faces losing a $200 million contract from the Pentagon and being labeled a “supply chain risk.” </p>\n<p>Chief Pentagon spokesperson Sean Parnell said Thursday the department has “no interest in using AI to conduct mass surveillance of Americans (which is illegal) nor do we want to use AI to develop autonomous weapons that operate without human involvement.”</p>\n<p>“This is a simple, common-sense request that will prevent Anthropic from jeopardizing critical military operations and potentially putting our warfighters at risk,” he wrote in a post on X. “We will not let ANY company dictate the terms regarding how we make operational decisions.”</p>",
            "kind": 1,
            "link": "https://thehill.com/policy/technology/5759007-ro-khanna-anthropic-pentagon-ai/",
            "pub_date": "2026-02-28 02:01:44",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5759016,
            "title": "Trump eyeing mail-in ballot, voting machine ban ahead of midterms?",
            "description": "<p>Here’s the headline: Pro-Trump activists, who say they’re coordinating with the White House, are <a href=\"https://www.washingtonpost.com/politics/2026/02/26/trump-elections-executive-order-activists/\" rel=\"noreferrer noopener\" target=\"_blank\">circulating a draft executive order</a> urging President Trump to declare a national emergency over the 2020 election, based on the claim that China interfered, and use that emergency to take sweeping control over how Americans vote in the midterms.  </p>\n<p>Let’s slow that down.  </p>\n<p>The draft would empower a president to ban mail-in ballots and voting machines, arguing they’re vulnerable to foreign interference. But U.S. intelligence reviews in 2021 concluded that while China considered influence efforts, it did not carry them out<a href=\"https://sos.ga.gov/news/us-intelligence-officials-find-no-foreign-interference-election-systems\" rel=\"noreferrer noopener\" target=\"_blank\">. There is no credible evidence that foreign interference altered the 2020 outcome.</a> At all.  </p>\n<p>And here’s the constitutional reality: The Elections Clause explicitly gives states — not the president — authority over how elections are run. <a href=\"https://constitution.congress.gov/browse/article-1/section-4/\" rel=\"noreferrer noopener\" target=\"_blank\">Article I, Section 4</a> is clear. States set the rules. Congress can step in. The president has no role.  </p>\n<p>As Michael McNulty, policy director for the pro-democracy group Issue One, <a href=\"https://issueone.org/press/reported-white-house-move-to-take-over-elections-would-violate-the-constitution/\" rel=\"noreferrer noopener\" target=\"_blank\">put it</a>: “The Constitution is absolutely clear. The president does not have legal authority to unilaterally change election rules. Any attempt by the White House to do so would contradict the Constitution and would almost certainly be struck down by the courts.”  </p>\n<p>But this isn’t happening in a vacuum.  </p>\n<p>For months, there’s been a broader drive to cast doubt on the legitimacy of the 2026 midterms. In his State of the Union, the president <a href=\"https://www.pbs.org/newshour/politics/8-takeaways-from-trumps-2026-state-of-the-union-address\" rel=\"noreferrer noopener\" target=\"_blank\">falsely claimed</a> the “only way” Democrats get elected “is to cheat.” He’s pushing the SAVE Act in Congress and has openly floated acting alone if lawmakers don’t comply.  </p>\n<p>At the same time, we’ve seen federal law enforcement step into election spaces in ways that raise alarms, including an <a href=\"https://www.cbsnews.com/atlanta/news/judge-order-fulton-county-federal-government-mediation-seized-2020-election-records/\" rel=\"noreferrer noopener\" target=\"_blank\">FBI raid on election offices in Fulton County, Ga.</a> Intelligence chief Tulsi Gabbard was present, despite her office having no formal role in election administration. The message to local officials feels unmistakable: If we don’t like the outcome, we may come looking.  </p>\n<p>And here’s what often gets left out of the conversation about “massive fraud.” The Heritage Foundation — you know, the right-wing think tank<a href=\"https://static.heritage.org/project2025/2025_MandateForLeadership_FULL.pdf\" rel=\"noreferrer noopener\" target=\"_blank\"> famous for pulling together the controversial Project 2025</a>, tracked election fraud cases over 25 years and <a href=\"https://www.brookings.edu/articles/how-widespread-is-election-fraud-in-the-united-states-not-very/\" rel=\"noreferrer noopener\" target=\"_blank\">found a rate of .0000845 percent</a>, with no election outcome altered by ballot fraud. Both parties have lawyers inside counting rooms. To believe widespread fraud exists, you’d have to believe armies of Republican and Democratic attorneys are either incompetent or complicit. That’s not reality.  </p>\n<p>A recent Washington Post-ABC News pol<a href=\"https://wedefendthevote.org/new-poll-voters-strongly-oppose-trumps-plan-to-nationalize-elections/\" rel=\"noreferrer noopener\" target=\"_blank\">l shows a majority of Americans</a>, including independents, oppose a federal takeover of election administration.  </p>\n<p>This moment is bigger than one executive order. It’s about whether we normalize the idea that a president can declare an emergency whenever he doesn’t trust the outcome of an election. That’s not election security. That’s executive overreach.  </p>\n<p>Facts matter. The Constitution matters. And confidence in our elections depends on leaders respecting both, even when the results don’t go their way. </p>\n<p><em>Lindsey Granger is a NewsNation contributor and co-host of The Hill’s commentary show “Rising.” This column is an edited transcription of her on-air commentary.  </em> </p>",
            "kind": 1,
            "link": "https://thehill.com/opinion/lindseys-lens/5759016-executive-overreach-election-rules/",
            "pub_date": "2026-02-28 01:51:23",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5758358,
            "title": "The 22nd Amendment at age 75: is it seriously under challenge?",
            "description": "<p><a href=\"https://www.archives.gov/exhibits/running-for-office/larger-image.php?image=44.1&amp;TB_iframe=true#:~:text=The%2022nd%20Amendment%20to%20the,as%20President%20after%20two%20terms.\">Feb. 27</a> marks the 75th anniversary of the <a href=\"https://constitutioncenter.org/the-constitution/amendments/amendment-xxii\">22nd Amendment to the Constitution</a>, when Minnesota’s ratification gave the three-quarters of the 48 states required by <a href=\"https://www.archives.gov/federal-register/constitution/article-v.html\">Article V</a>. Now it is back in the public consciousness as President Trump’s supporters take aim at its limitations.</p>\n<p>The intention is straightforward: “<a href=\"https://constitution.congress.gov/constitution/amendment-22/\">No person shall be elected to the office of the President more than twice</a>.” Furthermore, “no person who has held the office of President, or acted as President, for more than two years of a term to which some other person was elected President shall be elected to the office of the President more than once.”</p>\n<p>This wasn’t theoretical. Harry Truman had been elected as Franklin Roosevelt’s vice president in 1944, but had only served 82 days when Roosevelt died in April 1945. That gave him virtually all of Roosevelt’s <a href=\"https://www.history.com/articles/fdr-four-term-president-22-amendment\">fourth four-year term</a>.</p>\n<p>Presidential tenure became a campaign issue in the 1946 midterm elections: Republicans gained 55 seats in the House and 12 in the Senate to take control of Congress for the first time since 1932.</p>\n<p>Everything led back to Roosevelt. In 1940, he was approaching the end of his second term. George Washington had chosen to step down after eight years as president, and his model had become a moral and constitutional, if unofficial, exemplar.</p>\n<p>Ulysses S. Grant came close to winning the Republican nomination for a third time in 1880; incredibly, despite a paralyzing stroke in 1919, Woodrow Wilson considered seeking a third term in 1920 and even entertained the idea of a comeback in 1924. But no-one had got as far as the ballot.</p>\n<p>FDR’s third term was recognized as exceptional: the storm clouds of war were gathering and the Democrats played safe, Roosevelt winning 38 states.</p>\n<p>1944 was different. Roosevelt was only <a href=\"https://www.history.com/articles/franklin-d-roosevelt-health-final-term\">62 but he was suffering from congestive heart failure and hypertension</a>. The president was dying, so nominating a vice presidential candidate was almost certainly choosing the 33rd president of the U.S.</p>\n<p>The incumbent vice president, Henry Wallace, was a cerebral agriculturalist who opposed segregation. He was unacceptably liberal for Democrat bosses, so he was replaced at the party’s convention with Missouri Sen. Harry S. Truman, whom Roosevelt barely knew.</p>\n<p>The pair <a href=\"https://www.presidency.ucsb.edu/statistics/elections/1944\">won in November 1944</a>, but Roosevelt was already fading by then. He and Truman <a href=\"https://www.whitehousehistory.org/the-life-and-presidency-of-harry-s-truman\">met alone only twice as President and Vice President</a> before Roosevelt had a massive stroke and died on April 12, 1945. Four months earlier, Truman had been a middleweight senator of only 10 years’ standing. Now he was president.</p>\n<p>A <a href=\"https://s3.amazonaws.com/NARAprodstorage/opastorage/live/67/4118/1411867/content/arcmedia/congress/08276.pdf\">joint resolution</a> stipulating presidential term limits was introduced on the first day of the 80th Congress in 1947. Agreed on March 21 by Republicans and enough Democrats to matter, the text was sent to the states for ratification.</p>\n<p>It would not be a swift process. Although Maine and Michigan ratified the amendment on March 31, 1947, it would take three years and 343 days before the Minnesota Legislature’s decision passed the Article V threshold —  then a record length of time.</p>\n<p>The 22nd Amendment has rarely been a source of deep controversy. President Ronald Reagan retained approval ratings generally above 50 percent right to the end of his presidency, and <a href=\"https://www.washingtonpost.com/archive/politics/1986/06/16/short-sighted-amendment/236a7677-5e32-4013-b2a7-1909e55a1db9/\">came to think</a> the amendment was “a mistake”; but he was 77 by the end of his second term and his health was declining.</p>\n<p>President Bill Clinton was more grudging, <a href=\"https://www.rollingstone.com/politics/politics-news/bill-clinton-the-rolling-stone-interview-2-40256/\">telling Rolling Stone</a> in 2000, “Oh, I probably would have run again.” Asked if he thought he would have won, he replied “Yes I do. But it’s hard to say, because it’s entirely academic.”</p>\n<p>Trump has <a href=\"https://thehill.com/homenews/house/4988568-trump-third-term-house-republicans/\">publicly toyed</a> with the idea that his tenure might not have to end in 2029. He markets <a href=\"https://www.trumpstore.com/trump-2028-hat\">“Trump 2028” baseball caps</a>, and constitutional and criminal lawyer Alan Dershowitz has <a href=\"https://www.wsj.com/politics/elections/trump-told-by-alan-dershowitz-constitutionality-of-third-term-is-unclear-33133eb8?mod=hp_featst_pos3\">argued</a> that “it’s not clear if a president can become a third term president and it’s not clear if it’s permissible.” Trump himself clearly relishes the horror and outrage the suggestion inspires in his opponents.</p>\n<p>How could its provisions be overcome? Some point to its prohibition against being “elected to the office of the President more than twice,” arguing that Trump could succeed to the presidency by becoming the running-mate of a puppet candidate who would resign after being inaugurated. More improbable still, Trump might somehow become Speaker of the House of Representatives — second in the order of succession — and thence climb back to the White House by succeeding or somehow being deemed “acting as president.”</p>\n<p>It would take a vivid imagination to suppose the authors of the 22nd Amendment meant anything other than a simple two-term limit. There is no reason to think the word “elected” was chosen as a loophole for a future would-be autocrat to exploit, as both originalists and textualists would surely have to agree. Only a strict constructionist might find a coherent path through.</p>\n<p>It is impossible to predict what Trump will do when the primaries for 2028 draw near, for the simple reason that, as I <a href=\"https://thehill.com/opinion/finance/5260979-looking-for-logic-in-trumps-tariffs-is-a-fools-errand/\">have said before</a>, he himself does not know what he will do next. An attempt to defy the 22nd Amendment would ultimately be adjudicated by the Supreme Court. Six of its members, including Chief Justice John Roberts, were nominated by Republican presidents, three by Trump himself.</p>\n<p>The court’s recent decisions in cases like <a href=\"https://www.supremecourt.gov/opinions/23pdf/603us1r57_6k47.pdf\">Trump v. United States</a> and <a href=\"https://www.supremecourt.gov/opinions/24pdf/25a169_5h25.pdf\">Noem v. Vasquez Perdomo</a> have indicated sympathy with the administration’s maximalist interpretation of executive power, although its recent ruling against tariffs in <a href=\"https://www.supremecourt.gov/opinions/25pdf/24-1287_4gcj.pdf\">Learning Resources, Inc. v. Trump</a> ameliorated that. But to contort the prima facie meaning of an amendment so overtly? </p>\n<p>The 22nd Amendment has stood strong and firm for 75 years — but for how much longer?</p>\n<p><em>Eliot Wilson is a freelance writer on politics and international affairs and the co-founder of Pivot Point Group. He was senior official in the U.K. House of Commons from 2005 to 2016, including serving as a clerk of the Defence Committee and secretary of the U.K. delegation to the NATO Parliamentary Assembly.</em></p>",
            "kind": 1,
            "link": "https://thehill.com/opinion/white-house/5758358-75th-anniversary-22nd-amendment/",
            "pub_date": "2026-02-28 01:41:04",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5758945,
            "title": "Atlantic reporter says Crockett campaign ejected her from event",
            "description": "<p>Atlantic journalist Elaine Godfrey reported in a piece published on Friday that she had been ejected from a campaign event for Rep. Jasmine Crockett (D-Texas), one of the two Democrats vying for Texas Senate this year – a claim Crockett’s campaign has denied.  </p>\n<p><a href=\"https://www.theatlantic.com/politics/2026/02/texas-senate-democratic-primary-talarico-crockett/686154/?gift=zYCTBrO_7y7KHmiTPdBdgy4WhHAIcXijFBHeV034_ys\">In the piece</a>, Godfrey said a woman with a “badge” had asked her to leave the Crockett campaign event in Lubbock, Texas. </p>\n<p>“They just said, ‘Elaine from Atlantic, white girl with a hat and notepad. She’s interviewing people in the crowd. She’s a top-notch hater and will spin. She needs to leave,’” the woman told Godfrey, according to the Atlantic report.</p>\n<p>Godfrey said she agreed to leave, and was then escorted by guards to a highway near the event. </p>\n<p>The congresswoman in an interview with CBS News denied that her campaign had ejected the reporter. </p>\n<p>“I’ll just say that it’s silly season,” Crockett <a href=\"https://x.com/shawnamizelle/status/2026850494849622342\">told CBS News</a> on Wednesday. She did not mention Godfrey by the name in the interview.  </p>\n<p>“I will say that, you know, there is a specific journalist who is — she has a history of being less than truthful, and frankly, there’s no evidence of anything that she’s talking about. I’ve not seen anything,” Crockett said. </p>\n<p>Crockett also claimed that Godfrey had been sued for defamation and lost. The Atlantic reputed that account on X. </p>\n<p>“We are not sure who this video is describing: Elaine Godfrey has never been sued for defamation, and she was in fact removed from a campaign rally in Lubbock this week,” Anna Bross, senior vice president of communications at The Atlantic, <a href=\"https://x.com/AnnaCBross/status/2027150296405737976\">wrote on X.</a> </p>\n<p>A Crockett campaign spokesperson did not immediately respond to a request for comment from The Hill.   </p>\n<p>In her story in the Atlantic, Godfrey wrote that a Crockett campaign spokesperson did not respond to a request for comment about the incident. </p>\n<p>The series of events sparked criticism of Crockett from some Democrats. </p>\n<p>“Kicking out a reporter is bad. Blatantly lying about it is even worse,” “Pod Save America” podcast co-host Jon Favreau, who served as a speechwriter to former President Obama, <a href=\"https://x.com/jonfavs/status/2027389423692939762\">wrote on X.</a>  </p>\n<p>Democratic strategist Max Burns <a href=\"https://x.com/themaxburns/status/2027410414531653707\">suggested on X</a> that “the more the press consciously frames Crockett as violating the ‘rules’ of the game, the more her supporters rally,” drawing parallels to “Trump’s MAGA core strategy.” </p>\n<p>Godfrey’s piece came after Semafor <a href=\"https://www.semafor.com/article/02/24/2026/texas-senate-candidate-jasmine-crockett-escalates-her-war-on-the-press\">reported</a> on the incident<a href=\"https://www.semafor.com/article/02/24/2026/texas-senate-candidate-jasmine-crockett-escalates-her-war-on-the-press\"> </a>this week. The outlet also said that Crockett’s campaign had called the Capitol Police on a CNN reporter for possible trespassing when he attempted to visit a campaign office location. CNN and Crockett’s team declined to comment on the matter for Semafor’s piece. </p>\n<p>“The Atlantic confirms our story in more detail. Crockett and her spokesperson pretty brazenly lied here. A bizarre move knowing, as I told them, that the Atlantic was going to publish their piece pretty soon anyway,” Semafor’s Max Tani <a href=\"https://x.com/maxwelltani/status/2027169064389337257\">wrote on X.</a></p>\n<p>The controversy comes as Crockett campaigns in the closely watched Democratic primary for Senate in Texas, as her party grows bullish about its chances of flipping incumbent Sen. Jon Cornyn’s (R) seat in the red stronghold. </p>\n<p>One recent survey from the University of Texas/Texas Politics Project found Crockett up by double-digits over her rival, Democrat James Talarico, in a race that’s been seen as a clash between competing approaches for the party in a state that went to Trump by double digits in 2024. </p>\n<p></p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/campaign/5758945-atlantic-journalist-removed-campaign-rally/",
            "pub_date": "2026-02-28 01:16:18",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5758942,
            "title": "'I did nothing wrong': Bill Clinton denies knowledge of Epstein abuse in deposition",
            "description": "<p>Former President Clinton said he “did nothing wrong” and had “no idea of the crimes” Jeffrey Epstein was committing as he kicked off a deposition with the House Oversight and Government Reform Committee on Friday.</p>\n<p>“Though my brief acquaintance with Epstein ended years before his crimes came to light, and though I never witnessed during our interactions any indication of what was truly going on, I am here to offer what little I know so that it might prevent anything like this from ever happening again,” Clinton said in a <a href=\"https://x.com/BillClinton/status/2027424128559452573/photo/1\">prepared opening statement</a> posted on social media.</p>\n<p>He went on to say that he had “no idea of the crimes Epstein was committing,” and “saw nothing that ever gave me pause.”</p>\n<p>“I saw nothing, and I did nothing wrong,” Clinton said.</p>\n<p>Clinton is sitting for a deposition with the committee in Chappaqua, N.Y., after he and his wife, former Secretary of State Hillary Clinton, reversed course and agreed to interviews as they faced being held in contempt of Congress for defying a congressional subpoena.</p>\n<p>Hillary Clinton on Thursday sat for an hours-long deposition with the committee, in which she told the panel that <a href=\"https://thehill.com/homenews/house/5756577-clintons-questioned-epstein-links/\">she did not recall ever meeting</a> Epstein, only knew Ghislaine Maxwell as a casual acquaintance, and had no knowledge of their criminal activities. </p>\n<p>The former president bristled at his wife being called to appear.</p>\n<p>“But before we start, I have to get personal. You made Hillary come in. She had nothing to do with Jeffrey Epstein. Nothing,” Clinton said. “Whether you subpoenaed 10 people or 10,000, including her was simply not right.”</p>\n<p>Bill Clinton, however, had a documented friendship with Epstein in the 1990s through about 2003. Epstein visited the White House during the Clinton administration; Clinton flew on Epstein’s plane multiple times; and photos have emerged of Clinton and Epstein. Clinton has said that he never visited Epstein’s island.</p>\n<p>“As someone who grew up in a home with domestic abuse, not only would I not have flown on his plane if I had any inkling of what he was doing—I would have turned him in myself and led the call for justice for his crimes, not sweetheart deals,” Clinton said.</p>\n<p>“No matter how many photos you show me, I have two things at the end of the day matter more than your interpretation of those 20-year-old photos,” Clinton added. “I know what I saw, and more importantly, what I didn’t see. I know what I did, and more importantly, what I didn’t do.”</p>\n<p>Hillary Clinton told reporters on Thursday that she was confident that her husband did not know anything about Epstein’s crimes, noting the chronology of their connection. Bill Clinton’s relationship with Epstein ended “several years” before the late financier was convicted of procuring a minor for prostitution in 2008.</p>\n<p>Bill Clinton noted that too.</p>\n<p>“We are only here because he hid it from everyone so well for so long. And by the time it came to light with his 2008 guilty plea, I had long stopped associating with him,” Clinton said.</p>\n<p>House Oversight Committee Chair James Comer (R-Ky.) said that Hillary Clinton’s deposition will inform their line of questioning of the former president.</p>\n<p>“Yesterday, Ms. Clinton deferred a lot of questions to her husband today. There were at least a dozen times when she said, ‘You’ll have to ask my husband that, I can’t answer that,’” Comer said in a press conference ahead of the deposition. “So, we already had a big portfolio of questions for him, and that increased yesterday.”</p>\n<p>Democrats on the Oversight panel have warned that by compelling a former president to comply with a congressional subpoena, Republicans have set a new precedent — one that could lead to Democrats eventually forcing President Trump to testify when they are back in power. </p>\n<p>Oversight ranking member Robert Garcia (D-Calif.) and other Democrats are calling for Trump to testify to the committee about documents they allege are missing from the Department of Justice’s disclosure of the so-called Epstein Files, which include unverified allegations of sexual abuse against Trump. The DOJ said Wednesday that it is <a href=\"https://thehill.com/homenews/administration/5756249-doj-investigates-withheld-fbi-interviews/\">reviewing the files</a> that appear to be missing.</p>\n<p>“Before this, we had the Trump rule. Trump defied, as all of you know, a congressional subpoena with the January 6 Committee. He said, presidents don’t have to testify,” Rep. Ro Khanna (D-Calif.) said in a press conference before the deposition. “Now we have the Clinton rule, which is that presidents and their families have to testify when Congress issues a subpoena, and that means that Donald Trump needs to come before our committee and explain what he knew about Epstein and explain why we have not had a full release of the documents.”</p>\n<p>The Oversight panel had voted on a bipartisan basis to subpoena the Clintons and several other former government officials last year, and spent months negotiating with the Clintons over how they could provide testimony about their links to Epstein.</p>\n<p>As they attempted to avoid depositions, the Clintons argued that they had already provided the committee with all the information they had about Epstein and Maxwell, provided sworn statements that they had no knowledge of their criminal activities, and argued that the subpoenas were invalid. </p>\n<p>Later, they <a href=\"https://thehill.com/homenews/house/5718848-clintons-reject-deposition-offer/\">sought</a> to have Hillary Clinton provide a sworn statement instead of testifying, and sought to limit the former president’s deposition to a four-hour interview. </p>\n<p>In January, nine <a href=\"https://thehill.com/homenews/house/5699996-democrats-clintons-contempt-vote/\">Democrats on the panel voted</a> with Republicans to hold the former president in contempt of Congress over the refusal to sit for a deposition, while three Democrats voted to hold Hillary Clinton in contempt of Congress.</p>\n<p>Hillary Clinton on Thursday also bristled at Rep. Lauren Boebert (R-Colo.) <a href=\"https://thehill.com/homenews/house/5757287-hillary-clinton-deposition-boebert-photo/\">leaking a photo of her during the deposition</a>, in violation of agreed-upon rules, and about Republican members asking about UFOs and the Pizzagate conspiracy theory.</p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/house/5758942-bill-clinton-jeffrey-epstein-deposition/",
            "pub_date": "2026-02-28 01:16:17",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5758898,
            "title": "Altman says OpenAI agrees with Anthropic's red lines in Pentagon dispute",
            "description": "<p>OpenAI CEO Sam Altman said Friday that he agrees with Anthropic’s red lines in its increasingly contentious negotiations with the Pentagon over the terms of use for the company’s AI models.</p>\n<p>As the feud between Anthropic and the Defense Department (DOD) has reached a boiling point, the AI firm has refused to budge on lifting restrictions on two issues — mass surveillance and lethal autonomous weapons.</p>\n<p>The Pentagon has pushed for the company to agree to language that allows for “all lawful uses” of its technology. The DOD has given Anthropic until Friday at 5:01 p.m. ET to agree to its terms.</p>\n<p>If the company does not, the department is threatening to cancel a $200 million contract, in addition to warning it could label the AI firm a “supply chain risk” or invoke the Defense Production Act (DPA), a federal power typically reserved for wartime or emergencies. </p>\n<p>“I don’t personally think the Pentagon should be threatening DPA against these companies,” Altman told CNBC’s “Squawk Box” on Friday morning.</p>\n<p>“But I also think that companies that choose to work with the Pentagon, as long as it is going to comply with legal protections and the few red lines that the field, we have, I think we share with Anthropic and that other companies also independently agree with, I think it is important to do that,” he continued.</p>\n<p>“For all the differences I have with Anthropic, I mostly trust them as a company, and I think they really do care about safety, and I’ve been happy that they’ve been supporting our warfighters,” the OpenAI CEO added.</p>\n<p>OpenAI and Anthropic are major competitors in the commercial AI race, a rivalry highlighted by Anthropic’s Super Bowl ad knocking OpenAI’s plan to introduce advertising to it’s free ChatGPT tool. Altman and Amodei notably declined to clasp hands during a group photo shoot at India’s AI summit last week. </p>\n<p>Ahead of the Friday deadline, Anthropic CEO Dario Amodei said in a lengthy statement that the company “cannot in good conscience accede” to the Pentagon’s terms.</p>\n<p>“Anthropic understands that the Department of War, not private companies, makes military decisions,” he wrote in the statement released late Thursday. “We have never raised objections to particular military operations nor attempted to limit use of our technology in an ad hoc manner.”</p>\n<p>“However, in a narrow set of cases, we believe AI can undermine, rather than defend, democratic values,” he added. “Some uses are also simply outside the bounds of what today’s technology can safely and reliably do.”</p>\n<p>The Pentagon has argued that it has “no interest” in using AI to conduct mass surveillance or develop autonomous weapons.</p>\n<p>Following Amodei’s statement Thursday, Under Secretary of War Emil Michael accused the Anthropic CEO of having a “God-complex.”</p>\n<p>“He wants nothing more than to try to personally control the US Military and is ok putting our nation’s safety at risk,” he wrote in a post on the social platform X. “The @DeptofWar will ALWAYS adhere to the law but not bend to whims of any one for-profit tech company.”</p>",
            "kind": 1,
            "link": "https://thehill.com/policy/technology/5758898-altman-backs-anthropic-pentagon-stand/",
            "pub_date": "2026-02-28 01:10:55",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5758838,
            "title": "'Say no to pajamas': Florida airport issues 'ban' on PJs, but it was 'all in fun'",
            "description": "<p>TAMPA, Fla. (<a href=\"https://fox8.com/news/had-enough-airport-says-its-time-to-ban-pajamas/\">WJW</a>) – “It’s time to ban pajamas at Tampa International Airport.”</p>\n<p>A Florida airport <a href=\"https://x.com/FlyTPA/status/2027037182091731286/photo/1\">said on social media Thursday</a> that it wanted to prohibit people from wearing PJs, but it wasn’t being serious.</p>\n<div class=\"nlp-ignore-block article-content rich-text\">\n\n</div>\n<p>In a cheeky social media post, the airport claimed to have already banned Crocs and given “everyone the amazing opportunity to experience the world’s first Crocs-free airport.”</p>\n<p>“Pajamas. At the airport. In the middle of the day,” the airport wrote in a <a href=\"https://x.com/FlyTPA/status/2027037182091731286/photo/1\" rel=\"noreferrer noopener\" target=\"_blank\">social media post</a>. “We’ve seen enough, we’ve had enough,” adding that “the madness stops today.” </p>\n<p>“Help Tampa International Airport become the first Crocs-free and pajama-free airport,” the post continued. “Do your part. Say no to pajamas at TPA.”</p>\n<div class=\"nlp-ignore-block article-content rich-text\">\n\n</div>\n<p>Of course, travelers looking for comfort may have a different opinion on the matter. Commenters on the post added some reasons they’re traveling in comfort.</p>\n<p>“I realize that in the days of yore, people dressed up for air travel. This was also the first cabin then. People only care about price. The PJs stay,” <a href=\"https://x.com/FlyTPA/status/2027037182091731286/photo/1\" rel=\"noreferrer noopener\" target=\"_blank\">one wrote</a>.</p>\n<p>“I can’t support this, having sat at the terminal from 10 PM until nearly 4 AM on a flight delay,” <a href=\"https://x.com/FlyTPA/status/2027037182091731286/photo/1\" rel=\"noreferrer noopener\" target=\"_blank\">wrote another</a>. According to FlightAware, there were nearly 1,800 <a href=\"https://www.flightaware.com/live/cancelled/today\" rel=\"noreferrer noopener\" target=\"_blank\">delays in the U.S. before noon on Thursday</a>.</p>\n<p><a href=\"https://x.com/FlyTPA/status/2027037182091731286/photo/1\" rel=\"noreferrer noopener\" target=\"_blank\">Another commenter said</a>, “I think a lot of people have also had enough. Of airports and airlines. We’re treated like cattle with rare exceptions, stuffed into tiny little seats. … We pay exorbitant prices for food and drink at the airport and then receive peanuts and a biscuit for a meal on the plane.”</p>\n<p>Beau Zimmer, an airport spokesperson, told The Associated Press the post was part of the airport’s longstanding social media persona — a tongue-in-cheek voice it has cultivated since its early days on Twitter, before the platform rebranded as X. The account has attracted a loyal global following, he said.</p>\n<p>“Our regular social media followers just eat this stuff up,” Zimmer said. “But obviously, this is all in fun, and we encourage our travelers to be comfortable.”</p>\n<p>Nexstar’s WJW sister station, WFLA, got a statement from Tampa International Airport as well.</p>\n<p>“Tampa International Airport regularly shares lighthearted, satirical social media content as part of our ongoing effort to engage with our followers. Today’s post about ‘banning’ pajamas was another playful nod to day-of-travel fashion debates. We encourage our passengers to travel comfortably and appreciate our loyal followers who enjoy the online humor.”</p>\n<p>U.S. Transportation Secretary Sean Duffy reacted to the post with a GIF of actor John Krasinski from the TV show “The Office” looking into the camera and saying, “Yes!”</p>\n<p>Last year, before holiday travel, Duffy <a href=\"https://www.livenowfox.com/news/transportation-secretary-americans-ditch-pajamas-slippers-airport-travel-holidays\" rel=\"noreferrer noopener\" target=\"_blank\">issued a plea</a>.</p>\n<p>“I call this, just maybe dressing with some respect. You know, whether it’s a pair of jeans and a decent shirt,” he said in <a href=\"https://www.livenowfox.com/news/transportation-secretary-americans-ditch-pajamas-slippers-airport-travel-holidays\" rel=\"noreferrer noopener\" target=\"_blank\">November 2025</a>. “I would encourage people to maybe dress a little bit better, which encourages, encourages us to maybe behave a little better. Let’s try not to wear slippers and pajamas as we come to the airport.” </p>\n<p><em>The Associated Press contributed to this report. </em></p>",
            "kind": 1,
            "link": "https://thehill.com/policy/transportation/5758838-florida-airport-pjs-ban/",
            "pub_date": "2026-02-28 01:10:54",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5758890,
            "title": "Boebert on Hillary Clinton deposition photo leak: 'The Democrats were breaking the rules, too'",
            "description": "<p>Rep. Lauren Boebert (R-Colo.) is defending her decision on Thursday to share a picture of former Secretary of State Hillary Clinton during her closed-door <a href=\"https://thehill.com/homenews/house/5756577-clintons-questioned-epstein-links/\">deposition</a> before the House Oversight and Government Reform Committee. </p>\n<p>Boebert said she shared the image, which was taken before the hearing began, with right-wing podcaster Benny Johnson after receiving permission from the committee’s staff. Johnson then <a href=\"https://x.com/bennyjohnson/status/2027165683016933479?s=20\">posted</a> the image on social media. </p>\n<p>In an interview with NewsNation’s Chris Cuomo on Thursday, Boebert deflected blame on to Democratic committee members who shared updates about Clinton’s deposition with reporters. </p>\n<p>“However, there were Democrats and those at the minority party that were releasing information about the hearing throughout the day, topics that were discussed were being leaked to the media,” Boebert said. “And so there was a lot of things that were coming out of that room, but regardless, it was a photo.”</p>\n<p>Boebert said committee members later agreed that no one would take photos during the deposition. </p>\n<p>The committee subpoenaed Clinton’s testimony as part of its probe into convicted sex offender Jeffrey Epstein. The former secretary of State and former President Bill Clinton had battled for months about the deposition.</p>\n<p>Hillary Clinton <a href=\"https://thehill.com/homenews/house/5756577-clintons-questioned-epstein-links/\">repeatedly denied</a> any knowledge about Epstein’s crimes during her six-hour deposition in Chappaqua, N.Y. The former first lady told reporters she only knew Ghislaine Maxwell, Epstein’s associate who was convicted on sex trafficking crimes, “casually as an acquaintance.” </p>\n<p>Bill Clinton is set to <a href=\"https://thehill.com/homenews/house/5758483-bill-clinton-closed-door-testimony-epstein-files-house-oversight/\">testify</a> before the committee on Friday. The former president has previously gone on record about his relationship with Epstein, addressing his inclusion on the flight logs of the sexual predator’s private jet in a 2024 memoir. </p>\n<p>“Traveling on Epstein’s plane was not worth the years of questioning afterward,” he wrote in a 2024 autobiography. “I wish I had never met him.”</p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/house/5758890-boebert-on-hillary-clinton-deposition-photo-leak-the-democrats-were-breaking-the-rules-too/",
            "pub_date": "2026-02-28 00:56:50",
            "source": "thehill",
            "language": "en"
        }
    ]
}