{
    "data": [
        {
            "id": 5125205,
            "title": "Trump administration investigating antisemitism allegations at 5 universities",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>The Department of Education is investigating antisemitism allegations at five universities after the president’s executive order last week requiring federal agencies to take more action against antisemitism.  </p>\n<p>The department announced the investigations on Monday against Columbia University, Northwestern University, Portland State University, University of California, Berkeley and University of Minnesota, Twin Cities. </p>\n\n<p>The investigation was opened under the department’s Office of Civil Rights for alleged Title VI violations that protects students from discrimination based on national origin.  </p>\n<p>“Too many universities have tolerated widespread antisemitic harassment and the illegal encampments that paralyzed campus life last year, driving Jewish life and religious expression underground. The Biden Administration’s toothless resolution agreements did shamefully little to hold those institutions accountable,” said Craig Trainor, acting assistant secretary for civil rights.</p>\n<p>“Today, the Department is putting universities, colleges, and K-12 schools on notice: this administration will not tolerate continued institutional indifference to the wellbeing of Jewish students on American campuses, nor will it stand by idly if universities fail to combat Jew hatred and the unlawful harassment and violence it animates,” Trainor added.  </p>\n<p>The department said the investigations “build upon” the report House Republicans on the Education and Workforce Committee released last year documenting antisemitic incidents at college campuses around the country.  </p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>Two schools under investigation said they have received the notice and that discrimination is not tolerated on their campuses.  </p>\n<p>“We are confident in the actions we have taken to address antisemitism on our campus, including updating our Student Code of Conduct, our disciplinary procedures and making investments in public safety. We continue to work tirelessly to make our university a safe and non-discriminatory educational institution,” Northwestern University said in a statement. </p>\n\n<p>Columbia University, where the pro-Palestinian <a data-id=\"https://thehill.com/homenews/education/4614798-columbia-hybrid-classes-protests-israel-palestine/\" data-type=\"link\" href=\"https://thehill.com/homenews/education/4614798-columbia-hybrid-classes-protests-israel-palestine/\" rel=\"noreferrer noopener\" target=\"_blank\">protests began last spring</a> and has been a big target of Republicans, says it has taken several steps to address antisemitism on campus.  </p>\n<p>“We look forward to ongoing work with the new federal administration to combat antisemitism and ensure the safety and wellbeing of our students, faculty, and staff,” the school wrote.  </p>\n<p>The Hill has reached out to the other three schools for comment.  </p>\n<p>The Department of Education also announced Monday it was joining forces with the Justice Department and the Department of Health and Human Services to create a task force to combat antisemitism.  </p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/homenews/education/5125205-education-department-antisemitism-probe-universities/",
            "pub_date": "2025-02-04 23:46:24",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5125280,
            "title": "Todd Young, key GOP swing vote, says he’ll support Gabbard",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>Sen. Todd Young (R-Ind.) announced on Tuesday that he will support Tulsi Gabbard’s nomination to become director of national intelligence, paving the way for her to reach a floor vote and increasing her chances of winning full confirmation.</p>\n<p>Young had been considered a crucial Intelligence Committee GOP swing vote on Gabbard’s nomination.</p>\n<p>“I appreciate Tulsi Gabbard’s engagement with me on a variety of issues to ensure that our intelligence professionals will be supported and policymakers will receive unbiased information under her leadership,” Young <a href=\"https://x.com/sentoddyoung/status/1886799486640386197?s=46\">posted on X</a> with a letter Gabbard sent him of commitments in order to win his vote.  </p>\n<p>“I have done what the Framers envisioned for senators to do: use the consultative process to seek firm commitments, in this case commitments that will advance our national security, which is my top priority as a former Marine Corps intelligence officer,” he continued. </p>\n<p>“Having now secured these commitments, I will support Tulsi’s nomination and look forward to working with her to protect our national security,” Young added.</p>\n<p><em>DEVELOPING.</em></p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/homenews/senate/5125280-todd-young-tulsi-gabbard-vote/",
            "pub_date": "2025-02-04 23:46:22",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5123925,
            "title": "Kennedy, Patel and Gabbard: Trump’s terrifying troika",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>With a tie-breaking nod from Vice President JD Vance, President Trump got away with Pete Hegseth, a defense secretary short on qualifications and long on disqualifying personal baggage. Senate Minority Leader Chuck Schumer (D-N.Y.) <a href=\"https://www.democrats.senate.gov/news/press-releases/leader-schumer-floor-remarks-on-president-trumps-erratic-and-unqualified-nominee-for-secretary-of-defense-pete-hegseth\" rel=\"noreferrer noopener\" target=\"_blank\">called him</a> “one of the most erratic, unqualified, and unfit Cabinet nominees we have ever seen in modern times.” </p>\n<p>Hopefully, there will be someone in the Pentagon to push back against erratic defense policies that compromise our national security.</p>\n\n<p>But Robert F. Kennedy Jr., Kash Patel and Tulsi Gabbard, nominated to oversee public health, the FBI and national intelligence, are unqualified, unprincipled and untethered. This is really terrifying.</p>\n<p>Kennedy is Trump’s anti-vaccine nominee for Secretary of Health and Human Services. In addition to administering the country’s Medicare and Medicaid programs, HHS has in its portfolio the National Institutes of Health, the Centers for Disease Control and the Food and Drug Administration. This is our center for scientific research and delivery of healthcare to all Americans.</p>\n<p>Sen. Sheldon Whitehouse (D-R.I.), appreciating that the general welfare is on the line, told Kennedy, “Frankly, you frighten people.” No wonder. One of those “people” might include his cousin Caroline Kennedy, who said she had known Bobby her whole life and <a href=\"https://www.bbc.com/news/articles/cm29w09p7r4o\" rel=\"noreferrer noopener\" target=\"_blank\">damned him in a letter to the Senate</a> as a “predator” lacking “any relevant government, financial, management, or medical experience.” She wrote, “His views on vaccines are dangerous and willfully misinformed.”</p>\n<p>Putting someone like Kennedy in charge of the nation’s health care establishment is recklessly dangerous. Americans could die without access to the latest scientific advances. Children could die without access to safe and effective vaccines.</p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>Trump wants Kash Patel to head the FBI. Suffice it to say, J. Edgar Hoover, he is not. In his opening remarks, Sen. Chuck Grassley (R-Iowa) told Patel, “Public trust in the FBI is low. Only 41 percent of the American public thinks the FBI is doing a good job … Mr. Patel, it’ll be your job to restore the public’s trust and return the FBI to its core mission of fighting crime.”</p>\n<p>Some chance. Patel is all political vengeance. Before the committee, Patel lacked candor and credibility, straining to describe his past and accurately characterize his alleged accomplishments.</p>\n\n<p>Sen. Dick Durbin (D-Ill.) called Patel “a staunch Trump loyalist who has repeatedly peddled false conspiracy theories and threatened to go after President Trump’s enemies.” Patel switched positions, claiming he doesn’t have an “enemies list” — in fact, he published <a href=\"https://x.com/Timodc/status/1863620081873244259\" rel=\"noreferrer noopener\" target=\"_blank\">such a list</a> as an appendix in a 2023 book — and that he wouldn’t launch revenge investigations. Patel may be saying the right thing now with his confirmation on the line, but that hardly restores “public trust in the FBI.”</p>\n<p>It’s not just Democrats who have deep reservations about Patel. Trump’s attorney general, Bill Barr, <a href=\"https://substack.com/redirect/9e4ece3d-a9e9-492c-b56d-dae278f87667?j=eyJ1IjoiZnVuZHIifQ.EyGEkJ8j_xBCaMBtZFlmsSoVOAOKOvU_hXNZeAXvaTA\" rel=\"noreferrer noopener\" target=\"_blank\">rejected Patel</a> as a possible deputy director of the FBI, stating that Patel would be appointed over “my dead body.” That’s potent medicine coming from Trump’s “hatchet man,” who compromised the necessary independence of Justice Department. And when in his first administration Trump planned to name Patel deputy director of the CIA, Gina Haspel, the agency’s head, threatened to resign.</p>\n<p>Patel has a vengeful nature. When a reporter from The Atlantic <a href=\"https://www.theatlantic.com/magazine/archive/2024/10/kash-patel-trump-national-security-council/679566/?utm\" rel=\"noreferrer noopener\" target=\"_blank\">sought to interview</a> “many of the nearly forty” of Patel’s former colleagues, fearing certain retaliation, they said they would only do so if they could remain anonymous.</p>\n<div class=\"civic-science-article-container civic-science-more-14 civic-is-mr3\" data-civicscience-widget=\"3f127ebd-287e-0b64-a901-d55ec286348a\" id=\"civsci-id-civsci-id-596708068\"></div>\n<p>Durbin <a href=\"https://www.judiciary.senate.gov/press/dem/releases/durbin-delivers-opening-statement-in-senate-judiciary-committee-hearing-for-president-trumps-pick-to-be-fbi-director-kash-patel?utm_\" rel=\"noreferrer noopener\" target=\"_blank\">summarized it</a> exceedingly well: “The American people deserve an FBI director focused on keeping our families safe from terrorism, drug trafficking and violent crime, not the checklist of grievances in this book. Mr. Patel, your record makes clear that you are not that person.”</p>\n<p>As for Tulsi Gabbard, even the editorial board of Rupert Murdoch’s <a href=\"https://www.wsj.com/opinion/tulsi-gabbard-senate-intelligence-hearing-director-of-national-intelligence-section-702-478ef0e7?mod=trending_now_opn_3\" rel=\"noreferrer noopener\" target=\"_blank\">Wall Street Journal doesn’t like her</a>.</p>\n<p>In a sizzling editorial, the Journal faulted Gabbard’s opposition to Section 702 of the Foreign Intelligence Surveillance Act, which permits the government to monitor foreigners abroad without a warrant. The information goes into a database, around 60 percent of which goes into the president’s daily intelligence briefing. In some cases, the intelligence community can run inquiries on U.S. persons under strict guidelines imposed by Congress. This is not left-right issue. It is important national security stuff needed to combat terrorism that has overwhelming bipartisan support.</p>\n\n<p>Gabbard was woefully ignorant of the issues. “Warrants should generally be required before an agency undertakes a U.S. person query,” she told the Senate in writing, “except in exigent circumstances.” She underscored that view in response to a question from Sen. Ron Wyden (D-Wisc.).</p>\n<p>Gabbard got turned around. Her argument was identical to that made by far-left Democrats, which Congress rejected. The Journal editorial board believes correctly that the time involved in getting a warrant requiring court approval would impede the government in monitoring terrorist threats in real time. While the agents and the lawyers are dithering, the clock is ticking on the time bomb, or the plane is being hijacked and jetting towards its target.</p>\n<p>Gabbard didn’t have a clue. When Sen. John Cornyn (R-Texas) asked her what she would tell a judge to establish probable cause for a warrant, she had no answer, lamely protesting that “this is the center of the debate.”</p><!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://thehill.com/submitting-opinion-content/\"><img alt=\"\" class=\"wp-image-4329764\" decoding=\"async\" height=\"121\" loading=\"lazy\" sizes=\"(max-width: 899px) 100vw, 600px\" src=\"https://thehill.com/wp-content/uploads/sites/2/2023/11/op2.png?w=600\" srcset=\"https://thehill.com/wp-content/uploads/sites/2/2023/11/op2.png?resize=600,121 600w, https://thehill.com/wp-content/uploads/sites/2/2023/11/op2.png?resize=300,61 300w, https://thehill.com/wp-content/uploads/sites/2/2023/11/op2.png?resize=50,10 50w\" width=\"600\"/></a></figure>\n\n<p>All this — on top of Gabbard’s sanguine view of Putin’s invasion of Ukraine and her links to Assad’s Syria — make her nomination a nonstarter. The Journal said it well: “The Senate can do Mr. Trump, and the country, a favor by rejecting a director of national intelligence who doesn’t understand the vital tools of the job.”</p>\n<p>If I am frightened by these nominees, like so many other people, there is certainly an abundance of probable cause.</p>\n<p><em>James D. Zirin, author and legal analyst, is a former federal prosecutor in New York’s Southern District. He is also the host of the public television talk show and podcast </em><a href=\"https://podcasts.apple.com/us/podcast/conversations-with-jim-zirin/id1660145057\" rel=\"noreferrer noopener\" target=\"_blank\"><em>Conversations with Jim Zirin</em></a><em>.</em></p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/opinion/white-house/5123925-kennedy-patel-and-gabbard-trumps-terrifying-troika/",
            "pub_date": "2025-02-04 23:35:53",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5124446,
            "title": "Live updates: Senate panel advances RFK Jr.; USAID on the chopping block",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>A Senate panel on Tuesday <a href=\"https://thehill.com/homenews/senate/5123633-kennedy-nomination-advances/\" rel=\"noreferrer noopener\" target=\"_blank\">advanced the nomination</a> of Robert F. Kennedy Jr. to serve as secretary of Health and Human Services.</p>\n<p>The 14-13 vote was strictly along party lines.</p>\n\n<p>The vote on Kennedy was the first of two crucial tests for President Trump’s nominees on Tuesday. Tulsi Gabbard <a href=\"https://thehill.com/homenews/senate/5124466-gabbard-rfk-jr-confirmation-committee-votes/\" rel=\"noreferrer noopener\" target=\"_blank\">faces a vote before the Senate Intelligence Committee</a> this afternoon.</p>\n<p>Meanwhile, as part of the Trump administration’s crusade for “government efficiency,” Secretary of State Marco Rubio is being put in charge of the U.S. Agency for International Development (USAID) as the White House <a href=\"https://thehill.com/homenews/administration/5123282-marco-rubio-usaid-take-over/\">mulls the future of the agency</a>.</p>\n<p>USAID has for decades administered billions of dollars of humanitarian and development assistance around the world. </p>\n<p>USAID offices were closed Monday and employees were told to work remotely. Dozens of senior officials have been furloughed and hundreds of contract employees laid off. The apparent move to shutter the agency — and the chaos surrounding it on Monday — enraged Democrats.</p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>Also, Benjamin Netanyahu is in Washington meeting with President Trump about a future for Gaza.</p>\n<p>Read on for updates on these stories and more.</p>\n<div class=\"5124446\" id=\"wpcom-liveblog-container\"></div>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/homenews/administration/trumps-first-100-days/5124446-live-updates-gabbard-rfk-jr-usaid-trump-house-senate/",
            "pub_date": "2025-02-04 23:35:53",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5123633,
            "title": "Senate panel advances RFK Jr. as HHS Secretary on party-line vote",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>The Senate Finance Committee voted Tuesday to advance to the floor Robert F. Kennedy Jr’s nomination to lead the Department of Health and Human Services. </p>\n<p>The 14-13 vote was strictly along party lines and came despite Sen. Bill Cassidy (R-La.) saying last week he had <a href=\"https://thehill.com/policy/healthcare/5119803-cassidy-vote-kennedy-hhs/\" rel=\"noreferrer noopener\" target=\"_blank\">serious doubts</a> about whether Kennedy is qualified to lead the agency, primarily over his history of promoting a false link between vaccines and autism.  </p>\n\n<p>Cassidy had emerged as the pivotal vote, as Kennedy couldn’t afford to lose any Republicans on the committee. He can lose three on the Senate floor and still be confirmed, with Vice President JD Vance breaking the tie.  </p>\n<p>The three GOP senators who voted against Defense Secretary Pete Hegseth — Sens. Mitch McConnell (Ky.), Lisa Murkowski (Alaska) and Susan Collins (Maine) — are all seen as potential wildcards on Kennedy as well. None of them sit on the Finance Committee.  </p>\n<p>According to Fox News, Kennedy and Cassidy spoke on Sunday after the lawmaker said during the Senate Health, Education, Labor and Pensions (HELP) Committee confirmation hearing last week that he remained skeptical, and suggested the two might talk over the weekend. </p>\n<p>Cassidy, a practicing gastroenterologist, has been facing enormous pressure from Kennedy supporters and Louisiana Republicans ahead of the vote. He appeared torn between loyalty to Trump and his commitment to medicine. </p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>Kennedy is one of President Trump’s most high-profile nominees, and his <a href=\"https://thehill.com/policy/healthcare/5117209-robert-kennedy-senate-hearing/\">two</a> <a href=\"https://thehill.com/homenews/administration/5114603-robert-f-kennedy-jr-vaccine-conspiracy-theories/\">confirmation</a> hearings last week featured some fireworks as Democrats hammered him for promoting misinformation about vaccines, flip-flopping on abortion, conflicts of interest in his legal work, and his general lack of understanding about the details of health policies that would fall under his charge.</p>\n<p>Senators during Tuesday’s hearing also voted to waive the seven-day rule that usually requires at least a week to elapse between a nominee’s confirmation hearing and a vote to discharge from committee. </p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/homenews/senate/5123633-kennedy-nomination-advances/",
            "pub_date": "2025-02-04 23:31:04",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5124979,
            "title": "Watch live: Senate Judiciary Committee weighs permanent drug scheduling for fentanyl",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>The Senate Judiciary Committee is holding a hearing Tuesday morning to consider legislation that would permanently classify <a data-id=\"https://thehill.com/homenews/4656612-fentanyl-pill-seizures-skyrocketing-study/\" data-type=\"link\" href=\"https://thehill.com/homenews/4656612-fentanyl-pill-seizures-skyrocketing-study/\">fentanyl-related substances</a> as a Schedule 1 drug under the Controlled Substances Act.</p>\n<p>Schedule 1 drugs are those that have a high potential for abuse and the potential to create severe psychological and/or physical dependence, according to the <a data-id=\"https://www.drugs.com/article/csa-schedule-1.html\" data-type=\"link\" href=\"https://www.drugs.com/article/csa-schedule-1.html\">Drug Enforcement Agency </a>(DEA). The drugs on this list also have no currently accepted medical use.</p>\n<p>Senate Judiciary Chair Chuck Grassley (R-Iowa), along with Sens. Bill Cassidy (R-La.) and Martin Heinrich (D-N.M.), unveiled a <a data-id=\"https://www.judiciary.senate.gov/press/rep/releases/grassley-cassidy-heinrich-propose-permanent-scheduling-fix-for-fentanyl-related-substances\" data-type=\"link\" href=\"https://www.judiciary.senate.gov/press/rep/releases/grassley-cassidy-heinrich-propose-permanent-scheduling-fix-for-fentanyl-related-substances\">bipartisan bill</a> late last month that would reclassify the potent synthetic opioid — now a Schedule 2 drug — which has been used for pain management.</p>\n<p>“Today, roughly 150 Americans will die from fentanyl poisoning,” Grassley said. “Cartels fuel this crisis by marketing their poison as legitimate prescription pills. They also avoid regulation by chemically altering the drugs to create powerful fentanyl knock-offs.”</p>\n<p>The hearing is scheduled to begin at 10:30 a.m. EST.</p>\n<p>Watch the live video above.</p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/video-clips/5124979-senate-hearing-fentanyl-schedule-1-watch-live/",
            "pub_date": "2025-02-04 23:25:53",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5125168,
            "title": "New DNC chair: Democratic Party ‘not dead’",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>Democratic National Committee Chair <a href=\"https://thehill.com/homenews/campaign/5120961-ken-martin-new-dnc-chair-what-to-know/\">Ken Martin</a> said the party was “not dead” despite the party’s loss of the White House and Senate majority in last fall’s elections. </p>\n<p>“We’re not dead as a party. We’re still alive and kicking, and we’re going to fight for our values, and we’re going to fight for American values at this time, when people are seeing what Donald Trump and the Republicans are doing at this time,” Martin said during a Monday appearance on MSNBC’s “The Rachel Maddow Show.”</p>\n\n<p>Martin won the race to become the next DNC chair on Saturday in a highly-contested race. Democrats are looking to Martin to<a href=\"https://thehill.com/homenews/campaign/5019903-dnc-chair-candidate-martin-recenter-agenda/\"> reestablish</a> the party’s presence in states across the nation as preparations for midterm elections kickoff. </p>\n<p>“There’s so many people that have struggled throughout this country over the last several years who are feeling forgotten, left behind, feeling like our party is not fighting for them anymore. And so, what we need to do in this moment when the stakes are so high, right, is to stand up and fight back,” Martin said during the interview.</p>\n<p>“Give people a sense that we’re willing to advocate for their best lives and to make sure that we’re doing everything we can to build for better days to come, for not only Americans but for this world, frankly. There’s a lot at stake right now, and Americans are relying on our party right now to stand up to the excesses and extremes of the Trump administration right now,” he added.</p>\n<p>Martin, well known for his tenure as Minnesota Democratic Farmer Labor party chair said he’s playing the long game when it comes to election bids and legislative wins.</p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>“We don’t have to win every single battle, but we do need to win the war. And what I mean by that is we have to give people a sense of who they are. And this is really a question of which side are they on, which side are we on, right? And the contrast is very clear,” he told Maddow.</p>\n<p>“The Trump administration and his billionaire Cabinet is on the side of the robber barons. This current crop of robber barons, which are trying to profit off the backs of hard-working men and women in this country,” he added.</p>\n\n<p>“I know whose side I’m on. I know whose side the Democratic Party is on, and we’re on the side of hard-working men and women who just want the country to not forget about them, to make sure that we are center in their lives and focusing again, on making the American Dream real for all Americans.”</p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/homenews/administration/5125168-dnc-chair-ken-martin-rebuild/",
            "pub_date": "2025-02-04 23:20:49",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5125130,
            "title": "Amber Ruffin to headline White House Correspondents’ Association dinner",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>Amber Ruffin is taking center stage at this spring’s White House Correspondents’ Association (WHCA) dinner, the first time the high-profile Washington event is being held during President Trump’s second term in office. </p>\n<p>The comedian and writer — who’s part of CNN’s comedic news show “Have I Got News For You” — will headline the annual black-tie fête on April 26, the WHCA announced Tuesday.</p>\n\n<p>Group President Eugene Daniels lauded 46-year-old Ruffin, who also serves as a writer on “Late Night with Seth Meyers,” as a “perfect fit for the dinner this year” who has the “ability to walk the line between blistering commentary and humor all while provoking her audience to think about the important issues of the day.”</p>\n<p>Ruffin’s “unique talents are the ideal fit for this current political and cultural climate,” Daniels said. </p>\n<p>Trump — who has frequently sparred with the media and <a href=\"https://thehill.com/homenews/administration/400433-trump-attacks-reporters-as-enemy-of-the-people-says-they-cause-wars/\" rel=\"noreferrer noopener\" target=\"_blank\">has launched</a> blistering attacks on members of the press — bucked tradition and declined to attend the WHCA dinner throughout his first term. The sitting president is typically the focus — and punchline — for the entertainers who have served as emcees for the journalist-, celebrity- and lawmaker-filled Correspondents’ dinner.</p>\n<p>The WHCA has said that proceeds from its buzzy event benefit its work, “including awards recognizing excellence in the profession and scholarships for journalism students.”</p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>In 2019, Trump said he <a href=\"https://thehill.com/homenews/administration/437542-trump-to-skip-white-house-correspondents-dinner-again/\" rel=\"noreferrer noopener\" target=\"_blank\">was skipping</a> the WHCA gala and would instead hold a rally. </p>\n<p>“The dinner is boring and so negative that we’re going to hold a very positive rally,” he said at the time. </p>\n\n<p>That year, Trump <a href=\"https://thehill.com/homenews/administration/440229-trump-tells-officials-not-to-attend-white-house-correspondents-dinner/\" rel=\"noreferrer noopener\" target=\"_blank\">also directed</a> administration officials not to attend the dinner. </p>\n<p>The White House didn’t immediately respond when asked if Trump was planning on attending this year’s dinner.</p>\n<p><em>—Alex Gangitano contributed. </em></p>\n<script type=\"text/javascript\">window.NREUM||(NREUM={});NREUM.info={\"beacon\":\"bam.nr-data.net\",\"licenseKey\":\"bb199f70cb\",\"applicationID\":\"738543775\",\"transactionName\":\"MQNTMhdXDxECABBZDAhJchMWQg4PTBMLQxdIFl4VEQ==\",\"queueTime\":0,\"applicationTime\":2293,\"atts\":\"HURERF9NHE5BAkYKGBsb\",\"errorBeacon\":\"bam.nr-data.net\",\"agent\":\"\"}</script>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/blogs/in-the-know/5125130-amber-ruffin-white-house-correspondents-association-dinner-trump/",
            "pub_date": "2025-02-04 23:11:01",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5124942,
            "title": "Church vandalized by Proud Boys now controls group’s trademark, judge rules",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>The Proud Boys are barred from selling merchandise using the right-wing extremist group’s name or symbols without permission from a Black church once vandalized by its members after a Washington judge on Monday <a href=\"https://www.documentcloud.org/documents/25512616-2024-cab-004147/#document/p1\">revoked their control</a> over the trademark. </p>\n<p>Judge Tanya Jones Bosier of the Superior Court of the District of Columbia turned control of the trademark “Proud Boys” over to the Metropolitan African Methodist Episcopal Church, which was attacked by members of the group, including former leader Enrique Tarrio, after a December 2020 rally supporting President Trump.</p>\n\n<p>The church previously won a $2.8 million default judgment against the Proud Boys in 2023 but sought control of the group’s trademarked name when it failed to pay up.</p>\n<p>Now, the church can attempt to seize any money the Proud Boys make via “any sale, transfer, disposition, or license” of the group’s name or signature logos, including a black and yellow laurel wreath, according to the order. </p>\n<p>In a lengthy <a href=\"https://x.com/NobleOne/status/1886782313742135707\">statement published to the social platform X</a>, Tarrio called for the judge’s impeachment and suggested the church should be audited, asserting “retribution is inevitable.”</p>\n<p>“Their actions are a betrayal of justice, reminiscent of Judas’s treachery,” Tarrio said, referencing the biblical figure who betrayed Jesus. “I hold in contempt any motions, judgments, and orders issued against me.”</p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>The vandalization of the church — specifically the destruction of a Black Lives Matter banner it had on display — proved pivotal. Tarrio was arrested for burning the banner days before Jan. 6, 2021, and was ordered out of the city, preventing him from joining other Proud Boys at the Capitol that day. </p>\n<p>The violence between Proud Boys and anti-Trump protesters on Dec. 12, 2020, the night the church was attacked, also marked a turning point in the right-wing group’s relationship with police. Prosecutors described that night as a critical precursor to the Capitol attack.</p>\n\n<p>Tarrio, who was convicted of sedition and sentenced to 22 years in prison over Jan. 6, <a href=\"https://thehill.com/regulation/court-battles/5096927-trump-commutes-sentence-proud-boys-leader-enrique-tarrio/\" rel=\"noreferrer noopener\" target=\"_blank\">received a full and unconditional pardon</a> from Trump as part of the sweeping clemency he granted to those charged in connection with the riot. Other leaders in the group saw their sentences for sedition or different serious felonies commuted to time served.</p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/regulation/court-battles/5124942-proud-boys-trademark-church-vandalized/",
            "pub_date": "2025-02-04 23:05:56",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5123599,
            "title": "Harboring undocumented immigrants? You could face decades in prison.",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>The current administration is very serious about enforcing our immigration laws, and <a href=\"https://www.ice.gov/doclib/news/guidelines-civilimmigrationlaw.pdf\" rel=\"noreferrer noopener\" target=\"_blank\">unlike the previous administration</a>, it has not placed any restrictions on which provisions can be enforced. As border czar Tom Homan <a href=\"https://thenationaldesk.com/news/americas-news-now/homan-doubles-down-on-ice-activity-in-schools-if-they-dont-like-it-change-the-law-illegal-immigrants-immigration-border-czar-mexico-aliens-security-abc-news-this-week\" rel=\"noreferrer noopener\" target=\"_blank\">has said</a>, “We’re enforcing the laws that Congress enacted and a president signed.”  </p>\n<p>Most of the provisions in the <a href=\"https://www.uscis.gov/laws-and-policy/legislation/immigration-and-nationality-act\" rel=\"noreferrer noopener\" target=\"_blank\">Immigration and Nationality Act</a> pertain to civil offenses, such as deportability and eligibility for relief from deportation. But the law also includes criminal provisions — including ones that make giving prohibited assistance to undocumented immigrants a <a href=\"https://www.thefederalcriminalattorneys.com/classification-system-federal-felonies\" rel=\"noreferrer noopener\" target=\"_blank\">felony</a>. </p>\n\n<p>Individuals who help undocumented immigrants need to know that they may be committing a serious criminal offense that can result in severe consequences, including substantial fines and lengthy prison sentences. In extreme cases, offenders may face life imprisonment, or even the death penalty.</p>\n<p>This does not mean that you can’t help someone who might be an undocumented immigrant without subjecting yourself to prosecution. The main criminal provisions that pertain to assisting undocumented migrants can be found in <a href=\"https://uscode.house.gov/view.xhtml?req=granuleid:USC-prelim-title8-section1324&amp;num=0&amp;edition=prelim\" rel=\"noreferrer noopener\" target=\"_blank\">8 U.S.C. § 1324(a)(1)(A)</a>, which includes the following offenses: </p>\n<p><strong>Smuggling:</strong> Bringing or attempting to bring a person into the United States at any place other than a port of entry knowing that he/she is an alien is a criminal offense. </p>\n<p>For instance, in January 2025, Isai Orona was sentenced to four and a half years in federal prison for <a href=\"https://nypost.com/2025/01/23/us-news/smuggler-sentenced-after-confessing-he-transported-more-than-2500-illegal-immigrants-into-the-us/?utm_source=chatgpt.com\" rel=\"noreferrer noopener\" target=\"_blank\">smuggling more than 2,500 undocumented immigrants</a> into the United States. He had a network of drivers and 12 different cars for transporting the illegal crossers. The judge also ordered him to pay a $250,000 fine. </p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p><strong>Transporting:</strong> It is a criminal offense to provide transportation within the United States for an alien knowing “or in reckless disregard of the fact that [the] alien has come to, entered, or remains in the United States in violation of law.” </p>\n<p>The type of conduct this provision <a href=\"https://www.nolo.com/legal-encyclopedia/is-illegal-transport-undocumented-immigrant-within-the-us.html\" rel=\"noreferrer noopener\" target=\"_blank\">was meant to address</a> is that of a driver who is paid to pick up undocumented immigrants right after they’ve made an illegal crossing, taking them into the interior of the country. It should not apply to someone who gives a ride to a friend or neighbor without knowing he/she is an undocumented immigrant.  </p>\n\n<p><strong>Harboring: </strong>It is a criminal offense to conceal, harbor or shield an alien from detection “knowing or in reckless disregard of the fact that [the] alien has come to, entered, or remains in the United States in violation of law.”  </p>\n<p>To warrant a <a href=\"https://mcbeanlaw.com/harboring-an-undocumented-individual-what-you-need-to-know/\" rel=\"noreferrer noopener\" target=\"_blank\">conviction</a>, the defendant’s actions must have facilitated the undocumented immigrant’s ability to remain here unlawfully, but that requirement can be interpreted differently by different people. </p>\n<p>Here is an example of applying the provision the way it should be applied: A man named Lopez had six homes that he rented to undocumented immigrants. He didn’t just provide them with a place to stay; he also helped them with job applications and arranging <a href=\"https://sedaghatlaw.com/sham-marriage-green-card-consequences/\" rel=\"noreferrer noopener\" target=\"_blank\">sham marriages</a> so they could obtain green cards. Lopez significantly facilitated the ability of undocumented immigrants to stay in the U.S. unlawfully.  </p>\n<div class=\"civic-science-article-container civic-science-more-14 civic-is-mr3\" data-civicscience-widget=\"3f127ebd-287e-0b64-a901-d55ec286348a\" id=\"civsci-id-civsci-id-596708068\"></div>\n<p><strong>Encouraging:</strong> It is a criminal offense to encourage or induce an alien “to come to, enter, or reside in the United States while knowing or in reckless disregard of the fact that the alien’s entry or presence is or will be in violation of law.” </p>\n<p>The ACLU <a href=\"https://www.aclu.org/news/free-speech/this-law-could-criminalize-everyday-conversations-about-immigration\" rel=\"noreferrer noopener\" target=\"_blank\">claimed</a> that this provision could criminalize everyday conversations such as: </p>\n<ul>\n<li>“A grandmother who tells her undocumented grandchild that she doesn’t want them to leave her. </li>\n</ul>\n<ul>\n<li>A doctor advising a patient with an expiring student visa that the patient needs medical treatment that is only offered in the United States. </li>\n</ul>\n<ul>\n<li>A professor advocating for <a href=\"https://www.aclu.org/know-your-rights/know-your-rights-about-daca\" rel=\"noreferrer noopener\" target=\"_blank\">DACA</a> recipients to remain in the country no matter what so that Congress will be pressured to grant a path towards citizenship, while pointing out how her university’s policy of accepting DREAMers has enriched her teaching experience.” </li>\n</ul>\n<p>The Supreme Court <a href=\"https://crsreports.congress.gov/product/pdf/LSB/LSB11003\" rel=\"noreferrer noopener\" target=\"_blank\">upheld this provision</a> when it was challenged for allegedly violating free speech and being overly broad, because it only forbids “the purposeful solicitation and facilitation of specific acts that violate federal law.”  </p>\n\n<p>Telling an undocumented immigrant that you don’t want him or her to leave, or giving that person reasons to stay, should not be interpreted as a purposeful solicitation or facilitation of specific acts that violate federal law.  </p>\n<p>The <a href=\"https://www.ussc.gov/about-page\" rel=\"noreferrer noopener\" target=\"_blank\">U.S. Sentencing Commission</a> provides information on maximum sentences for violating 8 U.S.C. § 1324(a)(1)(A) in its <a href=\"https://www.ussc.gov/sites/default/files/pdf/training/primers/2024_Primer_Immigration.pdf\" rel=\"noreferrer noopener\" target=\"_blank\">Primer on Immigration Offenses</a>.  </p>\n<p>The statutory maximum for bringing or attempting to bring an undocumented immigrant into the United States is 10 years. The statutory maximum for transporting, harboring or encouraging a migrant to make an illegal entry without being paid for doing it is five years. The maximum increases to 10 years if any of these offenses is committed for financial gain. The maximum increases to 20 years if the offense causes serious bodily injury or places the life of another person in jeopardy. And it becomes life in prison or death if the offense causes the death of another person. </p>\n\n<p>The maximum penalty may be enhanced an additional 10 years if the offense is commercial transportation of large groups in a life-threatening manner or the offense resulted in a life- </p><!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://thehill.com/submitting-opinion-content/\"><img alt=\"\" class=\"wp-image-4329764\" decoding=\"async\" height=\"121\" loading=\"lazy\" sizes=\"(max-width: 899px) 100vw, 600px\" src=\"https://thehill.com/wp-content/uploads/sites/2/2023/11/op2.png?w=600\" srcset=\"https://thehill.com/wp-content/uploads/sites/2/2023/11/op2.png?resize=600,121 600w, https://thehill.com/wp-content/uploads/sites/2/2023/11/op2.png?resize=300,61 300w, https://thehill.com/wp-content/uploads/sites/2/2023/11/op2.png?resize=50,10 50w\" width=\"600\"/></a></figure>\n<p>threatening health risk to people in the United States. In addition, individuals convicted of these offenses may be subject to <a href=\"https://www.justice.gov/afp/types-federal-forfeiture\" rel=\"noreferrer noopener\" target=\"_blank\">forfeiture</a> of the vessel, motor vehicle or aircraft that was used in the commission of the offense. </p>\n<p>The possibility of innocently becoming engaged in criminal activity shouldn’t stop anyone from helping people who might be undocumented immigrants. Such conduct isn’t likely to result in being prosecuted for a criminal offense. But, it is necessary to be aware that providing prohibited assistance<em> </em>to an undocumented immigrant can have severe legal consequences — and to know what types of assistance are prohibited.  </p>\n\n<p><a href=\"https://nolanhillop-eds.blogspot.com/\" rel=\"noreferrer noopener\" target=\"_blank\"><em>Nolan Rappaport</em></a><em> was detailed to the House Judiciary Committee as an Executive Branch Immigration Law Expert for three years. He subsequently served as an immigration counsel for the Subcommittee on Immigration, Border Security and Claims for four years. Prior to working on the Judiciary Committee, he wrote decisions for the Board of Immigration Appeals for 20 years</em>.  </p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/opinion/immigration/5123599-enforcing-immigration-laws-crimes/",
            "pub_date": "2025-02-04 23:05:55",
            "source": "thehill",
            "language": "en"
        }
    ]
}