{
    "data": [
        {
            "id": 5127787,
            "title": "Trump invites Indian PM Modi to White House",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>President Trump has invited Indian Prime Minister Narendra Modi to the White House next week for a working visit, a White House official confirmed to The Hill. </p>\n<p>Modi will travel to Washington D.C. for a two-day visit. The invite comes just days after a recent phone call between the two leaders.</p>\n\n<p>The “productive call” touched on expanding U.S.-India cooperation on a number of global issues, which included security in the Indo-Pacific, the Middle East, and Europe. </p>\n<p>The phone call also saw Trump emphasize “the importance of India increasing its procurement of American-made security equipment and moving towards a fair bilateral trading relationship,” the White House said in a statement.</p>\n<p>“He is going to be coming to the White House, over next month, probably February. We have a very good relationship with India,” Trump told reporters aboard Air Force One in January.</p>\n<p>The confirmation of the visit follows news that a U.S. military plane with at least 100 migrants aboard landed in India on Wednesday.</p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>An Air Force C-17 plane landed at about 3:30 a.m. ET in Amritsar, India, according to the Defense Department. India previously said it would repatriate all Indians who entered the U.S. illegally. </p>\n<p>The visit also comes as Trump has increasingly threatened the BRICS countries, which includes Brazil, India, Russia, China and South Africa, with steep tariffs if they move to create a new currency that aims to rival the dollar.</p>\n\n<p>The Quad alliance, which includes the U.S., India, Australia and Japan, a bloc formed to counter Chinese clout in the Indo-Pacific, is also expected to come up in talks between the two leaders. India is set to host the Quad leaders’ summit in 2025.</p>\n<p>The Indian prime minister, who was reelected to a third term last year, but with greatly reduced power in parliament, has shared a warm relationship with Trump. Trump attended a massive rally with Modi in Houston in 2019, and <a href=\"https://thehill.com/homenews/administration/482388-trump-to-travel-to-india-in-late-february/\" rel=\"noreferrer noopener\" target=\"_blank\">visited India in February 2020</a>, where thousands of people watched the two leaders speak in Ahmedabad.</p>\n<p>Trump has previously described Modi as “fantastic” while describing India as a “very big abuser” in trade. His first term saw the Trump administration in 2019 cancel special trade privileges with India, responding India placing tariffs of its own on more than two dozen U.S. goods.</p>\n<p>Former President Biden hosted Modi for a state dinner in 2023, with more than 70 Democratic members of Congress signing a <a href=\"https://jayapal.house.gov/2023/06/20/jayapal-van-hollen-lead-bicameral-letter-with-over-70-members-urging-president-biden-to-discuss-upholding-human-rights-and-democratic-values-during-upcoming-meeting-with-indian-pm-modi/\">letter</a> urging Biden to discuss human rights and democratic values during his visit.</p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/homenews/administration/5127787-trump-invites-modi-white-house/",
            "pub_date": "2025-02-05 23:50:57",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5127880,
            "title": "Warren finds common ground with Trump over debanking concerns",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>Sen. Elizabeth Warren (D-Mass.) seems to have found common ground with President Trump and Republican lawmakers <a data-id=\"https://thehill.com/business/5102823-trump-banks-discrimination-conservatives/\" data-type=\"link\" href=\"https://thehill.com/business/5102823-trump-banks-discrimination-conservatives/\">over “debanking” concerns</a>, urging the president Tuesday to take action to prevent Americans from being improperly locked out of the financial system. </p>\n<p>The top Democrat on the Senate Banking Committee called on Trump to support the Consumer Financial Protection Bureau’s (CFPB) efforts to combat debanking — the closure of bank accounts that financial institutions consider risky, often with little or no notice.    </p>\n\n<p>“I write to request that you take action on preventing the debanking of too many Americans across the country, including consumers unfairly locked out of the financial system due to overdraft fees, religious affiliation, or political beliefs,” Warren wrote in a letter to Trump. </p>\n<p>“Your Administration can help to address this problem by supporting the ongoing efforts of the Consumer Financial Protection Bureau (CFPB), the main agency in our government working to stop unfair debanking, and directing other agencies to use their authorities to bring an end to this practice,” she added. </p>\n<p>Her call to support the CFPB comes after Trump tapped Treasury Secretary Scott Bessent to serve as acting director of the agency Monday. Bessent reportedly halted staff to halt all work, according to The Wall Street Journal. </p>\n<p>GOP lawmakers have long opposed the CFPB, which they argue has overstepped its regulatory authority.  </p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>Warren argued Tuesday that Bessent’s order to halt work at the agency “will only impede efforts to stop debanking.” She pointed to several proposed or finalized rules from the CFPB that would bar debanking based on political or religious affiliation and provide debanked customers notice and the ability to appeal account closures. </p>\n<p>The Massachusetts Democrat said her staff has identified thousands debanking-related complaints in the past three years, with more than half of those complaints lodged against four major banks — Bank of America, JPMorgan Chase, Wells Fargo and Citigroup. </p>\n\n<p>The letter marks a rare moment of alignment between the progressive senator and Trump. The president took aim at debanking, and Bank of America in particular, during a virtual appearance at the World Economic Forum in Davos, Switzerland. </p>\n<p>During an exchange with Bank of America CEO Brian Moynihan, Trump accused his bank and other financial institutions of refusing to do business with conservatives. </p>\n<p>“I hope you start opening your bank to conservatives, because many conservatives complain that the banks are not allowing them to do business within the bank, and that included a place called Bank of America,” Trump said. </p>\n<p>GOP lawmakers quickly jumped on the bandwagon, with House Oversight Committee Chair James Comer (R-Ky.) <a data-id=\"https://thehill.com/business/5105371-crypto-debanking-investigation/\" data-type=\"link\" href=\"https://thehill.com/business/5105371-crypto-debanking-investigation/\">opening an investigation</a> into debanking and Senate Banking Committee Chair Tim Scott (R-S.C.) announcing a hearing on the topic. </p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/policy/technology/5127880-trump-elizabeth-warren-debanking-concerns/",
            "pub_date": "2025-02-05 23:45:52",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5127821,
            "title": "USPS to resume accepting packages from China, Hong Kong",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>The U.S. Postal Service (USPS) announce it will resume accepting packages from China and Hong Kong, reversing course after saying it would not take in parcels following <a href=\"https://thehill.com/homenews/administration/5121102-trump-tariffs-china-canada-mexico/\">newly-imposed tariffs</a> on China. </p>\n<p>The USPS said in a <a href=\"https://about.usps.com/newsroom/service-alerts/international/suspension-of-inbound-parcels-from-china-and-hong-kong.htm\">notice</a> on Wednesday that it “will continue accepting all international inbound mail and packages from China and Hong Kong Posts.” </p>\n\n<p>The postal service added it was working “closely” with Customs and Border Protection (CBP) to “implement an efficient collection mechanism for the new China tariffs to ensure the least disruption to package delivery.” </p>\n<p>The U-turn came as USPS said on Tuesday it would pause accepting parcels from China and Hong Kong “until further notice” as the Trump administration’s tariffs against Beijing went into effect just past midnight on Tuesday. </p>\n<p>On Saturday, Trump <a href=\"https://thehill.com/homenews/administration/5121102-trump-tariffs-china-canada-mexico/\">signed tariffs</a> against Canada, Mexico and China, the three biggest U.S. trading partners. It imposed a 10 percent tariff on goods coming from China. Tariffs against Mexico and Canada, which were set to be 25 percent, were <a href=\"https://thehill.com/homenews/administration/5122864-trump-mexico-delay-tariffs/\">called off</a> after Trump spoke with leaders of both countries on Monday. </p>\n<p>Beijing responded <a href=\"https://thehill.com/homenews/administration/5124874-china-united-states-retaliatory-tariffs/\">on Tuesday, retaliating</a> with its own set of sweeping tariffs impacting critical elements, including oil, coal and natural gas. It set a 15 percent tariff on liquefied natural gas and coal along with a 10 percent one crude oil,  agricultural machinery and pickup trucks. </p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>Trump’s tariff on China included ending the “de minimis” trade loophole, which permitted shipping packages that are worth less than $800 without paying tax. China’s e-commerce companies Temu and Shein could be affected by the tariff. </p>\n<p>The number of shipments coming to the U.S. that requested the de minimis exemption went up by over 600 percent, going from around 139 million a year in 2015 to more than 1.36 billion during the fiscal year 2024, according to CBP <a href=\"https://www.cbp.gov/newsroom/national-media-release/cbp-proposes-new-rule-strengthen-enforcement-and-limit-duty\">data</a>.</p>\n\n<p>The de minimis value <a href=\"https://www.cbp.gov/newsroom/national-media-release/de-minimis-value-increases-800\">increased</a> from $200 to $800 in late 2016 with the rise of e-commerce businesses and more low-value packages entering the country.</p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/policy/international/5127821-usps-china-packages-tariffs/",
            "pub_date": "2025-02-05 23:35:55",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5127666,
            "title": "Google removes weapons development, surveillance pledges from AI ethics policy",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>Google has updated its ethical policies on artificial intelligence, eliminating a pledge to not use AI technology for weapons development and surveillance.</p>\n<p>According to a now-archived version of Google’s AI principles <a href=\"https://web.archive.org/web/20250130075626/https:/ai.google/responsibility/principles/\">seen on the Wayback Machine</a>, the section titled “Applications we will not pursue” previously included weapons and other technology aimed at injuring people, along with technologies that “gather or use information for surveillance.” </p>\n\n<p>As of Tuesday, the section was no longer listed on <a href=\"https://ai.google/responsibility/principles/\">Google’s AI principles page. </a></p>\n<p>The Hill reached out to Google for comment. </p>\n<p>In a blog post Tuesday, Google head of AI, Demis Hassabis and senior vice president for technology and society James Manyikaexplained the company’s experience and research over the years, along with guidance from other AI firms, “have deepened our understanding of AI’s potential and risks.”</p>\n<p>“Since we first published our AI principles in 2018, the technology has evolved rapidly,” Manyika and Hassabis wrote, adding, “It has moved from a niche research topic in the lab to a technology that is becoming as pervasive as mobile phones and the internet itself; one with numerous beneficial uses for society and people around the world, supported by a vibrant AI ecosystem of developers.”</p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>Google said in the blog post that it will continue to “stay consistent with widely accepted principles of international law and human rights,” and evaluate whether the benefits “substantially outweigh potential risks.” </p>\n<p>The new policy language also pledged to identity andassesst AI risks through research, expert opinion and “red teaming,” during which a company tests its cybersecurity effectiveness by conducting a simulated attack.</p>\n\n<p>The AI race has ramped among domestic and international companies in recent years as Google and other leading tech firms increase their investments into the emerging technology. </p>\n<p>As Washington increasingly embraces the use of AI, some policymakers have expressed concerns the technology could be used for harm when in the hands of bad actors. </p>\n<p>The federal government is still trying to harness the benefits of its use, even in the military. </p>\n<p>The Defense Department announced late last year a new office focused on accelerating and adopting AI technology for the military to deploy autonomous weapons in the near future. </p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/policy/technology/5127666-google-ai-ethical-rules-updated/",
            "pub_date": "2025-02-05 23:35:53",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5127659,
            "title": "Watch live: House Democrats give remarks as shutdown clock begins",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>House Democratic leaders will hold a press conference Wednesday morning as their GOP colleagues <a data-id=\"https://thehill.com/homenews/house/5127330-house-republicans-trump-agenda-scramble/\" data-type=\"link\" href=\"https://thehill.com/homenews/house/5127330-house-republicans-trump-agenda-scramble/\">grapple with internal divisions</a> ahead of <a data-id=\"https://thehill.com/business/budget/5126799-shutdown-fears-trump-moves-democrats/\" data-type=\"link\" href=\"https://thehill.com/business/budget/5126799-shutdown-fears-trump-moves-democrats/\">another looming shutdown</a>.</p>\n<p>House Minority Leader Hakeem Jeffries (D-N.Y.) has <a data-id=\"https://thehill.com/homenews/house/5123216-jeffries-government-shutdown-trump-orders/\" data-type=\"link\" href=\"https://thehill.com/homenews/house/5123216-jeffries-government-shutdown-trump-orders/\">vowed to use the budget fight</a> as a vehicle to block some of President Trump’s efforts to <a data-id=\"https://thehill.com/policy/healthcare/5118716-trump-administration-funding-freeze-public-health/\" data-type=\"link\" href=\"https://thehill.com/policy/healthcare/5118716-trump-administration-funding-freeze-public-health/\">gut federal programs</a> and <a data-id=\"https://thehill.com/business/5126025-republicans-congressional-budget-tax-bill/\" data-type=\"link\" href=\"https://thehill.com/business/5126025-republicans-congressional-budget-tax-bill/\">issue tax cuts</a>. The move likely raises the chance of a shutdown, with government funding set to lapse on March 14.</p>\n<p>The press conference will be led by House Democratic Caucus Chair Pete Aguilar (D-Calif.) and Vice Chair Ted Lieu (D-Calif.). </p>\n<p>Their remarks are scheduled to begin at 11 a.m. EST.</p>\n<p>Watch the live video above.</p>\n<script type=\"text/javascript\">window.NREUM||(NREUM={});NREUM.info={\"beacon\":\"bam.nr-data.net\",\"licenseKey\":\"bb199f70cb\",\"applicationID\":\"738543775\",\"transactionName\":\"MQNTMhdXDxECABBZDAhJchMWQg4PTBMLQxdIFl4VEQ==\",\"queueTime\":0,\"applicationTime\":4497,\"atts\":\"HURERF9NHE5BAkYKGBsb\",\"errorBeacon\":\"bam.nr-data.net\",\"agent\":\"\"}</script>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/homenews/5127659-watch-live-house-democrats-shutdown-looming/",
            "pub_date": "2025-02-05 23:31:10",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5125279,
            "title": "A bold, bipartisan strategy to secure Greenland’s future ",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>When President Trump <a href=\"https://www.npr.org/2025/01/26/nx-s1-5275375/trump-greenland-canada-israel-gaza\" rel=\"noreferrer noopener\" target=\"_blank\">again</a> proposed buying Greenland, the world laughed. But beneath the headlines was a spot-on strategic instinct. Greenland is a rapidly rising geopolitical heavyweight the U.S. cannot afford to ignore.  </p>\n<p>As Russia expands its Arctic military footprint and China pours billions into securing long-term access to the Arctic region, Greenland is steadily moving toward independence. The real question isn’t whether the U.S. should engage, but how — and whether we will act before Beijing or Moscow fills the void. </p>\n\n<p>To secure U.S. leadership in the Arctic, Congress must move beyond symbolic gestures and adopt a bold, bipartisan strategy that deepens U.S.-Greenland ties, strengthens Arctic security, and lays the groundwork for Greenland’s eventual NATO membership.  </p>\n<p>Russia and China aren’t waiting around in the Arctic, and neither should the U.S. Moscow is <a href=\"https://www.reuters.com/graphics/ARCTIC-SECURITY/zgvobmblrpd/\" rel=\"noreferrer noopener\" target=\"_blank\">ramping up its military presence</a> with new bases, nuclear-capable missiles and its most capable naval fleet. At the same time, Beijing is <a href=\"https://media.defense.gov/2021/Jan/05/2002560338/-1/-1/0/ARCTIC%20BLUEPRINT%202021%20FINAL.PDF/ARCTIC%20BLUEPRINT%202021%20FINAL.PDF\" rel=\"noreferrer noopener\" target=\"_blank\">building more nuclear-powered icebreakers</a>, pouring billions into <a href=\"https://www.npr.org/2024/08/02/nx-s1-5052089/pentagon-sounds-alarm-over-russia-china-cooperation-in-the-arctic\" rel=\"noreferrer noopener\" target=\"_blank\">dual-use Arctic research and infrastructure</a> and sailing its Navy further north.  </p>\n<p>Right in the middle of it all is Greenland — a resource-rich island with enormous strategic value to the U.S. and NATO.  </p>\n<p>To bolster defense, lawmakers should direct the Department of Defense to assess the feasibility of forward-basing elements of a <a href=\"https://seapowermagazine.org/admiral-cool-to-notion-of-separate-arctic-fleet/?print=print\" rel=\"noreferrer noopener\" target=\"_blank\">U.S. Arctic Fleet</a> in Greenland, incorporating this review into the 2026 National Defense Authorization Act. Washington should also work with Copenhagen and Nuuk to invest in joint military infrastructure, including port expansions and improved airstrips, to support NATO operations in the High North.</p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>To improve intelligence-sharing, Congress should fund the establishment of a NATO Arctic Intelligence Fusion Center in Nuuk, modeled after <a href=\"https://web.ifc.bices.org/\" rel=\"noreferrer noopener\" target=\"_blank\">similar initiatives</a> in Eastern Europe. This would provide real-time surveillance of Russian and Chinese activity, giving the U.S. and its allies better situational awareness in an increasingly navigable and contested Arctic region. </p>\n<p>Meanwhile, Greenland’s independence efforts will require a roadmap for transitioning from Danish military protection to self-defense. Congress should direct the Defense Department to develop a plan that helps Greenland build its own defense capabilities — ensuring it can secure its borders and contribute to regional stability. </p>\n\n<p>Greenland isn’t just an Arctic stronghold — it’s sitting on a <a href=\"https://apnews.com/article/greenland-trump-climate-change-minerals-trade-bab5bb60ba52f6073f056fb271c43215\" rel=\"noreferrer noopener\" target=\"_blank\">goldmine of rare earth elements</a>, crucial for U.S. defense systems, semiconductors, and renewable energy technology. With China controlling more than 70 percent of global rare earth production, the U.S. needs an alternative supply chain before it’s too late. </p>\n<p>Congress should introduce the U.S.-Greenland Rare Earth Security Act<em>,</em> which would offer tax incentives and loan guarantees for U.S. companies investing in Greenland’s mining sector. Expanding the <a href=\"https://crsreports.congress.gov/product/pdf/R/R43767\" rel=\"noreferrer noopener\" target=\"_blank\">Defense Production Act </a>to prioritize Greenland as a strategic supplier of critical minerals would further reduce America’s reliance on Beijing. </p>\n<p>A U.S.-Greenland Strategic Minerals Partnership could streamline regulatory cooperation, fast-track mining projects and promote environmentally responsible extraction — ensuring Greenland benefits economically while reinforcing U.S. supply chain security. This is a win-win: Greenland gains independence from Danish subsidies, and the U.S. secures a reliable source of rare earth elements. </p>\n<div class=\"civic-science-article-container civic-science-more-14 civic-is-mr3\" data-civicscience-widget=\"3f127ebd-287e-0b64-a901-d55ec286348a\" id=\"civsci-id-civsci-id-596708068\"></div>\n<p>Greenland is moving <a href=\"https://www.politico.eu/article/greenland-prime-minister-mute-egede-independence-denmark-colonialism-donald-trump-arctic/\" rel=\"noreferrer noopener\" target=\"_blank\">toward independence</a>, but it doesn’t want to be absorbed by another country. Instead, it wants strategic partnerships that allow it to stand <a href=\"https://www.politico.eu/article/greenland-poll-mute-egede-donald-trump-takeover-united-states/\" rel=\"noreferrer noopener\" target=\"_blank\">on its own</a>. That’s where a compact of free association comes in.</p>\n<p>Modeled after U.S. agreements with Pacific nations like Palau and the Marshall Islands, <a href=\"https://nationalinterest.org/feature/its-time-us-greenland-free-association-agreement-213327/\" rel=\"noreferrer noopener\" target=\"_blank\">a compact of free association with Greenland </a>would formalize military, economic and diplomatic ties without compromising Greenland’s sovereignty. Congress should request a State, Interior, and Defense Department feasibility study to assess the benefits of such a compact, laying the groundwork for introducing the U.S.-Greenland COFA Authorization Act<em> </em>to begin formal negotiations. </p>\n<p>To ensure Greenland’s transition to independence is successful, Congress should also create a Greenland Independence Transition Fund, which would provide targeted investments in governance, infrastructure and workforce development — helping Greenland reduce reliance on Danish subsidies while preparing for NATO integration. </p>\n\n<p>The U.S. can’t just treat Greenland as a security asset — it needs to invest in Greenland’s economic future. Congress should support expanding the U.S. consulate in Nuuk, increasing diplomatic staff focused on trade, education, and Arctic governance. Launching a U.S.-Greenland Business Council and U.S.-Greenland Arctic Innovation Fund would encourage American companies to invest in Greenland’s renewable energy, fisheries, and infrastructure projects.  </p>\n<p><a href=\"https://link.springer.com/chapter/10.1007/978-3-031-26051-3_10\" rel=\"noreferrer noopener\" target=\"_blank\">Investing in education</a> and workforce development will also be critical. Congress should establish a U.S.-Greenland Education Exchange Initiative <em>— </em>modeled after the <a href=\"https://us.fulbrightonline.org/\" rel=\"noreferrer noopener\" target=\"_blank\">Fulbright Program</a><em> — </em>STEM<em> </em>scholarships, teacher training partnerships and vocational programs in critical industries like mining and energy.  </p>\n<p>Congress has an opportunity to lead now. Holding House Foreign Affairs Committee hearings on Greenland’s strategic role, introducing the U.S.-Greenland COFA Authorization Act, and organizing a congressional delegation to Greenland should be immediate priorities in 2025. </p>\n\n<p>This bold, bipartisan strategy ensures that as Greenland moves toward independence, it does so as a committed U.S. ally — aligned with Western values and fully integrated into NATO. The window of opportunity is closing, and America must lead now. </p>\n<p><em>Walter Berbrick is a senior military analyst with Netsimco, a Saalex Company. He is the former founding director of the Arctic Studies Group and Newport Arctic Scholars Initiative at the U.S. Naval War College. He served in senior Arctic policy roles at the State Department and Pentagon and is the co-author of the “Newport Manual on Arctic Security.” </em></p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/opinion/international/5125279-greenland-strategic-geopolitical-power/",
            "pub_date": "2025-02-05 23:31:05",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5127802,
            "title": "Canadian lawmaker on Trump tariff delay: ‘He choked’",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>Canadian Member of Parliament Charlie Angus said President Trump “choked” as his tariff plan for Canada was <a href=\"https://thehill.com/homenews/administration/5124026-trump-trudeau-canada-tariff-delay/\">ultimately delayed</a> before going into action.</p>\n<p>“He blinked,” Angus told MediasTouch, <a href=\"https://www.huffpost.com/entry/charlie-angus-trump_n_67a32b28e4b05f0a510c0c61\">highlighted by HuffPost</a>. “He choked.”</p>\n\n<p>Just days after Trump signed an executive order that imposed a 25 percent tariff on Canada, he reached an agreement with Prime Minister Justin Trudeau to hold the tariffs for a month.</p>\n<p>Trump said Canada agreed to secure the northern border through a $1.3 billion plan and combat the flow of fentanyl into the U.S.</p>\n<p>Angus has been <a href=\"https://thehill.com/policy/international/5124695-canadian-lawmaker-rips-trump-for-51st-state-comments-the-mans-a-liar/\">an outspoken critic</a> of Trump’s tariff plan, as well as his remarks on incorporating the Canadian people into the U.S. by making the country America’s 51st state.</p>\n<p>Angus noted the Canadian people are much more united than American citizens currently and the country is ready to go “pound for pound” with the U.S. if Trump plunges the countries into a trade war.</p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>While speaking <a href=\"https://www.youtube.com/watch?v=yUHayD3Z4nQ\">with the outlet</a>, Angus said Canadians are already taking steps to show Trump the impact of not buying American products or stopping exports to the U.S.</p>\n<p>He rallied Canadian allies as Trump continues to say he wants to gain control of the Panama Canal and Greenland, and said they need to stand united.</p>\n\n<p>“We know it’s going to hurt, but I’m telling my friends in Buffalo, I’m telling my friends in Kentucky, I’m telling my friends in Michigan that, get ready, because the pain is coming your way, too,” Anus said. “Because we will fight back. Punch for punch, pound for pound, dollar for dollar, because it’s about our freedom as a nation.”</p>\n<p>After Trump and Trudeau struck the agreement, Angus argued it happened because the president was already seeing the impacts from Canadians.</p>\n<p>“We’re nice people, but you have really, seriously poked the polar bear,” he said. “So, Donald, come back at us a second time. It’s gonna hurt even more.”</p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/policy/international/5127802-canada-trump-tariffs-delay/",
            "pub_date": "2025-02-05 23:26:01",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5127815,
            "title": "Trump, Project 2025 protests planned in multiple cities",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>Protests against President Trump, Project 2025 and other issues have been planned in multiple cities for Wednesday.</p>\n<p>“We the people reject the agenda proposed by the Heritage Foundation in its publication of Project 2025. Its rhetoric intends to divide, isolate, and alienate our society, as well as dismantle the foundational liberties of our country by attacking our institutions,” reads a <a href=\"https://50protests.com/?fbclid=PAZXh0bgNhZW0CMTEAAabfBTR3w___J_ciV-1-kbrjkDuHvHVzTV03uTh8fSFP1gd2htEunoEDrZg_aem_JouoHs7b7WMYQyfZ4b03_g\">website stating there</a> will be “50 Marches on 2/5/25 to defend liberty, equality, and justice.”</p>\n\n<p>“The authors directly assaulted our individual liberties, targeting citizens by race, gender, sexual orientation, economic status, national origin, or by any means they choose,” the website continues. “The policies proposed undermine systemic freedoms such as free education, free speech, labor and employment protections, and affordable healthcare.”</p>\n<p>An Instagram <a href=\"https://www.instagram.com/50501movement?igsh=MXgyaDV4bjR5eWdjeQ%3D%3D&amp;utm_source=qr\">account</a> features <a href=\"https://www.instagram.com/p/DFq23DzP51K/\">posts saying</a> there will be protests in places including <a href=\"https://www.instagram.com/p/DFgSkTQvv21/\">Vermont</a>, Virginia, <a href=\"https://www.instagram.com/p/DFqoBHsvkcV/\">Oklahoma</a> <a href=\"https://www.instagram.com/p/DFbk1vtvDnh/\">and Georgia</a>.</p>\n<p>Project 2025 is <a href=\"https://thehill.com/homenews/campaign/4753684-heritage-foundation-project-2025/\">a 900-page</a> “governing agenda” from The Heritage Foundation, a conservative think tank. It describes conservative aims in the event that Republicans captured the White House in November 2024. Trump <a href=\"https://thehill.com/homenews/campaign/4765917-trump-denies-link-project-2025/\" rel=\"noreferrer noopener\" target=\"_blank\">has previously tried to distance</a> himself from it, saying in July he isn’t aware of anything “about Project 2025.”</p>\n<p>“I have not seen it, have no idea who is in charge of it, and, unlike our very well received Republican Platform, had nothing to do with it,” Trump said in <a href=\"https://thehill.com/homenews/campaign/4841340-donald-trump-campaign-project-2025/\">a previous post on</a> Truth Social.</p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>CNN also <a href=\"https://www.cnn.com/2024/07/11/politics/trump-allies-project-2025/index.html\">reported in July that it</a> found a minimum of 140 people who had been part of the first Trump administration being involved in Project 2025.</p>\n<p>Russell Vought, President Trump’s pick to lead the Office of Management and Budget (OMB), has been criticized for contributing to Project 2025, which has aligned with the president’s <a href=\"https://thehill.com/homenews/senate/5125936-susan-collins-russell-vought-omb/\">actions to halt and evaluate</a> spending amid his first two and a half weeks back in office.</p>\n\n<p>The Hill has reached out to the White House and The Heritage Foundation for comment.</p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/homenews/administration/5127815-trump-project-2025-protests-planned-in-multiple-cities/",
            "pub_date": "2025-02-05 23:25:59",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5127713,
            "title": "Steve Doocy on Trump Gaza takeover plan: ‘He knows the United States can’t invade another country’",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>Fox News host Steve Doocy cast doubt on President Trump’s comments <a data-id=\"https://thehill.com/policy/international/5127021-trump-us-takeover-gaza/\" data-type=\"link\" href=\"https://thehill.com/policy/international/5127021-trump-us-takeover-gaza/\">suggesting the U.S. take over Gaza</a>, a strip of land in the Middle East that has been plagued by war between Israel and Hamas for months.</p>\n<p>“I think this is just the tip … you know, this is the conversation starter because, obviously, the president knows when he says ‘we’ll take Gaza,’ He knows the United States can’t invade another country,” Doocy said Wednesday on “Fox &amp; Friends.” </p>\n\n<p>“The last thing he wants to do is put boots on the ground in Gaza. I mean, you know, he is always … in his first term, he was talking about he would like to get out of every war in the Middle East,” he added in comments <a data-id=\"https://www.mediaite.com/tv/the-united-states-cant-invade-another-country-steve-doocy-pours-cold-water-on-trumps-gaza-take-over-plan/\" data-type=\"link\" href=\"https://www.mediaite.com/tv/the-united-states-cant-invade-another-country-steve-doocy-pours-cold-water-on-trumps-gaza-take-over-plan/\">first highlighted by Mediate. </a></p>\n<p>Trump during a <a data-id=\"https://thehill.com/policy/international/5127164-trump-netanyahu-joint-presser/\" data-type=\"link\" href=\"https://thehill.com/policy/international/5127164-trump-netanyahu-joint-presser/\">joint press conference</a> Tuesday alongside Israeli Prime Minister Benjamin Netanyahu said of Gaza: “I think you’ll make that into an international, unbelievable place… I don’t want to be cute, I don’t want to be a wise guy, but the Riviera of the Middle East… this could be so magnificent.”</p>\n<p>“The U.S. will take over the Gaza Strip, and we will do a job — whether we’ll own it and be responsible for dismantling all of the dangerous unexploded bombs and other weapons on the site, level the site, and get rid of the destroyed buildings, level it out,” the president added.</p>\n<p>His comments sparked nearly instant backlash and condemnation <a data-id=\"https://thehill.com/policy/international/5127510-donald-trump-gaza-takeover-allies-adversaries-react/\" data-type=\"link\" href=\"https://thehill.com/policy/international/5127510-donald-trump-gaza-takeover-allies-adversaries-react/\">from the international community</a> and <a data-id=\"https://thehill.com/policy/international/5127616-gaza-donald-trump-democrats-ethnic-cleansing/\" data-type=\"link\" href=\"https://thehill.com/policy/international/5127616-gaza-donald-trump-democrats-ethnic-cleansing/\">Democratic lawmakers</a> alike.</p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>Doocy said he “was going to give Trump the benefit of the doubt” and floated the idea that Trump’s comment could have been “the first step in a negotiation.” </p>\n<p>“I think this was his opening salvo, first idea,” the cable news host said. “A lot of people saying you can’t do it. But maybe they could add to it and come up with something because the way it’s working is not working.”</p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/homenews/media/5127713-steve-doocy-donald-trump-gaza-takeover-reaction/",
            "pub_date": "2025-02-05 23:05:55",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5126586,
            "title": "Celebrities rail against Trump’s policies — but hesitate to say his name",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>After years of launching blistering attacks on President Trump, much of Hollywood appears to be casting him in a new “Harry Potter”-inspired role: He Who Must Not Be Named.</p>\n<p>Rather than blast Trump by name, many of his celebrity critics are instead zipping their lips when it comes to mentioning the 47th president.</p>\n\n<p><a href=\"https://thehill.com/blogs/in-the-know/5122358-lady-gaga-defends-transgender-community-during-grammys-acceptance-speech-trans-people-are-not-invisible/\" rel=\"noreferrer noopener\" target=\"_blank\">From Lady Gaga</a> <a href=\"https://thehill.com/blogs/in-the-know/5122573-alicia-keys-diversity-grammy-award/\" rel=\"noreferrer noopener\" target=\"_blank\">to Alicia Keys</a> <a href=\"https://thehill.com/blogs/in-the-know/5122326-shakira-dedicates-grammy-to-immigrants-you-are-loved/\" rel=\"noreferrer noopener\" target=\"_blank\">and Shakira</a>, plenty of stars took to the stage at Sunday’s Grammy Awards in Los Angeles to speak out about hot-button issues, including transgender rights, immigration and anti-diversity, equity and inclusion (DEI) efforts. But none of the music artists name-checked Trump while railing against some of his administration’s core focuses.</p>\n<p>Even Grammys host Trevor Noah <a href=\"https://thehill.com/blogs/in-the-know/5122250-trevor-noah-talks-tariffs-at-grammys-maple-syrup-is-about-to-be-50/\" rel=\"noreferrer noopener\" target=\"_blank\">offered up</a> a Trump-related punchline, minus actually speaking the president’s name.</p>\n<p>“Yesterday, Beyoncé announced her new tour,” Noah said on the CBS broadcast. “I will say though, Beyoncé, there’s tariffs. We can’t afford a new tour. Maple syrup is about to be $50,” Noah said, referring to tariffs on Canada, Mexico and China that had been threatened by Trump.</p>\n<p>“Everybody’s sort of radio silent in terms of mentioning Trump’s name,” noted Mark Harvey, an associate professor and the director of graduate business programs at the University of Saint Mary.</p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>The approach from many in the entertainment world just weeks into Trump’s second term is in stark contrast to Hollywood’s reaction to the commander in chief following his White House win in 2016. A day after Trump’s 2017 inauguration, a who’s who of Hollywood — including Madonna, Scarlett Johansson and America Ferrera — <a href=\"https://thehill.com/homenews/315466-womens-march-takes-over-dc/\" rel=\"noreferrer noopener\" target=\"_blank\">joined protesters</a> and denounced the new president at the Women’s March on Washington and in other U.S. cities.</p>\n<p>“There’s a night and day difference” between then and now, said Harvey.</p>\n\n<p>The first Trump era was marked by celebs making headlines as they assailed Trump on a regular basis. In 2016, singer <a href=\"https://thehill.com/blogs/blog-briefing-room/news/292448-cher-blasts-trump-i-just-wish-hed-fall-off-the-face-of-the/\" rel=\"noreferrer noopener\" target=\"_blank\">Cher dubbed</a> Trump a “f‑‑‑ing idiot,” saying she wished the then-GOP presidential nominee would “fall off the face of the Earth.” Comedian Kathy Griffin <a href=\"https://thehill.com/homenews/media/335660-kathy-griffin-beheads-trump-in-gory-photo/\" rel=\"noreferrer noopener\" target=\"_blank\">posed for</a> a controversial photo in 2017 with a bloodied, decapitated fake head meant to resemble the president. Robert De Niro received a standing ovation from the audience at the Tony Awards in 2018 after repeatedly declaring “f‑‑‑ Trump” onstage. </p>\n<p>But in interviews since his November reelection, performers have kept Trump’s name out of the conversation.</p>\n<p>“The main thing is I have so much compassion and love for so many people that are afraid today,” Lady Gaga said in <a href=\"https://thehill.com/blogs/in-the-know/5110928-lady-gaga-mayhem-trump-lgbtq/\" rel=\"noreferrer noopener\" target=\"_blank\">an interview</a> with Elle UK conducted just days after Trump’s win, which the “Born This Way” singer said she “prayed” wouldn’t happen.</p>\n<div class=\"civic-science-article-container civic-science-less-14 civic-is-mr3\" data-civicscience-widget=\"3f127ebd-287e-0b64-a901-d55ec286348a\" id=\"civsci-id-civsci-id-596708068\"></div>\n<p>Eva Longoria similarly <a href=\"https://thehill.com/blogs/in-the-know/4990187-eva-longoria-trump-america-dystopian-us/\" rel=\"noreferrer noopener\" target=\"_blank\">didn’t utter</a> Trump’s name while expressing dissatisfaction with him winning the 2024 race against then-Vice President Harris in a November interview with Marie Claire, saying, “The shocking part is not that he won.”</p>\n<p>“It’s that a convicted criminal who spews so much hate could hold the highest office,” said the former “Desperate Housewives” star, <a href=\"https://thehill.com/blogs/in-the-know/4788601-hollywood-kamala-harris-biden-trump-clooney-longoria-streisand/\" rel=\"noreferrer noopener\" target=\"_blank\">who campaigned</a> for Harris and spoke at the Democratic National Convention.</p>\n<p>These days, said Harvey, Hollywood seems to be reflecting an attitude of “we’ve been here before, we’ve seen this before.”</p>\n\n<p>“What we did last time wasn’t having an impact, so maybe we should do things differently now,” Harvey, the author of “Celebrity Influence: Politics, Persuasion and Issue-Based Advocacy,” said of what Trump’s bevy of star-studded critics could be thinking.</p>\n<p>Many famous faces, Harvey said, likely find themselves in a similar predicament right now as the Democratic Party itself. </p>\n<p>“If you compare 2016 to now — the slightest thing, every executive order, everything — had an outraged response. You could argue this was a justifiable outrage, but it also didn’t matter,” Harvey said.</p>\n\n<p>“[Celebrities] spoke out, and they felt probably by now that some of that was ineffective. I think they’re being more choosy about their outrage or how they’re going about this. This is going to have to be less about Donald Trump, and more about the issues.”</p>\n<p>It’s a reset that, knowingly or not, echoes a change in messaging that <a href=\"https://thehill.com/homenews/campaign/343559-new-dem-message-doesnt-mention-trump/\" rel=\"noreferrer noopener\" target=\"_blank\">Democrats adopted</a> as part of their 2018 agenda ahead of the midterm elections. In messaging documents released in 2017, Trump’s name was not mentioned a single time. </p>\n<p>“People need to know not only what we’re fighting against,” Sen. Chris Van Hollen (D-Md.) said at the time. “They need to know what we’re fighting for.”</p>\n\n<p>Some big names have been open about utilizing a Lord Voldemort-like approach to Trump’s name. In J.K. Rowling’s famed “Harry Potter” series, the villain is rarely referred to by his name by the other characters out of fear and worry of retribution. </p>\n<p>“I think it might be irresponsible to give him attention,” Stephen Colbert <a href=\"https://thehill.com/blogs/in-the-know/in-the-know/547700-colbert-theres-no-avoiding-trump-but-i-dont-like-saying-his/\" rel=\"noreferrer noopener\" target=\"_blank\">said of Trump</a> in 2021. </p>\n<p>While “there’s no avoiding him as a subject,” the “Late Show” host said of the then-ex-president, “He shouldn’t be [an] essential subject because I think that merely empowers him in some way. That’s why I don’t like saying his name, or showing his picture, if possible.”</p>\n\n<p>Colbert made an appeal to his show’s viewers to submit alternative name suggestions for Trump on social media using the hashtag #HeWhoShallBeNamed. The late-night host <a href=\"https://thehill.com/blogs/in-the-know/4254422-colbert-writers-strike-saying-trumps-name-again/\" rel=\"noreferrer noopener\" target=\"_blank\">began saying</a> “Trump” again on his CBS program in 2023. </p>\n<p>“The View” co-host Whoopi Goldberg <a href=\"https://thehill.com/blogs/in-the-know/372243-whoopi-goldberg-i-cant-even-say-trumps-name/\" rel=\"noreferrer noopener\" target=\"_blank\">also adopted</a> a personal “don’t speak his name” Trump policy on the ABC daytime talk show. </p>\n<p>“He’s the president. I’m still not going to say his name. That’s not going to change,” <a href=\"https://variety.com/2024/tv/news/the-view-whoopi-goldberg-refuses-trump-name-election-win-1236202564/\" rel=\"noreferrer noopener\" target=\"_blank\">Goldberg told</a> viewers a day after the 2024 presidential election.</p>\n\n<p>Harvey noted that there are only certain circumstances in which celebrities can exert political influence. While they may fill up movie theaters and concert halls, superstars “are not good at convincing people on issues that are highly polemic.”</p>\n<p>“Celebrities can’t get people to give up their guns. Celebrities can’t get people to change their mind on abortion,” Harvey said. “Do you think they’re going to change anybody’s mind on Donald Trump? Probably not.”</p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/blogs/in-the-know/5126586-hollywood-celebrities-trump-voldemort/",
            "pub_date": "2025-02-05 23:01:21",
            "source": "thehill",
            "language": "en"
        }
    ]
}