{
    "data": [
        {
            "id": 5760719,
            "title": "Protests opposing the US-led strikes in Iran planned in multiple cities",
            "description": "<p>A coalition of organizations on Saturday have planned protests opposing the U.S. and Israeli <a href=\"https://thehill.com/policy/international/5760207-trump-urges-iran-regime-change/\">strikes on Iran</a> earlier in the day, with demonstrations planned across multiple cities.</p>\n<p>“Trump’s unprovoked, illegal attack on Iran is an act of war that threatens to cause unthinkable death and destruction. But the people of this country reject another endless war and will take to the streets now and make our voices heard,” stated <a href=\"https://www.answercoalition.org/iran\">Action Coalition</a>.</p>\n<p>The coalition listed several emergency protests scheduled earlier in the day and into Saturday afternoon across several cities. These cities include Atlanta, Baltimore, Boston, Chicago, Cincinnati, Denver, Las Vegas, Los Angeles, Miami, Minneapolis, New York City and more. </p>\n<p>Six more protests will be held on Sunday in Albany, N.Y.; Ellensburg, Va.; Chattanooga, Tenn.; Decorah, Iowa; Gainesville, Fla.; and Springfield, Mo.</p>\n<p>The coalition said Iran was engaged in diplomatic negotiations with the U.S. “up to the very last moment.”</p>\n<p>“Trump promised to bring peace to the world while he was running for office, but he has done nothing but left a trail of devastation the world over,” the coalition added. “Rather than making executives at oil companies and weapons manufacturers richer, our tax dollars should be used to meet people’s needs.”</p>\n<p>The coalition is made up of other organizations like the Palestinian Youth Movement, the Democratic Socialists of America, Code Pink and The People’s Forum, among other activist groups. </p>\n<p>Trump said in a video <a href=\"https://truthsocial.com/@realDonaldTrump/116147082884192486\">posted to Truth Social</a> at 2:30 a.m. EST that the U.S. “began major combat operations in Iran.”</p>\n<p>“Our objective is to defend the American people by eliminating imminent threats from the Iranian regime, a vicous group of very hard, terrible people,” he added.</p>\n<p>Trump urged the Iranian people to reclaim their government from the regime that has controlled Iran since 1979. </p>\n<p>Iran struck back, launching missiles and drones toward Israel and across other countries allied with the U.S. The Israeli Defense Forces (IDF) confirmed the retaliatory attack and <a href=\"https://x.com/IDF/status/2027662583344296185\">wrote</a> on the social platform X that Israel “has a right to defend itself.”</p>\n<p>Iran’s Supreme Leader Ayatollah <a href=\"https://thehill.com/people/ali-khamenei/\">Ali Khamenei </a>was reportedly moved to a secure location as the attacks unfolded, according to <a href=\"https://www.independent.co.uk/bulletin/news/ayatollah-ali-khamenei-alive-iran-supreme-leader-us-attack-b2929525.html\">multiple reports</a>.</p>\n<p>Iranian Foreign Minister Abbas Araghchi said Tehran is weighing its options following Saturday’s attack. When asked if he was a target, Araghchi said he did not know, adding that the U.S. and Israel “targeted everybody.” He cited one strike that killed 57 at a girls elementary school in southern Iran, upping a previous death toll of 40, according to Iranian state media.</p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/state-watch/5760719-protests-us-iran-strikes/",
            "pub_date": "2026-03-01 04:26:42",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5760747,
            "title": "Five takeaways as Trump wages war on Iran",
            "description": "<p>The United States and Israel <a href=\"https://thehill.com/policy/defense/5760058-us-israel-launch-strikes-on-iran/\" rel=\"noreferrer noopener\" target=\"_blank\">launched waves of strikes</a> Saturday morning against Iran after weeks of tensions between Washington and Tehran. </p>\n<p>Iran swiftly retaliated, firing drones and ballistic missiles at Israel, along with attacking targets in Gulf countries, including Saudi Arabia, Qatar, the United Arab Emirates and Bahrain. </p>\n<p>The joint mission, dubbed “Operation Epic Fury,” began shortly after midnight Saturday with strikes aimed at destroying Iran’s regime security apparatus and focusing on locations that posed an “imminent threat,” the U.S. Central Command (Centcom) said. </p>\n<p>For weeks, President Trump has weighed authorizing strikes against Iran and on Friday <a href=\"https://thehill.com/homenews/administration/5759142-trump-iran-strike-decision/\">said he was unhappy</a> with the way nuclear talks with Iranian officials were unfolding. </p>\n<p>Iran’s foreign minister said on Saturday morning that the regime “may have lost one of two commanders,” but that other high-ranking officials, including Supreme Leader Ayatollah Ali Khameini, survived “as far as I know.” </p>\n<p>Here are the five takeaways: </p>\n<h2 class=\"wp-block-heading\"><strong>US, Israel target key government buildings and military assets</strong></h2>\n<p>The U.S. and Israel began the large-scale operation at 1:15 a.m. ET, targeting the Islamic Revolutionary Guard Corps (IRGC) command and control facilities, ballistic missile and drone launch sites, military airfields and Iranian air defense systems.</p>\n<p>The Israeli Air Force conducted the largest military flyover in the Israeli Defense Forces’ (IDF) history, with over 200 jets striking Iran’s missile sites and the IRGC’s air defense systems in western and central Iran, the IDF <a href=\"https://x.com/IDF/status/2027817570498142532\" rel=\"noreferrer noopener\" target=\"_blank\">said</a> on Saturday. </p>\n<p>The joint mission killed more than 200 people in Iran and injured nearly 750, Iran’s Red Crescent said to Iranian state TV, adding that the strikes hit 24 out of the 31 provinces. </p>\n<p>One of the sites the Israeli Air Force targeted was a launching site of surface-to-surface missiles in Tabriz. The IDF said its forces hit more than 500 targets, including Iranian missile launchers and aerial defense systems.  </p>\n<p>Thick, black smoke could be seen from a burning ship in Iran’s Kanarak naval base, according to satellite <a href=\"https://vantor.mediavalet.com/galleries/5b04a751-cff4-4564-ab61-839ab05944fd_39bb95db-f7b4-417a-9ff5-70e22ff2227e-ExternalUser/9ae0916c-6e7c-4b9a-9a98-ba4a6ec64ffd\" rel=\"noreferrer noopener\" target=\"_blank\">imagery</a> provided by Vantor. Drones were dispersed and the runway was blocked at the Konarak drone strip. </p>\n<p>The U.S. military fired munitions from air, land and sea assets in the region, according the Centcom, which added that its Task Force Scorpion Strike used its low-cost, one-way attack drones for the first time in combat. </p>\n<p>Centcom said it was looking into reports that strikes hit a girls’ school in southern Iran, which Iranian officials said killed more than 80 students. </p>\n<p>“The protection of civilians is of utmost importance, and we will continue to take all precautions available to minimize the risk of unintended harm,” Capt. Tim Hawkins, the Centcom spokesperson, said in a statement. </p>\n<p>The U.S. military successfully defended against hundreds of Iranian drone and missile attacks and there were no reports of U.S. service member casualties or related injuries, according to Centcom. </p>\n<p>The command added that the damage to U.S. installations was “minimal and has not impacted operations.” </p>\n<p>“Operation Epic Fury involves the largest regional concentration of American military firepower in a generation,” Centcom said in a <a href=\"https://x.com/CENTCOM/status/2027808045946835050\" rel=\"noreferrer noopener\" target=\"_blank\">statement</a>. </p>\n<h2 class=\"wp-block-heading\"><strong>Iran strikes back at US bases across Middle East, spurring threats of retaliation</strong></h2>\n<p>Iran quickly pulled Gulf states off the sidelines on Saturday with <a href=\"https://thehill.com/policy/international/5760555-gulf-unity-pushing-back-iran/\" rel=\"noreferrer noopener\" target=\"_blank\">drone and missile strikes on U.S. bases</a> in Saudi Arabia, Qatar, the United Arab Emirates, Bahrain and Kuwait — as well as a barrage of attacks on Israel. </p>\n<p>Saudi Arabia announced it would aid countries in repelling Iranian attacks. </p>\n<p>“Saudi Ministry of Foreign Affairs affirmed the Kingdom’s full solidarity with the countries concerned and its firm support for them, stating that it would mobilize all its capabilities to assist them in any measures they undertake,” the ministry said in a statement. </p>\n<p>The UAE, in a statement, emphasized that the country’s security is “indivisible” from its Gulf neighbors “and that any infringement on the sovereignty of any state constitutes a direct threat to the security and stability of the entire region.”</p>\n<p>Bahrain and Qatar also said they reserved the right to retaliate. Qatar also called for “efforts to contain the crisis in a manner that preserves the security of the region, safeguards the interests of its peoples, and prevents a slide into broader confrontations.”</p>\n<p>Iran’s foreign ministry called on Muslim and non-aligned states to demand an urgent meeting of the UN security council.</p>\n<p>In a post on X, it said, “all bases, facilities, and assets of hostile forces in the region are considered legitimate military targets. Iran will exercise this inherent right decisively until the aggression is completely and unequivocally halted.”</p>\n<h2 class=\"wp-block-heading\"><strong>Trump eyes regime change; Pahlavi previews ‘final action’</strong></h2>\n<p>Trump in his video posted overnight on Saturday urged members of Iran’s military to lay down their arms and called on Iranians to topple the hardline regime that has controlled the country since the Islamic Revolution in 1979.</p>\n<p>“Bombs will be dropping everywhere. When we are finished, take over your government. It will be yours to take. This will be, probably, your only chance for generations. For many years, you have asked for America’s help, but you never got it,” he said. </p>\n<p>“Now you have a president who is giving you what you want. So let’s see how you respond. America is backing you with overwhelming strength and devastating force,” he added. “This is the moment for action. Do not let it pass.”</p>\n<p>Reza Pahlavi, the exiled son of Iran’s last shah, who helped lead mass protests in the country last month, told Iranians to lie low for now and follow his messages online or over radio waves. </p>\n<p>“Stay vigilant and ready so that, at the appropriate time—which I will announce to you precisely—you can return to the streets for the final action,” he <a href=\"https://x.com/PahlaviReza/status/2027648281577132145?s=20\" rel=\"noreferrer noopener\" target=\"_blank\">said in a post</a> on X. </p>\n<p>“We are very close to final victory. I want to be by your side as soon as possible so that together we can take back and rebuild Iran,” he added. </p>\n<p>Trump monitored the situation with his national security team at Mar-a-Lago and spoke to Israeli Prime Minister Benjamin Netanyahu, White House press secretary Karoline Leavitt said. There alongside the president was the Chairman of the Joint Chiefs, Gen. Dan Caine, a source familiar with the matter told The Hill. </p>\n<p>Before the strikes took place, Secretary of State Marco Rubio called all eight members of the so-called Gang of Eight to notify them of the operation, according to Leavitt.</p>\n<p>Prior to the attacks, Rubio called all members of the Gang of Eight to provide congressional notification, and he was able to reach and brief seven of the eight members.</p>\n<h2 class=\"wp-block-heading\"><strong>War powers debate heats up in Congress</strong></h2>\n<p>Within hours of the first bombings in Iran, lawmakers <a href=\"https://thehill.com/homenews/senate/5760308-congress-demands-answers-on-iran-strike/\" rel=\"noreferrer noopener\" target=\"_blank\">pushing to check</a> Trump’s war powers <a href=\"https://thehill.com/homenews/administration/5760287-lawmakers-call-war-powers-vote/\" rel=\"noreferrer noopener\" target=\"_blank\">called for a vote</a> to end the Iran operation as soon as possible.  </p>\n<p>“<a href=\"https://thehill.com/people/donald-trump/\" rel=\"noreferrer noopener\" target=\"_blank\">Donald Trump </a>has launched a war on Iran and Congress must convene on Monday to vote on [Rep.] <a href=\"https://thehill.com/people/thomas-massie/\" rel=\"noreferrer noopener\" target=\"_blank\">Thomas Massie’s </a>[R-Ky.] and my war powers resolution to stop this war,” Rep. <a href=\"https://thehill.com/people/ro-khanna/\" rel=\"noreferrer noopener\" target=\"_blank\">Ro Khanna </a>(D-Calif.) said in a video posted on X, arguing Americans do not want to be embroiled in an overseas conflict. </p>\n<p>Last week, Rep. <a href=\"https://thehill.com/people/warren-davidson/\" rel=\"noreferrer noopener\" target=\"_blank\">Warren Davidson </a>(R-Ohio) became the second Republican to back Khanna’s resolution aimed at limiting Trump’s ability to take military action against Iran. </p>\n<p>“We need a government small enough to fit within the Constitution,” Davidson wrote Saturday on X. “We need a government effective enough to solve problems and serve its own people. Or, we need a new Constitution.”</p>\n<p>Sen. <a href=\"https://thehill.com/people/andy-kim/\" rel=\"noreferrer noopener\" target=\"_blank\">Andy Kim </a>(D-N.J.) called on senators to vote on Sen. <a href=\"https://thehill.com/people/tim-kaine/\" rel=\"noreferrer noopener\" target=\"_blank\">Tim Kaine’s</a> (D-Va.) war powers resolution. “Trump once again started a cycle of violence that has already escalated and could spiral out of control. This is unacceptable,” Kim wrote in a post on X. </p>\n<p>However, <a href=\"https://thehill.com/policy/international/5760326-republican-reaction-us-iran-strikes/\" rel=\"noreferrer noopener\" target=\"_blank\">most Republicans</a> quickly came out in support of Trump’s sweeping strikes on the longtime American adversary, making any war powers vote an uphill battle — especially with some House Democrats opposing the measure.  </p>\n<p>“I am confident this operation will be successful and the liberation of the long suffering people of Iran is at hand,” Sen. Lindsey Graham (R-S.C.), a fierce Iran hawk, wrote on X.</p>\n<h2 class=\"wp-block-heading\"><strong>Shipping halts through Strait of Hormuz; oil prices set for swings</strong></h2>\n<p>While Iran has not moved to close the Strait of Hormuz, a crucial lane for global energy supplies, major shipping companies are reportedly steering clear of the area. </p>\n<p>Reuters <a href=\"https://www.reuters.com/business/energy/oil-gas-majors-traders-suspend-shipments-via-hormuz-us-attacks-iran-sources-say-2026-02-28/\" rel=\"noreferrer noopener\" target=\"_blank\">reported</a> that several tanker owners, oil majors and trading houses have suspended crude oil, fuel and liquefied natural gas shipments through the strait. </p>\n<p>“Our ships will stay put for several days,” one top executive told the outlet. </p>\n<p>The Wall Street Journal <a href=\"https://www.wsj.com/livecoverage/iran-strikes-2026/card/tankers-divert-from-strait-of-hormuz-6iO60V0aInRLC0or9b0P?gaa_at=eafs&amp;gaa_n=AWEtsqfk-yRsS8GlT_fPcoczmnZ5Yxf6zdabSKgaqyRG-6Slu--xvA4ZAYz-LfNXkHU%3D&amp;gaa_ts=69a33a25&amp;gaa_sig=YscRwUB9KoRev_MTKkg9bAY9WYYpHg2ho9LjYSFOA2rZxiXaU71kIAaEqJ7b_tjnCxj-Vpt9FW8Nuq_ItYoNTw%3D%3D\" rel=\"noreferrer noopener\" target=\"_blank\">reported</a> that a loaded supertanker chartered by Shell is now idle in the Arabian Gulf, rather than seeking to traverse the strait. It said dozens of tankers are avoiding the Persian Gulf for the time being. </p>\n<p>What these disruptions mean for global oil markets, which are closed until Monday, remains to be seen. </p>\n<p>The Associated Press <a href=\"https://apnews.com/article/iran-israel-iran-strikes-oil-prices-4a4a800739e53a30ff63b5e89e84ad71\" rel=\"noreferrer noopener\" target=\"_blank\">predicted</a> price swings early in the week as traders assess the risk of a longer, expanding war in the Middle East. </p>\n<p>Iran exports some 1.6 million barrels of oil a day, most of it going to China. If that supply is disrupted, Chinese customers would look elsewhere for oil on the global market, potentially driving up prices.</p>",
            "kind": 1,
            "link": "https://thehill.com/policy/defense/5760747-trump-iran-regime-change/",
            "pub_date": "2026-03-01 04:26:41",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5759499,
            "title": "Congress was just a backdrop at the State of the Union",
            "description": "<p>I attended many State of the Union addresses as a member of Congress and I know the ritual cold. Normally a president arrives prepared to persuade and engage, to lay out an agenda and make the case for it to the Congress that must enact it and to the broader public.</p>\n<p>Tuesday night’s address earned better reviews than many expected because the stories worked and the honors bestowed on heroes were genuinely moving. But President Trump did not come to engage Congress. He reduced it to a backdrop, with Republicans as a prop and Democrats as a foil. In Trump’s vision of governing, Congress doesn’t have a seat at the table. It has a seat in the audience.</p>\n<p>The most revealing moment came when Trump announced that congressional action on tariffs would not be necessary — even though Supreme Court had just struck down his tariff authority just four days earlier. House Speaker Mike Johnson (R-La.) predictably stood and applauded. Although Justice Neil Gorsuch was not in the chamber, his searing concurring opinion defending Congress’s core legislative powers did more for Article I that evening than anything its current leaders said or did.</p>\n<p>Strip away the theater, and the substance was thin. Health care got vague gestures. A proposal to eventually replace the income tax with tariff revenue was more fantasy than policy. Running through all of it was a unifying assumption: Congress would not need to be involved.</p>\n<p>On national security, the lack of depth was more consequential. Iran received a few sentences and a demand: say the secret words, “we will never have a nuclear weapon.” But Iran has <a href=\"https://www.timesofisrael.com/liveblog_entry/iranian-president-reiterates-irans-opposition-to-building-nuclear-weapons-state-tv/\" rel=\"noreferrer noopener\" target=\"_blank\">already said those words</a>, repeatedly, in a Supreme Leader fatwa and under commitments made at the negotiating table, which means the bar the president set has already been cleared.</p>\n<p>The administration has assembled the largest U.S. military force in the Middle East since the Iraq invasion, and Senate Democrats emerged from a <a href=\"https://thehill.com/homenews/senate/5753437-trump-iran-military-strikes/\" rel=\"noreferrer noopener\" target=\"_blank\">classified briefing</a> the same day warning of a “very serious” moment. Members of both parties have called for a War Powers vote before any action is taken. Congress has not been asked to do anything, and most members do not want to “own” the consequences of their actions and so will punt and blame the president if things go wrong.</p>\n<p>China was not mentioned at all. This is extraordinary. China is the central strategic challenge of this century. It is also the primary target of the administration’s own tariff policy, the country whose military buildup most directly threatens American interests in the Pacific, and the economy most consequentially entangled with our own. Russia was barely present. On the fourth anniversary of Russia’s full-scale invasion of Ukraine, that country received three sentences and no policy. The silence on both Beijing and Moscow reflects a strategic void, and the reality that both adversaries are navigating their dealings with Washington on their own terms.</p>\n<p>There was also a dark passage targeting Somali immigrants, offered without elaboration or evidence. The question it raised deserved an answer: Who is next?</p>\n<p>The real response to Tuesday’s address was not in the chamber. It was outside. The fifty-plus Democrats who chose not to attend were reflecting a public that is not applauding. Six in ten Americans <a href=\"https://www.pbs.org/newshour/show/most-americans-say-country-worse-off-than-a-year-ago-new-poll-shows\" rel=\"noreferrer noopener\" target=\"_blank\">believe the country is worse off than a year ago</a>. Gov. Abigail Spanberger’s (D) rebuttal named what the president had omitted, the economic anxiety, the constitutional shortcuts, the self-dealing, and she was speaking not to the room but to the voters who will determine the next Congress.</p>\n<p>That election is nine months away. The next Congress will inherit a presidency that has treated Article I as optional and an institution whose Republican leaders applauded while it happened.</p>\n<p>There are concrete ways the next Congress can reassert its authority: demand authorization before the use of any military force; reclaim tariff authority the Supreme Court just confirmed belongs to Congress; do the hard work of compromise necessary to fully fund the government. The Department of Homeland Security was partially shut down during Tuesday’s address. I believe that is unprecedented.</p>\n<p>Trump invoked the revolution of 1776, and he was right to. That revolution established the principle that no single branch decides the limits of its own authority. The next Congress will have a genuine opportunity to renew the country’s faith in that principle, to push back against executive overreach, and to demonstrate that the constitutional order holds when the people demand it. </p>\n<p>It will also have the opportunity to recall something closer in time: an era I can remember when Congress and the executive were genuine partners, when leaders reached across party lines and were rewarded by voters for doing so.</p>\n<p><em><a href=\"https://thehill.com/people/jane-harman/\" rel=\"noreferrer noopener\" target=\"_blank\">Jane Harman,</a> a Democrat, represented California’s 36th District for nine terms and served as the ranking member of the House Intelligence Committee after 9/11. She chaired the bipartisan Commission on the National Defense Strategy and is president emerita of the Wilson Center.</em> </p>",
            "kind": 1,
            "link": "https://thehill.com/opinion/white-house/5759499-trump-congress-state-union/",
            "pub_date": "2026-03-01 03:16:45",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5760619,
            "title": "Graham says European allies have 'gone pathetically soft' over Iran response",
            "description": "<p>Sen. Lindsey Graham (R-S.C.) slammed three <a data-id=\"https://thehill.com/policy/international/5760393-uk-france-germany-iran-strikes-negotiations/\" data-type=\"link\" href=\"https://thehill.com/policy/international/5760393-uk-france-germany-iran-strikes-negotiations/\">European heads of state</a> over their response to <a data-id=\"https://thehill.com/policy/defense/5760058-us-israel-launch-strikes-on-iran/\" data-type=\"link\" href=\"https://thehill.com/policy/defense/5760058-us-israel-launch-strikes-on-iran/\">the latest strikes against Iran</a>, calling the reaction “so sad.”</p>\n<p>The U.S. military launched the <a data-id=\"https://thehill.com/policy/international/5760207-trump-urges-iran-regime-change/\" data-type=\"link\" href=\"https://thehill.com/policy/international/5760207-trump-urges-iran-regime-change/\">joint military operation</a>, dubbed “Operation Epic Fury,” with Israeli forces early Saturday morning. President Trump announced the attack in a <a data-id=\"https://truthsocial.com/@realDonaldTrump/116147082884192486\" data-type=\"link\" href=\"https://truthsocial.com/@realDonaldTrump/116147082884192486\">video posted to Truth Social</a> overnight, saying the U.S. is seeking to “defend the American people by eliminating imminent threats from the Iranian regime.”</p>\n<p>In a letter released following the strikes, the leaders of Germany, France and the United Kingdom urged the two countries to deescalate, and resume talks over its embattled nuclear program.</p>\n<p>“We call for a resumption of negotiations and urge the Iranian leadership to seek a negotiated solution,” the leaders wrote. “Ultimately, the Iranian people must be allowed to determine their future.”</p>\n<p>Graham, a <a href=\"https://thehill.com/homenews/senate/5756629-graham-trump-iran-berlin-wall-moment/\">staunch supporter</a> of military intervention in Iran, suggested he was more than “disappointed” by the letter, adding that the word would be “an understatement.”</p>\n<p>“To the leaders of France, Germany and the UK: the Iranian people are not wrong to demand the end to their oppression from the bloodthirsty ayatollah’s regime that has American and European blood on their hands,” the South Carolina Republican wrote in a lengthy <a href=\"https://x.com/LindseyGrahamSC/status/2027774010155536604\">post</a> on social platform X. </p>\n<p>“You collectively are the ones that are wrong by refusing to come to the Iranian people’s aid and adding insult to injury, you’re suggesting we should continue to negotiate with religious Nazis,” he continued. “It is pathetic. How far Western Europe has fallen.”</p>\n<p>The senator, known as one of the Senate’s top war hawks, ended his response with a direct message to protesters of the Iranian regime, saying, “President Trump heard your cries. Help has arrived in large measure.”</p>\n<p>“To our European allies: you have gone pathetically soft and lost your zeal for confronting evil apparently unless it’s on your front porch,” he added. “So sad.”</p>\n<p>His comments come as the United Nations Security Council is set to hold an <a href=\"https://thehill.com/policy/international/5760591-un-security-council-emergency-meeting-iran-strikes/\">emergency meeting</a> about the strikes at 4 p.m. EST on Saturday, following a call from French President Emmanuel Macron. Macron condemned the attacks earlier Saturday, <a data-id=\"https://thehill.com/policy/international/5760274-world-reaction-us-israel-strikes-iran/\" data-type=\"link\" href=\"https://thehill.com/policy/international/5760274-world-reaction-us-israel-strikes-iran/\">echoing the outcry</a> from other nations <a data-id=\"https://thehill.com/policy/international/5760555-gulf-unity-pushing-back-iran/\" data-type=\"link\" href=\"https://thehill.com/policy/international/5760555-gulf-unity-pushing-back-iran/\">about risks of a wider war</a> in the aftermath of the military operation.</p>\n<p>Lawmakers’ <a data-id=\"https://thehill.com/policy/international/5760326-republican-reaction-us-iran-strikes/\" data-type=\"link\" href=\"https://thehill.com/policy/international/5760326-republican-reaction-us-iran-strikes/\">support</a> and <a data-id=\"https://thehill.com/homenews/senate/5760308-congress-demands-answers-on-iran-strike/\" data-type=\"link\" href=\"https://thehill.com/homenews/senate/5760308-congress-demands-answers-on-iran-strike/\">opposition</a> to the strikes have mostly fallen along party lines.</p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/senate/5760619-lindsey-graham-europe-reaction-trump-iran-strikes/",
            "pub_date": "2026-03-01 02:51:45",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5758955,
            "title": "Florida has it right: No handouts for AI robber barons",
            "description": "<p>Florida is moving aggressively to position itself as a hub for innovation, including artificial intelligence. But as the state considers how to regulate AI and the infrastructure that supports it, one principle should remain nonnegotiable: Families should not be forced to bankroll Big Tech’s growth.</p>\n<p>That is the core idea behind Gov. Ron DeSantis’s (R) <a href=\"https://www.flgov.com/eog/news/press/2025/governor-ron-desantis-announces-proposal-citizen-bill-rights-artificial\" rel=\"noreferrer noopener\" target=\"_blank\">recent proposal</a> dealing with the <a href=\"https://www.flsenate.gov/Session/Bill/2026/482/BillText/Filed/HTML\" rel=\"noreferrer noopener\" target=\"_blank\">Artificial Intelligence Bill of Rights</a> and a <a href=\"https://www.flsenate.gov/Session/Bill/2026/484/BillText/Filed/HTML\" rel=\"noreferrer noopener\" target=\"_blank\">bill</a> that directly regulates data centers. The data center proposal specifically aims to prevent utilities from shifting the infrastructure costs of hyperscale AI data centers onto residential ratepayers. It would also bar taxpayer subsidies for those facilities and preserve local authority over siting decisions by applying these limits to new contracts and projects. </p>\n<p>If it becomes law, the bill would take effect July 1. The message is simple but important: Florida welcomes innovation, but it will not ask families to foot the bill for Big Tech welfare. Subsidizing AI data centers through utilities or tax policy is a hidden transfer from families to Big Tech, and Florida is right to stop it. </p>\n<p>AI data centers require extraordinary amounts of power, water, and supporting infrastructure. According to a <a href=\"https://www.eesi.org/articles/view/data-centers-and-water-consumption\" rel=\"noreferrer noopener\" target=\"_blank\">recent study</a> by the Environmental and Energy Study Institute, “Large data centers can consume up to 5 million gallons per day, equivalent to the water use of a town populated by 10,000 to 50,000 people.”</p>\n<p>When those demands are met through regulated utilities or public incentives, the costs rarely stay confined to the project itself. They are spread across rate bases, absorbed into tax policy and ultimately borne by households who never consented to subsidize the private development in the first place.</p>\n<p>Florida’s proposal draws a clear boundary around who should bear the costs of AI infrastructure. The <a href=\"https://www.flsenate.gov/Session/Bill/2026/484/BillText/Filed/HTML\" rel=\"noreferrer noopener\" target=\"_blank\">legislation</a> would prohibit utilities from passing data center infrastructure expenses on to residential ratepayers, bar taxpayer subsidies for hyperscale facilities and preserve local authority over siting decisions. In short, it treats AI data centers like any other private industrial project. If a company wants to build one, the company should pay for it.</p>\n<p>That principle is already being tested in real time. The legislation has already cleared both of its initial Senate committees unanimously <a href=\"https://www.flsenate.gov/Session/Bill/2026/482/?Tab=BillHistory\" rel=\"noreferrer noopener\" target=\"_blank\">and has advanced</a> to the Rules Committee, as the financial implications will soon come fully into focus. This is the stage where policy rhetoric meets fiscal reality, and where temptation to blur lines or carve out exceptions emerges.</p>\n<p>That balance matters beyond Florida. States <a href=\"https://www.forbes.com/sites/bryanrobinson/2025/02/16/artificial-intelligence-revolution-10-us-states-leading-the-pack/\" rel=\"noreferrer noopener\" target=\"_blank\">across the nation</a> are competing to attract AI investment, and many are turning to indirect subsidies that obscure who ultimately pays. Those arrangements may look painless on paper, but households feel them through higher bills and strained infrastructure long after the ribbon cuttings are over. </p>\n<p>A recent Harvard Electricity Law Initiative <a href=\"https://eelp.law.harvard.edu/wp-content/uploads/2025/03/Harvard-ELI-Extracting-Profits-from-the-Public.pdf\" rel=\"noreferrer noopener\" target=\"_blank\">paper</a> warns that utilities may socialize the costs of new power plants and power lines based on the premise that the public benefits, but the surging demand from data centers could force average consumers to subsidize the electricity costs of some of the world’s largest corporations.</p>\n<p>Florida is choosing a different approach. The <a href=\"https://www.flsenate.gov/Session/Bill/2026/482/BillText/Filed/HTML\" rel=\"noreferrer noopener\" target=\"_blank\">bill</a> makes clear that utilities may not recover data center infrastructure costs from residential ratepayers, drawing a bright line between private investment and public obligation. By insisting that AI companies internalize their own infrastructure costs and by anchoring consumer protections in statute, the state is drawing a line that other states should study closely. </p>\n<p>If artificial intelligence is going to reshape the economy, it should do so on its own merits. Families should not be forced to pay for private expansion through higher bills and back-door subsidies. Florida’s message is clear: Innovation is welcome, but welfare for Big Tech is not.</p>\n<p><em>Tony Vanderhoef is a law student at Florida State University and native Floridian. He is a contributor with Young Voices.</em></p>",
            "kind": 1,
            "link": "https://thehill.com/opinion/technology/5758955-big-tech-florida-regulation/",
            "pub_date": "2026-03-01 02:16:43",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5760620,
            "title": "Key pro-Israel Democrat to back war powers vote after Trump's Iran strikes",
            "description": "<p>Rep. Brad Schneider (D-Ill.), one of Capitol Hill’s staunchest allies of Israel, will support a war powers resolution limiting President Trump’s use of force in Iran.</p>\n<p>Schneider, a senior member of the Foreign Affairs Committee, has in recent days declined to say how he’d vote on the war powers resolution, which Democrats plan to force to the floor next week.</p>\n<p>But in the wake of Trump’s decision to launch strikes against Iran on Saturday morning, Schneider quickly announced that he will vote in favor of the resolution, which would require Trump to win Congressional approval to continue the operations in Iran.</p>\n<p>“Given this Administration’s failure to engage Congress in classified briefings, public hearings, and formal debate, I will vote to support the War Powers Resolution coming to the floor of the House next week,” <a href=\"https://schneider.house.gov/media/press-releases/schneider-statement-iran-0\">Schneider said in a statement</a>.</p>\n<p>Sponsored by Reps. Ro Khanna (D-Calif.) and Thomas Massie (R-Ky.), the war powers resolution is designed to reassert Congress’s authority to declare war, as delineated in the Constitution. It’s not expected to pass in the House, given the overwhelming opposition of Republicans and at least two Democratic allies of Israel, Reps. Josh Gottheimer (N.J.) and Jared Moskowitz (Fla.).</p>\n<p>Still, House Minority Leader Hakeem Jeffries (D-N.Y.) said Saturday that Democrats “remain committed” to forcing the resolution to the floor next week, which they intend to do using procedural moves to sidestep the opposition of Speaker Mike Johnson (R-La.) and other Republican leaders.</p>\n<p>Schneider emphasized that Iran has long posed a threat to the U.S., Israel and all Western democracies. But he said Trump’s decision to launch the strikes without briefing most members of Congress on the urgency of the threat has compelled him to support the Khanna-Massie resolution.</p>\n<p>“The President of the United States is not allowed to take our nation to war without authorization from Congress,” he said in his statement. “Speaker Johnson should immediately call the House back into session. The Administration must provide Congress with comprehensive classified briefings to understand the threat that justified today’s actions, the goals of the operation, and the strategy for achieving these goals. We need public hearings in House committees. We need formal public debate in the House and the Senate.” </p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/house/5760620-schneider-supports-war-powers-resolution/",
            "pub_date": "2026-03-01 02:16:42",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5760593,
            "title": "Canada's Carney backs Trump on Iran",
            "description": "<p>Canadian Prime Minister Mark Carney on Saturday backed President Trump’s <a data-id=\"https://thehill.com/homenews/ap/ap-international/ap-israels-defense-minister-says-his-country-has-attacked-iran-and-declares-a-state-of-emergency/mlite/\" data-type=\"link\" href=\"https://thehill.com/homenews/ap/ap-international/ap-israels-defense-minister-says-his-country-has-attacked-iran-and-declares-a-state-of-emergency/mlite/\">strikes on Iran</a> aimed at preventing the country from obtaining a nuclear weapon and pushed to further curb the regime’s actions.</p>\n<p>“Canada supports the United States acting to prevent Iran from obtaining a nuclear weapon and to prevent its regime from further threatening international peace and security,” Carney said in a <a href=\"https://x.com/MarkJCarney/status/2027721462233141679/photo/1\">statement</a>.</p>\n<p>“Canada’s position remains clear: the Islamic Republican of Iran is the principal source of instability and terror throughout the Middle East, has one of the world’s worst human rights records, and must never be allowed to obtain or develop nuclear weapons,” he added.</p>\n<p>The statement backing Trump’s strikes comes as several European allies <a href=\"https://thehill.com/policy/international/5760274-world-reaction-us-israel-strikes-iran/\">urge caution</a> and call for deescalation in the Middle East. Leaders of France, Germany and the United Kingdom urged the U.S. to <a href=\"https://thehill.com/policy/international/5760393-uk-france-germany-iran-strikes-negotiations/\">return to the negotiating table</a> with Iran. </p>\n<p>The support from Carney is also notable as Ottawa and Washington have repeatedly clashed during Trump’s first year back in office, with a rollercoaster relationship marked by sharp disagreements over trade and Trump’s steep tariffs.</p>\n<p>Tensions escalated last month after Carney delivered a speech in Davos, Switzerland, in which he declared a “rupture” in the old world order.</p>\n<p>Trump in his own speech said Canada <a href=\"https://thehill.com/policy/international/5703219-carney-trump-tensions-rise/\">“should be grateful to us”</a> and declared “Canada lives because of the United States,” telling the prime minister to “remember that.” </p>\n<p>After the president earlier this month threatened to block the opening of a major bridge between Detroit and Ontario, Carney said he had a <a href=\"https://thehill.com/policy/international/5732140-us-canada-bridge-dispute/\">“positive” conversation</a> with Trump.</p>\n<p>Carney on Saturday urged Canadians in Iran to shelter in place while calling for “the protection of all civilians in this conflict.” </p>",
            "kind": 1,
            "link": "https://thehill.com/policy/international/5760593-carney-supports-trump-iran-action/",
            "pub_date": "2026-03-01 01:45:56",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5760591,
            "title": "UN Security Council to hold emergency meeting after Iran strikes",
            "description": "<p>The United Nations Security Council will hold an <a href=\"https://main.un.org/securitycouncil/en/events/10112th-meeting-middle-east\">emergency meeting</a> on Saturday to discuss <a data-id=\"https://thehill.com/policy/defense/5760058-us-israel-launch-strikes-on-iran/\" data-type=\"link\" href=\"https://thehill.com/policy/defense/5760058-us-israel-launch-strikes-on-iran/\">joint strikes</a> launched by the U.S. and Israel on Iran early Saturday.</p>\n<p>French President Emmanuel Macron called for the meeting after the attack. He warned of “grave consequences for international peace and security” if the situation continues to escalate. </p>\n<p>“The ongoing escalation is dangerous for all. It must stop,” Macron <a href=\"https://x.com/EmmanuelMacron/status/2027718192643084649?s=20\">wrote</a> on social platform X. “The Iranian regime must understand that it now has no other option but to engage in good faith in negotiations to end its nuclear and ballistic programs, as well as its regional destabilization activities.”</p>\n<p>He added, “This is absolutely necessary for the security of all in the Middle East.”</p>\n<p>The forum comes after President Trump announced that the U.S. and Israel began a “major combat mission” in Iran following <a href=\"https://thehill.com/policy/international/5747127-trump-iran-nuclear-deal-outcome-timeline/\">weeks of threats</a> to the nation over its nuclear program. Despite several rounds of indirect talks between Washington and Tehran, Trump signaled he was dissatisfied with how the negotiations were going.</p>\n<p>He has <a data-id=\"https://thehill.com/policy/international/5747127-trump-iran-nuclear-deal-outcome-timeline/\" data-type=\"link\" href=\"https://thehill.com/policy/international/5747127-trump-iran-nuclear-deal-outcome-timeline/\">consistently threatened intervention</a> in Iran if the nations did not come to a new nuclear agreement. Trump withdrew the U.S. from a previous deal during his first administration.</p>\n<p>In a video <a data-id=\"https://truthsocial.com/@realDonaldTrump/116147082884192486\" data-type=\"link\" href=\"https://truthsocial.com/@realDonaldTrump/116147082884192486\">posted to his Truth Social</a> early Saturday, the president said the U.S. military is working to “defend the American people by eliminating imminent threats from the Iranian regime.”</p>\n<p>“Bombs will be dropping everywhere. When we are finished, take over your government. It will be yours to take; this will be probably your only chance for generations,” he said in the roughly 8-minute speech. “America is backing you with overwhelming strength and devastating force. Now is the time to seize control of your destiny.”</p>\n<p>U.N. Secretary-General António Guterres denounced the strikes in a Saturday statement <a href=\"https://x.com/antonioguterres/status/2027754597700206618\">posted to X</a>.</p>\n<p>“I condemn today’s military escalation in the Middle East,” Guterres wrote. “The use of force by the United States and Israel against Iran, and the subsequent retaliation by Iran across the region, undermine international peace and security.”</p>\n<p>He also “strongly” encouraged the U.S. and Iran to continue negotiations.</p>\n<p>Additionally, European Commission President Ursula von der Leyen announced she was “convening a special Security College” on Monday concerning the strikes. </p>\n<p>“For regional security and stability, it is of the utmost importance that there is no further escalation through Iran’s unjustified attacks on partners in the region,” von der Leyen <a href=\"https://x.com/vonderleyen/status/2027756878575362119\">posted</a> online.</p>\n<p>The security council will convene at 4 p.m. EST. </p>\n<p>The group <a href=\"https://main.un.org/securitycouncil/en/content/presidency\">rotates</a> leadership among member countries every month and is currently helmed by British Ambassador Barbara Woodward. The U.S. will assume the presidential role in the group on March 1. </p>",
            "kind": 1,
            "link": "https://thehill.com/policy/international/5760591-un-security-council-emergency-meeting-iran-strikes/",
            "pub_date": "2026-03-01 01:45:56",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5759473,
            "title": "Why the Mamdani-Trump 'bromance' makes sense right now",
            "description": "<p>NEW YORK — When he was campaigning to be mayor of the nation’s largest city, Zohran  Mamdani liked to say he was President Trump’s “worst nightmare.” </p>\n<p>In his victory speech in November, Mamdani took it a step further — calling Trump a “despot” and declaring that if anyone could show how to defeat him, “it’s the city that gave rise to him.” </p>\n<p>Trump returned the fire.</p>\n<p>He called Mamdani a “communist” and someone “who doesn’t know a damn thing” while threatening to withhold federal funds from New York. </p>\n<p>But on Thursday — for the second time since the mayor was elected in November — Trump and Mamdani not only met at the White House. Both sides emerged claiming to have a productive meeting. </p>\n<p>“It is the most fascinating bromance in America right now,” New York Democratic strategist Trip Yang said. </p>\n<p>To go from sparring as Mamdani campaigned “to where they are now, which looks like best buddies in a romcom, it’s simply remarkable.” </p>\n<p>It’s an unusual turn of events: Two politicians who have built their brands and support by opposing the other side were suddenly collaborative.</p>\n<p>And yet, political observers say the relationship makes sense.</p>\n<p>“Game recognizes game, and what I mean by that is they see something kindred in each other,” said Basil Smikle, a former executive director of the New York State Democratic Party. </p>\n<p>“They’re populist leaders. They appeal to very different bases for very different reasons, but they both have been able to create very strong movements around their respective candidacies, and are in firm control of that. I think they each recognize that, in attempting to go after the other person, their respective supporters are unshakeable.” </p>\n<p>During Thursday’s unscheduled meeting, Mamdani proposed a plan to build 12,000 units of housing in Queens. The plan would cost more than $21 billion, one of the largest federal investments in recent history. </p>\n<p>When he arrived at the White House for the closed-door Oval Office meeting, Mamdani also brought a copy of a 1975 New York Daily News front page that screamed: [Gerald] Ford to City: Drop Dead. He paired it with a mock Daily News cover featuring Trump’s face and another headline: “Trump to City: Let’s Rebuild.” </p>\n<p>A smiling Trump ended up holding both front pages in a photo that Mamdani shared on X, the social media site. </p>\n<p>“I’m looking forward to building more housing in New York City,” Mamdani wrote in the post. </p>\n<p>During their first White House meeting in November, Trump told Mamdani to come back to him with “some big ideas on how we can build some things together in New York City,” Joe Calvello, the mayor’s spokesperson, told reporters after the meeting, according to the New York Post. </p>\n<p>“And that’s what he did today,” Calvello said, adding that Trump was “enthusiastic” about the plan. “The mayor took him up on his offer and went to D.C.” </p>\n<p>Grant Reeher, a political science professor at Syracuse University, said the mayor had a good idea in taking the development proposal to a former real estate figure who was raised in Gotham and is known for his real estate empire there. </p>\n<p>“You’ve got the fact that they both care about New York, and you’ve got the fact [Mamdani] is coming to Trump with an idea about doing something that is in Trump’s wheelhouse,” Reeher said. </p>\n<p>Susan Del Percio, the longtime Republican strategist who is based in New York, said it is “quite smart” to go straight to Trump with proposals because “anything he can get from Trump makes him not as beholden to [New York Gov. Kathy] Hochul.” </p>\n<p>What does Trump get out of the deal? Del Percio was asked. </p>\n<p>“Probably his name on a building,” she said. </p>\n<p>Calvello said that during the meeting, Mamdani also swayed Trump to release a Columbia University student who had been obtained by Immigration and Customs Enforcement (ICE) officers earlier in the day. He also provided the president with a list of four others who had been apprehended by ICE officers. </p>\n<p>The Trump-Mamdani meeting came two days after Trump called the mayor in his State of the Union address “a nice guy.”</p>\n<p>“Actually speak to him a lot,” the president said. “Bad policy, but nice guy.” </p>\n<p>As he pushed for Congress to pass his voter-ID bill, the president pointed out Mamdani’s emergency snow-shoveling program in the Big Apple, arguing “if you apply for that job, you need to show two original forms of ID and a Social Security card.” </p>\n<p>“I can tell you, I didn’t expect this much attention nationwide on our emergency snow shoveler program,” Mamdani <a href=\"https://nam11.safelinks.protection.outlook.com/?url=https%3A%2F%2Fwww.nyc.gov%2Fmayors-office%2Fnews%2F2026%2F02%2Ftranscript--mayor-mamdani-ahead-of-feb--27-deadline--mayor-mamda&amp;data=05%7C02%7Ciswanson%40thehill.com%7C1dc76e9271164c2cee9308de763cebe9%7C9e5488e2e83844f6886cc7608242767e%7C1%7C0%7C639078201242847982%7CUnknown%7CTWFpbGZsb3d8eyJFbXB0eU1hcGkiOnRydWUsIlYiOiIwLjAuMDAwMCIsIlAiOiJXaW4zMiIsIkFOIjoiTWFpbCIsIldUIjoyfQ%3D%3D%7C0%7C%7C%7C&amp;sdata=eBSaZ3mL%2B85pKitMCex%2Fj7NDKy8BWgwKGrqFvGHVw4w%3D&amp;reserved=0\" rel=\"noreferrer noopener\" target=\"_blank\">quipped the next day</a>. </p>\n<p>Smikle also said New Yorkers seem generally approving, if not somewhat in awe, of Mamdani’s Trump approach. </p>\n<p>“Mamdani seems to have defanged Donald Trump. I think New Yorkers are proud of their mayor, but there’s also a curiosity: What is it about him that is so disarming?” </p>\n<p>But he cautioned that the mayor should still tread carefully with the unpredictable president.</p>\n<p>“Trump has, historically, tried to make sure that he feels he’s in control, and that people are paying appropriate deference to him,” he said. “What is very possible is that Trump could have this relationship with him today, on the surface, and then come around and try to test his resolve by doing other things that would make it seem that the relationship has been fractured, and that it’s Mamdani’s fault, and then force him into a situation where he then has to very publicly capitulate.” </p>\n<p>While Mamdani and Trump clearly see some positives in the bromance, Yang questioned how much further the relationship can progress as a win-win for both figures.</p>\n<p>“How long can the buddy cop saga play out? There may be times where that relationship is tested, so seeing how sustainable it is probably the biggest question mark.” </p>\n<p>More than 2 million New Yorkers voted in November’s election, marking the highest turnout for a mayoral election since 1969. Throughout his campaign, Mamdani, who is the youngest mayor of New York in more than a century, built his victory on an unusually diverse coalition, even attracting some Republicans by centering his campaign on economic issues including affordable housing. </p>\n<p>Since securing a surprise win in the primary in June, Mamdani has become one of the most visible faces of the progressive movement within the Democratic Party. That prominence has led some Democrats to wonder whether his newfound relationship with Trump could alienate parts of his base.</p>\n<p>But Del Percio poured cold water on that idea.</p>\n<p>“No one is thinking Mamdani is becoming a closet conservative,” she said.</p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/administration/5759473-mayor-mamdani-trump-relationship/",
            "pub_date": "2026-03-01 01:22:23",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5760555,
            "title": "Gulf countries coming under attack from Iran warn of retaliation",
            "description": "<p>Gulf countries expressed outrage on Saturday in the face of military attacks from the Islamic Republic of Iran, a rare show of unity in pushing back against Tehran in the wake of U.S. and Israeli strikes against the country. </p>\n<p>Iran is retaliating in the face of President Trump’s early Saturday decision to launch a major military operation with Israel aimed at toppling the regime in Tehran.</p>\n<p>Saudi Arabia, Qatar, the United Arab Emirates, Bahrain and Kuwait all appeared to have been targeted by Iranian attacks. Iran also targeted sites in Jordan. All of these countries host U.S. bases or forces in the region. </p>\n<p>“The regime has not capitulated in the least. At least not yet,” said Jonathan Schanzer, executive director of the Foundation for Defense of Democracies, a Washington based thinktank. </p>\n<p>“They are fighting back and so what we’re watching is this sort of test of wills,” he said in a briefing on Saturday, responding to Iran’s targeting of Gulf states. </p>\n<p>Saudi Arabia announced it would aid countries in repelling Iranian attacks. </p>\n<p>“Saudi Ministry of Foreign Affairs affirmed the Kingdom’s full solidarity with the countries concerned and its firm support for them, stating that it would mobilize all its capabilities to assist them in any measures they undertake,” the ministry said in a statement. </p>\n<p>The UAE, in a statement, emphasized that the country’s security is “indivisible” from its Gulf neighbors “and that any infringement on the sovereignty of any state constitutes a direct threat to the security and stability of the entire region.”</p>\n<p>Schanzer said it’s interesting to see the countries “banding together with the United States.” </p>\n<p>“The Emiratis and the Saudis are now speaking the same language,” he said.</p>\n<p>“They have been at odds with one another over the last several weeks, they are issuing statements of support for one another as Iranian missiles and drones are getting shot across the region.” </p>\n<p>Here’s a breakdown of attacks so far as this story develops: </p>\n<h2 class=\"wp-block-heading\"><strong>Saudi Arabia</strong></h2>\n<p>Saudi Arabia said Iranian attacks targeted the capital city of Riyadh and the Eastern Province. The Kingdom said it had successfully intercepted Iranian attacks. </p>\n<p>In a statement on X, the Saudi Foreign Ministry condemned Iranian strikes on its territory, calling them unjustified because the Kingdom had affirmed it would not allow its airspace to be used for any U.S. or Israeli attacks against the country. </p>\n<p>“These attacks cannot be justified under any pretext or in any way whatsoever, and they came despite the Iranian authorities’ knowledge that the Kingdom had affirmed it would not allow its airspace or territory to be used to target Iran,” <a href=\"https://x.com/KSAmofaEN/status/2027750941047349501?s=20\">the statement read.</a></p>\n<h2 class=\"wp-block-heading\"><strong>Bahrain</strong></h2>\n<p>Iran managed a strike against a service center of the U.S. Fifth Fleet naval base in Bahrain, Reuters reported </p>\n<p>The Kingdom of Bahrain said in a statement it “had been subjected to external attacks targeting sites and installations within its borders” but said it successfully intercepted some Iranian attacks. </p>\n<p>“The Government affirmed its full right to respond and to take all necessary measures to defend its national security and safeguard its sovereignty, in coordination with its allies and partners.”</p>\n<h2 class=\"wp-block-heading\"><strong>Qatar</strong></h2>\n<p>Qatar reportedly intercepted Iranian ballistic missiles targeting the Al-Udeid airbase in Doha, which hosts the U.S. Central Command. </p>\n<p>Qatar warned it reserves the right to retaliate in the face of Iranian strikes, but called for a cessation of hostilities and warned of a wider regional war. </p>\n<p>Qatar called for “efforts to contain the crisis in a manner that preserves the security of the region, safeguards the interests of its peoples, and prevents a slide into broader confrontations.”</p>\n<h2 class=\"wp-block-heading\"><strong>UAE</strong></h2>\n<p>Explosions were reported across Dubai and Abu Dhabi and the Emirati government said it reserved the right to respond. A Pakistani citizen was reportedly killed in the UAE related to the interception of an Iranian missile. </p>\n<p>“The UAE will not tolerate any compromise to its security or sovereignty under any circumstances,” the foreign ministry said in a statement on X. </p>\n<p>Reuters reported at least five booms in rapid succession that caused windows to vibrate in a house near Abu Dhabi’s Corniche, its premier waterfront promenade. </p>\n<h2 class=\"wp-block-heading\"><strong>Kuwait</strong></h2>\n<p>A drone targeted Kuwait’s International Airport on Saturday, resulting in minor injuries to a number of workers and limited material damage to the passenger termina, the General Authority of Civil Aviation said in a statement. </p>\n<p>Earlier on Saturday, Kuwait’s Armed Forces said it had “engaged aerial missiles detected in the airpsace.”</p>",
            "kind": 1,
            "link": "https://thehill.com/policy/international/5760555-gulf-unity-pushing-back-iran/",
            "pub_date": "2026-03-01 01:22:22",
            "source": "thehill",
            "language": "en"
        }
    ]
}