{
    "data": [
        {
            "id": 5125951,
            "title": "Greenland looks to ban foreign political donations",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>Greenland’s <a data-id=\"https://thehill.com/policy/international/5100318-trump-greenland-denmark-european-parliament/\" data-type=\"link\" href=\"https://thehill.com/policy/international/5100318-trump-greenland-denmark-european-parliament/\">parliament</a> on Tuesday debated whether it would ban political donations from foreign or anonymous contributors.</p>\n<p>The island territory’s Inatsisartut examined a proposal that would ban a political party from receiving domestic private contributions higher than 200,000 Danish kroner — which is nearly $28,000. It would also ban an individual contributor from exceeding 20,000 kroner, or $2,770, <a href=\"https://apnews.com/article/greenland-denmark-trump-parliament-contributions-us-884cd19482adc9135e2870cb059c8dae\">The Associated Press reported.</a></p>\n\n<p>The move comes as President Trump and his administration <a data-id=\"https://thehill.com/homenews/administration/5072954-trump-greenland-acquisition-concerns/\" data-type=\"link\" href=\"https://thehill.com/homenews/administration/5072954-trump-greenland-acquisition-concerns/\">seek to acquire</a> Greenland, which is currently owned by Denmark. Trump has <a data-id=\"https://thehill.com/policy/defense/5074900-trump-provokes-anxieties-with-greenland-panama-canal-military-talk/\" data-type=\"link\" href=\"https://thehill.com/policy/defense/5074900-trump-provokes-anxieties-with-greenland-panama-canal-military-talk/\">not ruled out</a> using military force to <a data-id=\"https://thehill.com/homenews/administration/5097789-trump-greenland-international-security/\" data-type=\"link\" href=\"https://thehill.com/homenews/administration/5097789-trump-greenland-international-security/\">take over the land</a>, <a data-id=\"https://thehill.com/policy/international/5076153-mike-waltz-donald-trump-greenland-expansion/\" data-type=\"link\" href=\"https://thehill.com/policy/international/5076153-mike-waltz-donald-trump-greenland-expansion/\">arguing</a> that it is <a data-id=\"https://thehill.com/homenews/administration/5053319-trump-greenland-purchase/\" data-type=\"link\" href=\"https://thehill.com/homenews/administration/5053319-trump-greenland-purchase/\">essential</a> for national security.</p>\n<p>Just days ago, Secretary of State Marco Rubio said it was <a href=\"https://thehill.com/policy/international/5117893-marco-rubio-greenland-trump/\">“not a joke”</a> that the president wants to acquire the Arctic island. </p>\n<p>Lawmakers in Greenland argue the bill must be examined “in the light of geopolitical interests” and the “current situation where representatives of an allied great power have expressed interest in taking over and controlling Greenland,” the AP reported.</p>\n<p>Politicians in Greenland and from Denmark — which recently <a data-id=\"https://thehill.com/policy/defense/5110298-denmark-military-spending-greenland-donald-trump-acquisition/\" data-type=\"link\" href=\"https://thehill.com/policy/defense/5110298-denmark-military-spending-greenland-donald-trump-acquisition/\">upped its military spending</a> allocated for the territory — have <a data-id=\"https://thehill.com/policy/international/5091212-greenland-donald-trump-expansion-proposal/\" data-type=\"link\" href=\"https://thehill.com/policy/international/5091212-greenland-donald-trump-expansion-proposal/\">stressed</a> that the land is <a href=\"https://thehill.com/policy/international/5071666-greenland-denmark-trump-jr-visit/\">not for sale</a>, even as Trump continues to say what an asset it would be for the U.S. </p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>Trump reportedly had <a href=\"https://thehill.com/policy/international/5105602-donald-trump-greenland-denmark/\">a “fiery” call</a> with Danish Prime Minister Mette Frederiksen about ownership and control of the land late last month.</p>\n<p>If parliament agrees to the spending proposal Tuesday, it will likely become law and be enacted straight away, as the party controlling government has a majority in parliament, <a data-id=\"https://www.theguardian.com/world/2025/feb/03/greenland-plans-to-ban-foreign-political-funding-over-trump-led-election-fears\" data-type=\"link\" href=\"https://www.theguardian.com/world/2025/feb/03/greenland-plans-to-ban-foreign-political-funding-over-trump-led-election-fears\">The Guardian reported.</a></p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/policy/international/5125951-greenland-foreign-political-donations-ban/",
            "pub_date": "2025-02-05 03:05:54",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5125843,
            "title": "Hawley makes push to allow parents to sue tech companies",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>Sen. Josh Hawley (R-Mo.) said Tuesday he will introduce legislation to empower parents to sue leading social media companies over alleged harms to children and teens.</p>\n<p>“Social media platforms don’t change because they don’t have any incentive, which is a very polite way of saying, there’s no hammer on these people. They do whatever they want to do because they know nobody can effectively hold them accountable,” Hawley said during a Senate Judiciary Hearing on fentanyl Tuesday. </p>\n\n<p>Hawley delivered the remarks after hearing from Bridgette Norring, who testified before the committee to discuss the loss of her son, Devin, who died at the age of 19 after buying a fentanyl-laced pill through social media.</p>\n<p>“They’re making billions of dollars on their social media platforms, they’re killing our kids. They’re exposing them to all kinds of ungodly material, and they won’t do anything about it because we can’t hold them accountable,” Hawley said.</p>\n<p>“And I just want to say to members of this body that has got to change. It is time to give parents the right to sue these platforms,” he continued. “No company in America has the liability shield that these companies have.” </p>\n<p>Hawley has been <a data-id=\"https://thehill.com/policy/technology/5119211-big-tech-on-the-rise-one-year-after-senate-beat-down/\" data-type=\"link\" href=\"https://thehill.com/policy/technology/5119211-big-tech-on-the-rise-one-year-after-senate-beat-down/\">a fierce critic</a> of Big Tech’s impact on kids’ safety and privacy in recent years.</p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>The Missouri senator said empowering parents with the right to sue technology companies is vital as other methods like changing the rules on reporting do not stop the companies from taking what he believes is real action. </p>\n<p>“I will introduce legislation this Congress to allow parents…to go to court and sue these companies,” he said. </p>\n\n<p>Section 230 of the Communications Decency Act largely protects social media companies from being sued over the content people post to their sites. It was not immediately clear what Hawley’s bill will include to circumvent this. </p>\n<p>Hawley introduced a bill in 2023 that would limit tech companies’ legal immunity under Section 230, but this did not pass. </p>\n<p>Just over a year ago, Hawley made headlines for his grilling of Meta CEO Mark Zuckerberg, who appeared before the Judiciary Committee alongside the leaders of four other popular social media networks. Amid pressure from Hawley, Zuckerberg eventually apologized to the families present at the hearing. </p>\n<p>The hearing put a spotlight on alleged harms that come from these platforms and amped up pressure on both the companies and policymakers to do more to protect children and teens. </p>\n<p>Still, by the end of last year, much of the legislation of kids’ online safety did not make it past the finish line amid pushback, largely from House Republicans concerned about censorship. </p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/policy/technology/5125843-hawley-makes-push-to-allow-parents-to-sue-tech-companies/",
            "pub_date": "2025-02-05 03:05:52",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5124685,
            "title": "Want to cut government waste? Pay congressional staffers more.",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<p>If President Trump and his Department of Government Efficiency are to succeed in reforming and reducing the size and power of the federal bureaucracy, they will need good intelligence. They will need to know the details of programs, the existence of unpublicized offices, the allocation of human and financial resources, the redundancies within and across agencies and, perhaps most importantly, who are the important people within them.</p>\n<p>The administrative state has grown into such a behemoth that very few people know “where the bodies are buried” unless they work within one of those bureaucracies. Outside of those executive branch departments and agencies, very few specialists grasp the full extent of what should be known in order to make those agencies leaner, more efficient and more responsive to the will of elected officials. </p>\n\n<p>There are analysts at the Government Accountability Office who audit said agencies in response to the directives of Congress. But insofar as Congress is limited in its possession of the necessary “intelligence,” it has a correspondingly inadequate ability to specify the investigations and evaluations that GAO should conduct.</p>\n<p>Congressional limitations are the central problem here. The ability of our elected representatives to make optimally informed decisions about programs and budgets is constrained by the limited capabilities and numbers of congressional staff. </p>\n<p>A typical House member’s office has two legislative assistants and a legislative director. Each legislative assistant has a portfolio that includes multiple subject areas, most of which are unrelated to one another — for example, someone might have health policy, Social Security, transportation, homeland security, education and veterans affairs. It is impossible for such an assistant to develop serious expertise in all these subjects and their corresponding government agencies. This is partly because most legislative assistants are very young — usually just a few years into their careers — and because they have no experience working in the executive branch. Members of Congress must then rely on their committee staff, who are more senior and the most knowledgeable of all. </p>\n<p>Given the inexperience and paucity of trusted staffers capable of overseeing executive branch bureaucracies, the ability of Congress to gather the intelligence it needs to shape the nation’s laws is grossly suboptimal. And the fact that Congress depends on lobbyists to supply so much of the intelligence it receives makes it difficult for all concerned to evaluate the degree to which that information is biased. </p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>The usual pattern for congressional staff is to serve several years on the Hill and then “graduate” to private-sector jobs or service in the executive branch. Both destinations offer much better salaries. One almost never sees executive branch officials move to congressional offices, because few Hill staff positions pay a family-friendly salary. Yet it is exactly former executive branch officials who are needed on congressional staffs — officials who have served long enough to know the lay of the land as well as the personnel who are likely to be responsive or resistant to the president’s agenda.</p><!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://thehill.com/submitting-opinion-content/\"><img alt=\"\" class=\"wp-image-4329764\" decoding=\"async\" height=\"121\" loading=\"lazy\" sizes=\"(max-width: 899px) 100vw, 600px\" src=\"https://thehill.com/wp-content/uploads/sites/2/2023/11/op2.png?w=600\" srcset=\"https://thehill.com/wp-content/uploads/sites/2/2023/11/op2.png?resize=600,121 600w, https://thehill.com/wp-content/uploads/sites/2/2023/11/op2.png?resize=300,61 300w, https://thehill.com/wp-content/uploads/sites/2/2023/11/op2.png?resize=50,10 50w\" width=\"600\"/></a></figure>\n<p>This situation is aggravated by false economies trumpeted by some members of Congress who proudly declare that they are “saving taxpayer dollars” by having such lean staffs stuck with substandard salaries. They live in fear that, should they actually pay their staff wages commensurate with the skill and responsibilities these jobs so obviously require, demagogues would accuse them of building an “imperial Congress” that rewards the politically connected. If there is anything in government as penny-wise and pound foolish as this “saving of money,” it would be hard to find.</p>\n\n<p>If the president and DOGE are serious about reducing the power, intrusiveness, waste, fraud and bloat of the administrative state, they would do well to encourage our congressional leaders to improve Congress’s ability to be a check and balance against the federal bureaucracy and to recruit sympathetic members of executive branch agencies who should not have to take a pay cut to render an inestimable national service.</p>\n<p><em>Dr. John Lenczowski is founder, president emeritus and chancellor of the Institute of World Politics. Previously, he served as President Ronald Reagan’s principal adviser on Soviet affairs, as well as a congressional and State Department staffer.</em></p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/opinion/campaign/5124685-want-to-cut-government-waste-pay-congressional-staffers-more/",
            "pub_date": "2025-02-05 03:01:11",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5124116,
            "title": "Trump’s astonishingly wrongheaded notions about trade and tariffs",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>President Trump has been right about many things. But when it comes to tariffs, he’s wrong about nearly everything. And not just a little wrong, he’s astonishingly wrong. And the great mystery is he has several good economists around him who know he’s wrong and surely have tried to explain it to him — apparently to no avail.</p>\n<p>But if he would listen to them, here’s what they would tell him.</p>\n\n<p><strong>Trade balances don’t matter.</strong> <a href=\"https://www.cfr.org/backgrounder/us-trade-deficit-how-much-does-it-matter\" rel=\"noreferrer noopener\" target=\"_blank\">Trump has long been obsessed</a> with the U.S. trade deficit. Most economists aren’t. For decades the U.S. has bought more from other countries than other countries have bought from us, which means we always have an annual trade deficit. <a href=\"https://www.census.gov/foreign-trade/balance/c0004.html\" rel=\"noreferrer noopener\" target=\"_blank\">According to the Census Bureau</a>, the U.S. trade deficit was $436 billion in 2000, $635 billion in 2010, and $1.06 trillion in 2023. About the only time the trade deficit goes down is when people have less money to spend because the country is in an economic recession.</p>\n<p>But doesn’t that mean other countries (e.g., China) are “winning,” as Trump says, while the U.S. is losing? No, and to understand why, consider a household. Your household may have lots of trade deficits: with the grocery store, gas station, department stores, pharmacy and restaurants. You buy from them, but they don’t buy from you. Do you consider yourself losing? That system works because your household produces enough wealth (i.e., income) to pay those bills. And when you make more money, you’re likely to spend even more, increasing your trade deficits.</p>\n<p>Countries are no different. The U.S. is the wealthiest country in the world. <a href=\"https://fred.stlouisfed.org/series/GDP\" rel=\"noreferrer noopener\" target=\"_blank\">Our gross domestic product</a> — the sum of all goods and services produced in the U.S. — goes up every year except in recessions. GDP was about $10.5 trillion in 2000, $15.3 trillion in 2010, and nearly $30 trillion in 2024. The U.S. — i.e., companies and individuals — creates wealth and we spend it on things we want and need, just like your household.</p>\n<p>Incidentally, some states likely have trade deficits or trade surpluses with other states, but you never hear about that because nobody cares.</p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p><strong>Americans, not foreign countries, pay the tariffs.</strong> It is a mystery why Trump keeps claiming other countries pay our tariffs. <a href=\"https://www.nytimes.com/2025/02/02/business/economy/trump-tariffs-what-to-know.html\" rel=\"noreferrer noopener\" target=\"_blank\">The New York Times writes</a>, “Many U.S. companies have expressed frustration with Mr. Trump’s frequent assertions that foreign countries pay for tariffs.” He couldn’t be more wrong. A tariff is a tax the U.S. imposes on imports to the U.S., and U.S. consumers and companies pay those tariffs when the products arrive at customs.</p>\n<p><a href=\"https://taxfoundation.org/blog/who-really-pays-tariffs/\" rel=\"noreferrer noopener\" target=\"_blank\">Here’s the Tax Foundation</a>: “When the US imposes tariffs on imports, US businesses directly pay import taxes to the US government on their purchases from abroad.” Got that? Tariffs are a tax increase on U.S. businesses. Those increases are often passed on to consumers, meaning they will pay higher prices. In short, Donald Trump is raising your taxes.</p>\n\n<p>That’s why Democratic presidential candidate <a href=\"https://www.nbcnews.com/politics/2024-election/harris-calls-trumps-tariff-proposals-sales-tax-american-people-rcna172627\" rel=\"noreferrer noopener\" target=\"_blank\">Kamala Harris equated Trump’s proposed tariffs to a sales tax</a>. They work the same. Consumers will pay more.</p>\n<p>Sometimes a foreign company will reduce its prices to partially offset the tariff. And sometimes U.S. companies importing those goods or services will eat part or all the additional costs, reducing profits. But <a href=\"https://www.cnn.com/2025/02/02/politics/us-tariffs-americans-pay-imports/index.html\" rel=\"noreferrer noopener\" target=\"_blank\">consumers will see many prices rise</a>.</p>\n<p>And that’s why you’ve likely seen news stories suggesting Trump’s <a href=\"https://www.yahoo.com/news/us-businesses-brace-inflation-fear-083218031.html\" rel=\"noreferrer noopener\" target=\"_blank\">tariffs could boost inflation</a>. Some prices will go up, which may persuade the Federal Reserve Bank to not lower interest rates — or maybe even raise them.</p>\n<div class=\"civic-science-article-container civic-science-more-14 civic-is-mr3\" data-civicscience-widget=\"3f127ebd-287e-0b64-a901-d55ec286348a\" id=\"civsci-id-civsci-id-596708068\"></div>\n<p>Don’t miss the irony. Trump wants the Fed to cut interest rates even as he imposes tariffs that could keep prices higher than otherwise, which would prevent the Fed from lowering interest rates.</p>\n<p><strong>Tariffs won’t replace other taxes.</strong> <a href=\"https://www.foxbusiness.com/media/trump-proposes-abolishment-federal-income-tax-bringing-us-back-richest-period-history\" rel=\"noreferrer noopener\" target=\"_blank\">Trump likes to point out</a> that tariffs were the primary source of government revenue in the 1800s. But, of course, this isn’t the 1800s.</p>\n<p><a href=\"https://crsreports.congress.gov/product/pdf/IF/IF11030\" rel=\"noreferrer noopener\" target=\"_blank\">According to the Congressional Research Service</a>, “Over the past 70 years, tariffs have never accounted for much more than 2% of total federal revenue.” Tariffs brought in only $77 billion, or 1.57 percent of total revenue, in 2024. More importantly, that’s only 1.14 percent of total <a href=\"https://fiscaldata.treasury.gov/americas-finance-guide/federal-spending/#:~:text=The%20federal%20government%20spends%20money,)%2C%20resulting%20in%20a%20deficit.\" rel=\"noreferrer noopener\" target=\"_blank\">2024 federal spending of $6.75 trillion</a>.</p>\n\n<p>Trump has flirted with the notion, whether seriously or not, that tariff revenue might <a href=\"https://www.foxbusiness.com/media/trump-proposes-abolishment-federal-income-tax-bringing-us-back-richest-period-history\" rel=\"noreferrer noopener\" target=\"_blank\">replace other taxes like the income tax</a>. But <a href=\"https://fiscaldata.treasury.gov/americas-finance-guide/government-revenue/\" rel=\"noreferrer noopener\" target=\"_blank\">federal revenue from the individual income tax</a> was $2.43 trillion in 2024 — about 32 times the $77 billion the government received in tariffs. Even with significant spending cuts and increased tariff revenue, tariffs will be only a small fraction of the needed federal revenue.</p>\n<p>The White House and Trump can expect to hear complaints from the thousands of U.S. businesses that will have to pay Trump’s tariffs, the thousands of U.S. businesses hit by retaliatory tariffs imposed by Canada, Mexico and China, and from investors who see their assets tank as the stock market understandably prices in lower economic growth — or even a recession.</p>\n<p>The best solution is for Trump to claim his targeted countries have made concessions, however minor, and end this trade war. And maybe he will. Because the last thing he wants is to be the one to Make America Poor Again.</p>\n\n<p><em><em><u><a href=\"https://twitter.com/MerrillMatthews\" rel=\"noreferrer noopener\" target=\"_blank\">Merrill Matthews</a></u></em></em> <em>is a public policy and political analyst and the co-author of “On the Edge: America Faces the Entitlements Cliff.”</em></p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/opinion/5124116-trump-wrong-about-tariffs/",
            "pub_date": "2025-02-05 02:35:57",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5125936,
            "title": "Collins to back OMB nominee Russell Vought, paving way for confirmation",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>Senate Appropriations Chair Susan Collins (R-Maine) told The Hill Tuesday that she plans to vote for Russell Vought, President Trump’s pick to head the White House budget office, paving the way for Vought’s likely confirmation later this week.</p>\n<p>“Yes, I’m going to support it,” she said of Vought’s nomination to head the Office of Management and Budget (OMB).</p>\n\n<p>Collins believes that senators should give presidents deference to pick senior executive branch officials as long as they are qualified for the job, according to a source familiar with her views.</p>\n<p>Vought served as OMB director from 2019 to 2020, during Trump’s first term</p>\n<p>He has <a href=\"https://thehill.com/homenews/senate/5100443-russell-vought-confirmation-hearing-trump-funding/\" rel=\"noreferrer noopener\" target=\"_blank\">come under criticism from Democrats</a> for supporting the view that the president has the constitutional authority to impound funds appropriated for Congress, but he acknowledged during his confirmation hearing that courts have upheld the Impoundment Control Act, which Congress passed to stop president’s from holding up congressionally authorized funds.</p>\n<p>Vought has also been criticized for contributing to Project 2025, the conservative blueprint for reforming the federal government, which has aligned with Trump’s executive actions to freeze and evaluate spending during his first two and a half weeks in office.</p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>His nomination <a href=\"https://thehill.com/business/budget/5116461-republicans-advance-omb-russell-vought-democrats-boycott/\" rel=\"noreferrer noopener\" target=\"_blank\">passed out of the Budget Committee</a> last week on an 11-0 vote after Democrats boycotted the meeting to protest a freeze the OMB placed on federal grants and loans. </p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/homenews/senate/5125936-susan-collins-russell-vought-omb/",
            "pub_date": "2025-02-05 02:35:56",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5125724,
            "title": "Dem AGs warn federal workers about ‘misleading’ Trump buyout offers",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>A coalition of Democratic attorneys general issued warnings to federal workers in their states Monday about the Trump administration’s buyout offers, calling the program “misleading.”</p>\n<p>The 11 attorneys general, led by New York Attorney General Letitia James (D), cautioned that the benefits touted as part of the “deferred resignation” program being offered to nearly all full-time federal employees <a href=\"https://ag.ny.gov/press-release/2025/attorney-general-james-and-eleven-attorneys-general-warn-federal-employees-about\">may not be assured.</a></p>\n\n<p>“President Trump’s so-called buyout offers are nothing more than the latest attack on federal workers and the services they provide,” James said. “These supposed offers are not guaranteed.”</p>\n<p>The Trump administration says federal workers who accept the buyout will be paid until the end of September and retain their benefits <a href=\"https://thehill.com/homenews/administration/5119883-trump-benefits-buyout-eligibility/\">so long as they resign by Thursday</a>. The offer was extended to an estimated 2 million federal employees, and <a href=\"https://thehill.com/homenews/administration/5125600-trump-administration-buyout-federal-employees/\">at least 20,000 federal employees have accepted</a> the offer so far, a source told The Hill. </p>\n<p>The attorneys general urged federal employees to follow the guidance of their unions to protect their rights. </p>\n<p>Arizona Attorney General Kris Mayes (D) decried the offer as <a href=\"https://www.azag.gov/press-release/attorney-general-mayes-warns-federal-employees-about-misleading-buyout-offer#:~:text=%22Federal%20employees%20in%20Arizona%20need,to%20follow%20your%20union's%20guidance.\">“completely unreliable,”</a> while Michigan Attorney General Dana Nessel (D) urged workers to “<a href=\"https://content.govdelivery.com/accounts/MIAG/bulletins/3d08db7\">read the fine print</a> before signing.”</p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>California Attorney General Rob Bonta (D) said the buyouts are a “<a href=\"https://oag.ca.gov/news/press-releases/attorney-general-bonta-warns-federal-employees-about-questionable-buyout-offer\">pointed attack</a> aimed at dismantling our federal workforce and sowing chaos for Americans that rely on a functioning government.”</p>\n<p>And New Jersey’s attorney general, Matthew Platkin (D),<a href=\"https://www.njoag.gov/attorney-general-matthew-j-platkin-joins-11-attorneys-general-to-warn-federal-employees-about-misleading-buyout-offer/\"> took direct aim</a> at billionaire Elon Musk, whom Trump has tapped to cut the federal workforce via the Department of Government Efficiency.</p>\n\n<p>“President Trump has allowed an unelected billionaire with no constitutional authority to intimidate the civil servants who keep our government running in an attempt to push them out of their jobs,” Platkin said, noting that federal workers’ protections don’t change when a new president takes office. </p>\n<p>Democratic attorneys general have banded together several times since Trump took office, seeking to form a line of defense against <a href=\"https://thehill.com/regulation/court-battles/5111429-democratic-states-attorneys-general-sue-trump-administration/\">various executive actions</a>.</p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/regulation/court-battles/5125724-trump-administration-buyout-offer/",
            "pub_date": "2025-02-05 02:35:56",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5125858,
            "title": "Burgum begins to implement Trump’s ‘energy emergency’ declaration",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>Shortly after being sworn in to lead the Interior Department, Secretary Doug Burgum announced steps he would take to implement Trump’s declaration of <a href=\"https://thehill.com/policy/energy-environment/5096946-trump-declares-energy-emergency/\">an energy emergency</a>.</p>\n<p>In one of a series of secretarial orders he announced, Burgum said he would direct Interior’s bureaus and offices to identify emergency and other legal authorities that can be used to speed up energy and mineral production and processing. </p>\n\n<p>The order said that this should include, but not be limited to, offshore energy and energy on public lands.</p>\n<p>On his first day in office, Trump declared that the nation was facing an energy emergency — unlocking additional powers to promote energy development. At the same time, however, he moved <a href=\"https://thehill.com/policy/energy-environment/5105492-trump-administration-pauses-renewable-energy-approvals-public-lands-waters/\">to block</a> wind projects.</p>\n<p>Trump has repeatedly criticized renewable energy, especially wind, and has pledged to “drill baby, drill.”</p>\n<p>On Tuesday, Burgum also issued orders implementing additional Trump executive orders, including directing offices to identify regulations that can potentially be repealed to conform with Trump’s recent order that for every regulation there needs to be 10 deregulatory actions. </p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>Burgum also issued an order to implement Trump’s reversal of former President Biden’s <a href=\"https://thehill.com/policy/energy-environment/5070107-biden-drilling-ban-impact/\">move to bar</a> drilling off the East and West Coasts and parts of Alaska’s coast.</p>\n<p>“Today marks the beginning of an exciting chapter for the Department of the Interior,” Burgum said in a written statement. “We are committed to working collaboratively to unlock America’s full potential in energy dominance and economic development to make life more affordable for every American family while showing the world the power of America’s natural resources and innovation.” </p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/policy/energy-environment/5125858-burgum-trump-energy-emergency/",
            "pub_date": "2025-02-05 02:31:10",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5125866,
            "title": "Senate confirms Doug Collins as VA secretary",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>Former Georgia Rep. <a href=\"https://thehill.com/people/doug-collins/\" rel=\"noreferrer noopener\" target=\"_blank\">Doug Collins</a> (R) will lead the Department of Veterans Affairs after the Senate on Tuesday easily voted to confirm him as secretary.  </p>\n<p>The chamber voted 77-23, with roughly half of Senate Democrats joining all 53 Republicans in voting for Collins.</p>\n\n<p>The vote concludes a <a href=\"https://thehill.com/policy/defense/5102404-doug-collins-va-secretary-advances/\" rel=\"noreferrer noopener\" target=\"_blank\">relatively painless confirmation</a> process for Collins, who had an uncontentious nomination hearing before the Senate Veterans’ Affairs Committee last month.</p>\n<p>Among the top concerns for Democrat lawmakers was the potential for Collins to overturn a Biden administration rule that allows the VA to provide abortions to veterans for a pregnancy resulting from rape or incest, or when the life of a pregnant woman is at risk, even in states where it has been largely outlawed.</p>\n<p>Collins, a Navy veteran, Air Force Reserve chaplain and former pastor, during the <a href=\"https://thehill.com/policy/defense/5098795-trump-vet-health-care-reform/\" rel=\"noreferrer noopener\" target=\"_blank\">confirmation hearing</a> did not commit to upholding the two-year-old rule after being questioned by several senators.</p>\n<p>Collins will now oversee one of the federal government’s largest agencies, with more than 400,000 employees. But he comes to the VA at a time of upheaval under the new Trump administration.</p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>President Trump last month fired 17 inspectors general, including the top watchdog for the VA, sparking fears of a lack of accountability at the massive government agency, tasked with caring for millions of former service members. </p>\n<p>Senate Veterans’ Affairs Committee Chair Jerry Moran (R-Kansas), during Collins’s nomination hearing, had touted the VA Inspector General’s office as vital to the agency’s operations.</p>\n\n<p>“We work closely with the inspector general at VA,’ Moran said. “I find him valuable both to me and to this committee, and he should be valuable to the Department of Veterans Affairs.”</p>\n<p>VA officials also last month announced that the department had placed 60 employees on administrative leave. The employees’ roles were centered on diversity, equity and inclusion (DEI) work, and the move follows an executive order signed by Trump to ban all federal DEI programs.</p>\n<p>The VA has already been struggling with expanding its health care delivery system, with former service members facing major costs and long wait times for care. Collins pledged to tackle those issues if confirmed.</p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/policy/defense/5125866-doug-collins-confirmed-veterans-affairs/",
            "pub_date": "2025-02-05 02:25:54",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5125817,
            "title": "Buttigieg excites Democrats as he mulls Michigan Senate bid",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>Former Transportation Secretary Pete Buttigieg is considering a run for Michigan’s Senate seat, the latest development to roil what is quickly shaping up to be one of next year’s most competitive and closely watched races.</p>\n<p>Buttigieg moved to the Great Lakes State with his Michigan-native husband in 2022, triggering questions about his political future after eventually leaving his post in the Biden administration’s Transportation Department. Last week’s announcement from Sen. Gary Peters (D-Mich.) that he wouldn’t seek another term in 2026 appears to have opened a clear path for Buttigieg.</p>\n\n<p>While he would likely face opposition and wouldn’t automatically coast to the nomination, Democrats said they’re excited by the prospect of Buttigieg jumping in and suggested he would be an early favorite as one of the best surrogates for the party.</p>\n<p>“I’m excited,” said former Rep. Mark Schauer (D-Mich.) about the prospect of Buttigieg entering the race. “I think he is a rare political talent, which he’s demonstrated as the Transportation secretary and on the campaign trail.”</p>\n<p>Buttigieg has experienced one of the most rapid rises of any Democrat of the past five years, going from mayor of South Bend, Ind., to becoming one of the most prominent voices in the party. </p>\n<p>He turned in an unexpectedly impressive performance in the 2020 Democratic presidential primaries, winning the Iowa caucuses and nearly winning in New Hampshire. Though he dropped out in March, he endorsed then-candidate Joe Biden and became a key supporter, eventually joining Biden’s administration. </p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>Political observers have expected Buttigieg to seek elected office again, and he has been rumored as a possible 2028 presidential candidate. Early polling has often placed him as one of the top potential choices for Democrats. </p>\n<p>But a Senate run in 2026 may be the launching pad for a long political career regardless of any larger future ambitions. </p>\n\n<p>“If it’s your end-state goal to become president, this gets you to D.C. in one of the very top elected jobs in the country,” said Michigan Democratic strategist Adrian Hemond. </p>\n<p>Buttigieg had already been speculated to be planning a run for statewide office in Michigan since moving to Traverse City a few years ago, but much of that had focused on a possible gubernatorial run, with Gov. Gretchen Whitmer (D) reaching her term limit in 2026. </p>\n<p>But that quickly shifted, as did the calculus for several other possible candidates, after Peters decided <a href=\"https://thehill.com/homenews/campaign/5116481-senator-gary-peters-decision-creates-competitive-race/\" rel=\"noreferrer noopener\" target=\"_blank\">not to seek a third term</a>. Buttigieg and several others almost immediately expressed interest in the seat, and <a href=\"https://www.detroitnews.com/story/news/politics/2025/02/01/mayor-pete-buttigieg-eyes-senate-bid-as-he-passes-on-run-for-michigan-governor/78131367007/\" rel=\"noreferrer noopener\" target=\"_blank\">The Detroit News reported</a> on Saturday that he had officially ruled out running for governor and is “very seriously focused” on a possible Senate run. </p>\n<div class=\"civic-science-article-container civic-science-more-14 civic-is-mr3\" data-civicscience-widget=\"3f127ebd-287e-0b64-a901-d55ec286348a\" id=\"civsci-id-civsci-id-596708068\"></div>\n<p>Former Michigan Sen. Debbie Stabenow (D) told the outlet she expects “a lot of people will encourage” Buttigieg to run. </p>\n<p>Analysts said a Senate run makes more sense for Buttigieg and may be an easier lift than a gubernatorial run given his relative newness to the state. </p>\n<p>Pollster Steve Mitchell, the CEO of Mitchell Research &amp; Communications, said the firm conducted polling last year on the gubernatorial race and found in September that Buttigieg had a “huge lead” over other possible candidates. With Peters not running, a Senate bid would be easier to pull off for someone relatively new to the state, he said. </p>\n\n<p>“It seems to me, given the fact that he came to Michigan two years ago, is not originally from here, running for the Senate is a lot better position than running for governor,” Mitchell said, adding that running for governor requires a deeper understanding of the state government. </p>\n<p>Candidates seeking office in a state they’re relatively new to have often faced accusations of “carpetbagging,” but Mitchell said history shows many more instances of those candidates pulling off successful Senate runs than gubernatorial bids. </p>\n<p>He pointed to Robert F. Kennedy’s (D) successful bid for Senate in New York in 1964 despite his background in Massachusetts, and former Sen. Hillary Clinton’s (D) victory in New York in 2000 despite being from Arkansas. </p>\n\n<p>Schauer, who was the Democratic nominee for governor in 2014, said he’s not too worried about Buttigieg’s recent move being an issue for him as a candidate. He noted that Buttigieg’s husband, Chasten, is a Michigander and that South Bend is “a stone’s throw” away from Michigan, only a few miles away from the border. </p>\n<p>He also noted that Republicans could face their own attacks on this issue if the 2024 GOP Senate nominee, former Rep. Mike Rogers (R-Mich.), is nominated again. While Rogers represented Michigan in the House for more than a decade, he moved to Florida before moving back to Michigan shortly before mounting his run. </p>\n<p>Rogers, who came within 20,000 votes of Sen. Elissa Slotkin (D-Mich.) in the race, is <a href=\"https://thehill.com/homenews/campaign/5118606-mike-rogers-considering-michigan-senate-run/\" rel=\"noreferrer noopener\" target=\"_blank\">considering another run</a>. </p>\n\n<p>Matthew Morey, the communications chair for the Kent County Democratic Party in Michigan, said Buttigieg also has “deep” ties to the Midwest and has showed his “commitment” to that region of the country. And he argued that Buttigieg can have crossover appeal. </p>\n<p>“While he absolutely appeals to a huge swath of the Democratic base, he also has demonstrated that he can work with anybody who is wanting to make a little bit of progress,” Morey said. </p>\n<p>Buttigieg has blazed a bit of his own path in the media, often seeking out appearances on major conservative media channels and other seemingly hostile outlets. </p>\n\n<p>The Democrat appeared regularly on Fox News’s daytime newscasts during the 2024 campaign and sparred with Fox anchor Shannon Bream on the network’s public affairs show last summer over issues like immigration and crime. </p>\n<p>“There are a lot of Americans who my party can’t blame if they are ignoring our message because they will never hear it if we don’t go on and talk about it,” Buttigieg said while <a href=\"https://thehill.com/homenews/campaign/444492-buttigieg-defends-appearing-on-fox-town-hall-dems-cant-blame-americans-who/\" rel=\"noreferrer noopener\" target=\"_blank\">defending his decision</a> to appear on Fox in 2019.</p>\n<p>Still, Democrats said the field is open and they expect a competitive and lively primary. While a few other candidates have ruled out bids, others such as state Senate Majority Whip Mallory McMorrow (D) and Reps. Haley Stevens (D) and Hillary Scholten (D) are among the top names being floated, each certainly prominent within Michigan. </p>\n\n<p>“I don’t think that Buttigieg clears the field at all, but he’s certainly a very, very strong candidate, and if he gets into this race, I expect he will raise money very, very quickly,” Hemond said. </p>\n<p>Morey said Buttigieg would represent a “new generation of leadership” that would energize Democrats in Michigan, but the party boasts a deep bench of qualified candidates. </p>\n<p>“We always love a crowded primary,” he said. “It gives us the opportunity to show the full range of what it means to be a Democrat. … so having all of these different voices and perspectives in the primary really gets to showcase that.”</p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/homenews/campaign/5125817-peter-buttigieg-michigan-senate/",
            "pub_date": "2025-02-05 02:25:52",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5125755,
            "title": "McCabe: FBI in ‘utter disarray’",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>Andrew McCabe, the former acting director of the FBI, said the agency is in “utter disarray” amid an <a href=\"https://thehill.com/homenews/administration/5124328-trump-administration-purge-fbi/\">apparent purge</a> of law enforcement agents, officials and other employees who worked on probes into President Trump. </p>\n<p>McCabe joined CNN’s Anderson Cooper on Monday to discuss the state of play at the FBI, which has seen dozens of officials removed, including those who worked on Jan. 6 Capitol riot cases.</p>\n\n<p>“I’ve talked to more FBI people in the last four days than I did in the prior four years,” said McCabe, who served as acting director in 2017, until Trump appointed Christopher Wray to the post. </p>\n<p>“It is a place in utter disarray right now.”</p>\n<p>In just a few weeks, the Trump administration has <a href=\"https://thehill.com/homenews/administration/5109360-doj-fires-prosecutors-who-worked-on-trump-criminal-cases/\">removed dozens</a> of Department of Justice (DOJ) and FBI officials and thousands more are feared on the chopping block, given the sprawling nature of the investigations into Jan. 6 in particular. </p>\n<p>At the FBI, five of the highest-ranking career officials were forced out, as well as the heads of numerous field offices, including the top official at the Washington, D.C. branch.</p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>About 2,400 agents who were working on Jan. 6 cases across the country were on a list turned over to the administration, leaving their future at the bureau uncertain.</p>\n<p>“This is totally unprecedented,” McCabe said Monday. </p>\n\n<p>“This is a moment of terror for these people. It is absolutely disgraceful that they are being put through this in the middle of some political gamesmanship,” McCabe said of FBI rank-and-file. “They don’t deserve to be treated this way. It’s unlawful and it’s disgusting.”</p>\n<p>As the longtime No. 2 official at the FBI, McCabe presided over the investigation of Hillary Clinton’s use of a private email server and the Trump campaign’s alleged ties with Russia. He left that role in early 2018, facing fierce criticism from Trump. </p>\n<p>He was officially fired shortly before he entered retirement, though eventually <a href=\"https://thehill.com/regulation/court-battles/576883-mccabe-wins-back-full-fbi-pension-after-being-fired-by-trump/\">won back his full pension</a> following a legal fight. </p>\n<script type=\"text/javascript\">window.NREUM||(NREUM={});NREUM.info={\"beacon\":\"bam.nr-data.net\",\"licenseKey\":\"bb199f70cb\",\"applicationID\":\"738543775\",\"transactionName\":\"MQNTMhdXDxECABBZDAhJchMWQg4PTBMLQxdIFl4VEQ==\",\"queueTime\":0,\"applicationTime\":2515,\"atts\":\"HURERF9NHE5BAkYKGBsb\",\"errorBeacon\":\"bam.nr-data.net\",\"agent\":\"\"}</script>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/homenews/administration/5125755-mccabe-fbi-in-utter-disarray/",
            "pub_date": "2025-02-05 02:20:53",
            "source": "thehill",
            "language": "en"
        }
    ]
}