{
    "data": [
        {
            "id": 5758955,
            "title": "Florida has it right: No handouts for AI robber barons",
            "description": "<p>Florida is moving aggressively to position itself as a hub for innovation, including artificial intelligence. But as the state considers how to regulate AI and the infrastructure that supports it, one principle should remain nonnegotiable: Families should not be forced to bankroll Big Tech’s growth.</p>\n<p>That is the core idea behind Gov. Ron DeSantis’s (R) <a href=\"https://www.flgov.com/eog/news/press/2025/governor-ron-desantis-announces-proposal-citizen-bill-rights-artificial\" rel=\"noreferrer noopener\" target=\"_blank\">recent proposal</a> dealing with the <a href=\"https://www.flsenate.gov/Session/Bill/2026/482/BillText/Filed/HTML\" rel=\"noreferrer noopener\" target=\"_blank\">Artificial Intelligence Bill of Rights</a> and a <a href=\"https://www.flsenate.gov/Session/Bill/2026/484/BillText/Filed/HTML\" rel=\"noreferrer noopener\" target=\"_blank\">bill</a> that directly regulates data centers. The data center proposal specifically aims to prevent utilities from shifting the infrastructure costs of hyperscale AI data centers onto residential ratepayers. It would also bar taxpayer subsidies for those facilities and preserve local authority over siting decisions by applying these limits to new contracts and projects. </p>\n<p>If it becomes law, the bill would take effect July 1. The message is simple but important: Florida welcomes innovation, but it will not ask families to foot the bill for Big Tech welfare. Subsidizing AI data centers through utilities or tax policy is a hidden transfer from families to Big Tech, and Florida is right to stop it. </p>\n<p>AI data centers require extraordinary amounts of power, water, and supporting infrastructure. According to a <a href=\"https://www.eesi.org/articles/view/data-centers-and-water-consumption\" rel=\"noreferrer noopener\" target=\"_blank\">recent study</a> by the Environmental and Energy Study Institute, “Large data centers can consume up to 5 million gallons per day, equivalent to the water use of a town populated by 10,000 to 50,000 people.”</p>\n<p>When those demands are met through regulated utilities or public incentives, the costs rarely stay confined to the project itself. They are spread across rate bases, absorbed into tax policy and ultimately borne by households who never consented to subsidize the private development in the first place.</p>\n<p>Florida’s proposal draws a clear boundary around who should bear the costs of AI infrastructure. The <a href=\"https://www.flsenate.gov/Session/Bill/2026/484/BillText/Filed/HTML\" rel=\"noreferrer noopener\" target=\"_blank\">legislation</a> would prohibit utilities from passing data center infrastructure expenses on to residential ratepayers, bar taxpayer subsidies for hyperscale facilities and preserve local authority over siting decisions. In short, it treats AI data centers like any other private industrial project. If a company wants to build one, the company should pay for it.</p>\n<p>That principle is already being tested in real time. The legislation has already cleared both of its initial Senate committees unanimously <a href=\"https://www.flsenate.gov/Session/Bill/2026/482/?Tab=BillHistory\" rel=\"noreferrer noopener\" target=\"_blank\">and has advanced</a> to the Rules Committee, as the financial implications will soon come fully into focus. This is the stage where policy rhetoric meets fiscal reality, and where temptation to blur lines or carve out exceptions emerges.</p>\n<p>That balance matters beyond Florida. States <a href=\"https://www.forbes.com/sites/bryanrobinson/2025/02/16/artificial-intelligence-revolution-10-us-states-leading-the-pack/\" rel=\"noreferrer noopener\" target=\"_blank\">across the nation</a> are competing to attract AI investment, and many are turning to indirect subsidies that obscure who ultimately pays. Those arrangements may look painless on paper, but households feel them through higher bills and strained infrastructure long after the ribbon cuttings are over. </p>\n<p>A recent Harvard Electricity Law Initiative <a href=\"https://eelp.law.harvard.edu/wp-content/uploads/2025/03/Harvard-ELI-Extracting-Profits-from-the-Public.pdf\" rel=\"noreferrer noopener\" target=\"_blank\">paper</a> warns that utilities may socialize the costs of new power plants and power lines based on the premise that the public benefits, but the surging demand from data centers could force average consumers to subsidize the electricity costs of some of the world’s largest corporations.</p>\n<p>Florida is choosing a different approach. The <a href=\"https://www.flsenate.gov/Session/Bill/2026/482/BillText/Filed/HTML\" rel=\"noreferrer noopener\" target=\"_blank\">bill</a> makes clear that utilities may not recover data center infrastructure costs from residential ratepayers, drawing a bright line between private investment and public obligation. By insisting that AI companies internalize their own infrastructure costs and by anchoring consumer protections in statute, the state is drawing a line that other states should study closely. </p>\n<p>If artificial intelligence is going to reshape the economy, it should do so on its own merits. Families should not be forced to pay for private expansion through higher bills and back-door subsidies. Florida’s message is clear: Innovation is welcome, but welfare for Big Tech is not.</p>\n<p><em>Tony Vanderhoef is a law student at Florida State University and native Floridian. He is a contributor with Young Voices.</em></p>",
            "kind": 1,
            "link": "https://thehill.com/opinion/technology/5758955-big-tech-florida-regulation/",
            "pub_date": "2026-03-01 02:16:43",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5760620,
            "title": "Key pro-Israel Democrat to back war powers vote after Trump's Iran strikes",
            "description": "<p>Rep. Brad Schneider (D-Ill.), one of Capitol Hill’s staunchest allies of Israel, will support a war powers resolution limiting President Trump’s use of force in Iran.</p>\n<p>Schneider, a senior member of the Foreign Affairs Committee, has in recent days declined to say how he’d vote on the war powers resolution, which Democrats plan to force to the floor next week.</p>\n<p>But in the wake of Trump’s decision to launch strikes against Iran on Saturday morning, Schneider quickly announced that he will vote in favor of the resolution, which would require Trump to win Congressional approval to continue the operations in Iran.</p>\n<p>“Given this Administration’s failure to engage Congress in classified briefings, public hearings, and formal debate, I will vote to support the War Powers Resolution coming to the floor of the House next week,” <a href=\"https://schneider.house.gov/media/press-releases/schneider-statement-iran-0\">Schneider said in a statement</a>.</p>\n<p>Sponsored by Reps. Ro Khanna (D-Calif.) and Thomas Massie (R-Ky.), the war powers resolution is designed to reassert Congress’s authority to declare war, as delineated in the Constitution. It’s not expected to pass in the House, given the overwhelming opposition of Republicans and at least two Democratic allies of Israel, Reps. Josh Gottheimer (N.J.) and Jared Moskowitz (Fla.).</p>\n<p>Still, House Minority Leader Hakeem Jeffries (D-N.Y.) said Saturday that Democrats “remain committed” to forcing the resolution to the floor next week, which they intend to do using procedural moves to sidestep the opposition of Speaker Mike Johnson (R-La.) and other Republican leaders.</p>\n<p>Schneider emphasized that Iran has long posed a threat to the U.S., Israel and all Western democracies. But he said Trump’s decision to launch the strikes without briefing most members of Congress on the urgency of the threat has compelled him to support the Khanna-Massie resolution.</p>\n<p>“The President of the United States is not allowed to take our nation to war without authorization from Congress,” he said in his statement. “Speaker Johnson should immediately call the House back into session. The Administration must provide Congress with comprehensive classified briefings to understand the threat that justified today’s actions, the goals of the operation, and the strategy for achieving these goals. We need public hearings in House committees. We need formal public debate in the House and the Senate.” </p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/house/5760620-schneider-supports-war-powers-resolution/",
            "pub_date": "2026-03-01 02:16:42",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5760593,
            "title": "Canada's Carney backs Trump on Iran",
            "description": "<p>Canadian Prime Minister Mark Carney on Saturday backed President Trump’s <a data-id=\"https://thehill.com/homenews/ap/ap-international/ap-israels-defense-minister-says-his-country-has-attacked-iran-and-declares-a-state-of-emergency/mlite/\" data-type=\"link\" href=\"https://thehill.com/homenews/ap/ap-international/ap-israels-defense-minister-says-his-country-has-attacked-iran-and-declares-a-state-of-emergency/mlite/\">strikes on Iran</a> aimed at preventing the country from obtaining a nuclear weapon and pushed to further curb the regime’s actions.</p>\n<p>“Canada supports the United States acting to prevent Iran from obtaining a nuclear weapon and to prevent its regime from further threatening international peace and security,” Carney said in a <a href=\"https://x.com/MarkJCarney/status/2027721462233141679/photo/1\">statement</a>.</p>\n<p>“Canada’s position remains clear: the Islamic Republican of Iran is the principal source of instability and terror throughout the Middle East, has one of the world’s worst human rights records, and must never be allowed to obtain or develop nuclear weapons,” he added.</p>\n<p>The statement backing Trump’s strikes comes as several European allies <a href=\"https://thehill.com/policy/international/5760274-world-reaction-us-israel-strikes-iran/\">urge caution</a> and call for deescalation in the Middle East. Leaders of France, Germany and the United Kingdom urged the U.S. to <a href=\"https://thehill.com/policy/international/5760393-uk-france-germany-iran-strikes-negotiations/\">return to the negotiating table</a> with Iran. </p>\n<p>The support from Carney is also notable as Ottawa and Washington have repeatedly clashed during Trump’s first year back in office, with a rollercoaster relationship marked by sharp disagreements over trade and Trump’s steep tariffs.</p>\n<p>Tensions escalated last month after Carney delivered a speech in Davos, Switzerland, in which he declared a “rupture” in the old world order.</p>\n<p>Trump in his own speech said Canada <a href=\"https://thehill.com/policy/international/5703219-carney-trump-tensions-rise/\">“should be grateful to us”</a> and declared “Canada lives because of the United States,” telling the prime minister to “remember that.” </p>\n<p>After the president earlier this month threatened to block the opening of a major bridge between Detroit and Ontario, Carney said he had a <a href=\"https://thehill.com/policy/international/5732140-us-canada-bridge-dispute/\">“positive” conversation</a> with Trump.</p>\n<p>Carney on Saturday urged Canadians in Iran to shelter in place while calling for “the protection of all civilians in this conflict.” </p>",
            "kind": 1,
            "link": "https://thehill.com/policy/international/5760593-carney-supports-trump-iran-action/",
            "pub_date": "2026-03-01 01:45:56",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5760591,
            "title": "UN Security Council to hold emergency meeting after Iran strikes",
            "description": "<p>The United Nations Security Council will hold an <a href=\"https://main.un.org/securitycouncil/en/events/10112th-meeting-middle-east\">emergency meeting</a> on Saturday to discuss <a data-id=\"https://thehill.com/policy/defense/5760058-us-israel-launch-strikes-on-iran/\" data-type=\"link\" href=\"https://thehill.com/policy/defense/5760058-us-israel-launch-strikes-on-iran/\">joint strikes</a> launched by the U.S. and Israel on Iran early Saturday.</p>\n<p>French President Emmanuel Macron called for the meeting after the attack. He warned of “grave consequences for international peace and security” if the situation continues to escalate. </p>\n<p>“The ongoing escalation is dangerous for all. It must stop,” Macron <a href=\"https://x.com/EmmanuelMacron/status/2027718192643084649?s=20\">wrote</a> on social platform X. “The Iranian regime must understand that it now has no other option but to engage in good faith in negotiations to end its nuclear and ballistic programs, as well as its regional destabilization activities.”</p>\n<p>He added, “This is absolutely necessary for the security of all in the Middle East.”</p>\n<p>The forum comes after President Trump announced that the U.S. and Israel began a “major combat mission” in Iran following <a href=\"https://thehill.com/policy/international/5747127-trump-iran-nuclear-deal-outcome-timeline/\">weeks of threats</a> to the nation over its nuclear program. Despite several rounds of indirect talks between Washington and Tehran, Trump signaled he was dissatisfied with how the negotiations were going.</p>\n<p>He has <a data-id=\"https://thehill.com/policy/international/5747127-trump-iran-nuclear-deal-outcome-timeline/\" data-type=\"link\" href=\"https://thehill.com/policy/international/5747127-trump-iran-nuclear-deal-outcome-timeline/\">consistently threatened intervention</a> in Iran if the nations did not come to a new nuclear agreement. Trump withdrew the U.S. from a previous deal during his first administration.</p>\n<p>In a video <a data-id=\"https://truthsocial.com/@realDonaldTrump/116147082884192486\" data-type=\"link\" href=\"https://truthsocial.com/@realDonaldTrump/116147082884192486\">posted to his Truth Social</a> early Saturday, the president said the U.S. military is working to “defend the American people by eliminating imminent threats from the Iranian regime.”</p>\n<p>“Bombs will be dropping everywhere. When we are finished, take over your government. It will be yours to take; this will be probably your only chance for generations,” he said in the roughly 8-minute speech. “America is backing you with overwhelming strength and devastating force. Now is the time to seize control of your destiny.”</p>\n<p>U.N. Secretary-General António Guterres denounced the strikes in a Saturday statement <a href=\"https://x.com/antonioguterres/status/2027754597700206618\">posted to X</a>.</p>\n<p>“I condemn today’s military escalation in the Middle East,” Guterres wrote. “The use of force by the United States and Israel against Iran, and the subsequent retaliation by Iran across the region, undermine international peace and security.”</p>\n<p>He also “strongly” encouraged the U.S. and Iran to continue negotiations.</p>\n<p>Additionally, European Commission President Ursula von der Leyen announced she was “convening a special Security College” on Monday concerning the strikes. </p>\n<p>“For regional security and stability, it is of the utmost importance that there is no further escalation through Iran’s unjustified attacks on partners in the region,” von der Leyen <a href=\"https://x.com/vonderleyen/status/2027756878575362119\">posted</a> online.</p>\n<p>The security council will convene at 4 p.m. EST. </p>\n<p>The group <a href=\"https://main.un.org/securitycouncil/en/content/presidency\">rotates</a> leadership among member countries every month and is currently helmed by British Ambassador Barbara Woodward. The U.S. will assume the presidential role in the group on March 1. </p>",
            "kind": 1,
            "link": "https://thehill.com/policy/international/5760591-un-security-council-emergency-meeting-iran-strikes/",
            "pub_date": "2026-03-01 01:45:56",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5759473,
            "title": "Why the Mamdani-Trump 'bromance' makes sense right now",
            "description": "<p>NEW YORK — When he was campaigning to be mayor of the nation’s largest city, Zohran  Mamdani liked to say he was President Trump’s “worst nightmare.” </p>\n<p>In his victory speech in November, Mamdani took it a step further — calling Trump a “despot” and declaring that if anyone could show how to defeat him, “it’s the city that gave rise to him.” </p>\n<p>Trump returned the fire.</p>\n<p>He called Mamdani a “communist” and someone “who doesn’t know a damn thing” while threatening to withhold federal funds from New York. </p>\n<p>But on Thursday — for the second time since the mayor was elected in November — Trump and Mamdani not only met at the White House. Both sides emerged claiming to have a productive meeting. </p>\n<p>“It is the most fascinating bromance in America right now,” New York Democratic strategist Trip Yang said. </p>\n<p>To go from sparring as Mamdani campaigned “to where they are now, which looks like best buddies in a romcom, it’s simply remarkable.” </p>\n<p>It’s an unusual turn of events: Two politicians who have built their brands and support by opposing the other side were suddenly collaborative.</p>\n<p>And yet, political observers say the relationship makes sense.</p>\n<p>“Game recognizes game, and what I mean by that is they see something kindred in each other,” said Basil Smikle, a former executive director of the New York State Democratic Party. </p>\n<p>“They’re populist leaders. They appeal to very different bases for very different reasons, but they both have been able to create very strong movements around their respective candidacies, and are in firm control of that. I think they each recognize that, in attempting to go after the other person, their respective supporters are unshakeable.” </p>\n<p>During Thursday’s unscheduled meeting, Mamdani proposed a plan to build 12,000 units of housing in Queens. The plan would cost more than $21 billion, one of the largest federal investments in recent history. </p>\n<p>When he arrived at the White House for the closed-door Oval Office meeting, Mamdani also brought a copy of a 1975 New York Daily News front page that screamed: [Gerald] Ford to City: Drop Dead. He paired it with a mock Daily News cover featuring Trump’s face and another headline: “Trump to City: Let’s Rebuild.” </p>\n<p>A smiling Trump ended up holding both front pages in a photo that Mamdani shared on X, the social media site. </p>\n<p>“I’m looking forward to building more housing in New York City,” Mamdani wrote in the post. </p>\n<p>During their first White House meeting in November, Trump told Mamdani to come back to him with “some big ideas on how we can build some things together in New York City,” Joe Calvello, the mayor’s spokesperson, told reporters after the meeting, according to the New York Post. </p>\n<p>“And that’s what he did today,” Calvello said, adding that Trump was “enthusiastic” about the plan. “The mayor took him up on his offer and went to D.C.” </p>\n<p>Grant Reeher, a political science professor at Syracuse University, said the mayor had a good idea in taking the development proposal to a former real estate figure who was raised in Gotham and is known for his real estate empire there. </p>\n<p>“You’ve got the fact that they both care about New York, and you’ve got the fact [Mamdani] is coming to Trump with an idea about doing something that is in Trump’s wheelhouse,” Reeher said. </p>\n<p>Susan Del Percio, the longtime Republican strategist who is based in New York, said it is “quite smart” to go straight to Trump with proposals because “anything he can get from Trump makes him not as beholden to [New York Gov. Kathy] Hochul.” </p>\n<p>What does Trump get out of the deal? Del Percio was asked. </p>\n<p>“Probably his name on a building,” she said. </p>\n<p>Calvello said that during the meeting, Mamdani also swayed Trump to release a Columbia University student who had been obtained by Immigration and Customs Enforcement (ICE) officers earlier in the day. He also provided the president with a list of four others who had been apprehended by ICE officers. </p>\n<p>The Trump-Mamdani meeting came two days after Trump called the mayor in his State of the Union address “a nice guy.”</p>\n<p>“Actually speak to him a lot,” the president said. “Bad policy, but nice guy.” </p>\n<p>As he pushed for Congress to pass his voter-ID bill, the president pointed out Mamdani’s emergency snow-shoveling program in the Big Apple, arguing “if you apply for that job, you need to show two original forms of ID and a Social Security card.” </p>\n<p>“I can tell you, I didn’t expect this much attention nationwide on our emergency snow shoveler program,” Mamdani <a href=\"https://nam11.safelinks.protection.outlook.com/?url=https%3A%2F%2Fwww.nyc.gov%2Fmayors-office%2Fnews%2F2026%2F02%2Ftranscript--mayor-mamdani-ahead-of-feb--27-deadline--mayor-mamda&amp;data=05%7C02%7Ciswanson%40thehill.com%7C1dc76e9271164c2cee9308de763cebe9%7C9e5488e2e83844f6886cc7608242767e%7C1%7C0%7C639078201242847982%7CUnknown%7CTWFpbGZsb3d8eyJFbXB0eU1hcGkiOnRydWUsIlYiOiIwLjAuMDAwMCIsIlAiOiJXaW4zMiIsIkFOIjoiTWFpbCIsIldUIjoyfQ%3D%3D%7C0%7C%7C%7C&amp;sdata=eBSaZ3mL%2B85pKitMCex%2Fj7NDKy8BWgwKGrqFvGHVw4w%3D&amp;reserved=0\" rel=\"noreferrer noopener\" target=\"_blank\">quipped the next day</a>. </p>\n<p>Smikle also said New Yorkers seem generally approving, if not somewhat in awe, of Mamdani’s Trump approach. </p>\n<p>“Mamdani seems to have defanged Donald Trump. I think New Yorkers are proud of their mayor, but there’s also a curiosity: What is it about him that is so disarming?” </p>\n<p>But he cautioned that the mayor should still tread carefully with the unpredictable president.</p>\n<p>“Trump has, historically, tried to make sure that he feels he’s in control, and that people are paying appropriate deference to him,” he said. “What is very possible is that Trump could have this relationship with him today, on the surface, and then come around and try to test his resolve by doing other things that would make it seem that the relationship has been fractured, and that it’s Mamdani’s fault, and then force him into a situation where he then has to very publicly capitulate.” </p>\n<p>While Mamdani and Trump clearly see some positives in the bromance, Yang questioned how much further the relationship can progress as a win-win for both figures.</p>\n<p>“How long can the buddy cop saga play out? There may be times where that relationship is tested, so seeing how sustainable it is probably the biggest question mark.” </p>\n<p>More than 2 million New Yorkers voted in November’s election, marking the highest turnout for a mayoral election since 1969. Throughout his campaign, Mamdani, who is the youngest mayor of New York in more than a century, built his victory on an unusually diverse coalition, even attracting some Republicans by centering his campaign on economic issues including affordable housing. </p>\n<p>Since securing a surprise win in the primary in June, Mamdani has become one of the most visible faces of the progressive movement within the Democratic Party. That prominence has led some Democrats to wonder whether his newfound relationship with Trump could alienate parts of his base.</p>\n<p>But Del Percio poured cold water on that idea.</p>\n<p>“No one is thinking Mamdani is becoming a closet conservative,” she said.</p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/administration/5759473-mayor-mamdani-trump-relationship/",
            "pub_date": "2026-03-01 01:22:23",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5760555,
            "title": "Gulf countries coming under attack from Iran warn of retaliation",
            "description": "<p>Gulf countries expressed outrage on Saturday in the face of military attacks from the Islamic Republic of Iran, a rare show of unity in pushing back against Tehran in the wake of U.S. and Israeli strikes against the country. </p>\n<p>Iran is retaliating in the face of President Trump’s early Saturday decision to launch a major military operation with Israel aimed at toppling the regime in Tehran.</p>\n<p>Saudi Arabia, Qatar, the United Arab Emirates, Bahrain and Kuwait all appeared to have been targeted by Iranian attacks. Iran also targeted sites in Jordan. All of these countries host U.S. bases or forces in the region. </p>\n<p>“The regime has not capitulated in the least. At least not yet,” said Jonathan Schanzer, executive director of the Foundation for Defense of Democracies, a Washington based thinktank. </p>\n<p>“They are fighting back and so what we’re watching is this sort of test of wills,” he said in a briefing on Saturday, responding to Iran’s targeting of Gulf states. </p>\n<p>Saudi Arabia announced it would aid countries in repelling Iranian attacks. </p>\n<p>“Saudi Ministry of Foreign Affairs affirmed the Kingdom’s full solidarity with the countries concerned and its firm support for them, stating that it would mobilize all its capabilities to assist them in any measures they undertake,” the ministry said in a statement. </p>\n<p>The UAE, in a statement, emphasized that the country’s security is “indivisible” from its Gulf neighbors “and that any infringement on the sovereignty of any state constitutes a direct threat to the security and stability of the entire region.”</p>\n<p>Schanzer said it’s interesting to see the countries “banding together with the United States.” </p>\n<p>“The Emiratis and the Saudis are now speaking the same language,” he said.</p>\n<p>“They have been at odds with one another over the last several weeks, they are issuing statements of support for one another as Iranian missiles and drones are getting shot across the region.” </p>\n<p>Here’s a breakdown of attacks so far as this story develops: </p>\n<h2 class=\"wp-block-heading\"><strong>Saudi Arabia</strong></h2>\n<p>Saudi Arabia said Iranian attacks targeted the capital city of Riyadh and the Eastern Province. The Kingdom said it had successfully intercepted Iranian attacks. </p>\n<p>In a statement on X, the Saudi Foreign Ministry condemned Iranian strikes on its territory, calling them unjustified because the Kingdom had affirmed it would not allow its airspace to be used for any U.S. or Israeli attacks against the country. </p>\n<p>“These attacks cannot be justified under any pretext or in any way whatsoever, and they came despite the Iranian authorities’ knowledge that the Kingdom had affirmed it would not allow its airspace or territory to be used to target Iran,” <a href=\"https://x.com/KSAmofaEN/status/2027750941047349501?s=20\">the statement read.</a></p>\n<h2 class=\"wp-block-heading\"><strong>Bahrain</strong></h2>\n<p>Iran managed a strike against a service center of the U.S. Fifth Fleet naval base in Bahrain, Reuters reported </p>\n<p>The Kingdom of Bahrain said in a statement it “had been subjected to external attacks targeting sites and installations within its borders” but said it successfully intercepted some Iranian attacks. </p>\n<p>“The Government affirmed its full right to respond and to take all necessary measures to defend its national security and safeguard its sovereignty, in coordination with its allies and partners.”</p>\n<h2 class=\"wp-block-heading\"><strong>Qatar</strong></h2>\n<p>Qatar reportedly intercepted Iranian ballistic missiles targeting the Al-Udeid airbase in Doha, which hosts the U.S. Central Command. </p>\n<p>Qatar warned it reserves the right to retaliate in the face of Iranian strikes, but called for a cessation of hostilities and warned of a wider regional war. </p>\n<p>Qatar called for “efforts to contain the crisis in a manner that preserves the security of the region, safeguards the interests of its peoples, and prevents a slide into broader confrontations.”</p>\n<h2 class=\"wp-block-heading\"><strong>UAE</strong></h2>\n<p>Explosions were reported across Dubai and Abu Dhabi and the Emirati government said it reserved the right to respond. A Pakistani citizen was reportedly killed in the UAE related to the interception of an Iranian missile. </p>\n<p>“The UAE will not tolerate any compromise to its security or sovereignty under any circumstances,” the foreign ministry said in a statement on X. </p>\n<p>Reuters reported at least five booms in rapid succession that caused windows to vibrate in a house near Abu Dhabi’s Corniche, its premier waterfront promenade. </p>\n<h2 class=\"wp-block-heading\"><strong>Kuwait</strong></h2>\n<p>A drone targeted Kuwait’s International Airport on Saturday, resulting in minor injuries to a number of workers and limited material damage to the passenger termina, the General Authority of Civil Aviation said in a statement. </p>\n<p>Earlier on Saturday, Kuwait’s Armed Forces said it had “engaged aerial missiles detected in the airpsace.”</p>",
            "kind": 1,
            "link": "https://thehill.com/policy/international/5760555-gulf-unity-pushing-back-iran/",
            "pub_date": "2026-03-01 01:22:22",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5760552,
            "title": "Bolton says US strikes on Iran 'justifiable and necessary'",
            "description": "<p>Former national security adviser John Bolton defended the Trump administration’s decision to launch <a href=\"https://thehill.com/policy/defense/5760058-us-israel-launch-strikes-on-iran/\">preemptive strikes</a> on Iran over its continued nuclear program.</p>\n<p>“Trump has every right to eliminate threats from the ayatollahs, the IRGC, and Iran’s nuclear-weapons program,” Bolton <a href=\"https://x.com/AmbJohnBolton/status/2027753154872545365\">wrote Saturday</a> in a post on social platform X.</p>\n<p>“This mission is completely justifiable and necessary,” he continued. “The regime must fall, and the opposition needs the support of the West.”</p>\n<p>In an earlier <a href=\"https://x.com/AmbJohnBolton/status/2027744681275031673\">post</a>, the former Trump official called the operation “the most consequential decision of Donald Trump’s presidency.”</p>\n<p>Bolton <a href=\"https://thehill.com/policy/international/5743117-john-bolton-trump-iran-ayatollah/\">previously urged</a> the Trump administration to pursue regime change in the Middle Eastern nation.</p>\n<p>“I think he should have done that a long time ago and indeed I think the U.S. has watched Iran sustain its regime, oppress its people, engage in supporting the world’s worst terrorists, and actively pursue a nuclear weapons program for a long, long time, and we’ve let it happen, and Israel and others have paid the consequences for it,” Bolton said during an appearance on NewsNation’s “<a href=\"https://www.newsnationnow.com/on-balance-with-leland-vittert/trump-ayatollah-set-date-john-bolton/\">On Balance</a>” earlier this month.</p>\n<p>Trump, in a <a data-id=\"https://truthsocial.com/@realDonaldTrump/116147082884192486\" data-type=\"link\" href=\"https://truthsocial.com/@realDonaldTrump/116147082884192486\">Truth Social video</a> announcing the strikes, said his administration aims to “defend the American people by eliminating imminent threats from the Iranian regime.”</p>\n<p>“Bombs will be dropping everywhere. When we are finished, take over your government. It will be yours to take; this will be probably your only chance for generations,” he said in the video, which was posted at 2:30 a.m. EST. “America is backing you with overwhelming strength and devastating force. Now is the time to seize control of your destiny.”</p>\n<p>The president has consistently threatened “<a href=\"https://thehill.com/policy/international/5747127-trump-iran-nuclear-deal-outcome-timeline/\">unfortunate</a>” consequences for Iran if their regime refused to agree to a new nuclear deal with the U.S. </p>\n<p>Republicans in Congress have <a href=\"https://thehill.com/policy/international/5760326-republican-reaction-us-iran-strikes/\">lauded</a> the president’s decision to militarily intervene in the country, with Sen. Lindsey Graham (R-S.C.) also backing Trump’s calls for regime change. </p>\n<p>“His speech will go down in history as the catalyst for the most historic change in the Middle East in a thousand years. I echo President Trump’s call to the Iranian military, IRGC and security forces to lay down their arms,” he <a href=\"https://x.com/LindseyGrahamSC/status/2027706424533422531\">wrote on X</a>. “I echo his call to the Iranian people to take back their government.”</p>\n<p>However, the move has <a href=\"https://thehill.com/policy/international/5760274-world-reaction-us-israel-strikes-iran/\">drawn opposition</a> from several foreign countries, including the leaders of France, Germany and the United Kingdom. </p>\n<p>In a <a href=\"https://thehill.com/policy/international/5760393-uk-france-germany-iran-strikes-negotiations/\">joint statement</a> on Saturday morning, the three heads of state called on U.S. and Iranian officials to resume negotiations and urged the Iranian regime specifically “to seek a negotiated solution.”</p>\n<p>“Ultimately, the Iranian people must be allowed to determine their future,” the leaders wrote.</p>",
            "kind": 1,
            "link": "https://thehill.com/policy/international/5760552-john-bolton-donald-trump-us-israel-iran-strikes/",
            "pub_date": "2026-03-01 01:22:22",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5760308,
            "title": "Democrats say Trump hasn't learned lessons of history, has no strategic endgame with Iran strikes",
            "description": "<p>Democrats reacting to U.S. strikes early Saturday morning on Iran criticized President Trump, saying he has failed to learn from multiple failed U.S. interventions in the Middle East and accusing the president of sidestepping Congress in launching the attacks. </p>\n<p>Sen. <a href=\"https://thehill.com/people/mark-warner/\">Mark Warner </a>(D-Va.), the ranking Democrat on the Senate Intelligence Committee, questioned the need for the attack in his statement, and warned the U.S. could be repeating “mistakes of the past” in a nod to the Iraq War launched by former President George W. Bush.</p>\n<p>“The American people have seen this playbook before – claims of urgency, misrepresented intelligence, and military action that pulls the United States into regime change and prolonged, costly nation-building,” Warner wrote. </p>\n<p>“We owe it to our service members, and to every American family, to ensure that we are not repeating the mistakes of the past. The president owes the country clear answers: What is the objective? What is the strategy to prevent escalation? And how does this make Americans safer?”</p>\n<p>Rep. Jim Himes (D-Conn.), the top Democrat on the House Intelligence Committee also said the president had failed to learn “the lessons of history.”</p>\n<p>“Everything I have heard from the Administration before and after these strikes on Iran confirms this is a war of choice with no strategic endgame,” Himes said in a statement.</p>\n<p>“Military action in this region almost never ends well for the United States, and conflict with Iran can easily spiral and escalate in ways we cannot anticipate. It does not appear that Donald Trump has learned the lessons of history.”</p>\n<p>Trump, in <a href=\"https://www.newsnationnow.com/world/full-text-trump-announces-major-combat-operations-in-iran/\">a video</a> <a href=\"https://truthsocial.com/@realDonaldTrump/posts/116147082884192486\">posted to Truth Social</a> overnight, said the U.S. was “going to destroy their missiles and raze their missile industry to the ground” and also called for regime change in Iran.</p>\n<p>But Democratic critics called those goals unrealistic.</p>\n<p>“The goals laid out by President Trump — ending Iran’s destabilizing nuclear weapons program, dismantling its missile arsenal, crushing its proxy network, and regime change — are not the objectives of a limited strike,” said Rep. Gregory Meeks (D-N.Y.), the top Democrat on the House Foreign Affairs Committee. </p>\n<p>“They are the objectives of a prolonged war. Military force can degrade Iran’s capabilities, but without a defined end state and real diplomacy, these objectives invite escalation.” </p>\n<p>Several Democrats also faulted Trump for failing to account for his own actions that set the stage for the growth of Iran’s nuclear program as well as inconsistencies in his statements about the both risks of its nuclear capabilities and U.S. success in thwarting them.</p>\n<p>Sen Tim Kaine (D-Va.), one of the sponsors of a war powers resolution, noted it was Trump who in 2018 withdrew the U.S. from the Joint Comprehensive Plan of Action (JCPOA) initially signed in 2015, a deal that was effectively blocking Iran’s pathway to building a bomb.</p>\n<p>“Has President Trump learned nothing from decades of U.S. meddling in Iran and forever wars in the Middle East? Is he too mentally incapacitated to realize that we had a diplomatic agreement with Iran that was keeping its nuclear program in check, until he ripped it up during his first term?” <a data-id=\"https://thehill.com/homenews/senate/5760434-kaine-trump-us-iran-strikes-nuclear/\" data-type=\"link\" href=\"https://thehill.com/homenews/senate/5760434-kaine-trump-us-iran-strikes-nuclear/\">Kaine said</a>.</p>\n<p> Trump last June launched strikes on Iran, with the president at the time asserting the U.S. had “obliterated” Iran’s nuclear program.</p>\n<p>That claim generated much pushback, with skeptics arguing Iran wasn’t on the brink of developing a weapon, while additional intelligence showed the strikes landed in other Iranian facilities set their nuclear development back only by a few months.</p>\n<p>Others argued Trump simply didn’t have the military background to understand the commitment he was making of U.S. troops.</p>\n<p>“I went to war three times for this country and learned that when elites in Washington bang the war drums, working class folks pay the price. The tough talk of a five-time draft dodger falls flat for Americans tired of military adventurism. Americans want us out of the regime change business,” said Rep. Jason Crow (D-Colo.), a former Army Ranger who did tours in Iraq and Afghanistan.</p>\n<p>“Trump is plunging us into another war in the Middle East. He’s learned nothing from decades of failed conflicts. It’s a war of choice with no clear end game, no authorization from Congress, and little support from Americans.”</p>\n<p>Several Democrats raised constitutional issues with the strikes, stressing that the president must come to lawmakers to authorize war.</p>\n<p>“Congress must be fully briefed, and the administration must come forward with a clear legal justification, a defined end state, and a plan that avoids dragging the United States into yet another costly and unnecessary war,” Warner wrote.</p>\n<p>“Iran’s leadership has long supported terrorism across the region, undermined regional stability, continued to advance its nuclear ambitions, and brutally repressed its own people,” Warner said. “But acknowledging those realities does not relieve any president of the responsibility to act within the law, with a clear strategy, and with Congress.</p>\n<p>Sen. <a href=\"https://thehill.com/people/ed-markey/\">Ed Markey </a>(D-Mass.) called the U.S. attack “illegal and unconstitutional” because it was not approved by Congress.</p>\n<p>“Trump’s illegal actions raise the threat of escalation into a wider regional war with grave risks for U.S. troops and civilians in the region,” he wrote in a statement that also called for an immediate vote on a war powers resolution that has been introduced by Kaine and <a href=\"https://thehill.com/people/adam-schiff/\">Adam Schiff </a>(D-Calif.).</p>\n<p>“A diplomatic solution remains the best way to permanently and verifiably prevent Iran from acquiring a nuclear weapon,” Markey stated. “This is a crisis of Trump’s creation. Americans do not want another endless war in the Middle East.”</p>\n<p>Sen. <a href=\"https://thehill.com/people/ruben-gallego/\">Ruben Gallego </a>(D-Ariz.), a former Marine who served in Iraq, said in a statement posted on X also warned of the possibility the U.S. could be drawn into a bigger war.</p>\n<p>“The Iranian people deserve freedom and dignity. But we cannot send our men and women to die at the whim of the President,” he wrote. “The regime’s actions shouldn’t become an excuse for a wider war that punishes civilians and puts our troops at risk.”</p>\n<p>Trump has been <a data-id=\"https://thehill.com/policy/international/5760326-republican-reaction-us-iran-strikes/\" data-type=\"link\" href=\"https://thehill.com/policy/international/5760326-republican-reaction-us-iran-strikes/\">seeing support</a> for his actions from a number of Republican lawmakers, however, and at least one Democrat.</p>\n<p>Sen. <u><a href=\"https://thehill.com/people/john-fetterman/\">John Fetterman </a></u>(D-Pa.) in a statement offered support for the action.</p>\n<p>“Operation Epic Fury. President Trump has been willing to do what’s right and necessary to produce real peace in the region. God bless the United States, our great military, and Israel,” <a href=\"https://x.com/SenFettermanPA/status/2027674658091204808\">he wrote</a>.</p>\n<p><em>This story was posted at 8:14 a.m. and updated at 11:15 a.m.</em></p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/senate/5760308-congress-demands-answers-on-iran-strike/",
            "pub_date": "2026-03-01 00:46:46",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5760492,
            "title": "Iranian president, supreme leader believed to be alive after US attack",
            "description": "<p>Iran’s Foreign Minister Abbas Araghchi said Saturday that the country’s president and supreme leader were alive “as far as I know” after overnight U.S.-Israeli strikes included targets near government compounds.</p>\n<p>“As far as I know, yes they are alive and the head of judiciary as well, the speaker of parliament as well. All high-ranking officials are alive,” Araghchi <a href=\"https://www.nbcnews.com/video/full-interview-iranian-foreign-minister-reacts-to-u-s-and-israeli-strikes-in-iran-258481733776\">told NBC New</a>s said when asked specifically of President Masoud Pezeshkian and Ayatollah Ali Khamenei.</p>\n<p>When asked if he believed he was one of the targets, Araghchi responded: “Well I don’t know. They have targeted everybody,” citing an attack on a girls elementary school in southern Iran that he says killed 57, upping a previous death toll of 40, according to Iranian state media.</p>\n<p>Araghchi characterized the situation on the ground thus far as “under control.”</p>\n<p>“I think Americans and Israelis failed to… hit their targets,” he said, adding that Iran began its retaliation around two hours after the initial strikes on nearby American bases in neighboring Gulf states.</p>\n<p>“Almost all officials are safe and sound and alive. We may have lost one or two commanders but that is not a big problem,” Araghchi said.</p>\n<p>Iran has launched a number of missile strikes in neighboring countries that host U.S. bases including in Jordan, Kuwait, Qatar and United Arab Emirates, some of which were intercepted.</p>\n<p>Explosions were also heard in and around Jerusalem with Israeli defense forces also reporting missile interceptions in Haifa in northern Israel.</p>\n<p>Araghchi said he had been in contact with Persian Gulf states about retaliatory attacks, expressing his intent to not attack them and instead target American bases “in the act of self-defense.”</p>\n<p>“We cannot just sit and watch,” he said.</p>\n<p>He also criticized the Trump administration for launching the attack as negotiations over Iran’s nuclear program were underway, citing a recent meeting in Geneva with Steve Witkoff and Jared Kushner that he said went well. </p>\n<p>“Everybody was happy,” Araghchi said. “A deal was at our reach.”</p>",
            "kind": 1,
            "link": "https://thehill.com/policy/international/5760492-araghchi-officials-alive-iran/",
            "pub_date": "2026-03-01 00:46:45",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5760484,
            "title": "Boebert posts Bill Clinton photo from deposition",
            "description": "<p>Rep. Lauren Boebert (R-Colo.) on Friday leaked a photo of former President Clinton as he was <a data-id=\"https://thehill.com/homenews/house/5759750-bill-clinton-epstein-deposition/\" data-type=\"link\" href=\"https://thehill.com/homenews/house/5759750-bill-clinton-epstein-deposition/\">being deposed</a> by the House Oversight and Government Reform Committee in its investigation of convicted sex offender Jeffrey Epstein.</p>\n<p>Boebert <a data-id=\"https://x.com/laurenboebert/status/2027550801623711798\" data-type=\"link\" href=\"https://x.com/laurenboebert/status/2027550801623711798\">posted an image</a> of a smiling Clinton on social platform X, a day after being <a data-id=\"https://thehill.com/homenews/house/5757287-hillary-clinton-deposition-boebert-photo/\" data-type=\"link\" href=\"https://thehill.com/homenews/house/5757287-hillary-clinton-deposition-boebert-photo/\">reprimanded</a> for leaking a photo of former secretary of state Hillary Clinton during <a data-id=\"https://thehill.com/homenews/house/5758013-hillary-clinton-epstein-deposition/\" data-type=\"link\" href=\"https://thehill.com/homenews/house/5758013-hillary-clinton-epstein-deposition/\">her deposition</a>.</p>\n<p>“‘What difference, at this point, does it make?’- HRC” the Colorado Republican wrote in the caption, crediting the former secretary.</p>\n<p>The quote was likely in <a href=\"https://www.nationalreview.com/corner/hillary-clinton-what-difference-point-does-it-make-nathaniel-botwinick/\">reference</a> to Hillary Clinton’s 2013 testimony before Congress about the Benghazi attack on two U.S. government facilities in Libya a year earlier. Clinton, who was the nation’s top diplomat at the time, was held accountable for security lapses around the tragedy.</p>\n<p>“With all due respect, the fact is, we had four dead Americans,” she said at the time, in a response to a question from Sen. Ron Johnson (R-Wisc.) about the Obama administration’s response.</p>\n<p>“Was it because of a protest or because of guys out for a walk one night who decide to kill some Americans, what difference at this point does it make?” the former first lady continued. “It is our job to figure out what happened and do everything we can to prevent it from ever happening again, Senator.”</p>\n<p>The Clintons were subpoenaed by the House Oversight Committee after the duo were named in <a data-id=\"https://thehill.com/homenews/administration/5715028-epstein-documents-publicly-available/\" data-type=\"link\" href=\"https://thehill.com/homenews/administration/5715028-epstein-documents-publicly-available/\">files released</a> by Epstein’s estate and the Department of Justice (DOJ) <a data-id=\"https://thehill.com/homenews/administration/5612631-epstein-files-transparency-act/\" data-type=\"link\" href=\"https://thehill.com/homenews/administration/5612631-epstein-files-transparency-act/\">under a law</a> signed by President Trump. They have <a data-id=\"https://thehill.com/homenews/house/5758942-bill-clinton-jeffrey-epstein-deposition/\" data-type=\"link\" href=\"https://thehill.com/homenews/house/5758942-bill-clinton-jeffrey-epstein-deposition/\">denied any knowledge</a> or participation in the disgraced financier’s crimes.</p>\n<p>The Clintons were deposed this week in Chappaqua, N.Y., after a strained back-and-forth between the couple’s lawyers and House Oversight Chair James Comer (R-Ky.) over terms of the deposition. Hillary Clinton initially <a data-id=\"https://thehill.com/homenews/house/5724172-hillary-clinton-public-deposition-epstein-probe/\" data-type=\"link\" href=\"https://thehill.com/homenews/house/5724172-hillary-clinton-public-deposition-epstein-probe/\">pushed for a public testimony</a>, but they later <a data-id=\"https://thehill.com/homenews/house/5719536-bill-hillary-clinton-testify-house-oversight-epstein/\" data-type=\"link\" href=\"https://thehill.com/homenews/house/5719536-bill-hillary-clinton-testify-house-oversight-epstein/\">reversed course</a> after Comer <a data-id=\"https://thehill.com/homenews/administration/5721434-clintons-congressional-testimony-investigation/\" data-type=\"link\" href=\"https://thehill.com/homenews/administration/5721434-clintons-congressional-testimony-investigation/\">threatened</a> contempt proceedings.</p>\n<p>Her testimony hit a brief road bump on Thursday after Boebert <a href=\"https://thehill.com/homenews/house/5758890-boebert-on-hillary-clinton-deposition-photo-leak-the-democrats-were-breaking-the-rules-too/\">shared a photo</a> of the former first lady with right-wing podcaster Benny Johnson, who subsequently <a href=\"https://x.com/bennyjohnson/status/2027165683016933479?s=20\">posted the image</a> to social media. </p>\n<p>The lawmaker <a data-id=\"https://thehill.com/homenews/house/5758890-boebert-on-hillary-clinton-deposition-photo-leak-the-democrats-were-breaking-the-rules-too/\" data-type=\"link\" href=\"https://thehill.com/homenews/house/5758890-boebert-on-hillary-clinton-deposition-photo-leak-the-democrats-were-breaking-the-rules-too/\">defended the action</a> in an interview with NewsNation’s Chris Cuomo on Thursday, blaming Democratic members of the committee who shared updates about the deposition earlier with reporters.</p>\n<p>“However, there were Democrats and those at the minority party that were releasing information about the hearing throughout the day, topics that were discussed were being leaked to the media,” the lawmaker said. “And so there was a lot of things that were coming out of that room, but regardless, it was a photo.”</p>\n<p>Comer on Friday told NewsNation, The Hill’s sister network, that the committee intends to release video of the depositions soon. He added that he plans to talk to House leadership about the incident — after he asked his fellow lawmakers to refrain from posting photos.</p>\n<p>Asked if the leaks could make it more difficult for others to agree to testify, Comer said “It doesn’t help.”</p>\n<p>“I think she’s going to have to answer for herself why she did that,” he told NewsNation’s Katie Pavlich. “I don’t think President Clinton will be as dramatic about it as Hillary Clinton was, but again, we said no pictures. I said no pictures, and that picture was released.”</p>\n<p>“I said no pictures, and that picture was released. Again, it’s an unfortunate situation, but I don’t think that in any way, shape or form delegitimizes the deposition,” he added.</p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/house/5760484-boebert-bill-clinton-deposition-epstein-files/",
            "pub_date": "2026-03-01 00:46:45",
            "source": "thehill",
            "language": "en"
        }
    ]
}