{
    "data": [
        {
            "id": 5126273,
            "title": "Senate preparing to move first on budget package amid House stalemate",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>Senate Budget Committee Chair Lindsey Graham (R-S.C.) will brief Republican senators Wednesday about moving first on a budget resolution to lay the groundwork for a package focused on border security, energy and defense that could pass the Senate with a simple majority while House Republicans remain deadlocked on how to move forward.</p>\n<p>Graham and other Republican senators are eager to get started on phase one of Trump’s agenda by moving a budget reconciliation package that would include about $100 billion in funding to secure the U.S.-Mexico border, reforms to expand oil and gas drilling and a substantial plus-up in defense spending.</p>\n\n<p>Their plan would move legislation to extend the expiring 2017 tax cuts in a second budget reconciliation package later this year.</p>\n<p>Senate Republican Whip John Barrasso (R-Wyo.) said that House Republicans “right now” are “not able to move at the level we’d like them to move.”</p>\n<p>“We do have a bill ready to go here and Sen. Graham is going to be briefing the conference on that tomorrow at lunch,” Barrasso.</p>\n<p>House Republicans this week were <a href=\"https://thehill.com/homenews/house/5124454-gop-trump-agenda-vote-delay/\" rel=\"noreferrer noopener\" target=\"_blank\">forced to delay an initial vote</a> on their version of the legislation amid jockeying among Republicans over how deep the spending cuts it should include.</p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>Barrasso said Senate Republicans will head to Florida this weekend and will meet with President Trump Friday night to gauge his interest in the Senate moving before the House on a budget reconciliation package to enact at least half of his legislative agenda.</p>\n<p>He said GOP senators will “see if he’d like us to move forward” on a package focused on border security, energy and defense.</p>\n\n<p>The Wyoming senator said Graham will update GOP colleagues “on where he is in terms of putting together the budget for the reconciliation.”</p>\n<p>“What he’s been working on, of course, is … the immediacy of border security, energy security, defense, national security. Those parts of things,” he said.</p>\n<p>Speaker Mike Johnson (R-La.), however, told reporters Tuesday afternoon that the plan is still for the House, not the Senate, to move forward on a budget package that would encompass border security, energy, defense and tax legislation.</p>\n<div class=\"civic-science-article-container civic-science-more-14 civic-is-mr3\" data-civicscience-widget=\"3f127ebd-287e-0b64-a901-d55ec286348a\" id=\"civsci-id-civsci-id-596708068\"></div>\n<p>“The Senate will not take the lead. We’ll take the lead. We’re right on schedule,” he said.</p>\n<p>Johnson noted that he will meet with Republican members of the House Budget Committee Tuesday evening to discuss a path forward.</p>\n<p>“It’s not yet determined whether we’ll be marking up this week or not,” he said. “We’re having an important meeting tonight with key figures on the committee and others to sort through it. But this is the deliberative process.”</p>\n\n<p>“We’re well within the margins of time that we have to work on and I’m very optimistic about it. We’ve made a lot of progress,” he said.</p>\n<p>A source familiar with the House schedule told The Hill Tuesday that the budget resolution would be delayed in the House.</p>\n<p>“There will not be a budget resolution markup this week,” the source said. “Leadership provided an ambitious timeline, and the House is doing the best it can to meet that.”</p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/homenews/senate/5126273-senate-budget-package-house-stalemate/",
            "pub_date": "2025-02-05 04:16:02",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5126204,
            "title": "Democrats call for investigation into Musk access of Treasury payment systems",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>Two Senate Democrats called for an investigation Tuesday into tech billionaire Elon Musk’s access of Department of Treasury payment systems.</p>\n<p>“We write to ask that the Government Accountability Office (GAO) conduct an investigation of reports indicating that Treasury Secretary Scott Bessent granted Elon Musk and other ‘Department of Government Efficiency’ employees unprecedented access to the federal government’s payment systems on January 31, 2025,” a <a href=\"https://www.banking.senate.gov/imo/media/doc/letter_to_gao_on_musk_and_treasury.pdf\">letter from</a> Sens. Ron Wyden (D-Ore.) and Elizabeth Warren (D-Mass.) to the Government Accountability Office’s (GAO) head Gene Dodaro reads.</p>\n\n<p>“These reports are deeply troubling. These critical systems process trillions of dollars of transactions each year and contain sensitive personal and financial information for tens of millions of Americans,” Wyden and Warren continued.</p>\n<p>David Lebryk, a top Treasury Department nonpolitical career official, <a href=\"https://thehill.com/homenews/administration/5119996-david-lebryk-retirement-treasury-doge-musk/\">retired at the end of last </a>week in the wake of him butting heads with Musk allies on government payment systems, a source previously told The Hill. </p>\n<p>Lebryk’s retirement followed a clash over a request from Musk’s Department of Government Efficiency (DOGE) for access to a payment system used by Treasury officials to disburse funds.</p>\n<p>Warren <a href=\"https://thehill.com/policy/technology/5123220-elizabeth-warren-letter-treasury-secretary/\">also sent a letter</a> to Treasury Secretary Scott Bessent on Monday pushing to know what access Musk had been given to the federal payments system, as well as safeguards put in place to guard Americans’ private data and prevent abuses.</p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>“In addition, the access provided to Mr. Musk and his team has important privacy implications for millions of Americans,” the Oregon and Massachusetts Democrats said. “The Treasury payment systems include ‘sensitive personal information about the millions of Americans who receive Social Security checks, tax refunds and other payments from the federal government.’ It is not clear why these individuals were granted unfettered access to such data, what they could do with it once inside these systems.”</p>\n<p>The Hill has reached out to the White House, the GAO and the Treasury Department for comment.</p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/homenews/senate/5126204-democrats-call-for-investigation-into-musk-access-of-treasury-payment-systems/",
            "pub_date": "2025-02-05 04:10:52",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5124487,
            "title": "Project 2025’s World Bank plan would backfire on America",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>Project 2025’s call for U.S. <a href=\"https://www.devex.com/news/devex-newswire-trump-wastes-no-time-on-foreign-aid-climate-and-health-109083\">withdrawal from the World Bank</a> threatens to hand America’s competitors a historic victory. While the blueprint correctly diagnoses the bank’s inefficiencies, its prescription would be catastrophic for U.S. interests. </p>\n<p>Having moved from World Bank leadership to private sector corporate affairs, I can attest that it needs urgent reform — but abandoning it would be a strategic blunder of the highest order.</p>\n\n<p>The World Bank, for all its faults, remains America’s most powerful tool for global development leadership. When I led health reforms in countries from Armenia to Romania, I saw firsthand how its technical expertise and convening power advanced both development goals and American interests. In almost every case, countries chose the World Bank over other partners because of its unique ability to mobilize resources and expertise at scale.</p>\n<p>However, Project 2025’s criticism isn’t entirely wrong. The bank’s operating model desperately needs modernization. Drawing from my private sector experience, three market-based reforms could transform the institution’s effectiveness while preserving American leadership.</p>\n<p>First, revolutionize the workforce strategy. While private sector companies embrace flexible contracting to match staffing with evolving needs, the World Bank remains wedded to lifetime tenure for most positions. This rigidity wastes resources and stifles innovation. The bank should adopt private sector-style staffing models that prioritize impact over job security, while maintaining core institutional knowledge.</p>\n<p>Second, implement systematic market segmentation. The World Bank’s current country-by-country approach to defining priorities is inefficient and often politically driven. Instead, it should develop a comprehensive market taxonomy — similar to how private companies segment markets — to determine where and how to invest resources. This would prevent the wasteful tendency to try everything everywhere and enable more strategic resource allocation.</p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>Third, rationalize the development finance landscape. Multiple agencies offering similar services with different terms creates inefficiency and enables “double-dipping” by borrowers. The U.S. should lead efforts to coordinate development partners and establish clear divisions of labor, similar to how private sector companies form strategic alliances to maximize impact.</p>\n<p>Critics might argue these reforms are too difficult to implement in a multilateral institution. But the alternative — U.S. withdrawal — would create a dangerous vacuum. China, through initiatives like the <a href=\"https://crsreports.congress.gov/product/pdf/IF/IF10154/17\" rel=\"noreferrer noopener\" target=\"_blank\">Asian Infrastructure Investment Bank</a> and the <a href=\"https://www.cfr.org/backgrounder/chinas-massive-belt-and-road-initiative\" rel=\"noreferrer noopener\" target=\"_blank\">Belt and Road Initiative</a>, stands ready to fill any void left by American retreat. The resulting loss of U.S. influence would far outweigh any short-term savings from withdrawal.</p><!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://thehill.com/submitting-opinion-content/\"><img alt=\"\" class=\"wp-image-4329764\" decoding=\"async\" height=\"121\" loading=\"lazy\" sizes=\"(max-width: 899px) 100vw, 600px\" src=\"https://thehill.com/wp-content/uploads/sites/2/2023/11/op2.png?w=600\" srcset=\"https://thehill.com/wp-content/uploads/sites/2/2023/11/op2.png?resize=600,121 600w, https://thehill.com/wp-content/uploads/sites/2/2023/11/op2.png?resize=300,61 300w, https://thehill.com/wp-content/uploads/sites/2/2023/11/op2.png?resize=50,10 50w\" width=\"600\"/></a></figure>\n\n<p>The new administration, currently debating World Bank funding, should instead use America’s position as the bank’s largest shareholder to drive these reforms. By modernizing the World Bank rather than abandoning it, the U.S. can maintain its global leadership while ensuring development dollars deliver maximum impact.</p>\n<p>The World Bank isn’t perfect, but it’s an invaluable instrument of American soft power and global development. The solution isn’t to destroy it, but to transform it. In an era of intensifying great power competition, that’s not just good development policy — it’s smart foreign policy.</p>\n<p><em>Dr. Adanna Chukwuma is a physician and development strategist with leadership experience in the World Bank and Fortune 500 companies. She holds degrees from Oxford and Harvard Universities and is a fellow of the OpEd Project.</em></p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/opinion/5124487-world-bank-reform-strategic/",
            "pub_date": "2025-02-05 04:01:06",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5124446,
            "title": "Live updates: Senate panels advance Gabbard, RFK Jr.; federal employees sue over Trump moves",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>Senate panels on Tuesday advanced the nominations of Tulsi Gabbard to be director of national intelligence and Robert F. Kennedy to lead the Department of Health and Human Services.</p>\n<p>Both votes were strictly along party-lines, but likely pave the way for two of President Trump’s most controversial nominees to be confirmed.</p>\n\n<p>Also on Tuesday, federal employees filed a number of lawsuits against Trump moves.</p>\n<p>Two Office of Personnel Management (OPM) employees are <a href=\"https://thehill.com/homenews/administration/5126073-opm-email-system-battle/?tbref=hp\" rel=\"noreferrer noopener\" target=\"_blank\">asking a court to block the agency</a> from using computer systems and emails connected with its buyout offers to federal employees.</p>\n<p>And 16 current agents are suing the FBI and the Department of Justice (DOJ), saying their review of those who worked on the cases of some 1,500 Jan. 6 defendants is a preparation to retaliate against agents.</p>\n<p>Also, Benjamin Netanyahu is in Washington meeting with President Trump about a future for Gaza.</p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>Read on for updates on these stories and more.</p>\n<div class=\"5124446\" id=\"wpcom-liveblog-container\"></div>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/homenews/administration/trumps-first-100-days/5124446-live-updates-gabbard-rfk-jr-usaid-trump-house-senate/mlite/",
            "pub_date": "2025-02-05 03:55:49",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5126182,
            "title": "Trump to sign executive order banning transgender athletes from women’s sports",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>President Trump is expected to sign an executive order Wednesday <a data-id=\"https://thehill.com/homenews/campaign/4936727-trump-bans-transgender-athletes/\" data-type=\"link\" href=\"https://thehill.com/homenews/campaign/4936727-trump-bans-transgender-athletes/\">banning transgender athletes</a> from competing in girls’ and women’s sports, the latest in a <a data-id=\"https://thehill.com/homenews/administration/5093503-trump-executive-orders-incoming/\" data-type=\"link\" href=\"https://thehill.com/homenews/administration/5093503-trump-executive-orders-incoming/\">string of executive actions </a>from the new administration to take aim at LGBTQ rights. </p>\n<p>The order, which Trump is expected to sign Wednesday afternoon, coincides with National Girls and Women in Sports Day, which is recognized annually in February to celebrate the accomplishments of female athletes. The Women’s Sports Foundation, which co-founded National Girls and Women in Sports Day in 1987, has <a href=\"https://www.womenssportsfoundation.org/media_statement/wsf-statement-in-response-to-the-department-of-educations-notice-of-proposed-rulemaking/\">opposed categorical bans</a> on transgender athletes, claiming such policies “limit opportunities and harm the development of both cisgender and transgender girls and women.” </p>\n\n<p>The organization did not immediately return a request for comment on Trump’s forthcoming order. </p>\n<p>On the campaign trail, Trump promised repeatedly to <a data-id=\"https://thehill.com/homenews/ap/ap-business/ap-trump-orders-reflect-his-promises-to-roll-back-transgender-protections-and-end-dei-programs/\" data-type=\"link\" href=\"https://thehill.com/homenews/ap/ap-business/ap-trump-orders-reflect-his-promises-to-roll-back-transgender-protections-and-end-dei-programs/\">ban transgender athletes from sports</a> if he were reelected. During a town hall event in Georgia in October, Trump signaled he would do so through an executive order. </p>\n<p>“The president bans it,” Trump said in response to a question about how he would handle “the transgender issue” in women’s sports. “You just don’t let it happen. Not a big deal.” </p>\n<p>Most Americans believe transgender athletes should not be allowed to compete on sports teams that match their gender identity, <a href=\"https://news.gallup.com/poll/507023/say-birth-gender-dictate-sports-participation.aspx\">a 2023 Gallup poll found</a>. According to <a href=\"https://apnews.com/projects/election-results-2024/votecast/\">AP VoteCast</a>, a survey of 120,000 voters nationwide, more than half of voters in the 2024 elections — including a majority of Trump voters — said support for trans rights in government and society has gone too far. </p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>The exact number of transgender athletes participating in school sports in the U.S. is unknown. While more than half of states have adopted policies to stop them from competing, lawmakers have often <a href=\"https://apnews.com/article/lawmakers-unable-to-cite-local-trans-girls-sports-914a982545e943ecc1e265e8c41042e7\">struggled to cite specific examples</a> of trans athletes in their states. </p>\n<p>In rejecting Utah’s 2022 transgender athlete ban, Republican Gov. Spencer Cox wrote <a href=\"https://governor.utah.gov/press/gov-cox-why-im-vetoing-hb11/\">in a veto message</a> that the state’s high school activities association had identified only four trans student-athletes that year, none of them the subject of complaints from students, families or administrators. </p>\n\n<p>“Four kids and only one of them playing girls sports. That’s what all of this is about,” Cox wrote at the time. “Four kids who aren’t dominating or winning trophies or taking scholarships. Four kids who are just trying to find some friends and feel like they are a part of something. Four kids trying to get through each day.”</p>\n<p>“Rarely has so much fear and anger been directed at so few,” he added.</p>\n<p>In December, NCAA President Charlie Baker, a former Republican governor of Massachusetts, told a Senate panel that there are <a href=\"https://thehill.com/homenews/lgbtq/5046662-ncaa-president-transgender-athletes-college-sports/\">fewer than 10 transgender athletes</a> he is aware of who currently compete in college sports, accounting for less than .002 percent of NCAA athletes nationwide. </p>\n<div class=\"civic-science-article-container civic-science-more-14 civic-is-mr3\" data-civicscience-widget=\"3f127ebd-287e-0b64-a901-d55ec286348a\" id=\"civsci-id-civsci-id-596708068\"></div>\n<p>Baker, who has faced mounting pressure from Republicans and conservative organizations to ban transgender athletes from college sports, said he would not adopt such a policy because federal courts have consistently sided with participation, but he would be open to with Congress to create a “federal standard” for eligibility. </p>\n<p>The National Association of Intercollegiate Athletics, which oversees collegiate sports at 241 mostly small colleges across the country, approved a policy <a href=\"https://thehill.com/homenews/state-watch/4581383-small-college-association-bans-transgender-athletes-from-womens-sports/\">barring most transgender women</a> from competition in April. </p>\n<p>House Republicans, with <a href=\"https://thehill.com/homenews/house/5085485-cuellar-gonzalez-transgender-athletes-bill/\">support from two Democrats</a>, passed legislation in January to ban transgender athletes from competing in women’s sports. </p>\n\n<p>Wednesday’s executive order is the latest move from Trump and his administration to <a data-id=\"https://thehill.com/homenews/administration/5099118-trump-executive-order-trans-rights/\" data-type=\"link\" href=\"https://thehill.com/homenews/administration/5099118-trump-executive-order-trans-rights/\">roll back transgender rights</a>.  </p>\n<p>The president, during his first few days back in office, signed orders declaring the government <a data-id=\"https://thehill.com/homenews/administration/5097278-trump-executive-order-gender-transition/\" data-type=\"link\" href=\"https://thehill.com/homenews/administration/5097278-trump-executive-order-gender-transition/\">recognizes only two sexes</a>, barring transgender people from <a data-id=\"https://thehill.com/policy/defense/5111819-trump-executive-order-transgender-military/\" data-type=\"link\" href=\"https://thehill.com/policy/defense/5111819-trump-executive-order-transgender-military/\">serving openly</a> in the military, threatening <a data-id=\"https://thehill.com/homenews/education/5113202-trump-schools-executive-order-crt-gender-ideology/\" data-type=\"link\" href=\"https://thehill.com/homenews/education/5113202-trump-schools-executive-order-crt-gender-ideology/\">funding for schools</a> that teach “radical gender ideology” and curbing federal support for <a data-id=\"https://thehill.com/homenews/lgbtq/5112282-trump-issues-executive-order-to-ban-gender-affirming-care-for-minors/\" data-type=\"link\" href=\"https://thehill.com/homenews/lgbtq/5112282-trump-issues-executive-order-to-ban-gender-affirming-care-for-minors/\">gender-affirming care</a> for transgender young people. </p>\n<p><em>Brett Samuels contributed.</em></p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/homenews/administration/5126182-donald-trump-executive-order-transgender-sports-ban/",
            "pub_date": "2025-02-05 03:51:01",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5126109,
            "title": "1 in 3 NY voters would reelect Hochul: Survey",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>Just 1 in 3 New York voters say they would vote to reelect Gov. Kathy Hochul (D-N.Y.), a new survey found.</p>\n<p>According to the survey, <a href=\"https://scri.siena.edu/wp-content/uploads/2025/02/SNY-February-2025-Poll-Release-FINAL-1.pdf?mkt_tok=NTU2LVlFRS05NjkAAAGYcN_s2u-RTKwT0RID6wipLOv-_kqipfIo4bKjbvSh-DjR05RHBZsbkaqR9N6F9iYM7kHrO0bAeUvoDscQkV7AmA-ks6QOZ51ejfVL5kuf2bRX\">released Monday</a> by Siena College’s Research Institute, 31 percent of New York voters say they would reelect Hochul while 57 percent say they want to vote for “someone else.”</p>\n\n<p>The results are similar to a survey conducted in December 2024, where Hochul also received a largely negative favorability rating. Currently, just 55 percent of Democrats view her favorably.</p>\n<p>New Yorkers rated President Trump more favorably than the governor, the survey found.</p>\n<div class=\"ns-block-custom-html\">\n<div class=\"flourish-embed flourish-chart\" data-src=\"visualisation/21470450\"><script src=\"https://public.flourish.studio/resources/embed.js\"></script><noscript><img alt=\"chart visualization\" decoding=\"async\" src=\"https://public.flourish.studio/visualisation/21470450/thumbnail\" width=\"100%\"/></noscript></div>\n</div>\n<p>Hochul has not received a positive favorability rating from the survey since January 2024.</p>\n<p>“Governor Hochul’s favorability and job approval ratings continue to languish in negative territory,” Siena College pollster Steven Greenberg said. “Currently 57 percent of voters — including 41 percent of Democrats — would prefer ‘someone else’ as their next governor.”</p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>The survey found that just 22 percent of New Yorkers think Hochul’s administration has improved the state’s fiscal condition while 52 percent say she has not.</p>\n<p>Still, eight of 10 of Hochul’s budget proposals in her State of the State were supported by large majorities, the survey found.</p>\n\n<p>The poll was conducted Jan. 27-30 among 803 registered New York state voters and has a margin of error of 4.2 percentage points.</p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/homenews/state-watch/5126109-1-in-3-ny-voters-would-reelect-hochul-survey/",
            "pub_date": "2025-02-05 03:51:01",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5124446,
            "title": "Live updates: Senate panels advance Gabbard, RFK Jr.; federal employees sue over Trump moves",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>A Senate panel on Tuesday <a href=\"https://thehill.com/homenews/senate/5123633-kennedy-nomination-advances/\" rel=\"noreferrer noopener\" target=\"_blank\">advanced the nomination</a> of Robert F. Kennedy Jr. to serve as secretary of Health and Human Services.</p>\n<p>The 14-13 vote was strictly along party lines.</p>\n\n<p>The vote on Kennedy was the first of two crucial tests for President Trump’s nominees on Tuesday. Tulsi Gabbard <a href=\"https://thehill.com/homenews/senate/5124466-gabbard-rfk-jr-confirmation-committee-votes/\" rel=\"noreferrer noopener\" target=\"_blank\">faces a vote before the Senate Intelligence Committee</a> this afternoon.</p>\n<p>Meanwhile, as part of the Trump administration’s crusade for “government efficiency,” Secretary of State Marco Rubio is being put in charge of the U.S. Agency for International Development (USAID) as the White House <a href=\"https://thehill.com/homenews/administration/5123282-marco-rubio-usaid-take-over/\">mulls the future of the agency</a>.</p>\n<p>USAID has for decades administered billions of dollars of humanitarian and development assistance around the world. </p>\n<p>USAID offices were closed Monday and employees were told to work remotely. Dozens of senior officials have been furloughed and hundreds of contract employees laid off. The apparent move to shutter the agency — and the chaos surrounding it on Monday — enraged Democrats.</p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>Also, Benjamin Netanyahu is in Washington meeting with President Trump about a future for Gaza.</p>\n<p>Read on for updates on these stories and more.</p>\n<div class=\"5124446\" id=\"wpcom-liveblog-container\"></div>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/homenews/administration/trumps-first-100-days/5124446-live-updates-gabbard-rfk-jr-usaid-trump-house-senate/",
            "pub_date": "2025-02-05 03:50:59",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5126051,
            "title": "Senate panel advances Tulsi Gabbard nomination for DNI",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>The Senate Intelligence Committee on Tuesday advanced Tulsi Gabbard’s nomination to become the next director of national intelligence (DNI), putting her in position to get confirmed by the full chamber after key senators threw their support behind her. </p>\n<p>The 9-8 vote was along party lines. It puts Gabbard only days away from being considered on the Senate floor after a roller-coaster process.</p>\n\n<p>The vote took place only hours after Sen. Todd Young (R-Ind.), a key GOP swing vote, <a href=\"https://thehill.com/homenews/senate/5125280-todd-young-tulsi-gabbard-vote/\" rel=\"noreferrer noopener\" target=\"_blank\">announced that he would support her</a>.</p>\n<p>During Thursday’s confirmation hearing, the <a href=\"https://thehill.com/homenews/5117815-tulsi-gabbard-snowden-controversy/\" rel=\"noreferrer noopener\" target=\"_blank\">Indiana Republican was visibly frustrated</a> after Gabbard refused to call Edward Snowden, the former contractor-turned-leaker who fled the U.S., a traitor on multiple occasions.</p>\n<p>But on Tuesday Young said he secured a number of commitments from Gabbard regarding deterring Snowden-like whistleblowers, not pardoning Snowden and working to reauthorize Section 702 of the Foreign Intelligence Surveillance Act.</p>\n<p>“I appreciate Tulsi Gabbard’s engagement with me on a variety of issues to ensure that our intelligence professionals will be supported and policymakers will receive unbiased information under her leadership,” Young <a href=\"https://x.com/sentoddyoung/status/1886799486640386197?s=46\">posted on the social platform X</a> alongside a letter Gabbard sent him of commitments in order to win his vote.  </p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>“I have done what the Framers envisioned for senators to do: use the consultative process to seek firm commitments, in this case commitments that will advance our national security, which is my top priority as a former Marine Corps intelligence officer,” he continued. “Having now secured these commitments, I will support Tulsi’s nomination and look forward to working with her to protect our national security.”</p>\n<p>Gabbard had secured another big win on Monday as Sen. Susan Collins (R-Maine) said that she would <a href=\"https://thehill.com/homenews/senate/5124047-tulsi-gabbard-susan-collins-intelligence-committee-dni/\" rel=\"noreferrer noopener\" target=\"_blank\">back her in the committee vote</a>. </p>\n\n<p>Collins and Young had been seen as pivotal votes in committee, and winning over the pair likely also greases the skids for the former congresswoman on the Senate floor, where she can only afford to lose three Republicans. Sen. Mitch McConnell (R-Ky.) is considered a likely “no” vote, while Sen. John Curtis (R-Utah) indicated following the hearing that he had more “questions” about her confirmation. </p>\n<p>From the moment Trump announced Gabbard as his nominee to be DNI, questions have cropped up about her past views and statements.</p>\n<p>Those include her 2017 meeting with then-Syrian President Bashir al-Assad, which occurred as he was accused of using chemical weapons on his own people, as well as her stance on Russia given multiple comments she made about the war with Ukraine that were considered sympathetic to Moscow and were echoed on Russian state TV. </p>\n<div class=\"civic-science-article-container civic-science-more-14 civic-is-mr3\" data-civicscience-widget=\"3f127ebd-287e-0b64-a901-d55ec286348a\" id=\"civsci-id-civsci-id-596708068\"></div>\n<p>Gabbard also faced numerous questions over her past defense of Snowden.</p>\n<p>A key moment during Gabbard’s hearing came when Sen. James Lankford (R-Okla.) asked whether she views Snowden as a “traitor,” advising her that members of the Intelligence panel would feel a lot better about her nomination if she would do so.</p>\n<p>Instead, Gabbard sidestepped two questions about whether Snowden betrayed the nation, telling lawmakers she is “focused on the future and how we can prevent something like this from happening again,” referring to Snowden’s theft of secret documents.</p>\n\n<p>Lankford said it should have been an “easy question” to say it’s “universally accepted when you steal a million pages of top-secret documents and you hand it to the Russians, that’s a traitorous act.”</p>\n<p>Privately, Gabbard had <a href=\"https://thehill.com/regulation/national-security/5092295-gabbard-defends-snowden-position/\">sought to assuage senators</a> about her views on Snowden, saying she didn’t feel he had the proper channels to blow the whistle.</p>\n<p>The Gabbard move also comes about a week and a half after senators confirmed Defense Secretary Pete Hegseth, who lost three votes on the floor but got the greenlight thanks to a tie-breaking vote by Vice President Vance.</p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/homenews/senate/5126051-tulsi-gabbard-dni-nomination-advances/",
            "pub_date": "2025-02-05 03:35:53",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5126136,
            "title": "Waffle House adding surcharge for every egg ordered",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>(NEXSTAR) – Waffle House restaurants across the nation will be adding a 50 cent surcharge to every egg ordered amid soaring prices due to inflation and the bird flu epidemic.</p>\n<p>The surcharge took effect Monday, according to a Waffle House memo shared with Nexstar.</p>\n\n<p>“The continuing egg shortage caused by HPAI (Bird Flu) has caused a dramatic increase in egg prices,” the memo reads. “Consumers and restaurants are being forced to make difficult decisions. Effective February 3, Waffle House has implemented a temporary .50 per egg surcharge to all menus.”</p>\n<div class=\"nlp-ignore-block article-content rich-text\">\n<aside class=\"promo-link\">\n<a class=\"promo-link__link\" href=\"https://www.wjbf.com/top-stories/waffle-houses-1955-menu-offered-this-ritzy-dish-for-just-1-50/\" target='\"_blank\"'>\n\t\tCan you guess how much a filet mignon dinner cost at Waffle House in 1955?\t</a>\n</aside>\n</div>\n<p>In its memo, Waffle House said the price hike is intended to be “a temporary targeted surcharge tied to the unprecedented rise in egg prices,” but did not indicate when the surcharges might be dropped.</p>\n<p>“While we hope these price fluctuations will be short-lived we cannot predict how long this shortage will last,” it said.</p>\n<p>A representative for Waffle House did not disclose how the surcharge would be communicated to customers in-store. Photos posted to social media appear to show that some operators have posted notices on the windows or menus.</p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<figure class=\"wp-block-image size-large\"><img alt=\"waffle house\" class=\"wp-image-1408591\" decoding=\"async\" src=\"https://www.wjbf.com/wp-content/uploads/sites/47/2023/12/WaffleHouseGettyImages-1355658787-e1703179557541.jpg?w=800\"/><figcaption class=\"wp-element-caption\">(Getty Images)</figcaption></figure>\n<p>Egg prices in the United States are significantly more expensive than in 2024 — recent data from the Labor Department shows <a href=\"https://thehill.com/homenews/nexstar_media_wire/5092350-eggs-are-about-to-get-even-more-expensive-expert-says-heres-how-much\" rel=\"noreferrer noopener\" target=\"_blank\">a nearly 40% increase</a> since January 2024. The Agriculture Department predicts prices are going to soar another 20% this year.</p>\n<p>An outbreak of the bird flu that began in 2022 is largely to blame for skyrocketing egg prices. Anytime the virus is found on a poultry farm, the entire flock is slaughtered to help limit the virus’ spread. And with massive egg farms routinely housing more than 1 million chickens, just a few infections can cause a supply crunch.</p>\n\n<div class=\"nlp-ignore-block article-content rich-text\">\n<aside class=\"promo-link\">\n<a class=\"promo-link__link\" href=\"https://www.wjbf.com/news/national/ap-us-news/ap-egg-prices-are-soaring-dont-expect-that-to-change-anytime-soon/\" target='\"_blank\"'>\n\t\tEgg prices are soaring. Don’t expect that to change anytime soon\t</a>\n</aside>\n</div>\n<p>The problem tends to linger because it takes months to dispose of all the carcasses, disinfect barns and bring in new birds.</p>\n<p>“Hopefully, hens will have start to develop some type of natural immunity to the bird flu, but we have not seen that yet and it will take many years for that to happen,” Patrick Penfield, a professor and supply chain expert at Syracuse University’s School of Management, <a href=\"https://thehill.com/homenews/nexstar_media_wire/5092350-eggs-are-about-to-get-even-more-expensive-expert-says-heres-how-much\" rel=\"noreferrer noopener\" target=\"_blank\">told Nexstar</a> in January.</p>\n<p>Penfield, too, believes that prices will continue to climb, and even surpass a previous nationwide record average price ($4.82 per dozen) set in 2023.</p>\n<p><em>The Associated Press contributed to this report.</em></p>\n<script type=\"text/javascript\">window.NREUM||(NREUM={});NREUM.info={\"beacon\":\"bam.nr-data.net\",\"licenseKey\":\"bb199f70cb\",\"applicationID\":\"738543775\",\"transactionName\":\"MQNTMhdXDxECABBZDAhJchMWQg4PTBMLQxdIFl4VEQ==\",\"queueTime\":0,\"applicationTime\":2415,\"atts\":\"HURERF9NHE5BAkYKGBsb\",\"errorBeacon\":\"bam.nr-data.net\",\"agent\":\"\"}</script>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/business/5126136-waffle-house-egg-prices-surcharge/",
            "pub_date": "2025-02-05 03:31:05",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5123980,
            "title": "Partnership in a new global paradigm",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>As Israel’s new ambassador to the U.S., I am deeply conscious of both the weight of responsibility and the unprecedented opportunity before us. The stakes are high. The international order has been awaiting a new global paradigm that transcends traditional concepts of multi-, bi- or unipolar world orders, and its time has arrived.</p>\n<p>President Trump’s inaugural address provided a road map for the new world order, one in which moral clarity, common sense, a pursuit of the commonality of interests and a robust use of power wherever and whenever necessary are its guidelines. This is a paradigm that could be dubbed “Mutually Assured Construction” (MAC) — a deliberate contrast to the Cold War doctrine of “MAD — Mutually Assured Destruction.”</p>\n\n<p>The <a href=\"https://www.nytimes.com/2020/08/13/us/politics/trump-israel-united-arab-emirates-uae.html\" rel=\"noreferrer noopener\" target=\"_blank\">Abraham Accords</a>, architected and implemented by Trump and Israeli Prime Minister Benjamin Netanyahu, were a crowning achievement of their previous administrations. Both leaders have returned to govern their countries and both exemplify the potential of this new paradigm going forward.</p>\n<p>Israel’s position as America’s strategic partner in this trend-setting agenda cannot be overstated. Our relationship generates tens of billions in mutual economic benefits annually. Israel’s military innovations save American lives and dollars, from <a href=\"https://www.timesofisrael.com/us-army-inks-193-million-deal-to-buy-israeli-tank-defense-system/#:~:text=In%202016%2C%20the%20US%20military,the%20TROPHY%20system%20by%202020.\" rel=\"noreferrer noopener\" target=\"_blank\">the Trophy tank defense system</a> to drone technology. Our intelligence sharing and cybersecurity cooperation protect both countries from evolving threats. Israel has also taken out terrorists with bounties on their heads for killing Americans, and while Israel’s wars are not wars of choice, by fighting the bad actors here, we free Americans from having too.</p>\n<p>Most important, Israel has shown that the principled use of power can engender dramatic change for the better, an idea central to Trump’s goal of a new, safer and more equitable world order. No one imagined that the mass-murdering Assad regime in Syria would ever collapse, but after Israel was forced to decisively use its military to debilitate Hamas and Hezbollah, proxies of Iran’s global terror network, Assad’s Iranian-backed regime washed away like a rope of sand, dramatically changing the regional calculous for the better.</p>\n<p>But much remains to be accomplished. To achieve the president’s goal of ending wars, in the Middle East as elsewhere, we must end the current conflict differently than its predecessors. History teaches us that half-measures and international monitoring mechanisms against terror organizations simply don’t work. The president recently spoke about America’s own experience with relinquishing strategic territory far from its borders. For Israel, a nation smaller than New Jersey, maintaining security buffers along its borders is not a luxury, but a necessity, for survival.</p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>When Israel left Gaza in 2005, we hoped for peace. Instead, we got a terrorist state on our border. When we left Lebanon in 2000, we hoped for tranquility. Instead, we got an Iranian proxy army armed with 150,000 rockets aimed at our civilians. The lesson is clear: Our enemies, led by the Mullahs of Iran, interpret anything short of decisive Israeli victory as an invitation to prepare for the next round of violence. The path to genuine peace — the kind that prevents future wars rather than merely postponing them — requires decisive outcomes.</p>\n<p>Israel cannot leave Hamas standing any more than the U.S. could have left Hideki Tojo and his kamikazes standing after their attack on Pearl Harbor, or, for that matter, Al Qaida after 9/11. The Netanyahu government spoke for all the people of Israel when it set three goals for the war following the Hamas massacre of 10/7: First, the complete destruction of Hamas. Second, the release of all our hostages. Third, ensuring that Gaza can never again threaten the safety of the people of Israel.</p>\n\n<p>Netanyahu shares with Trump a vision of how principled strength can transform regional dynamics. The steadfast insistence that Iran’s nuclear infrastructure be dismantled, along with the forging of unprecedented alliances with moderate Arab and Muslim states, ensures that the axis of evil that threatens both our nations will be defeated.</p><!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://thehill.com/submitting-opinion-content/\"><img alt=\"\" class=\"wp-image-4329764\" decoding=\"async\" height=\"121\" loading=\"lazy\" sizes=\"(max-width: 899px) 100vw, 600px\" src=\"https://thehill.com/wp-content/uploads/sites/2/2023/11/op2.png?w=600\" srcset=\"https://thehill.com/wp-content/uploads/sites/2/2023/11/op2.png?resize=600,121 600w, https://thehill.com/wp-content/uploads/sites/2/2023/11/op2.png?resize=300,61 300w, https://thehill.com/wp-content/uploads/sites/2/2023/11/op2.png?resize=50,10 50w\" width=\"600\"/></a></figure>\n<p>The United States and Israel share not just interests but fundamental values — democracy, rule of law and the belief that power should serve justice rather than replace it. Together, we can demonstrate that democratic nations can defend themselves while upholding their values. This is not just about Israel’s security; it’s about proving that civilization can triumph over barbarism.</p>\n<p>As I assume my role in Washington, I look forward to working with the American people and American leadership to advance our shared interests and values. By standing together and helping ensure Israel can secure its future in one of the most troubled areas on the globe, we can establish a new paradigm that brings genuine peace through strength — not just to Israel and its neighbors, but to all nations that choose construction over destruction.</p>\n<p><em><a href=\"https://new.embassies.gov.il/usa/en/the-embassy/the-ambassador\" rel=\"noreferrer noopener\" target=\"_blank\">Yechiel “Michael” Leiter</a> is Israel’s new ambassador to the United States.</em></p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/opinion/5123980-israel-us-new-world-order/",
            "pub_date": "2025-02-05 03:31:03",
            "source": "thehill",
            "language": "en"
        }
    ]
}