{
    "data": [
        {
            "id": 5757763,
            "title": "US threatens to cut off Swiss bank from financial system over alleged Iran, Russia ties",
            "description": "<p>The Treasury Department on Thursday <a data-id=\"https://home.treasury.gov/news/press-releases/sb0408\" data-type=\"link\" href=\"https://home.treasury.gov/news/press-releases/sb0408\">threatened to cut off</a> MBaer Merchant Bank AG’s access to U.S. financial institutions over the Swiss bank’s alleged ties to sanctioned Iranian and Russian actors.</p>\n<p>The Treasury accused MBaer and its employees of enabling corruption linked to Russian money laundering, as well as money laundering and terrorist financing on behalf of Iran’s Islamic Revolutionary Guard Corps and its Quds Force.  </p>\n<p>The department said it <a href=\"https://www.fincen.gov/system/files/2026-02/MBaer-NPRM.pdf\">proposed a change</a> to its Financial Crimes Enforcement Network (FinCEN) rules that would prohibit covered U.S. financial institutions from opening or maintaining accounts for, or on behalf of, MBaer.</p>\n<p>The action, if finalized, would mark the strongest possible action the Treasury can take against a bank, effectively stifling MBaer’s ability to handle transactions involving U.S. currency.</p>\n<p>“MBaer has funneled over a hundred million dollars through the U.S. financial system on behalf of illicit actors tied to Iran and Russia,” Treasury Secretary Scott Bessent said in a statement. “Banks should be on notice that the U.S. Treasury will aggressively protect the integrity of the U.S. financial system using the full force of our authorities.”</p>\n<p>Swiss media outlets <a href=\"https://www.swissinfo.ch/eng/various/mbaer-bank-categorised-as-a-money-laundering-risk-by-us-authorities/91005422?utm_source=multiple&amp;utm_campaign=swi-rss&amp;utm_medium=rss&amp;utm_content=o\">reported</a> that the Swiss Financial Market Supervisory Authority (FINMA), the independent government body responsible for supervising Swiss financial markets, concluded enforcement proceedings against MBaer several weeks ago.</p>\n<p>The body found that the bank had breached anti-money laundering rules and risk management requirements, particularly related to sanctions. It has appointed an audit officer to “monitor” the bank while an appeal is pending, <a href=\"https://www.finma.ch/en/news/2026/02/20260226-mm-mbaer/\">according to a FINMA news release</a>. FINMA also said it is in contact with FinCen.</p>\n<p>The U.S. has expanded sanctions on Iran and Russia in recent weeks, targeting key revenue streams, <a href=\"https://thehill.com/homenews/administration/5568227-treasury-russia-sanctions-rosneft-lukoil/\">such as oil sales</a>, that officials claim the nations’ leaders rely on to fund military programs and unlawful activities.  </p>\n<p>The Treasury on Wednesday <a href=\"https://thehill.com/homenews/administration/5755158-us-iran-sanctions-oil-nuclear-program/\">imposed additional sanctions</a> on Iranian individuals, companies and vessels that it accused of facilitating the country’s illicit oil sales and ballistic missile program.</p>\n<p>The fresh batch was announced a day before <a href=\"https://thehill.com/newsletters/1230-report/5756781-high-stakes-iran-nuclear-talks/\">indirect negotiations</a> on Tehran’s nuclear program resumed in Geneva, Switzerland, amid a <a href=\"https://thehill.com/policy/defense/5737201-uss-gerald-r-ford-middle-east-us-iran/\">buildup of U.S. military firepower</a> in the region and <a href=\"https://thehill.com/policy/international/5755742-trump-iran-nuclear-threat/\">threats of potential military action</a> if diplomacy fails.   </p>\n<p>Omani Foreign Minister Badr Albusaidi said U.S. and Iranian officials made “<a href=\"https://thehill.com/policy/international/5757110-us-iran-talks-oman-complete/\">significant progress</a>” in the discussions, with further talks planned for next week.</p>\n<p>“We will resume soon after consultation in the respective capitals. Discussions on a technical level will take place next week in Vienna. I am grateful to all concerned for their efforts: the negotiators, the IAEA, and our hosts the Swiss government,” Albusaidi <a href=\"https://x.com/badralbusaidi/status/2027089708392579576\">wrote on the social platform X</a>.</p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/administration/5757763-treasury-threatens-mbaer-swiss-bank/",
            "pub_date": "2026-02-27 06:41:03",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5757847,
            "title": "Power plant pollution rose last year, green group analysis finds",
            "description": "<p>U.S. power plant pollution rose last year, according to a green group’s analysis of Environmental Protection Agency (EPA) data.</p>\n<p>Emissions of sulfur dioxide increased by 18 percent in 2025, according to an analysis by the <a href=\"https://www.nrdc.org/press-releases/coal-pollution-spiked-after-trump-administrations-free-pass-pollute\" rel=\"noreferrer noopener\" target=\"_blank\">Natural Resources Defense Council</a>, an environmental advocacy group, of the EPA data.</p>\n<p>The group found that plants’ nitrogen oxide emissions increased 7 percent and their carbon dioxide emissions increased by 4 percent.</p>\n<p>Both <a href=\"https://www.epa.gov/so2-pollution/sulfur-dioxide-basics\" rel=\"noreferrer noopener\" target=\"_blank\">sulfur dioxide</a> and <a href=\"https://www.epa.gov/no2-pollution/basic-information-about-no2\" rel=\"noreferrer noopener\" target=\"_blank\">nitrogen oxides</a> can harm peoples’ respiratory systems. </p>\n<p>The analysis found that at <a href=\"https://thehill.com/policy/energy-environment/5239327-trump-exempts-coal-plants/\" rel=\"noreferrer noopener\" target=\"_blank\">the dozens of coal plants</a> that President Trump exempted from strict Biden-era standards for <a href=\"https://thehill.com/policy/energy-environment/5747717-trump-coal-plants-lead-mercury/\" rel=\"noreferrer noopener\" target=\"_blank\">Mercury and Air Toxics (MATS)</a>, sulfur dioxide emissions increased by 24 percent.</p>\n<p>“President Trump gave coal plants a free pass to pollute, and they took him up on the offer,” said Amanda Levin, director of policy analysis at the Natural Resources Defense Council (NRDC) in a written statement.  “With no cop on the beat to make sure the owners of these plants ran their pollution controls effectively, they ignored the health of their surrounding communities to save a few bucks on their costs. The rest of us will pay with our health.”</p>\n<p>The EPA, however, accused the group of cherry-picking data in a misleading way.</p>\n<p>“NRDC is peddling misleading, cherry-picked data in a desperate attempt to drum up donations,” an EPA spokesperson said via email. </p>\n<p>“MATS has little or nothing to do with sulfur dioxide emissions. And even if the now-repealed Biden EPA 2024 MATS rule had gone into effect, compliance with the 2024 MATS requirements was not required until 2027, so those requirements did not impact 2025 emissions,” the spokesperson added. </p>\n<p>The Trump administration has sought to bolster coal plants, including by loosening climate and environmental standards, providing funds and ordering plants to stay online. It has argued that this power is needed to support the electric grid, while environmental groups have raised concerns about pollution and climate change.</p>",
            "kind": 1,
            "link": "https://thehill.com/policy/energy-environment/5757847-trump-epa-power-plant-pollution/",
            "pub_date": "2026-02-27 06:41:03",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5757758,
            "title": "Warner Bros. Discovery: Paramount's hostile bid 'superior' to Netflix offer",
            "description": "<p>Warner Bros. Discovery, the sprawling entertainment company that owns major media brands like HBO and CNN, said Thursday it now favors a <a href=\"https://thehill.com/homenews/media/5754397-warner-bros-paramount-netflix-deal/\" rel=\"noreferrer noopener\" target=\"_blank\">bid made by Paramount</a> to buy the company’s key assets over a previous agreement with streamer Netflix.</p>\n<p>The company’s board, “following consultation with its independent financial and legal advisors,” said it had found Paramount’s deal to be a “Company Superior Proposal,” triggering a four-business-day period during which Netflix has the right to propose revisions to its<strong> </strong>merger agreement.</p>\n<p>One of the largest streamers in the world, Netflix announced late last year it had <a href=\"https://thehill.com/media/5721455-netflix-warner-brothers-merger-hearing/\" rel=\"noreferrer noopener\" target=\"_blank\">struck an agreement</a> to acquire Warner Bros. Discovery’s movie and television studios as part of a deal valued at more than $70 billion.</p>\n<p>But the deal has been met with opposition in recent days as President Trump and a growing number of elected Republicans have accused Netflix of left-leaning bias while Democrats on Capitol Hill have raised antitrust concerns.</p>\n<p>Paramount’s hostile bid, which seeks to purchase the entire Warner Bros. Discovery portfolio including its linear television assets like CNN and TNT Sports, comes with a purchase price of $31 per share in cash, as well as a $7 billion regulatory termination fee for the previous deal with Netflix.</p>\n<p>Warner Bros. Discovery had until Friday been urging its board to support the deal with Netflix, even as Paramount mounted its hostile push for the Hollywood giant.</p>\n<p>Any sale of Warner Bros. Discovery’s assets would need to be approved by Trump’s Department of Justice, which earlier this month ousted the head of its antitrust division.</p>\n<p>Trump has praised efforts by the Larry and David Ellison, the father-son duo atop Paramount, to retool the network’s news and entertainment divisions, moves that many Democrats and media critics view as a shift rightward to please the Trump administration.</p>\n<p>The president, who had not previously voiced opposition to the Warner Bros. Discovery-Netflix deal, attacked Netflix over the weekend, saying the <a href=\"https://thehill.com/homenews/media/5750810-netflix-warner-brothers-ted-sarandos-trump-rice/\" rel=\"noreferrer noopener\" target=\"_blank\">company should remove</a> Democratic political operative Susan Rice from its board over comments she made that were critical of his administration or “face the consequences.”</p>\n<p>The Netflix merger agreement remains in effect, Warner Bros. Discovery noted Thursday, saying its board continues to “recommend in favor of the Netflix transaction and has not withdrawn or modified its recommendation.”</p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/media/5757758-paramount-hostile-bid-warner-discovery/",
            "pub_date": "2026-02-27 06:41:02",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5757667,
            "title": "Pentagon draws scrutiny with Anthropic threats, Defense Production Act",
            "description": "<p>The Pentagon is threatening to use the Defense Production Act (DPA) against Anthropic amid a dispute over the company’s restrictions on its AI tools, in a move that many experts say is an unusual use of the measure.</p>\n<p>The Defense Department (DOD) warned Anthropic on Tuesday that it could invoke the DPA, which gives the president broad authority to control domestic industries in the name of national defense, to use the AI firm’s tool on its own terms.</p>\n<p>The threat marks an <a data-id=\"https://thehill.com/policy/defense/5752960-pentagon-threatens-anthropic-contract/\" data-type=\"link\" href=\"https://thehill.com/policy/defense/5752960-pentagon-threatens-anthropic-contract/\">escalation in the feud</a> between the two parties. Negotiations appear to be at a standstill, with the Pentagon giving Anthropic until Friday to comply with its terms or face a cancellation of a $200 million contract and risk being labeled a “supply chain risk” or confronting the DPA.</p>\n<p>“It’s the wrong purpose of the tool,” Mark Dalton, senior policy director for technology and innovation at the R Street Institute, told The Hill. “The DPA exists for a capacity reason, like it’s an industrial capacity policy, and to use it as leverage is, I think, irresponsible.”</p>\n<p>Anthropic and the Pentagon have been <a data-id=\"https://thehill.com/policy/defense/5750785-claude-ai-pentagon-contract-risk/\" data-type=\"link\" href=\"https://thehill.com/policy/defense/5750785-claude-ai-pentagon-contract-risk/\">locked in tense negotiations</a> in recent weeks over the company’s AI usage policy, which bars its AI model Claude from being used to conduct mass surveillance or develop lethal autonomous weapons.</p>\n<p>These two issues have become the company’s red lines in the dispute. A source familiar with negotiations told The Hill on Monday that Anthropic’s resistance stemmed from concerns that AI systems are not reliable enough to make life-or-death decisions and the technology significantly changes what is possible with domestic surveillance.</p>\n<p>Meanwhile, the Pentagon has pushed for the company to accept language that allows for “all lawful uses.”</p>\n<p>On Wednesday night, the DOD sent its last and final offer to Anthropic, asking the AI giant to allow the department to access Claude for “all lawful purposes,” a senior Pentagon official told The Hill on Thursday. CBS News reported earlier on the offer.</p>\n<p>The Hill has reached out to Anthropic for comment.</p>\n<p>Sean Parnell, chief Pentagon spokesperson, noted Thursday that the department has “no interest in using AI to conduct mass surveillance of Americans (which is illegal) nor do we want to use AI to develop autonomous weapons that operate without human involvement.”</p>\n<p>“Here’s what we’re asking: Allow the Pentagon to use Anthropic’s model for all lawful purposes,” he wrote in a post on social platform X. “This is a simple, common-sense request that will prevent Anthropic from jeopardizing critical military operations and potentially putting our warfighters at risk. We will not let ANY company dictate the terms regarding how we make operational decisions.”</p>\n<p>Under Secretary of War for Research and Engineering Emil Michael, who was at a Tuesday meeting between Defense Secretary Pete Hegseth and Anthropic CEO Dario Amodei, similarly said Thursday that mass surveillance would be a violation of the Fourth Amendment and the Pentagon would never do it.</p>\n<p>The dispute is notable given that Anthropic’s Claude has so far been the only AI model available to the department on its classified systems.</p>\n<p>However, the department recently reached a new agreement with Elon Musk’s xAI to use its AI model on the classified side, a Pentagon official told The Hill, while Google’s Gemini and OpenAI’s ChatGPT are “close.”</p>\n<p>Negotiations came to a head Tuesday, when Amodei met with Hegseth at the Pentagon, and the department gave the company an ultimatum — agree to its terms by 5:01 p.m. EST on Friday or it will cancel their contract.</p>\n<p>The AI company was one of several firms, alongside Google, OpenAI and xAI, that scored a $200 million contract with the Defense Department last summer.</p>\n<p>The Pentagon also upped the ante by raising the prospect of invoking the DPA and “supply chain risk” label.</p>\n<p>While the department may only be employing these threats as negotiating tactics, the potential use of the DPA is drawing scrutiny from experts and Democratic lawmakers.</p>\n<p>“This is unprecedented,” said Charlie Bullock, a senior research fellow at the Institute for Law &amp; AI.</p>\n<p>He underscored that the Pentagon’s DPA threat could fall outside the parameters of the statute or raise constitutional concerns, including under the First Amendment.</p>\n<p>“It’s mostly for traditional manufacturing in times of emergency,” Dalton added. “I get that everything feels emergent these days, but I don’t see what national emergency using DPA for a software company solves.”</p>\n<p>Democratic Sens. Elizabeth Warren (D-Mass.), who is on the Senate Armed Services Committee, and Andy Kim (D-N.J.) argued that Congress passed the DPA to aid the U.S. economy in times of needs, not to permit the Trump administration to “extort American companies that refuse to help the Pentagon to surveil Americans or build killer robots.”</p>\n<p>“If Secretary Hegseth weaponizes the DPA against American companies, he will shatter the bipartisan consensus in support of a strong DPA – weakening our hand in competition with China and our ability to ensure American competitiveness,” the pair said in a statement Wednesday.</p>\n<p>Previous administrations have invoked the DPA to boost production of goods during the COVID-19 pandemic. The Biden administration used the measure to up the production of baby formula, clean energy and vaccines, as well as to require AI companies to share safety information with the federal government.</p>\n<p>During his first term, President Trump used the law to address ventilator shortages. He has used the measure in his second term to increase the nation’s production of critical minerals.</p>\n<p>Title I of the DPA allows the president to require individuals or companies to prioritize or accept contracts as is necessary to promote the national defense, according to the Congressional Research Service. Several experts suggested this is likely the portion of the law that the Pentagon would turn to in this case.</p>\n<p>“I don’t believe he’s abusing the law in doing so,” said Greg Williams, director of the Center for Defense Information at the Project On Government Oversight (POGO).</p>\n<p>“However, I think it’s unfortunate the Pentagon is not as interested as Anthropic appears to be in ensuring the safe, lawful and ethical use of artificial intelligence,” he added.</p>\n<p>Neil Chilson, the head of AI policy at the Abundance Institute, who is a critic of the expanding uses of DPA Title I, said the measure’s use in this case is at least within the scope of defense and intent than in previous instances.</p>\n<p>“Because we are talking about DOD procuring services for defense purposes, right? So at least at the very high level, this is closer to the intent of the statute,” Chilson said in an interview with The Hill.</p>\n<p>Still, he said Pentagon’s threat of invoking the DPA is “perhaps more aggressive, even if it’s more within the sort of intent of the statute,” compared to the use of the law by previous administrations.</p>\n<p>Following Tuesday’s meeting, the Pentagon continued turning the screws on Anthropic, reaching out to defense contractors about its reliance on Claude, in what appears to be an initial step toward labeling the company a supply chain risk.</p>\n<p>Lockheed Martin spokesperson confirmed to The Hill that the Pentagon reached out to the defense contractor about its usage of Claude. The spokesperson declined to say when exactly the DOD reached out. Axios first reported on the outreach.</p>\n<p>Boeing Defense, Space and Security, a division of Boeing, does not have an active contract with Anthropic, a spokesperson confirmed to The Hill on Thursday.</p>\n<p>“What seems really sketchy here is this after the fact trying to change the terms of a contract without going through the regular contract negotiation process and what appears to be an abuse of labeling a contract a supply chain risk,” Williams of POGO said.</p>\n<p>“A supply chain risk is somebody who might not deliver on something they’ve agreed to do,” he added. “As far as I understand it, Anthropic is not suggesting they wouldn’t deliver on the terms of their existing contract.”</p>\n<p>James E. Baker, former chief judge of the U.S. Court of Appeals for the Armed Forces, also argued there is a discrepancy between invoking the DPA and slapping the supply chain risk designation on a company.</p>\n<p>“As [former DOD official] Greg Allen has stated, there is an inherent contradiction between threatening to designate a company a supply chain risk, and using the DPA to compel provision of the company’s services,” Baker, who is now the director of the Syracuse University Institute for Security Policy and Law, told The Hill on Thursday.</p>\n<p>But Chilsonof the Abundance Institute argued the Pentagon could both invoke the DPA and slap the supply chain risk designation on Anthropic.</p>\n<p>“I think logically it would make sense to say, like, we need a tool that lets us make decisions,” he said. “It doesn’t make decisions for us and if you’re not going to provide that tool, then we’re worried about the tools that you are providing to our downstream vendors.”</p>\n<p>Jerry McGinn, director of the Center for the Industrial Base at the Center for Strategic and International Studies, argued that if a company does not want to do work in certain area and under certain conditions, they can pull out of the contract or the government can cancel it.</p>\n<p>“The government has the vehicles they need to stop the work if they want and find another provider,” McGinn said in an interview with The Hill.</p>",
            "kind": 1,
            "link": "https://thehill.com/policy/technology/5757667-pentagon-threatens-anthropic-dpa/",
            "pub_date": "2026-02-27 06:05:54",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5757449,
            "title": "Texas grand jury rejects indictments in fatal shooting of US citizen by immigration agents",
            "description": "<p>A Texas grand jury on Wednesday rejected indictments regarding a fatal shooting involving federal immigration agents that left a U.S. citizen dead last year.</p>\n<p>The grand jury’s decision follows the <a href=\"https://thehill.com/homenews/state-watch/5754445-witness-ice-shooting-texas-dies/\">death of Joshua Orta</a>, who was with Ruben Ray Martinez when he was shot and killed by a Homeland Security Investigations (HSI) agent while driving in South Padre Island in March 2025. </p>\n<p>The Department of Homeland Security (DHS) claimed Martinez “intentionally ran over” the agent, which caused another agent to fire “defensive shots to protect himself, his fellow agents, and the general public.”</p>\n<p>Lawyers for Martinez’s family called on the Texas Department of Public Safety to disclose its findings after investigating the shooting to determine if Immigration and Customs Enforcement (ICE), which HSI operates under, is accurate about why Martinez was killed.</p>\n<p>“Since Ruben’s death a year ago, all we have wanted is justice for him and we have struggled with the silence surrounding his killing,” Martinez’s mother Rachel Reyes said in a <a href=\"https://www.texastribune.org/2026/02/25/texas-ice-shooting-death-grand-jury-no-bill/\">statement </a>obtained by the Texas Tribune. </p>\n<p>“Now, the country is in crisis — and, terribly, heartbreakingly, other families are enduring what we have,” Reyes added. “It’s my hope that attention being raised now into Ruben’s death will help bring the justice we want for him and the answers we haven’t had.”</p>\n<p>The comments come as Democrats <a href=\"https://thehill.com/homenews/senate/5748060-funding-department-homeland-security/\">refuse to fund and reopen DHS</a> unless there are substantial changes to immigration enforcement following the killing of two U.S. citizens in Minnesota earlier this year. </p>\n<p>Orta previously told Martinez’s family lawyers about the events of the crash in September and planned to work with investigators before his death. He defended his friend and said Martinez did not hit anyone, as the car was “just crawling as we were trying to turn around,” according to a draft affidavit obtained by The Associated Press. </p>\n<p>Orta said after they arrived at a crash site, they slowed down and started to turn their car after an officer ordered them to, seeing an open alcohol container in the back of their car. Other officers then surrounded their car and drew their guns.</p>\n<p>The officers fired into the driver’s side window without “warning, commands or opportunity to comply,” he added. An officer fired so close to the driver’s side window that bullet casings flew into the car after Martinez was shot. He apologized as he slumped back before officers removed Martinez’s body from the car and handcuffed him.</p>\n<p>A DHS spokesperson told The Hill on Wednesday that HSI special agents were helping local police with a “major accident.” The special agent they claim was struck by Martinez’s blue Ford was hospitalized with a knee injury.</p>\n<p><em>The Associated Press contributed. </em></p>",
            "kind": 1,
            "link": "https://thehill.com/regulation/court-battles/5757449-texas-grand-jury-rejects-indictments/",
            "pub_date": "2026-02-27 06:05:53",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5757731,
            "title": "Noem: DHS shutdown is affecting World Cup, America 250 preparations",
            "description": "<p>Department of Homeland Security (DHS) Secretary Kristi Noem said the ongoing shutdown of her department is affecting preparations for the 2026 World Cup and the celebration of <a href=\"https://america250.org/\">250 years of the United States</a>.</p>\n<p>In a post on the social platform X Thursday, Noem said the Federal Emergency Management Agency (FEMA) “was in the final stages of reviewing applications to ensure proper oversight when Democrats shut down the government putting significant portions of the FEMA staff on administrative leave.”</p>\n<p>“No funds have been awarded yet under the FIFA World Cup Grant Program. The longer DHS goes without funding, the less prepared our nation will be for threats at the FIFA World Cup and America 250,” Noem said in <a href=\"https://x.com/Sec_Noem/status/2027022585871863828\">her post</a>. </p>\n<p>“This Democrat shutdown directly impacts DHS’s ability to keep Americans safe at these events and our national security,” she added.</p>\n<p>The first U.S.-based World Cup game of this year’s tournament is set for June 12 in Los Angeles between the <a href=\"https://www.fifa.com/en/tournaments/mens/worldcup/canadamexicousa2026/scores-fixtures?country=US&amp;wtw-filter=ALL\">U.S. and Paraguay</a>. And the United States will celebrate 250 years of <a href=\"https://america250.org/about-america250/\">independence in July</a>, a notable milestone.</p>\n<p>On Tuesday, Senate Democrats shot down a bill to fund DHS, prolonging <a href=\"https://america250.org/about-america250/\">the shutdown of the department</a>. </p>\n<p>Throughout President Trump’s second term, DHS has faced heat over his strict immigration agenda. However, that heat boiled over following the killing of two U.S. citizens, Renee Good and Alex Pretti, by federal immigration officers in Minneapolis last month.</p>\n<p>In January, congressional appropriators came to a deal on the DHS funding bill, which passed the House with some Democratic support. Pretti’s shooting, however, resulted in Senate Democrats moving away from backing the bill. </p>",
            "kind": 1,
            "link": "https://thehill.com/policy/national-security/5757731-noem-dhs-shutdown-affects-world-cup/",
            "pub_date": "2026-02-27 06:05:52",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5757711,
            "title": "EPA firing 22 environmental justice staffers, union says",
            "description": "<p>The Environmental Protection Agency (EPA) moved to fire 22 more of its staffers, a union representing agency employees said Thursday.</p>\n<p>Justin Chen, president of the American Federation of Government Employees (AFGE) Council 238, which represents EPA staff, said that the agency issued reduction in force (RIF) notices to 22 people who work on “environmental justice,” meaning they tackle pollution in overburdened or underserved communities. </p>\n<p>“AFGE Council 238 is outraged by the EPA’s decision to issue RIF notices to 22 environmental justice employees whose work ensures that communities disproportionately burdened by environmental hazards receive the protections they are entitled to,” Chen said in a written statement. </p>\n<p>“The gutting of our workforce, which has already been reduced by an estimated 30 percent, has stretched remaining staff to the breaking point and weakened our ability to respond to mounting environmental and public health threats. There is no justification for further cuts: funding levels have remained steady and these are needed, well qualified workers, and the agency should be strengthening our workforce, not shrinking it,” he added.</p>\n<p>He urged the EPA to “immediately withdraw these notices.”</p>\n<p>Asked for comment, an EPA spokesperson confirmed to The Hill that it had “issued Reduction in Force notices to employees in EPA’s regional Environmental Justice Divisions,” though they did not say how many.</p>\n<p>The spokesperson said that the decision was part of an effort “to identify a better structure for the agency that will transform the workforce to best position the agency to fulfill its statutory obligations, protect human health and the environment, Power the Great American Comeback, be an exceptional steward of taxpayer resources, and continue making all decisions based on gold-standard science.”</p>\n<p>Last year, the EPA also targeted environmental justice staffers, <a href=\"https://thehill.com/policy/energy-environment/5261454-epa-firing-environmental-justice-staff/\" rel=\"noreferrer noopener\" target=\"_blank\">saying it would fire 280 of them</a> and reassign another 175. At the time, it said it was doing so as part of an effort to end diversity programming in the government.</p>\n<p>More broadly, the Trump administration has sought to shrink the footprint of the federal government and has fired thousands of workers.</p>",
            "kind": 1,
            "link": "https://thehill.com/policy/energy-environment/5757711-epa-environmental-justice/",
            "pub_date": "2026-02-27 05:56:42",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5757544,
            "title": "Kansas invalidates more than 1,000 transgender residents' driver's licenses, birth certificates",
            "description": "<p>A Kansas law invalidating the driver’s licenses and birth certificates of transgender residents who changed their gender on the documents took effect Thursday.</p>\n<p>The legislation, <a href=\"https://www.kslegislature.gov/li/b2025_26/measures/documents/sb244_enrolled.pdf\" rel=\"noreferrer noopener\" target=\"_blank\">Senate Bill 244</a>, requires all Kansans to identify with the same gender as their birth sex on official state documents. That impacts more than 1,000 people in the state, <a href=\"https://www.reuters.com/legal/government/kansas-invalidates-drivers-licenses-birth-certificates-over-1000-transgender-2026-02-26/\" rel=\"noreferrer noopener\" target=\"_blank\">according to Reuters</a>. </p>\n<p>Under the law, Kansans cannot make changes to their gender on driver’s licenses and birth certificates going forward. Those who need new licenses must pay a fee of no more than $8, to be set by state Secretary of Revenue Mark Burghart. </p>\n<p>Transgender Kansans must also use restrooms, locker rooms, changing rooms and shower rooms in government buildings that correspond to their birth sex. </p>\n<p>Individuals who violate the law twice will face a civil penalty of $1,000, while those who commit a third or subsequent violation will be charged with a class B misdemeanor. Government entities in violation will be penalized $25,000 for first infractions and $125,000 for each subsequent infraction. </p>\n<p>The GOP-led Kansas Legislature passed the bill last month. While Kansas Gov. Laura Kelly (D) vetoed it, the Legislature overrode that veto earlier this month. </p>\n<p>When that occurred, the American Civil Liberties Union (ACLU) of Kansas <a href=\"https://www.aclukansas.org/press-releases/advocacy-organizations-condemn-kansas-legislature-override-of-governor-veto-on-sb-244/\" rel=\"noreferrer noopener\" target=\"_blank\">denounced the legislation</a> as “intrusive” and an attack on transgender Kansans. </p>\n<p>“This bill is about forcing people into the wrong bathrooms and opening up all Kansans to scrutiny and gender policing by strangers,” said Logan DeMond, ACLU of Kansas policy director, in a release. “Bathroom bans are grounded in prejudice and misinformation, and they don’t actually make anyone safer.”</p>\n<p>Harper Seldin, a senior staff attorney with the LGBTQ and HIV Project at the ACLU, <a href=\"https://www.reuters.com/legal/government/kansas-invalidates-drivers-licenses-birth-certificates-over-1000-transgender-2026-02-26/\" rel=\"noreferrer noopener\" target=\"_blank\">told Reuters</a> that the organization plans on filing a legal challenge to the law by the end of Friday.</p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/state-watch/5757544-kansas-transgender-law-legislation/",
            "pub_date": "2026-02-27 05:45:54",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5757567,
            "title": "Platner deletes social media post promoting far-right figure Stew Peters",
            "description": "<p>Maine Senate candidate Graham Platner is facing backlash after amplifying a post made by far-right figure Stew Peters. </p>\n<p>“War with Iran is the only thing republicans and democrats have both given a standing ovation for. Let that sink in,” Peters, who has been deemed a conspiracy theorist, Christian nationalist and “prolific” <a href=\"https://www.adl.org/resources/article/stew-peters-five-things-know\" rel=\"noreferrer noopener\" target=\"_blank\">espouser of antisemitic views</a> by the Anti-Defamation League, wrote in a <a href=\"https://x.com/realstewpeters/status/2026503325609238733\" rel=\"noreferrer noopener\" target=\"_blank\">Tuesday post</a> on the social platform X.</p>\n<p>His comments referred to the applause from Democrats and Republicans while President Trump touted his administration’s efforts against Iran’s nuclear program during the State of the Union.</p>\n<p>Platner shared Peters’s comment and wrote a similar statement in a <a href=\"https://x.com/Bencjacobs/status/2027069889467576341?s=20\" rel=\"noreferrer noopener\" target=\"_blank\">now-deleted post</a>.</p>\n<p>“As always, there’s one thing that brings Republican and Democratic politicians together: sending other people’s children to die in stupid wars in the Middle East,” the Maine Senate candidate wrote. </p>\n<p>In a statement to The Hill, Platner’s campaign spokesperson said the team was “reposting a c-span clip of Trump speaking about the potential war with Iran and didn’t realize that the video had been posted by a despicable account. When we learned who the poster was we immediately deleted the post.”</p>\n<p>This isn’t the first time the Senate candidate has found himself in hot water. </p>\n<p>Last year, Platner ultimately <a href=\"https://thehill.com/homenews/campaign/5566909-platner-plans-tattoo-removal/\" rel=\"noreferrer noopener\" target=\"_blank\">covered a chest tattoo</a> that some said resembled a Nazi symbol, arguing he was unaware of its similarities to a Totenkopf, which is German for “death’s head.”</p>\n<p>The symbol was adopted by Adolf Hitler’s troops in Nazi Germany, according to the <a href=\"https://www.adl.org/resources/hate-symbol/totenkopf\" rel=\"noreferrer noopener\" target=\"_blank\">Anti-Defamation League’s website</a>.</p>\n<p>“I am not a secret Nazi,” Platner told co-host Tommy Vietor during an appearance on “<a href=\"https://x.com/podsaveamerica/status/1980436997669061072?s=46\" rel=\"noreferrer noopener\" target=\"_blank\">Pod Save America</a>” around that time.</p>\n<p>The conversation also focused on Platner’s <a href=\"https://thehill.com/homenews/campaign/5565118-graham-platner-maine-reddit-posts/\" rel=\"noreferrer noopener\" target=\"_blank\">deleted Reddit posts</a> in which <a href=\"https://thehill.com/homenews/campaign/5565118-graham-platner-maine-reddit-posts/\" rel=\"noreferrer noopener\" target=\"_blank\">he described himself</a> as a “communist,” called police officers “bastards” and said rural white Americans “actually are” racist and stupid.</p>\n<p>“I think you can pretty much figure out where I stand on Nazism and antisemitism and racism in general,” he added during the “Pod Save America” interview. “I would say a lifelong opponent.”</p>\n<p>Despite the criticism, Platner currently holds a <a href=\"https://thehill.com/homenews/campaign/5752823-platner-holds-double-digit-lead-on-mills-collins-in-maine-senate-race-poll/\" rel=\"noreferrer noopener\" target=\"_blank\">double-digit lead</a> over both Maine Gov. Janet Mills (D) and Sen. Susan Collins (R-Maine), according to a new poll from the University of New Hampshire <a href=\"https://scholars.unh.edu/cgi/viewcontent.cgi?article=1929&amp;context=survey_center_polls\" rel=\"noreferrer noopener\" target=\"_blank\">released on Tuesday</a>.</p>\n<p>He’s been backed by Sen. Bernie Sanders (I-Vt.), <a href=\"https://thehill.com/homenews/campaign/5569517-graham-platner-endorsed-by-sanders/\" rel=\"noreferrer noopener\" target=\"_blank\">who has defended</a> Platner amid the backlash over his behavior.</p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/campaign/5757567-platner-stew-peters-post-controversy/",
            "pub_date": "2026-02-27 05:45:53",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5757651,
            "title": "Top Oversight panel Democrat calls for Trump to testify in Epstein probe",
            "description": "<p>Rep. Robert Garcia (D-Calif.), the top Democrat on the House Oversight and Government Reform Committee, on Thursday called for President Trump to testify under oath before the committee as part of its investigation into the late sex offender Jeffrey Epstein.</p>\n<p>He did so as the <a href=\"https://thehill.com/homenews/house/5756577-clintons-questioned-epstein-links/\" rel=\"noreferrer noopener\" target=\"_blank\">panel conducted a deposition</a> with former Secretary of State Hillary Clinton in Chappaqua, N.Y., and is set to depose former President Clinton on Friday.</p>\n<p>“This committee has now set a new precedent about talking to presidents and former presidents,” Garcia said in a press conference during a break in Clinton’s deposition. “We’re demanding immediately that we ask President Trump to testify in front of our committee and be deposed in front of Oversight Republicans and Democrats.”</p>\n<p>Garcia and other Democrats brought up a <a href=\"https://www.npr.org/2026/02/24/nx-s1-5723968/epstein-files-trump-accusation-maxwell\">report from NPR</a> from this week that said the Department of Justice withheld and removed some Epstein files related to Trump.</p>\n<p>“We want to understand right now, where the missing FBI files are,” Garcia said. “These are files that accuse the president of the United States of serious, serious accusations around sexual abuse and the fact that they’re not in the files, and have been apparently either removed or discarded, is incredibly concerning.”</p>\n<p>The White House has denied any wrongdoing by Trump, and the Justice Department has said the allegations against Trump were found to have no credibility.</p>\n<p>The <a href=\"https://thehill.com/homenews/administration/5756249-doj-investigates-withheld-fbi-interviews/\">Department of Justice said in a statement is reviewing the matter</a>.</p>\n<p>“Several individuals and news outlets have recently flagged files related to documents produced to Ghislaine Maxwell in discovery of her criminal case that they claim appear to be missing,” it said in a <a href=\"https://x.com/DOJRR47/status/2026769082159112295?s=20\">statement Wednesday</a>.</p>\n<p>“As with all documents that have been flagged by the public, the Department is currently reviewing files within that category of the production. Should any document be found to have been improperly tagged in the review process and is responsive to the Act, the Department will of course publish it, consistent with the law.”</p>\n<p>Rep. James Comer (R-Ky.), the chair of the Oversight panel, said earlier Thursday that the panel is looking into the NPR report and looking to get an answer from the Department of Justice about what happened.</p>\n<p>Clinton said in her deposition opening statement that she did not recall ever meeting Epstein, and had no knowledge of crimes committed by him and Maxwell. Garcia said Clinton was “completely cooperating with the deposition and the committee” and “answering questions in full faith and in good faith.”</p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/house/5757651-oversight-democrat-trump-testify-epstein/",
            "pub_date": "2026-02-27 05:31:03",
            "source": "thehill",
            "language": "en"
        }
    ]
}