{
    "data": [
        {
            "id": 5757891,
            "title": "Wyden presses DEA for answers on secret Epstein investigation",
            "description": "<p>Sen. Ron Wyden (D-Ore.) on Wednesday pressed Drug Enforcement Agency (DEA) Administrator Terry Cole for answers on an investigation into possible drug trafficking and suspicious financial transactions involving the convicted sex offender Jeffrey Epstein.</p>\n<p>Wyden sent a letter to Cole requesting an unredacted version of a <a href=\"https://www.justice.gov/epstein/files/DataSet%209/EFTA00173953.pdf\" rel=\"noreferrer noopener\" target=\"_blank\">2015 memorandum</a> that references a probe entitled “Chain Reaction,” in which Epstein is named alongside 14 other alleged co-conspirators.</p>\n<p>“Since Epstein and his 14 co-conspirators were never charged by the DOJ for drug trafficking or financial crimes, I am concerned that the DEA and DOJ during the first Trump Administration moved to terminate this investigation in order to protect pedophiles,” Wyden wrote.</p>\n<p>“I am also concerned that the excessive redactions of this memorandum for operation ‘Chain Reaction’ go well beyond the intent of the Epstein Files Transparency Act, which allows for redactions to protect the identity of victims, not members of a criminal sex trafficking organization. Since this memorandum is designated as ‘sensitive but unclassified’ there is no reason to withhold an unredacted version of this document from the U.S. Congress,” he added.</p>\n<p>The <a href=\"https://thehill.com/homenews/administration/5612631-epstein-files-transparency-act/\" rel=\"noreferrer noopener\" target=\"_blank\">Epstein Files Transparency Act</a> requires the Department of Justice (DOJ) to provide Congress with an explanation for all redactions and the release of any immunity deals, nonprosecution agreements, plea bargains and sealed settlements provided to Epstein or his associates.</p>\n<p>Multiple redactions submitted by the DOJ have been contested by Reps. Thomas Massie (R-Ky.) and Ro Khanna (D-Calif.), in some cases leading to the information being released. </p>\n<p>In addition to a redacted copy of the DEA memo, Wyden asked for clarity regarding whether Epstein and his associates were buying or selling narcotics and why none of the 14 co-conspirators were prosecuted when the DEA’s “Chain Reaction” operation concluded.</p>\n<p>The memo in question notes that the case was opened in 2010 in New York and suggested it remained active when the memo was drafted in 2015. The co-conspirators, it said, were being investigated for “illegitimate wire transfers which are tied to illicit drug and/or prostitution activities occurring in the U.S. Virgin Islands and New York City.”</p>\n<p>The names of other co-conspirators and many other details in the memo are blacked out in the released files.</p>\n<p>The DEA did not immediately respond to The Hill’s request for comment.</p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/senate/5757891-wyden-presses-dea-epstein-probe/",
            "pub_date": "2026-02-27 07:36:40",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5757733,
            "title": "Childhood obesity hits record: CDC",
            "description": "<p>The Centers for Disease Control and Prevention (CDC) on Wednesday revealed that childhood and teen obesity rates in the U.S. have reached record highs in recent years.</p>\n<p>The <a href=\"https://www.cdc.gov/nchs/data/hestat/hestat111.pdf\" rel=\"noreferrer noopener\" target=\"_blank\">first report</a> details how the CDC’s researchers found that 40.3 percent of adults 20 and older were found to be obese, which included 9.7 percent who have severe obesity and another 31.7 percent who are classified as overweight. This report was conducted between August 2021 and August 2023.</p>\n<p>Between 1988 and 1994, when the <a href=\"https://www.cdc.gov/nchs/data/hestat/hestat112.pdf\" rel=\"noreferrer noopener\" target=\"_blank\">second report</a> was being surveyed, researchers found that almost 23 percent of adults 20 years and older were found to be obese. Of that number, 2.8 percent had severe obesity, and 33.1 percent were deemed overweight.</p>\n<p>The researchers relied on heights and weights established by the National Health and Nutrition Examination Survey to monitor and track years-long trends. Surveying for both reports was paused starting in March 2020 during the COVID-19 pandemic and resumed in August 2021.</p>\n<p>Professor David Ludwig of the Harvard T.H. Chan School of Public Health called the rate levels “exceptionally concerning.” He noted in <a href=\"https://hsph.harvard.edu/news/rising-childhood-obesity-exceptionally-concerning-says-expert/\" rel=\"noreferrer noopener\" target=\"_blank\">a report</a> published by the school that obesity rates were previously on a decline for children between 2 and 5 years old in the 2010s, something he said was a “glimmer of hope.” What reached down to 9.4 percent between 2013 and 2014 jumped to a 14.9 percent obesity rate.</p>\n<p>“We saw that dip [in 2014] and we all got excited thinking that we were beginning to turn the tide,” Ludwig said in the report. “In retrospect, that was more of a statistical aberration, more of mirage than a true glimmer of hope because the trend overall has continued upward.”</p>\n<p>The reports also show that adult obesity rates may be slowing as a result of public health policies and the introduction of GLP-1 agonists. </p>\n<p>“I do think the advent of the GLP-1s are absolutely playing a role,” Dr. John Brownstein, an epidemiologist at Boston Children’s Hospital, told <a href=\"https://abcnews.com/Health/us-child-teen-obesity-rates-reach-record-high/story?id=130441952\" rel=\"noreferrer noopener\" target=\"_blank\">ABC News</a>. “At that point in 2023, they weren’t as widespread as they are today. So, we expect that these factors could play even more significant role in more recent times.”</p>\n<p>The new data comes months after Gallup found that the country’s <a href=\"https://thehill.com/policy/healthcare/5578724-glp-1-weight-loss/\" rel=\"noreferrer noopener\" target=\"_blank\">obesity rate declined</a> in the last three years as a result of Americans using GLP-1 agonists for weight loss. Pollsters, however, noted that this was likely a “vanity effect” accounting for Gallup’s slightly lower obesity rates on average when compared with randomized clinical measurements.</p>",
            "kind": 1,
            "link": "https://thehill.com/policy/healthcare/5757733-obesity-rates-public-health/",
            "pub_date": "2026-02-27 07:36:40",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5758006,
            "title": "Anthropic says 'virtually no progress' on Pentagon AI talks as deadline looms",
            "description": "<p>Anthropic said Thursday that “virtually no progress” had been made in the company’s talks with the Pentagon over the terms of use for its AI models ahead of a Friday afternoon deadline.</p>\n<p>The Defense Department (DOD) delivered its <a data-id=\"https://thehill.com/policy/technology/5757667-pentagon-threatens-anthropic-dpa/\" data-type=\"link\" href=\"https://thehill.com/policy/technology/5757667-pentagon-threatens-anthropic-dpa/\">last and final offer</a> to the company on Wednesday night, asking the AI firm to allow the department to access Claude for “all lawful purposes.”</p>\n<p>It is unclear changes the Pentagon has proposed as part of its latest offer to the company.</p>\n<p>“The contract language we received overnight from the Department of War made virtually no progress on preventing Claude’s use for mass surveillance of Americans or in fully autonomous weapons,” an Anthropic spokesperson told The Hill in a statement on Thursday.</p>\n<p>“New language framed as compromise was paired with legalese that would allow those safeguards to be disregarded at will,” they added. “Despite DOW’s recent public statements, these narrow safeguards have been the crux of our negotiations for months.”</p>\n<p>The Pentagon has threatened to cancel Anthropic’s contract if it does not agree to the department’s terms by Friday afternoon. The AI firm was one of several companies that received a $200 million contract with the DOD last summer.</p>\n<p>Anthropic’s usage policy bars its AI model from being used for mass surveillance or lethal autonomous weapons. These two issues have been the company’s red lines in its weeks-long negotiations with the Pentagon.</p>\n<p>Amid this dispute, the DOD has also threatened to label Anthropic as a “supply chain risk” and to invoke the Defense Production Act (DPA) against the company. The DPA gives the president gives broad authority to control domestic industries in the name of national defense. </p>\n<p>The Pentagon has upped the pressure in recent days, reaching out to defense contractors about their reliance on Anthropic’s Claude in what appears to be an initial step toward labeling the company a supply chain risk. </p>\n<p>Amodei accused the DOD of “inherently contradictory threats” in negotiations with the the AI giant.</p>\n<p>“Regardless, these threats do not change our position: we cannot in good conscience accede to their request,” Amodei said in a lenghty statement.</p>\n<p>“It is the Department’s prerogative to select contractors most aligned with their vision,” he added. “But given the substantial value that Anthropic’s technology provides to our armed forces, we hope they reconsider. Our strong preference is to continue to serve the Department and our warfighters—with our two requested safeguards in place.”</p>\n<p>The Pentagon said earlier on Thursday that it has “no interest in using AI to conduct mass surveillance of Americans (which is illegal) nor do we want to use AI to develop autonomous weapons that operate without human involvement.”</p>\n<p>“Here’s what we’re asking: Allow the Pentagon to use Anthropic’s model for all lawful purposes,” Sean Parnell, chief Pentagon spokesperson , wrote in a post on the social platform X. “This is a simple, common-sense request that will prevent Anthropic from jeopardizing critical military operations and potentially putting our warfighters at risk. We will not let ANY company dictate the terms regarding how we make operational decisions.”</p>\n<p>The Pentagon’s latest proposal, which came less than 48 hours before the proposed deadline, included some of the Anthropic’s suggested language around narrow exceptions to the autonomous and surveillance provisions, a person familiar with the negotiations told The Hill on Thursday.  </p>\n<p>But substantively, the DOD offer reverts to permitting any lawful use while adding qualifiers where they see fit to the autonomy provision and all other applicable guidelines to the surveillance provision, the source briefed on the talks said.  </p>\n<p>The source argued that the additions are made to look like concessions, but ultimately give the other side the ability sideline restrictions whenever necessary.  </p>\n<p>They also accused the Pentagon of strategically leaking information to news outlets make it appear to be engaging in good-faith negotiations. </p>\n<p><em>Updated at 6:34 p.m. EST</em></p>",
            "kind": 1,
            "link": "https://thehill.com/policy/technology/5758006-anthropic-pentagon-ai-talks-stall/",
            "pub_date": "2026-02-27 07:36:39",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5757893,
            "title": "Mamdani touts productive meeting with Trump on housing",
            "description": "<p>New York City Mayor Zohran Mamdani on Thursday touted his “productive” meeting with President Trump at the White House, during which the mayor said they discussed the prospect of building more housing in their shared hometown.</p>\n<p>“I had a productive meeting with President Trump this afternoon,” Mamdani <a href=\"https://x.com/NYCMayor/status/2027113267710021738?s=20\">wrote in a post on the social platform X</a>. “I’m looking forward to building more housing in New York City.”</p>\n<p>The post included a photo of Mamdani standing in the Oval Office next to the president, who is holding up two front pages of the New York Daily News: one real one from 1975 and another mock-up, which Mamdani’s office confirmed the mayor gifted to the president on Thursday. </p>\n<p>In the president’s left hand is the authentic newspaper with the headline, “Ford to City: Drop Dead,” followed by the subheadline, “Vows He’ll Veto Any Bail-Out.” The article was published after former President Ford refused to bail out New York City as it approached bankruptcy in the 1970s.</p>\n<p>In Trump’s right hand is the fake newspaper, whose front page mirrors the formatting and language of the original. The fabricated headline reads, “Trump to City: Let’s Build,” followed by the subheadline, “Backs New Era of Housing.”</p>\n<p>Mamdani’s office told reporters after the meeting — which was not previously announced — that the mayor pitched the president on a project that could deliver an estimated 12,000 new units, which the mayor’s office characterized as potentially one of the biggest federal investments in housing in the past 50 years. </p>\n<p>The mayor’s office said the president was “enthusiastic” about the idea. The White House did not respond to a request for comment. </p>\n<p>Mamdani, who took office last month, ran on an affordability message focused in part on building more housing for New Yorkers. Trump first rose to prominence for his real estate ventures in New York.</p>\n<p>Mamdani’s unannounced trip to Washington on Thursday marks his second visit with the president since he was elected mayor in November. Despite vast differences in their views on a range of issues, the New Yorkers have expressed a willingness to collaborate on matters, like affordability, where their interests align.</p>\n<p>Also in the meeting, Mamdani said he asked the president if Immigration and Customs Enforcement (ICE) agents could release a Columbia University student detained that morning. Mamdani posted to social media later on Thursday saying the president called to inform him that “she will be released imminently.”</p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/administration/5757893-mamdani-trump-meet-housing-plans/",
            "pub_date": "2026-02-27 07:16:04",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5757893,
            "title": "Mamdani touts productive meeting with Trump on housing",
            "description": "<p>New York City Mayor Zohran Mamdani on Thursday touted his “productive” meeting with President Trump at the White House, during which the mayor said they discussed the prospect of building more housing in their shared hometown.</p>\n<p>“I had a productive meeting with President Trump this afternoon,” Mamdani <a href=\"https://x.com/NYCMayor/status/2027113267710021738?s=20\">wrote in a post on the social platform X</a>. “I’m looking forward to building more housing in New York City.”</p>\n<p>The post included a photo of Mamdani standing in the Oval Office next to the president, who is holding up two front pages of the New York Daily News: one real one from 1975 and another mock-up, which Mamdani’s office confirmed the mayor gifted to the president on Thursday. </p>\n<p>In the president’s left hand is the authentic newspaper with the headline, “Ford to City: Drop Dead,” followed by the subheadline, “Vows He’ll Veto Any Bail-Out.” The article was published after former President Ford refused to bail out New York City as it approached bankruptcy in the 1970s.</p>\n<p>In Trump’s right hand is the fake newspaper, whose front page mirrors the formatting and language of the original. The fabricated headline reads, “Trump to City: Let’s Build,” followed by the subheadline, “Backs New Era of Housing.”</p>\n<p>Mamdani’s office told reporters after the meeting — which was not previously announced — that the mayor pitched the president on a project that could deliver an estimated 12,000 new units, which the mayor’s office characterized as potentially one of the biggest federal investments in housing in the past 50 years. </p>\n<p>The mayor’s office said the president was “enthusiastic” about the idea. The White House did not respond to a request for comment. </p>\n<p>Mamdani, who took office last month, ran on an affordability message focused in part on building more housing for New Yorkers. Trump first rose to prominence for his real estate ventures in New York.</p>\n<p>Mamdani’s unannounced trip to Washington on Thursday marks his second visit with the president since he was elected mayor in November. Despite vast differences in their views on a range of issues, the New Yorkers have expressed a willingness to collaborate on matters, like affordability, where their interests align.</p>\n<p>Also in the meeting, Mamdani said he asked the president if Immigration and Customs Enforcement (ICE) agents could release a Columbia University student detained that morning. Mamdani posted to social media later on Thursday saying the president called to inform him that “she will be released imminently.”</p>",
            "kind": 1,
            "link": "https://thehill.com/business/housing/5757893-mamdani-trump-meet-housing-plans/",
            "pub_date": "2026-02-27 07:06:30",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5757945,
            "title": "GOP senators warn Justice Department to release all Epstein files mentioning Trump",
            "description": "<p>Republican senators are putting pressure on Attorney General Pam Bondi and the Justice Department to release all files related to convicted sex offender Jeffrey Epstein that mention President Trump’s name, warning the issue won’t go away until there is full transparency.</p>\n<p>GOP senators are urging the Justice Department to fully comply with the Epstein Files Transparency Act in the wake of media reports that the department hasn’t released records detailing claims a woman made in 2019 against both Epstein and Trump, that related to an incident from the 1980s.  </p>\n<p>Republicans are on the defensive as Senate Democratic Leader Chuck Schumer (N.Y.) is vowing that Democrats will use every tactic at their disposal to force the release of the missing records.</p>\n<p>Republican senators want the Justice Department to get ahead of the issue by releasing any records mentioning Trump that officials may have withheld due to their sensitive or unverified nature.</p>\n<p>“Release the documents. Redact the names of the victims. Don’t release photographs, naked or otherwise, of minors. Release the documents. This is not going to go away until there is full disclosure,” said Sen. John Kennedy (R-La.), a member of the Judiciary Committee.</p>\n<p>Asked about the whether the administration should hold back unverified allegations a woman made against Trump in several interviews with the FBI, Kennedy replied: “I don’t know how else to say it: Release the documents.”</p>\n<p>While he said the Justice Department should use some “discretion” in “good faith,” he advised officials should strive for maximum transparency.</p>\n<p>“This is not going away until there’s full disclosure and the American people want to know, and they’re entitled to know, who if anyone, did Epstein traffic these women to … and why they weren’t prosecuted,” Kennedy said.</p>\n<p>Asked about reports that the Justice Department has withheld files mentioning Trump, Sen. Susan Collins (R-Maine) said that would seem to be in conflict with what Congress intended when it overwhelmingly passed the Epstein Files Transparency Act.</p>\n<p>“I don’t know what the circumstances are and whether there’s legitimate reasons for redactions or withholding since he’s currently in office, but that would seem to be contrary with the intent of the law,” she said.</p>\n<p>Asked about missing files mentioning Trump’s name, Senate Judiciary Committee Chairman Chuck Grassley (R-Iowa) said the law passed by Congress last year was clear, the Justice Department should release all documents related to Epstein.</p>\n<p>“I think when we pass a law that says that all documents need to be put out, it seems to me all documents need to be put out,” Grassley said.</p>\n<p>The senior senator from Iowa said he hasn’t made a decision on whether he would hold a hearing on the Justice Department’s compliance with the law.</p>\n<p>Sen. Thom Tillis (R-N.C.), another member of the Judiciary panel, said it would be “concerning” if the Justice Department held back Epstein files that mention Trump.</p>\n<p>“If it’s in fact true, it’s concerning. Unless it fits the same filter as everyone else…,” he said. “I’ve heard the reporting but I haven’t nailed it down.”</p>\n<p>The New York Times and other media outlets reported this week that Epstein-related documents released by the Justice Department did not include FBI memos summarizing interviews with a woman who claimed that she was sexually assaulted by Trump and Epstein in the 1980s, when she was a minor.</p>\n<p>The White House has repeatedly said Trump did nothing wrong with regards to Epstein, and the Justice Department previously described the allegations as having no credibility.</p>\n<p>The missing memos were listed in an index that was publicly released by the Justice Department, which indicated that the FBI conducted four interviews related to the woman’s claims and wrote separate summaries about them.</p>\n<p>The interview notes connected to the investigation were not released, either.</p>\n<p>The Justice Department responded to The Times in a statement asserting that “the only materials that have been withheld were either privileged or duplicates” and later added that documents may have been withheld because of “an ongoing federal investigation.”</p>\n<p>On Wednesday night, Justice said it would be reviewing files to see if anything that should have been published was withheld.</p>\n<p>“Several individuals and news outlets have recently flagged files related to documents produced to <a href=\"https://thehill.com/people/ghislaine-maxwell/\">Ghislaine Maxwell </a>in discovery of her criminal case that they claim appear to be missing,” it said in a <a href=\"https://x.com/DOJRR47/status/2026769082159112295?s=20\">statement Wednesday</a>.</p>\n<p>“As with all documents that have been flagged by the public, the Department is currently reviewing files within that category of the production. Should any document be found to have been improperly tagged in the review process and is responsive to the Act, the Department will of course publish it, consistent with the law.”</p>\n<p>Independent journalist Roger Sollenberger first reported on the missing pages.</p>\n<p>Sen. Joni Ernst (R-Iowa) said she hasn’t closely followed the Justice Department’s compliance with the law but added that she would want to “look into” the matter.</p>\n<p>“I thought that they had released all of the files. So it’s definitely something I’d want to look into because I think Congress as a body has really said we need clarity on this issue,” she said.</p>\n<p>Schumer joined several other Democratic senators at a press conference in the Capitol Thursday pledging to keep pushing the issue until the Justice Department issues all the Epstein files in its possession, including all documents that mention the president.  </p>\n<p>“The law requires the DOJ to release all the files, not just some of the files, not just the ones they pick and choose and want to do,” Schumer said Thursday. “Let me be blunt, there is a massive coverup going on in the Justice Department to protect Donald Trump and people associated with Jeffrey Epstein.</p>\n<p>Schumer said Democrats are working with the victims’ attorneys and legal experts to push for the release of additional documents.</p>\n<p>“We will not rest, it’s an all-out oversight effort. We’re going to pull on every thread, we’re going to chase every lead. We’ll talk to whistleblowers,” he announced.</p>\n<p>A group of Senate Democrats plan to travel to the Justice Department “in the coming days” to review the unredacted Epstein files.</p>\n<p>“Pam Bondi should listen carefully, the truth will come out,” Schumer said. “Democrats are going to hold Pam Bondi and everyone involved at the DOJ accountable for this cover up.”</p>\n<p>Democrats have asked the Justice Department and FBI to preserve all records related to decisions on redacting and withholding Epstein related documents.</p>\n<p>Rep. Robert Garcia (D-Calif.), the ranking member of the House Oversight and Government Reform Committee, said in a statement Tuesday that Justice Department “appears to have illegally withheld FBI interviews” with the woman who made allegations against Trump.</p>\n<p>Garcia pledged to open up an investigation on the matter.</p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/senate/5757945-trump-epstein-files-release/",
            "pub_date": "2026-02-27 07:06:30",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5757763,
            "title": "US threatens to cut off Swiss bank from financial system over alleged Iran, Russia ties",
            "description": "<p>The Treasury Department on Thursday <a data-id=\"https://home.treasury.gov/news/press-releases/sb0408\" data-type=\"link\" href=\"https://home.treasury.gov/news/press-releases/sb0408\">threatened to cut off</a> MBaer Merchant Bank AG’s access to U.S. financial institutions over the Swiss bank’s alleged ties to sanctioned Iranian and Russian actors.</p>\n<p>The Treasury accused MBaer and its employees of enabling corruption linked to Russian money laundering, as well as money laundering and terrorist financing on behalf of Iran’s Islamic Revolutionary Guard Corps and its Quds Force.  </p>\n<p>The department said it <a href=\"https://www.fincen.gov/system/files/2026-02/MBaer-NPRM.pdf\">proposed a change</a> to its Financial Crimes Enforcement Network (FinCEN) rules that would prohibit covered U.S. financial institutions from opening or maintaining accounts for, or on behalf of, MBaer.</p>\n<p>The action, if finalized, would mark the strongest possible action the Treasury can take against a bank, effectively stifling MBaer’s ability to handle transactions involving U.S. currency.</p>\n<p>“MBaer has funneled over a hundred million dollars through the U.S. financial system on behalf of illicit actors tied to Iran and Russia,” Treasury Secretary Scott Bessent said in a statement. “Banks should be on notice that the U.S. Treasury will aggressively protect the integrity of the U.S. financial system using the full force of our authorities.”</p>\n<p>Swiss media outlets <a href=\"https://www.swissinfo.ch/eng/various/mbaer-bank-categorised-as-a-money-laundering-risk-by-us-authorities/91005422?utm_source=multiple&amp;utm_campaign=swi-rss&amp;utm_medium=rss&amp;utm_content=o\">reported</a> that the Swiss Financial Market Supervisory Authority (FINMA), the independent government body responsible for supervising Swiss financial markets, concluded enforcement proceedings against MBaer several weeks ago.</p>\n<p>The body found that the bank had breached anti-money laundering rules and risk management requirements, particularly related to sanctions. It has appointed an audit officer to “monitor” the bank while an appeal is pending, <a href=\"https://www.finma.ch/en/news/2026/02/20260226-mm-mbaer/\">according to a FINMA news release</a>. FINMA also said it is in contact with FinCen.</p>\n<p>The U.S. has expanded sanctions on Iran and Russia in recent weeks, targeting key revenue streams, <a href=\"https://thehill.com/homenews/administration/5568227-treasury-russia-sanctions-rosneft-lukoil/\">such as oil sales</a>, that officials claim the nations’ leaders rely on to fund military programs and unlawful activities.  </p>\n<p>The Treasury on Wednesday <a href=\"https://thehill.com/homenews/administration/5755158-us-iran-sanctions-oil-nuclear-program/\">imposed additional sanctions</a> on Iranian individuals, companies and vessels that it accused of facilitating the country’s illicit oil sales and ballistic missile program.</p>\n<p>The fresh batch was announced a day before <a href=\"https://thehill.com/newsletters/1230-report/5756781-high-stakes-iran-nuclear-talks/\">indirect negotiations</a> on Tehran’s nuclear program resumed in Geneva, Switzerland, amid a <a href=\"https://thehill.com/policy/defense/5737201-uss-gerald-r-ford-middle-east-us-iran/\">buildup of U.S. military firepower</a> in the region and <a href=\"https://thehill.com/policy/international/5755742-trump-iran-nuclear-threat/\">threats of potential military action</a> if diplomacy fails.   </p>\n<p>Omani Foreign Minister Badr Albusaidi said U.S. and Iranian officials made “<a href=\"https://thehill.com/policy/international/5757110-us-iran-talks-oman-complete/\">significant progress</a>” in the discussions, with further talks planned for next week.</p>\n<p>“We will resume soon after consultation in the respective capitals. Discussions on a technical level will take place next week in Vienna. I am grateful to all concerned for their efforts: the negotiators, the IAEA, and our hosts the Swiss government,” Albusaidi <a href=\"https://x.com/badralbusaidi/status/2027089708392579576\">wrote on the social platform X</a>.</p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/administration/5757763-treasury-threatens-mbaer-swiss-bank/",
            "pub_date": "2026-02-27 06:41:03",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5757847,
            "title": "Power plant pollution rose last year, green group analysis finds",
            "description": "<p>U.S. power plant pollution rose last year, according to a green group’s analysis of Environmental Protection Agency (EPA) data.</p>\n<p>Emissions of sulfur dioxide increased by 18 percent in 2025, according to an analysis by the <a href=\"https://www.nrdc.org/press-releases/coal-pollution-spiked-after-trump-administrations-free-pass-pollute\" rel=\"noreferrer noopener\" target=\"_blank\">Natural Resources Defense Council</a>, an environmental advocacy group, of the EPA data.</p>\n<p>The group found that plants’ nitrogen oxide emissions increased 7 percent and their carbon dioxide emissions increased by 4 percent.</p>\n<p>Both <a href=\"https://www.epa.gov/so2-pollution/sulfur-dioxide-basics\" rel=\"noreferrer noopener\" target=\"_blank\">sulfur dioxide</a> and <a href=\"https://www.epa.gov/no2-pollution/basic-information-about-no2\" rel=\"noreferrer noopener\" target=\"_blank\">nitrogen oxides</a> can harm peoples’ respiratory systems. </p>\n<p>The analysis found that at <a href=\"https://thehill.com/policy/energy-environment/5239327-trump-exempts-coal-plants/\" rel=\"noreferrer noopener\" target=\"_blank\">the dozens of coal plants</a> that President Trump exempted from strict Biden-era standards for <a href=\"https://thehill.com/policy/energy-environment/5747717-trump-coal-plants-lead-mercury/\" rel=\"noreferrer noopener\" target=\"_blank\">Mercury and Air Toxics (MATS)</a>, sulfur dioxide emissions increased by 24 percent.</p>\n<p>“President Trump gave coal plants a free pass to pollute, and they took him up on the offer,” said Amanda Levin, director of policy analysis at the Natural Resources Defense Council (NRDC) in a written statement.  “With no cop on the beat to make sure the owners of these plants ran their pollution controls effectively, they ignored the health of their surrounding communities to save a few bucks on their costs. The rest of us will pay with our health.”</p>\n<p>The EPA, however, accused the group of cherry-picking data in a misleading way.</p>\n<p>“NRDC is peddling misleading, cherry-picked data in a desperate attempt to drum up donations,” an EPA spokesperson said via email. </p>\n<p>“MATS has little or nothing to do with sulfur dioxide emissions. And even if the now-repealed Biden EPA 2024 MATS rule had gone into effect, compliance with the 2024 MATS requirements was not required until 2027, so those requirements did not impact 2025 emissions,” the spokesperson added. </p>\n<p>The Trump administration has sought to bolster coal plants, including by loosening climate and environmental standards, providing funds and ordering plants to stay online. It has argued that this power is needed to support the electric grid, while environmental groups have raised concerns about pollution and climate change.</p>",
            "kind": 1,
            "link": "https://thehill.com/policy/energy-environment/5757847-trump-epa-power-plant-pollution/",
            "pub_date": "2026-02-27 06:41:03",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5757758,
            "title": "Warner Bros. Discovery: Paramount's hostile bid 'superior' to Netflix offer",
            "description": "<p>Warner Bros. Discovery, the sprawling entertainment company that owns major media brands like HBO and CNN, said Thursday it now favors a <a href=\"https://thehill.com/homenews/media/5754397-warner-bros-paramount-netflix-deal/\" rel=\"noreferrer noopener\" target=\"_blank\">bid made by Paramount</a> to buy the company’s key assets over a previous agreement with streamer Netflix.</p>\n<p>The company’s board, “following consultation with its independent financial and legal advisors,” said it had found Paramount’s deal to be a “Company Superior Proposal,” triggering a four-business-day period during which Netflix has the right to propose revisions to its<strong> </strong>merger agreement.</p>\n<p>One of the largest streamers in the world, Netflix announced late last year it had <a href=\"https://thehill.com/media/5721455-netflix-warner-brothers-merger-hearing/\" rel=\"noreferrer noopener\" target=\"_blank\">struck an agreement</a> to acquire Warner Bros. Discovery’s movie and television studios as part of a deal valued at more than $70 billion.</p>\n<p>But the deal has been met with opposition in recent days as President Trump and a growing number of elected Republicans have accused Netflix of left-leaning bias while Democrats on Capitol Hill have raised antitrust concerns.</p>\n<p>Paramount’s hostile bid, which seeks to purchase the entire Warner Bros. Discovery portfolio including its linear television assets like CNN and TNT Sports, comes with a purchase price of $31 per share in cash, as well as a $7 billion regulatory termination fee for the previous deal with Netflix.</p>\n<p>Warner Bros. Discovery had until Friday been urging its board to support the deal with Netflix, even as Paramount mounted its hostile push for the Hollywood giant.</p>\n<p>Any sale of Warner Bros. Discovery’s assets would need to be approved by Trump’s Department of Justice, which earlier this month ousted the head of its antitrust division.</p>\n<p>Trump has praised efforts by the Larry and David Ellison, the father-son duo atop Paramount, to retool the network’s news and entertainment divisions, moves that many Democrats and media critics view as a shift rightward to please the Trump administration.</p>\n<p>The president, who had not previously voiced opposition to the Warner Bros. Discovery-Netflix deal, attacked Netflix over the weekend, saying the <a href=\"https://thehill.com/homenews/media/5750810-netflix-warner-brothers-ted-sarandos-trump-rice/\" rel=\"noreferrer noopener\" target=\"_blank\">company should remove</a> Democratic political operative Susan Rice from its board over comments she made that were critical of his administration or “face the consequences.”</p>\n<p>The Netflix merger agreement remains in effect, Warner Bros. Discovery noted Thursday, saying its board continues to “recommend in favor of the Netflix transaction and has not withdrawn or modified its recommendation.”</p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/media/5757758-paramount-hostile-bid-warner-discovery/",
            "pub_date": "2026-02-27 06:41:02",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5757667,
            "title": "Pentagon draws scrutiny with Anthropic threats, Defense Production Act",
            "description": "<p>The Pentagon is threatening to use the Defense Production Act (DPA) against Anthropic amid a dispute over the company’s restrictions on its AI tools, in a move that many experts say is an unusual use of the measure.</p>\n<p>The Defense Department (DOD) warned Anthropic on Tuesday that it could invoke the DPA, which gives the president broad authority to control domestic industries in the name of national defense, to use the AI firm’s tool on its own terms.</p>\n<p>The threat marks an <a data-id=\"https://thehill.com/policy/defense/5752960-pentagon-threatens-anthropic-contract/\" data-type=\"link\" href=\"https://thehill.com/policy/defense/5752960-pentagon-threatens-anthropic-contract/\">escalation in the feud</a> between the two parties. Negotiations appear to be at a standstill, with the Pentagon giving Anthropic until Friday to comply with its terms or face a cancellation of a $200 million contract and risk being labeled a “supply chain risk” or confronting the DPA.</p>\n<p>“It’s the wrong purpose of the tool,” Mark Dalton, senior policy director for technology and innovation at the R Street Institute, told The Hill. “The DPA exists for a capacity reason, like it’s an industrial capacity policy, and to use it as leverage is, I think, irresponsible.”</p>\n<p>Anthropic and the Pentagon have been <a data-id=\"https://thehill.com/policy/defense/5750785-claude-ai-pentagon-contract-risk/\" data-type=\"link\" href=\"https://thehill.com/policy/defense/5750785-claude-ai-pentagon-contract-risk/\">locked in tense negotiations</a> in recent weeks over the company’s AI usage policy, which bars its AI model Claude from being used to conduct mass surveillance or develop lethal autonomous weapons.</p>\n<p>These two issues have become the company’s red lines in the dispute. A source familiar with negotiations told The Hill on Monday that Anthropic’s resistance stemmed from concerns that AI systems are not reliable enough to make life-or-death decisions and the technology significantly changes what is possible with domestic surveillance.</p>\n<p>Meanwhile, the Pentagon has pushed for the company to accept language that allows for “all lawful uses.”</p>\n<p>On Wednesday night, the DOD sent its last and final offer to Anthropic, asking the AI giant to allow the department to access Claude for “all lawful purposes,” a senior Pentagon official told The Hill on Thursday. CBS News reported earlier on the offer.</p>\n<p>The Hill has reached out to Anthropic for comment.</p>\n<p>Sean Parnell, chief Pentagon spokesperson, noted Thursday that the department has “no interest in using AI to conduct mass surveillance of Americans (which is illegal) nor do we want to use AI to develop autonomous weapons that operate without human involvement.”</p>\n<p>“Here’s what we’re asking: Allow the Pentagon to use Anthropic’s model for all lawful purposes,” he wrote in a post on social platform X. “This is a simple, common-sense request that will prevent Anthropic from jeopardizing critical military operations and potentially putting our warfighters at risk. We will not let ANY company dictate the terms regarding how we make operational decisions.”</p>\n<p>Under Secretary of War for Research and Engineering Emil Michael, who was at a Tuesday meeting between Defense Secretary Pete Hegseth and Anthropic CEO Dario Amodei, similarly said Thursday that mass surveillance would be a violation of the Fourth Amendment and the Pentagon would never do it.</p>\n<p>The dispute is notable given that Anthropic’s Claude has so far been the only AI model available to the department on its classified systems.</p>\n<p>However, the department recently reached a new agreement with Elon Musk’s xAI to use its AI model on the classified side, a Pentagon official told The Hill, while Google’s Gemini and OpenAI’s ChatGPT are “close.”</p>\n<p>Negotiations came to a head Tuesday, when Amodei met with Hegseth at the Pentagon, and the department gave the company an ultimatum — agree to its terms by 5:01 p.m. EST on Friday or it will cancel their contract.</p>\n<p>The AI company was one of several firms, alongside Google, OpenAI and xAI, that scored a $200 million contract with the Defense Department last summer.</p>\n<p>The Pentagon also upped the ante by raising the prospect of invoking the DPA and “supply chain risk” label.</p>\n<p>While the department may only be employing these threats as negotiating tactics, the potential use of the DPA is drawing scrutiny from experts and Democratic lawmakers.</p>\n<p>“This is unprecedented,” said Charlie Bullock, a senior research fellow at the Institute for Law &amp; AI.</p>\n<p>He underscored that the Pentagon’s DPA threat could fall outside the parameters of the statute or raise constitutional concerns, including under the First Amendment.</p>\n<p>“It’s mostly for traditional manufacturing in times of emergency,” Dalton added. “I get that everything feels emergent these days, but I don’t see what national emergency using DPA for a software company solves.”</p>\n<p>Democratic Sens. Elizabeth Warren (D-Mass.), who is on the Senate Armed Services Committee, and Andy Kim (D-N.J.) argued that Congress passed the DPA to aid the U.S. economy in times of needs, not to permit the Trump administration to “extort American companies that refuse to help the Pentagon to surveil Americans or build killer robots.”</p>\n<p>“If Secretary Hegseth weaponizes the DPA against American companies, he will shatter the bipartisan consensus in support of a strong DPA – weakening our hand in competition with China and our ability to ensure American competitiveness,” the pair said in a statement Wednesday.</p>\n<p>Previous administrations have invoked the DPA to boost production of goods during the COVID-19 pandemic. The Biden administration used the measure to up the production of baby formula, clean energy and vaccines, as well as to require AI companies to share safety information with the federal government.</p>\n<p>During his first term, President Trump used the law to address ventilator shortages. He has used the measure in his second term to increase the nation’s production of critical minerals.</p>\n<p>Title I of the DPA allows the president to require individuals or companies to prioritize or accept contracts as is necessary to promote the national defense, according to the Congressional Research Service. Several experts suggested this is likely the portion of the law that the Pentagon would turn to in this case.</p>\n<p>“I don’t believe he’s abusing the law in doing so,” said Greg Williams, director of the Center for Defense Information at the Project On Government Oversight (POGO).</p>\n<p>“However, I think it’s unfortunate the Pentagon is not as interested as Anthropic appears to be in ensuring the safe, lawful and ethical use of artificial intelligence,” he added.</p>\n<p>Neil Chilson, the head of AI policy at the Abundance Institute, who is a critic of the expanding uses of DPA Title I, said the measure’s use in this case is at least within the scope of defense and intent than in previous instances.</p>\n<p>“Because we are talking about DOD procuring services for defense purposes, right? So at least at the very high level, this is closer to the intent of the statute,” Chilson said in an interview with The Hill.</p>\n<p>Still, he said Pentagon’s threat of invoking the DPA is “perhaps more aggressive, even if it’s more within the sort of intent of the statute,” compared to the use of the law by previous administrations.</p>\n<p>Following Tuesday’s meeting, the Pentagon continued turning the screws on Anthropic, reaching out to defense contractors about its reliance on Claude, in what appears to be an initial step toward labeling the company a supply chain risk.</p>\n<p>Lockheed Martin spokesperson confirmed to The Hill that the Pentagon reached out to the defense contractor about its usage of Claude. The spokesperson declined to say when exactly the DOD reached out. Axios first reported on the outreach.</p>\n<p>Boeing Defense, Space and Security, a division of Boeing, does not have an active contract with Anthropic, a spokesperson confirmed to The Hill on Thursday.</p>\n<p>“What seems really sketchy here is this after the fact trying to change the terms of a contract without going through the regular contract negotiation process and what appears to be an abuse of labeling a contract a supply chain risk,” Williams of POGO said.</p>\n<p>“A supply chain risk is somebody who might not deliver on something they’ve agreed to do,” he added. “As far as I understand it, Anthropic is not suggesting they wouldn’t deliver on the terms of their existing contract.”</p>\n<p>James E. Baker, former chief judge of the U.S. Court of Appeals for the Armed Forces, also argued there is a discrepancy between invoking the DPA and slapping the supply chain risk designation on a company.</p>\n<p>“As [former DOD official] Greg Allen has stated, there is an inherent contradiction between threatening to designate a company a supply chain risk, and using the DPA to compel provision of the company’s services,” Baker, who is now the director of the Syracuse University Institute for Security Policy and Law, told The Hill on Thursday.</p>\n<p>But Chilsonof the Abundance Institute argued the Pentagon could both invoke the DPA and slap the supply chain risk designation on Anthropic.</p>\n<p>“I think logically it would make sense to say, like, we need a tool that lets us make decisions,” he said. “It doesn’t make decisions for us and if you’re not going to provide that tool, then we’re worried about the tools that you are providing to our downstream vendors.”</p>\n<p>Jerry McGinn, director of the Center for the Industrial Base at the Center for Strategic and International Studies, argued that if a company does not want to do work in certain area and under certain conditions, they can pull out of the contract or the government can cancel it.</p>\n<p>“The government has the vehicles they need to stop the work if they want and find another provider,” McGinn said in an interview with The Hill.</p>",
            "kind": 1,
            "link": "https://thehill.com/policy/technology/5757667-pentagon-threatens-anthropic-dpa/",
            "pub_date": "2026-02-27 06:05:54",
            "source": "thehill",
            "language": "en"
        }
    ]
}