{
    "data": [
        {
            "id": 5759180,
            "title": "Mexican President Claudia Sheinbaum's brave fight against narcoterrorism",
            "description": "<p>When Mexican forces killed Nemesio Oseguera Cervantes — known as “El Mencho,” the longtime head of the Jalisco New Generation Cartel — the retaliation by one of the most violent criminal organizations in the Western Hemisphere was immediate and brutal.</p>\n<p>Gunfire erupted in crowded streets. Highways were blocked with burning vehicles. Armed convoys menaced neighborhoods. Entire cities shut down as cartel gunmen sought to reassert their reach. In the first 24 hours alone, <a href=\"https://www.cbsnews.com/news/el-mencho-killed-25-mexican-national-guard-troops-killed-jalisco-cartel/\" rel=\"noreferrer noopener\" target=\"_blank\">dozens of Mexican National Guard members</a> were killed in coordinated counterattacks — a stark reminder that this cartel operates not as a street gang, but as a heavily armed insurgent enterprise.</p>\n<p>Mexico’s operation against Jalisco New Generation is part of a truly courageous and successful campaign by Mexican President Claudia Sheinbaum since taking office: direct action against cartel leadership combined with expanded cooperation with the U.S.</p>\n<p>To be clear, this was not a unilateral strike carried out in isolation. Targeting cartel leadership was undertaken in close partnership with U.S. authorities, relying on shared intelligence, coordinated targeting, and operational synchronization. The campaign underscores a maturing bilateral security relationship to counter a common threat.</p>\n<p>Her administration has also <a href=\"https://apnews.com/article/mexico-us-trump-cartel-members-garcia-harfuch-e6af78fd8a5c851a81f7174324d55e51\" rel=\"noreferrer noopener\" target=\"_blank\">accelerated extraditions</a> of senior cartel figures to U.S. courts — a consequential step that disrupts command structures and removes high-level operators from Mexican territory. These extraditions are politically sensitive, diplomatically complex, and life-threatening to Sheinbaum personally. She has proceeded anyway.</p>\n<p>Last month, after Mexican authorities helped arrest a major trafficker on the U.S. most wanted list, FBI Director Kash Patel traveled to Mexico, underscoring an increasingly operational partnership. Senior-level dialogue, intelligence fusion, and coordinated enforcement actions now define the relationship more than public friction does.</p>\n<p>For President Donald Trump, dismantling fentanyl networks and cartel supply chains has been central to his national security agenda. For Mexico, cartel dominance has eroded public safety and seriously undermined state authority. Our joint strategic interests align.</p>\n<p>Groups like Jalisco New Generation operate with paramilitary capability. They field armored vehicles, deploy military-grade weapons, buy off and threaten officials, and use spectacular violence to intimidate governments and populations alike. Authorizing operations against senior leadership invites brutal retaliation, carrying risk well beyond the battlefield. Cartels have assassinated local officials, infiltrated institutions, and issued threats that reach into every facet of national politics.</p>\n<p>The deadly response following El Mencho’s killing demonstrates both the scale of the threat and the seriousness of Mexico’s current approach. Sheinbaum is escalating pressure and delivering tangible blows against organizations that have long relied on fear as a governing tool.</p>\n<p>That makes Washington’s posture critical.</p>\n<p>Public threats of unilateral U.S. military action inside Mexico would complicate the very strategy currently underway. Sheinbaum is taking significant political and personal risk by targeting cartel leadership, increasing extraditions, and deepening cooperation with U.S. authorities. Her credibility at home matters. Strengthening it advances shared objectives. Undermining it weakens a partner engaged in a high-stakes confrontation with transnational criminal networks.</p>\n<p>Cooperation is already functioning at a serious level. Escalatory rhetoric could disrupt intelligence sharing and embolden criminal organizations eager to portray bilateral tension as opportunity.</p>\n<p>Fentanyl continues to devastate American communities. But we must recognize that drug users in the United States demand Mexican drugs, supply the money to pay for them and the chemicals to make them. Likewise, the vast majority of weapons in the hands of the cartels comes from the United States. It is reasonable therefore for Mexicans to believe we are part of the problem, and have every reason to expect us to do our part to help them end the scourge threatening their own country.</p>\n<p>Enforcement alone will not solve either the supply or demand challenge; long-term progress requires institutional reform, fighting addiction, anti-corruption measures, and economic resilience. But enforcement remains essential. Removing leadership, disrupting logistics, and severing financial pipelines are prerequisites for broader reform.</p>\n<p>Sheinbaum’s current course reflects that understanding. Targeting high-level figures, facilitating extraditions, and coordinating closely with U.S. counterparts represent sustained strategic decisions, not isolated gestures.</p>\n<p>The U.S. benefits when Mexico acts decisively against narcoterrorism. Mexico benefits when the partnership is steady and credible. Cartels benefit when political friction disrupts coordinated pressure.</p>\n<p>This is a moment for alignment.</p>\n<p>Sheinbaum is pressing against some of the most powerful criminal organizations in the hemisphere. Doing so exposes her government — and her personally — to retaliation. It also reinforces the principle that the Mexican state, not armed syndicates, governs Mexican territory.</p>\n<p>Washington should reinforce that effort. Support, intelligence cooperation, and disciplined messaging will advance shared security goals more effectively than threats of unilateral action.</p>\n<p>Narcoterrorism is a transnational problem that demands sustained cooperation. To that end, Claudia Sheinbaum has proven herself a fearless and capable partner. With the cartels on the run, Mexico needs an ally not an adversary.</p>\n<p><em>Richard Swett served as the U.S. representative for <a href=\"https://ballotpedia.org/New_Hampshire%27s_2nd_Congressional_District\" rel=\"noreferrer noopener\" target=\"_blank\">New Hampshire’s 2nd District</a> from 1991 to 1995. He also served as the <a href=\"https://1997-2001.state.gov/about_state/biography/swett_richard.html\" rel=\"noreferrer noopener\" target=\"_blank\">U.S. Ambassador to Denmark</a> from 1998 to 2001. Republican Christopher Shays served as the U.S. representative for Connecticut’s 4th District from 1987 to 2009. </em></p>",
            "kind": 1,
            "link": "https://thehill.com/opinion/international/5759180-mexican-cartel-violence-retaliation/",
            "pub_date": "2026-03-01 00:18:06",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5760441,
            "title": "Former Trump AI adviser calls Anthropic decision 'attempted corporate murder'",
            "description": "<p>One of President Trump’s former senior artificial intelligence advisers is sharply criticizing the Defense Department’s <a href=\"https://thehill.com/policy/technology/5758006-anthropic-pentagon-ai-talks-stall/\">ongoing feud</a> with AI company Anthropic. </p>\n<p>In a <a href=\"https://x.com/deanwball/status/2027515599358730315\">post</a> on social media platform X, Dean Ball said companies like Nvidia, Amazon and Google “will have to divest from Anthropic” if Defense Secretary Pete Hegseth “gets his way.”</p>\n<p>“This is simply attempted corporate murder,” Ball continued. “I could not possibly recommend investing in American AI to any investor; I could not possibly recommend starting an AI company in the United States.”</p>\n<p>Ball’s comments follow weeks of <a data-id=\"https://thehill.com/policy/technology/5757667-pentagon-threatens-anthropic-dpa/\" data-type=\"link\" href=\"https://thehill.com/policy/technology/5757667-pentagon-threatens-anthropic-dpa/\">back and forth</a> between the Trump administration and the company over the Pentagon’s criticism of its restrictions. Anthropic was one of several companies awarded a $200 million contract with the department and its model was used by the U.S. military during the <a data-id=\"https://thehill.com/homenews/5670708-trump-captures-maduro-us-venezuela-strikes/\" data-type=\"link\" href=\"https://thehill.com/homenews/5670708-trump-captures-maduro-us-venezuela-strikes/\">capture</a> of Venezuelan leader Nicolás Maduro in January.</p>\n<p>The AI company <a href=\"https://thehill.com/policy/defense/5740369-pentagon-anthropic-relationship-review/\">expressed concerns</a> earlier this month that their signature product, Claude, could be directed to develop weaponry that fires without human input or used for mass surveillance. The administration pushed back on agreeing to these limits, saying the terms would limit the military’s work. </p>\n<p>The Pentagon gave Anthropic a <a href=\"https://thehill.com/policy/defense/5752960-pentagon-threatens-anthropic-contract/\">deadline</a> of Friday at 5:01 p.m. EST to agree to lift the restrictions. President Trump <a href=\"https://thehill.com/policy/technology/5759399-trump-bans-anthropic-tech/\">directed</a> all federal agencies to cease using the company’s products on Friday and Hegseth <a href=\"https://thehill.com/policy/defense/5759630-pentagon-designates-anthropic-risk/\">categorized</a> it as a supply chain risk. </p>\n<p>“Anthropic’s stance is fundamentally incompatible with American principles,” Hegseth said in a post on <a href=\"https://x.com/secwar/status/2027507717469049070?s=46\">social platform X</a>. “Their relationship with the United States Armed Forces and the Federal Government has therefore been <a href=\"https://thehill.com/policy/technology/5758006-anthropic-pentagon-ai-talks-stall/\">permanently altered</a>.” </p>\n<p>Some of Anthropic’s competitors have come out <a href=\"https://thehill.com/policy/technology/5759106-google-openai-anthropic-pentagon-ai/\">in support</a> of the AI company’s push for these safeguards. Hundreds of employees from Google and OpenAI signed an <a href=\"https://notdivided.org/\">open letter</a>, titled “We Will Not Be Divided,” accusing the Pentagon of pushing similar demands for their companies’ AI models. </p>\n<p>“The Pentagon is <a href=\"https://removepaywalls.com/https://www.axios.com/2026/02/23/ai-defense-department-deal-musk-xai-grok\">negotiating</a> with Google and OpenAI to try to get them to agree to what Anthropic has refused,” the employees wrote. </p>\n<p>“They’re trying to divide each company with fear that the other will give in,” they continued. “That strategy only works if none of us know where the others stand. This letter serves to create shared understanding and solidarity in the face of this pressure from the Department of War.”</p>\n<p>Additionally, OpenAI CEO Sam Altman <a data-id=\"https://apnews.com/article/openai-amazon-nvidia-softbank-altman-microsoft-a0a915c32b85337d799fe2f9525a932a\" data-type=\"link\" href=\"https://apnews.com/article/openai-amazon-nvidia-softbank-altman-microsoft-a0a915c32b85337d799fe2f9525a932a\">announced a deal</a> with the Pentagon on Friday. He <a data-id=\"https://x.com/sama/status/2027578652477821175\" data-type=\"link\" href=\"https://x.com/sama/status/2027578652477821175\">said in an X post</a> that the Defense Department agreed to prohibitions on mass surveillance and the creation of autonomous weapons — which mirrored Anthropic’s limits.</p>\n<p>Altman also noted that the administration “displayed a deep respect for safety and a desire to partner to achieve the best possible outcome.”</p>\n<p>“We are asking the DoW to offer these same terms to all AI companies, which in our opinion we think everyone should be willing to accept,” he continued. “We have expressed our strong desire to see things de-escalate away from legal and governmental actions and towards reasonable agreements.”</p>\n<p>“We remain committed to serve all of humanity as best we can,” Altman added. “The world is a complicated, messy, and sometimes dangerous place.”</p>",
            "kind": 1,
            "link": "https://thehill.com/policy/technology/5760441-dean-ball-trump-hegseth-ai-anthropic-feud/",
            "pub_date": "2026-03-01 00:18:06",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5760434,
            "title": "Kaine: Trump 'too mentally incapacitated' to understand he set stage for Iran nuclear development",
            "description": "<p>Sen. Tim Kaine (D-Va.) asked whether President Trump was “too mentally incapacitated” to realize he set the stage for the growth of <a data-id=\"https://thehill.com/policy/international/5759623-iran-nuclear-deal-stockpiling/\" data-type=\"link\" href=\"https://thehill.com/policy/international/5759623-iran-nuclear-deal-stockpiling/\">Iran’s nuclear program</a> during his first term.</p>\n<p>“Has President Trump learned nothing from decades of U.S. meddling in Iran and forever wars in the Middle East?” Kaine asked. “Is he too mentally incapacitated to realize that we had a diplomatic agreement with Iran that was keeping its nuclear program in check, until he ripped it up during his first term?”</p>\n<p>Trump in 2018 <a data-id=\"https://thehill.com/homenews/administration/386656-trump-pulls-us-out-of-iran-deal/\" data-type=\"link\" href=\"https://thehill.com/homenews/administration/386656-trump-pulls-us-out-of-iran-deal/\">withdrew</a> the U.S. from the Joint Comprehensive Plan of Action (JCPOA) initially signed in 2015, a deal that was effectively blocking Iran’s pathway to building a bomb.</p>\n<p>In <a data-id=\"https://thehill.com/policy/defense/5760058-us-israel-launch-strikes-on-iran/\" data-type=\"link\" href=\"https://thehill.com/policy/defense/5760058-us-israel-launch-strikes-on-iran/\">launching an attack</a> on Iran Saturday, the president <a data-id=\"https://truthsocial.com/@realDonaldTrump/posts/116147082884192486\" data-type=\"link\" href=\"https://truthsocial.com/@realDonaldTrump/posts/116147082884192486\">said the move was necessary</a> to “defend the American people by eliminating imminent threats from the Iranian regime.”</p>\n<p>That argument comes after the U.S. military <a data-id=\"https://thehill.com/policy/defense/5362470-us-iran-bombing-takeaways/\" data-type=\"link\" href=\"https://thehill.com/policy/defense/5362470-us-iran-bombing-takeaways/\">launched strikes on Iran</a> last June, with Trump at the time asserting the U.S. had “obliterated” Iran’s nuclear program.</p>\n<p>That claim generated much pushback, with skeptics arguing Iran wasn’t on the brink of developing a weapon, while additional intelligence showed the strikes landed in other Iranian facilities and only set their nuclear development back by a few months.</p>\n<p>“For months, I have raised hell about the fact that Americans want lower prices, not more wars – especially wars that aren’t authorized by Congress, as required by the Constitution, and don’t have a clear objective,” Kaine continued Saturday. </p>\n<p>“These strikes are a colossal mistake, and I pray they do not cost our sons and daughters in uniform and at our embassies throughout the region their life,” he added.</p>\n<p>Several Democrats <a data-id=\"https://thehill.com/homenews/senate/5760308-congress-demands-answers-on-iran-strike/\" data-type=\"link\" href=\"https://thehill.com/homenews/senate/5760308-congress-demands-answers-on-iran-strike/\">have come out</a> against the strikes, blasting the administration for exacerbating tensions in the region and <a data-id=\"https://thehill.com/homenews/house/5760412-jeffries-criticizes-trump-iran-strikes/\" data-type=\"link\" href=\"https://thehill.com/homenews/house/5760412-jeffries-criticizes-trump-iran-strikes/\">warned the White House</a> could be dragging the U.S. into a wider war. Many lawmakers have also pressed for more transparency following the attack and <a data-id=\"https://thehill.com/homenews/administration/5760287-lawmakers-call-war-powers-vote/\" data-type=\"link\" href=\"https://thehill.com/homenews/administration/5760287-lawmakers-call-war-powers-vote/\">ramped up pressure</a> for a vote on a war powers resolution.</p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/senate/5760434-kaine-trump-us-iran-strikes-nuclear/",
            "pub_date": "2026-02-28 23:46:41",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5760448,
            "title": "Marjorie Taylor Greene blasts Trump's Iran strikes",
            "description": "<p>Former Rep. Marjorie Taylor Greene (R-Ga.) slammed President Trump’s decision to <a href=\"https://thehill.com/policy/defense/5760058-us-israel-launch-strikes-on-iran/\">launch major strikes</a> on Iran in a push to dismantle its nuclear efforts and push for regime change.</p>\n<p>Greene posted a broadside against Trump’s Iran strikes on social media platform X, dismissing the administration’s rationale and accusing the president of betraying his supporters who backed his campaign message of opposing more foreign wars.</p>\n<p>“Thousands and thousands of Americans from my generation have been killed and injured in never ending pointless foreign wars and we said no more. But we are freeing the Iranian people. Please,” the former GOP lawmaker <a href=\"https://x.com/FmrRepMTG/status/2027746247684075987\">wrote Saturday</a> in a nearly 700-word post.</p>\n<p>“There are 93 million people in Iran, let them liberate themselves. But Iran is on the verge of having nuclear weapons. Yeah sure,” she continued.</p>\n<p>“It’s always a lie and it’s always America Last. But it feels like the worst betrayal this time because it comes from the very man and the admin who we all believed was different and said no more.”</p>\n<p>Greene, who was a top supporter of Trump’s for most of her time in office, has become a fierce critic since last year. Earlier this month she said Trump’s Make America Great Again slogan was <a href=\"https://thehill.com/homenews/administration/5718355-marjorie-taylor-greene-trump-maga-lie/\">a “lie”</a> and panned his first year back in office.</p>\n<p>Trump has hit back at her criticism, labeling her a <a href=\"https://thehill.com/homenews/state-watch/5743252-marjorie-taylor-greene-trump-feud/\">“traitor.”</a></p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/administration/5760448-marjorie-taylor-greene-slams-trump/",
            "pub_date": "2026-02-28 23:46:40",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5759692,
            "title": "The Clintons and the politics of scandal",
            "description": "<p>The deposition of former President Bill Clinton this week was both unprecedented and strikingly reminiscent. It was the first time a former president had been deposed by the House, let alone under subpoena. Yet it is hardly the first deposition for Clinton. Twenty-eight years ago, I testified in Clinton’s impeachment hearing after he had lied under oath about his relationship with White House intern Monica Lewinsky.</p>\n<p>Given his earlier previous perjury over an affair with a young woman, few would rely on Clinton’s denials of relations with multiple young women shown in pictures associated with Epstein. But given the paucity of direct evidence, there is ample room for plausible deniability. And plausible deniability is the realm wherein the Clintons have long dwelt — between the outright conclusive and the merely scandalous.</p>\n<p>The embarrassing photos of Clinton in a hot tub or receiving massages from young women come as a shock to no one. For anyone familiar with his past, Clinton was in his element. The level of Clinton’s interaction with Epstein is also extensive. Clinton flew on Epstein’s notorious private plane, dubbed the “Lolita Express, <a href=\"https://www.bbc.com/news/articles/c79l38vl3lwo\" rel=\"noreferrer noopener\" target=\"_blank\">at least 26 times</a> and had Epstein visit the White House <a href=\"https://www.usatoday.com/story/news/politics/2026/02/26/hillary-clinton-neighbors-sound-off-epstein-testimony/88887638007/\" rel=\"noreferrer noopener\" target=\"_blank\">at least 16 times.</a> Although Clinton has denied visiting Epstein’s island, various witnesses <a href=\"https://nypost.com/2020/05/26/clinton-spent-time-on-epsteins-orgy-island-netflix-doc/\" rel=\"noreferrer noopener\" target=\"_blank\">have claimed they saw him there</a>.</p>\n<p>Epstein emails also discuss his contributions to the Clinton Global Initiative and his work to assist the Clintons.</p>\n<p>That presents a greater challenge than debating <a href=\"https://www.washingtonpost.com/wp-srv/politics/special/clinton/stories/bctest092198_4.htm\" rel=\"noreferrer noopener\" target=\"_blank\">what the meaning of “is is.”</a></p>\n<p>The greatest danger was not that Clinton would be charged with sexual crimes connected to these underage girls. Prosecutors clearly did not find sufficient evidence for such charges. However, Clinton has previously shown the danger of being “too clever by half.” He and Hillary have spent their lives evading accountability, including his alleged perjury in the prior deposition. That record can create a dangerous sense of impunity and misplaced self-confidence.</p>\n<p>In 1998, I appeared at the Clinton impeachment and, despite voting for Clinton as a lifelong Democrat, I testified that his conduct in office had satisfied the standard of a “high crime and misdemeanor.”</p>\n<p>Clinton ultimately relied on Democratic senators to avoid conviction and was never formally charged with perjury, despite his public admissions of guilt.</p>\n<p>In the latest deposition, Clinton denied knowing anything about Epstein’s conduct with underage girls. Clinton built on his prior Lewinsky testimony by pluralizing his most famous declaration, denying that he had sex with those women. He said he had no memory of the identity of the young woman pictured with him in the hot tub. “I saw nothing,” he declared. “I did nothing wrong.”</p>\n<p>For critics, it was the <a href=\"https://www.bing.com/videos/riverview/relatedvideo?q=%22I+see+nothing!+I+hear+nothing!+I+know+nothing!+schultz&amp;mid=CDF2C9733176CF1E7AD5CDF2C9733176CF1E7AD5&amp;FORM=VIRE\" rel=\"noreferrer noopener\" target=\"_blank\">Sgt. Schultz defense</a> that the Clintons have used in a long litany of scandals.</p>\n<p>There is no evidence that Clinton had relations with “those women.” Although Epstein’s associate, Ghislaine Maxwell, attended Chelsea Clinton’s wedding after the allegations were publicly known, there is no way to prove any knowledge by Clinton of his friend’s unlawful proclivities. Maxwell was also <a href=\"https://www.theguardian.com/us-news/2025/aug/25/epstein-ghislaine-maxwell-bill-clinton-conference\" rel=\"noreferrer noopener\" target=\"_blank\">given an award</a> by the Clinton Global Initiative in 2013 — five years after the public disclosure of the first Epstein allegations.</p>\n<p>Investigators will now go through the long deposition to see if Clinton tripped any wires in his denials. In the meantime, Democrats are denouncing the deposition while pledging to replicate it by hauling in President Trump at some future date, once they are back in power. It is unlikely to happen while he is in office, but the Clinton deposition created a precedent for subpoenaing former presidents.</p>\n<p>There is no evidence that Trump committed any crime in relation to Epstein. He will be able to point to the fact that he expelled Epstein from his club at Mar-a-Lago, as well as his correspondence with local police encouraging their investigation of Epstein.  </p>\n<p>It does not matter that prosecutors, including under the Biden administration, found no evidence to charge Trump. Democrats have already dispensed with any need for a factual basis for conspiracy theories.</p>\n<p>Recently, Rep. Ro Khanna (D-Calif.) gave a <a href=\"https://jonathanturley.org/2026/02/15/ro-khanna-and-the-impunity-of-wealthy-powerful-men/\" rel=\"noreferrer noopener\" target=\"_blank\">chest-pounding speech</a> about revealing the names of six powerful men who had been protected by the Trump Justice Department from disclosure. Four of them turned out to have nothing to do with Epstein and weren’t especially powerful either. All Khanna accomplished was to multiply by 400 percent <a href=\"https://nypost.com/2025/11/21/us-news/dr-jeffrey-epstein-the-long-island-neurosurgeon-jasmine-crockett-confused-for-notorious-pedophile-floats-epic-revenge-he-could-exact-on-the-congresswoman/\" rel=\"noreferrer noopener\" target=\"_blank\">the earlier fiasco</a> by Rep. Jasmine Crockett (D-Texas), who spuriously connected politicians with a different man — a neurosurgeon named Jeffrey Epstein.</p>\n<p>This week, Rep. Ted Lieu (D-Calif.) used a hearing to accuse Trump of abusing an underage girl who was later allegedly murdered to keep her silent. His source? A driver who said he overheard Trump talking about abusing a minor and later learned of her murder. There is no evidence of the death, and the source has reportedly published hundreds of anti-Trump and bizarre postings. </p>\n<p>Lieu posted two pages from the FBI report containing the allegation but <a href=\"https://nypost.com/2026/02/13/us-news/lieu-makes-wild-claim-about-trump-based-on-unhinged-source/\" rel=\"noreferrer noopener\" target=\"_blank\">withheld a third page</a> that showed the same man making further allegations of a drunken Hillary Clinton and an effort to frame someone in the Oklahoma City bombing. There is a good reason raw investigative and grand jury materials are usually kept secret.</p>\n<p>The only thing more indecent than Epstein himself is the effort to use the scandal for political advantage. The scandal has ensnared as many leading Democrats as Republicans, if not more. But Epstein is the perfect political weapon with salacious allegations to inject directly into the media bloodstream against your opponents. </p>\n<p>Epstein himself once boasted, “I invest in people — be it politics or science. It’s what I do.” It now appears that Epstein himself is the investment that many in politics believe will bring unlimited political gains. </p>\n<p><em>Jonathan Turley is a law professor and the author of the New York Times bestselling “<a href=\"https://urldefense.com/v3/__https:/r.nypostlink.com/?btn_ref=org-19984c113c692001&amp;btn_url=https*3A*2F*2Fwww.amazon.com*2FRage-Republic-Unfinished-American-Revolution*2Fdp*2F1668205025*3Ftag*3Dnypost-20*26asc_refurl*3Dhttps*3A*2F*2Fnypost.com*2F2026*2F01*2F07*2Fopinion*2Fthe-peril-of-mamdani-and-weavers-communist-college-kids-nyc-field-trip*2F*26asc_source*3Dweb__;JSUlJSUlJSUlJSUlJSUlJSUlJSUl!!F0Stn7g!BjWySLJ4OwlcQZhb6wPOFS2EOKhL7o-sM6nnqIESQ0JVK8oWxyxym3SeoJz3PoYEXyZsHnFu6qmX2BMJ8juro55URA$\" rel=\"noreferrer noopener\" target=\"_blank\">Rage and the Republic</a>: The Unfinished Story of the American Revolution.”</em></p>",
            "kind": 1,
            "link": "https://thehill.com/opinion/criminal-justice/5759692-the-clintons-and-the-politics-of-scandal/",
            "pub_date": "2026-02-28 23:20:57",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5760412,
            "title": "Jeffries: Democrats 'committed' to forcing Iran war powers vote in wake of US strikes",
            "description": "<p>House Minority Leader Hakeem Jeffries (D-N.Y.) pledged that House Democrats will force a vote on limiting President Trump’s war powers in Iran as he criticized the president for striking the country without explicit congressional authorization.</p>\n<p>“The framers of the United States Constitution gave Congress the sole power to declare war as the branch of government closest to the American people,” Jeffries said in a statement Saturday in response to the strikes.</p>\n<p>“Iran is a bad actor and must be aggressively confronted for its human rights violations, nuclear ambitions, support of terrorism and the threat it poses to our allies like Israel and Jordan in the region. However, absent exigent circumstances, the Trump administration must seek authorization for the preemptive use of military force that constitutes an act of war,” Jeffries said.</p>\n<p>He mentioned a <a href=\"https://thehill.com/homenews/house/5745037-khanna-massie-war-powers-iran/\">war powers resolution</a> spearheaded by Rep. Thomas Massie (R-Ky.) and Rep. Ro Khanna (D-Calif.) that would make Trump remove U.S. forces from hostilities in Iran without congressional authorization. </p>\n<p>“House Democrats remain committed to compelling a vote on this resolution upon our return,” Jeffries said. </p>\n<p>War powers resolutions are privileged parliamentary procedures in the House and Senate, allowing members to bypass House Republican leaders to force floor votes on war powers measures.</p>\n<p>But as of earlier this week, the <a href=\"https://thehill.com/homenews/house/5756657-democrats-trump-iran-war-powers/\">resolution was expected to fail</a> in the House given overwhelming opposition from Republicans and a few Democrats. Reps. Josh Gottheimer (D-N.J.) and Jared Moskowitz (D-Fla.), both of whom are supporters of Israel, had announced their opposition to the resolution. Party leaders, though, wanted to get all lawmakers on the record for the vote.</p>\n<p>Massie, in a <a href=\"https://x.com/RepThomasMassie/status/2027739993033134279?s=20\">post on X</a> Saturday morning, also renewed his commitment to forcing the vote.</p>\n<p>“I am opposed to this War. This is not ‘America First,’” Massie said. “When Congress reconvenes, I will work with @RepRoKhanna to force a Congressional vote on war with Iran. The Constitution requires a vote, and your Representative needs to be on record as opposing or supporting this war.”</p>\n<p>Jeffries worried about negative long-term consequences from Trump’s strikes.</p>\n<p>“If Iran’s nuclear program was ‘completely and totally obliterated’ by the military strikes in June 2025, as Donald Trump boldly proclaimed, there should be no need to strike them now,” Jeffries said in a statement. </p>\n<p>“Equally troublesome, the advancement of security and stability in the Middle East requires more than military might, as we painfully discovered in several failed wars in Iraq and Afghanistan. The Trump administration must explain itself to the American people and Congress immediately, provide an ironclad justification for this act of war, clearly define the national security objective and articulate a plan to avoid another costly, prolonged military quagmire in the Middle East.”</p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/house/5760412-jeffries-criticizes-trump-iran-strikes/",
            "pub_date": "2026-02-28 23:20:56",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5760393,
            "title": "UK, France, Germany urge return to negotiations after US strikes Iran",
            "description": "<p>Following joint U.S.-Israeli <a href=\"https://thehill.com/homenews/ap/ap-international/ap-israels-defense-minister-says-his-country-has-attacked-iran-and-declares-a-state-of-emergency/\">strikes on Iran</a> early Saturday, the leaders of Germany, France and the United Kingdom pressed the Trump administration to return to the negotiating table with Tehran.</p>\n<p>“France, Germany and the United Kingdom have consistently urged the Iranian regime to end Iran’s nuclear program, curb its ballistic missile program, refrain from its destabilizing activity in the region and our homelands, and to cease the appalling violence and repression against its own people,” the leaders wrote in a statement.</p>\n<p>“We did not participate in these strikes, but are in close contact with our international partners including the United States, Israel, and partners in the region,” the nations continued. “We reiterate our commitment to regional stability and to the protection of civilian life.”</p>\n<p>Officials from the U.S. and Iran met as recently as Thursday in Geneva to <a href=\"https://thehill.com/homenews/ap/ap-international/ap-us-and-iran-to-hold-a-third-round-of-nuclear-talks-as-more-american-forces-deploy-to-the-mideast/\">for indirect talks</a> around Tehran’s nuclear program. Iranian Foreign Minister <a href=\"https://thehill.com/people/abbas-araghchi/\">Abbas Araghchi</a> said the latest negotiations were the “most intense so far” in a <a href=\"https://x.com/araghchi/status/2027156363097391139?s=20\">post</a> online. </p>\n<p>Trump, who is seeking a new nuclear deal with the Middle Eastern country, told reporters on Friday that he was “<a data-id=\"https://thehill.com/homenews/administration/5759142-trump-iran-strike-decision/\" data-type=\"link\" href=\"https://thehill.com/homenews/administration/5759142-trump-iran-strike-decision/\">not thrilled</a>” with the talks thus far. He has for weeks threatened <a data-id=\"https://thehill.com/policy/international/5747127-trump-iran-nuclear-deal-outcome-timeline/\" data-type=\"link\" href=\"https://thehill.com/policy/international/5747127-trump-iran-nuclear-deal-outcome-timeline/\">consequences</a> against the regime if an agreement was not reached.</p>\n<p>The president <a data-id=\"https://truthsocial.com/@realDonaldTrump/posts/116147082884192486\" data-type=\"link\" href=\"https://truthsocial.com/@realDonaldTrump/posts/116147082884192486\">announced</a> the “<a data-id=\"https://thehill.com/policy/international/5760207-trump-urges-iran-regime-change/\" data-type=\"link\" href=\"https://thehill.com/policy/international/5760207-trump-urges-iran-regime-change/\">major combat operation</a>” early Saturday in a video on Truth Social — in which he also called for regime change and <a data-id=\"https://thehill.com/policy/international/5760238-trump-freedom-iranians-us-israel-strikes/\" data-type=\"link\" href=\"https://thehill.com/policy/international/5760238-trump-freedom-iranians-us-israel-strikes/\">later in an interview</a> said he wanted “freedom” for Iranians.</p>\n<p>The leaders of Germany, France and the U.K. also spoke out against the Iranian regime’s retaliatory strikes on neighboring countries and U.S. bases in the Persian Gulf. </p>\n<p>“We condemn Iranian attacks on countries in the region in the strongest terms,” the leaders wrote. “Iran must refrain from indiscriminate military strikes. We call for a resumption of negotiations and urge the Iranian leadership to seek a negotiated solution. Ultimately, the Iranian people must be allowed to determine their future.”</p>\n<p>The leaders have all separately warned about risks of increased violence in the wake of the Saturday morning attack, echoing <a href=\"https://thehill.com/policy/international/5760274-world-reaction-us-israel-strikes-iran/\">global calls</a> for deescalation. </p>\n<p>French President Emmanuel Macron said the joint operation “carries grave consequences for international peace and security.”</p>\n<p>“The ongoing escalation is dangerous for all. It must stop,” Macron <a href=\"https://x.com/EmmanuelMacron/status/2027718192643084649\">posted</a> on soical platform X. “The Iranian regime must understand that it now has no other option but to engage in good faith in negotiations to end its nuclear and ballistic programs, as well as its regional destabilization activities.”</p>\n<p>He added, “This is absolutely necessary for the security of all in the Middle East.”</p>",
            "kind": 1,
            "link": "https://thehill.com/policy/international/5760393-uk-france-germany-iran-strikes-negotiations/",
            "pub_date": "2026-02-28 23:20:56",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5760384,
            "title": "White House calls reports Trump will address nation on Iran strikes 'inaccurate'",
            "description": "<p>The White House called reports that President Trump <a data-id=\"https://www.reuters.com/world/us/trump-give-saturday-morning-address-amid-iran-strikes-axios-reports-2026-02-28/\" data-type=\"link\" href=\"https://www.reuters.com/world/us/trump-give-saturday-morning-address-amid-iran-strikes-axios-reports-2026-02-28/\">will address the nation </a>on Saturday following the <a data-id=\"https://thehill.com/policy/international/5760207-trump-urges-iran-regime-change/\" data-type=\"link\" href=\"https://thehill.com/policy/international/5760207-trump-urges-iran-regime-change/\">U.S. strikes on Iran</a> “inaccurate.”</p>\n<p>“This reporting was inaccurate, the White House has not given any guidance on an address or remarks today,” the White House said in a statement to the press pool traveling with Trump.</p>\n<p>The push back comes after Axios reported Trump would deliver an address to the nation. The outlet cited a U.S. official.</p>\n<p>In a <a data-id=\"https://truthsocial.com/@realDonaldTrump/posts/116147082884192486\" data-type=\"link\" href=\"https://truthsocial.com/@realDonaldTrump/posts/116147082884192486\">video posted to Truth Social</a> overnight as the “major combat operations” began, the president called for regime change.</p>\n<p>“Our objective is to defend the American people by eliminating imminent threats from the Iranian regime, a vicious group of very hard, terrible people,” he said.</p>\n<p>Trump also urged members of Iran’s military to lay down their arms and called on Iranians to topple the hardline regime that has controlled the country since the Islamic Revolution in 1979.</p>\n<p>“Bombs will be dropping everywhere. When we are finished, take over your government. It will be yours to take; this will be probably your only chance for generations,” the president said in the roughly 8-minute speech. </p>\n<p>“America is backing you with overwhelming strength and devastating force. Now is the time to seize control of your destiny,” he added.</p>\n<p>The strikes follow weeks of speculation over whether the U.S. would attack Iran amid U.S. military buildup in the region. Washington and Tehran have been engaged in negotiations over Iran’s nuclear program. </p>\n<p>Trump has <a data-id=\"https://thehill.com/homenews/administration/5759142-trump-iran-strike-decision/\" data-type=\"link\" href=\"https://thehill.com/homenews/administration/5759142-trump-iran-strike-decision/\">increasingly expressed frustration</a> following the <a data-id=\"https://thehill.com/policy/international/5757110-us-iran-talks-oman-complete/\" data-type=\"link\" href=\"https://thehill.com/policy/international/5757110-us-iran-talks-oman-complete/\">indirect talks</a> and as Iran has declined to commit to not developing a nuclear weapon.</p>\n<p>The president could still address the nation via a Truth Social post or video, or in televised remarks.</p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/administration/5760384-white-house-no-trump-address-iran-strikes/",
            "pub_date": "2026-02-28 22:55:54",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5758845,
            "title": "How to solve the current and future physician shortage",
            "description": "<p>Over nearly 50 years, the medical school I founded has sent <a href=\"https://www.sgu.edu/about-sgu/history/\" rel=\"noreferrer noopener\" target=\"_blank\">more than 20,000 physicians</a> into the international health care system — more than any other single institution. </p>\n<p>Back then, I had an idea that the American medical establishment considered crazy, and reckless: To start an English-language medical school outside the U.S., using an American curriculum, close enough that graduates could train and practice in American hospitals. The logic was simple: If the U.S. was not producing enough doctors, others would have to help fill the gap.</p>\n<p>That idea became St. George’s University in Grenada. And for all these years, I have been right in the thick of the physician pipeline into the U.S. health care system.</p>\n<p>At the time of the university’s beginning, policymakers were warning of a “physician glut.” In fact, four years after St. George’s opened, the U.S. effectively stopped expanding medical education. <a href=\"https://macyfoundation.org/assets/reports/publications/new_and_developing_schools_part2.pdf\" rel=\"noreferrer noopener\" target=\"_blank\">In 1980, there were 127 U.S. medical schools; by 1990 there were 125</a>. After rapid growth in the 1960s and 1970s, expansion had stalled following federal workforce projections — most notably a <a href=\"https://www.ncbi.nlm.nih.gov/books/NBK232541/\" rel=\"noreferrer noopener\" target=\"_blank\">1981 report that warned of an impending physician surplus</a> and encouraged restraint.</p>\n<p>Those assumptions went largely unchallenged for nearly two decades, but they were wrong. Today’s physician shortage is serious, but the problem ahead is even more profound than most projections suggest, because many of the assumptions behind current forecasts no longer hold.</p>\n<p>First, one quarter of the U.S. physician workforce <a href=\"https://www.aamc.org/data-reports/data/2024-key-findings-and-definitions\" rel=\"noreferrer noopener\" target=\"_blank\">consists of international medical graduates</a>. The vast majority of these doctors are foreign-born and foreign-trained, and many rely on hospital sponsorship to complete residency training. Any disruption to visa pathways — whether through rising costs such as the <a href=\"https://www.uscis.gov/newsroom/alerts/h-1b-faq\" rel=\"noreferrer noopener\" target=\"_blank\">new $100,000 H1-B visa application fee</a>, administrative barriers or political uncertainty — immediately constrains physician supply. A workforce that is structurally dependent on international physicians cannot be susceptible to the vagaries of politics.</p>\n<p>Second, access to medical education is itself tightening. New limits on professional student borrowing will make medical school financially unreachable for many qualified applicants. At a time when we need more doctors, we are quietly narrowing the pipeline.</p>\n<p>Third, the workforce is aging. <a href=\"https://www.aamc.org/news/press-releases/aamc-report-reinforces-mounting-physician-shortage\" rel=\"noreferrer noopener\" target=\"_blank\">More than 40 percent</a> of active physicians will reach typical retirement age within the next decade. Each year the U.S. produces <a href=\"https://osteopathic.org/about/aoa-statistics/\" rel=\"noreferrer noopener\" target=\"_blank\">roughly 30,000 new Doctors of Medicine and Doctors of Osteopathic Medicine</a>, but that output barely offsets attrition, let alone population growth. New medical schools — most opening with classes of 60 students or fewer — will not close the gap. </p>\n<p>Meanwhile, the population is growing older, sicker and more medically complex. Americans are not only living longer, they are demanding care that preserves function and quality of life. If the country expands coverage further and brings tens of millions of uninsured Americans into regular care, demand will rise again.</p>\n<p>The conclusion is unavoidable: The current model of physician production cannot meet future needs, even under optimistic assumptions. So, what do we do?</p>\n<p>The answer is not simply to build more traditional medical schools. U.S. medical education is tightly linked to large, expensive research enterprises, which makes schools slow to open and costly to operate. Research universities have driven extraordinary innovation, but tying every medical school to a full-scale research infrastructure has also constrained capacity. </p>\n<p>St. George’s demonstrated something different: A teaching-focused medical school, anchored to strong clinical training and targeted research exposure, can produce outstanding physicians at scale. We now need to think bigger.</p>\n<p>One solution is to create a new system of teaching medical schools, with a dedicated accreditation pathway, formally partnered — or “twinned” — with established research institutions. These schools would focus primarily on education and clinical excellence, while maintaining structured access to research through their partner institutions. Some could be located domestically; others, as international medical schools have already proven, could operate outside the U.S. without compromising standards.</p>\n<p>At the same time, we must address maldistribution. Schools like St. George’s are already moving in this direction, offering substantial tuition support to students from rural and underserved communities in exchange for commitments to return home to practice. Training doctors who already understand the communities most in need is one of the most effective ways to close access gaps. </p>\n<p>When St. George’s opened in 1977, the idea was dismissed as unrealistic. History has proven otherwise. </p>\n<p>Today’s physician shortage will not be solved by incremental adjustments or by hoping current projections are wrong. It will take the same kind of bold thinking that challenged orthodoxy 50 years ago. If we want a healthy nation, we must be willing to rethink how and where we train the doctors who care for it. </p>\n<p><em>Charles R. Modica is the chancellor of St. George’s University and author of the forthcoming “<a href=\"https://www.amazon.com/Docs-Bay-Americas-Unlikely-Medical/dp/B0FQWPGSPY\" rel=\"noreferrer noopener\" target=\"_blank\">Docs on the Bay: The Dream that Became America’s Most Unlikely Medical School</a>” (Post Hill Press, April 2026)</em>.</p>",
            "kind": 1,
            "link": "https://thehill.com/opinion/healthcare/5758845-physician-shortage-rethinking-medical-education/",
            "pub_date": "2026-02-28 22:16:37",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5760326,
            "title": "GOP lawmakers rally behind Trump after Iran strikes",
            "description": "<p>Republicans on Capitol Hill were quick to rally behind President Trump after he announced the U.S. military and Israeli forces launched <a href=\"https://thehill.com/policy/defense/5760058-us-israel-launch-strikes-on-iran/\">joint strikes</a> on Iran early Saturday morning. </p>\n<p>Trump long <a href=\"https://thehill.com/policy/international/5747127-trump-iran-nuclear-deal-outcome-timeline/\">threatened</a> “unfortunate” consequences for Iran if the country did not agree to a new nuclear deal with the U.S.  The <a data-id=\"https://thehill.com/policy/international/5760207-trump-urges-iran-regime-change/\" data-type=\"link\" href=\"https://thehill.com/policy/international/5760207-trump-urges-iran-regime-change/\">latest attack</a> comes after the third round of negotiations between Washington and Tehran, mediated by Oman, wrapped up in Geneva on Thursday. </p>\n<p>The president, despite Oman’s <a data-id=\"https://thehill.com/policy/international/5757110-us-iran-talks-oman-complete/\" data-type=\"link\" href=\"https://thehill.com/policy/international/5757110-us-iran-talks-oman-complete/\">suggestion</a> that talks were moving forward, <a data-id=\"https://thehill.com/homenews/administration/5759142-trump-iran-strike-decision/\" data-type=\"link\" href=\"https://thehill.com/homenews/administration/5759142-trump-iran-strike-decision/\">told reporters</a> on Friday that he was “not thrilled” with where talks around the nation’s nuclear program were going.</p>\n<p>Trump <a data-id=\"https://truthsocial.com/@realDonaldTrump/posts/116147082884192486\" data-type=\"link\" href=\"https://truthsocial.com/@realDonaldTrump/posts/116147082884192486\">shared a video to Truth Social</a> early Saturday announcing a “major combat operation” in Iran and calling on the Iranian people to <a data-id=\"https://thehill.com/policy/international/5760238-trump-freedom-iranians-us-israel-strikes/\" data-type=\"link\" href=\"https://thehill.com/policy/international/5760238-trump-freedom-iranians-us-israel-strikes/\">rise up against the government</a> in pursuit of “freedom” and safety. </p>\n<p>Sen. Lindsey Graham (R-S.C.), known to be a war hawk in the upper chamber of Congress, doubled down on the president’s call for regime change.</p>\n<p>“His speech will go down in history as the catalyst for the most historic change in the Middle East in a thousand years. I echo President Trump’s call to the Iranian military, IRGC and security forces to lay down their arms,” he <a data-id=\"https://x.com/LindseyGrahamSC/status/2027706424533422531\" data-type=\"link\" href=\"https://x.com/LindseyGrahamSC/status/2027706424533422531\">wrote on social platform X</a>. “I echo his call to the Iranian people to take back their government.”</p>\n<p>“President Trump was right when he said he’s the first president in 47 years to stand with the people of Iran and give them the backing they need,” he added. “I am confident this operation will be successful and the liberation of the long suffering people of Iran is at hand.”</p>\n<p>Sen. Tom Cotton (R-Ark.), who sits on the Senate Armed Services Committee, also commended the president for the decision in a <a href=\"https://x.com/SenTomCotton/status/2027718442686480726\">post</a> on X.</p>\n<p>“The butcher’s bill has finally come due for the ayatollahs,” Cotton wrote. “May God bless and protect our troops on this vital mission of vengeance, and justice, and safety.”</p>\n<p>He urged his followers to watch Trump’s roughly 8-minute speech.</p>\n<p>“Please watch this excellent statement by President Trump,” Cotton <a data-id=\"https://x.com/SenTomCotton/status/2027723337804222842\" data-type=\"link\" href=\"https://x.com/SenTomCotton/status/2027723337804222842\">wrote in a separate post</a>. “He put it simply: for 47 years of Iran’s war against America, ‘it’s been mass terror, and we’re not going to put up with it any longer.'”</p>\n<p>Sen. Rick Scott, who also sits on the committee, praised Trump for his “strong leadership” following the strikes, which were dubbed part of “Operation Epic Fury.”</p>\n<p>“Operation Epic Fury is peace through strength on full display, and a reminder to our friends and our enemies: The U.S. will ALWAYS put AMERICA FIRST,” Scott <a href=\"https://x.com/SenRickScott/status/2027722947553611880\">wrote online</a>. “We will always stand with our friend, Israel, and we will NEVER allow Iran to have a nuclear weapon.”</p>\n<p>These congratulatory remarks come as some lawmakers on <a data-id=\"https://thehill.com/homenews/house/5757526-davidson-massie-back-resolution-iran/\" data-type=\"link\" href=\"https://thehill.com/homenews/house/5757526-davidson-massie-back-resolution-iran/\">both sides</a> of the aisle have <a href=\"https://thehill.com/homenews/administration/5760287-lawmakers-call-war-powers-vote/\">pressed for a vote</a> on a <a data-id=\"https://thehill.com/homenews/house/5753315-trump-iran-military-force-resolution-fails/\" data-type=\"link\" href=\"https://thehill.com/homenews/house/5753315-trump-iran-military-force-resolution-fails/\">war powers resolution</a> that would block the administration from continued use of military force against Tehran without congressional approval. That request was exacerbated Saturday following the attack.</p>\n<p>House Majority Whip Tom Emmer (R-Minn.) called the strikes “a bold, decisive act of strength by President Trump” in a <a data-id=\"https://x.com/GOPMajorityWhip/status/2027722551812620703\" data-type=\"link\" href=\"https://x.com/GOPMajorityWhip/status/2027722551812620703\">post on X</a>.</p>\n<p>“The Ayatollah is responsible for killing hundreds of U.S. service members and slaughtering its own people,” Emmer continued. “We pray that because of this leadership, the U.S. and the world will be a safer place. May God bless and protect the men and women of our military conducting this mission and serving in the region.”</p>\n<p>Rep. Nancy Mace (R-S.C.) also expressed her support for the operations. </p>\n<p>“The Iranian regime has slaughtered thousands of its own people in recent days, men, women, and children, whose only crime was asking for freedom,” Mace <a href=\"https://x.com/RepNancyMace/status/2027706207620718882?s=20\">wrote</a> on X. </p>\n<p>“Tyrants and terrorists everywhere should take note: the world is watching,” she continued. “History is watching. We must not forget what is happening in Iran. We must not turn a blind eye. History does not forgive those who look away from massacre.”</p>\n<p>Rep. Rick Crawford (R-Ark.) urged people to “pray for the safety” of Americans and military service members in the region and expressed his support for the actions taken against the Iranian regime.</p>\n<p>“President Trump has given Iran plenty of opportunities to take the diplomatic route,” he wrote <a data-id=\"https://x.com/RepRickCrawford/status/2027722407763460286\" data-type=\"link\" href=\"https://x.com/RepRickCrawford/status/2027722407763460286\">in a post online</a>. “The United States of America has the most premier military in the world, and I am confident it will successfully carry out the very clearly stated goals of this operation.” </p>\n<p>“I would strongly advise the Iranian regime heed President Trump’s warning,” Crawford added later.</p>\n<p>Sen. John Fetterman (D-Pa.) has so far been the only Democrat to signal support for the strikes.</p>\n<p>“President Trump has been willing to do what’s right and necessary to produce real peace in the region,” Fetterman <a href=\"https://x.com/SenFettermanPA/status/2027674658091204808\">wrote</a> in a post on X. “God bless the United States, our great military, and Israel.</p>",
            "kind": 1,
            "link": "https://thehill.com/policy/international/5760326-republican-reaction-us-iran-strikes/",
            "pub_date": "2026-02-28 22:16:37",
            "source": "thehill",
            "language": "en"
        }
    ]
}