{
    "data": [
        {
            "id": 5124971,
            "title": "Patel scrutinized over past work for Qatar",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>Kash Patel, President Trump’s pick to lead the FBI, previously worked as a consultant to the government of Qatar, newly released disclosures show, raising questions from ethics experts about his failure to register as a foreign agent.</p>\n<p>Patel listed the U.S. Embassy of Qatar as among the clients of his consulting company Trishul, which he has managed since shortly after Trump left office in 2021.</p>\n\n<p>State Democracy Defenders Action said Patel failed to register his consulting work, something they said could violate the Foreign Agents Registration Act (FARA).</p>\n<p>“It appears neither Patel nor Trishul is registered under FARA for services provided to Qatar,  leaving open the important question of exactly what Patel did for Qatar when he was serving as a national security advisor to President Trump during the 2024 election,” Norm Eisen, the group’s founder and a former Trump impeachment lawyer, wrote in the letter to the Senate Judiciary Committee.</p>\n<p>“If confirmed as the head of the FBI, Patel will be responsible for law enforcement investigations into possible FARA violations. And he will be expected to carry out this duty faithfully and impartially,” Eisen wrote, noting recent FARA cases involving those who failed to disclose work for the Qatari government.</p>\n<p>The letter is also sign by Virginia Canter, chief ethics counsel at Citizens for Responsibility and Ethics in Washington.</p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>The disclosure forms show Patel earned more than $2 million through the consulting firm, though it is unclear how much of that came from Qatar.</p>\n<p>In another form, Patel indicated he does not plan to divest from Trishul, instead saying he will recuse himself from any matters related to its work for the next year. </p>\n\n<p>“Upon confirmation, my consulting firm will cease engaging in any business, including the representation of clients. During my appointment to the position of Director of the Federal Bureau of Investigation, the firm will remain dormant and will not advertise,” he wrote.</p>\n<p>“The agency will grant me a written authorization to participate personally and substantially in particular matters involving specific parties in which I know the country of Qatar is a party or represents a party. Until such an authorization is granted, I will recuse pursuant to the impartiality regulation…for a period of one year after my resignation.”</p>\n<p>But Eisen said that also merits scrutiny.</p>\n<div class=\"civic-science-article-container civic-science-more-14 civic-is-mr3\" data-civicscience-widget=\"3f127ebd-287e-0b64-a901-d55ec286348a\" id=\"civsci-id-civsci-id-596708068\"></div>\n<p>“This arrangement at the very least raises questions about whether he plans to continue his relationship with Qatar as soon as he leaves the government,” he wrote.</p>\n<p>Patel did not immediately respond to request for comment.</p>\n<p>Other details of Patel’s filings, previously covered by <a href=\"https://www.businessinsider.com/trump-fbi-director-kash-patel-financial-disclosure-2025-1\" rel=\"noreferrer noopener\" target=\"_blank\">Business Insider</a>, show Patel is worth nearly $6 million.</p>\n\n<p>That includes Elite Depot, described as a “fashion management company” worth between $1 million and $5 million for whom Patel does consulting.</p>\n<p>Patel’s financial disclosures weren’t publicly posted ahead of <a data-id=\"https://thehill.com/homenews/administration/5115976-fbi-director-nominee-kash-patel-outlines-vision/\" data-type=\"link\" href=\"https://thehill.com/homenews/administration/5115976-fbi-director-nominee-kash-patel-outlines-vision/\" rel=\"noreferrer noopener\" target=\"_blank\">his hearing</a>, so his financial dealings received little scrutiny during the Thursday meeting.</p>\n<p>Much of the hearing focused on past controversial statements from Patel, many of which <a href=\"https://thehill.com/policy/national-security/5116845-kash-patel-democrats-controversial-statements/\" rel=\"noreferrer noopener\" target=\"_blank\">he did not acknowledge</a> or cast as taking him out of context.</p>\n\n<p>That includes seeking to distance himself from a choir comprised of jailed Jan. 6 defendants whose song he previously promoted as well as comments he’s made about prosecuting journalists.</p>\n<p>He also said he would <a href=\"https://thehill.com/policy/national-security/5117436-kash-patel-fbi-confirmation-hearing/\" rel=\"noreferrer noopener\" target=\"_blank\">follow the law</a> but did not commit to resigning if asked to do anything illegal and would not address prior calls to prosecute former FBI Director Christopher Wray.</p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/homenews/administration/5124971-kash-patel-qatar-work-fbi-nomination/",
            "pub_date": "2025-02-04 22:05:54",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5123250,
            "title": "Trump’s impending massacre of the federal workforce will destroy his second term",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>The Trump administration has initiated what may become the most devastating dismantling of the federal workforce in modern history — not with mass firings, but with a carefully designed invitation to resign. </p>\n<p>The recently announced deferred resignation program, <a href=\"https://apnews.com/article/trump-buyouts-to-all-federal-employees-f67f5751a0fd5ad8471806a5a1067b5e\" rel=\"noreferrer noopener\" target=\"_blank\">introduced</a> via an Office of Personnel Management memo, offers federal employees a lucrative off-ramp — full pay and benefits until Sept. 30, 2025, exemption from in-person work requirements and, in many or most cases, paid administrative leave.</p>\n\n<p>This is not just an incentive; it is a slow-motion purge, a calculated method to drain the federal government of talent and expertise while avoiding the immediate political backlash of forced layoffs.</p>\n<p>Many will take this offer. It is, for all intents and purposes, a paid early retirement program with no strings attached. Facing mounting uncertainty, a hostile workplace environment and the erosion of once-ironclad civil service protections, thousands of employees will see this as their best or perhaps only chance to leave on their own terms before being pushed out under harsher conditions later.</p>\n<p>Those most likely to accept the offer will be the most experienced, highly skilled federal employees, who know their value and have private-sector options — the ones with the most institutional knowledge, the backbone of the federal government.</p>\n<p>The consequences of this mass exodus will not be felt immediately. That’s what makes this such a dangerous, slow-moving disaster. On paper, the government will still have these employees on the payroll, but in reality, they will be ghost employees — paid but absent, receiving full compensation while contributing nothing. This will create a facade of normalcy, obscuring the full extent of the crisis. </p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>And then, in October 2025, the storm will hit all at once.</p>\n<p>The government will wake up to a crisis of its own making. Agencies will be hollowed out. The loss of institutional knowledge will paralyze essential services. Programs that millions of Americans rely on will be understaffed, backlogged, and dysfunctional. Taxpayers will be paying for a government that barely works.</p>\n\n<p>Social Security and Medicare processing will grind to a crawl. The employees who handle retirement benefits, disability claims and health care subsidies aren’t easily replaced. These are complex systems requiring years of experience to navigate. As experts walk out the door, the wait times will stretch from weeks to months. People who depend on these programs — seniors, disabled Americans, low-income families — will be left in limbo, waiting for an answer that may never come.</p>\n<p>Homeland Security and intelligence agencies will be severely weakened. The analysts and cybersecurity experts responsible for monitoring threats and protecting national security will disappear, leaving critical gaps in oversight. With fewer trained professionals tracking threats, adversaries will have more opportunities to exploit vulnerabilities. Cyberattacks will become harder to prevent. Terrorism investigations will take longer. The risks will multiply, and the consequences could be catastrophic.</p>\n<p>Federal law enforcement will suffer. The FBI, DEA, and ATF all depend on experienced agents who know how to handle complex investigations. If enough of them take the deferred resignation, cases will stall. Organized crime, drug trafficking, and corruption probes will face delays or be abandoned altogether. Criminals who would have been prosecuted may walk free, simply because there aren’t enough agents left to follow through.</p>\n<div class=\"civic-science-article-container civic-science-more-14 civic-is-mr3\" data-civicscience-widget=\"3f127ebd-287e-0b64-a901-d55ec286348a\" id=\"civsci-id-civsci-id-596708068\"></div>\n<p>Businesses will seriously suffer. A weakened federal workforce means regulatory guidance will be inconsistent, approvals will slow, and critical permitting processes will stall. Companies waiting on clearances, permits, and approvals will face indefinite delays. Infrastructure projects will be held up due to bureaucratic bottlenecks, stalling economic growth. </p>\n<p>Financial markets will see increased volatility as oversight agencies struggle to enforce compliance, creating uncertainty for investors. Without clear regulatory direction, corporations will be forced to navigate shifting policies blindly, increasing legal risks and operational inefficiencies. The absence of a functioning government will be an economic drag, not a relief.</p>\n<p>When these failures start piling up, the government will try to hire replacements. But who will want these jobs? Who will step into a system that has just sent its best employees packing? The reputation of federal employment will be shattered. Hiring will be slow and difficult. The government will be forced to rely on underqualified applicants who take the job as a last resort. Mistakes will multiply. The expertise lost in 2025 will take decades to rebuild, if it ever returns at all.</p>\n\n<p>And through it all, taxpayers will continue footing the bill for a government that can no longer fulfill its basic responsibilities. They will pay the salaries of employees who no longer work, and then they will pay again for the inefficiencies, errors, and delays that result from their departure.</p>\n<p>This is not a budget-cutting measure. This is not about efficiency. This is a deliberate erosion of federal capacity, carried out under the pretense of giving employees a choice.</p>\n<p>By the time the consequences are fully visible, it will be too late. Government does not rebuild easily. The institutions that fail in 2025 will not recover in a year, nor even in a decade. This is not a short-term disruption. This is a permanent shift, a dismantling of government functions that have been built over generations.</p>\n\n<p>The administration will claim victory. They will point to cost savings, to fewer employees on the books, to a streamlined government. But what they will not say is that the services Americans rely on will be weaker, slower, and less effective. When disaster strikes, the response will be inadequate. When people need help, they will be met with delays and confusion.</p><!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://thehill.com/submitting-opinion-content/\"><img alt=\"\" class=\"wp-image-4329764\" decoding=\"async\" height=\"121\" loading=\"lazy\" sizes=\"(max-width: 899px) 100vw, 600px\" src=\"https://thehill.com/wp-content/uploads/sites/2/2023/11/op2.png?w=600\" srcset=\"https://thehill.com/wp-content/uploads/sites/2/2023/11/op2.png?resize=600,121 600w, https://thehill.com/wp-content/uploads/sites/2/2023/11/op2.png?resize=300,61 300w, https://thehill.com/wp-content/uploads/sites/2/2023/11/op2.png?resize=50,10 50w\" width=\"600\"/></a></figure>\n<p>Trump’s legacy will not escape the consequences.</p>\n<p>This is a slow-motion collapse — a train wreck happening in real time. The people who see it coming are leaving. The people who remain will struggle to hold the system together. And the people who depend on it — taxpayers, businesses, the elderly, the sick, the vulnerable — will be the ones left paying the price.</p>\n\n<p><em>Gleb Tsipursky, Ph.D., serves as the CEO of the hybrid work consultancy <a href=\"http://disasteravoidanceexperts.com/\" rel=\"noreferrer noopener\" target=\"_blank\">Disaster Avoidance Experts</a> and authored the best-seller “<a href=\"https://disasteravoidanceexperts.com/hybrid/\" rel=\"noreferrer noopener\" target=\"_blank\">Returning to the Office and Leading Hybrid and Remote Teams</a>.</em>“</p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/opinion/5123250-trump-administration-pushed-out-federal-workers/",
            "pub_date": "2025-02-04 22:01:07",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5124933,
            "title": "Rubio accuses USAID of ‘rank insubordination’",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>Secretary of State Marco Rubio on Monday called out the <a data-id=\"https://thehill.com/homenews/administration/5124147-trump-musk-usaid-attacks/\" data-type=\"link\" href=\"https://thehill.com/homenews/administration/5124147-trump-musk-usaid-attacks/\">U.S. Agency for International Development</a> (USAID) for what he called “rank insubordination,” adding that the agency and its procedures <a data-id=\"https://thehill.com/homenews/administration/5124136-rubio-notifies-congress-of-potential-usaid-reorganization/\" data-type=\"link\" href=\"https://thehill.com/homenews/administration/5124136-rubio-notifies-congress-of-potential-usaid-reorganization/\">need an overhaul</a>.</p>\n<p>His comments just a day after President Trump announced Rubio would also serve as the <a href=\"https://thehill.com/homenews/administration/5123282-marco-rubio-usaid-take-over/\">acting head</a> of USAID.</p>\n\n<p>“Well, that was always the goal was to reform it, but now we have rank insubordination,” Rubio told Fox News’s Rich Edison <a data-id=\"https://www.state.gov/secretary-marco-rubio-with-rich-edson-of-fox-news/\" data-type=\"link\" href=\"https://www.state.gov/secretary-marco-rubio-with-rich-edson-of-fox-news/\">in an interview</a>. “Now we have basically an active effort — their basic attitude is we don’t work for anyone, we work for ourselves, no agency of government can tell us what to do.”</p>\n<p>“So the President made me the acting administrator,” he added. “I’ve delegated that power to someone who is there full-time, and we’re going to go through the same process at USAID as we’re going through now at the State Department.”</p>\n<p>The former Florida senator continued his criticism of the agency, arguing that it has lost its focus and abandoned the “national interest,” while citing complaints from U.S. officials and foreign leaders.</p>\n<p>“They have basically evolved into an agency that believes that they’re not even a U.S. Government agency, that they are out — they’re a global charity, that they take the taxpayer money, and they spend it as a global charity irrespective of whether it is in the national interest or not in the national interest,” Rubio said Monday.</p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>“One of the most common complaints you will get if you go to embassies around the world from State Department officials and ambassadors and the like is USAID is not only not cooperative; they undermine the work that we’re doing in that country; they are supporting programs that upset the host government for whom we’re trying to work with on a broader scale, and so forth,” he added.</p>\n<p>Experts have argued that blocking USAID funding is <a href=\"https://thehill.com/policy/international/foreign-aid/5123972-lawmakers-legal-experts-warn-shuttering-usaid-is-unconstitutional/\">unconstitutional</a> and plan to challenge the Trump administration’s efforts in the court of law. Democratic lawmakers have also <a data-id=\"https://thehill.com/homenews/house/5124297-democrats-urges-usaid-hearing/\" data-type=\"link\" href=\"https://thehill.com/homenews/house/5124297-democrats-urges-usaid-hearing/\">pushed back</a> against the administration’s <a data-id=\"https://thehill.com/policy/international/5120310-democrats-donald-trump-usaid-state-department/\" data-type=\"link\" href=\"https://thehill.com/policy/international/5120310-democrats-donald-trump-usaid-state-department/\">perceived intent</a> to merge the State Department and USAID.</p>\n\n<p>“We don’t have a fourth branch of government called Elon Musk, and that’s going to become real clear,” Rep. Jamie Raskin (D-Md.) said at a press conference with other Democratic lawmakers outside USAID headquarters. The group was <a data-id=\"https://thehill.com/homenews/administration/5123663-democrats-blocked-entry-usaid/\" data-type=\"link\" href=\"https://thehill.com/homenews/administration/5123663-democrats-blocked-entry-usaid/\">blocked from entering</a> the building.</p>\n<p>“This illegal, unconstitutional interference with congressional power is threatening lives all over the world,” Raskin added.</p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/policy/international/5124933-marco-rubio-usaid-overhaul-rank-insubordination/",
            "pub_date": "2025-02-04 21:50:54",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5123524,
            "title": "Under Trump, no state secret is safe ",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>The Trump administration presents a substantially increased risk of the nation’s secrets being compromised. As with many other matters, the pattern is set at the top.  </p>\n<p>If President Trump were an applicant for an ordinary position in the national security bureaucracy, he would be denied a security clearance. The numerous red flags in his case would lead any security officer reviewing his file to put it in the rejection pile. </p>\n\n<p>These red flags include, among other things, <a href=\"https://www.washingtonpost.com/politics/2016/live-updates/general-election/real-time-fact-checking-and-analysis-of-the-first-presidential-debate/fact-check-has-trump-declared-bankruptcy-four-or-six-times/\" rel=\"noreferrer noopener\" target=\"_blank\">multiple business bankruptcies</a>, financial <a href=\"https://www.worldfinance.com/strategy/deutsche-bank-loaned-trump-2bn-despite-multiple-red-flags-new-report-claims\" rel=\"noreferrer noopener\" target=\"_blank\">dependence on foreigners</a> and <a href=\"https://www.worldfinance.com/strategy/deutsche-bank-loaned-trump-2bn-despite-multiple-red-flags-new-report-claims\" rel=\"noreferrer noopener\" target=\"_blank\">private dealings with a foreign adversary</a> that Trump has taken pains to keep private. Added to that are character flaws that include behavior he has <a href=\"https://www.cbsnews.com/news/donald-trump-stormy-daniels-indictment-investigation-timeline-manhattan-district-attorney/\" rel=\"noreferrer noopener\" target=\"_blank\">paid hush money</a> to conceal and his status as a <a href=\"https://apnews.com/article/trump-trial-deliberations-jury-testimony-verdict-85558c6d08efb434d05b694364470aa0\" rel=\"noreferrer noopener\" target=\"_blank\">convicted felon</a>.</p>\n<p>But as president, Trump gets access to classified information anyway. And although some of his senior appointees might also have trouble getting clearances, Trump can <a href=\"https://www.politico.com/news/2024/12/05/fbi-trump-cabinet-security-clearance-00192693\" rel=\"noreferrer noopener\" target=\"_blank\">give them access</a>. He has already done that <a href=\"https://www.whitehouse.gov/presidential-actions/2025/01/memorandum-to-resolve-the-backlog-of-security-clearances-for-executive-office-of-the-president-personnel/\" rel=\"noreferrer noopener\" target=\"_blank\">with an order</a> making it possible for anyone in the Executive Office of the President — which potentially includes several hundred people — to receive a Top Secret-Sensitive Compartmented Information clearance immediately, good for six months, with no prior security review. </p>\n<p>Trump’s blurring of distinctions between the personal and the official was reflected in his carting off boxloads of classified documents at the end of his first term and resisting their return for more than a year while <a href=\"https://www.vanityfair.com/news/2023/06/trump-still-thinks-the-classified-documents-he-got-indicted-for-keeping-belong-to-him?srsltid=AfmBOoqQU5sACx4RFaQe0PkfrvwIuwG0ij458EzbQrXMaUGDcSI1e0Q5\" rel=\"noreferrer noopener\" target=\"_blank\">describing</a> them, contrary to law, as “my” documents. </p>\n<p>Trump’s <a href=\"https://www.cbsnews.com/news/trump-indictment-pictures-photos-documents-boxes-mar-a-lago-bathroom/\" rel=\"noreferrer noopener\" target=\"_blank\">stashing</a> of classified documents in a bathroom and ballroom at Mar-a-Lago was hardly his only misuse of such material. His decision during his first term to <a href=\"https://www.washingtonpost.com/world/national-security/trump-revealed-highly-classified-information-to-russian-foreign-minister-and-ambassador/2017/05/15/530c172a-3960-11e7-9e48-c4f199710b69_story.html\" rel=\"noreferrer noopener\" target=\"_blank\">reveal highly classified material</a> to the Russian foreign minister and ambassador was apparently motivated by his desire to show off what good stuff he had access to. His motivation to make trouble for his domestic political rivals despite opening information to foreign adversaries was illustrated during the 2016 election campaign when <a href=\"https://www.nytimes.com/2018/07/13/us/politics/trump-russia-clinton-emails.html\" rel=\"noreferrer noopener\" target=\"_blank\">he urged</a> Russia to hack into Hillary Clinton’s email — which the Russians in fact did shortly afterward. </p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>Trump’s <a href=\"https://www.theguardian.com/us-news/2024/mar/18/us-intelligence-trump-putin-threat\" rel=\"noreferrer noopener\" target=\"_blank\">attraction</a> to the regime of Russian President Vladimir Putin is highly relevant to the problem of safeguarding U.S. secrets. His <a href=\"https://www.foreignaffairs.com/united-states/trumps-threat-us-intelligence\" rel=\"noreferrer noopener\" target=\"_blank\">animus</a> toward the U.S. intelligence community, motivated in large part by the community <a href=\"https://www.dni.gov/files/documents/ICA_2017_01.pdf\" rel=\"noreferrer noopener\" target=\"_blank\">addressing Russia’s election interference</a> that helped to elect Trump in 2016, is also relevant, because the community produces much of the most sensitive classified material. A low regard for the intelligence agencies encourages a low regard for the need to safeguard their product. </p>\n<p>On this, as on other matters, the example set by Trump will be followed by his appointees.  </p>\n\n<p>One way Trump’s director of the Central Intelligence Agency, John Ratcliffe, demonstrated his fealty to Trump during his earlier tenure as director of national intelligence was to <a href=\"https://www.theguardian.com/us-news/2024/mar/18/us-intelligence-trump-putin-threat\" rel=\"noreferrer noopener\" target=\"_blank\">declassify and release publicly</a> a Russian document for no apparent purpose, other than that it suggested Clinton was behind any perceived connection between Trump’s campaign and Russia. Ratcliffe made the disclosure notwithstanding any threat to intelligence sources and methods and despite the document’s contents being unverified and possibly Russian disinformation. </p>\n<p>The Trump team’s careless approach to safeguarding sensitive information was apparent even before the president’s return to office. His transition team <a href=\"https://www.politico.com/news/2024/12/18/federal-officials-nervous-about-sending-data-to-trump-transition-private-emails-00195217\" rel=\"noreferrer noopener\" target=\"_blank\">used private email</a> to discuss government business with officials of the outgoing administration — a practice for which Trump in an earlier campaign, had <a href=\"https://www.presidency.ucsb.edu/documents/statement-donald-j-trump-hillary-clintons-bad-judgment-and-the-rigged-system\" rel=\"noreferrer noopener\" target=\"_blank\">castigated</a> Clinton. Trump’s adviser, Elon Musk, is a <a href=\"https://www.nytimes.com/2024/12/29/opinion/elon-musk-china-classified-secrets-national-security-russia-doge.html?searchResultPosition=1\" rel=\"noreferrer noopener\" target=\"_blank\">security risk</a> on multiple grounds, and Musk’s company SpaceX has a <a href=\"https://www.nytimes.com/2024/12/17/technology/elon-musk-spacex-national-security-reporting.html\" rel=\"noreferrer noopener\" target=\"_blank\">poor record</a> of compliance with procedures designed to safeguard government secrets. </p>\n<p>A disdain for protecting the nation’s secrets leads to a permissive posture toward leakers. “I love WikiLeaks,” <a href=\"https://thehill.com/blogs/ballot-box/presidential-races/300327-trump-i-love-wikileaks/\" rel=\"noreferrer noopener\" target=\"_blank\">proclaimed</a> Trump during his 2016 campaign, because among the wholesale disclosures by WikiLeaks of U.S. classified information was material that caused problems for Clinton, his political opponent at the time. </p>\n<div class=\"civic-science-article-container civic-science-more-14 civic-is-mr3\" data-civicscience-widget=\"3f127ebd-287e-0b64-a901-d55ec286348a\" id=\"civsci-id-civsci-id-596708068\"></div>\n<p>Several influential people in Trump’s circle are urging him to <a href=\"https://www.washingtonpost.com/politics/2024/12/04/trump-pardon-edward-snowden-gaetz/\" rel=\"noreferrer noopener\" target=\"_blank\">pardon Edward Snowden</a>, the contract employee of the National Security Agency who committed the largest leak ever of top-secret information about the nation’s signals intelligence programs. Trump has said he <a href=\"https://www.newsweek.com/donald-trump-close-pardoning-julian-assange-edward-snowden-candace-owens-1662153\" rel=\"noreferrer noopener\" target=\"_blank\">came close</a> to granting a pardon during his first term. </p>\n<p>Snowden’s disclosures went far beyond any controversial domestic activities and included copious material about NSA’s normal mission of collecting foreign intelligence. Who benefitted and who was harmed by Snowden’s actions is demonstrated by his placing himself in the hands of Russia and <a href=\"https://www.theguardian.com/us-news/2022/dec/02/edward-snowden-gets-russian-passport-after-swearing-oath-of-allegiance\" rel=\"noreferrer noopener\" target=\"_blank\">accepting Russian citizenship</a>. Snowden is a <a href=\"https://nationalinterest.org/blog/paul-pillar/snowdens-treason-9020\" rel=\"noreferrer noopener\" target=\"_blank\">traitor</a> — even though Trump’s nominee to be director of national intelligence, Tulsi Gabbard, <a href=\"https://www.axios.com/2025/01/30/tulsi-gabbard-edward-snowden-traitor\" rel=\"noreferrer noopener\" target=\"_blank\">refused to acknowledge it</a> at her confirmation hearing.</p>\n<p>The main immediate harms of the new administration’s handling of classified information include the loss of intelligence sources and methods, which can include the death of human agents. Foreign adversaries gain valuable knowledge about U.S. intelligence, military and other capabilities. Any compromise of classified material makes foreign partners in critical liaison relationships less willing to share their information with the U.S. — as I saw happen during my intelligence career following earlier leaks.</p>\n\n<p>Trump’s carelessness in handling the nation’s secrets and his encouragement of leakers promotes a further breakdown of discipline in the ranks. That leads to still more leaks and more unauthorized disclosures, which multiplies the harms. </p>\n<p><em>Paul R. Pillar is former national intelligence officer for the Near East and South Asia. His most recent book is </em><a href=\"https://www.amazon.com/Beyond-Waters-Edge-Partisanship-Corrupts/dp/0231213166\" rel=\"noreferrer noopener\" target=\"_blank\"><em>“Beyond the Water’s Edge: How Partisanship Corrupts U.S. Foreign Policy.”</em></a><em></em> </p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/opinion/national-security/5123524-trump-risk-national-secrets/",
            "pub_date": "2025-02-04 21:35:55",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5124897,
            "title": "El Salvador offers to house ‘American criminals,’ deportees: Rubio",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p><a data-id=\"https://thehill.com/homenews/ap/ap-international/ap-el-salvadors-president-is-triumphant-after-his-bet-on-bitcoin-comes-true/\" data-type=\"link\" href=\"https://thehill.com/homenews/ap/ap-international/ap-el-salvadors-president-is-triumphant-after-his-bet-on-bitcoin-comes-true/\">El Salvador</a> has offered to house criminals who are American citizens and deportees of other nationalities, according to the Secretary of State Marco Rubio.</p>\n<p>Rubio <a href=\"https://www.state.gov/secretary-of-state-marco-rubio-and-salvadoran-foreign-minister-alexandra-hill-tinoco-at-the-signing-of-a-memorandum-of-understanding-concerning-strategic-civil-nuclear-cooperation/\">said late Monday</a> that <a data-id=\"https://thehill.com/homenews/ap/ap-international/ap-u-s-dampens-criticism-of-el-salvadors-president-as-migration-overtakes-democracy-concerns/\" data-type=\"link\" href=\"https://thehill.com/homenews/ap/ap-international/ap-u-s-dampens-criticism-of-el-salvadors-president-as-migration-overtakes-democracy-concerns/\">Salvadoran President</a> Nayib Bukele’s offer is “the most unprecedented and extraordinary migratory agreement anywhere in the world.” </p>\n\n<p>The comments came after he met with the country’s leadership. </p>\n<p>Rubio traveled to El Salvador, part of his tour through Central America and the Caribbean to drum up support for President Trump’s <a data-id=\"https://thehill.com/policy/national-security/5105543-trumps-immigration-crackdown-southern-border-birthright-citizenship-aslyum-refugee-programs-biden/\" data-type=\"link\" href=\"https://thehill.com/policy/national-security/5105543-trumps-immigration-crackdown-southern-border-birthright-citizenship-aslyum-refugee-programs-biden/\">immigration agenda</a>, which the administration said will include <a data-id=\"https://thehill.com/homenews/administration/5033341-trump-prioritizes-immigration-policy/\" data-type=\"link\" href=\"https://thehill.com/homenews/administration/5033341-trump-prioritizes-immigration-policy/\">mass deportations</a>. </p>\n<p>“He has offered to house in his jails dangerous American criminals in custody in our country, including those of U.S. citizenship and legal residents,” Rubio said Monday, according to the State Department readout. “No country’s ever made an offer of friendship such as this.” </p>\n<p>El Salvador will keep accepting Salvadorans who are <a data-id=\"https://thehill.com/homenews/administration/5107701-homan-defends-immigration-raids-into-middle-elementary-schools/\" data-type=\"link\" href=\"https://thehill.com/homenews/administration/5107701-homan-defends-immigration-raids-into-middle-elementary-schools/\">living in the U.S. illegally</a>, along with international criminal gangs MS-13 or Tren de Aragua, both of which have been designated as foreign terrorist organizations by Trump.</p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>“And he’s also offered to do the same for dangerous criminals currently in custody and serving their sentences in the United States, even if they’re U.S. citizens or legal residents,” Rubio said. </p>\n<p>Bukele confirmed the offer on social platform X, calling it an opportunity to “outsource part of its prison system.” </p>\n\n<p>“We are willing to take in only convicted criminals (including convicted U.S. citizens) into our mega-prison (CECOT) in exchange for a fee,” Bukele <a href=\"https://x.com/nayibbukele/status/1886606794614587573?s=46\">wrote</a> Monday night. “The fee would be relatively low for the U.S. but significant for us, making our entire prison system sustainable.” </p>\n<p>The U.S. government doesn’t have the authority to deport American citizens and a move such as this would likely prompt a bevy of legal challenges. </p>\n<p>Since taking office, Bukele has been able to <a data-id=\"https://thehill.com/policy/international/ap-el-salvadors-nayib-bukele-heads-for-reelection-as-president-buoyed-by-support-for-gang-crackdown/\" data-type=\"link\" href=\"https://thehill.com/policy/international/ap-el-salvadors-nayib-bukele-heads-for-reelection-as-president-buoyed-by-support-for-gang-crackdown/\">tamp down gang violence</a> in the country, but critics have panned the push, at times, being in violation of civil rights and pointing to conditions at El Salvador’s jails. </p>\n<p>The State Department characterizes El Salvador’s prisons as “harsh and dangerous.”</p>\n<p>Rubio also visited Panama earlier this month, following Trump’s <a data-id=\"https://thehill.com/policy/defense/5074900-trump-provokes-anxieties-with-greenland-panama-canal-military-talk/\" data-type=\"link\" href=\"https://thehill.com/policy/defense/5074900-trump-provokes-anxieties-with-greenland-panama-canal-military-talk/\">proposal to regain control</a> of the <a data-id=\"https://thehill.com/homenews/administration/5071620-trump-panama-canal-greenland-canada-mar-a-lago/\" data-type=\"link\" href=\"https://thehill.com/homenews/administration/5071620-trump-panama-canal-greenland-canada-mar-a-lago/\">Panama Canal</a>. </p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/policy/international/5124897-marco-rubio-el-salvador-american-criminals-deportees/",
            "pub_date": "2025-02-04 21:25:56",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5122907,
            "title": "Snip, snip: Spending cuts are coming ",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>Republicans’ agenda of cutting taxes and increasing spending on their policy priorities depends significantly on identifying productive spending reductions. But just cutting spending will not be enough. Republicans must also explain how their tax and spending cuts will result in better outcomes for all Americans.</p>\n<p>The federal debt has exploded to $36 trillion and annual deficits now <a href=\"https://www.cbo.gov/publication/61172\" rel=\"noreferrer noopener\" target=\"_blank\">approach $2 trillion</a> for the foreseeable future. Just the interest on the debt totals <a href=\"https://www.aei.org/op-eds/stop-the-insanity-our-national-debt-now-tops-35-trillion/\" rel=\"noreferrer noopener\" target=\"_blank\">almost $1 trillion</a> per year, exceeding the cost of national defense. For Republicans, the underlying problem is simple: As Treasury Secretary Scott Bessent <a href=\"https://www.youtube.com/watch?v=1BEDMqI0Wds\" rel=\"noreferrer noopener\" target=\"_blank\">described</a> in his recent confirmation hearing, “we do not have a revenue problem.” Instead, “spending is out of control.”</p>\n\n<p>Upcoming bills threaten to make budget imbalances worse. Congress must soon pass legislation to prevent a government shutdown and increase the debt limit. Expensive relief for California wildfires is likely. And Republicans are planning a <a href=\"https://www.politico.com/live-updates/2025/01/29/congress/john-thune-senate-reconciliation-plan-00201406\" rel=\"noreferrer noopener\" target=\"_blank\">massive budget reconciliation bill</a> to extend expiring tax cuts and increase spending on immigration enforcement, defense and other administration priorities. </p>\n<p>Supporters rightly argue that allowing the tax cuts to lapse would harm everyday Americans. Ways and Means Chairman <a href=\"https://www.youtube.com/watch?v=4WjTj3SC-I4&amp;t=2269s\" rel=\"noreferrer noopener\" target=\"_blank\">Jason Smith (R-Mo.) notes</a> that would mean “40 million parents will have their child tax credit slashed in half.” Meanwhile, official scorekeepers project that extending current tax relief would increase deficits by <a href=\"https://crsreports.congress.gov/product/pdf/R/R47846\" rel=\"noreferrer noopener\" target=\"_blank\">over $4 trillion</a> — more if campaign-promised tax cuts, along with spending priorities, are added. </p>\n<p>The coming weeks will feature an intense debate over how much of those costs should be offset by other spending cuts. Deficit hawks have outsized leverage in that debate thanks to the ultra-thin partisan House majority. </p>\n<p><a href=\"https://www.politico.com/news/2025/01/19/trump-agenda-congress-delay-republicans-00001768\" rel=\"noreferrer noopener\" target=\"_blank\">Key details are yet to be decided</a>, but House Budget Committee Chairman Jodey Arrington (R-Texas) recently circulated a short list of <a href=\"https://www.politico.com/f/?id=00000194-5115-d639-a395-7db5d6b70000\" rel=\"noreferrer noopener\" target=\"_blank\">would-be savings</a> totaling over $5 trillion, followed by a <a href=\"https://punchbowl.news/reconciliation_wm/\" rel=\"noreferrer noopener\" target=\"_blank\">50-page menu</a> offering almost $15 trillion in nominal deficit reduction alongside more than $3 trillion in potential “sweeteners.”</p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>If lawmakers agree to even a fraction of those savings, it will involve enormous figures. Just as the Biden administration floundered in promoting <a href=\"https://www.nbcnews.com/politics/congress/lost-bidens-agenda-democrats-offer-competing-theories-failure-build-ba-rcna24552\" rel=\"noreferrer noopener\" target=\"_blank\">trillions in new spending</a>, Republicans won’t be able to sell the country on dollar figures alone.</p>\n<p>Opponents are already decrying “<a href=\"https://ccf.georgetown.edu/2025/01/20/house-budget-committee-circulates-new-detailed-list-of-budget-reconciliation-options-including-draconian-medicaid-cuts-within-house-republican-caucus/\" rel=\"noreferrer noopener\" target=\"_blank\">draconian</a>” cuts. House Minority Leader Hakeem Jeffries (D-N.Y.) has <a href=\"https://thehill.com/homenews/house/5086174-jeffries-house-republicans-debt-limit/\" rel=\"noreferrer noopener\" target=\"_blank\">criticized</a> “massive tax breaks for billionaires and wealthy corporations” alongside policies that would make “working families and middle-class folks and the poor, the sick and the afflicted … pay for it.” Such criticism spotlights a key challenge: To define not only how reforms will yield savings but also better outcomes, including for those now collecting benefits. </p>\n\n<p>There are strong arguments for reform, including eliminating unnecessary programs, ending benefits for those who entered the U.S. illegally, and reversing policies from the previous administration that contributed to rising inflation for everyone. </p>\n<p>Other worthy arguments involve expanding work requirements for those receiving government assistance, which expect able-bodied benefit recipients to participate in work or job training. <a href=\"https://www.aei.org/opportunity-social-mobility/turning-back-the-clock-on-welfare-reform/\" rel=\"noreferrer noopener\" target=\"_blank\">A generation ago</a>, lawmakers in both parties applied work requirements to millions of mostly single mothers then collecting welfare checks, arguing they were needed to reduce dependence and increase work. Even <a href=\"https://www.aei.org/opportunity-social-mobility/the-white-house-defender-of-welfare-work-requirements/\" rel=\"noreferrer noopener\" target=\"_blank\">then-Sen. Joe Biden (D-Del.)</a> supported work requirements. The reforms worked; poverty and <a href=\"https://sgp.fas.org/crs/misc/RL32760.pdf\" rel=\"noreferrer noopener\" target=\"_blank\">dependence on welfare checks</a> fell sharply as more former and would-be recipients worked and their earnings rose.  </p>\n<p>Current polls suggest that <a href=\"https://www.aei.org/opportunity-social-mobility/the-white-house-defender-of-welfare-work-requirements/\" rel=\"noreferrer noopener\" target=\"_blank\">large majorities</a> — including <a href=\"https://today.yougov.com/politics/articles/45187-americans-evaluate-social-security-medicare-poll\" rel=\"noreferrer noopener\" target=\"_blank\">most Democrats and independents</a> — support work requirements for able-bodied individuals on welfare. For example, a 2023 ballot measure in swing-state Wisconsin found that <a href=\"https://www.aei.org/politics-and-public-opinion/work-requirements-unify-voters-in-wisconsins-referendum/\" rel=\"noreferrer noopener\" target=\"_blank\">80 percent of voters</a> support work requirements. </p>\n<div class=\"civic-science-article-container civic-science-less-14 civic-is-mr3\" data-civicscience-widget=\"3f127ebd-287e-0b64-a901-d55ec286348a\" id=\"civsci-id-civsci-id-596708068\"></div>\n<p>Yet beyond cash welfare, few welfare programs today regularly require recipients to participate in work or training. While receipt of welfare checks remains low, the Congressional Budget Office <a href=\"https://www.cbo.gov/system/files/2025-01/60809-poverty.pdf\" rel=\"noreferrer noopener\" target=\"_blank\">recently reported</a> that in recent decades, other welfare programs — including the far larger food stamps and Medicaid programs — have grown rapidly. </p>\n<p>That suggests reforms are needed to connect more welfare recipients with work. Programs should start with those most able to work — <a href=\"https://www.aei.org/op-eds/beltway-liberals-are-playing-name-games-to-expand-the-welfare-state/\" rel=\"noreferrer noopener\" target=\"_blank\">able-bodied adults with no dependents</a>, who are best-positioned to progress from benefits to earnings and ultimately self-support. As they do so, benefit spending will fall.</p><!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://thehill.com/submitting-opinion-content/\"><img alt=\"\" class=\"wp-image-4329764\" decoding=\"async\" height=\"121\" loading=\"lazy\" sizes=\"(max-width: 899px) 100vw, 600px\" src=\"https://thehill.com/wp-content/uploads/sites/2/2023/11/op2.png?w=600\" srcset=\"https://thehill.com/wp-content/uploads/sites/2/2023/11/op2.png?resize=600,121 600w, https://thehill.com/wp-content/uploads/sites/2/2023/11/op2.png?resize=300,61 300w, https://thehill.com/wp-content/uploads/sites/2/2023/11/op2.png?resize=50,10 50w\" width=\"600\"/></a></figure>\n<p>Work requirements are just one part of the much bigger savings picture. Other <a href=\"https://www.aei.org/events/marriage-and-work-penalties-in-government-programs/\" rel=\"noreferrer noopener\" target=\"_blank\">pro-work reforms</a> are needed. Not everyone can work, and even cash welfare work requirements apply to only half of those collecting checks. But lawmakers can and should expect and support more work for those collecting major welfare benefits.</p>\n\n<p>This will help more people move off the sidelines and into the economic mainstream, where millions of jobs are open and millions more will now become available as illegal immigration is restricted. That will boost both families and taxpayers, while helping keep deficits in check. </p>\n<p><em>Matt Weidinger is an AEI senior fellow and Rowe Scholar.</em> </p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/opinion/congress-blog/5122907-republicans-spending-cuts/",
            "pub_date": "2025-02-04 21:01:05",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5122580,
            "title": "What I learned on my post-election trip to Trump Country",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>George Martin was searching for the word that best captured the vibe shift that has taken place between American voters and Donald Trump over the last couple of years. But first, as we shot pool at the Eastern Palace Club in Hazel Park, Mich., a few days before Trump’s inauguration, Martin wanted to explain why so many Black men had voted against America’s first Black female presidential nominee.</p>\n<p>First, there was abortion, an issue that Kamala Harris made <a href=\"https://thehill.com/newsletters/health-care/4789276-harris-poised-to-make-abortion-rights-a-centerpiece-of-campaign/\">a centerpiece</a> of her campaign but that didn’t resonate much with Black men like Martin. More important, though, was Harriss’s record as a prosecutor in California.  </p>\n\n<p>“One of the biggest knocks on Kamala was that she was AG during a time when Black men were prosecuted for all sorts of things,” Martin said. “And whenever she was questioned, she sort of minimized it or made it seem like it didn’t happen. That was an enormous deal for me. During that time as Black men, we were looked at as ‘super predators.’”</p>\n<p>I first met Martin in 2017 and have interviewed him several times since. A former Obama voter, Martin backed Trump in 2016. He voted for the libertarian presidential candidate in 2020 but returned to Trump last year.</p>\n<p>I asked Martin whether he knows many other Trump voters. “A majority of my friends are liberals,” said Martin, who lives in Detroit’s Bagley neighborhood and plays in a rock band. Even so, Martin suspects that a few of them voted for Trump. Trump won <a href=\"https://www.newsweek.com/trump-support-white-black-voters-immigration-2020299\">about 20 percent</a> of Black voters in 2020, the highest share of any Republican in a quarter century.</p>\n<p>“Was it easier to tell people you were voting for Trump this time?” I asked. </p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>“Oh yeah,” Martin said. “It was a lot easier to come out of the closet to say, ‘This ain’t working.’ Minorities in general, in 2016, you could get kicked out of your family for saying you like Donald Trump. But now, you might get looked at funny, but in the back of people’s minds, they kind of understand how it happened.”</p>\n<p>“A lot of us were politically weary,” he continued. “We’d been screaming at each other for so long. We were going at each other’s throats for a few years. I mean, now more people are thinking that [Trump’s second term] isn’t the end of the world. We’ve had four years of a Trump presidency, and we came out just fine.”</p>\n\n<p>Finally, Martin found the word he’d been searching for. “Overall, I think the only way to say it is there’s been a real <em>softening</em> [toward Trump].”</p>\n<p>I spent much of 2017-2019 reporting from nine swing counties for my book, <a href=\"https://www.amazon.com/Road-Trumps-America-Journey-Divided/dp/1645720187\">“On the Road in Trump’s America.”</a> Immersing myself in communities across the country, I learned a great deal about what motivated people’s votes both for and against Trump.</p>\n<p>Following Trump’s 2024 victory, I was curious how people’s views might have changed over the last five tumultuous years. So, in January, I traveled through Pennsylvania, Michigan, Wisconsin and Iowa, spending time in former Obama strongholds that had flipped to Trump. I interviewed many of the same people I had talked to at length during Trump’s first term and in the run-up to the 2020 election. </p>\n<div class=\"civic-science-article-container civic-science-more-14 civic-is-mr3\" data-civicscience-widget=\"3f127ebd-287e-0b64-a901-d55ec286348a\" id=\"civsci-id-civsci-id-596708068\"></div>\n<p>My first stop was Erie, a working-class city in the Northwest corner of Pennsylvania that has been battered by manufacturing job loss. I met up with Jim Wertz in a downtown food hall, just off Perry Square. Wertz chaired Erie County’s Democratic Party in 2020 before running unsuccessfully for the state Senate last year. </p>\n<p>Trump won Erie County by <a href=\"https://www.goerie.com/story/news/politics/elections/2024/11/06/donald-trump-wins-erie-county-pa-presidential-election-2024-harris/76081763007/\">nearly 2,000 votes</a> — a few hundred votes more than Joe Biden’s even slimmer <a href=\"https://www.electionreturns.pa.gov/_ENR/General/CountyResults?countyName=Erie&amp;ElectionID=83&amp;ElectionType=G&amp;IsActive=0\">1,400-vote victory</a> in the county in 2020. </p>\n<p>Wertz felt Democrats had lost many potential voters in the fast-moving events of last summer. “Midsummer, I was knocking on a lot of Republican doors,” he said. “These are people that we’d ID’d as persuadable for whatever reason. And the older Republicans, the folks that were Biden in 2020 and GOP down-ticket, they were saying they’d vote straight Dem because they were upset about the national conversation. I wonder how many of them had been battered by GOP messaging and turned [to Trump].”</p>\n\n<p>I asked Wertz whether the problem had less to do with messaging than with policy. </p>\n<p>“I don’t think Democrats have a policy problem,” he said. “I think they have a problem talking about their policies. I think that’s been true for a long time.”</p>\n<p>“But what about the criticism of Democratic policies as too ‘woke’ or too lenient on illegal immigration and crime?” I asked. </p>\n\n<p>“I think if your messaging is sound, you can humanize a lot of that wokeness and make people understand why that policy needs to be in place,” he said. “It comes down to human rights.”</p>\n<p>Many Democrats I spoke with insisted that the party’s policy positions are broadly popular and that they only needed to do a better job of packaging them and mobilizing their voters. </p>\n<p>“Democrats across the board from the top down spent time trying to convert a lot of voters and that’s just not good campaigning,” Wertz said. “You’ve got to turn your people out.”</p>\n\n<p>When I interviewed Wertz in 2020, he seemed baffled by religious voters’ continuing support for Trump. “I’ve thought a lot about it,” he said when I asked him about it again in January. “I don’t know that I’ve gotten closer to an answer. It still baffles me. But I’m not as hung up on it as I was.”</p>\n<p>I brought up abortion as an issue that motivates evangelical voters and where a chasm exists between the parties’ positions. </p>\n<p>He said he was surprised that abortion hadn’t helped Democrats more. Taking his cue from Harris, Wertz railed against the Trump-appointed Supreme Court majority’s decision ending the federal guarantee of a right to abortion. But the issue never really caught on (perhaps in part because the number of annual abortions has <a href=\"https://www.guttmacher.org/2024/03/despite-bans-number-abortions-united-states-increased-2023\">actually increased</a> since the court’s decision). </p>\n\n<p>An <a href=\"https://abcnews.go.com/538/abortion-lead-democrats-victory-2024-election/story?id=116880480\">election-eve poll</a> found that only about one-in-10 voters considered it their top issue, and no doubt many of those were pro-life voters.<strong> </strong></p>\n<p>“The post-Roe wave has subsided,” Wertz said. “I got an earful from some older Catholic women during the campaign. ‘You’re talking too much about abortion!’ they said. I said, ‘I know, but the polling still says this is the issue.’” Wertz thinks he should have talked more about the minimum wage instead.</p>\n<p>The next day, I had lunch with Dale and Darlene Thompson, a retired couple I had interviewed several times during Trump’s first term. Dale, a former union worker at a tool manufacturer in Erie, and Darlene, a former health care administrator, had recently decamped to rural Ohio.</p>\n\n<p>As Democrats in a deeply conservative place, Darlene said “there’s a big part of your life that you don’t share with people.” That said, the Thompsons placed a large Harris-Walz banner in front of their home a few weeks before the election. </p>\n<p>The Thompsons’ proximity to Trump voters hadn’t given them much insight into what motivated their votes. </p>\n<p>“Before the election, I asked my sister-in-law, ‘What is prompting you to vote for [Trump]?’” said Darlene. “She answered, ‘Well, they tried to kill him.’”</p>\n<p>“I said, ‘I meant policy-wise.’”</p>\n<p>“She said, ‘Don’t you know that we’re going to be safer and we’re going to be richer?’” </p>\n<p>Darlene saw Harris’s election loss coming from a mile away, but Dale still seemed to be processing it. He was also having trouble reconciling the loathsome politics of some of the Trump voters he knows with the fact that, as he put it, some of them “are such kind, wonderful people who would crawl through a mile of broken glass if you needed help.”</p>\n<p>“I’m truly afraid for our country,” Dale said. Still, he hoped that the end of Trump’s term would mark “the ancient white man’s hands getting pried from the levers of power for the last time.” </p>\n<p>“That’s exactly what you said the last time we spoke (in 2020),” I said. </p>\n<p>“I did,” he said. “It’s the best way I can think of to say it when more blacks and Hispanics are entering school than whites.”</p>\n<p>“A lot of them voted for Trump,” I said. “How do you account for that?”</p>\n<p>“I don’t know is the honest answer,” he said. “I wish I did. I wish I did.”</p>\n<p>Two days later, I found myself at L&amp;R Embroidery in New Baltimore, Mich., on the northern shores of Lake Saint Clair. New Baltimore is in Macomb County, a former Obama stronghold that swung decisively to Trump in 2016 and hasn’t looked back. </p>\n<p>Its owners, Laurie and Rob Rasch, sold MAGA hats and other Trump memorabilia, and Laurie told me business was good across the state. But I noticed that, amid all the Detroit-themed sports items, there were only a couple of Trump hats left. </p>\n<p>“There are just so many of them out there now, and you can get them for $4 or $5 bucks from China,” Laurie said. “During the election, there was [somebody] on every corner selling them.”</p>\n<p>I asked whether, during the campaign, anyone had ever come in asking for Biden or Harris merch. “Every once in a while, someone will ask me where my Biden hats are — or where are my Kamilla hats,” she said, deliberately mispronouncing the former veep’s name. “I’d just laugh.” </p>\n<p>Laurie said that although she and Rob were avid Trump supporters, they would have gladly made the hats if there had been sufficient demand. There just wasn’t.</p>\n<p>I perused the remaining hats. Laurie was all out of the red “Elect that MF’er again!” hats I had seen on my last visit in 2019. Only an outdated “Trump 2020 vision” hat and a classic red “Make America Great Again” cap remained. I bought the latter and decided to conduct an experiment. </p>\n<p>I drove to Madison, Wisconsin, the next day. Wisconsin is a swing state, but Madison is a deeply progressive college town. Harris beat Trump by more than 50 points in Dane county, which contains Madison. It’s so liberal that, when I lived in Madison in the 1990s, people would sometimes <a href=\"https://www.economist.com/democracy-in-america/2012/06/05/polarisation-in-the-peoples-republic-of-madison\">refer to it</a> as “The people’s republic of Madison.” </p>\n<p>When I arrived, I put the red MAGA hat on and wore it all afternoon. Nobody seemed to mind. The two young women working at my hotel reception desk noticed the hat but treated me with the cordiality Wisconsinites are known for.</p>\n<p>I roamed across the University of Wisconsin campus, down State Street and around the state capitol. I got lots of stares and double takes and a few bemused looks, but almost no hostility. Two college-aged guys walked by and one coughed loudly and shouted “shit!” after seeing my hat. But the predominant emotional response seemed to be not indignation but indifference. </p>\n<p>I found that to be strange on a campus with such a long and proud history of progressive political activity and protest. Granted, most of the college students hadn’t returned to campus yet, but there were still plenty of people about.</p>\n<p>I walked into Anthropologie, a “boho-chic” clothing store on State Street. A poster with a long inspirational quote by Kamala Harris was plastered on the entrance window. The store was packed with shoppers. Many noticed the hat, but none seemed to mind as I browsed the feminist greeting cards and calendars. When I left, I got a cheery “Have a good day” from the woman at the counter. </p>\n<p>At Fairtrade Coffee House on State Street, a man in a house dress glanced at my hat and then matter-of-factly explained coffee options before serving me a latte. I had similar reactions at the Willy Street food co-op and the local Whole Foods. </p>\n<p>“What gives?” I thought. During Trump’s first term, you’d occasionally hear stories of people getting <a href=\"https://www.youtube.com/watch?v=thRsikyXuSk\">kicked out of restaurants</a> or even <a href=\"https://www.bbc.com/news/world-us-canada-44745676\">physically assaulted</a> for wearing MAGA hats. But I didn’t experience any of that — not even in the people’s republic. </p>\n<p>Then it occurred to me that maybe George Martin was right. Maybe there had been a softening toward Trump. At the very least, it seemed that for many Democrats, clenched teeth and a raised fist had been replaced with an eye-roll and a shrug of the shoulders.</p>\n<p>Having completed my experiment, I ditched the hat and drove to Trempealeau County, a farming community along the Mississippi River on Wisconsin’s western border with Minnesota. </p>\n<p>I visited Paul Jereczek, a dairy and crop farmer. Paul is a Democrat who said he was surprised by the 2024 election results but not as devastated by Trump’s win as he had been in 2016. </p>\n<p>“On election night the first time around, when my kids went to bed, it was, ‘What kind of future are we going to have?’ And this time, some of that faded away. …We got through four years of him, even with the chaos at the end.”</p>\n<p>“The only solace is there’s nobody else who can do what Trump does,” he continued. “So, whatever we’re going through will be short lived. It’s not the end of the world.”</p>\n<p>Trump has promised to deport the estimated 11 million immigrants living in the U.S. illegally. That includes half of the 850,000 crop workers who the Department of Agriculture <a href=\"https://www.ers.usda.gov/topics/farm-economy/farm-labor#size\">estimates</a> are here illegally. In the first two weeks of his presidency, Trump has already signed several executive orders to that end and <a href=\"https://www.nytimes.com/2025/01/28/world/americas/us-brazil-deportations.html\">sent several plane-loads</a> of illegal immigrants back to Mexico, Guatemala, Brazil and Colombia, among others.</p>\n<p>“If he actually goes through with it, it would be a problem,” Paul said of the deportations. “But he would tick off too many people. …Those big, huge dairies are all based on immigrant labor. And they would collapse. The Ag sector alone, all the chicken plants, all the beef plants, everything, the backbone of all that work is immigrant labor. And there just isn’t enough white people to fill those jobs.”</p>\n<p>Immigrants have flocked to Trempealeau County in recent decades. In neighboring Arcadia, the Hispanic population has grown from less 1 percent to nearly half over the last 25 years, according to Census Bureau data. Most of them work at Ashley Furniture, America’s largest furniture manufacturer, or Gold’n Plump, a chicken processor, both based in Arcadia.</p>\n<p>Hispanics make up more than 80 percent of elementary school students here. The local priest once told me Spanish baptisms outnumber English baptisms by a ratio of six-to-one. </p>\n<p>At a time when many rural towns are disappearing, Arcadia’s immigrants are not only a welcome presence but also a necessary one. They’re keeping the place alive.</p>\n<p>“When I was in highs school here [in the 1990s], there was one Mexican kid in my class,” Paul said. “And now my son who’s in middle school, he’s definitely a minority. Easily.”</p>\n<p>“How do you feel about that?” I asked. </p>\n<p>“That’s the way it is,” Paul said. “Trump is talking about deporting all these people. But walk Arcadia, what would Arcadia be without them? And Arcadia can’t be the only town like that. There’s a reason why they’re here.”</p>\n<p>I got a different take when I spoke to Henry Filla the following day in Osseo, 40 miles north of Dodge. Filla, is a dairy, crop and buffalo farmer, and an avid Trump supporter. </p>\n<p>Filla told me he wasn’t worried about Trump’s tariffs affecting his farm. “We’ve had ‘em before,” he said, explaining that he “came out better” after receiving his share of the massive government payments made to farmers to stem the financial losses from tariffs during Trump’s first term. </p>\n<p>Filla said he didn’t think any deportations would affect the local economy. </p>\n<p>“I don’t know of any illegals here, in this particular area,” he said. “There are a few famers who have some. I think the focus of this deportation will be to start out with the criminals. And that’s a big pile, I guess. Three or four thousand of them.” </p>\n<p>Filla’s distinction between legal and illegal immigrants is one that progressives often ignore. But it’s a difference that the immigrants themselves understand is crucial to the debate.  </p>\n<p>The next day, I walked down Main Street in Arcadia, which is lined with Latino businesses with names like “La Tapatia Tienda y Taqueria, “MM San Juan” and “Don Juan Mexican Restaurant.” The Latinos I spoke with didn’t seem concerned with the prospect of deportations. As a young woman from Guatemala named Carla told me in Spanish at Guerrero Street Food, “If you’re working and have your papers, you’re fine.” </p>\n<p>My final stop was Howard County, Iowa, which in 2016 became the only county in America to vote for Trump by more than 20 points after having voted for Barack Obama by more than 20 points in 2012. (This time, Trump won by 32 points.)</p>\n<p>I have visited Howard County many times since 2016. Whenever I visit, I wonder how Obama managed to perform so well in this rural, ag-heavy place, where 99 percent of residents are white and a similar share own guns. Many were thrilled to vote for America’s first Black president, I learned, but later felt betrayed by Obama when he didn’t deliver on his promises, driving them into the arms of Trump. </p>\n<p>I met up with Chris Chilson at a bar in downtown Cresco, just up the block from the city’s only traffic light. Chris has voted for Trump three times and still flies a Trump flag outside his home in nearby Lime Springs.</p>\n<p>Chris is a Navy veteran who responded strongly when I brought up the name of Pete Hegseth, the former Fox News anchor and national guardsman who was in the middle of a difficult confirmation fight as Trump’s pick to be defense secretary.</p>\n<p>“Pete Hegseth’s a friend of mine,” Chris announced. “He grew up in Forest Lake, Minnesota. And he was my cousin’s best friend. And they still are best friends. …After I got out of the Navy, I got involved with Vets for Freedom and Concerned Veterans for America, which Pete was part of. And I got to know him over the years.”</p>\n<p>Hegseth’s confirmation was in jeopardy at the time due in part to allegations of sexual abuse and excessive drinking on the job. Iowa Sen. Joni Ernst (R), a decorated veteran who has spoken out against sexual abuse in the military, was considered a key swing vote in Hegseth’s confirmation.</p>\n<p>Chris wrote Ernst a letter stating that he had been with Hegseth on several occasions and never seen him act inappropriately. What struck Chris most was how the media seemed to manipulate Hegseth’s biography, focusing only on the negative aspects.</p>\n<p>“He’s the first person I’ve personally known who’s been involved in a high-profile position,” Chris said of Hegseth. “And when they started talking about all this stuff on the news, I thought, ‘This isn’t the guy I know.’ They’re just making up a profile … they could do it for anyone. Everybody has got bad parts, but if that’s all you focus on then you’re going to make him out to be the worst person in the world. And I thought, how many other people are they doing this to?”</p>\n<p>The following day, Ernst announced that she would vote <a href=\"https://www.nytimes.com/2025/01/14/us/politics/joni-ernst-pete-hegseth-confirmation.html\">in favor</a> of Hegseth, who went on to be <a href=\"https://www.msn.com/en-us/politics/government/senate-is-preparing-to-confirm-hegseth-as-defense-secretary-in-late-evening-vote/ar-AA1xOJmi?ocid=BingNewsSerp\">confirmed</a> by a historically slim margin. </p>\n<p>Later, I spoke with Laura Hubka, former chair of the Howard County Democratic Party. Like other Democrats I spoke with, she lamented that her party had gone “all in on abortion” and other cultural issues.</p>\n<p>“Democrats ran a lot on identity politics, which in an area like this, we don’t care if people are gay. We aren’t prejudiced. But we’d rather not focus on that, we’d rather focus on bringing prices down.”</p>\n<p>“Eight years ago, I was ready to go, ready to fight. I was very nervous. Thought the world would explode. We’d have four years of terror. A lot of bad things did happen, but there were checks in place. Those checks are still in place.”</p>\n<p>Hubka has become disillusioned by politics. “Maybe’s [Trump is] right and I’m wrong,” she said. “My voice meant nothing and it’s sad to admit that.” After devoting much of the last 10 years to political organizing, Hubka is checked out, exhausted. “I’m tired,” she said. “Someone else can take up the fight.”</p>\n<p>Later, I sat down with Joe Kaletka, who has chaired the county Democrats for the last year. At 24 years old, he can barely remember a time before Trump dominated the political scene. </p>\n<p>Kaletka believes people have become desensitized to Trump. “Yes, what he’s doing is outrageous, but we are not in uncharted territory like last time,” he said. “We know what he’s doing. We know he’s going to get away with it. And the feeling is, what can you do?”</p>\n<p>Trump has “hollowed out the rural Democratic Party,” said Kaletka. His focus looking ahead is not on winning the county back, but on simply identifying Democrats and convincing them to show up to meetings. The county has turned into such a Trump stronghold, he said, that “people are afraid to step up and be seen as a Democrat.”</p>\n<p>“We need more people, because … when I walk into a meeting, when my regulars are busy, and the meeting ends up being just me, and I sit there for 10 minutes hoping somebody will show up, I try not to talk to myself.”</p>\n<p>Hubka’s one fear is that Trump will try to remain in office beyond two terms. Others I spoke with sensed that Trump has so disrupted the political system that we won’t really know where we are until he leaves office. “Once he’s off the ballot in 2028, that’s going to give an indication of where we are at as Democrats,” said Kaletka. </p><!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://thehill.com/submitting-opinion-content/\"><img alt=\"\" class=\"wp-image-4329764\" decoding=\"async\" height=\"121\" loading=\"lazy\" sizes=\"(max-width: 899px) 100vw, 600px\" src=\"https://thehill.com/wp-content/uploads/sites/2/2023/11/op2.png?w=600\" srcset=\"https://thehill.com/wp-content/uploads/sites/2/2023/11/op2.png?resize=600,121 600w, https://thehill.com/wp-content/uploads/sites/2/2023/11/op2.png?resize=300,61 300w, https://thehill.com/wp-content/uploads/sites/2/2023/11/op2.png?resize=50,10 50w\" width=\"600\"/></a></figure>\n<p>George Martin had told me something similar when I was with him in metro Detroit. When I asked him whether the Republicans can keep improving with Black voters post-Trump, he was skeptical. </p>\n<p>“The Republican Party has such a long way to go with Black voters,” he said. “All bets are off after Trump leaves. Once neither party has Trump as the scapegoat or the crutch, we’ll see where we’re at.”</p>\n<p><em>Daniel Allott is The Hill’s chief opinion editor and author of </em><a href=\"https://www.amazon.com/Road-Trumps-America-Journey-Divided/dp/1645720187\"><em>“On the Road in Trump’s America: A Journey Into the Heart of a Divided Nation.”</em></a></p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/opinion/campaign/5122580-trump-voters-missing-the-mark/",
            "pub_date": "2025-02-04 20:45:59",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5124874,
            "title": "China hits US with retaliatory tariffs",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>China hit the U.S. back with retaliatory tariffs across the board over President Trump’s <a data-id=\"https://thehill.com/homenews/administration/5121102-trump-tariffs-china-canada-mexico/\" data-type=\"link\" href=\"https://thehill.com/homenews/administration/5121102-trump-tariffs-china-canada-mexico/\">enforcement of tariffs</a> on Chinese goods that went into effect on Tuesday. </p>\n<p>China’s Ministry of Finance announced the countermeasures, imposing a 15 percent tariff on liquefied <a data-id=\"https://thehill.com/homenews/administration/5119696-trump-tariffs-oil-semiconductors/\" data-type=\"link\" href=\"https://thehill.com/homenews/administration/5119696-trump-tariffs-oil-semiconductors/\">natural gas and coal</a>. China also said it would slap a 10 percent tariff on crude oil, pickup trucks, agricultural machinery and large-displacement cars. </p>\n\n<p>The tariffs are <a data-id=\"https://thehill.com/homenews/ap/ap-business/ap-china-imposes-15-tariffs-on-coal-lng-in-response-to-trumps-tariffs/\" data-type=\"link\" href=\"https://thehill.com/homenews/ap/ap-business/ap-china-imposes-15-tariffs-on-coal-lng-in-response-to-trumps-tariffs/\">set to take effect</a> next week on Feb. 10. </p>\n<p>“The US’s unilateral imposition of tariffs seriously violates the rules of the World Trade Organization,” the State Council Tariff Commission said in the announcement. “It is not only unhelpful in solving its own problems but also undermines the normal economic and trade cooperation between China and the US.” </p>\n<p>China’s Ministry of Commerce <a href=\"https://www.mofcom.gov.cn/zwgk/zcfb/art/2025/art_e623090907fc4e1092f0a4db72f57b95.html\">said</a> it would also impose export controls on several critical elements — including tellurium, bismuth, tungsten, indium and molybdenum. </p>\n<p>China went after Google whose search engine is not operational in the East Asia country. The State Administration for Market Regulation <a href=\"https://www.samr.gov.cn/xw/zj/art/2025/art_396a9ab3aa6d4c4bbd40833815afd245.html\">announced</a> Tuesday it will be starting an anti-trust probe into the company.</p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>The retaliatory measures from Beijing came as Trump’s additional 10 percent tariff went into effect Tuesday after a broad measure <a href=\"https://thehill.com/homenews/administration/5121102-trump-tariffs-china-canada-mexico/\">was signed</a> by the president over the weekend.</p>\n<p>The tariff threat came as part of Trump’s broader trade agenda with America’s neighbors, Canada and Mexico. Trump said he would <a data-id=\"https://thehill.com/business/5123332-trump-mexico-canada-tariffs/\" data-type=\"link\" href=\"https://thehill.com/business/5123332-trump-mexico-canada-tariffs/\">levy a 25 percent tariff</a> on each of the country’s goods coming into the U.S., a push that his administration argues is for forcing those nations to crack down on the influx of fentanyl and other illegal drugs in the country and better enforce border security. </p>\n\n<p>Trump spoke with leaders of both countries separately on Monday and decided to <a href=\"https://thehill.com/homenews/administration/5124026-trump-trudeau-canada-tariff-delay/\">postpone</a> the <a href=\"https://thehill.com/homenews/administration/5122864-trump-mexico-delay-tariffs/?email=467cb6399cb7df64551775e431052b43a775c749&amp;emaila=12a6d4d069cd56cfddaa391c24eb7042&amp;emailb=054528e7403871c79f668e49dd3c44b1ec00c7f611bf9388f76bb2324d6ca5f3&amp;utm_source=Sailthru&amp;utm_medium=email&amp;utm_campaign=02.03.25%20Business%20%26%20Economy%20SL%20JB\">tariffs</a> for one month after getting assurances from both that each nation would assist in enforcing border security and curbing the flow of illegal drugs coming across the nations’ borders. </p>\n<p>“I look forward to participating in those negotiations, with President Sheinbaum, as we attempt to achieve a ‘deal’ between our two Countries,” Trump said Monday following a call with the Mexican president.</p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/homenews/administration/5124874-china-united-states-retaliatory-tariffs/",
            "pub_date": "2025-02-04 20:45:59",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5122827,
            "title": "Trump and Congress are skipping out on the bill for mass deportations",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>Last week, President Trump signed into law the<a href=\"https://apnews.com/article/what-is-laken-riley-act-trump-immigration-2667d626139ddf5a16d1533516eab18f\"> Laken Riley Act</a>, which requires the attorney general to detain any non-citizen charged with theft or shoplifting, among other offenses. While doing so, the president <a href=\"https://www.cbsnews.com/news/trump-executive-order-guantanamo-bay-for-criminal-migrants/\">claimed there are</a> “30,000 beds in Guantanamo to detain the worst criminal illegal aliens threatening the American people.”  </p>\n<p>Both the legislation and the president’s claim about our capacity to detain non-citizens indicate the current administration has taken a page out of “Alice in Wonderland,” in which the Queen of Hearts demands “Sentence first, verdict afterward.”   </p>\n\n<p>The <a href=\"https://www.congress.gov/bill/119th-congress/senate-bill/5\">Laken Riley Act</a> mandates that non-citizens who are “charged with … arrested for … or admit (to) committing acts which constitute burglary, theft, larceny, shoplifting or assault of a law enforcement officer” be taken into federal custody. It essentially ends the presumption of innocence for non-citizens since merely being accused of one of the designated offenses will subject the person to federal detention.  </p>\n<p>The act also allows federal detention of non-citizens based solely on their admission that they committed one of the designated offenses. So law enforcement officers can now arrest someone they suspect of being a non-citizen and claim that the person admitted that they committed one of the designated offenses. That person can then be taken into federal custody without ever filing a charge in state court.  </p>\n<p>This violates one of the oldest rules of evidence: A person cannot be convicted of an offense based solely on their confession. The rule is designed to discourage officers from trying to extract confessions from someone when they have no other evidence of their guilt. </p>\n<p>However, the Laken Riley Act makes it possible to detain someone based solely on the testimony of a law enforcement officer even if there is no other evidence that a crime occurred. </p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>If that’s not alarming enough, we have the president’s claim that there are 30,000 beds in Guantanamo Bay,  a statement that can be added to his already long list of lies. While the naval base in Cuba has a detention center for suspected terrorists, it has never held more than<a href=\"https://www.nytimes.com/interactive/2021/us/guantanamo-bay-detainees.html\"> 800 detainees and currently holds just 15 people</a>. </p>\n<p>To put that 30,000 number further into perspective, the largest jail population in the United States belongs to<a href=\"https://www.vera.org/carefirstla\"> Los Angeles, where there are approximately 13,000 inmates</a>. Trump is claiming a detention facility with 15 detainees can increase by 199,900 percent and transform into our largest detention center overnight.  </p>\n\n<p>Even if there were 30,000 beds in Guantanamo Bay, you would still need people to work there. </p>\n<p>The New York City Department of Corrections, which is responsible for running Rikers Island, has roughly a<a href=\"https://comptroller.nyc.gov/reports/the-state-of-new-york-city-jails/\"> 1 to 1 ratio of uniformed staff to inmates</a>. While that might seem surprising, a detention facility needs to be staffed around the clock while maintaining sufficient staffing levels to ensure the safety of both the detainees and the officers. </p>\n<p>Only about<a href=\"https://www.nytimes.com/2021/11/26/us/politics/guantanamo-bay.html\"> 6,000 people</a> live at the Guantanamo Bay naval base. How would you possibly create the necessary infrastructure and recruit the thousands of staff to run what would, according to the president, amount to the largest jail in the U.S. — not to mention that the current cost per inmate at Guantanamo Bay is $36 million a year?</p>\n<div class=\"civic-science-article-container civic-science-more-14 civic-is-mr3\" data-civicscience-widget=\"3f127ebd-287e-0b64-a901-d55ec286348a\" id=\"civsci-id-civsci-id-596708068\"></div>\n<p>Even if Trump were honest and could actually conjure up 30,000 beds in Guantanamo, the Homeland Security Department estimates needing <a href=\"https://www.npr.org/2025/01/16/nx-s1-5262921/laken-riley-act-deportation-ice\">110,000 more detention beds</a> to meet the new demand.  </p>\n<p>Perhaps Trump’s plan isn’t to create a safe or secure detention facility. More likely, he doesn’t have a plan at all, as suggested by his actions of signing a bill that will drastically increase the number of non-citizens held in federal detention facilities that are already near capacity.  </p>\n<p>It would seem that Congress, which passed the Laken Riley Act without additional funding for Homeland Security, also doesn’t have a plan, as it’s estimated that enforcement will require an additional <a href=\"https://www.npr.org/2025/01/16/nx-s1-5262921/laken-riley-act-deportation-ice\">$26.9 billion in its first year</a>.   </p>\n\n<p>It is painfully obvious that Trump doesn’t think non-citizens deserve the basic rights guaranteed to American citizens. But apparently, the president and most members of Congress also don’t care about the safety or welfare of the American citizens who will have to pay for and work in overcrowded and dangerous detention facilities. </p>\n<p><a href=\"https://law.wisc.edu/profiles/jpgross3@wisc.edu\"><em>John Gross</em></a><em> is a clinical associate professor of law at University of Wisconsin Law School and director of the Public Defender Project. </em> </p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/opinion/immigration/5122827-trump-laken-riley-act-criticism/",
            "pub_date": "2025-02-04 20:31:03",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5124671,
            "title": "Trump’s tariff delay is ‘opportunity’ for Mexico: Ex-DEA chief",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>President Trump’s <a data-id=\"https://thehill.com/homenews/administration/5122864-trump-mexico-delay-tariffs/\" data-type=\"link\" href=\"https://thehill.com/homenews/administration/5122864-trump-mexico-delay-tariffs/\">30-day pause on tariff threats</a> against Mexico is a “step in the right direction” in strengthening the border, according to Ray Donovan, the former chief of operations for the Drug Enforcement Administration (DEA)</p>\n<p>“We have 30 days before the president is going to see if there are any advancements in this agreement,” Donovan said Monday on “<a href=\"https://www.newsnationnow.com/vargasreports/\" rel=\"noreferrer noopener\" target=\"_blank\">Elizabeth Vargas Reports.</a>” </p>\n\n<p>“It’s short-term, but I see it as a reset and opportunity for Mexico to go after the cartels,” he added.</p>\n<p>Donovan oversaw the <a data-id=\"https://thehill.com/blogs/blog-briefing-room/news/265236-mexican-president-we-caught-el-chapo/\" data-type=\"link\" href=\"https://thehill.com/blogs/blog-briefing-room/news/265236-mexican-president-we-caught-el-chapo/\">capture of Joaquin Guzman</a>, also known as “El Chapo,” the notorious head of the Sinaloa drug cartel.</p>\n<p>In a <a data-id=\"https://truthsocial.com/@realDonaldTrump/113940711907400754\" data-type=\"link\" href=\"https://truthsocial.com/@realDonaldTrump/113940711907400754\" rel=\"noreferrer noopener\" target=\"_blank\">post</a> to Truth Social, Trump said he had spoken to Mexican President Claudia Sheinbaum and negotiated assistance from Mexico to strengthen the United States’ border sovereignty and deter drug trafficking into the country.</p>\n<p>“It was a very friendly conversation wherein she agreed to immediately supply 10,000 Mexican Soldiers on the Border separating Mexico and the United States,” the president wrote.</p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>Sheinbaum also commented on the accord via social platform <a data-id=\"https://x.com/Claudiashein/status/1886434747238514776\" data-type=\"link\" href=\"https://x.com/Claudiashein/status/1886434747238514776\" rel=\"noreferrer noopener\" target=\"_blank\">social platform X</a> and, during a Monday morning news conference, said it was a “good conversation” with the president that lasted around 30 to 45 minutes.</p>\n<p>She confirmed 10,000 members of Mexico’s National Guard will be at the U.S. southern border, adding that the U.S. will work “to prevent the trafficking of high-powered weapons to Mexico.”</p>\n\n<p>She added that efforts would begin immediately regarding security and trade between both nations.</p>\n<p>The move comes after <a data-id=\"https://www.newsnationnow.com/us-news/immigration/colombia-deported-migrants-trump-showdown/\" data-type=\"link\" href=\"https://thehill.com/homenews/administration/5108055-white-house-says-us-colombia-agreement-in-place-after-back-and-forth-over-tariffs-immigration/\" rel=\"noreferrer noopener\" target=\"_blank\">concessions made by Colombia</a> following <a data-id=\"https://thehill.com/homenews/administration/5107673-trump-tariffs-colombia-deportation-flights/\" data-type=\"link\" href=\"https://thehill.com/homenews/administration/5107673-trump-tariffs-colombia-deportation-flights/\">Trump’s threat of tariffs</a> on the South American country for <a data-id=\"https://thehill.com/policy/international/5107369-colombia-president-deny-entry-deportation-flights/\" data-type=\"link\" href=\"https://thehill.com/policy/international/5107369-colombia-president-deny-entry-deportation-flights/\">initially refusing</a> to allow deported migrants to return via U.S. military aircraft.</p>\n<p><em>NewsNation’s Patrick Djordjevic contributed to this report.</em></p>\n<p><em>NewsNation is owned by Nexstar Media Group, which also owns The Hill.</em></p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/homenews/administration/5124671-donald-trump-tariff-delay-mexico-dea/",
            "pub_date": "2025-02-04 20:25:55",
            "source": "thehill",
            "language": "en"
        }
    ]
}