{
    "data": [
        {
            "id": 5756789,
            "title": "Tennessee hospital renamed as Dolly Parton Children's Hospital",
            "description": "<p>KNOXVILLE, Tenn. (<a href=\"https://www.wate.com/news/all-about-dolly-parton/east-tennessee-childrens-hospital-to-become-dolly-parton-childrens-hospital/\" rel=\"noreferrer noopener\" target=\"_blank\">WATE</a>) – <a href=\"https://www.wate.com/tag/east-tennessee-childrens-hospital\" rel=\"noreferrer noopener\" target=\"_blank\">East Tennessee Children’s Hospital</a> is being renamed in honor of Dolly Parton due to a partnership with the country music singer.</p>\n<p>The East Tennessee Children’s Hospital (ETCH) and Parton announced the news in videos posted by ETCH on Wednesday and Thursday. </p>\n<p>“I am so honored to support these doctors and nurses, and their team members and volunteers, who show up every day with courage and kindness,” Parton said. “In addition to expert care, children need hope, they need comfort, and they need to know that they are seen and valued.”</p>\n<p>Parton added that she felt “fortunate to have grown up in the mountains” of East Tennessee, where she was surrounded by “love and faith and music.”</p>\n<p>“I’ve always believed that every child deserves a fair chance to grow up healthy, hopeful, and surrounded with love,” she explained of her support for the children’s hospital system. </p>\n<div class=\"nlp-ignore-block article-content rich-text\">\n\n</div>\n<p>A <a href=\"https://www.etch.com/about-us/news/2026/a-new-era-in-pediatric-care-dolly-parton-childrens-hospital/\" rel=\"noreferrer noopener\" target=\"_blank\">press release</a> announcing the news did not disclose specific details of Parton’s support or what it entailed. But Matt Schaefer, the president and CEO of the now-Dolly Parton Children’s Hospital, indicated that the collaboration would further the facilities’ mission to provide “world-class” care.</p>\n<p>“This is more than a name change,” reads a statement attributed to Schaefer. “With Dolly’s support, we are strengthening our mission to deliver world-class pediatric care to families, ensuring every child who walks through our doors receives the treatment they deserve.”</p>\n<p>The hospital’s <a href=\"https://www.etch.com/\" rel=\"noreferrer noopener\" target=\"_blank\">website</a> added that Parton’s support would help “elevate children’s healthcare across East Tennessee and beyond.” ETCH has also launched a second website, <a href=\"https://dollychildrens.org/\" rel=\"noreferrer noopener\" target=\"_blank\">DollyChildrens.org,</a> to coincide with the name change.</p>\n<p>ETCH — now the Dolly Parton Children’s Hospital — has nearly 20 locations in East Tennessee, with its main campus in Knoxville, according to the sites.</p>",
            "kind": 1,
            "link": "https://thehill.com/policy/healthcare/5756789-dolly-parton-tennessee-hospital/",
            "pub_date": "2026-02-27 01:55:56",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5756680,
            "title": "What to know about Cuba firefight that killed 4 aboard US boat",
            "description": "<p>A shootout aboard a U.S. boat in Cuban waters on Wednesday resulted in <a href=\"https://thehill.com/policy/international/5756167-cuba-speedboat-killing-security/\">four deaths</a> and six injuries that have raised already high territorial tensions between Cuba and the U.S. </p>\n<p>U.S. and Florida officials are leading an investigation into the incident that took place off the Florida Keys and the citizenship status of those killed and wounded.</p>\n<p>The Cuban government, which was engaged in the shootout, said the majority of the 10 people on the boat “have a known history of criminal and violent activity,” according to <a href=\"https://thehill.com/homenews/ap/ap-international/ap-cuba-says-it-killed-4-people-aboard-florida-registered-speedboat-that-opened-fire-on-soldiers/\">The Associated Press</a>. The government has claimed the individuals on the boat were there for “terrorist purposes.” </p>\n<p>However, Secretary of State Marco Rubio said the U.S. was “not going to base our conclusions on what they’ve told us.”</p>\n<p>The U.S. Coast Guard and State Department are currently investigating the incident alongside law enforcement from Florida, where the boat was registered. </p>\n<p>Tensions were already high between Washington and Havana amid an ongoing oil blockade and increased pressure for Cuban regime change following President Trump’s capture of Venezuelan leader Nicolás Maduro. </p>\n<p>Here’s what to know about the incident involving Cuban officials and the U.S.-registered boat: </p>\n<h2 class=\"wp-block-heading\"><strong>Six remain in Cuban custody</strong></h2>\n<p>Florida lawmakers are pushing Cuba for answers about the identity and status of those on board the boat who Cuba detained. </p>\n<p>Officials in Havana have identified seven of the 10 passengers. Six of those identified are living, including Amijail Sánchez González, Leordan Enrique Cruz Gómez, Conrado Galindo Sariol, José Manuel Rodríguez Castelló, Cristian Ernesto Acosta Guevara and Roberto Azcorra Consuegra. </p>\n<p>The Cuban government also identified one of the four passengers killed as Michel Ortega Casanova, who was one of the four killed on the boat, according to <a href=\"https://x.com/EmbaCubaUS/status/2026838618669531238?s=20\">Cuba’s Interior Ministry</a>. </p>\n<p>Three others have not yet been identified. Two are under criminal investigation by the foreign government.</p>\n<p>Rep. Carlos A. Giménez (R-Fla.) said during a Thursday appearance on Fox News that the six injured individuals onboard the boat are receiving medical treatment at an unspecified location in Cuba.</p>\n<p>“I think that our ambassador is trying to get access to those individuals and so far, I don’t think he has had access to them … ,” Giménez told Fox. </p>\n<p>“The original story was they were transporting human smuggling and now they’re terrorists. They are changing their story and we need to get to the bottom of it,” he added.</p>\n<p>The Cuban-born Florida representative said he is hoping to speak with his constituents to hear their side of the story after those onboard the boat were accused of opening fire on Cuban authorities. </p>\n<p>Cuba is roughly 90 miles south of Key West, Fla. Trump recently placed an oil embargo on Cuba and is preventing trading partners from providing oil to the island, leaving those on shore in dire straits as the lack of fuel threatens stability with transportation, hospitals and electricity.</p>\n<h2 class=\"wp-block-heading\"><strong>Havana accuses individuals of infiltration, terrorism</strong></h2>\n<p>Leaders in Havana initially said the individuals were on a speedboat and were “sent” by the U.S. to infiltrate the country and threaten national stability. </p>\n<p>The Communist Party has maintained rule over the island for over 60 years and has disparagingly acknowledged international pressures for regime change. </p>\n<p>“Cuba has had to face numerous terrorist and aggressive infiltrations from the United States since 1959, with a high cost in lives, injuries, and material damage. A rigorous investigation is being carried out to clarify the facts,” Cuban diplomat Bruno Rodríguez Parrilla wrote in a <a href=\"https://x.com/EmbaCubaUS/status/2027000599284248733?s=20\">post</a> on the social platform X.</p>\n<p>“The defense of Cuba’s coasts, national territory, and national security is an unavoidable duty,” he added.</p>\n<p>The Cuban Interior Ministry said it also seized assault rifles, handguns, Molotov cocktails, bullet-proof vests, telescopes and camouflage uniforms that were on the boat, as reported by <a href=\"https://time.com/7381346/cuba-florida-speedboat-shooting-terrorism-oil-energy-crisis-rubio-us/\">Time</a>.</p>\n<p>The Cuban Defense Ministry <a href=\"https://x.com/EmbaCubaUS/status/2026838618669531238?s=20\">said</a> an individual named Hernández Santos confessed to being sent from the United States to facilitate the landing and reception of the armed group on board the boat.</p>\n<p>The Cuban Embassy in the U.S. said it detected a “<a href=\"https://x.com/EmbaCubaUS/status/2026732911114760673\">violating speedboat</a>” up to 1 nautical mile northeast of the El Pino channel, in Cayo Falcones, Corralillo municipality, Villa Clara province.</p>\n<p>Five members of Cuba’s Border Guard Troops approached the vessel for identification when those onboard the boat opened fire, injuring a commander, per the Embassy. </p>\n<h2 class=\"wp-block-heading\"><strong>Lawmakers call for an investigation</strong></h2>\n<p>A band of lawmakers in Congress have called for a formal investigation into the shooting.</p>\n<p>Sen. Rick Scott (R-Fla.) backed Giménez’s call for an investigation.</p>\n<p>“I agree with<a href=\"https://x.com/RepCarlos\"> @RepCarlos</a>. We need a full investigation into this deeply concerning situation and to determine what happened. The Communist Cuban regime must be held accountable!” Scott wrote in a <a href=\"https://x.com/SenRickScott/status/2026762373353165312?s=20\">post</a> on X.</p>\n<p>Giménez has also called into question the kind of boat the vessel actually was, doubting that it was a speedboat, as had been described by the Cuban government. </p>\n<p>“It is a 24-foot open fisherman with 1300 horsepower engine and ten people on it won’t go very fast,” he told Fox News. </p>\n<p>Florida Attorney General James Uthmeier said he’s “directed the Office of Statewide Prosecution to work with our federal, state, and law enforcement partners to begin an investigation. The Cuban government cannot be trusted, and we will do everything in our power to hold these communists accountable,” he said in a <a href=\"https://x.com/AGJamesUthmeier/status/2026750551338205242?s=20\">post</a> on X.</p>",
            "kind": 1,
            "link": "https://thehill.com/policy/international/5756680-investigation-cuban-boat-shootout/",
            "pub_date": "2026-02-27 01:55:56",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5756822,
            "title": "Judge declines to halt White House ballroom construction",
            "description": "<p>A federal judge on Thursday declined to halt President Trump’s White House ballroom construction project at the request of preservationists who sued. </p>\n<p>U.S. District Judge Richard Leon said the National Trust for Historic Preservation, which sought to block the $400 million project, did not properly challenge the renovations, but could amend its complaint, and the judge would reconsider.  </p>\n<p>“Until then, however, I have no choice but to deny Plaintiff’s motion for a preliminary injunction for lack of likelihood of success on the merits,” the judge wrote.  </p>\n<p>The preservationists sought to stop construction of the new ballroom until the White House abides by federal law and other rules, such as obtaining congressional approval.  </p>\n<p>The project is being funded mostly by private donors and is <a href=\"https://thehill.com/homenews/administration/5651225-white-house-ballroom-completion-2028/\" rel=\"noreferrer noopener\" target=\"_blank\">slated for completion</a> by 2028. </p>\n<p><em>DEVELOPING</em></p>",
            "kind": 1,
            "link": "https://thehill.com/regulation/court-battles/5756822-judge-declines-halt-trump-white-house-construction/",
            "pub_date": "2026-02-27 01:55:55",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5755893,
            "title": "Georgia is becoming Iran's sanctions evasion hub",
            "description": "<p>Tbilisi’s TV Tower <a href=\"https://oc-media.org/tbilisi-marks-irans-islamic-revolution-amidst-ongoing-government-crackdown/\" rel=\"noreferrer noopener\" target=\"_blank\">lit up</a> in the colors of the Islamic Republic on Feb. 11 to mark the anniversary of the 1979 revolution that brought Iran’s theocratic rulers to power. The streets in Tbilisi tell a different story: Ordinary Georgians have <a href=\"https://www.foxnews.com/world/georgian-demonstrators-watch-iran-closely-own-protests-grind?msockid=397a971568a9680b0c0f816169f96962\" rel=\"noreferrer noopener\" target=\"_blank\">rallied</a> behind the Iranian people in their struggle against the clerical regime. </p>\n<p>These Georgians fear their own increasingly authoritarian ruling party, Georgian Dream, is becoming more like Tehran’s dictatorship. But that has not stopped Georgian Dream from pursuing closer ties with Iran, handing Tehran an avenue to circumvent U.S. sanctions.</p>\n<p>A new <a href=\"https://civicidea.ge/en/behind-the-barrels-iranian-oil-and-political-ties-in-georgia/\" rel=\"noreferrer noopener\" target=\"_blank\">report</a> by the Georgian NGO Civic IDEA provides a clear snapshot of this burgeoning relationship. It finds that 72 companies registered in Georgia imported Iranian oil and petroleum products from 2022 to 2025. These importers include companies linked to Georgian Dream donors, state tenders, and public officials, including a former Georgian Dream member of Parliament.</p>\n<p>Iran’s strategic objective is to ensure access to foreign markets despite American sanctions. <a href=\"https://www.tabnak.ir/fa/news/737581/%DA%A9%D8%B4%D9%88%D8%B1%DB%8C-%DA%A9%D9%87-%D8%AF%D8%B1%D9%88%D8%A7%D8%B2%D9%87-%D9%88%D8%B1%D9%88%D8%AF-%D8%A7%DB%8C%D8%B1%D8%A7%D9%86-%D8%A8%D9%87-%D8%A8%D8%A7%D8%B2%D8%A7%D8%B1-%D8%A7%D8%B1%D9%88%D9%BE%D8%A7%D8%B3%D8%AA\" rel=\"noreferrer noopener\" target=\"_blank\">Iranian officials describe</a> Georgia as a favorable route for exporting Iranian goods to the European Union. In late 2021, Iran, Azerbaijan and Georgia <a href=\"https://forbes.ge/irani-azerbaijani-da-saqarthvelo-akhali-satranzito-marshrutis-sheqmnaze-shethankhmdnen/\" rel=\"noreferrer noopener\" target=\"_blank\">agreed to cultivate</a> a transit corridor linking Iran’s Persian Gulf ports to Georgia’s Black Sea ports of Batumi and Poti. In addition to moving licit goods, this corridor can facilitate sanctions-busting by obscuring the Iranian origin of illicit cargoes.</p>\n<p>After Georgian Dream assumed power in 2012, the country’s annual trade with Iran <a href=\"https://transparency.ge/en/post/georgia-politically-and-economically-moving-closer-iran\" rel=\"noreferrer noopener\" target=\"_blank\">nearly tripled</a> to $322 million by 2024. The vast majority, $285 million, consisted of imports from Iran. Meanwhile, the number of Iranian companies registered in Georgia has <a href=\"https://www.transparency.ge/en/post/georgia-politically-and-economically-moving-closer-iran#:~:text=companies%20in%20Georgia%20%E2%80%93-,four%20times%20more,-than%20the%20number\" rel=\"noreferrer noopener\" target=\"_blank\">exploded</a>, reaching <a href=\"https://www.rferl.org/a/iran-businesses-georgia-sanctions-evasion/33568509.html\" rel=\"noreferrer noopener\" target=\"_blank\">nearly 13,000</a> as of 2025.</p>\n<p>Many of those Iranian firms are <a href=\"https://www.radiotavisupleba.ge/a/%E1%83%98%E1%83%A0%E1%83%90%E1%83%9C%E1%83%A3%E1%83%9A%E1%83%98-%E1%83%99%E1%83%9D%E1%83%9B%E1%83%9E%E1%83%90%E1%83%9C%E1%83%98%E1%83%94%E1%83%91%E1%83%98-%E1%83%A4%E1%83%98%E1%83%A5%E1%83%AA%E1%83%98%E1%83%A3%E1%83%A0-%E1%83%9B%E1%83%98%E1%83%A1%E1%83%90%E1%83%9B%E1%83%90%E1%83%A0%E1%83%97%E1%83%94%E1%83%91%E1%83%96%E1%83%94/33554602.html\" rel=\"noreferrer noopener\" target=\"_blank\">tied</a> to a small number of addresses, often indicative of illicit activity. For example, some 700 Iranian companies were registered at one address in Tbilisi, while another 800 were registered in Dunta, a small rural village in western Georgia, roughly 105 miles from the capital. Iranian consultancies openly <a href=\"https://www.rferl.org/a/iran-businesses-georgia-sanctions-evasion/33568509.html\" rel=\"noreferrer noopener\" target=\"_blank\">coach</a> clients to register companies near Georgian ports and rebrand goods as “Made in Georgia.”</p>\n<p>In one sanctions-busting scheme <a href=\"https://home.treasury.gov/news/press-releases/jl2287\" rel=\"noreferrer noopener\" target=\"_blank\">revealed</a> by the U.S. Treasury Department in 2014, several Iranian individuals <a href=\"https://civicidea.ge/wp-content/uploads/2025/07/Iran-ENG.pdf\" rel=\"noreferrer noopener\" target=\"_blank\">established multiple companies in Georgia</a> and surreptitiously acquired a 70 percent stake in Georgia’s InvestBank. They used that bank for transactions totaling roughly $8 million with Iranian banks that were under U.S. sanctions.</p>\n<p>At the time, the U.S. Treasury praised the Georgian government for working “closely” with Washington to counter illicit Iranian activity. But as U.S.-Georgian relations have frayed amid democratic backsliding by Georgian Dream, that cooperation is under greater strain.</p>\n<p>Meanwhile, Tbilisi has pursued closer political ties with Iran. In May 2024, Georgian Prime Minister Irakli Kobakhidze attended the <a href=\"https://1tv.ge/lang/en/news/pm-fm-attend-funeral-service-of-irans-late-president/\" rel=\"noreferrer noopener\" target=\"_blank\">funeral</a> of Iran’s former president, Ebrahim Raisi, <a href=\"https://www.nytimes.com/2024/05/22/world/middleeast/iran-president-raisi-funeral.html\" rel=\"noreferrer noopener\" target=\"_blank\">alongside</a> officials from Hamas, Hezbollah, the Taliban, and Russia. Kobakhidze <a href=\"https://georgia.mfa.gov.ir/en/newsview/750557/Prime-Minister-of-Georgia-Meets-with-President-of-Iran\" rel=\"noreferrer noopener\" target=\"_blank\">returned</a> the following July for the inauguration of Iran’s new president, Masoud Pezeshkian.</p>\n<p>The next year, Georgian Deputy Prime Minister Aleksandre Khvtisiashvili <a href=\"https://oc-media.org/georgian-official-attends-iranian-embassy-event-commemorating-those-killed-in-iran-israel-war/\" rel=\"noreferrer noopener\" target=\"_blank\">attended</a> an event at the Iranian embassy commemorating what Tehran described as “martyrs” killed in the 12-Day War between Iran and Israel. According to the embassy, Khvtisiashvili “made entries in the condolence book at the Embassy” and “expressed condolences and solidarity to Iran,” drawing a <a href=\"https://www.radiotavisupleba.ge/a/33462165.html?ref=oc-media.org\" rel=\"noreferrer noopener\" target=\"_blank\">protest</a> from Israel.</p>\n<p>Researchers have also <a href=\"https://dfrlab.org/2023/04/27/iran-linked-website-targets-georgias-ethnic-azerbaijani-community-with-anti-west-content/\" rel=\"noreferrer noopener\" target=\"_blank\">documented</a> Iran-linked media activity targeting minority communities in Georgia with anti-Western messaging and narratives sympathetic to Tehran and Moscow. These influence operations matter because they reduce friction: The more Tehran can shape perceptions and polarize communities, the easier it is to operate commercially and politically.</p>\n<p>The United States is <a href=\"https://www.fdd.org/analysis/2026/02/13/vance-visit-to-armenia-and-azerbaijan-signals-u-s-push-into-region-dominated-by-russia/\" rel=\"noreferrer noopener\" target=\"_blank\">investing</a> political capital in the South Caucasus by brokering deals, financing infrastructure, and trying to build transit and energy corridors that bypass Russia and Iran. But Georgia, once America’s closest friend in the region, is undermining that strategy by creating a permissive hub for adversary influence and sanctions evasion. </p>\n<p>Washington should make clear that Tbilisi will face consequences. The Treasury Department should aggressively penalize Georgia-based individuals and entities involved in sanctions-evasion, especially where <a href=\"https://civicidea.ge/en/behind-the-barrels-iranian-oil-and-political-ties-in-georgia/\" rel=\"noreferrer noopener\" target=\"_blank\">those networks overlap</a> with persons connected to Georgia Dream.</p>\n<p>In concert, the U.S. should pair sanctions enforcement with renewed pressure on Tbilisi over its democratic backsliding. These are not separate problems. The environment that enables Georgian Dream to <a href=\"https://freedomhouse.org/country/georgia/freedom-world/2025\" rel=\"noreferrer noopener\" target=\"_blank\">crush</a> watchdogs, intimidate media, and concentrate power is the same environment that makes sanctions evasion easier to operationalize and harder to investigate.</p>\n<p>To add teeth to U.S. diplomatic warnings, Washington should expand and strictly enforce targeted sanctions against Georgia Dream officials, propagandists, and financiers involved in corruption, electoral manipulation, and human rights abuses. For starters, Treasury should build on its <a href=\"https://ofac.treasury.gov/recent-actions/20241227\" rel=\"noreferrer noopener\" target=\"_blank\">2024 designation</a> of Bidzina Ivanishvili, the billionaire who rules Georgia behind the scenes, by tracking and targeting his assets, which he likely has <a href=\"https://www.bbc.com/news/articles/cj91xgylkwlo\" rel=\"noreferrer noopener\" target=\"_blank\">attempted</a> to shield.</p>\n<p>The tower lighting was a message. The U.S. needs to send Georgia a strong message back — not just with words, but with action.</p>\n<p><em>Keti Korkiya is a research analyst in the Russia Program at the Foundation for Defense of Democracies.</em></p>",
            "kind": 1,
            "link": "https://thehill.com/opinion/international/5755893-georgia-dream-iran-ties/",
            "pub_date": "2026-02-27 01:36:17",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5756578,
            "title": "NJ mayor demands probe after ICE chase leads to chain-reaction collision",
            "description": "<p>NEW JERSEY (<a href=\"https://pix11.com/news/local-news/nj-mayor-demands-probe-after-ice-chase-leads-to-chain-reaction-collision/\" rel=\"noreferrer noopener\" target=\"_blank\">WPIX</a>) – A high-speed pursuit involving federal immigration agents ended in a chain-reaction crash Wednesday in Newark, sending several people, including schoolchildren, to the hospital and prompting calls for a state investigation.</p>\n<p>Newark Mayor Ras Baraka said U.S. Immigration and Customs Enforcement (ICE) agents caused the crash by illegally chasing a man through city streets Wednesday morning.</p>\n<p>The pursuit ended when vehicles connected to the operation collided with three civilian cars, witnesses and city officials said.</p>\n<div class=\"nlp-ignore-block article-content rich-text\">\n\n</div>\n<p>Shamad Davis, who witnessed the incident, said immigration agents began chasing a man driving a work van at high speed before the situation spiraled into a crash.</p>\n<p>“He flew up the hill and they started chasing him,” Davis said. “Next thing you know, it was a full collision and all three cars were totaled.”</p>\n<p>Three young siblings riding in a Lyft on their way to school were inside one of the vehicles struck during the crash, according to Newark Public Safety officials. Davis said the children appeared shaken and injured after the collision.</p>\n<p>“One was hysterical and couldn’t control herself,” he said. “Another complained her head was hurting, and the boy said his ankle was injured.”</p>\n<p>Video from the scene showed the children’s mother angrily confronting masked federal agents as emergency crews treated victims nearby. A crowd of residents gathered, shouting at immigration officers as tensions escalated.</p>\n<figure class=\"wp-block-image size-full\"><img alt=\"Chase involving ICE vehicles results in crash in Newark\" class=\"wp-image-747655\" decoding=\"async\" src=\"https://www.nxsmediawire.com/wp-content/uploads/sites/107/2026/02/ICE-CHASE.png?strip=1\"/><figcaption class=\"wp-element-caption\">A high-speed pursuit involving federal immigration agents ended in a chain-reaction crash Wednesday in Newark’s South Ward, sending several people, including schoolchildren, to the hospital and prompting calls for a state investigation. (WPIX)</figcaption></figure>\n<p>Immigrant advocates criticized federal enforcement tactics, arguing civil immigration matters should not involve dangerous vehicle pursuits.</p>\n<p>“It’s not up to ICE to be chasing people around,” said Amy Torres, executive director of the New Jersey Alliance for Immigrant Justice. “Whether someone has charges or convictions is a matter for the criminal legal system.”</p>\n<p>The man targeted by agents was seen being taken to a hospital on a stretcher. It’s unclear what happened following his hospitalization. Authorities said no life-threatening injuries were reported.</p>\n<p>Torres noted that a similar immigration-related pursuit earlier this month in Georgia ended in a fatal crash involving a Savannah schoolteacher, raising broader concerns about enforcement practices.</p>\n<p>Baraka said the city plans to submit police reports and evidence to the New Jersey attorney general’s office, urging an investigation into what he described as an illegal pursuit.</p>\n<p>“We’re going to use the police report and information we have and ask the governor and attorney general to take action and pursue this,” the mayor said.</p>\n<div class=\"nlp-ignore-block article-content rich-text\">\n\n</div>\n<p>Hours after the crash, Baraka signed an executive order banning immigration enforcement operations inside Newark city buildings without a judicial warrant. The order also directs city employees to report suspected unauthorized federal enforcement activity.</p>\n<p>Nexstar’s WPIX reached out to federal immigration officials who have not publicly commented on the incident as of Wednesday night.</p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/state-watch/5756578-ice-car-crash-new-jersey/",
            "pub_date": "2026-02-27 01:36:17",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5756715,
            "title": "Columbia says immigration officials detained a student after misrepresenting reason for entering school building",
            "description": "<p>Columbia University said Thursday that federal immigration officials detained a student after misrepresenting their purpose for entering a school building. </p>\n<p>Columbia <a data-id=\"https://president.columbia.edu/news/important-update-columbia-university\" data-type=\"link\" href=\"https://president.columbia.edu/news/important-update-columbia-university\">said that early this morning</a> federal agents from the Department of Homeland Security (DHS) went into a residential building owned by the university and detained a student. </p>\n<p>“Our understanding at this time is that the federal agents made misrepresentations to gain entry to the building to search for a ‘missing person.’ We are working to gather more details,” said Claire Shipman, acting president of the university. </p>\n<p>She added that DHS officers need a judicial warrant or subpoena to enter non-public buildings, writing, “An administrative warrant is not sufficient.” </p>\n<p>“If law enforcement agents seek entry to non-public areas of the University, ask the agents to wait to enter any non-public areas until contacting Public Safety. Public Safety will contact the Office of the General Counsel to coordinate the University’s response. Do not allow them to enter or accept service of a warrant or subpoena,” Shipman said. </p>\n<p>Columbia said it is working to gather more information and provide legal support to the student’s family. </p>\n<p>The Hill has reached out to DHS for comment.  </p>\n<p>The incident comes a year after the <a href=\"https://thehill.com/regulation/court-battles/5398448-mahmoud-khalil-trump-administration-detention-example/\" rel=\"noreferrer noopener\" target=\"_blank\">high-profile arrest</a> of Mahmoud Khalil, a recent graduate of the university and one of the leaders of its pro-Palestinian movement. He has since been released, but <a data-id=\"https://thehill.com/regulation/court-battles/5690897-appeals-court-rules-against-khalil/\" data-type=\"link\" href=\"https://thehill.com/regulation/court-battles/5690897-appeals-court-rules-against-khalil/\">his legal fight is not over</a>, and the government is still threatening to deport him.</p>\n<p>In July, <a data-id=\"https://thehill.com/homenews/ap/ap-u-s-news/ap-columbia-trump-deal-federal-funding/\" data-type=\"link\" href=\"https://thehill.com/homenews/ap/ap-u-s-news/ap-columbia-trump-deal-federal-funding/\">Columbia reached an agreement</a> with the Trump administration to pay more than $220 million in order to restore frozen federal research funding.</p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/education/5756715-columbia-immigration-dhs-student-arrest/",
            "pub_date": "2026-02-27 01:26:01",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5756632,
            "title": "NYPD arrests man for allegedly assaulting officers during snowball fight",
            "description": "<p>The New York City Police Department arrested a 27-year-old man for allegedly assaulting officers with snow and ice on Monday during a <a href=\"https://thehill.com/homenews/state-watch/5753113-mayor-mayor-nypd-snowball/\">massive snowball fight</a> in Washington Square Park on Monday.</p>\n<p>Gusmane Coulibaly was taken into custody Thursday morning, the NYPD said, noting he was also arrested less than three weeks ago for attempted robbery in the transit system.</p>\n<p>The arrest is the latest development in a political rift that has emerged between New York City Mayor Zohran Mamdani (D) and Police Commissioner Tisch after video circulated on social media showing NYPD officers getting pelted with snowballs and snow chunks on Monday after they were called in to control an escalating citywide snowball fight during a historic blizzard. </p>\n<p>Encounters with police officers were caught on video. Some began showing the officers apparently brushing off the snowballs they faced as they walked through the park, but others showed the increasingly tense dynamic as larger chunks of snow and snowballs came hurling in their direction, including at their faces and necks, and a crowd began chasing them. </p>\n<p>While the officers largely did not engage with the individuals, a couple officers were seen shoving people off of them as they retreated. The police later said two officers were taken to a nearby hospital for treatment. </p>\n<p>Tisch responded to footage of the incident by condemning the “individuals attacking cops” and characterizing the behavior as “disgraceful” and “criminal,” as she said her detectives were investigating the situation. </p>\n<p>Mamdani at first urged the public to treat police officers with respect, thanking them for their help during the blizzard. But he characterized the footage as “kids throwing snowballs” and later said he didn’t think anyone should be charged in connection to the fight.</p>\n<p>Mamdani’s response earned broad condemnation from critics, including the largest police union, which blasted Mamdani’s “failure of leadership.”</p>\n<p>“By ignoring their injuries and dismissing the incident, the mayor has sent a disgraceful message to every police officer who serves this city, and a dangerous message to every person who might be looking to attack a police officer in the future,” Patrick Hendry, president of the Police Benevolent Association, said in a statement Tuesday.</p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/state-watch/5756632-nyc-snowball-fight-arrest/",
            "pub_date": "2026-02-27 01:16:53",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5756686,
            "title": "Huckabee: Carlson saying Israel pushing around Trump 'offensive'",
            "description": "<p>U.S. Ambassador to Israel Mike Huckabee said Wednesday that it was “offensive” for conservative pundit Tucker Carlson to suggest in a recent interview that President Trump was taking cues from the Israeli government on foreign policy.</p>\n<p>“It’s very offensive to think that President Trump is, as Tucker Carlson characterized it, somebody who is being pushed around by Israel. That is the most nonsensical thing,” Huckabee told News Nation’s Leland Vittert on “<a href=\"https://www.newsnationnow.com/on-balance-with-leland-vittert/\">On Balance</a>.”</p>\n<p>Carlson and Huckabee both made <a href=\"https://thehill.com/policy/international/5749053-huckabee-israel-middle-east-takeover-carlson-interview/\">several provocative remarks</a> during an interview at Ben Gurion Airport in Tel Aviv, Israel, earlier this month.</p>\n<p>The <a href=\"https://thehill.com/homenews/ap/ap-international/ap-us-ambassador-causes-uproar-by-claiming-israel-has-a-right-to-much-of-the-middle-east/\">heated sit-down</a> came amid <a href=\"https://thehill.com/homenews/house/5428783-republicans-israel-gaza/\">a rift within the Republican Party</a> over Israel that has widened since the war in Gaza began. While the GOP has historically been united in support of the U.S. ally, some members of the far right have recently pushed for a more isolationist approach.</p>\n<p>Carlson has long accused U.S. officials — including Huckabee — of prioritizing Israel’s interests over America’s. His critics, in turn, have <a href=\"https://thehill.com/homenews/media/5592049-tucker-carlson-conservative-civil-war/\">condemned his commentary</a> on Israel as echoing antisemitic themes and conspiracy theories.</p>\n<p>“I don’t know where this is coming from,” Huckabee responded after Vittert asked about the “anti-Israel cancer” spreading through the party. “I don’t know if it’s because of the influence of significant amounts of money from Arab countries. I don’t know. I think it would be nice if we did know.”</p>\n<p>“But what I do fully understand is that this is divisive to the Republican Party, divisive to America, and it’s based on lies and half-truths, and that’s what’s concerning to me,” he added.</p>\n<p>Huckabee labeled some of Carlson’s comments in the interview as “alarming and very, very disrespectful and disparaging” toward Trump. He said he hoped Carlson apologized during a reported visit to the White House on Wednesday.</p>\n<p>“Look, it doesn’t matter what Tucker Carlson thinks about me. I’m expendable,” Huckabee said.</p>\n<p>“It does matter what he thinks about President Trump and his administration and President Trump’s leadership is the world leader and the head of both foreign policy and domestic policy,” he continued.</p>\n<p>Trump <a href=\"https://thehill.com/policy/international/5746010-trump-board-of-peace-takeaways/\">convened the first meeting</a> of his <a href=\"https://thehill.com/policy/international/5745297-trump-funding-board-of-peace/\">Board of Peace</a> last week, a group of world leaders tasked with supervising postwar restoration efforts in Gaza, including the disarmament of Hamas, as part of the second phase of the president’s <a href=\"https://thehill.com/policy/international/5688828-trump-gaza-peace-plan-phase2/\">20-point peace plan</a>.</p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/administration/5756686-huckabee-offensive-carlson-trump-israel/",
            "pub_date": "2026-02-27 01:16:53",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5756722,
            "title": "FBI fires agents who worked on Trump Mar-a-Lago investigation",
            "description": "<p>The FBI has fired additional agents who worked on cases involving President Trump, including several who worked on the Mar-a-Lago documents case. </p>\n<p>A source who confirmed the firings to The Hill said at least 10 agents were removed Wednesday. </p>\n<p>The dismissals are just the latest in a wave of firing of FBI and Justice Department personnel who worked on the cases involving Trump. </p>\n<p>The FBI Agents Association blasted the move as weakening the bureau. </p>\n<p>“The FBIAA condemns today’s unlawful termination of FBI Special Agents, which—like other firings by Director Patel—violates the due process rights of those who risk their lives to protect our country,” the group said in a statement. </p>\n<p>“These actions weaken the Bureau by stripping away critical expertise and destabilizing the workforce, undermining trust in leadership and jeopardizing the Bureau’s ability to meet its recruitment goals—ultimately putting the nation at greater risk.”</p>\n<p>Trump was charged with violating the Espionage Act and obstruction of justice after he was found to have 300 documents with classified markings in his Florida estate. The case asserted Trump likewise ordered the documents moved to hide them from authorities and his own lawyer. </p>\n<p>The FBI previously fired agents who worked on the case charging Trump for his conduct related to Jan. 6.</p>\n<p>The Justice Department has similarly engaged in sweeping firings of prosecutors who worked on the Trump cases, as well as those who brought charges against rioters who stormed the Capitol that day. </p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/administration/5756722-fbi-trump-case-agent-firings/",
            "pub_date": "2026-02-27 01:16:52",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5756617,
            "title": "Rove says he'd bet on Talarico to win Texas Senate primary",
            "description": "<p>Republican strategist Karl Rove said Thursday that he would bet on Texas state Rep. James Talarico (D) to win the key Democratic U.S. Senate primary over Rep. Jasmine Crockett (D-Texas), a race that is being closely watched by political observers.</p>\n<p>“Polling in a primary is difficult, particularly in a state like Texas, because we don’t have party registration. You can vote in any primary you want. So, it’s very difficult to go about — So, if you look at the recent Dem[ocratic] polls, 43-47 Crockett over Talarico, 56-44 Crockett over Talarico, 38-37, Texas [Public] Opinion Research,” Rove said on Fox News’s “America’s Newsroom.”</p>\n<p>“Most of these polls were conducted before the [Stephen] Colbert incident, and he’s now gotten a large number of views [because] of that. If I were a betting man, I’d bet on Talarico,” he added, referencing the “Late Show” host <a data-id=\"https://thehill.com/homenews/campaign/5744369-cbs-late-show-controversy/\" data-type=\"link\" href=\"https://thehill.com/homenews/campaign/5744369-cbs-late-show-controversy/\">saying</a> CBS told him not to air Talarico’s appearance on his show.</p>\n<p>Crockett had a double-digit <a data-id=\"https://thehill.com/homenews/campaign/5755382-jasmine-crockett-leads-texas-senate/\" data-type=\"link\" href=\"https://thehill.com/homenews/campaign/5755382-jasmine-crockett-leads-texas-senate/\">lead</a> over Talarico in a recent University of Texas/Texas Politics Project Poll. The poll found Crockett ahead of Talarico, 56 to 44 percent, among likely Democratic primary voters in Texas.</p>\n<p>Democrats have sought to score electoral wins in Texas in recent years, but have come up short in many instances including former Rep. Beto O’Rourke’s (D-Texas) unsuccessful challenge against conservative stalwart Sen. Ted Cruz (R-Texas) in 2018.</p>\n<p>Both Talarico and Crockett are vying for Sen. John Cornyn’s (R-Texas) seat. </p>\n<p>On Monday, Cornyn <a data-id=\"https://thehill.com/homenews/campaign/5752512-cornyn-warns-texas-crack-red-wall/\" data-type=\"link\" href=\"https://thehill.com/homenews/campaign/5752512-cornyn-warns-texas-crack-red-wall/\">said</a> a Democrat taking his seat would be “the first crack in the red wall.” He said that either Talarico or Crocket “absolutely” has a shot of winning in the Lone Star State, especially in the case that they face off against Texas Attorney General Ken Paxton (R) in November.</p>\n<p>Republicans are currently dealing with issues such as affordability, files linked to convicted sex offender Jeffrey Epstein and backlash toward President Trump’s immigration agenda heading into this year’s midterm elections.</p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/campaign/5756617-texas-democrat-senate-primary-karl-rove-james-talarico/",
            "pub_date": "2026-02-27 01:06:03",
            "source": "thehill",
            "language": "en"
        }
    ]
}