{
    "data": [
        {
            "id": 5126312,
            "title": "Trump turns up the heat on public broadcasters",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>President Trump and his allies are showing renewed vigor as they set their crosshairs on a longtime target for the right: public media. </p>\n<p>Recent moves by the Federal Communications Commission (FCC) and Republican lawmakers scrutinizing outlets like NPR and PBS over perceptions of liberal bias and taxpayer funding have highlighted the GOP’s willingness to use the power of the federal government to make life difficult for outlets Trump feels have treated him unfairly. </p>\n\n<p>Trump has telegraphed plans to take on NPR for years, celebrating an essay from a former editor who publicly accused the outlet of bias last year by vowing to give it no more public funding and describing it as a scam.</p>\n<p>With Trump now in the White House, allies have begun turning up the heat.</p>\n<p>“Trump has aggressively targeted these organizations and now has the administrative muscle to do something about it,” said Tobe Berkovitz, a Boston University professor who specializes in the media.</p>\n<p>The effort was punctuated last week in a letter from FCC Chair Brendan Carr to NPR and PBS leadership saying he planned to launch an investigation into member stations airing sponsorships.</p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>Federal law prohibits public broadcasters from selling commercial sponsorships, but the outlets are allowed to broadcast public underwriting spots paid for by private donors.</p>\n<p>The majority of NPR’s and PBS’s funding comes from private sponsorships and user contributions. The outlets also receive a smaller portion of their financing from the federal government and member stations.</p>\n\n<p>NPR said in a statement to The Hill it is “confident any review of our programming and underwriting practices will confirm NPR’s adherence to these rules.”</p>\n<p>GOP lawmakers are putting a spotlight on NPR and PBS, too.</p>\n<p>On Monday, a House subcommittee on government efficiency headed by Rep. Marjorie Taylor Greene (R-Ga.) called on the outlets’ executives to testify at a hearing concerning “the systemically biased news coverage produced on behalf of federally funded radio and TV stations.”</p>\n<div class=\"civic-science-article-container civic-science-more-14 civic-is-mr3\" data-civicscience-widget=\"3f127ebd-287e-0b64-a901-d55ec286348a\" id=\"civsci-id-civsci-id-596708068\"></div>\n<p>“Since its inception, NPR has collaborated with local nonprofit public media organizations to fill critical needs for news and information in America’s communities,” NPR said in a statement to The Hill. “We welcome the opportunity to discuss the critical role of public media in delivering impartial, fact-based news and reporting to the American public.”</p>\n<p>The latest targeting of public broadcasters comes as the White House has embraced more social and independent media platforms in lieu of mainstream news outlets, several of which the president decried or sued along the campaign trial.</p>\n<p>Some observers pointed to a line in Carr’s letter that questioned “why Congress should continue sending taxpayer dollars to NPR and PBS given the changes in the media marketplace since the passage of the Public Broadcasting Act of 1967.”</p>\n\n<p>Ellen Goodman, a professor of media policy and law at Rutgers, noted that comment was a telling one.</p>\n<p>“The public broadcasters have struggled for a long time with diversifying their audiences not just in terms of age but across all demographics,” Goodman said. “Still, it’s clear from Carr’s rhetoric there certainly is an interest in going after media whose content is objectionable, and that presents a big First Amendment problem.”</p>\n<p>Several journalists at NPR and member stations declined to comment on the record when contacted by The Hill. The White House did not respond to a request for comment.</p>\n\n<p>NPR has long been on the receiving end of attacks from conservatives and allies of the current administration. It famously left the social platform X after owner Elon Musk attached an official “state media” label to its account.</p>\n<p>Musk, who now leads Trump’s Department of Government Efficiency, on Monday reiterated calls to “defund NPR,” saying the outlet “should survive on its own.”</p>\n<p>FCC Commissioner Anna M. Gomez, who was nominated to her position by former President Biden in 2023, criticized Carr’s posture.</p>\n\n<p> “This appears to be yet another Administration effort to weaponize the power of the FCC,” she <a href=\"https://x.com/AGomezFCC/status/1885047186028728499\" rel=\"noreferrer noopener\" target=\"_blank\">wrote in a post</a> on social media responding to Carr’s letter. “The FCC has no business intimidating and silencing broadcast media.”</p>\n<p>It is unclear how far the Trump administration will go in its efforts toward NPR and other public media outlets, though some are anticipating it could reach a fever pitch.</p>\n<p>“NPR opens itself up to criticism from people who don’t want them around because they’re getting some government funding,” said Juan Williams, who worked at the public broadcaster for a decade before becoming a senior political analyst at Fox News.</p>\n\n<p>“My concern is now the Trump people are saying they don’t even think they should have [private] underwriters because they see that as a way to absolutely kill them off.”</p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/media/5126312-trump-targets-public-media-outlets/",
            "pub_date": "2025-02-05 19:10:56",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5126353,
            "title": "Bottom Line: NFL and MLB sign PhronesisDC",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>The <strong>​National Football League</strong> and ​<strong>Major League Baseball</strong> <a href=\"https://lda.senate.gov/filings/public/filing/0d1413c3-3aeb-4e7b-bbdc-382c7ce0d1f3/print/\">both</a> <a href=\"https://lda.senate.gov/filings/public/filing/49ea1cf8-74f8-4616-b5db-b3f3c19018f8/print/\">drafted</a><strong> PhronesisDC</strong> to lobby on issues related to tax policy as Republicans prepare to pass a follow up to the 2017 Tax Cuts and Jobs Act. Brendan Dunn, former policy adviser and counsel to then-Senate Republican Leader Mitch McConnell (R-Ky.), will work on the accounts.</p>\n<p><strong>​Elliott Investment Management</strong>, the investment firm founded by Republican megadonor Paul Singer, also <a href=\"https://lda.senate.gov/filings/public/filing/66c5eb49-d484-4c13-b390-471c72f57e38/print/\">hired</a> <strong>PhronesisDC</strong> to lobby on tax policy. In addition to Dunn, the lobbyists on the account are Brett Quick, former staff director of the Senate Banking Subcommittee on National Security, International Trade and Finance, and Riley Stamper, a former legislative staff assistant to Sen. Bill Hagerty (R-Tenn.).</p>\n\n<p><strong>​Marriott International</strong> <a href=\"https://lda.senate.gov/filings/public/filing/53da10b1-a2ed-4bf7-8a9b-e56abad7a73f/print/\">hired</a> <strong>Miller &amp; Chevalier Chartered</strong> to lobby on issues related to tax accounting for loyalty programs. Marc Gerson, former majority tax counsel for the House Ways and Means Committee, will work on the account.</p>\n<p><strong>The Walt Disney Company</strong> <a href=\"https://lda.senate.gov/filings/public/filing/d999e063-8925-499c-a4b7-0a1cea0768dd/print/\">hired</a> <strong>Ballard Partners </strong>to lobby on issues related to the media industry. One of the lobbyists on the account is Patrick Kilcur, who joined the firm in December from the Motion Picture Association, which includes Walt Disney Studios among its member companies.</p>\n<p><strong>Ballard Partners </strong>also <a href=\"https://lda.senate.gov/filings/public/filing/af9fd099-71e4-4e79-be26-f36b16da6cc6/print/\">registered</a> to lobby on inter-agency coordination for the ​<strong>Los Angeles Organizing Committee for the Olympic and Paralympic Games 2028</strong>. Daniel McFaul, who was previously chief of staff to former Rep. Matt Gaetz (R-Fla.), will work on the account.</p>\n<p>The medical device company <strong>​Boston Scientific Corporation</strong> <a href=\"https://lda.senate.gov/filings/public/filing/a24087e4-5da8-45b9-8a2f-6b7e03492c92/print/\">hired</a> <strong>Alston &amp; Bird</strong> to lobby on health care reimbursement, tax and trade issues. One of the lobbyists on the account is Jane Lucas, who was previously a White House special assistant for President Trump during his first term and spent a decade working with Senate Republican Leader John Thune (R-S.D.).</p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>Another Trump White House Alum, Benjamin Howard, is part of <strong>The Duberstein Group</strong> team hired by the <strong>Metropolitan Opera Association</strong>. The firm will provide advocacy, funding and policy support for the Met Opera’s arts and cultural initiatives, according to the <a href=\"https://lda.senate.gov/filings/public/filing/dbdb2fa4-30f8-4dba-b34b-7a35c2f3a246/print/\">registration</a>.</p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/lobbying/5126353-bottom-line-nfl-and-mlb-sign-phronesisdc/",
            "pub_date": "2025-02-05 19:10:56",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5126075,
            "title": "DeepSeek’s rise raises data privacy, national security concerns",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<p>The emergence of a newly popular artificial intelligence (AI) model from Chinese startup DeepSeek is raising national security and data privacy concerns for the U.S., not unlike those that spurred a ban on TikTok last month.   </p>\n<p>While the Chinese AI model’s rise has investors worried about the necessity of American AI companies’ massive infrastructure spending, it has experts concerned for other reasons — namely the potential ability for the Chinese government to access and manipulate the platform’s data. </p>\n\n<p>“The privacy policy explicitly says that it collects information and secures it on servers in China. Any data that you’re putting into DeepSeek, that is through the app or through a DeepSeek model available on the internet, that is collected and goes to China,” said Oliver Roberts, co-head of the AI Practice Group at law firm Holtzman Vogel. </p>\n<p>DeepSeek exploded onto the scene last month with its R1 model, quickly rising to the top of Apple’s App Store and overtaking OpenAI’s ChatGPT.  </p>\n<p>The model’s rapidly growing popularity, along with the Chinese AI startup’s impressive claims about its development, sent investors into a panic about American-made AI, sparking a mass sell-off in the tech sector.  </p>\n<p>DeepSeek claims to have built the R1 model using just a few thousand reduced-capacity chips from Nvidia, for a measly overall cost of $5.6 million. This contradicted the assumption of American firms that massive investment in AI infrastructure is necessary to advance the technology. </p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>Microsoft plans to invest $80 billion in data centers throughout 2025, while Meta will nearly double its spending on capital expenditures this year to between $60 billion and $65 billion. </p>\n<p>OpenAI, Oracle and SoftBank have also taken the lead on the Trump administration’s new Stargate project that plans to invest up to $500 billion in AI infrastructure in the next four years.  </p>\n\n<p>Even as worries abound about what DeepSeek means for American-made AI, other concerns are arising from the Chinese startup’s privacy policies.  </p>\n<p>DeepSeek automatically collects data on IP addresses, key stroke patterns and cookies, which is stored on “secure servers located in the People’s Republic of China.”  </p>\n<p>This raises the prospect that U.S. user data could end up in the hands of the Chinese government, which can legally compel Chinese companies to turn over data, not unlike U.S. law enforcement. </p>\n<div class=\"civic-science-article-container civic-science-more-14 civic-is-mr3\" data-civicscience-widget=\"3f127ebd-287e-0b64-a901-d55ec286348a\" id=\"civsci-id-civsci-id-596708068\"></div>\n<p>This data could then be used to profile Americans or manipulate algorithms to target propaganda, Roberts suggested.  </p>\n<p>He cautioned that businesses using DeepSeek could risk opening up their trade secrets to China, which has a poor track record on intellectual property protections. </p>\n<p>DeepSeek also currently lacks numerous privacy controls that exist in most other AI models, noted Rob Lee, chief of research and head of staff at SANS Institute, a cybersecurity firm.  </p>\n\n<p>“Unlike OpenAI — which, while imperfect, has a stronger commitment to privacy and anonymization — DeepSeek collects and indefinitely stores massive amounts of user data in China, without clear anonymization measures,” Lee said in a statement. </p>\n<p>“That’s a significant risk, not just from a security standpoint, but in terms of potential data misuse, regulatory concerns, and overall trust in AI systems,” he added. </p>\n<p>The Hill has reached out to DeepSeek for comment.</p>\n\n<p>Some companies have sought to take advantage of the open-source nature of DeepSeek’s models to alleviate these concerns. Perplexity AI has made DeepSeek’s R1 available but is hosting the model “exclusively in US &amp; EU data centers” so that “your data never leaves Western servers.” </p>\n<p>“I think it’s really important to distinguish between the DeepSeek products, which is their app, website and their API, and then the open-source model weights,” Dmitry Shevelenko, Perplexity’s chief business officer, told The Hill. </p>\n<p>“The product is very dangerous and scary because they are not only sending all your prompts and questions to China, they’re doing scary tracking of your activity on your device as well that they can get access to,” he continued. </p>\n\n<p>“The flip side is the model weights, which are open source,” Shevelenko added. “We were able to take those and put them ourselves in a U.S. data center and quickly make that available in Perplexity as one of the models.” </p>\n<p>The national security and data privacy concerns emerging around DeepSeek echo the worries that surrounded TikTok and ultimately led Congress to pass a law requiring its China-based parent company ByteDance to sell the app or face a ban. </p>\n<p>The law received wide bipartisan support amid concerns the Chinese government could access U.S. user data and potentially manipulate the content they see on the popular video-sharing platform. More than 170 million Americans use the app, according to TikTok. </p>\n\n<p>The ban was set to go into effect Jan. 19. However, it is currently on hold after President Trump barred enforcement for 75 days amid efforts to reach a deal to keep the app available in the U.S. </p>\n<p>Several lawmakers have already voiced concerns to the new Trump administration about DeepSeek. </p>\n<p>In a letter to national security adviser Mike Waltz last week, Reps. John Moolenaar (R-Mich.) and Raja Krishnamoorthi (D-Ill.) urged him to consider prohibiting the federal government from acquiring AI systems based on Chinese models, like DeepSeek. They also asked the administration to restrict the use of these models in critical infrastructure. </p>\n\n<p>Moolenaar and Krishnamoorthi are the top lawmakers on the House Select Committee on the Chinese Communist Party (CCP). </p>\n<p>“[I]t is clear we are at an inflection point in the AI market where PRC AI systems are increasingly available for use in the United States,” they wrote, using an abbreviation for People’s Republic of China (PRC). “It is imperative that we do not allow PRC AI systems to gain significant market share in the United States, while acquiring the data of U.S. users that only further enable the capabilities of the AI system.” </p>\n<p>Amid speculation that DeepSeek managed to circumvent U.S. export controls to obtain more advanced chips, the lawmakers also called on Waltz to consider new restrictions on chip sales.  </p>\n<p>Sens. Elizabeth Warren (D-Mass.) and Josh Hawley (R-Mo.) similarly wrote to Howard Lutnick, Trump’s nominee to lead the Commerce Department, on Monday to urge him to close a “loophole” in the export control regime. </p>\n<p>“With last week’s release of DeepSeek’s R1, a Chinese artificial intelligence (AI) model that rivals leading U.S. models, we must confront the reality that the PRC challenge to our technological leadership is real, and missteps could seriously undercut our economic and national security,” they said. </p>\n<p>The U.S. developed an increasingly strict export control regime under the Biden administration in an effort to stymie China’s ability to develop artificial intelligence. </p>\n<p>DeepSeek’s rise raises questions about the effectiveness of these controls and the state of the broader tech war between Washington and Beijing. </p>\n<p>“If they have the ability to create models at the same level of complexity as ChatGPT and OpenAI’s products 4.0 as well as o1, then that could put China on pace with the U.S. in terms of AI development, which has broader issues of China’s potential ability to create more advanced military equipment, weapons of mass destruction at a level we haven’t seen,” Roberts added. </p>\n<p>Texas Gov. Greg Abbott (R) banned state officials from using Chinese-owned technology, like DeepSeek, on government-issued devices Friday, saying it “will not allow the Chinese Communist Party to infiltrate our state’s critical infrastructure through data-harvesting AI and social media apps.”</p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/policy/technology/5126075-chinese-ai-model-raises-national-security-concerns/",
            "pub_date": "2025-02-05 19:05:53",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5126025,
            "title": "Republicans stare down massive deficits to extend Trump tax cuts",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>Caught between the debt and their tax base, Republicans are considering some novel ways to account for the cost of their legislative agenda as disagreements over budget cuts look set to hamstring early moves on their tax bill.</p>\n<p>Known as working from the “current policy baseline,” the nonstandard accounting method would let Republicans sweep nearly $5 trillion of debt under the rug.</p>\n\n<p>Using that baseline would keep the cost of extending expiring provisions of the 2017 Tax Cuts and Jobs Act out of the bill’s budgetary score, but include the potential benefits of renewing those provisions. Doing so would likely produce a much smaller number by which the tax legislation would add to the deficit.</p>\n<p>“That’s a $5 trillion question,” PwC tax expert and longtime Capitol Hill staffer Rohit Kumar told reporters in January, noting the policy baseline method could be used in either a one-bill or two-bill scenario for the Republican agenda. </p>\n<p>Jane Gravelle, senior specialist in economic policy at the nonpartisan Congressional Research Service (CRS), said using current policy baseline accounting would be a significant move.</p>\n<p>“It’s obviously a big deal,” Gravelle told The Hill. “Everything having to do with the debt is a big deal, because we’ve got a big problem with the debt.”</p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>Despite President Trump’s preference for “one big, beautiful bill” with which to advance his agenda, Republicans may opt for two, after the House GOP failed to reach agreement on a top-line budget number at their retreat in Florida last month. Speaker Mike Johnson (R-La.) has said he wants to vote on a number by the end of February.</p>\n<p>If the CBO were asked by Congress to score the costs of the tax legislation relative to a current policy baseline, the agency would do it, while also providing a score based on the primary accounting method, known as the “current law baseline.”</p>\n\n<p>Current law baseline considers the 2017 Trump tax cuts as they are written into law, accounting for the expiration of provisions such as cuts to personal income tax rates.</p>\n<p>The 2017 cuts were made temporary in the first place in order to satisfy the requirements of the budget reconciliation process, a legal workaround that sidesteps the need for 60 votes in the Senate and that Republicans are aiming to use once again.</p>\n<p>Ultimately, it’s a difference of assumption — but one with real consequences for the deficit, which ballooned to new highs after the pandemic and is a major concern for many Republicans. Total U.S. debt stock stands now at about $36 trillion, or 120 percent of annual gross domestic product.</p>\n<div class=\"civic-science-article-container civic-science-more-14 civic-is-mr3\" data-civicscience-widget=\"3f127ebd-287e-0b64-a901-d55ec286348a\" id=\"civsci-id-civsci-id-596708068\"></div>\n<p>On an annual basis, the budget deficit was $1.83 trillion in 2024; the government collected $4.92 trillion in revenue while spending $6.75 trillion, mostly on health and retirement insurance, defense and interest on the debt.</p>\n<p>The CBO expects that annual shortfall to increase to <a href=\"https://www.cbo.gov/publication/61162\" rel=\"noreferrer noopener\" target=\"_blank\">$2.7 trillion by 2035</a>, a number that doesn’t include the tax cut extensions Republicans are seeking. Total U.S. debt stock will reach $59.3 trillion by 2035, CBO estimates.</p>\n<p>Alex Muresianu, senior policy analyst with the Tax Foundation, called the distinction between the law and policy baselines a “gimmick.”</p>\n\n<p>“The current law baseline, assuming that these tax cuts expire, looks a certain way and then if you assume a current policy baseline where everything is assumed to be extended, then the current policy baseline would be worse. It’s just sort of a gimmick in terms of the actual fiscal position of the United States,” he said.</p>\n<p>It’s not unusual for the CBO to provide lawmakers with accounting projections based on assumptions that differ from current law, if lawmakers request that kind of information, though the agency differentiates between such analyses and considers the letter of the law to be the objective standard.</p>\n<p>For example, the CBO published a <a href=\"https://www.cbo.gov/publication/57627\" rel=\"noreferrer noopener\" target=\"_blank\">cost estimate</a> for the Biden administration’s Build Back Better in November 2021, which Republicans then asked the agency to modify <a href=\"https://www.cbo.gov/system/files/2021-12/57673-BBBA-GrahamSmith-Letter.pdf\" rel=\"noreferrer noopener\" target=\"_blank\">assuming the policies were made permanent</a>, rather than temporary. The estimates differed by an order of magnitude, jumping to $3 trillion from $367 billion.</p>\n\n<p>“Right now they use the current law baseline, which says that in 2026 all these provisions will expire and so to restore them there will be a revenue cost,” Gravelle told The Hill.</p>\n<p>Democrats have used policy baseline accounting projections in the past to advance their own agenda, Kumar noted.</p>\n<p>“Is Congress going to have to officially account for the cost of extending the expiring provisions — just the expiring stuff — or are they going to take the view, as the Obama administration did in 2012, that that which is law today we should just assume [is] permanent?” he said.</p>\n\n<p>“This is a harder question to answer,” Kumar added.</p>\n<p>Republican leadership is well aware of the challenges that lie ahead as it attempts to cut taxes and not explode the deficit.</p>\n<p>“We don’t want to blow a hole in the deficit by extending the Trump-era tax cuts, for example,”  Johnson said on Fox News on Monday. “But we’re definitely going to get that extended. We’ve got to find those savings.”</p>\n\n<p>Johnson said last week that the budget cuts Republicans had been considering amounted to a minimum rather than a maximum, but that minimum appears too low for the party’s deficit hawks. Rep. Ralph Norman (R-S.C.), a member of the conservative House Freedom Caucus, <a href=\"https://thehill.com/homenews/house/5124454-gop-trump-agenda-vote-delay/\" rel=\"noreferrer noopener\" target=\"_blank\">told The Hill</a> that $500 billion worth of cuts was a “nonstarter.”</p>\n<p>Some unusual activity in recent months in the bond market, which is sensitive to the deficit, may be signaling further concerns about the national debt. As the Federal Reserve slashed short-term interest rates over the fall, longer term interest rates in the bond market have gone up, indicating investors want a greater return for their money. Analysts have described this divergence in rates as unusual. </p>\n<p>Ratings agency Fitch downgraded U.S. creditworthiness from AAA to AA+ in 2023 following a debt ceiling standoff between Democrats and Republicans. Republicans will need to raise the debt ceiling again this year.</p>\n<script type=\"text/javascript\">window.NREUM||(NREUM={});NREUM.info={\"beacon\":\"bam.nr-data.net\",\"licenseKey\":\"bb199f70cb\",\"applicationID\":\"738543775\",\"transactionName\":\"MQNTMhdXDxECABBZDAhJchMWQg4PTBMLQxdIFl4VEQ==\",\"queueTime\":0,\"applicationTime\":2607,\"atts\":\"HURERF9NHE5BAkYKGBsb\",\"errorBeacon\":\"bam.nr-data.net\",\"agent\":\"\"}</script>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/business/5126025-republicans-congressional-budget-tax-bill/",
            "pub_date": "2025-02-05 19:05:51",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5126651,
            "title": "Musk’s expansive portfolio divides Trump world",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>Elon Musk may be the most divisive man in Washington — and in President Trump’s White House.</p>\n<p>In one camp stand Trump allies who see it as a matter of time before the president tires personally and professionally of Musk, who has been inescapable for the past week as he and staff for the Department of Government Efficiency (DOGE) have sought to seize control of various agencies.</p>\n\n<p>The critics see a tech titan who is not accountable to anyone but Trump and <a href=\"https://thehill.com/homenews/administration/5097672-elon-musk-responds-salute-criticism/\" rel=\"noreferrer noopener\" target=\"_blank\">stirs controversy</a>, even with <a href=\"https://x.com/BrendanPedersen/status/1886548531990737157\" rel=\"noreferrer noopener\" target=\"_blank\">some Republicans</a>.</p>\n<p>In the other camp are Trump advisers who see Musk as helping to deliver on exactly what the president promised as a candidate.</p>\n<p>“This is what President Trump campaigned on,” White House press secretary Karoline Leavitt said Tuesday. “Elon Musk is a highly respected, once-in-a-generation business leader who is volunteering his time to help make our federal government more efficient.”</p>\n<p>Musk’s shadow looms over the White House’s day-to-day business.</p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>In separate exchanges over the past three days with the press, Trump was asked about Musk and his role in the government. Leavitt faced Musk questions during a brief Q&amp;A with reporters on Monday amid uproar over the dismantling of the U.S. Agency for International Development (USAID). Leavitt confirmed Musk is serving as a <a href=\"https://www.washingtonpost.com/politics/2025/02/04/elon-musk-special-government-employee-meaning/\" rel=\"noreferrer noopener\" target=\"_blank\">special government employee</a>.</p>\n<p>Trump has been publicly supportive of Musk, and his advisers chafe at the suggestion that the tech titan is anything resembling a co-president. </p>\n\n<p>“Elon can’t do, and won’t do, anything without our approval,” Trump told reporters Monday. “And we’ll give him the approval where appropriate, where not appropriate we won’t. … But he does have a good natural instinct, he’s got a team of very talented people. We’re trying to shrink government, and he can probably shrink it as well as anyone else, if not better.”</p>\n<p>After Minnesota Gov. Tim Walz (D) posted on the social platform X that Musk “is a terrible president,” White House communications director Steven Cheung responded: “Tim Walz is a cuck.”</p>\n<p>Musk has been at the center of Trump’s hacksaw to the federal government this week. He has been the main cheerleader for <a href=\"https://thehill.com/policy/technology/5122676-usaid-shutdown-elon-musk-doge/\" rel=\"noreferrer noopener\" target=\"_blank\">gutting USAID</a>. His team has been pushing for access to the Treasury Department’s <a href=\"https://thehill.com/business/5124133-democrats-bill-treasury-system-musk/\" rel=\"noreferrer noopener\" target=\"_blank\">payment system</a>, and DOGE staff has  been involved at the Small Business Administration and the Government Services Administration.</p>\n<div class=\"civic-science-article-container civic-science-more-14 civic-is-mr3\" data-civicscience-widget=\"3f127ebd-287e-0b64-a901-d55ec286348a\" id=\"civsci-id-civsci-id-596708068\"></div>\n<p>Musk’s actions have led to protests outside the USAID building, outcry from Democrats and some unease from the public. <a href=\"https://news.gallup.com/poll/656111/few-major-political-figures-rated-positively-balance.asp\" rel=\"noreferrer noopener\" target=\"_blank\">A Gallup poll</a> conducted Jan. 21-27 found 43 percent of Americans held a favorable view of Musk, compared to 47 percent who had an unfavorable view, and sustained bad news cycles centered on Musk could frustrate Trump.</p>\n<p>“This Elon thing is going to be over in like three months. Both of these guys want to be the center of attention,” one Republican donor who requested anonymity to speak freely told The Hill.</p>\n<p>But where critics see Musk as an existential threat to government guardrails and a danger to Trump politically, his defenders view him as a revolutionary thinker with the work ethic to actually follow through on Trump’s campaign promises.</p>\n\n<p>“The only legitimate criticism that the Democrats can make is that President Trump has assembled the most highly competent, hardest working, and blazingly efficient Office of the President in American history,” senior White House aide Taylor Budowich posted on X. “The agenda voters demanded WILL BE delivered.”</p>\n<h2 class=\"wp-block-heading\">Vance’s key role</h2>\n<p>With Musk soaking up significant attention, Vice President Vance has managed to fly somewhat under the radar in the early weeks of the new administration.</p>\n<p>But it was Vance who played a critical part in helping some of Trump’s most controversial Cabinet nominees win over swing senators.</p>\n\n<p>Sen. Bill Cassidy (R-La.) thanked Vance for “his honest counsel” in deciding to support Robert F. Kennedy Jr.’s nomination to lead the Department of Health and Human Services. </p>\n<p>Sen. Todd Young (R-Ind.) also spoke with Vance as he eventually got to a “yes” vote in favor of Tulsi Gabbard’s nomination to serve as director of national intelligence. </p>\n<p>White House officials argued Vance’s Senate connections will prove critical. He is well liked and respected by his former colleagues on the GOP side in particular, those officials said, and Vance has shown an ability to articulate Trump’s beliefs to lawmakers.</p>\n\n<h2 class=\"wp-block-heading\">The trade war that wasn’t</h2>\n<p>Trump’s trade war that wasn’t with Mexico and Canada offered a lesson in how foreign leaders may try to navigate the next four years.</p>\n<p>The president was poised to impose tariffs on both nations Tuesday, but they were delayed for a month after calls with leaders from both countries. </p>\n<p>Mexico announced it would send 10,000 soldiers to the U.S. border to crack down on fentanyl trafficking. Canada said it would appoint a czar to oversee efforts to stop the flow of fentanyl and would ratchet up its posture toward cartels.</p>\n\n<p>Neither announcement was necessarily groundbreaking on its own, and Canada and Mexico in recent years have increased their efforts to cut down on migrants and drugs crossing the border. But the terms were enough to satisfy Trump, and the White House took a victory lap.</p>\n<p>The lesson for foreign leaders? Even a small gesture to Trump can be enough to avert a damaging dispute.</p>\n<h2 class=\"wp-block-heading\">Foreign leaders flock to White House</h2>\n<p>Israeli Prime Minister Benjamin Netanyahu had the honor of being the first foreign leader to meet Trump at the White House, but others aren’t far behind.</p>\n\n<p>Trump will host Japanese Prime Minister Shigeru Ishiba at the White House on Friday. </p>\n<p>King Abdullah of Jordan is scheduled to meet with Trump on Tuesday. Indian Prime Minister Narendra Modi and British Prime Minister Keir Starmer are also slated to visit Trump at the White House this month. </p>\n<p>The flurry of visits is reflective of the rush among foreign leaders to get on Trump’s good side and get a feel for what he may do on tariffs and foreign policy in the coming months.</p>\n<script type=\"text/javascript\">window.NREUM||(NREUM={});NREUM.info={\"beacon\":\"bam.nr-data.net\",\"licenseKey\":\"bb199f70cb\",\"applicationID\":\"738543775\",\"transactionName\":\"MQNTMhdXDxECABBZDAhJchMWQg4PTBMLQxdIFl4VEQ==\",\"queueTime\":0,\"applicationTime\":3102,\"atts\":\"HURERF9NHE5BAkYKGBsb\",\"errorBeacon\":\"bam.nr-data.net\",\"agent\":\"\"}</script>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/homenews/administration/5126651-elton-musk-trump-white-house/",
            "pub_date": "2025-02-05 19:01:13",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5126566,
            "title": "Satisfaction with public education at record low: Gallup",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>A Gallup poll released Wednesday found satisfaction with public education is at a record low as the Trump administration eyes shuttering the Department of Education.  </p>\n<p>The annual Mood of the Nation survey found 24 percent are satisfied with public education while 73 percent are dissatisfied, the lowest since the poll began back in 2001.  </p>\n\n<p>Only 16 percent of Republicans are somewhat or very satisfied with public education, compared to 30 percent of Democrats.  </p>\n<p>The results come amid a fight about how public education will look in the future given the priorities of the Trump administration.  </p>\n<p>The president is likely to take executive actions in the future to <a href=\"https://thehill.com/homenews/education/5126065-department-of-education-trump-musk-doge-doe-usaid/\">weaken the Department of Education</a>, with the goal to one day completely eliminate it.  </p>\n<p>“We’re ranked number 40 out of 40 schools, right? We’re ranked number one in cost per pupil, so we spend more per pupil than any other country in the world, and we’re ranked at the bottom of the list. We’re ranked very badly. And what I want to do is let the states run schools,” Trump said in the Oval Office on Tuesday while speaking about ending the federal agency.  </p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>Trump has also <a href=\"https://thehill.com/homenews/education/5112965-trump-signs-order-to-boost-school-choice-programs/\">signed an executive order</a> directing the federal government to prioritize and help states utilize federal funds to assist school choice programs.  </p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/homenews/education/5126566-public-education-satisfaction-gallup-poll/",
            "pub_date": "2025-02-05 17:06:07",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5127330,
            "title": "Republicans scramble for solutions on Trump legislative agenda after punting vote",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>House Republicans are scrambling to find a solution to internal disagreements over their plan to pass President Trump’s sprawling agenda, an effort that kicked into high gear after leadership was <a href=\"https://thehill.com/homenews/house/5124454-gop-trump-agenda-vote-delay/\" rel=\"noreferrer noopener\" target=\"_blank\">forced to punt a key vote</a> this week — and as the Senate <a href=\"https://thehill.com/homenews/senate/5126273-senate-budget-package-house-stalemate/\" rel=\"noreferrer noopener\" target=\"_blank\">inches closer to moving ahead </a>with its alternative plan.</p>\n<p>During a late-night meeting in the Capitol Tuesday night, lawmakers — including hardline conservatives, moderates and members of leadership — discussed potentially moving a five-year reconciliation package, to advance Trump’s agenda, three sources told The Hill, floating an abridged piece of legislation as the conference remains at odds over spending cuts.</p>\n\n<p>Throughout the budget reconciliation process Republicans have been operating under the assumption that the package full of Trump’s priorities — which include expensive tax extensions and exemptions — would last for 10 years. Shortening that timeframe would drastically lower the projected cost of the proposal in scoring. </p>\n<p>A reduction in the overall price tag could help gin up support among hardline conservatives, many of whom are demanding that the package be deficit neutral — a goal that would be more attainable with a lower cost. But it would also shorten the lifespan of the extended tax cuts, a fact that could frustrate some members. Trump has said he wants to make the tax cuts permanent.</p>\n<p>One source said that leadership plans to present the five-year idea to lawmakers during their House GOP conference meeting Wednesday morning, though it remains unclear if it would muster enough support in the slim majority.</p>\n<p>Johnson did not take a position on the five-year idea, another source said.</p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>A diverse group of lawmakers were present for the meeting, including Speaker Mike Johnson (R-La.), House Majority Leader Steve Scalise (R-La.), House Ways and Means Committee Chair Jason Smith (R-Mo.), House GOP Conference Vice Chair Blake Moore (R-Utah) and Reps. Chip Roy (R-Texas), David Valadao (R-Calif.), Ben Cline (R-Va.) and Kevin Hern (R-Okla.), according to one of the sources.</p>\n<p>While the viability of the five-year framework remains an open question, the fact that it was floated at all underscores the immense pressure House Republicans are under to move forward on a budget resolution that will include Trump priorities on tax, border enforcement, energy, and more — but will require near unanimity in the razor-thin GOP majority to advance.</p>\n\n<p>The special budget reconciliation process will allow Republicans to circumvent the 60-vote threshold in the Senate and move the bill without needing support from Democrats.</p>\n<p>GOP leaders had aimed to complete a blueprint at their Florida retreat last week and take an initial step to mark up the budget resolution in committee this week, but those seeking steep cuts derailed that plan by balking at an initial budget resolution proposal that featured a $500 billion tax cut floor. While leaders saw that as simply a starting point, fiscal hawks wanted commitments for much higher levels of cuts, with some seeking overall cuts of $2 trillion to $5 trillion.</p>\n<p>Though Johnson earlier on Tuesday had said that movement on the resolution in committee might still be possible, Scalise left the meeting saying Republicans would not be able to move on the markup this week.</p>\n<div class=\"civic-science-article-container civic-science-more-14 civic-is-mr3\" data-civicscience-widget=\"3f127ebd-287e-0b64-a901-d55ec286348a\" id=\"civsci-id-civsci-id-596708068\"></div>\n<p>“No,” Scalise succinctly responded when asked if House Republicans could mark up a budget resolution this week.</p>\n<p>“That’s what we’re focused on,” when pressed on if the key vote could happen next week.</p>\n<p>Scalise said that Republicans had raised the floor for cuts from what leaders presented at the House GOP retreat last week, which included ranges of cuts that each committee was tasked to come up with to offset the cost of priorities in the bill. </p>\n\n<p>“We have gone back to each committee to increase those numbers,” Scalise said, signaling that $1 trillion in cuts was realistic.</p>\n<p>But the tricky part is making sure the numbers are right — and that the votes are still there.</p>\n<p>Scalise that there will now be more “front-loading” of the work that leaders had initially expected would take place weeks from now in order to get agreement on the first step in the budget resolution.</p>\n\n<p>“Right now we’re doing is getting a lot more into the details of what the committees would have been doing in March, but we’re doing it now in the context of putting together the budget,” Scalise said. “The Budget Committee wants to be comfortable with numbers that they vote on to give the committees, and they weren’t. So we’re reworking it, but we’re reworking it by also working with the committees to make sure they can pass those —  those numbers.</p>\n<p>Reacting to the struggles on the House side, Senate Budget Committee Chair Lindsey Graham (R-S.C.) is set to brief senators on Wednesday about moving first on a budget resolution for an initial, skinny bill that would address border security, energy and defense. That measure would later be followed by a package extending the 2017 Trump tax cuts.</p>\n<p>“We do have a bill ready to go here and Sen. Graham is going to be briefing the conference on that tomorrow at lunch,” Senate Republican Whip John Barrasso (Wyo.) told reporters on Tuesday.</p>\n\n<p>Fear of a Senate alternative appears to be firing up House Republicans to try to find a solution to their internal conflict.</p>\n<p>“They’re worried about the Senate jamming them on a bill from the Senate, and the Senate would be a light one, it wouldn’t include the tax extension,” one source said when discussing the Tuesday night House Republican meeting.</p>\n<p>Johnson earlier on Tuesday insisted that the House will be spearheading the Trump agenda bill and shut down the idea of the Senate moving first.</p>\n\n<p>“The Senate will not take the lead,” Johnson said earlier on Tuesday. “We’ll take the lead. We’re right on schedule.”</p>\n<script type=\"text/javascript\">window.NREUM||(NREUM={});NREUM.info={\"beacon\":\"bam.nr-data.net\",\"licenseKey\":\"bb199f70cb\",\"applicationID\":\"738543775\",\"transactionName\":\"MQNTMhdXDxECABBZDAhJchMWQg4PTBMLQxdIFl4VEQ==\",\"queueTime\":0,\"applicationTime\":2384,\"atts\":\"HURERF9NHE5BAkYKGBsb\",\"errorBeacon\":\"bam.nr-data.net\",\"agent\":\"\"}</script>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/homenews/house/5127330-house-republicans-trump-agenda-scramble/",
            "pub_date": "2025-02-05 13:21:04",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5127297,
            "title": "Raskin warns ICE raids could sweep up ‘innocent citizens,’ demands answers",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>Rep. Jamie Raskin (D-Md.) has warned that Immigration and Customs Enforcement (ICE) raids could sweep up “innocent citizens.”</p>\n<p>“If you’re not out looking for criminals based on crimes committed, but undocumented immigrants based on their looks, you’re going to sweep up a lot of innocent people, including innocent citizens,” said the Maryland Democrat, <a href=\"https://www.nbcnews.com/news/latino/rep-jamie-raskin-demands-details-us-citizens-caught-ice-enforcement-rcna190649\">according to a statement</a> obtained by NBC News.</p>\n\n<p>“We’ve already seen cases of racial and ethnic profiling leading to the unlawful detention of U.S. citizens. That’s why I’m demanding answers about some of these profoundly troubling stories we’ve heard about citizens being targeted, detained and questioned,” he added.</p>\n<p>Raskin and Rep. Pramila Jayapal (D-Wash.) also sought <a href=\"https://democrats-judiciary.house.gov/uploadedfiles/2025-02-04_raskin_jayapal_to_noem_dhs_vitello_ice.pdf\">answers</a> from acting ICE Director Caleb Vitello and Department of Homeland Security (DHS) Secretary Kristi Noem on “troubling reports that U.S. citizens have been detained during immigration enforcement operations” in a Tuesday letter, of which NBC News obtained a copy first.</p>\n<p>“A recent NBC News article highlighted multiple incidents in which American citizens were wrongfully detained during immigration enforcement raids,” the two progressive Democrats wrote. “Additionally, Telemundo Puerto Rico recently reported on three U.S. citizens in Milwaukee—a toddler, his mother, and grandmother—who were detained and transported to an immigration detention center. </p>\n<p>ICE has denied the Milwaukee incident, claiming it was “completely false,” according to the <a href=\"https://www.jsonline.com/story/news/local/2025/01/31/ice-denies-detaining-puerto-rican-family-in-milwaukee/78091053007/\">Milwaukee Journal Sentinel</a>. </p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>“These reports raise serious questions about the actions of Department of Homeland Security (DHS) and Immigration and Customs Enforcement (ICE) personnel when conducting immigration enforcement,” Raskin and Jayapal said.</p>\n<p>The Hill has reached out to DHS and ICE for comment.</p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/homenews/house/5127297-raskin-ice-raids-ccitizens-demands-answers/",
            "pub_date": "2025-02-05 12:01:03",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5127282,
            "title": "Texas House Republican says US could use drones against cartels to ‘save American lives’",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>Rep. Brian Babin (R-Texas), co-chair of the Border Security Caucus, said on Tuesday the United States “could” use drones against the cartels if it meant saving American lives.</p>\n<p>NewsNation <a href=\"https://www.newsnationnow.com/us-news/immigration/ice-agents-escalating-threats-violence/\">reported this weekend</a> that cartels have authorized the use of weaponized drone explosives against border patrol agents and other U.S. law enforcement at the southern border.</p>\n\n<p>In an interview Tuesday on NewsNation’s “The Hill,” anchor Blake Burman asked Babin whether he thinks the situation “gets to the point where drones from the U.S. are used against the cartels.</p>\n<p>“It certainly could. I’m not saying it will,” Babin responded, noting that the U.S. knows where the drug labs are and where “a lot of these bad guys live.”</p>\n<p>“It could come down to that,” he added.</p>\n<p>Babin said he was grateful President Trump had designated the cartels as foreign terrorist organizations, saying “all is fair” when countering groups with that designation.</p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>“Everything’s on the table, and we could absolutely take that type of action against them, to save American lives, to save our property, to save our sovereignty,” he said.</p>\n<p> <em>The Hill is owned by Nexstar Media Group, which also owns NewsNation.</em></p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/homenews/house/5127282-brian-babin-drones-cartels/",
            "pub_date": "2025-02-05 11:25:55",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5127259,
            "title": "Grassley pushes for Senate committee vote on Patel as early as next week",
            "description": "<div class=\"article__text | body-copy | flow\">\n<!-- Starts Instaread-->\n<div class=\"instaread-audio-player\">\n<iframe allow=\"autoplay\" frameborder=\"no\" height=\"100%\" id=\"instaread_iframe\" name=\"instaread_playlist\" scrolling=\"no\" style=\"display:block\" title=\"Audio Article\" width=\"100%\"></iframe>\n<script>\n\t\t\t\tconst ir_script = document.createElement('script');\n\t\t\t\tconst ir_version = new Date().valueOf();\n\t\t\t\tir_script.src = 'https://instaread.co/js/instaread.thehill.js?version=' + ir_version;\n\t\t\t\tir_script.setAttribute(\"type\", \"text/javascript\");\n\t\t\t\tir_script.setAttribute(\"async\", true);\n\t\t\t\t(document.getElementsByTagName('body')[0] || document.getElementsByTagName('head')[0]).appendChild(ir_script);\n\t\t\t</script>\n</div>\n<!-- Finish Instaread -->\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n\n<p>Senate Judiciary Committee Chair Chuck Grassley (R-Iowa) said he’s eyeing next week for a final committee vote on Kash Patel’s nomination to lead the FBI, rejecting Senate Democrats’ request for a second formal hearing with the nominee.</p>\n<p>“Further hearings on his nomination are unnecessary,” Grassley said in a statement Tuesday.</p>\n\n<p>Grassley said Patel already testified for more than five hours before the committee, shared “thousands of pages of records and media appearances,” and provided 147 pages of answers to senators’ written questions.</p>\n<p>“The Senate Judiciary Committee will not fall for Democrats’ delay tactics,” Grassley added. “I intend to hold a final committee vote on Patel’s nomination as soon as next week.”</p>\n<p>Earlier on Tuesday, Senate Democrats on the committee <a href=\"https://x.com/JudiciaryDems/status/1886903667502076328/photo/1\">wrote to Grassley</a> to ask him to hold a second hearing for Patel. They said they wanted Patel to “clarify apparent falsehoods in his testimony” during the first hearing and wanted time to assess Patel’s grand jury testimony in connection to the federal investigation into President Trump’s retention of classified documents.</p>\n<p>They also said they wanted Patel to address “the recent removals and reassignments of FBI career civil servants.”</p>\n<div data-s2n-api=\"minuteMediaS2NApi\" data-stn-player=\"k036p9v5\" id=\"s2n-player\"></div>\n<p>“No one was convinced by the Minority’s baseless efforts to mischaracterize and malign Kash Patel,” Grassley said. “It’s additionally outrageous to assert that a nominee should come before the Senate to answer for government actions that occurred <em>prior to </em>their time at an agency.”</p>\n</div>",
            "kind": "post",
            "link": "https://thehill.com/homenews/senate/5127259-grassley-senate-committee-vote-patel/",
            "pub_date": "2025-02-05 10:50:59",
            "source": "thehill",
            "language": "en"
        }
    ]
}