{
    "data": [
        {
            "id": 5755042,
            "title": "Minneapolis chaos reveals a malevolent confusion over the First Amendment",
            "description": "<p>The <a href=\"https://www.ms.now/opinion/minneapolis-ice-metro-surge-trump-dhs\" rel=\"noreferrer noopener\" target=\"_blank\">lengthy drama that has played out in Minneapolis</a> in recent weeks has exposed yet again that too many Americans misunderstand what constitutes free expression. </p>\n<p>The First Amendment was designed by the framers to give citizens the rights to express themselves politically, religiously and culturally. Those protections allow people to express their thoughts and ideas. But that’s all the Constitution guarantees. </p>\n<p>Somewhere along the way, provocateurs bastardized the concept of free expression. They have confused unlawful incitement as “messaging” and falsely portrayed actual behavior as “free speech.” Apologists consciously obfuscate action and expression, lumping all approaches of dissent into the same category. </p>\n<p>A close reading of the First Amendment should remind Americans of the wording <a href=\"https://constitution.congress.gov/constitution/amendment-1/\" rel=\"noreferrer noopener\" target=\"_blank\">“peaceably to assemble.”</a> </p>\n<p>Even a former anchor at a high-profile news channel has intentionally mischaracterized what the First Amendment means. <a href=\"https://thehill.com/homenews/media/5737966-don-lemon-pleads-not-guilty/\" rel=\"noreferrer noopener\" target=\"_blank\">Don Lemon</a> intruded on private property and disrupted other citizens’ exercise of their rights, then tried to snooker the public with the claim that doing “journalism” allows such an invasion. Lemon’s stunt led to his arrest in Los Angeles by federal officials. Immediately, Mayor <a href=\"https://mayor.lacity.gov/news/mayor-bass-issues-statement-regarding-arrest-renowned-journalists-don-lemon-and-georgia-fort\" rel=\"noreferrer noopener\" target=\"_blank\">Karen Bass perpetuated the same inaccurate portrayal of Lemon’s actions</a>, proclaiming Lemon was “just doing his job.”</p>\n<p>Polarization happens when some citizens interpret free expression protections to include hostile action and incitement of unlawful behavior. Debate on issues ceases when mob behavior can be considered “expression” in a broad and unhealthy categorization. The forces of chaos thrive on these expansive interpretations of “expression” that justify dangerous behavior. </p>\n<p>Delineating what is constitutionally protected expression from uncivil conduct really isn’t that difficult to figure out, if the various parties want to promote reasoned discourse instead of chaotic behavior. Assembling, demonstrating, holding signs and chanting slogans are all just fine, if done on public property or your own property. All of those things are expressions.</p>\n<p>Blocking roads, vandalism, spitting, inciting violence, trespassing and organized interference with law enforcement officers are not OK. All of those things are actions — not expression or dissent. This should be simple enough to understand. </p>\n<p>There is no First Amendment “right” to try to nullify enforcement of federal law. President Dwight Eisenhower <a href=\"https://www.eisenhowerlibrary.gov/research/online-documents/civil-rights-little-rock-school-integration-crisis\" rel=\"noreferrer noopener\" target=\"_blank\">made that clear</a> to the governor of Arkansas in 1957, when the 101st Airborne was ordered to Little Rock to desegregate a school.</p>\n<p>But to the manipulators of mayhem and their overwrought true-believer followers, the false claim that action is the same as dissent serves a disruptive objective. Constitutional framer James Madison warned his countrymen about the dangers of mobs. He wrote in the <a href=\"https://founders.archives.gov/documents/Madison/01-10-02-0178\" rel=\"noreferrer noopener\" target=\"_blank\">Federalist Papers that mobs</a> were “adverse to the rights of other citizens, or to the permanent and aggregate interests of the community.” In 1838, a 28-year-old <a href=\"https://www.abrahamlincolnonline.org/lincoln/speeches/lyceum.htm\" rel=\"noreferrer noopener\" target=\"_blank\">Abraham Lincoln addressed a lyceum</a> in Springfield, Ill., telling his fellow citizens, “There is no grievance that is a fit object of redress by mob law.”</p>\n<p>Sensible Americans engage in productive dissent and free speech. Mobs promote civil disintegration and rage, and ultimately lead to anarchy. As British philosopher Edmund Burke <a href=\"https://www.irishphilosophy.com/2018/11/01/rage-and-frenzy/\" rel=\"noreferrer noopener\" target=\"_blank\">wrote two centuries ago</a>, “Rage and frenzy will pull down more in half an hour than prudence, deliberation and foresight can build in a hundred years.”</p>\n<p>It is unhelpful when government officials who should know better engage in the rhetoric of hysteria, demonizing political opponents and mischaracterizing disruptive behaviors as patriotic or somehow promoting justice. <a href=\"https://www.youtube.com/watch?v=MyMNyvO7xrk\" rel=\"noreferrer noopener\" target=\"_blank\">Minneapolis Mayor Jacob Frey broadly accused federal law enforcement</a> of trying “to silence dissent.” Perhaps some innocent citizens have been silenced, but it  is not silencing dissent to clear barricaded streets, stop vandalism or restrain people who are throwing projectiles. Rather, those are examples of addressing criminal behavior.</p>\n<p>The role of television news outlets in covering or even fueling disruptions is also worth noting. Much of the havoc carried out on the streets was designed particularly for the television cameras and news organizations playing along as publicists, dispensing emotion but providing too little context.</p>\n<p>Certainly, there is much blame to go around for the sad trajectory of events in Minneapolis. But it is safe to say that First Amendment ignorance has been a key part of this sad and, indeed, tragic episode. </p>\n<p>These intentional mischaracterizations of free expression, dispensed into the tense climate, did nothing to promote justice or patriotic dissent. Rather, the manipulation led to bedlam and a weakening of the rhetorical sphere in which such disputes should be resolved.  </p>\n<p><em><u><a href=\"https://twitter.com/Prof_McCall\" rel=\"noreferrer noopener\" target=\"_blank\">Jeffrey M. McCall</a></u> is a media critic and professor of communication at DePauw University. He has worked as a radio news director, a newspaper reporter and as a political media consultant.</em>   </p>",
            "kind": 1,
            "link": "https://thehill.com/opinion/white-house/5755042-first-amendment-rights-debate/",
            "pub_date": "2026-02-26 22:10:41",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5756249,
            "title": "DOJ reviewing whether any Epstein records withheld after reports of missing Trump-related documents",
            "description": "<p>The Justice Department will review whether it failed to publish several documents in the Epstein files after various media outlets reported several records related to accusations made against President Trump were removed from the tranche.</p>\n<p>The documents in question relate to accusations made by a woman who said as a minor she refused Trump’s sexual advances, prompting the president to respond violently and kick her out of the room. </p>\n<p>While the woman’s accusation was cataloged in the Epstein files, serial numbers tracking the various documents show that while the woman spoke to the FBI four times, roughly 50 pages related to the woman’s interviews were not publicly released; instead, only files detailing her accusations against Epstein were published.</p>\n<p>The White House has denied any wrongdoing by Trump, and Justice previously described the accusations as “salaciously insane” and argued they were found to have no credibility. It also had previously defended its handling of the release of documents.</p>\n<p>But in a shift, Justice on Wednesday said it would conduct the review.</p>\n<p>“Several individuals and news outlets have recently flagged files related to documents produced to Ghislaine Maxwell in discovery of her criminal case that they claim appear to be missing,” DOJ said in a <a href=\"https://x.com/DOJRR47/status/2026769082159112295?s=20\">statement Wednesday</a>.</p>\n<p>“As with all documents that have been flagged by the public, the Department is currently reviewing files within that category of the production. Should any document be found to have been improperly tagged in the review process and is responsive to the Act, the Department will of course publish it, consistent with the law.”</p>\n<p>Congressional Democrats are pledging to review the matter.</p>\n<p>“Yesterday, I reviewed unredacted evidence logs at the Department of Justice,” Rep. Robert Garcia (D-Calif.), ranking member of the Oversight Committee, said in a Tuesday statement.</p>\n<p>“Oversight Democrats can confirm that the DOJ appears to have illegally withheld FBI interviews with this survivor who accused President Trump of heinous crimes. Oversight Democrats will open a parallel investigation into this.” </p>\n<p>In a response the same day, DOJ again asserted nothing had been removed, saying, “NOTHING has been deleted…ALL responsive documents have been produced unless a document falls within one of the following categories: duplicates, privileged, or part of an ongoing federal investigation.</p>\n<p>But the pushback only prompted more questions from Oversight Democrats.</p>\n<p>“Records of FBI interviews with a survivor who alleged Trump sexually assaulted her as a child aren’t duplicates or shouldn’t be privileged. Are you saying there’s an active, ongoing federal investigation into President Trump?” the panel’s minority wrote on X.</p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/administration/5756249-doj-investigates-withheld-fbi-interviews/",
            "pub_date": "2026-02-26 22:10:40",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5755462,
            "title": "Gillibrand wants $130B tariff refund for Americans",
            "description": "<p>(NEXSTAR) — New York Democratic leaders want President Trump to <a data-id=\"https://thehill.com/homenews/5748171-us-tariff-revenue-refunds/\" data-type=\"link\" href=\"https://thehill.com/homenews/5748171-us-tariff-revenue-refunds/\">refund billions</a> after the Supreme Court ruling <a data-id=\"https://thehill.com/regulation/court-battles/5687657-scotus-rejects-trump-emergency-tariffs/\" data-type=\"link\" href=\"https://thehill.com/regulation/court-battles/5687657-scotus-rejects-trump-emergency-tariffs/\">struck down the bulk</a> of his tariffs on foreign trading partners.</p>\n<p>Sen. Kirsten Gillibrand (D-N.Y.) held a virtual press conference Wednesday to demand the administration send money back to small businesses and consumers, arguing that <a data-id=\"https://thehill.com/business/5737182-tariffs-trump-us-businesses-impact/\" data-type=\"link\" href=\"https://thehill.com/business/5737182-tariffs-trump-us-businesses-impact/\">American businesses and consumers</a> paid 96 percent of the costs for the “<a data-id=\"https://thehill.com/regulation/court-battles/5747353-read-supreme-court-trump-tariffs-ruling/\" data-type=\"link\" href=\"https://thehill.com/regulation/court-battles/5747353-read-supreme-court-trump-tariffs-ruling/\">illegal</a>” tariffs, generating some $130 billion in federal revenue. She demanded Treasury Secretary Scott Bessent <a data-id=\"https://thehill.com/regulation/court-battles/5747881-supreme-court-tariff-refunds/\" data-type=\"link\" href=\"https://thehill.com/regulation/court-battles/5747881-supreme-court-tariff-refunds/\">issue refunds</a> immediately.</p>\n<p>“That’s money that President Trump now owes back to the American people,” Gillibrand said. </p>\n<p>She added that tariffs and remarks from the president deeply offended Canadians, significantly reducing tourism that keeps businesses in New York afloat.</p>\n<p>To force the administration to issue refunds, the New York Democrat said companies should sue the trade commission. She also encouraged local businesses struggling without Canadian customers should write to Attorney General Letitia James (D) for legal support.</p>\n<p>“I imagine our attorney general will file a lawsuit,” she added. “I think it’s the best way for us to get our money back.”</p>\n<p>New York Gov. Kathy Hochul’s (D) office would not comment on the potential for a lawsuit but said the state government would explore all of its options to get refunds for New Yorkers.</p>\n<p>Officials presented different data points to estimate alleged economic damage. Gillibrand said the tariffs cost the average New York household about $4,200 per year. Meanwhile, a <a data-id=\"https://thehill.com/homenews/state-watch/5754391-new-york-kathy-hochul-tariff-refunds-trump-supreme-court/\" data-type=\"link\" href=\"https://thehill.com/homenews/state-watch/5754391-new-york-kathy-hochul-tariff-refunds-trump-supreme-court/\">statement from Hochul</a> on Tuesday cited the Yale Budget Lab, estimating $1,751 per household in new costs since the 2025 tariffs were enacted.</p>\n<p>Rochester business owner Ben Pearson manufactures science kits, according to Senate Minority Leader Chuck Schumer (D-N.Y.), and lost $1 million to tariffs — creating a deficit that forced him to reduce his workforce by 20 percent. Schumer invited Pearson to President Trump’s <a data-id=\"https://thehill.com/homenews/administration/5754101-trump-state-union-address-takeaways/\" data-type=\"link\" href=\"https://thehill.com/homenews/administration/5754101-trump-state-union-address-takeaways/\">State of the Union address</a> Tuesday night to demonstrate the financial strain in the state.</p>\n<p>“Upstate NY is paying the price for Trump’s cost-increasing policies, and it needs to stop,” Schumer said in a press release ahead of the <a data-id=\"https://thehill.com/homenews/administration/5754220-donald-trump-2026-state-of-the-union-record-speech/\" data-type=\"link\" href=\"https://thehill.com/homenews/administration/5754220-donald-trump-2026-state-of-the-union-record-speech/\">record-long speech</a>.</p>\n<p>After the address, conservatives in New York defended the president, targeting Hochul’s leadership instead. New York State Conservative Party Chair Gerard Kassar released a statement afterward praising Trump’s <a data-id=\"https://thehill.com/homenews/administration/5754028-trump-state-of-the-union-memorable-moments/\" data-type=\"link\" href=\"https://thehill.com/homenews/administration/5754028-trump-state-of-the-union-memorable-moments/\">State of the Union remarks</a>, arguing that he offered a sensible vision to counter progressive policies.</p>\n<p>Other than international travel, tariffs also disrupted agriculture, according to the governor. </p>\n<p>Hochul proposed a $30 million relief plan to help farmers offset the higher costs of equipment and fertilizer. According to her office, over 80 percent of agrochemical imports and 70 percent of farm machinery come from countries tariffed at 10 percent or more.</p>",
            "kind": 1,
            "link": "https://thehill.com/business/5755462-kirsten-gillibrand-new-york-13b-tariff-refunds/",
            "pub_date": "2026-02-26 21:51:06",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5756167,
            "title": "4 killed in speedboat were trying to infiltrate Cuba, officials say",
            "description": "<p>The Cuban government said late Wednesday that the 10 individuals involved in a <a href=\"https://thehill.com/policy/international/5755294-cuba-speedboat-shooting/\">confrontation with the island’s border security officers</a> were armed Cubans living in the U.S. attempting to infiltrate the country.</p>\n<p>The government said the majority of those onboard the boat “have a known history of criminal and violent activity,” <a href=\"https://apnews.com/article/cuba-us-florida-boat-shooting-68e07061282dc2470993f6539bd0bde2\">according to The Associated Press</a>. </p>\n<p>Earlier Wednesday, Cuba’s Interior Ministry <a href=\"https://x.com/EmbaCubaUS/status/2026732911114760673\">said</a> four people on the speedboat were killed and six were injured during a firefight with border security officers roughly 1 nautical mile northeast of Cayo Falcones, in the Villa Clara province. </p>\n<p>The ministry noted that the speedboat was registered in Florida. </p>\n<p>Secretary of State Marco Rubio told reporters Wednesday that Cuban authorities informed him of the incident earlier that morning. He noted that the U.S. Coast Guard, under the Department of Homeland Security, is investigating the incident along with the State Department. </p>\n<p>“We’re not going to base our conclusions on what they’ve told us,” Rubio remarked, referring to the Cuban government. “And I am very, very confident that we will know the full story of what happened here and we will know it soon, and then we’ll respond appropriately based on what that information tells us.”</p>\n<p>The secretary of state clarified that the individuals on the vessel were not U.S. government officials, and the State Department is working to determine whether they were American citizens or permanent residents. </p>\n<p>Vice President Vance also told reporters Wednesday that Rubio briefed him on the incident.</p>\n<p>“Certainly, a situation that we’re monitoring, hopefully it’s not as bad as we fear it could be but can’t say more because I just don’t know more,” Vance added. </p>\n<p>A spokesperson for Florida Gov. Ron DeSantis (R) told The Hill Wednesday that the governor was also brought up to speed. Cuba is roughly 90 miles south of Key West, Fla.</p>\n<p>Florida Attorney General James Uthmeier (R) also <a href=\"https://x.com/AGJamesUthmeier/status/2026750551338205242?s=20\">wrote on social media</a> Wednesday that he directed the state’s Office of Statewide Prosecution “to work with our federal, state, and law enforcement partners” to investigate the incident.</p>",
            "kind": 1,
            "link": "https://thehill.com/policy/international/5756167-cuba-speedboat-killing-security/",
            "pub_date": "2026-02-26 21:40:45",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5754891,
            "title": "Blue state public health cuts don't 'own the libs' — they endanger us all",
            "description": "<p>The Trump administration’s decision to <a href=\"https://www.nytimes.com/2026/02/09/health/trump-public-health-cuts-california.html\" rel=\"noreferrer noopener\" target=\"_blank\">slash $600 million in public health funding</a> from California, Colorado, Illinois and Minnesota isn’t just cruel or vindictive. It is breathtakingly stupid. </p>\n<p>According to <a href=\"https://www.nytimes.com/2026/02/09/health/trump-public-health-cuts-california.html\" rel=\"noreferrer noopener\" target=\"_blank\">documents reviewed by The New York Times</a>, the administration plans to rescind hundreds of millions in grants administered through the Centers for Disease Control and Prevention — funds that state and local health departments use for everything from hiring staff and modernizing data systems to managing disease outbreaks and preventing the spread of HIV. </p>\n<p>The rationale? These grants “<a href=\"https://www.usnews.com/news/health-news/articles/2026-02-11/trump-pulls-600m-in-public-health-funds-from-four-states\" rel=\"noreferrer noopener\" target=\"_blank\">do not reflect agency priorities</a>.” Translation: The states that receive them are run by Democrats. </p>\n<p>This is weaponization of public health funding for partisan retribution. It is government by grievance, policy by punishment, and it carries consequences that will reverberate far beyond the borders of the blue states that the administration seems so eager to penalize. </p>\n<p>Start with the most elementary fact of epidemiology: Infectious diseases do not recognize state borders or consult electoral maps. As former CDC chief medical officer Dr. Deb Houry pointedly noted, <a href=\"https://www.nytimes.com/2026/02/09/health/trump-public-health-cuts-california.html\" rel=\"noreferrer noopener\" target=\"_blank\">these cuts are happening “in the middle of a measles outbreak and other health threats</a>.”</p>\n<p>Measles, for those who need reminding, is <a href=\"https://www.who.int/news-room/fact-sheets/detail/measles\" rel=\"noreferrer noopener\" target=\"_blank\">one of the most contagious diseases</a> known to science. An outbreak that festers in a defunded California county doesn’t politely stop at the Nevada state line. It spreads — to Arizona, to Texas, to Florida, to every red state whose leaders might now be applauding this vindictive budget maneuver. </p>\n<p>This isn’t hypothetical. In December 2014, a measles outbreak that began at Disneyland in Anaheim, Calif., spread within weeks to <a href=\"https://www.cdc.gov/mmwr/preview/mmwrhtml/mm6406a5.htm\" rel=\"noreferrer noopener\" target=\"_blank\">six other states, Mexico and Canada</a>, ultimately infecting more than <a href=\"https://qmrawiki.org/case-studies/measles-outbreak-theme-park-southern-california-and-propagation-through-california\" rel=\"noreferrer noopener\" target=\"_blank\">147 people in the U.S. alone</a>. Among the hardest hit beyond California: <a href=\"https://www.cdc.gov/mmwr/preview/mmwrhtml/mm6406a5.htm\" rel=\"noreferrer noopener\" target=\"_blank\">Arizona, a red state, with seven linked cases, and deep-red Utah, with three</a>.</p>\n<p>The virus didn’t care that it was crossing from blue California into reliably conservative territory. It simply followed the unvaccinated. </p>\n<p>Nearly two dozen of the targeted grants were specifically aimed at curbing HIV and other sexually transmitted infections. Among the casualties: <a href=\"https://www.nytimes.com/2026/02/09/health/trump-public-health-cuts-california.html\" rel=\"noreferrer noopener\" target=\"_blank\">$5.2 million</a> from Lurie Children’s Hospital of Chicago for expanding HIV prevention therapy among Black women, and $<a href=\"https://www.usnews.com/news/health-news/articles/2026-02-11/trump-pulls-600m-in-public-health-funds-from-four-states\" rel=\"noreferrer noopener\" target=\"_blank\">371,000 from the Colorado Health Network</a> for outreach to Latino and African American men. </p>\n<p>These are precisely the kinds of community-based interventions that prevent localized health crises from becoming national ones. Gut them, and you aren’t owning the libs. You’re seeding the next epidemic. </p>\n<p>Then there’s the economic argument, which should matter even to those unmoved by humanitarian concerns. Illness is expensive. The CDC’s core public health infrastructure grants exist precisely because prevention is orders of magnitude cheaper than treatment.  </p>\n<p>California alone accounts for nearly two-thirds of the rescinded funding. <a href=\"https://www.gov.ca.gov/2025/04/23/california-is-now-the-4th-largest-economy-in-the-world/\" rel=\"noreferrer noopener\" target=\"_blank\">California is also the world’s fourth-largest economy</a>. When its public health infrastructure falters, the economic ripple effects don’t stay in Sacramento. They radiate through supply chains, labor markets and interstate commerce. </p>\n<p>The administration’s own stated rationale makes this worse, not better. The CDC’s website now declares that focusing on diseases that disproportionately affect certain populations “<a href=\"https://www.cdc.gov/about/cdc/index.html\" rel=\"noreferrer noopener\" target=\"_blank\">has not translated into measurable improved health for minority populations, and in many cases has undermined core American values</a>.” </p>\n<p>Set aside the Orwellian redefinition of “American values” as something incompatible with helping sick people. The practical effect of this ideology is to abandon the populations most vulnerable to infectious disease — which means abandoning the early-warning systems that protect everyone else. </p>\n<p>Diseases that circulate unchecked in marginalized communities eventually find their way into the general population. We learned this lesson with AIDS. We learned it again with COVID-19. Apparently, we need to learn it once more. </p>\n<p>There is also something deeply cruel about this approach to governance. Last month, Health and Human Services briefly <a href=\"https://www.statnews.com/2026/01/24/public-health-infrastructure-grants-cdc-paused-states/\" rel=\"noreferrer noopener\" target=\"_blank\">paused $5 billion in public health infrastructure grants</a> to ensure they were “aligned” with administration goals, only to reverse course within 24 hours after the ensuing uproar. Now comes $600 million in permanent cuts, targeted with surgical precision at states the president lost. This isn’t fiscal discipline: It’s a tantrum with a budget pen. </p>\n<p>Public health is, by definition, a collective enterprise. It works only when the entire system works — when every state has the resources to detect, track and contain threats before they spiral beyond control. Defunding four states doesn’t strengthen the remaining 46. It weakens them all. </p>\n<p>If this administration truly cared about American health and economic strength, it would invest more in public health infrastructure, not less — recognizing that disease surveillance in California protects families in Alabama, and HIV prevention in Illinois saves health care dollars in Mississippi.</p>\n<p>Instead, we get cruelty masquerading as policy. And when the next outbreak tears across state lines — because it will — the cost will be measured not in partisan points scored, but in American lives lost.</p>\n<p><em>Michelle A. Williams is a professor of epidemiology and population health at Stanford University School of Medicine and former dean of the Harvard T.H. Chan School of Public Health. Her book, “The Cure for Everything: The Epic Struggle for Public Health and a Radical Vision for Human Thriving,” was published by One World on Feb. 3, 2026.</em></p>",
            "kind": 1,
            "link": "https://thehill.com/opinion/healthcare/5754891-trump-cuts-public-health/",
            "pub_date": "2026-02-26 21:40:44",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5756103,
            "title": "Trump admin weighs requiring banks to collect citizenship info: Reports",
            "description": "<p>(<a href=\"https://www.newsnationnow.com/business/your-money/trump-banks-citizenship-info/\">NewsNation</a>) — The Trump administration is weighing a move that could require banks to collect <a data-id=\"https://thehill.com/regulation/court-battles/5716442-judge-blocks-trump-order-proof-of-citizenship/\" data-type=\"link\" href=\"https://thehill.com/regulation/court-battles/5716442-judge-blocks-trump-order-proof-of-citizenship/\">citizenship information</a> from customers, according to multiple reports.</p>\n<p>The potential action, reported by the <a data-id=\"https://www.wsj.com/politics/policy/trump-administration-considers-action-requiring-banks-to-collect-citizenship-info-8e26f6d2?st=6aADSk&amp;reflink=article_copyURL_share\" data-type=\"link\" href=\"https://www.wsj.com/politics/policy/trump-administration-considers-action-requiring-banks-to-collect-citizenship-info-8e26f6d2?st=6aADSk&amp;reflink=article_copyURL_share\" rel=\"noreferrer noopener\" target=\"_blank\">Wall Street Journal</a> and <a data-id=\"https://www.semafor.com/article/02/24/2026/trump-administration-weighs-citizenship-requirement-for-bank-account-holders\" data-type=\"link\" href=\"https://www.semafor.com/article/02/24/2026/trump-administration-weighs-citizenship-requirement-for-bank-account-holders\" rel=\"noreferrer noopener\" target=\"_blank\">Semafor</a>, could come as an executive order and may apply to both new and existing bank customers.</p>\n<p>While nothing has been finalized, such a decision would mark an escalation in the president’s <a data-id=\"https://www.newsnationnow.com/politics/ap-politics/ap-trumps-return-to-office-has-seen-sweeping-changes-to-immigration-enforcement/\" data-type=\"link\" href=\"https://thehill.com/homenews/administration/5693537-trump-immigration-crackdown-year-one/\" rel=\"noreferrer noopener\" target=\"_blank\">crackdown on illegal immigration</a> and could ultimately have banks requesting additional documentation, such as passports, from customers.</p>\n<p><a data-id=\"https://thehill.com/policy/transportation/5628287-flying-without-real-id-may-cost-you-45-under-new-tsa-program/\" data-type=\"link\" href=\"https://thehill.com/policy/transportation/5628287-flying-without-real-id-may-cost-you-45-under-new-tsa-program/\">REAL IDs</a> — which do not prove citizenship — would not be considered eligible, Semafor reported, citing people familiar with the talks.</p>\n<p>“Any reporting about potential policymaking that has not been officially announced by the White House is baseless speculation,” White House spokesman Kush Desai said in a statement to NewsNation.</p>\n<p>As it stands now, U.S. banks are not required to verify a customer’s citizenship status specifically, and there is no ban on opening accounts for noncitizens, the Journal noted.</p>\n<p>Banks do collect basic information — including a customer’s name, date of birth, address and identification number — under “<a data-id=\"https://www.helpwithmybank.gov/help-topics/bank-accounts/required-identification/id-types.html\" data-type=\"link\" href=\"https://www.helpwithmybank.gov/help-topics/bank-accounts/required-identification/id-types.html\" rel=\"noreferrer noopener\" target=\"_blank\">know your customer</a>” regulations meant to guard against illegal money laundering and terrorist financing. </p>\n<p>A move to require citizenship information would likely face pushback from the banking industry and could be complicated to implement, with one financial services lobbyist telling Semafor the idea is a “complete nightmare” logistically.</p>\n<p>The requirement could also pose challenges for U.S. citizens who may not have proof of citizenship readily available. Only about <a data-id=\"https://2021-2025.state.gov/return-to-pre-pandemic-passport-processing-times/\" data-type=\"link\" href=\"https://2021-2025.state.gov/return-to-pre-pandemic-passport-processing-times/\" rel=\"noreferrer noopener\" target=\"_blank\">half of Americans</a> have a valid passport, according to the State Department. </p>\n<p>Sen. Tom Cotton (R-Ark.) said he strongly supports President Trump taking action to “prevent illegal migrants from accessing our banking system” in a <a data-id=\"https://x.com/SenTomCotton/status/2026389585480044550/photo/1\" data-type=\"link\" href=\"https://x.com/SenTomCotton/status/2026389585480044550/photo/1\" rel=\"noreferrer noopener\" target=\"_blank\">post on social platform X</a> Tuesday.</p>\n<p>Cotton added that he plans to introduce legislation on the issue “shortly” and shared an October letter in which he asked Treasury Secretary Scott Bessent to investigate.</p>\n<p>One avenue the Trump administration is considering is having the Treasury Department’s Financial Crimes Enforcement Network collect the information, people familiar with the talks told the Journal.</p>\n<p>Discussions about the potential executive order have alarmed banks, which have questioned the legal basis for the proposal, according to the outlet.</p>",
            "kind": 1,
            "link": "https://thehill.com/business/5756103-donald-trump-proof-of-citizenship-banks/",
            "pub_date": "2026-02-26 21:30:53",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5754305,
            "title": "Relocation threats shouldn't stop California from taxing billionaires",
            "description": "<p>As a California millionaire, I have no problem paying more in tax if it means millions of my neighbors get to keep their health care coverage. I am proud to pay higher taxes if it makes for a healthier and safer nation. I also won’t leave my beloved home state of 30 years if that happens.</p>\n<p>It is a pity that some of my billionaire peers don’t feel the same about their civic responsibility and patriotic duty.</p>\n<p>Last October, organizers <a href=\"https://www.sacbee.com/news/politics-government/capitol-alert/article312624588.html\" rel=\"noreferrer noopener\" target=\"_blank\">filed a measure</a>, the <a href=\"https://oag.ca.gov/system/files/initiatives/pdfs/25-0024A1%20%28Billionaire%20Tax%20%29.pdf\" rel=\"noreferrer noopener\" target=\"_blank\">2026 Billionaire Tax Act</a>, to appear on the November 2026 ballot. If passed, this initiative would enact a one-time, 5 percent tax on the net worth of billionaires living in California as of Jan. 1, 2026. An estimated <a href=\"https://www.nytimes.com/2026/01/20/us/california-billionaires-wealth-tax.html\" rel=\"noreferrer noopener\" target=\"_blank\">200 billionaires</a> would be liable to pay the tax. It would raise about $100 billion in revenue, 90 percent of which would be directed to health care.</p>\n<p>Opponents of the wealth tax were quick to slam the initiative. A number of billionaires publicly threatened to relocate on account of the tax, <a href=\"https://prospect.org/2026/01/22/non-exodus-california-billionaires-wealth-tax/\" rel=\"noreferrer noopener\" target=\"_blank\">like</a> Google cofounders Larry Page and Sergey Brin and Palantir cofounder Peter Thiel. </p>\n<p>Gov. Gavin Newsom (D) and many of the<a href=\"https://www.politico.com/newsletters/california-playbook/2026/01/16/gov-field-isnt-buying-the-wealth-tax-00733083\" rel=\"noreferrer noopener\" target=\"_blank\"> current candidates</a> competing to replace him as governor have also come to their defense, <a href=\"https://www.nytimes.com/2026/01/13/us/newsom-billionaire-tax-california.html\" rel=\"noreferrer noopener\" target=\"_blank\">bemoaning</a> the stifling of innovation and long-term loss of tax revenue a Golden State billionaire exodus would cause. One detractor, Derik Kauffman, went so far as to <a href=\"https://www.sfexaminer.com/news/technology/founder-behind-sf-billionaires-march-says-hes-sincere/article_1842be47-58a5-430c-b322-dff8910aa98f.html\" rel=\"noreferrer noopener\" target=\"_blank\">organize a march in support of billionaires</a>. </p>\n<p>The wealth of America’s billionaires <a href=\"https://ips-dc.org/resource-richest-15-u-s-centi-billionaires-see-wealth-surge-33-percent-to-3-2-trillion/\" rel=\"noreferrer noopener\" target=\"_blank\">has climbed</a> to almost inconceivable heights in recent years. And although they may be smart and talented, this is largely because they are not paying their fair share in federal, state, or local taxes right now. </p>\n<p>Berkeley Professor <a href=\"https://www.theatlantic.com/economy/2026/01/california-wealth-tax-billionaire-migration/685779/?utm_campaign=work-in-progress&amp;utm_content=20260128&amp;utm_source=newsletter&amp;utm_medium=email&amp;lctg=6050e698f98ec7553cb8b56c&amp;utm_term=Work%20in%20Progress\" rel=\"noreferrer noopener\" target=\"_blank\">Emmanuel Saez estimates</a> that California’s roughly 200 billionaires collectively pay between $3 billion and $4 billion in state income taxes each year. That might seem like a lot, but it’s not really, considering that it’s only 0.2 percent of their total collective wealth. Let’s also not forget that they and the rest of the rich in America got another <a href=\"https://itep.org/tax-provisions-in-trump-megabill-national-and-state-level-estimates/\" rel=\"noreferrer noopener\" target=\"_blank\">massive tax break</a> with Republicans’ so-called “<a href=\"https://www.congress.gov/bill/119th-congress/house-bill/1/text\" rel=\"noreferrer noopener\" target=\"_blank\">One Big Beautiful Bill</a>” last summer.</p>\n<p>The 2026 Billionaire Tax Act would go a long way in helping California billionaires finally start paying their fair share in taxes back into the public systems — the schools, roads, courts and more — that allowed them to get so incredibly wealthy in the first place.</p>\n<p>While we should not dismiss the idea that some rich people may leave if such a tax is enacted, we should not allow those few individuals to hold the state hostage to their tax preferences. Especially because the evidence we have available today suggests that wealthy people do not move in droves when lawmakers raise their taxes. </p>\n<p>In his 2017 book, “<a href=\"https://www.sup.org/books/sociology/myth-millionaire-tax-flight\" rel=\"noreferrer noopener\" target=\"_blank\">The Myth of Millionaire Tax Flight: How Place Still Matters for the Rich</a>,” Cornell University Professor Cristobal Young found that just 2.4 percent of millionaires in America move to a different state every year — compared to 2.9 percent for the general population. He explains that millionaires are more rooted to their home bases because their financial success is intimately embedded within their communities given their powerful social and business connections.  </p>\n<p>More recent research corroborates Young’s findings. In December 2023, the Fiscal Policy Institute <a href=\"https://fiscalpolicy.org/migration\" rel=\"noreferrer noopener\" target=\"_blank\">reported</a> that the millionaire population in New York state had grown after tax hikes were instituted in 2017 and 2021. After <a href=\"https://ballotpedia.org/California_Proposition_30,_Sales_and_Income_Tax_Increase_Initiative_(2012)\">Proposition 30</a> went into effect California, state revenues increased by <a href=\"https://calbudgetcenter.org/resources/what-has-proposition-30-meant-for-california/\">$7 billion-$8 billion per year</a>, according to the California Budget &amp; Policy Center  — a sure sign the tax didn’t empty the state of millionaires. More recently, the Institute for Policy Studies found the same when they studied the <a href=\"https://ips-dc.org/report-wealth-expands-after-higher-state-taxes-on-high-income-earners/\" rel=\"noreferrer noopener\" target=\"_blank\">number of millionaires in Washington and Massachusetts</a> after they passed tax hikes on the rich in 2022. </p>\n<p>But even if billionaires do flee California in an attempt to avoid the tax, they will not be successful. That’s because the initiative would enact the one-time tax on their net worth in 2025. In other words, so long as they were living in California on<a href=\"https://www.nytimes.com/2026/01/20/us/california-billionaires-wealth-tax.html\" rel=\"noreferrer noopener\" target=\"_blank\"> Jan 1, 2026</a>, they’re paying it.  </p>\n<p>Those of us who have W-2 income and capital gains pay a lot of tax to make for a healthier, safer and well-educated California, as we should. It is the fair thing to do. The billionaires have to start paying their fair share too. We can no longer allow them to exploit tax loopholes that let their wealth grow to oligarchic levels while they benefit from public goods and services. </p>\n<p>Despite what the public whining from a few of them may suggest, if the initiative passes and they have to pay the tax, they will be absolutely fine, especially compared to the <a href=\"https://calbudgetcenter.org/resources/californias-persistent-poverty-crisis-2024-rates-remain-alarmingly-high/\" rel=\"noreferrer noopener\" target=\"_blank\">7 million Californians </a>who live in poverty. </p>\n<p>It is time California residents and lawmakers stand up and break free from the grip billionaires have on our tax policy. We can no longer let them dictate what is a reasonable tax policy when it comes to funding social and public services they rely on. </p>\n<p><em>Maureen Kennedy is a member of <a href=\"https://patrioticmillionaires.org/\">Patriotic Millionaires</a> and former deputy assistant secretary for policy at the Department of Housing and Urban Development during the Clinton administration. She also ran the Farmer’s Home Administration and was a real estate broker in the East Bay Hills.</em></p>",
            "kind": 1,
            "link": "https://thehill.com/opinion/finance/5754305-california-billionaire-tax-act/",
            "pub_date": "2026-02-26 21:10:51",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5755679,
            "title": "'Home Improvement' star Zachery Ty Bryan sentenced to 16 months in jail",
            "description": "<p>(<a href=\"https://www.newsnationnow.com/entertainment-news/home-improvement-zachery-ty-bryan-sentenced-jail-dui/\">NewsNation</a>) — “<a href=\"https://www.newsnationnow.com/entertainment-news/tim-allen-forgives-fathers-killer-erika-kirk/\">Home Improvement</a>” actor Zachery Ty Bryan was sentenced to over a year in jail for <a data-id=\"https://thehill.com/homenews/state-watch/5666678-new-laws-effective-2026/\" data-type=\"link\" href=\"https://thehill.com/homenews/state-watch/5666678-new-laws-effective-2026/\">driving under the influence</a> (DUI).</p>\n<p>The former child star was arraigned on Monday after he struck a plea deal with prosecutors over his 2024 DUI arrest, <a href=\"https://www.tmz.com/2026/02/23/zachery-ty-bryan-sentenced-to-over-a-year-jail/\" rel=\"noreferrer noopener\" target=\"_blank\">TMZ</a> and <a href=\"https://www.thewrap.com/industry-news/public-policy-legal/zachery-ty-bryan-sentenced-dui-home-improvement-tokyo-drift-star/\" rel=\"noreferrer noopener\" target=\"_blank\">The Wrap</a> reported.</p>\n<p>He pleaded guilty to not only driving under the influence, but also admitted to an enhancement for driving, which increases the severity of the charge, because his blood alcohol level was 0.15 percent or higher, which is nearly double the legal limit.</p>\n<p>Bryan was sentenced to 16 months in a county jail, with credit for 57 days served, according to TMZ.</p>\n<div class=\"wp-block-jetpack-slideshow aligncenter\" data-effect=\"slide\"><div class=\"wp-block-jetpack-slideshow_container swiper-container\"><ul class=\"wp-block-jetpack-slideshow_swiper-wrapper swiper-wrapper\"><li class=\"wp-block-jetpack-slideshow_slide swiper-slide\"><figure><img alt=\"\" class=\"wp-block-jetpack-slideshow_image wp-image-747525\" data-id=\"747525\" decoding=\"async\" src=\"https://www.nxsmediawire.com/wp-content/uploads/sites/107/2026/02/GettyImages-623136392.jpg?strip=1\"/><figcaption class=\"wp-block-jetpack-slideshow_caption gallery-caption\">Actor Zachery Ty Bryan attends the P.S. ARTS’ Express Yourself 2016 event at Barker Hangar on November 13, 2016 in Santa Monica, California.  (Photo by Paul Archuleta/FilmMagic)</figcaption></figure></li><li class=\"wp-block-jetpack-slideshow_slide swiper-slide\"><figure><img alt=\"\" class=\"wp-block-jetpack-slideshow_image wp-image-747527\" data-id=\"747527\" decoding=\"async\" src=\"https://www.nxsmediawire.com/wp-content/uploads/sites/107/2026/02/GettyImages-1370652785.jpg?strip=1\"/><figcaption class=\"wp-block-jetpack-slideshow_caption gallery-caption\">American child actor Zachery Ty Bryan, American child actor Taran Noah Smith, and American child actor Jonathan Taylor Thomas attend the 62nd Annual Hollywood Christmas Parade, held at KTLA Studios in Los Angeles, California, 28th November 1993.  (Photo by Vinnie Zuffante/Getty Images)</figcaption></figure></li><li class=\"wp-block-jetpack-slideshow_slide swiper-slide\"><figure><img alt=\"\" class=\"wp-block-jetpack-slideshow_image wp-image-747526\" data-id=\"747526\" decoding=\"async\" src=\"https://www.nxsmediawire.com/wp-content/uploads/sites/107/2026/02/GettyImages-140093734.jpg?strip=1\"/><figcaption class=\"wp-block-jetpack-slideshow_caption gallery-caption\">HOME IMPROVEMENT – “The Long and Winding Road” – Airdate: May 18, 1999. (Photo by ABC Photo Archives/Disney General Entertainment Content via Getty Images)\nZACHERY TY BRYAN;PATRICIA RICHARDSON;TARAN NOAH SMITH</figcaption></figure></li></ul><a class=\"wp-block-jetpack-slideshow_button-prev swiper-button-prev swiper-button-white\" role=\"button\"></a><a class=\"wp-block-jetpack-slideshow_button-next swiper-button-next swiper-button-white\" role=\"button\"></a><a aria-label=\"Pause Slideshow\" class=\"wp-block-jetpack-slideshow_button-pause\" role=\"button\"></a><div class=\"wp-block-jetpack-slideshow_pagination swiper-pagination swiper-pagination-white\"></div></div></div>\n<h2 class=\"wp-block-heading\">Zachery Ty Bryan’s legal troubles</h2>\n<p>The actor has had a string of run-ins with the law in recent years.</p>\n<p>Bryan was charged with felony strangulation, fourth-degree assault and interfering with making a police report after an argument with his girlfriend in October 2020, <a href=\"https://www.usmagazine.com/celebrity-news/news/home-improvements-zachery-ty-bryan-sentenced-to-16-months-in-jail-for-dui/\" rel=\"noreferrer noopener\" target=\"_blank\">Us Weekly reported</a>.</p>\n<p>He pleaded guilty to menacing and fourth-degree assault. He served seven days in jail and was placed on three years’ <a href=\"https://www.newsnationnow.com/us-news/sports/sports-headlines/ap-ncaa-puts-michigan-state-football-on-3-years-of-probation-for-recruiting-violations-under-mel-tucker/\" rel=\"noreferrer noopener\" target=\"_blank\">probation</a>.</p>\n<p>Three years later, Bryan was once again arrested and charged with fourth-degree felony assault, third-degree robbery and misdemeanor harassment, after he was allegedly involved in a physical altercation with another woman, according to Us Weekly.</p>\n<p>Following the 2023 arrest, he was sentenced to 36 months of supervised probation and seven days in jail.</p>\n<p>In 2024, he was arrested twice for DUIs.</p>\n<p>Bryan <a href=\"https://www.newsnationnow.com/entertainment-news/home-improvement-star-zachery-ty-bryan-arrested/\" rel=\"noreferrer noopener\" target=\"_blank\">was arrested</a> in November in Eugene, Ore., for allegedly violating his probation from a prior domestic violence conviction.</p>\n<p><em><strong>Editor’s Note</strong>: This story contains discussions of domestic violence. Reader discretion is advised. If you or someone you know is experiencing domestic violence or abuse, you can find resources and discreet ways to get help on the <a href=\"https://www.thehotline.org/\" rel=\"noreferrer noopener\" target=\"_blank\">National Domestic Violence Hotline website</a> or by calling 1-800-799-7233.</em></p>",
            "kind": 1,
            "link": "https://thehill.com/blogs/in-the-know/5755679-home-improvement-star-zachery-ty-bryan-sentenced-driving-under-influence/",
            "pub_date": "2026-02-26 21:10:51",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5756125,
            "title": "US women's hockey team captain: Trump joke 'distasteful'",
            "description": "<p>Hilary Knight, the captain of the <a data-id=\"https://thehill.com/homenews/administration/5752109-us-womens-gold-medal-trump-state-of-union-invite/\" data-type=\"link\" href=\"https://thehill.com/homenews/administration/5752109-us-womens-gold-medal-trump-state-of-union-invite/\">gold medal-winning</a> U.S. women’s hockey team, said Wednesday that President Trump’s “distasteful” joke about her squad should not overshadow their accomplishments. </p>\n<p>“I just thought the joke was distasteful and unfortunate, and I think just the way women are represented, it’s a great teaching point to really shine light on how women should be championed for their amazing feats,” Knight told reporters Wednesday, <a href=\"https://x.com/KING5Sports/status/2026850185222242796?s=20\">according to KING-TV in Seattle</a>. </p>\n<p>While talking on speakerphone with the U.S. men’s hockey team after their <a data-id=\"https://thehill.com/homenews/administration/5750297-patel-joins-us-hockey-gold/\" data-type=\"link\" href=\"https://thehill.com/homenews/administration/5750297-patel-joins-us-hockey-gold/\">Sunday victory</a> in the Winter Olympics gold medal game over Canada, President Trump invited them to the White House.</p>\n<p>“We’re going to have to bring the women’s team, you do know that,” he quipped, joking that he would be impeached if he did not do so. The joke elicited laughter from the players.</p>\n<p>The men’s team <a data-id=\"https://thehill.com/homenews/media/5752444-state-of-the-union-us-mens-olympic-hockey-team-milan/\" data-type=\"link\" href=\"https://thehill.com/homenews/media/5752444-state-of-the-union-us-mens-olympic-hockey-team-milan/\">appeared</a> at Trump’s <a data-id=\"https://thehill.com/homenews/administration/5754028-trump-state-of-the-union-memorable-moments/\" data-type=\"link\" href=\"https://thehill.com/homenews/administration/5754028-trump-state-of-the-union-memorable-moments/\">State of the Union address</a> on Tuesday, <a data-id=\"https://thehill.com/homenews/administration/5754101-trump-state-union-address-takeaways/\" data-type=\"link\" href=\"https://thehill.com/homenews/administration/5754101-trump-state-union-address-takeaways/\">during which</a> the president said <a data-id=\"https://thehill.com/homenews/administration/5753823-hellebuyck-receives-presidential-honor/\" data-type=\"link\" href=\"https://thehill.com/homenews/administration/5753823-hellebuyck-receives-presidential-honor/\">he will award goaltender</a> Connor Hellebuyck with the Presidential Medal of Freedom. Hellebuyck had 41 saves in the U.S.’s 2-1 overtime victory against Canada.</p>\n<p>The women’s team, meanwhile, was unable to visit the White House this week due to professional and academic commitments. The women’s team is comprised of a mix of Professional Women’s Hockey League stars and collegiate players, while the men’s team features only NHL players. </p>\n<p>“Players are back competing with their professional and collegiate teams and are in the midst of their season,” a USA Hockey spokesperson told Front Office Sports, regarding the women’s team. </p>\n<p>“They’re honored and grateful to be invited and any opportunity to visit the White House as a team will be based on their schedules once their seasons conclude,” they added.</p>\n<p>Members of the men’s and women’s teams have touted their relationship with each other in recent days. </p>\n<p>Knight, who has represented the U.S. in the last five Winter Olympics, said on ESPN’s <a href=\"https://x.com/SportsCenter/status/2026758406070047189?s=20\">“SportsCenter”</a> Wednesday that “there’s a genuine level of support there and respect” between the two teams “that’s being overshadowed by a quick lapse.”</p>\n<p>Jack Hughes, who scored the winning goal in the victory over Canada, struck a similar tone Wednesday on Trump’s remarks. </p>\n<p>“You’re in the moment and the president calls. We’re blaring the music. It is what it is,” Hughes told reporters, after his first game back with the New Jersey Devils, <a href=\"https://apnews.com/article/trump-winter-olympics-us-womens-hockey-b65eb29ad211f45d394aea730c7c7834\">according to The Associated Press</a>.</p>\n<p>“We have so much respect for the women’s team and they have so much respect for us,” he added. “We are all just proud Americans.”</p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/administration/5756125-us-womens-hockey-captain-hilary-knight-trump-state-of-the-union-joke/",
            "pub_date": "2026-02-26 21:00:54",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5753138,
            "title": "Falling crime and a strong border haven't lifted Trump's ratings — why not?",
            "description": "<blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\">\n<p>Stand in a grocery store checkout line, and the last few years show up on the receipt.</p>\n<p>Inflation has cooled dramatically from its peak. Economists are right about that. Prices are no longer rising at the pace they were two years ago. But the total at the bottom of the receipt still hits hard. Lower inflation means slower increases — not a return to earlier costs. Families reorganized budgets. They absorbed the shock, and the memory of strain remains.</p>\n<p>Now consider the broader picture. On paper, the shifts of the past year are significant. Inflation has fallen sharply. The stock market has returned to record territory. Unemployment remains historically low. Gas prices are down from the highs that rattled households.</p>\n<p>At the southern border, the operational reality looks markedly different from four years ago, when major enforcement policies were reversed and programs like “Remain in Mexico” were ended. At that time, incentives shifted, crossings surged and the system strained visibly. Americans watched images of overwhelmed facilities and chaotic crossings and formed an impression that ran deep.</p>\n<p>Today, encounters are dramatically lower. Enforcement is much tighter. The border is more controlled than it has been in years. The difference is operational and measurable.</p>\n<p>Violent crime tells a similar story. After the pandemic-era spike that sent homicide rates soaring, national data and reporting from major metropolitan areas show one of the steepest year-over-year declines in decades. In several large cities, murders have fallen at double-digit rates. Lives that might have been lost were not. Neighborhoods that felt unstable are experiencing relief.</p>\n<p>These are consequential reversals. And yet presidential approval remains underwater.</p>\n<p>For President Trump, this disconnect between measurable progress and public approval reveals something deeper about how leadership is processed in modern America.</p>\n<p>The old equation was straightforward: Improve conditions, and voters will reward you. Restore order, and confidence will follow. Deliver economic stability, and approval rises.</p>\n<p>But that equation is no longer automatic.</p>\n<p>Most Americans are not blind to improvement. They understand the border is more controlled than during the period of peak disorder. They see crime statistics trending downward. They know inflation is no longer surging. But acknowledgment is not the same as trust. </p>\n<p>Instability leaves an imprint. Families adjust finances. Communities adapt to disruption. Voters form conclusions about competence and direction long before conditions stabilize. When order returns, it does not erase memory overnight.</p>\n<p>Then there’s tone. Trump isn’t merely a policy actor — he is a polarizing presence. Supporters view confrontation as strength. Opponents experience it as provocation. The intensity of opposition toward him is extraordinary, and his rhetoric has consistently supplied fuel for it.</p>\n<p>Tone does not negate policy gains, but it shapes whether those gains expand confidence beyond the base. Escalation energizes loyalty, but it rarely broadens trust.</p>\n<p>Republican leaders often operate within that same confrontational current. Democratic leaders face a different temptation: to treat improvement as irrelevant if acknowledging it risks validating an opponent. When border encounters drop sharply, the instinct is often to emphasize what remains broken rather than what has changed. When crime falls, the response is to question the data or shift focus elsewhere.</p>\n<p>Both instincts narrow the field. One mistakes intensity for persuasion. The other mistakes resistance for principle.</p>\n<p>The result is a paradox. A president can preside over falling homicide rates, sharply reduced border encounters, cooling inflation, and strong employment, and still struggle to expand approval beyond hardened lines.</p>\n<p>The improvements remain significant. Lower homicide rates save lives. Reduced border encounters alter operational realities. Cooling inflation eases pressure. Strong employment expands opportunity.</p>\n<p>But results do not interpret themselves.</p>\n<p>Leadership is not only about producing results. It’s about helping people make sense of them. It’s about connecting statistics to lived experience. It’s about projecting steadiness in posture as well as policy.</p>\n<p>In a polarized era, performance alone does not carry the day. Story matters more than statistics. For Republicans, that means translating policy wins into the language of stability rather than grievance and allowing governance, at least occasionally, to step out of campaign mode.</p>\n<p>For Democrats, it means competing on future vision rather than permanent alarm. When measurable improvements occur, acknowledging them strengthens credibility rather than weakening opposition.</p>\n<p>American history offers perspective. The country has endured volatility before. Markets rebound. Crime recedes. Border flows shift. Institutions adjust.</p>\n<p>The open question is whether leaders adjust with the same discipline. Progress matters. But today, people follow more than performance. They follow the story that helps them make sense of change, and the tone that tells them whether stability is real.</p>\n<p>Governing well remains essential. Helping a divided nation believe what has improved may be the harder task.</p>\n<p><em>Jeff Evans is a political consultant, leadership communications advisor, and author of </em><a href=\"https://www.amazon.com/Storytelling-Leadership-Influence-Leaders-Meaning-ebook/dp/B0GDQDYLJ9\" rel=\"noreferrer noopener\" target=\"_blank\">“<em>Storytelling for Leadership and Influence</em>.”</a></p>\n</blockquote>",
            "kind": 1,
            "link": "https://thehill.com/opinion/white-house/5753138-inflation-border-crime-leadership/",
            "pub_date": "2026-02-26 20:51:43",
            "source": "thehill",
            "language": "en"
        }
    ]
}