{
    "data": [
        {
            "id": 5759772,
            "title": "RFK Jr. tells Joe Rogan he was not 'particularly happy' with Trump's glyphosate order",
            "description": "<p>Health and Human Services Secretary Robert F. Kennedy Jr. said in an interview that aired Friday that President Trump’s order <a href=\"https://thehill.com/policy/energy-environment/5745981-glyphosate-trump-order-maha-opposition/\" rel=\"noreferrer noopener\" target=\"_blank\">bolstering the controversial herbicide glyphosate</a> was “not something that I was particularly happy with.”</p>\n<p>Kennedy’s remarks to podcaster Joe Rogan departed somewhat from <a href=\"https://www.youtube.com/watch?v=wk7DQom821s\" rel=\"noreferrer noopener\" target=\"_blank\">his previous defense</a> of Trump’s move — though the Health secretary also expressed sympathy for the president’s position.</p>\n<p>“It’s not a good thing to have in your food so … it’s not something that I was particularly happy with. Let me put it that way, mildly,” he said.</p>\n<p>“But I also understand the president’s point of view,” he added. “If you ban glyphosate overnight, or if you got rid of it … it would destroy the American food system.”</p>\n<p>Kennedy <a href=\"https://thehill.com/policy/healthcare/5750676-kennedy-doubles-down-on-defense-of-trump-glyphosate-order-amid-maha-backlash/\" rel=\"noreferrer noopener\" target=\"_blank\">previously defended</a> Trump’s order, which said that pesticide companies should have “immunity” on glyphosate.</p>\n<p>“I support President Trump’s Executive Order to bring agricultural chemical production back to the United States and end our near-total reliance on adversarial nations,” he wrote in a post   Sunday night on social platform X.</p>\n<p>The nation’s top health official and his allies in the “Make America Healthy Again” movement have been <a href=\"https://thehill.com/policy/energy-environment/5685317-maha-pesticides-glyphosate-roundup-bayer-rfk-jr/\" rel=\"noreferrer noopener\" target=\"_blank\">critical of pesticides</a>, especially glyphosate.</p>\n<p>Trump’s order <a href=\"https://thehill.com/policy/healthcare/5753291-trump-mha-glyphosate-controversy/\" rel=\"noreferrer noopener\" target=\"_blank\">ignited a furor</a> among supporters of the group, which has been affiliated with the president.</p>\n<p>Glyphosate has been the key ingredient in Roundup weedkiller. Thousands of lawsuits have alleged that it is linked to cancer. </p>\n<p>Bayer, which owns Roundup-maker Monsanto, says that the chemical is not harmful. The company recently announced a settlement agreement with plaintiffs suing over the glyphosate.</p>",
            "kind": 1,
            "link": "https://thehill.com/policy/energy-environment/5759772-rfk-jr-joe-rogan-trump-glyphosate-order-maha/",
            "pub_date": "2026-02-28 08:06:49",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5759750,
            "title": "Bill Clinton gets bipartisan praise for cooperating in historic deposition on Epstein",
            "description": "<p>Both Republicans and Democrats said former President Clinton was “very cooperative” in a historic deposition with the House Oversight and Government Reform Committee on Friday that set a new precedent for how congressional investigators treat former presidents.</p>\n<p>“He did attempt to respond to every single question asked, even when his attorney told him to shut up,” House Oversight Committee Chair James Comer (R-Ky.) said after the deposition.</p>\n<p>“This was historical,” Comer said. “I believe that in the history of Congress, the two highest ranked officials to ever be deposed by Congress would be President Bill Clinton and Secretary of State Hillary Clinton.”</p>\n<p>Comer said the panel “picked up some new facts” and that lawmakers asked the Clintons where they should go from here in their Jeffrey Epstein investigation.</p>\n<p>“We’re going to bring more people in. We’re not finished,” Comer said.</p>\n<p>Comer has previously said it is “very possible” that Commerce Secretary Howard Lutnick will be asked to testify on Epstein. And he alluded to calls from some Republican members of the committee to scrutinize women who were both victims of Epstein and helped funnel young women to him.</p>\n<p>“I think one of the issues we have can you be a victim and a victimizer?” Comer said.</p>\n<p>Bill Clinton, who had spent time with Epstein and flew on his plane in the 1990s and early 2000s, said in his opening statement that he “did nothing wrong” and had “no idea of the crimes” Epstein was committing. He noted he was no longer associated with Epstein by the time he was convicted of sex crimes in 2008. </p>\n<p>“As someone who grew up in a home with domestic abuse, not only would I not have flown on his plane if I had any inkling of what he was doing — I would have turned him in myself and led the call for justice for his crimes, not sweetheart deals,” Clinton said.</p>\n<p>Comer said that going forward, the panel will be most interested in individuals who spent time with Epstein after his first conviction.</p>\n<p>Some Republicans on the panel dismissed Clinton’s denials.</p>\n<p>“Riiight. This gaslighting is top shelf. Slick Willie is at it again,” Rep. Lauren Boebert (R-Colo.) <a href=\"https://x.com/RepBoebert/status/2027492769380409622?s=20\" rel=\"noreferrer noopener\" target=\"_blank\">posted on social platform X</a>.</p>\n<p>The former president and former Secretary of State Hillary Clinton, who was deposed on Thursday, sat for depositions about seven months after being subpoenaed by the committee in its investigation into matters surrounding Epstein. They first resisted, saying they had no knowledge of his criminal activities and arguing the subpoenas were invalid, before relenting this month as they faced being held in contempt of Congress for refusing to comply with a congressional subpoena.</p>\n<p>Hillary Clinton <a href=\"https://thehill.com/homenews/house/5756577-clintons-questioned-epstein-links/\" rel=\"noreferrer noopener\" target=\"_blank\">testified before the committee</a> Thursday, telling lawmakers she did not recall ever meeting Epstein and had no information about Epstein’s criminal activities.</p>\n<p>Both Republicans and Democrats said Friday that Bill Clinton answered lawmakers’ questions in good faith, even as the former president had warned he would often say he did not recall: “That might be unsatisfying. But I’m not going to say something I’m not sure of. This was all a long time ago.”</p>\n<p>There was some praise across the aisle from Rep. Nancy Mace (R-S.C.) to Rep. Melanie Stansbury (D-N.M.): “Representative Stansbury had a lot of courageous questions. She showed bravery today.”</p>\n<p>But Rep. Wesley Bell (D-Mo.) said Republicans were “unprofessional.”</p>\n<p>“When we hear members from other side coming into a deposition with conclusions, get no evidence to support those conclusions, and then announce to the world that these conclusions must be true. That is unprofessional. It’s unethical,” Bell said.</p>\n<p>Rep. Anna Paulina Luna (R-Fla.) told reporters that she believes Epstein was an “intelligence asset and running some form of a honey pot operation” and that she believes “President Clinton as well as the secretary were potentially targets of that operation.” Other members did not echo those assertions.</p>\n<p>A full transcript and video of the deposition is expected to be released, which Democrats are urging to happen quickly. Comer said the panel has just one employee who does the videography and is working to prepare the video, and both sides have to approve a transcript before it is publicly released.</p>\n<p>Democrats are saying that by compelling Clinton’s testimony, the deposition has changed the dynamic between Congress and the president; and they are calling for the same standard for President Trump.</p>\n<p>“Before this, we had the Trump rule. Trump defied, as all of you know, a congressional subpoena with the Jan. 6 Committee. He said, ‘presidents don’t have to testify,’” Rep. Ro Khanna (D-Calif.) said in a press conference before the deposition. “Now we have the Clinton rule, which is that presidents and their families have to testify when Congress issues a subpoena, and that means that Donald Trump needs to come before our committee and explain what he knew about Epstein and explain why we have not had a full release of the documents.”</p>\n<p>Back in Washington, Trump <a href=\"https://thehill.com/homenews/5759183-trump-says-hes-not-happy-to-see-bill-clinton-deposed-over-epstein-files/\" rel=\"noreferrer noopener\" target=\"_blank\">acknowledged the precedent</a> set by the deposition taking place — and how that could affect him in the future.</p>\n<p>“I don’t like seeing him deposed, but they certainly went after me a lot more than that,” Trump told reporters before departing the White House for Texas.</p>\n<p>Comer addressed Democrats’ calls for Trump to testify, defending the president by giving reporters a readout of a line of questioning by Rep. Robert Garcia (Calif.), the top Democrat on the panel.</p>\n<p>“Ranking member Garcia asked President Clinton, quote, ‘Should President Trump be called to answer questions from this committee?’ And President Clinton said, ‘That’s for you to decide.’ And the president went on to say that the President Trump has never said anything to me to make me think he was involved,” Comer said during a break in the questioning.</p>\n<p>Asked about that, Garcia said: “I think the best response is for you to view the complete record of what actually he said.”</p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/house/5759750-bill-clinton-epstein-deposition/",
            "pub_date": "2026-02-28 08:06:48",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5759771,
            "title": "Duffy's wife knocks Trump's Venezuela policy: 'We're getting a little too cozy'",
            "description": "<p>Fox News host Rachel Campos-Duffy, who is also the wife of Transportation Secretary Sean Duffy, criticized President Trump for getting “too cozy” with acting Venezuelan President Delcy Rodríguez, calling the leader a “communist.”  </p>\n<p>“We’re getting a little too cozy with Delcy Rodríguez. This is a hardcore communist. She can never be trusted,” Campos-Duffy <a href=\"https://x.com/RCamposDuffy/status/2027384011006353633?s=20\">said Friday on Fox News</a>. “She is detested by the Venezuelan people. </p>\n<p>“María Corina will win that election,” she added, referring to Venezuela’s opposition leader Maria Corina Machado.</p>\n<p>Rodríguez became acting president of the South American nation after the U.S. <a href=\"https://thehill.com/policy/defense/5671368-us-forces-capture-maduro/\">captured and arrested</a> ex-leader Nicolás Maduro and his wife last month, who both <a href=\"https://thehill.com/regulation/court-battles/5673103-maduro-pleads-not-guilty/\">pleaded not guilty</a> to drug-trafficking and weapons-related charges. </p>\n<p>Earlier this month, Rodríguez drew criticism for saying that <a href=\"https://thehill.com/homenews/administration/5741326-trump-delcy-rodriguez-venezuela-maduro-ouster/\">Maduro was still the rightful leader</a> of Venezuela. But Trump responded that the two “have a great relationship” and that “politically, maybe she has to say that.” </p>\n<p>Trump’s latest comments signal he’s maintained a close relationship with Rodríguez since calling her a “<a href=\"https://www.politico.com/news/2026/01/14/trump-delcy-rodriguez-venezuela-00730397\">terrific person</a>” following their phone call after Maduro was removed.</p>\n<p>“This partnership between the United States of America and Venezuela will be a spectacular one FOR ALL,” Trump <a href=\"https://truthsocial.com/@realDonaldTrump/posts/115895806350456434\">said on Truth Social</a> on Jan. 14. “Venezuela will soon be great and prosperous again, perhaps more so than ever before!” </p>\n<p>Rodríguez <a href=\"https://x.com/delcyrodriguezv/status/2011557862380871974\">described</a> the phone call as a “long and courteous conversation.”</p>\n<p>The Trump administration has sought to tap into Venezuela’s abundant oil reserves since taking Maduro and his wife into custody. </p>\n<p>Energy Secretary Chris Wright told <a href=\"https://www.nbcnews.com/world/venezuela/maduro-legitimate-president-venezuela-delcy-rodriguez-interview-trump-rcna258687\">NBC News</a> that working with Rodríguez has “been an amazing cooperation,” and that she has “delivered information.” He added that she had “made enormous positive changes” to Venezuela’s petroleum policies. </p>\n<p>Campos-Duffy has been outspokenly supportive of Machado. When Maduro was first captured, Campos-Duffy <a href=\"https://www.mediamatters.org/rachel-campos-duffy/fox-host-rachel-campos-duffy-suggests-trump-administration-should-install-maria\">said</a> in an interview with fellow Fox News host Lawrence Jones that “we would be better off” by putting “the woman who won the election back in office.” </p>\n<p>Machado wanted to be a part of the nation’s 2024 election cycle but was banned from participating. Instead, she backed the opposing party, led by Edmundo González, who claimed the election Maduro won was rigged. Some <a href=\"https://thehill.com/policy/international/4811599-venezuela-maduro-election-tally/\">data</a> showed González beat Maduro by more than double the votes.</p>\n<p>Campos-Duffy sat for an <a href=\"https://www.foxnews.com/video/6387811908112\">interview with Machado</a> shortly after she returned from a White House visit, where she gifted Trump her own Nobel Peace Prize medal for ending Maduro’s authoritarian reign of Venezuela.</p>\n<p>Initially, following the military operation where Maduro was captured, Trump said Machado didn’t have the “respect” of the Venezuelan people. But Machado has <a href=\"https://thehill.com/policy/international/5717234-maria-corina-machado-venezuela-presidency/\">said she will be president</a> of Venezuela “when the time comes.” </p>\n<p>“She respects President Trump. She respects President Trump so much… she knows where the bodies are buried here and I think she will work closely with Marco Rubio and with President Trump to put this country back on track,” Campos-Duffy said in her interview with Jones. “I’m very worried about the fact that we cannot trust Delcy Rodríguez. She is a bad, bad lady.”</p>",
            "kind": 1,
            "link": "https://thehill.com/policy/international/5759771-campos-duffy-venezuela-trump/",
            "pub_date": "2026-02-28 08:06:48",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5759573,
            "title": "Stephen A. Smith on White House bid: 'Come up with a way for me to keep my money'",
            "description": "<p>Sports commentator Stephen A. Smith on Thursday addressed rumors that he could <a href=\"https://thehill.com/homenews/campaign/5737806-stephen-a-smith-2028-trump/\" rel=\"noreferrer noopener\" target=\"_blank\">launch a bid</a> to run for president in 2028 but said he needs to think up of a way for him to keep his money.</p>\n<p>“I’m telling you, if there was a way for me to be on that big debate stage and I didn’t have to give up my money to be on that debate stage, my brother, you look out,” Smith said in an interview on “<a href=\"https://www.youtube.com/watch?v=a1FYZA84f6U\" rel=\"noreferrer noopener\" target=\"_blank\">The Rubin Report</a>” podcast with host Dave Rubin.</p>\n<p>Rubin asked Smith if he was doing a “media play” to see if running is a viable option or if he is serious about tossing his hat in the race.</p>\n<p>“What I’m saying, Mr. Rubin, is this: Come up with a way for me to keep my money,” he exclaimed. “And I’m like, ‘I’ll show up!'”</p>\n<p>The two talked about Smith’s politics, referring to himself as socially liberal and fiscally conservative. He said he would run as a Democrat. </p>\n<p>“Well, first of all, I’ve never considered myself conservative when it came to social issues, anything outside of fiscal issues,” Smith said when Rubin asked why he would run as a Democrat. “I’ve always considered myself a liberal.”</p>\n<p>He said he was pro-choice despite being against abortion because he doesn’t “believe in telling a woman what to do with her body.” Smith added that he is also supportive of the LGBTQ community and said free-market capitalism and national security are issues that “matter” to him</p>\n<p>Smith made similar remarks during an <a href=\"https://thehill.com/blogs/in-the-know/5620799-stephen-smith-politics-2028/\" rel=\"noreferrer noopener\" target=\"_blank\">interview with The Hill</a> in November. He said at the time, which he has repeated since, that he is not ruling out a run and a chance to be on the debate stage next year.</p>\n<p>“I love what I do, and I’m not willing to give up my money,” said Smith, <a href=\"https://www.nytimes.com/athletic/6634775/2025/09/17/stephen-a-smith-espn-politics-sirius/\" rel=\"noreferrer noopener\" target=\"_blank\">who reportedly makes</a> $40 million a year.</p>\n<p>Smith has floated the idea of running for president in 2028 for several months now, becoming more outspoken about current politics and the divisions between Democrats and Republicans. </p>\n<p>On Wednesday, he said President Trump played Democrats “<a href=\"https://thehill.com/homenews/media/5757144-donald-trump-democrats-immigration-stephen-a-smith/\" rel=\"noreferrer noopener\" target=\"_blank\">like a fiddle</a>” when the president pressed Democrats on the issue of immigration during his State of the Union address the night before.</p>\n<p>Smith accused Democrats of hating Trump so much and expressing their “own personal feelings and animus towards him.”</p>\n<p>“And every time you do that, he smiles and mocks you and has a field day,” the commentator said.</p>",
            "kind": 1,
            "link": "https://thehill.com/blogs/in-the-know/5759573-smith-money-presidential-bid/",
            "pub_date": "2026-02-28 07:41:07",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5759557,
            "title": "Hillary Clinton spokesperson spars with Nancy Mace over 'screaming' claim",
            "description": "<p>Hillary Clinton’s spokesperson, Nick Merrill, said Rep. Nancy Mace (R-S.C.) is “full of s‑‑‑” for alleging the former secretary of State was “screaming” and “unhinged” during a deposition she gave related to an investigation into convicted sex offender Jeffrey Epstein. </p>\n<p>“Was she appalled that Congresswoman Mace wouldn’t let her answer a question about her work as a senator after the murder of 3,000 Americans on 9/11? Absolutely,” Merrill <a href=\"https://x.com/alivitali/status/2027427201902112937?s=20\" rel=\"noreferrer noopener\" target=\"_blank\">reportedly told</a> Ali Vitali, the host of MS NOW’s “Way Too Early.”</p>\n<p>“If Hillary Clinton’s spokesperson is scared about my line of questioning from yesterday and how unglued Hillary became (screaming at me); just wait until I get in front of Bill,” Mace <a href=\"https://x.com/RepNancyMace/status/2027437649980453153\" rel=\"noreferrer noopener\" target=\"_blank\">wrote in response</a> to her reported questions.</p>\n<p>The Clintons were <a href=\"https://thehill.com/homenews/house/5755536-clintons-depositions-epstein-investigation/\" rel=\"noreferrer noopener\" target=\"_blank\">subpoenaed to give depositions</a> before the House Oversight and Government Reform Committee after former President Clinton appeared in photos released with the Epstein files.</p>\n<p>In her deposition Thursday, Hillary Clinton said she did not have any information regarding Epstein and <a href=\"https://thehill.com/homenews/house/5756577-clintons-questioned-epstein-links/\" rel=\"noreferrer noopener\" target=\"_blank\">denied having ever encountered him</a>. Bill Clinton was testifying Friday.</p>\n<p>“You made something up. I corrected you,” Merrill <a href=\"https://x.com/NickMerrill/status/2027439184001085669?s=20\" rel=\"noreferrer noopener\" target=\"_blank\">responded to Mace on social platform X</a> less than 10 minutes later. “You can become unglued all you want today, just tell the truth.”</p>\n<p>Rep. Anna Paulina Luna (R-Fla.) backed up Mace’s claims, <a href=\"https://x.com/RepLuna/status/2027438931050950674\" rel=\"noreferrer noopener\" target=\"_blank\">saying in a post on X</a> that “Secretary Clinton did lose her cool” and “You’ll hear it on the audio.”</p>\n<p>“Even your Republican colleague is hedging in her agreement,” Merrill <a href=\"https://x.com/NickMerrill/status/2027442195314196956\" rel=\"noreferrer noopener\" target=\"_blank\">responded to Luna’s post</a>. </p>\n<p>Mace later posted a more detailed explanation of her claims after Merrill’s jabs that the congresswoman called a “spin” on “Hillary’s meltdown.” </p>\n<p>“Let me be abundantly clear: Hillary Clinton shamefully used the terrorist attack of 9/11 as a scapegoat to cover for her and her family’s close relationship with Howard Lutnick, Jeffrey Epstein and Ghislaine Maxwell,” Mace <a href=\"https://x.com/RepNancyMace/status/2027443637928243401?s=20\" rel=\"noreferrer noopener\" target=\"_blank\">wrote on X</a>. “In fact, Lutnick appeared to be key to Hillary trying to fundraise off Epstein for her failed presidential campaign LONG after Epstein was a well-known convicted pedophile (2015).”</p>\n<p>“Keep spinning Hillary, cause that’s what you have to do your part in one of the greatest cover ups in American history,” Mace concluded.</p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/house/5759557-nancy-mace-hillary-clinton-deposition-clash/",
            "pub_date": "2026-02-28 07:06:38",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5759646,
            "title": "Trump calls out to Texas GOP Senate candidates, stops short of endorsement",
            "description": "<p>President Trump gave shoutouts to the three Republicans running the Texas Senate primary race during a speech in which they were all in attendance in Corpus Christi on Friday, but he stopped short of endorsing in the race. </p>\n<p>“We have a great Attorney General Ken Paxton. Where’s Ken? Hi, Ken,” Trump said during his remarks. “And we have a great senator, John Cornyn. Hi, John. Thank you, John.” </p>\n<p>“They’re in a little race together. You know that, right,” he continued. “It’ll be an interesting one, right? They’re both great people too. Thank you both very much. I appreciate it.” </p>\n<p>Trump went on to give shoutouts to the rest of the state’s congressional delegation, including Rep. Wesley Hunt (R-Texas), who is also running in the primary with Cornyn and Paxton. </p>\n<p>“Another friend of mine who’s doing really well, Wesley Hunt. Where’s Wesley?” he said, adding “You’re doing a good job.” </p>\n<p>“Well, you do have an interesting election. You have a couple of them going on,” the president continued. </p>\n<p>Trump’s comments come days before Cornyn, Paxton and Hunt face off against each other in the primary Tuesday. </p>\n<p>The president told reporters before the speech that he has “pretty much” decided on whom to endorse in the primary, but he declined to name a candidate. </p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/administration/5759646-texas-senate-primary-trump/",
            "pub_date": "2026-02-28 07:06:37",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5757739,
            "title": "Live updates: Bill Clinton says he had 'no idea' of Epstein's crimes; Pentagon bars Anthropic",
            "description": "<p>Former President Clinton is sitting for <a href=\"https://thehill.com/homenews/house/5758483-bill-clinton-closed-door-testimony-epstein-files-house-oversight/\" rel=\"noreferrer noopener\" target=\"_blank\">a deposition in New York</a> before the House Oversight and Government Reform Committee in its probe of convicted sex offender Jeffrey Epstein.</p>\n<p>Ahead of his closed-door testimony, he released an opening statement <a href=\"https://x.com/BillClinton/status/2027424128559452573\" rel=\"noreferrer noopener\" target=\"_blank\">on social media</a>, saying he had “no idea of the crimes Epstein was committing” and “saw nothing that ever gave” him pause.</p>\n<p>As a deadline passed for artificial intelligence firm Anthropic to agree to the Pentagon’s terms of usage, Defense Secretary <a href=\"https://thehill.com/people/pete-hegseth/\">Pete Hegseth </a>said the Pentagon is designating Anthropic as a supply chain risk shortly after <a href=\"https://thehill.com/people/donald-trump/\">President Trump </a>directed all federal agencies <a href=\"https://thehill.com/policy/technology/5759399-trump-bans-anthropic-tech/\" rel=\"noreferrer noopener\" target=\"_blank\">to cease using the company’s technology</a> amid an ongoing feud with the Department of Defense (DOD).  </p>\n<p>Trump is in Texas, a visit related to energy policy. His <a href=\"https://thehill.com/homenews/campaign/5757641-trump-texas-senate-gop-primary/\" rel=\"noreferrer noopener\" target=\"_blank\">presence looms large</a> in the Lone Star State, where he has yet to make a coveted endorsement in a three-way GOP Senate primary. But he’s invited state Attorney General Ken Paxton, Sen. John Cornyn and Rep. Wesley Hunt to <a href=\"https://thehill.com/homenews/campaign/5758707-cornyn-paxton-hunt-texas-senate-trump-event/\" rel=\"noreferrer noopener\" target=\"_blank\">attend the event</a>. Senate Majority Leader John Thune (R-S.D.) <a href=\"https://thehill.com/homenews/state-watch/5758488-john-thune-texas-senate-race-democrats/\" rel=\"noreferrer noopener\" target=\"_blank\">warned Republicans could lose</a> the seat.</p>\n<p>In a gaggle as he left the White House, Trump <a href=\"https://thehill.com/policy/international/5759118-cuba-friendly-takeover-trump/\" rel=\"noreferrer noopener\" target=\"_blank\">suggested</a> the U.S. could carry out a “friendly takeover” of Cuba and said he has not made a final decision on whether he will strike Iran, but he said <a href=\"https://thehill.com/homenews/administration/5759142-trump-iran-strike-decision/\" rel=\"noreferrer noopener\" target=\"_blank\">he was not happy</a> with the way Tehran was negotiating in talks with the U.S. over its nuclear program</p>\n<p>On Capitol Hill, some Republican lawmakers are <a href=\"https://hp.taboola.com/nexstar-thehill/log/3/click?pi=%2F&amp;ri=cf39b845b4e35fac3b6d11132c7b9b68&amp;sd=v2_01a7b8b0b87561cde9e1d6fa8c276a24_df8dfe4a-8af5-4527-a8e1-3a5b80c24788-tuctd57353a_1772198469_1772199425_CIi3jgYQw91eGM_qyPrJMyAGKAMw4QE4kaQOQMqRD0i0xdsDULcEWABgoB9ojNnH0eiTntKsAXABgAEAiAEA&amp;ui=df8dfe4a-8af5-4527-a8e1-3a5b80c24788-tuctd57353a&amp;ii=~~V1~~1797347118963188270~~Xl6k7qiKAMNJTl5yNAx9CA&amp;it=text&amp;pt=home&amp;li=rbox-h2v&amp;sig=920eec12c94137fdc13a4568e7a1fc8ebef07bef38e0&amp;st=f&amp;vi=1772199490895&lt;i=trecs&amp;r=457&amp;ppb=CMEE&amp;cpb=EhIyMDI2MDIyNi05LVJFTEVBU0UYwdXb0wYgACoZdXMudGFib29sYXN5bmRpY2F0aW9uLmNvbTIIdHJjMTAxMTU4gPCSmAZAkaQOSMqRD1C0xdsDWLcEYwjXFhDVHxgjZGMImbIBELXjARgkZGMI3AoQoBAYFmRjCJ5BEJZYGDZkYwj5__________8BEPn__________wEYB2RjCNIDEOAGGAhkYwiWFBCcHBgYZGMI96wBEIzcARgJZGMIqIUBEO6oARg6ZGMIrKQBENvPARgMZGMI4f__________ARDh__________8BGB9kYwjR__________8BENH__________wEYL2R4AYABAogB1bjsR5ABHJgB4ujE-skz2wEQAdwB&amp;cv=20260226-9-RELEASE&amp;route=US%3AUS%3AV&amp;pc=1&amp;url=https%3A%2F%2Fthehill.com%2Fhomenews%2Fhouse%2F5758046-republicans-stock-trading-ban-trump-state-of-the-union%2F%3Ftbref%3Dhp\" rel=\"noreferrer noopener\" target=\"_blank\">growing increasingly frustrated</a> with House GOP leadership over not moving quickly enough on a stock trading ban after Trump endorsed the push at Tuesday’s State of the Union.<strong> </strong></p>\n<p>Follow live below.</p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/administration/5757739-live-updates-trump-texas-bill-clinton-epstein/",
            "pub_date": "2026-02-28 07:06:37",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5759461,
            "title": "Harris backs Crockett in Texas Senate primary",
            "description": "<p>Former Vice President Kamala Harris is endorsing Rep. Jasmine Crockett (D-Texas) ahead of her high-profile Senate primary Tuesday.</p>\n<p>Harris lent her voice for a robocall urging Democrats to vote for Crockett, who is running against state Rep. James Talarico for the Democratic nomination to take Sen. John Cornyn’s (R-Texas) seat.</p>\n<p>“Texas has the chance to send a fighter like Jasmine Crockett to the United States Senate,” Harris says in the call, <a href=\"https://www.texastribune.org/2026/02/27/kamala-harris-jasmine-crockett-robocall-texas-senate-democratic-primary/\" rel=\"noreferrer noopener\" target=\"_blank\">The Texas Tribune</a> reported. “Jasmine has the experience and record to hold Donald Trump and his billionaire cronies accountable.”</p>\n<p>Harris urged Democrats to cast their ballots early Friday or in person Tuesday.</p>\n<p>“It’s time to turn Texas blue,” the former vice president says at the end of the call.</p>\n<p>The Hill has reached out to Harris’s and Crockett’s offices for comment.</p>\n<p>The two have been political allies since Crockett served as the national co-chair on Harris’s 2024 presidential campaign. Crockett also spoke at the Democratic National Convention when Harris became the nominee.</p>\n<p>Crockett has said she talked with Harris before plunging into the Senate race. She told <a href=\"https://www.youtube.com/live/LPbFXENWZPI?t=825s\">“Native Land Pod”</a> in December that she was not going to jump into the race “without having some real conversations with the vice president.”</p>\n<p>“And obviously, she didn’t just run in one state, she’s run in a lot of states, right?” Crockett said. “And to this day, she still remains a mentor and a friend and an auntie of sorts.”</p>\n<p>Crockett and Talarico are neck and neck in the <a href=\"https://polls.decisiondeskhq.com/averages/primary-ballot-test/2026-tx-us-senate-dem/texas/lv-rv-adults-independents-democrats\" rel=\"noreferrer noopener\" target=\"_blank\">Decision Desk HQ (DDHQ)</a> polling average, with 44.4 percent support for Talarico to Crockett’s 44.1 percent.</p>\n<p>Cornyn, meanwhile is in a highly competitive primary of his own, currently sitting at 33.9 percent, compared to 38.7 percent for Texas Attorney General Ken Paxton and 17.1 percent for Rep. Wesley Hunt, <a href=\"https://polls.decisiondeskhq.com/averages/primary-ballot-test/2026-tx-us-senate-gop/texas/republicans-lv-rv-adults-independents\" rel=\"noreferrer noopener\" target=\"_blank\">according to DDHQ</a>.</p>\n<p>The race is seen as a crucial one for both parties in the fight for control of the Senate. </p>\n<p>President Trump has declined to endorse in the GOP primary, saying of Paxton and Cornyn at an event in Texas on Friday, “they’re both great people.”</p>\n<p>All three Republicans were invited to meet with Trump during his stop in Corpus Christi.</p>\n<p> <audio src=\"https://www.texastribune.org/wp-content/uploads/2026/02/Harris-Crockett-robocall-1.mp3\"></audio></p>",
            "kind": 1,
            "link": "https://thehill.com/homenews/campaign/5759461-harris-crockett-texas-senate-democratic-primary-talarico/",
            "pub_date": "2026-02-28 06:41:00",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5759529,
            "title": "FEMA releasing billions in disaster assistance, while further funds await approval",
            "description": "<p>The Trump administration is releasing billions of dollars in disaster aid that were previously awaiting approval from Homeland Security Secretary Kristi Noem.</p>\n<p>A source familiar with the situation told The Hill that billions in combined public assistance and hazard mitigation funds are being awarded from the Federal Emergency Management Agency (FEMA) and that the funds were previously held up under Noem’s policy of personally reviewing major expenditures.</p>\n<p>FEMA’s public assistance funds <a href=\"https://www.fema.gov/sites/default/files/2020-07/fema_public-assistance-fact-sheet_10-2019.pdf\">help communities recover from disasters</a> while its hazard mitigation funds <a href=\"https://www.fema.gov/grants/mitigation\">help communities better prepare for future disasters</a>.</p>\n<p>The source said that more than $10 billion in public assistance funds are still awaiting approval. </p>\n<p>The source also said that Minnesota, Illinois, California, Colorado and the Virgin Islands are the only U.S. states and territories that would not receive public assistance awards in the tranche of funding.</p>\n<p>Spokespeople for FEMA and the Department of Homeland Security (DHS), which oversees FEMA, did not immediately respond to The Hill’s request for comment.</p>\n<p>However, a FEMA spokesperson confirmed to <a href=\"https://www.cnn.com/2026/02/26/politics/disaster-aid-fema-states-trump-shutdown\">CNN</a>, which first reported that some of the funds would be released, that it was doling out more than $5 billion.</p>\n<p>“This week, FEMA released over $5 billion in recovery funding for projects, some dating back as far as 15 years — a significant win for states, local governments, and hospitals,” the spokesperson said. “To be clear, this is about results, not politics.”</p>\n<p>“Regarding which projects are being funded, FEMA is prioritizing based on project readiness and strict oversight. Obligations are made when projects meet all necessary criteria. Decisions are not based on political considerations; the process is focused on merit and accountability,” they told CNN.</p>\n<p>DHS is requiring that all expenditures of more than $100,000 – including but not limited to FEMA funds –  get Noem’s personal approval before their release.</p>\n<p>The controversial policy has made headlines, including when FEMA staff <a href=\"https://thehill.com/policy/energy-environment/5468696-fema-letter-trump-administration-disaster-response/\">released a letter</a> criticizing the administration and saying that the policy ““reduces FEMA’s authorities and capabilities to swiftly deliver our mission.”</p>\n<p>The administration has also indicated that it plans to “reform” FEMA, though it has not yet released its plans for doing so. Reporting indicated that such changes could include cuts to FEMA staff.</p>\n<p>The funding releases come amid a federal government shutdown at DHS as Democrats and Republicans feud over immigration funding. However, FEMA has funding sources beyond the typical appropriations process through its Disaster Relief Fund, which cover many of its operations even if other appropriations have lapsed.</p>\n<p>The Trump administration has previously singled out California, Illinois, Colorado and Minnesota, <a href=\"https://thehill.com/policy/energy-environment/5725217-trump-blue-states-funding-minnesota-colorado-evs-hiv/\">revoking health and transportation funds</a> from those states earlier this month.</p>",
            "kind": 1,
            "link": "https://thehill.com/policy/energy-environment/5759529-billions-in-fema-funds-awarded/",
            "pub_date": "2026-02-28 06:11:37",
            "source": "thehill",
            "language": "en"
        },
        {
            "id": 5759346,
            "title": "More Americans sympathize with Palestinians over Israelis: Gallup",
            "description": "<p>New polling released on Friday reveals that more Americans say they sympathize with Palestinians than they do with Israelis, a new statistic coming several months after Israel and Hamas struck a deal to pause their devastating war in the Gaza Strip.</p>\n<p><a href=\"https://news.gallup.com/poll/702440/israelis-no-longer-ahead-americans-middle-east-sympathies.aspx\">Gallup</a> found that 41 percent of Americans sympathize with the Palestinians compared to the 36 percent who say they sympathize with the Israelis. The polling firm noted that although this difference is not statistically significant, it contrasts with the lead Israelis have had in similar polls over the past 24 years.</p>\n<p>Israelis consistently held a double-digit lead during that time, typically averaging a 43-point gap between 2001 and 2018. This started to narrow down in 2019, years before Hamas’s deadly attack on Israel on Oct. 7, 2023, and shifted further during Israel’s sweeping military campaign in Gaza.</p>\n<p>“The cumulative effect of gradual changes in U.S. attitudes since then has led to the Israelis no longer being viewed more sympathetically,” Gallup stated.</p>\n<p>Gallup also found that 37 percent of Americans hold a favorable view of the Palestinian Territories, which is behind the 46 percent who view Israel favorably. Fifty-seven percent of Americans favor an independent Palestinian state, which comes close to the highest percentage on the subject that Gallup has measured.</p>\n<p>Democrats’ views toward Palestinians have jumped since 2023, with 65 percent now sympathizing more with the Palestinians compared to 17 percent who say they sympathize with the Israelis.</p>\n<p>Seven in 10 Republicans, however, told Gallup that they sympathize with the Israelis, while 13 percent say they sympathize with the Palestinians.</p>\n<p>The poll comes just over a week after President Trump held the first <a href=\"https://thehill.com/policy/international/5746010-trump-board-of-peace-takeaways/\">“Board of Peace” meeting</a> with other world leaders tasked with overseeing the reconstruction of Gaza following two years of war. The board is the next step in Trump’s 20-point peace plan amid the fragile ceasefire, which requires Hamas to demilitarize and eventually allow a new governing body to lead the Gaza Strip. </p>\n<p>“We will make Gaza very successful and safe and we are also going to maybe take it a step further, where we see hotspots around the world, we could probably do that very easily,” Trump said at the meeting.</p>\n<p>The U.S. gave Hamas a 60-day period to disarm, Israeli Cabinet Secretary Yossi Fuchs said last week. He warned that Israel will restart the war if Hamas does not meet the deadline.</p>\n<p>The Gallup survey was conducted Sept. 2-16 and included 1,001 respondents. The margin of error is 4 percentage points.</p>",
            "kind": 1,
            "link": "https://thehill.com/policy/international/5759346-shifting-us-attitudes-israel-palestine/",
            "pub_date": "2026-02-28 05:51:26",
            "source": "thehill",
            "language": "en"
        }
    ]
}