{
    "data": [
        {
            "title": "Deepfake videos are getting shockingly good",
            "description": "<div class=\"entry-content wp-block-post-content is-layout-constrained wp-block-post-content-is-layout-constrained\">\n<p class=\"wp-block-paragraph\" id=\"speakable-summary\">Researchers from TikTok owner ByteDance have demoed a new AI system, <a href=\"https://omnihuman-lab.github.io/\" rel=\"nofollow\">OmniHuman-1</a>, that can generate perhaps the most realistic deepfake videos to date.</p>\n<p class=\"wp-block-paragraph\">Deepfaking AI is a commodity. There’s no shortage of apps that can insert someone into a photo, or make a person appear to say something they didn’t actually say. But most deepfakes — and video deepfakes in particular — fail to clear the uncanny valley. There’s usually some tell or obvious sign that AI was involved somewhere. </p>\n\n\n<p class=\"wp-block-paragraph\">Not so with OmniHuman-1 — at least from the cherry-picked samples the ByteDance team released.  </p>\n<p class=\"wp-block-paragraph\">Here’s a fictional Taylor Swift performance:</p>\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-4-3 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<div class=\"global-consent eu-consent tcembed-iframe tcembed--youtube\" data-iframe-height=\"375\" data-iframe-sandbox=\"\" data-iframe-src=\"https://www.youtube.com/embed/CVVNK06LVac?feature=oembed\" data-iframe-width=\"500\"></div>\n</div></figure>\n<p class=\"wp-block-paragraph\">Here’s a TED Talk that never took place:</p>\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<div class=\"global-consent eu-consent tcembed-iframe tcembed--youtube\" data-iframe-height=\"281\" data-iframe-sandbox=\"\" data-iframe-src=\"https://www.youtube.com/embed/V_ZjvRmHZOI?feature=oembed\" data-iframe-width=\"500\"></div>\n</div></figure>\n<p class=\"wp-block-paragraph\">And here’s a deepfaked Einstein lecture: </p>\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-4-3 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<div class=\"global-consent eu-consent tcembed-iframe tcembed--youtube\" data-iframe-height=\"375\" data-iframe-sandbox=\"\" data-iframe-src=\"https://www.youtube.com/embed/n6HKcS2pj0Q?feature=oembed\" data-iframe-width=\"500\"></div>\n</div></figure>\n<p class=\"wp-block-paragraph\">According to the ByteDance researchers, OmniHuman-1 only needs a single reference image and audio, like speech or vocals, to generate a video. The output video’s aspect ratio is adjustable, as is the subject’s “body proportion” — i.e. how much of their body is shown in the fake clip.</p>\n\n<p class=\"wp-block-paragraph\">OmniHuman-1 can also edit existing videos, even modifying the movements of a person’s limbs. It’s truly astonishing how convincing the result can be: </p>\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-4-3 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<div class=\"global-consent eu-consent tcembed-iframe tcembed--youtube\" data-iframe-height=\"375\" data-iframe-sandbox=\"\" data-iframe-src=\"https://www.youtube.com/embed/4-PKhdg_YS4?feature=oembed\" data-iframe-width=\"500\"></div>\n</div></figure>\n<p class=\"wp-block-paragraph\">Granted, OmniHuman-1 isn’t perfect. The ByteDance team says that “low-quality” reference images won’t yield the best videos, and the system seems to struggle with certain poses. Note the weird gestures with the wine glass in this video: </p>\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-4-3 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<div class=\"global-consent eu-consent tcembed-iframe tcembed--youtube\" data-iframe-height=\"375\" data-iframe-sandbox=\"\" data-iframe-src=\"https://www.youtube.com/embed/z8pXnnOgC9w?feature=oembed\" data-iframe-width=\"500\"></div>\n</div></figure>\n<p class=\"wp-block-paragraph\">Still, OmniHuman-1 is easily heads and shoulders above previous deepfake techniques, and it may well be a sign of things to come. While ByteDance hasn’t released the system, the AI community tends not to take long to reverse-engineer models like these.</p>\n\n\n<p class=\"wp-block-paragraph\">The implications are worrisome. </p>\n<p class=\"wp-block-paragraph\">Last year, political deepfakes spread like wildfire around the globe. On election day in Taiwan, a Chinese Communist Party-affiliated group <a href=\"https://cdn-dynmedia-1.microsoft.com/is/content/microsoftcorp/microsoft/final/en-us/microsoft-brand/documents/MTAC-East-Asia-Report.pdf\" rel=\"nofollow\">posted AI-generated, misleading audio of a politician throwing</a> his support behind a pro-China candidate. In Moldova, deepfake videos depicted the country’s president, Maia Sandu, resigning. And in South Africa, <a href=\"https://africacheck.org/fact-checks/meta-programme-fact-checks/will-real-slim-shady-please-stand-eminem-video-endorsing\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">a deepfake</a> of rapper Eminem supporting a South African opposition party circulated ahead of the country’s election.</p>\n<p class=\"wp-block-paragraph\">Deepfakes are also increasingly being used to carry out financial crimes. <a href=\"https://www.forbes.com/sites/chriswestfall/2024/11/29/ai-deepfakes-of-elon-musk-on-the-rise-causing-billions-in-fraud-losses/\" rel=\"nofollow\">Consumers are being duped by deepfakes of celebrities</a> offering fraudulent investment opportunities, while <a href=\"https://www.cnn.com/2024/02/04/asia/deepfake-cfo-scam-hong-kong-intl-hnk/index.html\" rel=\"nofollow\">corporations are being swindled out of millions</a> by deepfake impersonators. According to <a href=\"https://www2.deloitte.com/us/en/insights/industry/financial-services/financial-services-industry-predictions/2024/deepfake-banking-fraud-risk-on-the-rise.html\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">Deloitte</a>, AI-generated content contributed to more than $12 billion in fraud losses in 2023, and could reach $40 billion in the U.S. by 2027. </p>\n<p class=\"wp-block-paragraph\">Last February, hundreds in the AI community <a href=\"https://openletter.net/l/disrupting-deepfakes\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">signed an open letter calling for strict deepfake </a><a href=\"https://openletter.net/l/disrupting-deepfakes\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">regulation</a>. In the absence of a law criminalizing deepfakes at the federal level in the U.S., more than 10 states have enacted statutes against AI-aided impersonation. California’s law — <a href=\"https://techcrunch.com/2024/10/02/judge-blocks-californias-new-ai-law-in-case-over-kamala-harris-deepfake-musk-reposted/\">currently stalled</a> — would be the first to empower judges to order the posters of deepfakes to take them down or potentially face monetary penalties.</p>\n<p class=\"wp-block-paragraph\">Unfortunately, deepfakes are hard to detect. While <a href=\"https://techcrunch.com/2024/04/05/meta-deepfake-labels/\">some social networks</a> and <a href=\"https://techcrunch.com/2024/10/24/google-adds-new-disclosures-for-ai-photos-but-its-still-not-obvious-at-first-glance/\">search engines</a> have taken steps to limit their spread, the volume of deepfake content online continues to grow at an alarmingly fast rate. </p>\n<p class=\"wp-block-paragraph\"><a href=\"https://www.jumio.com/about/press-releases/global-identity-survey-2024/\" rel=\"nofollow\">In a May 2024 survey</a> from ID verification firm Jumio, 60% of people said they encountered a deepfake in the past year. Seventy-two percent of respondents to the poll said they were worried about being fooled by deepfakes on a daily basis, while a majority supported legislation to address the proliferation of AI-generated fakes.</p>\n</div>",
            "link": "https://techcrunch.com/2025/02/04/deepfake-videos-are-getting-shockingly-good/",
            "author": "TechCrunch",
            "pub_date": "2025-02-05 00:20:52",
            "source": "techcrunch",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "LogicStar is building AI agents for app maintenance",
            "description": "<div class=\"entry-content wp-block-post-content is-layout-constrained wp-block-post-content-is-layout-constrained\">\n<p class=\"wp-block-paragraph\" id=\"speakable-summary\">Swiss startup <a href=\"https://logicstar.ai\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">LogicStar</a> is bent on joining the <a href=\"https://techcrunch.com/2024/12/15/what-exactly-is-an-ai-agent/\" rel=\"noreferrer noopener\" target=\"_blank\">AI agent</a> game. The summer 2024-founded startup has bagged $3 million in pre-seed funding to bring tools to the developer market that can do autonomous maintenance of software applications, rather than the more typical AI agent use-case of code co-development.</p>\n<p class=\"wp-block-paragraph\">LogicStar CEO and co-founder Boris Paskalev suggests the startup’s AI agents could end up partnering with code development agents — such as, say, the likes of Cognition Labs’ Devin — in a business win-win.</p>\n\n\n<p class=\"wp-block-paragraph\">Code fidelity is an issue for AI agents building and deploying software, just as it is for human developers, and LogicStar wants to do its bit to grease the development wheel by automatically picking up and fixing bugs wherever they may crop up in deployed code. </p>\n<p class=\"wp-block-paragraph\">As it stands, Paskalev suggests that “even the best models and agents” out there are unable to resolve the majority of bugs they’re presented with — hence the team spying an opportunity for an AI startup that’s dedicated to improving these odds and delivering on the dream of less tedious app maintenance.</p>\n<p class=\"wp-block-paragraph\">To this end, they are building atop large language models (LLMs) — such as OpenAI’s GPT or even China’s DeepSeek — taking a model-agnostic approach for their platform. This allows LogicStar to dip into different LLMs and maximize its AI agents’ utility, based on which foundational model works best for resolving a particular code issue.</p>\n<p class=\"wp-block-paragraph\">Paskalev contends that the founding team has the technical and domain-specific knowledge to build a platform that can resolve programming problems which can challenge or outfox LLMs working alone. They also have past entrepreneurial success to point to: he sold his prior code review startup, DeepCode, to cybersecurity giant Snyk back in <a href=\"https://techcrunch.com/2020/09/24/snyk-acquires-deepcode-to-boost-its-code-review-smarts/\" rel=\"noreferrer noopener\" target=\"_blank\">September 2020</a>.</p>\n<p class=\"wp-block-paragraph\">“In the beginning we were thinking about actually building a large language model for code,” he told TechCrunch. “Then we realized that that will quickly become a commodity… Now we’re building assuming all those large language models are there. Assuming there’s some actually decent [AI] agents for code, how do we extract the maximum business value from them?”</p>\n\n<p class=\"wp-block-paragraph\">He said that the idea built on the team’s understanding of how to analyze software applications. “Combine that with large language models — then focus into grounding and verifying what those large language models and the AI agent actually suggest.”</p>\n<h2 class=\"wp-block-heading\" id=\"h-test-driven-development\">Test-driven development</h2>\n<p class=\"wp-block-paragraph\">What does that mean in practice? Paskalev says LogicStar performs an analysis of each application that its tech is deployed on — using “classical computer science methods” — in order to build a “knowledge base”. This gives its AI agent a comprehensive map of the software’s inputs and outputs; how variables link to functions; and any other linkages and dependencies etc. </p>\n<p class=\"wp-block-paragraph\">Then, for every bug it’s presented with, the AI agent is able to determine which parts of the application are impacted — allowing LogicStar to narrow down the functions needing to be simulated in order to test scores of potential fixes. </p>\n\n\n<p class=\"wp-block-paragraph\">Per Paskalev, this “minimized execution environment” allows the AI agent to run “thousands” of tests aimed at reproducing bugs to identify a “failing test”, and — through this “test-driven development” approach — ultimately land on a fix that sticks.</p>\n<p class=\"wp-block-paragraph\">He confirms that the actual bug fixes are sourced from the LLMs. But because LogicStar’s platform enables this “very fast executive environment” its AI agents can work at scale to separate the wheat from the chaff, as it were, and serve its users with a shortcut to the best that LLMs can offer.</p>\n<p class=\"wp-block-paragraph\">“What we see is [LLMs are] great for prototyping, testing things, etc, but it’s absolutely not great for [code] production, commercial applications. I think we’re far from there, and this is what our platform delivers,” he argued. “To be able to extract those capabilities of the models today, we can actually safely extract commercial value and actually save time for developers to really focus on the important stuff.”</p>\n<p class=\"wp-block-paragraph\">Enterprises are set to be LogicStar’s initial target. Its “silicon agents” are intended to be put to work alongside corporate dev teams, albeit at a fraction of the salary required to hire a human developer, handling a range of app upkeep tasks and freeing up engineering talent for more creative and/or challenging work. (Or, well, at least until LLMs and AI agents get a lot more capable.)</p>\n<p class=\"wp-block-paragraph\">While the startup’s pitch touts a “fully autonomous” app maintenance capability, Paskalev confirms that the platform will allow human developers to review (and otherwise oversee) the fixes its AI agents call up. So trust can be — and must be — earned first. </p>\n<p class=\"wp-block-paragraph\">“The accuracy that a human developer delivers ranges between 80 to 90%. Our goal [for our AI agents] is to be exactly there,” he adds.</p>\n<p class=\"wp-block-paragraph\">It’s still early days for LogicStar: an alpha version of its technology is in testing with a number of undisclosed companies which Paskalev refers to as “design partners”. Currently the tech only supports Python — but expansions to Typescript, Javascript and Java are billed as “coming soon”. </p>\n<p class=\"wp-block-paragraph\">“The main goal [with the pre-seed funding] is to actually show the technology works with our design partners — focusing on Python,” adds Paskalev. “We already spent a year on it, and we have lots of opportunity to actually expand. And that’s why we’re trying to focus it first, to show the value in one case.”</p>\n\n\n<p class=\"wp-block-paragraph\">The startup’s pre-seed raise was led by European VC firm Northzone, with angel investors from DeepMind, Fleet, Sequoia scouts, Snyk and Spotify also joining the round. </p>\n<p class=\"wp-block-paragraph\">In a statement, Michiel Kotting, partner at Northzone, said: “AI-driven code generation is still in its early stages, but the productivity gains we’re already seeing are revolutionary. The potential for this technology to streamline development processes, reduce costs, and accelerate innovation is immense. and the team’s vast technical expertise and proven track record position them to deliver real, impactful results. The future of software development is being reshaped, and LogicStar will play a crucial role in software maintenance.”</p>\n<p class=\"wp-block-paragraph\">LogicStar is operating a <a href=\"https://docs.google.com/forms/d/e/1FAIpQLSdKE5SROAvar8h5BIHAAATYYd2G3I2dpJyxaJPFdsYkbu4mrw/viewform\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">waiting list</a> for potential customers wanting to express interest in getting early access. It told us a beta release is planned for later this year.  </p>\n</div>",
            "link": "https://techcrunch.com/2025/02/04/logicstar-is-building-ai-agents-for-app-maintenance/",
            "author": "TechCrunch",
            "pub_date": "2025-02-05 00:15:55",
            "source": "techcrunch",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Two space startups have merged to create the next generation of telescopes",
            "description": "<div class=\"entry-content wp-block-post-content is-layout-constrained wp-block-post-content-is-layout-constrained\">\n<p class=\"wp-block-paragraph\" id=\"speakable-summary\">On a clear spring evening in Michigan, the stars aligned — just not in the way Upfront Ventures partner Nick Kim expected.</p>\n<p class=\"wp-block-paragraph\">He’d just led <a href=\"https://techcrunch.com/2023/12/06/oursky-lands-9-5m-seed-to-build-out-developer-platform-for-space-data/\">a $9.5 million seed round</a> for OurSky, a software platform for space observational data, and was eager to see what its telescope partner PlaneWave Instruments could do. </p>\n\n\n<p class=\"wp-block-paragraph\">But when they rolled out the telescopes that night at PlaneWave’s manufacturing facility, he was stuck waiting. </p>\n<p class=\"wp-block-paragraph\">“It took them quite a long time to get the first image. I’m talking like, multiple hours. And these are the people who make the telescopes! They were using all this, like, off-the-shelf, open-source software that they kind of cobbled together,”  Kim said in an interview with TechCrunch.</p>\n<p class=\"wp-block-paragraph\">Kim wasn’t upset, though. He was excited. “This is why OurSky needed to exist, right? This is the problem,” he remembered thinking. “What a perfect match.” </p>\n<p class=\"wp-block-paragraph\">It was such a good match that, now, OurSky and PlaneWave are merging to create a new company called Observable Space. </p>\n<p class=\"wp-block-paragraph\">OurSky founder Dan Roelker and PlaneWave founder Richard Hedrick say this will make the telescopes easier to use. And they also believe the tighter integration will open up new markets – especially as they leverage their position as the only U.S.-based telescope manufacturer. They already count NASA, the U.S. Space Force, and Georgia State’s Center for High Angular Resolution Astronomy as customers.</p>\n\n<p class=\"wp-block-paragraph\">“My dream was to integrate all the components on the telescope, even the parts we don’t sell, and then integrate the control of the telescope,” Hedrick said in an interview. “It was very obvious for us to be working together.”</p>\n<p class=\"wp-block-paragraph\">Roelker, who was SpaceX’s VP of software engineering from 2015 to 2019, said telescope users have to deal with what he called a “mash of integration bullsh–.” PlaneWave’s vertical strategy combined with OurSky’s software will eliminate those headaches, he said.</p>\n<p class=\"wp-block-paragraph\">Solving that integration problem is an opportunity for Observable Space to grow the market, Roelker said. (The platform OurSky has built will continue on in that name, and the telescopes will continue to be sold under the PlaneWave brand.)</p>\n\n\n<p class=\"wp-block-paragraph\">That can involve a number of things, like letting users tap multiple telescopes at a single site — or even around the world — to mimic the capabilities of a much larger telescope, or sending communications to and from space via laser, all while lowering cost.</p>\n<p class=\"wp-block-paragraph\">Squeezing more out of his high-quality telescopes sold Hedrick on the merger. It will make the tech more approachable and affordable for enthusiasts and institutions alike.</p>\n<p class=\"wp-block-paragraph\">Hedrick said one of those institutions recently designed some one-meter telescopes and had them custom built by someone else. “And they were like, ‘God, if you had existed, we never would have done that,’” he said.</p>\n<h2 class=\"wp-block-heading\" id=\"h-new-business\">New business</h2>\n<p class=\"wp-block-paragraph\">As the cost to get to orbit shrinks, more companies are sending things to space, Roelker said. That means there is increased demand for the ability to locate and track objects orbiting the Earth, communicate with spacecraft, and enable defense and intelligence applications. </p>\n<p class=\"wp-block-paragraph\">Observable Space can be a key player in that new economy, according to Mislav Tolusic, managing partner at dual-use venture fund Marlinspike, which has invested in Observable Space.</p>\n<p class=\"wp-block-paragraph\">“Every day you’re relying on space,” Tolusic said in an interview. “If you take out GPS constellations, we’re in trouble economically. It’s a big, big, big deal. A lot of systems stop functioning. And guess what? The future is going to be even more dependent on that infrastructure.”</p>\n<p class=\"wp-block-paragraph\">Tolusic praised PlaneWave’s quality, and noted Hedrick built up the company at a time when basically all telescope manufacturing is overseas – which he believes is an advantage. </p>\n<p class=\"wp-block-paragraph\">“If you want to replicate that [in the U.S.], you have to go figure out how to make those fine lenses, how to make gimbals – and not just how to design them but how to spit them out by the thousands,” he said.</p>\n\n\n<p class=\"wp-block-paragraph\">Jordan Noone, general partner at Embedded Ventures, explained his fund’s investment with a specific example of what OurSky and PlaneWave can do as a combined company. </p>\n<p class=\"wp-block-paragraph\">Shortly before the merger, Noone was at Mount Wilson Observatory in Los Angeles for a demo of the companies’ products working together. </p>\n<p class=\"wp-block-paragraph\">He told TechCrunch that the teams pulled an observation request from the queue on OurSky’s platform: a satellite operator had lost radio contact with its spacecraft. The OurSky and PlaneWave teams located it quickly. </p>\n<p class=\"wp-block-paragraph\">What he described was a much smoother experience than Kim’s demo in Michigan, and served as proof in his mind that Observable Space was a good bet to make. </p>\n<p class=\"wp-block-paragraph\">“Many of the world’s most valuable companies, like Apple, Nvidia – they’re hardware/software platform combos,” Noone said. “Companies that approach just one of those two can have a lot of inherent value, but the combination of both in today’s world is extremely powerful.”</p>\n<h2 class=\"wp-block-heading\" id=\"h-star-wars-or-star-trek\">Star Wars or Star Trek?</h2>\n<p class=\"wp-block-paragraph\">Observable Space has about 100 employees, with the manufacturing operations remaining in Michigan, some engineering happening in Los Angeles, California, and an observatory outside Washington, D.C. </p>\n<p class=\"wp-block-paragraph\">It’s already revenue-generating, and the combined company has raised $11 million to date, including funding from In-Q-Tel, the CIA’s non-profit strategic investment arm.</p>\n<p class=\"wp-block-paragraph\">Hedrick and Roelker said the two companies have fit together easily, since they were both focused on such different businesses and didn’t have massive back office operations.</p>\n\n\n<p class=\"wp-block-paragraph\">“Going through the merger process itself was actually really valuable, because when you’re going through it, a lot of issues pop up,” Roelker said. “You actually get a really good sense of how you’re going to work together. And I think both Rick and I felt really good about that, because we actually went through some really hard things during the merger.” </p>\n<p class=\"wp-block-paragraph\">When asked, the pair did not describe those “hard things,” and Hedrick instead quipped: “We had to decide on whether [the company] was going to be Star Wars or Star Trek.”</p>\n<p class=\"wp-block-paragraph\">The answer?</p>\n<p class=\"wp-block-paragraph\">“Battlestar Galactica,” Roelker said.</p>\n</div>",
            "link": "https://techcrunch.com/2025/02/04/two-space-startups-have-merged-to-create-the-next-generation-of-telescopes/",
            "author": "TechCrunch",
            "pub_date": "2025-02-05 00:01:11",
            "source": "techcrunch",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Sotira lands $2M to help brands offload and monetize their surplus inventory",
            "description": "<div class=\"entry-content wp-block-post-content is-layout-constrained wp-block-post-content-is-layout-constrained\">\n<p class=\"wp-block-paragraph\" id=\"speakable-summary\">An estimated <a href=\"https://www.netsuite.com/portal/resource/articles/inventory-management/obsolete-inventory.\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">20% to 30% of all inventory</a> in the U.S. is surplus, with much of it ending up in landfills. A startup called <a href=\"https://www.sotira.co/\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">Sotira</a> wants to help address this problem: It leverages AI to help companies offload and monetize their surplus inventory. Sotira partners with brands to offload millions of pounds of surplus grocery, health and wellness, and cosmetics goods all over the United States. </p>\n<p class=\"wp-block-paragraph\">To fuel its mission, the company has closed a $2 million pre-seed funding round. Sotira plans to use the new funding to expand its operations nationally, specifically the midwest and southeast.</p>\n\n\n<p class=\"wp-block-paragraph\">The startup, which exhibited at TechCrunch Disrupt Battlefield 200 2024, was founded by CEO Amrita Bhasin and CTO Gary Kwong. The pair met at UC Berkeley and bonded over their shared interest in the ecommerce and logistics space. Bhasin and Kwong were both running their own companies that were focused on selling previously owned, new, or used products. </p>\n<p class=\"wp-block-paragraph\">The duo then started running a liquidation business together because they wanted to understand how the space operated before jumping into starting a company. They decided to cast a wide net before zeroing in on their mission with Sotira. </p>\n<p class=\"wp-block-paragraph\">“We learned that the market opportunity for monetizing overstock is huge,” Bhasin told TechCrunch. “It is a multi-billion-dollar market, and it is a very old-school manual space, like the people we’re talking to are doing things on pen and paper. They’ve never heard of ChatGPT, they don’t know what AI is. And so that pretty much was the catalyst for us starting the company. We were like, there is a market opportunity here.”</p>\n<p class=\"wp-block-paragraph\">Sotira helps to offload products that are nearing their expiration date, items that are facing storage capacity issues, and products that have been over-ordered. Vetted suppliers can sign up for Sotira and link their storage capacity or inventory. Sotira then matches the products to a buyer that will then pick up pallets from the supplier’s warehouse. </p>\n<p class=\"wp-block-paragraph\">Buyers are verified, brick-and-mortar stores all over the country. They can share the UPC codes of the kind of inventory they purchase, and Sotira will use AI to match them with inventory. Sotira automates compliance and facilitates transactions and logistics with buyers so suppliers get paid out upon pickups. Sotira’s goal is to clear surplus within a few days of receiving inventory data. </p>\n\n<p class=\"wp-block-paragraph\">In the past, brands would have had to identify the stock they would not be able to sell to their primary purchasers, and then call up different liquidators to compare offers and manually negotiate prices. Sotira has brought this process online and allows suppliers to clear up inventory much faster.  </p>\n<p class=\"wp-block-paragraph\">Sotira charges a monthly fee for access; it also takes a percentage of revenue from each transaction on its platform. </p>\n<p class=\"wp-block-paragraph\">While Sotira is beneficial for suppliers and buyers, Bahsin says Sotira is also proud of its ability to open up affordable access to premium products that people may otherwise be unable to access. For instance, Sotira works with a lot of CPG beverage brands that end up offloading their excess inventory to discount grocery stores. </p>\n\n\n<p class=\"wp-block-paragraph\">“In the economy right now, where you currently look at how rapidly grocery prices are increasing, these are the categories consumers purchase the most,” Bahsin said. “There is so much value in opening affordable access to these items. A lot of the buyers we work with are in rural areas. They’re in areas that they may be more impoverished, where consumers actually rely on purchasing from over-stock stores, like they won’t purchase from a Whole Foods, they’re purchasing from a discount grocery store.”</p>\n<p class=\"wp-block-paragraph\">Bahsin also noted that since <a href=\"https://www.cbs8.com/article/news/local/new-california-law-requires-large-venues-donate-leftover-food-instead-of-throwing-it-away/509-e06c8377-3ff4-4965-925b-5fb319b28fed\" rel=\"nofollow\">California has passed legislation</a> to stop grocery stores from dumping food and beverages, Sotira can now approach these companies and inform them that there’s a market for their surplus inventory. </p>\n<p class=\"wp-block-paragraph\">Sotira plans to expand beyond food, beverage, health, and cosmetics in the future and move into the apparel space. The company is getting interest from brands that want help moving their excess clothing and shoes, Bhasin said. </p>\n<p class=\"wp-block-paragraph\">Sotira’s pre-seed funding included participation from Unusual Ventures, Night Capital, K5 Global, Ritual Capital, and others. </p>\n</div>",
            "link": "https://techcrunch.com/2025/02/04/sotira-lands-2m-to-help-brands-offload-and-monetize-their-surplus-inventory/",
            "author": "TechCrunch",
            "pub_date": "2025-02-04 23:16:04",
            "source": "techcrunch",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "OpenAI’s Operator agent helped me move, but I had to help it, too",
            "description": "<div class=\"entry-content wp-block-post-content is-layout-constrained wp-block-post-content-is-layout-constrained\">\n<p class=\"wp-block-paragraph\" id=\"speakable-summary\">OpenAI gave me one week to test <a href=\"https://techcrunch.com/2025/01/23/openai-launches-operator-an-ai-agent-that-performs-tasks-autonomously/\">its new AI agent, Operator</a>, a system that can independently do tasks for you on the internet.</p>\n<p class=\"wp-block-paragraph\">Operator is the closest thing I’ve seen to the tech industry’s <a href=\"https://techcrunch.com/2024/12/15/what-exactly-is-an-ai-agent/\">vision of AI agents</a> — systems that can automate the boring parts of life, freeing us up to do the things we really love. However, judging from my experience with OpenAI’s agent, truly “autonomous” AI systems are still just out of reach.</p>\n\n\n<p class=\"wp-block-paragraph\">OpenAI <a href=\"https://openai.com/index/computer-using-agent/\" rel=\"nofollow\">trained a new model to power Operator</a>, which combines the visual understanding of GPT-4o with the reasoning capabilities of o1.</p>\n<p class=\"wp-block-paragraph\">That model seems to work well for basic tasks; I watched Operator click buttons, navigate menus on websites, and fill out forms. The AI was occasionally successful at independently taking actions, and it works much faster than web-based agents I’ve seen from <a href=\"https://techcrunch.com/2024/10/22/anthropics-new-ai-can-control-your-pc/\">Anthropic</a> and <a href=\"https://techcrunch.com/2024/12/11/google-unveils-project-mariner-ai-agents-to-use-the-web-for-you/\">Google</a>.</p>\n<p class=\"wp-block-paragraph\">But during my trial, I found myself assisting OpenAI’s agent more than I’d like. It felt like I was coaching Operator through each problem, whereas I wanted to push certain tasks off my plate altogether.</p>\n<p class=\"wp-block-paragraph\">Too often during my test, I had to answer several questions, grant permissions, fill out personal information, and help the agent when it got stuck.</p>\n<p class=\"wp-block-paragraph\">In car terms, Operator is like driving a car with cruise control – occasionally taking your foot off the pedals and letting the car drive itself – but it’s far from full-blown autopilot.</p>\n\n<p class=\"wp-block-paragraph\">In fact, OpenAI says Operator’s frequent pauses are by design.</p>\n<p class=\"wp-block-paragraph\">The AI powering Operator, much like the AI powering chatbots like OpenAI’s ChatGPT, can’t reliably work independently for long periods of time, and it’s prone to the same sort of hallucinating. Because of that, OpenAI doesn’t want to give the system too much decision-making power or sensitive user information. Maybe that’s a safe choice by OpenAI, but it reduces Operator’s practicality.</p>\n<p class=\"wp-block-paragraph\">That said, OpenAI’s first agent is an impressive proof of concept — and interface — for an AI that can use the front end of any website. But to create truly independent AI systems, tech companies will need to build more reliable AI models that don’t require this much steering.</p>\n<h2 class=\"wp-block-heading\" id=\"h-a-little-too-hands-on\">A little too ‘hands on’</h2>\n<p class=\"wp-block-paragraph\">My Operator trial coincided with the week I was moving apartments, so I had OpenAI’s agent help with moving logistics.</p>\n\n\n<p class=\"wp-block-paragraph\">I asked Operator to help me buy a new parking permit. OpenAI’s agent told me, “Sure,” then opened a window into its browser on my PC’s screen.</p>\n<p class=\"wp-block-paragraph\">Operator then conducted a search for a San Francisco parking permit in the browser, took me to the correct city website, and even the right page.</p>\n<p class=\"wp-block-paragraph\">Operator still lets you use the rest of your computer while it’s working, something that can’t be said for Google’s Project Mariner. This is because OpenAI’s agent isn’t really working on the computer, but rather, off in the cloud somewhere.</p>\n<figure class=\"wp-block-image size-large\"><img alt=\"\" class=\"wp-image-2958150\" decoding=\"async\" height=\"2086\" loading=\"lazy\" sizes=\"auto, (max-width: 1608px) 100vw, 1608px\" src=\"https://techcrunch.com/wp-content/uploads/2025/01/Screenshot-2025-01-24-at-9.57.44AM.png?w=524\" srcset=\"https://techcrunch.com/wp-content/uploads/2025/01/Screenshot-2025-01-24-at-9.57.44AM.png 1608w, https://techcrunch.com/wp-content/uploads/2025/01/Screenshot-2025-01-24-at-9.57.44AM.png?resize=116,150 116w, https://techcrunch.com/wp-content/uploads/2025/01/Screenshot-2025-01-24-at-9.57.44AM.png?resize=231,300 231w, https://techcrunch.com/wp-content/uploads/2025/01/Screenshot-2025-01-24-at-9.57.44AM.png?resize=768,996 768w, https://techcrunch.com/wp-content/uploads/2025/01/Screenshot-2025-01-24-at-9.57.44AM.png?resize=524,680 524w, https://techcrunch.com/wp-content/uploads/2025/01/Screenshot-2025-01-24-at-9.57.44AM.png?resize=925,1200 925w, https://techcrunch.com/wp-content/uploads/2025/01/Screenshot-2025-01-24-at-9.57.44AM.png?resize=987,1280 987w, https://techcrunch.com/wp-content/uploads/2025/01/Screenshot-2025-01-24-at-9.57.44AM.png?resize=331,430 331w, https://techcrunch.com/wp-content/uploads/2025/01/Screenshot-2025-01-24-at-9.57.44AM.png?resize=555,720 555w, https://techcrunch.com/wp-content/uploads/2025/01/Screenshot-2025-01-24-at-9.57.44AM.png?resize=694,900 694w, https://techcrunch.com/wp-content/uploads/2025/01/Screenshot-2025-01-24-at-9.57.44AM.png?resize=617,800 617w, https://techcrunch.com/wp-content/uploads/2025/01/Screenshot-2025-01-24-at-9.57.44AM.png?resize=1184,1536 1184w, https://techcrunch.com/wp-content/uploads/2025/01/Screenshot-2025-01-24-at-9.57.44AM.png?resize=1579,2048 1579w, https://techcrunch.com/wp-content/uploads/2025/01/Screenshot-2025-01-24-at-9.57.44AM.png?resize=515,668 515w, https://techcrunch.com/wp-content/uploads/2025/01/Screenshot-2025-01-24-at-9.57.44AM.png?resize=289,375 289w, https://techcrunch.com/wp-content/uploads/2025/01/Screenshot-2025-01-24-at-9.57.44AM.png?resize=476,617 476w, https://techcrunch.com/wp-content/uploads/2025/01/Screenshot-2025-01-24-at-9.57.44AM.png?resize=409,531 409w\" width=\"1608\"/><figcaption class=\"wp-element-caption\"><span class=\"wp-element-caption__text\">The operator interface (Credit: Maxwell Zeff/OpenAI)</span></figcaption></figure>\n<p class=\"wp-block-paragraph\">For my parking permit, I had to grant Operator permission to start different processes a few too many times. It also stopped to ask me to fill out forms with personal information – such as my name, phone number, and email address. At times, Operator also got lost, forcing me to take control of the browser and get the agent back on track.</p>\n<p class=\"wp-block-paragraph\">In another test, I asked Operator to make me a reservation at a Greek restaurant. To its credit, Operator found me a nice place in my area with reasonable prices. But I had to answer more than half a dozen questions throughout the flow.</p>\n<figure class=\"wp-block-image size-large\"><img alt=\"\" class=\"wp-image-2958925\" decoding=\"async\" height=\"2022\" loading=\"lazy\" sizes=\"auto, (max-width: 2114px) 100vw, 2114px\" src=\"https://techcrunch.com/wp-content/uploads/2025/02/Operator-restaurant-demo.jpg?w=680\" srcset=\"https://techcrunch.com/wp-content/uploads/2025/02/Operator-restaurant-demo.jpg 2114w, https://techcrunch.com/wp-content/uploads/2025/02/Operator-restaurant-demo.jpg?resize=150,143 150w, https://techcrunch.com/wp-content/uploads/2025/02/Operator-restaurant-demo.jpg?resize=300,287 300w, https://techcrunch.com/wp-content/uploads/2025/02/Operator-restaurant-demo.jpg?resize=768,735 768w, https://techcrunch.com/wp-content/uploads/2025/02/Operator-restaurant-demo.jpg?resize=680,650 680w, https://techcrunch.com/wp-content/uploads/2025/02/Operator-restaurant-demo.jpg?resize=1200,1148 1200w, https://techcrunch.com/wp-content/uploads/2025/02/Operator-restaurant-demo.jpg?resize=1280,1224 1280w, https://techcrunch.com/wp-content/uploads/2025/02/Operator-restaurant-demo.jpg?resize=430,411 430w, https://techcrunch.com/wp-content/uploads/2025/02/Operator-restaurant-demo.jpg?resize=720,689 720w, https://techcrunch.com/wp-content/uploads/2025/02/Operator-restaurant-demo.jpg?resize=900,861 900w, https://techcrunch.com/wp-content/uploads/2025/02/Operator-restaurant-demo.jpg?resize=800,765 800w, https://techcrunch.com/wp-content/uploads/2025/02/Operator-restaurant-demo.jpg?resize=1536,1469 1536w, https://techcrunch.com/wp-content/uploads/2025/02/Operator-restaurant-demo.jpg?resize=2048,1959 2048w, https://techcrunch.com/wp-content/uploads/2025/02/Operator-restaurant-demo.jpg?resize=668,639 668w, https://techcrunch.com/wp-content/uploads/2025/02/Operator-restaurant-demo.jpg?resize=392,375 392w, https://techcrunch.com/wp-content/uploads/2025/02/Operator-restaurant-demo.jpg?resize=645,617 645w, https://techcrunch.com/wp-content/uploads/2025/02/Operator-restaurant-demo.jpg?resize=555,531 555w\" width=\"2114\"/><figcaption class=\"wp-element-caption\"><span class=\"wp-element-caption__text\">Some steps to making a reservation with Operator (Credit: Maxwell Zeff/OpenAI)</span></figcaption></figure>\n<p class=\"wp-block-paragraph\">If you have to intervene six or more times just to book a reservation through an AI agent, at what point is it easier to just do it yourself? That’s a question I asked myself a lot while testing Operator.</p>\n<h2 class=\"wp-block-heading\" id=\"h-agent-as-a-platform\">Agent-as-a-platform</h2>\n<p class=\"wp-block-paragraph\">In a few of my tests, I ran into websites that blocked Operator for whatever reason. For example, I tried booking an electrician using TaskRabbit, but OpenAI’s agent told me that it ran into an error, and asked if it could use an alternative service instead. Expedia, Reddit, and YouTube also blocked the AI agent from accessing their platforms.</p>\n<p class=\"wp-block-paragraph\">However, other services are embracing Operator with open arms. Instacart, Uber, and eBay collaborated with OpenAI for the launch of Operator, allowing the agent to navigate their websites on behalf of humans.</p>\n\n\n<p class=\"wp-block-paragraph\">These businesses are preparing for a future where a subset of user interactions are facilitated by an AI agent.</p>\n<p class=\"wp-block-paragraph\">“Customers are using Instacart through a variety of different entry points,” said Daniel Danker, chief product officer at Instacart, in an interview with TechCrunch. “We see Operator as, potentially, another one of those entry points.”</p>\n<p class=\"wp-block-paragraph\">Letting OpenAI’s agent use Instacart’s website on behalf of a person seems like it would separate Instacart from its customers. However, Danker says Instacart wants to meet customers wherever they are.</p>\n<p class=\"wp-block-paragraph\">“We really are bullish about our belief, similar to OpenAI, that agentic systems will have a major impact on how consumers interact with digital properties,” said eBay’s chief AI officer, Nitzan Mekel-Bobrov, in an interview with TechCrunch.</p>\n<p class=\"wp-block-paragraph\">Even if AI agents rise in popularity, Mekel-Bobrov says he expects users will always come to eBay’s website, noting that “online destinations are not going anywhere.”</p>\n<h2 class=\"wp-block-heading\" id=\"h-trust-issues\">Trust issues</h2>\n<p class=\"wp-block-paragraph\">I had some issues trusting Operator after it hallucinated a few times, and nearly cost me several hundreds dollars.</p>\n<p class=\"wp-block-paragraph\">For instance, I asked the agent to find me a parking garage near my new apartment. It ended up suggesting two garages that it said would take just a few minutes to walk to.</p>\n<figure class=\"wp-block-image size-large\"><img alt=\"\" class=\"wp-image-2958924\" decoding=\"async\" height=\"792\" loading=\"lazy\" sizes=\"auto, (max-width: 612px) 100vw, 612px\" src=\"https://techcrunch.com/wp-content/uploads/2025/02/Operator-demo.jpg?w=525\" srcset=\"https://techcrunch.com/wp-content/uploads/2025/02/Operator-demo.jpg 612w, https://techcrunch.com/wp-content/uploads/2025/02/Operator-demo.jpg?resize=116,150 116w, https://techcrunch.com/wp-content/uploads/2025/02/Operator-demo.jpg?resize=232,300 232w, https://techcrunch.com/wp-content/uploads/2025/02/Operator-demo.jpg?resize=525,680 525w, https://techcrunch.com/wp-content/uploads/2025/02/Operator-demo.jpg?resize=332,430 332w, https://techcrunch.com/wp-content/uploads/2025/02/Operator-demo.jpg?resize=556,720 556w, https://techcrunch.com/wp-content/uploads/2025/02/Operator-demo.jpg?resize=516,668 516w, https://techcrunch.com/wp-content/uploads/2025/02/Operator-demo.jpg?resize=290,375 290w, https://techcrunch.com/wp-content/uploads/2025/02/Operator-demo.jpg?resize=477,617 477w, https://techcrunch.com/wp-content/uploads/2025/02/Operator-demo.jpg?resize=410,531 410w\" width=\"612\"/><figcaption class=\"wp-element-caption\"><span class=\"wp-element-caption__text\">Hallucination about parking spot distances (Credit: Maxwell Zeff/OpenAI)</span></figcaption></figure>\n<p class=\"wp-block-paragraph\">Besides being way out of my price range, the garages were actually really far from my apartment. One was a 20-minute walk away, and the other was a 30-minute walk. Turns out, Operator had put in the wrong address.</p>\n\n\n<p class=\"wp-block-paragraph\">This is exactly why OpenAI doesn’t give its agent your credit card number, passwords, or access to email. If OpenAI didn’t let me intervene here, Operator would’ve have wasted hundreds of dollars on a parking spot I didn’t need.</p>\n<p class=\"wp-block-paragraph\">Hallucinations like this are a key roadblock to actually useful autonomous agents – ones that can take bothersome tasks off your plate. No one will trust agents if they’re prone to making basic mistakes, especially mistakes with real-world consequences.</p>\n<p class=\"wp-block-paragraph\">With Operator, OpenAI seems to have built some impressive tools to let AI systems browse the web. But these tools won’t amount to much until the underpinning AI can reliably do what users ask it to do. Until then, humans will be stuck assisting agents — not the other way around. And that kind of defeats the point.</p>\n</div>",
            "link": "https://techcrunch.com/2025/02/04/openais-operator-agent-helped-me-move-but-i-had-to-help-it-too/",
            "author": "TechCrunch",
            "pub_date": "2025-02-04 23:16:02",
            "source": "techcrunch",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Spotify reports its first full year of profitability, adds 35M monthly active users",
            "description": "<div class=\"entry-content wp-block-post-content is-layout-constrained wp-block-post-content-is-layout-constrained\">\n<p class=\"wp-block-paragraph\" id=\"speakable-summary\">On Tuesday morning, Spotify <a href=\"https://newsroom.spotify.com/2025-02-04/spotify-reports-fourth-quarter-2024-earnings/\" rel=\"nofollow\">announced</a> its fourth-quarter earnings, marking its first full year of profitability since its inception 17 years ago. The operating income for the quarter reached a record €477 million ($509.48 million) and amounted to €1.4 billion ($1.495 billion) for the 2024 fiscal year.</p>\n<p class=\"wp-block-paragraph\">Spotify also reported an addition of 35 million monthly active users (MAUs), the largest Q4 net addition in the company’s history, surpassing internal projections of 25 million. This increase brings the total to 675 million, representing a 12% year-over-year jump.</p>\n\n\n<p class=\"wp-block-paragraph\">Additionally, the company experienced growth in its paid subscriber base despite implementing two consecutive price hikes for Premium subscriptions. The company reported 263 million total subscribers, up from 240 million in the previous quarter. </p>\n<p class=\"wp-block-paragraph\">Last quarter, Spotify <a href=\"https://techcrunch.com/2024/11/13/spotify-teases-a-super-premium-tier-for-superfans-and-upcoming-video-expansion-in-q3-earnings-call/\">teased</a> the future arrival of its HiFi or “super premium” subscription offering, enabling the company to increase prices even further. CEO Daniel Ek previously said the plan would cost about $17 or $18 per month, or around $5 more than the current Premium tier.</p>\n<p class=\"wp-block-paragraph\">The company’s profitability milestone comes on the heels of Spotify signing a new <a href=\"https://newsroom.spotify.com/2025-01-26/universal-music-group-spotify-expansion/\" rel=\"nofollow\">multi-year distribution agreement</a> with Universal Music Group. The deal, which includes payments to artists and protects their streaming royalties, could allow Spotify to launch a new offering for fans that includes extra perks.</p>\n<p class=\"wp-block-paragraph\"></p>\n</div>",
            "link": "https://techcrunch.com/2025/02/04/spotify-reports-its-full-year-of-profitability-adds-35m-monthly-active-users/",
            "author": "TechCrunch",
            "pub_date": "2025-02-04 23:16:01",
            "source": "techcrunch",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Snap unveils AI text-to-image model for mobile devices",
            "description": "<div class=\"entry-content wp-block-post-content is-layout-constrained wp-block-post-content-is-layout-constrained\">\n<p class=\"wp-block-paragraph\" id=\"speakable-summary\">Snap has unveiled an AI text-to-image model for mobile devices that will power some of Snapchat’s features in the coming months. The company said on Tuesday that the model can produce high-resolution images in around 1.4 seconds on an iPhone 16 Pro Max. </p>\n<p class=\"wp-block-paragraph\">The new diffusion model runs entirely on the device, which reduces computational costs compared to models that rely on large servers. Snap notes that the model can create “stunning” visual results by “transferring rich representations from large-scale diffusion models to this smaller and more efficient model.”</p>\n\n\n<p class=\"wp-block-paragraph\">Snap plans to bring the technology into production in the coming months to help power the app’s AI Snaps, AI Bitmoji Backgrounds, and more. </p>\n<p class=\"wp-block-paragraph\">The company says that by implementing this in-house technology, it will be able to offer its community high-quality AI tools at a lower operating cost. </p>\n<p class=\"wp-block-paragraph\">“Snap has a long history of research excellence in model optimization and efficiency,” the company said in a blog post. “We are inspired by the industry innovation that is making AI tools more efficient, affordable, and accessible and we look forward to continuing to contribute to the rapid pace of innovation, particularly for mobile-first experiences.”</p>\n<p class=\"wp-block-paragraph\">The company didn’t share any further details about the model but noted that it’s the continuation of its long-term investment in AI and ML technologies.</p>\n<p class=\"wp-block-paragraph\">While Snap has tapped AI tools from companies like <a href=\"https://techcrunch.com/2023/02/27/snapchat-launches-an-ai-chatbot-powered-by-openais-gpt-technology/\">OpenAI</a> and <a href=\"https://techcrunch.com/2024/09/24/snapchat-taps-googles-gemini-to-power-its-chatbots-generative-ai-features/\">Google</a> in the past to power some of its features, it has now debuted its own in-house AI model that will allow it to offer unique features to its users. It makes sense for the company to invest in AI and develop its own model, especially since nearly every tech company, including Meta, has been doing so over the past few years.</p>\n\n<p class=\"wp-block-paragraph\">Snap is scheduled to release its Q4 2024 earnings report on Tuesday. </p>\n</div>",
            "link": "https://techcrunch.com/2025/02/04/snap-unveils-ai-text-to-image-model-for-mobile-devices/",
            "author": "TechCrunch",
            "pub_date": "2025-02-04 22:45:52",
            "source": "techcrunch",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "LinkedIn amps up vertical video tools as uploads jump 36%",
            "description": "<div class=\"entry-content wp-block-post-content is-layout-constrained wp-block-post-content-is-layout-constrained\">\n<p class=\"wp-block-paragraph\" id=\"speakable-summary\">Video reigns supreme on social media like TikTok, Instagram, and YouTube. And now, video is becoming a bigger business for LinkedIn. </p>\n<p class=\"wp-block-paragraph\">The Microsoft-owned social network for the working world has <a href=\"https://techcrunch.com/2024/03/27/linkedin-is-experimenting-with-a-tiktok-like-video-feed-in-its-app/\">yet to go full TikTok</a>. But with a big boost of usage — today it said that video uploads jumped by 36% compared to last year, while video creation on the platform itself grew 100% — LinkedIn is adding in more features to woo more video activity: a new full-screen vertical video display for all users (not just those on mobile), along with a number of new tools to boost viewer engagement. </p>\n\n\n<p class=\"wp-block-paragraph\">The updates a week after Microsoft reported earnings that disclosed LinkedIn <a href=\"https://techcrunch.com/2025/01/29/linkedin-passes-2b-in-premium-revenues-in-12-months-with-overall-revenues-up-9-on-the-year/\">growing revenues by 9%</a> in the last year (with premium subscriptions passing $2 billion in revenue). </p>\n<p class=\"wp-block-paragraph\">The company now has over 1 billion users, so it’s a sure bet that in its drive to make more money, it will also be leaning into economies of scale around advertising and paid features. </p>\n<p class=\"wp-block-paragraph\">Video will inevitably be a major component of that because of the stickiness and popularity of the medium, not just generally on social media but on LinkedIn in particular: last week it <a href=\"https://digiday.com/media/linkedins-video-push-appears-to-be-working-in-2025/\" rel=\"nofollow\">disclosed</a> that video viewership was up 36% on last year.</p>\n<p class=\"wp-block-paragraph\">The new vertical video feed for web pages is a natural development, given that LinkedIn had already been seeing strong engagement with that format on mobile, where it had <a href=\"https://www.linkedin.com/help/linkedin/answer/a6290168\" rel=\"nofollow\">first launched</a>. As with the mobile experience, the new vertical web experience will allow people to select single videos, and then swipe or click from them to more videos in their feed.</p>\n<p class=\"wp-block-paragraph\">This is not — yet — a full-screen player for video a la TikTok or Instagram. We first reported on that test in March 2024, and LinkedIn confirms this remains in test and <a href=\"https://www.linkedin.com/feed/update/urn:li:activity:7275224371206504449/\" rel=\"nofollow\">feedback</a> mode.</p>\n\n<p class=\"wp-block-paragraph\">Meanwhile, it appears LinkedIn is going ahead and rolling out a number of features in aid of that future experience. For example, users will now see a new profile preview feature to see a creator’s profile without leaving the video, with a much more prominent follow button appearing in the interface. </p>\n<p class=\"wp-block-paragraph\">LinkedIn is also adding more video content into its search results, with a new video carousel appearing alongside other links. (It will be facinating to see how many opt for these results rather than text-based ones.)</p>\n<p class=\"wp-block-paragraph\">There are also some analytics being developed for creators, who will be able to track average watch times for their content. This is a small step but a signal that we’re likely to see more analytics features emerge in the coming months — especially if a full video feed makes its way to general release. </p>\n</div>",
            "link": "https://techcrunch.com/2025/02/04/linkedin-amps-up-vertical-video-tools-as-uploads-jump-36/",
            "author": "TechCrunch",
            "pub_date": "2025-02-04 22:15:55",
            "source": "techcrunch",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Walkstar is a new iOS app that pauses songs when you stop moving",
            "description": "<div class=\"entry-content wp-block-post-content is-layout-constrained wp-block-post-content-is-layout-constrained\">\n<p class=\"wp-block-paragraph\" id=\"speakable-summary\">There are plenty of pedometer and step counter apps in the world, but this new app has a fun twist. <a href=\"https://www.cromulentlabs.com/walkstar/\" rel=\"nofollow\">Walkstar</a>, which <a href=\"https://apps.apple.com/us/app/walkstar-move-groove/id6736508282\" rel=\"nofollow\">launched Tuesday in the App Store</a>, enhances your workout by syncing your tunes with your movement. The moment you pause, the music fades away, making it a perfect motivator for those looking to maintain an active lifestyle.</p>\n<p class=\"wp-block-paragraph\">When you start walking or running for at least 10 seconds, the music begins to play. If the app detects that you’ve stopped moving, the music will also stop. It will resume playing once you start moving again.</p>\n\n\n<p class=\"wp-block-paragraph\">The app was created by Greg Gardner, who previously developed <a href=\"https://apps.apple.com/us/app/launcher-with-multiple-widgets/id905099592\" rel=\"nofollow\">Launcher</a>, the app-launching widget that allows iPhone users to launch an app, perform an action, or access a website with one tap.</p>\n<p class=\"wp-block-paragraph\">Gardner shared with TechCrunch that he got the idea for Walkstar after observing someone online who combined an old Sony Walkman with a pedometer. This allowed the device to play music only while the user was walking. (Unfortunately, we were unable to locate the original post.)</p>\n<p class=\"wp-block-paragraph\">“I thought that was really clever and realized that the same thing could probably be accomplished with an iPhone app and that it could be a really nice motivational tool to encourage people to walk more,” Gardner said. </p>\n<p class=\"wp-block-paragraph\">One particularly fun aspect of Walkstar is its retro-style interface, which transforms your phone into a colorful portable cassette player, reminiscent of an old-school Walkman. A nostalgic touch is added with a sound tape hiss that plays when the music starts.</p>\n<figure class=\"wp-block-image aligncenter size-large\"><img alt=\"\" class=\"wp-image-2958966\" decoding=\"async\" height=\"1200\" loading=\"lazy\" sizes=\"auto, (max-width: 555px) 100vw, 555px\" src=\"https://techcrunch.com/wp-content/uploads/2025/02/walkstar_song.png?w=315\" srcset=\"https://techcrunch.com/wp-content/uploads/2025/02/walkstar_song.png 555w, https://techcrunch.com/wp-content/uploads/2025/02/walkstar_song.png?resize=69,150 69w, https://techcrunch.com/wp-content/uploads/2025/02/walkstar_song.png?resize=139,300 139w, https://techcrunch.com/wp-content/uploads/2025/02/walkstar_song.png?resize=315,680 315w, https://techcrunch.com/wp-content/uploads/2025/02/walkstar_song.png?resize=199,430 199w, https://techcrunch.com/wp-content/uploads/2025/02/walkstar_song.png?resize=333,720 333w, https://techcrunch.com/wp-content/uploads/2025/02/walkstar_song.png?resize=416,900 416w, https://techcrunch.com/wp-content/uploads/2025/02/walkstar_song.png?resize=370,800 370w, https://techcrunch.com/wp-content/uploads/2025/02/walkstar_song.png?resize=309,668 309w, https://techcrunch.com/wp-content/uploads/2025/02/walkstar_song.png?resize=173,375 173w, https://techcrunch.com/wp-content/uploads/2025/02/walkstar_song.png?resize=285,617 285w, https://techcrunch.com/wp-content/uploads/2025/02/walkstar_song.png?resize=246,531 246w\" width=\"555\"/><figcaption class=\"wp-element-caption\"><span class=\"wp-block-image__credits\"><strong>Image Credits:</strong>Cromulent Labs</span></figcaption></figure>\n<p class=\"wp-block-paragraph\">Other neat features include Game Center integration to view leaderboards and achievements. There’s also a Live Activity widget for tracking step count and distance, as well as Shortcuts integration for starting and stopping walking sessions, among other features.</p>\n\n<p class=\"wp-block-paragraph\">The app is available to download for free, but there’s also a Premium subscription if you want to customize the app with colorful app icons and cassette tape covers. Additionally, Premium members can view analytics, including their overall step count and walking history.</p>\n<p class=\"wp-block-paragraph\">In the future, Gardner plans to introduce more features that will enable people to share their progress and compete with friends. If the app gains sufficient popularity, he may also consider developing an Android version.</p>\n<figure class=\"wp-block-image aligncenter size-large\"><img alt=\"\" class=\"wp-image-2958968\" decoding=\"async\" height=\"1200\" loading=\"lazy\" sizes=\"auto, (max-width: 555px) 100vw, 555px\" src=\"https://techcrunch.com/wp-content/uploads/2025/02/walkstar_steps-1.png?w=315\" srcset=\"https://techcrunch.com/wp-content/uploads/2025/02/walkstar_steps-1.png 555w, https://techcrunch.com/wp-content/uploads/2025/02/walkstar_steps-1.png?resize=69,150 69w, https://techcrunch.com/wp-content/uploads/2025/02/walkstar_steps-1.png?resize=139,300 139w, https://techcrunch.com/wp-content/uploads/2025/02/walkstar_steps-1.png?resize=315,680 315w, https://techcrunch.com/wp-content/uploads/2025/02/walkstar_steps-1.png?resize=199,430 199w, https://techcrunch.com/wp-content/uploads/2025/02/walkstar_steps-1.png?resize=333,720 333w, https://techcrunch.com/wp-content/uploads/2025/02/walkstar_steps-1.png?resize=416,900 416w, https://techcrunch.com/wp-content/uploads/2025/02/walkstar_steps-1.png?resize=370,800 370w, https://techcrunch.com/wp-content/uploads/2025/02/walkstar_steps-1.png?resize=309,668 309w, https://techcrunch.com/wp-content/uploads/2025/02/walkstar_steps-1.png?resize=173,375 173w, https://techcrunch.com/wp-content/uploads/2025/02/walkstar_steps-1.png?resize=285,617 285w, https://techcrunch.com/wp-content/uploads/2025/02/walkstar_steps-1.png?resize=246,531 246w\" width=\"555\"/></figure>\n<p class=\"wp-block-paragraph\">It’s important to note that Walkstar is currently only compatible with Apple services, including Apple Music, Apple Podcasts, Apple Books, and iTunes. Users can also listen to music that they manually load onto their devices via the Apple Music app.</p>\n\n\n<p class=\"wp-block-paragraph\">Gardner is exploring the possibility of adding more music-streaming integrations, with Spotify being the first target. A test version featuring Spotify is currently under review in the App Store.</p>\n<p class=\"wp-block-paragraph\">“Hopefully, it gets approved in the next few months,” Gardner stated.</p>\n</div>",
            "link": "https://techcrunch.com/2025/02/04/walkstar-is-a-new-ios-app-that-pauses-songs-when-you-stop-moving/",
            "author": "TechCrunch",
            "pub_date": "2025-02-04 22:01:06",
            "source": "techcrunch",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Canada’s StackAdapt snaps up $235M for its AI-based programmatic platform",
            "description": "<div class=\"entry-content wp-block-post-content is-layout-constrained wp-block-post-content-is-layout-constrained\">\n<p class=\"wp-block-paragraph\" id=\"speakable-summary\">While the U.S. and Canada duke it out over tariffs between the two countries, a tech company based out of Toronto is announcing a major round of funding led by a homegrown VC. <a href=\"https://www.stackadapt.com/\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">StackAdapt</a>, a programmatic advertising startup, says that it has raised $235 million in equity funding, with Teachers’ Venture Growth (TVG) — the investment arm of the Ontario Teachers’ Pension Plan — leading the growth round. </p>\n<p class=\"wp-block-paragraph\">Intrepid Growth Partners, a firm based between Toronto and London, is also participating, along with four other investors that are not being named. </p>\n\n\n<p class=\"wp-block-paragraph\">The funding is significant both for its size and its focus. </p>\n<p class=\"wp-block-paragraph\">In terms of the size, this is one of the bigger funding rounds for a startup out of Canada to date — although it’s not the biggest. Most recently, Fintech Clio <a href=\"https://techcrunch.com/2024/07/23/clio-raises-900m-at-a-3b-valuation-plans-to-double-down-on-ai-and-fintech/\">raised $900 million</a>; Cohere <a href=\"https://techcrunch.com/2024/07/22/cohere-raises-500m-to-beat-back-generative-ai-rivals/\">raised $500 million</a>, and Tenstorrent <a href=\"https://techcrunch.com/2024/12/02/jeff-bezos-backs-ai-chipmaker-tenstorrent/\">raised $700 million</a>, all last year. </p>\n<p class=\"wp-block-paragraph\">Funding for Canadian startups is largely reflecting trends that are playing out in other markets. The total number of deals in <a href=\"https://thelogic.co/news/why-axis/canada-canada-vc-q4-2024-ai-startups/\" rel=\"nofollow\">2024</a> was down on the year before, with companies working in the area of artificial intelligence taking an outsized part of what was getting invested.  </p>\n<p class=\"wp-block-paragraph\">StackAdapt, which describes itself as a company that “harnesses the power of AI”, is arguably a part of trend. The company launched in 2014 and had more or less grown as a quietly bootstrapped company. That was until 2022, when it took a $300 million investment from Summit Partners. <a href=\"https://my.pitchbook.com/profile/93668-23/company/profile#general-info\" rel=\"nofollow\">PitchBook data</a> indicates that at least some of that $300 million was in the form of a secondary investment. From what we understand it was a minority investment, which would put the company’s valuation at above $600 million.</p>\n<p class=\"wp-block-paragraph\">The company is not disclosing valuation with this current round.</p>\n\n<p class=\"wp-block-paragraph\">The size of this round speaks not only to the company’s size today, but also notably how it’s financing the next stage of its growth with local backing. </p>\n<p class=\"wp-block-paragraph\">Programmatic advertising has become, effectively, the building block of how all digital advertising works these days accounting for upwards of 90% of the market, the reason being that it gives marketers a more effective way of measuring how their ads are working, and to whom those ads are being shown; and it gives publishers a more automated way of bringing in a larger volume of ads against their content. </p>\n<p class=\"wp-block-paragraph\">In the case of StackAdapt, the company offers customers across different business verticals — for example, political campaigns, retailers, B2B, travel, healthcare and financial services — and its inventory includes native advertising (sponsored content), display, video, connected TV, audio, games and more. </p>\n\n\n<p class=\"wp-block-paragraph\">Developments like the rise of AI (along with other kinds of automation) have shifted the landscape for programmatic advertising, leading to potentially higher incidents of ad fraud. Other issues that programmatic advertising faces include more difficulty controlling brand safety and data protection, given the amount of data used to power its ad targeting. </p>\n<p class=\"wp-block-paragraph\">That’s the challenge but also opportunity for companies like StackAdapt. </p>\n<p class=\"wp-block-paragraph\"><strong>“</strong>Following the 2022–2023 lull, companies are shifting their focus toward growth and increasing their investments,” said Vitaly Pecherskiy, the CEO who co-founded the company with Yang Han, and Ildar Shar, in a statement to TechCrunch. “That said, growth at all costs is no longer the priority. Companies are looking for solutions to drive their business forward while prioritizing cost-effectiveness through automation and AI. As a result, we are seeing strong demand for our product.”</p>\n<p class=\"wp-block-paragraph\">StackAdapt, he said has built its AI on “a decade of experience analyzing ad traffic patterns and understanding their evolution,” which it uses to help combat ad fraud and bot traffic.</p>\n<p class=\"wp-block-paragraph\">“We are proud to support StackAdapt, a leading Canadian technology company, on its trajectory to becoming the global leader in AI-driven, end-to-end advertising,” said Rick Prostko, senior managing director of TVG, in a statement. “The company has been able to demonstrate consistent growth and profitability while building the future of advertising and marketing technology. We have been impressed by their exceptional team, visionary leadership, and relentless focus on delivering customer value.” </p>\n</div>",
            "link": "https://techcrunch.com/2025/02/04/canadas-stackadapt-snaps-up-235m-for-its-ai-based-programmatic-platform/",
            "author": "TechCrunch",
            "pub_date": "2025-02-04 21:20:58",
            "source": "techcrunch",
            "kind": 1,
            "language": "en"
        }
    ]
}