{
    "data": [
        {
            "title": "Archive raises $30M to solve fashion’s pollution problem with online resales",
            "description": "<div class=\"entry-content wp-block-post-content is-layout-constrained wp-block-post-content-is-layout-constrained\">\n<p class=\"wp-block-paragraph\" id=\"speakable-summary\">The fashion industry has concerned Emily Gittins since adolescence. </p>\n<p class=\"wp-block-paragraph\">The sector is, after all, one of the most polluting in the world. According to some sources, it is responsible for nearly 10% of the <a href=\"https://earth.org/fast-fashions-detrimental-effect-on-the-environment/\" rel=\"nofollow\">earth’s CO2 emissions</a> and <a href=\"https://blogs.gwu.edu/law-gwpointsource/2023/10/02/fast-fashion-polluting-our-water-millions-of-clothing-items-at-a-time/\" rel=\"nofollow\">more than 20%</a> of all water waste. </p>\n\n\n<p class=\"wp-block-paragraph\">Yet people still want more, fast. </p>\n<p class=\"wp-block-paragraph\">“The way we consume today is hugely problematic,” Gittins told TechCrunch. </p>\n<p class=\"wp-block-paragraph\">In 2021, Gittins teamed up with Ryan Rowe to launch Archive, a company that provides software to fashion brands and merchants so they can create resale platforms <a href=\"https://www.archiveresale.com/blog/a-beginners-guide-to-resale-models\" rel=\"nofollow\">tailored to each business’s</a> wants and needs, including a spot where people can sell used clothes to each other. </p>\n<p class=\"wp-block-paragraph\">Competitors include Trove and Treet, which also creates online resale software for brands to sell used items. Archive says its product is different because it can support global brands across various continents. </p>\n<p class=\"wp-block-paragraph\">Archive’s features include smart pricing and product feeds; and warehouse management to handle intake, processing, repair, and fulfillment; it also provides tools to analyze profits and costs and allows brands to connect it to their own tools and share data. Archive already works with more than 50 brands, including New Balance, The North Face, and Oscar de la Renta, Gittins says.</p>\n\n<p class=\"wp-block-paragraph\">There is a massive opportunity in the general second-hand market, which is expected to<a href=\"https://www.retaildive.com/news/resale-secondhand-apparel-market-growth-projections/711476/\" rel=\"nofollow\"> hit $73 billion</a> by 2028 in the U.S. alone, according to the resale report by retailer ThreadUp. That share of the fashion industry is only expected to increase, <a href=\"https://www.theguardian.com/business/2024/mar/27/secondhand-clothing-on-track-to-take-10-of-global-fashion-sales\" rel=\"nofollow\">as the Guardian reported</a>, especially among young people and anyone else looking for more eco, and budget-friendly options. </p>\n<p class=\"wp-block-paragraph\">That’s what convinced VCs to invest a $30 million Series B, led by Energize Capital. Other investors include Lightspeed Venture Partners, G9 Ventures, and Bain Capital. Archive has raised $54 million in total funding to date. Archive will use the new funding to further develop its resale software and more product innovation. </p>\n<p class=\"wp-block-paragraph\">Another good sign for the clothing resale industry is <a href=\"https://www.archiveresale.com/blog/a-comprehensive-guide-to-the-latest-us-sustainable-fashion-policy\" rel=\"nofollow\">growing legislation in a number of states </a>that encourages it, like California’s new Responsible Textile Recovery Act, and well as similar legislation in<a href=\"https://www.archiveresale.com/blog/your-complete-guide-to-sustainable-fashion-policy-in-europe\" rel=\"nofollow\"> Europe</a>. </p>\n\n\n<p class=\"wp-block-paragraph\">“We’ve debunked the concern that resale cannibalizes full-price scales,” Gittins added. “We’re in scaling mode with many of our brands and are excited to be launching resale businesses for so many new brands in 2025.” </p>\n</div>",
            "link": "https://techcrunch.com/2025/02/04/archive-raises-30m-to-solve-fashions-pollution-problem-with-online-resales/",
            "author": "TechCrunch",
            "pub_date": "2025-02-04 21:01:03",
            "source": "techcrunch",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Egypt’s Khazna banks $16M for its financial super app and expansion into Saudi",
            "description": "<div class=\"entry-content wp-block-post-content is-layout-constrained wp-block-post-content-is-layout-constrained\">\n<p class=\"wp-block-paragraph\" id=\"speakable-summary\">A large portion of Egypt’s population lacks access to traditional banking, forcing many to rely on cash transactions and informal lending. <a href=\"https://techcrunch.com/2022/03/31/egyptian-financial-super-app-khazna-raises-38m-from-quona-capital-and-lendable/\">Khazna</a>, a fintech startup founded in 2019, is tackling this issue by offering financial services tailored for low- and middle-income workers. The company provides solutions like salary advances, digital payments, and microloans to help employees and contractors access much-needed financial services.</p>\n<p class=\"wp-block-paragraph\">Khazna recently secured $16 million in pre-Series B funding, bringing its total funding to over $63 million. The investment will support its expansion plans as it prepares to apply for a digital banking license in Egypt and expand into Saudi Arabia.</p>\n\n\n<p class=\"wp-block-paragraph\">When we covered the fintech in 2022, it <a href=\"https://techcrunch.com/2022/03/31/egyptian-financial-super-app-khazna-raises-38m-from-quona-capital-and-lendable/\">had just raised $38 million</a> pre-Series A with over 150,000 customers across its products. Today, Khazna has grown its user base to over 500,000 people; that number is half what it was targeting twice by the end of 2022, according to what Saleh shared at the time.</p>\n<p class=\"wp-block-paragraph\">The company focuses on workers earning three times less than Egypt’s minimum wage, providing them with affordable financial tools. About 100,000 users receive their payroll through Khazna, allowing the company to integrate financial services such as loans and insurance directly into their payroll accounts.</p>\n<p class=\"wp-block-paragraph\">For the remaining 400,000 users, Khazna offers lending services, helping gig workers and pensioners access credit. CEO Omar Saleh explained that the company initially focused on payroll-backed credit and pension lending, contributing to its break-even last month. </p>\n<p class=\"wp-block-paragraph\">“What we did over the last two and half years was to focus on our core product, which is credit offering to payroll and pension recipients and also unsecured loans to gig workers,” co-founder and CEO Omar Saleh told TechCrunch on a call. “This is the most profitable and core product in our journey, and getting it right was very important because it has helped us to hit profitability.”</p>\n<figure class=\"wp-block-embed is-type-wp-embed is-provider-techcrunch wp-block-embed-techcrunch\"><div class=\"wp-block-embed__wrapper\">\n<blockquote class=\"wp-embedded-content\" data-secret=\"tXKbrfEl4A\"><a href=\"https://techcrunch.com/2022/03/31/egyptian-financial-super-app-khazna-raises-38m-from-quona-capital-and-lendable/\">Egyptian financial super app Khazna raises $38M from Quona Capital and Lendable</a></blockquote><iframe class=\"wp-embedded-content\" data-secret=\"tXKbrfEl4A\" frameborder=\"0\" height=\"282\" loading=\"lazy\" marginheight=\"0\" marginwidth=\"0\" sandbox=\"allow-scripts\" scrolling=\"no\" security=\"restricted\" src=\"https://techcrunch.com/2022/03/31/egyptian-financial-super-app-khazna-raises-38m-from-quona-capital-and-lendable/embed/#?secret=wRwe8u0ueT#?secret=tXKbrfEl4A\" style=\"position: absolute; visibility: hidden;\" title=\"“Egyptian financial super app Khazna raises $38M from Quona Capital and Lendable” — TechCrunch\" width=\"500\"></iframe>\n</div></figure>\n<h2 class=\"wp-block-heading\" id=\"h-on-the-path-to-becoming-a-digital-bank\">On the path to becoming a digital bank</h2>\n<p class=\"wp-block-paragraph\">Khazna provides other services like bill payments, buy now, pay later, medical insurance, and a rent-to-own product. But by embedding itself into both payroll and lending, it is strategically moving toward becoming a full-fledged digital bank for Egypt’s underserved communities. </p>\n\n<p class=\"wp-block-paragraph\">But one thing is missing: unlike traditional banks, Khazna, like many fintechs in Egypt, doesn’t have access to customer deposits, making it expensive to fund loans. So far, Khazna has relied on wholesale debt financing in dollars (USD) and the Egyptian pound (EGP) to fund its lending operations.</p>\n<p class=\"wp-block-paragraph\">To reduce borrowing costs and offer more affordable loans, Khazna is now working to obtain a deposit-taking license in Egypt. This license would allow the startup to accept customer deposits, allowing it to lower its cost of funds. </p>\n<p class=\"wp-block-paragraph\">“The biggest game changer here is for us to get access to user deposits. There’s a huge opportunity for us to capture part of that market as well in a way that will make our cost of funding much more attractive than it is today, and ultimately, that would put us in a very differentiated position,” he remarked. </p>\n\n\n<p class=\"wp-block-paragraph\">Khazna is targeting mid-2026 to secure the banking license from Egypt’s Central Bank, which laid out its regulatory framework for digital banks in July 2024.</p>\n<p class=\"wp-block-paragraph\">But as the six-year-old fintech gets started with that process, it’s simultaneously setting sights on Saudi Arabia, where there is a growing demand for consumer finance solutions. Unlike BNPL players like <a href=\"https://techcrunch.com/2023/10/31/buy-now-pay-later-platform-tabby-nabs-200m-in-series-d-funding-at-1-5b-valuation/\">Tabby</a> and <a href=\"https://techcrunch.com/2023/12/18/saudi-shopping-and-bnpl-platform-tamara-tops-1b-valuation-in-340m-series-c-funding/\">Tamara</a>, which focus on short-term BNPL credit, Khazna hopes to differentiate itself with medium-term credit products like earned wage access (EWA), payroll-backed lending, and pension-based credit.</p>\n<h2 class=\"wp-block-heading\" id=\"h-expansion-plans-including-a-not-so-imminent-ipo\">Expansion plans, including a not-so-imminent IPO</h2>\n<p class=\"wp-block-paragraph\">Another reason Khazna is prioritizing Saudi is its strong connection with Egypt, Saleh notes. With nearly three million Egyptians living in Saudi, the Egypt-Saudi remittance corridor is one of the world’s largest, presenting an opportunity to offer cross-border financial services, combining credit-led offerings with foreign exchange (FX) solutions. </p>\n<p class=\"wp-block-paragraph\">Beyond market size and product fit, Saudi Arabia’s capital markets are also a driver in Khazna’s decision, according to Saleh. Tadawul is one of the region’s most liquid and retail-investor-driven stock exchanges, launching several IPOs over the past couple of years.</p>\n<p class=\"wp-block-paragraph\">For that reason, Khazna plans to have 40-50% of its business coming from Saudi in the next four years, making it eligible for a public listing on Tadawul. For early-stage investors who have backed the company for four to five years, Saleh says this provides a clear path to a high-value exit.</p>\n<p class=\"wp-block-paragraph\">Sure, Khazna will fund this expansion with the recently raised growth capital. However, the macroeconomic challenges in Egypt over the past two years had a hand in structuring this pre-Series B round.   </p>\n<p class=\"wp-block-paragraph\">Between 2022 and 2023, Egypt faced currency devaluations and economic instability, making fundraising more difficult for startups and ventures. The overall slowdown in deal flow reflected this, as investors took a cautious approach to Egyptian startups. But 2024 brought a major shift, with over $50 billion in foreign direct investment (FDI) flowing into Egypt following economic reforms and a more flexible exchange rate. As a result, investor confidence returned, bringing renewed interest from global and regional investors.</p>\n<p class=\"wp-block-paragraph\">As such, Khazna welcomed participation from new and existing investors, including global investors like Quona and Speedinvest, as well as regional financial institutions and investment firms like SANAD Fund for MSME, anb Seed Fund (managed by anb Capital), Aljazira Capital (the investment arm of Bank Aljazira of Saudi Arabia), Tibas Ventures (the venture capital arm of İşbank of Turkey), Khwarizmi Ventures, Nclude (the fintech fund set up by Egypt’s largest national banks) and ICU Ventures. </p>\n\n\n<p class=\"wp-block-paragraph\"></p>\n</div>",
            "link": "https://techcrunch.com/2025/02/04/egypts-khazna-banks-16m-for-its-financial-super-app-and-expansion-into-saudi/",
            "author": "TechCrunch",
            "pub_date": "2025-02-04 19:15:55",
            "source": "techcrunch",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "OpenAI doubles down on Asia, partners with Kakao after its big deal with SoftBank",
            "description": "<div class=\"entry-content wp-block-post-content is-layout-constrained wp-block-post-content-is-layout-constrained\">\n<p class=\"wp-block-paragraph\" id=\"speakable-summary\">On the heels of Chinese AI firm DeepSeek making a huge splash in OpenAI’s American backyard, OpenAI is diving into expanding in Asia, with major commercial deals that will also help it train its AI on more Asian-language content and user behavior — a gateway to doing more business in these markets in the future on its own.</p>\n<p class=\"wp-block-paragraph\">Today, OpenAI unveiled a strategic collaboration with Kakao, the South Korea tech company that operates one of the region’s most popular messaging apps, KakaoTalk. </p>\n\n\n<p class=\"wp-block-paragraph\">The move comes one day after SoftBank also <a href=\"https://group.softbank/en/news/press/20250203_0\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">announced</a> a major commitment to using OpenAI: it has allocated a budget of $3 billion to deploy OpenAI tech across its various group operations and subsidiaries, as well as establish a joint venture, SB OpenAI Japan, to build solutions customized for enterprises in the country.</p>\n<p class=\"wp-block-paragraph\">Today’s Kakao news was announced earlier today at an event in Seoul co-led by Kakao CEO Shina Chung and OpenAI CEO Sam Altman, and it will initially cover <a href=\"https://www.kakaocorp.com/page/detail/11451\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">three projects</a>.</p>\n<p class=\"wp-block-paragraph\">The companies plan to develop a new Korean-language assistant called Kanana powered by OpenAI; OpenAI tech will be integrated into KakaoTalk; and Kakao will also become a customer of OpenAI’s, using ChatGPT Enterprise internally among its employees.</p>\n<p class=\"wp-block-paragraph\">Meanwhile, the SoftBank announcement is just the latest development of what looks like a pretty deep-looking relationship between the two companies. SoftBank is also <a href=\"https://techcrunch.com/2025/01/29/softbank-in-talks-to-invest-as-much-as-25b-in-openai-report-says/\" rel=\"noreferrer noopener\" target=\"_blank\">reportedly</a> eyeing up a major investment in OpenAI — yet to be confirmed — and the two are in theory also working together on the <a href=\"https://techcrunch.com/2025/01/23/openai-and-softbank-are-reportedly-putting-19b-each-into-stargate/\">Stargate</a> project to build AI superservers and other infrastructure in the U.S..</p>\n<p class=\"wp-block-paragraph\">On the surface, both of these partnerships are big commercial deals that will bring OpenAI services to new populations in their home languages.</p>\n\n<p class=\"wp-block-paragraph\">“Kakao has a deep understanding of how technology can enrich everyday lives, and they’ve consistently delivered innovative experiences for their users,” Altman said in a statement. “We’re excited to bring advanced AI to Kakao’s millions of users and work together to integrate our technology into services that transform how Kakao’s users communicate and connect.”</p>\n<p class=\"wp-block-paragraph\">But beyond that, in both the case of Kako and SoftBank, the deals will benefit OpenAI in another very significant way. </p>\n<p class=\"wp-block-paragraph\">The U.S. company continues to build out and train its Large Language Models. Deals with major players in Korea and Japan, with their access to millions of consumers in their respective markets, gives OpenAI an opportunity to unlock new linguistic doors. </p>\n\n\n<p class=\"wp-block-paragraph\">This is especially important given DeepSeek. If the Chinese AI company proves to be more than just a viral flash in the pan — and it doesn’t get buried under a sea of legal issues around copyright, personal data protection, and more — it will have proven to be a very clear signal to OpenAI that a company building outside of the U.S. has stolen a march on capturing English-language generative AI momentum. </p>\n<p class=\"wp-block-paragraph\">Thus, OpenAI needs to continue to expand its reach internationally, too, and that includes in terms of its ability to work just as well in different languages as it does in English. </p>\n<p class=\"wp-block-paragraph\">It’s notable too because SoftBank at one point saw a very different route, and opening, for itself. </p>\n<p class=\"wp-block-paragraph\">Seizing the opportunity to build for its home language in an AI world largely dominated by English natural language services, in 2023, it announced a new company. <a href=\"https://techcrunch.com/2023/08/04/softbank-launches-an-openai-for-japan-sb-intuitions-building-llms-and-generative-ai-in-japanese/\" rel=\"noreferrer noopener\" target=\"_blank\">SB Intuitions</a> aimed to build LLMs and generative AI in Japanese. </p>\n<p class=\"wp-block-paragraph\">It’s not clear what is happening with that business — whether it never got off the ground, or whether that work will be rolled into the JV, or something else altogether. We have contacted the company and will update as we learn more.</p>\n<p class=\"wp-block-paragraph\">Apart from the collaboration with Kakao, Altman is using the moment to connect with other major Korean tech giants. He also took meetings with top executives at Samsung Electronics and Korean semiconductor maker SK Hynix to discuss custom-designed chips and AI-powered devices, <a href=\"http://Altman held meeting with execs at Samsung Electronics and Korean semiconductor maker SK Hynix to discuss its custom-designed chips and AI-powered devices, per a local media report. OpenAI is joining other tech giants such as Google, Amazon, Microsoft, and Meta, all of which are developing their own in-house AI chips.\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">per a local media report</a>. OpenAI is joining other tech giants such as Google, Amazon, Microsoft, and Meta, <a href=\"https://www.nytimes.com/2024/12/03/technology/nvidia-ai-chips.html\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">all developing their own in-house AI chips</a>.</p>\n<h1 class=\"wp-block-heading\" id=\"h-softbank-openai-japan\">SoftBank OpenAI Japan</h1>\n<p class=\"wp-block-paragraph\">The latest strategic collaboration comes a day after OpenAI’s<a href=\"https://group.softbank/en/news/press/20250203_0\" rel=\"noreferrer noopener nofollow\" target=\"_blank\"> joint venture announcement</a> on Monday with SoftBank, which will spend $3 billion annually to implement the U.S. AI firm’s solutions, including ChatGPT Enterprise, OpenAI’s API and agents products like <a href=\"https://openai.com/index/computer-using-agent/\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">Operator</a>, across its group companies. The Japanese tech giant and OpenAI have set up “SB OpenAI Japan,” a JV that will exclusively offer the U.S. AI startup’s enterprise technology to large enterprises in Japan.</p>\n<p class=\"wp-block-paragraph\">Last week, OpenAI introduced <a href=\"https://openai.com/index/computer-using-agent/\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">Operator</a>, an agent capable of carrying out tasks like vacation planning and restaurant reservations on the web, and the <a href=\"https://openai.com/index/openai-o3-mini/\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">o3-mini</a>, the latest and most cost-effective reasoning model. The creator of ChatGPT also unveiled a new capability called <a href=\"https://openai.com/index/introducing-deep-research/\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">Deep Research</a>, which can perform in-depth internet research for complicated tasks.</p>\n\n\n<p class=\"wp-block-paragraph\">Arm, the chip designer from the U.K. acquired by SoftBank in 2016, will also use OpenAI tools to increase productivity, per <a href=\"https://group.softbank/en/news/press/20250203_0\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">SoftBank’s statement</a>.</p>\n<p class=\"wp-block-paragraph\">SoftBank is <a href=\"https://www.reuters.com/technology/artificial-intelligence/openai-talks-investment-round-valuing-it-up-340-billion-wsj-reports-2025-01-30/\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">reportedly</a> <a href=\"https://techcrunch.com/2025/01/29/softbank-in-talks-to-invest-as-much-as-25b-in-openai-report-says/\">in talks to</a> lead a funding round for OpenAI that could be worth as much as $40 billion and potentially value the company at $300 billion.</p>\n<p class=\"wp-block-paragraph\">Separately to this, <a href=\"https://techcrunch.com/2025/01/21/openai-teams-up-with-softbank-and-oracle-on-50b-data-center-project/\">last month, OpenAI said it will team up with SoftBank and Oracle </a>to build multiple data centers for AI in the U.S., forming a joint venture called the Stargate Project. The project will kick off with a large data center in Texas. Initially, the three companies plan to invest $100 billion in Stargate and potentially contribute up to $500 billion to the project in the following four years.</p>\n<figure class=\"wp-block-embed is-type-wp-embed is-provider-techcrunch wp-block-embed-techcrunch\"><div class=\"wp-block-embed__wrapper\">\n<blockquote class=\"wp-embedded-content\" data-secret=\"csXdr0MB5E\"><a href=\"https://techcrunch.com/2025/01/29/softbank-in-talks-to-invest-as-much-as-25b-in-openai-report-says/\">SoftBank in talks to invest as much as $25B in OpenAI, report says</a></blockquote><iframe class=\"wp-embedded-content\" data-secret=\"csXdr0MB5E\" frameborder=\"0\" height=\"282\" loading=\"lazy\" marginheight=\"0\" marginwidth=\"0\" sandbox=\"allow-scripts\" scrolling=\"no\" security=\"restricted\" src=\"https://techcrunch.com/2025/01/29/softbank-in-talks-to-invest-as-much-as-25b-in-openai-report-says/embed/#?secret=CFzpxv3TLD#?secret=csXdr0MB5E\" style=\"position: absolute; visibility: hidden;\" title=\"“SoftBank in talks to invest as much as $25B in OpenAI, report says” — TechCrunch\" width=\"500\"></iframe>\n</div></figure>\n</div>",
            "link": "https://techcrunch.com/2025/02/04/openai-doubles-down-on-asia-partners-with-kakao-after-its-big-deal-with-softbank/",
            "author": "TechCrunch",
            "pub_date": "2025-02-04 18:20:51",
            "source": "techcrunch",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Grubhub confirms data breach affecting customers and drivers",
            "description": "<div class=\"entry-content wp-block-post-content is-layout-constrained wp-block-post-content-is-layout-constrained\">\n<p class=\"wp-block-paragraph\" id=\"speakable-summary\">U.S. food delivery giant Grubhub says hackers accessed the personal details of customers and drivers after breaching its internal systems. </p>\n<p class=\"wp-block-paragraph\">Grubhub is a popular food-ordering and delivery platform with over 375,000 merchants and 200,000 delivery providers using its platform in more than 4,000 U.S. cities. New York-based <a href=\"https://techcrunch.com/2024/11/12/just-eat-takeaway-sells-grubhub-to-wonder-for-650-million/\">Wonder Group acquired the company</a> last fall in a deal valued at $650 million — a fraction of the <a href=\"https://techcrunch.com/2020/06/10/just-eat-takeaway-confirms-its-gobbling-up-grubhub-in-a-7-3b-deal/\">$7.3 billion Just Eat Takeaway paid for it back in 2020</a>. </p>\n\n\n<p class=\"wp-block-paragraph\">On Monday, the Illinois-based company disclosed a data breach impacting the personal data of an undisclosed number of customers, merchants and drivers. Grubhub said it detected “unusual activity” in its network which it traced to a third-party service provider. </p>\n<p class=\"wp-block-paragraph\">“Upon discovery, we promptly launched an investigation, identifying unauthorized access to an account associated with this provider,” <a href=\"https://about.grubhub.com/news/our-response-to-a-third-party-vendor-incident/\" rel=\"nofollow\">Grubhub said in a statement</a>. “We immediately terminated the account’s access and removed the service provider from our systems altogether.”</p>\n<p class=\"wp-block-paragraph\">It said the intrusion allowed unnamed hackers to access the personal details of customers, merchants and drivers who interacted with its customer care service. The breach also affected users of Grubhub’s Campus Dining service, which allows university students to use their meal credits on the food delivery app. </p>\n<p class=\"wp-block-paragraph\">According to Grubhub personal details accessed include names, email addresses, phone numbers, and partial payment card information — including the last four digits of the card number — for a “subset” of campus diners. The hacker also accessed hashed passwords for certain legacy systems, per Grubhub, but it added that bank account details and Social Security numbers were not affected by the breach. </p>\n<p class=\"wp-block-paragraph\">As well as not disclosing how many individuals have been affected by the breach Grubhub has not confirmed when the incident occurred. </p>\n\n<p class=\"wp-block-paragraph\">The company did not immediately respond to TechCrunch’s questions. </p>\n</div>",
            "link": "https://techcrunch.com/2025/02/04/grubhub-confirms-data-breach-affecting-customers-and-drivers/",
            "author": "TechCrunch",
            "pub_date": "2025-02-04 18:20:49",
            "source": "techcrunch",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Waabi and Volvo team up to build self-driving trucks at scale",
            "description": "<div class=\"entry-content wp-block-post-content is-layout-constrained wp-block-post-content-is-layout-constrained\">\n<p class=\"wp-block-paragraph\" id=\"speakable-summary\">Self-driving truck startup Waabi is partnering with Volvo Autonomous Solutions to jointly develop and deploy autonomous trucks, an important milestone as it gets closer to a commercial launch. </p>\n<p class=\"wp-block-paragraph\">The tie up also marks Volvo’s second partnership to co-develop self-driving big rigs with a startup partner. In May 2024, <a href=\"https://techcrunch.com/2024/05/20/aurora-volvo-unveil-self-driving-truck-driverless-future/\" rel=\"noreferrer noopener\" target=\"_blank\">Volvo teamed up with Aurora Innovation</a> to reveal the Volvo VNL Autonomous truck. </p>\n\n\n<p class=\"wp-block-paragraph\">Waabi will be using the same truck, but it will have Waabi’s tech on it, including its sensor suite, compute, and the Waabi Driver software. </p>\n<p class=\"wp-block-paragraph\">“We now have everything we need to scale our product,” Raquel Urtasun, founder and CEO of Waabi, told TechCrunch. “We have the next-generation AV 2.0 technology, we have an approach that is much more capital efficient, and a much faster path to market.”</p>\n<p class=\"wp-block-paragraph\">Waabi plans to launch commercial pilots with the Volvo-built trucks in Texas over the next couple of months, with a product-ready driverless demonstration on public roads planned for the end of 2025. </p>\n<p class=\"wp-block-paragraph\">A fully driverless commercial launch – directly between customer depots from day one, rather than via terminals – will follow soon afterwards, according to Urtasun. </p>\n<p class=\"wp-block-paragraph\">Urtasun, who previously served as chief scientist at Uber ATG before launching Waabi in 2021, claims to have built AI models that can <a href=\"https://techcrunch.com/2024/06/18/waabis-genai-promises-to-do-so-much-more-than-power-self-driving-trucks/\" rel=\"noreferrer noopener\" target=\"_blank\">reason as a human would</a>, which in turn speeds up commercial deployment and makes for a more efficient system overall. She has reasoned that a better quality AI will require much less data and compute to understand and react to the world around it.  </p>\n\n<p class=\"wp-block-paragraph\">Waabi has relied on its simulation technology to not just test and train its self-driving technology, but also to help design trucks for OEM integration. The startup unveiled its first purpose-built truck — with sensors, compute, and software built in at the assembly line — <a href=\"https://techcrunch.com/2022/11/16/waabi-unveils-its-first-generation-self-driving-truck/\" rel=\"noreferrer noopener\" target=\"_blank\">in 2022.</a> </p>\n<p class=\"wp-block-paragraph\">By contrast, competitor<a href=\"https://techcrunch.com/2022/07/17/kodiak-robotics-founder-explains-why-autonomous-freight-could-brush-off-inflation/\" rel=\"noreferrer noopener\" target=\"_blank\"> Kodiak Robotics</a> has developed a self-driving system that includes all of the redundant hardware and software system, but is not tied to one manufacturer. Urtasun is more interested in integrating the Waabi Driver into autonomous trucks at the factory level with no interruption to an OEM’s assembly line.</p>\n<p class=\"wp-block-paragraph\">Urtasun believes this is the best approach to building a safe, reliable product.</p>\n\n\n<p class=\"wp-block-paragraph\">Waabi’s partnership with Volvo builds on the automaker’s <a href=\"https://techcrunch.com/2023/01/18/self-driving-truck-startup-waabi-brings-on-volvo-vc-as-strategic-investor/\" rel=\"noreferrer noopener\" target=\"_blank\">strategic investment</a> into the startup two years ago via its venture arm, Volvo Group Venture Capital. Volvo later participated in Waabi’s <a href=\"https://techcrunch.com/2024/06/18/waabis-genai-promises-to-do-so-much-more-than-power-self-driving-trucks/\" rel=\"noreferrer noopener\" target=\"_blank\">$200 million Series B</a>.   </p>\n<p class=\"wp-block-paragraph\">Volvo will build trucks for Waabi at its production-ready facility in Virginia. Urtasun said the first “handful” would come off the assembly line in 2025, and that she expects a timeline of around two to three years to reach volume scale. </p>\n<p class=\"wp-block-paragraph\">Over that time, Urtasun also noted that capital efficiency will be “an absolute must” to be successful in this industry. She says Waabi’s “AI-first approach” means the startup’s capital needs to get to a driverless launch will be “a tiny fraction of what you see in the industry today.” </p>\n<p class=\"wp-block-paragraph\">To date, Waabi has raised $282 million, per PitchBook data, and Urtasun says the startup has enough to launch a driverless operation on public roads and beyond. Its main competitors, Aurora and Kodiak, have raised $3.46 billion and $243 million, respectively. </p>\n<p class=\"wp-block-paragraph\">Aurora plans to launch a driverless commercial trucking operation <a href=\"https://techcrunch.com/2024/10/30/aurora-innovation-delays-commercial-autonomous-truck-launch-to-2025/\" rel=\"noreferrer noopener\" target=\"_blank\">by April</a>, and Kodiak last month <a href=\"https://techcrunch.com/2025/01/24/kodiak-has-made-its-first-driverless-truck-deliveries-to-customer-atlas-energy/\" rel=\"noreferrer noopener\" target=\"_blank\">delivered its first autonomous trucks </a>to a commercial partner that will use them for off-road operations. </p>\n<p class=\"wp-block-paragraph\">“2025 is the year of trucking; it’s a make it or break it situation,” Urtasun said. “I think there will be potentially more consolidation.”</p>\n<p class=\"wp-block-paragraph\">There aren’t many players left in the game since <a href=\"https://techcrunch.com/2023/03/03/embark-trucks-lays-off-workers-explores-liquidation-of-self-driving-truck-assets/\" rel=\"noreferrer noopener\" target=\"_blank\">Embark</a> and <a href=\"https://techcrunch.com/2024/09/13/a-fight-is-brewing-as-tusimple-tries-to-move-450m-to-china-and-pivot-from-self-driving-trucks-to-ai-animation/\" rel=\"noreferrer noopener\" target=\"_blank\">TuSimple shut down</a> and <a href=\"https://techcrunch.com/2023/07/26/waymo-puts-the-brakes-on-self-driving-trucks-program/\" rel=\"noreferrer noopener\" target=\"_blank\">Waymo paused</a> its autonomous truck ambitions. </p>\n<p class=\"wp-block-paragraph\">When asked if Waabi was considering a merger or acquisition, Urtasun replied: “Absolutely not. Trucking is only the beginning. We’re going to do so much more than trucking – robotaxis, warehouse robotics. I have tremendously big plans for the company, and we are going to remain a fully independent company.”</p>\n</div>",
            "link": "https://techcrunch.com/2025/02/04/waabi-and-volvo-team-up-to-build-self-driving-trucks-at-scale/",
            "author": "TechCrunch",
            "pub_date": "2025-02-04 18:01:01",
            "source": "techcrunch",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "SoftBank-backed billionaire to invest $230M in Indian AI startup Krutrim",
            "description": "<div class=\"entry-content wp-block-post-content is-layout-constrained wp-block-post-content-is-layout-constrained\">\n<p class=\"wp-block-paragraph\" id=\"speakable-summary\">Ola founder Bhavish Aggarwal is investing $230 million into <a href=\"https://techcrunch.com/2024/01/26/ola-founder-ai-startup-krutrim-unicorn-in-50m-funding/\" rel=\"noreferrer noopener\" target=\"_blank\">an AI startup he founded</a> as the country pushes to establish itself in a field dominated by U.S. and Chinese firms.</p>\n<p class=\"wp-block-paragraph\">Aggarwal is largely financing the investment in Krutrim through his family office, a source familiar with the matter told TechCrunch. In <a href=\"https://x.com/bhash/status/1886687710363955492?s=46\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">a post on X</a> Tuesday, Aggarwal said Krutrim seeks to attract an investment of $1.15 billion by next year. He will seek to raise the remainder of the capital from outside investors, the source said.</p>\n\n\n<p class=\"wp-block-paragraph\">The funding announcement coincides with unicorn startup Krutrim making its AI models open source and unveiling plans to build what it claims will be India’s largest supercomputer in partnership with Nvidia.</p>\n<p class=\"wp-block-paragraph\">The <a href=\"https://ai-labs.olakrutrim.com/\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">lab</a> released Krutrim-2, a 12-billion parameter language model that has shown strong performance in processing Indian languages. In sentiment analysis tests Krutrim shared Tuesday, it scored 0.95 compared with 0.70 for competing models, while achieving an 80% success rate in code generation tasks.</p>\n<p class=\"wp-block-paragraph\">The lab has open sourced several specialized models, including systems for processing images, speech translation and text search, all optimized for Indian languages.</p>\n<p class=\"wp-block-paragraph\">“We’re nowhere close to global benchmarks yet but have made good progress in one year,” wrote Aggarwal, whose other ventures have been backed by SoftBank, on X. “By open sourcing our models, we hope the entire Indian AI community collaborates to create a world-class Indian AI ecosystem.”</p>\n<p class=\"wp-block-paragraph\">The initiative comes as India seeks to establish itself in an artificial intelligence landscape dominated by US and Chinese companies. The recent release of DeepSeek’s R1 “reasoning” model, built on a purportedly modest budget, has sent shock waves through the tech industry. India last week <a href=\"https://techcrunch.com/2025/01/30/india-to-host-china-deepseek-ai-model-locally-in-rare-tech-approval/\" rel=\"noreferrer noopener\" target=\"_blank\">praised DeepSeek‘s progress</a> and said the country will host the Chinese AI lab’s large language models on domestic servers. Krutrim’s cloud arm <a href=\"https://www.olakrutrim.com/ai-studio\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">began offering DeepSeek on Indian servers</a> last week.</p>\n\n<p class=\"wp-block-paragraph\">Krutrim has developed its own evaluation framework, BharatBench, to assess AI models’ proficiency in Indian languages, addressing a gap in existing benchmarks that primarily focus on English and Chinese.</p>\n<p class=\"wp-block-paragraph\">The lab’s technical approach includes using a 128,000-token context window, allowing its systems to handle longer texts and more complex conversations. Performance metrics published by the startup showed Krutrim-2 achieving high scores in grammar correction (0.98) and multi-turn conversations (0.91).</p>\n<p class=\"wp-block-paragraph\">The investment follows January’s launch of Krutrim-1, a 7-billion parameter system that served as India’s first large language model. The supercomputer deployment with Nvidia is scheduled to go live in March, with expansion planned throughout the year.</p>\n</div>",
            "link": "https://techcrunch.com/2025/02/04/softbank-backed-billionaire-to-invest-230m-in-indian-ai-startup-krutrim/",
            "author": "TechCrunch",
            "pub_date": "2025-02-04 17:20:57",
            "source": "techcrunch",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Opera launches a mindfulness-focused browser with break reminders and soundscapes",
            "description": "<div class=\"entry-content wp-block-post-content is-layout-constrained wp-block-post-content-is-layout-constrained\">\n<p class=\"wp-block-paragraph\" id=\"speakable-summary\">Norway-based browser maker <a href=\"https://www.opera.com/\" rel=\"nofollow\">Opera</a> on Tuesday launched a new browser called “Opera Air,” which focuses on mental well-being and mindfulness with features like break reminders, breathing exercises, soundscapes, and binaural beats for better focus.</p>\n<p class=\"wp-block-paragraph\">The company said that people use browsers for a lot of their work online, and it wanted to ship a browser that is not just a utility tool but a stress and focus management system.</p>\n<figure class=\"wp-block-image aligncenter size-large\"><img alt=\"\" class=\"wp-image-2958413\" decoding=\"async\" height=\"844\" loading=\"lazy\" sizes=\"auto, (max-width: 1500px) 100vw, 1500px\" src=\"https://techcrunch.com/wp-content/uploads/2025/02/Opera-Air-Browser-Sidebar.jpg?w=680\" srcset=\"https://techcrunch.com/wp-content/uploads/2025/02/Opera-Air-Browser-Sidebar.jpg 1500w, https://techcrunch.com/wp-content/uploads/2025/02/Opera-Air-Browser-Sidebar.jpg?resize=150,84 150w, https://techcrunch.com/wp-content/uploads/2025/02/Opera-Air-Browser-Sidebar.jpg?resize=300,169 300w, https://techcrunch.com/wp-content/uploads/2025/02/Opera-Air-Browser-Sidebar.jpg?resize=768,432 768w, https://techcrunch.com/wp-content/uploads/2025/02/Opera-Air-Browser-Sidebar.jpg?resize=680,383 680w, https://techcrunch.com/wp-content/uploads/2025/02/Opera-Air-Browser-Sidebar.jpg?resize=1200,675 1200w, https://techcrunch.com/wp-content/uploads/2025/02/Opera-Air-Browser-Sidebar.jpg?resize=1280,720 1280w, https://techcrunch.com/wp-content/uploads/2025/02/Opera-Air-Browser-Sidebar.jpg?resize=430,242 430w, https://techcrunch.com/wp-content/uploads/2025/02/Opera-Air-Browser-Sidebar.jpg?resize=720,405 720w, https://techcrunch.com/wp-content/uploads/2025/02/Opera-Air-Browser-Sidebar.jpg?resize=900,506 900w, https://techcrunch.com/wp-content/uploads/2025/02/Opera-Air-Browser-Sidebar.jpg?resize=800,450 800w, https://techcrunch.com/wp-content/uploads/2025/02/Opera-Air-Browser-Sidebar.jpg?resize=668,376 668w, https://techcrunch.com/wp-content/uploads/2025/02/Opera-Air-Browser-Sidebar.jpg?resize=666,375 666w, https://techcrunch.com/wp-content/uploads/2025/02/Opera-Air-Browser-Sidebar.jpg?resize=1097,617 1097w, https://techcrunch.com/wp-content/uploads/2025/02/Opera-Air-Browser-Sidebar.jpg?resize=708,398 708w\" width=\"1500\"/><figcaption class=\"wp-element-caption\"><span class=\"wp-element-caption__text\">Image Credits: Opera</span></figcaption></figure>\n<p class=\"wp-block-paragraph\">Opera opted for a new lightweight design language with semi-transparent theming.</p>\n\n\n<p class=\"wp-block-paragraph\"> In the floating sidebar, the company has placed a break reminder tool and a boosts feature — which plays a combination of music, ambient sounds, and binaural beats — along with shortcuts to <a href=\"https://techcrunch.com/2023/08/16/operas-ios-web-browser-gains-an-ai-companion-with-aria/\" rel=\"noreferrer noopener\" target=\"_blank\">the company’s Aria AI assistant</a>, Messenger, and WhatsApp.</p>\n<p class=\"wp-block-paragraph\">The “Take a break” feature acts like a battery indicator through three bars, and they become greyed out if you keep using the browser for a long period. You can define the time for continuous usage, after which the level of the indicator drops out, signaling you to take a break.  You can also turn off this indicator system altogether. </p>\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<div class=\"global-consent eu-consent tcembed-iframe tcembed--youtube\" data-iframe-height=\"281\" data-iframe-sandbox=\"\" data-iframe-src=\"https://www.youtube.com/embed/TMXkxUTeiY8?feature=oembed\" data-iframe-width=\"500\"></div>\n</div></figure>\n<p class=\"wp-block-paragraph\">For breaks, the company has designed different breathing exercises, neck stretches, meditation, or full body scans. You can do these activities depending on the length of the break you want to take and the mode of activity you want to choose. </p>\n<p class=\"wp-block-paragraph\">For neck stretches, you can also choose to turn on your camera so the browser can guide you on your posture and form during the exercises. </p>\n\n<figure class=\"wp-block-image aligncenter size-large\"><img alt=\"\" class=\"wp-image-2958414\" decoding=\"async\" height=\"900\" loading=\"lazy\" sizes=\"auto, (max-width: 1600px) 100vw, 1600px\" src=\"https://techcrunch.com/wp-content/uploads/2025/02/Opera-take-a-break.jpg?w=680\" srcset=\"https://techcrunch.com/wp-content/uploads/2025/02/Opera-take-a-break.jpg 1600w, https://techcrunch.com/wp-content/uploads/2025/02/Opera-take-a-break.jpg?resize=150,84 150w, https://techcrunch.com/wp-content/uploads/2025/02/Opera-take-a-break.jpg?resize=300,169 300w, https://techcrunch.com/wp-content/uploads/2025/02/Opera-take-a-break.jpg?resize=768,432 768w, https://techcrunch.com/wp-content/uploads/2025/02/Opera-take-a-break.jpg?resize=680,383 680w, https://techcrunch.com/wp-content/uploads/2025/02/Opera-take-a-break.jpg?resize=1200,675 1200w, https://techcrunch.com/wp-content/uploads/2025/02/Opera-take-a-break.jpg?resize=1280,720 1280w, https://techcrunch.com/wp-content/uploads/2025/02/Opera-take-a-break.jpg?resize=430,242 430w, https://techcrunch.com/wp-content/uploads/2025/02/Opera-take-a-break.jpg?resize=720,405 720w, https://techcrunch.com/wp-content/uploads/2025/02/Opera-take-a-break.jpg?resize=900,506 900w, https://techcrunch.com/wp-content/uploads/2025/02/Opera-take-a-break.jpg?resize=800,450 800w, https://techcrunch.com/wp-content/uploads/2025/02/Opera-take-a-break.jpg?resize=1536,864 1536w, https://techcrunch.com/wp-content/uploads/2025/02/Opera-take-a-break.jpg?resize=668,375 668w, https://techcrunch.com/wp-content/uploads/2025/02/Opera-take-a-break.jpg?resize=1097,617 1097w, https://techcrunch.com/wp-content/uploads/2025/02/Opera-take-a-break.jpg?resize=708,398 708w\" width=\"1600\"/><figcaption class=\"wp-element-caption\"><span class=\"wp-element-caption__text\">Image Credits: Opera</span></figcaption></figure>\n<p class=\"wp-block-paragraph\">Currently, Opear Air has only guided exercises for these breaks in English. But it is also working on voiceovers for other languages. </p>\n<p class=\"wp-block-paragraph\">The other mindfulness feature, called Boosts, already comes with a pre-set combination of music, ambient sounds, and binaural beats. The company’s product director, Mohamed Salah, said that it chose to include binaural beats in these soundscapes as it helps improve focus by playing slightly different frequencies in each ear and, in effect, creating a new “ghost” frequency effect in the brain.</p>\n<p class=\"wp-block-paragraph\">You can change the music, ambient sound, frequency of binaural beats, and volume of each track anytime. Users can also pick how long they want to play a boost ranging from 15 minutes to infinity. You can play or pause the boost from the sidebar at any point in time. </p>\n<figure class=\"wp-block-image aligncenter size-large\"><img alt=\"\" class=\"wp-image-2958415\" decoding=\"async\" height=\"900\" loading=\"lazy\" sizes=\"auto, (max-width: 1600px) 100vw, 1600px\" src=\"https://techcrunch.com/wp-content/uploads/2025/02/Opera-Air-Boosts.jpg?w=680\" srcset=\"https://techcrunch.com/wp-content/uploads/2025/02/Opera-Air-Boosts.jpg 1600w, https://techcrunch.com/wp-content/uploads/2025/02/Opera-Air-Boosts.jpg?resize=150,84 150w, https://techcrunch.com/wp-content/uploads/2025/02/Opera-Air-Boosts.jpg?resize=300,169 300w, https://techcrunch.com/wp-content/uploads/2025/02/Opera-Air-Boosts.jpg?resize=768,432 768w, https://techcrunch.com/wp-content/uploads/2025/02/Opera-Air-Boosts.jpg?resize=680,383 680w, https://techcrunch.com/wp-content/uploads/2025/02/Opera-Air-Boosts.jpg?resize=1200,675 1200w, https://techcrunch.com/wp-content/uploads/2025/02/Opera-Air-Boosts.jpg?resize=1280,720 1280w, https://techcrunch.com/wp-content/uploads/2025/02/Opera-Air-Boosts.jpg?resize=430,242 430w, https://techcrunch.com/wp-content/uploads/2025/02/Opera-Air-Boosts.jpg?resize=720,405 720w, https://techcrunch.com/wp-content/uploads/2025/02/Opera-Air-Boosts.jpg?resize=900,506 900w, https://techcrunch.com/wp-content/uploads/2025/02/Opera-Air-Boosts.jpg?resize=800,450 800w, https://techcrunch.com/wp-content/uploads/2025/02/Opera-Air-Boosts.jpg?resize=1536,864 1536w, https://techcrunch.com/wp-content/uploads/2025/02/Opera-Air-Boosts.jpg?resize=668,375 668w, https://techcrunch.com/wp-content/uploads/2025/02/Opera-Air-Boosts.jpg?resize=1097,617 1097w, https://techcrunch.com/wp-content/uploads/2025/02/Opera-Air-Boosts.jpg?resize=708,398 708w\" width=\"1600\"/><figcaption class=\"wp-element-caption\"><span class=\"wp-element-caption__text\">Image Credits: Opera</span></figcaption></figure>\n<p class=\"wp-block-paragraph\">When TechCrunch asked Opera why it built a separate browser instead of baking these tools in the existing browser, Salah said the company wanted to bake in the concept of mindfulness in a different product.</p>\n\n\n<p class=\"wp-block-paragraph\">“Opera One is a great browser that is aimed at productivity with features like split screen and tab islands. But what we want with Opera Air is to convey the concept of mindfulness with mindfulness tools and minimalistic design,” Salah said.</p>\n<p class=\"wp-block-paragraph\">He also noted that while there are different apps for break reminders or soundscapes on Mac and on mobile, the company wanted to provide an all-in mindfulness package on desktop.</p>\n<p class=\"wp-block-paragraph\">The challenge for Opera would be to have people adopt this version for mindfulness browsing. With its <a href=\"https://techcrunch.com/2023/04/24/opera-launches-opera-one-browser-with-a-new-tab-grouping-concept/\">Opera One browser</a> and <a href=\"https://techcrunch.com/2023/09/07/gaming-browser-opera-gx-integrates-chatgpt-powered-ai-feature/\">gaming-focused Opera GX browser</a>, the company has built up a suite of features people might be used to, and the transition to a minimalistic browser might not be easy. </p>\n<p class=\"wp-block-paragraph\"></p>\n</div>",
            "link": "https://techcrunch.com/2025/02/04/opera-launches-a-mindfulness-browser-with-break-reminders-and-soundscapes/",
            "author": "TechCrunch",
            "pub_date": "2025-02-04 17:01:10",
            "source": "techcrunch",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "AI agents for e-commerce startup, founded by Google and DeepMind alums, raises $10M seed",
            "description": "<div class=\"entry-content wp-block-post-content is-layout-constrained wp-block-post-content-is-layout-constrained\">\n<p class=\"wp-block-paragraph\" id=\"speakable-summary\">AI is changing how we shop online, making our experiences more personalized. Smart assistants recommend products, negotiate deals, and even handle customer service. Big retailers and smaller businesses are using AI to improve search, supply chains, and checkout. </p>\n<p class=\"wp-block-paragraph\">If AI companies (and their investors) have their way, shopping will soon be focused on chatting with an assistant, with businesses automating everything behind the scenes. </p>\n\n\n<p class=\"wp-block-paragraph\">Dubai-based <a href=\"https://www.qeen.ai\" rel=\"nofollow\">Qeen.ai</a> (stylized as qeen.ai) is working to make this a reality in the Middle East and beyond. The startup has raised $10 million to scale its platform, which provides autonomous AI agents for e-commerce businesses.</p>\n<p class=\"wp-block-paragraph\">Prosus Ventures, a major e-commerce investor, led the seed round, which is not only one of the largest in the Middle East’s AI industry but in MENA overall. The VC believes Qeen.ai is well-positioned to bring AI-driven automation to merchants as AI agents reshape online marketplaces.</p>\n<p class=\"wp-block-paragraph\">Founders <a href=\"https://www.linkedin.com/in/mibrahimi/?originalSubdomain=ca\" rel=\"nofollow\">Morteza Ibrahimi </a>(CEO), <a href=\"https://ae.linkedin.com/in/ahmadkhwileh\" rel=\"nofollow\">Ahmad Khwlieh</a> (CTO), and <a href=\"https://www.linkedin.com/in/dina-alsamhan-3a5aa024/?originalSubdomain=ae\" rel=\"nofollow\">Dina Alsamhan</a> (CBO) started Qeen after years of working on AI at Google and DeepMind. </p>\n<p class=\"wp-block-paragraph\">Ibrahimi, in an interview with TechCrunch, said that they honed in on e-commerce in part opportunistically: all three had worked at Google Ads in various roles during their time with the search giant, and they and saw first-hand how other alums built highly successful e-commerce businesses. On top of their AI expertise, the trio knew how to run ads and optimize SEO exceptionally well and thought it could be a strong combination.</p>\n<h2 class=\"wp-block-heading\" id=\"h-google-and-deepmind-background\">Google and DeepMind background</h2>\n<p class=\"wp-block-paragraph\">E-commerce has been steadily growing for years, but apart from certain spikes (particularly during holiday periods) it still accounts for between 15% and 20% of retail sales (even in a mature market like the U.S. it was only just over 16% at of the last quarter, per the <a href=\"https://www.census.gov/retail/mrts/www/data/pdf/ec_current.pdf\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">U.S. Census Bureau</a>). </p>\n\n<p class=\"wp-block-paragraph\">Qeen’s thesis is that this could grow if the e-commerce processes were run better. Success in e-commerce, they believed, should be about great products and operational efficiency — not just who can game the ad system best. That insight led them to build a platform that helps e-commerce sellers grow without relying on ads as their primary driver.</p>\n<p class=\"wp-block-paragraph\">The global e-commerce market is expanding fast, driven by changing consumer behavior, digital payments, and better logistics. In MENA, the market is expected to hit $50 billion by 2025, with Saudi Arabia and the UAE leading the growth.</p>\n<p class=\"wp-block-paragraph\">Qeen.ai is tapping into this boom by developing AI-powered marketing agents designed for e-commerce businesses across MENA. These fully automated agents handle content creation, marketing, and conversational sales, allowing small and mid-sized merchants to compete without relying on expensive agencies or deep ad expertise. </p>\n\n\n<p class=\"wp-block-paragraph\">Unlike traditional solutions, Qeen’s AI continuously learns from consumer interactions using its proprietary RL-UI technology, refining marketing strategies in real-time for better results.</p>\n<h2 class=\"wp-block-heading\" id=\"h-from-google-ads-to-ai-driven-e-commerce\">From Google ads to AI-driven e-commerce</h2>\n<p class=\"wp-block-paragraph\">While AI-powered sales and customer service tools often struggle with high churn rates, as businesses frequently switch platforms, Qeen.ai claims to see stronger retention in e-commerce and marketing. Ibrahimi attributes this to how deeply Qeen’s AI agents integrate into merchants’ workflows, making them a core part of daily operations rather than a replaceable tool.</p>\n<p class=\"wp-block-paragraph\">A key feature driving engagement is dynamic text personalization, which adjusts content based on user behavior and device type. For example, an iPhone user might see product details in bullet points for quick reading, while a laptop user gets a detailed paragraph. </p>\n<p class=\"wp-block-paragraph\">Since launching its Dynamic Content agent in Q2 2024, Qeen.ai has served over 15 million users, generated 1 million SKU descriptions, and helped merchants increase sales by 30%, according to the company.</p>\n<p class=\"wp-block-paragraph\">“We worked with a client to optimize their content and SEO. After using our AI plugins, their search volume increased by 40%, and their Google ranking improved from 22 to 18—all with zero manual effort. The entire process was fully autonomous,” said Ibrahimi, giving another instance where Qeen’s AI capabilities have shone. </p>\n<p class=\"wp-block-paragraph\">Qeen employs a subscription-based pricing model and incorporates value-based pricing, a growing trend in AI services. Currently, qeen generates revenue through two subscription models: content automation, where businesses pay per active SKU, typically $0.10 to $0.20 per SKU per month. Then its AI marketing agent whose pricing is based on per-interaction volume. </p>\n<p class=\"wp-block-paragraph\">Ibrahimi declined to disclose the number of businesses using qeen, as well as revenue growth metrics. Notable clients include Dubai Store, 6th Street, and Jumia.</p>\n<h2 class=\"wp-block-heading\" id=\"h-standing-out-with-talent\">Standing out… with talent</h2>\n<p class=\"wp-block-paragraph\">Ibrahimi left DeepMind in early 2023 to co-found the startup. That same year, the company raised a $2 million pre-seed round before launching its product in June 2024. With its recent $10 million seed round, qeen has raised a total of $12 million in under a year.</p>\n\n\n<p class=\"wp-block-paragraph\">During this time, AI-powered marketing agents have gained traction worldwide, with several startups, particularly in the U.S. and Europe, entering the space. Competitors like YC-backed Unusual and Rankai are tackling similar challenges, so how does Qeen stand out?</p>\n<p class=\"wp-block-paragraph\">Well, for one, most of these AI startups focus on developed markets, while Qeen instead is prioritizing the Middle East first—a region largely underserved by AI-driven marketing automation tools. According to Ibrahimi, Qeen will serve small businesses across MENA, establish a strong foothold, and then expand globally.</p>\n<p class=\"wp-block-paragraph\">Deep tech expertise and a strong talent pool give Qeen an edge over new entrants, the chief executive added. Two of its co-founders earned PhDs in AI over a decade ago, long before AI became mainstream. Ibrahimi himself previously led a DeepMind research team specializing in self-learning, goal-driven AI agents—the same technology that now powers Qeen.</p>\n<p class=\"wp-block-paragraph\">“One of the most exciting things we’ve seen is the quality of AI talent here,” Ibrahimi said. “We’ve attracted great talent both locally and internationally—people have left the Bay Area, Europe, and the UK to come here and build with us.”</p>\n<p class=\"wp-block-paragraph\">Qeen.ai currently employs over 25 people across the UAE and Jordan.</p>\n<p class=\"wp-block-paragraph\">The seed funding will support qeen’s growth strategy by expanding its AI platform, scaling its team, and attracting more customers, it said. Wamda Capital, 10X Founders Fund, and Dara Holdings are among the other investors in this round.</p>\n</div>",
            "link": "https://techcrunch.com/2025/02/04/google-and-deepmind-alums-raises-10m-for-qee/",
            "author": "TechCrunch",
            "pub_date": "2025-02-04 16:10:58",
            "source": "techcrunch",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Neuralk-AI is developing AI models specifically designed for structured data",
            "description": "<div class=\"entry-content wp-block-post-content is-layout-constrained wp-block-post-content-is-layout-constrained\">\n<p class=\"wp-block-paragraph\" id=\"speakable-summary\">Tabular data is a broad term that encompasses structured data that generally fits into a specific row and column. It can be a SQL database, a spreadsheet, a .CSV file, etc.</p>\n<p class=\"wp-block-paragraph\">While there has been tremendous progress on artificial intelligence applied to unstructured and sequential data, these large language models are fuzzy by design. They are built to manipulate input tokens to generate a coherent output without necessarily following a fixed structure. The best LLMs are also either expensive to access via an API or expensive to run on your own cloud infrastructure.</p>\n\n\n<p class=\"wp-block-paragraph\">And yet, many companies already have a data strategy with a data warehouse or data lake to centralize all important data and some data scientists that can leverage this data to improve the company’s strategy. </p>\n<p class=\"wp-block-paragraph\">French startup <a href=\"https://www.neuralk-ai.com/\" rel=\"nofollow\">Neuralk-AI</a> is an artificial intelligence company has been working on AI models focused on tabular data. The company this week announced $4 million in funding.</p>\n<p class=\"wp-block-paragraph\">“Data with real value for companies is data that was identified a long time ago, structured in the form of a table, and used by the data scientists of these companies to create all their machine learning algorithms,” Nueralk-AI co-founder and Chief Scientist Officer Alexandre Pasquiou told TechCrunch. </p>\n<p class=\"wp-block-paragraph\">Neuralk-AI thinks there’s an opportunity in revisiting AI model development, but with a specific focus on structured data. At first, it plans to offer its model as an API to data scientists working for commerce companies because these companies <em>love</em> data — think product catalogs, customer databases, shopping cart trends, etc.</p>\n<p class=\"wp-block-paragraph\">“Today, LLMs are great for search, natural user interaction, and answering questions based on unstructured documents. But it has some limitations the moment we go back to classic machine learning, which is really based on classic tabular data,” Pasquiou said.</p>\n\n<p class=\"wp-block-paragraph\">With Neuralk-AI, retailers can automate complex data workflows with smart deduplication and enrichment. But they could also use the company’s models to detect fraud, optimize the product recommendations, and generate sales forecasts that could be used for inventory management and product pricing.</p>\n<p class=\"wp-block-paragraph\">Fly Ventures led the company’s $4 million round with SteamAI also participating. Several business angels also invested in the startup, such as Thomas Wolf from Hugging Face, Charles Gorintin from Alan, and Philippe Corrot and Nagi Letaifa from Mirakl.</p>\n<p class=\"wp-block-paragraph\">The team is still actively working on its models. It plans to test with a group of leading French retailers and commerce startups, such as E.Leclerc, Auchan, Mirakl, and Lucky Cart.</p>\n\n\n<p class=\"wp-block-paragraph\">“Within three or four months, we’ll release the first version of our model and the public benchmark on which we’ll be able to rank our model compared to the state-of-the-art in this space,” Pasquiou said. “And in September, the idea is to be the best tabular foundation model in everything related to representation learning.”</p>\n</div>",
            "link": "https://techcrunch.com/2025/02/03/neuralk-ai-is-developing-ai-models-specifically-designed-for-structured-data/",
            "author": "TechCrunch",
            "pub_date": "2025-02-04 15:15:54",
            "source": "techcrunch",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "China hits back at Trump tariffs with Google antitrust investigation",
            "description": "<div class=\"entry-content wp-block-post-content is-layout-constrained wp-block-post-content-is-layout-constrained\">\n<p class=\"wp-block-paragraph\" id=\"speakable-summary\">China said Tuesday it has <a href=\"https://www.samr.gov.cn/xw/zj/art/2025/art_396a9ab3aa6d4c4bbd40833815afd245.html?_x_tr_sl=auto&amp;_x_tr_tl=en&amp;_x_tr_hl=en-US&amp;_x_tr_pto=wapp\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">launched an antitrust investigation into Google</a>, part of a swift retaliation after the U.S. President Donald Trump imposed a 10% tariff on Chinese goods.</p>\n<p class=\"wp-block-paragraph\">The probe by China’s State Administration for Market Regulation will examine alleged monopolistic practices by the U.S. tech giant, which has had its search and internet services blocked in China since 2010 but maintains operations there primarily focused on advertising.</p>\n\n\n<p class=\"wp-block-paragraph\">“Because Google is suspected of violating the Anti-Monopoly Law of the People’s Republic of China, the State Administration for Market Regulation has launched an investigation into Google in accordance with the law,” the English translated version of administration’s statement read.</p>\n<p class=\"wp-block-paragraph\">Beijing also hit U.S. coal and liquefied natural gas exports with a 15% levy and imposed a 10% tariff on oil and agricultural equipment. Chinese authorities also added Calvin Klein owner PVH Corp. and gene sequencing company Illumina to a restricted entities list, while implementing new export controls on tungsten-related materials.</p>\n<p class=\"wp-block-paragraph\">Trump’s tariffs, which he justified as a response to Beijing’s failure to prevent the flow of illegal drugs, reignited trade tensions between the world’s largest economies just as relations appeared to be stabilizing.</p>\n<p class=\"wp-block-paragraph\"><em>This is a developing story. More to follow.</em></p>\n</div>",
            "link": "https://techcrunch.com/2025/02/03/china-hits-back-at-trump-tariffs-with-google-antitrust-investigation/",
            "author": "TechCrunch",
            "pub_date": "2025-02-04 14:45:51",
            "source": "techcrunch",
            "kind": 1,
            "language": "en"
        }
    ]
}