{
    "data": [
        {
            "title": "Hitachi Ventures raises $400M fund to invest in everything from fusion to AI",
            "description": "<div class=\"entry-content wp-block-post-content is-layout-constrained wp-block-post-content-is-layout-constrained\">\n<p class=\"wp-block-paragraph\" id=\"speakable-summary\">Hitachi Ventures secured $400 million for a fourth fund, the firm exclusively told TechCrunch.</p>\n<p class=\"wp-block-paragraph\">The size of the new fund is a vote of confidence in a range of deep tech verticals. The corporate VC’s sprawling portfolio mimics that of its limited partner’s, including energy, manufacturing, biotech, and AI.</p>\n\n\n<p class=\"wp-block-paragraph\">“We are open to other breakthrough opportunities,” said managing director and CEO Stefan Gabriel. “There’s a lot around quantum, nuclear, life science, space tech. Not too broad — we have a clear view on what excites us in these areas.”</p>\n<p class=\"wp-block-paragraph\"><a href=\"https://www.hitachi-ventures.com/\" rel=\"nofollow\">Hitachi Ventures</a> will continue to focus on Series A investments. “That is still the sweet spot,” said partner Gayathri Radhakrishnan. Its first investments in a company will average around $5 million, and the fund is reserving around 55% of its capital for follow-on opportunities, partner and CFO Wolfgang Seibold said.</p>\n<p class=\"wp-block-paragraph\">Though it takes its name from the Japanese conglomerate, Munich-based Hitachi Ventures is a bit of an outlier in the corporate VC world. It’s structured more like a typical venture fund, Gabriel said, with Hitachi serving as the solo LP. The investment committee is made up of the firm’s partners, and they do not have to run possible investments past its corporate affiliate, said Pete Bastien, partner and president of the firm’s U.S. operations. </p>\n<p class=\"wp-block-paragraph\">But the fund still works closely with Hitachi, he added, in part to help portfolio companies understand what a potential future customer is looking for. Like other CVCs, Hitachi Ventures doesn’t promise that it can land deals for portfolio companies, but it can make key introductions.</p>\n<p class=\"wp-block-paragraph\">“We can put you in front of Hitachi, but your product needs to sell itself,” Radhakrishnan said.</p>\n\n<p class=\"wp-block-paragraph\">And like other CVCs, Hitachi Ventures serves as a scout, Radhakrishnan said, scouring through pitches to find smaller companies and technologies that fits its corporate partner’s businesses.</p>\n<p class=\"wp-block-paragraph\">Hitachi Ventures previous investments span a range of verticals. On the energy side, it has invested in battery recycler <a href=\"https://techcrunch.com/2023/09/11/battery-recycling-heats-up-with-ascend-elements-542m-series-d/\">Ascend Elements</a>, fusion startup <a href=\"https://techcrunch.com/2024/02/08/thea-energy-series-a/\">Thea Energy</a>, and <a href=\"https://techcrunch.com/2024/03/27/wase-seed-fundraise/\">Wase</a>, a wastewater-to-energy company. Its AI investments have tended toward workplace applications, including <a href=\"https://techcrunch.com/2024/03/05/ema-a-universal-ai-employee-emerges-from-stealth-with-25m/\">Ema</a>, which focuses on enterprise workflows; <a href=\"https://techcrunch.com/startup-battlefield/company/strikeready/\">Strikeready</a>, which covers cybersecurity; and <a href=\"https://techcrunch.com/2022/10/18/makersite-lands-18m-to-help-companies-manage-product-supply-chains/\">Makersite</a>, which uses AI to improve supply chains.</p>\n</div>",
            "link": "https://techcrunch.com/2025/02/04/hitachi-ventures-raises-400m-fund-to-invest-in-everything-from-fusion-to-ai/",
            "author": "TechCrunch",
            "pub_date": "2025-02-05 14:01:06",
            "source": "techcrunch",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Google wants Search to be more like an AI assistant in 2025",
            "description": "<div class=\"entry-content wp-block-post-content is-layout-constrained wp-block-post-content-is-layout-constrained\">\n<p class=\"wp-block-paragraph\" id=\"speakable-summary\">Google Search is in the midst of a “journey” around AI, Google CEO Sundar Pichai said during the company’s earnings call on Tuesday.<a href=\"https://techcrunch.com/2024/05/14/google-is-adding-more-ai-to-its-search-results/\"> The start of that journey was AI overviews</a>, a controversial and monumental shift in how Google delivers information to billions of Search users.</p>\n<p class=\"wp-block-paragraph\">But that was just the beginning.</p>\n\n\n<p class=\"wp-block-paragraph\">“As AI continues to expand the universe of queries that people can ask, 2025 is going to be one of the biggest years for search innovation yet,” said Pichai during his opening remarks on the call.</p>\n<p class=\"wp-block-paragraph\">Throughout the call, Pichai laid out the next phase of Google’s plan to pack Search with AI features from the company’s research lab, DeepMind. The Search product is slowly becoming more like an AI assistant that browses the internet for you, looks at web pages, and returns an answer.</p>\n<p class=\"wp-block-paragraph\">It’s a long way off from a simple search system that gives you ten blue links.</p>\n<p class=\"wp-block-paragraph\">Google has been on this path for a few years now, ever since the search giant was caught flat footed by the release of OpenAI’s ChatGPT in 2022. The shift has massive implications for websites that rely on Google’s traffic and businesses that buy ads on Google Search.</p>\n<p class=\"wp-block-paragraph\">Not everyone is happy about it, but Google is pushing ahead.</p>\n\n<p class=\"wp-block-paragraph\">When asked about the future of AI and Search, Pichai said that, “You can imagine the future with<a href=\"https://techcrunch.com/2024/05/14/googles-gemini-updates-how-project-astra-is-powering-some-of-i-os-big-reveals/\"> Project Astra,</a>” a reference to DeepMind’s multimodal AI system, which can process live video from a camera or computer screen and answer user questions about what the AI sees in real time.</p>\n<p class=\"wp-block-paragraph\">Google has big plans for Project Astra in other parts of its business too. The company says it wants the multimodal AI system to power a pair of <a href=\"https://techcrunch.com/2024/12/12/google-wants-to-sell-those-project-astra-ar-glasses-some-day-but-it-wont-be-today/\">augmented reality smart glasses</a> one day, which Google will create the operating system for. </p>\n<p class=\"wp-block-paragraph\">Pichai also mentioned<a href=\"https://techcrunch.com/2024/12/11/gemini-can-now-research-deeper/\"> Gemini Deep Research</a> – an AI agent that takes several minutes to create long research reports – as a feature that could fundamentally shift how people use Google Search. Deep Research automates work that people have traditionally done with Google Search. But now, it seems Google wants to do that research for users.</p>\n\n\n<p class=\"wp-block-paragraph\">“You are really dramatically expanding the types of use cases for which Search can work – things which don’t always get answered instantaneously, but can take some time to answer,” said Pichai. “Those are all areas of exploration, and you will see us putting new experiences in front of users through the course of 2025.”</p>\n<p class=\"wp-block-paragraph\">Pichai said further that Google has a “clear sense” of the Search experiences it could create with another one of Google’s AI agents,<a href=\"https://techcrunch.com/2024/12/11/google-unveils-project-mariner-ai-agents-to-use-the-web-for-you/\"> Project Mariner</a>. That system can use the front-end of websites on behalf of users, making it unnecessary for people to use websites themselves.</p>\n<p class=\"wp-block-paragraph\">Google’s CEO also said there’s an “opportunity” around letting users interact more and ask follow-up questions with Google Search. Pichai was light on details there, but it sounds like Google is considering ways to make its Search interface more like a chatbot.</p>\n<p class=\"wp-block-paragraph\">“I think the [Search] product will evolve even more,” said Pichai. “As you make it more easy for people to interact and ask follow-up questions, etc., I think we have an opportunity to drive further growth.”</p>\n<p class=\"wp-block-paragraph\">Today, ChatGPT has matured into one of the internet’s most used products, with hundreds of millions of weekly users. It presents an existential threat to Google Search’s long-term business. To address it, Google is not only building a competitor AI chatbot with Gemini, but also injecting AI features directly in Search.</p>\n<p class=\"wp-block-paragraph\">Of course, the first step on Google Search’s AI journey did not go very well. When Google rolled out AI overviews to all of Google Search, the system displayed inaccurate and weird AI hallucinations. These included answers that told<a href=\"https://techcrunch.com/2024/05/26/what-are-googles-ai-overviews-good-for/\"> people to eat rocks and put glue on their pizza</a>. Google admitted at the time that<a href=\"https://techcrunch.com/2024/05/31/google-admits-its-ai-overviews-need-work-but-were-all-helping-it-beta-test/\"> AI overviews needed some work</a>.</p>\n<p class=\"wp-block-paragraph\">Despite this negative rollout, it appears Google is just getting started putting AI into Search.</p>\n</div>",
            "link": "https://techcrunch.com/2025/02/04/google-wants-search-to-be-more-like-an-ai-assistant-in-2025/",
            "author": "TechCrunch",
            "pub_date": "2025-02-05 10:05:55",
            "source": "techcrunch",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Krafton leads Cashfree’s $53M funding at $700M valuation",
            "description": "<div class=\"entry-content wp-block-post-content is-layout-constrained wp-block-post-content-is-layout-constrained\">\n<p class=\"wp-block-paragraph\" id=\"speakable-summary\">Cashfree, an Indian payments startup that facilitates and processes more than $80 billion for its customers each year, has raised $53 million in a new round of funding as it gears up to deepen its presence in some international markets.</p>\n<p class=\"wp-block-paragraph\">Krafton, maker of sleeper hit titles such as PUBG and BGMI, led Cashfree’s Series C financing round alongside existing investor Apis Growth Fund, the two said Wednesday. The funding values the eight-year-old startup at $700 million, according to a source familiar with the terms. </p>\n\n\n<p class=\"wp-block-paragraph\">It’s an unusual deal – a gaming company investing in <a href=\"https://techcrunch.com/2020/11/23/yc-backed-cashfree-raises-35-3-million-for-its-payments-platform/\" rel=\"noreferrer noopener\" target=\"_blank\">a payments startup</a> – but the two firms see strategic value in the partnership. Sean Hyunil Sohn, who heads Krafton’s India business, said the gaming giant is betting on India’s evolving media and entertainment sector, where robust payment systems have become crucial for enhancing user experience.</p>\n<p class=\"wp-block-paragraph\">The Bangalore-based startup, which serves more than 800,000 businesses including prominent names such as Swiggy, Zepto, and Bajaj Finance, has seen merchant sign-ups surge 130% in the current fiscal year. The startup is particularly focused on expanding in the UAE and other Middle Eastern markets.</p>\n<p class=\"wp-block-paragraph\">Cashfree’s technology stack allows businesses to process up to 12,000 transactions per second during peak demand. The startup has also developed SecureID, an identity verification system that has performed over a billion verifications to date, helping businesses combat fraud while reducing customer drop-offs during onboarding.</p>\n<p class=\"wp-block-paragraph\">Cashfree is one of the first companies to receive authorization from India’s central bank to operate as a payment aggregator for both domestic and international transactions. The startup, which was incubated by PayPal, counts Y Combinator and State Bank of India among its earlier backers.</p>\n<p class=\"wp-block-paragraph\"><em>More to follow.</em></p>\n\n</div>",
            "link": "https://techcrunch.com/2025/02/04/krafton-leads-cashfrees-53m-funding-at-700m-valuation/",
            "author": "TechCrunch",
            "pub_date": "2025-02-05 09:45:55",
            "source": "techcrunch",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Brightpick’s new warehouse robot can reach 20-foot-high shelves",
            "description": "<div class=\"entry-content wp-block-post-content is-layout-constrained wp-block-post-content-is-layout-constrained\">\n<p class=\"wp-block-paragraph\" id=\"speakable-summary\">Brightpick, a maker of autonomous mobile robots, on Tuesday announced a lofty addition to its current line. The appropriately named <a href=\"https://brightpick.ai/brightpick-launches-giraffe-an-autonomous-mobile-picking-system-that-triples-warehouse-storage-density/\" rel=\"nofollow\">Giraffe</a> system is notable for its large, retractable platform capable of reaching up to 20 feet (6 meters) in height to pick items from warehouse shelves. It’s a novel approach to warehouses with ceilings well out of the grasp of both standard AMRs and their human coworkers.</p>\n<p class=\"wp-block-paragraph\">Giraffe accomplishes the feat by way of a telescoping arm with three overlapping segments that measure 8.5 feet when fully stowed. Rather than constantly extending and retracting 11.5 feet at a time, the system is designed to work in tandem with the Kentucky company’s existing Autopicker robot. That AMR, which sports two supply bins, meets the larger robot halfway by extending up to 11 feet.</p>\n\n\n<p class=\"wp-block-paragraph\">The system resembles the <a href=\"https://techcrunch.com/2023/06/27/dexory-nabs-19m-to-bring-visibility-to-warehouses-through-analytics-and-autonomous-robots/\"> telescoping warehouse robots</a> of the London-based outfit Dexory, though the latter’s “DexoryView” platform simply features sensors for scanning shelves. The Giraffe has the decidedly more difficult task of transferring the shelves’ contents.</p>\n<p class=\"wp-block-paragraph\">Dexory’s primary competition for tall-shelf warehouse inventory are drone-based scanning startups like Gather AI, Verity, and Corvus. Actually lifting and moving payloads is, however, far too resource intensive for quadcopters, so they won’t likely be infringing on Giraffe’s turf any time soon.</p>\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<div class=\"global-consent eu-consent tcembed-iframe tcembed--youtube\" data-iframe-height=\"281\" data-iframe-sandbox=\"\" data-iframe-src=\"https://www.youtube.com/embed/sYoZfxb3o9U?feature=oembed\" data-iframe-width=\"500\"></div>\n</div></figure>\n<p class=\"wp-block-paragraph\">A more apt comparison are the automated storage and retrieval systems offered by companies like AutoStore and Kardex. Their tightly-packed grid solutions are expensive to install, difficult to repair, and are generally less flexible with inventory sizes. Brightpick’s order picking solution, on the other hand, features AMRs cruising around and retrieving inventory from more traditional warehouse shelves.</p>\n<p class=\"wp-block-paragraph\">BionicHive offers yet another solution in the form of its Squid systems, which ride on shelf-mounted tracks to retrieve inventory. Amazon <a href=\"https://techcrunch.com/2022/04/21/amazon-invests-5-startups-new-1b-industrial-innovation-fund/\">invested </a>in that Israeli robotics startup in 2022, as part of its Industrial Innovation Fund.</p>\n<p class=\"wp-block-paragraph\">In the rapidly automating warehouse and logistics world, there’s plenty of room for a wide range of different form factors and solutions.</p>\n\n<p class=\"wp-block-paragraph\">Brightpick is rolling Giraffe out for two major customers in 2025. E-commerce retailer The Feed will employ six Giraffes alongside 73 Autopickers at a Colorado facility. Medical supply firm McGuff Company is deploying a more modest four Giraffes and one dozen Autopickers at a warehouse in California.</p>\n<p class=\"wp-block-paragraph\">Brightpick claims the Giraffe/Autopicker combo allows for 3x the warehouse density of manual, human-based operations, while doubling its own existing solution.</p>\n</div>",
            "link": "https://techcrunch.com/2025/02/04/brightpicks-new-warehouse-robot-can-reach-20-foot-high-shelves/",
            "author": "TechCrunch",
            "pub_date": "2025-02-05 08:31:00",
            "source": "techcrunch",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Alphabet praises DeepSeek, but it’s massively ramping up its AI spending",
            "description": "<div class=\"entry-content wp-block-post-content is-layout-constrained wp-block-post-content-is-layout-constrained\">\n<p class=\"wp-block-paragraph\" id=\"speakable-summary\">Booming AI budgets seemed at risk last week when DeepSeek <a href=\"https://techcrunch.com/2025/01/27/nvidia-drops-600bn-off-its-market-cap-amid-the-rise-of-deepseek/\">crashed Nvidia’s stock</a> based on speculation that its <a href=\"https://techcrunch.com/2025/01/27/deepseek-claims-its-reasoning-model-beats-openais-o1-on-certain-benchmarks/\">cheaper AI models</a> would lower demand for AI chips and data centers. </p>\n<p class=\"wp-block-paragraph\">Alphabet CEO Sundar Pichai has certainly noticed the Chinese AI company, praising its work as “tremendous” in Alphabet’s <a href=\"https://techcrunch.com/storyline/alphabet-earnings-live-updates-ai-gemini-2-0-google-cloud-and-more/\">latest earnings call</a> (while <a href=\"https://techcrunch.com/snippet/2960014/sundar-praises-deepseek-but-says-geminis-just-as-cheap/\">adding</a> that some of Gemini’s models are just as efficient).</p>\n\n\n<p class=\"wp-block-paragraph\">But <a href=\"https://techcrunch.com/2025/01/29/zuck-shrugs-off-deepseek-vows-to-spend-hundreds-of-billions-on-ai/\">just like Meta</a>, Alphabet isn’t throwing down the towel in Big Tech’s AI spending wars. In its latest earnings report, Alphabet <a href=\"https://techcrunch.com/snippet/2960051/alphabet-brushes-off-deepseek-fears-with-mammoth-75b-capex-spend/\">announced</a> it would boost capital expenditures to $75 billion — a whopping 42% increase — to accelerate its AI progress.</p>\n<p class=\"wp-block-paragraph\">Alphabet is betting that cheaper AI will massively boost demand for its services, rather than making it basically free and threatening its business models. The company noted it stands to benefit from this rise in usage — known as inference — thanks to its billions of existing users.</p>\n<p class=\"wp-block-paragraph\">“Part of the reason we are so excited about the AI opportunity is we know we can drive extraordinary use cases because the cost of actually using it is going to keep coming down, which will make more use cases feasible,” Pichai said during the earnings call. “And that’s the opportunity space. It’s as big as it comes, and that’s why you’re seeing us invest to meet that moment.”</p>\n<p class=\"wp-block-paragraph\">Meta CEO Mark Zuckerberg made <a href=\"https://techcrunch.com/2025/01/29/zuck-shrugs-off-deepseek-vows-to-spend-hundreds-of-billions-on-ai/\">similar comments</a> in Meta’s earnings call last week, pledging to spend “hundreds of billions” on AI in the long term despite all the <a href=\"https://techcrunch.com/2025/01/30/how-deepseek-changed-silicon-valleys-ai-landscape/\">DeepSeek buzz.</a></p>\n<p class=\"wp-block-paragraph\">Whether this all pans out is unclear, but for now, tech giants can afford the AI bills, and when (or if) they’ll slow down is anyone’s guess.</p>\n\n<p class=\"wp-block-paragraph\"></p>\n</div>",
            "link": "https://techcrunch.com/2025/02/04/alphabet-praises-deepseek-but-its-massively-ramping-up-its-ai-spending/",
            "author": "TechCrunch",
            "pub_date": "2025-02-05 08:11:04",
            "source": "techcrunch",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Two space startups have merged to create the next generation of telescopes",
            "description": "<div class=\"entry-content wp-block-post-content is-layout-constrained wp-block-post-content-is-layout-constrained\">\n<p class=\"wp-block-paragraph\" id=\"speakable-summary\">On a clear spring evening in Michigan, the stars aligned — just not in the way Upfront Ventures partner Nick Kim expected.</p>\n<p class=\"wp-block-paragraph\">He’d just led <a href=\"https://techcrunch.com/2023/12/06/oursky-lands-9-5m-seed-to-build-out-developer-platform-for-space-data/\">a $9.5 million seed round</a> for OurSky, a software platform for space observational data, and was eager to see what its telescope partner PlaneWave Instruments could do. </p>\n\n\n<p class=\"wp-block-paragraph\">But when they rolled out the telescopes that night at PlaneWave’s manufacturing facility, he was stuck waiting. </p>\n<p class=\"wp-block-paragraph\">“It took them quite a long time to get the first image. I’m talking like, multiple hours. And these are the people who make the telescopes! They were using all this, like, off-the-shelf, open source software that they kind of cobbled together,”  Kim said in an interview with TechCrunch.</p>\n<p class=\"wp-block-paragraph\">Kim wasn’t upset, though. He was excited. “This is why OurSky needed to exist, right? This is the problem,” he remembered thinking. “What a perfect match.” </p>\n<p class=\"wp-block-paragraph\">It was such a good match that, now, OurSky and PlaneWave are merging to create a new company called <a href=\"https://observable.space/\" rel=\"noreferrer noopener nofollow\" target=\"_blank\">Observable Space</a>. </p>\n<p class=\"wp-block-paragraph\">OurSky founder Dan Roelker and PlaneWave founder Richard Hedrick say this will make the telescopes easier to use. And they also believe the tighter integration will open up new markets — especially as they leverage their position as the only U.S.-based telescope manufacturer. They already count NASA, the U.S. Space Force, and Georgia State University’s Center for High Angular Resolution Astronomy as customers.</p>\n\n<p class=\"wp-block-paragraph\">“My dream was to integrate all the components on the telescope, even the parts we don’t sell, and then integrate the control of the telescope,” Hedrick said in an interview. “It was very obvious for us to be working together.”</p>\n<p class=\"wp-block-paragraph\">Roelker, who was SpaceX’s VP of software engineering from 2015 to 2019, said telescope users have to deal with what he called a “mash of integration bullsh–.” PlaneWave’s vertical strategy combined with OurSky’s software will eliminate those headaches, he said.</p>\n<p class=\"wp-block-paragraph\">Solving that integration problem is an opportunity for Observable Space to grow the market, Roelker said. (The platform OurSky has built will continue on in that name, and the telescopes will continue to be sold under the PlaneWave brand.)</p>\n\n\n<p class=\"wp-block-paragraph\">That can involve a number of things, like letting users tap multiple telescopes at a single site — or even around the world — to mimic the capabilities of a much larger telescope, or sending communications to and from space via laser, all while lowering cost.</p>\n<p class=\"wp-block-paragraph\">Squeezing more out of his high-quality telescopes sold Hedrick on the merger. It will make the tech more approachable and affordable for enthusiasts and institutions alike.</p>\n<p class=\"wp-block-paragraph\">Hedrick said one of those institutions recently designed some one-meter telescopes and had them custom-built by someone else. “And they were like, ‘God, if you had existed, we never would have done that,’” he said.</p>\n<h2 class=\"wp-block-heading\" id=\"h-new-business\">New business</h2>\n<p class=\"wp-block-paragraph\">As the cost to get to orbit shrinks, more companies are sending things to space, Roelker said. That means there is increased demand for the ability to locate and track objects orbiting the Earth, communicate with spacecraft, and enable defense and intelligence applications. </p>\n<p class=\"wp-block-paragraph\">Observable Space can be a key player in that new economy, according to Mislav Tolusic, managing partner at dual-use venture fund Marlinspike, which has invested in Observable Space.</p>\n<p class=\"wp-block-paragraph\">“Every day you’re relying on space,” Tolusic said in an interview. “If you take out GPS constellations, we’re in trouble economically. It’s a big, big, big deal. A lot of systems stop functioning. And guess what? The future is going to be even more dependent on that infrastructure.”</p>\n<p class=\"wp-block-paragraph\">Tolusic praised PlaneWave’s quality, and noted Hedrick built up the company at a time when basically all telescope manufacturing is overseas — which he believes is an advantage. </p>\n<p class=\"wp-block-paragraph\">“If you want to replicate that [in the U.S.], you have to go figure out how to make those fine lenses, how to make gimbals — and not just how to design them but how to spit them out by the thousands,” he said.</p>\n\n\n<p class=\"wp-block-paragraph\">Jordan Noone, general partner at Embedded Ventures, explained his fund’s investment with a specific example of what OurSky and PlaneWave can do as a combined company. </p>\n<p class=\"wp-block-paragraph\">Shortly before the merger, Noone was at Mount Wilson Observatory in Los Angeles for a demo of the companies’ products working together. </p>\n<p class=\"wp-block-paragraph\">He told TechCrunch that the teams pulled an observation request from the queue on OurSky’s platform: a satellite operator had lost radio contact with its spacecraft. The OurSky and PlaneWave teams located it quickly. </p>\n<p class=\"wp-block-paragraph\">What he described was a much smoother experience than Kim’s demo in Michigan, and served as proof in his mind that Observable Space was a good bet to make. </p>\n<p class=\"wp-block-paragraph\">“Many of the world’s most valuable companies, like Apple, Nvidia — they’re hardware/software platform combos,” Noone said. “Companies that approach just one of those two can have a lot of inherent value, but the combination of both in today’s world is extremely powerful.”</p>\n<h2 class=\"wp-block-heading\" id=\"h-star-wars-or-star-trek\">Star Wars or Star Trek?</h2>\n<p class=\"wp-block-paragraph\">Observable Space has about 100 employees, with the manufacturing operations remaining in Michigan, some engineering happening in Los Angeles, California, and an observatory outside Washington, D.C. </p>\n<p class=\"wp-block-paragraph\">It’s already revenue-generating, and the combined company has raised $11 million to date, including funding from In-Q-Tel, the CIA’s nonprofit strategic investment arm.</p>\n<p class=\"wp-block-paragraph\">Hedrick and Roelker said the two companies have fit together easily, since they were both focused on such different businesses and didn’t have massive back-office operations.</p>\n\n\n<p class=\"wp-block-paragraph\">“Going through the merger process itself was actually really valuable, because when you’re going through it, a lot of issues pop up,” Roelker said. “You actually get a really good sense of how you’re going to work together. And I think both Rick and I felt really good about that, because we actually went through some really hard things during the merger.” </p>\n<p class=\"wp-block-paragraph\">When asked, the pair did not describe those “hard things,” and Hedrick instead quipped: “We had to decide on whether [the company] was going to be Star Wars or Star Trek.”</p>\n<p class=\"wp-block-paragraph\">The answer?</p>\n<p class=\"wp-block-paragraph\">“Battlestar Galactica,” Roelker said.</p>\n</div>",
            "link": "https://techcrunch.com/2025/02/04/two-space-startups-have-merged-to-create-the-next-generation-of-telescopes/",
            "author": "TechCrunch",
            "pub_date": "2025-02-05 08:01:08",
            "source": "techcrunch",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Snap says TikTok uncertainty benefited its business",
            "description": "<div class=\"entry-content wp-block-post-content is-layout-constrained wp-block-post-content-is-layout-constrained\">\n<p class=\"wp-block-paragraph\" id=\"speakable-summary\">During Snap’s <a href=\"https://s25.q4cdn.com/442043304/files/doc_financials/2024/q4/Q4-2024-Press-Release.pdf\" rel=\"nofollow\">fourth-quarter earnings</a> call on Tuesday, CEO Evan Spiegel said that the uncertainty surrounding TikTok’s future has positively affected its business.</p>\n<p class=\"wp-block-paragraph\">“We’re not trying to draw too many conclusions from some of the engagement lift we saw when [TikTok] <a href=\"https://techcrunch.com/2025/01/19/tiktok-goes-dark-in-the-u-s/\">went dark for that brief period of time</a>. I would say that the overall environment of uncertainty is benefiting our business,” he said on the call.</p>\n\n\n<p class=\"wp-block-paragraph\">Among the appealing features that attract users to Snapchat is Spotlight, which serves as the company’s alternative to TikTok. Many creators are already on the platform, and more will likely join if TikTok goes offline in the U.S. again. Over the past year, Snap has onboarded thousands of creators into its Snap Star program, and the number of creators posting content grew by more than 40% year-over-year in the fourth quarter, says the company.</p>\n<p class=\"wp-block-paragraph\">Spiegel also highlighted the growth of Snapchat’s public content. He added, “I think in Q4 we actually reached a billion public posts a month on Snapchat. So the public content ecosystem is growing in a really nice and healthy way, and so we’re just going to continue our focus there when it comes to our strategy and participation.”</p>\n<p class=\"wp-block-paragraph\">In the fourth quarter, the company reported that it reached 453 million daily active users, an increase of 39 million from the previous period. Snap reported a revenue of $1.55 billion, up from $1.36 billion the previous year.</p>\n<p class=\"wp-block-paragraph\">The uncertainty surrounding TikTok has not only benefited Snap but has also affected the broader social media landscape, with several apps, <a href=\"https://techcrunch.com/2025/01/13/xiaohongshu-rednote-chinas-answer-to-instagram-hits-no-1-on-the-app-store-as-tiktok-faces-us-shutdown/\">including the Chinese-owned RedNote</a>, YouTube, and Meta seeing boosts in user engagement. </p>\n</div>",
            "link": "https://techcrunch.com/2025/02/04/snap-says-tiktok-uncertainty-benefited-its-business/",
            "author": "TechCrunch",
            "pub_date": "2025-02-05 07:31:03",
            "source": "techcrunch",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "A16z hires acquitted former Marine Daniel Penny as an investor",
            "description": "<div class=\"entry-content wp-block-post-content is-layout-constrained wp-block-post-content-is-layout-constrained\">\n<p class=\"wp-block-paragraph\" id=\"speakable-summary\">Powerhouse venture firm Andreessen Horowitz has hired Daniel Penny as an investor, its webpage confirms. </p>\n<p class=\"wp-block-paragraph\">Penny is the former Marine who was tried last year and found not guilty of criminally negligent homicide in the death of a homeless man on a New York City subway. After the man acted erratically, Penny held him in a chokehold and the man was later pronounced dead. The case <a href=\"https://www.nytimes.com/2024/12/16/nyregion/daniel-penny-verdict.html\" rel=\"nofollow\">polarized the nation</a>. </p>\n\n\n<p class=\"wp-block-paragraph\">Penny does not have a background in investing, but a16z plans to train him, according to an <a href=\"https://www.thefp\" rel=\"nofollow\">internal statement obtained by The Free Press</a>, which broke the news. Penny will work in the American Dynamism practice, which invests in government and defense tech. A16z did not immediately respond to our request for comment. </p>\n<p class=\"wp-block-paragraph\"></p>\n</div>",
            "link": "https://techcrunch.com/2025/02/04/a16z-hires-acquitted-former-marine-daniel-penny-as-an-investor/",
            "author": "TechCrunch",
            "pub_date": "2025-02-05 07:15:55",
            "source": "techcrunch",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "AMD pulls up the release of its next-gen data center GPUs",
            "description": "<div class=\"entry-content wp-block-post-content is-layout-constrained wp-block-post-content-is-layout-constrained\">\n<p class=\"wp-block-paragraph\" id=\"speakable-summary\">AMD says that it plans to launch its next major data center GPUs, the AMD Instinct MI350 series, sooner than originally announced.</p>\n<p class=\"wp-block-paragraph\">During the company’s Q4 2024 earnings call Tuesday, AMD CEO Lisa Su said AMD plans to sample the MI350 with “lead customers” this quarter, and “accelerate” production shipments to “mid-year.”</p>\n\n\n<p class=\"wp-block-paragraph\">“So, we had previously stated that we thought we would launch [the MI350] in the second half of [2025],” Su said. “And frankly, that bring-up has come up better than we expected, and there’s very strong customer demand, so we are actually going to pull that production ramp into the middle of the year, which improves our relative competitiveness.”</p>\n<p class=\"wp-block-paragraph\">AMD’s data center revenue pales in comparison to rival Nvidia’s, which regularly eclipses tens of billions of dollars per quarter. But AMD has gained ground in the last year, acquiring and retaining customers including Meta, Microsoft, and IBM.</p>\n<p class=\"wp-block-paragraph\">AMD says that sales of AMD Instinct chips reached over $5 billion in 2024, and the company expects its data center segment to grow “double digits” in 2025. Last year, data center revenue made up around half ($3.9 billion) of AMD’s overall revenue ($7.1 billion), the company reported.</p>\n<p class=\"wp-block-paragraph\">“I believe that the demand for AI compute is strong,” Su continued. “We see [the data center] business growing to tens of billions as we go through the next couple of years.”</p>\n</div>",
            "link": "https://techcrunch.com/2025/02/04/amd-pulls-up-the-release-of-its-next-gen-data-center-gpus/",
            "author": "TechCrunch",
            "pub_date": "2025-02-05 07:05:50",
            "source": "techcrunch",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Miist, founded by a 25-year-old, wants people to vape their way out of smoking addiction and migraines",
            "description": "<div class=\"entry-content wp-block-post-content is-layout-constrained wp-block-post-content-is-layout-constrained\">\n<p class=\"wp-block-paragraph\" id=\"speakable-summary\">As a university student, Dalton Signor was troubled by how many people around him smoked or vaped, including his grandmother and 14-year-old sister.</p>\n<p class=\"wp-block-paragraph\">Signor (pictured center) felt that existing smoking cessation medicines, whether patches, gums, or lozenges, are not very effective because they take too long to start working. “They take about 30 minutes to provide relief, but the average person relapses in 11 minutes,” he told TechCrunch.</p>\n\n\n<p class=\"wp-block-paragraph\">So, three years ago, he set out to develop a withdrawal-inhibitor inhaler because delivering medication directly to the lungs allows for rapid absorption into the bloodstream, providing faster relief. He dropped out of the university to work on this problem, creating Miist Therapeutics, attracting Jeff Schuster (pictured left), a physicist who has<a href=\"https://patents.justia.com/inventor/jeffrey-a-schuster?page=3\" rel=\"nofollow\"> dozens of patents</a> for developing inhaled medicines, as CTO and co-founder, and his long-term friend and biomedical engineer Eric Ezerins (pictured right) as head of R&amp;D.</p>\n<p class=\"wp-block-paragraph\">Three years after launching, Miist announced it secured $7 million in seed funding from investors including Refactor Capital, 1517 Fund, and Freeflow Ventures.</p>\n<p class=\"wp-block-paragraph\">Refractor’s solo GP Zal Bilmoria said he initially wasn’t convinced that Miist’s approach would be effective. But when Signor presented him with the results of the company’s Phase I trial, the former Andreessen Horowitz partner who helped launch <a href=\"https://techcrunch.com/2024/06/18/zal-bilimoria-refactor-capital-venture-capital/\">that firm’s first Bio Fund</a>, instantly changed his mind.</p>\n<p class=\"wp-block-paragraph\">The small study showed that smokers who used Miist’s inhaler eliminated 92% of their cravings in only two minutes, a 10X improvement over the existing standard of care. “It’s game-changing,” Bilmoria said.</p>\n<p class=\"wp-block-paragraph\">Signor explained that Miist’s technology produces particles that are 50% smaller than other inhalers, which means the medicine is deposited deeper in the lungs, where the lining is just one cell thick, leading to faster absorption into the bloodstream.</p>\n\n<p class=\"wp-block-paragraph\">Although Miist calls its invention an inhaler, it looks and acts like a vaping device. Signor said that its vape-like properties may help with the psychological aspects of quitting.</p>\n<p class=\"wp-block-paragraph\">“When people quit, they miss taking the five-minute smoke break and like having that part of their day to themselves,” he said, adding that even though the medicine could be delivered in one inhalation, Miist chose to spread it out over seven puffs to mimic the behaviour of smoking.</p>\n<figure class=\"wp-block-image size-large is-resized\"><img alt=\"\" class=\"wp-image-2959994\" decoding=\"async\" height=\"1280\" loading=\"lazy\" sizes=\"auto, (max-width: 1920px) 100vw, 1920px\" src=\"https://techcrunch.com/wp-content/uploads/2025/02/IMG_4326.jpg?w=680\" srcset=\"https://techcrunch.com/wp-content/uploads/2025/02/IMG_4326.jpg 1920w, https://techcrunch.com/wp-content/uploads/2025/02/IMG_4326.jpg?resize=150,100 150w, https://techcrunch.com/wp-content/uploads/2025/02/IMG_4326.jpg?resize=300,200 300w, https://techcrunch.com/wp-content/uploads/2025/02/IMG_4326.jpg?resize=768,512 768w, https://techcrunch.com/wp-content/uploads/2025/02/IMG_4326.jpg?resize=680,453 680w, https://techcrunch.com/wp-content/uploads/2025/02/IMG_4326.jpg?resize=1200,800 1200w, https://techcrunch.com/wp-content/uploads/2025/02/IMG_4326.jpg?resize=1280,853 1280w, https://techcrunch.com/wp-content/uploads/2025/02/IMG_4326.jpg?resize=430,287 430w, https://techcrunch.com/wp-content/uploads/2025/02/IMG_4326.jpg?resize=720,480 720w, https://techcrunch.com/wp-content/uploads/2025/02/IMG_4326.jpg?resize=900,600 900w, https://techcrunch.com/wp-content/uploads/2025/02/IMG_4326.jpg?resize=800,533 800w, https://techcrunch.com/wp-content/uploads/2025/02/IMG_4326.jpg?resize=1536,1024 1536w, https://techcrunch.com/wp-content/uploads/2025/02/IMG_4326.jpg?resize=668,445 668w, https://techcrunch.com/wp-content/uploads/2025/02/IMG_4326.jpg?resize=563,375 563w, https://techcrunch.com/wp-content/uploads/2025/02/IMG_4326.jpg?resize=926,617 926w, https://techcrunch.com/wp-content/uploads/2025/02/IMG_4326.jpg?resize=708,472 708w\" style=\"width:934px;height:auto\" width=\"1920\"/><figcaption class=\"wp-element-caption\"><span class=\"wp-block-image__credits\"><strong>Image Credits:</strong>Miist</span></figcaption></figure>\n<p class=\"wp-block-paragraph\">Nicotine addiction is not the only health issue where rapid release makes a big difference.</p>\n\n\n<p class=\"wp-block-paragraph\">The company recently launched a program for migraines. For someone in the throes of a migraine the difference between fast-acting and slow-absorbing medication can be significant. It not only provides faster relief, but can also help avert a much longer, untreatable attack.</p>\n<p class=\"wp-block-paragraph\">Although several nasal inhaler formulations of migraine drugs currently exist, Miist anticipates that its oral inhaler will be more effective.</p>\n<p class=\"wp-block-paragraph\">Miist is gearing up to run a Phase II trial of its smoking cessation tech that uses the active ingredient in standard nicotine replacement therapy, like Nicorette. It is also currently testing triptans, a class of migraine drugs, in the lab, Signor said. Signor envisions that the inhaler can one day also be used to administer other medicines for other conditions, such as anxiety control.</p>\n<p class=\"wp-block-paragraph\">Miist is not the only startup developing a vape-like device for smoking cessation and migraines. Qnovia has raised over $35 million at an estimated $350 million valuation from investors including Blue Ledge Capital, DG Ventures, and Vice Venture,<a href=\"https://www.forbes.com/sites/willyakowicz/2024/10/25/qnovia-respirx-nicotine-replacement-therapy-nrt-new-device-to-quit-smoking/\" rel=\"nofollow\"> Forbes reported</a>.</p>\n<p class=\"wp-block-paragraph\">Qnovia, like Miist, needs FDA clearance before selling its device in the US. If approved, they will be the first prescription-approved smoking cessation treatment to come to market in <a href=\"https://pmc.ncbi.nlm.nih.gov/articles/PMC5347897/#:~:text=On%2011%20May%202006%2C%20the,had%20experienced%20suicidal%20behaviour%202.\" rel=\"nofollow\">nearly two decades</a>.</p>\n<p class=\"wp-block-paragraph\">Some may view vaping as an unorthodox method of drug delivery. However, Refractor’s Bilmoria believes that its effectiveness should override people’s reservations.</p>\n<p class=\"wp-block-paragraph\">“It’s unbelievable to me that the pharma industry has overlooked this opportunity,” he said.</p>\n</div>",
            "link": "https://techcrunch.com/2025/02/04/miist-founded-by-a-25-year-old-wants-people-to-vape-their-way-out-of-smoking-addiction-and-migraines/",
            "author": "TechCrunch",
            "pub_date": "2025-02-05 06:20:55",
            "source": "techcrunch",
            "kind": 1,
            "language": "en"
        }
    ]
}