{
    "data": [
        {
            "title": "The key electronics sector saw production jump 44 per cent year on year.",
            "description": "<div class=\"storyline-wrapper default\"><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">SINGAPORE - Singapore’s manufacturing production <!-- -->began 2026 with a bang, notching its fifth straight month of growth in January, led by the key electronics sector.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Total factory output rose by 16.6 per cent from the previous year, picking up from the growth of 10.9 per cent recorded in December 2025, according to data released by the Economic Development Board (EDB) on Feb 26.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Excluding the volatile biomedical manufacturing sector, manufacturing output rose 24.1 per cent.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">The electronics sector, which accounts for more than a third of the Republic’s manufacturing output, saw production surge 44 per cent year on year.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">This was led by other electronic modules and components, which saw growth of 53.3 per cent over the period. Semiconductors grew by 52 per cent, with the segment supported by strong artificial intelligence (AI)-related demand, according to EDB.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Infocomms and consumer electronics <!-- -->expanded <!-- -->5.2 per cent, while computer peripherals and data storage contracted 6.3 per cent.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Maybank economist Brian Lee said that electronics will likely remain a key driver of manufacturing strength over the coming months, <!-- -->on a sustained <!-- -->AI investment boom.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">He added that Singapore’s critical semiconductor exports remain exempt from US tariffs.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Mr Lee also noted that many of its trading partners are enjoying lower tariff rates of 10 per cent for the time being, after the US Supreme Court ruled that President Donald Trump’s reciprocal tariffs were unconstitutional. </p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">He said: “Asian exporters could seize the opportunity to step up frontloading (of exports) to the US to capitalise on the temporarily lower tariff rates.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">“Further frontloading will benefit Singapore’s manufacturing sector and exports.”</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Biomedical manufacturing output fell 33.1 per cent, largely attributed to the contraction of 44.1 per cent in the pharmaceuticals segment, that produced less biological products and active pharmaceutical ingredients.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Medical technology output fell 28.1 per cent, due to the softer demand for medical devices. </p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Meanwhile, transport engineering output grew 25.2 per cent. This was led by the aerospace sector, which saw a higher production of aircraft parts and sustained maintenance, repair and overhaul activities.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Precision engineering<!-- --> production rose<!-- --> 13.2 per cent, with growth in precision modules and, as well as machinery and systems including semiconductor equipment.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">The general manufacturing segment declined 2.6 per cent, as gains in miscellaneous industries and printing were offset by declines in food, beverages and tobacco production.</p></div>",
            "link": "https://www.straitstimes.com/business/economy/singapore-factory-output-grows-16-6-in-january-more-than-expected-as-electronics-surge",
            "pub_date": "2026-02-26 13:20:29",
            "source": "straitstimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Economists raise Singapore growth forecast this year to 3.6% from 2.3%: MAS survey",
            "description": "<div class=\"storyline-wrapper default\"><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">SINGAPORE - Private sector economists expect Singapore’s economy to grow by 3.6 per cent in 2026, higher than their previous forecast, amid an improved outlook for the manufacturing and wholesale and retail trade sectors.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">This is a significant upgrade from their previous prediction of 2.3 per cent in the December survey, and comes in towards the higher end of the Government’s forecast range of 2 per cent to 4 per cent.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">The latest quarterly survey of professional forecasters was sent out by the Monetary Authority of Singapore (MAS) on Feb 10, and it is not clear whether any of the responses came before Feb 20 when the US imposed a new global tariff rate of 10 per cent and raised the possibility of pushing it up to 15 per cent for some countries.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Deputy Prime Minister Gan Kim Yong said on Feb 22 that despite the possibility of higher US tariffs, the Government for now is maintaining its 2026 growth forecast.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">The <!-- -->higher forecast in the MAS survey<!-- --> came about as respondents raised their 2026 projections for manufacturing to 4.3 per cent from 3.6 per cent previously. The forecast for the wholesale and retail trade sector rose to 4 per cent from 2 per cent.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">The forecast for non-oil domestic exports more than doubled to 4.5 per cent from 2 per cent.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">However, estimates for accommodation and food services<!-- --> dropped<!-- --> to 1.3 per cent from 1.6 per cent.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">For the first quarter of 2026, the MAS survey tips growth of 5.8 per cent year on year, strong but down from the 6.9 per cent expansion seen in the previous quarter. That 6.9 per cent growth far exceeded the 3.6 per cent growth tipped by respondents<!-- --> in the December survey.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">In their first forecast for 2027, the economists surveyed estimate growth<!-- --> at 2.5 per cent. </p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Most economists in the MAS survey saw the possibility of an upside to their 2026 forecasts from a sustained artificial intelligence-led tech cycle upturn. Respondents also pointed to resilient global growth and easing of trade tensions as potential upsides.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">They still warned of downside risks to Singapore’s economic outlook from possible geopolitical risks, including escalation in trade tensions and wars. They also flagged the risk of a so-called AI bubble burst, with negative spillovers to financial markets and the global economy.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Geopolitical tensions, including the introduction of semiconductor and pharmaceutical tariffs, was the top downside risk to Singapore’s economic outlook.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">The survey’s median forecast for 2026 inflation, as measured by the consumer price index (CPI) for all-items, came in unchanged at 1.5 per cent.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">However, the projection for core inflation – which excludes private transport and accommodation costs to better represent household expenses – rose to 1.5 per cent from 1.3 per cent in the previous survey.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">The 2027 median forecasts for both CPI-all items inflation and core inflation were at 1.7 per cent.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">For the labour market, the respondents expect the unemployment rate to be 2.1 per cent at end of 2026, unchanged from the December survey.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Nearly half of the economists, or 47 per cent, expect MAS to tighten its monetary policy in April -<!-- --> likely<!-- --> in response to the uptick in core inflation.</p></div>",
            "link": "https://www.straitstimes.com/business/economy/economists-raise-singapore-growth-forecast-this-year-to-3-6-from-2-3-mas-survey",
            "pub_date": "2026-02-26 12:00:57",
            "source": "straitstimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "IMF says tariff uncertainty risks hampering ‘buoyant’ US economy",
            "description": "<div class=\"storyline-wrapper default\"><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">WASHINGTON – Turmoil around <a aria-label=\"link\" class=\"gap-x-04 items-center inline text-primary-60 select-auto\" data-testid=\"custom-link\" href=\"https://www.straitstimes.com/world/united-states/us-tariff-rate-to-hit-15-or-more-for-some-nations-ustr-says?ref=inline-article\" rel=\"nofollow noopener\" target=\"_blank\"><p class=\"font-body-baseline-regular inline\" data-testid=\"paragraph-test-id\">sweeping US tariffs</p></a> risks undercutting what’s otherwise a “buoyant” economy, the International Monetary Fund said.  </p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">“Uncertainty around trade policies could represent a larger-than-expected drag on activity,” the IMF said on Feb 25 in a summary of its latest annual review of the world’s biggest economy. The Fund said it’s also possible that import taxes may not pass through to consumers as much as expected. </p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">President Donald Trump imposed the highest tariffs in roughly a century in 2025, saying they’d push companies to invest more in the United States. Last week many of those charges were <a aria-label=\"link\" class=\"gap-x-04 items-center inline text-primary-60 select-auto\" data-testid=\"custom-link\" href=\"https://www.straitstimes.com/world/united-states/us-supreme-court-strikes-down-trumps-tariffs?ref=inline-article\" rel=\"nofollow noopener\" target=\"_blank\"><p class=\"font-body-baseline-regular inline\" data-testid=\"paragraph-test-id\">struck down by the US Supreme Court,</p></a> pushing the administration to seek alternative authorities for taxing imports. A new 10 per cent across-the-board levy took effect on Feb 24, and Mr Trump says he’ll raise the rate to 15 per cent. </p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Those changes came after the IMF had concluded what’s known as the Article IV consultation, an assessment of US economic and financial developments, managing director Kristalina Georgieva said in a press conference on Feb 25. Publication of the report was delayed due to a US government shutdown. Ms Georgieva said she met with US Treasury Secretary Scott Bessent and Federal Reserve Chair Jerome Powell before the Feb 25 release.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">The administration has <a aria-label=\"link\" class=\"gap-x-04 items-center inline text-primary-60 select-auto\" data-testid=\"custom-link\" href=\"/business/economy/trump-pegs-new-tariffs-to-a-payments-crisis-that-experts-doubt-exists?ref=inline-article\" rel=\"noopener\" target=\"_blank\"><p class=\"font-body-baseline-regular inline\" data-testid=\"paragraph-test-id\">invoked a crisis in the US balance of payments</p></a> for its latest trade shift, an argument greeted with skepticism by many economists. </p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">The US current-account deficit – seen as the broadest measure of trade – “is too big,” Ms Georgieva said, though she added that it’s not an immediate or pressing concern. The IMF study also said the country’s declining net investment position “represents a potentially important source of vulnerability.” </p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">The IMF also touched on US budget deficits that are large by historical standards, and called for measures to bring them down. “The upward path for the public debt-GDP ratio and increasing levels of short-term debt-GDP represent a growing stability risk to the US and global economy,” the study said. </p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Ms Georgieva pointed to rapid productivity gains in the US labour force, citing it as a promising sign for the economy’s prospects. But the IMF also cited tighter immigration policy that could strain labour supply and hinder growth.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">“Stricter border enforcement and increased removals are expected to reduce the size of the foreign-born labor force in the coming years resulting in slower employment growth, a modest increase in inflationary pressures, and a reduction in activity of around 0.4 per cent by 2027,” the report said.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">The IMF cut its forecast for US medium-term potential expansion by a quarter percentage point, with “lower labour force growth expected to more-than-offset the gains in labour productivity.”</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">The IMF summary also highlighted the pressure on the Fed, which has been pushed by the Trump administration to slash interest rates. And the Fund warned against damaging budget cuts for the country’s data- and tax-collecting agencies. </p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">“The US’s strong institutional framework for economic and regulatory policymaking should be maintained, including by respecting existing institutional protections and fully resourcing the agencies that are responsible for key federal functions,” it said. BLOOMBERG</p></div>",
            "link": "https://www.straitstimes.com/business/economy/imf-says-tariff-uncertainty-risks-hampering-buoyant-us-economy",
            "pub_date": "2026-02-26 08:50:24",
            "source": "straitstimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Singapore core inflation sees surprise drop to 1% in January",
            "description": "<div class=\"storyline-wrapper default\"><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">SINGAPORE - Singapore’s consumer prices fell in the first month of 2026 due to a moderation in services inflation, the Monetary Authority of Singapore (MAS) and the Ministry of Trade and Industry (MTI) said on Feb 23. </p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Core inflation, which excludes private transport and accommodation costs to better represent household expenses, eased to 1 per cent in January from 1.2 per cent in December 2025.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Analysts polled by Bloomberg had expected core inflation to rise to 1.5 per cent last month.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Overall – or headline – inflation in January rose to 1.4 per cent from 1.2 per cent in December due to higher accommodation inflation that more than offset lower core and private transport inflation. The reading was below the 1.6 per cent forecast in the Bloomberg poll.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">MAS and MTI said in their joint report on Feb 23 that Singapore’s imported costs should remain contained, as global crude oil prices are expected to remain lower while regional consumer price inflation should pick up modestly after their weak outturns in 2025.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">They maintained their forecast for core inflation in 2026 to average<!-- --> 1 per cent to 2 per cent. The forecast was raised in January from 0.5 per cent-1.5 per cent previously.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">MAS and MTI said the inflation outlook remains subject to uncertainties. </p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">“Stronger-than-expected growth could bolster demand-pull inflationary pressures. Supply shocks, including those triggered by geopolitical developments, could also lift imported costs. Conversely, a large, discrete shock to growth from macroeconomic and financial stressors could dampen inflation,” said MAS and MTI in a joint statement.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Accommodation inflation picked up to 1.9 per cent, from 0.3 per cent in December, owing to a larger increase in the cost of housing maintenance and repairs.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Prices of retail and other goods rose by 0.5 per cent, after being unchanged in December, primarily on account of an increase in the cost of other appliances for personal care.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Services inflation moderated at 1.5 per cent, from 1.9 per cent in December, led by a larger fall in airfares and a decline in general, vocational and higher education fees.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Electricity and gas inflation fell 4.2 per cent, unchanged from December, as electricity tariffs declined at a similar pace. </p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Private transport inflation eased to 2.7 per cent, from 3.7 per cent in December, owing to a smaller increase in car prices and a steeper decline in petrol prices.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Food inflation was unchanged at 1.2 per cent, as the prices of non-cooked food and food services rose at similar rates in January and December.</p></div>",
            "link": "https://www.straitstimes.com/business/economy/singapore-core-inflation-sees-surprise-drop-to-1-in-january",
            "pub_date": "2026-02-23 13:26:00",
            "source": "straitstimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "UK graduate jobs drop below 10,000 for first time, report says",
            "description": "<div class=\"storyline-wrapper default\"><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">LONDON – UK job vacancies dropped to their lowest in five years and graduate posts fell to a record low as hiring weakened in January amid mounting concerns about the labour market.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Employers advertised 694,940 jobs, a 3.05 per cent fall in the month that continued the downward trend from 2025, the online job search site Adzuna said. It was the worst reading since January 2021. </p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Graduate jobs plunged 19.1 per cent to below 10,000 for the first time since Adzuna started tracking the metric in April 2016. </p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">“The market remains challenging, with fewer vacancies and intense competition, but continued wage growth suggests employers are still willing to pay for the right skills,” said Andrew Hunter, the firm’s co-founder. The average salary reached £43,289 (S$74,017) in January, up 5.98 per cent year on year, Adzuna said – above the Bank of England’s 3.25 per cent estimate of non-inflationary stable wage growth.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">The findings will add to fears that the UK labour market is fast unwinding, with young people hit hardest. Bank of England rate-setters have recently raised concerns about rising unemployment, which has climbed to 5.2 per cent from 4.7 per cent in the past six months.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Labour’s hikes to the minimum wage and payroll taxes have been blamed, as well as its plans for stricter employment rights. <a aria-label=\"link\" class=\"gap-x-04 items-center inline text-primary-60 select-auto\" data-testid=\"custom-link\" href=\"https://www.straitstimes.com/world/europe/startups-in-britain-turn-to-ai-instead-of-costly-new-hires?ref=inline-article\" rel=\"nofollow noopener\" target=\"_blank\"><p class=\"font-body-baseline-regular inline\" data-testid=\"paragraph-test-id\">Artificial intelligence also appears to be replacing entry level jobs,</p></a> which fell 4.46 per cent month on month, according to Adzuna.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Economists are hoping AI and improved business investment spark a recovery in Britain’s feeble productivity, a measure of output per worker that is vital to raising living standards. Research published on Feb 23 by the Boston Consulting Group (BCG) found that Britain’s biggest industries have been responsible for the decades-long decline in productivity that has roughly halved the GDP growth rate since the end of the 1990s.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Finance, manufacturing, communications and retail have fallen behind the “productivity frontier” over the past two decades, reversing the catch-up achieved between 1997 and 2007, BCG said. The situation has been made worse by an increase in the number of underperforming small firms despite technological advances.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">There are more low productivity small companies in the UK today than in 1997 and they are on average less productive than three decades ago. The BCG study highlights the scale of the challenge the UK faces to reverse its productivity trend and close the gap with the United States and other economies. <span class=\"uppercase\">bloomberg</span></p></div>",
            "link": "https://www.straitstimes.com/business/economy/uk-graduate-jobs-drop-below-10000-for-first-time-report-says",
            "pub_date": "2026-02-23 08:56:08",
            "source": "straitstimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Trump pegs new tariffs to a US payments crisis that experts doubt exists",
            "description": "<div class=\"storyline-wrapper default\"><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">WASHINGTON – With his move to <a aria-label=\"link\" class=\"gap-x-04 items-center inline text-primary-60 select-auto\" data-testid=\"custom-link\" href=\"https://www.straitstimes.com/world/united-states/trump-says-he-will-raise-us-global-tariff-rate-from-10-to-15?ref=inline-article\" rel=\"nofollow noopener\" target=\"_blank\"><p class=\"font-body-baseline-regular inline\" data-testid=\"paragraph-test-id\">impose new global tariffs,</p></a> US President Donald Trump isn’t just trying to repair a trade policy dismantled by a <a aria-label=\"link\" class=\"gap-x-04 items-center inline text-primary-60 select-auto\" data-testid=\"custom-link\" href=\"https://www.straitstimes.com/world/united-states/us-supreme-court-strikes-down-trumps-tariffs?ref=inline-article\" rel=\"nofollow noopener\" target=\"_blank\"><p class=\"font-body-baseline-regular inline\" data-testid=\"paragraph-test-id\">Supreme Court rebuke.</p></a> He’s also declaring the world’s largest economy is facing a profound balance-of-payments crisis. </p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">The potential problem for Mr Trump and his administration with that argument: Many economists – and financial markets so far – don’t see the US teetering on any such precipice. That means his latest import taxes seem likely to lead to yet another legal challenge and more uncertainty for trading partners, companies, consumers and investors. </p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">To roll out a tariff of 10 per cent – which Mr Trump later raised to 15 per cent – to replace those the court invalidated in its landmark ruling on Feb 20, he invoked Section 122 of the Trade Act of 1974. The statute allows US presidents to impose duties for up to 150 days “in situations of fundamental international payments problems.” Those include “large and serious United States balance-of-payments deficits” and an “imminent and significant depreciation of the dollar.” </p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Treasury Secretary Scott Bessent, in interviews with CNN and Fox News on Feb 22, said the new tariffs would be temporary, ensure that revenues continue to flow to the Treasury and eventually be replaced by ones under separate authorities that “have withstood more than 4,000 challenges since the president’s first term.”</p><h2 class=\"font-header-lg-semibold\" data-testid=\"article-subhead-test-id\">Short-term ‘bridge’</h2><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">“We’ll see what Congress does, but the 122 is likely a five-month bridge during which studies on Section 232 tariffs and Section 301s are done,” Mr Bessent told CNN, referring to other tariff authorities that require investigations before being implemented. “So this is more of a bridge than a permanent facility.” </p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">To Fox News, he added that Section 122 is “a very robust authority.” </p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Mr Bessent didn’t say that the new tariffs were necessary to address a particular payments crisis. </p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">An executive order Mr Trump signed on Feb 20 announcing the new import taxes pointed to the US trade deficit and other financial flows as evidence of “large and serious” balance-of-payments deficits. </p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Among the things Mr Trump identified was a net international investment position – the difference between US investments abroad and foreign investments in the US – that is now US$26 trillion (S$32.9 trillion) in the red. </p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">What he didn’t mention was that his use of levies to force US and foreign companies to invest more in the US would lead to that number ballooning further. Or that in its latest report in January on the position, the US Bureau of Economic Analysis pointed to the soaring valuations on US equities markets that Mr Trump has hailed as a vote of confidence in the US as a major cause of the increase in the US’s negative investment position. </p><h2 class=\"font-header-lg-semibold\" data-testid=\"article-subhead-test-id\">Dollar resilience</h2><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">The issue most economists see is that despite the president’s proclamation, there’s no evidence the US isn’t able to pay its bills or meet the obligations it has to international investors. If there was, financial markets would be selling off American assets and the dollar would be collapsing amid a loss of confidence in the US economy and the most dominant reserve currency. </p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">“Wearing my (former) IMF hat I will say that the US does not have a fundamental international payments problem,” Gita Gopinath, the former first deputy managing director of the International Monetary Fund, wrote in a social media post on Feb 22.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">In an email to Bloomberg News, she added that “150-day tariffs will do little to durably reduce trade deficits. It will mainly result in another round of volatile trade numbers as importers try to time their purchases to avoid tariffs.” </p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Jay Shambaugh, who occupied the top international job at the US Treasury during the Biden administration, said in an interview there was no evidence the US was facing any balance-of-payments crisis despite Mr Trump’s proclamation. </p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">“That would be a situation where not enough money is flowing into the country to balance all the things where money is flowing out of the country,” Mr Shambaugh said.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">But that’s not the case with financial flows into the country balancing the trade deficit. If it wasn’t true, that would be evident in a dollar “depreciating rapidly because nobody wanted to put money into the US to cover the things that are going out,” Mr Shambaugh said.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Mark Sobel, another former senior Treasury official, said the entire premise was based on an antiquated view of the US economy and an artifact of the long-dead Bretton Woods regime of fixed exchange rates and the gold standard. He also argued that Mr Trump has the wrong targets in his sights. </p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">“The president should be far more concerned about the fiscal outlook. Many estimates point to our fiscal deficits averaging 6 per cent of GDP annually over the next decade, before subsequently going much higher,” Sobel said. “That is a lot of Treasury issuance for global markets to digest and could push interest rates much higher.”</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">The last time a US president imposed tariffs to address balance-of-payments concerns was in 1971 when Richard Nixon introduced a 10 per cent duty that lasted for just a few months and was meant to force other nations into renegotiating fixed foreign exchange rates and address an overvalued dollar. The fundamental payments problem faced by the US then was that the US didn’t hold enough gold in its reserves to match the value of the dollar and speculators were starting to attack the currency. </p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Section 122 was actually part of a law passed by Congress in response to Mr Nixon’s tariffs and to ensure that future presidents would have boundaries on their use. </p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">There are economists who argue that the Trump administration is partially justified in invoking the Section 122 provision.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Brad Setser, a former US Treasury and trade official now at the Council on Foreign Relations, said the US’s current-account deficit now around 3 per cent-4 per cent of gross domestic product was significant enough to merit the “large and serious” definition.</p><h2 class=\"font-header-lg-semibold\" data-testid=\"article-subhead-test-id\">‘Big’ deficit</h2><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">But whether the US faced “‘fundamental international payments problems’ is a harder question,” he wrote in a series of social media posts on Feb 22. “The deficit is big,” Mr Setser said. But portfolio inflows into the US in 2025 remained strong enough to fund a US$500 billion external deficit, he said, “and the dollar is currently quite strong.”</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Mr Trump’s latest tariffs and his reason for them could also end up back before the Supreme Court. </p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">“It’s not clear to me that he’s met the conditions” of Section 122 or that the reasons for the statute even exist since the US abandoned the gold standard, said Jennifer Hillman, a former top US trade lawyer and judge now at Georgetown University’s law school. </p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">She said such a case would be less clear-cut than the challenge Trump lost on Feb 20, in which the Supreme Court found that the original 1977 statute he used didn’t even mention the word tariff.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Neal Katyal, the prominent lawyer who argued the case against Mr Trump’s global tariffs before the Supreme Court, pointed out over the weekend that one issue the president could face if his new tariffs are challenged is that his own lawyers argued Section 122 wasn’t appropriate for them. </p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">“Nor does (Section 122) have any obvious application here, where the concerns the president identified in declaring an emergency arise from trade deficits, which are conceptually distinct from balance-of-payments deficits,” administration lawyers wrote in a filing in 2025. </p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">That may be moot, Mr Setser argued. </p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">While he said he was sure the justification for Trump’s tariffs would end up before the courts, “more importantly, I don’t think litigation over the meaning of a fundamental payments problem and a balance-of-payments deficit will be sorted in 150 days,” he wrote. “So my bet is that the clock on the tariffs will expire” before the courts rule. BLOOMBERG</p></div>",
            "link": "https://www.straitstimes.com/business/economy/trump-pegs-new-tariffs-to-a-payments-crisis-that-experts-doubt-exists",
            "pub_date": "2026-02-23 07:45:47",
            "source": "straitstimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Las Vegas sees sharp visitor drop as leisure spending wanes",
            "description": "<div class=\"storyline-wrapper default\"><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">LAS VEGAS - On Fridays, it still feels like peak Vegas – rolling suitcases, packed rideshare queues and the familiar churn at Harry Reid International. By Monday, the airport has quieted considerably.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">“Our peaks are still peaks, and our valleys are softer,” said James Chrisley, director of the Clark County Aviation Department.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">The softening is showing up in hotel pricing, flight schedules and pay cheques – echoing what the Federal Reserve’s survey and recent airline earnings calls have flagged: Higher-income travellers keep booking, while households feeling the pinch pull back.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">With the top 10 per cent of earners driving consumer spending, economists warn recession risks can rise if affluent, market-linked spending suddenly cools.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Nowhere is that divide clearer than in Las Vegas, a city powered by leisure spending that just posted its sharpest annual visitor decline outside the pandemic.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Las Vegas drew about 3.1 million fewer visitors in 2025, a 7.5 per cent drop – its sharpest decline outside the pandemic since record-keeping began in 1970, according to the Las Vegas Convention and Visitors Authority. The agency does not break down its visitation figures by domestic versus international travellers.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Conventions are holding up; the weakness is leisure – the city’s lifeblood.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">“I think this is more of a microcosm of where the American consumer is than necessarily telling us where the American economy is going,” said Andrew Woods, who heads the Center for Business and Economic Research at the University of Nevada.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Mr Woods said other big vacation spots – like Honolulu, Orlando and Disneyland – are not seeing the same downward trend in visitors as Las Vegas, adding that the city’s high prices and fees have made it especially vulnerable as budget-conscious travellers pull back.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Officials and executives said Las Vegas is coming off two straight record years and is now settling into a more balanced market.</p><h2 class=\"font-header-lg-semibold\" data-testid=\"article-subhead-test-id\">Midweek fade</h2><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">The shift is most visible in the middle of the week.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Weekdays are when hotels build steady volume – rooms that cover payrolls and keep restaurants and casino floors moving. When that demand softens, hotels can backfill with promotions, but they usually lower prices or add perks to do it.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Location data from Placer.ai shows that the weekday share of foot traffic on the Las Vegas Strip has been declining, while the weekend share has been rising: It reached 35.3 per cent in 2025, up from 33.8 per cent in 2019.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Officials, analysts, workers and visitors cited a mix of political unease and more cautious travel plans. Fernanda Loiza, a tourist from Guatemala, said some travelers may be staying away because of the Trump administration’s immigration crackdown, which has ensnared tourists in some high-profile cases. Some people, Ms Loiza said, are afraid of “coming and openly and freely enjoying Las Vegas.”</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">International visitors matter disproportionately because they typically stay longer and spend more.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Tour guide Michael Hillman said travellers are bristling at how pricey Las Vegas has become. “Ten bucks for a bottle of water,” he said. “People don’t see a deal anymore.”</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Economists say years of add-on fees and higher prices have left visitors feeling they pay more for less – a model that’s harder to sustain as inflation weighs on budgets.</p><h2 class=\"font-header-lg-semibold\" data-testid=\"article-subhead-test-id\">Hotels discount, airlines pull back</h2><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">MGM Resorts in February said revenue and earnings at its Las Vegas resorts fell in the fourth quarter and in 2025, citing outsized weakness at value-oriented properties such as Luxor and Excalibur, even as executives said trends were improving into 2026.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Caesars Entertainment reported on Feb 17 that profit and revenue fell at its Las Vegas segment in the quarter ending in December and in all of 2025. For the full year, profit was down about 20 per cent year on year, on roughly a 5 per cent drop in revenue.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Strip hotels have leaned on seasonal offers and dining credits since late 2025, sometimes adding perks to hold demand. CoStar Group data shows midweek revenue per available room fell about 11 per cent in 2025.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">“Las Vegas remains a predominantly leisure-driven hotel market,” said Michael Stathokostopoulos, a senior market analyst at CoStar. Inflation and economic uncertainty, he said, are pushing travelers to skip trips, shorten stays or trade down.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Airlines have trimmed schedules as demand has softened. Cirium data shows US carriers have about 7 per cent fewer seats scheduled into Las Vegas for the first quarter of 2026 than a year earlier.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">International traffic shows a similar trend, particularly from Canada, a key overseas market. Major Canadian carriers have cut capacity for the quarter by about 30 per cent. The pullback comes as some Canadians have shown greater reluctance to travel to the United States amid political tensions, including fallout from US tariffs and immigration-related policies.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Economists say the next test comes this spring, as households book summer travel. One early gauge will be drive-in traffic from Southern California, a key feeder market.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">For some job seekers, the slowdown is already stark. Woo Shuang, 26, said she has struggled to land interviews and received a string of automated rejections. She recently enrolled in training to become a casino dealer.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">“It’s been really tough,” she said. “The entire city runs on tourism.” REUTERS</p></div>",
            "link": "https://www.straitstimes.com/business/economy/las-vegas-sees-sharp-visitor-drop-as-leisure-spending-wanes",
            "pub_date": "2026-02-20 10:17:42",
            "source": "straitstimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Japan's factory activity expands at fastest pace in four years, PMI shows",
            "description": "<div class=\"storyline-wrapper default\"><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">TOKYO - Japan’s manufacturing activity grew at its fastest pace in about four years in February, buoyed by strong domestic and overseas demand, a private sector survey showed on Feb 20, an encouraging sign for Prime Minister Sanae Takaichi’s economic revival plans.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">The S&amp;P Global flash Japan Manufacturing Purchasing Managers’ Index (PMI) rose to 52.8 in February from 51.5 last month, marking the strongest growth since May 2022. Readings above 50 indicate growth in activity, while those below 50 signal contraction.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">“The manufacturing industry saw a notable improvement in growth momentum, and broadly matched the solid pace seen across the service sector to suggest that the upturn has become more broad-based,” said Annabel Fiddes, Economics Associate Director at S&amp;P Global Market Intelligence.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Key sub-indexes for both factory output and new orders extended their growth in February, with firms often noting solid underlying demand conditions and the positive impact of new product releases.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">The robust overseas demand helped drive the fastest pace of growth in new export orders in eight years.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">The services sector also maintained its robust performance, with the flash Japan services PMI rising to 53.8 from 53.7 in January. This expansion was the quickest since May 2024.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">The broadly upbeat results of the survey should provide encouragement to Ms Takaichi, who took her Liberal Democratic Party to a sweeping election victory on Feb 8 on the back of promises to revitalise the economy and address cost-of-living pressures.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">The flash Japan composite PMI, which combines both manufacturing and services activity, increased to 53.8 in February from 53.1 in January, marking the fastest pace of growth since May 2023.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">“Improved demand conditions also shifted some pricing power back to firms amid marked cost pressures,” Ms Fiddes said.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Indeed, a rise in input costs prompted companies to increase selling prices at the quickest rate since May 2024.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Looking ahead, Japanese firms expressed increased optimism about future business activity, with sentiment reaching a 15-month high.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Companies are banking on continued strong demand for semiconductors and AI-related technology, while some firms were upbeat about the outlook following the election win by Ms Takaichi’s ruling coalition. REUT</p></div>",
            "link": "https://www.straitstimes.com/business/economy/japans-factory-activity-expands-at-fastest-pace-in-four-years-pmi-shows",
            "pub_date": "2026-02-20 09:29:45",
            "source": "straitstimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US trade deficit in goods widens to new record in 2025 despite Trump tariffs",
            "description": "<div class=\"storyline-wrapper default\"><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\"><span class=\"uppercase\">Washington – </span>The US trade deficit in goods expanded to a new record in 2025, government data showed on Feb 19, despite sweeping tariffs that President Donald Trump imposed during his first year back in the White House.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">The US goods deficit stood at US$1.24 trillion (S$1.57 trillion) for all of 2025, widening slightly from 2024‘s level to its biggest in Commerce Department figures dating back to 1960.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">But the trade gap in goods with China narrowed for the year, as US imports from the world’s second-biggest economy dropped by 30 per cent.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">When both goods and services were considered, the overall US trade deficit for 2025 narrowed to US$901.5 billion, from US$903.5 billion in 2024.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">This was still the third-widest deficit on record.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">In the month of December, the overall deficit grew more than expected by 32.6 per cent to US$70.3 billion, as exports fell and imports climbed.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Trade flows involving the world’s biggest economy were heavily swayed in 2025 as Mr Trump slapped fresh tariffs on goods from virtually all trading partners after returning to the presidency, as part of a push to reduce the US trade gap.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">His moves brought the average effective tariff rate to its highest since the 1930s.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\"><b>AI, front-loading</b></p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Chad Bown of the Peterson Institute for International Economics told reporters on Feb 19 that the uptick in imports was likely due in part to the United States’ artificial intelligence build-out.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">This covers high-tech goods like advanced semiconductors, primarily manufactured in Taiwan, that eventually go towards data centres.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Another factor could be that Mr Trump’s waves of country-specific tariffs in 2025 contained significant exemptions, such as for electronic products like smartphones.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">The shift in trade flows with China came as Mr Trump engaged in tit-for-tat tariff escalations with Beijing in April. Tensions between both countries have since cooled.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">But overall import figures likely reflect changes in companies’ sourcing strategies, turning to countries like Vietnam for example, as the US-China relationship remained turbulent.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Meanwhile, “imports were a lot stronger at the beginning of the year than they were toward the end of the year,” Mr Bown said.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Some of this was probably due to companies “front-running to try to beat the tariffs” before they took effect, he added.</p><h2 class=\"font-header-lg-semibold\" data-testid=\"article-subhead-test-id\">‘Roller-coaster ride’</h2><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">“Trade took a roller-coaster ride in 2025 as tariffs jolted flows, mostly on the import side,” said Nationwide financial market economist Oren Klachkin in a note.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">“But after all the tariff headlines and swings in the data, the trade deficit barely budged in 2025, decreasing only US$2.1 billion, or 0.2 per cent, on an annual basis,” he added.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Still, he noted significant moves under the surface.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">The trade deficit with China fell to its lowest since the early 2000s while gaps with Taiwan and Mexico reached a record high, he said.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">“With the peak tariff drag now likely behind us, we expect trade to settle into a more predictable rhythm,” said Mr Klachkin.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Mr Trump has been quick to attribute US economic growth and other achievements to his sweeping tariffs, saying on social media in January that they have “rescued our economy and national security.”</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">But a New York Federal Reserve paper noted in February that nearly 90 per cent of the tariffs’ economic burden fell on US firms and consumers.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">This underscores the Trump administration’s challenges ahead to convince American households of his economic record, as they grapple with affordability.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">In December, exports of industrial supplies including nonmonetary gold dropped, while imports in the same category rose for the month.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">US imports of capital goods like computer accessories and telecommunications equipment picked up in the month. AFP</p></div>",
            "link": "https://www.straitstimes.com/business/economy/us-trade-deficit-in-goods-widens-to-new-record-in-2025-despite-trump-tariffs",
            "pub_date": "2026-02-20 08:51:52",
            "source": "straitstimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Foreigners rebuff ‘Sell America’ and buy a net $2 trillion in assets in 2025",
            "description": "<div class=\"storyline-wrapper default\"><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">NEW YORK - Foreign purchases of US financial assets accelerated in 2025, led by demand for stocks and US Treasuries, marking a sharp rebuttal of the “Sell America” narrative that’s become a regular feature of discussion among market participants.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Overseas investors bought a net US$1.55 trillion (S$2 trillion) of long-term US financial assets in 2025, data released by the Treasury Department on Feb 18 showed. That’s up from a net US$1.18 trillion of purchases in 2024. Of that total, US$658.5 billion went into equities and US$442.7 billion to Treasury notes and bonds.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">President Donald Trump’s regular threats of steep tariff hikes – deployed for reasons ranging from economic to geopolitical to national security – have triggered concerns that investors abroad will abandon American markets and the US dollar. Amid Mr Trump’s pressure on Denmark over its island of Greenland, a Danish pension fund warned in January it was planning to exit its Treasuries position. Dutch fund Stichting Pensioenfonds ABP, Europe’s biggest, dramatically scaled back its exposure in 2025.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">But Treasury Secretary Scott Bessent has regularly pushed back against the “sell America” rhetoric, arguing that the administration’s economic policies enhance the US’s position as the top destination for global capital.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">“Yes, there has been geopolitical instability as of late, and the sell-the-dollar trade has been popular as a result,” said Andrew Hazlett, a foreign-exchange trader at Monex. But ultimately Treasuries make up a large share of sovereign debt holdings, he noted. “I don’t really see a world where that changes.”</p><h2 class=\"font-header-lg-semibold\" data-testid=\"article-subhead-test-id\">US dollar role</h2><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">US dollar depreciation in 2025 might have even encouraged some overseas managers to load up on US securities. Geoff Yu, senior macro strategist at BNY – one of the world’s largest custodians – said earlier in February that was what happened after the market gyrations spurred by<a aria-label=\"link\" class=\"gap-x-04 items-center inline text-primary-60 select-auto\" data-testid=\"custom-link\" href=\"https://www.straitstimes.com/world/timeline-how-trumps-tariffs-have-upended-the-global-economy?ref=inline-article\" rel=\"nofollow noopener\" target=\"_blank\"><p class=\"font-body-baseline-regular inline\" data-testid=\"paragraph-test-id\"> Trump’s “Liberation Day” tariff announcement last April.</p></a></p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">“Our data show that cross-border investors took full advantage of the adjustment in dollar valuation to add to US equity exposure,” Mr Yu wrote in a note last week. “Although allocations are not as strong as during the ‘US exceptionalism’ period from 2023 to 2024, the cross-border ‘premium’ remains intact.”</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">The Treasury’s figures suggest many overseas managers were willing to add to positions in the US in 2025. Besides stocks and Treasuries, net purchases of corporate bonds totaled US$327.8 billion last year. Securities issued by Fannie Mae, Freddie Mac and other so-called agencies amounted to a net US$112.9 billion.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">On a regional basis, Europe accounted for US$872.8 billion of the net influx of money to long-term financial assets – defined as over one year. The Cayman Islands purchased a net US$277.2 billion while Japan bought a net US$56 billion. Canada totalled US$84.4 billion. </p><h2 class=\"font-header-lg-semibold\" data-testid=\"article-subhead-test-id\">China sells</h2><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">The Treasury cautions that it can be challenging to identify the ultimate origin of ownership, however. A number of the biggest net purchases came from locations known for their tax advantages, such as the Cayman Islands and Guernsey, and for their custodial roles in global finance, including the UK and Belgium.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">China was a notable net seller of US long-term financial assets, in the amount of US$208.6 billion. Its holdings of Treasuries ended the year at US$683.5 billion, the lowest level since 2008.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Chinese holdings may come under extra scrutiny after a Bloomberg report earlier in February showed that Beijing’s regulators had advised financial institutions to rein in their holdings of US Treasuries, citing concerns over concentration risks and market volatility.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">For the month of December alone, foreign holdings of Treasuries dropped by US$88.4 billion, to US$9.27 trillion – the lowest level since October. Japan, the largest overseas owner of US government debt, saw its position decline by US$17.2 billion, to US$1.19 trillion. UK holdings fell US$23 billion, to US$866 billion. BLOOMBERG</p></div>",
            "link": "https://www.straitstimes.com/business/economy/foreigners-rebuff-sell-america-and-buy-a-net-2-trillion-in-assets-in-2025",
            "pub_date": "2026-02-19 12:04:19",
            "source": "straitstimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "IMF warns China’s economic policies causing waste at home, damage abroad",
            "description": "<div class=\"storyline-wrapper default\"><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">BEIJING - The International Monetary Fund faulted China’s economic policies for causing waste at home and damage abroad and called for a reorientation by Beijing to embrace a model based on domestic consumer spending.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">“Transitioning to a consumption-led growth model should be the overarching priority,” the IMF’s executive directors said in a statement on Feb 18, released alongside its annual review of China’s economy.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">In that review, IMF staff highlighted China’s large current-account surplus, which has featured “adverse spillovers to trading partners.” Some of that excess stems from exports getting a boost from “real depreciation of the RMB,” the fund said, referring to the inflation-adjusted weakening of the renminbi, also known as the yuan.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Some of the IMF’s language matched long-standing criticisms of the United States – across multiple administrations – and other developed nations. Its spillover warning also echoed a November assessment by Goldman Sachs economists, who said China’s expanding export capacity meant a net negative for the rest of the global economy.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">China’s representative on the IMF’s executive board, Zhang Zhengxin, took issue with the criticism, saying in a separate statement that China’s 2025 export growth “was primarily driven by its competitiveness and innovation capacity,” along with front-loading caused by Washington’s trade policy.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">The executive board as a whole, however, called for a major shift in China’s policy framework, making its argument just weeks before the annual gathering of the nation’s National People’s Congress – where specific economic targets will be released for 2026. The release also came amid China’s weeklong Lunar New Year holiday.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">“Reorienting China’s growth model requires significant cultural and economic policy transformation,” the IMF directors said. They “called for a comprehensive and more forceful response that combines increased macroeconomic policy support with structural reforms.”</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Along with “more expansionary” measures including fiscal stimulus, the directors said that central government funding to deal with the overhang of unfinished properties in China’s crippled property market “would rebuild consumer confidence.”</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">After gross domestic product (GDP) growth of 5 per cent in 2025 – a figure that met Beijing’s official target – the IMF sees the expansion slowing to 4.5 per cent in 2026. Many economists anticipate China will in March set its 2026 growth target in a 4.5 per cent to 5 per cent range.</p><h2 class=\"font-header-lg-semibold\" data-testid=\"article-subhead-test-id\">Spotlighting ‘imbalances’</h2><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">The IMF’s annual report used the term “external imbalances” more than 10 times, compared with no such mentions in the 2024 edition. The fund estimated China’s current account surplus at 3.3 per cent of GDP for 2025 – more than double the 1.5 per cent it had projected in its 2024 annual report. Mr Zhang said the fund’s figure “appeared excessively large.”</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Even so, according to Bloomberg calculations based on preliminary data released last week, the surplus hit 3.7 per cent of GDP in 2025, driven by the record US$1.2 trillion (S$1.5 trillion) excess of exported goods over imported ones. Goldman economists have projected China’s surplus to reach almost 1 per cent of global GDP within as few as three years, the biggest “of any country in recorded history.”</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">The fund forecasts the surplus will narrow over the medium term, to 2.2 per cent of China’s GDP in 2030 – still well above an estimated “norm” of 0.9 per cent. </p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">The IMF suggested that a weaker yuan, measured in trade-weighted, inflation adjusted terms, had given Chinese goods an advantage overseas, while imports languished amid subdued domestic demand. Staff estimated the yuan was around 16 per cent undervalued, with its range stretching from 12.1 per cent to 20.7 per cent.</p><h2 class=\"font-header-lg-semibold\" data-testid=\"article-subhead-test-id\">Policy waste</h2><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">IMF executive directors called for “greater exchange rate flexibility.” China’s Mr Zhang said Beijing’s currency policy is “clear and consistent,” relying on market forces to play “a decisive role.”</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">China also took issue with IMF staff estimates of the scale and wastefulness of Beijing’s industrial policies. </p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">The fund calculated that the fiscal cost of government measures for priority sectors amounted to about 4 per cent of GDP as of 2023. While “international comparison is difficult,” the fund noted that European Union state aid in 2022 was less than half that figure, at about 1.5 per cent.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Staff said that scaling back “unwarranted” industrial policy measures by about 2 per cent of GDP over the medium term would boost productivity, reduce mis-allocation of resources and cut fiscal costs.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">The fund highlighted that almost a third of growth in 2025 was from net exports. That reliance has “triggered overcapacity concerns, which ultimately can motivate trade actions from partners and put China’s exports at risk,” the report said.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">The IMF also expressed serious concern about the continued drop in prices in China and its damage to the economy, with the words “deflation” or “deflationary” appearing more than 60 times in the report.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">“Empirical evidence suggests that deflationary pressures are in part related to the demand slump, including from the protracted property sector correction,” the IMF said, also highlighting large local government debt loads that limit their ability to stimulate demand.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">The fund estimated government debt continued to soar in 2025, totaling almost 127 per cent of GDP – an increase of about 10 percentage points from 2024. That’s forecast to climb to more than 135 per cent in 2026 and continue rising through 2034. BLOOMBERG</p></div>",
            "link": "https://www.straitstimes.com/business/economy/imf-warns-chinas-economic-policies-causing-waste-at-home-damage-abroad",
            "pub_date": "2026-02-19 07:59:14",
            "source": "straitstimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US Fed minutes show surprise shift as several officials ponder rate hike",
            "description": "<div class=\"storyline-wrapper default\"><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">WASHINGTON - US Federal Reserve officials appeared surprisingly wary of cutting interest rates when they met in January, with several even suggesting the central bank may need to raise rates if inflation remains stubbornly high.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">While the minutes of the central bank’s Jan 27-28 policy meeting, released on Feb 18, fell far short of suggesting most officials were contemplating the possibility of rate increases, they made clear the Fed is shifting further away from agreeing on another cut. </p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">That could put it on a collision course with US President Donald Trump and complicates the task of his nominee for Fed chair, Kevin Warsh. </p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Mr Trump has repeatedly said he wants the next Fed chief to deliver lower interest rates, and on Jan 30, two days after this policy meeting, he announced he would nominate Mr Warsh, a former Fed governor, to take over when Jerome Powell’s tenure as chair ends in May.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">“The minutes carry a distinctly more hawkish tilt,” Gregory Daco, chief economist at EY-Parthenon, wrote in a note to clients. “This sets up an interesting dynamic if and when Kevin Warsh is confirmed as Fed chair.”</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">The minutes showed most of the Federal Open Market Committee (FOMC) believed 2025’s labour market weakness, which prompted the central bank to lower rates three times in late 2025, was fading by late January.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">“The vast majority of participants judged that downside risks to employment had moderated in recent months while the risk of more persistent inflation remained,” the minutes said. </p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">That was before the release of a strong January employment report. Moreover, one group of policymakers at the meeting was embracing a view even more hostile to additional rate cuts.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">“Several participants cautioned that easing policy further in the context of elevated inflation readings could be misinterpreted as implying diminished policymaker commitment to the 2 per cent inflation objective,” the record showed.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Still, another group of “several officials” remained open to more rate cuts if inflation declined as they expected, though most said inflation progress could be slower than generally forecast.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">The FOMC voted 10-2 at its January meeting to hold the benchmark federal funds rate in a range of 3.5 per cent-3.75 per cent. Governors Christopher Waller and Stephen Miran dissented in favour of a quarter-point reduction. Officials dropped language pointing to increased downside risks to employment that had appeared in the three previous statements.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\"><b>Better data</b></p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Numbers published since the Fed’s January meeting have signalled accelerating growth, slowing inflation and a stabilising labour market. The consumer price index rose modestly in January, restrained by lower energy costs, according to Bureau of Labor Statistics. An underlying metric known as core CPI, which excludes food and energy, advanced as expected from a month earlier.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Payrolls rose in January by the most in more than a year and the unemployment rate unexpectedly fell, suggesting the labour market continued to stabilise at the start of 2026. Employers added 130,000 jobs and the unemployment rate declined to 4.3 per cent, according to BLS data.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Since the January meeting, several Fed policymakers have maintained that an overall stable US economy provides them room to be patient in considering additional rate adjustments. President Trump and other administration officials continue to call for the Fed to lower rates immediately.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Traders this year have eased back their expectations for when officials might next lower rates, though Fed funds futures contracts still suggest a cut is likely by June. BLOOMBERG</p></div>",
            "link": "https://www.straitstimes.com/business/economy/us-fed-minutes-show-surprise-shift-as-several-officials-ponder-rate-hike",
            "pub_date": "2026-02-19 07:26:45",
            "source": "straitstimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Japan's exports mark biggest jump in 3 years on pre-Chinese New Year shipments",
            "description": "<div class=\"storyline-wrapper default\"><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">TOKYO - Japan’s exports posted the biggest jump in more than three years in January, data showed on Feb 18, boosted by strong Asian demand reflecting front-loading shipments ahead of China’s Lunar New Year holidays. </p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">The outcome follows separate data this week that showed the economy limped back to meagre growth in the fourth quarter, significantly missing market forecasts due to weaker-than-expected exports and capital expenditure.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Total exports by value rose 16.8 per cent year on year in January, the largest increase since November 2022 and exceeding a median market forecast for a 12 per cent increase. They rose for a fifth consecutive month, following a 5.1 per cent rise in December.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Exports to China jumped 32 per cent, boosted by a surge in demand ahead of the Lunar New Year in mid-February, later than usual, while those to Asia rose 25.8 per cent. The European Union-bound exports expanded 29.6 per cent.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">In contrast, exports to the United States fell 5 per cent in January from a year earlier.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Takeshi Minami, chief economist at Norinchukin Research Institute, said the surge in January appeared largely due to temporary factors.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">“This probably means that February may see a pullback larger than anticipated. But if you average out January and February, the pace is likely to end up being about the same as at the end of last year,” he said.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Japan’s exports have been recovering after an initial blow from US tariffs dragged down US shipments in the July-September quarter, but momentum has remained fragile despite a September trade deal with Washington that set a baseline 15 per cent tariff on nearly all goods.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Imports dropped 2.5 per cent from a year earlier, compared with market forecasts for a 3 per cent increase.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">As a result, Japan ran a trade deficit of 1.15 trillion yen (S$9.5 billion) in January, compared with the forecast of a 2.14 trillion yen deficit.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Analysts expect the Japanese economy to gather momentum with the help of domestic drivers such as private consumption, with wage growth expected to ease the burden on households from rising living costs.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">“Although the impact of the Trump tariffs has largely run its course, they are still undoubtedly holding back global growth, so we shouldn’t expect strong momentum in exports,” Mr Minami said.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">“But the Japanese economy should be able to achieve modest growth if inflation wanes and consumers gradually get used to higher food prices and ease up on their frugality,” he added. REUTERS</p></div>",
            "link": "https://www.straitstimes.com/business/economy/japans-exports-mark-biggest-jump-in-3-years-on-pre-chinese-new-year-shipments",
            "pub_date": "2026-02-18 11:38:46",
            "source": "straitstimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Britain’s unemployment rate rises to five-year high of 5.2%",
            "description": "<div class=\"storyline-wrapper default\"><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">LONDON – Britain’s unemployment rate rose to a five-year high of 5.2 per cent in the final quarter of 2025, official data showed on Feb 17, as the country’s economy struggled to grow.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">It was a slight increase from the 5.1 per cent jobless rate seen in the three months to end-November, the Office for National Statistics (ONS) said.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">It was the highest level since January 2021, which coincided with the Covid-19 pandemic.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">“The number of workers on payroll fell further in the final quarter of the year, reflecting weak hiring activity,” ONS director of economic statistics Liz McKeown said in a statement.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Analysts said the data increased chances of the Bank of England cutting its benchmark interest rate in March, a forecast that weighed on the pound.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Official figures last week showed that Britain’s economy grew less than expected in the final quarter of 2025.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">“Continuing the recent trend, the UK labour market… is showing signs of creaking at a time when economic growth is difficult to come by,” said Mr Jonathan Raymond, an investment manager at Quilter Cheviot.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">The ONS added that wage growth slowed further in the fourth quarter, to 4.2 per cent, while overall British inflation is expected to retreat further in the coming months. AFP</p></div>",
            "link": "https://www.straitstimes.com/business/economy/britains-unemployment-rate-rises-to-five-year-high-of-5-2",
            "pub_date": "2026-02-17 16:40:50",
            "source": "straitstimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Winter economy emerges as poster child for China's stimulus tilt to services",
            "description": "<div class=\"storyline-wrapper default\"><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">CHONGLI, China - Luo Li’s ski resort north of Beijing is a rare post-pandemic success story that Chinese authorities want to replicate through state-led investments in various services sectors, in what is emerging as an important, albeit risky, policy shift in 2025.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">About two decades ago, when he opened the Wanlong complex in Chongli - some 200 kilometres outside the capital - he had more staff than customers. But China’s hosting of the 2022 Olympics brought new transport infrastructure to the area, encouraging seven more resorts to open.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Once China lifted Covid-19 restrictions in early 2023, the crowds started to come and Wanlong is now profitable for a second-straight year.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">“We created the demand,” said the 64-year-old, who employs 1,200 staff catering for Wanlong’s 600,000 visitors in 2026.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">“Agglomeration effects really matter. When I was the only ski resort here, it was very hard to attract people on my own.”</p><h2 class=\"font-header-lg-semibold\" data-testid=\"article-subhead-test-id\">Service sector shift</h2><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Beijing has been signalling a policy shift to focus on services in 2026 as it tries to redirect some stimulus from sometimes-wasteful investments on transport, housing and industrial infrastructure to potentially more productive areas.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">An added bonus could be that just like in Mr Luo’s case, once the facilities are in place and services become available, some latent household demand can be unlocked as well and help revive consumption - a longstanding structural weakness.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Soft consumer demand has hobbled the economy and Beijing’s measures so far haven’t turned it around. Per-capita services consumption was 46.1 per cent in 2025, well below the 70 per cent in the United States.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Its new services-focused policy carries risks. It is using the same old supply-side playbook, hoping the “build it and they will come” approach that fostered the rise of megacities like Shenzhen or the advanced industrial clusters across the country can also be applied to services.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Analysts caution that such a policy model can bring to the services sector the same ills of wasteful investment and overcapacity that taint China’s export-focused economy today.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">“Chongli’s experience highlights an important dynamic: when frictions are reduced and capacity constraints are alleviated, demand can respond strongly,” said Tommy Xie, OCBC Bank’s head of Asia macro research.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">But, he added, “China has no shortage of examples where overinvestment ... eventually resulted in underutilised or abandoned assets.”</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">In recent months, Chinese state media ran multiple articles about the booming “ice and snow” economy, spanning ski resorts, adjacent dining and accommodation facilities and winter sports equipment manufacturing, projecting it to grow to 1.5 trillion yuan (S$274 billion) in 2030 from one trillion yuan in 2025.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Local authorities have unveiled investment plans in various services.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Jilin and Hebei in the north plan to expand winter sports facilities; subtropical Henan pushes the “night-time economy” of bars, clubs and concerts; Hainan island promotes yachting and medical tourism; wealthier Beijing goes for education, health, elderly and child care.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">None gave figures, but the theme is expected to feature prominently in the policy documents China releases at its annual parliament meeting starting on March 5.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">In all these services, China currently faces supply shortages, analysts say, while urging caution.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">“China’s boom in winter sports is a useful example highlighting how expanded infrastructure can unleash demand for services that hitherto lay dormant,” said Fred Neumann, chief Asia economist at HSBC.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">“The risk, however, is that overincentivising supply can also lead to excess capacity, with demand ultimately unable to meet the expectations.”</p><h2 class=\"font-header-lg-semibold\" data-testid=\"article-subhead-test-id\">Chongli as boomtown</h2><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Chongli’s economic growth averaged 6.5 per cent annually in the past five years, outpacing national figures.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Before its boom, Chongli was largely agrarian, producing oats, and “not even doing well at that,” said Mr Luo. Now its streets are bustling with tourists, while winter gear shops and roasted lamb restaurants are thriving.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Student Yan Jingyi, 23, boasts about earning over 10,000 yuan monthly as a ski instructor - surpassing entry-level salaries in almost any industry in China. Taxi driver Ren Bing earns 9,000 yuan, about a third more than he made previously as a truck driver in Beijing.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">But there are also signs that growth risks stalling if Beijing’s focus on the service sector isn’t complemented by other policies that accelerate income growth, which has been lagging the economy for years.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">The hashtag “poor people skiing” has become popular on Chinese social media, with users sharing tips on where to buy second-hand skis and snowboards or the best unbranded winter clothing.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Collinder Chen, 32, who works in the cultural sector in the southern city of Guangzhou, earns little more than a Chongli ski instructor, and tried to limit her spending on a recent five-day trip to 6,000 yuan in total.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">“Skiing as a regular sport is definitely quite expensive,” said Ms Chen. “But as a single trip it’s still okay.”</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Some analysts say China might be better off if the state sector stepped back instead of deepening its presence.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Regulatory crackdowns in recent years and state firms’ dominance in some key industries have dented business sentiment and turned away foreign investors.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">“If the investment climate is right, the government doesn’t need to get overly involved in expanding supply. It can and should leave that to the private sector,” said Louis Kuijs, chief Asia economist at S&amp;P Global Ratings. REUTERS</p></div>",
            "link": "https://www.straitstimes.com/business/economy/winter-economy-emerges-as-poster-child-for-chinas-stimulus-tilt-to-services",
            "pub_date": "2026-02-16 09:51:38",
            "source": "straitstimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Japan’s economy barely grew in Q4, missing forecasts, as Takaichi eyes more spending",
            "description": "<div class=\"storyline-wrapper default\"><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">TOKYO - Japan’s economy eked out growth in the fourth quarter of 2025, reversing from a deep contraction in the previous period, underscoring the case for Prime Minister Sanae Takaichi’s proactive spending policies following her historic election triumph.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Japan’s real gross domestic product grew 0.2 per cent on an annualized basis in the three months through December, according to a Cabinet Office report on Feb 16. That was weaker than economists’ median estimate of 1.6 per cent growth.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Economists project the world’s fourth-largest economy would continue to expand at a gradual pace in coming months.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">A survey this month by the Japan Center for Economic Research showed 38 economists forecast an average annualised growth of 1.04 per cent in the first quarter and 1.12 per cent in the second quarter this year.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Private consumption, which accounts for more than half of economic output, rose 0.1 per cent in October-December, matching market estimates.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">It cooled from the 0.4 per cent rise in the previous quarter, indicating that persistently high food costs remain a drag on household spending.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Capital spending, a key driver of private demand-led growth, rose 0.2 per cent in the fourth quarter, versus a rise of 0.8 per cent in the Reuters poll.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Net external demand, or exports minus imports, contributed nothing to growth, versus a 0.3 point drag in the July-September period.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Exports posted a milder drop after the United States formalised a baseline 15 per cent tariff on nearly all Japanese imports, down from 27.5 per cent on autos and initially threatened 25 per cent on most other goods. </p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">The report may add momentum to Ms Takaichi’s push to support growth with government spending and targeted investments. Earlier in February, she led her Liberal Democratic Party to the biggest post-war victory for a single-party in a general election, securing a mandate to push her expansionist policies.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">The scale of her election victory quieted concerns preceding the vote that passage of the regular budget for the fiscal year starting in April might be delayed. With the LDP having garnered two-thirds of the powerful lower house, smooth passage of the budget is virtually assured.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Ms Takaichi plans to expedite discussions on whether to temporarily suspend the sales tax on food and has said she’ll cover the lost revenue without relying on deficit-covering government bonds. BLOOMBERG, REUTERS</p></div>",
            "link": "https://www.straitstimes.com/business/economy/japans-economy-barely-grew-in-q4-missing-forecasts-as-takaichi-eyes-more-spending",
            "pub_date": "2026-02-16 09:20:58",
            "source": "straitstimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Singapore key exports rose 9.3% in January with electronics fuelled by AI demand",
            "description": "<div class=\"storyline-wrapper default\"><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">SINGAPORE - Singapore’s key exports saw further gains in January as electronics shipments surged on strong artificial intelligence-related demand.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Non-oil domestic exports (NODX) expanded 9.3 per cent, extending from the 6.1 per cent increase in December 2025, though falling short of the 13.5 per cent forecast by analysts in a Bloomberg poll.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Electronics exports jumped 56.1 per cent from a low base a year ago, as the Chinese New Year period fell on January 2025. Electronic NODX stood at $3.1 billion that month, below the 2025 monthly average</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Integrated circuits (ICs) exports expanded the most at 80.5 per cent, while disk media products and PC exports rose 70.2 per cent and 24 per cent respectively.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Meanwhile, non-electronics exports saw declines across specialised machinery, food preparations and petrochemicals.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">In terms of markets, exports to China, Hong Kong and Europe rose the most compared to a year ago, while Indonesia and the US contracted.</p></div>",
            "link": "https://www.straitstimes.com/business/economy/singapore-key-exports-rose-9-3-in-january-with-electronics-fuelled-by-ai-demand",
            "pub_date": "2026-02-16 08:35:59",
            "source": "straitstimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Americans are paying the bill for tariffs, despite Trump’s claims",
            "description": "<div class=\"storyline-wrapper default\"><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">US President Donald Trump has frequently claimed that foreign countries were paying for his tariffs, not Americans. But as economists predicted, that is largely turning out not to be the case.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Research published on Feb 12 by economists at the Federal Reserve Bank of New York and Columbia University suggests that, through November 2025, 90 per cent of the economic burden of the President’s tariffs fell on US companies and consumers.</p></div>",
            "link": "https://www.straitstimes.com/business/economy/americans-are-paying-the-bill-for-tariffs-despite-trumps-claims",
            "pub_date": "2026-02-14 09:01:33",
            "source": "straitstimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Malaysia's economy beats forecasts with 5.2% growth in 2025, fastest pace in 3 years",
            "description": "<div class=\"storyline-wrapper default\"><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">KUALA LUMPUR - Malaysia’s economy expanded at its fastest pace in three years in 2025, surpassing expectations as strong domestic demand, exports and investment propelled growth, with momentum likely to continue this year, the central bank said on Feb 13. </p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Full-year 2025 economic growth reached 5.2 per cent, a notch above the 5.1 per cent expansion in 2024 and exceeding official projections of between 4 per cent and 4.8 per cent growth.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">It is Malaysia’s highest growth rate since the 9 per cent achieved in 2022, government and central bank data showed. </p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">The economy expanded 6.3 per cent in the fourth quarter of 2025 compared to a year earlier, its fastest pace in twelve quarters, also exceeding expectations. Third-quarter growth was revised upwards to 5.4 per cent from 5.2 per cent.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Economists surveyed by Reuters and advance estimates released by the government had forecast that year-on-year growth would come in at 5.7 per cent in the October to December period.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">On a quarter-on-quarter seasonally-adjusted basis, the economy grew 0.8 per cent from October to December of 2025, compared to 2.7 per cent in the preceding three months.</p><h2 class=\"font-header-lg-semibold\" data-testid=\"article-subhead-test-id\">Growth momentum to continue</h2><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">The central bank said household spending will benefit from employment, wage growth and government policies in 2026, while investment activity and exports will remain robust.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">“This growth momentum is expected to continue in 2026, supported by resilient domestic demand and exports,” Bank Negara Malaysia governor Abdul Rasheed Ghaffour said in a statement.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">The government and central bank expect the economy to grow between 4 per cent and 4.5 per cent in 2026, amid persisting uncertainties about the impact of US tariffs. Malaysia faces a 19 per cent levy on goods exported to the United States. </p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\"> In a Reuters poll, Malaysia’s economy is projected to grow 4.5 per cent in 2026, at the upper end of the government’s forecast range. Meanwhile, its central bank is also expected to keep its benchmark interest rate on hold in 2026, with some economists expecting the next possible move to be a hike not a cut. Malaysia could raise its economic growth outlook for 2026, its second finance minister said earlier in February, following a string of recent positive signals.</p><h2 class=\"font-header-lg-semibold\" data-testid=\"article-subhead-test-id\">Ringgit</h2><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Headline and core inflation averaged 1.4 per cent and 2 per cent, respectively, in 2025, the central bank said, adding that the rate is expected to remain moderate in 2026.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">The central bank said while the ringgit will continue to be influenced by external factors, resilient domestic fundamentals and its efforts to encourage market flows are expected to provide support to the currency.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">The ringgit has gained about 17 per cent since the start of 2024, making it the best-performing Asian currency over the period. It is currently trading at its strongest levels in eight years against the US dollar. REUTERS</p></div>",
            "link": "https://www.straitstimes.com/business/economy/malaysias-economy-beats-forecasts-with-5-2-growth-in-2025-fastest-pace-in-3-years",
            "pub_date": "2026-02-13 14:31:34",
            "source": "straitstimes",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Traders cut odds of Fed rate cut in June after January jobs surprise",
            "description": "<div class=\"storyline-wrapper default\"><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">WASHINGTON – Unexpectedly US strong employment data for January reduces the chances the Federal Reserve will see a need to cut interest rates again by mid-2026.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Worries about rising unemployment that prompted three rate cuts at the end of 2025, before a pause in January, were likely eased by numbers out on Feb 11 showing <a aria-label=\"link\" class=\"gap-x-04 items-center inline text-primary-60 select-auto\" data-testid=\"custom-link\" href=\"/business/economy/us-job-growth-accelerates-in-january-unemployment-rate-falls-to-4-3?ref=inline-article\" rel=\"noopener\" target=\"_blank\"><p class=\"font-body-baseline-regular inline\" data-testid=\"paragraph-test-id\">130,000 jobs were added last month</p></a>, and unemployment fell to 4.3 per cent.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Fed officials at January’s policy meeting had already cited signs of stabilisation as a reason to hold rates steady. The report on Jan 11 prompted traders to cut the odds of a rate cut at the June meeting – previously eyed as the most likely timing of the next reduction – to under 50 per cent.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Economists cautioned that the upbeat January numbers could yet be revised lower, and that hiring continues to be dominated by a handful of sectors, primarily health care. Revisions to 2025 data showed job gains averaged just 15,000 a month, down from the initially reported 49,000 pace.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Yet the bounce in January will calm fears that unemployment was set to keep climbing amid worries over the impact of artificial intelligence and widespread concerns that companies were putting hiring plans on hold, said Stephen Stanley, chief US economist at Santander US Capital Markets.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Kansas City Fed president Jeff Schmid, speaking on Feb 11, said the central bank needs to keep rates at restrictive levels to continue putting downward pressure on inflation, and added he’s not seeing many indications of restraint in the economic data.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">US President Donald Trump continued calling for more rate cuts. In a social media post after the jobs data was released, he hailed the “GREAT JOBS NUMBERS” and said the United States should be paying the lowest interest rates globally.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Mr Trump’s National Economic Council director, Kevin Hassett, told the Fox Business Network there is “plenty of room for the Fed to cut rates,” citing a big supply shock from AI that will boost growth without creating inflation.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Kevin Warsh, whom Trump has said he will nominate to take over as Fed chair after Jerome Powell’s term ends in May, has echoed those views.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">Fed watchers cautioned that it’s too soon to make calls on where the economy will be by June – when Mr Warsh would chair his first policy meeting, if he is confirmed by then. </p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">For now, key indicators are suggesting a firming labour market and broader economy, none of which immediately lend themselves to Mr Warsh’s calls for lower rates, said Stephanie Roth, chief economist at Wolfe Research.</p><p class=\"font-body-baseline-regular text-primary\" data-testid=\"article-paragraph-annotation-test-id\">“It makes his job a little bit harder,” she said. BLOOMBERG</p></div>",
            "link": "https://www.straitstimes.com/business/economy/traders-cut-odds-of-fed-rate-cut-in-june-after-jnauary-jobs-surprise",
            "pub_date": "2026-02-12 11:12:24",
            "source": "straitstimes",
            "kind": 1,
            "language": "en"
        }
    ]
}