{
    "data": [
        {
            "title": "U.S. Brings Tough Demands to Iran Nuclear Talks -2-",
            "description": "<div class=\"mdc-article-body\">\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  0946 GMT - Zimbabwe's export restrictions on lithium will probably be more successful than the DRC's curbs on cobalt, at least in terms of encouraging local processing, says Freddie Brooks at BMI, a unit of Fitch Solutions. That's because of Zimbabwe's share of global lithium mine production, the commodities analyst says. At approximately 10%, Zimbabwe's share of production is high enough to make it difficult to replace in the lithium value chain, but not so high that export restrictions significantly inflate prices and trigger demand destruction downstream, as in the case of the DRC's 75% share of global cobalt mine production. \"In any case, processing facilities for lithium are already being built in Zimbabwe by Chinese companies, and lithium faces significantly lower substitution risks in the battery market compared to cobalt,\" Brooks says. (fabiana.negrinochoa@wsj.com) </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  -- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Eni Had a Strong End to the Year -- Market Talk </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  0938 GMT - Italian energy major Eni had a strong end to the year as net income beat consensus expectations by 25%, RBC Capital Markets analysts Biraj Borkhataria and Adnan Dhanani write. Quarterly production is also well ahead of market expectations, they add. While guidance is limited due to its upcoming capital markets day, Eni's capital spending outlook does look lower than anticipated, they say. This reflects the closure of an Indonesian joint venture by the middle of the year. Additionally, production looks set to continue growing, they add. Shares trade up 1.1% to 19.09 euros. (adam.whittaker@wsj.com) </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  -- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  European Gas Holds Around 30 Euros With U.S.-Iran in Focus -- Market Talk </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  0937 GMT - European natural-gas prices are hovering around 30 euros a megawatt-hour, supported by forecasts for milder weather and ample LNG supply. Still, gas storage across the European Union remains around 30% full--well below the five-year average of 47%--and is set to finish the heating season near or below 2022 levels, analysts say. The benchmark Dutch TTF contract is down 1.1% to 30.58 euros a megawatt hour. Investors are now closely watching U.S.-Iran talks as any escalation could threaten LNG flows through the Strait of Hormuz, though analysts consider this scenario unlikely. (giulia.petroni@wsj.com) </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  -- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  London's Miners Drop as Metal Prices Slide -- Market Talk </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  0928 GMT - London's miners trade down as metal prices drop. In morning trade, New York gold futures are down 0.62% to $5,192.20 a troy ounce. Silver futures slide nearly 4.25% to $87.12 an ounce while LME three-month copper futures are down 0.4% to $13,247 a metric ton. While gold slips, it remains up more than 3.5% over the week as uncertainty around U.S. trade policy and geopolitical tensions with Iran remain. Silver and gold miner Fresnillo drops nearly 4%, while Hochschild Mining is down 1.5%. Copper miner Antofagasta trades 2.85% lower. Diversified miner Anglo American is down around 2.5% and Glencore drops 1.8%. (adam.whittaker@wsj.com) </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  -- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Gold Slips but Remains Above $5,100 as Markets Focus on U.S.-Iran Talks -- Market Talk </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  0844 GMT - Gold prices slipped in early trading but remain above $5,100 a troy ounce as investors look ahead to U.S.-Iran talks later on Thursday. New York futures fall 0.7% to $5,191.60 an ounce, with gains tempered by concerns that U.S. interest rates could remain on hold for some time. Still, the metal is up more than 3.5% on the week, supported by renewed uncertainty around U.S. trade policy and geopolitical tensions with Iran. \"Any escalation in tensions involving Iran is likely to add further support and reinforce gold's role as a hedge against shocks,\" analysts at ING say. \"At the same time, the structural drivers behind gold's earlier rally remain firmly in place.\" (giulia.petroni@wsj.com) </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  -- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Brent Spreads Signal Well-Supplied Market </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  0857GMT - Price differences between near-term and later Brent crude contracts have weakened recently, suggesting the physical market is becoming increasingly well supplied. Kazakh oil exports through the Caspian Pipeline Consortium terminal are returning to normal after earlier disruptions. Meanwhile, floating storage is shrinking, suggesting that previously stranded, sanctioned barrels are now finding buyers, according to analysts at ING. \"If we are to see de-escalation between the U.S. and Iran, it should allow weaker fundamentals to feed through to a lower flat price-particularly if OPEC+ resumes supply increases from April, which we believe they will agree to this weekend,\" they say. (giulia.petroni@wsj.com) </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  -- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Oil Inches Higher Ahead of U.S.-Iran Talks </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  0830 GMT - Oil prices edge higher ahead of a third round of nuclear talks between the U.S. and Iran later on Thursday. In early trade, Brent crude is up 0.3% to $70.94 a barrel, while WTI rises 0.3% to $65.35 a barrel. \"A constructive resolution would likely prompt the market to gradually unwind as much as a $10/bbl risk premium, which we believe is currently priced in,\" analysts at ING say. \"If talks break down, the upside risk remains, but the market may hold off on a full reaction until the scale of potential U.S. action against Iran becomes clearer.\" Meanwhile, the latest EIA data showed U.S. crude oil inventories rose by 16 million barrels last week, the largest weekly build since February 2023. (giulia.petroni@wsj.com) </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  -- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Comex Gold Futures' Bullish Technical Setup Remains Intact, Chart Shows -- Market Talk </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  0621 GMT - Comex gold futures' bullish technical setup remains intact, RHB Retail Research's Joseph Chai says in a research report. The fresh bullish candlestick pattern on the daily chart suggests selling pressure has tapered, the analyst says. Since gold \"bulls have returned to the driver's seat,\" the precious metal could resume the bullish trajectory toward resistance at $5,500/oz, Chai says. A bullish breakout above this level would extend its uptrend toward $6,000/oz. Also, 20- and 50-day simple moving averages continue moving upward, lending support for bullish technical setup, the analyst adds. Spot gold is 0.6% higher at $5,196.37/oz. (ronnie.harui@wsj.com) </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  -- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Copper Edges Lower Amid Profit-Taking -- Market Talk </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  0238 GMT - Copper edges lower in early Asian trading, with the three-month LME copper contract 0.15% lower at $13302.00 a ton. Investors appear to be taking profit after the metal's price reached a two-month high. Buying in China has remained slow after the Lunar New Year holiday, as some investors have hesitated due to high prices, ANZ Research analysts say. Investors are closely watching the developments related to U.S. tariffs. (tracy.qu@wsj.com) </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  -- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Iron Ore Rises on Improved Sentiment From Policy Support -- Market Talk </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  0235 GMT - Iron ore rises in early Asian trade as sentiment improves on reports of new Chinese policy support, ANZ Research analysts say in a note. China's National Development and Reform Commission will reportedly receive new funding for urban renewal projects nationwide. Supply side are also supporting prices, as steelmakers in Northern China have been required to cut blast furnace output by 30% during the annual plenary sessions of the National People's Congress, which begin next Wednesday. \"This lifted steel prices, supporting higher margins for steel mills,\" ANZ adds. The most-traded contract on the Dalian Commodity Exchange is up 0.2% at CNY750.00 a ton.(jason.chau@wsj.com) </p>\n<pre class=\"mdc-article-pre\" data-v-370ea3ac=\"\"></pre>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Write to Barcelona Editors at barcelonaeditors@dowjones.com </p>\n<pre class=\"mdc-article-pre\" data-v-370ea3ac=\"\"></pre>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  (END) Dow Jones Newswires</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  February 26, 2026 10:47 ET (15:47 GMT)</p>\n\nCopyright (c) 2026 Dow Jones &amp; Company, Inc.</div>",
            "pub_date": "2026-02-27 00:00:42",
            "link": "https://www.morningstar.com/news/dow-jones/2026022611371/us-brings-tough-demands-to-iran-nuclear-talks-2",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "THE CORMORANT AT 55 SOUTH: SILVERSEA UNVEILS ALL PUBLIC SPACES OF HIGHLY ANTICIPATED SOUTHERNMOST HOTEL",
            "description": "<div class=\"mdc-article-body\">\n            \n              \n              THE CORMORANT AT 55 SOUTH: SILVERSEA UNVEILS ALL PUBLIC SPACES OF HIGHLY ANTICIPATED SOUTHERNMOST HOTEL\n              \n            \n            \n              <span>\n<h2 class=\"mdc-article-heading mdc-heading__mdc mdc-heading--level-5__mdc\" data-v-618d53ae=\"\">THE CORMORANT AT 55 SOUTH: SILVERSEA UNVEILS ALL PUBLIC SPACES OF HIGHLY ANTICIPATED SOUTHERNMOST HOTEL</h2>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">PR Newswire</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">MIAMI, Feb. 26, 2026</p>\n</span>\n<span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">The Cormorant will create the most convenient, comfortable, and seamless way to explore Antarctica</em></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span data-v-602de5d2=\"\">MIAMI</span>, <span data-v-602de5d2=\"\">Feb. 26, 2026</span> /PRNewswire/ -- Silversea, the leading experiential luxury and expedition travel brand, has unveiled the interior spaces of its new 150-room hotel, The Cormorant at 55 South, in Puerto Williams, Chile, designed to streamline travel to one of the world's most remote destinations, while enhancing the overall guest experience. Set to welcome guests in October 2026, The Cormorant at 55 South, named for its unique location and the resilient seabird, will serve as a cornerstone of Silversea's innovative <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4628319-1&amp;h=2945706006&amp;u=https%3A%2F%2Fwww.silversea.com%2Flp-antarctica-fly-cruise.html&amp;a=Antarctica+Fly+Cruise\" tabindex=\"0\">Antarctica Fly Cruise</a> program, offering some of the most diverse polar experiences in luxury travel.</p>\n<span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"> </p>\n</span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\"The Cormorant at 55 South represents an exciting new chapter for Silversea, extending our commitment to luxury travel to Antarctica,\" said Bert Hernandez, president, Silversea. \"This unique property will offer our guests the same hallmark comfort and personalized service they expect while on board our ships and will immerse them in the rich culture, traditions, and natural beauty of the region. The interior spaces are thoughtfully designed to reflect the spirit of this extraordinary destination.\"</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">FIVE SIGNATURE SPACES INSPIRED BY NATURE AND ADVENTURE</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">The Cormorant's public spaces are designed to foster relaxation, reflection and discovery, blending Silversea's signature elegance with the raw beauty of Patagonia. Cozy lounges, curated gathering areas, and panoramic views of the surrounding wilderness invite guests to pause and connect with the spirit of the far south.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">THE FIREPLACE LOUNGE</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Inspired by the region's reverence for fire as a symbol for gathering, hospitality, and storytelling, the fireplace lounge will serve as a place of retreat, with a variety of plush seating, fine wines, and signature cocktails. Sweeping vistas of the Patagonian landscape unfold from the lounge's expansive windows, as guests enjoy the comforting warmth of this one-of-a-kind fireplace.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">150 GUEST ROOMS </strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Each of The Cormorant's 150 guest rooms are thoughtfully appointed, inviting guests to recharge before or after their voyage. Rooms offer serene forest views or water vistas of the Beagle channel, bringing guests closer to the breathtaking natural beauty of Patagonia and immersing them in the landscapes that define this region. The interiors feature warm wood tones and earthy elements, creating an authentic and calming environment. To further this connection, every room will incorporate handcrafted items created by Chilean artisans, adding a unique touch that celebrates local and regional culture.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">LATITUDE 55</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">In addition to spaces honoring the nature of Puerto Williams, guests will enjoy a culinary experience rooted in Chilean flavors, with a dining venue that offers a warm, welcoming atmosphere and menus that celebrate the region's ingredients and traditions. At Latitude 55 – named for its location near the 55th parallel south – menus will celebrate Patagonia's rich flavors, blending regional staples with chef-inspired creations. In the evening, the restaurant turns into a family-style gathering that sparks stories of adventure and anticipation of the journey to come.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">BAR SUR</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Bar Sur will serve as the social heart of The Cormorant, offering teas and small bites by day and curated wines and spirits by night – all inspired by regional flavors. From wine tastings showcasing Patagonia's viticultural legacy to a guided tasting and hands-on cocktail masterclass of Chilean Pisco, a fragrant, high-proof grape brandy and Chile's most iconic spirit – every moment captures the essence of exploration.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">UNCHARTED</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">To commemorate their visit to the southernmost hotel on earth, guests can visit Uncharted, The Cormorant's boutique. Here, keepsakes crafted by Chilean artisans, and expedition essentials provide lasting mementos of an extraordinary journey.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">A NEW GATEWAY TO ANTARCTICA</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Silversea's pioneering Antarctica Fly Cruise itineraries – allowing guests to skip the Drake Passage – will include a hotel stay in Santiago, followed by a direct charter flight to Puerto Williams, where guests will enjoy a one-night stay at The Cormorant before continuing to King George Island for embarkation. Upon return, guests will again stay overnight at the hotel before flying back to Santiago.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Guests will also have the opportunity to explore the natural beauty of Puerto Williams through activities such as nature walks, hiking, kayaking, and wildlife watching, further enriching their expedition experience. The hotel will operate seasonally from October to March, with dedicated staff trained in The Silversea Way, which reflects Silversea's philosophy of personalized service, destination expertise, and thoughtful attention to guest needs, to ensure a consistent and exceptional level of service and hospitality.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">LEARN MORE IN THE LATEST EPISODE OF STORIES BY SILVERSEA </strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">In the latest episode of Stories by Silversea, the brand's leaders and project partners go behind the scenes, offering a closer look at the spaces taking shape at The Cormorant and the elevated experiences guests can expect. Watch the episode here: <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4628319-1&amp;h=1303837803&amp;u=https%3A%2F%2Fyoutu.be%2F_eQokB6-aik&amp;a=A+Legacy+in+the+Making%3A+Part+3.\" tabindex=\"0\">A Legacy in the Making: Part 3.</a></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">For more information on The Cormorant at 55 South and Silversea's Antarctica Fly Cruise program, visit: <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4628319-1&amp;h=3574870736&amp;u=https%3A%2F%2Fwww.silversea.com%2Flp-antarctica-fly-cruise.html&amp;a=https%3A%2F%2Fwww.silversea.com%2Flp-antarctica-fly-cruise.html\" tabindex=\"0\">https://www.silversea.com/lp-antarctica-fly-cruise.html</a></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Find additional assets in our digital press kit: <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4628319-1&amp;h=1729620963&amp;u=https%3A%2F%2Froyalcaribbeangrouppresscenter.com%2Fsilversea%2Fdpk%2Fcormorant&amp;a=https%3A%2F%2Froyalcaribbeangrouppresscenter.com%2Fsilversea%2Fdpk%2Fcormorant\" tabindex=\"0\">https://royalcaribbeangrouppresscenter.com/silversea/dpk/cormorant</a></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Cautionary Statement Concerning Forward-Looking Statements</strong><br data-v-602de5d2=\"\"/>Certain statements in this press release relating to, among other things, expectations on timing, design, and demand for the development of The Cormorant at 55 South, constitute forward-looking statements under the Private Securities Litigation Reform Act of 1995. Words such as \"set,\" \"anticipate,\" \"will,\" \"scheduled,\" and similar expressions are intended to help identify forward-looking statements. Forward-looking statements reflect management's current expectations, are based on judgments, are inherently uncertain and are subject to risks, uncertainties and other factors, which could cause our actual results, performance or achievements to differ materially from the future results, performance or achievements expressed or implied in those forward-looking statements. Examples of these risks, uncertainties and other factors include, but are not limited to, those included under the caption \"Risk Factors\" in our most recent annual report on Form 10-K, as well as our other filings with the SEC, copies of which may be obtained by visiting our Investor Relations website at <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4628319-1&amp;h=4229922689&amp;u=http%3A%2F%2Fwww.rclinvestor.com%2F&amp;a=www.rclinvestor.com\" tabindex=\"0\">www.rclinvestor.com</a> or the SEC's website at <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4628319-1&amp;h=1461729417&amp;u=http%3A%2F%2Fwww.sec.gov%2F&amp;a=www.sec.gov\" tabindex=\"0\">www.sec.gov</a>. Undue reliance should not be placed on the forward-looking statements in this release, which are based on information available to us on the date hereof. We undertake no obligation to publicly update or revise any forward-looking statements, whether as a result of new information, future events or otherwise.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">About Silversea <br data-v-479a2324=\"\"/></strong>Silversea is the leading experiential luxury and expedition travel brand, offering guests immersive experiences on all seven continents, personalized service, and an innovative culinary offering aboard its 12 intimate ocean and expedition ships. Silversea's itineraries encompass an unparalleled range of destinations worldwide, from the Mediterranean and the Caribbean to the Galápagos, both Polar Regions, and hundreds of fascinating places in between. Set to strengthen its destination leadership starting in 2026, the brand is developing the southernmost hotel on Earth, The Cormorant at 55 South, in Puerto Williams, Chile – offering guests a uniquely seamless journey to Antarctica. Silversea brings its like-minded guests closer to their destination in uncompromised comfort, championing the joy of travel, an enriching spirit of discovery, and an enduring commitment to Silversea's signature \"To Finding More\" promise. Silversea is owned and operated by global cruise company Royal Caribbean Group (NYSE: RCL). For more information, visit <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4628319-1&amp;h=699799231&amp;u=https%3A%2F%2Fwww.silversea.com%2F&amp;a=www.silversea.com\" tabindex=\"0\">www.silversea.com</a>. Media can stay up to date by visiting the brand's press center.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Silversea, Otium, S.A.L.T., The Cormorant at 55 South, To Finding More, and the various ship names are registered trademarks of Silversea Cruises Ltd.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">About Royal Caribbean Group <br data-v-479a2324=\"\"/></strong>Royal Caribbean Group (NYSE: RCL) is a vacation industry leader with a global fleet of 68 ships across its five brands traveling to all seven continents. With a mission to deliver the best vacations responsibly, Royal Caribbean Group serves millions of guests each year through its portfolio of best-in-class brands, including Royal Caribbean, Celebrity Cruises, and Silversea; and an expanding portfolio of land-based vacation experiences through Perfect Day at CocoCay and Royal Beach Club collection. The company also owns 50% of a joint venture that operates TUI Cruises and Hapag-Lloyd Cruises. With a rich history of innovating, Royal Caribbean Group continually delivers exciting new products and guest experiences that help shape the future of leisure travel. Learn more at <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4628319-1&amp;h=2193607434&amp;u=https%3A%2F%2Fwww.royalcaribbeangroup.com%2F&amp;a=royalcaribbeangroup.com\" tabindex=\"0\">royalcaribbeangroup.com</a> or <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4628319-1&amp;h=2713197219&amp;u=https%3A%2F%2Froyalcaribbeangrouppresscenter.com%2Fsilversea%2Fnews%2Frclinvestor.com&amp;a=rclinvestor.com\" tabindex=\"0\">rclinvestor.com</a>.</p>\n<span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://mma.prnewswire.com/media/2921323/Silversea_Cruises_The_Cormorant_at_55_South.html\" tabindex=\"0\">\n<span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img\" data-v-f0ef0696=\"\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://mma.prnewswire.com/media/2921323/Silversea_Cruises_The_Cormorant_at_55_South.jpg\"/></picture></span>\n</a>\n</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://mma.prnewswire.com/media/2921324/Silversea_Cruises_The_Cormorant_at_55_South_Bar_Sur.html\" tabindex=\"0\">\n<span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img\" data-v-f0ef0696=\"\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://mma.prnewswire.com/media/2921324/Silversea_Cruises_The_Cormorant_at_55_South_Bar_Sur.jpg\"/></picture></span>\n</a>\n</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://mma.prnewswire.com/media/2921325/Silversea_Cruises_The_Cormorant_at_55_South_Bedroom.html\" tabindex=\"0\">\n<span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img\" data-v-f0ef0696=\"\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://mma.prnewswire.com/media/2921325/Silversea_Cruises_The_Cormorant_at_55_South_Bedroom.jpg\"/></picture></span>\n</a>\n</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://mma.prnewswire.com/media/2921326/Silversea_Cruises_The_Cormorant_at_55_South_Fireplace_Lounge.html\" tabindex=\"0\">\n<span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img\" data-v-f0ef0696=\"\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://mma.prnewswire.com/media/2921326/Silversea_Cruises_The_Cormorant_at_55_South_Fireplace_Lounge.jpg\"/></picture></span>\n</a>\n</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://mma.prnewswire.com/media/2921327/Silversea_Cruises_The_Cormorant_at_55_South_Latitude_55.html\" tabindex=\"0\">\n<span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img\" data-v-f0ef0696=\"\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://mma.prnewswire.com/media/2921327/Silversea_Cruises_The_Cormorant_at_55_South_Latitude_55.jpg\"/></picture></span>\n</a>\n</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://mma.prnewswire.com/media/2921328/Silversea_Cruises_The_Cormorant_at_55_South_MainLobby.html\" tabindex=\"0\">\n<span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img\" data-v-f0ef0696=\"\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://mma.prnewswire.com/media/2921328/Silversea_Cruises_The_Cormorant_at_55_South_MainLobby.jpg\"/></picture></span>\n</a>\n</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://mma.prnewswire.com/media/1488683/Silversea_Cruises_Logo.html\" tabindex=\"0\">\n<span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img\" data-v-f0ef0696=\"\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://mma.prnewswire.com/media/1488683/Silversea_Cruises_Logo.jpg\"/></picture></span>\n</a>\n</p>\n</span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img mdc-article-image__img--12-width\" data-v-f0ef0696=\"\" style=\"width:12px;\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://edge.prnewswire.com/c/img/favicon.png?sn=FL96752&amp;sd=2026-02-26\"/></picture></span> View original content to download multimedia:<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://www.prnewswire.com/news-releases/the-cormorant-at-55-south-silversea-unveils-all-public-spaces-of-highly-anticipated-southernmost-hotel-302698593.html\" tabindex=\"0\">https://www.prnewswire.com/news-releases/the-cormorant-at-55-south-silversea-unveils-all-public-spaces-of-highly-anticipated-southernmost-hotel-302698593.html</a></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">SOURCE Silversea Cruises</p></span>\n<span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img\" data-v-f0ef0696=\"\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://rt.prnewswire.com/rt.gif?NewsItemId=FL96752&amp;Transmission_Id=202602261049PR_NEWS_USPR_____FL96752&amp;DateId=20260226\"/></picture></span>\n</div>",
            "pub_date": "2026-02-27 00:00:41",
            "link": "https://www.morningstar.com/news/pr-newswire/20260226fl96752/the-cormorant-at-55-south-silversea-unveils-all-public-spaces-of-highly-anticipated-southernmost-hotel",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Knightscope Announces Over $2 Million in New and Recurring Contracts",
            "description": "<div class=\"mdc-article-body\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Knightscope Announces Over $2 Million in New and Recurring Contracts</strong>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fknightscope.com%2F&amp;esheet=54433878&amp;newsitemid=20260226885101&amp;lan=en-US&amp;anchor=Knightscope%2C+Inc.&amp;index=1&amp;md5=7c97cad44de160164d94a3aab14c70ad\" tabindex=\"0\">Knightscope, Inc.</a> (NASDAQ: KSCP), a security technology company building the Nation’s First Autonomous Security Force, today announced that it has surpassed another $2 million milestone in new sales and client renewals. Following similar success in prior months, this continued momentum underscores the growing national demand for Knightscope’s innovative, technology-driven solutions designed to enhance security infrastructure and modernize both public and private environments.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Emergency Communication Device (ECD) Growth Across Key Verticals</strong>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nKnightscope secured sales of 119 new Emergency Communication Devices (ECD) across multiple sectors, including consumer packaged goods, higher education, hospitality, local governments, and healthcare. These varying areas of new business growth reflect increasing confidence in Knightscope’s potentially life-saving communication technology and its critical role in bolstering emergency communications infrastructure nationwide.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nIn addition, maintenance services for hundreds of ECD units were renewed or extended among existing clients in the healthcare, higher education, and state and local government sectors. These ongoing commitments further validate the reliability and long-term value of Knightscope’s emergency communication systems and contribute meaningfully to Knightscope’s recurring revenue.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Autonomous Security Robot (ASR) Momentum and Renewals</strong>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nKnightscope also reported continued strength in its Autonomous Security Robots (ASRs), with 20 new ASR sales across residential, consumer goods, commercial real estate, and healthcare verticals. Notably, these new deployments include three RTX human-in-the-loop remote monitoring packages, reinforcing the market’s confidence in Knightscope’s intelligent patrol solutions for high-security environments.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nKnightscope additionally completed ASR renewals totaling 21 units, including 13 K1 Hemispheres, 5 K5 ASR, and 2 K1 Towers, with clients spanning megachurches, local governments, hospitals, logistics, auto retail, and commercial real estate deployment environments. These renewals reflect client satisfaction in the solution Knightscope’s Machine-as-a-Service (MaaS) platform provides.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Long-Term Client Partnerships Continue to Strengthen</strong>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nAmong the many renewals, Knightscope has highlighted its 9<span data-v-602de5d2=\"\">th</span> consecutive year renewal with one of the largest health systems in the US, along with a Fortune 500 entertainment company’s industrial site entering its 8<span data-v-602de5d2=\"\">th</span> year under contract, as some of the most notable. These enduring relationships demonstrate sustained value Knightscope delivers through its machines proven crime deterrence and prevention.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Building on Recurring Revenue Growth</strong>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nThis performance further solidifies Knightscope’s position as a national leader in autonomous physical security and emergency communications. Through its Machine-as-a-Service (MaaS) model, the Company continues to expand predictable revenue streams while delivering measurable impact through innovation, scalability, and client-valued outcomes.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">About Knightscope</strong>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nKnightscope is a security technology company building the Nation’s First Autonomous Security Force. The Company combines autonomous machines, advanced software, and human expertise to help protect people, property, and critical infrastructure. Knightscope’s long-term mission is to make the United States of America the safest country in the world. Learn more about us at <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.knightscope.com%2F&amp;esheet=54433878&amp;newsitemid=20260226885101&amp;lan=en-US&amp;anchor=www.knightscope.com&amp;index=2&amp;md5=64ca37d2fdb820634cbacdc49659dd29\" tabindex=\"0\">www.knightscope.com</a>.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Forward-Looking Statements</strong>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nThis press release contains \"forward-looking statements\" within the meaning of the Private Securities Litigation Reform Act of 1995. Such forward-looking statements can be identified by the use of words such as \"should,\" \"may,\" \"intends,\" \"anticipates,\" \"believes,\" \"estimates,\" \"projects,\" \"forecasts,\" \"expects,\" \"plans,\" \"proposes\" and similar expressions. Forward-looking statements contained in this press release and other communications include, but are not limited to, statements about the Company’s goals, profitability, growth, prospects, reduction of expenses, and outlook. Although Knightscope believes that the expectations reflected in these forward-looking statements are based on reasonable assumptions, there are a number of risks, uncertainties and other important factors that could cause actual results to differ materially from such forward-looking statements, including the factors discussed under the heading \"Risk Factors\" in Knightscope’s Annual Report on Form 10-K for the year ended December 31, 2024, as updated by its other filings with the Securities and Exchange Commission. Forward-looking statements speak only as of the date of the document in which they are contained, and Knightscope does not undertake any duty to update any forward-looking statements, except as may be required by law.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img\" data-v-f0ef0696=\"\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20260226885101r1&amp;sid=mstr3&amp;distro=nx&amp;lang=en\"/></picture></span><span data-v-602de5d2=\"\"></span></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\"><em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">Public Relations \n</em></strong><br data-v-602de5d2=\"\"/><em class=\"mdc-article-emphasis\" data-v-370fea16=\"\"><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"mailto:overwatch@knightscope.com\" tabindex=\"0\">overwatch@knightscope.com \n</a></em><br data-v-602de5d2=\"\"/><em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">Knightscope, Inc. \n</em><br data-v-602de5d2=\"\"/><strong class=\"mdc-article-strong\" data-v-479a2324=\"\"><em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">(650) 924-1025 ext. 6</em></strong>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span data-v-602de5d2=\"\">View source version on businesswire.com: </span><span data-v-602de5d2=\"\"><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://www.businesswire.com/news/home/20260226885101/en/\" tabindex=\"0\">https://www.businesswire.com/news/home/20260226885101/en/</a></span></p></div>",
            "pub_date": "2026-02-26 23:51:47",
            "link": "https://www.morningstar.com/news/business-wire/20260226885101/knightscope-announces-over-2-million-in-new-and-recurring-contracts",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Why Nvidia's stock is falling despite a historic earnings beat",
            "description": "<div class=\"mdc-article-body\">\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  By Britney Nguyen </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Blockbuster earnings were anticipated as Nvidia's big customers have already indicated how much they've hiked their spending on hardware </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Nvidia's stock fell after it reported a fiscal fourth-quarter earnings beat. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     When Nvidia earns $43 billion in a quarter, does it make a sound? </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Perhaps a whimper. Nvidia's stock (NVDA) is down more than 4% after Thursday's open, despite what Morgan Stanley's Joseph Moore said was a historic beat-and-raise performance for a chip company. Nvidia's revenue exceeded estimates by about $3 billion, and its guidance came in roughly $5 billion above what analysts had been modeling. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     That sort of beat might have been anticipated, as Nvidia's hyperscaler customers recently lifted their capital-expense forecasts, signaling a continued flood of spending on chips. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Moore said that while the muted stock reaction is surprising, the debates hanging over Nvidia's stock \"are longer term in nature.\" </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Despite the boosts to capital-expenditures forecasts, investors have been worried about the sustainability of artificial-intelligence spending, and Moore said hyperscalers' free-cash generation looks to be \"under significant pressure\" from all the investments so far. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     He's not so worried. Hyperscalers are asking for more compute power, he said. While the costs are a challenge, the demand is coming from a shift to inference, or running AI models, which eventually translates to revenue. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     The long term \"looks pretty good,\" Moore said in his Thursday note. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     See more: Nvidia's earnings report is just a prelude to what should really matter for investors </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     The bigger catalysts for Nvidia's stock may be Nvidia CEO Jensen Huang's upcoming keynote at Morgan Stanley's technology conference and the chip maker's annual GTC in March, according to Moore. Investors will be looking for more details on the company's product road map, including updates on its Vera Rubin chip platform and following Feynman architecture. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Bernstein analyst Stacy Rasgon said he isn't \"sure what else investors want to hear at this point,\" but buy-side expectations for Nvidia looking into 2027 seem \"very plausible\" as demand for its products shows \"zero signs of slowing.\" Specifically, he pointed to a buy-side view that $12 or more of earnings per share may be possible for Nvidia next calendar year. The FactSet consensus was for more like $10. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Meanwhile, Nvidia has also been swept up by concerns over rising memory prices due to supply shortages. Nvidia's chips need a lot of memory, though the heavy demand for memory has helped drive industry prices higher against a tight supply backdrop. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Nvidia's \"confident-but-conservative messaging on\" its 75% gross margin should be good news to investors, TD Cowen analyst Joshua Buchalter said in a Wednesday note. The company likely locked in its memory supply and pricing ahead of the supply crunch, he added. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Buchalter is a bit confounded by the sluggishness of Nvidia's stock recently, as software stocks have slumped. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     \"To highlight just one oddity - it's odd to us that software stocks seem to be pricing existential declines while the hardware infrastructure that would enable such a future outcome is pricing a rapid decline in demand,\" he wrote. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Don't miss: Why Nvidia is 'highly motivated' to keep investing in OpenAI </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     -Britney Nguyen </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     This content was created by MarketWatch, which is operated by Dow Jones &amp; Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal. </p>\n<pre class=\"mdc-article-pre\" data-v-370ea3ac=\"\"></pre>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  (END) Dow Jones Newswires</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  02-26-26 1036ET</p>\n\nCopyright (c) 2026 Dow Jones &amp; Company, Inc.</div>",
            "pub_date": "2026-02-26 23:51:46",
            "link": "https://www.morningstar.com/news/marketwatch/20260226202/why-nvidias-stock-is-falling-despite-a-historic-earnings-beat",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "AI-RAN Alliance Reaches Major Milestone, Showcasing Breakthrough Momentum for AI-Native Networks",
            "description": "<div class=\"mdc-article-body\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">AI-RAN Alliance Reaches Major Milestone, Showcasing Breakthrough Momentum for AI-Native Networks</strong>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">AI-RAN Alliance reaches 132 members, announces 33 Innovation Demos, and launches three new Industry Blueprints, signaling rapid industry adoption of Artificial Intelligence into the Radio Access Network (RAN)</em>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nThe AI-RAN Alliance today announced a major growth milestone, reaching 132 members worldwide, welcoming new Board Members including Qualcomm, SK Telecom, and Vodafone, and accelerating delivery of AI-native RAN innovation at a global scale. At MWC 2026, the Alliance will present 33 AI-driven innovation demonstrations and unveil four new industry blueprints. These will highlight how AI can be integrated into the Radio Access Network (RAN) to enhance wireless networks making them more intelligent and also demonstrate how the network will support AI applications and foster new ways of innovations.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nIn under two years, the Alliance has become a leading platform for software-defined and AI-native network innovation, uniting operators, technology partners, universities, and research labs worldwide. Its working groups covering AI-for-RAN, AI-and-RAN, AI-on-RAN; task group, such as Data-for-AI; and the shared labs are accelerating benchmarking, delivering reference designs researched collaboratively by industry and academia.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">From Proof to Practice</strong>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nThe 33 demos at MWC will show how AI is now embedded across every layer of the Network, from the RAN physical layer to orchestration and edge applications.\n\n</p><ul class=\"mdc-article-list mdc-article-list--unordered\" data-v-7b473e83=\"\">\n<li data-v-7b473e83=\"\">\nAI‑for‑RAN: Leveraging AI to optimize the RAN’s performance, from radio signal processing to network operations and automation, to deliver faster speeds, better coverage, lower energy consumption, and efficient use of radio resources.\n\n</li>\n<li data-v-7b473e83=\"\">\nAI‑and‑RAN orchestration: End‑to‑end AI control that places workloads on shared compute based on cost and performance targets, cutting operational complexity.\n\n</li>\n<li data-v-7b473e83=\"\">\nAI-on-RAN: Deploying AI workloads directly on mobile network infrastructure, enabling advanced applications at the network edge. By bringing AI capabilities closer to the user, we enable low-latency applications, real-time AI inference, and new use cases that were previously impossible.\n\n</li>\n<li data-v-7b473e83=\"\">\nAgentic RAN &amp; large telco models: How agentic AI frameworks can autonomously interpret operator intents and optimize RAN operations in distinct scenarios using Large Telco Models.\n\n</li>\n<li data-v-7b473e83=\"\">\nDigital twins: Virtual replicas of radio networks used to train and test AI before live deployment.\n\n</li>\n</ul><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nTogether, they reflect a clear shift from experimentation to AI-native RAN implementations.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Expanding Global Collaboration and Policy Alignment</strong>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nThe Alliance is expanding its technology and innovation collaborations globally, welcoming Japan’s Ministry of Internal Affairs and Communications (MIC) as a new member, while advancing AI-RAN commercialization through its collaboration with South Korea’s AI Network Alliance (AINA), supported by the Ministry of Science and ICT (MSIT). This collaboration aims to support the development of use cases and facilitate the contribution of trial results to the relevant AI-RAN Alliance Working Groups. It also encompasses the promotion of vendor lab tests focused on performance and efficiency.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">New Industry Blueprints to Accelerate Deployment</strong>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nThe Alliance has released four foundational publications defining the key building blocks of AI-powered 5G and 6G networks, providing guidance for implementation. These include:\n\n</p><ol class=\"mdc-article-list mdc-article-list--ordered\" data-v-7b473e83=\"\">\n<li data-v-7b473e83=\"\">\nAn AI-RAN Reference Architecture framework outlining a high-level AI‑native RAN design, including major functional domains and main components.\n\n</li>\n<li data-v-7b473e83=\"\">\nA report summarizing the latest AI/ML techniques and models for improving RAN performance from link‑level optimizations to network‑wide automation.\n\n</li>\n<li data-v-7b473e83=\"\">\nA document defining AI-RAN platform and infrastructure orchestration for managing AI and RAN workloads to dynamically optimize resource efficiency and ROI, while ensuring strict RAN performance\n\n</li>\n<li data-v-7b473e83=\"\">\nA white paper that explains how AI‑on‑RAN enables differentiated, monetizable connectivity for mobile‑native AI applications.\n\n</li>\n</ol><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nTogether, these publications establish architectural foundations and operations strategies needed to transform the RAN into a multi-purpose platform, helping operators accelerate innovation from research to real-world deployment and the introduction of predictable, premium-differentiated connectivity essential for AI-native applications.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Industry Alignment, Real‑World Impact</strong>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nDr. Alex Jinsung Choi, Principal Fellow of SoftBank Corp.’s Research Institute of Advanced Technology and Chair of the AI-RAN Alliance, commented: “These milestones reflect the growing recognition that AI-native RAN is no longer experimental, it is foundational to the future of wireless networks. With 132 members, active global collaborations and demonstrations, the Alliance is turning innovation into impact and accelerating the path to commercial deployment. The industry is aligning and we’re delivering partnerships that will deliver value to stakeholders worldwide.”\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">MWC 2026</strong>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nThe Alliance will make its exhibitor debut at Mobile World Congress 2026 in Hall 2 (Booth #2E45). It will run 33 multi-member AI-RAN demonstrations across the four-day event, offering insights into real-world performance improvements, energy-and-spectral-efficiency gains and automation breakthroughs across 5G-Advanced and 6G-ready AI-native networks.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nFor more information, visit: <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fai-ran.org&amp;esheet=54434342&amp;newsitemid=20260226771236&amp;lan=en-US&amp;anchor=https%3A%2F%2Fai-ran.org&amp;index=1&amp;md5=4d460adff8747defc8168496dc799b79\" tabindex=\"0\">https://ai-ran.org</a>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Notes to Editors:</strong>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">About the AI-RAN Alliance</strong>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nThe AI-RAN Alliance is a global consortium accelerating the integration of artificial intelligence into Radio Access Networks. Established in 2024, the Alliance unites leading companies, researchers, and technologists to advance open, practical approaches for building AI-native wireless networks. The Alliance focuses on enabling experimentation, sharing knowledge, and real-world performance to support the next generation of mobile infrastructure. For more information, visit: <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fai-ran.org%2F&amp;esheet=54434342&amp;newsitemid=20260226771236&amp;lan=en-US&amp;anchor=https%3A%2F%2Fai-ran.org&amp;index=2&amp;md5=8ad58810acc2cbb7f4c39a1a1bd802f7\" tabindex=\"0\">https://ai-ran.org</a>.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img\" data-v-f0ef0696=\"\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20260226771236r1&amp;sid=mstr3&amp;distro=nx&amp;lang=en\"/></picture></span><span data-v-602de5d2=\"\"></span></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nCarol Fusaro\n<br data-v-602de5d2=\"\"/><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"mailto:cfusaro@virtualinc.com\" tabindex=\"0\">cfusaro@virtualinc.com</a>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span data-v-602de5d2=\"\">View source version on businesswire.com: </span><span data-v-602de5d2=\"\"><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://www.businesswire.com/news/home/20260226771236/en/\" tabindex=\"0\">https://www.businesswire.com/news/home/20260226771236/en/</a></span></p></div>",
            "pub_date": "2026-02-26 23:35:41",
            "link": "https://www.morningstar.com/news/business-wire/20260226771236/ai-ran-alliance-reaches-major-milestone-showcasing-breakthrough-momentum-for-ai-native-networks",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Comcast and Boys & Girls Clubs of Snohomish County Open Lift Zone in Granite Falls to Help Youth Build Digital Skills",
            "description": "<div class=\"mdc-article-body\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">NORTHAMPTON, MA / <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://www.accessnewswire.com/\" tabindex=\"0\">ACCESS Newswire</a> / February 26, 2026 / </strong><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://pr.report/j3f2\" tabindex=\"0\">Comcast</a> and <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://pr.report/j3dc\" tabindex=\"0\">Boys &amp; Girls Clubs of Snohomish County </a>(BGCSC) have opened a new Lift Zone at the <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://pr.report/j3dd\" tabindex=\"0\">Granite Falls Club</a> to help youth build their digital skills. Powered by Comcast Business, this Lift Zone includes free WiFi access and was made possible by a $60,000 contribution from Comcast to support technology upgrades for the club and provide advanced programming for students. <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://pr.report/j3de\" tabindex=\"0\">Lift Zones</a>, Comcast's nationwide initiative to ensure more people in more communities have access to the internet and digital tools needed to thrive, are backed by a $50 million cash and in-kind investment.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://pr.report/j3df\" tabindex=\"0\"><span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img mdc-article-image__img--720-width\" data-v-f0ef0696=\"\" style=\"width:720px;\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://app.accessnewswire.com/imagelibrary/a02d5682-84be-4a90-9816-737e9ac5e5b2/1141884/lift-zone-inline-1-1024x734.png\"/></picture></span></a></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\"Comcast's new Lift Zone will make a real difference for youth in Granite Falls,\" said Marci Volmer, President &amp; CEO of Boys &amp; Girls Clubs of Snohomish County. \"By providing a welcoming, reliable place to get online, the Lift Zone allows us to expand our impact for youth and teens elevating their experience and ensuring they have the digital access and training they need to succeed. From strengthening reading, writing, math, and science skills to exploring future careers, this investment is part of our broader partnership with Comcast to open doors to learning, connection, and career pathways.\"</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Building on the legacy of Comcast's award-winning <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://pr.report/j3dg\" tabindex=\"0\">Lift Zone</a> program, which launched in 2020 and now includes more than 1,250 locations nationwide, this Lift Zone will offer:</p><ul class=\"mdc-article-list mdc-article-list--unordered\" data-v-7b473e83=\"\"><li data-v-7b473e83=\"\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">New equipment including 3D printers, interactive lighting, teleconferencing with other clubs, high powered desktop computers, and laptops for each student to use.</p></li><li data-v-7b473e83=\"\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Live-streaming capabilities for Life &amp; Workforce Readiness activities, Esports and more.</p></li><li data-v-7b473e83=\"\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">High-performance computing center to host resume-building and job-search workshops and to support Club Programs such as Power Hour &amp; Project Learn (academic support programs).</p></li><li data-v-7b473e83=\"\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Advanced tools, such as virtual reality, next-gen Esports PCs, digital fabrication equipment, 3D printers, robotics kits, and multimedia production equipment to enable students to explore STEAM and increase their access to technology.</p></li></ul><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://pr.report/j3dh\" tabindex=\"0\"><span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img mdc-article-image__img--720-width\" data-v-f0ef0696=\"\" style=\"width:720px;\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://app.accessnewswire.com/imagelibrary/4f4d345f-c6bf-4725-af19-45b9100941d9/1141884/lift-zone-inline-2-1024x792.png\"/></picture></span></a></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\"At Comcast, we're committed to helping to close Washington's digital skills gap, and that includes right here in Granite Falls,\" said Keith Turner, Senior Vice President for Comcast's Pacific Northwest Region. \"This Comcast Lift Zone will give students access to advanced technology and digital skills training needed to thrive, whether they're accessing online homework, exploring new learning tools, or preparing for future careers.\"</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Comcast Lift Zones are part of <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://pr.report/j3di\" tabindex=\"0\">Project UP</a>, the company's $1 billion initiative to advance digital opportunity and create a future of unlimited possibilities.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">The Boys &amp; Girls Clubs of Snohomish County is a non-profit organization providing young people ages 5-18 with a safe and positive place to spend their time before and after school and during the summer. Clubs are strategically located in neighborhoods and are accessible to all kids. Since 1946, the Boys &amp; Girls Clubs of Snohomish County has been helping young people, especially those who need us most, to reach their full potential as productive, caring, responsible citizens. To learn more, please visit our website: <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://pr.report/j3dj\" tabindex=\"0\">https://bgcsc.org/</a></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://app.accessnewswire.com/imagelibrary/16c6055c-89c8-4b50-973b-71b8c2180e03/1141884/caa36581-6b9f-45c2-86f7-7ac614a2cbca.png\" tabindex=\"0\"><span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img mdc-article-image__img--720-width\" data-v-f0ef0696=\"\" style=\"width:720px;\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://app.accessnewswire.com/imagelibrary/16c6055c-89c8-4b50-973b-71b8c2180e03/1141884/caa36581-6b9f-45c2-86f7-7ac614a2cbca.png\"/></picture></span></a></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://pr.report/j3dk\" tabindex=\"0\">Find more stories and multimedia from Comcast at 3blmedia.com.</a></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Contact Info:</strong><br data-v-602de5d2=\"\"/>Spokesperson: Comcast<br data-v-602de5d2=\"\"/>Website: <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://pr.report/j3dl\" tabindex=\"0\">https://www.3blmedia.com/profiles/comcast</a><br data-v-602de5d2=\"\"/>Email: <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"mailto:info@3blmedia.com\" tabindex=\"0\">info@3blmedia.com</a></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">SOURCE: </strong>Comcast</p><br/><br/>View the original <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://www.accessnewswire.com/newsroom/en/business-and-professional-services/comcast-and-boys-and-girls-clubs-of-snohomish-county-open-lift-z-1141884\" tabindex=\"0\">press release</a> on ACCESS Newswire<br/><br/>\n<span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img mdc-article-image__img--0-width\" data-v-f0ef0696=\"\" style=\"width:0;\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://app.accessnewswire.com/img.ashx?id=1141884\"/></picture></span></div>",
            "pub_date": "2026-02-26 23:35:40",
            "link": "https://www.morningstar.com/news/accesswire/1141884msn/comcast-and-boys-girls-clubs-of-snohomish-county-open-lift-zone-in-granite-falls-to-help-youth-build-digital-skills",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Jayson Winer, aka Mr. Black, Announces Candidacy for Florida Governor on Bold Faith, Family, and Freedom Platform",
            "description": "<div class=\"mdc-article-body\">\n            \n              \n              Jayson Winer, aka Mr. Black, Announces Candidacy for Florida Governor on Bold Faith, Family, and Freedom Platform\n              \n            \n            \n              <span>\n<h2 class=\"mdc-article-heading mdc-heading__mdc mdc-heading--level-5__mdc\" data-v-618d53ae=\"\">Jayson Winer, aka Mr. Black, Announces Candidacy for Florida Governor on Bold Faith, Family, and Freedom Platform</h2>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">PR Newswire</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">MIAMI, Feb. 26, 2026</p>\n</span>\n<span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span data-v-602de5d2=\"\">MIAMI</span>, <span data-v-602de5d2=\"\">Feb. 26, 2026</span> /PRNewswire/ -- Having made his mark in the business and <span data-v-602de5d2=\"\">bitcoin</span> industries, Yerucham Zvi Winer, also known by his artist name Mr. Black, is ready to put real leadership and family focus at the forefront of Florida politics as he announces his bid for governor.</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">This Israeli-born entrepreneur who moved to the United States at just three years old forged his own path at an early age and is no stranger to struggle. Growing up in East Cleveland, he faced and overcame addiction and poverty to become a self-made man, never losing sight of his love of country, family, and God. He now wants to instill these values in his home state of Florida.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Winer's campaign is firmly rooted in an anti-globalist platform aimed at restoring state sovereignty, strengthening families, and protecting individual freedoms.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\"We'll purge globalist influences and restore a state grounded in faith, family, and freedom,\" said Winer. \"I'm fighting for the American dream where the poor can thrive through opportunity and grit.\"</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Now a father of three daughters, he is on a mission to safeguard Florida's future for the next generation. A former Wall Street veteran who founded and managed his own fund overseeing $2 billion in assets, co-founder of premium tequila brand Casa Malka, forward-thinking <span data-v-602de5d2=\"\">bitcoin</span> artist, and owner of the Miami Assassins sports franchise, Winer represents what he calls the reality of the American dream achieved through hard work and resilience.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Combining business acumen, a family-first approach, a faith-driven lifestyle, and innovative leadership, his bid for the governor's seat is aimed at strengthening the moral and economic foundation of the state. His vision reimagines a Florida that prospers financially while keeping families and children safe from corruption and harmful influences.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">He also has ambitious plans for <span data-v-602de5d2=\"\">bitcoin</span> and vows to make \"Miami the <span data-v-602de5d2=\"\">Bitcoin</span> capital of the world.\"</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\"<span data-v-602de5d2=\"\">Bitcoin</span> embodies freedom, an incorruptible currency, and the future of finance,\" he said.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">His campaign is focused on policies encouraging larger families through tax breaks and educational support, legislation to grant full legal protections to unborn children, supporting legal immigration, helping families rise out of poverty, increasing government accountability, and pursuing justice against criminal exploitation networks.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Aside from being a father and businessman, Winer is also known by his <span data-v-602de5d2=\"\">bitcoin</span> artist name, Mr. Black. Among his most notable works are pieces that explore themes of corruption, power, and spiritual warfare in modern society.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4628332-1&amp;h=1925209895&amp;u=https%3A%2F%2Fvoteblackinnovember.com%2F&amp;a=https%3A%2F%2Fvoteblackinnovember.com\" tabindex=\"0\">https://voteblackinnovember.com</a><br data-v-602de5d2=\"\"/>MEDIA CONTACT<br data-v-602de5d2=\"\"/>Gloverse<br data-v-602de5d2=\"\"/>Chelo Cortez<br data-v-602de5d2=\"\"/>Tel: 561-321-9236<br data-v-602de5d2=\"\"/>Email: <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"mailto:409748@email4pr.com\" tabindex=\"0\">409748@email4pr.com</a></p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img mdc-article-image__img--12-width\" data-v-f0ef0696=\"\" style=\"width:12px;\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://edge.prnewswire.com/c/img/favicon.png?sn=PH96766&amp;sd=2026-02-26\"/></picture></span> View original content to download multimedia:<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://www.prnewswire.com/news-releases/jayson-winer-aka-mr-black-announces-candidacy-for-florida-governor-on-bold-faith-family-and-freedom-platform-302698555.html\" tabindex=\"0\">https://www.prnewswire.com/news-releases/jayson-winer-aka-mr-black-announces-candidacy-for-florida-governor-on-bold-faith-family-and-freedom-platform-302698555.html</a></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">SOURCE Yerucham Zvi Winer</p></span>\n<span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img\" data-v-f0ef0696=\"\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://rt.prnewswire.com/rt.gif?NewsItemId=PH96766&amp;Transmission_Id=202602261016PR_NEWS_USPR_____PH96766&amp;DateId=20260226\"/></picture></span>\n</div>",
            "pub_date": "2026-02-26 23:21:39",
            "link": "https://www.morningstar.com/news/pr-newswire/20260226ph96766/jayson-winer-aka-mr-black-announces-candidacy-for-florida-governor-on-bold-faith-family-and-freedom-platform",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Global Environmental Solutions Expands National Water Infrastructure Platform with Acquisition of Environmental Controls Company",
            "description": "<div class=\"mdc-article-body\">\n            \n              \n              Global Environmental Solutions Expands National Water Infrastructure Platform with Acquisition of Environmental Controls Company\n              \n            \n            \n              <span>\n<h2 class=\"mdc-article-heading mdc-heading__mdc mdc-heading--level-5__mdc\" data-v-618d53ae=\"\">Global Environmental Solutions Expands National Water Infrastructure Platform with Acquisition of Environmental Controls Company</h2>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">PR Newswire</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">MANCHESTER, N.H., Feb. 26, 2026</p>\n</span>\n<span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span data-v-602de5d2=\"\">MANCHESTER, N.H.</span>, <span data-v-602de5d2=\"\">Feb. 26, 2026</span> /PRNewswire/ -- Global Environmental Solutions, LLC (GES), a leading provider of environmental control technologies, today announced the completion of an asset acquisition of Environmental Controls Company, LLC (ECC), effective January 25, 2026.</p>\n<span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://mma.prnewswire.com/media/2920873/Global_Environmental_Solutions_LLC_Logo.html\" tabindex=\"0\">\n<span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img\" data-v-f0ef0696=\"\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://mma.prnewswire.com/media/2920873/Global_Environmental_Solutions_LLC_Logo.jpg\"/></picture></span>\n</a>\n</p>\n</span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">The acquisition expands GES's product portfolio and national footprint by adding ECC's proven modular floating cover technologies serving stormwater systems, reservoirs, water and wastewater treatment facilities, mining operations, airports, and industrial storage applications. ECC's products have a long track record of performance in demanding environmental conditions and are trusted by municipalities and industrial operators across the United States.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\"This acquisition establishes GES as a national platform serving both land and water infrastructure with well-engineered, long-life environmental solutions,\" said Rocco Petrilli, Chief Revenue Officer of GES. \"The provision of floating cover systems complement our dust control and surface management technologies and enable us to provide a broader, integrated infrastructure solution to our customers. The transaction also increases our revenue base and positions GES for significant growth in 2026 and beyond.\"</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">As part of the transaction, GES will continue to support all existing ECC customers without interruption. Manufacturing continuity, product performance, and customer relationships will be maintained, with planned investments to strengthen logistics, inventory availability, and technical support.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\"This acquisition expands GES's water infrastructure segment and accelerates the company's strategic growth plan as it continues building a scaled environmental solutions offering across North America\" added Petrilli.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">GES will rebrand its expanded water infrastructure product line under the EnviroBalls™ name, supporting applications including evaporation mitigation, odor control, shade ball systems, and aviation bird management. The company is investing in expanded domestic manufacturing capabilities to ensure EnviroBalls™ products are manufactured in the United States.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">GES is in the final stages of integrating ECC's  business and product offerings into its broader organization.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">About Global Environmental Solutions, LLC<br data-v-479a2324=\"\"/></strong>Global Environmental Solutions (GES) provides innovative environmental control technologies for dust suppression, soil stabilization, surface management, and water infrastructure applications. GES serves municipal, industrial, mining, construction, transportation, and agricultural markets across North America.<br data-v-602de5d2=\"\"/><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4627972-1&amp;h=2082689638&amp;u=http%3A%2F%2Fwww.globalenvironmentalsolutions.com%2F&amp;a=www.globalenvironmentalsolutions.com\" tabindex=\"0\">www.globalenvironmentalsolutions.com</a></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">About Environmental Controls Company, LLC<br data-v-479a2324=\"\"/></strong>Environmental Controls Company is a historical provider of modular floating cover systems and hollow plastic balls for a variety of industrial and commercial applications. <br data-v-602de5d2=\"\"/><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4627972-1&amp;h=249994177&amp;u=http%3A%2F%2Fwww.eccllc.us%2F&amp;a=www.eccllc.us\" tabindex=\"0\">www.eccllc.us</a></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Media Contact: <span class=\"mdc-article-underline\" data-v-1f1bdc8a=\"\"><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"mailto:media@dirtglue.com\" tabindex=\"0\">media@dirtglue.com</a></span></p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img mdc-article-image__img--12-width\" data-v-f0ef0696=\"\" style=\"width:12px;\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://edge.prnewswire.com/c/img/favicon.png?sn=NE96407&amp;sd=2026-02-26\"/></picture></span> View original content to download multimedia:<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://www.prnewswire.com/news-releases/global-environmental-solutions-expands-national-water-infrastructure-platform-with-acquisition-of-environmental-controls-company-302698530.html\" tabindex=\"0\">https://www.prnewswire.com/news-releases/global-environmental-solutions-expands-national-water-infrastructure-platform-with-acquisition-of-environmental-controls-company-302698530.html</a></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">SOURCE Global Environmental Solutions, LLC</p></span>\n</div>",
            "pub_date": "2026-02-26 23:21:37",
            "link": "https://www.morningstar.com/news/pr-newswire/20260226ne96407/global-environmental-solutions-expands-national-water-infrastructure-platform-with-acquisition-of-environmental-controls-company",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "iFOLIO's New Personalization Engine Turns Digital AI Fatigue into Pipeline",
            "description": "<div class=\"mdc-article-body\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><em class=\"mdc-article-emphasis\" data-v-370fea16=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">PURLs deliver human feeling messages at scale, lifting conversions where generic outreach fails.</strong></em></p> <p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">ATLANTA, GA / <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://www.accessnewswire.com/\" tabindex=\"0\">ACCESS Newswire</a> / February 26, 2026 / </strong><em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">Inboxes in 2026 are exhausting. AI-generated messages are everywhere, they all sound the same, and audiences have gotten very good at ignoring them. iFOLIO built something to change that.</em></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Today iFOLIO announced a major expansion of its personalization engine - moving well beyond subject lines and first names to make any element of a message dynamically personal: greetings, product references, reports, videos, calls-to-action, and more. No limitations on data attributes. Highly relevant, human-feeling messages, delivered at scale.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Why Now </strong>AI-saturated inboxes have created a real trust deficit. Audiences are tuning out automation signals faster than most teams realize - and conversion rates are quietly suffering. The fix isn't more messages. It's more relevant ones. iFOLIO keeps humans in the loop where relationships matter, and eliminates manual burden where it doesn't.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\"Personalization now moves from surface-level customization to meaningful relevance,\" said Jean Marie Richardson, CEO. \"Every interaction can feel intentional, timely, and truly personal. That's what turns a touchpoint into a relationship.\"</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">What's New</strong></p><ul class=\"mdc-article-list mdc-article-list--unordered\" data-v-7b473e83=\"\"><li data-v-7b473e83=\"\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Dynamic PURLs</strong> - anything in the email, text message or digital content adapts per recipient: tone, narrative, imagery, purchase or gift reference, etc. No manual drafting required.</p></li><li data-v-7b473e83=\"\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Visual Trust Anchors (Custom Favicons) </strong>- A branded favicon signals legitimacy before a word is read - critical in an era of phishing and deepfakes.</p></li><li data-v-7b473e83=\"\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Frictionless Individualization</strong> - Eliminates the \"manual tax\" that has made true 1-to-1 outreach unscalable until now.</p></li></ul><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Who It's For </strong>Enterprise sales teams closing faster with buyer-specific messaging. Account teams delivering personalized updates. Advancement offices generating major gifts through individualized impact reports. Any team where relationship quality drives results.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Trusted By</strong> University of Florida, Alabama Crimson Tide, Northeastern University, VCU MCV Foundation, Florida A&amp;M, Kansas State, Henry Ford College, Clemson, University of Memphis, University System of Georgia Foundation, and Savannah State - already live on iFOLIO's PURLs engine.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">About iFOLIO</strong> iFOLIO is the leader in personalized digital marketing software, powering engagement across all 50 states and 120 countries. <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://pr.report/j3et\" tabindex=\"0\">www.ifoliocloud.com</a>.<br data-v-602de5d2=\"\"/><br data-v-602de5d2=\"\"/>For media inquiries, please contact:<br data-v-602de5d2=\"\"/>Val Fa<br data-v-602de5d2=\"\"/>Media Director, iFOLIO<br data-v-602de5d2=\"\"/><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"mailto:valfa@ifoliocloud.com\" tabindex=\"0\">valfa@ifoliocloud.com</a></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">SOURCE:</strong> iFOLIO</p><br/><br/>View the original <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://www.accessnewswire.com/newsroom/en/business-and-professional-services/ifolios-new-personalization-engine-turns-digital-ai-fatigue-into-1141254\" tabindex=\"0\">press release</a> on ACCESS Newswire<br/><br/>\n<span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img mdc-article-image__img--0-width\" data-v-f0ef0696=\"\" style=\"width:0;\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://app.accessnewswire.com/img.ashx?id=1141254\"/></picture></span></div>",
            "pub_date": "2026-02-26 23:10:39",
            "link": "https://www.morningstar.com/news/accesswire/1141254msn/ifolios-new-personalization-engine-turns-digital-ai-fatigue-into-pipeline",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Matter Health Appoints Sarah Chouinard, MD, as Chief Medical Officer",
            "description": "<div class=\"mdc-article-body\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Matter Health Appoints Sarah Chouinard, MD, as Chief Medical Officer</strong>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Matter Health</strong>, a medical group delivering on-site care inside senior-restricted affordable housing communities, today announced the appointment of <strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Sarah Chouinard</strong>, MD, as Chief Medical Officer.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">This press release features multimedia. View the full release here: <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://www.businesswire.com/news/home/20260225605152/en/\" tabindex=\"0\">https://www.businesswire.com/news/home/20260225605152/en/</a></p><span><span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img\" data-v-f0ef0696=\"\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://mms.businesswire.com/media/20260225605152/en/2731907/4/IMG_4864.jpg\"/></picture></span><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Sarah Chouinard, MD, appointed Chief Medical Officer of Matter Health</p></span><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nIn this role, Dr. Chouinard will oversee all aspects of clinical delivery and model performance, including quality outcomes, clinical programs, risk management, and overall model performance across Matter Health’s expanding national footprint.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nDr. Chouinard joins Matter Health from Main Street Health, where she played a critical leadership role in scaling the organization nationwide while supporting more than half a million members. Her experience building and operationalizing clinical models at national scale positions her to lead Matter Health through its next phase of growth.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n“Sarah brings a rare combination of deep clinical credibility and hands-on experience scaling care models nationally,” said <strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Michael Scarbrough</strong>, Chief Executive Officer of Matter Health. “As we continue expanding into new markets and deepening our payer partnerships, her leadership will be foundational to delivering consistent, high-quality outcomes for the seniors we serve.”\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nMatter Health’s model embeds interdisciplinary care teams directly inside affordable housing communities, eliminating access barriers and enabling industry-leading engagement, quality, and cost performance for low-income, vulnerable seniors.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n“Matter Health is addressing one of the most underserved populations in healthcare with a model built for accountability and scale,” said Dr. Chouinard. “I’m excited to help lead the clinical strategy and partner with care teams across the country to deliver measurable impact.”\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nUnder Dr. Chouinard’s clinical leadership, Matter Health will enter multiple new states in 2026 and continue scaling nationally to serve the approximately 1.2 million seniors residing in age-restricted public housing communities.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">About Matter Health</strong>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nMatter Health is a value-based medical group that embeds multidisciplinary care teams directly inside age-restricted public housing communities, providing convenient, coordinated, and compassionate care to dual-eligible Medicare–Medicaid members. Headquartered in Nashville, TN, Matter Health partners with leading payers and housing operators to improve outcomes, reduce costs, and keep patients connected to the care they deserve.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img\" data-v-f0ef0696=\"\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20260225605152r1&amp;sid=mstr3&amp;distro=nx&amp;lang=en\"/></picture></span><span data-v-602de5d2=\"\"></span></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nSabrina Haddad\n<br data-v-602de5d2=\"\"/><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"mailto:Sabrina.haddad@matterhealthcare.com\" tabindex=\"0\">Sabrina.haddad@matterhealthcare.com</a>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span data-v-602de5d2=\"\">View source version on businesswire.com: </span><span data-v-602de5d2=\"\"><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://www.businesswire.com/news/home/20260225605152/en/\" tabindex=\"0\">https://www.businesswire.com/news/home/20260225605152/en/</a></span></p></div>",
            "pub_date": "2026-02-26 23:10:38",
            "link": "https://www.morningstar.com/news/business-wire/20260225605152/matter-health-appoints-sarah-chouinard-md-as-chief-medical-officer",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        }
    ]
}