{
    "data": [
        {
            "title": "Low-Cost Hydrogen Becomes Commercial Reality. Groundbreaking Hydrogen Fuel Technology at Pleasants Power Station Completes Technology Validation Testing.",
            "description": "<div class=\"mdc-article-body\">\n            \n              \n              Low-Cost Hydrogen Becomes Commercial Reality. Groundbreaking Hydrogen Fuel Technology at Pleasants Power Station Completes Technology Validation Testing.\n              \n            \n            \n              <span>\n<h2 class=\"mdc-article-heading mdc-heading__mdc mdc-heading--level-5__mdc\" data-v-618d53ae=\"\">Low-Cost Hydrogen Becomes Commercial Reality. Groundbreaking Hydrogen Fuel Technology at Pleasants Power Station Completes Technology Validation Testing.</h2>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">PR Newswire</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">PLEASANTS COUNTY, W.Va., Feb. 27, 2026</p>\n</span>\n<span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span data-v-602de5d2=\"\">PLEASANTS COUNTY, W.Va.</span>, <span data-v-602de5d2=\"\">Feb. 27, 2026</span> /PRNewswire/ -- Quantum Pleasants today announced a major milestone: the successful completion of a year-long evaluation of its revolutionary Omnis Quantum Reformer® (\"OQR®\") technology at Pleasants Power Station in West Virginia. The breakthrough technology produces hydrogen fuel onsite at 50% lower cost than any other hydrogen fuel and can be used in existing coal and gas power plants for electricity generation. \"We have fully tested the commercial ultra-high temperature pyrolysis OQR® unit for more than a year,\" said Dr. Nansen Saleri, Chairman of the Omnis Hydrogen Technology Advisory Board. \"The OQR® has been rigorously evaluated, and we are confident it can now be effectively scaled to supply hydrogen fuel for the entire plant.\"</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">A single OQR® has demonstrated the ability to produce hydrogen from carbon fuels. However, the true breakthrough lies in the unparalleled efficiency and cost-effectiveness of the proprietary process that is expected to reduce fuel costs at the 1,300MW Pleasants Power Station. When fully scaled with multiple OQR® units, Pleasants could usher in a new era of clean power generation, leveraging the state's rich hydrocarbon resources and positioning the Pleasants facility as the world's largest Hydrogen production plant.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Independent Validation<br data-v-479a2324=\"\"/></strong>The groundbreaking, patented technology has been validated by numerous independent experts and industry leaders. A comprehensive third party study of the OQR® technology and operations at Pleasants Power Station, conducted over more than four months, concluded that it met all goals for safety, commercial capability, and economic viability.  Over the past year, representatives from major academic institutions, the National Energy Technology Laboratory (NETL), the Department of Energy (DOE), and many West Virginia State legislators witnessed the OQR® reforming Quantum H<span data-v-602de5d2=\"\">2</span>® fuel from hydrocarbon feedstock and its use at Pleasants Power Station to generate electricity for the PJM market.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Acknowledgments and Next Steps<br data-v-479a2324=\"\"/></strong>\"I am confident in the future of Quantum H<span data-v-602de5d2=\"\">2</span>® as a sustainable, low-cost fuel for power generation,\" said Simon Hodson, Chairman of Quantum Pleasants, LLC. \"We are grateful to the State of West Virginia and its Economic Development Authority for providing an early-stage loan that was invaluable. The Pleasants Power Station is now on track to become a fully restored, hydrogen-powered facility that uses West Virginia coal and natural gas, employing hundreds of local residents. The socio-economic benefits to the state at full-scale operations are enormous, as it will serve as a magnet for energy-intensive businesses. We could not have achieved this so quickly without the support of the State and the local community.\"</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">With commercial validation complete, Quantum Pleasants is moving forward with plans to convert the entire power station to hydrogen fuel. The fuel conversion is expected to take approximately 24 months. Once complete, the Pleasants Power Station will be the first large power plant converted from fossil fuel to 100% hydrogen fuel. In preparation for this next phase, the company is in advanced discussions with select strategic partners to assume ownership and operation of the power plant, enabling Quantum Pleasants to focus on advancing hydrogen reformation technology for the global power market.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">About Quantum Pleasants, LLC</strong> <span data-v-602de5d2=\"\">Quantum </span>Pleasants<span data-v-602de5d2=\"\">, LLC is a licensee of </span>Omnis<span data-v-602de5d2=\"\"> Energy, a leading innovator in hydrogen production technology, focused on developing commercially scalable, economically viable solutions for the energy sector. The company's patented technology, incorporating the </span>Omnis<span data-v-602de5d2=\"\"> Quantum Reformer®, achieves very low-cost production of Quantum H</span><span data-v-602de5d2=\"\">2</span><span data-v-602de5d2=\"\">® at commercially viable quantities, supporting a global shift toward more sustainable and affordable energy.</span></p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img mdc-article-image__img--12-width\" data-v-f0ef0696=\"\" style=\"width:12px;\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://edge.prnewswire.com/c/img/favicon.png?sn=CG97861&amp;sd=2026-02-27\"/></picture></span> View original content:<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://www.prnewswire.com/news-releases/low-cost-hydrogen-becomes-commercial-reality-groundbreaking-hydrogen-fuel-technology-at-pleasants-power-station-completes-technology-validation-testing-302699766.html\" tabindex=\"0\">https://www.prnewswire.com/news-releases/low-cost-hydrogen-becomes-commercial-reality-groundbreaking-hydrogen-fuel-technology-at-pleasants-power-station-completes-technology-validation-testing-302699766.html</a></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">SOURCE Quantum Pleasants, LLC</p></span>\n</div>",
            "pub_date": "2026-02-28 00:40:55",
            "link": "https://www.morningstar.com/news/pr-newswire/20260227cg97861/low-cost-hydrogen-becomes-commercial-reality-groundbreaking-hydrogen-fuel-technology-at-pleasants-power-station-completes-technology-validation-testing",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "February's 'panic' rotation in stocks sets the stage for more tumult in March",
            "description": "<div class=\"mdc-article-body\">\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  By Isabel Wang </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     February's anti-AI trade has been driving a dramatic rotation under the surface of the stock market. Has it gone too far already? </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     A rare alliance against Big Tech came together in February. Now that could be put to the test. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     February has brought a sharp rotation away from the group of megacap tech stocks known as the Magnificent Seven MAGS, sparking an \"everything but tech\" rally that lifted economically sensitive names as well as recession shelters. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     That unusual unity, however, may already be starting to crack as the month draws to a close, suggesting the market's temporary alliance against Big Tech may not last. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     In February, defensive sectors like consumer staples and utilities XX:SP500.55 have surged alongside economically sensitive groups such as industrials and materials, while technology stocks XX:SP500.45 have been under sharp pressure. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     This comes as concerns about tech spending and artificial intelligence were on full display this week, with the big drop in Nvidia's stock (NVDA) that followed its blowout earnings report dragging the rest of the stock market lower. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     See: Why Nvidia's stock is falling despite a historic earnings beat </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     That backdrop has led to the S&amp;P 500's SPX consumer staples XX:SP500.30, industrials XX:SP500.20 and materials XX:SP500.15 sectors being among the best-performing of the large-cap benchmark index's 11 sectors so far in February, with each up over 6.3%, while the S&amp;P 500 has fallen 0.4% in the same period, according to FactSet data (see table below). </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     SOURCE: DOW JONES MARKET DATA; FACTSET </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     \"I don't think anybody had that on their bingo card coming into 2026,\" said Stephen Hoedt, head of equities at Key Private Bank. \"It has created a really difficult environment for market participants to navigate, because there's no playbook that you could come up with over the last 10 years where cyclicals and and defensives were rallying at the same time while tech was getting smashed.\" </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Cyclicals and defensive stocks rarely move in tandem, as they tend to benefit from different, and often opposing, market and economic conditions. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Defensive stocks are shares of companies that provide essential goods and services that tend to remain in demand regardless of economic conditions. These safe-haven investments often offer low volatility and could help protect investors from market downturns, but they generally lag during bull markets. Cyclical stocks, on the other hand, are closely tied to the economic cycle. They typically perform well during expansions, but could underperform during economic downturns or even recessions. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     A central theme around the rapid pace of AI advancements is that it could be a driving force for growth. But it also might trigger painful job losses and render some business lines obsolete, which could ultimately hurt the consumer-centric U.S. economy. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Meanwhile, investors have focused on the consumer staples sector, which was up a total of 14.2% in January and February, while the industrials sector rose 13% and materials stocks were up 15.7% in the year to date, according to FactSet data. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     See: The S&amp;P 500 is caught in an extremely narrow trading range. What's happening beneath the surface could decide where the index goes next. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     More broadly, there has been a rising \"united front\" against Big Tech that has \"nothing to do with economic conditions,\" Hoedt told MarketWatch in a phone interview. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     \"But it has everything to do with the market looking for stuff that is not AI impacted and figuring out what is a safe place to hide. What we see here is the anti-AI trade really writ large in these sector rotations,\" he said. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Cyclicals may extend their leadership </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     According to Hoedt, the correlation between cyclicals and defensive stocks is likely to break down soon, as defensive trades become crowded and expensive. Should the economy run hot, cyclical stocks could see further gains from here. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     \"It strikes us that the defensive trade has gotten a bit overcooked and crowded. But we don't think that people are going to back off the cyclicals when we're in a hot economy, so cyclicals are the place to be in,\" he said. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     See: Block plans to lay off nearly half its staff in 'deliberate and bold' embrace of AI </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Economic conditions remain a wild card for the rest of 2026 as investors parse how AI will reshape the labor market. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Ken Mahoney, president and chief executive officer at Mahoney Asset Management, said that cyclicals such as industrials and materials are also benefiting from the rise of \"physical AI\" as they provide support in the build-out of infrastructure, including power grids, data centers and factories, that will support the next phase of the AI race. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     \"Technology stories are usually more exciting than the materials, but you need all these materials to get up and running for all the contracts that have been signed and construction to be done in the next few years,\" Mahoney told MarketWatch via phone on Thursday. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     That's why the rally in materials and industrials \"still has legs,\" he added. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     See: AI jitters are turning discount chains and shampoo makers into the stock market's hottest trade - and that's risky </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     U.S. stocks were lower on Friday. The Nasdaq composite COMP was down 0.8% and the S&amp;P 500 was off 0.6%. The Dow Jones Industrial Average DJIA was 1.2% lower, according to FactSet data. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     -Isabel Wang </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     This content was created by MarketWatch, which is operated by Dow Jones &amp; Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal. </p>\n<pre class=\"mdc-article-pre\" data-v-370ea3ac=\"\"></pre>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  (END) Dow Jones Newswires</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  02-27-26 1125ET</p>\n\nCopyright (c) 2026 Dow Jones &amp; Company, Inc.</div>",
            "pub_date": "2026-02-28 00:40:54",
            "link": "https://www.morningstar.com/news/marketwatch/20260227190/februarys-panic-rotation-in-stocks-sets-the-stage-for-more-tumult-in-march",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Dow Jones Top Company Headlines at 11 AM ET: OpenAI Raises $110 Billion | Lululemon ...",
            "description": "<div class=\"mdc-article-body\">\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  OpenAI Raises $110 Billion </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  The new funding, which values the company at $730 billion before the investment, came from Amazon, SoftBank and Nvidia. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     ---- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Lululemon Founder Intensifies Board Battle, Cites Weak Governance, Strategic Drift </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Chip Wilson, founder of lululemon athletica, intensified his campaign against the company, accusing the board of weak governance and slow engagement as he pushes for sweeping changes. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     ---- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Target to Remove Artificial Dyes From Cereal Aisle </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  The retailer said it has worked with national brands and owned-brand partners to reformulate products where necessary. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     ---- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Paramount Wins Bidding War for Warner Discovery After Netflix Drops Out </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Netflix pulled the plug on its deal soon after Warner's board determined Paramount's revised offer was superior. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     ---- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Altman Says OpenAI Is Working on Pentagon Deal Amid Anthropic Standoff </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Altman waded into the standoff between Anthropic and the Pentagon over the use of AI on the battlefield, telling his staff that the company was working on a deal that might help solve the impasse. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     ---- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Trump Media in Talks to Spin Off Truth Social </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  President Trump's media company said it is in discussions to spin off businesses, including social-media platform Truth Social, into a new publicly traded company. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     ---- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  How Jack Dorsey Explained Cutting Almost Half of Block's Staff </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  The entrepreneur said fewer employees is better in the AI age. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     ---- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Carter's Sales Rise, Weak 1Q Outlook Given </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Carter's posted higher fourth-quarter sales with the help of increased traffic and prices, but issued first-quarter earnings guidance below Wall Street's expectations. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     ---- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Moderna's Covid-Flu Vaccine Recommended for Approval in EU </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  The recommendation from regulators paves the way for the shot's approval in the European Union at a time the company is facing scrutiny in the U.S. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     ---- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Puma's Shares Drop as Turnaround Progress Remains Under Scrutiny </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Puma's shares lost a chunk of Thursday's gains after some analysts said optimism over a change in the brand's fortunes could be premature. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     ---- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Amazon Tries Its Low-Cost Approach to Winning the AI Race </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Amazon's new artificial intelligence czar, Peter DeSantis, is a larger-than-life figure within the company. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     ---- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Swiss Re Tops Up Returns With $1 Billion Buyback </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Stock jumped after the reinsurer paired its quarterly results with a surprise buyback, signaling a more aggressive stance on capital returns. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     ---- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  CPP Investments, Equinix in $4 Billion Deal to Buy Nordic Data-Center Operator atNorth </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  The Canada Pension Plan Investment Board takes a 60% stake in the Nordic data-center operator, with digital infrastructure company Equinix owning 40%. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     ---- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Lynas Rare Earths' Departing CEO Has Sights on Pentagon Supply Deal </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  The chief executive of Lynas Rare Earths said plans for a new processing plant in Texas will remain stalled until talks with the Pentagon are finalized. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     ---- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Japan Government to Become Top Shareholder in Chip Maker Rapidus </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  The government will hold a so-called \"golden share\" in Rapidus, granting it veto power over board decisions. </p>\n<pre class=\"mdc-article-pre\" data-v-370ea3ac=\"\"></pre>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  (END) Dow Jones Newswires</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  February 27, 2026 11:15 ET (16:15 GMT)</p>\n\nCopyright (c) 2026 Dow Jones &amp; Company, Inc.</div>",
            "pub_date": "2026-02-28 00:25:57",
            "link": "https://www.morningstar.com/news/dow-jones/202602277428/dow-jones-top-company-headlines-at-11-am-et-openai-raises-110-billion-lululemon",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Deep Fission to Host Public Meeting in Parsons, Kansas on March 12",
            "description": "<div class=\"mdc-article-body\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Deep Fission to Host Public Meeting in Parsons, Kansas on March 12</strong>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Deep Fission, Inc.</strong> (“Deep Fission” or the “Company”), a pioneering advanced nuclear energy company placing small modular pressurized water reactors in boreholes one mile underground, will host a public meeting in Parsons, Kansas on Thursday, March 12, from 5:00–7:00 p.m. CT.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nThe meeting will take place at the <strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Wall Event Center</strong>, 2605 Main St., Parsons, KS 67357.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nCommunity members are invited to attend to learn more about the project, ask questions, and meet members of the Deep Fission team.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nThose who are unable to attend in person may submit questions or comments through the Deep Fission community page at: <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fdeepfission.com%2Fcommunity%2F&amp;esheet=54435306&amp;newsitemid=20260227307518&amp;lan=en-US&amp;anchor=https%3A%2F%2Fdeepfission.com%2Fcommunity%2F&amp;index=1&amp;md5=6c443ce54789c5517c04ce3d9b905721\" tabindex=\"0\">https://deepfission.com/community/</a>.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">About Deep Fission</strong>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nDeep Fission is revolutionizing the energy landscape with innovative technology that places a small modular pressurized water reactor in a borehole one mile underground. Founded and led by a team of seasoned scientists, engineers, and entrepreneurs, the company is committed to delivering safe, reliable, and affordable low-carbon power at scale. Deep Fission was selected for the Department of Energy’s Reactor Pilot Program and is building its first reactor in Parsons, Kansas. Deep Fission was founded in 2023 by father-daughter team Liz and Rich Muller. Learn more at <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fdeepfission.com%2F&amp;esheet=54435306&amp;newsitemid=20260227307518&amp;lan=en-US&amp;anchor=deepfission.com&amp;index=2&amp;md5=519be7be430eb851a779f854b0adeceb\" tabindex=\"0\">deepfission.com</a>.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Forward-Looking Statements</strong>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nThis press release contains forward-looking statements within the meaning of the U.S. federal securities laws, including, among other things, statements regarding Deep Fission’s development plans, anticipated project timelines, potential commercial opportunities, collaboration activities, and other future matters. These statements are based on current expectations and involve risks and uncertainties that could cause actual results to differ materially from those expressed or implied. Important factors that may affect actual results are described under “Risk Factors” and “Special Note Regarding Forward-Looking Statements” in Deep Fission’s registration statement on Form S-1 filed with the U.S. Securities and Exchange Commission (as amended or supplemented), and in other filings Deep Fission makes with the SEC. Forward-looking statements speak only as of the date of this press release. Deep Fission undertakes no obligation to update any forward-looking statements, whether as a result of new information, future events, or otherwise, except as required by law.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img\" data-v-f0ef0696=\"\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20260227307518r1&amp;sid=mstr3&amp;distro=nx&amp;lang=en\"/></picture></span><span data-v-602de5d2=\"\"></span></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Deep Fission Contacts: \n</strong><br data-v-602de5d2=\"\"/>For media inquiries, please contact:\n<br data-v-602de5d2=\"\"/>Chloe Frader, VP of Strategic Affairs\n<br data-v-602de5d2=\"\"/><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"mailto:chloe.frader@deepfission.com\" tabindex=\"0\">chloe.frader@deepfission.com</a>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span data-v-602de5d2=\"\">View source version on businesswire.com: </span><span data-v-602de5d2=\"\"><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://www.businesswire.com/news/home/20260227307518/en/\" tabindex=\"0\">https://www.businesswire.com/news/home/20260227307518/en/</a></span></p></div>",
            "pub_date": "2026-02-28 00:25:56",
            "link": "https://www.morningstar.com/news/business-wire/20260227307518/deep-fission-to-host-public-meeting-in-parsons-kansas-on-march-12",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "TAMARACK RESORT LAUNCHES 26/27 ALL SEASON PASS AT LOWEST PRICE OF THE YEAR: Adult passes start at $499; Family passes only $999",
            "description": "<div class=\"mdc-article-body\">\n            \n              \n              TAMARACK RESORT LAUNCHES 26/27 ALL SEASON PASS AT LOWEST PRICE OF THE YEAR: Adult passes start at $499; Family passes only $999\n              \n            \n            \n              <span>\n<h2 class=\"mdc-article-heading mdc-heading__mdc mdc-heading--level-5__mdc\" data-v-618d53ae=\"\">TAMARACK RESORT LAUNCHES 26/27 ALL SEASON PASS AT LOWEST PRICE OF THE YEAR: Adult passes start at $499; Family passes only $999</h2>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">PR Newswire</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">TAMARACK, Idaho, Feb. 27, 2026</p>\n</span>\n<span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span data-v-602de5d2=\"\">TAMARACK, Idaho</span>, <span data-v-602de5d2=\"\">Feb. 27, 2026</span> /PRNewswire/ -- Tamarack Resort today announced the launch of its 26/27 All Season Pass, offering Idaho families and outdoor enthusiasts the lowest pass price of the entire year. Beginning today, Adult All Season Passes are available for $499 — a savings of $400 compared to purchasing later — and a Family All Season Pass is available for $999, offering savings of more than $1,000 versus in-season pricing.</p>\n<span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://mma.prnewswire.com/media/2921879/TAMARACK_RESORT_1.html\" tabindex=\"0\">\n<span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img\" data-v-f0ef0696=\"\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://mma.prnewswire.com/media/2921879/TAMARACK_RESORT_1.jpg\"/></picture></span>\n</a>\n</p>\n</span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Tier 1 pricing is the best rate Tamarack will offer all year. Once this pricing window closes, it will not return.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">The Tamarack Resort All Season Pass provides year-round access to winter and summer lift operations, including skiing, snowboarding, lift-served mountain biking, and scenic access. Passholders receive valuable perks throughout the resort, including 10% off Sports School lessons, rentals, tuning, seasonal lockers, Elevation Studio classes, childcare, golf rounds at Osprey Meadows, and golf simulator sessions. Additional benefits include 15% off family and friends day lift tickets and 15% off vacation rental stays (up to seven nights annually, blackout dates apply). Tamarack Resort is America's only ski, golf, and lake resort, delivering an all-season lifestyle across its mountain, meadow, and lake.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Tamarack is limiting the total number of All Season Passes sold in order to preserve the uncrowded, premium experience the resort is known for. Day tickets will also be limited on peak dates, making an All Season Pass the only way to guarantee access on the most sought-after days of the season.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Tier 1 pricing is available for a limited time and inventory is capped. Guests who purchase now secure the lowest rate of the year and guaranteed access through 2026/27 winter season. Once Tier 1 closes, prices will increase and availability is not guaranteed.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Passes are available now at <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4628953-1&amp;h=1303614951&amp;u=http%3A%2F%2Fwww.tamarackidaho.com%2Fallseason&amp;a=www.tamarackidaho.com%2Fallseason\" tabindex=\"0\">www.tamarackidaho.com/allseason</a>.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">About Tamarack Resort<br data-v-479a2324=\"\"/></strong>Tamarack Resort is America's only ski, golf and lake resort. The independent, all-season destination is situated on 3,600 acres, located 90 miles north of Boise, Idaho. Within its master- planned community, Tamarack offers recreation, real estate, vacation rentals, event space and a vibrant alpine-style village. The winter brings 2,800 feet of vertical on 1,530 acres of skiable terrain in addition to Nordic and snowshoe trails. In the summer, the resort is home to golf, mountain biking, ziplining, hiking, rafting, and watersports on Lake Cascade. For more information on recreation, accommodations and real estate, visit <span class=\"mdc-article-underline\" data-v-1f1bdc8a=\"\">tamarackidaho.com</span>.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Media Contact:<br data-v-602de5d2=\"\"/>Zander Smith<br data-v-602de5d2=\"\"/><span class=\"mdc-article-underline\" data-v-1f1bdc8a=\"\"><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"mailto:asmith@tamarackidaho.com\" tabindex=\"0\">asmith@tamarackidaho.com</a></span></p>\n<span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://mma.prnewswire.com/media/2921880/TAMARACK_RESORT_2.html\" tabindex=\"0\">\n<span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img\" data-v-f0ef0696=\"\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://mma.prnewswire.com/media/2921880/TAMARACK_RESORT_2.jpg\"/></picture></span>\n</a>\n</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://mma.prnewswire.com/media/2921881/TAMARACK_RESORT_3.html\" tabindex=\"0\">\n<span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img\" data-v-f0ef0696=\"\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://mma.prnewswire.com/media/2921881/TAMARACK_RESORT_3.jpg\"/></picture></span>\n</a>\n</p>\n</span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img mdc-article-image__img--12-width\" data-v-f0ef0696=\"\" style=\"width:12px;\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://edge.prnewswire.com/c/img/favicon.png?sn=LA97488&amp;sd=2026-02-27\"/></picture></span> View original content to download multimedia:<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://www.prnewswire.com/news-releases/tamarack-resort-launches-2627-all-season-pass-at-lowest-price-of-the-year-adult-passes-start-at-499-family-passes-only-999-302699337.html\" tabindex=\"0\">https://www.prnewswire.com/news-releases/tamarack-resort-launches-2627-all-season-pass-at-lowest-price-of-the-year-adult-passes-start-at-499-family-passes-only-999-302699337.html</a></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">SOURCE TAMARACK RESORT</p></span>\n</div>",
            "pub_date": "2026-02-28 00:11:13",
            "link": "https://www.morningstar.com/news/pr-newswire/20260227la97488/tamarack-resort-launches-2627-all-season-pass-at-lowest-price-of-the-year-adult-passes-start-at-499-family-passes-only-999",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "ISS National Lab-Sponsored Payloads Return on SpaceX CRS-33",
            "description": "<div class=\"mdc-article-body\">\n            \n              \n              ISS National Lab-Sponsored Payloads Return on SpaceX CRS-33\n              \n            \n            \n              <span>\n<h2 class=\"mdc-article-heading mdc-heading__mdc mdc-heading--level-5__mdc\" data-v-618d53ae=\"\">ISS National Lab-Sponsored Payloads Return on SpaceX CRS-33</h2>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">PR Newswire</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">KENNEDY SPACE CENTER, Fla., Feb. 27, 2026</p>\n</span>\n<span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\"><em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">Dozens of projects return from the space station to advance medicine, technology, and workforce development </em></strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span data-v-602de5d2=\"\">KENNEDY SPACE CENTER, Fla.</span>, <span data-v-602de5d2=\"\">Feb. 27, 2026</span> /PRNewswire/ -- SpaceX's Dragon spacecraft has safely splashed down off the coast of Southern California, bringing back more than 55 investigations sponsored by the International Space Station (ISS) National Laboratory. These projects, supported by the ISS crew, represent a cross-section of <span class=\"mdc-article-underline\" data-v-1f1bdc8a=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\"><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4629241-1&amp;h=2507054722&amp;u=https%3A%2F%2Fissnationallab.org%2Fvideos%2Fiss-national-lab-prelaunch-science-webinar-spx-33-2%2F&amp;a=cutting-edge+work\" tabindex=\"0\">cutting-edge work</a></strong></span> in regenerative medicine, advanced materials, space biology, and student-led innovation. Results from this research will help accelerate discoveries that benefit people on Earth and foster a robust commercial marketplace in low Earth orbit (LEO).</p>\n<span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://mma.prnewswire.com/media/2261434/ISSNL_Logo.html\" tabindex=\"0\">\n<span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img\" data-v-f0ef0696=\"\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://mma.prnewswire.com/media/2261434/ISSNL_Logo.jpg\"/></picture></span>\n</a>\n</p>\n</span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">With the successful return of SpaceX's 33rd Commercial Resupply Services (CRS) mission for NASA, researchers will begin postflight analysis, aiming to advance scientific knowledge that accelerates future R&amp;D in LEO and beyond. Payloads returning to Earth through this mission include the following:</p><ul class=\"mdc-article-list mdc-article-list--unordered\" data-v-7b473e83=\"\"><li data-v-7b473e83=\"\">Cedars-Sinai Medical Center is studying how induced pluripotent stem cells can be used to produce brain and heart organoids in space, which could accelerate regenerative medicine breakthroughs. The project builds on <span class=\"mdc-article-underline\" data-v-1f1bdc8a=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\"><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4629241-1&amp;h=2231191965&amp;u=https%3A%2F%2Fissnationallab.org%2Fpress-releases%2Fax2-cedars-sinai-stem-cells%2F&amp;a=multiple+investigations\" tabindex=\"0\">multiple investigations</a></strong></span> from this team over the years and could further in-space manufacturing to produce stem cell-based therapies for heart disease, neurodegenerative conditions, and more.</li><li data-v-7b473e83=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\"><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4629241-1&amp;h=4159359838&amp;u=https%3A%2F%2Fissnationallab.org%2Fpress-releases%2Fspacex-crs32-elvis-jpl-portland-state%2F&amp;a=ELVIS+is+back\" tabindex=\"0\"><span class=\"mdc-article-underline\" data-v-1f1bdc8a=\"\">ELVIS is back</span></a></strong>. Portland State University and NASA's Jet Propulsion Laboratory leveraged the ISS to test the Extant Life Volumetric Imaging System (ELVIS), a new holographic microscope designed to study how life adapts under extreme conditions.</li><li data-v-7b473e83=\"\">Wake Forest Institute for Regenerative Medicine (WFIRM) is studying how engineered liver tissue containing blood vessels behaves in microgravity. Originating from NASA's Vascular Tissue Challenge, the project could advance tissue engineering in space to support future organ replacement for patients on Earth and beyond.</li><li data-v-7b473e83=\"\">In a project funded by the U.S. National Science Foundation, Arizona State University is collaborating with BioServe Space Technologies to study how <span class=\"mdc-article-underline\" data-v-1f1bdc8a=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\"><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4629241-1&amp;h=4035541354&amp;u=https%3A%2F%2Fissnationallab.org%2Fpress-releases%2Fmedia-webinar-showcases-research-launching-to-the-iss%2F&amp;a=germicidal+ultraviolet+light\" tabindex=\"0\">germicidal ultraviolet light</a></strong></span> affects the formation of biofilms in space-based water systems. Findings could lead to new ways to protect life support systems during spaceflight and reduce biofilm-related challenges on Earth.</li><li data-v-7b473e83=\"\">Multiple student-led projects to prepare the future space workforce were completed on the space station. One project comes from the annual Genes in Space competition, in which students in grades 7-12 propose genetics-related investigations to be conducted on the ISS. This investigation examined the potential use of bacteriophages (viruses that infect bacteria) as therapeutic agents to combat microbial infections in space. Additionally, the Higher Orbits Go For Launch! program conducted experiments from students in Florida, Michigan, Pennsylvania, Texas, and Virginia.</li></ul><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">To learn more about ISS National Lab-sponsored research that flew on this mission, visit our <span class=\"mdc-article-underline\" data-v-1f1bdc8a=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\"><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4629241-1&amp;h=2534164661&amp;u=https%3A%2F%2Fissnationallab.org%2Flaunch%2Fnasas-spacex-crs-33%2F&amp;a=launch+page\" tabindex=\"0\">launch page</a></strong></span>. Additionally, to learn more about results from R&amp;D conducted on station, please subscribe to <span class=\"mdc-article-underline\" data-v-1f1bdc8a=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\"><em class=\"mdc-article-emphasis\" data-v-370fea16=\"\"><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4629241-1&amp;h=1498256406&amp;u=https%3A%2F%2Fissnationallab.org%2Fupward%2F&amp;a=Upward\" tabindex=\"0\">Upward</a></em></strong></span>, the official magazine of the ISS National Lab.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Download a high-resolution image for this release: </strong><span class=\"mdc-article-underline\" data-v-1f1bdc8a=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\"><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4629241-1&amp;h=1992728740&amp;u=https%3A%2F%2Fwww.flickr.com%2Fphotos%2Fiss_casis%2F55112887182%2Fin%2Fdateposted%2F&amp;a=SpaceX-33+return\" tabindex=\"0\">SpaceX-33 return</a></strong></span></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">About the International Space Station (ISS) National Laboratory:<br data-v-479a2324=\"\"/></strong>The International Space Station (ISS) is a one-of-a-kind laboratory that enables research and technology development not possible on Earth. As a public service enterprise, the ISS National Laboratory® allows researchers to leverage this multiuser facility to improve quality of life on Earth, mature space-based business models, advance science literacy in the future workforce, and expand a sustainable and scalable market in low Earth orbit. Through this orbiting national laboratory, research resources on the ISS are available to support non-NASA science, technology, and education initiatives from U.S. government agencies, academic institutions, and the private sector. The Center for the Advancement of Science in Space® (CASIS®) manages the ISS National Lab, under Cooperative Agreement with NASA, facilitating access to its permanent microgravity research environment, a powerful vantage point in low Earth orbit, and the extreme and varied conditions of space. To learn more about the ISS National Lab, visit <span class=\"mdc-article-underline\" data-v-1f1bdc8a=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\"><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4629241-1&amp;h=3704516137&amp;u=https%3A%2F%2Fwww.issnationallab.org%2F&amp;a=our+website\" tabindex=\"0\">our website</a></strong></span>.</p><span><table class=\"mdc-article-table mds-data-table mds-data-table--large\" data-v-0db7e951=\"\"><tbody class=\"mdc-article-table-body mds-data-table__body\"><tr class=\"mdc-article-table-row mds-data-table__row\"><td class=\"mdc-article-table-cell mds-data-table__cell\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Media Contact:</strong></span></p></td><td class=\"mdc-article-table-cell mds-data-table__cell\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span data-v-602de5d2=\"\">Amy Elkavich</span></p></td></tr><tr class=\"mdc-article-table-row mds-data-table__row\"><td class=\"mdc-article-table-cell mds-data-table__cell\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span data-v-602de5d2=\"\">AElkavich@ISSNationalLab.org </span></p></td></tr></tbody></table></span><span><table class=\"mdc-article-table mds-data-table mds-data-table--large\" data-v-0db7e951=\"\"><tbody class=\"mdc-article-table-body mds-data-table__body\"><tr class=\"mdc-article-table-row mds-data-table__row\"><td class=\"mdc-article-table-cell mds-data-table__cell\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">International Space Station (ISS) National Laboratory</strong></span></p></td></tr><tr class=\"mdc-article-table-row mds-data-table__row\"><td class=\"mdc-article-table-cell mds-data-table__cell\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span data-v-602de5d2=\"\">Managed by the Center for the Advancement of Science in Space® (CASIS®)</span></p></td></tr><tr class=\"mdc-article-table-row mds-data-table__row\"><td class=\"mdc-article-table-cell mds-data-table__cell\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span data-v-602de5d2=\"\">1005 Viera Blvd., Suite 101, Rockledge, FL 32955 • 321.253.5101 • www.ISSNationalLab.org</span></p></td></tr></tbody></table></span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img mdc-article-image__img--12-width\" data-v-f0ef0696=\"\" style=\"width:12px;\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://edge.prnewswire.com/c/img/favicon.png?sn=DE97781&amp;sd=2026-02-27\"/></picture></span> View original content to download multimedia:<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://www.prnewswire.com/news-releases/iss-national-lab-sponsored-payloads-return-on-spacex-crs-33-302699748.html\" tabindex=\"0\">https://www.prnewswire.com/news-releases/iss-national-lab-sponsored-payloads-return-on-spacex-crs-33-302699748.html</a></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">SOURCE International Space Station National Lab</p></span>\n</div>",
            "pub_date": "2026-02-28 00:11:12",
            "link": "https://www.morningstar.com/news/pr-newswire/20260227de97781/iss-national-lab-sponsored-payloads-return-on-spacex-crs-33",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Merck Gets CHMP Backing of Keytruda in Certain Ovarian Cancers",
            "description": "<div class=\"mdc-article-body\">\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  By Colin Kellaher </p>\n<pre class=\"mdc-article-pre\" data-v-370ea3ac=\"\"></pre>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Merck &amp; Co. said the European Medicines Agency's Committee for Medicinal Products for Human Use has recommended expanded approval of its blockbuster cancer drug Keytruda for certain patients with ovarian cancer. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  The Rahway, N.J., drugmaker on Friday said the recommendation covers Keytruda in combination with paclitaxel, with or without bevacizumab, for the treatment of platinum resistant epithelial ovarian, fallopian tube or primary peritoneal carcinoma in adults whose tumors express PDL1 with a CPS ≥ 1 and who have received one or two prior systemic treatment regimens. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  The European Commission, which generally follows the CHMP's advice, will review the recommendation and make a final decision. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Keytruda, a cancer drug that harnesses a patient's immune system to fight tumors, is approved in dozens of indications worldwide and generated sales of nearly $31.7 billion last year. </p>\n<pre class=\"mdc-article-pre\" data-v-370ea3ac=\"\"></pre>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Write to Colin Kellaher at colin.kellaher@wsj.com </p>\n<pre class=\"mdc-article-pre\" data-v-370ea3ac=\"\"></pre>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  (END) Dow Jones Newswires</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  February 27, 2026 10:48 ET (15:48 GMT)</p>\n\nCopyright (c) 2026 Dow Jones &amp; Company, Inc.</div>",
            "pub_date": "2026-02-28 00:06:04",
            "link": "https://www.morningstar.com/news/dow-jones/202602277234/merck-gets-chmp-backing-of-keytruda-in-certain-ovarian-cancers",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Block says AI will let it cut more than 4,000 jobs. Some argue that's not the whole story.",
            "description": "<div class=\"mdc-article-body\">\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  By Emily Bary </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Block's 'audacious' move ignites debate over whether the company is using AI as an excuse to walk back reckless hiring </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Block is the parent company of Square and the Cash App. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Block's stock is rocketing 16% after the company said that massive advancements in artificial intelligence are allowing it to cut more than 40% of its workforce. But some argue that the real story is a bit more complicated than that. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     One big question in the wake of Block's (XYZ) job-cuts announcement is whether AI really is the cause of such widespread reductions in head count. For instance, Block's employee count swelled in the years since the COVID-19 pandemic began, going from under 4,000 at the end of 2019 to a recent figure over 10,000. The company, which houses Square and Cash App, will pare its workforce to below 6,000 employees. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     \"How much of this is using AI as a justification to unwind over-hiringduring the COVID-era?\" Deutsche Bank analyst Nate Svensson asked in a note to clients. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     See more: Block plans to lay off nearly half its staff in 'deliberate and bold' embrace of AI </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     The debate became so pronounced on X that Block CEO Jack Dorsey responded to one online critic who slammed his \"managerial incompetence.\" Dorsey argued that he was wrong to hire too many people who ended up serving in redundant roles, but he also said he already \"corrected\" those mistakes more than a year ago. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Dorsey also argued that Block is already being run efficiently. The company has been trying to get more serious about profitability for several years, including streamlining organizational structures and focusing more on respected financial metrics. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     CFO Amrita Ahuja told MarketWatch on Thursday that Block's management thinks the decision would enable it to serve customers better and with a greater emphasis on product velocity. \"We would not do this\" if it weren't for the company's customer focus, she said. \"If we're delivering for customers, we're also delivering for shareholders.\" </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Read: Why did AI 'science fiction' spur market panic? We asked a behavioral-finance expert to find out. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Bernstein analyst Harshita Rawat acknowledged the various puts and takes of Block's \"audacious\" move. On one hand, \"someone can argue that Block is not exactly a poster child of an efficiently run company,\" noting \"duplicate cost functions across Block\" on a historical basis. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     While Rawat didn't exactly get into these matter, the company has also made polarizing acquisitions and drawn criticism for other elements of its spending. For one, Block acquired buy-now-pay-later provider Afterpay in an all-stock deal valued at $29 billion that closed in 2022, but now Block itself is only worth $33 billion. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Last year, the company's third-quarter \"in-person company event\" for employees was so costly that the company had to disclose it as one of the reasons behind a $68 million increase in general and administrative expenses for that period. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     But for all the criticism of Block's inefficiencies, the \"head count actions cannot be explained by 'bloat'\" as \"that problem was somewhat solved from 2023-2025,\" Rawat added. After some adjustments, Block's gross profit per employee was $800,000 at the end of 2025, she said, above what peers like PayPal Holdings (PYPL) and Adyen (NL:ADYEN) showed. The company's guidance implies that the ratio could work out to $1.5 million in 2026, \"exceeding the levels seen at large tech giants.\" </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Elsewhere, analysts saw merit in the AI explanation. \"Block is a tech-forward company that has invested meaningfully in internal AI tools, which is allowing them to take such a drastic action,\" Matthew Coad of Truist Securities said in a note to clients. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     -Emily Bary </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     This content was created by MarketWatch, which is operated by Dow Jones &amp; Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal. </p>\n<pre class=\"mdc-article-pre\" data-v-370ea3ac=\"\"></pre>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  (END) Dow Jones Newswires</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  02-27-26 1054ET</p>\n\nCopyright (c) 2026 Dow Jones &amp; Company, Inc.</div>",
            "pub_date": "2026-02-28 00:06:03",
            "link": "https://www.morningstar.com/news/marketwatch/20260227186/block-says-ai-will-let-it-cut-more-than-4000-jobs-some-argue-thats-not-the-whole-story",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Stanford Study Finds Evidence-Based Reading Intervention Physically Rewires the Dyslexic Brain",
            "description": "<div class=\"mdc-article-body\">\n            \n              \n              Stanford Study Finds Evidence-Based Reading Intervention Physically Rewires the Dyslexic Brain\n              \n            \n            \n              <span>\n<h2 class=\"mdc-article-heading mdc-heading__mdc mdc-heading--level-5__mdc\" data-v-618d53ae=\"\">Stanford Study Finds Evidence-Based Reading Intervention Physically Rewires the Dyslexic Brain</h2>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">PR Newswire</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">SAN LUIS OBISPO, Calif., Feb. 26, 2026</p>\n</span>\n<span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Peer-Reviewed Research Published in <em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">Nature Communications</em> Confirms Lindamood-Bell's Seeing Stars® Program Improves Reading Skills and Strengthens Brain Circuitry in Children with Dyslexia</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span data-v-602de5d2=\"\">SAN LUIS OBISPO, Calif.</span>, <span data-v-602de5d2=\"\">Feb. 26, 2026</span> /PRNewswire/ -- A peer-reviewed study led by Stanford University and published in<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4628753-1&amp;h=1220497055&amp;u=https%3A%2F%2Fwww.nature.com%2Fncomms%2F&amp;a=%C2%A0\" tabindex=\"0\"> </a><em class=\"mdc-article-emphasis\" data-v-370fea16=\"\"><span class=\"mdc-article-underline\" data-v-1f1bdc8a=\"\"><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4628753-1&amp;h=780279387&amp;u=https%3A%2F%2Fwww.nature.com%2Fncomms%2F&amp;a=Nature+Communications\" tabindex=\"0\">Nature Communications</a></span></em> shows that intensive, evidence-based reading instruction not only improves reading skills in children with dyslexia, it physically changes the brain. The six-year randomized controlled trial, conducted in partnership with the University of Washington and Lindamood-Bell Learning Processes, found that children who received intensive reading intervention grew the brain region responsible for word recognition. Children who did not receive intervention showed no comparable change.</p>\n<span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://mma.prnewswire.com/media/2921674/Lindamood_Bell_Learning_Processes_Logo.html\" tabindex=\"0\">\n<span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img\" data-v-f0ef0696=\"\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://mma.prnewswire.com/media/2921674/Lindamood_Bell_Learning_Processes_Logo.jpg\"/></picture></span>\n</a>\n</p>\n</span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">What the Study Found</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Forty-four children with dyslexia, ages 7–13, received eight weeks of intensive instruction using Lindamood-Bell's Seeing Stars® program, delivered live and virtually by trained instructional professionals. A control group of 43 children, including students with and without dyslexia, received no intervention. Brain activity was measured up to five times over one year using functional MRI.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Key findings include:</p><ul class=\"mdc-article-list mdc-article-list--unordered\" data-v-7b473e83=\"\"><li data-v-7b473e83=\"\">Children who received intervention improved their reading levels by approximately one grade level in eight weeks.</li><li data-v-7b473e83=\"\">The Visual Word Form Area (VWFA), the brain region critical for fluent word recognition, grew larger and more detectable in students who received instruction.</li><li data-v-7b473e83=\"\">The VWFA did not show comparable growth in students who received no instruction.</li><li data-v-7b473e83=\"\">Some neurological differences persisted one year later, confirming that dyslexia reflects enduring brain traits alongside the brain's capacity for change.</li></ul><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">What Researchers Said</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\"It's as if evidence-based intervention builds this region in the dyslexic brain,\" said lead researcher Dr. Jason Yeatman of Stanford University. \"The intervention is not only improving reading — it's also building the brain circuit.\"</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Why This Matters</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Dyslexia affects approximately 5–10% of people and is linked to reduced size and responsiveness in the VWFA. This study, funded by the Eunice Kennedy Shriver National Institute of Child Health and Human Development, provides neurobiological evidence that the right instruction can produce measurable brain and behavioral change. Lindamood-Bell donated the intervention used in the research.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">For Lindamood-Bell, the findings validate 40 years of instructional practice focused on building the sensory-cognitive foundations of reading. Effective help exists, and the right instruction can change outcomes.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">About Lindamood-Bell Learning Processes</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">For 40 years, Lindamood-Bell has been committed to helping individuals learn to their potential. Through evidence-based instruction delivered at 46 Learning Centers and through professional development for educators worldwide, Lindamood-Bell addresses the underlying sensory-cognitive processes needed for reading and comprehension. The organization engages in peer-reviewed research with universities, including MIT and Stanford, and continues to advance the science of learning. Visit<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4628753-1&amp;h=3901719558&amp;u=https%3A%2F%2Fwww.lindamoodbell.com%2F&amp;a=%C2%A0\" tabindex=\"0\"> </a><span class=\"mdc-article-underline\" data-v-1f1bdc8a=\"\"><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4628753-1&amp;h=155993183&amp;u=https%3A%2F%2Fwww.lindamoodbell.com%2F&amp;a=www.lindamoodbell.com\" tabindex=\"0\">www.lindamoodbell.com</a></span> to learn more.</p>\n<span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://mma.prnewswire.com/media/2921675/Lindamood_Bell_Learning_Processes_Stanford_study.html\" tabindex=\"0\">\n<span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img\" data-v-f0ef0696=\"\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://mma.prnewswire.com/media/2921675/Lindamood_Bell_Learning_Processes_Stanford_study.jpg\"/></picture></span>\n</a>\n</p>\n</span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img mdc-article-image__img--12-width\" data-v-f0ef0696=\"\" style=\"width:12px;\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://edge.prnewswire.com/c/img/favicon.png?sn=LA97283&amp;sd=2026-02-27\"/></picture></span> View original content to download multimedia:<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://www.prnewswire.com/news-releases/stanford-study-finds-evidence-based-reading-intervention-physically-rewires-the-dyslexic-brain-302699722.html\" tabindex=\"0\">https://www.prnewswire.com/news-releases/stanford-study-finds-evidence-based-reading-intervention-physically-rewires-the-dyslexic-brain-302699722.html</a></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">SOURCE Lindamood-Bell Learning Processes</p></span>\n</div>",
            "pub_date": "2026-02-27 23:55:58",
            "link": "https://www.morningstar.com/news/pr-newswire/20260227la97283/stanford-study-finds-evidence-based-reading-intervention-physically-rewires-the-dyslexic-brain",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Gallant Announces First-of-Its-Kind Partnership with MWI Animal Health to Deliver Anticipated FDA-Conditionally Approved Stem Cell Therapy into Veterinary Clinics",
            "description": "<div class=\"mdc-article-body\">\n            \n              \n              Gallant Announces First-of-Its-Kind Partnership with MWI Animal Health to Deliver Anticipated FDA-Conditionally Approved Stem Cell Therapy into Veterinary Clinics\n              \n            \n            \n              <span>\n<h2 class=\"mdc-article-heading mdc-heading__mdc mdc-heading--level-5__mdc\" data-v-618d53ae=\"\">Gallant Announces First-of-Its-Kind Partnership with MWI Animal Health to Deliver Anticipated FDA-Conditionally Approved Stem Cell Therapy into Veterinary Clinics</h2>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">PR Newswire</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">SAN DIEGO, Feb. 27, 2026</p>\n</span>\n<span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">Agreement establishes first ultra-low temperature cold chain in veterinary medicine ahead of anticipated potential first FDA-approved, off-the-shelf stem cell therapy</em></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span data-v-602de5d2=\"\">SAN DIEGO</span>, <span data-v-602de5d2=\"\">Feb. 27, 2026</span> /PRNewswire/ -- <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4629253-1&amp;h=1822278325&amp;u=http%3A%2F%2Fwww.gallant.com%2F&amp;a=Gallant\" tabindex=\"0\">Gallant</a>, an animal health biotechnology company pioneering off-the-shelf stem cell therapies for pets, today announced a landmark fulfillment agreement with <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4629253-1&amp;h=855554835&amp;u=https%3A%2F%2Fwww.mwiah.com%2F&amp;a=MWI+Animal+Health\" tabindex=\"0\">MWI Animal Health</a> (MWI), part of global healthcare company Cencora, to create the first-ever ultra-low temperature cold chain for veterinary medicine. This comes as Gallant advances toward delivering the potential first-ever FDA-approved off-the-shelf veterinary stem cell therapy, pending conditional approval by the U.S. Food and Drug Administration Center for Veterinary Medicine (FDA-CVM). </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Together, the companies are laying the foundation for a new category of veterinary care.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">The first expected product from Gallant's pipeline is sonruvetcel injectable suspension—a potential first-in-class, uterine-derived allogeneic mesenchymal stromal cell (MSC) therapy for cats with refractory feline chronic gingivostomatitis (rFCGS). Partnership with MWI will enable reliable delivery of veterinary stem cell therapies requiring storage at -80°C.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\"Breakthrough science only matters if we can safely and reliably put it into the hands of veterinary professionals,\" said Dr. Linda Black, DVM, Ph.D., CEO of Gallant. \"With MWI, we are pairing regenerative medicine innovation with world class supply chain management. This partnership helps ensure that, once approved, veterinarians can conveniently access an FDA-regulated, off-the-shelf stem cell therapy with confidence in its quality and integrity.\"</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\"This partnership demonstrates how distribution innovation can unlock clinical innovation,\" said Julia Loew, CCO at MWI Animal Health. \"Stem cell therapies require precision handling. By investing in ultra-low temperature logistics tailored to veterinary practice, we are ensuring that this category of innovation can be delivered to clinics in the exact state intended, ready for safe and effective use.\"</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Under the agreement, MWI will develop and deploy a scalable, ultra-low temperature fulfillment model. It will support nationwide availability through overnight shipping from MWI's Edwardsville, Kansas, distribution center, helping to ensure access for clinics across the continental United States and in noncontiguous U.S. markets, including Alaska, Hawaii, and Puerto Rico.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">The companies expect the partnership to serve as a model by establishing infrastructure that can support Gallant's broader pipeline of disease-modifying therapies targeting inflammatory and degenerative conditions in companion animals.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Expanding the Spectrum of Care</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Recent survey data conducted by Gallant, in collaboration with the American Animal Hospital Association (AAHA), found that nearly 95% of veterinary professionals believe stem cell therapy will become a standard treatment option within the next decade. 79% say they are likely to use or recommend stem cell therapy in the future, and 93% report they would be more likely to offer regenerative therapies in-house if they were off-the-shelf and delivered through a simple IV protocol.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">The Gallant–MWI partnership directly addresses veterinary professionals' expectations and practice needs by pairing an anticipated FDA-regulated, donor-derived stem cell therapy with a clinic-friendly fulfillment model.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">About Gallant</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Gallant is an animal health biotechnology company creating a new category of veterinary medicine with a pipeline of off-the-shelf, ready-to-use stem cell therapies targeting the root causes of disease in pets. Led by pioneers in veterinary regenerative medicine with deep expertise in development, manufacturing and commercialization, Gallant is making regenerative medicine accessible to everyday practice. Learn more at <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4629253-1&amp;h=3828868947&amp;u=http%3A%2F%2Fwww.gallant.com%2F&amp;a=www.gallant.com\" tabindex=\"0\">www.gallant.com</a>.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Media Contact:<br data-v-602de5d2=\"\"/>Julie Lawless - LawlessComms<br data-v-602de5d2=\"\"/>+1.615.585.5861<br data-v-602de5d2=\"\"/><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"mailto:409817@email4pr.com\" tabindex=\"0\">409817@email4pr.com</a></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">Sonruvetcel is an investigational new animal drug and has not yet received FDA conditional approval. Availability is pending regulatory review.</em></p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img mdc-article-image__img--12-width\" data-v-f0ef0696=\"\" style=\"width:12px;\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://edge.prnewswire.com/c/img/favicon.png?sn=PH97792&amp;sd=2026-02-27\"/></picture></span> View original content to download multimedia:<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://www.prnewswire.com/news-releases/gallant-announces-first-of-its-kind-partnership-with-mwi-animal-health-to-deliver-anticipated-fda-conditionally-approved-stem-cell-therapy-into-veterinary-clinics-302699723.html\" tabindex=\"0\">https://www.prnewswire.com/news-releases/gallant-announces-first-of-its-kind-partnership-with-mwi-animal-health-to-deliver-anticipated-fda-conditionally-approved-stem-cell-therapy-into-veterinary-clinics-302699723.html</a></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">SOURCE Gallant</p></span>\n</div>",
            "pub_date": "2026-02-27 23:55:57",
            "link": "https://www.morningstar.com/news/pr-newswire/20260227ph97792/gallant-announces-first-of-its-kind-partnership-with-mwi-animal-health-to-deliver-anticipated-fda-conditionally-approved-stem-cell-therapy-into-veterinary-clinics",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        }
    ]
}