{
    "data": [
        {
            "title": "Cardiff Lexington Subsidiary Nova Ortho and Spine Announces New Healthcare Hires to Support Growth",
            "description": "<div class=\"mdc-article-body\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">LEXINGTON, KY / <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://www.accessnewswire.com/\" tabindex=\"0\">ACCESS Newswire</a> / February 26, 2026 / </strong><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Cardiff Lexington Corporation</strong> (OTCQB:<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">CDIX</strong>), a healthcare holding company with deep leadership and operational expertise in Orthopedics, Spine Care, and Pain Management, today announced that the Company's subsidiary, Nova Ortho and Spine, LLC, has expanded its Florida team with the hiring of two highly qualified procedurally trained and certified nurse practitioners to support increased patient volume and demand throughout the region. These hires demonstrate Cardiff Lexington's ongoing commitment to providing best-in-class healthcare to patient populations throughout Florida, and the continued execution of the Company's growth strategy for Nova Ortho and Spine.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Catherine Amanda Kelly, MSN, APRN, FNP-BC, brings 20 years of clinical experience across procedural, emergency and hospital medicine that should contribute to the growth of Nova Ortho and Spine in Orlando and the Southeastern regions of Florida.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Ashley Logan, APRN- BC, has an extensive background in neurosurgery, orthopedic surgery and pain management. Her experience with procedure medicine, imaging and symptomology evaluations makes her a valuable addition to Nova Ortho and Spine, and her operational expertise will help to significantly improve efficiency, safety and overall patient satisfaction.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Alex Cunningham, Chief Executive Officer of Cardiff Lexington, commented, \"We're very pleased to enhance our team at Nova Ortho and Spine with two highly qualified nurse practitioners with deep experience in the surgical and pain management fields. These new hires support the ongoing growth of Nova Ortho and Spine and the increasing patient volumes that we continue to see throughout Florida. We remain committed to expanding our healthcare footprint with the goal of providing best-in-class healthcare to patient populations throughout the state.\"</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Dr. Kevin Fitzgerald, Chief Medical Officer of Nova Ortho and Spine, commented, \"We're excited to officially welcome Catherine and Ashley to the Nova Ortho and Spine team. Their medical and operational expertise have played an integral role in supporting the increasing patient volume that we're seeing across our network of locations as demand for our services continues to grow.\"</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">About Cardiff Lexington Corporation</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Cardiff Lexington Corporation</strong> (OTCQB:CDIX) is a targeted healthcare holding company dedicated to acquiring and building middle-market niche health care clinics, primarily in Orthopedics, Spine Care, and Pain Management. The Company's partnership-driven culture emphasizes <strong class=\"mdc-article-strong\" data-v-479a2324=\"\">service excellence, teamwork, accountability, and performance</strong>.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">All current revenue is derived from <strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Nova Ortho and Spine, LLC</strong>, which operates a network of regional specialty and ancillary orthopedic care centers across Florida and Georgia. These facilities provide traumatic injury patients with comprehensive diagnostic and surgical services, primary care evaluations, interventional pain management, and specialty consultations.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">For more information on Cardiff Lexington Corporation, you may access the company's website at <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://pr.report/geg3\" tabindex=\"0\">https://cardifflexington.com/</a></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Forward-Looking Statements</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">This press release contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. These statements are based on current expectations, estimates, and projections and involve risks and uncertainties that could cause actual results to differ materially. Cardiff Lexington Corporation undertakes no obligation to update or revise forward-looking statements except as required by law.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Investor Contact</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Cardiff Lexington Investor Relations<br data-v-602de5d2=\"\"/><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"mailto:investorsrelations@cardifflexington.com\" tabindex=\"0\">investorsrelations@cardifflexington.com</a><br data-v-602de5d2=\"\"/>(800) 628-2100 ext. 705</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">or</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">IMS Investor Relations<br data-v-602de5d2=\"\"/><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"mailto:cardifflexington@imsinvestorrelations.com\" tabindex=\"0\">cardifflexington@imsinvestorrelations.com</a><br data-v-602de5d2=\"\"/>(203) 972-9200</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">SOURCE:</strong> Cardiff Lexington Corporation</p><br/><br/>View the original <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://www.accessnewswire.com/newsroom/en/business-and-professional-services/cardiff-lexington-subsidiary-nova-ortho-and-spine-announces-new-1141776\" tabindex=\"0\">press release</a> on ACCESS Newswire<br/><br/>\n<span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img mdc-article-image__img--0-width\" data-v-f0ef0696=\"\" style=\"width:0;\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://app.accessnewswire.com/img.ashx?id=1141776\"/></picture></span></div>",
            "pub_date": "2026-02-26 21:05:32",
            "link": "https://www.morningstar.com/news/accesswire/1141776msn/cardiff-lexington-subsidiary-nova-ortho-and-spine-announces-new-healthcare-hires-to-support-growth",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Canada's Purpose-Built Rental Crisis: Why the Private Sector Must Lead the Way",
            "description": "<div class=\"mdc-article-body\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><em class=\"mdc-article-emphasis\" data-v-370fea16=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Ladan Hosseinzadeh Sadeghi, President &amp; CEO of Sky Property Group Inc., says the country's rental housing shortage requires bold private-sector investment - not just government promises.</strong></em></p> <p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">TORONTO, ON / <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://www.accessnewswire.com/\" tabindex=\"0\">ACCESS Newswire</a> / February 26, 2026 / </strong>Canada is in the middle of a rental housing emergency, and no one is coming to save it. That is the frank assessment of Ladan Hosseinzadeh Sadeghi, President &amp; CEO of Sky Property Group Inc., who has spent more than a decade building residential and mixed-use communities across Ontario.</p><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://app.accessnewswire.com/imagelibrary/fad6a8bf-ff29-47ad-bb5a-781df4d8e6f3/image.png\" tabindex=\"0\"><span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img\" data-v-f0ef0696=\"\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://app.accessnewswire.com/imagelibrary/fad6a8bf-ff29-47ad-bb5a-781df4d8e6f3/1140512/image.png\"/></picture></span></a><span> </span><span> </span><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\"We have been talking about the rental housing shortage in this country for years,\" said Hosseinzadeh Sadeghi. \"And the conversation keeps happening while the vacancy rates stay near zero and rents keep climbing. At some point, the private sector has to stop waiting for policy to catch up and start building.\"</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">The numbers make a compelling case for urgency. Canada's national residential vacancy rate hovered near 1.5 percent in major urban centres as of late 2025, according to Canada Mortgage and Housing Corporation (CMHC) data - well below the 3 percent generally considered a balanced rental market. In Toronto, Vancouver, and Calgary, the picture is even more dire. Newcomers, students, and young professionals are competing for a dangerously thin supply of purpose-built rental units that simply does not exist at the scale needed.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">What Is Purpose-Built Rental - and Why Does It Matter?</strong></p><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://app.accessnewswire.com/imagelibrary/8e2d9164-c4c5-49f5-a1e0-63b613a2c563/image.png\" tabindex=\"0\"><span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img\" data-v-f0ef0696=\"\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://app.accessnewswire.com/imagelibrary/8e2d9164-c4c5-49f5-a1e0-63b613a2c563/1140512/image.png\"/></picture></span></a><span> </span><span> </span><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Purpose-built rental housing refers to residential buildings constructed with the explicit intention of renting units long-term, rather than selling them as condominiums. Unlike condos, where individual investors may rent out units informally, purpose-built rentals offer more stability, longer tenancies, and often better amenities for residents who prefer or need to rent.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">But for years, developers in Canada overwhelmingly favoured condo construction over purpose-built rental because the financial model made more sense: pre-sales generated construction financing and delivered faster returns. The result was a lopsided housing ecosystem - thousands of new condo units entering the market, while dedicated rental stock stagnated.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\"The incentives were misaligned for a long time,\" Hosseinzadeh Sadeghi explained. \"Building rental meant carrying long-term operational costs and waiting years for a return. But those economics are changing. Interest rates have moderated, government incentive programs have improved, and frankly, the demand is undeniable. The rental market in this country is enormous - and underserved.\"</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Federal and Provincial Programs Are Moving the Needle</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Recent years have seen meaningful policy shifts at both federal and provincial levels. The federal government's Apartment Construction Loan Program (ACLP) - formerly the Rental Construction Financing Initiative - has expanded its envelope significantly, offering low-cost, long-term financing to developers who build purpose-built rental units. In Ontario, the province has moved to remove development charges on certain rental projects, reducing the upfront cost burden that has historically deterred builders.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Hosseinzadeh Sadeghi is cautiously optimistic about these changes, though she believes execution - not announcement - is what will define success.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\"Policy moves in the right direction, and then implementation lags by two or three years,\" she said. \"In real estate, time is money and time is people. Every year we delay is another year that families are paying too much for housing that doesn't meet their needs. We need approval timelines to shrink, we need clarity on density permissions, and we need municipalities and provinces to align their signals.\"</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Sky Property Group has been positioning itself at the intersection of market-rate and attainable rental development, identifying sites in Ontario communities where population growth is outpacing supply. The company's approach emphasizes mixed-income rental buildings that serve a wide range of tenants - from young professionals entering the housing market to seniors looking to downsize without leaving their communities.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">The Immigration Factor</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Canada's population grew by more than one million people in 2024, driven largely by international migration targets that successive federal governments have pursued as an economic growth strategy. While immigration has been an engine of economic vitality, it has also placed enormous pressure on rental markets in cities that were already stretched.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\"When you bring in hundreds of thousands of people who need a place to live - and most of them will rent before they buy - you need the housing to be there,\" Hosseinzadeh Sadeghi said. \"We didn't build it fast enough, and now we're paying the price in rents, in competition, and in social tension that didn't have to happen.\"</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">She is careful not to frame immigration as the problem - rather, the failure to plan ahead for it. \"Every one of those newcomers is a future homeowner, a future business owner, a future contributor. The question is whether we give them a dignified place to land. Right now, we're not doing that well enough.\"</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Financing Innovation and Institutional Appetite</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">One encouraging trend Hosseinzadeh Sadeghi highlights is the growing appetite among institutional investors - pension funds, insurance companies, and REITs - for purpose-built rental assets. Unlike condo speculation, purpose-built rental offers stable, long-term cash flows that align well with institutional investment horizons.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\"We're seeing pension money take a serious look at Canadian rental housing in a way they didn't ten years ago,\" she said. \"That's good for the industry. It brings patient capital and professional asset management to a sector that needs it.\"</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Sky Property Group has been exploring joint-venture structures that pair private development expertise with institutional capital, a model Hosseinzadeh Sadeghi believes can unlock projects that would otherwise be unviable under traditional financing.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">What Needs to Happen Next</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">When asked what she would tell Canada's housing ministers if given thirty minutes, Hosseinzadeh Sadeghi doesn't hesitate.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\"Speed up approvals, protect rental tenure, and stop changing the rules mid-project,\" she said. \"Developers can absorb risk. What we can't absorb is uncertainty. When the goalposts move after we've already committed capital, projects die. And when projects die, units don't get built.\"</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">She also advocates for greater use of modular and mass timber construction as tools to reduce build times and costs - technologies she believes remain underutilized in Canada relative to their potential.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\"We have the land. We have the capital markets starting to come along. We have government programs that are better than they were five years ago,\" she said. \"What we need now is alignment and urgency. Canada can fix this - but not by talking about it.\"</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">About Sky Property Group Inc.</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Sky Property Group Inc. is a Toronto-based real estate development and investment company led by President &amp; CEO Ladan Hosseinzadeh Sadeghi. The company specializes in residential and mixed-use development across Ontario, with a focus on sustainable, community-centred projects that meet the evolving needs of Canadian renters and homeowners.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Contact:</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Ladan Hosseinzadeh Sadeghi<br data-v-602de5d2=\"\"/><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"mailto:ladanhosseinzadehsadeghi@gmail.com\" tabindex=\"0\">ladanhosseinzadehsadeghi@gmail.com</a></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">SOURCE:</strong> Sky Property Group Inc.</p><br/><br/>View the original <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://www.accessnewswire.com/newsroom/en/business-and-professional-services/canadas-purpose-built-rental-crisis-why-the-private-sector-must-1140512\" tabindex=\"0\">press release</a> on ACCESS Newswire<br/><br/>\n<span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img mdc-article-image__img--0-width\" data-v-f0ef0696=\"\" style=\"width:0;\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://app.accessnewswire.com/img.ashx?id=1140512\"/></picture></span></div>",
            "pub_date": "2026-02-26 21:05:31",
            "link": "https://www.morningstar.com/news/accesswire/1140512msn/canadas-purpose-built-rental-crisis-why-the-private-sector-must-lead-the-way",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Global Solenoid Valve Market to Reach USD 5.8 Billion by 2036 as Smart Automation Redefines Flow Control",
            "description": "<div class=\"mdc-article-body\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><em class=\"mdc-article-emphasis\" data-v-370fea16=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Intelligent Valve Systems Transition from Commodity Components to Core Industry 4.0 Enablers Driving Predictive Control and Energy Optimization.</strong></em></p> <p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">NEWARK, DE / <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://www.accessnewswire.com/\" tabindex=\"0\">ACCESS Newswire</a> / February 26, 2026 / </strong>The global <strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Solenoid Valve Market</strong> is entering a decisive transformation phase, forecast to expand from <strong class=\"mdc-article-strong\" data-v-479a2324=\"\">USD 3.2 billion in 2026 to USD 5.8 billion by 2036</strong>, registering a robust <strong class=\"mdc-article-strong\" data-v-479a2324=\"\">CAGR of 6.1%</strong>. The growth trajectory reflects a structural evolution in industrial automation, where electrically actuated valves are replacing manual flow control systems across manufacturing, energy, water treatment, and process industries.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">According to the latest analysis by Future Market Insights (FMI), solenoid valves are no longer viewed as auxiliary components. Instead, they are emerging as intelligent control nodes embedded within Industry 4.0 ecosystems, supporting predictive maintenance, energy optimization, and safety compliance frameworks.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Get Access of Report Sample: </strong><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://pr.report/j3ak\" tabindex=\"0\">https://www.futuremarketinsights.com/reports/sample/rep-gb-17425</a></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Smart Manufacturing Drives Structural Demand Shift</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Between 2026 and 2036, the industry is transitioning from cost-based component procurement toward performance-led system integration. Previously, solenoid valves were selected primarily for basic on/off control in conventional industrial systems.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Today, digital transformation is reshaping expectations. Modern plants increasingly require:</p><ul class=\"mdc-article-list mdc-article-list--unordered\" data-v-7b473e83=\"\"><li data-v-7b473e83=\"\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Remote monitoring and IoT-enabled diagnostics</p></li><li data-v-7b473e83=\"\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Faster response times and precision flow control</p></li><li data-v-7b473e83=\"\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Fail-safe positioning aligned with global safety standards</p></li><li data-v-7b473e83=\"\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Seamless integration into PLC and SCADA architectures</p></li></ul><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">This evolution aligns with Industry 4.0 adoption across key industrial economies, where real-time process control and automation reliability are paramount.</p><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://app.accessnewswire.com/imagelibrary/8c5e466c-7fe7-4adb-9f96-b4bd8b08bf06/solenoid-valve-market-accesswire.jpg\" tabindex=\"0\"><span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img\" data-v-f0ef0696=\"\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://app.accessnewswire.com/imagelibrary/8c5e466c-7fe7-4adb-9f96-b4bd8b08bf06/1140842/solenoid-valve-market-accesswire.jpg\"/></picture></span></a><span> </span><span> </span><span> </span><span> </span><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Market Snapshot (2026-2036)</strong></p><table class=\"mdc-article-table mds-data-table mds-data-table--large\" data-v-0db7e951=\"\"><thead class=\"mdc-article-table-header mds-data-table__header\"><tr class=\"mdc-article-table-row mds-data-table__row\"><th class=\"mdc-article-table-head mds-data-table__header-cell\"><div class=\"mds-data-table__header-cell-inner\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Metric</strong></span></p></div></th><th class=\"mdc-article-table-head mds-data-table__header-cell\"><div class=\"mds-data-table__header-cell-inner\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Value</strong></span></p></div></th></tr></thead><tbody class=\"mdc-article-table-body mds-data-table__body\"><tr class=\"mdc-article-table-row mds-data-table__row\"><td class=\"mdc-article-table-cell mds-data-table__cell\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span data-v-602de5d2=\"\">Market Value (2026)</span></p></td><td class=\"mdc-article-table-cell mds-data-table__cell\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span data-v-602de5d2=\"\">USD 3.2 Billion</span></p></td></tr><tr class=\"mdc-article-table-row mds-data-table__row\"><td class=\"mdc-article-table-cell mds-data-table__cell\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span data-v-602de5d2=\"\">Forecast Value (2036)</span></p></td><td class=\"mdc-article-table-cell mds-data-table__cell\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span data-v-602de5d2=\"\">USD 5.8 Billion</span></p></td></tr><tr class=\"mdc-article-table-row mds-data-table__row\"><td class=\"mdc-article-table-cell mds-data-table__cell\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span data-v-602de5d2=\"\">Projected CAGR</span></p></td><td class=\"mdc-article-table-cell mds-data-table__cell\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span data-v-602de5d2=\"\">6.1%</span></p></td></tr><tr class=\"mdc-article-table-row mds-data-table__row\"><td class=\"mdc-article-table-cell mds-data-table__cell\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span data-v-602de5d2=\"\">Leading Valve Type</span></p></td><td class=\"mdc-article-table-cell mds-data-table__cell\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span data-v-602de5d2=\"\">Direct Acting (64.8% Share)</span></p></td></tr><tr class=\"mdc-article-table-row mds-data-table__row\"><td class=\"mdc-article-table-cell mds-data-table__cell\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span data-v-602de5d2=\"\">Dominant Application</span></p></td><td class=\"mdc-article-table-cell mds-data-table__cell\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span data-v-602de5d2=\"\">Normally Closed (58.4% Share)</span></p></td></tr></tbody></table><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Direct Acting Valves Maintain Dominance</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">By valve type, <strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Direct Acting Solenoid Valves</strong> command <strong class=\"mdc-article-strong\" data-v-479a2324=\"\">64.8% of the global market share</strong>, driven by their operational simplicity and compatibility with low-to-medium pressure systems. These valves open without requiring pilot pressure, making them highly suitable for industrial automation builds prioritizing reliability and straightforward installation.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Pilot-operated valves, accounting for 35.2% share, are gaining traction in high-flow and high-pressure environments where amplified actuation and enhanced performance stability are essential.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Safety Logic Shapes Application Demand</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Application segmentation reveals that <strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Normally Closed valves</strong> hold <strong class=\"mdc-article-strong\" data-v-479a2324=\"\">58.4% share</strong>, reflecting industrial design principles centered on fail-safe behavior. In many hazardous environments, isolating flow during power loss represents the safest operational state.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Conversely, <strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Normally Open valves</strong> account for 41.6%, primarily serving cooling and purge applications where maintaining flow continuity ensures system stability during unexpected shutdowns.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Regional Outlook: Automation Intensity Defines Growth</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Global adoption varies based on industrial policy, automation maturity, and manufacturing scale.</p><ul class=\"mdc-article-list mdc-article-list--unordered\" data-v-7b473e83=\"\"><li data-v-7b473e83=\"\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">India (7.8% CAGR):</strong> Accelerated industrial digitization initiatives and rapid manufacturing expansion are fueling adoption.</p></li><li data-v-7b473e83=\"\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">China (7.2% CAGR):</strong> State-backed smart manufacturing programs are elevating component standards and integration requirements.</p></li><li data-v-7b473e83=\"\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">USA (6.4% CAGR):</strong> Reshoring initiatives and semiconductor manufacturing expansion are driving high-reliability fluid control demand.</p></li><li data-v-7b473e83=\"\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Germany (5.9% CAGR):</strong> Industrie 4.0 architecture emphasizes interoperability and precision engineering.</p></li><li data-v-7b473e83=\"\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Japan (5.7% CAGR):</strong> Labor shortages and advanced robotics integration are reinforcing automation investments.</p></li></ul><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">These markets collectively define the next wave of intelligent valve deployment across automation-driven economies.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Energy Efficiency and Compliance as Core Catalysts</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Beyond automation, energy optimization is emerging as a measurable growth driver. Industrial facilities are increasingly implementing interlocked solenoid shutoff systems to reduce compressed air losses and idle energy consumption.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Simultaneously, evolving regulatory frameworks in process industries-particularly oil &amp; gas, pharmaceuticals, and water treatment-are raising the bar for operational transparency and system reliability. Solenoid valves are being specified earlier in design cycles as part of safety-instrumented systems rather than as aftermarket components.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Competitive Landscape: Smart Integration Takes Center Stage</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">The competitive environment is characterized by engineering depth and smart connectivity innovation. Leading global players include:</p><ul class=\"mdc-article-list mdc-article-list--unordered\" data-v-7b473e83=\"\"><li data-v-7b473e83=\"\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">ASCO Valve Inc</strong></p></li><li data-v-7b473e83=\"\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Parker Hannifin Corporation</strong></p></li><li data-v-7b473e83=\"\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Burkert Fluid Control Systems</strong></p></li><li data-v-7b473e83=\"\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Emerson Electric Co.</strong></p></li><li data-v-7b473e83=\"\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Danfoss Group</strong></p></li><li data-v-7b473e83=\"\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">SMC Corporation</strong></p></li><li data-v-7b473e83=\"\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Festo AG &amp; Co. KG</strong></p></li><li data-v-7b473e83=\"\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Norgren Ltd.</strong></p></li></ul><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Market leaders are shifting from standardized production toward IoT-integrated valve platforms featuring predictive diagnostics, enhanced coil performance, and real-time data transmission. This movement strengthens long-term partnerships with automation system integrators and OEMs.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">From Component to Intelligent Asset</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Pre-2026, solenoid valves were largely commoditized hardware selected on price and availability. The 2026-2036 decade marks a pivotal transformation where intelligent valve systems contribute directly to uptime assurance, process stability, and regulatory compliance.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Smart solenoid valves equipped with embedded sensors and condition-monitoring capabilities are enabling:</p><ul class=\"mdc-article-list mdc-article-list--unordered\" data-v-7b473e83=\"\"><li data-v-7b473e83=\"\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Predictive maintenance scheduling</p></li><li data-v-7b473e83=\"\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Reduced unplanned downtime</p></li><li data-v-7b473e83=\"\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Improved lifecycle traceability</p></li><li data-v-7b473e83=\"\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Lower total cost of ownership</p></li></ul><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">This paradigm shift is redefining the value proposition from actuation to operational intelligence.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Market Definition and Scope</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">The solenoid valve market encompasses electrically actuated valves designed for fluid flow control across industrial automation, oil &amp; gas, water treatment, automotive, pharmaceutical, and food &amp; beverage sectors.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Included within scope:</p><ul class=\"mdc-article-list mdc-article-list--unordered\" data-v-7b473e83=\"\"><li data-v-7b473e83=\"\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Direct acting and pilot operated designs</p></li><li data-v-7b473e83=\"\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Normally closed and normally open configurations</p></li><li data-v-7b473e83=\"\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Smart-connected and diagnostic-enabled systems</p></li></ul><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Excluded from scope:</p><ul class=\"mdc-article-list mdc-article-list--unordered\" data-v-7b473e83=\"\"><li data-v-7b473e83=\"\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Manual or pneumatic-only valves</p></li><li data-v-7b473e83=\"\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Hydraulic actuators not based on electromagnetic principles</p></li><li data-v-7b473e83=\"\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Non-industrial or residential-grade fluid control devices</p></li></ul><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Outlook: Precision, Connectivity, and Assurance</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">By 2036, solenoid valves will represent a foundational layer within global automation infrastructures. As factories prioritize predictive maintenance, cybersecurity compliance, and real-time process intelligence, valve systems will continue evolving into data-enabled control assets.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">With smart manufacturing initiatives accelerating worldwide, the solenoid valve market is positioned not merely for expansion-but for reinvention-at the core of next-generation industrial ecosystems.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">For an in-depth analysis of evolving formulation trends and to access the complete strategic outlook for the Compact Construction Equipment Market through 2036, Full Report Request: </strong><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://pr.report/j3al\" tabindex=\"0\">https://www.futuremarketinsights.com/reports/solenoid-valve-market</a></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Related Reports:</p><ul class=\"mdc-article-list mdc-article-list--unordered\" data-v-7b473e83=\"\"><li data-v-7b473e83=\"\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">United States Solenoid Valve Market- <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://pr.report/j3am\" tabindex=\"0\">https://www.futuremarketinsights.com/reports/solenoid-valve-industry-analysis-in-the-united-states</a></p></li><li data-v-7b473e83=\"\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">HVAC Valve Market- <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://pr.report/j3an\" tabindex=\"0\">https://www.futuremarketinsights.com/reports/hvac-valve-market</a></p></li><li data-v-7b473e83=\"\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Valve Grinder Market- <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://pr.report/j3ao\" tabindex=\"0\">https://www.futuremarketinsights.com/reports/valve-grinder-market</a></p></li></ul><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">About Future Market Insights (FMI)</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Future Market Insights (FMI) is a leading provider of market intelligence and consulting services, serving clients in over 150 countries. Headquartered in Delaware, USA, with a global delivery center in India and offices in the UK and UAE, FMI delivers actionable insights to businesses across industries including automotive, technology, consumer products, manufacturing, energy, and chemicals.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">An ESOMAR-certified research organization, FMI provides custom and syndicated market reports and consulting services, supporting both Fortune 1,000 companies and SMEs. Its team of 300+ experienced analysts ensures credible, data-driven insights to help clients navigate global markets and identify growth opportunities.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">For Press &amp; Corporate Inquiries</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Rahul Singh</strong><br data-v-602de5d2=\"\"/><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">AVP - Marketing and Growth Strategy</strong><br data-v-602de5d2=\"\"/><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Future Market Insights, Inc.</strong><br data-v-602de5d2=\"\"/>+91 8600020075<br data-v-602de5d2=\"\"/>For Sales - <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"mailto:sales@futuremarketinsights.com\" tabindex=\"0\">sales@futuremarketinsights.com</a><br data-v-602de5d2=\"\"/>For Media - <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"mailto:Rahul.singh@futuremarketinsights.com\" tabindex=\"0\">Rahul.singh@futuremarketinsights.com</a><br data-v-602de5d2=\"\"/>For web - <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://pr.report/j3ap\" tabindex=\"0\">https://www.futuremarketinsights.com/</a></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">SOURCE: </strong>Future Market Insights, Inc.</p><br/><br/>View the original <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://www.accessnewswire.com/newsroom/en/business-and-professional-services/global-solenoid-valve-market-to-reach-usd-5.8-billion-by-2036-as-1140842\" tabindex=\"0\">press release</a> on ACCESS Newswire<br/><br/>\n<span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img mdc-article-image__img--0-width\" data-v-f0ef0696=\"\" style=\"width:0;\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://app.accessnewswire.com/img.ashx?id=1140842\"/></picture></span></div>",
            "pub_date": "2026-02-26 20:51:37",
            "link": "https://www.morningstar.com/news/accesswire/1140842msn/global-solenoid-valve-market-to-reach-usd-58-billion-by-2036-as-smart-automation-redefines-flow-control",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "TD Bank Quarterly Earnings Lifted by Growth Across Operations",
            "description": "<div class=\"mdc-article-body\">\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  By Robb M. Stewart </p>\n<pre class=\"mdc-article-pre\" data-v-370ea3ac=\"\"></pre>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Toronto-Dominion Bank's earnings jumped in the first three months of its fiscal year as the big Canadian lender saw revenue growth across its operations, including record revenue in Canada on the back of a rise in loan and deposit volumes and strength in its wealth-management and markets-facing segments. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Net income climbed to 4.04 billion Canadian dollars (US$2.96 billion), or C$2.34 a share, from C$2.79 billion, or C$1.55, a year earlier. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Stripping out items that the bank doesn't believe reflect the underlying performance of its business, such as restructuring costs, first-quarter per-share earnings came in at C$2.44, well above the C$2.26 mean estimate of analysts polled by FactSet. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Overall revenue was up 18% for the three months to Jan. 31 at C$16.59 billion, beating the C$14.52 billion expected. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  The rise in earnings for TD, Canada's second-largest bank by market value, was helped by a decline in the lender's provision for credit losses to C$1.04 billion from C$1.21 billion in the same period last year. Still, that was higher than the C$1.11 billion economists expected TD to have set aside in against the risk of loans defaulting, and it marked an increase of C$57 million from the final quarter of fiscal 2025. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Compared with a year prior, TD said its provision on impaired loans declined about 4%, with lower provisions in the Canadian and U.S. commercial-banking segments and U.S. consumer-lending portfolios, while the bank recorded a recovery in its credit-loss provision on performing loans of C$125 million with a migration from performing to impaired in the wholesale and U.S. commercial-lending portfolios, as well as an improvement in its Canadian and U.S. macroeconomic forecasts. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Across its business, revenue from Canadian personal and commercial banking was up 5.3% on a year earlier to C$5.42 billion. The operations saw volume growth and higher loan margins, with average loan volumes increasing about 5% and deposit volumes rising some 3% with increases in personal and business deposits. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  U.S. banking revenue jumped 39% to C$4.09 billion following recent balance-sheet restructuring efforts and a fall in credit-loss provisions. Wealth-management and insurance-division revenue increased 8.6% to C$3.91 billion and TD's wholesale-banking revenue advanced 24% to C$2.47 billion. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  TD capital position remained strong. Its common equity Tier 1 capital ratio stood at 14.5% as of the end of January, compared with 13.1% a year earlier. Canada's banking regulator requires the big lenders to maintain a capital ratio of at least 11.5% of risk-weighted assets. </p>\n<pre class=\"mdc-article-pre\" data-v-370ea3ac=\"\"></pre>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Write to Robb M. Stewart at robb.stewart@wsj.com </p>\n<pre class=\"mdc-article-pre\" data-v-370ea3ac=\"\"></pre>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  (END) Dow Jones Newswires</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  February 26, 2026 07:46 ET (12:46 GMT)</p>\n\nCopyright (c) 2026 Dow Jones &amp; Company, Inc.</div>",
            "pub_date": "2026-02-26 20:51:36",
            "link": "https://www.morningstar.com/news/dow-jones/202602268636/td-bank-quarterly-earnings-lifted-by-growth-across-operations",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Cass Information Systems and Caspian Partner to Deliver Comprehensive Tariff Cost Management Solution",
            "description": "<div class=\"mdc-article-body\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nCass Information Systems and Caspian Partner to Deliver Comprehensive Tariff Cost Management Solution\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.cassinfo.com%2F&amp;esheet=54433759&amp;newsitemid=20260226554201&amp;lan=en-US&amp;anchor=Cass+Information+Systems%2C+Inc.&amp;index=1&amp;md5=92e925173c5e1f2fe7c3a7e07cb7466b\" tabindex=\"0\">Cass Information Systems, Inc.</a> (Nasdaq: CASS), a leading provider of enterprise payment and spend management solutions, today announced a strategic partnership with <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fmeetcaspian.com%2F&amp;esheet=54433759&amp;newsitemid=20260226554201&amp;lan=en-US&amp;anchor=Caspian&amp;index=2&amp;md5=9b04f5ca0d87d98a9cc4cd69bd39c616\" tabindex=\"0\">Caspian</a>, the AI command center for customs refunds. Together, the companies will deliver a comprehensive tariff cost management solution designed to help U.S. importers improve cash flow, strengthen compliance, and better understand their true landed product costs.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Addressing Critical Supply Chain Challenges</strong>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nOngoing tariff complexity and difficult customs processes continue to elevate compliance and financial risks for U.S. importers.\n\n</p><ul class=\"mdc-article-list mdc-article-list--unordered\" data-v-7b473e83=\"\">\n<li data-v-7b473e83=\"\">\nRefunds opportunities go undetected, unrecovered or become stuck in endless red tape\n\n</li>\n<li data-v-7b473e83=\"\">\nCompliance posture &amp; supply chain planning are reactive to geopolitics\n\n</li>\n<li data-v-7b473e83=\"\">\nPricing strategy lacks visibility to trends in product-level duty burdens\n\n</li>\n</ul><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nShippers need processes and technology that improve financial controls and supply chain resiliency, while reducing the work they face each day.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">A Connected Tariff Spend Management Offering</strong>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nThe Cass–Caspian partnership will deliver an integrated solution connecting payment, audit, compliance, recovery, and improved visibility. To enhance Cass payments and reporting, Caspian will contribute AI‑driven HTS modeling, detailed tariff audit capabilities, refund identification, and full support for post summary corrections (PSC), protests, and duty drawback programs.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nCass clients who leverage its established ocean audit capabilities and the new tariff solution will achieve true excellence in managing the costs of global trade.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Benefits to Importers: Post-Entry Process on Autopilot</strong>\n</p><ul class=\"mdc-article-list mdc-article-list--unordered\" data-v-7b473e83=\"\">\n<li data-v-7b473e83=\"\">\nReduce tariff spend by addressing misclassifications and overpayments\n\n</li>\n<li data-v-7b473e83=\"\">\nAccelerate refunds by completing audits &amp; corresponding correction filings in days\n\n</li>\n<li data-v-7b473e83=\"\">\nStrengthen CBP compliance posture by creating searchable records databases &amp; auditing shipments pre- and post-entry via integrated data feeds\n\n</li>\n<li data-v-7b473e83=\"\">\nIncrease resiliency by identifying trade compliance gaps, streamlining time-sensitive payments, and leveraging tariff refund eligibility logic that is updated daily\n\n</li>\n<li data-v-7b473e83=\"\">\nManage global trade costs (freight and duties) in one platform, with one payment process\n\n</li>\n</ul><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Leadership Perspectives</strong>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n“This partnership strengthens our ability to help importers manage tariff costs with greater accuracy and transparency,” said Tony Urban, president of Cass’s freight payment organization. “Cass has supported duty payments for years. Now by adding Caspian’s compliance, audit, and recovery capabilities, we’re able to deliver the comprehensive solution our clients have been asking for.”\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n“Caspian brings a best-in-class AI-driven tariff audit engine and advanced HTS modeling to this partnership, and our team has decades of combined experience in customs brokerage and supply chain technology,” said Justin Sherlock, co-founder and CEO of Caspian. “Together, we’ll help importers close compliance gaps, maximize tariff refunds, and increase transparency throughout the shipping lifecycle.”\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nTo learn more, contact <strong class=\"mdc-article-strong\" data-v-479a2324=\"\"><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"mailto:cassmarketing@cassinfo.com\" tabindex=\"0\">cassmarketing@cassinfo.com</a></strong>.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">About Cass Information Systems</strong>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nCass Information Systems, Inc. is a leading provider of enterprise payment and spend management solutions, helping clients manage and optimize complex facilities and transportation spend through intelligent automation, accurate auditing, and centralized visibility.<em class=\"mdc-article-emphasis\" data-v-370fea16=\"\"></em>Disbursing over $94 billion annually on behalf of clients, and with total assets of $2.6 billion, Cass is uniquely supported by Cass Commercial Bank. Founded in 1906 and a wholly owned subsidiary, Cass Commercial Bank provides sophisticated financial exchange services to the parent organization and its clients. Cass is part of the Russell 2000®. More information is available at <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.cassinfo.com&amp;esheet=54433759&amp;newsitemid=20260226554201&amp;lan=en-US&amp;anchor=www.cassinfo.com&amp;index=3&amp;md5=dce2dbdcc694d8bfd0b059d309b274c4\" tabindex=\"0\">www.cassinfo.com</a>.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">About Caspian</strong>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nCaspian is the first AI‑native trade advisory platform for international supply chains, specializing in duty drawback and tariff refund processing. Founded in 2024, Caspian is a U.S.-licensed customs broker and ABI software vendor, helping importers simplify trade processes, strengthen compliance, and recover millions in overpaid duties. Learn more at <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.meetcaspian.com&amp;esheet=54433759&amp;newsitemid=20260226554201&amp;lan=en-US&amp;anchor=www.meetcaspian.com&amp;index=4&amp;md5=e1dbe8745ea985a6e904d46e982495d4\" tabindex=\"0\">www.meetcaspian.com</a>.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img\" data-v-f0ef0696=\"\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20260226554201r1&amp;sid=mstr3&amp;distro=nx&amp;lang=en\"/></picture></span><span data-v-602de5d2=\"\"></span></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\"><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"mailto:cassmarketing@cassinfo.com\" tabindex=\"0\">cassmarketing@cassinfo.com</a></strong>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span data-v-602de5d2=\"\">View source version on businesswire.com: </span><span data-v-602de5d2=\"\"><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://www.businesswire.com/news/home/20260226554201/en/\" tabindex=\"0\">https://www.businesswire.com/news/home/20260226554201/en/</a></span></p></div>",
            "pub_date": "2026-02-26 20:40:48",
            "link": "https://www.morningstar.com/news/business-wire/20260226554201/cass-information-systems-and-caspian-partner-to-deliver-comprehensive-tariff-cost-management-solution",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Fed's Bostic Says People Have Begun to Doubt Fed Independence",
            "description": "<div class=\"mdc-article-body\">\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Fed's Bostic Says People Have Begun to Doubt Fed Independence By Vicky Ge Huang </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Atlanta Fed President Raphael Bostic said Wednesday that the rift between the Federal Reserve and the White House has begun to erode trust in the central bank's apolitical standing, one of the most direct warnings yet from a top monetary-policy official about the consequences of President Trump's aggressive stance toward the Fed. Meanwhile, Kansas City Fed President Jeff Schmid, one of the three dissenters in the Fed's December quarter-point rate cut decision, continued to express his concerns about inflation. Elsewhere, Bank of Japan policy board member Hajime Takata said that with deflation now firmly in the rearview mirror, the path is clear for the Japanese central bank to raise interest rates sooner rather than later. And South Korea's central bank held its policy rate on hold for a sixth straight meeting and raised its growth and inflation forecasts for this year, </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Top News Fed's Bostic Says People Have Begun to Doubt Fed Independence </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Writing in a farewell essay ahead of his scheduled retirement at the end of February, Atlanta Fed President Raphael Bostic said his colleagues in the Federal Reserve system remain committed to insulating their work from politics. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     \"But my travels over the past several months have made clear that the legal and rhetorical battles raging around the central bank right now have caused people across a wide cross-section of our population to begin to doubt the Fed's independence , \" Bostic wrote. \"This is a major concern.\" </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Kansas City's Schmid Says Fed Has Work to Do With Inflation </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Speaking at the Economic Club of Colorado, Kansas City Fed President Jeff Schmid said \"I think we have work to do on the inflation side of things , \" regarding the Fed's dual mandate of price stability and maximum employment. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     \"I think we're in a pretty good place for employment, even though, structurally, some things are changing in the labor market,\" he added. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Bank of Japan's Most Hawkish Member Says Rate Hike Needed Soon </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Bank of Japan policy board member Hajime Takata said in a speech Thursday: \"I believe the bank should make a further gear shift, and engage in communication that assumes that the price stability target is almost achieved.\" </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     He also flagged the risk that an external shock could drive Japan's inflation up more than expected. Takata is seen as the BOJ board's most prominent policy hawk . In January, he was the lone dissenter in an 8-1 decision to hold the policy rate at 0.75%, instead proposing a hike to 1.0%. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Bank of Korea Holds Rates Steady, Lifts Growth Forecast </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     The Bank of Korea on Thursday left its benchmark seven-day repurchase rate at 2.50% . Twenty-one of 25 analysts polled by The Wall Street Journal had expected the decision. Most expect the bank to hold rates steady this year, with some projecting possible increases in 2027. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Trade Remains 'Challenging' for Eurozone, ECB's Lagarde Says </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Eurozone exporters continue to have greater difficulty finding overseas buyers , thanks in part to changeable policy in the U.S., European Central Bank President Christine Lagarde said Thursday. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     U.S. Economy The Math Behind Trump's Eye-Catching Economic Ideas </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     In a record-length State of the Union address, President Trump threw out a string of eye-catching economic ideas. His proposals and promises come as American voters are increasingly frustrated with the economy. About 56% of Americans disapprove of his handling of it, compared with about 40% who approve, according to an average of polls collected by the nonpartisan Cook Political Report. Here's a look at the math </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  behind some of Trump's economic notions </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Americans Are Leaving the U.S. in Record Numbers </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Last year the U.S. experienced something that hasn't definitively occurred since the Great Depression: More people moved out than moved in . America's own citizens are leaving in record numbers, replanting themselves and their families in lands they find more affordable and safe. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Greer: 15% Tariff May Only Apply to Some Countries </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     President Trump may increase his 10% global tariff to 15% </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  for only some nations, his trade chief said, adding to the confusion over an increase that was announced last weekend but has yet to materialize. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Wall Street Traders Are Pouncing on the Tariff Refund Chaos </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Shipping Industry Sends Strong Consumer Demand Signal For 2026 </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Major U.S. importers are facing off against the world's largest ocean carriers in an early gut check for trade in 2026. Retailers are expecting favorable deals </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  as they kick off talks next month for ocean shipping contracts that link factories in Asia to warehouses in America. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     U.S. Should Shift Gears on Economic Policy, IMF Says </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     An alternative policy mix in the U.S. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  could achieve the Trump administration's goals while avoiding negative repercussions, the International Monetary Fund says. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Forward Guidance Thursday (all times ET) </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     8:30 a.m.: Unemployment Insurance Weekly Claims Report - Initial Claims </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     10 a.m.: Federal Reserve Vice Chair for Supervision Michelle Bowman appears before senate committee hearing </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     11 a.m.: Federal Reserve Bank of Kansas City Survey of Tenth District Manufacturing </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Friday </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     8:30 a.m.: PPI </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     9:45 a.m.: Chicago Business Barometer - ISM-Chicago Business Survey - Chicago PMI </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     3 p.m.: Agricultural Prices </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     3:30 p.m.: U.S. President Donald Trump delivers remarks at The Port of Corpus Christi </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Research Corporate Bonds Below the Highest Ratings Are in 'Good Shape' </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Corporate bonds are generally pricey, but the lower end of investment-grade and the upper tier of high yield still hold value, SanJac Alpha's Andrew Wells tells WSJ. In the high-yield space, BB and B-rated bonds are \"actually in real good shape because anything that looks risky has kind of been pushed out into private credit,\" he says. Debt accumulation to fund AI also raises concerns, so he is avoiding tech exposure. \"It's the ones that have taken on just massive amounts of debt like Oracle,\" he says. \"It certainly shows signs of an overbuild or an oversupply [of bonds] coming.\" - Paulo Trevisani </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Basis Points Canadian Prime Minister Mark Carney heads to the Indo-Pacific region </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  this week, starting with a visit to India where he aims to accelerate efforts to deepen commercial ties with the country after years of diplomatic distress. Confidence among firms in the eurozone slipped in February </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  amid fresh uncertainties surrounding Europe's political and economic relationship with the U.S. The risk premium demanded by investors to lend to countries in central and eastern Europe has fallen back </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  to levels last seen before Russia's full scale invasion of Ukraine, easing the war's negative impact on the region's economies, the European Bank for Reconstruction and Development said Thursday. About Us </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     WSJ Pro Central Banking brings you central banking news, analysis and insights from WSJ's global team of reporters and editors. This newsletter was compiled by markets reporter Vicky Ge Huang  in New York. Send your tips, suggestions and feedback to [vicky.huang@wsj.com]. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     This article is a text version of a Wall Street Journal newsletter published earlier today. </p>\n<pre class=\"mdc-article-pre\" data-v-370ea3ac=\"\"></pre>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  (END) Dow Jones Newswires</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  February 26, 2026 07:30 ET (12:30 GMT)</p>\n\nCopyright (c) 2026 Dow Jones &amp; Company, Inc.</div>",
            "pub_date": "2026-02-26 20:40:47",
            "link": "https://www.morningstar.com/news/dow-jones/202602268181/feds-bostic-says-people-have-begun-to-doubt-fed-independence",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Chubb Limited Board Will Recommend 33rd Consecutive Annual Dividend Increase to Shareholders at the 2026 Annual General Meeting; Declares Quarterly Dividend",
            "description": "<div class=\"mdc-article-body\">\n            \n              \n              Chubb Limited Board Will Recommend 33rd Consecutive Annual Dividend Increase to Shareholders at the 2026 Annual General Meeting; Declares Quarterly Dividend\n              \n            \n            \n              <span>\n<h2 class=\"mdc-article-heading mdc-heading__mdc mdc-heading--level-5__mdc\" data-v-618d53ae=\"\">Chubb Limited Board Will Recommend 33rd Consecutive Annual Dividend Increase to Shareholders at the 2026 Annual General Meeting; Declares Quarterly Dividend</h2>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">PR Newswire</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">ZURICH, Feb. 26, 2026</p>\n</span>\n<span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span data-v-602de5d2=\"\">ZURICH</span>, <span data-v-602de5d2=\"\">Feb. 26, 2026</span> /PRNewswire/ -- Chubb Limited (NYSE: CB) announced today that its Board of Directors will recommend to shareholders at the company's 2026 Annual General Meeting an increase in its quarterly dividend for the 33rd consecutive year.  The proposal calls for a $4.08 annual per share dividend, payable in four quarterly installments of $1.02 per share, compared to the current quarterly dividend amount of $0.97 per share.</p>\n<span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://mma.prnewswire.com/media/321965/Chubb_Limited_Logo.html\" tabindex=\"0\">\n<span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img\" data-v-f0ef0696=\"\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://mma.prnewswire.com/media/321965/Chubb_Limited_Logo.jpg\"/></picture></span>\n</a>\n</p>\n</span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">The Board also declared a quarterly dividend equal to $0.97 per share, payable on April 6, 2026 to shareholders of record at the close of business on March 13, 2026.  The dividend will be payable out of legal reserves and will be made in United States dollars by the company's transfer agent as described in the Chubb Limited 2025 proxy statement.  This will be the fourth installment as approved by the company's shareholders on May 15, 2025.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">About Chubb <br data-v-479a2324=\"\"/></strong>Chubb is a world leader in insurance. With operations in 54 countries and territories, Chubb provides commercial and personal property and casualty insurance, personal accident and supplemental health insurance, reinsurance and life insurance to a diverse group of clients. The company is defined by its extensive product and service offerings, broad distribution capabilities, exceptional financial strength and local operations globally. Parent company Chubb Limited is listed on the New York Stock Exchange (NYSE: CB) and is a component of the S&amp;P 500 index. Chubb employs approximately 45,000 people worldwide. Additional information can be found at: <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4627679-1&amp;h=2172247550&amp;u=https%3A%2F%2Fedge.prnewswire.com%2Fc%2Flink%2F%3Ft%3D0%26l%3Den%26o%3D4591985-1%26h%3D3363838660%26u%3Dhttps%253A%252F%252Fc212.net%252Fc%252Flink%252F%253Ft%253D0%2526l%253Den%2526o%253D4396093-1%2526h%253D3367814517%2526u%253Dhttp%25253A%25252F%25252Fwww.chubb.com%25252F%2526a%253Dwww.chubb.com%26a%3Dwww.chubb.com&amp;a=www.chubb.com\" tabindex=\"0\">www.chubb.com</a>.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\"><em class=\"mdc-article-emphasis\" data-v-370fea16=\"\"><span class=\"mdc-article-underline\" data-v-1f1bdc8a=\"\">Cautionary Statement Regarding Forward-Looking Statements:</span></em></strong> <br data-v-602de5d2=\"\"/><em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">Forward-looking statements made in this press release, such as statements regarding the company's 2026 Annual General Meeting and dividends, reflect the company's current views with respect to future events and are made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995. Such statements involve risks and uncertainties, which may cause actual results to differ materially from these statements. For example, payment of scheduled dividends could be affected by extraordinary company events or capital constraints or similar factors that could require the company to adjust, delay or withhold dividend payments.  Additional information regarding factors that could cause differences from these forward-looking statements appears in the company's filings with the Securities and Exchange Commission.  Readers are cautioned not to place undue reliance on these forward-looking statements, which speak only as of the date on which they are made. </em> </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img mdc-article-image__img--12-width\" data-v-f0ef0696=\"\" style=\"width:12px;\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://edge.prnewswire.com/c/img/favicon.png?sn=NY96113&amp;sd=2026-02-26\"/></picture></span> View original content to download multimedia:<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://www.prnewswire.com/news-releases/chubb-limited-board-will-recommend-33rd-consecutive-annual-dividend-increase-to-shareholders-at-the-2026-annual-general-meeting-declares-quarterly-dividend-302698280.html\" tabindex=\"0\">https://www.prnewswire.com/news-releases/chubb-limited-board-will-recommend-33rd-consecutive-annual-dividend-increase-to-shareholders-at-the-2026-annual-general-meeting-declares-quarterly-dividend-302698280.html</a></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">SOURCE Chubb Limited</p></span>\n<span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img\" data-v-f0ef0696=\"\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://rt.prnewswire.com/rt.gif?NewsItemId=NY96113&amp;Transmission_Id=202602260720PR_NEWS_USPR_____NY96113&amp;DateId=20260226\"/></picture></span>\n</div>",
            "pub_date": "2026-02-26 20:30:36",
            "link": "https://www.morningstar.com/news/pr-newswire/20260226ny96113/chubb-limited-board-will-recommend-33rd-consecutive-annual-dividend-increase-to-shareholders-at-the-2026-annual-general-meeting-declares-quarterly-dividend",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Telekom Srbija Group Secures Landmark International Credit Ratings from Fitch and Moody’s, Marking Historic First for Western Balkans",
            "description": "<div class=\"mdc-article-body\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Telekom Srbija Group Secures Landmark International Credit Ratings from Fitch and Moody’s, Marking Historic First for Western Balkans</strong>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nFirst Western Balkans–headquartered company to secure dual global credit ratings, shining a spotlight on the region’s rising growth and international relevance\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nTelekom Srbija Group today announced that it has received international credit ratings from Fitch Ratings and Moody’s Investors Service, marking a historic milestone as the first company headquartered in the Western Balkans to achieve this distinction.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nFitch Ratings has affirmed Telekom Srbija’s long-term issuer rating in connection with its debut issuance of bonds on the international financial market, recognizing the Group’s strong market position, resilient cash flow profile and disciplined financial strategy. Moody’s Investors Service has assigned a B1 rating to the company’s bond issuance, underscoring Telekom Srbija’s established operating performance and strategic importance within the regional telecommunications sector.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nAs the first Western Balkans–headquartered company to issue bonds on the international financial market and secure ratings from two of the world’s leading credit rating agencies, Telekom Srbija has set a new benchmark for the region’s corporate sector. The achievement signals growing investor confidence in both the company and the broader economic potential of Serbia and the Western Balkans.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Vladimir Lučić, CEO of Telekom Srbija</strong>, stated:\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n“This is a defining moment for Telekom Srbija and for the broader business community in our region. For the first time, a company headquartered in the Western Balkans has successfully accessed the international bond market and obtained credit ratings from some of the most respected global agencies. This milestone reflects the strength of our business model, the sustained growth we have delivered across our core markets and the credibility we have built with international investors. We believe this achievement will pave the way for other Serbian and regional companies to access global capital markets under competitive conditions.”\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nTelekom Srbija Group is the leading telecommunications and digital services provider in Southeast Europe, serving millions of customers across mobile, fixed, broadband and multimedia services. In recent years, the company has accelerated investments in network expansion, digital platforms and media content, reinforcing its competitive position and supporting sustainable long-term growth.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">About Telekom Srbija Group</strong>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nThe Telekom Srbija Group, headquartered in Serbia and operating in 13 countries across Europe and beyond (SER, BIH, MNE, CRO, SI, NMK, TUR, AUT, CH, GER, USA, NL, BE), is one of the largest and fastest-growing telecommunications operators in Southeast Europe, and a leader in digital transformation in the Western Balkans. With nearly 14 million subscribers and more than 13,000 employees, the Group provides services in four key segments: fixed telephony, mobile communications, internet, and multimedia.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img\" data-v-f0ef0696=\"\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20260226417288r1&amp;sid=mstr3&amp;distro=nx&amp;lang=en\"/></picture></span><span data-v-602de5d2=\"\"></span></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nIvana Bajović\n<br data-v-602de5d2=\"\"/><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"mailto:ivanabajo@telekom.rs\" tabindex=\"0\">ivanabajo@telekom.rs \n</a><br data-v-602de5d2=\"\"/>+381 64 650 7300\n<br data-v-602de5d2=\"\"/>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span data-v-602de5d2=\"\">View source version on businesswire.com: </span><span data-v-602de5d2=\"\"><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://www.businesswire.com/news/home/20260226417288/en/\" tabindex=\"0\">https://www.businesswire.com/news/home/20260226417288/en/</a></span></p></div>",
            "pub_date": "2026-02-26 20:30:35",
            "link": "https://www.morningstar.com/news/business-wire/20260226417288/telekom-srbija-group-secures-landmark-international-credit-ratings-from-fitch-and-moodys-marking-historic-first-for-western-balkans",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Dow Jones Top Energy Headlines at 7 AM ET: Oil Inches Higher Ahead of U.S.-Iran Talks | Engie ...",
            "description": "<div class=\"mdc-article-body\">\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Oil Inches Higher Ahead of U.S.-Iran Talks </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Oil prices edged higher ahead of a third round of nuclear talks between the U.S. and Iran. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     ---- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Engie to Buy UK Power Networks for $14.2 Billion From Hong Kong's CK Group </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  France's Engie will acquire UK Power Networks for 10.5 billion pounds in equity value, equivalent to about $14.2 billion, from Hong Kong billionaire Li Ka-shing's CK Group. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     ---- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Energy &amp; Utilities Roundup: Market Talk </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Find insight on Engie, Iberdrola, E.ON and more in the latest Market Talks covering Energy and Utilities. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     ---- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Eni Earnings Rise on Higher Production </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Adjusted net profit-the company's preferred metric-jumped 35% and earnings were supported by a more than 7% rise in oil and gas production. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     ---- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  U.S. Opens the Way for Fuel-Starved Cuba to Get Oil Shipments </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  The Treasury Department also said some shipments of American fuel could be legal to relieve the humanitarian crisis on the Communist island. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     ---- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  U.S. Crude Oil Stockpiles Post Large Weekly Build </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Crude oil inventories rose by 16 million barrels, posting their biggest weekly increase in three years as imports rose, exports fell and refineries cut their capacity use. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     ---- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Nordex Surges 16% on Earnings Beat, Potential U.S. Expansion </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Energy demand from AI-driven data center expansion will drive demand momentum in North America, the wind-turbine manufacturer said. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     ---- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Iberdrola's Net Profit Rises, Reiterates Guidance </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Iberdrola said net profit rose in 2025, driven by its networks business, and the energy company reiterated its guidance for the year ahead. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     ---- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  E.ON's Earnings Rise as It Spends on European Energy Infrastructure </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  E.ON's earnings rose as it expanded and upgraded energy infrastructure across Europe and it raised its investment plan to 2030. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     ---- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  First Solar Posts Higher Profit on Increase in Revenue </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  The solar-energy company posted a higher profit in fourth quarter, but issued revenue guidance for this year that missed analyst expectations. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     ---- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Iranian Oil Loadings Soar as Regional Risks Intensify Ahead of U.S. Talks </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Iran's crude loadings have surged to multiyear highs this month as geopolitical risks build ahead of a third round of nuclear talks with Washington. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     ---- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Crude Oil Prices Are Poised to Jump, Price Action Signals </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n   The lonely laggard in a yearlong surge for commodities may be getting ready to bounce higher. </p>\n<pre class=\"mdc-article-pre\" data-v-370ea3ac=\"\"></pre>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  (END) Dow Jones Newswires</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  February 26, 2026 07:15 ET (12:15 GMT)</p>\n\nCopyright (c) 2026 Dow Jones &amp; Company, Inc.</div>",
            "pub_date": "2026-02-26 20:21:26",
            "link": "https://www.morningstar.com/news/dow-jones/202602267648/dow-jones-top-energy-headlines-at-7-am-et-oil-inches-higher-ahead-of-us-iran-talks-engie",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Dow Jones Top Company Headlines at 7 AM ET: Why Nvidia's Huge Numbers Don't Settle the Latest AI Fears | Mistral ...",
            "description": "<div class=\"mdc-article-body\">\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Why Nvidia's Huge Numbers Don't Settle the Latest AI Fears </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Record sales and booming cash flow come as worries have shifted to AI's destabilizing impact. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     ---- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Mistral AI Lands Accenture as Latest Big Client </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  The agreement is a boost for the French artificial-intelligence startup as it seeks to expand its network of alliances. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     ---- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Baidu Profit Drops as Revenue Decline Continues </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  The Chinese search reported sharply lower profit, with revenue declining for a third straight quarter, as it struggles to transform its businesses in the AI era. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     ---- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Rolls-Royce Plans $12 Billion Buyback, Raises 2028 Targets </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  The engine maker said a strong balance sheet allowed it to launch the multiyear buyback program, and lifted its targets after earnings grew. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     ---- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Engie to Buy UK Power Networks for $14.2 Billion From Hong Kong's CK Group </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  France's Engie will acquire UK Power Networks for 10.5 billion pounds in equity value, equivalent to about $14.2 billion, from Hong Kong billionaire Li Ka-shing's CK Group. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     ---- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Dell's Earnings Will Highlight Benefits, and Risks, of the AI Boom </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Server and networking revenue for the quarter is estimated to be $14 billion, which is an 111% increase from last year. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     ---- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  LSEG Shares Rise After Forecast of Profitability Boost, $4 Billion Buybacks </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  The financial-data provider and exchange operator said continued revenue growth and efficiencies would help it improve profitability beyond this year. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     ---- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  HKEX Has Record Year as Hong Kong Reclaims IPO Crown </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Hong Kong hosted 119 new listings last year, raising more than triple the funds raised the previous year. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     ---- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Salesforce Sees Stable Growth Despite Wall Street's AI Concerns </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  The company expects continued revenue growth as investors worry about AI's threat to software. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     ---- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Nutanix's stock soars as AMD investment creates a 'halo effect' </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  The company, which makes hyperconverged infrastructure including storage offerings, is partnering with AMD and betting that AI customers want flexible ecosystems. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     ---- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  CoreWeave's Growth Is Booming. Can It Keep Up? </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  CoreWeave is expected to post triple-digit revenue growth, but investors are watching debt levels, Nvidia exposure and insider selling. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     ---- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  BlueScope Says $11 Billion Steel Dynamics, SGH Takeover Offer Insufficient </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Last week's proposal intensified a takeover campaign by Indiana-based Steel Dynamics, which has been involved in five bids for BlueScope since late 2024. </p>\n<pre class=\"mdc-article-pre\" data-v-370ea3ac=\"\"></pre>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  (END) Dow Jones Newswires</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  February 26, 2026 07:15 ET (12:15 GMT)</p>\n\nCopyright (c) 2026 Dow Jones &amp; Company, Inc.</div>",
            "pub_date": "2026-02-26 20:21:25",
            "link": "https://www.morningstar.com/news/dow-jones/202602267642/dow-jones-top-company-headlines-at-7-am-et-why-nvidias-huge-numbers-dont-settle-the-latest-ai-fears-mistral",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        }
    ]
}