{
    "data": [
        {
            "title": "New to The Street to Broadcast Executive Leadership Interviews Featuring Medicus Pharma Ltd. (NASDAQ:MDCX), CitroTech (NYSE:CITR), Vivos Therapeutics, Inc. (NASDAQ:VVOS), and Virtuix Holdings ($VTIX) on Bloomberg Television Tonight at 6:30 PM EST",
            "description": "<div class=\"mdc-article-body\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><em class=\"mdc-article-emphasis\" data-v-370fea16=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">The Show Will Also Air Across Latin America and MENA 1230 pm local time.</strong></em></p> <p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">NEW YORK CITY, NEW YORK / <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://www.accessnewswire.com/\" tabindex=\"0\">ACCESS Newswire</a> / February 28, 2026 / </strong>New to The Street will broadcast nationally tonight at 6:30 PM EST on Bloomberg Television, featuring executive leadership interviews with Medicus Pharma Ltd. (NASDAQ:MDCX), CitroTech (NYSE:CITR), Vivos Therapeutics, Inc. (NASDAQ:VVOS), and Virtuix Holdings (NASDAQ:VTIX).</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">The program will air across Bloomberg's U.S. platform and will also broadcast throughout Latin America and the Middle East &amp; North Africa (MENA), expanding global visibility for each company's strategic initiatives and growth outlook.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Each executive interview delivers in-depth discussion around corporate strategy, market positioning, upcoming catalysts, and long-term value creation. The show continues to connect innovative public companies with a global investor audience through structured, recurring national exposure.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">In addition to national television distribution, the segments will be amplified across New to The Street's digital ecosystem, including its 4.4M+ subscriber YouTube channel - the largest YouTube subscriber base in the public-company media space - along with integrated distribution across X, LinkedIn, Instagram, and Facebook.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">About New to The Street</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">New to The Street is a 17-year-old financial television brand broadcasting weekly as sponsored programming across multiple linear television networks, including Bloomberg Television and Fox Business. The platform delivers long-form executive interviews filmed from premier financial venues including the NYSE and Nasdaq MarketSite.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">With over 4.4 million YouTube subscribers - the largest dedicated subscriber base in the public company media category - New to The Street combines national television reach, global broadcast distribution across the U.S., Latin America, and MENA, and a powerful digital amplification engine.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">New to The Street TV can be viewed on YouTube at:<br data-v-602de5d2=\"\"/><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://pr.report/j5je\" tabindex=\"0\">https://youtube.com/@newtothestreettv?si=JdWxFdCXg6smGoiz</a></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">The platform provides predictable, recurring visibility designed to support corporate growth narratives and investor engagement.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Broadcast Details:</strong><br data-v-602de5d2=\"\"/>6:30 PM EST - Bloomberg Television<br data-v-602de5d2=\"\"/>Also airing across Latin America and MENA</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">For media inquiries:</strong><br data-v-602de5d2=\"\"/>Monica Brennan<br data-v-602de5d2=\"\"/><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"mailto:Monica@NewtoTheStreet.com\" tabindex=\"0\">Monica@NewtoTheStreet.com</a></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">SOURCE: </strong>New to The Street</p><br/><br/>View the original <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://www.accessnewswire.com/newsroom/en/publishing-and-media/new-to-the-street-to-broadcast-executive-leadership-interviews-featuring-medic-1142530\" tabindex=\"0\">press release</a> on ACCESS Newswire<br/><br/>\n<span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img mdc-article-image__img--0-width\" data-v-f0ef0696=\"\" style=\"width:0;\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://app.accessnewswire.com/img.ashx?id=1142530\"/></picture></span></div>",
            "pub_date": "2026-03-01 00:41:34",
            "link": "https://www.morningstar.com/news/accesswire/1142530msn/new-to-the-street-to-broadcast-executive-leadership-interviews-featuring-medicus-pharma-ltd-nasdaqmdcx-citrotech-nysecitr-vivos-therapeutics-inc-nasdaqvvos-and-virtuix-holdings-vtix-on-bloomberg-television-tonight-at-630-pm-est",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Need a side hustle to support your retirement dreams? Here's how to find work right now.",
            "description": "<div class=\"mdc-article-body\">\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  By Richard Eisenberg </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     7 tips for navigating this tricky job market </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Many employers are reluctant to hire workers, including people looking for part-time jobs in retirement. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Most retired Americans don't have employment income to supplement their savings, even though a majority wish they did. That's a problem in this \"no hire\" economy, as one economics writer put it. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     More than 9 in 10 people said they didn't have a side gig in retirement, but 60% wished they did, according to a survey by the financial-services firm D.A. Davidson. This comes in the middle of what people are calling a \"no hire\" economy, where finding work in retirement is becoming a struggle. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Read: CEOs say they won't add many jobs in 2026. Is a low-hire, low-fire labor market the new norm? </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Consider these statistics about the deep freeze in the labor market: </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     -- People think they have only a 43% chance of finding work in the next three months if they lose their job, the lowest level in 12 years, a New York Fed survey in December said. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     -- The U.S. added essentially zero jobs over the last five months and just 44,000 a month last year, the lowest since the pandemic recession. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     -- 37% of workers surveyed by the Employee Benefit Research Institute said they've seen hiring freezes at their employers in the past 12 months. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     -- The 108,435 layoffs announced in January - including huge job cuts at Amazon AMZN and UPS UPS -were the highest to start a year since 2009, according to the outplacement firm Challenger, Gray &amp; Christmas. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     -- 81% of recruiters post \"ghost jobs,\" positions that are nonexistent or have already been filled, a MyPerfectResume survey found. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     And that's affecting workers across all ages, not just older individuals who may face the additional struggles of age discrimination in the workplace or hiring process. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     \"There's a sense of precarity in the air. I think it's going to be a rough year,\" said Kerry Hannon, author of \"Great Jobs for Everyone 50+,\" at the recent Trendspotting 2026 webinar about older workers. The webinar was offered by the Encore Network, a nonprofit championing people over 50. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Why is job hunting so tough these days? Many employers are reluctant to hire workers, including people looking for part-time jobs in retirement, because they're apprehensive about the economy. Consumer spending is expected to slow, and businesses are turning to AI as an alternative to bringing on staff for things like customer service and data entry. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     What's more, said Isaiah Hankel, author of the new book \"Too Good to Get Hired,\" America has an \"overqualified\" crisis, with employers routinely snubbing older job applicants due to their age and years of experience. \"'Too good to get hired' sounds like an oxymoron, right?\" he said. \"You would think it's impossible to be too good to get hired. But the data shows this is just not the case.\" </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Hankel, the older-worker experts at the Encore webinar panel and LinkedIn authorities have seven smart tips for finding jobs in retirement: </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     For anyone preparing to retire, review your finances and start thinking about where to look for part-time work </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     If you're nervous, 2026 is a year to plan, said panelist Chris Farrell, senior economics contributor at American Public Media's Marketplace radio program and author of \"Unretirement.\" </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     \"Come up with a budget you can control and reach out to people in your network,\" he advised. Then, Farrell noted, you might be able to say to yourself: \"If I make this amount of money, I'm going to be OK financially not making as much as I did before.\" </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Spend more time networking than applying to online job listings </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Most online job applications result in a 0.1% to 2% success rate, according to the HiringThing blog. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     \"You can't rely on job boards the way you used to,\" Hankel said. A Congressional Research Service report said 27% of all U.S. job listings on LinkedIn are likely ghost jobs. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Consider boomeranging part time to the employer you retired from </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     \"Boomeranging used to be something companies would avoid; there was a stigma attached to it,\" Farrell said. \"That has changed dramatically, because the employer knows who the person is and what they can do.\" </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     When applying for jobs in retirement, play up what you can do for an employer - not what you've done </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     \"Make more potential-based statements, not just proof-based statements about your prior work,\" Hankel said. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Fix your LinkedIn Profile to be a stronger job candidate </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     The LinkedIn social-media platform recently launched an AI-powered ranking and recommendation system called 360Brew, which makes job candidates get seen more - or less - depending on how they appear to the algorithm. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     The 360Brew system favors consistency, linear careers and clear titles, wrote Viveka von Rosen, a career adviser for women age 50-plus, in a LinkedIn post. She recommends ensuring your LinkedIn headline isn't vague, your About section isn't bloated and your Experience section doesn't read like a \"resumé archive.\" </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Speaking at an Encore webinar about \"the new LinkedIn,\" communications specialist Debra Yearwood recommended writing a LinkedIn headline that combines your desired position and your skills. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Yearwood also advised amplifying your LinkedIn profile's Experience section by showing your personal brand. \"Put in a bit of a description of the work you did at a job, the organization itself and your achievements there,\" she said. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Be sure to include the skills you've acquired, and that your top two show up at the beginning of your profile. Ask former colleagues to endorse those two skills, too. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Look for jobs in fields related to the aging of the U.S. population </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     \"We have a critical mass of baby boomers who are getting older, and a Silent Generation who's getting even older. They need access to products, services and care,\" said panelist Catherine Collinson, who publishes the Transamerica Institute's annual Transamerica Retirement Survey. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Hannon calls this \"riding the age wave,\" and notes that getting hired to serve the health needs of older adults doesn't require a medical background. \"You could be a healthcare accountant or a project manager or use skills from a previous job,\" she said. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Deflect employers' ageist hiring practices by starting a business in retirement </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     In a recent Harris Poll, 69% of professionals said owning a business is the best protection against ageism in the workforce, antiageism advocate Janine Vanderburg wrote on LinkedIn. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     While running a small business could be a lot to manage in retirement, there are some options that play into a retiree's experiences and skills. For example, among the 25 fastest-growing jobs in the U.S. for 2026, according to LinkedIn: strategic advisers, independent consultants, and founders. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     \"Solo entrepreneurship is continuing to grow,\" Farrell said. \"That's probably the one part of the job market to be the most optimistic about.\" </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     -Richard Eisenberg </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     This content was created by MarketWatch, which is operated by Dow Jones &amp; Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal. </p>\n<pre class=\"mdc-article-pre\" data-v-370ea3ac=\"\"></pre>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  (END) Dow Jones Newswires</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  02-28-26 1119ET</p>\n\nCopyright (c) 2026 Dow Jones &amp; Company, Inc.</div>",
            "pub_date": "2026-03-01 00:30:52",
            "link": "https://www.morningstar.com/news/marketwatch/20260228180/need-a-side-hustle-to-support-your-retirement-dreams-heres-how-to-find-work-right-now",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Berkshire Hathaway shrinks cash pile in Buffett's last act as CEO. Here's how successor Greg Abel is now looking to spend.",
            "description": "<div class=\"mdc-article-body\">\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  By Tomi Kilgore </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Company's cash hoard at end of 2025 - which Abel noted was not a sign of an investment retreat - was down 2.1% from September to $373.3 billion </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Berkshire Hathaway's cash holdings have dipped, and the new CEO, Greg Abel, is evaluating opportunities. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     It's Greg Abel's Berkshire Hathaway now, but the last act of Warren Buffett as CEO appears to have been putting some of the conglomerate's record cash hoard to work. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     And in the first annual shareholder letter not penned by Buffett in 60 years, Abel said he is currently evaluating other opportunities, but will remain patient and disciplined in making investments, even in Berkshire's own stock (BRK. B) (BRK. A). </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Abel assured shareholders that the way decisions are made, and how capital is allocated under his watch, will continue on the path set by Buffett \"into perpetuity.\" He also noted that as chairman, Buffett will still be going to the office \"five days a week\" to help make decisions. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Berkshire's annual report released early Saturday showed that the cash held as of Dec. 31 was $373.31 billion, down from the record $381.67 billion held at the end of the third quarter but still up 11.7% from the end of 2024. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     \"Many times in Berkshire's history, some observers have suggested that our substantial cash position signals a retreat from investing,\" Abel wrote. \"It does not.\" </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     And while Abel said share repurchases were an \"important capital-allocation option,\" the company didn't buy back any stock during the fourth quarter, extending that trend to six quarters. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Berkshire's stock was little-changed during the fourth quarter, while the S&amp;P 500 index SPX rose 2.4%. So far this year, the stock has edged up 0.5% through Friday, to match the S&amp;P 500's performance. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Abel's first shareholder letter also comes at a time that Berkshire's insurance business has struggled, to the point that the company will not be looking to grow the business for a while. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Following are some other key insights from Abel's letter to shareholders. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Investments in Japan are as important as U.S. holdings </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Abel noted that a large portion of Berkshire's equity investments are held in a small number of U.S. companies, notably investments in Apple (AAPL), American Express (AXP), Coca-Cola (KO) and Moody's (MCO). The total market value of those holdings was $158.6 billion as of Dec. 31. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     \"This concentrated approach will continue, with limited activity in these holdings, though we may significantly adjust a holding if we see fundamental changes in its long-term economic prospects,\" Abel wrote. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     The same methodology in choosing investments in American companies is used in finding opportunities in Japan, \"which we view as comparable to our major U.S. holdings in importance and long-term value-creation opportunity.\" </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     The largest Japan holdings, with a total market value of $35.37 billion, are Mitsubishi (JP: 8058), Itochu (JP: 8001), Mitsui &amp; Co. (MITSY), Marubeni (MARUY) and Sumitomo (SSUMY). </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Kraft Heinz holding has disappointed </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     As Buffett said in last year's shareholder letter, there have been some mistakes in Berkshire's investments. Abel noted that Kraft Heinz was one of them. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     \"Our investment in Kraft Heinz has been disappointing,\" Abel wrote. \"Even after considering the preferred equity component in our original Heinz investment, our return has been well short of adequate.\" </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Abel appeared to be setting the stage for Berkshire make a big change. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     In January, Kraft Heinz disclosed that Berkshire \"may offer to sell\" its 325.4 million shares stake in the company. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Buffett was a big backer of the Kraft Foods and Heinz merger in 2015. After a decade of share price underperformance, Kraft Heinz said in September it will break up. But new CEO Steve Cahillane said he was putting the breakup plan on hold, so he can focus on fixing the problems. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Earnings fall for the quarter and year </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Net income in the latest quarter fell 2.5% from the same period a year ago to $19.2 billion. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Operating earnings, which exclude investment gains and other nonrecurring items, declined 29.8% to $10.2 billion for the quarter, and were down 6.2% for the year to $44.5 billion. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Abel noted, however, that while 2025 earnings showed a decline, they were above the $37.5 billion in earnings Berkshire has averaged over the past five years, which he said underscores the durability of Berkshire's operating business, while also showing there's room for improvement. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Insurance struggles could continue </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Central to the weakness in operating earnings during the fourth quarter was Berkshire's insurance business, in which the total of insurance underwriting and insurance-investment income dropped 38.2% to $4.6 billion. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     While the company reassesses how insurance policies are priced, Abel said the businesses, which includes Geico, will not be growing for a while. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     \"Their performance reflected both their inherent strengths and an industry that, after several years of needed adjustments to pricing and policy terms, in 2025 began to experience a deceleration or reversal of these trends, particularly in the latter half of the year,\" Abel wrote. \"This likely means we will write less property and casualty business for a period of time.\" </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Ajit Jain, who Abel said is \"peerless\" in pricing insurance risk, runs Berkshire's insurance operations. Before Abel was named as Buffett's successor last year, Jain was considered a top candidate. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Buffett remains a fixture at the office </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Here's how Abel's first shareholder letter started: \"Warren Buffett is arguably the greatest investor of all time, with generations benefiting from his investment acumen.\" </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     He said, however, that Buffett shouldn't be viewed solely as an investment guru. What will endure, according to his successor as CEO, is how he ran his businesses, and how he treated shareholders as partners. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     And Buffett may no longer be running the business, but Abel reminded shareholders that Buffett will still be in the office \"five days a week\" as chairman, and will continue to have a say in which stocks Berkshire buys. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     -Tomi Kilgore </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     This content was created by MarketWatch, which is operated by Dow Jones &amp; Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal. </p>\n<pre class=\"mdc-article-pre\" data-v-370ea3ac=\"\"></pre>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  (END) Dow Jones Newswires</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  02-28-26 1106ET</p>\n\nCopyright (c) 2026 Dow Jones &amp; Company, Inc.</div>",
            "pub_date": "2026-03-01 00:11:39",
            "link": "https://www.morningstar.com/news/marketwatch/20260228175/berkshire-hathaway-shrinks-cash-pile-in-buffetts-last-act-as-ceo-heres-how-successor-greg-abel-is-now-looking-to-spend",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Boomers waste money, too. These are the spending traps tripping up the richest generation.",
            "description": "<div class=\"mdc-article-body\">\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  By Venessa Wong </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Baby boomers may not be the 'avocado toast' generation, but they have plenty of their own wasteful and financially damaging habits </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Boomers are more wasteful in certain spending categories than their younger counterparts. These habits can be harmful for the many people in this cohort who are financially vulnerable. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     The wasteful habits of millennials and Gen Z members should come as no surprise - it has been well documented that many of these consumers are prone to impulse online spending and have grown addicted to the convenience of delivery apps. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     But new survey data show that baby boomers - America's richest generation and one often perceived as being thriftier those that followed - are more wasteful in certain spending categories than younger people. And those habits can be especially harmful for the many people in this unevenly wealthy cohort who are financially vulnerable. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Specifically, baby boomers are more likely than the average consumer to waste food by throwing out leftovers or expired items, to leave appliances or utilities running unnecessarily, to buy brand-name pantry items and to buy lottery tickets, according to a recent survey by Motley Fool Money. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     And these habits have only gotten more expensive: Food prices increased by 2.9% in January compared with a year earlier, gas utility costs rose by 9.8% and electricity went up 6.3%, according to the latest figures from the Bureau of Labor Statistics. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     \"Once you are drawing from savings instead of building it, small recurring expenses matter more,\" said Melissa Caro, a financial planner and founder of My Retirement Network, a financial education site. \"Utilities, food waste and lifestyle inflation can quietly erode cash flow over a 20- to 30-year retirement. Even households with meaningful assets need to manage longevity risk, healthcare uncertainty and rising living costs.\" </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Boomers - who were born between 1946 and 1964 - were more likely than Americans on average to waste money during shopping trips, while on vacation or for special occasions, the poll of 2,000 U.S. adults found. Their most common trigger was sales and discounts. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     On the other hand, millennials, who were born between 1981 and 1996, and Gen Z, born between 1997 and 2012, were more likely to waste money online late at night. Members of Gen X, born between 1965 and 1980, were the most vulnerable to emotionally driven shopping but, along with boomers, were much more likely than younger generations to resist social-media trends and peer influence, the Motley Fool survey showed. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Despite their wasteful ways, boomers are the wealthiest cohort in U.S. history. Many were buoyed by the postwar economic boom, access to affordable college educations and workplace pensions, and growth in the housing and stock markets, MarketWatch recently reported. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     In line with broader trends in the economy, however, their wealth is not evenly distributed across the generation. Pew Research Center found that the top 10% of boomer households owned 71% of the generation's overall wealth. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     For instance, Americans 70 to 74, who fall in the middle of the current boomer age range, have a median net worth of about $476,000, including home equity, MarketWatch previously reported - meaning half of the people in that group have a net worth that is lower. The net worth for those in the 90th percentile is nearly $3.3 million, or 6.8 times the median. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     This wealth gap suggests that for many boomers, wasteful spending habits could have a meaningful impact on their financial well-being. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     The \"huge inequality within the boomer generation itself\" means \"some have paid-off homes and strong portfolios. Others rely almost entirely on Social Security and have very little margin for error,\" Juan G. HernandezAriano, a financial planner and principal at WealthCreate, told MarketWatch. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     In his experience, boomers are largely \"pretty cost-conscious in day-to-day spending,\" but many are casual about larger financial decisions that \"slowly chip away at retirement security,\" such as underestimating healthcare expenses or being overly conservative with their investments. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Only 40% of boomers - the youngest of whom are already 62 years old - are ready for retirement, Vanguard estimates, meaning their projected sustainable income exceeds their spending needs. These people are \"concentrated among the top 30% of income earners.\" </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     There are other signs that many boomers may be victims of poor spending habits: More reported living paycheck to paycheck - meaning their spending on necessities took up more than 95% of their income - in 2025 than in 2023, according to the Bank of America Institute. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     The average credit-card debt was $6,795 for boomers, 82.9% of whom had credit-card debt in 2025, a higher rate than millennials (77.9%) or Gen Z (72.2%), according to Experian. They were also the most likely to have home-equity lines of credit. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Some may not even be aware of their spending habits. Boomers were more likely than other generations to say they never waste money - but \"that doesn't mean that there isn't waste. It just shows up a little differently,\" Joel O'Leary, personal finance expert at Motley Fool Money, told MarketWatch. \"It's more like throwing away unused groceries or continuing to go to Costco or some of those expensive stores and buying in bulk, and then throwing away much of it.\" </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Wasteful habits are harmful when they start to impact financial security. While one-third of baby boomers said they had to tap their emergency savings in the last 12 months,16% of people in this age range said they have no emergency savings, according to 2025 Bankrate data. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Like any consumer, boomers who want to avoid wasting money can consider tracking and analyzing expenses and cutting back on expenses that don't actually improve their quality of life. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     While Caro \"wouldn't describe wasteful spending as a defining boomer trait,\" she noted that \"many boomers were raised by parents who lived through the Great Depression. That experience tends to produce strong money beliefs - sometimes in the direction of extreme thrift, and sometimes in the opposite direction. In families where scarcity was intense, the next generation can either internalize 'waste not, want not' or subconsciously react against it.\" </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     What personal-finance issues would you like to see covered in MarketWatch? We would like to hear from readers about their financial decisions and money-related questions. You can write to us at readerstories@marketwatch.com. A reporter may be in touch to learn more. MarketWatch will not attribute your answers to you by name without your permission. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     -Venessa Wong </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     This content was created by MarketWatch, which is operated by Dow Jones &amp; Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal. </p>\n<pre class=\"mdc-article-pre\" data-v-370ea3ac=\"\"></pre>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  (END) Dow Jones Newswires</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  02-28-26 1107ET</p>\n\nCopyright (c) 2026 Dow Jones &amp; Company, Inc.</div>",
            "pub_date": "2026-03-01 00:11:38",
            "link": "https://www.morningstar.com/news/marketwatch/20260228178/boomers-waste-money-too-these-are-the-spending-traps-tripping-up-the-richest-generation",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Trump calls for regime change after U.S.-Israel attack on Iran. Markets should brace for more than June's brief military campaign.",
            "description": "<div class=\"mdc-article-body\">\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  By Joy Wiltermuth and Barbara Kollmeyer </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     The next 24 to 48 hours of conflict will be crucial for markets after the U.S. and Israel launched military strikes against Iran </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     A plume of smoke rises in Tehran after U.S. and Israel launched a military attact. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     The U.S. and Israel attacked Iran, leading Tehran to retaliate with strikes within Israel and elsewhere in the Middle East after President Donald Trump called on Iranians to take over their government. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Those developments have raised questions about whether this conflict will last longer - and risk sweeping up more oil-producing nations - than the relatively short-lived U.S.-Israel military operation in June targeting Tehran's nuclear facilities. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     \"This is different,\" said Ali Meli, founder and chief investment officer at Monachil Capital Partners, in a Saturday interview with MarketWatch. \"There's a belief that this may be more aimed at regime change, beyond nuclear deterrence.\" </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     '[T]he question is if there will be a version of regime change like in Venezuela, or something more radical.'Ali Meli, Monachil Capital Partners </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     \"Now, the question is if there will be a version of regime change like in Venezuela, or something more radical,\" said Meli. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     What happens in the next 24 to 48 hours may provide clues to the potential scope of this conflict and its likely impact on markets, with Iran's oil infrastructure and the region's Strait of Hormuz, a critical oil chokepoint, now a major focus. That waterway connects the Persian Gulf with the Gulf of Oman and the Arabian Sea. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Oil (CL.1) (BRN00) prices jumped on Friday as traders began to sense strikes were nearing, as Trump suggested to reporters that the window for diplomacy with Iran could be closing. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     \"The brief June 2025 conflict is a poor guide to what is likely to follow,\" said Nick Redman, analyst at Oxford Analytica, a geopolitical risk-analysis and advisory service owned by MarketWatch publisher Dow Jones. \"Then, Iran sought to avoid confrontation because it understood U.S. objectives were limited, meaning that regional relations and wider international legitimacy were worth preserving.\" </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Now, however, Iran might look to \"hunker down or seek to draw out any conflict,\" according to Redman. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     European leaders from Britain, France and Germany issued a statement Saturday saying their countries had not taken part in the Iran strikes, but they added that they had been in close contact with the U.S., Israel and partners in the region. They called for a resumption of negotiations, the Associated Press reported. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Investors might see a \"relatively predictable\" reaction to the strikes on Iran, starting with a big leap in crude prices, said Michael Brown, senior research strategist at Pepperstone, in a note to clients. \"At this stage there are many unknowns, and the situation is incredibly fast-moving.\" </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Should a longer, more complicated conflict unfold, the U.S. could tap its Strategic Petroleum Reserve in an effort to keep a lid on oil and gasoline prices. U.S. benchmark crude shot up to over $130 a barrel in 2022 after Russia's full-scale invasion of Ukraine. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     However, the U.S could quickly ramp up domestic production given its shale resources, and it also now exerts control over Venezuela's oil, Meli at Monachil Capital said. That should help keep crude prices in a range, he added. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Likely to get a bid are haven assets, such as gold (GC00), which jumped nearly 11% in February, finishing at $5,230.50 an ounce on Friday. That marked gold's biggest one-month percentage gain since January 2012, and its monthly gain of $516.60 was the biggest one-month net gain on record, according to Dow Jones Market Data. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Cryptocurrencies, which trade 24/7, offered the first glimpse at how investors might react as they wait for Asian markets to open on Sunday. Bitcoin (BTCUSD) was steady, around $66,000, after briefly sinking to a level not seen since early February. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Apart from surging oil prices on Friday, the S&amp;P 500 SPX and Nasdaq Composite COMP and Dow industrials DJIA tumbled after the January PPI report reflected a surprise spike in U.S. wholesale inflation. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Brown at Pepperstone said the Japanese yen (USDJPY), Swiss franc (USDCHF) and U.S. Treasurys BX:TMUBMUSD10Y BX:TMUBMUSD30Ywould also likely be in the outperformer category. Investors have been increasingly pushing into U.S. government debt recently, a move strategists have attributed to fears over AI threats to employment and economic growth. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Read: The bond market has been doing something strange despite a hot inflation report </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Trump, addressing Iranians in a video address, said, \"Now is the time to seize control of your destiny.\" </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Trump last week offered a deadline of 10 to 15 days for a nuclear deal with Iran, which left this weekend as a possibility for a U.S. strike. Iran, with which the U.S. under President Barack Obama had negotiated a nuclear pact that Trump canceled during his first White House term, ranks among the world's biggest oil producers. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     \"It has always been the policy of the United States - in particular, my administration - that this terrorist regime can never have a nuclear weapon,\" Trump said, in his address, pointing to \"an unending campaign of bloodshed and mass murder\" against the U.S. over a 47-year span, as well as attacks on Israel. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Myra P. Saefong contributed. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     -Joy Wiltermuth -Barbara Kollmeyer </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     This content was created by MarketWatch, which is operated by Dow Jones &amp; Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal. </p>\n<pre class=\"mdc-article-pre\" data-v-370ea3ac=\"\"></pre>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  (END) Dow Jones Newswires</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  02-28-26 1036ET</p>\n\nCopyright (c) 2026 Dow Jones &amp; Company, Inc.</div>",
            "pub_date": "2026-02-28 23:51:31",
            "link": "https://www.morningstar.com/news/marketwatch/20260228169/trump-calls-for-regime-change-after-us-israel-attack-on-iran-markets-should-brace-for-more-than-junes-brief-military-campaign",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Stanley Druckenmiller says this is how he'd build a portfolio from scratch right now",
            "description": "<div class=\"mdc-article-body\">\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  By Barbara Kollmeyer </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     AI is no longer playing a starring role, says the widely followed investor </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Stanley Druckenmiller, shown in July 2017 at a conference in Sun Valley, Idaho, revealed in an interview on Friday with Morgan Stanley where he's seeing opportunities right now. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Stanley Druckenmiller says artificial intelligence is no longer playing a starring role in his investments, as he focuses more on hard assets like copper and a more diversified portfolio of stocks. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     The closely followed investor, who runs the Duquesne Family Office, made the comments in an interview for \"Hard Lessons,\" a Morgan Stanley podcast that was published on Friday. He was asked by liana Bouzali, Morgan Stanley's global head of derivatives, distribution and structuring, how he would construct a hedge-fund portfolio from scratch today. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Druckenmiller said such portfolio building would take into account a strengthening U.S. economy and potential for Fed rate cuts, though, given highly valued equities, he prefers longer positions in a more \"eclectic basket of stocks.\" The AI trade to him is not longer so big, he added. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     \"[O]ur portfolio,\" he indicated, over the past three years, had been \"very much AI-driven. We still have dribs and drabs of AI around, but it's not driving the engine anymore, to some extent,\" said Druckenmiller. He's still excited, he said, about the opportunity for \"massive disruption and massive change\" in the next three or four years, which would be a plus for any hedge fund starting now. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Don't miss: The week, FOBO - 'fear of becoming obsolete' because of AI - became real for workers and markets </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     \"Macro has been dead for 10 or 15 years,\" he observed. \"I don't think that's the case anymore.\" </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Druckenmiller said he's still got \"big positions in Japan and Korea,\" with some of that in AI. The iShares MSCI Japan ETF EWJ is up 40% over a one-year span, and the iShares MSCI Korea ETF EWY up 55%, versus a gain of 15% for the S&amp;P 500 SPX. A 13F filing released earlier this month showed Druckenmiller's family office also made a well-time bet on the iShares MSCI Brazil ETF EWZ in the final quarter of 2025. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Earlier this week: The milestones keep coming for the world's hottest stock market </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Also read: U.S. stocks are falling behind. It could be the beginning of an epic shift toward global markets. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     \"We're bearish on the U.S. dollar, mainly because [it has been] sort of [at] the top of the historic range in terms of purchasing power, and foreigners are way, way overloaded in dollars,\" he added. Whether that's a sell-America trade or just buying fewer U.S. assets, he expects the currency DXY will weaken. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     As for copper (HG00), up 32% over the past 52 weeks and up 6% in 2026, Druckenmiller said it's \"not a genius trade\" but makes sense given supply will be pretty tight over the next eight years, with extra demand from AI and data centers. He said his family office is not investing big in copper miners but keeps rolling over exposure to front-month copper, and it has gold (GC00) exposure, though, in that case, for geopolitical rather than industrial reasons. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     See: Trump calls for regime change after U.S.-Israel attack on Iran. Markets should brace for more than June's brief military campaign. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Gold is up 84% over the last year, having seen a historic rally. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Druckenmiller said that, given his family office's long exposure to lots of risk assets, it's keeping a short position in bonds, which wouldn't be a big moneymaker unless he's right and the economy sees disinflationary growth. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     \"If I'm wrong and the strong growth creates inflation - it wouldn't be that unusual if the Fed were to cut into a booming economy for inflation to take off, particularly with what's going on with commodities. So I'm open-minded to that. But we create a matrix, and the bonds are helpful in both ways,\" he said. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     The interview with Druckenmiller was conducted on Jan. 30, just ahead of the February ascent of an AI fear trade that pummeled software and other sectors exposed to artificial-intelligence technology. Investors have also been piling into bond markets on fears that AI advances will decimate the job market, while hotter-than-expected producer prices have clouded hopes for Federal Reserve interest-rate cuts. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     U.S. stocks plunged on Friday after the PPI data pointed to worryingly persistent inflation. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Don't miss: Any chance of a Fed interest-rate cut in 2026 is 'evaporating before our very eyes' with Iran war set to stoke oil prices </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Druckenmiller said contrarianism is \"overrated,\" and he isn't bothered by exposure to a crowded trade. But he also flagged past mistakes, such as buying Nvidia (NVDA) in the first half of 2022 but then cutting his stake in mid-2024. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     He also discussed a big bet on biotech, highlighting how the market has been undervaluing one pick, Teva Pharmaceuticals (TEVA), of which he became more enthusiastic following a meeting with its management. The \"best use case out there of AI is biotech, through drug discovery, diagnostics, monitoring - everything,\" Druckenmiller said, noting that that sector has \"been on its butt for like four years.\" </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Read on: Private-credit 'cockroaches' and the AI 'scare trade' hammered stocks in February. Here's what else has investors shaken up </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     -Barbara Kollmeyer </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     This content was created by MarketWatch, which is operated by Dow Jones &amp; Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal. </p>\n<pre class=\"mdc-article-pre\" data-v-370ea3ac=\"\"></pre>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  (END) Dow Jones Newswires</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  02-28-26 1038ET</p>\n\nCopyright (c) 2026 Dow Jones &amp; Company, Inc.</div>",
            "pub_date": "2026-02-28 23:51:30",
            "link": "https://www.morningstar.com/news/marketwatch/20260228171/stanley-druckenmiller-says-this-is-how-hed-build-a-portfolio-from-scratch-right-now",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "'I have a legal and a moral question': My dad left when I was 9, reconnected with me in my 50s and now needs money. What do I owe him?",
            "description": "<div class=\"mdc-article-body\">\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  By Quentin Fottrell </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     'After the divorce was finalized, he and his partner moved out of state to a place where there would be no child-support enforcement' </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     \"I feel disinclined to send money to someone who is essentially a stranger.\" (Photo subject is a model.) </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Dear Quentin, </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     I'm looking for advice on my obligations to a parent who was not in my life starting at age 9 - there was no financial support or other contact - but who has initiated contact again now that I am in my 50s. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     My father left my mother with five young children on Christmas Eve in 1978. After the divorce was finalized, he and his partner moved out of state to a place where there would be no child-support enforcement. They did not have any children together. There was almost no contact for 42 years. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     My mother did reach out when she remarried in 1981 because my stepdad wanted to adopt us. My father said no, which I now realize we could have challenged, but for me and my siblings, our stepdad became the person we considered our dad, so it wasn't very important to us to change our last name. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     'There was almost no contact for 42 years.' </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Several years ago, my father reached out after his wife passed away. He sent each of his five children $1,000 from his wife's life insurance and then a few hundred dollars more after he sold her car. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     At that time, I told him I was not looking for a father-daughter relationship because I already had a dad, but I was willing to maintain some level of correspondence. For about a year, he sent cards, but over the last few years his interaction has decreased, which was not a surprise. However, I still receive emails from him from time to time. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Mention of money </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     I have a legal and a moral question. Occasionally, he mentions his need for money. He has never directly asked for financial assistance, but he has shared some of the problems he has experienced. For example, he was defrauded and had to refinance his house after losing money. He has also had medical expenses, as he is now 83 and his health is declining. Recently, he told me that stairs have become difficult for him and that he would like to install a chair lift but cannot afford it. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     I am generally a compassionate person, so I sometimes wonder whether I should help him financially. While I would empty my savings for my mom (and would have done so for my stepdad, who has passed away), I feel disinclined to send money to someone who is essentially a stranger. He is not destitute: He owns his home and has relationships with his siblings and with some nieces and nephews. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     'I would empty my savings for my mom.' </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     What I want to better understand is whether I have a legal obligation to provide support to this man, who is connected to me only through biology. I don't believe I do. Maryland (where I live) and South Carolina (where he lives) do not have filial-responsibility laws. However, does accepting money from his wife's life insurance create any obligations that would not otherwise exist? Does continuing to communicate with him create any obligation? </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     And finally, setting legal obligations aside, do I have a moral obligation to provide financial support to a man who did not provide food, clothing, shelter, healthcare, safety or emotional support during my childhood or throughout most of my adult life? </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     I wrestle with these questions. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     A Conflicted Daughter </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Don't miss: 'I spend $7,500 a month': I'm 47, earn $260K, and have $3 million. Can I retire at 50? </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     You can email The Moneyist with any financial and ethical questions at qfottrell@marketwatch.com. The Moneyist regrets he cannot reply to questions individually. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     If you give him one penny of your own money, it will open up a transactional codependence between you and this man, who is a virtual stranger. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Dear Daughter, </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     That $1,000 gift was not free. It had strings attached. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     He came back into your life in your 50s when his own wife died and he was on his own, emotionally and financially. I suspect the latter is where his focus lies. Given that he gave away $5,000 of his wife's life-insurance payout as gifts to his five children, we can assume that he received a substantial sum. That money either ran out due perhaps to home repairs and medical expenses, or he spent and invested it poorly. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     What is clear: If he was in his 70s when he got back in touch with you, he has a very clear 360-degree view of his own long-term financial stability. He skipped town to avoid paying one red cent to your mother in child support, and now he's back. That $1,000 was an \"open-your-wallet\" gesture, designed to gain access. People in your life should make you feel safe, nourished and valued. Does he do that? </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     South Carolina does not have filial-responsibility laws, and Maryland repealed its own law in 2017, meaning adult children are not responsible for their parents' debts or care-home costs, unless they sign as a guarantor. While some states still enforce these laws, they often include exceptions, including parental abandonment or failure to provide support, which would relieve the adult children of any liability. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     That $1,000 was an 'open-your-wallet' gesture to give him access. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     This relationship ended at a time when you most needed him, as a child, and that 9-year-old child still exists today. She may still yearn for the approval, acknowledgement, attention and validation of her father, even if she received those things from her stepfather. Your father not only withheld that financial support and love and affection from your 9-year-old self, he also blocked the way for your stepfather to completely fulfill that role. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Now that your stepfather is gone, it is of course too late for him to adopt you. But fatherhood, as you say, is about more than just biology. It's about the most valuable thing we give our loved ones during this short life: our time. Your father has never given you his time. He has only given you that $1,000 as an opening gambit, and now he wants something from you, but he is too Machiavellian to ask for it outright. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     By leaving breadcrumbs for you in the form of hard-luck stories, he is manipulating you and using that 9-year-old child who he knows will always cry out with an open heart and open arms for the father who walked away, closing his wallet and his heart as he moved to another state. If you give him one penny of your own money, it will open up a transactional codependence between you and this man, who is a virtual stranger. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     The $1,000 question </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     You have three choices. The first is to detach with love - that is, politely and kindly, and with no explanations or blame. That means telling him that you wish him well and bear him no ill will. You can gradually stop answering his emails and texts. That's your choice. He is the last person you owe an explanation. You can simply say: \"I need to take time for my family, my health and my life. I wish you well with everything.\" </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Doing that may feel awkward because you accepted $1,000 from this man, your biological father. That's money in the bank in more ways than one, but primarily it gives him emotional and financial leverage. Your second choice is to detach with love and repay the $1,000, as he suggests he needs it more than you do. That way, you are not under obligation to him for anything, and you don't even have to answer his calls. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     The third choice is to stay in contact - with or without repaying the $1,000 - and manage him as you would a busybody neighbor or annoying acquaintance who wants to be closer than you are. You don't have to answer every call or respond to every text. You are not a customer-service representative and you are no longer the little girl who needed a father. You are in your 50s and have other things to worry about. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     I suggest you detach with love and repay the $1,000 he gave you. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     So no, he is not your responsibility. You owe him nothing - legally, ethically or morally. Those ties were broken when he walked away and pulled up the drawbridge behind him. I don't know whether or not he is a narcissist, but from your retelling, he is someone who has always looked out for himself. He is in touch now because he needs something from you. He has nothing to bring to the table. It's likely too late for that. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Legal and ethical issues are governed by standards set by society, but moral choices, for the most part, are for you alone to decide. I want you to make the choice for the right reason, not because you feel manipulated into giving money to a person who may not stop at one direct deposit and not because your 9-year-old self still craves the approval of the man who walked away and didn't look back all those years ago. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Be forewarned about the tools in a narcissist's playbook: Love bombing (giving you what they think you crave) and dry begging (dropping hints about what they need). And when they see you pulling away, be prepared for a complete change of personality (anger and rage and/or guilt-tripping and passive aggression). I am not diagnosing him or implying malicious intent, but I do believe you should be guarded. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Remember, your 9-year-old self already found her real father: your stepdad. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     More columns from Quentin Fottrell: </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Can I stop my kids from using their inheritance to support political causes I vehemently oppose? </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     My wife's credit-card payment is three months overdue. As an authorized user, am I in trouble? </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     My stepmother cheated me out of $500K from my father's estate. What can I do? </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Check out The Moneyist's private Facebook group, where members help answer life's thorniest money issues. Post your questions, or weigh in on the latest Moneyist columns. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     By emailing your questions to The Moneyist or posting your dilemmas on The Moneyist Facebook group, you agree to have them published anonymously on MarketWatch. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  (MORE TO FOLLOW) Dow Jones Newswires</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  02-28-26 1031ET</p>\n\nCopyright (c) 2026 Dow Jones &amp; Company, Inc.</div>",
            "pub_date": "2026-02-28 23:42:14",
            "link": "https://www.morningstar.com/news/marketwatch/20260228165/i-have-a-legal-and-a-moral-question-my-dad-left-when-i-was-9-reconnected-with-me-in-my-50s-and-now-needs-money-what-do-i-owe-him",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "'I have a legal and a moral question': My dad -2-",
            "description": "<div class=\"mdc-article-body\">\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     By submitting your story to Dow Jones &amp; Co., the publisher of MarketWatch, you understand and agree that we may use your story, or versions of it, in all media and platforms, including via third parties. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     -Quentin Fottrell </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     This content was created by MarketWatch, which is operated by Dow Jones &amp; Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal. </p>\n<pre class=\"mdc-article-pre\" data-v-370ea3ac=\"\"></pre>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  (END) Dow Jones Newswires</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  02-28-26 1031ET</p>\n\nCopyright (c) 2026 Dow Jones &amp; Company, Inc.</div>",
            "pub_date": "2026-02-28 23:42:13",
            "link": "https://www.morningstar.com/news/marketwatch/20260228166/i-have-a-legal-and-a-moral-question-my-dad-2",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Waterdrop Filter Debuts Its First Whole-House RO System and Innovative Purification Lineup at KBIS 2026",
            "description": "<div class=\"mdc-article-body\">\n            \n              \n              Waterdrop Filter Debuts Its First Whole-House RO System and Innovative Purification Lineup at KBIS 2026\n              \n            \n            \n              <span>\n<h2 class=\"mdc-article-heading mdc-heading__mdc mdc-heading--level-5__mdc\" data-v-618d53ae=\"\">Waterdrop Filter Debuts Its First Whole-House RO System and Innovative Purification Lineup at KBIS 2026</h2>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">PR Newswire</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">LOS ANGELES, March 1, 2026</p>\n</span>\n<span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span data-v-602de5d2=\"\">LOS ANGELES</span>, <span data-v-602de5d2=\"\">March 1, 2026</span> /PRNewswire/ -- Waterdrop Filter, a global leader in water purification, wrapped up a successful showcase at the 2026 Kitchen &amp; Bath Industry Show (KBIS) in Orlando. As the North America's largest event for kitchen and bath design, this event drew over 622 exhibitors and over 33,000 professional attendees. Waterdrop Filter showcased its latest innovative products spanning whole-house and countertop Reverse Osmosis (RO) solutions.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Throughout the event, the Waterdrop Filter's booth was a major draw, buzzing with thousands of visitors, including designers and industry experts, expressing high praise for its innovative, full-scenario RO systems. Furthermore, retail giants like Costco, Sam's Club, and Walmart, along with key distributors, visited the booth to experience these systems firsthand and engaged in future strategic partnerships.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">At KBIS 2026, Waterdrop Filter's latest flagship innovations commanded significant attention:</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Waterdrop MASTER WHS01 Whole House RO System</strong>: This system marks Waterdrop Filter's entry into the whole-house RO market. It reflects the shift from single-point filtration to whole-home family protection; ensuring clean water reaches every corner of the house. Featuring a 0.0001μm high-precision RO membrane, it aggressively targets heavy metals and fluorides. With smart monitoring and whisper-quiet operation, it is the ultimate \"health shield\" for modern, high-end households.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Waterdrop IM1 Ultimate All-in-One Countertop RO System</strong>: The latest evolution in Hot &amp; Cold All-in-One countertop series, the IM1 seamlessly blends 9-stage RO filtration with a built-in pure ice maker. It features a superior 3:1 pure-to-drain ratio and a dual-mode option (piped or tank version), allowing users to enjoy crystal-clear ice and chilled drinks anytime.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\"><span class=\"mdc-article-underline\" data-v-1f1bdc8a=\"\"><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://www.waterdropfilter.com/products/waterdrop-water-softener-system-for-home?_pos=1&amp;_psq=whr01&amp;_ss=e&amp;_v=1.0&amp;utm_source=prnewswire&amp;utm_medium=pr&amp;utm_campaign=kbis&amp;utm_id=prnewswire\" tabindex=\"0\">Waterdrop WHR01 Whole House Water Softener</a></span></strong>: Using high-efficiency ion exchange to remove calcium and magnesium, this softener prevents scale buildup, extends the life of appliances like water heaters and washing machines, and improves the feel of better skin and cleaner-feeling laundry.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Amid the growing industry focus on \"wellness,\" \"personalization,\" and \"smart integration\" seen at KBIS 2026, Waterdrop Filter also showcased its broader ecosystem, including the WD-ED10G Electric Pitcher, the under-sink RO series X14, X16, G3P800, K8 and so on, addressing needs ranging from convenient daily hydration to high-capacity water purification.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Waterdrop Filter's showcase at KBIS 2026 not only responded to growing demand for healthier drinking water, but also reinforced its long-term vision for full-scenario RO innovation and ecosystem development, advancing smarter and more efficient water purification solutions for modern households.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">About Waterdrop</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Founded in 2015, Waterdrop Filter is a water purification company that offers solutions for homes, offices, and outdoor use. Its product range includes under-sink and countertop Reverse Osmosis (RO) systems, pitchers, and whole-house filters. With the mission of making clean water accessible worldwide, Waterdrop Filter provides water filtration products trusted by over 40 million families globally. Learn more from <span class=\"mdc-article-underline\" data-v-1f1bdc8a=\"\"><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://www.waterdropfilter.com/?utm_source=prnewswire&amp;utm_medium=pr&amp;utm_campaign=kbis&amp;utm_id=prnewswire\" tabindex=\"0\">www.waterdropfilter.com</a></span></p><span><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://mma.prnewswire.com/media/2922788/Waterdrop_Filter_KBIS_2026.html\" tabindex=\"0\"><span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img\" data-v-f0ef0696=\"\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://mma.prnewswire.com/media/2922788/Waterdrop_Filter_KBIS_2026.jpg\"/></picture></span></a></p></span><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"> </p>\n<span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://mma.prnewswire.com/media/2920974/Waterdrop_LPR_Logo.html\" tabindex=\"0\">\n<span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img\" data-v-f0ef0696=\"\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://mma.prnewswire.com/media/2920974/Waterdrop_LPR_Logo.jpg\"/></picture></span>\n</a>\n</p>\n</span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img mdc-article-image__img--12-width\" data-v-f0ef0696=\"\" style=\"width:12px;\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://edge.prnewswire.com/c/img/favicon.png?sn=CN98463&amp;sd=2026-02-28\"/></picture></span> View original content to download multimedia:<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://www.prnewswire.com/news-releases/waterdrop-filter-debuts-its-first-whole-house-ro-system-and-innovative-purification-lineup-at-kbis-2026-302700195.html\" tabindex=\"0\">https://www.prnewswire.com/news-releases/waterdrop-filter-debuts-its-first-whole-house-ro-system-and-innovative-purification-lineup-at-kbis-2026-302700195.html</a></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">SOURCE Waterdrop Filter</p></span>\n</div>",
            "pub_date": "2026-02-28 23:31:32",
            "link": "https://www.morningstar.com/news/pr-newswire/20260228cn98463/waterdrop-filter-debuts-its-first-whole-house-ro-system-and-innovative-purification-lineup-at-kbis-2026",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "KEYTRUDA® (pembrolizumab) Plus WELIREG® (belzutifan) Given as Adjuvant Therapy Reduced the Risk of Disease Recurrence or Death by 28% Compared to KEYTRUDA Monotherapy in Certain Patients With Earlier-Stage Renal Cell Carcinoma (RCC)",
            "description": "<div class=\"mdc-article-body\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">KEYTRUDA<span data-v-479a2324=\"\">®</span> (pembrolizumab) Plus WELIREG<span data-v-479a2324=\"\">®</span> (belzutifan) Given as Adjuvant Therapy Reduced the Risk of Disease Recurrence or Death by 28% Compared to KEYTRUDA Monotherapy in Certain Patients With Earlier-Stage Renal Cell Carcinoma (RCC)</strong>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">This is the first positive Phase 3 trial for WELIREG in earlier-stage disease, the first positive results for a HIF-2α inhibitor and immunotherapy combination and the first study in earlier-stage disease, regardless of tumor type, to demonstrate a disease-free survival improvement compared to KEYTRUDA</strong>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Based on these data, the U.S. FDA has accepted for priority review supplemental applications for WELIREG in combination with KEYTRUDA or KEYTRUDA QLEX™ for the adjuvant treatment of certain patients with RCC</strong>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nMerck (NYSE: MRK), known as MSD outside of the United States and Canada, today announced the presentation of results from the pivotal Phase 3 LITESPARK-022 trial evaluating KEYTRUDA<span data-v-602de5d2=\"\">® </span>(pembrolizumab), Merck’s anti-PD-1 therapy, in combination with WELIREG<span data-v-602de5d2=\"\">®</span> (belzutifan), Merck’s first-in-class, oral hypoxia-inducible factor-2 alpha (HIF-2α) inhibitor, given in the adjuvant setting, for patients with clear cell renal cell carcinoma (RCC) following nephrectomy. These late-breaking data will be presented for the first time today during an oral abstract session at the 2026 American Society of Clinical Oncology (ASCO) Genitourinary (GU) Cancers Symposium (abstract #LBA418) and are included in the official ASCO GU Press Program.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nAt the first pre-specified interim analysis (median follow-up of 28.4 months [range, 15.0-40.1 months]), KEYTRUDA plus WELIREG given in the adjuvant setting significantly improved disease-free survival (DFS), the study’s primary endpoint, reducing the risk of disease recurrence or death by 28% (HR=0.72 [95% CI 0.59-0.87]; p=0.0003) compared to KEYTRUDA plus placebo. Median DFS was not reached in either arm; the estimated 24-month DFS rate was 80.7% (95% CI, 77.7-83.2) for the KEYTRUDA plus WELIREG arm and was 73.7% (95% CI, 70.6-76.6) for the KEYTRUDA plus placebo arm. As previously reported, the trial will continue to evaluate overall survival (OS), a key secondary endpoint.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n“Approximately 40% of patients with renal cell cancer may experience tumor growth after initial treatment. Results from LITESPARK-022 mark an important step forward for certain patients with renal cell cancer, showing a significant reduction in the risk of disease recurrence or death compared to pembrolizumab alone,” said Dr. Toni K. Choueiri, director, Lank Center for Genitourinary Oncology, Dana-Farber Cancer Institute and Jerome and Nancy Kohlberg professor of medicine, Harvard Medical School. “The combination of pembrolizumab and belzutifan is the first ever regimen in the adjuvant setting for renal cell cancer to demonstrate an improvement in disease-free survival over pembrolizumab monotherapy, positioning this regimen to potentially reshape clinical practice.”\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n“LITESPARK-022 is a critical part of our comprehensive RCC clinical development program, and the Phase 3 results presented at ASCO GU underscore the importance of KEYTRUDA and WELIREG in helping to treat patients with certain types of renal cell carcinoma,” said Dr. M. Catherine Pietanza, vice president, Global Clinical Development, Merck Research Laboratories. “These findings represent the first positive Phase 3 data for WELIREG in earlier stages of disease, as well as the first positive Phase 3 results for a HIF‑2α inhibitor and immunotherapy combination, reinforcing our commitment to exploring novel treatment approaches to improve upon established treatment paradigms for patients in need.”\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nThe safety profile of KEYTRUDA plus WELIREG was consistent with that observed in previously reported studies for both agents; no new safety signals were observed. Of patients enrolled, 69.5% of those in the KEYTRUDA plus WELIREG arm and 71.1% of those in the KEYTRUDA plus placebo arm completed the assigned treatment. Among treated patients, Grade ≥3 treatment-emergent adverse events (TEAEs) occurred in 52.1% of patients who received KEYTRUDA plus WELIREG and 30.2% of patients who received KEYTRUDA plus placebo. The most common Grade ≥3 TEAEs were anemia (12.1% versus 0.5%), increased alanine aminotransferase (ALT) (6.4% versus 2.0%) and hypoxia (4.6% versus 0%). Grade 5 treatment-emergent (1.1% versus 1.2%) and treatment-related adverse events (0.3% versus 0.3%) were similar between treatment arms.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nBased on data from the LITESPARK-022 trial, the U.S. Food and Drug Administration (FDA) has accepted for priority review supplemental applications seeking approval of WELIREG in combination with KEYTRUDA or KEYTRUDA QLEX™ (pembrolizumab and berahyaluronidase alfa-pmph) for the adjuvant treatment of adult patients with RCC with a clear cell component with increased risk of recurrence following nephrectomy. The FDA has set a Prescription Drug User Fee Act (PDUFA), or target action date, of June 19, 2026 for the WELIREG sNDA and the KEYTRUDA and KEYTRUDA QLEX sBLAs. Merck will also discuss these data with global regulatory authorities.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nKEYTRUDA is <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.merck.com%2Fnews%2Ffda-approves-mercks-keytruda-pembrolizumab-as-adjuvant-therapy-for-certain-patients-with-renal-cell-carcinoma-rcc-following-surgery%2F&amp;esheet=54435729&amp;newsitemid=20260228025853&amp;lan=en-US&amp;anchor=approved&amp;index=1&amp;md5=b9661c9549faebed8b068999c7f148f4\" tabindex=\"0\">approved</a> for the adjuvant treatment of certain patients with RCC in the U.S., Canada, European Union (EU), Japan and other countries worldwide based on data from KEYNOTE-564.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nWELIREG is <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.merck.com%2Fnews%2Ffda-approves-mercks-welireg-belzutifan-for-the-treatment-of-patients-with-advanced-renal-cell-carcinoma-rcc-following-a-pd-1-or-pd-l1-inhibitor-and-a-vegf-tki%2F&amp;esheet=54435729&amp;newsitemid=20260228025853&amp;lan=en-US&amp;anchor=approved&amp;index=2&amp;md5=2619ddae7431697a068bb1a62b60434c\" tabindex=\"0\">approved</a> in over 45 countries including the U.S., Canada, EU, and Japan for the treatment of adult patients with advanced RCC following a PD-1/PD-L1 inhibitor and 1-2 VEGF-TKIs based on results from the Phase 3 LITESPARK-005 trial.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nMerck has an industry-leading clinical development program in RCC, leveraging multiple approved therapeutic options across multiple settings, including adjuvant and advanced disease.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">About LITESPARK-022</strong>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nLITESPARK-022 is a multicenter, randomized, double-blind Phase 3 trial (ClinicalTrials.gov, <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fclinicaltrials.gov%2Fstudy%2FNCT05239728&amp;esheet=54435729&amp;newsitemid=20260228025853&amp;lan=en-US&amp;anchor=NCT05239728&amp;index=3&amp;md5=3406e2c301167171552fc133ba568e9a\" tabindex=\"0\">NCT05239728</a>) evaluating WELIREG in combination with KEYTRUDA compared to KEYTRUDA plus placebo for the treatment of patients with clear cell RCC following nephrectomy. The primary endpoint is DFS, and key secondary endpoints include OS, safety and quality of life outcomes. The trial enrolled 1,841 patients who were randomized to receive either:\n\n</p><ul class=\"mdc-article-list mdc-article-list--unordered\" data-v-7b473e83=\"\">\n<li data-v-7b473e83=\"\">\nWELIREG (120 mg orally once daily for approximately one year) plus KEYTRUDA (400 mg intravenously every six weeks for approximately one year), or;\n\n</li>\n<li data-v-7b473e83=\"\">\nKEYTRUDA plus placebo.\n\n</li>\n</ul><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">About renal cell carcinoma</strong>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nRenal cell carcinoma is the most common type of kidney cancer, with about nine out of 10 kidney cancer diagnoses being RCC. In 2022, there were about 435,000 new cases of kidney cancer diagnosed and approximately 156,000 deaths from the disease worldwide. Renal cell carcinoma is about twice as common in men as in women. Most cases of RCC are discovered incidentally during imaging tests for other abdominal diseases. Approximately 30% of patients with kidney cancer are diagnosed at an advanced stage.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">About Merck’s early-stage cancer clinical program</strong>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nFinding cancer at an earlier stage may give patients a greater chance of long-term survival. Many cancers are considered most treatable and potentially curable in their earliest stage of disease. Building on the strong understanding of the role of KEYTRUDA in later-stage cancers, Merck is evaluating our portfolio of medicines and pipeline candidates in earlier disease states, with more than 30 ongoing registrational studies across multiple types of cancer.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">About Merck’s research in genitourinary cancers</strong>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nMerck is advancing research aimed at helping transform the treatment landscape and broaden options for people with genitourinary (GU) cancers, including bladder, kidney and prostate cancers. Globally, GU cancers account for an estimated 2.6 million new cancer diagnoses each year, equaling over 1 in 8 of all cancer incidences. Through a robust clinical development program with more than 50 ongoing clinical trials evaluating more than 22,000 patients around the world, Merck is investigating the potential of several portfolio medicines and pipeline assets, leveraging multiple novel combination strategies, across various stages of disease, to help address unmet needs in GU cancers.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">About WELIREG<span data-v-479a2324=\"\">®</span> (belzutifan) 40 mg tablets, for oral use</strong>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nWELIREG, Merck’s first-in-class hypoxia-inducible factor 2 alpha (HIF-2α) inhibitor, is an orally administered small-molecule designed to reduce transcription and expression of HIF-2α target genes associated with cellular proliferation, angiogenesis and tumor growth. By inhibiting HIF-2α signaling, WELIREG aims to disrupt key pathways certain tumors may use to adapt to low-oxygen conditions, including those that help promote abnormal blood vessel formation and support tumor survival.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nWELIREG has received regulatory approvals in patients with certain von Hippel-Lindau (VHL) disease-associated tumors, renal cell carcinoma (RCC) and in pheochromocytoma or paraganglioma (PPGL). As part of a broader clinical program, Merck continues to research WELIREG monotherapy and combination approaches for people with RCC and selected solid tumors across a range of treatment settings, to further define where HIF-2a inhibition may provide clinical benefit.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">WELIREG<span data-v-479a2324=\"\">®</span> (belzutifan) Indications in the U.S.</strong>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">Certain von Hippel-Lindau (VHL) disease-associated tumors</em>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nWELIREG is indicated for the treatment of adult patients with von Hippel-Lindau (VHL) disease who require therapy for associated renal cell carcinoma (RCC), central nervous system (CNS) hemangioblastomas, or pancreatic neuroendocrine tumors (pNET), not requiring immediate surgery.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">Advanced Renal Cell Carcinoma (RCC)</em>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nWELIREG is indicated for the treatment of adult patients with advanced renal cell carcinoma (RCC) with a clear cell component following a programmed death receptor-1 (PD-1) or programmed death ligand 1 (PD-L1) inhibitor and a vascular endothelial growth factor tyrosine kinase inhibitor (VEGF-TKI).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">Pheochromocytoma or Paraganglioma (PPGL)</em>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nWELIREG is indicated for the treatment of adult and pediatric patients 12 years and older with locally advanced, unresectable, or metastatic pheochromocytoma or paraganglioma (PPGL).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Selected Safety Information for WELIREG</strong>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\"><em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">Warning: Embryo-Fetal Toxicity</em></strong>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nExposure to WELIREG during pregnancy can cause embryo-fetal harm. Verify pregnancy status prior to the initiation of WELIREG. Advise patients of these risks and the need for effective non-hormonal contraception as WELIREG can render some hormonal contraceptives ineffective.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Anemia</strong>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nWELIREG can cause severe anemia that can require blood transfusion. Monitor for anemia before initiation of, and periodically throughout, treatment. Transfuse patients as clinically indicated. For patients with hemoglobin &lt;8 g/dL, withhold WELIREG until ≥8 g/dL, then resume at the same or reduced dose or permanently discontinue WELIREG, depending on the severity of anemia. For life-threatening anemia or when urgent intervention is indicated, withhold WELIREG until hemoglobin ≥8 g/dL, then resume at a reduced dose or permanently discontinue WELIREG.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nIn LITESPARK-004 (N=61), decreased hemoglobin occurred in 93% of patients with VHL disease and 7% had Grade 3 events. Median time to onset of anemia was 31 days (range: 1 day to 8.4 months).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nThe safety of erythropoiesis-stimulating agents (ESAs) for treatment of anemia in patients with VHL disease treated with WELIREG has not been established.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nIn LITESPARK-005 (n=372), decreased hemoglobin occurred in 88% of patients with advanced RCC with a clear cell component and 29% had Grade 3 events. Median time to onset of anemia was 29 days (range: 1 day to 16.6 months). Of the patients with anemia, 22% received transfusions only, 20% received ESAs only, and 12% received both transfusion and ESAs.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nIn LITESPARK-015, anemia occurred in 96% of patients and 22% had Grade 3 events. Median time to onset of anemia was 29 days (range: 1 day to 22.1 months). Of the patients with anemia, 20% received transfusions only, 26% received ESAs only, and 6% received both transfusion and ESAs.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Hypoxia</strong>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nWELIREG can cause severe hypoxia that may require discontinuation, supplemental oxygen, or hospitalization.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nMonitor oxygen saturation before initiation of, and periodically throughout, treatment. For decreased oxygen saturation with exercise (e.g., pulse oximeter &lt;88% or PaO2 ≤55 mm Hg), consider withholding WELIREG until pulse oximetry with exercise is greater than 88%, then resume at the same dose or a reduced dose. For decreased oxygen saturation at rest (e.g., pulse oximeter &lt;88% or PaO2 ≤55 mm Hg) or when urgent intervention is indicated, withhold WELIREG until resolved and resume at a reduced dose or discontinue. For life-threatening hypoxia or recurrent symptomatic hypoxia, permanently discontinue WELIREG. Advise patients to report signs and symptoms of hypoxia immediately to a healthcare provider.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nIn LITESPARK-004, hypoxia occurred in 1.6% of patients.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nIn LITESPARK-005, hypoxia occurred in 15% of patients and 10% had Grade 3 events. Of the patients with hypoxia, 69% were treated with oxygen therapy. Median time to onset of hypoxia was 30.5 days (range: 1 day to 21.1 months).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nIn LITESPARK-015, hypoxia occurred in 13% of patients and 10% had Grade 3 hypoxia. Median time to onset of hypoxia was 35 days (range: 6 days to 23.9 months). Of the patients with hypoxia, 67% were treated with oxygen therapy.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Embryo-Fetal Toxicity</strong>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nBased on findings in animals, WELIREG can cause fetal harm when administered to a pregnant woman.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nAdvise pregnant women and females of reproductive potential of the potential risk to the fetus. Advise females of reproductive potential to use effective non-hormonal contraception during treatment with WELIREG and for 1 week after the last dose. WELIREG can render some hormonal contraceptives ineffective. Advise male patients with female partners of reproductive potential to use effective contraception during treatment with WELIREG and for 1 week after the last dose.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Adverse Reactions</strong>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<span data-v-602de5d2=\"\">Adverse Reactions in LITESPARK-004</span>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nSerious adverse reactions occurred in 15% of patients, including anemia, hypoxia, anaphylaxis reaction, retinal detachment, and central retinal vein occlusion (1 patient each). WELIREG was permanently discontinued due to adverse reactions in 3.3% of patients for dizziness and opioid overdose (1.6% each).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nDosage interruptions due to an adverse reaction occurred in 39% of patients. Those which required dosage interruption in &gt;2% of patients were fatigue, decreased hemoglobin, anemia, nausea, abdominal pain, headache, and influenza-like illness.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nDose reductions due to an adverse reaction occurred in 13% of patients. The most frequently reported adverse reaction which required dose reduction was fatigue (7%).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nThe most common adverse reactions (≥25%), including laboratory abnormalities, that occurred in patients who received WELIREG were decreased hemoglobin (93%), fatigue (64%), increased creatinine (64%), headache (39%), dizziness (38%), increased glucose (34%), and nausea (31%).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<span data-v-602de5d2=\"\">Adverse Reactions in LITESPARK-005</span>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nSerious adverse reactions occurred in 38% of patients. The most frequently reported serious adverse reactions were hypoxia (7%), anemia (5%), pneumonia (3.5%), hemorrhage (3%), and pleural effusion (2.2%). Fatal adverse reactions occurred in 3.2% of patients who received WELIREG, including sepsis (0.5%) and hemorrhage (0.5%).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nWELIREG was permanently discontinued due to adverse reactions in 6% of patients. Adverse reactions which resulted in permanent discontinuation (≥0.5%) were hypoxia (1.1%), anemia (0.5%), and hemorrhage (0.5%).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nDosage interruptions due to an adverse reaction occurred in 39% of patients. Of the patients who received WELIREG, 28% were 65 to 74 years, and 10% were 75 years and over. Dose interruptions occurred in 48% of patients ≥65 years of age and in 34% of younger patients. Adverse reactions which required dosage interruption in ≥2% of patients were anemia (8%), hypoxia (5%), COVID-19 (4.3%), fatigue (3.2%), and hemorrhage (2.2%).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nDose reductions due to an adverse reaction occurred in 13% of patients. Dose reductions occurred in 18% of patients ≥65 years of age and in 10% of younger patients. The most frequently reported adverse reactions which required dose reduction (≥1.0%) were hypoxia (5%) and anemia (3.2%).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nThe most common (≥25%) adverse reactions, including laboratory abnormalities, were decreased hemoglobin (88%), fatigue (43%), musculoskeletal pain (34%), increased creatinine (34%), decreased lymphocytes (34%), increased alanine aminotransferase (32%), decreased sodium (31%), increased potassium (29%), and increased aspartate aminotransferase (27%).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<span data-v-602de5d2=\"\">Adverse Reactions in LITESPARK-015</span>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nSerious adverse reactions occurred in 36% of patients. The most frequently reported serious adverse reactions were anemia and hypertension (4.2% each) and pyelonephritis, pneumonia, hypoxia, dyspnea and hemorrhage (2.8% each).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nWELIREG was permanently discontinued due to adverse reactions in 2 patients (2.8%). Adverse reactions which resulted in permanent discontinuation were increased alanine aminotransferase and paraparesis (1.4% each).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nDosage interruptions due to an adverse reaction occurred in 40% of patients. Of the patients who received WELIREG, 13% were ≥65 years old and 4.2% were ≥75 years. Adverse reactions which required dosage interruption in &gt;3% of patients were hypoxia, nausea and fatigue (4.2% each).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nDose reductions due to an adverse reaction occurred in 14% of patients. The most frequently reported adverse reaction which required dose reduction was hypoxia (4.2%).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nThe most common (≥25%) adverse reactions, including laboratory abnormalities, that occurred in patients were anemia (96%), fatigue (56%), musculoskeletal pain (56%), decreased lymphocytes (54%), increased alanine aminotransferase (51%), increased aspartate aminotransferase (42%), increased calcium (34%), dyspnea (33%), increased potassium (31%), decreased leukocytes (30%), headache (29%), increased alkaline phosphatase (25%), dizziness (26%) and nausea (25%).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Drug Interactions</strong>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nCoadministration of WELIREG with inhibitors of UGT2B17 or CYP2C19 increases plasma exposure of belzutifan, which may increase the incidence and severity of adverse reactions. Monitor for anemia and hypoxia and reduce the dosage of WELIREG as recommended.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nCoadministration of WELIREG with CYP3A4 substrates decreases concentrations of CYP3A4 substrates, which may reduce the efficacy of these substrates or lead to therapeutic failures. Avoid coadministration with sensitive CYP3A4 substrates. If coadministration cannot be avoided, increase the sensitive CYP3A4 substrate dosage in accordance with its Prescribing Information. Coadministration of WELIREG with hormonal contraceptives may lead to contraceptive failure or an increase in breakthrough bleeding.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Lactation</strong>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nBecause of the potential for serious adverse reactions in breastfed children, advise women not to breastfeed during treatment with WELIREG and for 1 week after the last dose.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Females and Males of Reproductive Potential</strong>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nWELIREG can cause fetal harm when administered to a pregnant woman. Verify the pregnancy status of females of reproductive potential prior to initiating treatment with WELIREG.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nUse of WELIREG may reduce the efficacy of hormonal contraceptives. Advise females of reproductive potential to use effective non-hormonal contraception during treatment with WELIREG and for 1 week after the last dose. Advise males with female partners of reproductive potential to use effective contraception during treatment with WELIREG and for 1 week after the last dose.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nBased on findings in animals, WELIREG may impair fertility in males and females of reproductive potential and the reversibility of this effect is unknown.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Pediatric Use</strong>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nThe safety and effectiveness of WELIREG have been established in pediatric patients aged 12 years and older for the treatment of locally advanced, unresectable, or metastatic pheochromocytoma or paraganglioma.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Renal Impairment</strong>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nFor patients with severe renal impairment (eGFR 15-29 mL/min estimated by MDRD), monitor for increased adverse reactions and modify the dosage as recommended.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Hepatic Impairment</strong>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nWELIREG has not been studied in patients with severe hepatic impairment (total bilirubin &gt;1.5 x ULN and any AST). For patients with moderate and severe hepatic impairment, monitor for increased adverse reactions and modify the dosage as recommended.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Please see Prescribing Information, including information for the Boxed Warning about embryo-fetal toxicity, for WELIREG (belzutifan) at </strong><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.merck.com%2Fproduct%2Fusa%2Fpi_circulars%2Fw%2Fwelireg%2Fwelireg_pi.pdf&amp;esheet=54435729&amp;newsitemid=20260228025853&amp;lan=en-US&amp;anchor=https%3A%2F%2Fwww.merck.com%2Fproduct%2Fusa%2Fpi_circulars%2Fw%2Fwelireg%2Fwelireg_pi.pdf&amp;index=4&amp;md5=7fe9d320e71bef488c4f7c98a412de03\" tabindex=\"0\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">https://www.merck.com/product/usa/pi_circulars/w/welireg/welireg_pi.pdf</strong></a><strong class=\"mdc-article-strong\" data-v-479a2324=\"\"></strong><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">and Medication Guide for WELIREG at </strong><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.merck.com%2Fproduct%2Fusa%2Fpi_circulars%2Fw%2Fwelireg%2Fwelireg_mg.pdf&amp;esheet=54435729&amp;newsitemid=20260228025853&amp;lan=en-US&amp;anchor=https%3A%2F%2Fwww.merck.com%2Fproduct%2Fusa%2Fpi_circulars%2Fw%2Fwelireg%2Fwelireg_mg.pdf&amp;index=5&amp;md5=a4f95f31576e0d69c90dc6500ccbac79\" tabindex=\"0\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">https://www.merck.com/product/usa/pi_circulars/w/welireg/welireg_mg.pdf</strong></a><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">.</strong>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">About KEYTRUDA<span data-v-479a2324=\"\">®</span> (pembrolizumab) injection for intravenous use, 100 mg</strong>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nKEYTRUDA is an anti-programmed death receptor-1 (PD-1) therapy that works by increasing the ability of the body’s immune system to help detect and fight tumor cells. KEYTRUDA is a humanized monoclonal antibody that blocks the interaction between PD-1 and its ligands, PD- L1 and PD-L2, thereby activating T lymphocytes which may affect both tumor cells and healthy cells.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nMerck has the industry’s largest immuno-oncology clinical research program. There are currently more than 1,600 trials studying KEYTRUDA across a wide variety of cancers and treatment settings. The KEYTRUDA clinical program seeks to understand the role of KEYTRUDA across cancers and the factors that may predict a patient's likelihood of benefitting from treatment with KEYTRUDA, including exploring several different biomarkers.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">About KEYTRUDA QLEX™ (pembrolizumab and berahyaluronidase alfa-pmph) injection for subcutaneous use</strong>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nKEYTRUDA QLEX is a fixed-combination drug product of pembrolizumab and berahyaluronidase alfa. Pembrolizumab is a programmed death receptor-1 (PD-1) blocking antibody and berahyaluronidase alfa enhances dispersion and permeability to enable subcutaneous administration of pembrolizumab. KEYTRUDA QLEX is administered as a subcutaneous injection into the thigh or abdomen, avoiding the 5 cm area around the navel, over one minute every three weeks (2.4 mL) or over two minutes every six weeks (4.8 mL).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Selected KEYTRUDA<span data-v-479a2324=\"\">®</span> (pembrolizumab) Indications in the U.S.</strong>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">Renal Cell Carcinoma</em>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nKEYTRUDA and KEYTRUDA QLEX are each indicated, in combination with axitinib, for the first-line treatment of adult patients with advanced renal cell carcinoma (RCC).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nKEYTRUDA and KEYTRUDA QLEX are each indicated for the adjuvant treatment of adult patients with renal cell carcinoma (RCC) at intermediate high or high risk of recurrence following nephrectomy, or following nephrectomy and resection of metastatic lesions.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">See additional selected KEYTRUDA indications in the U.S. after the Selected Important Safety Information.</em>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Selected Important Safety Information for KEYTRUDA and KEYTRUDA QLEX</strong>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Contraindications</strong>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nKEYTRUDA QLEX is contraindicated in patients with known hypersensitivity to berahyaluronidase alfa, hyaluronidase or to any of its excipients.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Severe and Fatal Immune-Mediated Adverse Reactions</strong>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nKEYTRUDA and KEYTRUDA QLEX are monoclonal antibodies that belong to a class of drugs that bind to either the programmed death receptor-1 (PD-1) or the programmed death ligand 1 (PD-L1), blocking the PD-1/PD-L1 pathway, thereby removing inhibition of the immune response, potentially breaking peripheral tolerance and inducing immune-mediated adverse reactions. Immune-mediated adverse reactions, which may be severe or fatal, can occur in any organ system or tissue, can affect more than one body system simultaneously, and can occur at any time after starting treatment or after discontinuation of treatment. Important immune-mediated adverse reactions listed here may not include all possible severe and fatal immune-mediated adverse reactions.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nMonitor patients closely for symptoms and signs that may be clinical manifestations of underlying immune-mediated adverse reactions. Early identification and management are essential to ensure safe use of anti–PD-1/PD-L1 treatments. Evaluate liver enzymes, creatinine, and thyroid function at baseline and periodically during treatment. For patients with TNBC treated with KEYTRUDA or KEYTRUDA QLEX in the neoadjuvant setting, monitor blood cortisol at baseline, prior to surgery, and as clinically indicated. In cases of suspected immune-mediated adverse reactions, initiate appropriate workup to exclude alternative etiologies, including infection. Institute medical management promptly, including specialty consultation as appropriate.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nWithhold or permanently discontinue KEYTRUDA and KEYTRUDA QLEX depending on severity of the immune-mediated adverse reaction. In general, if KEYTRUDA and KEYTRUDA QLEX require interruption or discontinuation, administer systemic corticosteroid therapy (1 to 2 mg/kg/day prednisone or equivalent) until improvement to Grade 1 or less. Upon improvement to Grade 1 or less, initiate corticosteroid taper and continue to taper over at least 1 month. Consider administration of other systemic immunosuppressants in patients whose adverse reactions are not controlled with corticosteroid therapy.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<span data-v-602de5d2=\"\">Immune-Mediated Pneumonitis</span>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nKEYTRUDA and KEYTRUDA QLEX can cause immune-mediated pneumonitis. The incidence is higher in patients who have received prior thoracic radiation. Immune-mediated pneumonitis occurred in 3.4% (94/2799) of patients receiving KEYTRUDA, including fatal (0.1%), Grade 4 (0.3%), Grade 3 (0.9%), and Grade 2 (1.3%) reactions. Systemic corticosteroids were required in 67% (63/94) of patients. Pneumonitis led to permanent discontinuation of KEYTRUDA in 1.3% (36) and withholding in 0.9% (26) of patients. All patients who were withheld reinitiated KEYTRUDA after symptom improvement; of these, 23% had recurrence. Pneumonitis resolved in 59% of the 94 patients. Immune-mediated pneumonitis occurred in 5% (13/251) of patients receiving KEYTRUDA QLEX in combination with chemotherapy, including fatal (0.4%), Grade 3 (2%), and Grade 2 (1.2%) adverse reactions.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nPneumonitis occurred in 7% (41/580) of adult patients with resected NSCLC who received KEYTRUDA as a single agent for adjuvant treatment of NSCLC, including fatal (0.2%), Grade 4 (0.3%), and Grade 3 (1%) adverse reactions. Patients received high-dose corticosteroids for a median duration of 10 days (range: 1 day to 2.3 months). Pneumonitis led to discontinuation of KEYTRUDA in 26 (4.5%) of patients. Of the patients who developed pneumonitis, 54% interrupted KEYTRUDA, 63% discontinued KEYTRUDA, and 71% had resolution.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<span data-v-602de5d2=\"\">Immune-Mediated Colitis</span>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nKEYTRUDA and KEYTRUDA QLEX can cause immune-mediated colitis, which may present with diarrhea. Cytomegalovirus infection/reactivation has been reported in patients with corticosteroid-refractory immune-mediated colitis. In cases of corticosteroid-refractory colitis, consider repeating infectious workup to exclude alternative etiologies.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nImmune-mediated colitis occurred in 1.7% (48/2799) of patients receiving KEYTRUDA, including Grade 4 (&lt;0.1%), Grade 3 (1.1%), and Grade 2 (0.4%) reactions. Systemic corticosteroids were required in 69% (33/48); additional immunosuppressant therapy was required in 4.2% of patients. Colitis led to permanent discontinuation of KEYTRUDA in 0.5% (15) and withholding in 0.5% (13) of patients. All patients who were withheld reinitiated KEYTRUDA after symptom improvement; of these, 23% had recurrence. Colitis resolved in 85% of the 48 patients. Immune-mediated colitis occurred in 1.2% (3/251) of patients receiving KEYTRUDA QLEX in combination with chemotherapy, including Grade 3 (0.8%) and Grade 2 (0.4%) adverse reactions.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<span data-v-602de5d2=\"\">Hepatotoxicity and Immune-Mediated Hepatitis</span>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nKEYTRUDA and KEYTRUDA QLEX can cause immune-mediated hepatitis. Immune-mediated hepatitis occurred in 0.7% (19/2799) of patients receiving KEYTRUDA, including Grade 4 (&lt;0.1%), Grade 3 (0.4%), and Grade 2 (0.1%) reactions. Systemic corticosteroids were required in 68% (13/19) of patients; additional immunosuppressant therapy was required in 11% of patients. Hepatitis led to permanent discontinuation of KEYTRUDA in 0.2% (6) and withholding in 0.3% (9) of patients. All patients who were withheld reinitiated KEYTRUDA after symptom improvement; of these, none had recurrence. Hepatitis resolved in 79% of the 19 patients. Immune-mediated hepatitis occurred in 0.4% (1/251) of patients receiving KEYTRUDA QLEX in combination with chemotherapy, including Grade 2 (0.4%) adverse reactions.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">KEYTRUDA With Axitinib or KEYTRUDA QLEX With Axitinib</em>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nKEYTRUDA and KEYTRUDA QLEX, when either is used in combination with axitinib, can cause hepatic toxicity. Monitor liver enzymes before initiation of and periodically throughout treatment. Consider monitoring more frequently as compared to when the drugs are administered as single agents. For elevated liver enzymes, interrupt KEYTRUDA and axitinib or KEYTRUDA QLEX and axitinib, and consider administering corticosteroids as needed.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nWith the combination of KEYTRUDA and axitinib, Grades 3 and 4 increased alanine aminotransferase (ALT) (20%) and increased aspartate aminotransferase (AST) (13%) were seen at a higher frequency compared to KEYTRUDA alone. Fifty-nine percent of the patients with increased ALT received systemic corticosteroids. In patients with ALT ≥3 times upper limit of normal (ULN) (Grades 2-4, n=116), ALT resolved to Grades 0-1 in 94%. Among the 92 patients who were rechallenged with either KEYTRUDA (n=3) or axitinib (n=34) administered as a single agent or with both (n=55), recurrence of ALT ≥3 times ULN was observed in 1 patient receiving KEYTRUDA, 16 patients receiving axitinib, and 24 patients receiving both. All patients with a recurrence of ALT ≥3 ULN subsequently recovered from the event.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<span data-v-602de5d2=\"\">Immune-Mediated Endocrinopathies</span>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">Adrenal Insufficiency</em>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nKEYTRUDA and KEYTRUDA QLEX can cause primary or secondary adrenal insufficiency. For Grade 2 or higher, initiate symptomatic treatment, including hormone replacement as clinically indicated. Withhold KEYTRUDA and KEYTRUDA QLEX depending on severity. Adrenal insufficiency occurred in 0.8% (22/2799) of patients receiving KEYTRUDA, including Grade 4 (&lt;0.1%), Grade 3 (0.3%), and Grade 2 (0.3%) reactions. Systemic corticosteroids were required in 77% (17/22) of patients; of these, the majority remained on systemic corticosteroids. Adrenal insufficiency led to permanent discontinuation of KEYTRUDA in &lt;0.1% (1) and withholding in 0.3% (8) of patients. All patients who were withheld reinitiated KEYTRUDA after symptom improvement. Adrenal insufficiency occurred in 2% (5/251) of patients receiving KEYTRUDA QLEX in combination with chemotherapy, including Grade 3 (0.4%) and Grade 2 (0.8%) adverse reactions.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">Hypophysitis</em>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nKEYTRUDA and KEYTRUDA QLEX can cause immune-mediated hypophysitis. Hypophysitis can present with acute symptoms associated with mass effect such as headache, photophobia, or visual field defects. Hypophysitis can cause hypopituitarism. Initiate hormone replacement as indicated. Withhold or permanently discontinue KEYTRUDA and KEYTRUDA QLEX depending on severity.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nHypophysitis occurred in 0.6% (17/2799) of patients receiving KEYTRUDA, including Grade 4 (&lt;0.1%), Grade 3 (0.3%), and Grade 2 (0.2%) reactions. Systemic corticosteroids were required in 94% (16/17) of patients; of these, the majority remained on systemic corticosteroids. Hypophysitis led to permanent discontinuation of KEYTRUDA in 0.1% (4) and withholding in 0.3% (7) of patients. All patients who were withheld reinitiated KEYTRUDA after symptom improvement.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">Thyroid Disorders</em>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nKEYTRUDA and KEYTRUDA QLEX can cause immune-mediated thyroid disorders. Thyroiditis can present with or without endocrinopathy. Hypothyroidism can follow hyperthyroidism. Initiate hormone replacement for hypothyroidism or institute medical management of hyperthyroidism as clinically indicated. Withhold or permanently discontinue KEYTRUDA and KEYTRUDA QLEX depending on severity.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nThyroiditis occurred in 0.6% (16/2799) of patients receiving KEYTRUDA, including Grade 2 (0.3%). None discontinued, but KEYTRUDA was withheld in &lt;0.1% (1) of patients.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nHyperthyroidism occurred in 3.4% (96/2799) of patients receiving KEYTRUDA, including Grade 3 (0.1%) and Grade 2 (0.8%). It led to permanent discontinuation of KEYTRUDA in &lt;0.1% (2) and withholding in 0.3% (7) of patients. All patients who were withheld reinitiated KEYTRUDA after symptom improvement. Hypothyroidism occurred in 8% (237/2799) of patients receiving KEYTRUDA, including Grade 3 (0.1%) and Grade 2 (6.2%). It led to permanent discontinuation of KEYTRUDA in &lt;0.1% (1) and withholding in 0.5% (14) of patients. All patients who were withheld reinitiated KEYTRUDA after symptom improvement. The majority of patients with hypothyroidism required long-term thyroid hormone replacement. The incidence of new or worsening hypothyroidism was higher in 1185 patients with HNSCC, occurring in 16% of patients receiving KEYTRUDA as a single agent or in combination with platinum and FU, including Grade 3 (0.3%) hypothyroidism. The incidence of new or worsening hyperthyroidism was higher in 580 patients with resected NSCLC, occurring in 11% of patients receiving KEYTRUDA as a single agent as adjuvant treatment, including Grade 3 (0.2%) hyperthyroidism. The incidence of new or worsening hypothyroidism was higher in 580 patients with resected NSCLC, occurring in 22% of patients receiving KEYTRUDA as a single agent as adjuvant treatment (KEYNOTE-091), including Grade 3 (0.3%) hypothyroidism.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nThyroiditis occurred in 0.4% (1/251) of patients receiving KEYTRUDA QLEX in combination with chemotherapy, including Grade 2 (0.4%). Hyperthyroidism occurred in 8% (20/251) of patients receiving KEYTRUDA QLEX in combination with chemotherapy, including Grade 2 (3.2%). Hypothyroidism occurred in 14% (35/251) of patients receiving KEYTRUDA QLEX in combination with chemotherapy, including Grade 2 (11%).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">Type 1 Diabetes Mellitus (DM), Which Can Present With Diabetic Ketoacidosis</em>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nMonitor patients for hyperglycemia or other signs and symptoms of diabetes. Initiate treatment with insulin as clinically indicated. Withhold KEYTRUDA and KEYTRUDA QLEX depending on severity. Type 1 DM occurred in 0.2% (6/2799) of patients receiving KEYTRUDA. It led to permanent discontinuation in &lt;0.1% (1) and withholding of KEYTRUDA in &lt;0.1% (1) of patients. All patients who were withheld reinitiated KEYTRUDA after symptom improvement. Type 1 DM occurred in 0.4% (1/251) of patients receiving KEYTRUDA QLEX in combination with chemotherapy.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<span data-v-602de5d2=\"\">Immune-Mediated Nephritis With Renal Dysfunction</span>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nKEYTRUDA and KEYTRUDA QLEX can cause immune-mediated nephritis.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nImmune-mediated nephritis occurred in 0.3% (9/2799) of patients receiving KEYTRUDA, including Grade 4 (&lt;0.1%), Grade 3 (0.1%), and Grade 2 (0.1%) reactions. Systemic corticosteroids were required in 89% (8/9) of patients. Nephritis led to permanent discontinuation of KEYTRUDA in 0.1% (3) and withholding in 0.1% (3) of patients. All patients who were withheld reinitiated KEYTRUDA after symptom improvement; of these, none had recurrence. Nephritis resolved in 56% of the 9 patients.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<span data-v-602de5d2=\"\">Immune-Mediated Dermatologic Adverse Reactions</span>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nKEYTRUDA and KEYTRUDA QLEX can cause immune-mediated rash or dermatitis. Exfoliative dermatitis, including Stevens-Johnson syndrome, drug rash with eosinophilia and systemic symptoms, and toxic epidermal necrolysis, has occurred with anti–PD-1/PD-L1 treatments. Topical emollients and/or topical corticosteroids may be adequate to treat mild to moderate nonexfoliative rashes. Withhold or permanently discontinue KEYTRUDA and KEYTRUDA QLEX depending on severity.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nImmune-mediated dermatologic adverse reactions occurred in 1.4% (38/2799) of patients receiving KEYTRUDA, including Grade 3 (1%) and Grade 2 (0.1%) reactions. Systemic corticosteroids were required in 40% (15/38) of patients. These reactions led to permanent discontinuation in 0.1% (2) and withholding of KEYTRUDA in 0.6% (16) of patients. All patients who were withheld reinitiated KEYTRUDA after symptom improvement; of these, 6% had recurrence. The reactions resolved in 79% of the 38 patients. Immune-mediated dermatologic adverse reactions occurred in 1.6% (4/251) of patients receiving KEYTRUDA QLEX in combination with chemotherapy, including Grade 4 (0.8%) and Grade 3 (0.8%) adverse reactions.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<span data-v-602de5d2=\"\">Other Immune-Mediated Adverse Reactions</span>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nThe following clinically significant immune-mediated adverse reactions occurred at an incidence of &lt;1% (unless otherwise noted) in patients who received KEYTRUDA, KEYTRUDA QLEX, or were reported with the use of other anti–PD-1/PD-L1 treatments. Severe or fatal cases have been reported for some of these adverse reactions. <em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">Cardiac/Vascular:</em> Myocarditis, pericarditis, vasculitis; <em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">Nervous System:</em> Meningitis, encephalitis, myelitis and demyelination, myasthenic syndrome/myasthenia gravis (including exacerbation), Guillain-Barré syndrome, nerve paresis, autoimmune neuropathy; <em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">Ocular:</em> Uveitis, iritis and other ocular inflammatory toxicities can occur. Some cases can be associated with retinal detachment. Various grades of visual impairment, including blindness, can occur. If uveitis occurs in combination with other immune-mediated adverse reactions, consider a Vogt-Koyanagi-Harada-like syndrome, as this may require treatment with systemic steroids to reduce the risk of permanent vision loss; <em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">Gastrointestinal:</em> Pancreatitis, to include increases in serum amylase and lipase levels, gastritis (2.8%), duodenitis; <em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">Musculoskeletal and Connective Tissue:</em> Myositis/polymyositis, rhabdomyolysis (and associated<em class=\"mdc-article-emphasis\" data-v-370fea16=\"\"></em>sequelae, including renal failure), arthritis (1.5%), polymyalgia rheumatica;<em class=\"mdc-article-emphasis\" data-v-370fea16=\"\"> Endocrine:</em> Hypoparathyroidism; <em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">Hematologic/Immune:</em> Hemolytic anemia,<em class=\"mdc-article-emphasis\" data-v-370fea16=\"\"></em>aplastic anemia, hemophagocytic lymphohistiocytosis, systemic inflammatory<em class=\"mdc-article-emphasis\" data-v-370fea16=\"\"></em>response syndrome, histiocytic necrotizing lymphadenitis (Kikuchi<em class=\"mdc-article-emphasis\" data-v-370fea16=\"\"></em>lymphadenitis), sarcoidosis, immune thrombocytopenic purpura, solid organ<em class=\"mdc-article-emphasis\" data-v-370fea16=\"\"></em>transplant rejection, other transplant (including corneal graft) rejection.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Hypersensitivity and Infusion- or Administration-Related Reactions</strong>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nKEYTRUDA and KEYTRUDA QLEX can cause severe or life-threatening administration-related reactions, including hypersensitivity and anaphylaxis. With KEYTRUDA and KEYTRUDA QLEX, monitor for signs and symptoms of infusion- and administration-related systemic reactions including rigors, chills, wheezing, pruritus, flushing, rash, hypotension, hypoxemia, and fever. Infusion-related reactions have been reported in 0.2% of 2799 patients receiving KEYTRUDA. Interrupt or slow the rate of infusion for Grade 1 or Grade 2 reactions. For Grade 3 or Grade 4 reactions, stop infusion and permanently discontinue KEYTRUDA. Hypersensitivity and administration related systemic reactions occurred in 3.2% (8/251) of patients receiving KEYTRUDA QLEX in combination with platinum doublet chemotherapy, including Grade 2 (2.8%). Interrupt injection (if not already fully administered) and resume if symptoms resolve for mild or moderate systemic reactions. For severe or life-threatening systemic reactions, stop injection and permanently discontinue KEYTRUDA QLEX.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Complications of Allogeneic Hematopoietic Stem Cell Transplantation (HSCT)</strong>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nFatal and other serious complications can occur in patients who receive allogeneic HSCT before or after anti–PD-1/PD-L1 treatments. Transplant-related complications include hyperacute graft-versus-host disease (GVHD), acute and chronic GVHD, hepatic veno-occlusive disease after reduced intensity conditioning, and steroid-requiring febrile syndrome (without an identified infectious cause). These complications may occur despite intervening therapy between anti–PD-1/PD-L1 treatments and allogeneic HSCT. Follow patients closely for evidence of these complications and intervene promptly. Consider the benefit vs risks of using anti–PD-1/PD-L1 treatments prior to or after an allogeneic HSCT.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Increased Mortality in Patients With Multiple Myeloma</strong>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nIn trials in patients with multiple myeloma, the addition of KEYTRUDA to a thalidomide analogue plus dexamethasone resulted in increased mortality. Treatment of these patients with an anti–PD-1/PD-L1 treatment in this combination is not recommended outside of controlled trials.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Embryofetal Toxicity</strong>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nBased on their mechanism of action, KEYTRUDA and KEYTRUDA QLEX can each cause fetal harm when administered to a pregnant woman. Advise women of this potential risk. In females of reproductive potential, verify pregnancy status prior to initiating KEYTRUDA or KEYTRUDA QLEX and advise them to use effective contraception during treatment and for 4 months after the last dose.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Adverse Reactions</strong>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nIn study MK-3475A-D77, when KEYTRUDA QLEX was administered with chemotherapy in metastatic non–small cell lung cancer (NSCLC), serious adverse reactions occurred in 39% of patients. Serious adverse reactions in ≥1% of patients who received KEYTRUDA QLEX were pneumonia (10%), thrombocytopenia (4%), febrile neutropenia (4%), neutropenia (2.8%), musculoskeletal pain (2%), pneumonitis (2%), diarrhea (1.6%), rash (1.2%), respiratory failure (1.2%), and anemia (1.2%). Fatal adverse reactions occurred in 10% of patients including pneumonia (3.2%), neutropenic sepsis (2%), death not otherwise specified (1.6%), respiratory failure (1.2%), parotitis (0.4%), pneumonitis (0.4%), pneumothorax (0.4%), pulmonary embolism (0.4%), neutropenic colitis (0.4%), and seizure (0.4%). KEYTRUDA QLEX was permanently discontinued due to an adverse reaction in 16% of 251 patients. Adverse reactions which resulted in permanent discontinuation of KEYTRUDA QLEX in ≥2% of patients included pneumonia and pneumonitis. Dosage interruptions of KEYTRUDA QLEX due to an adverse reaction occurred in 45% of patients. Adverse reactions which required dosage interruption in ≥2% of patients included neutropenia, anemia, thrombocytopenia, pneumonia, rash, and increased aspartate aminotransferase. The most common adverse reactions (≥20%) were nausea (25%), fatigue (25%), and musculoskeletal pain (21%).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nIn KEYNOTE-006, KEYTRUDA was discontinued due to adverse reactions in 9% of 555 patients with advanced melanoma; adverse reactions leading to permanent discontinuation in more than one patient were colitis (1.4%), autoimmune hepatitis (0.7%), allergic reaction (0.4%), polyneuropathy (0.4%), and cardiac failure (0.4%). The most common adverse reactions (≥20%) with KEYTRUDA were fatigue (28%), diarrhea (26%), rash (24%), and nausea (21%).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nIn KEYNOTE-054, when KEYTRUDA was administered as a single agent to patients with stage III melanoma, KEYTRUDA was permanently discontinued due to adverse reactions in 14% of 509 patients; the most common (≥1%) were pneumonitis (1.4%), colitis (1.2%), and diarrhea (1%). Serious adverse reactions occurred in 25% of patients receiving KEYTRUDA. The most common adverse reaction (≥20%) with KEYTRUDA was diarrhea (28%). In KEYNOTE-716, when KEYTRUDA was administered as a single agent to patients with stage IIB or IIC melanoma, adverse reactions occurring in patients with stage IIB or IIC melanoma were similar to those occurring in 1011 patients with stage III melanoma from KEYNOTE-054.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nIn KEYNOTE-189, when KEYTRUDA was administered with pemetrexed and platinum chemotherapy in metastatic nonsquamous NSCLC, KEYTRUDA was discontinued due to adverse reactions in 20% of 405 patients. The most common adverse reactions resulting in permanent discontinuation of KEYTRUDA were pneumonitis (3%) and acute kidney injury (2%). The most common adverse reactions (≥20%) with KEYTRUDA were nausea (56%), fatigue (56%), constipation (35%), diarrhea (31%), decreased appetite (28%), rash (25%), vomiting (24%), cough (21%), dyspnea (21%), and pyrexia (20%).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nIn KEYNOTE-407, when KEYTRUDA was administered with carboplatin and either paclitaxel or paclitaxel protein-bound in metastatic squamous NSCLC, KEYTRUDA was discontinued due to adverse reactions in 15% of 101 patients. The most frequent serious adverse reactions reported in at least 2% of patients were febrile neutropenia, pneumonia, and urinary tract infection. Adverse reactions observed in KEYNOTE-407 were similar to those observed in KEYNOTE-189 with the exception that increased incidences of alopecia (47% vs 36%) and peripheral neuropathy (31% vs 25%) were observed in the KEYTRUDA and chemotherapy arm compared to the placebo and chemotherapy arm in KEYNOTE-407.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nIn KEYNOTE-042, KEYTRUDA was discontinued due to adverse reactions in 19% of 636 patients with advanced NSCLC; the most common were pneumonitis (3%), death due to unknown cause (1.6%), and pneumonia (1.4%). The most frequent serious adverse reactions reported in at least 2% of patients were pneumonia (7%), pneumonitis (3.9%), pulmonary embolism (2.4%), and pleural effusion (2.2%). The most common adverse reaction (≥20%) was fatigue (25%).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nIn KEYNOTE-010, KEYTRUDA monotherapy was discontinued due to adverse reactions in 8% of 682 patients with metastatic NSCLC; the most common was pneumonitis (1.8%). The most common adverse reactions (≥20%) were decreased appetite (25%), fatigue (25%), dyspnea (23%), and nausea (20%).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nIn KEYNOTE-671, adverse reactions occurring in patients with resectable NSCLC receiving KEYTRUDA in combination with platinum-containing chemotherapy, given as neoadjuvant treatment and continued as single-agent adjuvant treatment, were generally similar to those occurring in patients in other clinical trials across tumor types receiving KEYTRUDA in combination with chemotherapy.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nThe most common adverse reactions (reported in ≥20%) in patients receiving KEYTRUDA in combination with chemotherapy or chemoradiotherapy were fatigue/asthenia, nausea, constipation, diarrhea, decreased appetite, rash, vomiting, cough, dyspnea, pyrexia, alopecia, peripheral neuropathy, mucosal inflammation, stomatitis, headache, weight loss, abdominal pain, arthralgia, myalgia, insomnia, palmar-plantar erythrodysesthesia, urinary tract infection, hypothyroidism, radiation skin injury, dysphagia, dry mouth, and musculoskeletal pain.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nIn the neoadjuvant phase of KEYNOTE-671, when KEYTRUDA was administered in combination with platinum-containing chemotherapy as neoadjuvant treatment, serious adverse reactions occurred in 34% of 396 patients. The most frequent (≥2%) serious adverse reactions were pneumonia (4.8%), venous thromboembolism (3.3%), and anemia (2%). Fatal adverse reactions occurred in 1.3% of patients, including death due to unknown cause (0.8%), sepsis (0.3%), and immune-mediated lung disease (0.3%). Permanent discontinuation of any study drug due to an adverse reaction occurred in 18% of patients who received KEYTRUDA in combination with platinum-containing chemotherapy; the most frequent adverse reactions (≥1%) that led to permanent discontinuation of any study drug were acute kidney injury (1.8%), interstitial lung disease (1.8%), anemia (1.5%), neutropenia (1.5%), and pneumonia (1.3%).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nOf the KEYTRUDA-treated patients who received neoadjuvant treatment, 6% of 396 patients did not receive surgery due to adverse reactions. The most frequent (≥1%) adverse reaction that led to cancellation of surgery in the KEYTRUDA arm was interstitial lung disease (1%).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nIn the adjuvant phase of KEYNOTE-671, when KEYTRUDA was administered as a single agent as adjuvant treatment, serious adverse reactions occurred in 14% of 290 patients. The most frequent serious adverse reaction was pneumonia (3.4%). One fatal adverse reaction of pulmonary hemorrhage occurred. Permanent discontinuation of KEYTRUDA due to an adverse reaction occurred in 12% of patients who received KEYTRUDA as a single agent, given as adjuvant treatment; the most frequent adverse reactions (≥1%) that led to permanent discontinuation of KEYTRUDA were diarrhea (1.7%), interstitial lung disease (1.4%), increased aspartate aminotransferase (1%), and musculoskeletal pain (1%).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nAdverse reactions observed in KEYNOTE-091 were generally similar to those occurring in other patients with NSCLC receiving KEYTRUDA as a single agent, with the exception of hypothyroidism (22%), hyperthyroidism (11%), and pneumonitis (7%). Two fatal adverse reactions of myocarditis occurred.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nAdverse reactions observed in KEYNOTE-483 were generally similar to those occurring in other patients receiving KEYTRUDA in combination with pemetrexed and platinum chemotherapy.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nIn KEYNOTE-689, the most common adverse reactions (≥20%) in patients receiving KEYTRUDA were stomatitis (48%), radiation skin injury (40%), weight loss (36%), fatigue (33%), dysphagia (29%), constipation (27%), hypothyroidism (26%), nausea (24%), rash (22%), dry mouth (22%), diarrhea (22%), and musculoskeletal pain (22%).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nIn the neoadjuvant phase of KEYNOTE-689, of the 361 patients who received at least one dose of single agent KEYTRUDA, 11% experienced serious adverse reactions. Serious adverse reactions that occurred in more than one patient were pneumonia (1.4%), tumor hemorrhage (0.8%), dysphagia (0.6%), immune-mediated hepatitis (0.6%), cellulitis (0.6%), and dyspnea (0.6%). Fatal adverse reactions occurred in 1.1% of patients, including respiratory failure, clostridium infection, septic shock, and myocardial infarction (one patient each). Permanent discontinuation of KEYTRUDA due to an adverse reaction occurred in 2.8% of patients who received KEYTRUDA as neoadjuvant treatment. The most frequent adverse reaction which resulted in permanent discontinuation of neoadjuvant KEYTRUDA in more than one patient was arthralgia (0.6%).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nOf the 361 patients who received KEYTRUDA as neoadjuvant treatment, 11% did not receive surgery. Surgical cancellation on the KEYTRUDA arm was due to disease progression in 4%, patient decision in 3%, adverse reactions in 1.4%, physician’s decision in 1.1%, unresectable tumor in 0.6%, loss of follow-up in 0.3%, and use of non-study anti-cancer therapy in 0.3%.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nOf the 323 KEYTRUDA-treated patients who received surgery following the neoadjuvant phase, 1.2% experienced delay of surgery (defined as on-study surgery occurring ≥9 weeks after initiation of neoadjuvant KEYTRUDA) due to adverse reactions, and 2.8% did not receive adjuvant treatment due to adverse reactions.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nIn the adjuvant phase of KEYNOTE-689, of the 255 patients who received at least one dose of KEYTRUDA, 38% experienced serious adverse reactions. The most frequent serious adverse reactions reported in ≥1% of KEYTRUDA-treated patients were pneumonia (2.7%), pyrexia (2.4%), stomatitis (2.4%), acute kidney injury (2.0%), pneumonitis (1.6%), COVID-19 (1.2%), death not otherwise specified (1.2%), diarrhea (1.2%), dysphagia (1.2%), gastrostomy tube site complication (1.2%), and immune-mediated hepatitis (1.2%). Fatal adverse reactions occurred in 5% of patients, including death not otherwise specified (1.2%), acute renal failure (0.4%), hypercalcemia (0.4%), pulmonary hemorrhage (0.4%), dysphagia/malnutrition (0.4%), mesenteric thrombosis (0.4%), sepsis (0.4%), pneumonia (0.4%), COVID-19 (0.4%), respiratory failure (0.4%), cardiovascular disorder (0.4%), and gastrointestinal hemorrhage (0.4%). Permanent discontinuation of adjuvant KEYTRUDA due to an adverse reaction occurred in 17% of patients. The most frequent (≥1%) adverse reactions that led to permanent discontinuation of adjuvant KEYTRUDA were pneumonitis, colitis, immune-mediated hepatitis, and death not otherwise specified.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nIn KEYNOTE-048, KEYTRUDA monotherapy was discontinued due to adverse events in 12% of 300 patients with HNSCC; the most common adverse reactions leading to permanent discontinuation were sepsis (1.7%) and pneumonia (1.3%). The most common adverse reactions (≥20%) were fatigue (33%), constipation (20%), and rash (20%).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nIn KEYNOTE-048, when KEYTRUDA was administered in combination with platinum (cisplatin or carboplatin) and FU chemotherapy, KEYTRUDA was discontinued due to adverse reactions in 16% of 276 patients with HNSCC. The most common adverse reactions resulting in permanent discontinuation of KEYTRUDA were pneumonia (2.5%), pneumonitis (1.8%), and septic shock (1.4%). The most common adverse reactions (≥20%) were nausea (51%), fatigue (49%), constipation (37%), vomiting (32%), mucosal inflammation (31%), diarrhea (29%), decreased appetite (29%), stomatitis (26%), and cough (22%).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nIn KEYNOTE-012, KEYTRUDA was discontinued due to adverse reactions in 17% of 192 patients with HNSCC. Serious adverse reactions occurred in 45% of patients. The most frequent serious adverse reactions reported in at least 2% of patients were pneumonia, dyspnea, confusional state, vomiting, pleural effusion, and respiratory failure. The most common adverse reactions (≥20%) were fatigue, decreased appetite, and dyspnea. Adverse reactions occurring in patients with HNSCC were generally similar to those occurring in patients with melanoma or NSCLC who received KEYTRUDA as a monotherapy, with the exception of increased incidences of facial edema and new or worsening hypothyroidism.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nIn KEYNOTE-A39, when KEYTRUDA was administered in combination with enfortumab vedotin to patients with locally advanced or metastatic urothelial cancer (n=440), fatal adverse reactions occurred in 3.9% of patients, including acute respiratory failure (0.7%), pneumonia (0.5%), and pneumonitis/ILD (0.2%). Serious adverse reactions occurred in 50% of patients receiving KEYTRUDA in combination with enfortumab vedotin; the serious adverse reactions in ≥2% of patients were rash (6%), acute kidney injury (5%), pneumonitis/ILD (4.5%), urinary tract infection (3.6%), diarrhea (3.2%), pneumonia (2.3%), pyrexia (2%), and hyperglycemia (2%). Permanent discontinuation of KEYTRUDA occurred in 27% of patients. The most common adverse reactions (≥2%) resulting in permanent discontinuation of KEYTRUDA were pneumonitis/ILD (4.8%) and rash (3.4%). The most common adverse reactions (≥20%) occurring in patients treated with KEYTRUDA in combination with enfortumab vedotin were rash (68%), peripheral neuropathy (67%), fatigue (51%), pruritus (41%), diarrhea (38%), alopecia (35%), weight loss (33%), decreased appetite (33%), nausea (26%), constipation (26%), dry eye (24%), dysgeusia (21%), and urinary tract infection (21%).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nIn KEYNOTE-052, KEYTRUDA was discontinued due to adverse reactions in 11% of 370 patients with locally advanced or metastatic urothelial carcinoma. Serious adverse reactions occurred in 42% of patients; those ≥2% were urinary tract infection, hematuria, acute kidney injury, pneumonia, and urosepsis. The most common adverse reactions (≥20%) were fatigue (38%), musculoskeletal pain (24%), decreased appetite (22%), constipation (21%), rash (21%), and diarrhea (20%).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nIn KEYNOTE-045, KEYTRUDA was discontinued due to adverse reactions in 8% of 266 patients with locally advanced or metastatic urothelial carcinoma. The most common adverse reaction resulting in permanent discontinuation of KEYTRUDA was pneumonitis (1.9%). Serious adverse reactions occurred in 39% of KEYTRUDA-treated patients; those ≥2% were urinary tract infection, pneumonia, anemia, and pneumonitis. The most common adverse reactions (≥20%) in patients who received KEYTRUDA were fatigue (38%), musculoskeletal pain (32%), pruritus (23%), decreased appetite (21%), nausea (21%), and rash (20%).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nIn KEYNOTE-905, the most common adverse reactions (≥20%) occurring in cisplatin-ineligible patients with MIBC treated with KEYTRUDA in combination with enfortumab vedotin (n=167) were rash (54%), pruritus (47%), fatigue (47%), peripheral neuropathy (39%), alopecia (35%), dysgeusia (35%), diarrhea (34%), constipation (28%), decreased appetite (28%), nausea (26%), urinary tract infection (24%), dry eye (21%), and weight loss (20%).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nIn the neoadjuvant phase of KEYNOTE-905, serious adverse reactions occurred in 27% (n=167) of patients; the most frequent (≥2%) were urinary tract infection (3.6%) and hematuria (2.4%). Fatal adverse reactions occurred in 1.2% of patients, including myasthenia gravis and toxic epidermal necrolysis (0.6% each). Additional fatal adverse reactions were reported in 2.7% of patients in the post-surgery phase before adjuvant treatment started, including sepsis and intestinal obstruction (1.4% each). Permanent discontinuation of KEYTRUDA due to an adverse reaction occurred in 15% of patients; the most frequent (&gt;1%) were rash (2.4%, including generalized exfoliative dermatitis), increased alanine aminotransferase, increased aspartate aminotransferase, diarrhea, dysgeusia, and toxic epidermal necrolysis (1.2% each). Of the 167 patients in the KEYTRUDA in combination with enfortumab vedotin arm who received neoadjuvant treatment, 7 (4.2%) patients did not receive surgery due to adverse reactions. The adverse reactions that led to cancellation of surgery were acute myocardial infarction, bile duct cancer, colon cancer, respiratory distress, urinary tract infection, and two deaths due to myasthenia gravis and toxic epidermal necrolysis (0.6% each).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nOf the 146 patients who received neoadjuvant treatment with KEYTRUDA in combination with enfortumab vedotin and underwent radical cystectomy, 6 (4.1%) patients experienced delay of surgery (defined as time from last neoadjuvant treatment to surgery exceeding 8 weeks) due to adverse reactions.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nIn the adjuvant phase of KEYNOTE-905, serious adverse reactions occurred in 43% (n=100) of patients; the most frequent (≥2%) were urinary tract infection (8%); acute kidney injury and pyelonephritis (5% each); urosepsis (4%); and hypokalemia, intestinal obstruction, and sepsis (2% each). Fatal adverse reactions occurred in 7% of patients, including urosepsis, intracranial hemorrhage, death, myocardial infarction, multiple organ dysfunction syndrome, and pseudomonal pneumonia (1% each). Permanent discontinuation of KEYTRUDA due to an adverse reaction occurred in 28% of patients; the most frequent (&gt;1%) were diarrhea (5%), peripheral neuropathy, acute kidney injury, and pneumonitis (2% each).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nIn KEYNOTE-057, KEYTRUDA was discontinued due to adverse reactions in 11% of 148 patients with high-risk NMIBC. The most common adverse reaction resulting in permanent discontinuation of KEYTRUDA was pneumonitis (1.4%). Serious adverse reactions occurred in 28% of patients; those ≥2% were pneumonia (3%), cardiac ischemia (2%), colitis (2%), pulmonary embolism (2%), sepsis (2%), and urinary tract infection (2%). The most common adverse reactions (≥20%) were fatigue (29%), diarrhea (24%), and rash (24%).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nAdverse reactions occurring in patients with MSI-H or dMMR CRC were similar to those occurring in patients with melanoma or NSCLC who received KEYTRUDA as a monotherapy.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nIn KEYNOTE-158 and KEYNOTE-164, adverse reactions occurring in patients with MSI-H or dMMR cancer were similar to those occurring in patients with other solid tumors who received KEYTRUDA as a single agent.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nIn KEYNOTE-811, fatal adverse reactions occurred in 3 patients who received KEYTRUDA in combination with trastuzumab and CAPOX (capecitabine plus oxaliplatin) or FP (5-FU plus cisplatin) and included pneumonitis in 2 patients and hepatitis in 1 patient. KEYTRUDA was discontinued due to adverse reactions in 13% of 350 patients with locally advanced unresectable or metastatic HER2-positive gastric or GEJ adenocarcinoma. Adverse reactions resulting in permanent discontinuation of KEYTRUDA in ≥1% of patients were pneumonitis (2.0%) and pneumonia (1.1%). In the KEYTRUDA arm vs placebo, there was a difference of ≥5% incidence between patients treated with KEYTRUDA vs standard of care for diarrhea (53% vs 47%), rash (35% vs 28%), hypothyroidism (11% vs 5%), and pneumonia (11% vs 5%).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nIn KEYNOTE-859, when KEYTRUDA was administered in combination with fluoropyrimidine- and platinum-containing chemotherapy, serious adverse reactions occurred in 45% of 785 patients. Serious adverse reactions in &gt;2% of patients included pneumonia (4.1%), diarrhea (3.9%), hemorrhage (3.9%), and vomiting (2.4%). Fatal adverse reactions occurred in 8% of patients who received KEYTRUDA, including infection (2.3%) and thromboembolism (1.3%). KEYTRUDA was permanently discontinued due to adverse reactions in 15% of patients. The most common adverse reactions resulting in permanent discontinuation of KEYTRUDA (≥1%) were infections (1.8%) and diarrhea (1.0%). The most common adverse reactions (reported in ≥20%) in patients receiving KEYTRUDA in combination with chemotherapy were peripheral neuropathy (47%), nausea (46%), fatigue (40%), diarrhea (36%), vomiting (34%), decreased appetite (29%), abdominal pain (26%), palmar-plantar erythrodysesthesia syndrome (25%), constipation (22%), and weight loss (20%).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nIn KEYNOTE-590, when KEYTRUDA was administered with cisplatin and fluorouracil to patients with metastatic or locally advanced esophageal or GEJ (tumors with epicenter 1 to 5 centimeters above the GEJ) carcinoma who were not candidates for surgical resection or definitive chemoradiation, KEYTRUDA was discontinued due to adverse reactions in 15% of 370 patients. The most common adverse reactions resulting in permanent discontinuation of KEYTRUDA (≥1%) were pneumonitis (1.6%), acute kidney injury (1.1%), and pneumonia (1.1%). The most common adverse reactions (≥20%) with KEYTRUDA in combination with chemotherapy were nausea (67%), fatigue (57%), decreased appetite (44%), constipation (40%), diarrhea (36%), vomiting (34%), stomatitis (27%), and weight loss (24%).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nAdverse reactions occurring in patients with esophageal cancer who received KEYTRUDA as a monotherapy were similar to those occurring in patients with melanoma or NSCLC who received KEYTRUDA as a monotherapy.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nIn KEYNOTE-A18, when KEYTRUDA was administered with CRT (cisplatin plus external beam radiation therapy [EBRT] followed by brachytherapy [BT]) to patients with FIGO 2014 Stage III-IVA cervical cancer, fatal adverse reactions occurred in 1.4% of 294 patients, including 1 case each (0.3%) of large intestinal perforation, urosepsis, sepsis, and vaginal hemorrhage. Serious adverse reactions occurred in 34% of patients; those ≥1% included urinary tract infection (3.1%), urosepsis (1.4%), and sepsis (1%). KEYTRUDA was discontinued for adverse reactions in 9% of patients. The most common adverse reaction (≥1%) resulting in permanent discontinuation was diarrhea (1%). For patients treated with KEYTRUDA in combination with CRT, the most common adverse reactions (≥10%) were nausea (56%), diarrhea (51%), urinary tract infection (35%), vomiting (34%), fatigue (28%), hypothyroidism (23%), constipation (20%), weight loss (19%), decreased appetite (18%), pyrexia (14%), abdominal pain and hyperthyroidism (13% each), dysuria and rash (12% each), back and pelvic pain (11% each), and COVID-19 (10%).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nIn KEYNOTE-826, when KEYTRUDA was administered in combination with paclitaxel and cisplatin or paclitaxel and carboplatin, with or without bevacizumab (n=307), to patients with persistent, recurrent, or first-line metastatic cervical cancer regardless of tumor PD-L1 expression who had not been treated with chemotherapy except when used concurrently as a radio-sensitizing agent, fatal adverse reactions occurred in 4.6% of patients, including 3 cases of hemorrhage, 2 cases each of sepsis and due to unknown causes, and 1 case each of acute myocardial infarction, autoimmune encephalitis, cardiac arrest, cerebrovascular accident, femur fracture with perioperative pulmonary embolus, intestinal perforation, and pelvic infection. Serious adverse reactions occurred in 50% of patients receiving KEYTRUDA in combination with chemotherapy with or without bevacizumab; those ≥3% were febrile neutropenia (6.8%), urinary tract infection (5.2%), anemia (4.6%), and acute kidney injury and sepsis (3.3% each).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nKEYTRUDA was discontinued in 15% of patients due to adverse reactions. The most common adverse reaction resulting in permanent discontinuation (≥1%) was colitis (1%).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nFor patients treated with KEYTRUDA, chemotherapy, and bevacizumab (n=196), the most common adverse reactions (≥20%) were peripheral neuropathy (62%), alopecia (58%), anemia (55%), fatigue/asthenia (53%), nausea and neutropenia (41% each), diarrhea (39%), hypertension and thrombocytopenia (35% each), constipation and arthralgia (31% each), vomiting (30%), urinary tract infection (27%), rash (26%), leukopenia (24%), hypothyroidism (22%), and decreased appetite (21%).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nFor patients treated with KEYTRUDA in combination with chemotherapy with or without bevacizumab, the most common adverse reactions (≥20%) were peripheral neuropathy (58%), alopecia (56%), fatigue (47%), nausea (40%), diarrhea (36%), constipation (28%), arthralgia (27%), vomiting (26%), hypertension and urinary tract infection (24% each), and rash (22%).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nIn KEYNOTE-158, KEYTRUDA was discontinued due to adverse reactions in 8% of 98 patients with previously treated recurrent or metastatic cervical cancer. Serious adverse reactions occurred in 39% of patients receiving KEYTRUDA; the most frequent included anemia (7%), fistula, hemorrhage, and infections [except urinary tract infections] (4.1% each). The most common adverse reactions (≥20%) were fatigue (43%), musculoskeletal pain (27%), diarrhea (23%), pain and abdominal pain (22% each), and decreased appetite (21%).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nIn KEYNOTE-394, KEYTRUDA was discontinued due to adverse reactions in 13% of 299 patients with previously treated hepatocellular carcinoma. The most common adverse reaction resulting in permanent discontinuation of KEYTRUDA was ascites (2.3%). The most common adverse reactions in patients receiving KEYTRUDA (≥10%) were pyrexia (18%), rash (18%), diarrhea (16%), decreased appetite (15%), pruritus (12%), upper respiratory tract infection (11%), cough (11%), and hypothyroidism (10%).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nIn KEYNOTE-966, when KEYTRUDA was administered in combination with gemcitabine and cisplatin, KEYTRUDA was discontinued for adverse reactions in 15% of 529 patients with locally advanced unresectable or metastatic biliary tract cancer. The most common adverse reaction resulting in permanent discontinuation of KEYTRUDA (≥1%) was pneumonitis (1.3%). Adverse reactions leading to the interruption of KEYTRUDA occurred in 55% of patients. The most common adverse reactions or laboratory abnormalities leading to interruption of KEYTRUDA (≥2%) were decreased neutrophil count (18%), decreased platelet count (10%), anemia (6%), decreased white blood cell count (4%), pyrexia (3.8%), fatigue (3.0%), cholangitis (2.8%), increased ALT (2.6%), increased AST (2.5%), and biliary obstruction (2.3%).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nIn KEYNOTE-017 and KEYNOTE-913, adverse reactions occurring in patients with MCC (n=105) were generally similar to those occurring in patients with melanoma or NSCLC who received KEYTRUDA as a single agent.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nIn KEYNOTE-426, when KEYTRUDA was administered in combination with axitinib, fatal adverse reactions occurred in 3.3% of 429 patients. Serious adverse reactions occurred in 40% of patients, the most frequent (≥1%) were hepatotoxicity (7%), diarrhea (4.2%), acute kidney injury (2.3%), dehydration (1%), and pneumonitis (1%). Permanent discontinuation due to an adverse reaction occurred in 31% of patients; KEYTRUDA only (13%), axitinib only (13%), and the combination (8%); the most common were hepatotoxicity (13%), diarrhea/colitis (1.9%), acute kidney injury (1.6%), and cerebrovascular accident (1.2%). The most common adverse reactions (≥20%) were diarrhea (56%), fatigue/asthenia (52%), hypertension (48%), hepatotoxicity (39%), hypothyroidism (35%), decreased appetite (30%), palmar-plantar erythrodysesthesia (28%), nausea (28%), stomatitis/mucosal inflammation (27%), dysphonia (25%), rash (25%), cough (21%), and constipation (21%).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nIn KEYNOTE-564, when KEYTRUDA was administered as a single agent for the adjuvant treatment of renal cell carcinoma, serious adverse reactions occurred in 20% of patients receiving KEYTRUDA; the serious adverse reactions (≥1%) were acute kidney injury, adrenal insufficiency, pneumonia, colitis, and diabetic ketoacidosis (1% each). Fatal adverse reactions occurred in 0.2% including 1 case of pneumonia. Discontinuation of KEYTRUDA due to adverse reactions occurred in 21% of 488 patients; the most common (≥1%) were increased ALT (1.6%), colitis (1%), and adrenal insufficiency (1%). The most common adverse reactions (≥20%) were musculoskeletal pain (41%), fatigue (40%), rash (30%), diarrhea (27%), pruritus (23%), and hypothyroidism (21%).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nIn KEYNOTE-868, when KEYTRUDA was administered in combination with chemotherapy (paclitaxel and carboplatin) to patients with advanced or recurrent endometrial carcinoma (n=382), serious adverse reactions occurred in 35% of patients receiving KEYTRUDA in combination with chemotherapy, compared to 19% of patients receiving placebo in combination with chemotherapy (n=377). Fatal adverse reactions occurred in 1.6% of patients receiving KEYTRUDA in combination with chemotherapy, including COVID-19 (0.5%) and cardiac arrest (0.3%). KEYTRUDA was discontinued for an adverse reaction in 14% of patients. Adverse reactions occurring in patients treated with KEYTRUDA and chemotherapy were generally similar to those observed with KEYTRUDA alone or chemotherapy alone, with the exception of rash (33% all Grades; 2.9% Grades 3-4).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nAdverse reactions occurring in patients with MSI-H or dMMR endometrial carcinoma who received KEYTRUDA as a single agent were similar to those occurring in patients with melanoma or NSCLC who received KEYTRUDA as a single agent.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nAdverse reactions occurring in patients with TMB-H cancer were similar to those occurring in patients with other solid tumors who received KEYTRUDA as a single agent.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nAdverse reactions occurring in patients with recurrent or metastatic cSCC or locally advanced cSCC were similar to those occurring in patients with melanoma or NSCLC who received KEYTRUDA as a monotherapy.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nIn KEYNOTE-522, when KEYTRUDA was administered with neoadjuvant chemotherapy (carboplatin and paclitaxel followed by doxorubicin or epirubicin and cyclophosphamide) followed by surgery and continued adjuvant treatment with KEYTRUDA as a single agent (n=778) to patients with newly diagnosed, previously untreated, high-risk early-stage TNBC, fatal adverse reactions occurred in 0.9% of patients, including 1 each of adrenal crisis, autoimmune encephalitis, hepatitis, pneumonia, pneumonitis, pulmonary embolism, and sepsis in association with multiple organ dysfunction syndrome and myocardial infarction. Serious adverse reactions occurred in 44% of patients receiving KEYTRUDA; those ≥2% were febrile neutropenia (15%), pyrexia (3.7%), anemia (2.6%), and neutropenia (2.2%). KEYTRUDA was discontinued in 20% of patients due to adverse reactions. The most common reactions (≥1%) resulting in permanent discontinuation were increased ALT (2.7%), increased AST (1.5%), and rash (1%). The most common adverse reactions (≥20%) in patients receiving KEYTRUDA were fatigue (70%), nausea (67%), alopecia (61%), rash (52%), constipation (42%), diarrhea and peripheral neuropathy (41% each), stomatitis (34%), vomiting (31%), headache (30%), arthralgia (29%), pyrexia (28%), cough (26%), abdominal pain (24%), decreased appetite (23%), insomnia (21%), and myalgia (20%).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nIn KEYNOTE-355, when KEYTRUDA and chemotherapy (paclitaxel, paclitaxel protein-bound, or gemcitabine and carboplatin) were administered to patients with locally recurrent unresectable or metastatic TNBC who had not been previously treated with chemotherapy in the metastatic setting (n=596), fatal adverse reactions occurred in 2.5% of patients, including cardio-respiratory arrest (0.7%) and septic shock (0.3%). Serious adverse reactions occurred in 30% of patients receiving KEYTRUDA in combination with chemotherapy; the serious reactions in ≥2% were pneumonia (2.9%), anemia (2.2%), and thrombocytopenia (2%). KEYTRUDA was discontinued in 11% of patients due to adverse reactions. The most common reactions resulting in permanent discontinuation (≥1%) were increased ALT (2.2%), increased AST (1.5%), and pneumonitis (1.2%). The most common adverse reactions (≥20%) in patients receiving KEYTRUDA in combination with chemotherapy were fatigue (48%), nausea (44%), alopecia (34%), diarrhea and constipation (28% each), vomiting and rash (26% each), cough (23%), decreased appetite (21%), and headache (20%).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nIn KEYNOTE-B96, when KEYTRUDA in combination with paclitaxel, with or without bevacizumab, was administered to patients with epithelial ovarian, fallopian tube, or primary peritoneal carcinoma whose tumors express PD-L1 (CPS ≥1), serious adverse reactions occurred in 54% of patients receiving KEYTRUDA and paclitaxel with or without bevacizumab. Serious adverse reactions in ≥2% of patients were pneumonia (4.3%), urinary tract infection (3.9%), adrenal insufficiency, hyponatremia (3% each), COVID-19, decreased neutrophil count, pulmonary embolism (2.6% each), abdominal pain, anemia, colitis, diarrhea, febrile neutropenia, pyrexia, and vomiting (2.1% each).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nFatal adverse reactions occurred in 3.9% of patients receiving KEYTRUDA and paclitaxel, with or without bevacizumab, including assisted suicide (0.9%), death, intestinal perforation, sepsis, COVID-19, cardio-respiratory arrest, colitis, and embolic stroke (0.4% each).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nKEYTRUDA was permanently discontinued for adverse reactions in 16% of patients. The most common adverse reactions resulting in permanent discontinuation of KEYTRUDA (≥1%) were colitis and increased alanine aminotransferase (1.3% each). Adverse reactions leading to the interruption of KEYTRUDA occurred in 44% of patients. The most common adverse reactions leading to interruption of KEYTRUDA in ≥2% were urinary tract infection (3.9%), adrenal insufficiency, pyrexia, pneumonitis, upper respiratory tract infection (2.6% each), neutropenia, diarrhea, and COVID-19 (2.1% each).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nThe most common adverse reactions (≥20%) for patients treated with KEYTRUDA in combination with paclitaxel, with or without bevacizumab, were diarrhea (45%), fatigue (43%), nausea (41%), alopecia, peripheral neuropathy (38% each), epistaxis (31%), urinary tract infection (27%), constipation (25%), abdominal pain, decreased appetite, vomiting (24% each), hypothyroidism (21%), cough, hypertension, and rash (20% each).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nFor patients treated with KEYTRUDA in combination with paclitaxel and bevacizumab (N=169), decreased white blood cell count (27%), stomatitis (22%), and pyrexia (21%) were also reported as adverse reactions.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Lactation</strong>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nBecause of the potential for serious adverse reactions in breastfed children, advise women not to breastfeed during treatment and for 4 months after the last dose.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Pediatric Use</strong>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nIn KEYNOTE-051, 173 pediatric patients (65 pediatric patients aged 6 months to younger than 12 years and 108 pediatric patients aged 12 years to 17 years) were administered KEYTRUDA 2 mg/kg every 3 weeks. The median duration of exposure was 2.1 months (range: 1 day to 25 months).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nThe safety and effectiveness of KEYTRUDA QLEX for the treatment of pediatric patients 12 years and older who weigh greater than 40 kg have been established for:\n\n</p><ul class=\"mdc-article-list mdc-article-list--unordered\" data-v-7b473e83=\"\">\n<li data-v-7b473e83=\"\">\nStage IIB, IIC, or III melanoma following complete resection\n\n</li>\n<li data-v-7b473e83=\"\">\nUnresectable or metastatic microsatellite instability-high (MSI-H) or mismatch repair deficient (dMMR) solid tumors\n\n</li>\n<li data-v-7b473e83=\"\">\nRecurrent locally advanced or metastatic Merkel cell carcinoma\n\n</li>\n<li data-v-7b473e83=\"\">\nUnresectable or metastatic tumor mutational burden-high solid tumors (TMB-H)\n\n</li>\n</ul><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nUse of KEYTRUDA QLEX in pediatric patients for these indications is supported by evidence from adequate and well-controlled studies of KEYTRUDA in adults and additional pharmacokinetic and safety data for KEYTRUDA in pediatric patients 12 years and older. Pembrolizumab exposures in pediatric patients 12 years and older who weigh greater than 40 kg are predicted to be within range of those observed in adults at the same dosage.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nThe safety and effectiveness of KEYTRUDA as a single agent have been established in pediatric patients with melanoma (stage IIB, IIC, or III melanoma following complete resection in pediatric patients 12 and older), MCC, MSI-H or dMMR cancer, and TMB-H cancer.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nUse of KEYTRUDA in pediatric patients for these indications is supported by evidence from adequate and well-controlled studies in adults with additional pharmacokinetic and safety data in pediatric patients.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nThe safety and effectiveness of KEYTRUDA QLEX have not been established in pediatric patients younger than 12 years of age for the treatment of melanoma, MCC, MSI-H or dMMR cancer, and TMB-H cancer.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nThe safety and effectiveness of KEYTRUDA and KEYTRUDA QLEX have not been established in pediatric patients for other approved indications shown.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nAdverse reactions that occurred at a ≥10% higher rate in pediatric patients when compared to adults were pyrexia (33%), leukopenia (30%), vomiting (29%), neutropenia (28%), headache (25%), abdominal pain (23%), thrombocytopenia (22%), Grade 3 anemia (17%), decreased lymphocyte count (13%), and decreased white blood cell count (11%).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Geriatric Use</strong>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nOf the 564 patients with locally advanced or metastatic urothelial cancer treated with KEYTRUDA in combination with enfortumab vedotin, 44% (n=247) were 65-74 years and 26% (n=144) were 75 years or older. No overall differences in effectiveness were observed between patients 65 years of age or older and younger patients. Patients 75 years of age or older treated with KEYTRUDA in combination with enfortumab vedotin experienced a higher incidence of fatal adverse reactions than younger patients. The incidence of fatal adverse reactions was 4% in patients younger than 75 and 7% in patients 75 years or older.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nOf the 167 patients with MIBC treated with KEYTRUDA in combination with enfortumab vedotin, 37% (n=61) were 65-74 years and 46% (n=77) were 75 years or older. Patients 75 years of age or older treated with KEYTRUDA in combination with enfortumab vedotin experienced a higher incidence of fatal adverse reactions than younger patients. The incidence of fatal adverse reactions was 4% in patients younger than 75 and 12% in patients 75 years or older.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Additional Selected KEYTRUDA and KEYTRUDA QLEX Indications in the U.S.</strong>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Additional Selected KEYTRUDA Indications in the U.S.</strong>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">Melanoma</em>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nKEYTRUDA and KEYTRUDA QLEX are each indicated for the treatment of adult patients with unresectable or metastatic melanoma.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nKEYTRUDA and KEYTRUDA QLEX are each indicated for the adjuvant treatment of adult and pediatric patients 12 years and older with stage IIB, IIC, or III melanoma following complete resection.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">Non-Small Cell Lung Cancer</em>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nKEYTRUDA and KEYTRUDA QLEX are each indicated, in combination with pemetrexed and platinum chemotherapy, for the first-line treatment of adult patients with metastatic nonsquamous non–small cell lung cancer (NSCLC), with no EGFR or ALK genomic tumor aberrations.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nKEYTRUDA and KEYTRUDA QLEX are each indicated, in combination with carboplatin and either paclitaxel or paclitaxel protein-bound, for the first-line treatment of adult patients with metastatic squamous NSCLC.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nKEYTRUDA and KEYTRUDA QLEX, as single agents, are each indicated for the first-line treatment of adult patients with NSCLC expressing PD-L1 [tumor proportion score (TPS) ≥1%] as determined by an FDA-authorized test, with no EGFR or ALK genomic tumor aberrations, and is:\n\n</p><ul class=\"mdc-article-list mdc-article-list--unordered\" data-v-7b473e83=\"\">\n<li data-v-7b473e83=\"\">\nstage III where patients are not candidates for surgical resection or definitive chemoradiation, or\n\n</li>\n<li data-v-7b473e83=\"\">\nmetastatic.\n\n</li>\n</ul><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nKEYTRUDA and KEYTRUDA QLEX, as single agents, are each indicated for the treatment of adult patients with metastatic NSCLC whose tumors express PD-L1 (TPS ≥1%) as determined by an FDA-authorized test, with disease progression on or after platinum-containing chemotherapy. Patients with EGFR or ALK genomic tumor aberrations should have disease progression on FDA-authorized therapy for these aberrations prior to receiving KEYTRUDA or KEYTRUDA QLEX.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nKEYTRUDA and KEYTRUDA QLEX are each indicated for the treatment of adult patients with resectable (tumors ≥4 cm or node positive) NSCLC in combination with platinum-containing chemotherapy as neoadjuvant treatment, and then continued as a single agent as adjuvant treatment after surgery.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nKEYTRUDA and KEYTRUDA QLEX, as single agents, are each indicated as adjuvant treatment following resection and platinum-based chemotherapy for adult patients with stage IB (T2a ≥4 cm), II, or IIIA NSCLC.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">Malignant Pleural Mesothelioma</em>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nKEYTRUDA and KEYTRUDA QLEX are each indicated, in combination with pemetrexed and platinum chemotherapy, for the first-line treatment of adult patients with unresectable advanced or metastatic malignant pleural mesothelioma (MPM).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">Head and Neck Squamous Cell Cancer</em>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nKEYTRUDA and KEYTRUDA QLEX are each indicated for the treatment of adult patients with resectable locally advanced head and neck squamous cell carcinoma (HNSCC) whose tumors express PD-L1 [Combined Positive Score (CPS) ≥1] as determined by an FDA-authorized test, as a single agent as neoadjuvant treatment, continued as adjuvant treatment in combination with radiotherapy (RT) with or without cisplatin and then as a single agent.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nKEYTRUDA and KEYTRUDA QLEX are each indicated, in combination with platinum and fluorouracil (FU), for the first-line treatment of adult patients with metastatic or with unresectable, recurrent head and neck squamous cell carcinoma (HNSCC).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nKEYTRUDA and KEYTRUDA QLEX, as single agents, are each indicated for the first-line treatment of adult patients with metastatic or with unresectable, recurrent HNSCC whose tumors express PD-L1 (CPS ≥1) as determined by an FDA-authorized test.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nKEYTRUDA and KEYTRUDA QLEX, as single agents, are each indicated for the treatment of adult patients with recurrent or metastatic head and neck squamous cell carcinoma (HNSCC) with disease progression on or after platinum-containing chemotherapy.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">Urothelial Cancer</em>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nKEYTRUDA and KEYTRUDA QLEX are each indicated, in combination with enfortumab vedotin, for the treatment of adult patients with locally advanced or metastatic urothelial cancer.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nKEYTRUDA and KEYTRUDA QLEX, as single agents, are each indicated for the treatment of adult patients with locally advanced or metastatic urothelial carcinoma:\n\n</p><ul class=\"mdc-article-list mdc-article-list--unordered\" data-v-7b473e83=\"\">\n<li data-v-7b473e83=\"\">\nwho are not eligible for any platinum-containing chemotherapy, or\n\n</li>\n<li data-v-7b473e83=\"\">\nwho have disease progression during or following platinum-containing chemotherapy or within 12 months of neoadjuvant or adjuvant treatment with platinum-containing chemotherapy.\n\n</li>\n</ul><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nKEYTRUDA and KEYTRUDA QLEX are each indicated, in combination with enfortumab vedotin, as neoadjuvant treatment and then continued after cystectomy as adjuvant treatment for the treatment of adult patients with muscle invasive bladder cancer (MIBC) who are ineligible for cisplatin-containing chemotherapy.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nKEYTRUDA and KEYTRUDA QLEX, as single agents, are each indicated for the treatment of adult patients with Bacillus Calmette-Guerin (BCG)-unresponsive, high-risk, non-muscle invasive bladder cancer (NMIBC) with carcinoma in situ (CIS) with or without papillary tumors who are ineligible for or have elected not to undergo cystectomy.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">Microsatellite Instability-High or Mismatch Repair Deficient Cancer</em>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nKEYTRUDA and KEYTRUDA QLEX are each indicated for the treatment of adult patients with unresectable or metastatic microsatellite instability-high (MSI-H) or mismatch repair deficient (dMMR) solid tumors, as determined by an FDA-authorized test, that have progressed following prior treatment and who have no satisfactory alternative treatment options. For this indication, KEYTRUDA also is indicated for the treatment of pediatric patients, and KEYTRUDA QLEX also is indicated for the treatment of pediatric patients 12 years and older.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">Microsatellite Instability-High or Mismatch Repair Deficient Colorectal Cancer</em>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nKEYTRUDA and KEYTRUDA QLEX are each indicated for the treatment of adult patients with unresectable or metastatic MSI-H or dMMR colorectal cancer (CRC) as determined by an FDA-authorized test.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">Gastric Cancer</em>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nKEYTRUDA and KEYTRUDA QLEX are each indicated, in combination with trastuzumab, fluoropyrimidine- and platinum-containing chemotherapy, for the first-line treatment of adults with locally advanced unresectable or metastatic HER2-positive gastric or gastroesophageal junction (GEJ) adenocarcinoma whose tumors express PD-L1 (CPS ≥1) as determined by an FDA-authorized test.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nKEYTRUDA and KEYTRUDA QLEX are each indicated, in combination with fluoropyrimidine- and platinum-containing chemotherapy, for the first-line treatment of adults with locally advanced unresectable or metastatic HER2-negative gastric or gastroesophageal junction (GEJ) adenocarcinoma whose tumors express PD-L1 (CPS ≥1) as determined by an FDA-authorized test.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">Esophageal Cancer</em>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nKEYTRUDA and KEYTRUDA QLEX are each indicated for the treatment of adult patients with locally advanced or metastatic esophageal or gastroesophageal junction (GEJ) (tumors with epicenter 1 to 5 centimeters above the GEJ) carcinoma that is not amenable to surgical resection or definitive chemoradiation either:\n\n</p><ul class=\"mdc-article-list mdc-article-list--unordered\" data-v-7b473e83=\"\">\n<li data-v-7b473e83=\"\">\nin combination with platinum- and fluoropyrimidine-based chemotherapy for patients with tumors that express PD-L1 (CPS ≥1), or\n\n</li>\n<li data-v-7b473e83=\"\">\nas a single agent after one or more prior lines of systemic therapy for patients with tumors of squamous cell histology that express PD-L1 (CPS ≥10) as determined by an FDA-authorized test.\n\n</li>\n</ul><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">Cervical Cancer</em>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nKEYTRUDA and KEYTRUDA QLEX are each indicated, in combination with chemoradiotherapy (CRT), for the treatment of adult patients with locally advanced cervical cancer involving the lower third of the vagina, with or without extension to pelvic sidewall, or hydronephrosis/non-functioning kidney, or spread to adjacent pelvic organs (FIGO 2014 Stage III-IVA).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nKEYTRUDA and KEYTRUDA QLEX are each indicated, in combination with chemotherapy, with or without bevacizumab, for the treatment of adult patients with persistent, recurrent, or metastatic cervical cancer whose tumors express PD-L1 (CPS ≥1) as determined by an FDA-authorized test.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nKEYTRUDA and KEYTRUDA QLEX, as single agents, are each indicated for the treatment of adult patients with recurrent or metastatic cervical cancer with disease progression on or after chemotherapy whose tumors express PD-L1 (CPS ≥1) as determined by an FDA-authorized test.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">Hepatocellular Carcinoma</em>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nKEYTRUDA and KEYTRUDA QLEX are each indicated for the treatment of adult patients with hepatocellular carcinoma (HCC) secondary to hepatitis B who have received prior systemic therapy other than a PD-1/PD-L1–containing regimen.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">Biliary Tract Cancer</em>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nKEYTRUDA and KEYTRUDA QLEX are each indicated, in combination with gemcitabine and cisplatin, for the treatment of adult patients with locally advanced unresectable or metastatic biliary tract cancer (BTC).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">Merkel Cell Carcinoma</em>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nKEYTRUDA and KEYTRUDA QLEX are each indicated for the treatment of adult patients with recurrent locally advanced or metastatic Merkel cell carcinoma (MCC). For this indication, KEYTRUDA also is indicated for the treatment of pediatric patients, and KEYTRUDA QLEX also is indicated for the treatment of pediatric patients 12 years and older.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">Endometrial Carcinoma</em>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nKEYTRUDA and KEYTRUDA QLEX are each indicated, in combination with carboplatin and paclitaxel, followed by KEYTRUDA or KEYTRUDA QLEX as a single agent, for the treatment of adult patients with primary advanced or recurrent endometrial carcinoma.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nKEYTRUDA and KEYTRUDA QLEX, as a single agent, are each indicated for the treatment of adult patients with advanced endometrial carcinoma that is MSI-H or dMMR, as determined by an FDA-authorized test, who have disease progression following prior systemic therapy in any setting and are not candidates for curative surgery or radiation.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">Tumor Mutational Burden-High Cancer</em>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nKEYTRUDA and KEYTRUDA QLEX are each indicated for the treatment of adult patients with unresectable or metastatic tumor mutational burden-high (TMB-H) [≥10 mutations/megabase (mut/Mb)] solid tumors, as determined by an FDA-authorized test, that have progressed following prior treatment and who have no satisfactory alternative treatment options. For this indication, KEYTRUDA also is indicated for the treatment of pediatric patients, and KEYTRUDA QLEX also is indicated for the treatment of pediatric patients 12 years and older.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nThis indication is approved under accelerated approval based on tumor response rate and durability of response. Continued approval for this indication may be contingent upon verification and description of clinical benefit in the confirmatory trials.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nIn TMB-H central nervous system cancers, the safety and effectiveness of KEYTRUDA in pediatric patients, and of KEYTRUDA QLEX in pediatric patients 12 years and older, have not been established.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">Cutaneous Squamous Cell Carcinoma</em>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nKEYTRUDA and KEYTRUDA QLEX are each indicated for the treatment of adult patients with recurrent or metastatic cutaneous squamous cell carcinoma (cSCC) or locally advanced cSCC that is not curable by surgery or radiation.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">Triple-Negative Breast Cancer</em>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nKEYTRUDA and KEYTRUDA QLEX are each indicated for the treatment of adult patients with high-risk early-stage triple-negative breast cancer (TNBC) in combination with chemotherapy as neoadjuvant treatment, and then each continued as a single agent as adjuvant treatment after surgery.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nKEYTRUDA and KEYTRUDA QLEX are each indicated, in combination with chemotherapy, for the treatment of adult patients with locally recurrent unresectable or metastatic triple-negative breast cancer (TNBC) whose tumors express PD-L1 (CPS ≥10) as determined by an FDA-authorized test.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">Ovarian Cancer</em>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nKEYTRUDA and KEYTRUDA QLEX are each indicated, in combination with paclitaxel, with or without bevacizumab, for the treatment of adult patients with platinum-resistant epithelial ovarian, fallopian tube, or primary peritoneal carcinoma whose tumors express PD-L1 (CPS ≥1) as determined by an FDA-authorized test, and who have received 1 or 2 prior systemic treatment regimens.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Please see Prescribing Information for KEYTRUDA (pembrolizumab) at </strong><strong class=\"mdc-article-strong\" data-v-479a2324=\"\"><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.merck.com%2Fproduct%2Fusa%2Fpi_circulars%2Fk%2Fkeytruda%2Fkeytruda_pi.pdf&amp;esheet=54435729&amp;newsitemid=20260228025853&amp;lan=en-US&amp;anchor=https%3A%2F%2Fwww.merck.com%2Fproduct%2Fusa%2Fpi_circulars%2Fk%2Fkeytruda%2Fkeytruda_pi.pdf&amp;index=6&amp;md5=a9ec3385c3afc5d74522b30f648b3fa3\" tabindex=\"0\">https://www.merck.com/product/usa/pi_circulars/k/keytruda/keytruda_pi.pdf</a></strong><strong class=\"mdc-article-strong\" data-v-479a2324=\"\"> and Medication Guide for KEYTRUDA at </strong><strong class=\"mdc-article-strong\" data-v-479a2324=\"\"><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.merck.com%2Fproduct%2Fusa%2Fpi_circulars%2Fk%2Fkeytruda%2Fkeytruda_mg.pdf&amp;esheet=54435729&amp;newsitemid=20260228025853&amp;lan=en-US&amp;anchor=https%3A%2F%2Fwww.merck.com%2Fproduct%2Fusa%2Fpi_circulars%2Fk%2Fkeytruda%2Fkeytruda_mg.pdf&amp;index=7&amp;md5=c2307602b0560550f05495e0ccad9237\" tabindex=\"0\">https://www.merck.com/product/usa/pi_circulars/k/keytruda/keytruda_mg.pdf</a></strong><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">.</strong>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Please see Prescribing Information for KEYTRUDA QLEX (pembrolizumab and berahyaluronidase alfa-pmph) at </strong><strong class=\"mdc-article-strong\" data-v-479a2324=\"\"><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.merck.com%2Fproduct%2Fusa%2Fpi_circulars%2Fk%2Fkeytruda_qlex%2Fkeytruda_qlex_pi.pdf&amp;esheet=54435729&amp;newsitemid=20260228025853&amp;lan=en-US&amp;anchor=https%3A%2F%2Fwww.merck.com%2Fproduct%2Fusa%2Fpi_circulars%2Fk%2Fkeytruda_qlex%2Fkeytruda_qlex_pi.pdf&amp;index=8&amp;md5=e3619a9f9b2b4acdf74a354313b251d2\" tabindex=\"0\">https://www.merck.com/product/usa/pi_circulars/k/keytruda_qlex/keytruda_qlex_pi.pdf</a></strong><strong class=\"mdc-article-strong\" data-v-479a2324=\"\"> and Medication Guide for KEYTRUDA QLEX at </strong><strong class=\"mdc-article-strong\" data-v-479a2324=\"\"><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.merck.com%2Fproduct%2Fusa%2Fpi_circulars%2Fk%2Fkeytruda_qlex%2Fkeytruda_qlex_mg.pdf&amp;esheet=54435729&amp;newsitemid=20260228025853&amp;lan=en-US&amp;anchor=https%3A%2F%2Fwww.merck.com%2Fproduct%2Fusa%2Fpi_circulars%2Fk%2Fkeytruda_qlex%2Fkeytruda_qlex_mg.pdf&amp;index=9&amp;md5=1c558569fe55eefb6180ee946d932bd9\" tabindex=\"0\">https://www.merck.com/product/usa/pi_circulars/k/keytruda_qlex/keytruda_qlex_mg.pdf</a></strong>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Merck’s focus on cancer</strong>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nEvery day, we follow the science as we work to discover innovations that can help patients, no matter what stage of cancer they have. As a leading oncology company, we are pursuing research where scientific opportunity and medical need converge, underpinned by our diverse pipeline of more than 25 novel mechanisms. With one of the largest clinical development programs across more than 30 tumor types, we strive to advance breakthrough science that will shape the future of oncology. By addressing barriers to clinical trial participation, screening and treatment, we work with urgency to reduce disparities and help ensure patients have access to high-quality cancer care. Our unwavering commitment is what will bring us closer to our goal of bringing life to more patients with cancer. For more information, visit <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.merck.com%2Fresearch%2Foncology%2F&amp;esheet=54435729&amp;newsitemid=20260228025853&amp;lan=en-US&amp;anchor=www.merck.com%2Fresearch%2Foncology%2F&amp;index=10&amp;md5=5908fabbb71a243de152179178795ece\" tabindex=\"0\">www.merck.com/research/oncology/</a>.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">About Merck</strong>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nAt Merck, known as MSD outside of the United States and Canada, we are unified around our purpose: We use the power of leading-edge science to save and improve lives around the world. For more than 130 years, we have brought hope to humanity through the development of important medicines and vaccines. We aspire to be the premier research-intensive biopharmaceutical company in the world – and today, we are at the forefront of research to deliver innovative health solutions that advance the prevention and treatment of diseases in people and animals. We foster a diverse and inclusive global workforce and operate responsibly every day to enable a safe, sustainable and healthy future for all people and communities. For more information, visit <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.merck.com%2F&amp;esheet=54435729&amp;newsitemid=20260228025853&amp;lan=en-US&amp;anchor=www.merck.com&amp;index=11&amp;md5=7954178e425381e7ab0983c18d76d15e\" tabindex=\"0\">www.merck.com</a> and connect with us on <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Ftwitter.com%2FMerck&amp;esheet=54435729&amp;newsitemid=20260228025853&amp;lan=en-US&amp;anchor=X+%28formerly+Twitter%29&amp;index=12&amp;md5=c49d15ff3576f6343ca57098abed57b2\" tabindex=\"0\">X (formerly Twitter)</a>, <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.facebook.com%2FMerckInvents%2F&amp;esheet=54435729&amp;newsitemid=20260228025853&amp;lan=en-US&amp;anchor=Facebook&amp;index=13&amp;md5=ab99d42a46c601f1cff5711eeab65c1b\" tabindex=\"0\">Facebook</a>, <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.instagram.com%2Fmerck%2F&amp;esheet=54435729&amp;newsitemid=20260228025853&amp;lan=en-US&amp;anchor=Instagram&amp;index=14&amp;md5=12d11ff6c72608b7c41aa25efdffbec1\" tabindex=\"0\">Instagram</a>, <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.youtube.com%2FMerck&amp;esheet=54435729&amp;newsitemid=20260228025853&amp;lan=en-US&amp;anchor=YouTube&amp;index=15&amp;md5=80b6f56ceb2e41920810471af24d7134\" tabindex=\"0\">YouTube</a> and <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.linkedin.com%2Fcompany%2Fmerck&amp;esheet=54435729&amp;newsitemid=20260228025853&amp;lan=en-US&amp;anchor=LinkedIn&amp;index=16&amp;md5=1034bf00d5ca4fef9bea48c25e67daa5\" tabindex=\"0\">LinkedIn</a>.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Forward-Looking Statement of Merck &amp; Co., Inc., Rahway, N.J., USA</strong>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nThis news release of Merck &amp; Co., Inc., Rahway, N.J., USA (the “company”) includes “forward-looking statements” within the meaning of the safe harbor provisions of the U.S. Private Securities Litigation Reform Act of 1995. These statements are based upon the current beliefs and expectations of the company’s management and are subject to significant risks and uncertainties. There can be no guarantees with respect to pipeline candidates that the candidates will receive the necessary regulatory approvals or that they will prove to be commercially successful. If underlying assumptions prove inaccurate or risks or uncertainties materialize, actual results may differ materially from those set forth in the forward-looking statements.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nRisks and uncertainties include but are not limited to, general industry conditions and competition; general economic factors, including interest rate and currency exchange rate fluctuations; the impact of pharmaceutical industry regulation and health care legislation in the United States and internationally; global trends toward health care cost containment; technological advances, new products and patents attained by competitors; challenges inherent in new product development, including obtaining regulatory approval; the company’s ability to accurately predict future market conditions; manufacturing difficulties or delays; financial instability of international economies and sovereign risk; dependence on the effectiveness of the company’s patents and other protections for innovative products; and the exposure to litigation, including patent litigation, and/or regulatory actions.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nThe company undertakes no obligation to publicly update any forward-looking statement, whether as a result of new information, future events or otherwise. Additional factors that could cause results to differ materially from those described in the forward-looking statements can be found in the company’s Annual Report on Form 10-K for the year ended December 31, 2025 and the company’s other filings with the Securities and Exchange Commission (SEC) available at the SEC’s Internet site (<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.sec.gov%2F&amp;esheet=54435729&amp;newsitemid=20260228025853&amp;lan=en-US&amp;anchor=www.sec.gov&amp;index=17&amp;md5=e4e09f8492d4a87c04990c73d0588a6a\" tabindex=\"0\">www.sec.gov</a>). \n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img\" data-v-f0ef0696=\"\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20260228025853r1&amp;sid=mstr3&amp;distro=nx&amp;lang=en\"/></picture></span><span data-v-602de5d2=\"\"></span></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nMedia Contacts\n<br data-v-602de5d2=\"\"/>\n<br data-v-602de5d2=\"\"/>Julie Cunningham\n<br data-v-602de5d2=\"\"/>(617) 519-6264\n<br data-v-602de5d2=\"\"/>\n<br data-v-602de5d2=\"\"/>Michael McArdle\n<br data-v-602de5d2=\"\"/>(908) 447-9453\n<br data-v-602de5d2=\"\"/>\n<br data-v-602de5d2=\"\"/>Investor Contacts:\n<br data-v-602de5d2=\"\"/>\n<br data-v-602de5d2=\"\"/>Peter Dannenbaum\n<br data-v-602de5d2=\"\"/>(732) 594-1579\n<br data-v-602de5d2=\"\"/>\n<br data-v-602de5d2=\"\"/>Steven Graziano\n<br data-v-602de5d2=\"\"/>(732) 594-1583\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span data-v-602de5d2=\"\">View source version on businesswire.com: </span><span data-v-602de5d2=\"\"><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://www.businesswire.com/news/home/20260228025853/en/\" tabindex=\"0\">https://www.businesswire.com/news/home/20260228025853/en/</a></span></p></div>",
            "pub_date": "2026-02-28 23:26:31",
            "link": "https://www.morningstar.com/news/business-wire/20260228025853/keytruda-pembrolizumab-plus-welireg-belzutifan-given-as-adjuvant-therapy-reduced-the-risk-of-disease-recurrence-or-death-by-28-compared-to-keytruda-monotherapy-in-certain-patients-with-earlier-stage-renal-cell-carcinoma-rcc",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        }
    ]
}