{
    "data": [
        {
            "title": "'I dread the snow': My heating and air conditioning always breaks down. Do I spend $15,000 on a new one?",
            "description": "<div class=\"mdc-article-body\">\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  By Quentin Fottrell </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     'Is there a formula or method for figuring out when replacement becomes more cost-effective than ongoing repairs?' </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     \"I estimate that similar expenses will occur two to three times per year.\" (Photo subject is a model.) </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Dear Quentin, </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     My heating and air-conditioning unit is 11 years old and needs repairs every few months. Yesterday, I had to spend almost $400 on a repair, and I estimate that similar expenses will occur two to three times per year. I'm trying to determine at what point it makes sense to replace the unit. I don't yet know what a new unit will cost, but I plan to find out on Monday when the salesperson visits. Is there a formula or method for figuring out when replacement becomes more cost-effective than ongoing repairs? </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Homeowner </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Don't miss: 'I spend $7,500 a month': I'm 47, earn $260K, and have $3 million. Can I retire at 50? </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     You can email The Moneyist with any financial and ethical questions at qfottrell@marketwatch.com. The Moneyist regrets he cannot reply to questions individually. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     If there is a leak, he needs to find it. He has not proven that he can do that, so it's time for a second opinion. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Dear Homeowner, </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Regular maintenance should, as any dentist will tell you, help prevent pain later on. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Since your HVAC unit is 11 years old and you're spending $400 per repair two to three times a year, it's costing you $1,000 a year. So it would take 15 years to reach the $15,000 price tag of a new unit. As older units tend to fail more often, repair costs are likely to rise each year, and a major breakdown could hit you with even bigger sticker shock. If your system is more than 10 years old and annual repairs exceed $500 to $1,000 a year, start putting money aside for a replacement. From what you say, replacing the unit would be more cost-effective and less stressful. However, I'm not convinced that your maintenance man is not missing the problem. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     A leak of the chemical refrigerant, which is crucial for the cooling and heating process, can reduce cooling efficiency, cause the buildup of ice on coils, increase your energy costs and lead to periodic breakdowns in the entire system. Your maintenance man keeps coming back and, it seems, fixing the same problem. If there is a leak, he needs to find it. He has not proven that he can do that, so it's time for a second opinion. You should conduct maintenance on your HVAC every year, but three times a year is not sustainable. So you either find the problem and fix it or invest in a new air-conditioning unit. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     The silver lining, I hope, is that you can afford your heating and cooling bills. \"I dread the snow,\" a friend recently told me, because the cold temperatures mean they'll have to turn up the heat for weeks, meaning a surge in their heating bill. It can make a difference for a house with two or more bedrooms. The National Energy Assistance Directors Association recently reported that home heating costs are expected to rise 11% this winter (November through March), driven by higher energy prices. That's nearly four times the rate of inflation. (Homes that rely on electricity for their heating are predicted to rise more than those relying on natural gas.) </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Lifespan of units </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Back to your HVAC: While some brands have better reputations than others, Constellation (CEG), the energy company, has this guide on the lifespan of units. Taking these estimates at face value, your unit should have at least another four years left, so let's assume that with a change of maintenance contractor, you will find the leak and solve the problem. Here are some lifespan estimates, according to Constellation: central air-conditioning units (12 to 17 years); heat pumps (10 to 16 years); furnaces and boilers (15 to 20 years); geothermal heat pumps (25 to 30 years); ground loops (50 years); solar panels (25 to 30 years); and evaporative coolers (5 to 15 years). </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     HVACs, like people, require regular tuneups. So if your unit costs you $15,000, you want to make sure it lasts as long as possible. The healthier the unit, the fewer times you will have to replace it. Those seasonal tuneups start with simple tasks like changing filters, inspecting refrigerant levels and keeping outdoor components clean, according to the experts at Constellation. Cleaning air filters removes dust, pet hair and germs, and - the best part - replacing them is inexpensive and easy. The same is true for keeping air ducts clean. To save money, put the system on \"auto\" (rather than \"all day\") and turn it off if you're going away. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     \"It is important to understand, however, that there really is no such thing as an average HVAC system,\" the company adds. \"The features and functions of different units vary tremendously. A system that only produces heat and doesn't include air conditioning will perform differently from a heat pump, for example, that does both. Usage patterns will affect how long a system might last. Heavy use will increase wear and tear and decrease a unit's lifespan. How well they are maintained can also make a difference that is measured in decades of more useful life. It is often worth paying more up front for a higher-quality unit.\" </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Good luck with the new maintenance man in solving your temperature trouble. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     More columns from Quentin Fottrell: </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Can I stop my kids from using their inheritance to support political causes I vehemently oppose? </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     My wife's credit-card payment is three months overdue. As an authorized user, am I in trouble? </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     My stepmother cheated me out of $500K from my father's estate. What can I do? </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Check out The Moneyist's private Facebook group, where members help answer life's thorniest money issues. Post your questions, or weigh in on the latest Moneyist columns. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     By emailing your questions to The Moneyist or posting your dilemmas on The Moneyist Facebook group, you agree to have them published anonymously on MarketWatch. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     By submitting your story to Dow Jones &amp; Co., the publisher of MarketWatch, you understand and agree that we may use your story, or versions of it, in all media and platforms, including via third parties. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     -Quentin Fottrell </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     This content was created by MarketWatch, which is operated by Dow Jones &amp; Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal. </p>\n<pre class=\"mdc-article-pre\" data-v-370ea3ac=\"\"></pre>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  (END) Dow Jones Newswires</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  02-28-26 1527ET</p>\n\nCopyright (c) 2026 Dow Jones &amp; Company, Inc.</div>",
            "pub_date": "2026-03-01 04:31:39",
            "link": "https://www.morningstar.com/news/marketwatch/20260228201/i-dread-the-snow-my-heating-and-air-conditioning-always-breaks-down-do-i-spend-15000-on-a-new-one",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "My brother is paranoid, alone and has forgotten that he sold his house. How can we help?",
            "description": "<div class=\"mdc-article-body\">\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  By Quentin Fottrell </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     His lawyer said, 'He's gone off the deep end' </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     \"The lawyer's last words to us was we might have to appoint a new executor if his condition continues to deteriorate.\" (Photo subject is a model.) </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Dear Quentin, </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     My sister and I have held power of attorney for my brother, who lives six hours away. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     He has been in an assisted-living facility for over three years. Physically, he is not able to live independently, but was or is pretty sharp mentally. We take care of all his bills; his house and car were sold over three years ago. His wife died in 2020; they had no children. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Over the last 10 days, he started calling my sister about bills he needed to pay; all his bills are being paid by her. He also wants to know the balance in his bank accounts. My sister has always given him this information when he asks. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     He wanted to see the lawyer recently. He was very paranoid, asking staff to witness their conversation. He doesn't remember that he sold his house or car. In an email, his lawyer said, \"He's gone off the deep end.\" </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     The lawyer's last words to us were we might have to appoint a new executor if his condition continues to deteriorate. My sister and I are his only family, the will is made and we would inherit his estate. What do we do next? </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     The Other Sibling </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Don't miss: 'I spend $7,500 a month': I'm 47, earn $260K, and have $3 million. Can I retire at 50? </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     You can email The Moneyist with any financial and ethical questions at qfottrell@marketwatch.com. The Moneyist regrets he cannot reply to questions individually. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     A durable power of attorney would continue to carry out these duties after if/when your brother becomes incapacitated. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Dear Sibling, </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     I'm not encouraged by the tone or content of his attorney's email. It lacks compassion, professionalism and respect. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Your brother is confused and needs help. But he doesn't need an executor. An executor is appointed by the probate court after your brother passes away (and would typically be designated executor in his will). A power of attorney usually looks after a person's finances while they have diminished capacity; a durable power of attorney would continue to carry out these duties after if/when your brother becomes incapacitated. A conservator/guardian would be appointed by the courts to oversee his financial, physical and medical wellbeing. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Take immediate steps to safeguard your brother's safety: He may need an assessment for dementia or cognitive impairment from a neurologist or geriatrician. I hope that the assisted-living facility is aware of this change of behavior, and is equipped to help him navigate this next stage. You will all need to work together until you figure out the next steps for your brother. Questions remain: What kind of power of attorney document currently exists? What legal capacity does your brother have to make decisions for himself - everything from hiring a new lawyer to revoking a POA? Has your brother been actually diagnosed with dementia? </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     A durable power of attorney would continue if/when your brother becomes incapacitated. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Most of all, you will require health advocates and a competent lawyer. If the lawyer mentioned in your letter is not equipped to deal with your brother's situation - and it could be so given his reaction to the decline in your brother's health - you need a new lawyer to oversee your brother's affairs; as his joint powers of attorney, you can help him to appoint one. They will be able to help outline your options, which will depend on what kind of POA you hold and whether or not your brother requires conservatorship/guardianship, which should be a last resort. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Laws regarding a conservator/guardian vary by state. In Texas, you would need to file a petition with the court. \"A hearing will be held, and the judge will examine the evidence and make a decision,\" says Childs Legacy Law Firm in Houston. \"In the second instance, absent a pending petition, and in lieu of a family member, living will or another relevant document, the court will appoint a conservator. The conservator can be any number of people, like a friend, social worker, neighbor, church member, attorney, nurse [or] another qualified person.\" </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     General conservatorship </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     \"A general conservatorship is created when an adult - typically an elderly person but can be a younger adult person - cannot manage their finances or health due to deteriorated mental capacity or impairment caused by an illness or injury,\" it adds. \"While they recover from the illness or injury, a conservator may be appointed by a court to address their medical and financial needs.\" Reasons include a person falling into a coma, a form of dementia like Alzheimer's, head injury or a stroke that impairs their ability to think or express their wishes. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Your brother's condition appears to be deteriorating, quite suddenly. \"People who suffer from any of the above can become vulnerable to bad actors who may try to manipulate the situation for their own financial gain. These bad actors may, for example, attempt to divert your disability payments (fraud) or coerce you into changing a will (undue influence),\" the law firm says. It is always better to draft an estate plan while you have the legal capacity to write and sign such a document. Otherwise, it will be left up to the courts. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Your brother's condition appears to be deteriorating. He needs calm and legal protection. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Right now, your brother needs reassurance and validation, clear and comforting communication, a routine so he feels safe, and legal protection; document everything, especially his changes in behavior. If he does not already have a healthcare proxy or healthcare power of attorney, and your brother is not of sound mind, the courts will appoint one for him. If he is in assisted living, for example, there may come a time when you will have to move him to a full-time care facility. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     In the absence of long-term-care insurance or Medicaid, I assume you will use (or have used) the proceeds from the sale of his house to pay for his care. Selling a primary residence turns the home's equity from an exempt asset into countable cash, which often exceeds the strict monthly $2,000-$3,000 individual limit for Medicaid, which would lead to a temporary loss of benefits until those funds are spent. A trust and estate attorney can talk through your options. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     You can do this. But you can't - nor should you - do it alone. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Related: 'I am fearful': My ailing relative is being forced into assisted living. What can I do? </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     More columns from Quentin Fottrell: </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Can I stop my kids from using their inheritance to support political causes I vehemently oppose? </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     My wife's credit-card payment is three months overdue. As an authorized user, am I in trouble? </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     My stepmother cheated me out of $500K from my father's estate. What can I do? </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Check out The Moneyist's private Facebook group, where members help answer life's thorniest money issues. Post your questions, or weigh in on the latest Moneyist columns. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     By emailing your questions to The Moneyist or posting your dilemmas on The Moneyist Facebook group, you agree to have them published anonymously on MarketWatch. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     By submitting your story to Dow Jones &amp; Co., the publisher of MarketWatch, you understand and agree that we may use your story, or versions of it, in all media and platforms, including via third parties. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     -Quentin Fottrell </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     This content was created by MarketWatch, which is operated by Dow Jones &amp; Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal. </p>\n<pre class=\"mdc-article-pre\" data-v-370ea3ac=\"\"></pre>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  (END) Dow Jones Newswires</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  02-28-26 1527ET</p>\n\nCopyright (c) 2026 Dow Jones &amp; Company, Inc.</div>",
            "pub_date": "2026-03-01 04:31:38",
            "link": "https://www.morningstar.com/news/marketwatch/20260228199/my-brother-is-paranoid-alone-and-has-forgotten-that-he-sold-his-house-how-can-we-help",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Middle Eastern airports are crossroads of the world. Here's how the U.S.-Israel attack on Iran will sow chaos on air travel",
            "description": "<div class=\"mdc-article-body\">\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  By Claudia Assis </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     The Dubai International Airport in February 2021. Dubai and other airports in the region fashioned themselves into major international hubs over the years. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Middle Eastern airports such as United Arab Emirates' Dubai and Qatar's Doha fashioned themselves into the crossroads of the world in the last couple of decades. Both are closed following U.S. and Israel's attacks on Iran on Saturday, wreaking havoc in international air travel. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Dubai and Doha are among the largest international hubs for air travel, said Henry Harteveldt, a travel industry analyst with Atmosphere Research Group. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     \"Flights from these hubs go to all continents,\" he said. \"It's going to be highly highly disruptive to international air travelers.\" </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     The U.S. and Israel's strikes on Saturday led to Tehran's strikes of its own, with President Donald Trump calling on Iranians to overthrow their government. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Aviation analytics firm Cirium said Saturday the three major airlines operating out of the UAE and Qatar - Emirates, Qatar Airways, and Etihad - connect about 90,000 transiting passengers a day, not including passengers destined for the Middle East. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Several airlines canceled flights to Middle Eastern airports due to safety concerns, including United Airlines (UAL) and Delta Air Lines (DAL) scratching their flights to Tel Aviv at least through the weekend, among other changes and cancellations. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Stephen Trent, an independent airline analyst who spent decades at major investment banks, noted that U.S. airlines already spent the last couple of years experiencing disruption in the region and already restricted their routes, which could minimize the current direct disruption. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Dubai's and Doha's airports were catapulted into major air-travel hubs starting in the 2000s as their own countries became global economic powerhouses. Dubai's Emirates, for instance, is one of only a select group of airlines flying Airbus' A380 jets, the largest commercial plane ever built, with room for more than 500 passengers. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Historically, Iran's Mehrabad airport in Tehran was emerging as a global hub connecting East and West in the 1970s, but that trajectory cut short by the Iranian Revolution, Harteveldt said. Over the years, Dubai, Doha and Abu Dhabi's airports took that mantle. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Depending on how long the conflict and airport closures last, cargo would also be affected, Harteveldt said. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Even with an end to the conflict, it will take time for airlines to right their schedules and resume normal operations, since their planes - and crews - were diverted to other airports and are scattered due to the closures, he said. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     -Claudia Assis </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     This content was created by MarketWatch, which is operated by Dow Jones &amp; Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal. </p>\n<pre class=\"mdc-article-pre\" data-v-370ea3ac=\"\"></pre>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  (END) Dow Jones Newswires</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  02-28-26 1450ET</p>\n\nCopyright (c) 2026 Dow Jones &amp; Company, Inc.</div>",
            "pub_date": "2026-03-01 04:00:52",
            "link": "https://www.morningstar.com/news/marketwatch/20260228198/middle-eastern-airports-are-crossroads-of-the-world-heres-how-the-us-israel-attack-on-iran-will-sow-chaos-on-air-travel",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Iran conflict raises talk of a return to $100-a-barrel oil",
            "description": "<div class=\"mdc-article-body\">\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  By Myra P. Saefong </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Reports say Iran's military is not allowing passage through the crucial maritime waterway known as the Strait of Hormuz </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Sealing the Straight of Hormuz would be the economic equivalent of pulling the fire alarm in a crowded theatre, says SPI Asset Management. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     The U.S. and Israel's attack on Iran raised alarms on Saturday that a key regional source of the world's crude oil may now be at risk, sparking  talk of a return to $100-a-barrel oil prices. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     The Strait of Hormuz, a maritime chokepoint vital to the world's crude-oil exports, has come into sharp focus as fears of a broader regional conflict grow. The strait is crucial because it allows cargo ships to pass the Persian Gulf,  the Gulf of Oman and the Arabian Sea, facilitating the production and flow of crude oil from the Middle East. The region is home to five of the world's top 10 biggest producers. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     \"So far, there is no clarity on the magnitude of any energy disruptions, but there has been some disruption of shipping in the Strait of Hormuz,\" said Matt Gertken, chief geopolitical and U.S. political strategist at BCA Research. \"It is too soon to gauge the impact on the oil market, but the intensity of the military operation implies high odds of a major oil supply disruption\" of 5 million barrels per day or more, he told MarketWatch on Saturday. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     The U.S. and Israel strikes on Iran targeted its leadership and military assets, The Wall Street Journal reported. The move followed failed negotiations between the U.S. and Iran to reach a deal to limit Iran's nuclear program. Iran has responded with strikes across the Middle East. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Read: Trump calls for regime change after U.S.-Israel attack on Iran. Markets should brace for more than June's brief military campaign. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Several news reports Saturday indicated that passage through the Strait of Hormuz has been curtailed. An official from the European Union's naval mission Aspides told Reuters that vessels have been receiving VHF transmission from Iran's Revolutionary Guards saying that no ship is allowed to pass the Strait of Hormuz. So far, there has not been any official closure announcement. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     'Iran understands that sealing Hormuz is the economic equivalent of pulling the fire alarm in a crowded theatre and locking the exits for Middle East oil exports.'Stephen Innes, SPI Asset Management </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Iran, however, \"understands that sealing Hormuz is the economic equivalent of pulling the fire alarm in a crowded theatre and locking the exits for Middle East oil exports,\" said Stephen Innes, managing partner at SPI Asset Management. \"It would hit not only Western consumers but also China and regional buyers. It is a blunt instrument.\" </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Developments in the region are sure to impact oil prices as soon as trading resumes late Sunday and into early Monday. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Oil prices will continue to rise on speculation that the war will expand and that infrastructure will be hit, said BCA Research's Gertken. U.S. global benchmark Brent crude (BRN00) could reach $90 per barrel without significant physical disruption, he said. That would be a more than 20% rise from Friday's settlement of $72.87 for the May contract (BRNK26). </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     If there is physical disruption, then it can rise above $100 per barrel - \"potentially well above\" that, said Gertken. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Strait of Hormuz: A staggering chokepoint </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Just how much oil could be involved when it comes to the Strait of Hormuz and to the broader region is staggering. Kpler provided a snapshot Saturday of oil and oil-product tankers in the Strait of Hormuz. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     This map is a snapshot of the oil and oil-product tankers currently in and around the Strait Hormuz. Green tankers are loaded, while red ones are in \"ballast,\" or essentially empty. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Around 20% of the global petroleum liquids the world uses transits through the strait each day. Last year, just over 14.5 million barrels per day of crude and crude condensate exports passed through the strait, said Matt Smith, U.S. head analyst at Kpler. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     From the archives: Strait of Hormuz, the world's biggest oil chokepoint, in focus as U.S.-Iran tensions flare </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Saudi Arabia accounted for around 5.5 million daily barrels, Iraq 3.25 million, UAE 1.97 million, Iran 1.59 million, Kuwait 1.55 million, and Qatar 0.72 million, said Smith. Over 90% of that oil typically heads to Asia, around 4% to Europe, 4% to the Americas and the rest to Africa, he said. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Four countries - China, India, Japan and South Korea - account for nearly three-quarters of the crude barrels that pass through the Strait of Hormuz, so they would feel the most significant impact, said Smith. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     The Middle East is home to half of the world's top 10 oil producers - Saudi Arabia, Iraq, the United Arab Emirates, Iran and Kuwait, according to the International Energy Agency. In 2022, the region accounted for more than four in 10 barrels of global oil exports, it said. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Yet the oil market's biggest risk isn't the Strait of Hormuz being closed, said Kpler's Smith. It's that \"Iran's retaliation leads to broader unrest in the region, putting supply at risk,\" he said. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Iran alone produces 3.2 million daily barrels of crude oil, with around 2 million of that primarily exported to China for refining, according to OPIS, a unit of Dow Jones, the publisher of MarketWatch. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Iran's proven crude oil reserves are estimated at 208 billion barrels, according to OPIS. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     There have been reports of explosions Iran's Kharg Island, a key export terminal roughly 15 miles off the coast of Iran, OPIS's Denton Cinquegrana and Tracy Cui wrote in a report Saturday. It is still too early to tell what kind of damage, if any, has been done to export infrastructure on Kharg Island, they said, but about 90% of Iran's exports go through it. Sometimes called \"oil island,\" it has a storage capacity of about 7 million barrels. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     From the archives: Israeli strikes on Iran's 'oil island' could send crude prices soaring </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     OPEC+ meeting Sunday </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     The Iran conflict comes ahead of Sunday's monthly meeting of eight major oil producers, a group known as the Organization of the Petroleum Exporting Countries and its allies, or OPEC+. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     The group had been raising their production quotas for most of last year, but paused those increases for the first quarter of 2026 on the heels of expectations for a global oil supply surplus. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Now OPEC+ is likely to increase production to \"try to suppress prices, cushion the global economy, and undercut Iranian regime funding,\" said BCA Research's Gertken. But if shipping is affected, then any such production increases \"may not be able to reach the global market immediately.\" </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Read: Any chance of a Fed interest-rate cut in 2026 is 'evaporating before our very eyes' with Iran war set to stoke oil prices </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     -Myra P. Saefong </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     This content was created by MarketWatch, which is operated by Dow Jones &amp; Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal. </p>\n<pre class=\"mdc-article-pre\" data-v-370ea3ac=\"\"></pre>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  (END) Dow Jones Newswires</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  02-28-26 1439ET</p>\n\nCopyright (c) 2026 Dow Jones &amp; Company, Inc.</div>",
            "pub_date": "2026-03-01 03:46:41",
            "link": "https://www.morningstar.com/news/marketwatch/20260228197/iran-conflict-raises-talk-of-a-return-to-100-a-barrel-oil",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "More than 80% say affordability has not improved under Trump, exclusive YouGov-MarketWatch poll finds",
            "description": "<div class=\"mdc-article-body\">\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  By Venessa Wong </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Americans say politicians in Washington aren't taking the cost of living seriously </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Consumers named grocery prices, insurance, prescription drug prices, rent and saving to buy a house as their top affordability challenges, according to an exclusive YouGov-MarketWatch survey. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     As President Donald Trump begins his second year in office, Americans are still struggling with the cost of living. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     The president campaigned on assurances that he would solve affordability challenges in 2024, and he touted his record on these issues in Tuesday's State of the Union address. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Yet, in a YouGov survey conducted this month exclusively for MarketWatch, nearly 47% of survey takers said affordability has worsened somewhat or a lot over the past year. Meanwhile, 36% said it has stayed about the same, and nearly 18% said affordability has improved. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Consumers said grocery prices, insurance, prescription drug prices, rent, and saving to buy a home were the top affordability challenges. Of those who selected insurance, car insurance was the most common concern, followed by health insurance and homeowners' or renters' insurance. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Related: Trump says 'prices are plummeting' during SOTU. Here's what the data say. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     The Trump administration has lowered taxes and negotiated Medicaid and Medicare drug prices; Trump has proposed a variety of other measures - ranging from a cap on credit-card interest rates to banning institutional investors from buying single-family homes. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Yet two-thirds of respondents in the YouGov-MarketWatch poll did not feel elected officials in Washington were taking affordability issues seriously. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Hopefully, \"the message is finally breaking through to policymakers that affordability is the challenge of our time,\" said Catherine Harvey, a senior policy program manager in the Research to Action Lab at the Urban Institute, a left-leaning research organization. Just as past policy choices have shaped the financial pressures consumers face today, future \"policy choices can relieve some of those same pressures,\" she said. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Related: Here are Trump's affordability proposals - and where they stand </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Asked who or what is most responsible for Americans' current affordability challenges, 41% of survey takers said the Trump administration was responsible, 40% said corporate greed, 22% said Republican lawmakers, 21% said the Biden administration and 20% said Democratic lawmakers (respondents could pick more than one response for this question). </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     \"Trump policies will hamstring the economy's ability to supply goods and services, and these policies aim to increase inequality by transferring income from the bottom and middle toward the top,\" according to a new report by Josh Bivens, chief economist at the  Economic Policy Institute, a left-leaning think tank. This shift will happen through funding cuts for public services, including Affordable Care Act subsidies, and tax cuts favoring the rich, he wrote. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     \"Sometimes this affordability crunch will manifest as higher prices or faster inflation, but it is more likely to appear as slower wage growth and the rollback of public supports for households,\" Bivens wrote. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     As for what would improve Americans' personal financial situations, respondents primarily said lower prices (38%), higher wages (19%) and lower taxes (12%) would do the most to help them, according to the YouGov-MarketWatch poll of 1,000 people. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     People's earnings have gone up since the start of Trump's first term in 2017, but \"not as fast as prices. And that's why people are feeling squeezed,\" Harvey said. In terms of public investments to relieve any of these issues, it will be important to measure what works so the government can \"invest wisely.\" </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     More on this: Here are the ideas that could really help solve America's affordability crisis in 2026 </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     As for what would improve Americans' personal financial situations, respondents primarily said lower prices (38%) and higher wages (19%). </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     White House spokesman Kush Desai said in a statement to MarketWatch ahead of the State of the Union address, \"President Trump pledged to turn the page on Joe Biden's inflation and affordability crisis, and the Trump administration is embarking on an ambitious agenda of reform across every sector of our economy to deliver: from MFN [most favored nation] deals to lower drug prices to an energy abundance push to lower prices at the pump. This overarching agenda has already cooled inflation and cut prices of many household essentials, with more progress in store for the American people.\" </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Nicole Huyer, a senior research associate at the conservative Heritage Foundation, said in a recent opinion piece that Trump has implemented a variety of policies - \"deregulation, tax cuts, cutting of unnecessary public workers and taxpayer-funded programs, and deportations\" - intended to reduce costs, and called them \"all steps in the right direction.\" </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Many Americans, particularly those considered to be low or middle income, face serious challenges in today's economy. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     The gap between high-income and middle- and low-income households has continued to widen since the pandemic, according to the Bank of America Institute. Last month, lower- and middle-income households' year-over-year spending growth ticked down to 0.3% and 1.0%, respectively, while higher-income households' spending growth was more stable at 2.5%, according to Bank of America credit- and debit-card data. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     The number of Americans who say they don't have money left over after paying their bills rose 7 points to 48% between May and September 2025, according to Ipsos. Seven in 10 people polled by Ipsos said they were spending more on food at home and less on dining out and travel; nearly four in 10 have postponed a vacation or have delayed a big-ticket purchase such as an appliance, car or home renovation; and 30% delayed or skipped medical treatment due to cost. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     As noted in an Urban Institute report, for many, \"affordability\" doesn't merely indicate an ability to spend on short-term needs and wants; it means being able to save for mid- and long-term financial goals as well. \"Young people see today's affordability crisis as a barrier to their long-term wealth-building plans, including higher education and homeownership,\" stated the report. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     For instance, high home prices and interest rates led the share of first-time home buyers to drop to a record low of 21%, while the typical age of first-time buyers reached an all-time high of 40 years old, according to the National Association of Realtors. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Among the roughly one-fourth of preretirees who said last year that they are delaying retirement, 44% cited inflation as a reason. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Related: Who can actually buy a house today? Meet the 'elite' buyers achieving the American dream. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     JOIN THE DON'T SHORT YOURSELF LIVE Q&amp;ATax season stressing you out? We've got you. Join Don't Short Yourself Live to ask MarketWatch's Andrew Keshner and Beth Pinsker your tax questions on Wednesday, Feb. 25, 2026, at 1:30 p.m. Eastern time. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     What personal-finance issues would you like to see covered in MarketWatch? We would like to hear from readers about their financial decisions and money-related questions. You can write to us at readerstories@marketwatch.com. A reporter may be in touch to learn more. MarketWatch will not attribute your answers to you by name without your permission. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     -Venessa Wong </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     This content was created by MarketWatch, which is operated by Dow Jones &amp; Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal. </p>\n<pre class=\"mdc-article-pre\" data-v-370ea3ac=\"\"></pre>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  (END) Dow Jones Newswires</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  02-28-26 1423ET</p>\n\nCopyright (c) 2026 Dow Jones &amp; Company, Inc.</div>",
            "pub_date": "2026-03-01 03:36:32",
            "link": "https://www.morningstar.com/news/marketwatch/20260228195/more-than-80-say-affordability-has-not-improved-under-trump-exclusive-yougov-marketwatch-poll-finds",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "PYPL Investor Alert: Kessler Topaz Meltzer & Check, LLP Encourages PYPL Investors with Losses to Contact the Firm",
            "description": "<div class=\"mdc-article-body\">\n            \n              \n              PYPL Investor Alert: Kessler Topaz Meltzer &amp; Check, LLP Encourages PYPL Investors with Losses to Contact the Firm\n              \n            \n            \n              <span>\n<h2 class=\"mdc-article-heading mdc-heading__mdc mdc-heading--level-5__mdc\" data-v-618d53ae=\"\">PYPL Investor Alert: Kessler Topaz Meltzer &amp; Check, LLP Encourages PYPL Investors with Losses to Contact the Firm</h2>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">PR Newswire</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Radnor, Pa., Feb. 28, 2026</p>\n</span>\n<span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Did you buy PYPL common stock between February 25, 2025, and February 2, 2026?</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Affected PayPal Holdings, Inc.</strong> <strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Investor Summary</strong></p><ul class=\"mdc-article-list mdc-article-list--unordered\" data-v-7b473e83=\"\"><li data-v-7b473e83=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Who</strong>: PayPal Holdings, Inc. (<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4629592-1&amp;h=2357001639&amp;u=https%3A%2F%2Fwww.benzinga.com%2Fquote%2FPYPL&amp;a=NASDAQ%3A+PYPL\" tabindex=\"0\">NASDAQ: PYPL</a>)</li><li data-v-7b473e83=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">What:</strong> Securities <span data-v-7b473e83=\"\">fraud</span> class action lawsuit filed</li><li data-v-7b473e83=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Class Period:</strong> February 25, 2025, through February 2, 2026</li><li data-v-7b473e83=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Deadline to Seek Lead Plaintiff Status:</strong> April 20, 2026</li><li data-v-7b473e83=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Key Lawsuit Allegations:</strong> Material misstatements and/or omissions concerning the company's projected revenue outlook and anticipated growth.</li><li data-v-7b473e83=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Investor Action:</strong> Contact <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4629592-1&amp;h=2262316190&amp;u=https%3A%2F%2Fwww.ktmc.com%2Fpypl-paypal-holdings-inc-class-action-lawsuit%3Futm_source%3DPR_Newswire%26utm_medium%3Dpressrelease%26utm_campaign%3Dpypl%26mktm%3DPR&amp;a=Kessler+Topaz+Meltzer+%26+Check%2C+LLP+(www.ktmc.com)\" tabindex=\"0\">Kessler Topaz Meltzer &amp; Check, LLP (www.ktmc.com)</a> for recovery options at no cost to investor</li></ul><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span data-v-602de5d2=\"\">Radnor, Pa.</span>, <span data-v-602de5d2=\"\">Feb. 28, 2026</span> /PRNewswire/ -- Kessler Topaz Meltzer &amp; Check, LLP (<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4629592-1&amp;h=3833159455&amp;u=http%3A%2F%2Fwww.ktmc.com%2F&amp;a=www.ktmc.com\" tabindex=\"0\">www.ktmc.com</a>), a nationally recognized securities litigation law firm, informs investors that a securities <span data-v-602de5d2=\"\">fraud</span> class action lawsuit has been filed against PayPal Holdings, Inc. (PayPal) (<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4629592-1&amp;h=2357001639&amp;u=https%3A%2F%2Fwww.benzinga.com%2Fquote%2FPYPL&amp;a=NASDAQ%3A+PYPL\" tabindex=\"0\">NASDAQ: PYPL</a>) on behalf of those who purchased or acquired PayPal common stock between February 25, 2025, and February 2, 2026, inclusive. The lawsuit is filed in the United States District Court for the Northern District of California and is captioned <em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">Goodman v. PayPal Holdings, Inc., et al,</em> Case No. 3:26-cv-01381 (N.D. Cal.). <strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Investors have until April 20, 2026, to file for lead plaintiff status.</strong> </p>\n<span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://mma.prnewswire.com/media/2476890/Kessler_Topaz_Meltzer_and_Check__Logo.html\" tabindex=\"0\">\n<span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img\" data-v-f0ef0696=\"\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://mma.prnewswire.com/media/2476890/Kessler_Topaz_Meltzer_and_Check__Logo.jpg\"/></picture></span>\n</a>\n</p>\n</span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\"><span class=\"mdc-article-underline\" data-v-1f1bdc8a=\"\">CONTACT KTMC TO DISCUSS YOUR LEGAL RIGHTS:<br data-v-1f1bdc8a=\"\"/></span></strong>If you purchased or acquired PayPal common stock and have lost money on your investment, you are encouraged to contact KTMC attorney Jonathan Naji, Esq. at:</p><ul class=\"mdc-article-list mdc-article-list--unordered\" data-v-7b473e83=\"\"><li data-v-7b473e83=\"\">(484) 270-1453</li><li data-v-7b473e83=\"\"><span>info@ktmc.com</span></li><li data-v-7b473e83=\"\"><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4629592-1&amp;h=2348385992&amp;u=https%3A%2F%2Fwww.ktmc.com%2Fpypl-paypal-holdings-inc-class-action-lawsuit%3Futm_source%3DPR_Newswire%26utm_medium%3Dpressrelease%26utm_campaign%3Dpypl%26mktm%3DPR&amp;a=https%3A%2F%2Fwww.ktmc.com%2Fpypl-paypal-holdings-inc-class-action-lawsuit%3Futm_source%3DPR_Newswire%26utm_medium%3Dpressrelease%26utm_campaign%3Dpypl%26mktm%3DPR\" tabindex=\"0\">https://www.ktmc.com/pypl-paypal-holdings-inc-class-action-lawsuit?utm_source=PR_Newswire&amp;utm_medium=pressrelease&amp;utm_campaign=pypl&amp;mktm=PR</a></li></ul><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">There is no cost or obligation to speak with an attorney.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Learn more about PayPal Holdings, Inc. on YouTube: </strong></p><ul class=\"mdc-article-list mdc-article-list--unordered\" data-v-7b473e83=\"\"><li data-v-7b473e83=\"\"><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4629592-1&amp;h=2582852741&amp;u=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3D8ed9a5ReIpc&amp;a=+PayPal+Holdings%2C+Inc.+Securities+Class+Action+Lawsuit+(long+video)\" tabindex=\"0\"> <strong class=\"mdc-article-strong\" data-v-479a2324=\"\">PayPal Holdings, Inc. Securities Class Action Lawsuit (long video)</strong></a></li><li data-v-7b473e83=\"\"><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4629592-1&amp;h=265404551&amp;u=https%3A%2F%2Fwww.youtube.com%2Fshorts%2Fn2jtzz_ysd8&amp;a=+PayPal+Holdings%2C+Inc.+Securities+Class+Action+Lawsuit+(short+video)\" tabindex=\"0\"> <strong class=\"mdc-article-strong\" data-v-479a2324=\"\">PayPal Holdings, Inc. Securities Class Action Lawsuit (short video)</strong></a></li></ul><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\"><span class=\"mdc-article-underline\" data-v-1f1bdc8a=\"\">PAYPAL HOLDINGS, INC.</span></strong><span class=\"mdc-article-underline\" data-v-1f1bdc8a=\"\"> <strong class=\"mdc-article-strong\" data-v-479a2324=\"\">CLASS ACTION LAWSUIT - COMPLAINT ALLEGATION SUMMARY:</strong> <br data-v-1f1bdc8a=\"\"/></span>The complaint <span data-v-602de5d2=\"\">alleges</span> that, throughout the Class Period, Defendants made materially false and/or misleading statements, as well as failed to disclose material adverse facts about PayPal's business and operations. Specifically, Defendants created the false impression that they possessed reliable information pertaining to PayPal's projected revenue outlook and anticipated growth while also minimizing risk from seasonality and macroeconomic fluctuations. In truth, PayPal's optimistic plan for growth through various initiatives to bolster PayPal's Branded Checkout offerings fell short of reality as the 2027 targets were not achievable under the tenure of PayPal's CEO and required both an unrealistically stable consumer landscape and strong execution with clear direction from PayPal and its management.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Why did PayPayl's Stock Drop?<br data-v-479a2324=\"\"/></strong>On February 3, 2026, PayPal announced a surprise leadership change replacing the company's CEO. The leadership change coincided with PayPal's fourth quarter and full year 2025 earnings report, wherein PayPal missed consensus estimates for both revenue and profit. On this news, PayPal's stock price fell $10.63, or 20.3%, to close at $41.70 per share on February 3, 2026. </p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\"><span class=\"mdc-article-underline\" data-v-1f1bdc8a=\"\">WHAT PYPL INVESTORS CAN DO NOW:</span></strong></p><ol class=\"mdc-article-list mdc-article-list--ordered\" data-v-7b473e83=\"\"><li data-v-7b473e83=\"\">File to be lead plaintiff by April 20, 2026.</li><li data-v-7b473e83=\"\">Contact KTMC for a free case evaluation. All representation is on a contingency fee basis, there is no cost to you.</li><li data-v-7b473e83=\"\">Retain counsel of choice or take no action.</li></ol><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\"><span class=\"mdc-article-underline\" data-v-1f1bdc8a=\"\">THE LEAD PLAINTIFF PROCESS FOR PAYPAL HOLDINGS, INC. INVESTORS</span></strong><strong class=\"mdc-article-strong\" data-v-479a2324=\"\"><span class=\"mdc-article-underline\" data-v-1f1bdc8a=\"\">:<br data-v-1f1bdc8a=\"\"/></span></strong>PayPal investors may, <strong class=\"mdc-article-strong\" data-v-479a2324=\"\"><em class=\"mdc-article-emphasis\" data-v-370fea16=\"\"><span class=\"mdc-article-underline\" data-v-1f1bdc8a=\"\">no later than April 20, 2026,</span></em></strong> seek to be appointed as a lead plaintiff representative of the class through <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4629592-1&amp;h=1099665259&amp;u=https%3A%2F%2Fwww.ktmc.com%2Fpypl-paypal-holdings-inc-class-action-lawsuit%3Futm_source%3DPR_Newswire%26utm_medium%3Dpressrelease%26utm_campaign%3Dpypl%26mktm%3DPR&amp;a=Kessler+Topaz+Meltzer+%26+Check%2C+LLP\" tabindex=\"0\">Kessler Topaz Meltzer &amp; Check, LLP</a> or other counsel, or may choose to do nothing and remain an absent class member. A lead plaintiff is a representative party who acts on behalf of all class members in directing the litigation. The lead plaintiff is usually the investor or small group of investors who have the largest financial interest and who are also adequate and typical of the proposed class of investors. The lead plaintiff selects counsel to represent the lead plaintiff and the class and these attorneys, if approved by the court, are lead or class counsel. Your ability to share in any recovery is not affected by the decision of whether or not to serve as a lead plaintiff.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span class=\"mdc-article-underline\" data-v-1f1bdc8a=\"\"><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4629592-1&amp;h=597220954&amp;u=https%3A%2F%2Fwww.ktmc.com%2F&amp;a=Kessler+Topaz+Meltzer+%26+Check%2C+LLP\" tabindex=\"0\">Kessler Topaz Meltzer &amp; Check, LLP</a></span> encourages PayPal investors to contact the firm for more information.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\"><span class=\"mdc-article-underline\" data-v-1f1bdc8a=\"\">ABOUT KESSLER TOPAZ MELTZER &amp; CHECK, LLP (KTMC): <br data-v-1f1bdc8a=\"\"/></span></strong>Kessler Topaz Meltzer &amp; Check, LLP (KTMC) is a leading U.S. plaintiff-side law firm focused on securities-<span data-v-602de5d2=\"\">fraud</span> class actions and global investor protection. The firm represents individual investors as well as institutions, such as major pension funds, asset managers, and international investors. KTMC has led some of the largest recoveries in securities litigation and has been recognized by peers and the legal media with numerous accolades, including The National Law Journal's Plaintiff's Hot List and Trailblazers in Plaintiffs' Law, BTI Consulting Group's Honor Roll of Most Feared Law Firms, The Legal Intelligencer's Class Action Firm of the Year, Lawdragon's Leading Plaintiff Financial Lawyers, and Law360's Titans of the Plaintiffs Bar. The firm operates globally with offices in Pennsylvania and California. KTMC has recovered over $25 billion for our clients and the classes they represent. For more information about Kessler Topaz Meltzer &amp; Check, LLP, please visit <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4629592-1&amp;h=3833159455&amp;u=http%3A%2F%2Fwww.ktmc.com%2F&amp;a=www.ktmc.com\" tabindex=\"0\">www.ktmc.com</a>. The complaint in this matter was not filed by KTMC.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">CONTACT:<br data-v-479a2324=\"\"/></strong>Jonathan Naji, Esq.<br data-v-602de5d2=\"\"/>(484) 270-1453<br data-v-602de5d2=\"\"/>280 King of Prussia Road<br data-v-602de5d2=\"\"/>Radnor, PA 19087<br data-v-602de5d2=\"\"/><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"mailto:info@ktmc.com\" tabindex=\"0\">info@ktmc.com</a> </p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">May be considered attorney advertising in certain jurisdictions. Past results do not guarantee future outcomes.</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img mdc-article-image__img--12-width\" data-v-f0ef0696=\"\" style=\"width:12px;\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://edge.prnewswire.com/c/img/favicon.png?sn=DC98139&amp;sd=2026-02-28\"/></picture></span> View original content to download multimedia:<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://www.prnewswire.com/news-releases/pypl-investor-alert-kessler-topaz-meltzer--check-llp-encourages-pypl-investors-with-losses-to-contact-the-firm-302699993.html\" tabindex=\"0\">https://www.prnewswire.com/news-releases/pypl-investor-alert-kessler-topaz-meltzer--check-llp-encourages-pypl-investors-with-losses-to-contact-the-firm-302699993.html</a></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">SOURCE Kessler Topaz Meltzer &amp; Check, LLP</p></span>\n</div>",
            "pub_date": "2026-03-01 03:31:00",
            "link": "https://www.morningstar.com/news/pr-newswire/20260228dc98139/pypl-investor-alert-kessler-topaz-meltzer-check-llp-encourages-pypl-investors-with-losses-to-contact-the-firm",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Why more CEOs are taking a page from Elon Musk and chatting directly with customers",
            "description": "<div class=\"mdc-article-body\">\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  By Charles Passy </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Executives say it's all about learning how to better run their businesses, but some corporate watchers question if this is just a PR move </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Elon Musk is just one of a number of chief executives and business leaders who sometimes connects directly with customers. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Have a complaint about a company? Or even a compliment to share? The chief executive is expecting your call. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     At least that's how some businesses are handling customer-service matters these days. Tom Curtis, president of Burger King's U.S. and Canada operations (QSR), recently announced that he's inviting customers to reach out to him and offer feedback. He's even posted a phone number - (305) 874-0520 - for all to give him a ring. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     There \"is a broader perception that large brands are not listening closely enough, and taking action based on feedback,\" Curtis said in a statement to MarketWatch. \"I see that as an opportunity. Listening to guests has always been part of how we operate, but this step makes that commitment more personal and visible.\" </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Curtis is in good company these days. You'll find there are a number of prominent executives who often connect with customers. Elon Musk has been known to respond via social media to complaints regarding his Tesla (TSLA) vehicles. Richard Branson, founder of the Virgin Group, has said he walks throughout Virgin planes \"asking for feedback from passengers and crew.\" </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Many corporate watchers expect the trend will continue, if not become bigger, as companies look for any way to appear more authentic and genuine - and grow their business as a result. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     \"CEOs are stepping in because they see an opportunity to break through ... by personally signaling a culture of commitment to customers' wants and needs,\" said G. Tomas M. Hult, a professor at Michigan State University and a business executive at the American Customer Satisfaction Index. Hult has also authored a Harvard Business Review paper looking at how CEOs respond to customers. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Some question whether these eager-to-connect executives are truly invested in their customers, or if they're just making it appear that way for the sake of publicity. Others wonder if a CEO may do more harm than good by effectively overriding the usual customer-service channels and protocols. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     And that's to say nothing of the obvious fact that a CEO simply doesn't have the time to deal with every customer complaint - or even more than a handful of them. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     It \"is not a scalable business model,\" Hult said. \"The real infrastructure of customer satisfaction depends on front-line customer service, sales and customer experience management personnel who are trained to handle these matters at volume.\" </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     'CEOs are stepping in because they see an opportunity to break through.'G. Tomas M. Hult, professor at Michigan State University and business executive at the American Customer Satisfaction Index </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Burger King's Curtis and other executives who spoke with MarketWatch say they're well aware that their efforts constitute just a drop in the proverbial bucket in terms of dealing with customer issues. But they also say these interactions can be critical to their business. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     \"Not every [customer] suggestion can or should be implemented, but identifying consistent patterns is incredibly valuable,\" said Curtis. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Executives are quick to cite instances when their findings from customer exchanges led to action. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Carina Radonich, co-owner and CEO of the Magic Moment Resort &amp; Kids Club in the Orlando, Fla., area, says it was during her regular conversations with guests that she learned people were frustrated with the limited schedule of the theme-park shuttle service. She also found that guests were disappointed that the resort's breakfast menu didn't vary from day to day. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     So Radonich made changes, adding more shuttle trips and switching up the morning food offerings, adding things like breakfast burritos and stuffed croissants. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     \"Small operational shifts like these drive higher guest satisfaction and repeat bookings,\" she said. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Sweetwater CEO Mike Clem adds a note to every shipment that goes out to customers. He also makes his email contact information readily available. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Not all such interactions with customers are tied to complaints. Mike Clem, the CEO of Sweetwater, a leading retailer of musical instruments, says about 80% of the comments he receives are positive. And Clem receives hundreds of comments a year, because he makes his email contact information readily available. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     The responses include Sweetwater customers sending Clem photos of their home studios. \"They send them to me like it's pictures of their kids,\" he said. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Even if a customer has a complaint, Clem says it's all about building a personal connection - and he insists it's those connections that have helped the 47-year-old business reach nearly $2 billion in annual sales. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     There may, however, be another motive for CEOs who offer customers a direct line. Earl Stewart, who owns a Toyota dealership in Lake Park, Fla., has red phones scattered throughout his busy operation - all of which enable customers to put in a call to him personally. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Stewart says that when his employees see a customer reaching for one of the phones, they often step in to see if they can resolve the issue themselves. In effect, the phones keep his staff mindful of customers - and that's what Stewart believes has helped his business win accolades and awards. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     But Stewart doesn't deny that the phones also help from a brand standpoint, announcing that his dealership is customer-centric all the way up to the top guy. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     \"It's big PR,\" said Stewart. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Time will tell if the Burger King exec's outreach is seen more as a publicity stunt, or if it's really about listening to customers and learning from them. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Jessica Kriegel, chief strategy partner at Culture Partners, a consulting firm that works with large organizations, says if an executive is truly trying to connect with customers, they don't necessarily have to announce it to the world. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     \"I'm more impressed with the CEOs that don't have press releases,\" she said. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     -Charles Passy </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     This content was created by MarketWatch, which is operated by Dow Jones &amp; Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal. </p>\n<pre class=\"mdc-article-pre\" data-v-370ea3ac=\"\"></pre>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  (END) Dow Jones Newswires</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  02-28-26 1408ET</p>\n\nCopyright (c) 2026 Dow Jones &amp; Company, Inc.</div>",
            "pub_date": "2026-03-01 03:25:53",
            "link": "https://www.morningstar.com/news/marketwatch/20260228193/why-more-ceos-are-taking-a-page-from-elon-musk-and-chatting-directly-with-customers",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "How boomers became the richest generation - and why Gen X, Gen Z and millennials may never catch up",
            "description": "<div class=\"mdc-article-body\">\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  By Alessandra Malito </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     There's never been a generation like the baby boomers - and there probably never will be again </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     For many members of the baby-boomer generation, personal finances have improved with time and asset appreciation. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Baby boomers seemed to have it easier than other generations: They benefited from the postwar economic boom, had access to affordable higher education and workplace pensions, and found success in real estate and the stock market - and then didn't share the wealth with subsequent generations. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     New research has found there's some truth to that narrative. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Boomers have been more financially comfortable than their predecessors during the same times of life, and if the trends continue, they'll be better off than at least one generation after them, too: Generation X. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     For many members of the baby-boomer generation, who were born between 1946 and 1964, their personal finances have improved with time and asset appreciation. Baby boomers, the oldest of whom are turning 80 this year, have watched home prices soar after getting into the housing market at young age. And while they've weathered market volatility and downturns, their investments have climbed through the decades. They're also more educated than their older counterparts, which lends itself to higher wages, experts note. And for them, higher education was cheaper: The average cost of tuition at a public college is up more than 300% since 1963. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     \"A few things worked in boomers' favor,\" said Richard Fry, senior researcher on the social and demographics trends team at Pew Research Center. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Read: The steep price of housing is forcing Americans to delay marriage, kids and other milestones </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     By the time the cohort had reached the ages of 58 to 76 in 2022, the median wealth of baby-boomer households was $432,200, compared with $335,900 for the Silent Generation in 2001, and $185,300 for the Greatest Generation before them in 1983, according to a recent Pew Research Center report that adjusted for inflation as of 2024. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Of course, some baby boomers are significantly better off than their peers; those with bachelor's degrees were wealthier than those with lower levels of education. The top 10% of baby-boomer households held almost three-quarters of the $77 trillion in wealth the generation holds, the research showed. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Still, even with more degrees under their belts, the generations younger than the baby boomers are still finding their footing as they plan for retirement. Americans' median retirement savings, when accounting just for people with any retirement savings, was $40,000, according to the National Institute of Retirement Security. When also factoring in American workers without retirement savings, the median amount is $955. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Though boomers' financial well-being blossomed over the decades, their children did not necessarily benefit as a result. Gen X might have it the hardest right now: The so-called slacker generation, born between 1965 and 1980, entered the labor force at a time when defined-benefit pensions began to dissolve and companies placed the responsibility of saving for old age on workers, with the advent of the 401(k). </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     They've also been caring for both aging loved ones and young or adult children who leave the nest later than the generations before them. Gen X-ers will be retiring around the same time Social Security's trust funds are expected to run out of money, at which point beneficiaries would see a roughly 20% cut to benefits if Congress does not act. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     \"Gen X is living in the perfect storm for their retirement and overall wealth building,\" said Catherine Collinson, CEO and president of Transamerica Institute and its Transamerica Center for Retirement Studies. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Millennials and Gen Z-ers, meanwhile, might have brighter futures. The younger the generation, the more likely they are to start preparing for retirement sooner. The median age when baby boomers started saving for retirement was 35, compared with 30 for Gen X, 25 for millennials and 20 for Gen Z, Collinson said. \"It offers them a greater time horizon for their savings to compound and grow,\" she noted. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Still, the future is uncertain, Pew's Fry said. Younger generations have attained higher levels of education than their older counterparts, but it's a guess as to how market volatility, home prices, wage growth and other economic aspects of society could evolve over the next few decades. While their overall better education should work in their favor, Fry said, \"it's hard to make predictions about assets and incomes.\" </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     -Alessandra Malito </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     This content was created by MarketWatch, which is operated by Dow Jones &amp; Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal. </p>\n<pre class=\"mdc-article-pre\" data-v-370ea3ac=\"\"></pre>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  (END) Dow Jones Newswires</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  02-28-26 1354ET</p>\n\nCopyright (c) 2026 Dow Jones &amp; Company, Inc.</div>",
            "pub_date": "2026-03-01 03:11:31",
            "link": "https://www.morningstar.com/news/marketwatch/20260228192/how-boomers-became-the-richest-generation-and-why-gen-x-gen-z-and-millennials-may-never-catch-up",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Trump calls for regime change after U.S.-Israel attack on Iran. Markets should brace for more than June's brief military campaign.",
            "description": "<div class=\"mdc-article-body\">\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  By Joy Wiltermuth and Barbara Kollmeyer </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     The next 24 to 48 hours of conflict will be crucial for markets after the U.S. and Israel launched military strikes against Iran </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     U.S. markets are on edge after the U.S. and Israel's attack on Iran prompted Tehran to respond with strikes in the Middle East. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     The U.S. and Israel attacked Iran, leading Tehran to quickly retaliate with strikes within Israel and elsewhere in the Middle East after President Donald Trump called on Iranians to take over their government. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Those developments have raised questions about whether this conflict will last longer - and risk sweeping up more oil-producing nations - than the brief U.S.-Israel military operation in June targeting Tehran's nuclear facilities. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     \"This is different,\" said Ali Meli, founder and chief investment officer at Monachil Capital Partners, in a Saturday interview with MarketWatch. \"There's a belief that this may be more aimed at regime change, beyond nuclear deterrence.\" </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     '[T]he question is if there will be a version of regime change like in Venezuela, or something more radical.'Ali Meli, Monachil Capital Partners </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     \"Now, the question is if there will be a version of regime change like in Venezuela, or something more radical,\" said Meli. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     What happens in the next 24 to 48 hours may provide clues to the potential scope of this conflict and its likely impact on markets, with Iran's oil infrastructure and the region's Strait of Hormuz, a critical oil chokepoint, now a major focus. That waterway connects the Persian Gulf with the Gulf of Oman and the Arabian Sea. There were reports Saturday of Iran threatening to limit passage through the waterway. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Oil (CL.1) (BRN00) prices jumped on Friday as traders began to sense strikes were nearing, as Trump suggested to reporters that the window for diplomacy with Iran could be closing. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     \"The brief June 2025 conflict is a poor guide to what is likely to follow,\" said Nick Redman, analyst at Oxford Analytica, a geopolitical risk-analysis and advisory service owned by MarketWatch publisher Dow Jones. \"Then, Iran sought to avoid confrontation because it understood U.S. objectives were limited, meaning that regional relations and wider international legitimacy were worth preserving.\" </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Now, however, Iran might look to \"hunker down or seek to draw out any conflict,\" according to Redman. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     European leaders from Britain, France and Germany issued a statement Saturday saying their countries had not taken part in the Iran strikes, but they added that they had been in close contact with the U.S., Israel and partners in the region. They called for a resumption of negotiations, the Associated Press reported. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     \"Clearly, there are more questions than answers in this first day of this,\" Ryan Detrick, chief market strategist at the Carson Group, told MarketWatch. \"But there are valid concerns that this could become a larger issue than in June.\" </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Detrick said he's bracing for near-term weakness in equities, a likely spike in crude oil and for gold and other safe-haven assets to rise. \"At the same time, the U.S. economy is still strong, and it's been a strong earnings season,\" he said, adding those factors as being a support for equity prices. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Brent crude (BRN00) prices, the global oil benchmark, could hit $100 a barrel because of the threat of \"a spiraling security situation\" and supply disruptions out of the Middle East, according to Barclays analysts. Prices were near $73 a barrel Friday. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Away from oil jitters, investors endured a violent rotation under the surface of the stock market in February, with investors looking for cover from artificial intelligence disruptions and cracks in credit. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     That could spell a difficult start to March for stocks, plus the \"black cloud overhead\" from the Iran conflict, said Detrick at the Carson Group. \"To think we are going to have a calm start to March probably isn't on anyone's bingo card.\" </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Should a longer, more complicated conflict unfold, the U.S. could tap its Strategic Petroleum Reserve in an effort to keep a lid on oil and gasoline prices. U.S. benchmark crude shot up to over $130 a barrel in 2022 after Russia's full-scale invasion of Ukraine. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     However, the U.S could look to quickly ramp up domestic production given its shale resources, and it also now exerts control over Venezuela's oil, Meli at Monachil Capital said. That may help keep crude prices in a range, he added. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Gold (GC00) jumped nearly 11% in February, finishing at $5,230.50 an ounce on Friday. That marked gold's biggest one-month percentage gain since January 2012, and its monthly gain of $516.60 was the biggest one-month net gain on record, according to Dow Jones Market Data. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Cryptocurrencies, which trade 24/7, offered the first glimpse at how investors might react as they wait for Asian markets to open on Sunday. Bitcoin (BTCUSD) was under pressure around $65,300. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     The S&amp;P 500 SPX and Nasdaq Composite COMP and Dow industrials DJIA closed lower Friday, but with the S&amp;P 500 less than 2% off record levels. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     The Japanese yen (USDJPY), Swiss franc (USDCHF) and U.S. Treasurys BX:TMUBMUSD10Y BX:TMUBMUSD30Ycould be in the outperformer category. Investors have been increasingly pushing into U.S. government debt recently, a move strategists have attributed to fears over AI threats to employment and economic growth. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Read: The bond market has been doing something strange despite a hot inflation report </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Trump, addressing Iranians in a video address, said, \"Now is the time to seize control of your destiny.\"  White House press secretary Karoline Leavitt indicated that congressional notification was provided before the attack, in a social-media post. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Trump last week offered a deadline of 10 to 15 days for a nuclear deal with Iran, which left this weekend as a possibility for a U.S. strike. Iran, with which the U.S. under President Barack Obama had negotiated a nuclear pact that Trump canceled during his first White House term, ranks among the world's biggest oil producers. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Myra P. Saefong contributed. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     -Joy Wiltermuth -Barbara Kollmeyer </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     This content was created by MarketWatch, which is operated by Dow Jones &amp; Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal. </p>\n<pre class=\"mdc-article-pre\" data-v-370ea3ac=\"\"></pre>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  (END) Dow Jones Newswires</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  02-28-26 1342ET</p>\n\nCopyright (c) 2026 Dow Jones &amp; Company, Inc.</div>",
            "pub_date": "2026-03-01 03:05:49",
            "link": "https://www.morningstar.com/news/marketwatch/20260228190/trump-calls-for-regime-change-after-us-israel-attack-on-iran-markets-should-brace-for-more-than-junes-brief-military-campaign",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Oracle Corporation Securities Fraud Class Action Lawsuit Filed by Kessler Topaz Meltzer & Check, LLP; April 6, 2026, Lead Plaintiff Deadline",
            "description": "<div class=\"mdc-article-body\">\n            \n              \n              Oracle Corporation Securities Fraud Class Action Lawsuit Filed by Kessler Topaz Meltzer &amp; Check, LLP; April 6, 2026, Lead Plaintiff Deadline\n              \n            \n            \n              <span>\n<h2 class=\"mdc-article-heading mdc-heading__mdc mdc-heading--level-5__mdc\" data-v-618d53ae=\"\">Oracle Corporation Securities Fraud Class Action Lawsuit Filed by Kessler Topaz Meltzer &amp; Check, LLP; April 6, 2026, Lead Plaintiff Deadline</h2>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">PR Newswire</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">RADNOR, Pa., Feb. 28, 2026</p>\n</span>\n<span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Did you buy ORCL common stock between June 12, 2025, and December 16, 2025?</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Affected Oracle Corporation</strong> <strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Investor Summary</strong></p><ul class=\"mdc-article-list mdc-article-list--unordered\" data-v-7b473e83=\"\"><li data-v-7b473e83=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Who</strong>: Oracle Corporation (<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4629579-1&amp;h=687848553&amp;u=https%3A%2F%2Fwww.benzinga.com%2Fquote%2FORCL&amp;a=NYSE%3A+ORCL\" tabindex=\"0\">NYSE: ORCL</a>)</li><li data-v-7b473e83=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">What:</strong> Securities <span data-v-7b473e83=\"\">fraud</span> class action lawsuit filed</li><li data-v-7b473e83=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Class Period:</strong> June 12, 2025, through December 16, 2025</li><li data-v-7b473e83=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Deadline to Seek Lead Plaintiff Status:</strong> April 6, 2026</li><li data-v-7b473e83=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Key Lawsuit Allegations:</strong> Material misstatements and/or omissions concerning the company's data center capabilities for artificial intelligence infrastructure and capital expenditures.</li><li data-v-7b473e83=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Investor Action:</strong> Contact Kessler Topaz Meltzer &amp; Check, LLP (<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4629579-1&amp;h=778636101&amp;u=http%3A%2F%2Fwww.ktmc.com%2F&amp;a=www.ktmc.com\" tabindex=\"0\">www.ktmc.com</a>) for recovery options at no cost to investor</li></ul><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span data-v-602de5d2=\"\">RADNOR, Pa.</span>, <span data-v-602de5d2=\"\">Feb. 28, 2026</span> /PRNewswire/ -- The law firm of <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4629579-1&amp;h=3648172002&amp;u=https%3A%2F%2Fwww.ktmc.com%2Forcl-oracle-corporation-class-action-lawsuit%3Futm_source%3DPR_Newswire%26utm_medium%3Dpressrelease%26utm_campaign%3Dorcl%26mktm%3DPR&amp;a=Kessler+Topaz+Meltzer+%26+Check%2C+LLP\" tabindex=\"0\">Kessler Topaz Meltzer &amp; Check, LLP</a> informs investors that the firm has filed a <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4629579-1&amp;h=164700613&amp;u=https%3A%2F%2Fwww.ktmc.com%2Fwebfiles%2FOracle%2520-%2520Complaint%2520and%2520Civil%2520Cover%2520Sheet.pdf&amp;a=securities+fraud+class+action+lawsuit\" tabindex=\"0\">securities <span>fraud</span> class action lawsuit</a> against Oracle Corporation (<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4629579-1&amp;h=687848553&amp;u=https%3A%2F%2Fwww.benzinga.com%2Fquote%2FORCL&amp;a=NYSE%3A+ORCL\" tabindex=\"0\">NYSE: ORCL</a>) (Oracle) on behalf of investors who purchased or acquired Oracle common stock between June 12, 2025, and December 16, 2025, inclusive (the Class Period). This action, captioned <em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">Barrows v. Oracle Corporation, et al.</em>, Case No. 1:26-cv-00127-JLH, was filed on February 3, 2026, in the United States District Court for the District of Delaware and is pending before the Honorable Jennifer L. Hall. </p>\n<span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://mma.prnewswire.com/media/2476890/Kessler_Topaz_Meltzer_and_Check__Logo.html\" tabindex=\"0\">\n<span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img\" data-v-f0ef0696=\"\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://mma.prnewswire.com/media/2476890/Kessler_Topaz_Meltzer_and_Check__Logo.jpg\"/></picture></span>\n</a>\n</p>\n</span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\"><em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">Important Deadline Reminder: Investors who purchased or otherwise acquired Oracle common stock during the Class Period may, no later than April 6, 2026, move the Court to serve as lead plaintiff for the class.</em></strong> </p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\"><span class=\"mdc-article-underline\" data-v-1f1bdc8a=\"\">CONTACT KTMC TO DISCUSS YOUR LEGAL RIGHTS: </span></strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">If you purchased or acquired Oracle common stock and lost money on your investment, you are encouraged to contact KTMC attorney Jonathan Naji, Esq. at:</p><ul class=\"mdc-article-list mdc-article-list--unordered\" data-v-7b473e83=\"\"><li data-v-7b473e83=\"\">(484) 270-1453</li><li data-v-7b473e83=\"\"><span>info@ktmc.com</span></li><li data-v-7b473e83=\"\"><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4629579-1&amp;h=188789145&amp;u=https%3A%2F%2Fwww.ktmc.com%2Forcl-oracle-corporation-class-action-lawsuit%3Futm_source%3DPR_Newswire%26utm_medium%3Dpressrelease%26utm_campaign%3Dorcl%26mktm%3DPR&amp;a=https%3A%2F%2Fwww.ktmc.com%2Forcl-oracle-corporation-class-action-lawsuit%3Futm_source%3DPR_Newswire%26utm_medium%3Dpressrelease%26utm_campaign%3Dorcl%26mktm%3DPR\" tabindex=\"0\">https://www.ktmc.com/orcl-oracle-corporation-class-action-lawsuit?utm_source=PR_Newswire&amp;utm_medium=pressrelease&amp;utm_campaign=orcl&amp;mktm=PR</a> </li></ul><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">There is no cost or obligation to speak with an attorney.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Learn more about Oracle Corporation on YouTube: </strong></p><ul class=\"mdc-article-list mdc-article-list--unordered\" data-v-7b473e83=\"\"><li data-v-7b473e83=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\"><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4629579-1&amp;h=1544574235&amp;u=https%3A%2F%2Fyoutu.be%2FO0iS53tatdA&amp;a=Oracle+Corporation+Securities+Class+Action+Lawsuit+(long+video)\" tabindex=\"0\">Oracle Corporation Securities Class Action Lawsuit (long video)</a></strong></li><li data-v-7b473e83=\"\"><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4629579-1&amp;h=2306865213&amp;u=https%3A%2F%2Fyoutube.com%2Fshorts%2FJzYeY2P1rDk%3Ffeature%3Dshare&amp;a=Oracle+Corporation+Securities+Class+Action+Lawsuit+(short+video)\" tabindex=\"0\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Oracle Corporation Securities Class Action Lawsuit (short video)</strong></a></li></ul><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\"><span class=\"mdc-article-underline\" data-v-1f1bdc8a=\"\">ORACLE CORPORATION</span></strong><span class=\"mdc-article-underline\" data-v-1f1bdc8a=\"\"> <strong class=\"mdc-article-strong\" data-v-479a2324=\"\">CLASS ACTION LAWSUIT - COMPLAINT ALLEGATION SUMMARY:</strong> </span></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Oracle, a Delaware corporation with its principal executive offices in Austin, Texas, is a technology company that provides, among other things, infrastructure for operating artificial intelligence (AI) programs. During the Class Period, Defendants misled investors by touting the Oracle's contracts to develop data center capabilities for AI infrastructure and falsely assuring investors that the Company's significant capital expenditures (CapEx) would quickly result in accelerated revenue growth. </p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">The complaint <span data-v-602de5d2=\"\">alleges</span> that, throughout the Class Period, Defendants made materially false and/or misleading statements, as well as failed to disclose material adverse facts, about Oracle's business and operations. Specifically, Defendants misrepresented and/or failed to disclose that: (1) Oracle's AI infrastructure strategy would result in massive increases in CapEx without equivalent, near-term growth in revenue; (2) Oracle's substantially increased spending created serious risks involving Oracle's debt and credit rating, free cash flow, and ability to fund its projects, among other concerns; and (3) as a result, Defendants' representations about Oracle's business, operations, and prospects were materially false and misleading and/or lacked a reasonable basis.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Why did Oracle's Stock Drop?<br data-v-479a2324=\"\"/></strong>The truth began to be revealed on September 24, 2025, when S&amp;P Global Ratings warned that OpenAI \"could account for more than a third of total Oracle revenues by fiscal 2028 and even a greater share by fiscal 2030,\" creating risks given that \"OpenAI's ability to meet contractual obligations will be contingent on AI tailwinds continuing and its models being a market leader to continue to raise external financing.\" On this news, the price of Oracle common stock declined $5.37 per share, or nearly 2%, from a close of $313.83 per share on September 23, 2025, to close at $308.46 per share on September 24, 2025.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Oracle's stock price continued to fall in response to multiple additional disclosures, the last of which was on December 17, 2025, when the <em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">Financial Times</em> reported that Blue Owl Capital—\"the primary [financial] backer for Oracle's largest data centre projects in the US\"—had backed out of funding a $10 billion Oracle data center intended to serve OpenAI. According to the report, Blue Owl pulled out of the deal as a result of concerns about Oracle's spending commitments and rising debt levels. On this news, the price of Oracle common stock declined $10.19 per share, or approximately 5.4%, from a close of $188.65 per share on December 16, 2025, to close at $178.46 per share on December 17, 2025.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\"><span class=\"mdc-article-underline\" data-v-1f1bdc8a=\"\">WHAT ORCL INVESTORS CAN DO NOW:</span></strong></p><ol class=\"mdc-article-list mdc-article-list--ordered\" data-v-7b473e83=\"\"><li data-v-7b473e83=\"\">File to be lead plaintiff by April 6, 2026.</li><li data-v-7b473e83=\"\">Contact KTMC for a free case evaluation.</li><li data-v-7b473e83=\"\">Retain counsel of choice or take no action.</li></ol><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\"><span class=\"mdc-article-underline\" data-v-1f1bdc8a=\"\">THE LEAD PLAINTIFF PROCESS FOR ORACLE CORPORATION INVESTORS</span></strong><strong class=\"mdc-article-strong\" data-v-479a2324=\"\"><span class=\"mdc-article-underline\" data-v-1f1bdc8a=\"\">:<br data-v-1f1bdc8a=\"\"/></span></strong>Oracle investors may, <strong class=\"mdc-article-strong\" data-v-479a2324=\"\"><em class=\"mdc-article-emphasis\" data-v-370fea16=\"\"><span class=\"mdc-article-underline\" data-v-1f1bdc8a=\"\">no later than April 6, 2026,</span></em></strong> seek to be appointed as a lead plaintiff representative of the class through <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4629579-1&amp;h=3648172002&amp;u=https%3A%2F%2Fwww.ktmc.com%2Forcl-oracle-corporation-class-action-lawsuit%3Futm_source%3DPR_Newswire%26utm_medium%3Dpressrelease%26utm_campaign%3Dorcl%26mktm%3DPR&amp;a=Kessler+Topaz+Meltzer+%26+Check%2C+LLP\" tabindex=\"0\">Kessler Topaz Meltzer &amp; Check, LLP</a> or other counsel, or may choose to do nothing and remain an absent class member. A lead plaintiff is a representative party who acts on behalf of all class members in directing the litigation. The lead plaintiff is usually the investor or small group of investors who have the largest financial interest and who are also adequate and typical of the proposed class of investors. The lead plaintiff selects counsel to represent the lead plaintiff and the class and these attorneys, if approved by the court, are lead or class counsel. Your ability to share in any recovery is not affected by the decision of whether or not to serve as a lead plaintiff.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span class=\"mdc-article-underline\" data-v-1f1bdc8a=\"\"><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4629579-1&amp;h=3918039552&amp;u=https%3A%2F%2Fwww.ktmc.com%2F&amp;a=Kessler+Topaz+Meltzer+%26+Check%2C+LLP\" tabindex=\"0\">Kessler Topaz Meltzer &amp; Check, LLP</a></span> encourages Oracle investors to contact the firm for more information.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\"><span class=\"mdc-article-underline\" data-v-1f1bdc8a=\"\">ABOUT KESSLER TOPAZ MELTZER &amp; CHECK, LLP (KTMC):<br data-v-1f1bdc8a=\"\"/></span></strong>Kessler Topaz Meltzer &amp; Check, LLP (KTMC) is a leading U.S. plaintiff-side law firm focused on securities-<span data-v-602de5d2=\"\">fraud</span> class actions and global investor protection. The firm represents individual investors as well as institutions, such as major pension funds, asset managers, and international investors. KTMC has led some of the largest recoveries in securities litigation and has been recognized by peers and the legal media with numerous accolades, including The National Law Journal's Plaintiff's Hot List and Trailblazers in Plaintiffs' Law, BTI Consulting Group's Honor Roll of Most Feared Law Firms, The Legal Intelligencer's Class Action Firm of the Year, Lawdragon's Leading Plaintiff Financial Lawyers, and Law360's Titans of the Plaintiffs Bar. The firm operates globally with offices in Pennsylvania and California. KTMC has recovered over $25 billion for our clients and the classes they represent. For more information about Kessler Topaz Meltzer &amp; Check, LLP, please visit <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4629579-1&amp;h=778636101&amp;u=http%3A%2F%2Fwww.ktmc.com%2F&amp;a=www.ktmc.com\" tabindex=\"0\">www.ktmc.com</a>. The complaint in this matter was filed by KTMC.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">CONTACT:<br data-v-479a2324=\"\"/></strong>Jonathan Naji, Esq.<br data-v-602de5d2=\"\"/>(484) 270-1453<br data-v-602de5d2=\"\"/>280 King of Prussia Road<br data-v-602de5d2=\"\"/>Radnor, PA 19087<br data-v-602de5d2=\"\"/><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"mailto:info@ktmc.com\" tabindex=\"0\">info@ktmc.com</a> </p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">May be considered attorney advertising in certain jurisdictions. Past results do not guarantee future outcomes.</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img mdc-article-image__img--12-width\" data-v-f0ef0696=\"\" style=\"width:12px;\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://edge.prnewswire.com/c/img/favicon.png?sn=DC98125&amp;sd=2026-02-28\"/></picture></span> View original content to download multimedia:<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://www.prnewswire.com/news-releases/oracle-corporation-securities-fraud-class-action-lawsuit-filed-by-kessler-topaz-meltzer--check-llp-april-6-2026-lead-plaintiff-deadline-302699988.html\" tabindex=\"0\">https://www.prnewswire.com/news-releases/oracle-corporation-securities-fraud-class-action-lawsuit-filed-by-kessler-topaz-meltzer--check-llp-april-6-2026-lead-plaintiff-deadline-302699988.html</a></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">SOURCE Kessler Topaz Meltzer &amp; Check, LLP</p></span>\n<span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img\" data-v-f0ef0696=\"\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://rt.prnewswire.com/rt.gif?NewsItemId=DC98125&amp;Transmission_Id=202602281311PR_NEWS_USPR_____DC98125&amp;DateId=20260228\"/></picture></span>\n</div>",
            "pub_date": "2026-03-01 02:25:55",
            "link": "https://www.morningstar.com/news/pr-newswire/20260228dc98125/oracle-corporation-securities-fraud-class-action-lawsuit-filed-by-kessler-topaz-meltzer-check-llp-april-6-2026-lead-plaintiff-deadline",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        }
    ]
}