{
    "data": [
        {
            "title": "U.S.-Iran nuclear talks end, but with hope that negotiations continue. That still leaves the oil market in limbo.",
            "description": "<div class=\"mdc-article-body\">\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  By Myra P. Saefong </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Oman's foreign minister, a meditator of the U.S.-Iran talks, indicated Thursday that the two sides had made progress and would resume negotiations at another time </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     The U.S. and Iran wrapped up Thursday's negotiations after \"significant progress,\" Oman's foreign minister posted on social media. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Growing tensions between the U.S. and Iran have kept the oil market on edge for much of this year, as President Donald Trump threatened military action if the two nations failed to reach a deal to put an end to Tehran's nuclear ambitions. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Nuclear talks on Thursday were expected to ease much of the uncertainty surrounding those tensions. The talks apparently ended \"after significant progress\" in negotiations, said Badr Albusaidi, Oman's foreign minister, in a post on X. Oman mediated the negotiations in Geneva. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Albusaidi offered no details on those negotiations, but said in his post that talks would resume after \"consultation in the respective capitals.\" He also said discussions on a \"technical level\" would take place next week in Vienna. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     The White House didn't immediately respond to an emailed request from MarketWatch for details on the outcome of Thursday's negotiations. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     The news left oil prices slightly lower on Thursday, with April West Texas Intermediate crude (CLJ26) (CL.1) down 0.3% to settle at $65.21 a barrel, and April Brent crude (BRNJ26) at $70.75, down 0.1% for the session. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     \"Geopolitics will drive the market in the short term, with prices rising and falling based on talks and then likely military actions,\" said Matt Gertken, chief geopolitical strategist at BCA Research. \"Only after there is a diplomatic or military resolution will fundamentals reassert themselves.\" </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Following Thursday's talks, \"there may only be one more chance for diplomacy to avoid a military confrontation next week,\" Gertken told MarketWatch. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     \"If Iran is not willing to renounce all uranium enrichment on its soil permanently, then the U.S. will likely take another round of military action against Iran's nuclear and ballistic missile programs,\" he said. Last June, during the Israel-Iran war, the U.S. military attacked three Iranian nuclear facilities. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Gertken suggested that the March 2-6 meeting of the International Atomic Energy Agency, and potential secret talks in the aftermath, may be the last opportunity for Iran to \"capitulate prior to the U.S. taking military action.\" </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Trump has said that U.S. military has amassed an armada of warships and fighter jets near Iran. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Oil may see active buying until Trump's deadline of March 6, said Gertken. That's when Trump has said he expects to decide his next move on Iran. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Robert Schroeder contributed. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     -Myra P. Saefong </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     This content was created by MarketWatch, which is operated by Dow Jones &amp; Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal. </p>\n<pre class=\"mdc-article-pre\" data-v-370ea3ac=\"\"></pre>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  (END) Dow Jones Newswires</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  02-26-26 1656ET</p>\n\nCopyright (c) 2026 Dow Jones &amp; Company, Inc.</div>",
            "pub_date": "2026-02-27 06:05:46",
            "link": "https://www.morningstar.com/news/marketwatch/20260226372/us-iran-nuclear-talks-end-but-with-hope-that-negotiations-continue-that-still-leaves-the-oil-market-in-limbo",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Green Bridge Metals Completes Re-Sampling of Historical Core Assay and Geophysics Data for Skibo Prospect",
            "description": "<div class=\"mdc-article-body\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">VANCOUVER, BC / <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://www.accessnewswire.com/\" tabindex=\"0\">ACCESS Newswire</a> / February 26, 2026 / </strong>Green Bridge Metals Corporation (CSE:<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">GRBM)(</strong>OTCQB:<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">GBMCF)(</strong>FWB:<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">J48</strong>, WKN: <strong class=\"mdc-article-strong\" data-v-479a2324=\"\">A3EW4S</strong>) (\"<strong class=\"mdc-article-strong\" data-v-479a2324=\"\"> Green Bridge</strong> \" or the \"<strong class=\"mdc-article-strong\" data-v-479a2324=\"\"> Company</strong> \") is pleased to announce that it has completed re-sampling work in respect of historical core assay and geophysics data for its Skibo Prospect (\"<strong class=\"mdc-article-strong\" data-v-479a2324=\"\"> Skibo</strong> \" or \"<strong class=\"mdc-article-strong\" data-v-479a2324=\"\"> Project</strong> \"), located within the South Contact District, Duluth Complex, Minnesota (Figure 1). These new datum support the definition of a coherent magmatic copper (Cu)-nickel (Ni)-platinum group metal (PGM) system that appears spatially associated with electromagnetic conductors - observations which strengthen the Company's geological targeting framework for future work (Figure 2).</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Key Highlights</strong></p><ul class=\"mdc-article-list mdc-article-list--unordered\" data-v-7b473e83=\"\"><li data-v-7b473e83=\"\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Disseminated Cu-Ni-PGM mineralization identified over intervals exceeding 200-400 metres in multiple historic holes</p></li><li data-v-7b473e83=\"\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">High-grade massive and semi-massive sulfide intercepts spatially associated with mapped electromagnetic conductors</p></li><li data-v-7b473e83=\"\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Conductive anomalies interpreted to extend between two historic drill clusters, supporting potential system continuity</p></li><li data-v-7b473e83=\"\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Integrated geological and geophysical model establishes a repeatable targeting framework for future drilling</p></li><li data-v-7b473e83=\"\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Geological model enhanced through low-cost historic core sampling program (&lt; US$180,000)</p></li></ul><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Integrated Results Indicate Potential for a Coherent Mineralized System</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">The presence of massive and semi-massive Cu-Ni-PGM intervals at Skibo has been indicated by the resampling program of historical drill core. The goal of this program was to target unsampled intervals above and below historical assay intervals that report high-grade zones. Sampling of the historical drill core is expected to allow the Company to evaluate whether disseminated mineralization halos exist and to assess their spatial relationship to mapped electromagnetic conductors.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Results from the re-sampling work confirmed that massive sulfide veins occur within broader disseminated halos extending over substantial downhole lengths (Table 1). The highest-grade intercepts are spatially associated with mapped electromagnetic conductors, supporting the interpretation that these conductors represent mineralized sulfide trends rather than isolated occurrences. The Table of results shown below reflects significant intervals of mineralization in the core that integrates both the historical assay results with the new assay intervals completed by the Company (Table 2). This reflects a more complete picture of the extent and tenor of mineralization the historical drillhole dataset. For reports of the historical drill hole and assay data please see the Company's Technical Report titled, \"Technical Report and Mineral Resource Estimate for the South Contact Zone Project, St Louis County, Minnesota, USA\" with an effective date of September 18, 2024.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Geophysical Targeting</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">The relationship between mineralization and electromagnetic conductors establishes a repeatable, data-supported targeting methodology for future drill programs. Historical drill holes that are observed to have strong Cu-Ni-PGM mineralization are spatially correlated with mapped electromagnetic conductors (show as red lines on Figure 2). Where historical drill holes were observed to have modest Cu-Ni-PGMM mineralization, they are not spatially coincident with the electromagnetic conductors. Future exploration plans will focus on testing electromagnetic conductor trends and step-out targets between and beyond historic core holes.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">District Context</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Mineralization at Skibo occurs along the basal contact of the Duluth Complex, a geological setting that hosts several copper-nickel deposits in Minnesota. While exploration at Skibo remains at an early stage, the style of mineralization, presence of thick disseminated halos, and association with geophysical conductors are consistent with magmatic sulfide systems elsewhere in the district.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">CEO Commentary</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\"<em class=\"mdc-article-emphasis\" data-v-370fea16=\"\"> These early results are encouraging and advance our understanding of Skibo,</em> \" said David Suda, President and CEO of Green Bridge Metals. <em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">This gives us a clear and disciplined path for further exploration. Skibo is emerging as a serious opportunity within our district portfolio.</em> \"</p><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://app.accessnewswire.com/imagelibrary/4c26732b-9dcc-45fd-971b-1cd03f00d65d/1142002/first-image-in-pr.png?v=1\" tabindex=\"0\"><span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img\" data-v-f0ef0696=\"\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://app.accessnewswire.com/imagelibrary/4c26732b-9dcc-45fd-971b-1cd03f00d65d/1142002/first-image-in-pr.png?v=1\"/></picture></span></a>Figure 1. Map showing the location of the South Contact District properties, including Skibo.<span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><span></span><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://app.accessnewswire.com/imagelibrary/4b21486f-771b-450d-acf5-fa8b8caaa19b/1142002/second-photo-for-the-pr.png\" tabindex=\"0\"><span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img\" data-v-f0ef0696=\"\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://app.accessnewswire.com/imagelibrary/4b21486f-771b-450d-acf5-fa8b8caaa19b/1142002/second-photo-for-the-pr.png\"/></picture></span></a>Figure 2. Geological map at Skibo with surface projected geophysical anomalies (red lines) and historically drilled diamond core holes (black circles) locations of those presented here. Those holes with <strong class=\"mdc-article-strong\" data-v-479a2324=\"\">bold </strong>text denote those with intercepts at or near 1% copper. Other holes contain disseminated mineralization.<span></span><span></span><span></span><span></span><span></span><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://app.accessnewswire.com/imagelibrary/bf3f5639-463e-4579-acb2-515258a6554d/1142002/table-1.png\" tabindex=\"0\"><span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img\" data-v-f0ef0696=\"\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://app.accessnewswire.com/imagelibrary/bf3f5639-463e-4579-acb2-515258a6554d/1142002/table-1.png\"/></picture></span></a><span></span><span></span><span></span><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://app.accessnewswire.com/imagelibrary/ef47a5c0-1248-4330-a55c-d2b5d5e79e5c/1142002/table-2.png\" tabindex=\"0\"><span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img\" data-v-f0ef0696=\"\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://app.accessnewswire.com/imagelibrary/ef47a5c0-1248-4330-a55c-d2b5d5e79e5c/1142002/table-2.png\"/></picture></span></a><span></span><span></span><span></span><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Quality Assurance and Quality Control</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Please see the technical report entitled \"Technical Report and Mineral resource Estimate for the South Contact Zone Project, St Louis County, Minnesota, USA\" with an effective date of September 18, 2024 prepared by independent \"Qualified Persons\" (as that term is defined in National Instrument 43-101 (\"NI 43-101\") Michael B Dufresne (P. Geol, P. Geo), Andrew J Turner (P. Geol, P. Geo), Fallon T Clarke (P.Geo), Christian Bohm (P.Geo)) for all historical assay information as well as information on the QA/QC, data verification, analytical and testing procedures at the Skibo prospect, part of the South Contact Zone Project. The laboratory used for all historical data presented herein is ALS Minerals, which is independent of the Company. The laboratory used for all new assay data herein is Activation Labs, which is independent of the Company.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Green Bridge Metals exploration samples were collected following industry standards and best practices. All new samples were submitted to Activation Labs in Thunder Bay, Ontario for geochemical analysis. The analyses used in this analytical program include; fire assay with ICP-OES analysis for gold and platinum group metals, sodium peroxide fusion analysis with analysis by ICP-OES was used to report all trace elements, and chemical composition was analyzed using a Lithium Metaborate fused disc with analysis by XRF.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Lengths are drill intersections and not necessarily true widths. True widths cannot be consistently calculated for comparison purposes between holes because of the irregular shapes of the mineralized zones. The geological interpretations in this news release are solely those of the Company. The locations and distances highlighted on all maps in this news release are approximate.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Ajeet Milliard, Chief Geologist at Green Bridge Metals and a Qualified Person within the meaning of NI 43-101 is satisfied that the analytical and testing procedures used are standard industry operating procedures and methodologies, and has reviewed, approved and verified the technical information disclosed in this news release, including sampling, analytical and test data underlying the technical information.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">About Green Bridge Metals Corporation</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Green Bridge Metals Corporation is advancing critical mineral assets in North America, with a focus on the Duluth Complex's South Contact Zone. The Company's projects target copper, nickel, PGMs, cobalt, and titanium to support global electrification and infrastructure needs.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">For more information, visit <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://pr.report/j3v4\" tabindex=\"0\">www.greenbridgemetals.com</a> or contact:<br data-v-602de5d2=\"\"/>David Suda President and CEO<br data-v-602de5d2=\"\"/>Tel: +1 (604) 928-2967<br data-v-602de5d2=\"\"/>Email: <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"mailto:david@greenbridgemetals.com\" tabindex=\"0\">david@greenbridgemetals.com</a></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Forward-Looking Information</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Certain statements and information herein, including all statements that are not historical facts, contain forward-looking statements and forward-looking information within the meaning of applicable securities laws. Although management of the Company believe that the assumptions made and the expectations represented by such statements or information are reasonable, there can be no assurance that forward-looking statements or information herein will prove to be accurate. Forward-looking statements in this news release include statements about: the Company's ability to complete its proposed exploration and other work programs; its ability to obtain required permits and regulatory approvals; the proposed scope and timing of exploration activities; and the development of its properties. Forward-looking statements and information by their nature are based on assumptions and involve known and unknown risks, uncertainties and other factors which may cause actual results, performance or achievements, or industry results, to be materially different from any future results, performance or achievements expressed or implied by such forward-looking statements or information. These risk factors include, but are not limited to: locating mineral deposits is inherently risky; the exploration and development of the Company's mineral properties may not result in any commercially successful outcome for the Company; risks associated with the business of the Company; business and economic conditions in the mining industry generally; changes in general economic conditions or conditions in the financial markets certain statements and information herein, including all statements that are not historical facts, contain forward-looking statements and forward-looking information within the meaning of applicable securities laws. Although management of the Company believe that the assumptions made and the expectations represented by such statements or information are reasonable, there can be no assurance that forward-looking statements or information herein will prove to be accurate. Forward-looking statements in this news release include statements about: the Company's ability to complete its proposed exploration and other work programs; its ability to obtain required permits and regulatory approvals; the proposed scope and timing of exploration activities; and the development of its properties. Forward-looking statements and information by their nature are based on assumptions and involve known and unknown risks, uncertainties and other factors which may cause actual results, performance or achievements, or industry results, to be materially different from any future results, performance or achievements expressed or implied by such forward-looking statements or information. These risk factors include, but are not limited to: locating mineral deposits is inherently risky; the exploration and development of the Company's mineral properties may not result in any commercially successful outcome for the Company; risks associated with the business of the Company; business and economic conditions in the mining industry generally; changes in general economic conditions or conditions in the financial markets; changes in laws (including regulations respecting mining concessions); and other risk factors as detailed from time to time.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">The Company does not undertake to update any forward-looking information, except in accordance with applicable securities laws. Investors should not attribute undue certainty or place undue reliance on forward looking statements. Investors are urged to consider closely the disclosures in Green Bridge's annual and quarterly reports and other public filings, available at <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://pr.report/j3r7\" tabindex=\"0\">www.sedarplus.ca</a>.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Certain figures and references contain information supported by public and corporate references that may have been updated, changed, or modified since their referenced date.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">The Canadian Securities Exchange has not reviewed and does not accept responsibility for the adequacy or accuracy of this news release.</em></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">SOURCE: </strong>Green Bridge Metals Corporation</p><br/><br/>View the original <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://www.accessnewswire.com/newsroom/en/metals-and-mining/green-bridge-metals-completes-re-sampling-of-historical-core-assay-and-geophysics-1142002\" tabindex=\"0\">press release</a> on ACCESS Newswire<br/><br/>\n<span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img mdc-article-image__img--0-width\" data-v-f0ef0696=\"\" style=\"width:0;\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://app.accessnewswire.com/img.ashx?id=1142002\"/></picture></span></div>",
            "pub_date": "2026-02-27 06:05:45",
            "link": "https://www.morningstar.com/news/accesswire/1142002msn/green-bridge-metals-completes-re-sampling-of-historical-core-assay-and-geophysics-data-for-skibo-prospect",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "GLOBE LIFE INC. DECLARES DIVIDEND AND ANNOUNCES APPOINTMENT OF TWO NEW BOARD MEMBERS",
            "description": "<div class=\"mdc-article-body\">\n            \n              \n              GLOBE LIFE INC. DECLARES DIVIDEND AND ANNOUNCES APPOINTMENT OF TWO NEW BOARD MEMBERS\n              \n            \n            \n              <span>\n<h2 class=\"mdc-article-heading mdc-heading__mdc mdc-heading--level-5__mdc\" data-v-618d53ae=\"\">GLOBE LIFE INC. DECLARES DIVIDEND AND ANNOUNCES APPOINTMENT OF TWO NEW BOARD MEMBERS</h2>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">PR Newswire</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">MCKINNEY, Texas, Feb. 26, 2026</p>\n</span>\n<span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span data-v-602de5d2=\"\">MCKINNEY, Texas</span>, <span data-v-602de5d2=\"\">Feb. 26, 2026</span> /PRNewswire/ -- Globe Life Inc. (NYSE: GL) announced that its Board of Directors has raised the quarterly dividend to $0.3300 per share on all of the outstanding common stock of the Company held of record as of close of business of the Company's transfer agent on April 3, 2026. The dividend will be paid on May 1, 2026.</p>\n<span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://mma.prnewswire.com/media/784039/Globe_Life_New_Logo.html\" tabindex=\"0\">\n<span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img\" data-v-f0ef0696=\"\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://mma.prnewswire.com/media/784039/Globe_Life_New_Logo.jpg\"/></picture></span>\n</a>\n</p>\n</span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Globe Life Inc. also announced today that Derek T. Kan, Vice President of Business Operations, Shopify, Inc., and Sandra L. Phillips, Senior Vice President Enterprise Integrity, Chief Legal Officer, Corporate Secretary and Chief Sustainability Officer, Toyota Motor North America Inc., were appointed as members of Globe Life's Board of Directors on February 25, 2026.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Kan brings to the Board valuable experience in the area of innovation and the implementation of new technologies through his time spent at Shopify Inc., a global e-commerce technology company, and as the former Chief Business Officer of Deliverr, Inc., an e-commerce fulfillment company. His service as Vice Chairman of the United States Postal Service Board of Governors together with his prior senior roles at the White House Office of Management and Budget and the United States Department of Transportation provide the Board with a unique perspective on financial oversight and regulatory matters. He also serves on the Board of Directors of Toll Brothers, Inc. (NYSE: TOL). Mr. Kan holds a B.S. in Business Administration from the University of Southern California, an M.S. from the London School of Economics, and an M.B.A. from Stanford Graduate School of Business.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Phillips provides the Board with strong expertise in legal, regulatory and operational matters with over 30 years of experience in the legal field, including more than a decade serving as General Counsel and Chief Legal Officer of Toyota Motor North America Inc. (\"TMNA\") and as a former Partner at several highly-regarded law firms. Through her various senior leadership roles at TMNA, she has gained expertise overseeing compliance, governance and enterprise risk functions that will enhance the Board's capabilities and inform its consideration of regulatory and operational risk. She also serves on the Board of Directors of MSA Safety Inc. (NYSE: MSA). Ms. Phillips holds a Bachelor of Journalism degree from the University of Texas at Austin and a Juris Doctor degree from the University of Texas School of Law.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Globe Life Inc. is a holding company specializing in life and supplemental health insurance for the middle-income market distributed through multiple channels, including direct to consumer and exclusive and independent agencies.</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img mdc-article-image__img--12-width\" data-v-f0ef0696=\"\" style=\"width:12px;\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://edge.prnewswire.com/c/img/favicon.png?sn=DA97286&amp;sd=2026-02-26\"/></picture></span> View original content to download multimedia:<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://www.prnewswire.com/news-releases/globe-life-inc-declares-dividend-and-announces-appointment-of-two-new-board-members-302699044.html\" tabindex=\"0\">https://www.prnewswire.com/news-releases/globe-life-inc-declares-dividend-and-announces-appointment-of-two-new-board-members-302699044.html</a></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">SOURCE Globe Life Inc.</p></span>\n<span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img\" data-v-f0ef0696=\"\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://rt.prnewswire.com/rt.gif?NewsItemId=DA97286&amp;Transmission_Id=202602261646PR_NEWS_USPR_____DA97286&amp;DateId=20260226\"/></picture></span>\n</div>",
            "pub_date": "2026-02-27 05:56:31",
            "link": "https://www.morningstar.com/news/pr-newswire/20260226da97286/globe-life-inc-declares-dividend-and-announces-appointment-of-two-new-board-members",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Monkee's of Kiawah Brings Elevated Style and Personalized Service to the Island",
            "description": "<div class=\"mdc-article-body\">\n            \n              \n              Monkee's of Kiawah Brings Elevated Style and Personalized Service to the Island\n              \n            \n            \n              <span>\n<h2 class=\"mdc-article-heading mdc-heading__mdc mdc-heading--level-5__mdc\" data-v-618d53ae=\"\">Monkee's of Kiawah Brings Elevated Style and Personalized Service to the Island</h2>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">PR Newswire</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">KIAWAH ISLAND, S.C., Feb. 26, 2026</p>\n</span>\n<span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span data-v-602de5d2=\"\">KIAWAH ISLAND, S.C.</span>, <span data-v-602de5d2=\"\">Feb. 26, 2026</span> /PRNewswire/ -- Monkee's Franchising, LLC is proud to announce the opening of its newest location, Monkee's of Kiawah, owned by Debbie Creasy. The boutique introduces a thoughtfully curated shopping experience to the Kiawah Island community, blending elevated style with warm, personalized service.</p>\n<span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://mma.prnewswire.com/media/2921697/Monkees_CreaseyFamily.html\" tabindex=\"0\">\n<span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img\" data-v-f0ef0696=\"\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://mma.prnewswire.com/media/2921697/Monkees_CreaseyFamily.jpg\"/></picture></span>\n</a>\n</p>\n</span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">For Debbie, opening Monkee's of Kiawah represents the perfect combination of passion and entrepreneurship. After decades in her family's successful grocery business, she was inspired to pursue her lifelong love of fashion and retail in a more personal way. With extensive experience serving customers and building relationships, she set out to create a boutique that feels welcoming, intentional, and community-driven.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\"I wanted to blend my love of style and fashion with my entrepreneurial background,\" Debbie shares. \"I truly find joy in sharing great clothes with people. Helping someone find something that makes them feel beautiful and confident is incredibly rewarding.\"</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Customers visiting Monkee's of Kiawah can expect a beautiful, inviting space that reflects the relaxed sophistication of coastal living. The boutique is centered on a relationship-driven shopping experience, with attentive service and personalized styling at its core. Debbie and her team take pride in understanding each customer's lifestyle and preferences, offering thoughtfully selected pieces that feel flattering, versatile, and effortless.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">The store features a curated mix of established and emerging designers, with collections suited for everything from casual island gatherings to special occasions. Shoppers will find timeless staples alongside fresh new arrivals, ensuring there is always something exciting to discover.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Family plays an important role in this new venture. Supported by her husband Todd and their daughter Caroline, Debbie brings a strong sense of hospitality and connection to the boutique, reflecting her commitment to building lasting relationships within the Kiawah community.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Monkee's of Kiawah is located at 259 Gardners Circle, Kiawah Island, SC 29455. The store is open Monday through Saturday from 10 a.m. to 6 p.m. and Sunday from 12 p.m. to 5 p.m. Customers can shop online at <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4628789-1&amp;h=2100449268&amp;u=http%3A%2F%2Fwww.monkeesofkiawah.com%2F&amp;a=www.monkeesofkiawah.com\" tabindex=\"0\">www.monkeesofkiawah.com</a> and follow along on Instagram at @monkeesofkiawah.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">The community is invited to visit and experience a personalized approach to shopping that feels both elevated and welcoming.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">About Monkee's Franchising LLC</strong><br data-v-602de5d2=\"\"/>Monkee's is a women's boutique franchise with a 30-year legacy of delivering curated fashion and exceptional customer service. With over 60 locations nationwide, Monkee's is recognized for helping women build stylish, versatile wardrobes with confidence.</p>\n<span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://mma.prnewswire.com/media/2012093/Monkee_s_Franchising_Logo.html\" tabindex=\"0\">\n<span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img\" data-v-f0ef0696=\"\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://mma.prnewswire.com/media/2012093/Monkee_s_Franchising_Logo.jpg\"/></picture></span>\n</a>\n</p>\n</span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img mdc-article-image__img--12-width\" data-v-f0ef0696=\"\" style=\"width:12px;\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://edge.prnewswire.com/c/img/favicon.png?sn=CL97320&amp;sd=2026-02-26\"/></picture></span> View original content to download multimedia:<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://www.prnewswire.com/news-releases/monkees-of-kiawah-brings-elevated-style-and-personalized-service-to-the-island-302699043.html\" tabindex=\"0\">https://www.prnewswire.com/news-releases/monkees-of-kiawah-brings-elevated-style-and-personalized-service-to-the-island-302699043.html</a></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">SOURCE Monkee's Franchising LLC</p></span>\n</div>",
            "pub_date": "2026-02-27 05:56:30",
            "link": "https://www.morningstar.com/news/pr-newswire/20260226cl97320/monkees-of-kiawah-brings-elevated-style-and-personalized-service-to-the-island",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "PARAMOUNT COMMENTS ON WARNER BROS. DISCOVERY BOARD'S DETERMINATION OF PARAMOUNT'S PROPOSAL AS SUPERIOR",
            "description": "<div class=\"mdc-article-body\">\n            \n              \n              PARAMOUNT COMMENTS ON WARNER BROS. DISCOVERY BOARD'S DETERMINATION OF PARAMOUNT'S PROPOSAL AS SUPERIOR\n              \n            \n            \n              <span>\n<h2 class=\"mdc-article-heading mdc-heading__mdc mdc-heading--level-5__mdc\" data-v-618d53ae=\"\">PARAMOUNT COMMENTS ON WARNER BROS. DISCOVERY BOARD'S DETERMINATION OF PARAMOUNT'S PROPOSAL AS SUPERIOR</h2>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">PR Newswire</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">LOS ANGELES and NEW YORK, Feb. 26, 2026</p>\n</span>\n<span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span data-v-602de5d2=\"\">LOS ANGELES and NEW YORK</span>, <span data-v-602de5d2=\"\">Feb. 26, 2026</span> /PRNewswire/ -- Paramount Skydance Corporation (NASDAQ: PSKY) (\"Paramount\") confirms that it has been notified by Warner Bros. Discovery, Inc. (NASDAQ: WBD) (\"WBD\") that WBD's Board of Directors has determined that Paramount's $31 per share, all-cash proposal to acquire WBD is a \"Company Superior Proposal\" under the terms of WBD's merger agreement with Netflix, Inc. (NASDAQ: NFLX).</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">David Ellison, Chairman and CEO of Paramount, said: \"We are pleased WBD's Board has unanimously affirmed the superior value of our offer, which delivers to WBD shareholders superior value, certainty and speed to closing.\"</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Under the terms of Paramount's proposed merger agreement:</p><ul class=\"mdc-article-list mdc-article-list--unordered\" data-v-7b473e83=\"\"><li data-v-7b473e83=\"\">Paramount will acquire WBD for $31.00 per WBD share in cash for 100% of the company;</li><li data-v-7b473e83=\"\">A daily \"ticking fee\" of $0.25 per quarter will accrue after September 30, 2026, until the consummation of the Paramount transaction;</li><li data-v-7b473e83=\"\">A regulatory termination fee of $7 billion would be payable in the event the transaction does not close due to regulatory matters;</li><li data-v-7b473e83=\"\">Paramount will pay the $2.8 billion termination fee which WBD is required to pay to Netflix to terminate its existing Netflix merger agreement;</li><li data-v-7b473e83=\"\">Paramount will eliminate WBD's potential $1.5 billion financing cost associated with its debt exchange offer;</li><li data-v-7b473e83=\"\">The \"Company Material Adverse Effect\" definition excludes the performance of WBD's Global Linear Networks business;</li><li data-v-7b473e83=\"\">The Ellison Trust is providing a $45.7 billion equity commitment, and Larry Ellison is guaranteeing such commitment, including an obligation to contribute additional equity funding to Paramount to the extent needed to support the solvency certificate required by Paramount's lending banks, and</li><li data-v-7b473e83=\"\">Bank of America Merrill Lynch, Citi and Apollo are providing a $57.5 billion debt commitment.</li></ul><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">The entry into Paramount's proposed transaction requires the expiration of a four business day match period, termination of the Netflix merger agreement and execution of a definitive merger agreement between Paramount and WBD.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">As previously announced, the waiting period under the Hart-Scott-Rodino Antitrust Improvements Act applicable to Paramount's acquisition of WBD expired at 11:59 pm on February 19, 2026.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Centerview Partners LLC and RedBird Advisors are acting as lead financial advisors to Paramount, and Bank of America Securities, Citi, M. Klein &amp; Company and LionTree are also acting as financial advisors. Cravath, Swaine &amp; Moore LLP and Latham &amp; Watkins LLP are acting as legal counsel to Paramount.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\"><span class=\"mdc-article-underline\" data-v-1f1bdc8a=\"\">About Paramount, a Skydance Corporation</span></strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Paramount, a Skydance Corporation (Nasdaq: PSKY) is a leading, next generation global media and entertainment company, comprised of three business segments: Studios, Direct-to-Consumer, and TV Media. The Company's portfolio unites legendary brands, including Paramount Pictures, Paramount Television, CBS – America's most-watched broadcast network, CBS News, CBS Sports, Nickelodeon, MTV, BET, Comedy Central, Showtime, Paramount+, Pluto TV, and Skydance's Animation, Film, Television, Interactive/Games, and Sports divisions. For more information please visit <strong class=\"mdc-article-strong\" data-v-479a2324=\"\"><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4628799-1&amp;h=1755004653&amp;u=https%3A%2F%2Furl.uk.m.mimecastprotect.com%2Fs%2FT2rfCpYWUnAxGnkHDhkIGcQ0m%3Fdomain%3Dedge.prnewswire.com&amp;a=www.paramount.com\" tabindex=\"0\">www.paramount.com</a></strong>.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\"><span class=\"mdc-article-underline\" data-v-1f1bdc8a=\"\">Cautionary Note Regarding Forward-Looking Statements </span></strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">This communication contains both historical and forward-looking statements, including statements related to Paramount Skydance Corporation's (\"Paramount\") future financial results and performance, potential achievements, anticipated reporting segments and industry changes and developments. All statements that are not statements of historical fact are, or may be deemed to be, \"forward-looking statements\". Similarly, statements that describe Paramount's objectives, plans or goals are or may be forward-looking statements. These forward-looking statements reflect Paramount's current expectations concerning future results and events; generally can be identified by the use of statements that include phrases such as \"believe,\" \"expect,\" \"anticipate,\" \"intend,\" \"plan,\" \"foresee,\" \"likely,\" \"will,\" \"may,\" \"could,\" \"estimate\" or other similar words or phrases; and involve known and unknown risks, uncertainties and other factors that are difficult to predict and which may cause Paramount's actual results, performance or achievements to be different from any future results, performance or achievements expressed or implied by these statements. These risks, uncertainties and other factors include, among others:  the outcome of the tender offer by Paramount and Prince Sub Inc. (the \"Tender Offer\") to purchase for cash all of the outstanding Series A common stock of Warner Bros. Discovery, Inc. (\"WBD\") or any discussions between Paramount and WBD with respect to a possible transaction (including, without limitation, by means of the Tender Offer, the \"Potential Transaction\"), including the possibility that the Tender Offer will not be successful, that the parties will not agree to pursue a business combination transaction or that the terms of any such transaction will be materially different from those described herein; the conditions to the completion of the Potential Transaction or the previously announced transaction between WBD and Netflix, Inc. (\"Netflix\") pursuant to the Agreement and Plan of Merger, dated December 4, 2025, among Netflix, Nightingale Sub, Inc., WBD and New Topco 25, Inc. (the \"Proposed Netflix Transaction\"), including the receipt of any required stockholder and regulatory approvals for either transaction, the proposed financing for the Potential Transaction, the indebtedness Paramount expects to incur in connection with the Potential Transaction and the total indebtedness of the combined company; the possibility that Paramount may be unable to achieve expected synergies and operating efficiencies within the expected timeframes or at all and to successfully integrate the operations of WBD with those of Paramount, and the possibility that such integration may be more difficult, time-consuming or costly than expected or that operating costs and business disruption (including, without limitation, disruptions in relationships with employees, customers or suppliers) may be greater than expected in connection with the Potential Transaction; risks related to Paramount's streaming business; the adverse impact on Paramount's advertising revenues as a result of changes in consumer behavior, advertising market conditions and deficiencies in audience measurement; risks related to operating in highly competitive and dynamic industries, including cost increases; the unpredictable nature of consumer behavior, as well as evolving technologies and distribution models; risks related to Paramount's decisions to make investments in new businesses, products, services and technologies, and the evolution of Paramount's business strategy; the potential for loss of carriage or other reduction in or the impact of negotiations for the distribution of Paramount's content; damage to Paramount's reputation or brands; losses due to asset impairment charges for goodwill, intangible assets, FCC licenses and content; liabilities related to discontinued operations and former businesses; increasing scrutiny of, and evolving expectations for, sustainability initiatives; evolving business continuity, cybersecurity, privacy and data protection and similar risks; content infringement; domestic and global political, economic and regulatory factors affecting Paramount's businesses generally, including tariffs and other changes in trade policies; the inability to hire or retain key employees or secure creative talent; disruptions to Paramount's operations as a result of labor disputes; the risks and costs associated with the integration of, and Paramount's ability to integrate, the businesses of Paramount Global and Skydance Media, LLC successfully and to achieve anticipated synergies; volatility in the prices of Paramount's Class B Common Stock; potential conflicts of interest arising from Paramount's ownership structure with a controlling stockholder; and other factors described in Paramount's news releases and filings with the Securities and Exchange Commission (the \"SEC\"), including but not limited to Paramount Global's most recent Annual Report on Form 10-K and Paramount's reports on Form 10-Q and Form 8-K. There may be additional risks, uncertainties and factors that Paramount does not currently view as material or that are not necessarily known. The forward-looking statements included in this communication are made only as of the date of this report, and Paramount does not undertake any obligation to publicly update any forward-looking statements to reflect subsequent events or circumstances.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\"><span class=\"mdc-article-underline\" data-v-1f1bdc8a=\"\">Additional Information </span></strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">This communication does not constitute an offer to buy or a solicitation of an offer to sell securities. This communication relates to a proposal that Paramount has made for an acquisition of WBD, the Tender Offer that Paramount, through Prince Sub Inc., its wholly owned subsidiary, has made to WBD stockholders, and Paramount's intention to solicit proxies against the Proposed Netflix Transaction and other proposals to be voted on by WBD stockholders at the special meeting of WBD stockholders to be held to approve the Proposed Netflix Transaction (the \"Netflix Merger Solicitation\") and/or for use at the WBD annual meeting of stockholders. The Tender Offer is being made pursuant to a tender offer statement on Schedule TO (including the offer to purchase, the letter of transmittal and other related offer documents), filed with the SEC on December 8, 2025. These materials, as may be amended from time to time, contain important information, including the terms and conditions of the offer. Subject to future developments, Paramount (and, if a negotiated transaction is agreed, WBD) may file additional documents with the SEC. This communication is not a substitute for any proxy statement, tender offer statement, or other document Paramount and/or WBD may file with the SEC in connection with the Potential Transaction.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Paramount, Prince Sub Inc. and the other participants in the Netflix Merger Solicitation have filed a preliminary proxy statement and the accompanying BLUE proxy card with the SEC on January 22, 2026 in connection with the Netflix Merger Solicitation (the \"Special Meeting Preliminary Proxy Statement\"). Paramount expects to file a definitive proxy statement and the accompanying proxy card with the SEC in connection with the Netflix Merger Solicitation and may file other proxy solicitation materials in connection therewith or the annual meeting of WBD stockholders, or other documents with the SEC.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">PARAMOUNT STRONGLY ADVISES ALL STOCKHOLDERS OF WBD TO READ THE SPECIAL MEETING PRELIMINARY PROXY STATEMENT AND OTHER PROXY MATERIALS AS THEY BECOME AVAILABLE BECAUSE THEY WILL CONTAIN IMPORTANT INFORMATION, INCLUDING INFORMATION RELATED TO THE PARTICIPANTS. SUCH PROXY MATERIALS WILL BE AVAILABLE AT NO CHARGE ON THE SEC'S WEB SITE AT <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4628799-1&amp;h=156350773&amp;u=http%3A%2F%2Fwww.sec.gov%2F&amp;a=HTTP%3A%2F%2FWWW.SEC.GOV\" tabindex=\"0\">HTTP://WWW.SEC.GOV</a>. IN ADDITION, PARAMOUNT AND THE OTHER PARTICIPANTS IN SUCH PROXY SOLICITATIONS WILL PROVIDE COPIES OF THE APPLICABLE PROXY STATEMENTS WITHOUT CHARGE, WHEN AVAILABLE, UPON REQUEST. REQUESTS FOR SUCH COPIES SHOULD BE DIRECTED TO THE APPLICABLE PROXY SOLICITOR. </p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\"><span class=\"mdc-article-underline\" data-v-1f1bdc8a=\"\">Participants in the Solicitation</span></strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">The participants in the Netflix Merger Solicitation are expected to be Paramount, Prince Sub Inc., certain directors and executive officers of Paramount and Prince Sub Inc., Lawrence Ellison, RedBird Capital Management and The Lawrence J. Ellison Revocable Trust, u/a/d 1/22/88, as amended. Additional information about the participants in the Netflix Merger Solicitation is available in the Special Meeting Preliminary Proxy Statement.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">PSKY-IR</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\"><span class=\"mdc-article-underline\" data-v-1f1bdc8a=\"\">Media Contact</span></strong><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">s: <br data-v-479a2324=\"\"/></strong><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Paramount<br data-v-479a2324=\"\"/></strong>Melissa Zukerman / Laura Watson<br data-v-602de5d2=\"\"/><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"mailto:msz@paramount.com\" tabindex=\"0\">msz@paramount.com</a> / <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"mailto:laura.watson@paramount.com\" tabindex=\"0\">laura.watson@paramount.com</a></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Brunswick Group<br data-v-479a2324=\"\"/></strong><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"mailto:ParamountSkydance@brunswickgroup.com\" tabindex=\"0\">ParamountSkydance@brunswickgroup.com</a></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Gagnier Communications<br data-v-479a2324=\"\"/></strong>Dan Gagnier<br data-v-602de5d2=\"\"/><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"mailto:dg@gagnierfc.com\" tabindex=\"0\">dg@gagnierfc.com</a></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\"><span class=\"mdc-article-underline\" data-v-1f1bdc8a=\"\">Investor Contacts</span></strong><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">:<br data-v-479a2324=\"\"/></strong><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Paramount <br data-v-479a2324=\"\"/></strong>Kevin Creighton / Logan Thomas<br data-v-602de5d2=\"\"/><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"mailto:kevin.creighton@paramount.com\" tabindex=\"0\">kevin.creighton@paramount.com</a> / <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"mailto:logan.thomas@paramount.com\" tabindex=\"0\">logan.thomas@paramount.com</a></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Okapi Partners<br data-v-479a2324=\"\"/></strong>(212) 297-0720<br data-v-602de5d2=\"\"/>Toll-Free: (844) 343-2621<br data-v-602de5d2=\"\"/><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"mailto:info@okapipartners.com\" tabindex=\"0\">info@okapipartners.com</a> </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img mdc-article-image__img--12-width\" data-v-f0ef0696=\"\" style=\"width:12px;\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://edge.prnewswire.com/c/img/favicon.png?sn=NY97331&amp;sd=2026-02-26\"/></picture></span> View original content:<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://www.prnewswire.com/news-releases/paramount-comments-on-warner-bros-discovery-boards-determination-of-paramounts-proposal-as-superior-302699028.html\" tabindex=\"0\">https://www.prnewswire.com/news-releases/paramount-comments-on-warner-bros-discovery-boards-determination-of-paramounts-proposal-as-superior-302699028.html</a></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">SOURCE Paramount Skydance Corporation</p></span>\n<span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img\" data-v-f0ef0696=\"\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://rt.prnewswire.com/rt.gif?NewsItemId=NY97331&amp;Transmission_Id=202602261635PR_NEWS_USPR_____NY97331&amp;DateId=20260226\"/></picture></span>\n</div>",
            "pub_date": "2026-02-27 05:45:45",
            "link": "https://www.morningstar.com/news/pr-newswire/20260226ny97331/paramount-comments-on-warner-bros-discovery-boards-determination-of-paramounts-proposal-as-superior",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "10-year Treasury yield hits a three-month low - and it may have to do with AI, strategist says",
            "description": "<div class=\"mdc-article-body\">\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  By Vivien Lou Chen </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Concerns about AI's potential as a destructive force on U.S. jobs have contributed to a rally in the 10-year note and 30-year bond, sending their yields to the lowest levels since November </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     The AI fear trade appears to be spilling into the U.S. bond market, according to Lawrence Gillum of LPL Financial. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     The bond market has caught a bid over much of the past month, with buyers stepping into a crucial part of the $30 trillion Treasury market partly because of anxiety over artificial intelligence's potential to wipe out many U.S. jobs, according to strategist Lawrence Gillum of LPL Financial. Under Gillum's theory, the Treasury market's recent rally in long-dated government debt, and the resulting drop in yields, is linked at least in part to broader fears about AI's destructive capacity. In other words, AI-driven anxiety may be pushing bond-market yields lower. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     On Thursday, the benchmark 10-year yield BX:TMUBMUSD10Y, which is a peg for pricing new 30-year fixed mortgages, finished below 4.02% and at its lowest level since Nov. 26, according to Dow Jones Market Data.  Meanwhile, the yield on the 30-year bond BX:TMUBMUSD30Y fell below 4.7% to the lowest 3 p.m. Eastern time level of the past three months. The drop in yields occurred despite a lack of any data or non-AI-related events that could explain those moves. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Falling long-term yields since January have spilled over into mortgage financing, where rates for new 30-year fixed mortgages have fallen below the 6% threshold for the first time in 31/2 years, according to Freddie Mac. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Read: Mortgage rates fall below 6%, giving buyers a glimpse of affordability </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Treasury yields can be influenced by a variety of things - such as the outlook for the U.S. economy and inflation, expectations for the path of interest rates, and rising geopolitical risks in the Middle East. What's interesting now is that long-term yields are trending lower even though the U.S. economy is holding up, expectations for the Federal Reserve's next rate cut have been pushed back to July, and the U.S. and Iran are involved in nuclear talks in Geneva that could reportedly produce an agreement. While economic data have been mixed, most U.S. companies have avoided widespread layoffs - keeping a \"low-hire, low-fire\" labor market in place. So long as workers have jobs, lower mortgage rates could help improve affordability issues. Yet fears of layoffs might still act as a counterbalance. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Read: CEOs say they won't add many jobs in 2026. Is a low-hire, low-fire labor market the new norm? </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Within the bond market, \"there's been an ongoing bid related to job displacements from AI, and we've seen a drop in yields over the past couple of weeks because of that,\" LPL Financial's Gillum said in a phone interview. Thursday's bond-market moves \"seem like a continuation of that trade,\" he noted. The strategist added that traders seemed to be more focused on AI's disinflationary impacts than on the potential for elevated inflation pressures over the next few years. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     On Thursday, investors remained focused on the likely winners and losers from AI. Major stock indexes DJIA SPX COMP finished mostly lower. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     -Vivien Lou Chen </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     This content was created by MarketWatch, which is operated by Dow Jones &amp; Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal. </p>\n<pre class=\"mdc-article-pre\" data-v-370ea3ac=\"\"></pre>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  (END) Dow Jones Newswires</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  02-26-26 1638ET</p>\n\nCopyright (c) 2026 Dow Jones &amp; Company, Inc.</div>",
            "pub_date": "2026-02-27 05:45:44",
            "link": "https://www.morningstar.com/news/marketwatch/20260226287/10-year-treasury-yield-hits-a-three-month-low-and-it-may-have-to-do-with-ai-strategist-says",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Block plans to lay off nearly half its staff in 'deliberate and bold' embrace of AI",
            "description": "<div class=\"mdc-article-body\">\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  By Emily Bary </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     'Intelligence tools have changed what it means to build and run a company,' CEO Jack Dorsey says </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Jack Dorsey thinks other companies will follow Block with dramatic workforce cuts. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Block, the parent company of Square and the Cash App, is conducting a major reorganization in the age of artificial intelligence. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     The payment-technology company plans to cut almost half of its workforce, it announced Thursday. The restructuring will bring Block's (XYZ) employee count below 6,000 versus more than 10,000 today. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     The layoffs at Block come just days after Citrini Research rattled markets with the publication of a blog post detailing a fictional scenario in which AI productivity tools were so powerful that they forced widespread shifts in the U.S. labor market. These particularly impacted knowledge workers. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     'Intelligence tools have changed what it means to build and run a company,\" CEO Jack Dorsey said in a shareholder letter. \"We're already seeing it internally. A significantly smaller team, using the tools we're building, can do more and do it better.\" </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     By \"intelligence tools,\" the company is referring to AI and automation. CFO Amrita Ahuja said that Block has seen sizable productivity gains recently, not just among programmers but also within the broader company. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Within a year, Dorsey expects other companies to follow suit with \"similar structural changes.\" </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     \"I'd rather get there honestly and on our own terms than be forced into it reactively,\"  he added. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Block's \"deliberate and bold\" decision to dramatically reduce its workforce comes \"from a position of strength,\" according to Ahuja, as the company just exceeded expectations with various financial metrics and lifted its outlook. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     The stock was up about 4% in Thursday's extended session. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     In its fourth-quarter earnings report Thursday, Block reported earnings per share of 65 cents, down from 71 cents a year before but ahead of the FactSet consensus by a penny. Gross profit, which is seen by Wall Street as a reasonably clean barometer for Block's top-line performance, was up 24% from a year before to $2.87 billion. Analysts were looking for $2.74 billion. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Block now expects 18% growth in gross profit for the full year, above the 17% target it set at an investor day late last year. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     That new outlook reflects a \"recognition of our ability to continue to drive against our roadmap\" with a \"smaller, more nimble, flatter organizational structure,\" Ahuja said. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     -Emily Bary </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     This content was created by MarketWatch, which is operated by Dow Jones &amp; Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal. </p>\n<pre class=\"mdc-article-pre\" data-v-370ea3ac=\"\"></pre>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  (END) Dow Jones Newswires</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  02-26-26 1622ET</p>\n\nCopyright (c) 2026 Dow Jones &amp; Company, Inc.</div>",
            "pub_date": "2026-02-27 05:30:52",
            "link": "https://www.morningstar.com/news/marketwatch/20260226256/block-plans-to-lay-off-nearly-half-its-staff-in-deliberate-and-bold-embrace-of-ai",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "10-year Treasury yield hits a three-month low - and it may have to do with AI, strategist says",
            "description": "<div class=\"mdc-article-body\">\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  By Vivien Lou Chen </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Concerns about AI's potential as a destructive force on U.S. jobs have contributed to a rally in the 10-year note and 30-year bond, sending their yields to the lowest level since November </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     The AI fear trade appears to be spilling into the U.S. bond market, according to Lawrence Gillum of LPL Financial. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     The bond market has caught a bid over much of the past month, with buyers stepping into a crucial part of the $30 trillion Treasury market partly because of anxiety over artificial intelligence's potential to wipe out many U.S. jobs, according to strategist Lawrence Gillum of LPL Financial. Under Gillum's theory, the Treasury market's recent rally in long-dated government debt, and the resulting drop in yields, is linked at least in part to broader fears about AI's destructive capacity. In other words, AI-driven anxiety may be pushing bond-market yields lower. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     On Thursday, the benchmark 10-year yield BX:TMUBMUSD10Y, which is a peg for pricing new 30-year fixed mortgages, finished below 4.02% and at its lowest level since Nov. 26, according to Dow Jones Market Data.  Meanwhile, the yield on the 30-year bond BX:TMUBMUSD30Y fell below 4.7% to the lowest 3 p.m. Eastern time level of the past three months. The drop in yields occurred despite a lack of any data or non-AI-related events that could explain those moves. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Falling long-term yields since January have spilled over into mortgage financing, where rates for new 30-year fixed mortgages have fallen below the 6% threshold for the first time in 31/2 years, according to Freddie Mac. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Read: Mortgage rates fall below 6%, giving buyers a glimpse of affordability </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Treasury yields can be influenced by a variety of things - such as the outlook for the U.S. economy and inflation, expectations for the path of interest rates, and rising geopolitical risks in the Middle East. What's interesting now is that long-term yields are trending lower even though the U.S. economy is holding up, expectations for the Federal Reserve's next rate cut have been pushed back to July, and the U.S. and Iran are involved in nuclear talks in Geneva that could reportedly produce an agreement. While economic data have been mixed, most U.S. companies have avoided widespread layoffs - keeping a \"low-hire, low-fire\" labor market in place. So long as workers have jobs, lower mortgage rates could help improve affordability issues. Yet fears of layoffs might still act as a counterbalance. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Read: CEOs say they won't add many jobs in 2026. Is a low-hire, low-fire labor market the new norm? </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Within the bond market, \"there's been an ongoing bid related to job displacements from AI, and we've seen a drop in yields over the past couple of weeks because of that,\" LPL Financial's Gillum said in a phone interview. Thursday's bond-market moves \"seem like a continuation of that trade,\" he noted. The strategist added that traders seemed to be more focused on AI's disinflationary impacts than on the potential for elevated inflation pressures over the next few years. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     On Thursday, investors remained focused on the likely winners and losers from AI. Major stock indexes DJIA SPX COMP finished mostly lower. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     -Vivien Lou Chen </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     This content was created by MarketWatch, which is operated by Dow Jones &amp; Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal. </p>\n<pre class=\"mdc-article-pre\" data-v-370ea3ac=\"\"></pre>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  (END) Dow Jones Newswires</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  02-26-26 1626ET</p>\n\nCopyright (c) 2026 Dow Jones &amp; Company, Inc.</div>",
            "pub_date": "2026-02-27 05:30:50",
            "link": "https://www.morningstar.com/news/marketwatch/20260226258/10-year-treasury-yield-hits-a-three-month-low-and-it-may-have-to-do-with-ai-strategist-says",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Dow Jones Top Financial Services Headlines at 4 PM ET: Fed's Miran Says Four Cuts Are Appropriate This Year | Victory ...",
            "description": "<div class=\"mdc-article-body\">\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Fed's Miran Says Four Cuts Are Appropriate This Year </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Federal Reserve governor Stephen Miran said he thinks the Fed needs to cut interest rates by about a percentage point this year. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     ---- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Victory Capital Files Competing Bid to Acquire Janus Henderson </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Victory Capital said it submitted a bid to acquire Janus Henderson that it says is higher than the $7.4 billion offered in December by Nelson Peltz's Trian Fund Management and venture firm General Catalyst. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     ---- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Vanguard Settles Texas Lawsuit Alleging Investors Conspired to Drive Up Coal Prices </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Vanguard Group agreed to pay several U.S. states $29.5 million to settle a lawsuit alleging it worked with other index-fund managers to pressure coal companies to reduce output. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     ---- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  TD Bank Quarterly Earnings Lifted by Growth Across Operations </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Toronto-Dominion Bank's earnings jumped in the first three months of its fiscal year as the big Canadian lender saw revenue growth across its operations. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     ---- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Royal Bank of Canada Earnings Lifted by Personal Banking, Markets Growth </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  The bank, Canada's biggest by market value, turned in a stronger-than-expected profit in the first quarter with gains across most business segments. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     ---- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  LSEG Shares Rise After Forecast of Profitability Boost, $4 Billion Buybacks </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  The financial-data provider and exchange operator said continued revenue growth and efficiencies would help it improve profitability beyond this year. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     ---- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Munich Re Profit Dented By Currency Headwinds </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  The reinsurer's fourth-quarter profit fell 11.5% as foreign exchange fluctuations dragged. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     ---- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Allianz Posts Rise in Operating Profit, Issues In-Line Guidance </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Europe's largest insurer by market capitalization delivered record operating profit for 2025 as it reported growth across its key metrics in the final quarter. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     ---- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  French Insurer AXA Reports Profit Rise After Asset Manager Sale </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Net profit for last year was 24% ahead of 2024's result due to top-line growth and the sale of AXA Investment Managers to BNP Paribas. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     ---- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Financial Services Roundup: Market Talk </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Find insight on the weekly average mortgage rate, Bitcoin and more in the latest Market Talks covering Financial Services. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     ---- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  A Judge Said Stifel Should Pay Landmark $133 Million Arbitration Award. Stifel Is Still Objecting. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  The brokerage firm is focusing on a single arbitrator in its effort to avoid the penalty in the highest-profile case involving former broker Chuck Roberts. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     ---- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Despite Stock Selloff, Analysts Don't Foresee Private-Markets Wipeout </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  The crisis of confidence in publicly traded alternatives managers so far is having little impact on their private peers. </p>\n<pre class=\"mdc-article-pre\" data-v-370ea3ac=\"\"></pre>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  (END) Dow Jones Newswires</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  February 26, 2026 16:15 ET (21:15 GMT)</p>\n\nCopyright (c) 2026 Dow Jones &amp; Company, Inc.</div>",
            "pub_date": "2026-02-27 05:16:37",
            "link": "https://www.morningstar.com/news/dow-jones/2026022616144/dow-jones-top-financial-services-headlines-at-4-pm-et-feds-miran-says-four-cuts-are-appropriate-this-year-victory",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Dow Jones Top Energy Headlines at 4 PM ET: Big Oil Is Urging Trump to Stop Battle on Offshore Wind | Engie ...",
            "description": "<div class=\"mdc-article-body\">\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Big Oil Is Urging Trump to Stop Battle on Offshore Wind </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  The president's assault on wind farms is stalling a legislative push to speed permitting for energy projects. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     ---- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Engie to Buy UK Power Networks for $14.2 Billion From Hong Kong's CK Group </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  France's Engie will acquire UK Power Networks for 10.5 billion pounds in equity value, equivalent to about $14.2 billion, from Hong Kong billionaire Li Ka-shing's CK Group. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     ---- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Eni Earnings Rise on Higher Production </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Adjusted net profit-the company's preferred metric-jumped 35% and earnings were supported by a more than 7% rise in oil and gas production. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     ---- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Oil Futures Slip Amid Jitters Over U.S.-Iran Talks </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Crude futures settled lower in a volatile session as the U.S. and Iran wound up a day of talks in Geneva. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     ---- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Energy &amp; Utilities Roundup: Market Talk </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Find insight on oil futures, Veolia and more in the latest Market Talks covering Energy and Utilities. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     ---- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  U.S. Natural Gas Futures Fall on Weather Outlook </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  U.S. natural gas settled lower with the April contract moving to the front of the curve. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     ---- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  U.S. Opens the Way for Fuel-Starved Cuba to Get Oil Shipments </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  The Treasury Department also said some shipments of American fuel could be legal to relieve the humanitarian crisis on the Communist island. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     ---- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  U.S. Crude Oil Stockpiles Post Large Weekly Build </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Crude oil inventories rose by 16 million barrels, posting their biggest weekly increase in three years as imports rose, exports fell and refineries cut their capacity use. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     ---- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Nordex Surges 16% on Earnings Beat, Potential U.S. Expansion </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Energy demand from AI-driven data center expansion will drive demand momentum in North America, the wind-turbine manufacturer said. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     ---- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Iberdrola's Net Profit Rises, Reiterates Guidance </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Iberdrola said net profit rose in 2025, driven by its networks business, and the energy company reiterated its guidance for the year ahead. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     ---- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  E.ON's Earnings Rise as It Spends on European Energy Infrastructure </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  E.ON's earnings rose as it expanded and upgraded energy infrastructure across Europe and it raised its investment plan to 2030. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     ---- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  First Solar Posts Higher Profit on Increase in Revenue </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  The solar-energy company posted a higher profit in fourth quarter, but issued revenue guidance for this year that missed analyst expectations. </p>\n<pre class=\"mdc-article-pre\" data-v-370ea3ac=\"\"></pre>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  (END) Dow Jones Newswires</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  February 26, 2026 16:15 ET (21:15 GMT)</p>\n\nCopyright (c) 2026 Dow Jones &amp; Company, Inc.</div>",
            "pub_date": "2026-02-27 05:16:36",
            "link": "https://www.morningstar.com/news/dow-jones/2026022616145/dow-jones-top-energy-headlines-at-4-pm-et-big-oil-is-urging-trump-to-stop-battle-on-offshore-wind-engie",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        }
    ]
}