{
    "data": [
        {
            "title": "Fed Mounts Closed-Door Fight Against DOJ Subpoenas",
            "description": "<div class=\"mdc-article-body\">\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Fed Mounts Closed-Door Fight Against DOJ Subpoenas By Vicky Ge Huang </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     The Federal Reserve is waging a behind-closed-doors legal challenge to a pair of subpoenas issued as part of U.S. Attorney Jeanine Pirro's criminal investigation into Fed Chair Jerome Powell, according to people familiar with the matter. As that legal battle ensues, Fed governor Stephen Miran turned his attention to the central bank's policy stance: he said in a Fox Business interview Thursday that the Fed needs to cut rates by about a percentage point this year. Meanwhile, markets will get their next hint on where prices are headed when wholesale inflation data is released Friday. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Top News Fed Mounts Closed-Door Fight Against Justice Department Subpoenas </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     U.S. Attorney Jeanine Pirro, a longtime ally of President Trump, opened a probe into Federal Reserve Chair Jerome Powell to examine whether he gave false testimony to Congress last summer about the central bank's building-renovation project. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     The move prompted an unprecedented public response from Powell, who in a Jan. 11 video statement said the investigation was a pretext for President Trump's continuing campaign to pressure the Fed to lower interest rates and end the independence of the central bank. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     The Fed, in sealed proceedings, is asking a judge to quash the subpoenas , which could reduce or eliminate its obligation to respond. Its specific legal arguments couldn't immediately be learned. It isn't uncommon, especially in high-profile investigations, for a subpoena recipient to challenge prosecutors' demands as being overly broad or seeking information protected by legal privilege. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Fed's Miran Says Four Cuts Are Appropriate This Year </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Federal Reserve governor Stephen Miran said Thursday: \"Four cuts I think are appropriate,\" </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  adding \"I'd rather get them sooner than later.\" With regard to private credit, Miran said he hasn't seen anything yet that would make him worried from a macroeconomic perspective. He added a lot of the growth in private credit ties back to overregulation in banks. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     January's Wholesale Inflation Will Help Flesh Out the Fed's Preferred Price Gauge </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     The Bureau of Labor Statistics is set to publish the producer price index for total final demand at 8:30 a.m. ET. Economists expected that solid price pressures remained in the pipeline in January, though not as strong as in December. That could signal that the Federal Reserve's preferred inflation gauge will remain sticky, possibly stalling momentum for further interest-rate cuts. Economists surveyed by FactSet expect that wholesale inflation rose 0.3% in January. That's a cooldown from the 0.5% monthly pace in December, but still a relatively firm monthly print. The annual rate is expected to be 2.6%, a pullback from December's 3% increase. (Barron's) </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Mortgage Rates Fall Below 6% for the First Time Since 2022 </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Mortgage rates fell below 6% this week </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  for the first time in more than three years, welcome news for waves of house hunters heading into the busy spring home-buying season. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Trump's Push to Make Homes More Affordable Needs the Banks to Play Ball </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Key Developments Around the World China Moves to Tame Yuan Rally by Slashing Shorting Costs </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     China's central bank has started taking steps to check the yuan's recent advance, dusting off an old playbook that would reduce the cost of betting against the currency. The People's Bank of China announced it would slash the risk reserve requirement ratio </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  for financial institutions conducting foreign-exchange forward trading to zero from 20%, a move that effectively makes purchasing the dollar cheaper. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Tokyo CPI Slows Below BOJ Target But Rate-Hike Path Seems Intact </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Inflation in Japan's capital cooled below the central bank's 2% target </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  for the first time in over a year, but the slowdown is unlikely to derail further interest rate hikes. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     U.K. Consumer Mood Darkens Amid Lingering Cost-Of-Living Squeeze </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     U.K. consumer sentiment fell unexpectedly </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  in February as cost-of-living pressures continue to weigh on households. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     U.K. Prime Minister Starmer Suffers Another Setback With Local Election </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  OPEC+ Expected to Resume Output Hikes at Sunday Meeting </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     The Organization of the Petroleum Exporting Countries and its allies meet Sunday with a familiar dilemma : add barrels to the market or continue holding back against a fragile geopolitical backdrop. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Commentary Tech Has Never Caused a Job Apocalypse. Don't Bet on It Now. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     It was only a matter of time before the AI apocalypse theory went mainstream, writes Greg Ip for The Wall Street Journal. Last weekend, a sensational report posited a future in which AI unleashes enough disruption and job destruction to bring on a deep recession and financial crisis. In response, the entire stock market sold off. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     AI disruption makes news almost daily. On Thursday, payments company Block said it was laying off 4,000 employees, 40% of its workforce, because AI has \"changed what it means to build and run a company,\" founder Jack Dorsey told shareholders. \"Within the next year, I believe the majority of companies will reach the same conclusion.\" </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Is this just the beginning? No one should dismiss any scenario, even the most dystopian, with high conviction. Certainly not journalists, whose way of life is in AI's crosshairs. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     But I keep stumbling over one small problem with the doomsday vision: It requires a breakdown in how the market economy functions. Nothing like it has happened in the U.S. before, and there is no evidence it is happening now. Read more . </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Forward Guidance Friday (all times ET) </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     8:30 a.m.: PPI </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     9:45 a.m.: Chicago Business Barometer - ISM-Chicago Business Survey - Chicago PMI </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     3 p.m.: Agricultural Prices </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     3:30 p.m.: U.S. President Donald Trump delivers remarks at The Port of Corpus Christi </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Monday </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     9:45 a.m.: US Manufacturing PMI </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     10 a.m.: ISM Report On Business Manufacturing PMI </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     About Us </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     WSJ Pro Central Banking brings you central banking news, analysis and insights from WSJ's global team of reporters and editors. This newsletter was compiled by markets reporter Vicky Ge Huang  in New York. Send your tips, suggestions and feedback to [vicky.huang@wsj.com]. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     This article is a text version of a Wall Street Journal newsletter published earlier today. </p>\n<pre class=\"mdc-article-pre\" data-v-370ea3ac=\"\"></pre>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  (END) Dow Jones Newswires</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  February 27, 2026 07:46 ET (12:46 GMT)</p>\n\nCopyright (c) 2026 Dow Jones &amp; Company, Inc.</div>",
            "pub_date": "2026-02-27 20:56:35",
            "link": "https://www.morningstar.com/news/dow-jones/202602275286/fed-mounts-closed-door-fight-against-doj-subpoenas",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Beware of banks breaking bad, warns top B. of A. strategist. He casts a wary eye on bank-loan ETFs.",
            "description": "<div class=\"mdc-article-body\">\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  By Jules Rimmer </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Problem loans in the financial-services sector imply mounting risks for markets </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Bank of America strategist Michael Hartnett is worried about problems \"under the hood\" of the U.S. economy </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     An alarm bell has been rung by one of Wall Street's most prominent strategists. Investors ought to be wary of developments in the financial sector, with problem loans increasingly a concern that could trigger a \"proper flush in risk assets\" next month. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     This stark warning emanates from one of Wall Street's most respected commentators, Bank of America chief equity strategist Michael Hartnett. His weekly flow note alerts investors to watch closely the performance of exchange-traded funds that specialize in bank loans. The panic generated by Jamie Dimon's \"cockroaches\" forewarning last October has never fully dissipated. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     When bank-loan funds break below the 200-day moving average? \"Bad events.\" </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Hartnett highlights two funds in particular that warrant special attention: the State Street BlackRock senior loan ETF SRLN and the State Street Financial Select Sector ETF XLF. So far this year, the former is down just a few percentage points, with the latter dropping about 5%, but Hartnett and team suggest that if respective key support levels for the funds' 200-day moving average at $40 and $52 are broken, that signals \"bad events\" are looming. He cites comparisons with pandemic-era markets and the U.K. pension-fund crisis. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     If the worst comes to pass, Hartnett predicts a big increase in risk aversion in March, a spike in the dollar DXY, with its index hitting 100, and a surge in demand for U.S Treasurys. Hartnett's \"Flow Show\" points out that, already this year, the zero-coupon Treasury-bond ETF ZROZ, which supercharges returns when rates decline, has gained more than 5%. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     MarketWatch Live: The 10-year Treasury yield is below 4% for the first time since November </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     To arrest such a panic, Hartnett speculates that either the Fed would be obliged to ease or the hyperscalers (AMZN) (GOOG) (MSFT) would have to cut back on capital expenditures. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Other troubling indicators are flashing in Asia, Hartnett points out, most notably in Korea, where the KOSPI KR:180721 index has already added more than 50% in 2026. Hartnett compares the bubble here to overbought levels hit by gold (GC00) in January, bitcoin (BTCUSD) in March 2024 and the \"Magnificent Seven\" MAGS in summer 2023. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Hartnett adds that the Nikkei (NIY00) has reached an all-time high, China's currency (USDCNY) is the strongest it's been in three years, and, taken together, this combination suggests Asian assets are front running a global economic boom. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Don't miss: Yes, consumers in China are consuming again. It's just not their No. 1 priority these days. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     KOSPI today as compared with other \"bubble\" peaks. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     In the short term, Hartnett makes the bold call to \"sell the greed\" in Asia, predicting a correction ahead of trade summits between Donald Trump, the U.S. president, and Japan's prime minister, Sanae Takaichi, on March 19, and China's president, Xi Jinping, on March 31. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     On a longer-term horizon, however, Hartnett is very constructive on the rest of the world, particularly relative to the U.S. At present, U.S. equities SPX RUT constitute 62% of the world's aggregate stock-market capitalization and the rest of the world VXUS makes up just 38%. For Hartnett, clearly, this has to start reversing, especially with the global trends of fiscal excess, populism and the end of deflation. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     His final point emphasizing this sea change in the investment landscape is that AI disruption is liable to be more disruptive and detrimental to the U.S. services-heavy indices, compared with the more manufacturing- and resource-heavy alternatives in Europe, Australasia, the Far East and emerging markets EEM. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     -Jules Rimmer </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     This content was created by MarketWatch, which is operated by Dow Jones &amp; Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal. </p>\n<pre class=\"mdc-article-pre\" data-v-370ea3ac=\"\"></pre>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  (END) Dow Jones Newswires</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  02-27-26 0751ET</p>\n\nCopyright (c) 2026 Dow Jones &amp; Company, Inc.</div>",
            "pub_date": "2026-02-27 20:56:34",
            "link": "https://www.morningstar.com/news/marketwatch/20260227155/beware-of-banks-breaking-bad-warns-top-b-of-a-strategist-he-casts-a-wary-eye-on-bank-loan-etfs",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "ProCap Financial’s “Attack Mode\" Shrinks Discount to NAV as Company Aggressively Repurchases Shares",
            "description": "<div class=\"mdc-article-body\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">ProCap Financial’s “Attack Mode\" Shrinks Discount to NAV as Company Aggressively Repurchases Shares</strong>\n</p><ul class=\"mdc-article-list mdc-article-list--unordered\" data-v-7b473e83=\"\">\n<li data-v-7b473e83=\"\">\nProCap Financial repurchased 159,904 shares on Thursday, February 26, 2026 at approximately 25% discount to NAV\n\n</li>\n<li data-v-7b473e83=\"\">\nCompany is committed to aggressively repurchasing shares at a significant discount to NAV\n\n</li>\n</ul><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.procapfinancial.com&amp;esheet=54435008&amp;newsitemid=20260227782572&amp;lan=en-US&amp;anchor=ProCap+Financial%2C+Inc.&amp;index=1&amp;md5=5b3d9bd4b318afaf58f18f0f69de635f\" tabindex=\"0\">ProCap Financial, Inc.</a> (Nasdaq: BRR), the first publicly traded agentic finance firm, today announced it repurchased 159,904 shares of its common stock in the open market yesterday. The repurchases were done at an approximate 25% discount to Net Asset Value (\"NAV\").\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n”Our strategy is working,” said <strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Anthony Pompliano, Chairman and CEO of ProCap Financial</strong>. “We have been aggressively repurchasing our shares at a significant discount to NAV, which has helped to close the NAV discount over the last week. The job is not done.”\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">About ProCap Financial</strong>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nProCap Financial is the first publicly traded agentic finance firm. The Company’s mission is to help independent investors make money. Founded in 2025, the Company raised more than $750 million from leading investors and is traded on Nasdaq under the symbol BRR. Visit <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.procapfinancial.com&amp;esheet=54435008&amp;newsitemid=20260227782572&amp;lan=en-US&amp;anchor=www.procapfinancial.com&amp;index=2&amp;md5=ad9189ae3c0998aeedb97c8f96044a19\" tabindex=\"0\">www.procapfinancial.com</a> for more information.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Forward-Looking Statements</strong>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nThis press release contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. These statements are based on current expectations and are subject to various risks and uncertainties that could cause actual results to differ materially. Such risks include those described under “Risk Factors” in most recent SEC filings. We caution readers not to place undue reliance on forward-looking statements, which reflect our views only as of the date of this release. We undertake no obligation to update such statements, except as required by law.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img\" data-v-f0ef0696=\"\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20260227782572r1&amp;sid=mstr3&amp;distro=nx&amp;lang=en\"/></picture></span><span data-v-602de5d2=\"\"></span></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">MEDIA CONTACT\n<br data-v-479a2324=\"\"/>Erica Chase \n</strong><br data-v-602de5d2=\"\"/><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"mailto:press@procapfinancial.com\" tabindex=\"0\">press@procapfinancial.com \n</a><br data-v-602de5d2=\"\"/>\n<br data-v-602de5d2=\"\"/><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">INVESTOR CONTACT\n<br data-v-479a2324=\"\"/></strong><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"mailto:investors@procapfinancial.com\" tabindex=\"0\">investors@procapfinancial.com</a>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span data-v-602de5d2=\"\">View source version on businesswire.com: </span><span data-v-602de5d2=\"\"><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://www.businesswire.com/news/home/20260227782572/en/\" tabindex=\"0\">https://www.businesswire.com/news/home/20260227782572/en/</a></span></p></div>",
            "pub_date": "2026-02-27 20:45:47",
            "link": "https://www.morningstar.com/news/business-wire/20260227782572/procap-financials-attack-mode-shrinks-discount-to-nav-as-company-aggressively-repurchases-shares",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "My grandpa retired happily at 70 with $750K after working as a missionary. I know where most Americans go wrong.",
            "description": "<div class=\"mdc-article-body\">\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  By Quentin Fottrell </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     'You could even retire at 55 with $500,000 and be perfectly fine. Am I right?' </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     \"Realistically, no one is going to spend $100,000 a year in retirement.\" (Photo subject is a model.) </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Dear Quentin, </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     The money people need to save for retirement keeps going up, and I don't like it. I am also very skeptical. Some people say you need $5 million to retire; some say $1 million; others will give a figure anywhere in between. I am highly skeptical about these numbers and wonder what assumptions they're making about how you'll use your money. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     My grandpa retired at 70 after working as a missionary for most of his life and later at a national laboratory. He hardly earned anything as a missionary. Between his coffeehouse, wife and three kids, it all got spent. He made a lot of money at the lab, but only worked there for about 10 to 15 years before retiring. And now? He's a part-time programmer, landlord and fixes cars. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Since the goal of his life was not money, he retired with $750,000 - and he's doing fine. You know why? Because he bought two mobile homes some time ago, and a 2.5-acre lot in the middle of nowhere and started renting them before he retired. In addition to being a landlord, he also had some of his money invested in income stocks. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     He finds low-effort ways to make money. He buys an underpriced car, fixes it up, and resells it for a $1,000 profit. He used to run a programming company with my dad. They made a little money, but gained experience. That probably helped him get accepted at the laboratory. Some people even still ask him to reprogram things for them and pay him a few thousand dollars. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Thrift shopping </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     He also doesn't spend much. He doesn't own a luxury Tesla; he owns a $5,000 Prius. The only reason he spent more on a car was that my grandma really wanted one that actually worked. The rent from their garage covers their property tax. They don't eat out except on special occasions, like birthdays or holidays, and live a comfortable, low-cost life. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     They take a 30-minute walk every day to stay healthy. My grandma loves shopping a bit too much, but she shops at thrift stores, so their shopping and entertainment expenses remain low. So my grandpa doesn't receive much Social Security, but he makes it work because he uses his money wisely. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     The American dream is to make six figures and buy a house. If you have $2.5 million in a money-market account with a 4% return, you get $100,000 a year. Realistically, no one is going to spend $100,000 a year in retirement. The average American spends $78,500 per year. That means, with no interest, $1 million would last about 12 years at that spending rate. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Is the problem really how much money we have - or how much we spend? I daresay that if you put your money in the right places and you are careful, you could even retire at 55 with $500,000 and be perfectly fine. Am I right? Of course, it's good to enjoy the fruits of our labor and spend some money on leisure. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Am I missing something big, or were my suspicions right all along? </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Skeptical Reader </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Don't miss: 'I spend $7,500 a month': I'm 47, earn $260K, and have $3 million. Can I retire at 50? </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     You can email The Moneyist with any financial and ethical questions at qfottrell@marketwatch.com. The Moneyist regrets he cannot reply to questions individually. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     To take your retirement-at-55-with-$500,000 scenario at face value would be tough. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Dear Skeptical, </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     I am on #teamgrandpa. He's done a lot right. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     He achieved three valuable things: He worked until he was 70. He found ways to make extra income, which includes renting his mobile homes for extra cash, and keeping his hand in freelance work for his former company, a job that was born from his willingness to take risks and experiment, and by using his assets to make money. And he keeps his costs low. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     It would be tough to retire at 55 with $500,000, even though it's a lot of money, although it again depends on your lifestyle and where you live. You would have to take into account healthcare costs, utilities, transportation, rent/mortgage, and property tax.  You could also explore a substantially equal periodic payment plan (SEPP) or employ the Rule of 55. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     It would be tough to retire at 55 with $500,000, even though it's a lot of money, </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     A reminder for readers out there: The \"rule of 55\" is an IRS provision that allows you to take penalty-free withdrawals from your current employer's 401(k) or 403(b) if you leave your job in the year you turn 55 - or later - without incurring a 10% early-withdrawal 10% penalty. SEPPs are IRS-approved, scheduled withdrawals from retirement accounts like 401(k)s and IRAs. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     To take your retirement-at-55-with-$500,000 scenario at face value would be tough. That money, all going well with your health, would need to last 35-40 years and inflation would also erode its value over time. Using the 4% rule, that would provide $20,000 per year (or $1,670 per month), especially as Medicare eligibility does not kick in until 65. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Your point about whether you need $1 million in retirement, as many surveys suggest - and also point out that $1 million is not enough - is well made. It all depends on your lifestyle, whether your income exceeds your expenses and how much you are willing to cut back in terms of all those extraneous expenses (from coffees and streaming services to eating out). </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Related: I'm 80 with $1 million. How do I prevent my son from being hit with inheritance tax? </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Retiring at 65 with $1 million </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     I have wondered in these pages whether people are squandering their retirement on eating out. All that pizza and spaghetti bolognese add up, as do the extras like drinks, side orders and desserts. Research suggests that people spend anywhere between $1,990 and $2,500 a year on restaurant food - and up to $3,640 on takeout. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     In fact, Americans spend almost as much on dining out ($1.5 trillion a year) as they owe in student debt ($1.8 trillion), according to the Department of Agriculture. Total spending on food exceeds $2.63 trillion. Taking those dining-out figures at face value, you would spend $123,750 by 80 if you started counting at 25. Or over $200,000, including takeout. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Americans spend almost as much on dining out as they owe in student debt. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     So, yes, I'm with your grandpa on this one. He pivoted from missionary work into the corporate sector and made enough money in the latter part of his working life to balance the books in retirement (otherwise known as \"making ends meet\"). That takes creativity, intelligence and gumption, and I'm sure your grandfather has those in spades. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     There are other roadblocks and/or forks in the road people face in retirement, including a gradual decline in health, which could lead to the need to live in an assisted-living facility. That too costs money (up to $100,000 a year or more, depending on the facility and location). Without long-term-care insurance, retirees often tap the equity in their homes. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Saving, which requires curtailing your spending, is just as critical for a comfortable retirement as investing in a 401(k), IRA or taxable brokerage account. I'm a big fan of shopping at thrift stores. (I just bought a pair of Dr. Martens boots in New York to get me through the snowstorm.) The freedom to travel after 65, if you have the ability, is also a reward for retirement. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     A healthy retirement fund rewards you with that. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     More columns from Quentin Fottrell: </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Can I stop my kids from using their inheritance to support political causes I vehemently oppose? </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     My wife's credit-card payment is three months overdue. As an authorized user, am I in trouble? </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     My stepmother cheated me out of $500K from my father's estate. What can I do? </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Check out The Moneyist's private Facebook group, where members help answer life's thorniest money issues. Post your questions, or weigh in on the latest Moneyist columns. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     By emailing your questions to The Moneyist or posting your dilemmas on The Moneyist Facebook group, you agree to have them published anonymously on MarketWatch. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     By submitting your story to Dow Jones &amp; Co., the publisher of MarketWatch, you understand and agree that we may use your story, or versions of it, in all media and platforms, including via third parties. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     -Quentin Fottrell </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     This content was created by MarketWatch, which is operated by Dow Jones &amp; Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal. </p>\n<pre class=\"mdc-article-pre\" data-v-370ea3ac=\"\"></pre>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  (END) Dow Jones Newswires</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  02-27-26 0730ET</p>\n\nCopyright (c) 2026 Dow Jones &amp; Company, Inc.</div>",
            "pub_date": "2026-02-27 20:45:46",
            "link": "https://www.morningstar.com/news/marketwatch/20260227153/my-grandpa-retired-happily-at-70-with-750k-after-working-as-a-missionary-i-know-where-most-americans-go-wrong",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Healthcare Triangle Subsidiary QuantumNexis Inc. Launches its Dubai, UAE Operations to accelerate Digital Health Transformation across the GCC Countries",
            "description": "<div class=\"mdc-article-body\">\n            \n              \n              Healthcare Triangle Subsidiary QuantumNexis Inc. Launches its Dubai, UAE Operations to accelerate Digital Health Transformation across the GCC Countries\n              \n            \n            \n              <span>\n<h2 class=\"mdc-article-heading mdc-heading__mdc mdc-heading--level-5__mdc\" data-v-618d53ae=\"\">Healthcare Triangle Subsidiary QuantumNexis Inc. Launches its Dubai, UAE Operations to accelerate Digital Health Transformation across the GCC Countries</h2>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">PR Newswire</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">PLEASANTON, Calif., Feb. 27, 2026</p>\n</span>\n<span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">The <span data-v-370fea16=\"\">Dubai</span> Operation strengthens Healthcare Triangle's mission to accelerate TeleHelath, Digital Therapeutics and population-scale care delivery across GCC.</em></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span data-v-602de5d2=\"\">PLEASANTON, Calif.</span>, <span data-v-602de5d2=\"\">Feb. 27, 2026</span> /PRNewswire/ -- Healthcare Triangle, Inc. (Nasdaq: HCTI) (\"HCTI\" or the \"Company\"), a leader in digital transformation solutions including managed services, cloud enablement, and data analytics for the healthcare and life sciences industries, today announced that its subsidiary QuantumNexis Inc. has launched its <span data-v-602de5d2=\"\">Dubai</span>, UAE operations in Meydan Free Zone to deliver clinically validated digital mental health solutions and AI powered Hospital Information System to the GCC markets.</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">\"This marks a major strategic expansion into the GCC, positioning the company to support National Healthcare Modernisation initiatives across the UAE, Saudi Arabia, Qatar, Oman, and Bahrain\" - Suresh Venkatachari, Chairman, QuantumNexis Inc.</em></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">QuantumNexis brings a powerful multi‑brand ecosystem to the region, integrating <strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Ezovion Health OS, Ziloy.ai</strong> and its strategic partnership with Better.care, all strengthened by alignment with the Partner ecosystem with Microsoft and Better.care.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">\"<span data-v-370fea16=\"\">Dubai</span> is the epicentre of digital health innovation in the Middle East,\" said Kathir K President and Chief Growth Officer, QuantumNexis. \"Our launch here reflects our commitment to enabling interoperable, AI‑native healthcare infrastructure that aligns with national visions such as UAE's NABIDH/Riayati and Saudi Arabia's Vision 2030. We are here to accelerate transformation at scale.\"</em></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Strategic Focus Areas</p><ul class=\"mdc-article-list mdc-article-list--unordered\" data-v-7b473e83=\"\"><li data-v-7b473e83=\"\">National‑scale interoperability and openEHR implementations<br data-v-7b473e83=\"\"/><br data-v-7b473e83=\"\"/></li><li data-v-7b473e83=\"\">AI‑powered clinical and operational automation<br data-v-7b473e83=\"\"/><br data-v-7b473e83=\"\"/></li><li data-v-7b473e83=\"\">Digital Mental Health through Ziloy.ai<br data-v-7b473e83=\"\"/><br data-v-7b473e83=\"\"/></li><li data-v-7b473e83=\"\">Digital front‑door and patient experience platforms<br data-v-7b473e83=\"\"/><br data-v-7b473e83=\"\"/></li><li data-v-7b473e83=\"\">Workforce capability development on Better.care and Microsoft Cloud for Healthcare<br data-v-7b473e83=\"\"/><br data-v-7b473e83=\"\"/></li><li data-v-7b473e83=\"\">Multi‑country regulatory alignment and compliance frameworks</li></ul><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Market Opportunity in the GCC</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">The GCC is one of the fastest‑growing digital health markets globally, driven by government investment, AI adoption, and national interoperability mandates.</p><ul class=\"mdc-article-list mdc-article-list--unordered\" data-v-7b473e83=\"\"><li data-v-7b473e83=\"\">The UAE digital health market is projected to reach USD 1.84 billion by 2030.<br data-v-7b473e83=\"\"/><br data-v-7b473e83=\"\"/></li><li data-v-7b473e83=\"\">Saudi Arabia digital health market is projected over USD 11 billion by 2033.</li></ul><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">QuantumNexis aims to capture significant market share by delivering interoperable, compliant, and AI‑native healthcare solutions tailored to regional needs.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">About QuantumNexis</strong><br data-v-602de5d2=\"\"/>QuantumNexis Inc, a subsidiary of Healthcare Triangle, is dedicated to advancing digital mental health solutions that are clinically validated, accessible, and culturally sensitive. Quantum Nexis's digital health ecosystem focused on AI‑powered platforms, interoperability, and healthcare modernization. Through its multi‑brand portfolio and strategic partnerships, the company supports hospitals, clinics, and health systems across Asia, the Middle East, Africa, and Europe. For more information, please visit <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4629124-1&amp;h=311593827&amp;u=https%3A%2F%2Fwww.quantumnexis.ai%2F&amp;a=www.quantumnexis.ai\" tabindex=\"0\">www.quantumnexis.ai</a></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">About Healthcare Triangle<br data-v-479a2324=\"\"/></strong>Healthcare Triangle, Inc. based in Pleasanton, California, reinforces healthcare progress through breakthrough technology and extensive industry knowledge and expertise. We support healthcare organizations including hospitals and health systems, payers, and pharma/life sciences organizations in their effort to improve health outcomes through better utilization of the data and information technologies that they rely on. Healthcare Triangle achieves HITRUST Certification for Cloud and Data Platform (CaDP), marketed as CloudEz™ and DataEz™. HITRUST Risk-based, 2-year (r2) Certified status demonstrates to our clients the highest standards for data protection and information security. Healthcare Triangle enables the adoption of new technologies, data enlightenment, business agility, and response to immediate business needs and competitive threats. The highly regulated healthcare and life sciences industries rely on Healthcare Triangle for expertise in digital transformation encompassing the cloud, security and compliance, data lifecycle management, healthcare interoperability, and clinical &amp; business performance optimization. For more information, please visit <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4629124-1&amp;h=2211778285&amp;u=http%3A%2F%2Fwww.healthcaretriangle.com%2F&amp;a=www.healthcaretriangle.com\" tabindex=\"0\">www.healthcaretriangle.com</a></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Forward-Looking Statement:</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">This report contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. These statements are based on current expectations, estimates, forecasts, and projections about the industry and markets in which Healthcare Triangle, Inc. operates, as well as management's beliefs and assumptions. Forward-looking statements include, but are not limited to, statements regarding revenue growth, margin expansion, market opportunities, and strategic initiatives. These statements involve risks, uncertainties, and assumptions that are difficult to predict. Actual outcomes may differ materially from those expressed or implied in any forward-looking statements due to various factors beyond the company's control, including changes in market conditions, client demand, regulatory developments, and execution risks. Readers are cautioned not to place undue reliance on these forward-looking statements. Healthcare Triangle, Inc. undertakes no obligation to publicly update any forward-looking statements, whether as a result of new information, future events, or otherwise, except as required by law.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Investors:</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">1-800-617-9550</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"mailto:ir@healthcaretriangle.com\" tabindex=\"0\">ir@healthcaretriangle.com</a></p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img mdc-article-image__img--12-width\" data-v-f0ef0696=\"\" style=\"width:12px;\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://edge.prnewswire.com/c/img/favicon.png?sn=SF97663&amp;sd=2026-02-27\"/></picture></span> View original content:<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://www.prnewswire.com/news-releases/healthcare-triangle-subsidiary-quantumnexis-inc-launches-its-dubai-uae-operations-to-accelerate-digital-health-transformation-across-the-gcc-countries-302699573.html\" tabindex=\"0\">https://www.prnewswire.com/news-releases/healthcare-triangle-subsidiary-quantumnexis-inc-launches-its-dubai-uae-operations-to-accelerate-digital-health-transformation-across-the-gcc-countries-302699573.html</a></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">SOURCE Healthcare Triangle, Inc.</p></span>\n<span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img\" data-v-f0ef0696=\"\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://rt.prnewswire.com/rt.gif?NewsItemId=SF97663&amp;Transmission_Id=202602270718PR_NEWS_USPR_____SF97663&amp;DateId=20260227\"/></picture></span>\n</div>",
            "pub_date": "2026-02-27 20:36:31",
            "link": "https://www.morningstar.com/news/pr-newswire/20260227sf97663/healthcare-triangle-subsidiary-quantumnexis-inc-launches-its-dubai-uae-operations-to-accelerate-digital-health-transformation-across-the-gcc-countries",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Dow Jones Top Energy Headlines at 7 AM ET: Oil Rises With Focus on U.S.-Iran Talks, OPEC+ Meeting | OPEC+ ...",
            "description": "<div class=\"mdc-article-body\">\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Oil Rises With Focus on U.S.-Iran Talks, OPEC+ Meeting </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Oil prices rose as traders digested news that the U.S. and Iran would resume discussions next week after talks wrapped up on Thursday without a deal. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     ---- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  OPEC+ Expected to Resume Output Hikes at Sunday Meeting </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  The alliance faces a familiar dilemma: add barrels to the market or continue holding back against a fragile geopolitical backdrop. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     ---- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  CPP Investments, Equinix in $4 Billion Deal to Buy Nordic Data-Center Operator atNorth </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  The Canada Pension Plan Investment Board takes a 60% stake in the Nordic data-center operator, with digital infrastructure company Equinix owning 40%. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     ---- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Energy &amp; Utilities Roundup: Market Talk </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Find insight on Eni, Veolia, CSE Global and more in the latest Market Talks covering Energy and Utilities. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     ---- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  U.S.-Iran nuclear talks end, but with hope that negotiations continue. That still leaves the oil market in limbo. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Nuclear talks on Thursday were expected to ease the uncertainty surrounding tensions between the U.S. and Iran. They ended with the promise of further discussions. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     ---- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Big Oil Is Urging Trump to Stop Battle on Offshore Wind </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  The president's assault on wind farms is stalling a legislative push to speed permitting for energy projects. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     ---- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Engie to Buy UK Power Networks for $14.2 Billion From Hong Kong's CK Group </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  France's Engie will acquire UK Power Networks for 10.5 billion pounds in equity value, equivalent to about $14.2 billion, from Hong Kong billionaire Li Ka-shing's CK Group. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     ---- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Eni Earnings Rise on Higher Production </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Adjusted net profit-the company's preferred metric-jumped 35% and earnings were supported by a more than 7% rise in oil and gas production. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     ---- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Energy &amp; Utilities Roundup: Market Talk </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Find insight on oil futures, Veolia and more in the latest Market Talks covering Energy and Utilities. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     ---- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  U.S. Opens the Way for Fuel-Starved Cuba to Get Oil Shipments </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  The Treasury Department also said some shipments of American fuel could be legal to relieve the humanitarian crisis on the Communist island. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     ---- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  U.S. Crude Oil Stockpiles Post Large Weekly Build </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Crude oil inventories rose by 16 million barrels, posting their biggest weekly increase in three years as imports rose, exports fell and refineries cut their capacity use. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     ---- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Nordex Surges 16% on Earnings Beat, Potential U.S. Expansion </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Energy demand from AI-driven data center expansion will drive demand momentum in North America, the wind-turbine manufacturer said. </p>\n<pre class=\"mdc-article-pre\" data-v-370ea3ac=\"\"></pre>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  (END) Dow Jones Newswires</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  February 27, 2026 07:15 ET (12:15 GMT)</p>\n\nCopyright (c) 2026 Dow Jones &amp; Company, Inc.</div>",
            "pub_date": "2026-02-27 20:25:43",
            "link": "https://www.morningstar.com/news/dow-jones/202602275030/dow-jones-top-energy-headlines-at-7-am-et-oil-rises-with-focus-on-us-iran-talks-opec-meeting-opec",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Atlas Salt Commences Site Preparation Activities",
            "description": "<div class=\"mdc-article-body\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">ST GEORGE'S, NL / <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://www.accessnewswire.com/\" tabindex=\"0\">ACCESS Newswire</a> / February 27, 2026 / </strong><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Atlas Salt Inc. (\"Atlas Salt\" or the \"Company\") (TSXV:SALT)(OTCQX:SALQF)(FRA:9D00)</strong> announces that it has fulfilled the applicable Environmental Assessment (\"EA\") conditions necessary to initiate Early Works for the Great Atlantic Salt Project (the \"Project\"), located near St. George's, Newfoundland and Labrador.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Commencement of Land Clearing and Site Preparation Activities</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">The Company confirms that:</p><ul class=\"mdc-article-list mdc-article-list--unordered\" data-v-7b473e83=\"\"><li data-v-7b473e83=\"\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">The Early Works Development Plan and associated Environmental Management Plans have received approval from the Government of Newfoundland and Labrador, as previously disclosed.</p></li><li data-v-7b473e83=\"\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">The Benefits Agreement between Atlas Salt and the Province of Newfoundland and Labrador has been approved by necessary provincial entities, including Cabinet, and has been executed.</p></li><li data-v-7b473e83=\"\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Atlas Salt has received a formal Letter of Release confirming satisfaction of the applicable Environmental Assessment conditions required to commence Early Works Phase activities.</p></li></ul><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">With these approvals and the Letter of Release in place, Atlas Salt is immediately commencing permitted land clearing and related site preparation activities.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Transition to Site Activity</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Fulfillment of EA conditions for the Great Atlantic Salt Project represents a key regulatory milestone, enabling Atlas Salt to advance from permitting and planning into physical Early Works execution. Initial activities will include permitted land clearing, grubbing, and site preparation required to establish the mine site footprint and support subsequent construction phases.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Nolan Peterson, President and CEO of Atlas Salt, commented:</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">\"With the execution of the Benefits Agreement with the Province of Newfoundland and Labrador and satisfaction of the Early Works conditions under our approved Environmental Assessment, we are now moving into site preparation and initial construction at the Great Atlantic Salt Project. Beginning construction is a major milestone achievement for any mining project. For Atlas and the Great Atlantic Salt Project, it reflects disciplined progress and growing momentum as we continue advancing the project toward full development and production.\"</em></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Regulatory and Stakeholder Alignment</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Completion of the EA conditions and associated approvals reflects ongoing coordination with provincial regulators and stakeholders. The Benefits Agreement establishes a framework supporting employment, procurement, training, and community participation throughout the construction and operations phases of the Project. Atlas Salt will continue to advance required regulatory submissions as the Project progresses into subsequent phases.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">For further information and ongoing updates, please visit <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://pr.report/j3wx\" tabindex=\"0\">https://atlassalt.com</a>.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">About Atlas Salt</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Atlas Salt is developing North America's next salt mine and is committed to responsible and sustainable mining practices. With a focus on innovation and efficiency, the company is poised to make significant contributions to the North American salt market while upholding its values of environmental stewardship and community engagement.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><em class=\"mdc-article-emphasis\" data-v-370fea16=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">For information, please contact:</strong></em></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Jeff Kilborn, CFO &amp; VP Corporate Development </strong><br data-v-602de5d2=\"\"/><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"mailto:investors@atlassalt.com\" tabindex=\"0\">investors@atlassalt.com</a><br data-v-602de5d2=\"\"/>(709) 275-2009</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">We seek safe harbour.</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Cautionary Statement</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">Neither the TSX Venture Exchange nor its Regulation Services Provider, (as the term is defined in the Policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release. This press release includes certain \"forward-looking information\" and \"forward-looking statements\" (collectively \"forward-looking statements\") within the meaning of applicable Canadian securities legislation. All statements, other than statements of historical fact, included herein, without limitation, statements relating to the future operating or financial performance of the Company, are forward-looking statements. Forward-looking statements are frequently, but not always, identified by words such as \"expects\", \"anticipates\", \"believes\", \"intends\", \"estimates\", \"potential\", \"possible\", and similar expressions, or statements that events, conditions, or results \"will\", \"may\", \"could\", or \"should\" occur or be achieved. Forward-looking statements in this press release relate to, among other things: obtaining financing, completion, delivery and timing of project components and requirements, and analysis and assumptions related thereto. Actual future results may differ materially. There can be no assurance that such statements will prove to be accurate, and actual results and future events could differ materially from those anticipated in such statements. Forward-looking statements reflect the beliefs, opinions and projections on the date the statements are made and are based upon a number of assumptions and estimates that, while considered reasonable by the respective parties, are inherently subject to significant business, technical, economic, and competitive uncertainties and contingencies. Many factors, both known and unknown, could cause actual results, performance or achievements to be materially different from the results, performance or achievements that are or may be expressed or implied by such forward-looking statements and the parties have made assumptions and estimates based on or related to many of these factors. Such factors include, without limitation: the timing, completion and delivery of required permits, supply arrangements and financing. Readers should not place undue reliance on the forward-looking statements and information contained in this news release concerning these times. Except as required by law, the Company does not assume any obligation to update the forward-looking statements of beliefs, opinions, projections, or other factors, should they change, except as required by law.</em></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">SOURCE:</strong> Atlas Salt Inc.</p><br/><br/>View the original <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://www.accessnewswire.com/newsroom/en/metals-and-mining/atlas-salt-commences-site-preparation-activities-1142062\" tabindex=\"0\">press release</a> on ACCESS Newswire<br/><br/>\n<span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img mdc-article-image__img--0-width\" data-v-f0ef0696=\"\" style=\"width:0;\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://app.accessnewswire.com/img.ashx?id=1142062\"/></picture></span></div>",
            "pub_date": "2026-02-27 20:25:42",
            "link": "https://www.morningstar.com/news/accesswire/1142062msn/atlas-salt-commences-site-preparation-activities",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "KORE Announces Agreement to be Acquired by Searchlight Capital Partners and Abry Partners",
            "description": "<div class=\"mdc-article-body\">\n            \n              \n              KORE Announces Agreement to be Acquired by Searchlight Capital Partners and Abry Partners\n              \n            \n            \n              <span>\n<h2 class=\"mdc-article-heading mdc-heading__mdc mdc-heading--level-5__mdc\" data-v-618d53ae=\"\">KORE Announces Agreement to be Acquired by Searchlight Capital Partners and Abry Partners</h2>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">PR Newswire</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">ATLANTA and NEW YORK, Feb. 27, 2026</p>\n</span>\n<span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">KORE shareholders to receive $9.25 per share in cash, representing approximately 700% premium to the unaffected price</em></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span data-v-602de5d2=\"\">ATLANTA and NEW YORK</span>, <span data-v-602de5d2=\"\">Feb. 27, 2026</span> /PRNewswire/ -- KORE Group Holdings, Inc. (NYSE: KORE) (\"KORE\" or the \"Company\"), the global pure-play Internet of Things (\"IoT\") hyperscaler and leading provider of IoT Connectivity, Solutions and Analytics, Searchlight Capital Partners, L.P. and Abry Partners, each a leading global private investment firm, today announced that they have entered into a definitive agreement and plan of merger (the \"Agreement\") under which Searchlight and Abry will acquire all of the shares of KORE's issued and outstanding common stock that are not currently owned by them in an all-cash transaction valued at approximately $726 million.</p>\n<span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://mma.prnewswire.com/media/1571455/KORE_Logo.html\" tabindex=\"0\">\n<span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img\" data-v-f0ef0696=\"\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://mma.prnewswire.com/media/1571455/KORE_Logo.jpg\"/></picture></span>\n</a>\n</p>\n</span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">The purchase price represents a 691% premium to the closing price of the Company's common stock as of December 18, 2024, the last trading day prior to Searchlight amending its Schedule 13D with the Securities and Exchange Commission to indicate that Searchlight may seek to further invest in or evaluate a full acquisition of KORE, and a 132% premium to the closing price of the Company's common stock as of November 3, 2025, the last trading day prior to Searchlight and Abry submitting a letter to the Company indicating an interest in acquiring the Company for $5.00 per share. </p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">The members of the KORE Board of Directors voted unanimously in favor of the transaction, at a special meeting by all members present, and was based on the recommendation of a Special Committee of the Board consisting solely of independent directors and advised by independent financial and legal advisors. The Special Committee was established to, among other things, evaluate the advisability and fairness of strategic alternatives to the Company and its stockholders (including unaffiliated stockholders of the Company). Upon closing, KORE will operate as a privately-held company.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Abry is presently the beneficial owner of approximately 28% of the Company's issued and outstanding shares of common stock, and Searchlight also is the holder of all of the Company's issued and outstanding Series A-1 preferred stock (with a present liquidation preference of approximately $275 million) and the holder of warrants to purchase approximately 14% of the Company's shares of common stock, on a fully diluted basis. Under the terms of the Agreement, Searchlight and Abry will acquire all issued and outstanding shares of KORE common stock not already owned by them at an all-cash price of $9.25 per share.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\"We are pleased to have reached this agreement with Abry and Searchlight, which unlocks significant value for our stockholders at a substantial premium,\" said Ron Totton, KORE's Chief Executive Officer and President. \"This agreement follows a comprehensive review of strategic alternatives by the Special Committee, which unanimously determined this transaction to be the optimal path forward. In addition to delivering immediate value to our stockholders, the partnership with Searchlight and Abry provides KORE with seasoned and strategically aligned investors to accelerate our vision as a private, customer-centric IoT leader. Both firms have an exceptional track record of helping their portfolio companies foster the growth and innovation required to be an industry leader with a loyal and satisfied customer base.\"</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Timothy Donahue, Chairman of KORE's Board of Directors and Chairman of the Special Committee, said, \"The KORE Board explored numerous strategic alternatives and carefully considered the best way to position KORE for long-term success. We strongly believe that the transaction with Searchlight and Abry was the best option to position KORE in the IoT marketplace and deliver the highest value to the Company's stockholders.\"</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Transaction Details, Approvals and Timing</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Closing of the transaction is conditioned upon, among other things, approval of the holders of a majority of the voting power represented by the outstanding shares that are entitled to vote thereon and approval by the holders of a majority of the votes cast by stockholders other than Searchlight and Abry, Board members who are affiliated with Searchlight and Abry and certain Company officers, receipt of regulatory approvals, including clearance under the Hart-Scott-Rodino (HSR) Antitrust Improvements Act of 1976, as amended, and by the Committee on Foreign Investment in the United States (CFIUS) and other customary closing conditions.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">In addition, concurrent with the signing of the merger agreement, Cerberus Telecom Acquisition Holdings, LLC, the SPAC sponsor, executed and delivered a voting and support agreement with KORE in favor of the transaction. Searchlight and Abry also executed and delivered, and certain other stockholders holding not more than 2,500,000 shares of common stock of the Company will be asked to execute and deliver, voting, support and rollover agreements with KORE in favor of the transaction. The voting agreements would terminate upon termination of the merger agreement in accordance with its terms for KORE to accept a superior offer and upon certain other circumstances. </p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">The closing of the transaction is not subject to a financing condition. KORE expects the transaction to close during the second or third quarter of 2026.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Advisors</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Rothschild &amp; Co is acting as financial advisor and Richards, Layton &amp; Finger, P.A. as legal advisor to the Special Committee. Troutman Pepper Locke LLP is serving as legal advisor to KORE. Wachtell, Lipton, Rosen &amp; Katz is serving as legal advisor to Searchlight. Kirkland &amp; Ellis LLP is acting as legal advisor to Abry. TD Cowen is acting as financial advisor to Searchlight and Abry.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">About KORE</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">KORE is a pioneer, leader, and trusted advisor delivering mission critical IoT solutions and services. We empower organizations of all sizes to improve operational and business results by simplifying the complexity of IoT. Our deep IoT knowledge and experience, global reach, purpose-built solutions, and deployment agility accelerate and materially impact our customers' business outcomes. For more information, visit <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4629078-1&amp;h=3278014104&amp;u=https%3A%2F%2Fwww.korewireless.com%2F&amp;a=korewireless.com\" tabindex=\"0\">korewireless.com</a>.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">About Searchlight</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Searchlight is a global private investment firm with more than $18 billion in assets under management and offices in New York, London, Miami and Toronto. Searchlight seeks to invest in businesses where its long-term capital and strategic support accelerate value creation for all stakeholders. For more information, please visit <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4629078-1&amp;h=2251480722&amp;u=https%3A%2F%2Fwww.searchlightcap.com%2F&amp;a=www.searchlightcap.com\" tabindex=\"0\">www.searchlightcap.com</a>.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">About Abry</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Abry Partners is one of the most experienced and successful sector-focused private equity investment firms in North America. Since its founding in 1989, the firm has completed over $90 billion of leveraged transactions and other private equity or preferred equity placements. Currently, the firm manages $16 billion of assets across several fund strategies. </p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">More information about Abry Partners: <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4629078-1&amp;h=3162337899&amp;u=https%3A%2F%2Fwww.abry.com%2F&amp;a=www.abry.com\" tabindex=\"0\">www.abry.com</a></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Additional Information and Where to Find It</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">In connection with the proposed merger, KORE intends to file a proxy statement with the SEC in connection with its solicitation of proxies regarding the stockholder vote to approve the merger. KORE and Parent also intend to jointly file a transaction statement on Schedule 13E-3. <strong class=\"mdc-article-strong\" data-v-479a2324=\"\">KORE STOCKHOLDERS ARE URGED TO READ THE PROXY STATEMENT, AS MAY BE AMENDED OR SUPPLEMENTED FROM TIME TO TIME, THE PROXY CARD, THE SCHEDULE 13E-3 AND ANY OTHER RELATED MATERIALS FILED WITH THE SEC WHEN THESE DOCUMENTS BECOME AVAILABLE BEFORE MAKING ANY DECISION WITH RESPECT TO THE MERGER, BECAUSE THESE DOCUMENTS WILL CONTAIN IMPORTANT INFORMATION ABOUT THE PROPOSED TRANSACTIONS AND THE PARTIES THERETO. </strong>Stockholders of KORE will be able to obtain a free copy of these documents (when they become available) and other documents filed by KORE with the SEC at the SEC's website at <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"http://www.sec.gov\" tabindex=\"0\">www.sec.gov</a>. In addition, KORE stockholders will be able to obtain a free copy of the proxy statement and all related documents filed by KORE with the SEC (when they become available) from KORE's website at <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4629078-1&amp;h=3408894257&amp;u=https%3A%2F%2Fwww.korewireless.com&amp;a=www.korewireless.com\" tabindex=\"0\">www.korewireless.com</a>.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Participants in the Solicitation</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">KORE and its directors, executive officers and other members of management and employees, under SEC rules, may be deemed to be participants in the solicitation of proxies from KORE's stockholders in connection with the proposed transactions. Investors and security holders may obtain more detailed information regarding the names, affiliations and interests of certain of KORE's executive officers and directors in the solicitation by reading KORE's Annual Report on Form 10-K for the fiscal year ended December 31, 2024, which was filed with the SEC on April 30, 2025, and its definitive proxy statement for the 2025 annual meeting of stockholders, which was filed with the SEC on April 30, 2025 (the \"2025 Proxy Statement\"). To the extent that holdings of KORE's securities have changed since the amounts printed in the 2025 Proxy Statement, such changes have been or will be reflected on Statements of Change in Ownership on Form 4 filed with the SEC.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Additional information regarding the interests of such individuals in the proposed merger, which may, in some cases, be different than those of KORE's stockholders generally, will be included in the proxy statement relating to the proposed merger when it is filed by KORE with the SEC. These documents (when available) may be obtained free of charge from the SEC's website at <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"http://www.sec.gov\" tabindex=\"0\">www.sec.gov</a> and KORE's website at <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4629078-1&amp;h=3408894257&amp;u=https%3A%2F%2Fwww.korewireless.com&amp;a=www.korewireless.com\" tabindex=\"0\">www.korewireless.com</a>.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Forward-Looking Statements</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">In addition to historical information, this press release includes certain forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. Such statements include both implied and express statements regarding the completion of the transaction and timing for closing; the execution and delivery of voting, support and rollover agreements; the receipt of regulatory approvals; the benefits expected from the transaction; and KORE's current expectations and projections relating to its future performance and business following closing. Such forward-looking statements are not guarantees of future performance and are subject to risks, uncertainties and other factors that may cause the actual results, performance or achievements of KORE to differ materially from the historical results or from any results expressed or implied by such forward-looking statements. Risks that could cause actual results to differ materially from those in the forward-looking statements include: the risks that the transaction will not close in the timeframe expected, or at all; the risk that the expected benefits and effects of the transaction will not be achieved; the risk that the requisite number of KORE stockholders fail to approve the transaction; the risk that a governmental entity may prohibit, delay or refuse to grant approval for the consummation of the transaction; the risk that KORE's business will suffer due to uncertainty related to the transaction; and other general economic and business risks. For a discussion of other risk factors that may impact KORE's business, please see KORE's filings with the SEC. KORE disclaims any obligation or duty to update or modify these forward-looking statements.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">No Offer or Solicitation</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">This communication is not intended to and shall not constitute an offer to buy or sell or the solicitation of an offer to buy or sell any securities, or a solicitation of any vote or approval, nor shall there be any offer, solicitation or sale of securities in any jurisdiction in which such offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of any such jurisdiction.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Contacts</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">KORE CONTACT:</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Vik Vijayvergiya<br data-v-602de5d2=\"\"/>VP, Investor Relations<br data-v-602de5d2=\"\"/>Email: <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"mailto:vvijayvergiya@korewireless.com\" tabindex=\"0\">vvijayvergiya@korewireless.com</a></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">SEARCHLIGHT CONTACT:</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Prosek<br data-v-602de5d2=\"\"/><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"mailto:pro-searchlight@prosek.com\" tabindex=\"0\">pro-searchlight@prosek.com</a></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">ABRY CONTACT:</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">FGS Global<br data-v-602de5d2=\"\"/><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"mailto:abry@fgsglobal.com\" tabindex=\"0\">abry@fgsglobal.com</a><br data-v-602de5d2=\"\"/>(212) 687-8080</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img mdc-article-image__img--12-width\" data-v-f0ef0696=\"\" style=\"width:12px;\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://edge.prnewswire.com/c/img/favicon.png?sn=CL97616&amp;sd=2026-02-27\"/></picture></span> View original content to download multimedia:<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://www.prnewswire.com/news-releases/kore-announces-agreement-to-be-acquired-by-searchlight-capital-partners-and-abry-partners-302699482.html\" tabindex=\"0\">https://www.prnewswire.com/news-releases/kore-announces-agreement-to-be-acquired-by-searchlight-capital-partners-and-abry-partners-302699482.html</a></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">SOURCE KORE Group Holdings, Inc.</p></span>\n<span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img\" data-v-f0ef0696=\"\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://rt.prnewswire.com/rt.gif?NewsItemId=CL97616&amp;Transmission_Id=202602270700PR_NEWS_USPR_____CL97616&amp;DateId=20260227\"/></picture></span>\n</div>",
            "pub_date": "2026-02-27 20:15:53",
            "link": "https://www.morningstar.com/news/pr-newswire/20260227cl97616/kore-announces-agreement-to-be-acquired-by-searchlight-capital-partners-and-abry-partners",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Norgine welcomes positive CHMP opinion recommending approval of mavorixafor in the European Union for WHIM syndrome",
            "description": "<div class=\"mdc-article-body\">\n            \n              \n              Norgine welcomes positive CHMP opinion recommending approval of mavorixafor in the European Union for WHIM syndrome\n              \n            \n            \n              <span>\n<h2 class=\"mdc-article-heading mdc-heading__mdc mdc-heading--level-5__mdc\" data-v-618d53ae=\"\">Norgine welcomes positive CHMP opinion recommending approval of mavorixafor in the European Union for WHIM syndrome</h2>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">PR Newswire</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">AMSTERDAM, Feb. 27, 2026</p>\n</span>\n<span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">CHMP recommendation marks major step toward first authorised treatment for WHIM syndrome in Europe<br data-v-370fea16=\"\"/></em><em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">Final decision expected from the European Commission in Q2 2026 <br data-v-370fea16=\"\"/></em><em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">Partnership with X4 Pharmaceuticals for Norgine-led commercialisation in Europe</em></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span data-v-602de5d2=\"\">AMSTERDAM</span>, <span data-v-602de5d2=\"\">Feb. 27, 2026</span> /PRNewswire/ -- Norgine B.V., a leading European specialty pharmaceutical company, today welcomes the positive opinion issued by the European Medicines Agency's (EMA) Committee for Medicinal Products for Human Use (CHMP) recommending the granting of a marketing authorisation under exceptional circumstances[*] for XOLREMDI<span data-v-602de5d2=\"\">®</span> (mavorixafor) in patients aged 12 years and older for the treatment of WHIM syndrome (warts, hypogammaglobulinemia, infections and myelokathexis) to increase the number of circulating mature neutrophils and lymphocytes.[1]</p>\n<span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://mma.prnewswire.com/media/2846726/Norgine_Logo.html\" tabindex=\"0\">\n<span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img\" data-v-f0ef0696=\"\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://mma.prnewswire.com/media/2846726/Norgine_Logo.jpg\"/></picture></span>\n</a>\n</p>\n</span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">This CHMP positive opinion is an important regulatory milestone for patients living with WHIM syndrome for whom there is currently no other licensed treatment option.[2] The condition results from dysfunction of the chemokine receptor (CXCR4), which impairs the release of white blood cells from the bone marrow into circulation, leading to recurrent and/or severe infections.<span data-v-602de5d2=\"\">2</span></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">The European Commission (EC) will now review the CHMP recommendation, with a final decision expected in Q2, 2026.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\"<em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">We are pleased to see this important regulatory milestone for patients living with WHIM syndrome</em>,\" said Janneke van der Kamp, Chief Executive Officer, Norgine. \"<em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">At Norgine, we have built deep expertise in delivering rare and specialty medicines across Europe, Australia and New Zealand and the positive CHMP opinion for mavorixafor reflects the type of innovation our organisation is designed to bring to patients in need</em>.\"</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">The CHMP's positive opinion for mavorixafor is supported by results from the pivotal, phase 3 clinical trial (4WHIM), a global, randomised, double-blind, placebo-controlled, 52-week multicentre study that evaluated the efficacy and safety of mavorixafor in 31 people aged 12 years and older diagnosed with WHIM syndrome.[3]</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Norgine and X4 Pharmaceuticals entered into a licensing and supply agreement in January 2025, under which Norgine will commercialise mavorixafor in Europe, Australia and New Zealand following regulatory approval. All marketing authorisations in the licensed territories will be transferred to Norgine. Once completed, Norgine will be responsible for all market access and commercialisation activities in the licensed territories. X4 will manufacture and supply mavorixafor to Norgine.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">About WHIM Syndrome</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">WHIM syndrome is an ultra-rare, combined primary immunodeficiency and chronic neutropenic disorder caused by CXCR4 receptor dysfunction that results in impaired mobilisation of white blood cells from the bone marrow into peripheral circulation. WHIM syndrome is named for its four classic manifestations: warts, hypogammaglobulinemia, infections, and myelokathexis, although only a minority of patients experience all four manifestations. People with WHIM syndrome characteristically have low blood levels of neutrophils (neutropenia) and lymphocytes (lymphopenia), and as a result, experience serious and/or frequent infections.<span data-v-602de5d2=\"\">2</span></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">About Mavorixafor</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Mavorixafor is a selective CXC chemokine receptor 4 (CXCR4) antagonist that binds to the CXCR4 receptor, preventing its interaction with CXCL12,<span data-v-602de5d2=\"\">1</span> which is currently approved in the United States under the trade name XOLREMDI® for the treatment of WHIM syndrome.<span data-v-602de5d2=\"\">3</span></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">About Norgine</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Norgine is a mid-sized EU-based pharmaceutical company with 1,500 employees, generating approximately $650 million in annual sales. At Norgine, innovation drives our mission to deliver medicines that change lives. From common conditions like constipation to rare and severe diseases such as childhood cancer, we target unmet medical needs because we believe that every scientific breakthrough deserves to reach patients in need.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">We use our innovative development, commercialisation and manufacturing capabilities as well as strategic partnerships to navigate complex pathways. Combined with our extensive history and deep regional expertise, this approach allows us to accelerate and expand the reach of life-changing medicines across Europe, Australia, and New Zealand.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">We are guided by the trust that healthcare professionals and patients place in us and remain committed to delivering innovation that transforms lives, one patient at a time.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">[*] EMA definition for Exceptional Circumstances: <em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">A type of marketing authorisation granted to medicines where the applicant is unable to provide comprehensive data on the efficacy and safety under normal conditions of use, because the condition to be treated is rare or because collection of full information is not possible or is unethical.</em></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">[1] XOLREMDI<span data-v-602de5d2=\"\">®</span> (mavorixafor) CHMP opinion<br data-v-602de5d2=\"\"/>[2] <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://rarediseases.org/rare-diseases/whim-syndrome/\" tabindex=\"0\">WHIM Syndrome - Symptoms, Causes, Treatment | NORD</a>, accessed February 2026<br data-v-602de5d2=\"\"/>[3] Badolato R, Alsina L, Azar A, et al. A phase 3 randomized trial of mavorixafor, a CXCR4 antagonist, for WHIM syndrome. <em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">Blood</em>. 2024;144(1):35‑45.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Logo - <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://mma.prnewswire.com/media/2846726/5826695/Norgine_Logo.jpg\" tabindex=\"0\">https://mma.prnewswire.com/media/2846726/5826695/Norgine_Logo.jpg</a></p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img mdc-article-image__img--12-width\" data-v-f0ef0696=\"\" style=\"width:12px;\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://edge.prnewswire.com/c/img/favicon.png?sn=LN97131&amp;sd=2026-02-27\"/></picture></span> View original content to download multimedia:<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://www.prnewswire.com/news-releases/norgine-welcomes-positive-chmp-opinion-recommending-approval-of-mavorixafor-in-the-european-union-for-whim-syndrome-302698931.html\" tabindex=\"0\">https://www.prnewswire.com/news-releases/norgine-welcomes-positive-chmp-opinion-recommending-approval-of-mavorixafor-in-the-european-union-for-whim-syndrome-302698931.html</a></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">SOURCE Norgine</p></span>\n</div>",
            "pub_date": "2026-02-27 20:15:52",
            "link": "https://www.morningstar.com/news/pr-newswire/20260227ln97131/norgine-welcomes-positive-chmp-opinion-recommending-approval-of-mavorixafor-in-the-european-union-for-whim-syndrome",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Clough Global Equity Fund Section 19(a) Notice",
            "description": "<div class=\"mdc-article-body\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><em class=\"mdc-article-emphasis\" data-v-370fea16=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Statement Pursuant to Section 19(a) of the Investment Company Act of 1940</strong></em></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">DENVER, CO / <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://www.accessnewswire.com/\" tabindex=\"0\">ACCESS Newswire</a> / February 27, 2026 / </strong>On February 27, 2026, the Clough Global Equity Fund (NYSE American:GLQ) (the \"Fund\"), a closed-end fund, paid a monthly distribution on its common stock of $0.0729 per share to shareholders of record at the close of business on February 18, 2026.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">The following table sets forth the estimated amount of the sources of distribution for purposes of Section 19 of the Investment Company Act of 1940, as amended, and the related rules adopted thereunder. The Fund estimates the following percentages, of the total distribution amount per share, attributable to (i) current and prior fiscal year net investment income, (ii) net realized short-term capital gain, (iii) net realized long-term capital gain and (iv) return of capital or other capital source as a percentage of the total distribution amount. These percentages are disclosed for the current distribution as well as the fiscal year-to-date cumulative distribution amount per share for the Fund.</p><table class=\"mdc-article-table mds-data-table mds-data-table--large\" data-v-0db7e951=\"\"><tbody class=\"mdc-article-table-body mds-data-table__body\"><tr class=\"mdc-article-table-row mds-data-table__row\"><td class=\"mdc-article-table-cell mds-data-table__cell\"><span><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Current Distribution from:</strong></span></td><td class=\"mdc-article-table-cell mds-data-table__cell\"></td><td class=\"mdc-article-table-cell mds-data-table__cell\"></td><td class=\"mdc-article-table-cell mds-data-table__cell\"></td><td class=\"mdc-article-table-cell mds-data-table__cell\"></td><td class=\"mdc-article-table-cell mds-data-table__cell\"></td><td class=\"mdc-article-table-cell mds-data-table__cell\"></td></tr><tr class=\"mdc-article-table-row mds-data-table__row\"><td class=\"mdc-article-table-cell mds-data-table__cell\"><span></span></td><td class=\"mdc-article-table-cell mds-data-table__cell\"></td><td class=\"mdc-article-table-cell mds-data-table__cell\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Per Share ($)</strong></p></td><td class=\"mdc-article-table-cell mds-data-table__cell\"></td><td class=\"mdc-article-table-cell mds-data-table__cell\"></td><td class=\"mdc-article-table-cell mds-data-table__cell\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">%</strong></p></td><td class=\"mdc-article-table-cell mds-data-table__cell\"></td></tr><tr class=\"mdc-article-table-row mds-data-table__row\"><td class=\"mdc-article-table-cell mds-data-table__cell\"><span>Net Investment Income</span></td><td class=\"mdc-article-table-cell mds-data-table__cell\"></td><td class=\"mdc-article-table-cell mds-data-table__cell\"></td><td class=\"mdc-article-table-cell mds-data-table__cell\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">0.00000</p></td><td class=\"mdc-article-table-cell mds-data-table__cell\"></td><td class=\"mdc-article-table-cell mds-data-table__cell\"></td><td class=\"mdc-article-table-cell mds-data-table__cell\"></td><td class=\"mdc-article-table-cell mds-data-table__cell\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">0.00</p></td><td class=\"mdc-article-table-cell mds-data-table__cell\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">%</p></td></tr><tr class=\"mdc-article-table-row mds-data-table__row\"><td class=\"mdc-article-table-cell mds-data-table__cell\"><span>Net Realized Short-Term Capital Gain</span></td><td class=\"mdc-article-table-cell mds-data-table__cell\"></td><td class=\"mdc-article-table-cell mds-data-table__cell\"></td><td class=\"mdc-article-table-cell mds-data-table__cell\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">0.00000</p></td><td class=\"mdc-article-table-cell mds-data-table__cell\"></td><td class=\"mdc-article-table-cell mds-data-table__cell\"></td><td class=\"mdc-article-table-cell mds-data-table__cell\"></td><td class=\"mdc-article-table-cell mds-data-table__cell\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">0.00</p></td><td class=\"mdc-article-table-cell mds-data-table__cell\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">%</p></td></tr><tr class=\"mdc-article-table-row mds-data-table__row\"><td class=\"mdc-article-table-cell mds-data-table__cell\"><span>Net Realized Long-Term Capital Gain</span></td><td class=\"mdc-article-table-cell mds-data-table__cell\"></td><td class=\"mdc-article-table-cell mds-data-table__cell\"></td><td class=\"mdc-article-table-cell mds-data-table__cell\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">0.00000</p></td><td class=\"mdc-article-table-cell mds-data-table__cell\"></td><td class=\"mdc-article-table-cell mds-data-table__cell\"></td><td class=\"mdc-article-table-cell mds-data-table__cell\"></td><td class=\"mdc-article-table-cell mds-data-table__cell\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">0.00</p></td><td class=\"mdc-article-table-cell mds-data-table__cell\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">%</p></td></tr><tr class=\"mdc-article-table-row mds-data-table__row\"><td class=\"mdc-article-table-cell mds-data-table__cell\"><span>Return of Capital or other Capital Source</span></td><td class=\"mdc-article-table-cell mds-data-table__cell\"></td><td class=\"mdc-article-table-cell mds-data-table__cell\"></td><td class=\"mdc-article-table-cell mds-data-table__cell\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">0.07290</p></td><td class=\"mdc-article-table-cell mds-data-table__cell\"></td><td class=\"mdc-article-table-cell mds-data-table__cell\"></td><td class=\"mdc-article-table-cell mds-data-table__cell\"></td><td class=\"mdc-article-table-cell mds-data-table__cell\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">100.00</p></td><td class=\"mdc-article-table-cell mds-data-table__cell\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">%</p></td></tr><tr class=\"mdc-article-table-row mds-data-table__row\"><td class=\"mdc-article-table-cell mds-data-table__cell\"><span>Total (per common share)</span></td><td class=\"mdc-article-table-cell mds-data-table__cell\"></td><td class=\"mdc-article-table-cell mds-data-table__cell\"></td><td class=\"mdc-article-table-cell mds-data-table__cell\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">0.07290</p></td><td class=\"mdc-article-table-cell mds-data-table__cell\"></td><td class=\"mdc-article-table-cell mds-data-table__cell\"></td><td class=\"mdc-article-table-cell mds-data-table__cell\"></td><td class=\"mdc-article-table-cell mds-data-table__cell\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">100.00</p></td><td class=\"mdc-article-table-cell mds-data-table__cell\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">%</p></td></tr><tr class=\"mdc-article-table-row mds-data-table__row\"><td class=\"mdc-article-table-cell mds-data-table__cell\"><span><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Fiscal Year-to-Date Cumulative Distributions from:</strong></span></td><td class=\"mdc-article-table-cell mds-data-table__cell\"></td><td class=\"mdc-article-table-cell mds-data-table__cell\"></td><td class=\"mdc-article-table-cell mds-data-table__cell\"></td><td class=\"mdc-article-table-cell mds-data-table__cell\"></td><td class=\"mdc-article-table-cell mds-data-table__cell\"></td><td class=\"mdc-article-table-cell mds-data-table__cell\"></td><td class=\"mdc-article-table-cell mds-data-table__cell\"></td><td class=\"mdc-article-table-cell mds-data-table__cell\"></td></tr><tr class=\"mdc-article-table-row mds-data-table__row\"><td class=\"mdc-article-table-cell mds-data-table__cell\"></td><td class=\"mdc-article-table-cell mds-data-table__cell\"></td><td class=\"mdc-article-table-cell mds-data-table__cell\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Per Share ($)</strong></p></td><td class=\"mdc-article-table-cell mds-data-table__cell\"></td><td class=\"mdc-article-table-cell mds-data-table__cell\"></td><td class=\"mdc-article-table-cell mds-data-table__cell\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">%</strong></p></td><td class=\"mdc-article-table-cell mds-data-table__cell\"></td></tr><tr class=\"mdc-article-table-row mds-data-table__row\"><td class=\"mdc-article-table-cell mds-data-table__cell\"><span>Net Investment Income</span></td><td class=\"mdc-article-table-cell mds-data-table__cell\"></td><td class=\"mdc-article-table-cell mds-data-table__cell\"></td><td class=\"mdc-article-table-cell mds-data-table__cell\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">0.00000</p></td><td class=\"mdc-article-table-cell mds-data-table__cell\"></td><td class=\"mdc-article-table-cell mds-data-table__cell\"></td><td class=\"mdc-article-table-cell mds-data-table__cell\"></td><td class=\"mdc-article-table-cell mds-data-table__cell\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">0.00</p></td><td class=\"mdc-article-table-cell mds-data-table__cell\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">%</p></td></tr><tr class=\"mdc-article-table-row mds-data-table__row\"><td class=\"mdc-article-table-cell mds-data-table__cell\"><span>Net Realized Short-Term Capital Gain</span></td><td class=\"mdc-article-table-cell mds-data-table__cell\"></td><td class=\"mdc-article-table-cell mds-data-table__cell\"></td><td class=\"mdc-article-table-cell mds-data-table__cell\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">0.00000</p></td><td class=\"mdc-article-table-cell mds-data-table__cell\"></td><td class=\"mdc-article-table-cell mds-data-table__cell\"></td><td class=\"mdc-article-table-cell mds-data-table__cell\"></td><td class=\"mdc-article-table-cell mds-data-table__cell\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">0.00</p></td><td class=\"mdc-article-table-cell mds-data-table__cell\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">%</p></td></tr><tr class=\"mdc-article-table-row mds-data-table__row\"><td class=\"mdc-article-table-cell mds-data-table__cell\"><span>Net Realized Long-Term Capital Gain</span></td><td class=\"mdc-article-table-cell mds-data-table__cell\"></td><td class=\"mdc-article-table-cell mds-data-table__cell\"></td><td class=\"mdc-article-table-cell mds-data-table__cell\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">0.00000</p></td><td class=\"mdc-article-table-cell mds-data-table__cell\"></td><td class=\"mdc-article-table-cell mds-data-table__cell\"></td><td class=\"mdc-article-table-cell mds-data-table__cell\"></td><td class=\"mdc-article-table-cell mds-data-table__cell\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">0.00</p></td><td class=\"mdc-article-table-cell mds-data-table__cell\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">%</p></td></tr><tr class=\"mdc-article-table-row mds-data-table__row\"><td class=\"mdc-article-table-cell mds-data-table__cell\"><span>Return of Capital or other Capital Source</span></td><td class=\"mdc-article-table-cell mds-data-table__cell\"></td><td class=\"mdc-article-table-cell mds-data-table__cell\"></td><td class=\"mdc-article-table-cell mds-data-table__cell\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">0.27580</p></td><td class=\"mdc-article-table-cell mds-data-table__cell\"></td><td class=\"mdc-article-table-cell mds-data-table__cell\"></td><td class=\"mdc-article-table-cell mds-data-table__cell\"></td><td class=\"mdc-article-table-cell mds-data-table__cell\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">100.00</p></td><td class=\"mdc-article-table-cell mds-data-table__cell\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">%</p></td></tr><tr class=\"mdc-article-table-row mds-data-table__row\"><td class=\"mdc-article-table-cell mds-data-table__cell\"><span>Total (per common share)</span></td><td class=\"mdc-article-table-cell mds-data-table__cell\"></td><td class=\"mdc-article-table-cell mds-data-table__cell\"></td><td class=\"mdc-article-table-cell mds-data-table__cell\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">0.27580</p></td><td class=\"mdc-article-table-cell mds-data-table__cell\"></td><td class=\"mdc-article-table-cell mds-data-table__cell\"></td><td class=\"mdc-article-table-cell mds-data-table__cell\"></td><td class=\"mdc-article-table-cell mds-data-table__cell\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">100.00</p></td><td class=\"mdc-article-table-cell mds-data-table__cell\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">%</p></td></tr></tbody></table><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><em class=\"mdc-article-emphasis\" data-v-370fea16=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">The amounts and sources of distributions reported in this 19(a) Notice are only estimates and not for tax reporting purposes. The actual amounts and sources of the amounts for tax reporting purposes will depend upon the Fund's investment experience during the remainder of its fiscal year and may be subject to changes based on tax regulations. The Fund will send you a Form 1099-DIV for the calendar year that will tell you how to report these distributions for federal income tax purposes. The Fund estimates that it has distributed more than its income and net realized capital gains; therefore, a portion of your distribution may be a return of capital. A return of capital may occur for example, when some or all of the money that you invested in the Fund is paid back to you. A return of capital distribution does not necessarily reflect the Fund's investment performance and should not be confused with 'yield' or 'income.'</strong></em></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Presented below are return figures, based on the change in the Fund's Net Asset Value per share (\"NAV\"), compared to the annualized distribution rate for this current distribution as a percentage of the NAV on the last business day of the month prior to distribution record date.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Fund Performance &amp; Distribution Information</strong></p><table class=\"mdc-article-table mds-data-table mds-data-table--large\" data-v-0db7e951=\"\"><tbody class=\"mdc-article-table-body mds-data-table__body\"><tr class=\"mdc-article-table-row mds-data-table__row\"><td class=\"mdc-article-table-cell mds-data-table__cell\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Fiscal Year to Date (11/1/2025 through 1/31/2026)</strong></p></td><td class=\"mdc-article-table-cell mds-data-table__cell\"></td><td class=\"mdc-article-table-cell mds-data-table__cell\"></td></tr><tr class=\"mdc-article-table-row mds-data-table__row\"><td class=\"mdc-article-table-cell mds-data-table__cell\"><span>Annualized Distribution Rate as a Percentage of NAV^</span></td><td class=\"mdc-article-table-cell mds-data-table__cell\"></td><td class=\"mdc-article-table-cell mds-data-table__cell\"></td><td class=\"mdc-article-table-cell mds-data-table__cell\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span data-v-602de5d2=\"\">9.58</span></p></td><td class=\"mdc-article-table-cell mds-data-table__cell\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span data-v-602de5d2=\"\">%</span></p></td><td class=\"mdc-article-table-cell mds-data-table__cell\"></td></tr><tr class=\"mdc-article-table-row mds-data-table__row\"><td class=\"mdc-article-table-cell mds-data-table__cell\"><span>Cumulative Distribution Rate on NAV^<span>+</span></span></td><td class=\"mdc-article-table-cell mds-data-table__cell\"></td><td class=\"mdc-article-table-cell mds-data-table__cell\"></td><td class=\"mdc-article-table-cell mds-data-table__cell\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span data-v-602de5d2=\"\">3.02</span></p></td><td class=\"mdc-article-table-cell mds-data-table__cell\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span data-v-602de5d2=\"\">%</span></p></td><td class=\"mdc-article-table-cell mds-data-table__cell\"></td></tr><tr class=\"mdc-article-table-row mds-data-table__row\"><td class=\"mdc-article-table-cell mds-data-table__cell\"><span>Cumulative Total Return on NAV*</span></td><td class=\"mdc-article-table-cell mds-data-table__cell\"></td><td class=\"mdc-article-table-cell mds-data-table__cell\"></td><td class=\"mdc-article-table-cell mds-data-table__cell\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span data-v-602de5d2=\"\">4.64</span></p></td><td class=\"mdc-article-table-cell mds-data-table__cell\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span data-v-602de5d2=\"\">%</span></p></td><td class=\"mdc-article-table-cell mds-data-table__cell\"></td></tr><tr class=\"mdc-article-table-row mds-data-table__row\"><td class=\"mdc-article-table-cell mds-data-table__cell\"><span></span></td><td class=\"mdc-article-table-cell mds-data-table__cell\"></td><td class=\"mdc-article-table-cell mds-data-table__cell\"></td><td class=\"mdc-article-table-cell mds-data-table__cell\"></td><td class=\"mdc-article-table-cell mds-data-table__cell\"></td><td class=\"mdc-article-table-cell mds-data-table__cell\"></td></tr><tr class=\"mdc-article-table-row mds-data-table__row\"><td class=\"mdc-article-table-cell mds-data-table__cell\"><span><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Average Annual Total Return on NAV for the 5-Year Period Ending 1/31/2026**</strong></span></td><td class=\"mdc-article-table-cell mds-data-table__cell\"></td><td class=\"mdc-article-table-cell mds-data-table__cell\"></td><td class=\"mdc-article-table-cell mds-data-table__cell\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span data-v-602de5d2=\"\">0.80</span></p></td><td class=\"mdc-article-table-cell mds-data-table__cell\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span data-v-602de5d2=\"\">%</span></p></td><td class=\"mdc-article-table-cell mds-data-table__cell\"></td></tr></tbody></table><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><em class=\"mdc-article-emphasis\" data-v-370fea16=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Past performance is not indicative of future results.</strong></em></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">^ Based on the Fund's NAV as of January 31, 2026.</em></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><em class=\"mdc-article-emphasis\" data-v-370fea16=\"\"><span data-v-370fea16=\"\">+</span>Cumulative distribution rate is based on distributions paid to date for the period November 1, 2025 through February 28, 2026.</em></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">*Cumulative fiscal year-to-date return is based on the change in NAV including distributions paid and assuming reinvestment of these distributions for the period November 1, 2025 through January 31, 2026.</em></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">**The 5-year annualized total return is based on change in NAV including distributions paid and assuming reinvestment of these distributions and that all rights in the Fund's rights offering were exercised, as of the last business day of the month prior to the month of the current distribution record date.</em></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">While the NAV performance may be indicative of the Fund's investment performance, it does not measure the value of a shareholder's investment in the Fund. The value of a shareholder's investment in the Fund is determined by the Fund's market price, which is based on the supply and demand for the Fund's shares in the open market.</em></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><em class=\"mdc-article-emphasis\" data-v-370fea16=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Shareholders should not draw any conclusions about the Fund's investment performance from the amount of this distribution or from the terms of the Fund's Managed Distribution Plan.</strong></em></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">Furthermore, the Board of Trustees reviews the amount of any potential distribution and the income, capital gain or capital available. The Board of Trustees will continue to monitor the Fund's distribution level, taking into consideration the Fund's net asset value and the financial market environment. The Fund's distribution policy is subject to modification by the Board of Trustees at any time. The distribution rate should not be considered the dividend yield or total return on an investment in the Fund.</em></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Contact Info:</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Website: <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://pr.report/j2dr\" tabindex=\"0\">https://www.cloughcapital.com/cefs/glq/</a></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Email: <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"mailto:cloughclientinquiries@paralel.com\" tabindex=\"0\">cloughclientinquiries@paralel.com</a></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">SOURCE:</strong> Clough Global Equity Fund | GLQ</p><br/><br/>View the original <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://www.accessnewswire.com/newsroom/en/closed-end-funds-and-trusts/clough-global-equity-fund-section-19a-notice-1141509\" tabindex=\"0\">press release</a> on ACCESS Newswire<br/><br/>\n<span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img mdc-article-image__img--0-width\" data-v-f0ef0696=\"\" style=\"width:0;\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://app.accessnewswire.com/img.ashx?id=1141509\"/></picture></span></div>",
            "pub_date": "2026-02-27 20:06:46",
            "link": "https://www.morningstar.com/news/accesswire/1141509msn/clough-global-equity-fund-section-19a-notice",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        }
    ]
}