{
    "data": [
        {
            "title": "Cass Information Systems and Caspian Partner to Deliver Comprehensive Tariff Cost Management Solution",
            "description": "<div class=\"mdc-article-body\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nCass Information Systems and Caspian Partner to Deliver Comprehensive Tariff Cost Management Solution\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.cassinfo.com%2F&amp;esheet=54433759&amp;newsitemid=20260226554201&amp;lan=en-US&amp;anchor=Cass+Information+Systems%2C+Inc.&amp;index=1&amp;md5=92e925173c5e1f2fe7c3a7e07cb7466b\" tabindex=\"0\">Cass Information Systems, Inc.</a> (Nasdaq: CASS), a leading provider of enterprise payment and spend management solutions, today announced a strategic partnership with <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fmeetcaspian.com%2F&amp;esheet=54433759&amp;newsitemid=20260226554201&amp;lan=en-US&amp;anchor=Caspian&amp;index=2&amp;md5=9b04f5ca0d87d98a9cc4cd69bd39c616\" tabindex=\"0\">Caspian</a>, the AI command center for customs refunds. Together, the companies will deliver a comprehensive tariff cost management solution designed to help U.S. importers improve cash flow, strengthen compliance, and better understand their true landed product costs.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Addressing Critical Supply Chain Challenges</strong>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nOngoing tariff complexity and difficult customs processes continue to elevate compliance and financial risks for U.S. importers.\n\n</p><ul class=\"mdc-article-list mdc-article-list--unordered\" data-v-7b473e83=\"\">\n<li data-v-7b473e83=\"\">\nRefunds opportunities go undetected, unrecovered or become stuck in endless red tape\n\n</li>\n<li data-v-7b473e83=\"\">\nCompliance posture &amp; supply chain planning are reactive to geopolitics\n\n</li>\n<li data-v-7b473e83=\"\">\nPricing strategy lacks visibility to trends in product-level duty burdens\n\n</li>\n</ul><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nShippers need processes and technology that improve financial controls and supply chain resiliency, while reducing the work they face each day.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">A Connected Tariff Spend Management Offering</strong>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nThe Cass–Caspian partnership will deliver an integrated solution connecting payment, audit, compliance, recovery, and improved visibility. To enhance Cass payments and reporting, Caspian will contribute AI‑driven HTS modeling, detailed tariff audit capabilities, refund identification, and full support for post summary corrections (PSC), protests, and duty drawback programs.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nCass clients who leverage its established ocean audit capabilities and the new tariff solution will achieve true excellence in managing the costs of global trade.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Benefits to Importers: Post-Entry Process on Autopilot</strong>\n</p><ul class=\"mdc-article-list mdc-article-list--unordered\" data-v-7b473e83=\"\">\n<li data-v-7b473e83=\"\">\nReduce tariff spend by addressing misclassifications and overpayments\n\n</li>\n<li data-v-7b473e83=\"\">\nAccelerate refunds by completing audits &amp; corresponding correction filings in days\n\n</li>\n<li data-v-7b473e83=\"\">\nStrengthen CBP compliance posture by creating searchable records databases &amp; auditing shipments pre- and post-entry via integrated data feeds\n\n</li>\n<li data-v-7b473e83=\"\">\nIncrease resiliency by identifying trade compliance gaps, streamlining time-sensitive payments, and leveraging tariff refund eligibility logic that is updated daily\n\n</li>\n<li data-v-7b473e83=\"\">\nManage global trade costs (freight and duties) in one platform, with one payment process\n\n</li>\n</ul><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Leadership Perspectives</strong>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n“This partnership strengthens our ability to help importers manage tariff costs with greater accuracy and transparency,” said Tony Urban, president of Cass’s freight payment organization. “Cass has supported duty payments for years. Now by adding Caspian’s compliance, audit, and recovery capabilities, we’re able to deliver the comprehensive solution our clients have been asking for.”\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n“Caspian brings a best-in-class AI-driven tariff audit engine and advanced HTS modeling to this partnership, and our team has decades of combined experience in customs brokerage and supply chain technology,” said Justin Sherlock, co-founder and CEO of Caspian. “Together, we’ll help importers close compliance gaps, maximize tariff refunds, and increase transparency throughout the shipping lifecycle.”\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nTo learn more, contact <strong class=\"mdc-article-strong\" data-v-479a2324=\"\"><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"mailto:cassmarketing@cassinfo.com\" tabindex=\"0\">cassmarketing@cassinfo.com</a></strong>.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">About Cass Information Systems</strong>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nCass Information Systems, Inc. is a leading provider of enterprise payment and spend management solutions, helping clients manage and optimize complex facilities and transportation spend through intelligent automation, accurate auditing, and centralized visibility.<em class=\"mdc-article-emphasis\" data-v-370fea16=\"\"></em>Disbursing over $94 billion annually on behalf of clients, and with total assets of $2.6 billion, Cass is uniquely supported by Cass Commercial Bank. Founded in 1906 and a wholly owned subsidiary, Cass Commercial Bank provides sophisticated financial exchange services to the parent organization and its clients. Cass is part of the Russell 2000®. More information is available at <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.cassinfo.com&amp;esheet=54433759&amp;newsitemid=20260226554201&amp;lan=en-US&amp;anchor=www.cassinfo.com&amp;index=3&amp;md5=dce2dbdcc694d8bfd0b059d309b274c4\" tabindex=\"0\">www.cassinfo.com</a>.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">About Caspian</strong>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nCaspian is the first AI‑native trade advisory platform for international supply chains, specializing in duty drawback and tariff refund processing. Founded in 2024, Caspian is a U.S.-licensed customs broker and ABI software vendor, helping importers simplify trade processes, strengthen compliance, and recover millions in overpaid duties. Learn more at <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.meetcaspian.com&amp;esheet=54433759&amp;newsitemid=20260226554201&amp;lan=en-US&amp;anchor=www.meetcaspian.com&amp;index=4&amp;md5=e1dbe8745ea985a6e904d46e982495d4\" tabindex=\"0\">www.meetcaspian.com</a>.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img\" data-v-f0ef0696=\"\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20260226554201r1&amp;sid=mstr3&amp;distro=nx&amp;lang=en\"/></picture></span><span data-v-602de5d2=\"\"></span></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\"><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"mailto:cassmarketing@cassinfo.com\" tabindex=\"0\">cassmarketing@cassinfo.com</a></strong>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span data-v-602de5d2=\"\">View source version on businesswire.com: </span><span data-v-602de5d2=\"\"><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://www.businesswire.com/news/home/20260226554201/en/\" tabindex=\"0\">https://www.businesswire.com/news/home/20260226554201/en/</a></span></p></div>",
            "pub_date": "2026-02-26 20:40:48",
            "link": "https://www.morningstar.com/news/business-wire/20260226554201/cass-information-systems-and-caspian-partner-to-deliver-comprehensive-tariff-cost-management-solution",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Fed's Bostic Says People Have Begun to Doubt Fed Independence",
            "description": "<div class=\"mdc-article-body\">\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Fed's Bostic Says People Have Begun to Doubt Fed Independence By Vicky Ge Huang </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Atlanta Fed President Raphael Bostic said Wednesday that the rift between the Federal Reserve and the White House has begun to erode trust in the central bank's apolitical standing, one of the most direct warnings yet from a top monetary-policy official about the consequences of President Trump's aggressive stance toward the Fed. Meanwhile, Kansas City Fed President Jeff Schmid, one of the three dissenters in the Fed's December quarter-point rate cut decision, continued to express his concerns about inflation. Elsewhere, Bank of Japan policy board member Hajime Takata said that with deflation now firmly in the rearview mirror, the path is clear for the Japanese central bank to raise interest rates sooner rather than later. And South Korea's central bank held its policy rate on hold for a sixth straight meeting and raised its growth and inflation forecasts for this year, </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Top News Fed's Bostic Says People Have Begun to Doubt Fed Independence </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Writing in a farewell essay ahead of his scheduled retirement at the end of February, Atlanta Fed President Raphael Bostic said his colleagues in the Federal Reserve system remain committed to insulating their work from politics. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     \"But my travels over the past several months have made clear that the legal and rhetorical battles raging around the central bank right now have caused people across a wide cross-section of our population to begin to doubt the Fed's independence , \" Bostic wrote. \"This is a major concern.\" </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Kansas City's Schmid Says Fed Has Work to Do With Inflation </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Speaking at the Economic Club of Colorado, Kansas City Fed President Jeff Schmid said \"I think we have work to do on the inflation side of things , \" regarding the Fed's dual mandate of price stability and maximum employment. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     \"I think we're in a pretty good place for employment, even though, structurally, some things are changing in the labor market,\" he added. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Bank of Japan's Most Hawkish Member Says Rate Hike Needed Soon </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Bank of Japan policy board member Hajime Takata said in a speech Thursday: \"I believe the bank should make a further gear shift, and engage in communication that assumes that the price stability target is almost achieved.\" </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     He also flagged the risk that an external shock could drive Japan's inflation up more than expected. Takata is seen as the BOJ board's most prominent policy hawk . In January, he was the lone dissenter in an 8-1 decision to hold the policy rate at 0.75%, instead proposing a hike to 1.0%. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Bank of Korea Holds Rates Steady, Lifts Growth Forecast </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     The Bank of Korea on Thursday left its benchmark seven-day repurchase rate at 2.50% . Twenty-one of 25 analysts polled by The Wall Street Journal had expected the decision. Most expect the bank to hold rates steady this year, with some projecting possible increases in 2027. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Trade Remains 'Challenging' for Eurozone, ECB's Lagarde Says </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Eurozone exporters continue to have greater difficulty finding overseas buyers , thanks in part to changeable policy in the U.S., European Central Bank President Christine Lagarde said Thursday. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     U.S. Economy The Math Behind Trump's Eye-Catching Economic Ideas </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     In a record-length State of the Union address, President Trump threw out a string of eye-catching economic ideas. His proposals and promises come as American voters are increasingly frustrated with the economy. About 56% of Americans disapprove of his handling of it, compared with about 40% who approve, according to an average of polls collected by the nonpartisan Cook Political Report. Here's a look at the math </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  behind some of Trump's economic notions </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Americans Are Leaving the U.S. in Record Numbers </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Last year the U.S. experienced something that hasn't definitively occurred since the Great Depression: More people moved out than moved in . America's own citizens are leaving in record numbers, replanting themselves and their families in lands they find more affordable and safe. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Greer: 15% Tariff May Only Apply to Some Countries </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     President Trump may increase his 10% global tariff to 15% </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  for only some nations, his trade chief said, adding to the confusion over an increase that was announced last weekend but has yet to materialize. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Wall Street Traders Are Pouncing on the Tariff Refund Chaos </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Shipping Industry Sends Strong Consumer Demand Signal For 2026 </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Major U.S. importers are facing off against the world's largest ocean carriers in an early gut check for trade in 2026. Retailers are expecting favorable deals </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  as they kick off talks next month for ocean shipping contracts that link factories in Asia to warehouses in America. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     U.S. Should Shift Gears on Economic Policy, IMF Says </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     An alternative policy mix in the U.S. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  could achieve the Trump administration's goals while avoiding negative repercussions, the International Monetary Fund says. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Forward Guidance Thursday (all times ET) </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     8:30 a.m.: Unemployment Insurance Weekly Claims Report - Initial Claims </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     10 a.m.: Federal Reserve Vice Chair for Supervision Michelle Bowman appears before senate committee hearing </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     11 a.m.: Federal Reserve Bank of Kansas City Survey of Tenth District Manufacturing </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Friday </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     8:30 a.m.: PPI </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     9:45 a.m.: Chicago Business Barometer - ISM-Chicago Business Survey - Chicago PMI </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     3 p.m.: Agricultural Prices </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     3:30 p.m.: U.S. President Donald Trump delivers remarks at The Port of Corpus Christi </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Research Corporate Bonds Below the Highest Ratings Are in 'Good Shape' </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Corporate bonds are generally pricey, but the lower end of investment-grade and the upper tier of high yield still hold value, SanJac Alpha's Andrew Wells tells WSJ. In the high-yield space, BB and B-rated bonds are \"actually in real good shape because anything that looks risky has kind of been pushed out into private credit,\" he says. Debt accumulation to fund AI also raises concerns, so he is avoiding tech exposure. \"It's the ones that have taken on just massive amounts of debt like Oracle,\" he says. \"It certainly shows signs of an overbuild or an oversupply [of bonds] coming.\" - Paulo Trevisani </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Basis Points Canadian Prime Minister Mark Carney heads to the Indo-Pacific region </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  this week, starting with a visit to India where he aims to accelerate efforts to deepen commercial ties with the country after years of diplomatic distress. Confidence among firms in the eurozone slipped in February </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  amid fresh uncertainties surrounding Europe's political and economic relationship with the U.S. The risk premium demanded by investors to lend to countries in central and eastern Europe has fallen back </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  to levels last seen before Russia's full scale invasion of Ukraine, easing the war's negative impact on the region's economies, the European Bank for Reconstruction and Development said Thursday. About Us </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     WSJ Pro Central Banking brings you central banking news, analysis and insights from WSJ's global team of reporters and editors. This newsletter was compiled by markets reporter Vicky Ge Huang  in New York. Send your tips, suggestions and feedback to [vicky.huang@wsj.com]. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     This article is a text version of a Wall Street Journal newsletter published earlier today. </p>\n<pre class=\"mdc-article-pre\" data-v-370ea3ac=\"\"></pre>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  (END) Dow Jones Newswires</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  February 26, 2026 07:30 ET (12:30 GMT)</p>\n\nCopyright (c) 2026 Dow Jones &amp; Company, Inc.</div>",
            "pub_date": "2026-02-26 20:40:47",
            "link": "https://www.morningstar.com/news/dow-jones/202602268181/feds-bostic-says-people-have-begun-to-doubt-fed-independence",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Chubb Limited Board Will Recommend 33rd Consecutive Annual Dividend Increase to Shareholders at the 2026 Annual General Meeting; Declares Quarterly Dividend",
            "description": "<div class=\"mdc-article-body\">\n            \n              \n              Chubb Limited Board Will Recommend 33rd Consecutive Annual Dividend Increase to Shareholders at the 2026 Annual General Meeting; Declares Quarterly Dividend\n              \n            \n            \n              <span>\n<h2 class=\"mdc-article-heading mdc-heading__mdc mdc-heading--level-5__mdc\" data-v-618d53ae=\"\">Chubb Limited Board Will Recommend 33rd Consecutive Annual Dividend Increase to Shareholders at the 2026 Annual General Meeting; Declares Quarterly Dividend</h2>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">PR Newswire</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">ZURICH, Feb. 26, 2026</p>\n</span>\n<span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span data-v-602de5d2=\"\">ZURICH</span>, <span data-v-602de5d2=\"\">Feb. 26, 2026</span> /PRNewswire/ -- Chubb Limited (NYSE: CB) announced today that its Board of Directors will recommend to shareholders at the company's 2026 Annual General Meeting an increase in its quarterly dividend for the 33rd consecutive year.  The proposal calls for a $4.08 annual per share dividend, payable in four quarterly installments of $1.02 per share, compared to the current quarterly dividend amount of $0.97 per share.</p>\n<span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://mma.prnewswire.com/media/321965/Chubb_Limited_Logo.html\" tabindex=\"0\">\n<span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img\" data-v-f0ef0696=\"\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://mma.prnewswire.com/media/321965/Chubb_Limited_Logo.jpg\"/></picture></span>\n</a>\n</p>\n</span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">The Board also declared a quarterly dividend equal to $0.97 per share, payable on April 6, 2026 to shareholders of record at the close of business on March 13, 2026.  The dividend will be payable out of legal reserves and will be made in United States dollars by the company's transfer agent as described in the Chubb Limited 2025 proxy statement.  This will be the fourth installment as approved by the company's shareholders on May 15, 2025.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">About Chubb <br data-v-479a2324=\"\"/></strong>Chubb is a world leader in insurance. With operations in 54 countries and territories, Chubb provides commercial and personal property and casualty insurance, personal accident and supplemental health insurance, reinsurance and life insurance to a diverse group of clients. The company is defined by its extensive product and service offerings, broad distribution capabilities, exceptional financial strength and local operations globally. Parent company Chubb Limited is listed on the New York Stock Exchange (NYSE: CB) and is a component of the S&amp;P 500 index. Chubb employs approximately 45,000 people worldwide. Additional information can be found at: <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4627679-1&amp;h=2172247550&amp;u=https%3A%2F%2Fedge.prnewswire.com%2Fc%2Flink%2F%3Ft%3D0%26l%3Den%26o%3D4591985-1%26h%3D3363838660%26u%3Dhttps%253A%252F%252Fc212.net%252Fc%252Flink%252F%253Ft%253D0%2526l%253Den%2526o%253D4396093-1%2526h%253D3367814517%2526u%253Dhttp%25253A%25252F%25252Fwww.chubb.com%25252F%2526a%253Dwww.chubb.com%26a%3Dwww.chubb.com&amp;a=www.chubb.com\" tabindex=\"0\">www.chubb.com</a>.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\"><em class=\"mdc-article-emphasis\" data-v-370fea16=\"\"><span class=\"mdc-article-underline\" data-v-1f1bdc8a=\"\">Cautionary Statement Regarding Forward-Looking Statements:</span></em></strong> <br data-v-602de5d2=\"\"/><em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">Forward-looking statements made in this press release, such as statements regarding the company's 2026 Annual General Meeting and dividends, reflect the company's current views with respect to future events and are made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995. Such statements involve risks and uncertainties, which may cause actual results to differ materially from these statements. For example, payment of scheduled dividends could be affected by extraordinary company events or capital constraints or similar factors that could require the company to adjust, delay or withhold dividend payments.  Additional information regarding factors that could cause differences from these forward-looking statements appears in the company's filings with the Securities and Exchange Commission.  Readers are cautioned not to place undue reliance on these forward-looking statements, which speak only as of the date on which they are made. </em> </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img mdc-article-image__img--12-width\" data-v-f0ef0696=\"\" style=\"width:12px;\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://edge.prnewswire.com/c/img/favicon.png?sn=NY96113&amp;sd=2026-02-26\"/></picture></span> View original content to download multimedia:<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://www.prnewswire.com/news-releases/chubb-limited-board-will-recommend-33rd-consecutive-annual-dividend-increase-to-shareholders-at-the-2026-annual-general-meeting-declares-quarterly-dividend-302698280.html\" tabindex=\"0\">https://www.prnewswire.com/news-releases/chubb-limited-board-will-recommend-33rd-consecutive-annual-dividend-increase-to-shareholders-at-the-2026-annual-general-meeting-declares-quarterly-dividend-302698280.html</a></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">SOURCE Chubb Limited</p></span>\n<span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img\" data-v-f0ef0696=\"\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://rt.prnewswire.com/rt.gif?NewsItemId=NY96113&amp;Transmission_Id=202602260720PR_NEWS_USPR_____NY96113&amp;DateId=20260226\"/></picture></span>\n</div>",
            "pub_date": "2026-02-26 20:30:36",
            "link": "https://www.morningstar.com/news/pr-newswire/20260226ny96113/chubb-limited-board-will-recommend-33rd-consecutive-annual-dividend-increase-to-shareholders-at-the-2026-annual-general-meeting-declares-quarterly-dividend",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Telekom Srbija Group Secures Landmark International Credit Ratings from Fitch and Moody’s, Marking Historic First for Western Balkans",
            "description": "<div class=\"mdc-article-body\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Telekom Srbija Group Secures Landmark International Credit Ratings from Fitch and Moody’s, Marking Historic First for Western Balkans</strong>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nFirst Western Balkans–headquartered company to secure dual global credit ratings, shining a spotlight on the region’s rising growth and international relevance\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nTelekom Srbija Group today announced that it has received international credit ratings from Fitch Ratings and Moody’s Investors Service, marking a historic milestone as the first company headquartered in the Western Balkans to achieve this distinction.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nFitch Ratings has affirmed Telekom Srbija’s long-term issuer rating in connection with its debut issuance of bonds on the international financial market, recognizing the Group’s strong market position, resilient cash flow profile and disciplined financial strategy. Moody’s Investors Service has assigned a B1 rating to the company’s bond issuance, underscoring Telekom Srbija’s established operating performance and strategic importance within the regional telecommunications sector.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nAs the first Western Balkans–headquartered company to issue bonds on the international financial market and secure ratings from two of the world’s leading credit rating agencies, Telekom Srbija has set a new benchmark for the region’s corporate sector. The achievement signals growing investor confidence in both the company and the broader economic potential of Serbia and the Western Balkans.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Vladimir Lučić, CEO of Telekom Srbija</strong>, stated:\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n“This is a defining moment for Telekom Srbija and for the broader business community in our region. For the first time, a company headquartered in the Western Balkans has successfully accessed the international bond market and obtained credit ratings from some of the most respected global agencies. This milestone reflects the strength of our business model, the sustained growth we have delivered across our core markets and the credibility we have built with international investors. We believe this achievement will pave the way for other Serbian and regional companies to access global capital markets under competitive conditions.”\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nTelekom Srbija Group is the leading telecommunications and digital services provider in Southeast Europe, serving millions of customers across mobile, fixed, broadband and multimedia services. In recent years, the company has accelerated investments in network expansion, digital platforms and media content, reinforcing its competitive position and supporting sustainable long-term growth.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">About Telekom Srbija Group</strong>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nThe Telekom Srbija Group, headquartered in Serbia and operating in 13 countries across Europe and beyond (SER, BIH, MNE, CRO, SI, NMK, TUR, AUT, CH, GER, USA, NL, BE), is one of the largest and fastest-growing telecommunications operators in Southeast Europe, and a leader in digital transformation in the Western Balkans. With nearly 14 million subscribers and more than 13,000 employees, the Group provides services in four key segments: fixed telephony, mobile communications, internet, and multimedia.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img\" data-v-f0ef0696=\"\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20260226417288r1&amp;sid=mstr3&amp;distro=nx&amp;lang=en\"/></picture></span><span data-v-602de5d2=\"\"></span></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nIvana Bajović\n<br data-v-602de5d2=\"\"/><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"mailto:ivanabajo@telekom.rs\" tabindex=\"0\">ivanabajo@telekom.rs \n</a><br data-v-602de5d2=\"\"/>+381 64 650 7300\n<br data-v-602de5d2=\"\"/>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span data-v-602de5d2=\"\">View source version on businesswire.com: </span><span data-v-602de5d2=\"\"><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://www.businesswire.com/news/home/20260226417288/en/\" tabindex=\"0\">https://www.businesswire.com/news/home/20260226417288/en/</a></span></p></div>",
            "pub_date": "2026-02-26 20:30:35",
            "link": "https://www.morningstar.com/news/business-wire/20260226417288/telekom-srbija-group-secures-landmark-international-credit-ratings-from-fitch-and-moodys-marking-historic-first-for-western-balkans",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Dow Jones Top Energy Headlines at 7 AM ET: Oil Inches Higher Ahead of U.S.-Iran Talks | Engie ...",
            "description": "<div class=\"mdc-article-body\">\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Oil Inches Higher Ahead of U.S.-Iran Talks </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Oil prices edged higher ahead of a third round of nuclear talks between the U.S. and Iran. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     ---- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Engie to Buy UK Power Networks for $14.2 Billion From Hong Kong's CK Group </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  France's Engie will acquire UK Power Networks for 10.5 billion pounds in equity value, equivalent to about $14.2 billion, from Hong Kong billionaire Li Ka-shing's CK Group. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     ---- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Energy &amp; Utilities Roundup: Market Talk </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Find insight on Engie, Iberdrola, E.ON and more in the latest Market Talks covering Energy and Utilities. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     ---- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Eni Earnings Rise on Higher Production </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Adjusted net profit-the company's preferred metric-jumped 35% and earnings were supported by a more than 7% rise in oil and gas production. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     ---- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  U.S. Opens the Way for Fuel-Starved Cuba to Get Oil Shipments </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  The Treasury Department also said some shipments of American fuel could be legal to relieve the humanitarian crisis on the Communist island. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     ---- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  U.S. Crude Oil Stockpiles Post Large Weekly Build </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Crude oil inventories rose by 16 million barrels, posting their biggest weekly increase in three years as imports rose, exports fell and refineries cut their capacity use. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     ---- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Nordex Surges 16% on Earnings Beat, Potential U.S. Expansion </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Energy demand from AI-driven data center expansion will drive demand momentum in North America, the wind-turbine manufacturer said. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     ---- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Iberdrola's Net Profit Rises, Reiterates Guidance </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Iberdrola said net profit rose in 2025, driven by its networks business, and the energy company reiterated its guidance for the year ahead. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     ---- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  E.ON's Earnings Rise as It Spends on European Energy Infrastructure </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  E.ON's earnings rose as it expanded and upgraded energy infrastructure across Europe and it raised its investment plan to 2030. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     ---- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  First Solar Posts Higher Profit on Increase in Revenue </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  The solar-energy company posted a higher profit in fourth quarter, but issued revenue guidance for this year that missed analyst expectations. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     ---- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Iranian Oil Loadings Soar as Regional Risks Intensify Ahead of U.S. Talks </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Iran's crude loadings have surged to multiyear highs this month as geopolitical risks build ahead of a third round of nuclear talks with Washington. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     ---- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Crude Oil Prices Are Poised to Jump, Price Action Signals </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n   The lonely laggard in a yearlong surge for commodities may be getting ready to bounce higher. </p>\n<pre class=\"mdc-article-pre\" data-v-370ea3ac=\"\"></pre>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  (END) Dow Jones Newswires</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  February 26, 2026 07:15 ET (12:15 GMT)</p>\n\nCopyright (c) 2026 Dow Jones &amp; Company, Inc.</div>",
            "pub_date": "2026-02-26 20:21:26",
            "link": "https://www.morningstar.com/news/dow-jones/202602267648/dow-jones-top-energy-headlines-at-7-am-et-oil-inches-higher-ahead-of-us-iran-talks-engie",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Dow Jones Top Company Headlines at 7 AM ET: Why Nvidia's Huge Numbers Don't Settle the Latest AI Fears | Mistral ...",
            "description": "<div class=\"mdc-article-body\">\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Why Nvidia's Huge Numbers Don't Settle the Latest AI Fears </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Record sales and booming cash flow come as worries have shifted to AI's destabilizing impact. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     ---- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Mistral AI Lands Accenture as Latest Big Client </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  The agreement is a boost for the French artificial-intelligence startup as it seeks to expand its network of alliances. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     ---- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Baidu Profit Drops as Revenue Decline Continues </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  The Chinese search reported sharply lower profit, with revenue declining for a third straight quarter, as it struggles to transform its businesses in the AI era. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     ---- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Rolls-Royce Plans $12 Billion Buyback, Raises 2028 Targets </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  The engine maker said a strong balance sheet allowed it to launch the multiyear buyback program, and lifted its targets after earnings grew. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     ---- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Engie to Buy UK Power Networks for $14.2 Billion From Hong Kong's CK Group </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  France's Engie will acquire UK Power Networks for 10.5 billion pounds in equity value, equivalent to about $14.2 billion, from Hong Kong billionaire Li Ka-shing's CK Group. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     ---- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Dell's Earnings Will Highlight Benefits, and Risks, of the AI Boom </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Server and networking revenue for the quarter is estimated to be $14 billion, which is an 111% increase from last year. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     ---- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  LSEG Shares Rise After Forecast of Profitability Boost, $4 Billion Buybacks </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  The financial-data provider and exchange operator said continued revenue growth and efficiencies would help it improve profitability beyond this year. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     ---- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  HKEX Has Record Year as Hong Kong Reclaims IPO Crown </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Hong Kong hosted 119 new listings last year, raising more than triple the funds raised the previous year. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     ---- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Salesforce Sees Stable Growth Despite Wall Street's AI Concerns </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  The company expects continued revenue growth as investors worry about AI's threat to software. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     ---- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Nutanix's stock soars as AMD investment creates a 'halo effect' </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  The company, which makes hyperconverged infrastructure including storage offerings, is partnering with AMD and betting that AI customers want flexible ecosystems. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     ---- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  CoreWeave's Growth Is Booming. Can It Keep Up? </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  CoreWeave is expected to post triple-digit revenue growth, but investors are watching debt levels, Nvidia exposure and insider selling. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     ---- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  BlueScope Says $11 Billion Steel Dynamics, SGH Takeover Offer Insufficient </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Last week's proposal intensified a takeover campaign by Indiana-based Steel Dynamics, which has been involved in five bids for BlueScope since late 2024. </p>\n<pre class=\"mdc-article-pre\" data-v-370ea3ac=\"\"></pre>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  (END) Dow Jones Newswires</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  February 26, 2026 07:15 ET (12:15 GMT)</p>\n\nCopyright (c) 2026 Dow Jones &amp; Company, Inc.</div>",
            "pub_date": "2026-02-26 20:21:25",
            "link": "https://www.morningstar.com/news/dow-jones/202602267642/dow-jones-top-company-headlines-at-7-am-et-why-nvidias-huge-numbers-dont-settle-the-latest-ai-fears-mistral",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "PNCC Selects LotusFlare to Power Digital BSS and Commerce Platform for New 4G/5G Standalone Network",
            "description": "<div class=\"mdc-article-body\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">PNCC Selects LotusFlare to Power Digital BSS and Commerce Platform for New 4G/5G Standalone Network</strong>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Flotusflare.com%2F&amp;esheet=54434285&amp;newsitemid=20260226869218&amp;lan=en-US&amp;anchor=LotusFlare&amp;index=1&amp;md5=4c50741231af187e030fefbbc9219815\" tabindex=\"0\">LotusFlare</a>, a provider of a cloud-native, AI-driven digital commerce and monetization platform for communications service providers (CSPs), today announced that <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.pnccpalau.com%2F&amp;esheet=54434285&amp;newsitemid=20260226869218&amp;lan=en-US&amp;anchor=Palau+National+Communications+Corporation+%28PNCC%29&amp;index=2&amp;md5=3c891b6677b9e3e7c66fc9a8e70b1b3d\" tabindex=\"0\">Palau National Communications Corporation (PNCC)</a> has selected it to provide a comprehensive commerce and monetization platform, including a full-stack digital business support system (dBSS) as part of PNCC’s broader 4G/5G Standalone (SA) network modernization programme.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">This press release features multimedia. View the full release here: <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://www.businesswire.com/news/home/20260226869218/en/\" tabindex=\"0\">https://www.businesswire.com/news/home/20260226869218/en/</a></p><span><span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img\" data-v-f0ef0696=\"\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://mms.businesswire.com/media/20260226869218/en/2732077/4/pncc_logo_1-01.jpg\"/></picture></span><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Palau National Communications Corporation (PNCC)</p></span><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nThe LotusFlare solution will support PNCC subscribers across mobile, fixed broadband, and digital TV services, while enabling unique multi-tenant capabilities aligned with PNCC’s long-term digital and regional strategy.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nPNCC has embarked on a comprehensive technology modernization program focused on increasing speed-to-market, enhancing customer experience, and long-term operational efficiency. After a competitive tender process, PNCC selected LotusFlare for its highly skilled team, cloud-native technology, Internet DNA, and proven experience supporting leading communications service providers globally.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nAs the national telecommunications operator of the Republic of Palau, PNCC is undertaking a full network transformation to deploy a 4G/5G SA mobile network based on open architecture principles, alongside cloud-native core, OSS, BSS, and digital platforms. The program is designed to improve service agility, enhance network resilience, and support the long-term digital development of Palau.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n“PNCC is proving that geographic isolation is no longer a barrier to world-class digital experiences. By utilizing <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Flotusflare.com%2Fofferings%2Fai-powered-bss%2F&amp;esheet=54434285&amp;newsitemid=20260226869218&amp;lan=en-US&amp;anchor=LotusFlare+DNO%26%238482%3B+Cloud&amp;index=3&amp;md5=f8219f1c16380efb2f231415cca53ca5\" tabindex=\"0\">LotusFlare DNO™ Cloud</a>, PNCC is moving beyond legacy limitations to a modern, multi-tenant platform that can serve as a digital blueprint for the entire Pacific region,” said Sam Gadodia, CEO of LotusFlare. “LotusFlare’s expertise and innovative approach will help PNCC deliver valuable business outcomes and enhance the customer experience for the people of Palau.”\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nSimon Fraser, CEO of PNCC, commented: “Partnering with LotusFlare enables PNCC to deploy a cloud-native digital platform at the core of our new 4G/5G SA network. A modern, API-driven dBSS is fundamental to ensuring agility and enabling the rapid introduction of new digital services for our customers. Geographic isolation or scale should never define digital ambition - the people of Palau deserve world-class connectivity, and this transformation ensures they receive it.“\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">About PNCC</strong>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nPalau National Communications Corporation (PNCC) is the national telecommunications provider of the Republic of Palau, delivering mobile, fixed, broadband, and international connectivity services nationwide.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">About LotusFlare</strong>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nBased in Silicon Valley, LotusFlare simplifies technology and customer experience to deliver valuable outcomes for enterprises. The company’s flagship product, DNO™ Cloud, is an AI-driven, cloud-native commerce and monetization platform that serves as a digital Business Support System (BSS) for communications service providers. LotusFlare also owns and operates Nomad eSIM, a global connectivity service providing travelers with convenient, reliable, and affordable data plans in over 200 destinations.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nLotusFlare is a trusted partner to leading global enterprises, including Deutsche Telekom, T-Mobile US, A1, Globe Telecom, Liberty Latin America, Singtel, MTN, and TELUS. Learn more at <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Flotusflare.com&amp;esheet=54434285&amp;newsitemid=20260226869218&amp;lan=en-US&amp;anchor=lotusflare.com&amp;index=4&amp;md5=88d240bb1adaa77e0719b52572632e76\" tabindex=\"0\">lotusflare.com</a>.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img\" data-v-f0ef0696=\"\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20260226869218r1&amp;sid=mstr3&amp;distro=nx&amp;lang=en\"/></picture></span><span data-v-602de5d2=\"\"></span></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">LotusFlare Contact \n</strong><br data-v-602de5d2=\"\"/>Magdalena Arnautovic\n<br data-v-602de5d2=\"\"/>Senior Marketing Manager\n<br data-v-602de5d2=\"\"/>Email Address: <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"mailto:magdalena.marjanovic@lotusflare.com\" tabindex=\"0\">magdalena.marjanovic@lotusflare.com \n</a><br data-v-602de5d2=\"\"/>LotusFlare News: <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Flotusflare.com%2Fnews%2F&amp;esheet=54434285&amp;newsitemid=20260226869218&amp;lan=en-US&amp;anchor=https%3A%2F%2Flotusflare.com%2Fnews%2F&amp;index=5&amp;md5=2d1fc1558879b16facd83e51da0b7fa5\" tabindex=\"0\">https://lotusflare.com/news/ \n</a><br data-v-602de5d2=\"\"/>LinkedIn: <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.linkedin.com%2Fcompany%2Flotusflare&amp;esheet=54434285&amp;newsitemid=20260226869218&amp;lan=en-US&amp;anchor=https%3A%2F%2Fwww.linkedin.com%2Fcompany%2Flotusflare&amp;index=6&amp;md5=6bbc71063551158f5363b0c154a36e93\" tabindex=\"0\">https://www.linkedin.com/company/lotusflare</a>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span data-v-602de5d2=\"\">View source version on businesswire.com: </span><span data-v-602de5d2=\"\"><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://www.businesswire.com/news/home/20260226869218/en/\" tabindex=\"0\">https://www.businesswire.com/news/home/20260226869218/en/</a></span></p></div>",
            "pub_date": "2026-02-26 20:15:47",
            "link": "https://www.morningstar.com/news/business-wire/20260226869218/pncc-selects-lotusflare-to-power-digital-bss-and-commerce-platform-for-new-4g5g-standalone-network",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Why strategist Tom Lee believes the AI bloodbath and crypto selloff is almost over",
            "description": "<div class=\"mdc-article-body\">\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  By Barbara Kollmeyer </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Fundstrat co-founder also believes Mag 7 and crypto are near bottoms </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Fundstrat's Tom Lee is calling the end, nearly, of the AI scare trade. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Nvidia delivered solid results, but there's just a smattering of applause so far, and no sign of a rally for Thursday as investors near the end of what has been a tough month for stocks tied to the AI trade. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Nvidia CEO Jensen Huang also declared \"markets got it wrong\" over the software selloff, so we'll see his view takes hold. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     You'll find some concurrence with Huang in our call of the day from co-founder and head of research at Fundstrat, Tom Lee, who believes that selloffs for software, Magnificent 7 stocks and crypto are nearly done. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Lee said markets tend to bottom on bad news, flagging the viral AI doom post from Citrini Research that shook up investors at the start of the week. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     \"I think that we're seeing signs that we could be far along into that bottom,\" he said. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     The Mag 7 stocks MAGS have been rising since Feb. 17. Software stocks IGV have gained for the last two days and he thinks they bottomed on Feb. 23, he told clients in a video blog. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Lee believes investors are 95% into the decline of Mag 7 as he sees the rotation out of those stocks nearing an extreme level. Software is 99% done with a selloff now in the final weeks, and cryptocurrencies are also in the last weeks of a pullback, he says. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     A supportive stat for markets overall that he points to is the so-called January barometer. The argument is that if the S&amp;P 500 SPX rises for the first week of January and the month overall - the index gained 1.5% and 1.3%, respectively - February tends to be a \"payback\"month, with a median monthly average decline of 0.4%. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     That gives way to an even stronger March performance, potentially an average gain of 2%, followed by an even better April, says Lee. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Lee is sticking to some themes he flagged headed into 2026, such as energy  XLE and basic materials XLB, both of which rallied this year. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Industrials, financials and small-caps are also poised to gain in a \"stronger 2026,\" and he's also keen on Mag 7 stocks, bitcoin (BTCUSD) and Ethereum (ETHUSD), given he believes the selloff for those assets is nearly over. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Lee it should be noted is chairman of Ethereum treasury company BitMine Immersion Technologies (BMNR), and that crypto is down 30% year to date, versus a 21% drop for bitcoin. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     One of his arguments about an Ethereum bounce has to do with how much the crypto has unwound its prior bull market. In 2020, it was a 96% retracement, in 2022 that was 83%, in 2025 it was an 84% retracement. The current one is up to 90%, so he thinks that process is nearly finished. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Lee is known as one of Wall Street's most accurate forecasters who correctly told investors to buy stocks during pandemic lows and nailed the 2023 bull market. But he's also made pretty bullish calls on crypto, suggesting last summer that bitcoin could \"easily get to $200,000\" by the end of 2025, and has predicted it could top $1 million in a few years. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Lee also weighed in on Nvidia's earnings, pointing to record quarterly revenue and strong net income, plus shares trading at less than 20 times forward earnings, so about half of Costco's (COST) multiple. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Read: Here's what's necessary to return the incredibly concentrated U.S. stock market to normal levels </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     The markets </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     U.S. stock futures (ES00) (YM00) (NQ00) are slipping, with gold (GC00), silver (SI00) and oil (CL00) under pressure. </p>\n<pre class=\"mdc-article-pre\" data-v-370ea3ac=\"\">   Key asset performance                                                Last       5d     1m      YTD     1y \n   S&amp;P 500                                                              6946.13    0.94%  -0.46%  1.47%   16.62% \n   Nasdaq Composite                                                     23,152.08  1.75%  -2.96%  -0.39%  21.37% \n   10-year Treasury                                                     4.054      -2.60  -18.60  -11.80  -21.10 \n   Gold                                                                 5203.8     4.16%  -3.83%  20.12%  77.50% \n   Oil                                                                  65.62      1.05%  3.34%   14.30%  -4.65% \n   Data: MarketWatch. Treasury yields change expressed in basis points </pre>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     The buzz </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Nvidia shares (NVDA) are rising slightly following blowout earnings that still failed to trigger a bigger reaction. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Salesforce (CRM) announced a $50 billion stock buyback, but mixed results, and shares are dropping. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Nutanix (NTNX) is surging after news of an investment by chip maker Advanced Micro Devices (AMD) in the cloud computing group. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Trade Desk stock (TTD) is tumbling after the ad-tech company's revenue forecast fell short of expectations. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Snowflake stock (SNOW) is down after mixed earnings from the data-warehousing software group. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Weekly jobless claims are due at 8:30 a.m. Fed Vice Chair for Supervision Michelle Bowman will testify to Congress at 10 a.m. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Best of the web </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Inside the $265 million war over who writes America's AI rules. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     DeepSeek withholds latest AI model from U.S. chip makers including Nvidia, sources say. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Americans are leaving the U.S. in record numbers. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     The chart </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     The chart from Citadel Securities, it its response to the viral Citrini piece,  shows how despite AI job displacement worries, software engineer job postings are rising this year. Citadel's macro strategist Frank Flight asserts that AI adoption will be slower than many think and therefore abrupt labor disruption is unlikely to happen. \"It seems more likely that AI will be a complement rather than a substitute for labor is many areas,\" he writes. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Top tickers </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     These were the top-searched tickers on MarketWatch as of 6 a.m.: </p>\n<pre class=\"mdc-article-pre\" data-v-370ea3ac=\"\">   Ticker  Security name \n   NVDA    Nvidia \n   TSLA    Tesla \n   TSM     Taiwan Semiconductor Manufacturing \n   GME     GameStop \n   MSFT    Microsoft \n   PLTR    Palantir \n   INFY    Infosys \n   AMZN    Amazon \n   AAPL    Apple \n   NFLX    Netflix </pre>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Random reads </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Japan's naked festival just got bigger. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Scientists crack secrets of squeaky basketball sneakers. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Another mystery cracked - why there are snowmen-shaped objects in space. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     BEYOND THE NEWSROOM </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     MarketWatch Picks: 'Waiting it out could mean missing out.' What 4 pros say CD rates will look like in March - and beyond </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     -Barbara Kollmeyer </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     This content was created by MarketWatch, which is operated by Dow Jones &amp; Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal. </p>\n<pre class=\"mdc-article-pre\" data-v-370ea3ac=\"\"></pre>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  (END) Dow Jones Newswires</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  02-26-26 0705ET</p>\n\nCopyright (c) 2026 Dow Jones &amp; Company, Inc.</div>",
            "pub_date": "2026-02-26 20:15:47",
            "link": "https://www.morningstar.com/news/marketwatch/20260226153/why-strategist-tom-lee-believes-the-ai-bloodbath-and-crypto-selloff-is-almost-over",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Viatris Maintains Dividend Policy for 2026 and Announces Quarterly Dividend",
            "description": "<div class=\"mdc-article-body\">\n            \n              \n              Viatris Maintains Dividend Policy for 2026 and Announces Quarterly Dividend\n              \n            \n            \n              <span>\n<h2 class=\"mdc-article-heading mdc-heading__mdc mdc-heading--level-5__mdc\" data-v-618d53ae=\"\">Viatris Maintains Dividend Policy for 2026 and Announces Quarterly Dividend</h2>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">PR Newswire</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">PITTSBURGH, Feb. 26, 2026</p>\n</span>\n<span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span data-v-602de5d2=\"\">PITTSBURGH</span>, <span data-v-602de5d2=\"\">Feb. 26, 2026</span> /PRNewswire/ -- <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4627743-1&amp;h=3106458585&amp;u=https%3A%2F%2Fwww.viatris.com%2Fen&amp;a=Viatris+Inc\" tabindex=\"0\">Viatris Inc</a>. (Nasdaq: VTRS) today announced that on February 23, 2026, its Board of Directors approved a 2026 dividend policy of 48 cents ($0.48) per share and declared a quarterly dividend of 12 cents ($0.12) for each issued and outstanding share of the Company's common stock. The dividend is payable on March 18, 2026, to shareholders of record as of the close of business on March 9, 2026. This marks the sixth consecutive year the Company has paid a dividend.                 </p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">About Viatris <br data-v-479a2324=\"\"/></strong><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4627743-1&amp;h=2734135206&amp;u=https%3A%2F%2Fwww.viatris.com%2Fen&amp;a=Viatris+Inc.\" tabindex=\"0\">Viatris Inc.</a> (Nasdaq: VTRS) is a global healthcare company uniquely positioned to bridge the traditional divide between generics and brands, combining the best of both to more holistically address healthcare needs globally. With a mission to empower people worldwide to live healthier at every stage of life, we provide access at scale, currently supplying high-quality medicines to approximately 1 billion patients around the world annually and touching all of life's moments, from birth to the end of life, acute conditions to chronic diseases. With our exceptionally extensive and diverse portfolio of medicines, a one-of-a-kind global supply chain designed to reach more people when and where they need them, and the scientific expertise to address some of the world's most enduring health challenges, access takes on deep meaning at Viatris. We are headquartered in the U.S., with global centers in Pittsburgh, Shanghai and Hyderabad, India. Learn more at <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4627743-1&amp;h=2173865400&amp;u=https%3A%2F%2Fwww.viatris.com%2Fen&amp;a=viatris.com\" tabindex=\"0\">viatris.com</a> and <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4627743-1&amp;h=3394414752&amp;u=https%3A%2F%2Finvestor.viatris.com%2F&amp;a=investor.viatris.com\" tabindex=\"0\">investor.viatris.com</a>, and connect with us on <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4627743-1&amp;h=2582944302&amp;u=https%3A%2F%2Fwww.linkedin.com%2Fcompany%2Fviatris%2Fmycompany%2Fverification%2F&amp;a=LinkedIn\" tabindex=\"0\">LinkedIn</a>, <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4627743-1&amp;h=1954792832&amp;u=https%3A%2F%2Fwww.instagram.com%2Fviatrisinc&amp;a=Instagram\" tabindex=\"0\">Instagram</a>, <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4627743-1&amp;h=2932500400&amp;u=http%3A%2F%2Fwww.youtube.com%2Fviatris&amp;a=YouTube\" tabindex=\"0\">YouTube</a> and <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4627743-1&amp;h=4090422056&amp;u=https%3A%2F%2Ftwitter.com%2FViatrisInc&amp;a=X\" tabindex=\"0\">X</a>.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Forward-Looking Statements<br data-v-479a2324=\"\"/></strong>This press release includes statements that constitute \"forward-looking statements.\" These statements are made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995. Such forward-looking statements may include statements that Viatris' Board of Directors approved a 2026 dividend policy of 48 cents ($0.48) per share and declared a quarterly dividend of 12 cents ($0.12) for each issued and outstanding share of the Company's common stock, payable on March 18, 2026, to shareholders of record as of the close of business on March 9, 2026. Because forward-looking statements inherently involve risks and uncertainties, actual future results may differ materially from those expressed or implied by such forward-looking statements. Factors that could cause or contribute to such differences include, but are not limited to: actions and decisions of healthcare and pharmaceutical regulators; our ability to comply with applicable laws and regulations; changes in healthcare and pharmaceutical laws and regulations in the U.S. and abroad; any regulatory, legal or other impediments to Viatris' ability to bring new products to market; products in development and/or that receive regulatory approval may not achieve expected levels of market acceptance, efficacy or safety; longer review, response and approval times as a result of evolving regulatory priorities and reductions in personnel at health agencies; Viatris' or its partners' ability to develop, manufacture, and commercialize products; the scope, timing and outcome of any ongoing legal proceedings, and the impact of any such proceedings on Viatris; Viatris' failure to achieve expected or targeted future financial and operating performance and results; goodwill or impairment charges or other losses; any changes in or difficulties with the Company's manufacturing facilities; risks associated with international operations; changes in third-party relationships; the effect of any changes in Viatris' or its partners' customer and supplier relationships and customer purchasing patterns; the impacts of competition; changes in the economic and financial conditions of Viatris or its partners; uncertainties regarding future demand, pricing and reimbursement for the Company's products; uncertainties and matters beyond the control of management, including but not limited to general political and economic conditions, potential adverse impacts from future tariffs and trade restrictions, inflation rates and global exchange rates; and the other risks described in Viatris' filings with the Securities and Exchange Commission (\"SEC\"). Viatris routinely uses its website as a means of disclosing material information to the public in a broad, non-exclusionary manner for purposes of the SEC's Regulation Fair Disclosure (Reg FD). Viatris undertakes no obligation to update these statements for revisions or changes after the date of this press release other than as required by law.</p><span><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://mma.prnewswire.com/media/1983916/Viatris_OUS_Logo.html\" tabindex=\"0\"><span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img\" data-v-f0ef0696=\"\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://mma.prnewswire.com/media/1983916/Viatris_OUS_Logo.jpg\"/></picture></span></a></p></span>\n<span>\n</span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img mdc-article-image__img--12-width\" data-v-f0ef0696=\"\" style=\"width:12px;\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://edge.prnewswire.com/c/img/favicon.png?sn=NE96175&amp;sd=2026-02-26\"/></picture></span> View original content to download multimedia:<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://www.prnewswire.com/news-releases/viatris-maintains-dividend-policy-for-2026-and-announces-quarterly-dividend-302697710.html\" tabindex=\"0\">https://www.prnewswire.com/news-releases/viatris-maintains-dividend-policy-for-2026-and-announces-quarterly-dividend-302697710.html</a></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">SOURCE Viatris Inc.</p></span>\n<span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img\" data-v-f0ef0696=\"\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://rt.prnewswire.com/rt.gif?NewsItemId=NE96175&amp;Transmission_Id=202602260655PR_NEWS_USPR_____NE96175&amp;DateId=20260226\"/></picture></span>\n</div>",
            "pub_date": "2026-02-26 20:05:51",
            "link": "https://www.morningstar.com/news/pr-newswire/20260226ne96175/viatris-maintains-dividend-policy-for-2026-and-announces-quarterly-dividend",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Why strategist Tom Lee believes the AI bloodbath and crypto selloff is almost over",
            "description": "<div class=\"mdc-article-body\">\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  By Barbara Kollmeyer </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Fundstrat co-founder also believes Mag 7 and crypto are near bottoms </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Fundstrat's Tom Lee is calling the end, nearly, of the AI scare trade. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Nvidia delivered solid results, but there's just a smattering of applause so far, and no sign of a rally for Thursday as investors near the end of what has been a tough month for stocks tied to the AI trade. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Nvidia CEO Jensen Huang also declared \"markets got it wrong\" over the software selloff, so we'll see his view takes hold. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     You'll find some concurrence with Huang in our call of the day from co-founder and head of research at Fundstrat, Tom Lee, who believes that selloffs for software, Magnificent 7 stocks and crypto are nearly done. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Lee said markets tend to bottom on bad news, flagging the viral AI doom post from Citrini Research that shook up investors at the start of the week. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     \"I think that we're seeing signs that we could be far along into that bottom,\" he said. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     The Mag 7 stocks MAGS have been rising since Feb. 17. Software stocks IGV have gained for the last two days and he thinks they bottomed on Feb. 23, he told clients in a video blog. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Lee believes investors are 95% into the decline of Mag 7 as he sees the rotation out of those stocks nearing an extreme level. Software is 99% done with a selloff now in the final weeks, and cryptocurrencies are also in the last weeks of a pullback, he says. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     A supportive stat for markets overall that he points to is the so-called January barometer. The argument is that if the S&amp;P 500 SPX rises for the first week of January and the month overall - the index gained 1.5% and 1.3%, respectively - February tends to be a \"payback\"month, with a median monthly average decline of 0.4%. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     That gives way to an even stronger March performance, potentially an average gain of 2%, followed by an even better April, says Lee. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Lee is sticking to some themes he flagged headed into 2026, such as energy  XLE and basic materials XLB, both of which rallied this year. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Industrials, financials and small-caps are also poised to gain in a \"stronger 2026,\" and he's also keen on Mag 7 stocks, bitcoin (BTCUSD) and Ethereum (ETHUSD), given he believes the selloff for those assets is nearly over. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Lee it should be noted is chairman of Ethereum treasury company BitMine Immersion Technologies (BMNR), and that crypto is down 30% year to date, versus a 21% drop for bitcoin. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     One of his arguments about an Ethereum bounce has to do with how much the crypto has unwound its prior bull market. In 2020, it was a 96% retracement, in 2022 that was 83%, in 2025 it was an 84% retracement. The current one is up to 90%, so he thinks that process is nearly finished. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Lee is known as one of Wall Street's most accurate forecasters who correctly told investors to buy stocks during pandemic lows and nailed the 2023 bull market. But he's also made pretty bullish calls on crypto, suggesting last summer that bitcoin could \"easily get to $200,000\" by the end of 2025, and has predicted it could top $1 million in a few years. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Lee also weighed in on Nvidia's earnings, pointing to record quarterly revenue and strong net income, plus shares trading at less than 20 times forward earnings, so about half of Costco's (COST) multiple. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Read: Here's what's necessary to return the incredibly concentrated U.S. stock market to normal levels </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     The markets </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     U.S. stock futures (ES00) (YM00) (NQ00) are slipping, with gold (GC00), silver (SI00) and oil (CL00) under pressure. </p>\n<pre class=\"mdc-article-pre\" data-v-370ea3ac=\"\">   Key asset performance                                                Last       5d     1m      YTD     1y \n   S&amp;P 500                                                              6946.13    0.94%  -0.46%  1.47%   16.62% \n   Nasdaq Composite                                                     23,152.08  1.75%  -2.96%  -0.39%  21.37% \n   10-year Treasury                                                     4.054      -2.60  -18.60  -11.80  -21.10 \n   Gold                                                                 5203.8     4.16%  -3.83%  20.12%  77.50% \n   Oil                                                                  65.62      1.05%  3.34%   14.30%  -4.65% \n   Data: MarketWatch. Treasury yields change expressed in basis points </pre>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     The buzz </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Nvidia shares (NVDA) are rising slightly following blowout earnings that still failed to trigger a bigger reaction. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Salesforce (CRM) announced a $50 billion stock buyback, but mixed results, and shares are dropping. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Nutanix (NTNX) is surging after news of an investment by chip maker Advanced Micro Devices (AMD) in the cloud computing group. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Trade Desk stock (TTD) is tumbling after the ad-tech company's revenue forecast fell short of expectations. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Snowflake stock (SNOW) is down after mixed earnings from the data-warehousing software group. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Weekly jobless claims are due at 8:30 a.m. Fed Vice Chair for Supervision Michelle Bowman will testify to Congress at 10 a.m. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Best of the web </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Inside the $265 million war over who writes America's AI rules. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     DeepSeek withholds latest AI model from U.S. chip makers including Nvidia, sources say. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Americans are leaving the U.S. in record numbers. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     The chart </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     The chart from Citadel Securities, it its response to the viral Citrini piece,  shows how despite AI job displacement worries, software engineer job postings are rising this year. Citadel's macro strategist Frank Flight asserts that AI adoption will be slower than many think and therefore abrupt labor disruption is unlikely to happen. \"It seems more likely that AI will be a complement rather than a substitute for labor is many areas,\" he writes. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Top tickers </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     These were the top-searched tickers on MarketWatch as of 6 a.m.: </p>\n<pre class=\"mdc-article-pre\" data-v-370ea3ac=\"\">   Ticker  Security name \n   NVDA    Nvidia \n   TSLA    Tesla \n   TSM     Taiwan Semiconductor Manufacturing \n   GME     GameStop \n   MSFT    Microsoft \n   PLTR    Palantir \n   INFY    Infosys \n   AMZN    Amazon \n   AAPL    Apple \n   NFLX    Netflix </pre>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Random reads </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Japan's naked festival just got bigger. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Scientists crack secrets of squeaky basketball sneakers. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Another mystery cracked - why there are snowmen-shaped objects in space. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     BEYOND THE NEWSROOM </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     MarketWatch Picks: 'Waiting it out could mean missing out.' What 4 pros say CD rates will look like in March - and beyond </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     -Barbara Kollmeyer </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     This content was created by MarketWatch, which is operated by Dow Jones &amp; Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal. </p>\n<pre class=\"mdc-article-pre\" data-v-370ea3ac=\"\"></pre>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  (END) Dow Jones Newswires</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  02-26-26 0655ET</p>\n\nCopyright (c) 2026 Dow Jones &amp; Company, Inc.</div>",
            "pub_date": "2026-02-26 20:05:50",
            "link": "https://www.morningstar.com/news/marketwatch/20260226152/why-strategist-tom-lee-believes-the-ai-bloodbath-and-crypto-selloff-is-almost-over",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        }
    ]
}