{
    "data": [
        {
            "title": "Popular, Inc. Declares a Cash Dividend of $0.75 per Common Share",
            "description": "<div class=\"mdc-article-body\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Popular, Inc. Declares a Cash Dividend of $0.75 per Common Share</strong>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nPopular, Inc. (NASDAQ: BPOP) announced today that its Board of Directors has approved a quarterly cash dividend of $0.75 per share on its outstanding common stock. The dividend will be payable on April 1, 2026 to shareholders of record at the close of business on March 18, 2026.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">About Popular, Inc.</strong>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nPopular, Inc. (NASDAQ: BPOP) is the leading financial institution by both assets and deposits in Puerto Rico and ranks among the top 50 U.S. bank holding companies by assets. Founded in 1893, Banco Popular de Puerto Rico, Popular’s principal subsidiary, provides retail, mortgage and commercial banking services in Puerto Rico and the U.S. and British Virgin Islands, as well as auto and equipment leasing and financing in Puerto Rico. Popular also offers broker-dealer and insurance services in Puerto Rico through specialized subsidiaries. In the mainland United States, Popular provides retail and commercial banking services through its New York-chartered banking subsidiary, Popular Bank, which has branches located in New York, New Jersey and Florida.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nFinancial (English): P-EN-FIN\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img\" data-v-f0ef0696=\"\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20260225593127r1&amp;sid=mstr3&amp;distro=nx&amp;lang=en\"/></picture></span><span data-v-602de5d2=\"\"></span></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nPopular, Inc.\n<br data-v-602de5d2=\"\"/>Investor Relations:\n<br data-v-602de5d2=\"\"/>Paul J. Cardillo, 212-417-6721\n<br data-v-602de5d2=\"\"/>Senior Vice President and Investor Relations Officer\n<br data-v-602de5d2=\"\"/><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"mailto:pcardillo@popular.com\" tabindex=\"0\">pcardillo@popular.com</a>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nor\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nMedia Relations:\n<br data-v-602de5d2=\"\"/>MC González Noguera, 917-804-5253\n<br data-v-602de5d2=\"\"/>Executive Vice President and Chief Communications &amp; Public Affairs Officer\n<br data-v-602de5d2=\"\"/><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"mailto:mc.gonzalez@popular.com\" tabindex=\"0\">mc.gonzalez@popular.com</a>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span data-v-602de5d2=\"\">View source version on businesswire.com: </span><span data-v-602de5d2=\"\"><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://www.businesswire.com/news/home/20260225593127/en/\" tabindex=\"0\">https://www.businesswire.com/news/home/20260225593127/en/</a></span></p></div>",
            "pub_date": "2026-02-27 01:55:48",
            "link": "https://www.morningstar.com/news/business-wire/20260225593127/popular-inc-declares-a-cash-dividend-of-075-per-common-share",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "DATATRAK Standalone eConsent Accelerates Clinical Trials",
            "description": "<div class=\"mdc-article-body\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><em class=\"mdc-article-emphasis\" data-v-370fea16=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">eConsent solution deploys in under four weeks, integrates with any EDC, and delivers affordable, patient‑centric digital consent</strong></em></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">AUSTIN, TX / <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://www.accessnewswire.com/\" tabindex=\"0\">ACCESS Newswire</a> / February 26, 2026 / </strong>DATATRAK International, Inc.'s<strong class=\"mdc-article-strong\" data-v-479a2324=\"\"> (OTC:DTRK)</strong> DATATRAK Powered by Fountayn unified eClinical, eSource, and decentralized clinical trial (DCT) platform, announces the release of its standalone eConsent solution designed to help sponsors, CROs, and sites modernize informed consent while reducing startup timelines and technology costs. The new eConsent offering can be deployed in under four weeks and is available as a lightweight, cost‑effective module or as a fully integrated component of the DATATRAK Powered by Fountayn EDC and DCT ecosystem.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Unlike many eConsent tools that are bundled only within large, expensive ePRO or DCT packages, DATATRAK's standalone eConsent delivers flexible pricing so study teams can implement digital informed consent without paying for an entire ePRO system they do not need. Reasonable, study‑level pricing makes eConsent accessible for a broader range of trials and budgets, including early‑phase, single‑site, and investigator‑initiated studies.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\"Study teams want the benefits of modern eConsent-faster startup, better participant understanding, and cleaner documentation-without lengthy implementations or bloated platform costs,\" said Alex Tabatabai, CEO, DATATRAK. \"Our standalone eConsent is purpose‑built to launch quickly, fit into existing study infrastructure, and scale seamlessly when sponsors are ready to expand into DATATRAK EDC, ePRO, RTSM, CTMS, or full decentralized clinical trials.\"</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Fast Startup, IND‑Ready Timelines</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">The DATATRAK eConsent solution is designed for implementation timelines of under four weeks, allowing study teams to go live in time for IND or ethics approval and first‑patient‑in milestones. Configuration is supported by reusable templates and best‑practice workflows that help streamline approvals and site activation.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Standalone eConsent with Enterprise‑Grade Integration</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">The eConsent module can be used as a standalone utility and integrated with third‑party infrastructure, including external EDC, RTSM, CTMS, and eTMF systems, or deployed as a native component of DATATRAK EDC. When used with DATATRAK EDC, consent data and enrollment status are seamlessly connected to subject records, randomization, and visit schedules, enabling true end‑to‑end digital trial execution on a single platform.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Key Capabilities Include:</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">1. Standalone eConsent that integrates with third‑party clinical trial systems or EDC<br data-v-602de5d2=\"\"/>2. Seamless integration with the consent and enrollment workflow in EDC<br data-v-602de5d2=\"\"/>3. Support for remote and decentralized clinical trials with patient access from any device<br data-v-602de5d2=\"\"/>4. Designed for protocol amendments and regulatory workflows</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">DATATRAK's eConsent simplifies managing protocol amendments and re‑consent, a common pain point for sponsors and sites. Study teams can easily trigger and track re‑consent when protocol changes occur, ensuring every participant is on the correct version and that audit trails remain inspection‑ready.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">The system also supports tracking and managing supporting documents such as witness statements, translations, and supplemental information, helping maintain complete, compliant records across sites and regions.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Flexible Patient Engagement and Enrollment Options</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">To support both site‑based and remote enrollment, the eConsent solution enables sites to invite participants using multiple methods: email links, QR codes patients can scan on their own device, or direct registration by the physician or site staff. Sites can also schedule consent visits prior to trial enrollment, helping ensure participants have adequate time to review materials, ask questions, and complete consent in a controlled, compliant workflow.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">When combined with DATATRAK's EDC, ePRO, and eSource capabilities, sponsors can extend the same patient‑centric digital experience beyond consent to ongoing data collection and engagement throughout the study.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">About DATATRAK</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">DATATRAK Powered by Fountayn is transforming healthcare and life sciences through technological innovations by providing a unified, cloud based eClinical and decentralized clinical trial platform that brings together EDC, eSource, ePRO/eCOA, eConsent, RTSM, RBM, Adjudication, Imaging, Safety, Global Oversight and Enterprise Workflow Management, CTMS, eTMF, and DCT tools in a single, configurable environment. With global access from any device and a single‑source data model, DATATRAK helps sponsors, CROs, and sites accelerate study timelines, improve data quality, and reduce operational burden across all phases of clinical research. DATATRAK complies with the highest Quality Assurance standards that are 21 CFR Part 11, GDPR, GCP, HIPAA, and CDISC compliant that are fully validated by our experienced team of software quality engineers. DATATRAK's cloud-based platform is trusted in 83 countries, 6 continents, for over 10,000 clinical trials. DATATRAK is based in Austin, Texas and has team members and data hosting infrastructure in its key service regions of the United States, Europe, and Japan. For more information, visit www.fountayn.com or www.datatrak.com.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Contact: </strong><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"mailto:sales@fountayn.com\" tabindex=\"0\">sales@fountayn.com</a></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">SOURCE: </strong>Datatrak International</p><br/><br/>View the original <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://www.accessnewswire.com/newsroom/en/computers-technology-and-internet/datatrak-standalone-econsent-accelerates-clinical-trials-1141923\" tabindex=\"0\">press release</a> on ACCESS Newswire<br/><br/>\n<span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img mdc-article-image__img--0-width\" data-v-f0ef0696=\"\" style=\"width:0;\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://app.accessnewswire.com/img.ashx?id=1141923\"/></picture></span></div>",
            "pub_date": "2026-02-27 01:55:47",
            "link": "https://www.morningstar.com/news/accesswire/1141923msn/datatrak-standalone-econsent-accelerates-clinical-trials",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CULINARY INSTITUTE OF AMERICA ANNOUNCED AS EXCLUSIVE LAUNCH PARTNER FOR MATTSONIQ™",
            "description": "<div class=\"mdc-article-body\">\n            \n              \n              CULINARY INSTITUTE OF AMERICA ANNOUNCED AS EXCLUSIVE LAUNCH PARTNER FOR MATTSONIQ™\n              \n            \n            \n              <span>\n<h2 class=\"mdc-article-heading mdc-heading__mdc mdc-heading--level-5__mdc\" data-v-618d53ae=\"\">CULINARY INSTITUTE OF AMERICA ANNOUNCED AS EXCLUSIVE LAUNCH PARTNER FOR MATTSONIQ™</h2>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">PR Newswire</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">HYDE PARK, N.Y., Feb. 26, 2026</p>\n</span>\n<span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Innovation Engine Opens a New World of Educational Possibilities</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span data-v-602de5d2=\"\">HYDE PARK, N.Y.</span>, <span data-v-602de5d2=\"\">Feb. 26, 2026</span> /PRNewswire/ -- <strong class=\"mdc-article-strong\" data-v-479a2324=\"\"><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4628371-1&amp;h=4088916025&amp;u=http%3A%2F%2Fwww.ciachef.edu%2F&amp;a=The+Culinary+Institute+of+America\" tabindex=\"0\">The Culinary Institute of America</a></strong> (CIA) today announced that it has been chosen as the exclusive launch partner for <strong class=\"mdc-article-strong\" data-v-479a2324=\"\">MattsonIQ™</strong>, an AI platform designed to open new pathways for discovery and innovation across the global food industry. <strong class=\"mdc-article-strong\" data-v-479a2324=\"\"><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4628371-1&amp;h=2310538487&amp;u=https%3A%2F%2Fmattsonco.com%2F&amp;a=Mattson\" tabindex=\"0\">Mattson</a></strong>—a U.S.-based food and beverage product innovation firm—is a recognized leader in bringing artificial intelligence (AI) to the food and beverage space. Available to all CIA students, faculty, and staff, <strong class=\"mdc-article-strong\" data-v-479a2324=\"\">MattsonIQ </strong>will help accelerate the pace of learning, inspire creativity, and much, much more. It will facilitate fast and easy deep dives into three key areas: food and beverage ingredients, cuisine, and nutrition. The two organizations also announced the <strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Mattson AI Lab @ The Culinary Institute of America</strong>—an AI exploratory group focused on unlocking the future applications of artificial intelligence in food—that will allow CIA students and faculty to explore how to apply AI to create new ideas faster, test them more intelligently, and apply critical thinking skills at the intersection of creativity and the application of AI technology.  </p>\n<span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://mma.prnewswire.com/media/2921370/The_Culinary_Institute_of_America.html\" tabindex=\"0\">\n<span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img\" data-v-f0ef0696=\"\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://mma.prnewswire.com/media/2921370/The_Culinary_Institute_of_America.jpg\"/></picture></span>\n</a>\n</p>\n</span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Led by Provost Jeroen Greven, and Vice President of Academic Affairs Michael Sperling, PhD., the lab will be piloted by a select number of CIA faculty and students who will collaborate closely with Steve Gundrum, Mattson's Chief AI Officer, and Jennifer Pagano, Mattson's AI Director.   </p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\"With CIA's 80-year legacy of leadership and Mattson's reputation for applying artificial intelligence (AI) to food and beverage innovation, this partnership is another step forward in ensuring CIA continues to shape the future of food,\" said CIA Provost Jeroen Greven. \"By bringing advanced AI into our learning environment, we can explore new ideas faster, test them more intelligently, and train students to think at the intersection of creativity and technology, giving them a competitive advantage as they graduate into an industry that is evolving faster than ever before.\"</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">The lab expands the creative and strategic surface area for exploration—enabling faster discovery, deeper insights, and more ambitious solutions for meeting evolving guest needs, identifying and applying flavor and cuisine trends, and addressing global food systems challenges.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\"For decades, food innovation has been limited by the speed of human imagination alone,\" said Steve Gundrum, Chief AI Officer at Mattson. \"With the Mattson AI Lab @ The Culinary Institute of America, we will be expanding that imagination exponentially. This is about inventing the future of food faster, smarter, and with greater impact.\"</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\"><span class=\"mdc-article-underline\" data-v-1f1bdc8a=\"\">About The Culinary Institute of America</span></strong> <br data-v-602de5d2=\"\"/>Founded in 1946, The Culinary Institute of America is dedicated to developing leaders in food, beverage, and hospitality. The independent, not-for-profit CIA offers associate degrees in culinary arts and baking and pastry arts; bachelor's degrees with majors in culinary arts, baking &amp; pastry arts, food business management, hospitality management, culinary science, and applied food studies; and master's degrees in culinary arts, culinary therapeutics, food business, sustainable food systems, and wine and beverage management. The college also offers executive education, certificate programs, and courses for professionals and enthusiasts. Its conferences, leadership initiatives, and consulting services are a valuable resource to industry professionals, and its worldwide network of nearly 60,000 alumni includes innovators in every area of the food world. The CIA has locations in New York, California, Texas, and Singapore. For more information, visit <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4628371-1&amp;h=4117317058&amp;u=https%3A%2F%2Fwww.ciachef.edu%2F&amp;a=www.ciachef.edu\" tabindex=\"0\">www.ciachef.edu</a>. </p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\"><span class=\"mdc-article-underline\" data-v-1f1bdc8a=\"\">About Mattson</span></strong> <br data-v-602de5d2=\"\"/>Mattson is the largest end-to-end food and beverage new products innovation firm. Since 1977, Mattson has worked across the food industry playing a major role in bringing 1,000's of new products to market.  With offices in Silicon Valley California and Chicago, Mattson provides services to all channels within the food and beverage industry, including foodservice, CPG, commercial ingredients, and more. Working with clients both large and small, Mattson identifies new product strategies that fuel future growth platforms for their clients, from ideation through commercialization. For more information, visit <span class=\"mdc-article-underline\" data-v-1f1bdc8a=\"\"><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4628371-1&amp;h=2423504712&amp;u=https%3A%2F%2Fmattsonco.com%2F&amp;a=https%3A%2F%2Fmattsonco.com\" tabindex=\"0\">https://mattsonco.com</a></span> or contact Mattson at: <span class=\"mdc-article-underline\" data-v-1f1bdc8a=\"\"><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"mailto:MattsonIQ@mattsonco.com\" tabindex=\"0\">MattsonIQ@mattsonco.com</a></span></p>\n<span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://mma.prnewswire.com/media/2421655/Culinary_Institute_of_America_Logo.html\" tabindex=\"0\">\n<span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img\" data-v-f0ef0696=\"\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://mma.prnewswire.com/media/2421655/Culinary_Institute_of_America_Logo.jpg\"/></picture></span>\n</a>\n</p>\n</span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img mdc-article-image__img--12-width\" data-v-f0ef0696=\"\" style=\"width:12px;\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://edge.prnewswire.com/c/img/favicon.png?sn=NY96806&amp;sd=2026-02-26\"/></picture></span> View original content to download multimedia:<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://www.prnewswire.com/news-releases/culinary-institute-of-america-announced-as-exclusive-launch-partner-for-mattsoniq-302698713.html\" tabindex=\"0\">https://www.prnewswire.com/news-releases/culinary-institute-of-america-announced-as-exclusive-launch-partner-for-mattsoniq-302698713.html</a></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">SOURCE The Culinary Institute of America</p></span>\n</div>",
            "pub_date": "2026-02-27 01:50:39",
            "link": "https://www.morningstar.com/news/pr-newswire/20260226ny96806/culinary-institute-of-america-announced-as-exclusive-launch-partner-for-mattsoniq",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Accenture Gains on Partnership With Mistral AI",
            "description": "<div class=\"mdc-article-body\">\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  By Elias Schisgall </p>\n<pre class=\"mdc-article-pre\" data-v-370ea3ac=\"\"></pre>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Shares of Accenture advanced after the consultancy signed a multi-year agreement with the French artificial-intelligence startup Mistral AI. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Shares were up 6% at $202.98 in midday trading Thursday. The stock has fallen 43% in the past year. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  The companies said Thursday that Accenture would have access to Mistral AI's models for its consulting work. They did not disclose financial details of the partnership. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  The partnership is Accenture's latest agreement with an AI company to increase its technological capabilities. Earlier this week, the company was one of four to partner with OpenAI to gain early access to its Frontier agentic AI platform. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Accenture also launched a three-year partnership with Anthropic to sell AI services to businesses in December. Anthropic said at the time that Accenture became one of its top three enterprise customers. </p>\n<pre class=\"mdc-article-pre\" data-v-370ea3ac=\"\"></pre>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Write to Elias Schisgall at elias.schisgall@wsj.com </p>\n<pre class=\"mdc-article-pre\" data-v-370ea3ac=\"\"></pre>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  (END) Dow Jones Newswires</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  February 26, 2026 12:35 ET (17:35 GMT)</p>\n\nCopyright (c) 2026 Dow Jones &amp; Company, Inc.</div>",
            "pub_date": "2026-02-27 01:50:37",
            "link": "https://www.morningstar.com/news/dow-jones/2026022612699/accenture-gains-on-partnership-with-mistral-ai",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Nordic Shares Close Down; Hampidjan Falls Furthest",
            "description": "<div class=\"mdc-article-body\">\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  This article was automatically generated by Dow Jones using technology from Automated Insights. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Stocks in the Nordic region declined Thursday, with the OMX Nordic 40 Index declining 0.1%. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Hampidjan hf. posted the largest decline among large stocks during the session, declining 8.0%, followed by Lundin Mining Corp. shares, which declined 5.8%. Shares of Solstad Maritime ASA fell 5.7%. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Torm PLC was the biggest leader, rising 6.2%, and Sweden-listed Hoegh Autoliners ASA gained 5.9%. Norway-listed Hoegh Autoliners ASA rounded out the top three leaders on Thursday, with shares gaining 5.0%. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     In Denmark, the OMX Copenhagen 20 Index increased 0.2%, while the OMX Helsinki 25 Index, which tracks Finland's most-traded stocks, fell 0.8%. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Stocks on Sweden's OMX Stockholm 30 Index gained 0.3%, while Norway's Oslo Exchange Benchmark Index_GI fell 0.4%. Shares in Iceland decreased, with the OMX Iceland All-Share PI Equity Index falling 0.4%. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Elsewhere in Europe, indexes were mixed, with the STOXX Europe 600 Index steady and the FTSE 100 Index gaining 0.4% from the previous close. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     In commodities news, Brent crude oil futures were up 1.7%, while gold futures were down 0.6%. Bitcoin slipped 3.3% to $66,903. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     On the currency front, the WSJ Dollar Index gained 0.1% to 94.80. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Against the euro, the U.S. dollar was up 0.2%, the Norwegian krone was up 0.1%, the Icelandic krona was flat, the Danish krone was flat, and the Swedish krona was down 0.3%. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Against the U.S. dollar, the Norwegian krone was down 0.1%, the Danish krone was down 0.2%, the euro was down 0.2%, the Icelandic krona was down 0.2%, and the Swedish krona was down 0.4%. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Data source: Dow Jones Market Data, FactSet </p>\n<pre class=\"mdc-article-pre\" data-v-370ea3ac=\"\"></pre>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  (END) Dow Jones Newswires</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  February 26, 2026 12:21 ET (17:21 GMT)</p>\n\nCopyright (c) 2026 Dow Jones &amp; Company, Inc.</div>",
            "pub_date": "2026-02-27 01:41:26",
            "link": "https://www.morningstar.com/news/dow-jones/2026022612558/nordic-shares-close-down-hampidjan-falls-furthest",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Physitrack Plc Announces Update on Publication of Annual Report",
            "description": "<div class=\"mdc-article-body\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><em class=\"mdc-article-emphasis\" data-v-370fea16=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Physitrack PLC (Nasdaq First North:PTRK) (\"Physitrack\" or the \"Company\") announces that its audited Q4 2025 report will be published on 27 February 2026 as planned, while the Annual Report will be published in the course of next week.</strong></em></p> <p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">LONDON, UK / <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://www.accessnewswire.com/\" tabindex=\"0\">ACCESS Newswire</a> / February 26, 2026 / </strong>Physitrack PLC (STO:PTRK) - Physitrack PLC announces that its audited Q4 2025 report will be published on 27 February 2026 as planned.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">For the first time, the Q4 2025 report will also be published in Swedish alongside the English version.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">The Company's Annual Report for the financial year ended 31 December 2025, which was originally scheduled for publication on 27 February 2026, will instead be published during the course of next week.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">The statutory audit is substantially complete. The Board confirms that no material audit issues have been identified and that there are no outstanding matters relating to the Company's financial performance or financial position. The revised timing relates solely to the completion of final internal audit quality control procedures and formal file closure prior to signing.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">The Company will announce the exact publication date of the Annual Report once the audit process has been formally concluded.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Enquiries regarding this announcement should be addressed to:</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Henrik Molin, CEO and co-founder, Physitrack.<br data-v-602de5d2=\"\"/>+44 208 133 9325<br data-v-602de5d2=\"\"/><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"mailto:ir@physitrack.com\" tabindex=\"0\">ir@physitrack.com</a><br data-v-602de5d2=\"\"/><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"mailto:media@physitrack.com\" tabindex=\"0\">media@physitrack.com</a></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">About Physitrack</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Physitrack PLC, founded in 2012, is a global digital healthcare provider, focused on the B2B wellness and virtual-first care markets. With staff with 12 nationalities on four continents, customers in 17 time zones, and end users in 187 countries, Physitrack is a truly global company.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">The company has two business lines:</strong><br data-v-602de5d2=\"\"/>1. Lifecare - SaaS platform tailored mainly to physiotherapy and musculoskeletal care, enabling practitioners to deliver clinical home exercises, education prescription, outcomes tracking, triaging and Telehealth.<br data-v-602de5d2=\"\"/>2. Wellness / Champion Health - SaaS platform for Employee Wellness and care powered by a combination of world-leading technology and wellness professionals based in the United Kingdom, Germany and the Nordics.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Physitrack PLC is headquartered in London, United Kingdom, and listed on Nasdaq First North Premier Growth Market (PTRK).</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Visit us at</strong><br data-v-602de5d2=\"\"/><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://pr.report/j3g9\" tabindex=\"0\">https://physitrackgroup.com/</a> (investor relations)<br data-v-602de5d2=\"\"/><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://pr.report/j3ga\" tabindex=\"0\">https://physitrack.com</a> (product marketing)</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">About Champion Health</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Champion Health, a subsidiary of Physitrack Plc, is a leader in corporate wellness technology, providing an innovative platform that empowers businesses to support their employees' well-being through personalised wellness action plans and advanced analytics.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Visit us at</strong><br data-v-602de5d2=\"\"/><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://pr.report/j3gb\" tabindex=\"0\">https://championhealth.co.uk/</a></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Attachments</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://pr.report/j3gc\" tabindex=\"0\">Physitrack Plc Announces Update on Publication of Annual Report</a></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">SOURCE:</strong> Physitrack PLC</p><br/><br/>View the original <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://www.accessnewswire.com/newsroom/en/computers-technology-and-internet/physitrack-plc-announces-update-on-publication-of-annual-report-1141922\" tabindex=\"0\">press release</a> on ACCESS Newswire<br/><br/>\n<span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img mdc-article-image__img--0-width\" data-v-f0ef0696=\"\" style=\"width:0;\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://app.accessnewswire.com/img.ashx?id=1141922\"/></picture></span></div>",
            "pub_date": "2026-02-27 01:41:25",
            "link": "https://www.morningstar.com/news/accesswire/1141922msn/physitrack-plc-announces-update-on-publication-of-annual-report",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Immigrant Success Story: BodyKore CEO Launches Tomorrow's Legacy Initiative",
            "description": "<div class=\"mdc-article-body\">\n            \n              \n              Immigrant Success Story: BodyKore CEO Launches Tomorrow's Legacy Initiative\n              \n            \n            \n              <span>\n<h2 class=\"mdc-article-heading mdc-heading__mdc mdc-heading--level-5__mdc\" data-v-618d53ae=\"\">Immigrant Success Story: BodyKore CEO Launches Tomorrow's Legacy Initiative</h2>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">PR Newswire</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">GARDEN GROVE, Calif., Feb. 26, 2026</p>\n</span>\n<span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">Fitness industry leader draws on personal experience to create mentorship, skills training and job-readiness programs for at-risk youth in Southern California.</em></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span data-v-602de5d2=\"\">GARDEN GROVE, Calif.</span>, <span data-v-602de5d2=\"\">Feb. 26, 2026</span> /PRNewswire/ -- Before he became the CEO of <span class=\"mdc-article-underline\" data-v-1f1bdc8a=\"\"><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4628357-1&amp;h=3624670314&amp;u=https%3A%2F%2Fwww.bodykore.com%2F&amp;a=BodyKore\" tabindex=\"0\">BodyKore</a></span>, a global fitness equipment manufacturer, Leo Chang was a teenager struggling to find his place.</p>\n<span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://mma.prnewswire.com/media/2921357/TomorrowsLegacyInitiative_BodyKore_LeoChang.html\" tabindex=\"0\">\n<span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img\" data-v-f0ef0696=\"\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://mma.prnewswire.com/media/2921357/TomorrowsLegacyInitiative_BodyKore_LeoChang.jpg\"/></picture></span>\n</a>\n</p>\n</span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Chang immigrated to the United States from Taiwan at age 2. While he grew up immersed in American culture, his Chinese/Taiwanese household was still learning how to navigate life in a new country. The cultural disconnect created pressure at home and confusion outside it. Feeling lost and isolated, Chang rebelled, fell in with the wrong crowd and ultimately faced disciplinary issues.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\"A lot of the mistakes I made growing up could have been avoided with the proper guidance,\" Chang said. \"Fortunately, I was able to get my head straight and turn my life around. But there are a lot of kids who never get that opportunity.\"</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">That lived experience led Chang to launch the <span class=\"mdc-article-underline\" data-v-1f1bdc8a=\"\"><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4628357-1&amp;h=3652814768&amp;u=https%3A%2F%2Ftomorrowslegacy.org%2F&amp;a=Tomorrow%27s+Legacy+Initiative\" tabindex=\"0\">Tomorrow's Legacy Initiative</a></span>, a community-driven program operating under WRATH Corp Foundation, a nonprofit serving immigrant families and at-risk teens in Southern California. Chang serves on the board as Director of Program Development &amp; Strategy and created the youth-focused initiative to address the gaps he experienced firsthand.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">About Tomorrow's Legacy Initiative<br data-v-479a2324=\"\"/></strong>The Tomorrow's Legacy Initiative is designed to equip underserved youth with practical tools, mentorship and culturally responsive support delivered directly within the community. The initiative will focus on the following four areas:</p><ul class=\"mdc-article-list mdc-article-list--unordered\" data-v-7b473e83=\"\"><li data-v-7b473e83=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Skills Training Workshops</strong> that provide career readiness, resume development, entrepreneurship education, digital literacy and financial literacy.</li><li data-v-7b473e83=\"\">A <strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Youth Mentorship Program</strong> that pairs students with community leaders and professionals to foster leadership, confidence and accountability.</li><li data-v-7b473e83=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Mental Health and Substance Abuse Support</strong> through culturally responsive referrals, resilience education and prevention programming.</li><li data-v-7b473e83=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Family Resource Navigation</strong> connecting families to housing assistance, employment opportunities and community services.</li></ul><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Turning Experience Into Action<br data-v-479a2324=\"\"/></strong>Drawing on nearly two decades in the fitness industry, Chang will also leverage BodyKore's infrastructure and professional network to provide real-world exposure and career pathways for participating youth. Chang said he will personally participate in mentorship efforts, speaking openly about his experiences and connecting with youth who may be navigating similar cultural and personal struggles.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\"I'm excited to be part of this foundation because its mission reflects my own journey,\" Chang said. \"I was given a second chance, and that makes me deeply committed to creating that same opportunity for immigrant and at-risk youth who need guidance, hope and someone to truly believe in them.\"</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Program Rollout and Vision<br data-v-479a2324=\"\"/></strong>While the long-term vision includes establishing a dedicated community center, Tomorrow's Legacy is beginning with mobile programming hosted at schools, partner gyms, community centers and faith-based organizations. Upcoming efforts include a March 21–22 Teens in Leadership Training (TILT) workshop in Santa Ana, a two-day experiential program focused on leadership development, communication and decision-making skills for youth ages 14–17.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Learn More, Donate Now<br data-v-479a2324=\"\"/></strong>Tomorrow's Legacy is funded through private donations, corporate sponsorships and community fundraising events. Individuals interested in donating or volunteering can learn more at <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4628357-1&amp;h=3006584522&amp;u=https%3A%2F%2Ftomorrowslegacy.org&amp;a=https%3A%2F%2Ftomorrowslegacy.org\" tabindex=\"0\">https://tomorrowslegacy.org</a>.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">About BodyKore<br data-v-479a2324=\"\"/></strong>Founded in 2005, BodyKore designs and manufactures commercial-grade fitness equipment for professional facilities worldwide. The company provides free consultations, custom 3D gym design and full installation services, serving clients across North America, Asia, the Middle East and Latin America. BodyKore products are available online and through more than 100 authorized dealers across the United States. Learn more at <span class=\"mdc-article-underline\" data-v-1f1bdc8a=\"\"><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4628357-1&amp;h=462407929&amp;u=http%3A%2F%2Fbodykore.com%2F&amp;a=BodyKore.com\" tabindex=\"0\">BodyKore.com</a></span> and follow <span class=\"mdc-article-underline\" data-v-1f1bdc8a=\"\"><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4628357-1&amp;h=444104758&amp;u=https%3A%2F%2Fwww.instagram.com%2Fbodykore%2F&amp;a=%40BodyKore\" tabindex=\"0\">@BodyKore</a></span> on Instagram.</p>\n<span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://mma.prnewswire.com/media/2378877/Banner_Large_0d74579131_Logo.html\" tabindex=\"0\">\n<span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img\" data-v-f0ef0696=\"\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://mma.prnewswire.com/media/2378877/Banner_Large_0d74579131_Logo.jpg\"/></picture></span>\n</a>\n</p>\n</span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img mdc-article-image__img--12-width\" data-v-f0ef0696=\"\" style=\"width:12px;\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://edge.prnewswire.com/c/img/favicon.png?sn=LA96792&amp;sd=2026-02-26\"/></picture></span> View original content to download multimedia:<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://www.prnewswire.com/news-releases/immigrant-success-story-bodykore-ceo-launches-tomorrows-legacy-initiative-302698693.html\" tabindex=\"0\">https://www.prnewswire.com/news-releases/immigrant-success-story-bodykore-ceo-launches-tomorrows-legacy-initiative-302698693.html</a></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">SOURCE BodyKore Inc.</p></span>\n</div>",
            "pub_date": "2026-02-27 01:25:49",
            "link": "https://www.morningstar.com/news/pr-newswire/20260226la96792/immigrant-success-story-bodykore-ceo-launches-tomorrows-legacy-initiative",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Health Gorilla Files Motion to Dismiss, Reaffirming Confidence in Interoperability System",
            "description": "<div class=\"mdc-article-body\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Health Gorilla Files Motion to Dismiss, Reaffirming Confidence in Interoperability System</strong>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">Company Reaffirms Confidence in Carequality and TEFCA Frameworks and Warns of Risks to Patient Care if Established Self-Governance Is Undermined</em>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nHealth Gorilla today announced that it has filed a Motion to Dismiss litigation initiated by Epic, in which Health Gorilla reaffirms its commitment to strong, nationwide interoperability frameworks that enable providers to safely and securely exchange patient information. The Motion to Dismiss states that the lawsuit is an attack on interoperability, threatening patient safety and efficient healthcare nationwide.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nThe Motion to Dismiss explains that Plaintiffs bypassed mandatory contractual dispute resolution procedures designed to allow the networks to self-govern and resolve disagreements through established mechanisms and instead sought to escalate what is fundamentally a healthcare governance dispute into a federal action and smear campaign.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nMore broadly, the Motion describes the lawsuit as part of a pattern of conduct by Epic to deter both its competitors and customers from embracing innovation in interoperability, which undermines the framework and risks a more efficient, safer healthcare system. The lawsuit calls into question the networks’ ability to self-police, which threatens the stability of systems that providers rely on daily to deliver safe and efficient care.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nThe Motion emphasizes that the lawsuit relies on facts that Health Gorilla provided to Epic after it willingly cooperated in investigations concerning certain network participants, during a months-long, exhaustive and voluntary process involving Carequality, the TEFCA network administrator, and several of the nation’s largest health providers. This clearly demonstrates Health Gorilla’s commitment to vet and investigate concerns, honoring its obligations to protect the system. None of the providers that joined Health Gorilla’s investigation are plaintiffs, which is telling.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n“Carequality and TEFCA protect patients by ensuring clinicians have the information they need at the point of care,” said Bob Watson, CEO of Health Gorilla. “Bypassing them risks destabilizing systems that hundreds of millions of patients and providers depend on.”\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nHealth Gorilla’s priority remains unchanged: Preserve reliable treatment access while protecting privacy, security, and the integrity of the national interoperability ecosystem.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nRead the full complaint here.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fcdn.prod.website-files.com%2F62719a041d28d7b5603dd995%2F69a0632f55ccce3651feff55_HG%2527s%2520Memo%2520ISO%2520MTD%2520C.D.%2520Cal.%252026-cv-00321%2520dckt%252056_001%25202026-02-26.pdf&amp;esheet=54434589&amp;newsitemid=20260226940871&amp;lan=en-US&amp;anchor=https%3A%2F%2Fcdn.prod.website-files.com%2F62719a041d28d7b5603dd995%2F69a0632f55ccce3651feff55_HG%2527s%2520Memo%2520ISO%2520MTD%2520C.D.%2520Cal.%252026-cv-00321%2520dckt%252056_001%25202026-02-26.pdf&amp;index=1&amp;md5=43ba3511cff75b04203bbe22b565ce17\" tabindex=\"0\">https://cdn.prod.website-files.com/62719a041d28d7b5603dd995/69a0632f55ccce3651feff55_HG%27s%20Memo%20ISO%20MTD%20C.D.%20Cal.%2026-cv-00321%20dckt%2056_001%202026-02-26.pdf</a>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">About Health Gorilla</strong>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nHealth Gorilla, a designated Qualified Health Information Network under TEFCA, provides interoperability solutions delivering secure, real-time access to deduplicated, AI-ready health data. Health Gorilla supports EHR vendors, value-based care organizations, and digital health innovators with data-driven workflows that enable more informed, connected, and efficient care.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img\" data-v-f0ef0696=\"\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20260226940871r1&amp;sid=mstr3&amp;distro=nx&amp;lang=en\"/></picture></span><span data-v-602de5d2=\"\"></span></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nMedia Contact:\n<br data-v-602de5d2=\"\"/>Elizabeth Northrup\n<br data-v-602de5d2=\"\"/>ROKK Solutions for Health Gorilla\n<br data-v-602de5d2=\"\"/>301-325-1960\n<br data-v-602de5d2=\"\"/><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"mailto:elizabeth@rokksolutions.com\" tabindex=\"0\">elizabeth@rokksolutions.com</a>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span data-v-602de5d2=\"\">View source version on businesswire.com: </span><span data-v-602de5d2=\"\"><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://www.businesswire.com/news/home/20260226940871/en/\" tabindex=\"0\">https://www.businesswire.com/news/home/20260226940871/en/</a></span></p></div>",
            "pub_date": "2026-02-27 01:25:48",
            "link": "https://www.morningstar.com/news/business-wire/20260226940871/health-gorilla-files-motion-to-dismiss-reaffirming-confidence-in-interoperability-system",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "New report: Medicare Advantage enrollment depicts industry at a crossroads, with concentrated growth and retrenchment",
            "description": "<div class=\"mdc-article-body\">\n            \n              \n              New report: Medicare Advantage enrollment depicts industry at a crossroads, with concentrated growth and retrenchment\n              \n            \n            \n              <span>\n<h2 class=\"mdc-article-heading mdc-heading__mdc mdc-heading--level-5__mdc\" data-v-618d53ae=\"\">New report: Medicare Advantage enrollment depicts industry at a crossroads, with concentrated growth and retrenchment</h2>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">PR Newswire</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">CHICAGO, Feb. 26, 2026</p>\n</span>\n<span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">Enrollment slows as market resets under new economic realities. </em></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span data-v-602de5d2=\"\">CHICAGO</span>, <span data-v-602de5d2=\"\">Feb. 26, 2026</span> /PRNewswire/ -- HealthScape Advisors, a leading healthcare payer consulting firm, today announced the release of its annual <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4628259-1&amp;h=758613230&amp;u=https%3A%2F%2Fwww.healthscape.com%2Finsights%2Fmedicare-advantage-enrollment-depicts-industry-crossroads&amp;a=2026+Medicare+Advantage+competitive+enrollment+report\" tabindex=\"0\">2026 Medicare Advantage competitive enrollment report</a>. The report is a collaboration between Chartis and HealthScape Advisors, a Chartis Company.</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">The Medicare Advantage market grew by 900,000 total beneficiaries to 35.4 million in PY2026, with enrollment rising 2.5% year over year, down from 3.6% in 2025 and 3.9% in 2024. This continued deceleration comes as many organizations intentionally scale back membership to prioritize margin for financial sustainability in a challenging regulatory and operating environment. Many are narrowing geographic footprints and reducing benefit richness. </p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Expectations about market-wide enrollment are mixed for PY2027, but the long-term outlook remains positive. 77% of Medicare Advantage leaders expect the market will hold steady or continue to grow but at a lower rate than previous years.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\"We continue to see sustained moderation in growth year over year as Medicare Advantage experiences a period of recalibration and some for-profit organizations reevaluate their participation,\" said <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4628259-1&amp;h=2228110605&amp;u=https%3A%2F%2Fwww.healthscape.com%2Fabout%2Four-people%2Falexis-levy&amp;a=Alexis+Levy\" tabindex=\"0\">Alexis Levy</a>, HealthScape Senior Partner and report co-author. \"Despite slowed market growth, the majority of plan executives express optimism about the future of Medicare Advantage over the next five years.\"</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\"Even as some plans retreat from certain markets and rethink benefit design, long-term confidence in the Medicare Advantage marketplace remains intact,\" said <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4628259-1&amp;h=2030753112&amp;u=https%3A%2F%2Fwww.chartis.com%2Fabout%2Four-people%2Fnick-herro&amp;a=Nick+Herro\" tabindex=\"0\">Nick Herro</a>, Senior Partner in Strategic Transformation at Chartis and report co-author. \"To remain competitive in this shrinking environment, plans are refining their growth strategy toward more predictable, targeted segments, like Special Needs Plans (SNPs).\"</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">The report explores key themes and takeaways changing the Medicare Advantage market, including:</p><ul class=\"mdc-article-list mdc-article-list--unordered\" data-v-7b473e83=\"\"><li data-v-7b473e83=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Enrollment trends:</strong> Medicare Advantage enrollment rose 2.5% year over year, down from 3.6% in 2025, signaling a more constrained growth environment. Humana and a small subset of other challengers captured most net gains, benefiting from pullbacks by United and Aetna.</li><li data-v-7b473e83=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">SNP enrollment: </strong>SNP enrollment jumped 12.2%, outpacing the broader market. Chronic Condition SNPs (C-SNP) continued to surge with 49% growth, as plans like Devoted, CareSource, and Molina gained traction.</li><li data-v-7b473e83=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Plan options and preferences:</strong> Total plan offerings fell 2.5% for the third straight year, driven by cuts to non-SNPs and a 10% drop in PPOs. Despite fewer plan offerings, enrollment patterns remained relatively stable.</li><li data-v-7b473e83=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Quality ratings:</strong> While average Star Ratings held steady, two-thirds of members (67.2%) are now enrolled in 4+ star plans, down sharply from roughly 80% earlier in the decade.</li></ul><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">To view the full report, including the analytic methodology, click <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4628259-1&amp;h=2883402377&amp;u=https%3A%2F%2Fwww.healthscape.com%2Finsights%2Fmedicare-advantage-enrollment-depicts-industry-crossroads&amp;a=here\" tabindex=\"0\">here</a>.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">About HealthScape Advisors</strong><br data-v-602de5d2=\"\"/>Every payer strives for better. At HealthScape Advisors, we help them achieve it. We partner with payers to deliver better member experiences, build better provider partnerships, and realize better health outcomes. We work with health plans and payers, ancillary and specialty health organizations, and healthcare investors and innovators to accelerate strategic growth; advance care quality, accessibility, and affordability; optimize operations; communicate with purpose and unlock the power of data. Our expertise across thousands of projects means we understand the landscape like no one else. When payers want meaningful results, they turn to HealthScape Advisors—the specialist who'll help them get to better. Learn more at <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4628259-1&amp;h=3875879276&amp;u=http%3A%2F%2Fwww.healthscape.com%2F&amp;a=www.healthscape.com\" tabindex=\"0\">www.healthscape.com</a>.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">About Chartis</strong><br data-v-602de5d2=\"\"/>The challenges facing US healthcare are longstanding and all too familiar. We are Chartis, and we believe in better. We work with more than 1,900 organizations annually to develop and activate transformative strategies, operating models, and organizational enterprises that make US healthcare more affordable, accessible, safe, and human. With more than 1,450 professionals, we help providers, payers, technology innovators, retail companies, and investors create and embrace solutions that tangibly and materially reshape healthcare for the better. Our family of brands—Chartis, Jarrard, Greeley, and HealthScape Advisors—is 100% focused on healthcare and each has a longstanding commitment to helping transform healthcare in big and small ways. <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4628259-1&amp;h=171540226&amp;u=https%3A%2F%2Fwww.chartis.com%2F&amp;a=Learn+more\" tabindex=\"0\">Learn more</a>. Chartis. Believe in better.</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img mdc-article-image__img--12-width\" data-v-f0ef0696=\"\" style=\"width:12px;\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://edge.prnewswire.com/c/img/favicon.png?sn=CG96691&amp;sd=2026-02-26\"/></picture></span> View original content:<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://www.prnewswire.com/news-releases/new-report-medicare-advantage-enrollment-depicts-industry-at-a-crossroads-with-concentrated-growth-and-retrenchment-302698465.html\" tabindex=\"0\">https://www.prnewswire.com/news-releases/new-report-medicare-advantage-enrollment-depicts-industry-at-a-crossroads-with-concentrated-growth-and-retrenchment-302698465.html</a></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">SOURCE The Chartis Group</p></span>\n<span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img\" data-v-f0ef0696=\"\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://rt.prnewswire.com/rt.gif?NewsItemId=CG96691&amp;Transmission_Id=202602261200PR_NEWS_USPR_____CG96691&amp;DateId=20260226\"/></picture></span>\n</div>",
            "pub_date": "2026-02-27 01:16:46",
            "link": "https://www.morningstar.com/news/pr-newswire/20260226cg96691/new-report-medicare-advantage-enrollment-depicts-industry-at-a-crossroads-with-concentrated-growth-and-retrenchment",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Level AI Announces Major AI Virtual Agent Expansion: Delivering Human-Quality AI for Every Interaction",
            "description": "<div class=\"mdc-article-body\">\n            \n              \n              Level AI Announces Major AI Virtual Agent Expansion: Delivering Human-Quality AI for Every Interaction\n              \n            \n            \n              <span>\n<h2 class=\"mdc-article-heading mdc-heading__mdc mdc-heading--level-5__mdc\" data-v-618d53ae=\"\">Level AI Announces Major AI Virtual Agent Expansion: Delivering Human-Quality AI for Every Interaction</h2>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">PR Newswire</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">MOUNTAIN VIEW, Calif., Feb. 26, 2026</p>\n</span>\n<span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span data-v-602de5d2=\"\">MOUNTAIN VIEW, Calif.</span>, <span data-v-602de5d2=\"\">Feb. 26, 2026</span> /PRNewswire/ -- Level AI, a leader in customer experience AI, is significantly expanding its full-stack agentic CX platform, redefining the standard for customer experience by moving beyond the limitations of the \"siloed\" virtual agent. Recognizing that isolated automation of customer issue resolution fails to address complex enterprise needs, Level AI focuses on striking a strategic balance between human and AI agents. By grounding its intelligence in proprietary customer interaction data to identify the optimal use cases for automation, the platform creates a continuous intelligence loop where human and AI agents share real-time learning and training, all governed by a common set of quality standards. This unified model eliminates the visibility gap for CX leaders by providing comprehensive journey insights across both human and AI conversations, ensuring a seamless, high-fidelity brand experience at every touchpoint.</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">The Platform Advantage: Integrated AI Virtual Agent Capabilities</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">The expansion of Level AI's AI Virtual Agent (VA) capabilities is powered by its deep integration into its overall agentic CX platform, transforming it from a basic virtual agent to one that operates in total harmony with human agents. Key enhancements include:</p><ul class=\"mdc-article-list mdc-article-list--unordered\" data-v-7b473e83=\"\"><li data-v-7b473e83=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Automation Discovery:</strong> By leveraging the platform's ability to scan 100% of customer interaction data, the AI Virtual Agent identifies and automates the highest-ROI, safest tasks, ensuring a low-risk path to automation.</li><li data-v-7b473e83=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Integrated Proprietary Voice Stack:</strong> The AI Virtual Agent utilizes the platform's native voice AI stack to deliver industry-leading low latency (under 2 seconds) and fluid interruption handling, creating a dialogue experience that feels naturally human.</li><li data-v-7b473e83=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Unified Intelligence Loop:</strong> The AI Virtual Agent is not built in a vacuum; it inherits human agent workflows mapped directly from the platform's data on top-performing agents. This loop uses a single set of human-grade benchmarks to continuously evaluate and retrain both virtual and human teams in tandem.</li><li data-v-7b473e83=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Adaptive Workflows: </strong>An integrated studio blends agentic reasoning for complex tasks, and deterministic controls for structured processes, ensuring the perfect balance of flexibility and brand compliance.</li></ul><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\"A virtual agent operating in a silo is no longer enough for the modern enterprise. We are redefining the category by showing that a virtual agent is exponentially more powerful when it is an integrated part of a full-stack agentic CX platform that manages human interactions as well,\" says Ashish Nagar, CEO of Level AI. \"By moving away from isolated virtual agents, we've created a system that prioritizes a strategic human-AI blend, ensuring automation is never blind but rather a precision-engineered extension of a brand's best performers. This creates a compounding loop of insights and learning where every interaction—human or AI—continuously trains and levels up the experience across the entire customer journey.\"</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Level AI continues to push the envelope with the fastest time-to-value, moving from kickoff to production in just weeks and slashing implementation timelines and maintenance costs by 10X. The platform achieves this while offering the 'steering wheel' control essential for enterprise rigor through sophisticated testing and deployment safeguards.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\"Working with Level AI was a breath of fresh air after a miserable 'failure to launch' with our previous vendor. We value this strategic partnership because their proprietary full-stack AI allowed us to make more progress in four weeks than we had in the previous nine months. By instantly synthesizing over 12,000 technical assets through their native architecture, the platform now delivers precise, multilingual resolutions in real-time. We are now confidently expanding to their proprietary Voice Agent technology to ensure our customers receive high-fidelity support before a call ever reaches our human team.\" Director, Business Performance, Analytics, Global Positioning Technology Leader.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">About Level AI: Level AI is a leader in customer experience AI. Its unified platform unlocks human-quality AI, powering leading brands like CustomInk, Extra Space Storage, From You Flowers, and VistaPrint to transform their contact centers with AI-native solutions. To see the AI Virtual Agent in action, request a personalized demo at <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4628413-1&amp;h=515135002&amp;u=https%3A%2F%2Fc212.net%2Fc%2Flink%2F%3Ft%3D0%26l%3Den%26o%3D4445339-1%26h%3D1698325315%26u%3Dhttps%253A%252F%252Fthelevel.ai%252F%26a%3Dhttps%253A%252F%252Fthelevel.ai&amp;a=thelevel.ai\" tabindex=\"0\">thelevel.ai</a>.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Media Contact: Gayathri Krishnamurthy, <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"mailto:gayathri@thelevel.ai\" tabindex=\"0\">gayathri@thelevel.ai</a></p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img mdc-article-image__img--12-width\" data-v-f0ef0696=\"\" style=\"width:12px;\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://edge.prnewswire.com/c/img/favicon.png?sn=LA96849&amp;sd=2026-02-26\"/></picture></span> View original content:<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://www.prnewswire.com/news-releases/level-ai-announces-major-ai-virtual-agent-expansion-delivering-human-quality-ai-for-every-interaction-302698659.html\" tabindex=\"0\">https://www.prnewswire.com/news-releases/level-ai-announces-major-ai-virtual-agent-expansion-delivering-human-quality-ai-for-every-interaction-302698659.html</a></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">SOURCE Level AI</p></span>\n<span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img\" data-v-f0ef0696=\"\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://rt.prnewswire.com/rt.gif?NewsItemId=LA96849&amp;Transmission_Id=202602261202PR_NEWS_USPR_____LA96849&amp;DateId=20260226\"/></picture></span>\n</div>",
            "pub_date": "2026-02-27 01:16:45",
            "link": "https://www.morningstar.com/news/pr-newswire/20260226la96849/level-ai-announces-major-ai-virtual-agent-expansion-delivering-human-quality-ai-for-every-interaction",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        }
    ]
}