{
    "data": [
        {
            "title": "SDM Deadline: SDM Investors with Losses in Excess of $100K Have Opportunity to Lead Smart Digital Group Ltd. Securities Fraud Lawsuit",
            "description": "<div class=\"mdc-article-body\">\n            \n              \n              SDM Deadline: SDM Investors with Losses in Excess of $100K Have Opportunity to Lead Smart Digital Group Ltd. Securities Fraud Lawsuit\n              \n            \n            \n              <span>\n<h2 class=\"mdc-article-heading mdc-heading__mdc mdc-heading--level-5__mdc\" data-v-618d53ae=\"\">SDM Deadline: SDM Investors with Losses in Excess of $100K Have Opportunity to Lead Smart Digital Group Ltd. Securities Fraud Lawsuit</h2>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">PR Newswire</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">NEW YORK, Feb. 28, 2026</p>\n</span>\n<span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span data-v-602de5d2=\"\">NEW YORK</span>, <span data-v-602de5d2=\"\">Feb. 28, 2026</span> /PRNewswire/ --</p>\n<span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://mma.prnewswire.com/media/2598307/32a64817_10ba_407b_947c_76bd790799f6_Logo.html\" tabindex=\"0\">\n<span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img\" data-v-f0ef0696=\"\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://mma.prnewswire.com/media/2598307/32a64817_10ba_407b_947c_76bd790799f6_Logo.jpg\"/></picture></span>\n</a>\n</p>\n</span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Why: Rosen Law Firm, a global investor rights law firm, reminds purchasers of securities of Smart Digital Group Ltd. (NASDAQ: SDM) between May 5, 2025 and September 26, 2025 at 9:34 AM EST, both dates inclusive (the \"Class Period\"), of the important March 16, 2026 lead plaintiff deadline.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">So what: If you purchased SDM securities during the Class Period you may be entitled to compensation without payment of any out of pocket fees or costs through a contingency fee arrangement.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">What to do next: To join the SDM class action, go to <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4629730-1&amp;h=2535422655&amp;u=https%3A%2F%2Frosenlegal.com%2Fsubmit-form%2F%3Fcase_id%3D50638&amp;a=https%3A%2F%2Frosenlegal.com%2Fsubmit-form%2F%3Fcase_id%3D50638\" tabindex=\"0\">https://rosenlegal.com/submit-form/?case_id=50638</a> or call Phillip Kim, Esq. toll-free at 866-767-3653 or email <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"mailto:case@rosenlegal.com\" tabindex=\"0\">case@rosenlegal.com</a> for information on the class action. A class action lawsuit has already been filed. If you wish to serve as lead plaintiff, you must move the Court no later than March 16, 2026. A lead plaintiff is a representative party acting on behalf of other class members in directing the litigation.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Why Rosen Law: We encourage investors to select qualified counsel with a track record of success in leadership roles. Often, firms issuing notices do not have comparable experience, resources, or any meaningful peer recognition. Many of these firms do not actually handle securities class actions, but are merely middlemen that refer clients or partner with law firms that actually litigate the cases. Be wise in selecting counsel. The Rosen Law Firm represents investors throughout the globe, concentrating its practice in securities class actions and shareholder derivative litigation. Rosen Law Firm has achieved, at that time, the largest ever securities class action settlement against a Chinese Company. Rosen Law Firm was Ranked No. 1 by ISS Securities Class Action Services for number of securities class action settlements in 2017. The firm has been ranked in the top 4 each year since 2013 and has recovered hundreds of millions of dollars for investors. In 2019 alone the firm secured over $438 million for investors. In 2020, founding partner Laurence Rosen was named by law360 as a Titan of Plaintiffs' Bar. Many of the firm's attorneys have been recognized by Lawdragon and Super Lawyers.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Details of the case: According to the lawsuit, defendants throughout the Class Period made false and/or misleading statements and/or failed to disclose that: (1) Smart Digital was the subject of a market manipulation and fraudulent promotion scheme involving social-media based misinformation and impersonators posing as financial professionals; (2) insiders and/or affiliates used and/or intended to use offshore or nominee accounts to facilitate the coordinated dumping of shares during a price inflation campaign; (3) Smart Digital's public statements and risk disclosures omitted any mention of realized risk of fraudulent trading or market manipulation used to drive Smart Digital's stock price; (4) as a result, Smart Digital securities were at unique risk of a sustained suspension in trading by either or both of the SEC and NASDAQ; and (5) as a result of the foregoing, defendants' positive statements about Smart Digital's business, operations and prospects were materially misleading and/or lacked a reasonable basis.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">To join the SDM class action, go to <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4629730-1&amp;h=2535422655&amp;u=https%3A%2F%2Frosenlegal.com%2Fsubmit-form%2F%3Fcase_id%3D50638&amp;a=https%3A%2F%2Frosenlegal.com%2Fsubmit-form%2F%3Fcase_id%3D50638\" tabindex=\"0\">https://rosenlegal.com/submit-form/?case_id=50638</a> or call Phillip Kim, Esq. toll-free at 866-767-3653 or email <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"mailto:case@rosenlegal.com\" tabindex=\"0\">case@rosenlegal.com</a> for information on the class action.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">No Class Has Been Certified. Until a class is certified, you are not represented by counsel unless you retain one. You may select counsel of your choice. You may also remain an absent class member and do nothing at this point. An investor's ability to share in any potential future recovery is not dependent upon serving as lead plaintiff.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Follow us for updates on LinkedIn: <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4629730-1&amp;h=701037670&amp;u=https%3A%2F%2Fwww.linkedin.com%2Fcompany%2Fthe-rosen-law-firm&amp;a=https%3A%2F%2Fwww.linkedin.com%2Fcompany%2Fthe-rosen-law-firm\" tabindex=\"0\">https://www.linkedin.com/company/the-rosen-law-firm</a>, on Twitter: <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4629730-1&amp;h=330085938&amp;u=https%3A%2F%2Ftwitter.com%2Frosen_firm&amp;a=https%3A%2F%2Ftwitter.com%2Frosen_firm\" tabindex=\"0\">https://twitter.com/rosen_firm</a> or on Facebook: <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4629730-1&amp;h=3817979679&amp;u=https%3A%2F%2Fwww.facebook.com%2Frosenlawfirm%2F&amp;a=https%3A%2F%2Fwww.facebook.com%2Frosenlawfirm%2F\" tabindex=\"0\">https://www.facebook.com/rosenlawfirm/</a>.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Attorney Advertising. Prior results do not guarantee a similar outcome.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Contact Information:</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">      Laurence Rosen, Esq.<br data-v-602de5d2=\"\"/>      Phillip Kim, Esq.<br data-v-602de5d2=\"\"/>      The Rosen Law Firm, P.A.<br data-v-602de5d2=\"\"/>      275 Madison Avenue, 40th Floor<br data-v-602de5d2=\"\"/>      New York, NY 10016<br data-v-602de5d2=\"\"/>      Tel: (212) 686-1060<br data-v-602de5d2=\"\"/>      Toll Free: (866) 767-3653<br data-v-602de5d2=\"\"/>      Fax: (212) 202-3827<br data-v-602de5d2=\"\"/>      <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"mailto:case@rosenlegal.com\" tabindex=\"0\">case@rosenlegal.com</a><br data-v-602de5d2=\"\"/>      <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4629730-1&amp;h=2118701566&amp;u=http%3A%2F%2Fwww.rosenlegal.com%2F&amp;a=www.rosenlegal.com\" tabindex=\"0\">www.rosenlegal.com</a></p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img mdc-article-image__img--12-width\" data-v-f0ef0696=\"\" style=\"width:12px;\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://edge.prnewswire.com/c/img/favicon.png?sn=DC98281&amp;sd=2026-02-28\"/></picture></span> View original content to download multimedia:<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://www.prnewswire.com/news-releases/sdm-deadline-sdm-investors-with-losses-in-excess-of-100k-have-opportunity-to-lead-smart-digital-group-ltd-securities-fraud-lawsuit-302700065.html\" tabindex=\"0\">https://www.prnewswire.com/news-releases/sdm-deadline-sdm-investors-with-losses-in-excess-of-100k-have-opportunity-to-lead-smart-digital-group-ltd-securities-fraud-lawsuit-302700065.html</a></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">SOURCE THE ROSEN LAW FIRM, P. A.</p></span>\n</div>",
            "pub_date": "2026-02-28 22:46:39",
            "link": "https://www.morningstar.com/news/pr-newswire/20260228dc98281/sdm-deadline-sdm-investors-with-losses-in-excess-of-100k-have-opportunity-to-lead-smart-digital-group-ltd-securities-fraud-lawsuit",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Trump blacklists Anthropic - and OpenAI swoops in",
            "description": "<div class=\"mdc-article-body\">\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  By William Gavin </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Claude developer Anthropic refused to let its products be deployed for autonomous weapons or mass surveillance </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Anthropic CEO Dario Amodei has warned that artificial intelligence has the capabilities to undermine democratic values. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     President Donald Trump on Friday ordered the U.S. government to stop using Anthropic's artificial-intelligence models and threatened the company with \"major\" consequences. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     \"Anthropic better get their act together, and be helpful during this phase out period, or I will use the Full Power of the Presidency to make them comply, with major civil and criminal consequences to follow,\" Trump said in a post on his Truth Social platform. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Trump directed all federal agencies to immediately stop using Anthropic's Claude AI models. He added that the Department of Defense and other U.S. agencies have six months to phase out Anthropic's technology. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     The conflict stems from Anthropic's contract with the Defense Department, which is worth up to $200 million. Anthropic has drawn a line in the sand over how the department can use its technology. Specifically, Anthropic doesn't want its products to be used to develop autonomous weapons or for mass surveillance. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     The Pentagon has said it has \"no interest\" in using AI for those purposes. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     But something curious happened after Trump's announcement about Anthropic: OpenAI said that it had struck a government deal and that it was able to secure carve-outs. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     \"Two of our most important safety principles are prohibitions on domestic mass surveillance and human responsibility for the use of force, including for autonomous weapon systems,\" OpenAI CEO Sam Altman said on the X platform. The Defense Department \"agrees with these principles, reflects them in law and policy, and we put them into our agreement,\" he added. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Meanwhile, Anthropic CEO Dario Amodei said in a blog post that his company \"tried in good faith to reach an agreement with the Department of War,\" using the name the Trump administration prefers for the Pentagon, \"making clear that we support all lawful uses of AI for national security aside from the two narrow exceptions.\" </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     The company does \"not believe that today's frontier AI models are reliable enough to be used in fully autonomous weapons,\" he added. And, he said, the team at Anthropic believes \"that mass domestic surveillance of Americans constitutes a violation of fundamental rights.\" </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Trump's announcement came after days of public and private back-and-forth negotiations between the Pentagon and Anthropic that occasionally turned ugly. After Amodei defended his company's refusal to budge on Thursday, a Pentagon official accused him of trying to \"personally control the U.S. military.\" </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     \"It's a shame that @DarioAmodei is a liar and has a God-complex,\" Emil Michael, the undersecretary of defense for research and engineering, wrote on X. Michael, a former executive at Uber Technologies (UBER), also accused Anthropic of having a plan to \"impose\" its values on Americans. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     A Jan. 9 memo handed down by Defense Secretary Pete Hegseth called for AI labs to amend their defense contracts to allow \"any lawful use\" of their technology. Hegseth gave the department 180 days to insert that standard into any contract that involves procuring AI services. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     \"DoD does not want a private company's usage policy to function as a veto over lawful military applications,\" Jessica Tillipman, a professor at George Washington University's law school who specializes in government procurement law, told MarketWatch over email. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     \"If DoD makes this the default clause across all AI vendors, it eliminates vendor-by-vendor negotiation over acceptable use and signals that firms unwilling to accept that baseline will be replaced,\" Tillipman said. \"It sounds like boring contract boilerplate, but it is really about procurement leverage.\" </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Following Trump's announcement, Hegseth formally declared Anthropic a supply-chain risk to national security, a designation previously applied only to foreign companies, notably those based in China and believed to be under government influence. As a result of Hegseth's action, no contractor, supplier or partner that does business with the U.S. military can conduct \"any commercial activity\" with Anthropic. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     That has potentially major implications for Anthropic, which recently raised $30 billion at a $380 billion valuation and disclosed $14 billion in annual run-rate revenue, driven mostly by increasing enterprise adoption of its products. More than 500 business customers now spend over $1 million annually on Anthropic's products. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Microsoft (MSFT), which alongside Nvidia (NVDA) signed a strategic partnership with Anthropic last November, works with the Defense Department.  Amazon (AMZN), which has invested billions of dollars in Anthropic, recently detailed a plan to support the Pentagon through access to Amazon Web Services. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Before this week, Claude was the only AI model approved for classified use in the Pentagon. Claude was even used, through a Palantir Technologies (PLTR) partnership, to help the U.S. capture Venezuela's then-president, Nicolás Maduro, according to the Wall Street Journal. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     However, Elon Musk's xAI signed a deal to allow its controversial Grok model to be used for classified purposes earlier this week. Officials at multiple federal agencies have raised concerns over potential safety issues with Grok, the Journal reports. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     See: Amazon, Nvidia and SoftBank pour $110 billion into OpenAI - raising the stakes for AI monetization </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Emily Bary contributed. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     -William Gavin </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     This content was created by MarketWatch, which is operated by Dow Jones &amp; Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal. </p>\n<pre class=\"mdc-article-pre\" data-v-370ea3ac=\"\"></pre>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  (END) Dow Jones Newswires</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  02-28-26 0942ET</p>\n\nCopyright (c) 2026 Dow Jones &amp; Company, Inc.</div>",
            "pub_date": "2026-02-28 22:46:38",
            "link": "https://www.morningstar.com/news/marketwatch/20260228157/trump-blacklists-anthropic-and-openai-swoops-in",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Any chance of a Fed interest-rate cut in 2026 is 'evaporating before our very eyes' with Iran war set to stoke oil prices",
            "description": "<div class=\"mdc-article-body\">\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  By Greg Robb </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     U.S. and Israel strike several locations in Iran, which responds with missile attacks on Gulf nations </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     President Donald Trump greeted members of the Joint Chiefs of Staff as he arrived to deliver his State of the Union address on Tuesday. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     War with Iran is expected to lead to a spike in oil prices, which, if prolonged, could mean the next move by the Federal Reserve is to raise interest rates. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     President Donald Trump has called for regime change in Iran. Experts said one of the largest-scale concerns is that this Iranian regime will see its very existence at stake. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     The Iranian regime \"is going to do whatever they can and whatever they believe will help them stay in power,\" said Suzanne Maloney, director of the foreign-policy program at the Brookings Institution, speaking at a Chicago Council on Global Affairs event this week. \"That does include striking both their neighbors, against energy infrastructure in the region, and, of course, against Israel and the U.S. military and any other presence in the region. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     \"It could be a very dangerous time in the aftermath of American military action in Iran.\" </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     For the U.S. economy, meanwhile, it seems certain that war will push the inflation rate higher. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     \"The argument for having lower rates is just evaporating right before our very eyes,\" said Brian Bethune, an economist at Boston College, in an interview with MarketWatch. The uptick in oil prices combined with the Trump administration's aggressive approach to tariffs will keep prices high. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     See: After the U.S. and Israel attack Iran, bitcoin and oil are offering glimpses into the broader response of markets </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Over the past several months, the Fed has struggled to tamp down inflation amid pressure from the White House and the markets to cut rates. These latest developments in the Middle East only add to the central bank's challenges. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Prices at the wholesale level started to accelerate in December and are now running at a 3% annual rate, frustrating Federal Reserve officials who had hoped that Trump's new levies on imports would have only a transitory impact on inflation. It's likely that the increase in producer prices will soon be passed on to consumers, said Ethan Harris, former chief economist at BofA Securities, in a note on LinkedIn. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Inflation is looking like it's heating up in the first quarter, agreed Scott Anderson, chief U.S. economist at BMO Capital Markets. Core personal-consumption expenditures could rise to a 3.1% annual rate in January, the highest rate in two years - and that's before any impact from the strike on Iran and its repercussions. The Fed's annual target for inflation is 2%. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Any $10 increase in crude-oil prices is estimated to raise consumer-price inflation by 0.2% to 0.4% over the coming year, Anderson said. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     WTI crude-oil futures (CL00) (CLJ26) are up about 16% to date in 2026, or $10 per barrel. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Oil prices were already rising as tension with Iran was rising, and now a prolonged conflict might raise the possibility that the central bank's next move would be to raise interest rates, Anderson added. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     \"You're really talking about problems for the Fed in terms of putting a lid on inflation,\" Bethune said. \"In this situation, the Fed can't lower rates.\" </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Traders in derivate markets still expect two quarter-point rate cuts this year, with the first coming in June and the second in September. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Both tariffs and oil prices are supply shocks, raising the costs of inputs into production of the economy, which are very hard for the Fed to cool. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     The Fed's interest-rate tool kit works more on the demand side of the economy, by either spurring companies and consumers to spend or nudging them to pull back. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Oil prices to spike as Iran hits neighbors </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Oil prices are expected to spike now that Iran's missiles have hit other Gulf states. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Iran  has the ability to disrupt the flow of oil through the Strait of Hormuz, a crucial maritime passage connecting the Persian Gulf with the Gulf of Oman and the Arabian Sea. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Christopher Granville, managing director of TS Lombard, a macroeconomic forecasting consultancy firm based in London, said a military confrontation between the U.S. and Iran is unlikely to send the global economy into a full-blown oil crisis or stagflationary shock. Still, it's possible we'll face an \"oil squall\" similar to what happened after Russia invaded Ukraine in February 2022, when oil prices surged over $100 a barrel and remained high for six months. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     That so-called squall was enough to fuel inflation in the U.S., with the core PCE price index rising at an annual pace of 5.6% in September 2022, its highest rate in almost 40 years. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Karen Young, senior research scholar at the Center for Global Energy Policy at Columbia University, said any price spike depends on whether the Iranian regime strikes oil-production facilities of its neighbors in the Middle East in response to the U.S.-Israel action. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Vali Nasr, a professor at the Johns Hopkins University's School of Advanced International Studies, had said it was likely that Iran would hit its neighbors. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     For as long as the Iranian regime holds out, said Granville, the \"squall risk\" will persist, pointing to a sticky risk premium in oil prices and, in effect, putting a floor under what would otherwise be fundamentally driven weakness. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     During whatever time span is required for U.S. military power to neutralize Iran's defense capabilities, the oil price spike would endure, but that same \"whatever it takes\" response, according to Granville, would prevent any Iranian action setting ablaze the whole of the Gulf and precipitating a full-blown, 1970s-style oil crisis. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     -Greg Robb </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     This content was created by MarketWatch, which is operated by Dow Jones &amp; Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal. </p>\n<pre class=\"mdc-article-pre\" data-v-370ea3ac=\"\"></pre>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  (END) Dow Jones Newswires</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  02-28-26 0922ET</p>\n\nCopyright (c) 2026 Dow Jones &amp; Company, Inc.</div>",
            "pub_date": "2026-02-28 22:36:41",
            "link": "https://www.morningstar.com/news/marketwatch/20260228152/any-chance-of-a-fed-interest-rate-cut-in-2026-is-evaporating-before-our-very-eyes-with-iran-war-set-to-stoke-oil-prices",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Any chance of a Fed interest-rate cut in 2026 is 'evaporating before our very eyes' with Iran war set to stoke oil prices",
            "description": "<div class=\"mdc-article-body\">\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  By Greg Robb </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     U.S. and Israel strike several locations in Iran, which responds with missile attacks on Gulf nations </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     President Donald Trump greeted members of the Joint Chiefs of Staff as he arrived to deliver his State of the Union address on Tuesday. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     War with Iran is expected to lead to a spike in oil prices, which, if prolonged, could mean the next move by the Federal Reserve is to raise interest rates. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     President Donald Trump has called for regime change in Iran. Experts said one of the largest-scale concerns is that this Iranian regime will see its very existence at stake. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     The Iranian regime \"is going to do whatever they can and whatever they believe will help them stay in power,\" said Suzanne Maloney, director of the foreign-policy program at the Brookings Institution, speaking at a Chicago Council on Global Affairs event this week. \"That does include striking both their neighbors, against energy infrastructure in the region, and, of course, against Israel and the U.S. military and any other presence in the region. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     \"It could be a very dangerous time in the aftermath of American military action in Iran.\" </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     For the U.S. economy, meanwhile, it seems certain that war will push the inflation rate higher. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     \"The argument for having lower rates is just evaporating right before our very eyes,\" said Brian Bethune, an economist at Boston College, in an interview with MarketWatch. The uptick in oil prices combined with the Trump administration's aggressive approach to tariffs will keep prices high. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     See: After the U.S. and Israel attack Iran, bitcoin and oil are offering glimpses into the broader response of markets </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Over the past several months, the Fed has struggled to tamp down inflation amid pressure from the White House and the markets to cut rates. These latest developments in the Middle East only add to the central bank's challenges. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Prices at the wholesale level started to accelerate in December and are now running at a 3% annual rate, frustrating Federal Reserve officials who had hoped that Trump's new levies on imports would have only a transitory impact on inflation. It's likely that the increase in producer prices will soon be passed on to consumers, said Ethan Harris, former chief economist at BofA Securities, in a note on LinkedIn. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Inflation is looking like it's heating up in the first quarter, agreed Scott Anderson, chief U.S. economist at BMO Capital Markets. Core personal-consumption expenditures could rise to a 3.1% annual rate in January, the highest rate in two years - and that's before any impact from the strike on Iran and its repercussions. The Fed's annual target for inflation is 2%. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Any $10 increase in crude-oil prices is estimated to raise consumer-price inflation by 0.2% to 0.4% over the coming year, Anderson said. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     WTI crude-oil futures (CL00) (CLJ26) are up about 16% to date in 2026, or $10 per barrel. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Oil prices were already rising as tension with Iran was rising, and now a prolonged conflict might raise the possibility that the central bank's next move would be to raise interest rates, Anderson added. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     \"You're really talking about problems for the Fed in terms of putting a lid on inflation,\" Bethune said. \"In this situation, the Fed can't lower rates.\" </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Traders in derivate markets still expect two quarter-point rate cuts this year, with the first coming in June and the second in September. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Both tariffs and oil prices are supply shocks, raising the costs of inputs into production of the economy, which are very hard for the Fed to cool. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     The Fed's interest-rate tool kit works more on the demand side of the economy, by either spurring companies and consumers to spend or nudging them to pull back. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Oil prices to spike as Iran hits neighbors </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Oil prices are expected to spike now that Iran's missiles have hit other Gulf states. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Iran  has the ability to disrupt the flow of oil through the Strait of Hormuz, a crucial maritime passage connecting the Persian Gulf with the Gulf of Oman and the Arabian Sea. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Christopher Granville, managing director of TS Lombard, a macroeconomic forecasting consultancy firm based in London, said a military confrontation between the U.S. and Iran is unlikely to send the global economy into a full-blown oil crisis or stagflationary shock. Still, it's possible we'll face an \"oil squall\" similar to what happened after Russia invaded Ukraine in February 2022, when oil prices surged over $100 a barrel and remained high for six months. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     That so-called squall was enough to fuel inflation in the U.S., with the core PCE price index rising at an annual pace of 5.6% in September 2022, its highest rate in almost 40 years. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Karen Young, senior research scholar at the Center for Global Energy Policy at Columbia University, said any price spike depends on whether the Iranian regime strikes oil-production facilities of its neighbors in the Middle East in response to the U.S.-Israel action. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Vali Nasr, a professor at the Johns Hopkins University's School of Advanced International Studies, had said it was likely that Iran would hit its neighbors. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     -Greg Robb </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     This content was created by MarketWatch, which is operated by Dow Jones &amp; Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal. </p>\n<pre class=\"mdc-article-pre\" data-v-370ea3ac=\"\"></pre>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  (END) Dow Jones Newswires</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  02-28-26 0917ET</p>\n\nCopyright (c) 2026 Dow Jones &amp; Company, Inc.</div>",
            "pub_date": "2026-02-28 22:25:59",
            "link": "https://www.morningstar.com/news/marketwatch/20260228150/any-chance-of-a-fed-interest-rate-cut-in-2026-is-evaporating-before-our-very-eyes-with-iran-war-set-to-stoke-oil-prices",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Well-grounded Confidence! How China's domestic growth drivers propel a strong start to its 15th Five-Year Plan",
            "description": "<div class=\"mdc-article-body\">\n            \n              \n              Well-grounded Confidence! How China's domestic growth drivers propel a strong start to its 15th Five-Year Plan\n              \n            \n            \n              <span>\n<h2 class=\"mdc-article-heading mdc-heading__mdc mdc-heading--level-5__mdc\" data-v-618d53ae=\"\">Well-grounded Confidence! How China's domestic growth drivers propel a strong start to its 15th Five-Year Plan</h2>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">PR Newswire</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">BEIJING, Feb. 28, 2026</p>\n</span>\n<span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span data-v-602de5d2=\"\">BEIJING</span>, <span data-v-602de5d2=\"\">Feb. 28, 2026</span> /PRNewswire/ -- A news report from China.org.cn on Chinese economy:</p><span><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"> </p></span><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">The year 2026 marks the beginning of China's 15th Five-Year Plan period (2026-2030). To achieve a strong and stable start, China's economy relies on its powerful domestic growth drivers, as well as its unique systematic advantages.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">In today's world, the scarcest resource is the market. China, with its 1.4 billion people and the world's most complete industrial system, is steadily reinforcing its unified national market, catalyzing the country's economic development. In the Yangtze River Delta, a new energy vehicle (NEV) manufacturer can quickly secure all necessary components — from battery materials in Ningde to smart screens in Shanghai — within just four hours. In the Beijing-Tianjin-Hebei region, manufacturing materials can also be swiftly reallocated and dispatched via land ports, despite administrative boundaries. Across China, authorities are accelerating efforts to break down administrative barriers and facilitate the free flow of economic resources, enabling optimal resource allocation for more industries nationwide. The organic integration of the unified national market is a vivid embodiment of China's economic resilience and strength.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">The consumption engine continues to gather momentum, injecting renewed vitality that supports the long-term strength of the Chinese economy. China is home to the world's largest middle-income group and an enormous domestic consumer market with immense potential. In the past year, domestic demand contributed over 67% of China's GDP growth. Buoyed by the consumer goods trade-in program, retail turnover for home appliances and communication devices have both surpassed the one trillion yuan mark. Trendy toy IPs continue to gain traction, micro-dramas have risen rapidly, and a single performance can make an entire city go viral. Such new types of service-oriented consumption centered on new scenarios, business formats and operating models are emerging as potential fresh growth drivers for China's consumption market. As consumption upgrading gathers pace, it is also steadily shouldering the main responsibility for driving China's economic growth.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">More targeted investment is delivering greater efficiency. As one of the three drivers of economic growth, investment in China has shifted from a broad \"flood-style\" approach to targeted measures that aim to bolster weak links. For example, new infrastructure projects like the national computing power hubs have been rolled out and generated tangible results; livelihood-focused investments such as the renovation of old residential communities and the construction of social-security housing have brought warmth to many; investments in manufacturing technological upgrading have consistently improved productivity among traditional industries. By directing investment towards the real economy, improvements to well-being and industry upgrading, China is not only stimulating economic growth in the present, but also building momentum for the long term, ensuring that every yuan invested delivers maximum impact.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">The momentum of technological innovation is picking up pace, becoming a new engine that spurs development. China's core AI industry has exceeded 1 trillion yuan, with \"AI+\" business formats mushrooming in industrial and commercial sectors. China's NEV production and sales have ranked first globally for 11 consecutive years; cutting-edge technologies like gene editing and cell therapy have provided new solutions for treating complex diseases. The new system for mobilizing resources nationwide has helped break through key technological bottlenecks, and fruits of technological innovation are rapidly moving from the lab onto production lines, fueling economic development with a steady surge of new momentum.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">From the scale advantage of a unified national market to the domestic vitality of consumption, and from the effective boost of targeted investments to the core drive of technological innovation, the intrinsic forces propelling China's economy are going from strength to strength, with the country's systematic advantages becoming ever more pronounced. These forces empower one another, creating a powerful synergy that makes a solid start to the 15th Five-Year Plan not only a clear target, but also an inevitable outcome.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\"><em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">Well-grounded Confidence! How China's domestic growth drivers propel a strong start to its 15th Five-Year Plan <br data-v-370fea16=\"\"/></em></strong><em class=\"mdc-article-emphasis\" data-v-370fea16=\"\"><span class=\"mdc-article-underline\" data-v-1f1bdc8a=\"\"><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"http://www.china.org.cn/video/2026-02/28/content_118351275.shtml\" tabindex=\"0\">http://www.china.org.cn/video/2026-02/28/content_118351275.shtml</a><br data-v-1f1bdc8a=\"\"/></span></em><strong class=\"mdc-article-strong\" data-v-479a2324=\"\"><em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">China Mosaic <br data-v-370fea16=\"\"/></em></strong><span class=\"mdc-article-underline\" data-v-1f1bdc8a=\"\"><em class=\"mdc-article-emphasis\" data-v-370fea16=\"\"><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"http://chinamosaic.china.com.cn/\" tabindex=\"0\">http://chinamosaic.china.com.cn/</a></em></span></p>\n<span>\n</span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img mdc-article-image__img--12-width\" data-v-f0ef0696=\"\" style=\"width:12px;\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://edge.prnewswire.com/c/img/favicon.png?sn=CN98439&amp;sd=2026-02-28\"/></picture></span> View original content to download multimedia:<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://www.prnewswire.com/news-releases/well-grounded-confidence-how-chinas-domestic-growth-drivers-propel-a-strong-start-to-its-15th-five-year-plan-302700154.html\" tabindex=\"0\">https://www.prnewswire.com/news-releases/well-grounded-confidence-how-chinas-domestic-growth-drivers-propel-a-strong-start-to-its-15th-five-year-plan-302700154.html</a></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">SOURCE China.org.cn</p></span>\n<span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img\" data-v-f0ef0696=\"\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://rt.prnewswire.com/rt.gif?NewsItemId=CN98439&amp;Transmission_Id=202602280900PR_NEWS_USPR_____CN98439&amp;DateId=20260228\"/></picture></span>\n</div>",
            "pub_date": "2026-02-28 22:16:32",
            "link": "https://www.morningstar.com/news/pr-newswire/20260228cn98439/well-grounded-confidence-how-chinas-domestic-growth-drivers-propel-a-strong-start-to-its-15th-five-year-plan",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "My brother is paranoid, alone and has forgotten that he sold his house. How can we help?",
            "description": "<div class=\"mdc-article-body\">\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  By Quentin Fottrell </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     His lawyer said, 'He's gone off the deep end' </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     \"The lawyer's last words to us was we might have to appoint a new executor if his condition continues to deteriorate.\" (Photo subject is a model.) </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Dear Quentin, </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     My sister and I have held power of attorney for my brother, who lives six hours away. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     He has been in an assisted-living facility for over three years. Physically, he is not able to live independently, but was or is pretty sharp mentally. We take care of all his bills; his house and car were sold over three years ago. His wife died in 2020; they had no children. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Over the last 10 days, he started calling my sister about bills he needed to pay; all his bills are being paid by her. He also wants to know the balance in his bank accounts. My sister has always given him this information when he asks. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     He wanted to see the lawyer recently. He was very paranoid, asking staff to witness their conversation. He doesn't remember that he sold his house or car. In an email, his lawyer said, \"He's gone off the deep end.\" </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     The lawyer's last words to us were we might have to appoint a new executor if his condition continues to deteriorate. My sister and I are his only family, the will is made and we would inherit his estate. What do we do next? </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     The Other Sibling </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Don't miss: 'I spend $7,500 a month': I'm 47, earn $260K, and have $3 million. Can I retire at 50? </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     You can email The Moneyist with any financial and ethical questions at qfottrell@marketwatch.com. The Moneyist regrets he cannot reply to questions individually. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     A durable power of attorney would continue to carry out these duties after if/when your brother becomes incapacitated. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Dear Sibling, </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     I'm not encouraged by the tone or content of his attorney's email. It lacks compassion, professionalism and respect. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Your brother is confused and needs help. But he doesn't need an executor. An executor is appointed by the probate court after your brother passes away (and would typically be designated executor in his will). A power of attorney usually looks after a person's finances while they have diminished capacity; a durable power of attorney would continue to carry out these duties after if/when your brother becomes incapacitated. A conservator/guardian would be appointed by the courts to oversee his financial, physical and medical wellbeing. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Take immediate steps to safeguard your brother's safety: He may need an assessment for dementia or cognitive impairment from a neurologist or geriatrician. I hope that the assisted-living facility is aware of this change of behavior, and is equipped to help him navigate this next stage. You will all need to work together until you figure out the next steps for your brother. Questions remain: What kind of power of attorney document currently exists? What legal capacity does your brother have to make decisions for himself - everything from hiring a new lawyer to revoking a POA? Has your brother been actually diagnosed with dementia? </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     A durable power of attorney would continue if/when your brother becomes incapacitated. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Most of all, you will require health advocates and a competent lawyer. If the lawyer mentioned in your letter is not equipped to deal with your brother's situation - and it could be so given his reaction to the decline in your brother's health - you need a new lawyer to oversee your brother's affairs; as his joint powers of attorney, you can help him to appoint one. They will be able to help outline your options, which will depend on what kind of POA you hold and whether or not your brother requires conservatorship/guardianship, which should be a last resort. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Laws regarding a conservator/guardian vary by state. In Texas, you would need to file a petition with the court. \"A hearing will be held, and the judge will examine the evidence and make a decision,\" says Childs Legacy Law Firm in Houston. \"In the second instance, absent a pending petition, and in lieu of a family member, living will or another relevant document, the court will appoint a conservator. The conservator can be any number of people, like a friend, social worker, neighbor, church member, attorney, nurse [or] another qualified person.\" </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     General conservatorship </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     \"A general conservatorship is created when an adult - typically an elderly person but can be a younger adult person - cannot manage their finances or health due to deteriorated mental capacity or impairment caused by an illness or injury,\" it adds. \"While they recover from the illness or injury, a conservator may be appointed by a court to address their medical and financial needs.\" Reasons include a person falling into a coma, a form of dementia like Alzheimer's, head injury or a stroke that impairs their ability to think or express their wishes. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Your brother's condition appears to be deteriorating, quite suddenly. \"People who suffer from any of the above can become vulnerable to bad actors who may try to manipulate the situation for their own financial gain. These bad actors may, for example, attempt to divert your disability payments (fraud) or coerce you into changing a will (undue influence),\" the law firm says. It is always better to draft an estate plan while you have the legal capacity to write and sign such a document. Otherwise, it will be left up to the courts. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Your brother's condition appears to be deteriorating. He needs calm and legal protection. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Right now, your brother needs reassurance and validation, clear and comforting communication, a routine so he feels safe, and legal protection; document everything, especially his changes in behavior. If he does not already have a healthcare proxy or healthcare power of attorney, and your brother is not of sound mind, the courts will appoint one for him. If he is in assisted living, for example, there may come a time when you will have to move him to a full-time care facility. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     In the absence of long-term-care insurance or Medicaid, I assume you will use (or have used) the proceeds from the sale of his house to pay for his care. Selling a primary residence turns the home's equity from an exempt asset into countable cash, which often exceeds the strict monthly $2,000-$3,000 individual limit for Medicaid, which would lead to a temporary loss of benefits until those funds are spent. A trust and estate attorney can talk through your options. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     You can do this. But you can't - nor should you - do it alone. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Related: 'I am fearful': My ailing relative is being forced into assisted living. What can I do? </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     More columns from Quentin Fottrell: </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Can I stop my kids from using their inheritance to support political causes I vehemently oppose? </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     My wife's credit-card payment is three months overdue. As an authorized user, am I in trouble? </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     My stepmother cheated me out of $500K from my father's estate. What can I do? </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Check out The Moneyist's private Facebook group, where members help answer life's thorniest money issues. Post your questions, or weigh in on the latest Moneyist columns. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     By emailing your questions to The Moneyist or posting your dilemmas on The Moneyist Facebook group, you agree to have them published anonymously on MarketWatch. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     By submitting your story to Dow Jones &amp; Co., the publisher of MarketWatch, you understand and agree that we may use your story, or versions of it, in all media and platforms, including via third parties. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     -Quentin Fottrell </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     This content was created by MarketWatch, which is operated by Dow Jones &amp; Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal. </p>\n<pre class=\"mdc-article-pre\" data-v-370ea3ac=\"\"></pre>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  (END) Dow Jones Newswires</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  02-28-26 0903ET</p>\n\nCopyright (c) 2026 Dow Jones &amp; Company, Inc.</div>",
            "pub_date": "2026-02-28 22:16:31",
            "link": "https://www.morningstar.com/news/marketwatch/20260228148/my-brother-is-paranoid-alone-and-has-forgotten-that-he-sold-his-house-how-can-we-help",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "AQST INVESTOR NOTICE: Faruqi & Faruqi, LLP Investigates Claims on Behalf of Investors of Aquestive Therapeutics",
            "description": "<div class=\"mdc-article-body\">\n            \n              \n              AQST INVESTOR NOTICE: Faruqi &amp; Faruqi, LLP Investigates Claims on Behalf of Investors of Aquestive Therapeutics\n              \n            \n            \n              <span>\n<h2 class=\"mdc-article-heading mdc-heading__mdc mdc-heading--level-5__mdc\" data-v-618d53ae=\"\">AQST INVESTOR NOTICE: Faruqi &amp; Faruqi, LLP Investigates Claims on Behalf of Investors of Aquestive Therapeutics</h2>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">PR Newswire</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">NEW YORK, Feb. 28, 2026</p>\n</span>\n<span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Faruqi &amp; Faruqi, LLP Securities Litigation Partner </strong><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4629439-1&amp;h=1653552366&amp;u=https%3A%2F%2Fwww.faruqilaw.com%2Fattorney%2F22%2Fjames-m-wilson-jr&amp;a=James+(Josh)+Wilson\" tabindex=\"0\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">James (Josh) Wilson</strong></a><strong class=\"mdc-article-strong\" data-v-479a2324=\"\"> Encourages Investors Who Suffered Significant Losses In Aquestive Therapeutics To Contact Him Directly To Discuss Their Options</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">If you suffered significant losses in </strong><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4629439-1&amp;h=3661198299&amp;u=https%3A%2F%2Fwww.faruqilaw.com%2FAQST&amp;a=Aquestive+Therapeutics\" tabindex=\"0\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Aquestive Therapeutics</strong></a><strong class=\"mdc-article-strong\" data-v-479a2324=\"\"> stock or options </strong>and would like to discuss your legal rights, call Faruqi &amp; Faruqi partner <strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Josh Wilson directly </strong>at <strong class=\"mdc-article-strong\" data-v-479a2324=\"\">877-247-4292 </strong>or <strong class=\"mdc-article-strong\" data-v-479a2324=\"\">212-983-9330</strong><strong class=\"mdc-article-strong\" data-v-479a2324=\"\"> (Ext. 1310)</strong>. </p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4629439-1&amp;h=906739697&amp;u=https%3A%2F%2Fwww.faruqilaw.com%2FAQST&amp;a=%5BYou+may+also+click+here+for+additional+information%5D\" tabindex=\"0\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">[You may also click here for additional information]</strong></a></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span data-v-602de5d2=\"\">NEW YORK</span>, <span data-v-602de5d2=\"\">Feb. 28, 2026</span> /PRNewswire/ -- <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4629439-1&amp;h=2374974588&amp;u=https%3A%2F%2Fwww.faruqilaw.com%2F&amp;a=Faruqi+%26+Faruqi%2C+LLP\" tabindex=\"0\">Faruqi &amp; Faruqi, LLP</a>, a leading national securities law firm, is investigating potential claims against Aquestive Therapeutics, Inc. (\"Aquestive\" or the \"Company\") (NASDAQ: AQST).</p>\n<span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://mma.prnewswire.com/media/2457438/Faruqi_Logo.html\" tabindex=\"0\">\n<span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img\" data-v-f0ef0696=\"\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://mma.prnewswire.com/media/2457438/Faruqi_Logo.jpg\"/></picture></span>\n</a>\n</p>\n</span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Faruqi &amp; Faruqi is a leading national securities law firm with offices in New York, Pennsylvania, California and Georgia. The firm has recovered hundreds of millions of dollars for investors since its founding in 1995. See <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4629439-1&amp;h=2466615924&amp;u=https%3A%2F%2Fwww.faruqilaw.com%2F&amp;a=www.faruqilaw.com\" tabindex=\"0\">www.faruqilaw.com</a>.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Shares of Aquestive Therapeutics, Inc. (NASDAQ: AQST) plunged approximately 40% intraday on Friday after the company disclosed that the U.S. Food and Drug Administration (FDA) identified deficiencies in its New Drug Application (NDA) for Anaphylm, its experimental sublingual film for the treatment of severe allergic reactions, including anaphylaxis. The FDA advised that the unidentified deficiencies currently prevent discussions of labeling and post-marketing requirements, raising concerns about the application's approvability ahead of the January 31, 2026, PDUFA action date.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">To learn more about the <strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Aquestive Therapeutics</strong> investigation, go to <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4629439-1&amp;h=793030824&amp;u=https%3A%2F%2Fwww.faruqilaw.com%2FAQST&amp;a=www.faruqilaw.com%2FAQST\" tabindex=\"0\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">www.faruqilaw.com/AQST</strong></a> or <strong class=\"mdc-article-strong\" data-v-479a2324=\"\">call</strong> Faruqi &amp; Faruqi partner <strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Josh Wilson directly </strong>at <strong class=\"mdc-article-strong\" data-v-479a2324=\"\">877-247-4292 </strong>or <strong class=\"mdc-article-strong\" data-v-479a2324=\"\">212-983-9330</strong><strong class=\"mdc-article-strong\" data-v-479a2324=\"\"> (Ext. 1310)</strong>.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Follow us for updates on <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4629439-1&amp;h=2565505647&amp;u=https%3A%2F%2Fwww.linkedin.com%2Fcompany%2Ffaruqi-%26-faruqi-llp%2F&amp;a=LinkedIn\" tabindex=\"0\">LinkedIn</a>, on <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4629439-1&amp;h=3768899423&amp;u=https%3A%2F%2Fx.com%2Ffaruqilaw&amp;a=X\" tabindex=\"0\">X</a>, or on <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4629439-1&amp;h=1385065218&amp;u=https%3A%2F%2Fwww.facebook.com%2FFaruqiLaw%2F&amp;a=Facebook\" tabindex=\"0\">Facebook</a>.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Attorney Advertising. The law firm responsible for this advertisement is Faruqi &amp; Faruqi, LLP (<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4629439-1&amp;h=1490028263&amp;u=http%3A%2F%2Fwww.faruqilaw.com%2F&amp;a=www.faruqilaw.com\" tabindex=\"0\">www.faruqilaw.com</a>). Prior results do not guarantee or predict a similar outcome with respect to any future matter. We welcome the opportunity to discuss your particular case. All communications will be treated in a confidential manner.</p>\n<span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://mma.prnewswire.com/media/2745617/Faruqi__Faruqi_LLP_James_Josh_Wilson.html\" tabindex=\"0\">\n<span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img\" data-v-f0ef0696=\"\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://mma.prnewswire.com/media/2745617/Faruqi__Faruqi_LLP_James_Josh_Wilson.jpg\"/></picture></span>\n</a>\n</p>\n</span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img mdc-article-image__img--12-width\" data-v-f0ef0696=\"\" style=\"width:12px;\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://edge.prnewswire.com/c/img/favicon.png?sn=NY97985&amp;sd=2026-02-28\"/></picture></span> View original content to download multimedia:<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://www.prnewswire.com/news-releases/aqst-investor-notice-faruqi--faruqi-llp-investigates-claims-on-behalf-of-investors-of-aquestive-therapeutics-302699973.html\" tabindex=\"0\">https://www.prnewswire.com/news-releases/aqst-investor-notice-faruqi--faruqi-llp-investigates-claims-on-behalf-of-investors-of-aquestive-therapeutics-302699973.html</a></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">SOURCE Faruqi &amp; Faruqi, LLP</p></span>\n</div>",
            "pub_date": "2026-02-28 21:40:48",
            "link": "https://www.morningstar.com/news/pr-newswire/20260228ny97985/aqst-investor-notice-faruqi-faruqi-llp-investigates-claims-on-behalf-of-investors-of-aquestive-therapeutics",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "The week, FOBO - 'fear of becoming obsolete' because of AI - became real for workers and markets",
            "description": "<div class=\"mdc-article-body\">\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  By Weston Blasi and Andrew Keshner </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Massive jobs cuts at Block and a cataclysmic Citrini blog post stoked anxieties - but some CEOs and researchers are skeptical about doomsday scenarios </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     \"Fear of becoming obsolete\" has become an increasing concern for workers. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     This past week, Block CEO Jack Dorsey announced that the parent company of Square and Cash App was cutting nearly half its employees - some 4,000 workers - because AI and \"intelligence tools have changed what it means to build and run a company.\" </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     On Monday, Citrini Research put out a blog post laying out a hypothetical, cataclysmic near-future in which AI eliminates white-collar jobs, upending companies and entire industries. The 7,200-word essay from the independent research firm helped spark a selloff in software stocks that wiped out $200 billion in market value. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     This felt like the week that \"FOBO\" - the \"fear of becoming obsolete\" - moved from being a theoretical discussion to having real-world implications. And new research offers a glimpse at the price people are willing to pay in order to manage those fears. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Almost two-thirds of workers across the world (63%) say they'd trade a 10% pay increase for a chance to improve their AI and digital skills, according to a new report from Mercer, a human-resources consulting firm. That detail is one part of a wider report showing how employers, investors and workers across the globe are trying to understand what AI's ascent means for their future plans. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Four in 10 workers say one of their biggest worries about their future work plans is job loss because of AI. That's up from two years ago, when 28% of workers felt that way, the report said. To be sure, workers acknowledge the ways AI is helping; 8 in 10 employees said AI has made them \"more productive and efficient at work.\" At the same time, 6 in 10 workers say company brass is underestimating AI's psychological toll on staff as it muscles in. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     There's a lot of truth in worker apprehension: 99% of executives polled said AI will result in some head-count reductions within two years. But there is also a lot of uncertainty over how, exactly, AI will impact jobs and work. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Speaking at an investor event this week, JPMorgan Chase (JPM) CEO Jamie Dimon said workers may think that using AI is saving them four hours a day, but it's not necessarily translating into four hours of added value for JPMorgan. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     \"We have an LLM model; 150,000 people use it every week,\" Dimon said. \"They think they're saving four hours a day. That's not in an NPV [net present value] - we don't see the four hours a day in terms of reduced head count like that.\" </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     And some analysts have argued that Block's (XYZ) decision to slash jobs was a way for the company to blame AI while correcting a reckless postpandemic hiring binge, helping to send its stock soaring. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Are AI fears grounded in a myth? </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     The new Mercer report reflects a \"growing sense of anxiety\" among workers, said Ravin Jesuthasan, who is the firm's global leader for transformation services. But he added that while AI will be able to perform certain tasks that workers traditionally handled, many companies are focused on redeveloping worker skills, instead of making deep cuts that would effectively turn staff salaries and training into a sunk cost. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Keith Spencer, career expert at job-search automation platform Sonara, told MarketWatch that while AI is speeding up daily tasks, it isn't fundamentally changing how the work gets done. And until it does, those time savings may not show up in revenue or margins. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     \"AI is largely being layered onto existing work rather than fundamentally redesigning workflows,\" Spencer said, noting that many professionals are using it to draft emails or presentations, summarize information, analyze data or automate repetitive administrative chores. \"Completing tasks faster doesn't automatically mean a company or team is suddenly producing more products or serving more customers,\" he noted, which would have a more noticeable impact on revenue. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Read also: CEOs say they won't add many jobs in 2026. Is a low-hire, low-fire labor market the new norm? </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     In recently published research for the Harvard Business Review, authors Aruna Ranganathan and Xingqi Maggie Ye argued that it's a myth that AI will reduce employee workloads. Instead of shrinking their work, AI will lead to \"work intensification\" where employees use their newfound tools to tackle a broader scope of tasks, resulting in increased multitasking across the company. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     A temporary surge in productivity may occur, the authors said, but it can be unsustainable. Over the long term, such practices can lead to \"workload creep,\" cognitive fatigue and a decline in quality of decision-making. In the long term, AI tools meant to save time can make workers feel busier and more stretched because they're taking on more tasks. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Preventing these AI-related burnout issues can be tough, but possible. Ranganathan and Ye suggest companies establish a formal \"AI practice,\" where expected interruptions can occur at work. Those can take the form of intentional pauses to assess workflow and sequencing work to reduce AI fragmentation. Having practices in place to ground AI work tasks with human thinking can protect creativity and ensure long-term sustainability </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     For now, some 12% of employees say they are using AI daily at their jobs, according to a Gallup Workforce survey of more than 22,000 U.S. workers, and 26% say they use it multiple times a week - up from 10% and 23%, respectively, year over year. And some tech giants like Amazon.com (AMZN), Google (GOOGL) (GOOG) and Meta Platforms (META) have rolled out AI tools that their workers are now required to incorporate into their daily tasks. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Entry-level workers are in a pinch - but for how long? </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Workers may have to recalibrate their skills looking ahead. But in a sense, they already have a leg up because they at least have a job. Entry-level work has long had its difficulties, but it's in sharp focus now as AI increases its office presence. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     A Federal Reserve Bank of Dallas report this week noted there are jobs requiring black-and-white textbook knowledge, and there are jobs requiring knowledge from experience. It's essentially the difference between book smarts and street smarts. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Street smarts may hold the upper hand for now. Early data show wages are increasing for AI-exposed jobs that \"place a high value on a worker's tacit knowledge and experience,\" wrote J. Scott Davis, an assistant vice president in the Dallas Fed's research department. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     The challenge is finding ways to give new workers valuable experience when AI is increasingly handling the textbook work that used to be meant for entry-level employees, Davis said. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Businesses may determine it's not an effective move in the short run to keep giving new employees textbook grunt work as they slowly build their experience. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     \"Of course, leaving new employees off the job ladder is not sustainable in the long run. In the long run, AI adoption will require rethinking how entry-level employees gain experience on the job,\" Davis wrote. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Job-market conditions for recent college graduates deteriorated at the end of last year, according to the Federal Reserve Bank of New York. The fourth-quarter jobless rate for new grads rose to 5.7%, from 5.3%, in the third quarter, while the underemployment rate climbed to its highest point since 2020. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Underemployment counts as working in a job that generally does not require a college degree, researchers said. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     -Weston Blasi -Andrew Keshner </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     This content was created by MarketWatch, which is operated by Dow Jones &amp; Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal. </p>\n<pre class=\"mdc-article-pre\" data-v-370ea3ac=\"\"></pre>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  (END) Dow Jones Newswires</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  02-28-26 0830ET</p>\n\nCopyright (c) 2026 Dow Jones &amp; Company, Inc.</div>",
            "pub_date": "2026-02-28 21:40:47",
            "link": "https://www.morningstar.com/news/marketwatch/20260228146/the-week-fobo-fear-of-becoming-obsolete-because-of-ai-became-real-for-workers-and-markets",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Can China just steal America's AI brain that's costing trillions to develop?",
            "description": "<div class=\"mdc-article-body\">\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  By Christine Ji and William Gavin </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     American companies are spending enormous sums to develop high-performing AI models. Distillation attacks are attempting to maliciously extract them - and nobody is doing much to stop it. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     The AI race between China and the U.S. is heating up. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     In January, Moonshot AI, a China-based startup seeking a $10 billion valuation, released Kimi K2.5 - an open-source large language model with coding abilities neck-to-neck with Claude Opus 4.5, which at the time was Anthropic's most advanced model. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Users of the new Moonshot model quickly noticed something fishy: Kimi K2.5 referred to itself as Claude. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     \"Kimi-K2.5 believes it's an AI assistant named Claude,\" one user noted on social-media platform X. \"Identity crisis, or training set?\" </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     That Kimi-K2.5 called itself Claude is \"very likely\" a sign that the model was distilled from Claude outputs, according to Nathan Lambert, post-training lead at the Allen Institute for AI. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Indeed, the world's most high-stakes clandestine cat-and-mouse game is currently taking place in the race for artificial-intelligence supremacy. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Earlier this week, Anthropic, a San Francisco-based AI startup, published a blog post documenting instances of distillation attacks on its models from three of China's \"AI tigers,\" alleging that the labs trained their AI using Anthropic's large language models. The Chinese labs - DeepSeek, Moonshot AI and MiniMax (HK:100) - collectively used 24,000 fraudulent accounts to learn from Anthropic's Claude, according to the U.S. company. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Representatives for DeepSeek, MiniMax, Moonshot AI and Anthropic did not immediately respond to MarketWatch's request for comment. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     The distillation attacks - attempts to maliciously extract the intellectual property of a high-performing AI model - come at a pivotal moment for Anthropic and the AI industry at large. Anthropic is fresh off of a new funding round that puts the startup's valuation at $380 billion. It's also dealing with the aftermath of a tense standoff with the U.S. Defense Department over how the government agency can can use its models. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Anthropic isn't the only frontier lab documenting distillation attacks. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Earlier this month, both OpenAI and Alphabet's (GOOG) (GOOGL) Google DeepMind identified an increase in model-extraction attempts. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     The controversy comes as it has become clear that AI is now a critical pillar of the U.S. economy and its military practices - a strategic asset for the nation on the world stage. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     The reported incidents flagged by Anthropic are \"only the tip of the iceberg of actual usage for this type of data generation,\" said Lambert. But it requires a lot of nuance to differentiate between a distillation attack and a company using an AI model for legitimate purposes, he added. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Anthropic does not offer commercial access to Claude in China due to national-security reasons, according to the company. But that policy can't stop Chinese companies from accessing Claude outside of China. U.S. companies are projecting to spend trillions of dollars on AI innovation, and if Chinese labs can siphon off the technology to build comparable models for a fraction of the cost, they could render America's hardware and R&amp;D advantages marginal. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     \"The national-security dimension, the risk of frontier AI capabilities ending up in military or systems, is worth taking seriously,\" Lukasz Olejnik, independent technology consultant and visiting senior research fellow at the Department of War Studies at King's College London, told MarketWatch. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     However, the ethics of distillation are somewhat murky given that many LLMs were trained on third-party data and copyrighted materials, often without explicit permission, Olejnik noted. And the practice of distillation is used in many nonmalicious contexts. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Valid practice or violation? </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Distillation has been around in some shape or form for a long time, according to Christopher Caen, CEO of Mill Pond Research. \"It's another version of scraping, which has been a problem since day one,\" Caen said, referencing how Anthropic's Claude and other LLMs have been trained on large amounts of copyrighted material from across the internet. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Distillation involves training a weaker model to mimic the probability distributions of a more powerful model, often through analyzing millions of API responses to reverse engineer the \"logic\" behind the model's intelligence. The underlying technique of training a model on the outputs of another is very common for AI labs to use for internal optimization, the Allen Institute's Lambert told MarketWatch. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     \"Many academics and research institutes technically violate the terms of service in a strict interpretation,\" Lambert said. Anthropic itself has used distillation to create its smaller, faster models such as Claude 3 Haiku and Claude 3.5 Sonnet. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     According to Anthropic, the three Chinese labs generated more than 16 million exchanges with Claude through unauthorized third-party API resellers. The lion's share, 13 million, was attributed to MiniMax, which says its model serves more than 212 million users and over 130,000 enterprise clients and developers. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Read: Did everyone forget about DeepSeek? What Wall Street is getting wrong about Chinese AI </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Anthropic claimed another 3.4 million exchanges stemmed from Moonshot, which is backed by Chinese tech giants Tencent (HK:700) and Alibaba (BABA) (HK:9988). More than 150,000 exchanges were traced back to DeepSeek, which briefly threw U.S. AI firms into a panic last year when it debuted its R1 reasoning model. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Theo Browne, founder and CEO of the AI startup T3 Chat, told MarketWatch that 16 million exchanges is \"really not much,\" noting that his business hits that volume of usage most months. But as AI training moves beyond simple question-and-answer and toward more complex agentic workflows, companies are using large language models to generate synthetic data to train on, according to Browne and Lambert. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     \"It wouldn't be surprising if most of them used American models for parts of their synthetic data pipelines,\" Browne said. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     The key difference between the actions of a company like Browne's or university researchers and those of Minimax or DeepSeek can be chalked up to a few things. Chief among them is geopolitics, according to Kyle Chan, a researcher at the Brookings Institution think tank who studies Chinese tech firms and industrial policy. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     \"If they're 'cheating' off of the American models, then that means that China is able to get some kind of advantage or a leg up\" on the competition, Chan said. \"And that could challenge or threaten U.S. leadership in this space.\" </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Olejnik, at King's College London, said that while distillation is \"routinely used to build smaller, faster and cheaper versions of existing systems,\" Anthropic and other labs are likely flagging a phenomenon where \"thousands of fake accounts circumvented access control for systematic extraction of model capabilities that took years and billions of dollars to develop.\" </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Chan said that while Chinese labs clearly use distillation as a tool to hone their models, it's likely not the only reason for their advancements. He added that some U.S. AI leaders have called technical reports released by the labs impressive, which signals that they have developed some \"fundamental capabilities.\" </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     \"It's hard to say how much distillation matters for the Chinese AI models,\" Chan said. \"You need to have a certain level of capability in order to ... even be able to leverage that kind of data.\" </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     More: How quantum computing could become the next frontier in national security </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Distillation also has potential ramifications beyond simply allowing AI labs or businesses that are not as well funded to develop comparable models. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     In its blog post, Anthropic warned that foreign labs can use their distilled models to enable \"authoritarian governments\" the ability to deploy frontier AI for mass surveillance and cyberattacks. It can also make advanced AI more accessible to groups that would otherwise be incapable of committing major crimes, experts have said. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     \"AI will probably enable relatively low-skilled cybercriminals to target firms at a higher pace and scale globally this year,\" Dragonfly, a risk-analysis and security-intelligence service owned by MarketWatch's parent company, Dow Jones, said in a report this week. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Amazon Threat Intelligence (AMZN) said in a Feb. 20 report that a bad actor had used multiple AI services to compromise over 600 firewalls across dozens of countries. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     And on Wednesday, cybersecurity firm Gambit Security revealed that roughly 150 gigabytes of data were stolen from 10 Mexican government bodies and a single financial institution by a hacker using Claude and OpenAI's ChatGPT. It took an individual actor just a month after their initial breach to carry out the assault, according to Gambit. They relied on more than 1,000 prompts to Claude Code backed up by data analysis run by ChatGPT. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     \"AI didn't just assist, it functioned as the operational team: writing exploits, building tools, automating exfiltration,\" Gambit said. \"Claude executed the attack under the guidance of the attacker, and OpenAI analyzed data in support of accelerating Claude's attack-execution efforts.\" </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     The real battle is over the engine </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     What's stopping any AI lab - not just DeepSeek, MiniMax and Moonshot - from doing the same kind of distillation? \"Absolutely nothing,\" according to Mill Pond Research's Caen. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Stopping such practices will be incredibly hard without legislation, Lambert of the Allen Institute said, which he posited could be a goal of Anthropic drawing attention to the matter. In its blog post, Anthropic said the industry would need to work with policymakers to combat widespread distillation. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  (MORE TO FOLLOW) Dow Jones Newswires</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  02-28-26 0800ET</p>\n\nCopyright (c) 2026 Dow Jones &amp; Company, Inc.</div>",
            "pub_date": "2026-02-28 21:16:37",
            "link": "https://www.morningstar.com/news/marketwatch/20260228143/can-china-just-steal-americas-ai-brain-thats-costing-trillions-to-develop",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "PL-Universe with Stanford: Groundbreaking Physical AI & Robot Event Successfully Concluded",
            "description": "<div class=\"mdc-article-body\">\n            \n              \n              PL-Universe with Stanford: Groundbreaking Physical AI &amp; Robot Event Successfully Concluded\n              \n            \n            \n              <span>\n<h2 class=\"mdc-article-heading mdc-heading__mdc mdc-heading--level-5__mdc\" data-v-618d53ae=\"\">PL-Universe with Stanford: Groundbreaking Physical AI &amp; Robot Event Successfully Concluded</h2>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">PR Newswire</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">STANFORD, Calif., Feb. 28, 2026</p>\n</span>\n<span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span data-v-602de5d2=\"\">STANFORD, Calif.</span>, <span data-v-602de5d2=\"\">Feb. 28, 2026</span> /PRNewswire/ -- <span data-v-602de5d2=\"\">On </span>February 26, PL-Universe Robotics successfully held a flagship Physical AI &amp; Robot event at Stanford University, themed <em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">Robots Master the Production Line? PL-Universe: VLA for Autonomy, Robotics &amp; Investment</em>. The event gathered Stanford students, robotics and autonomous driving practitioners, veteran investors and academic experts, fostering in-depth discussions on VLA technological breakthroughs, industrial robotics deployment, and investment logic in the era of Embodied AI, showcasing the strength of China's Deep Tech in the global &amp; physical AI frontier.</p>\n<span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://mma.prnewswire.com/media/2922778/20260228174040_264_314.html\" tabindex=\"0\">\n<span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img\" data-v-f0ef0696=\"\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://mma.prnewswire.com/media/2922778/20260228174040_264_314.jpg\"/></picture></span>\n</a>\n</p>\n</span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">As a pioneer in industrial-grade embodied AI robotics, PL-Universe's Founder &amp; COO Ge Jin delivered a keynote speech, proposing the innovative \"universal ontology + rapidly replaceable dedicated end-effectors\" solution to meet the rigorous industrial demands for flexibility, reliability and large-scale deployment, redefining the new paradigm of intelligent manufacturing.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Quan Kuichen, Head of PL-Universe's Large Model Team, decoded VLA's industrial applications, sharing the company's technological breakthroughs in multi-modal data collection, cloud-edge collaboration and few-shot learning, driving embodied AI from lab to production lines with sub-millimeter precision and real-time performance.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Xing Lei, a renowned automotive industry observer, analyzed the global competition landscape of physical AI, noting that China excels in supply chains and scenarios while the US leads in algorithms and chips in the embodied AI field, calling for complementary Sino-US cooperation.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">TSVC General Partner Spencer Greene gave a venture capital perspective on investing in Embodied AI startups. He discussed opportunities driven by structural labor shortages that can be solved by Embodied AI systems and emphasized a focus on real commercial value, while cautioning against some of the hype in the humanoid sector.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Adhering to \"driving industrial upgrading through technological innovation\", PL-Universe will continue to deepen R&amp;D in industrial embodied AI and strengthen global cooperation to empower the intelligent transformation of global manufacturing.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"> </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img mdc-article-image__img--12-width\" data-v-f0ef0696=\"\" style=\"width:12px;\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://edge.prnewswire.com/c/img/favicon.png?sn=CN98456&amp;sd=2026-02-28\"/></picture></span> View original content to download multimedia:<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://www.prnewswire.com/news-releases/pl-universe-with-stanford-groundbreaking-physical-ai--robot-event-successfully-concluded-302700181.html\" tabindex=\"0\">https://www.prnewswire.com/news-releases/pl-universe-with-stanford-groundbreaking-physical-ai--robot-event-successfully-concluded-302700181.html</a></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">SOURCE PL-Universe Robotics</p></span>\n</div>",
            "pub_date": "2026-02-28 21:16:36",
            "link": "https://www.morningstar.com/news/pr-newswire/20260228cn98456/pl-universe-with-stanford-groundbreaking-physical-ai-robot-event-successfully-concluded",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        }
    ]
}