{
    "data": [
        {
            "title": "Changes to the UBS Board of Directors",
            "description": "<div class=\"mdc-article-body\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Changes to the UBS Board of Directors</strong>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Agustín Carstens and Luca Maestri nominated for election to the Board of Directors of UBS Group AG and UBS AG at the 2026 Annual General Meetings in April</strong>\n</p><ul class=\"mdc-article-list mdc-article-list--unordered\" data-v-7b473e83=\"\">\n<li data-v-7b473e83=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">William C. Dudley and Jeanette Wong will not stand for re-election</strong>\n</li>\n<li data-v-7b473e83=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">As previously announced, Vice Chairman Lukas Gähwiler will be stepping down from the Board and Markus Ronner was nominated for election to the Board</strong> \n\n</li>\n</ul><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nRegulatory News:\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nAd hoc announcement pursuant to article 53 of the SIX Exchange Regulation Listing Rules\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nThe Board of Directors of UBS Group AG (NYSE:UBS) (SWX:UBSN) announces today the nomination of Agustín Carstens and Luca Maestri for election to the Board at the Annual General Meeting (AGM) on 15 April 2026. William C. Dudley and Jeanette Wong have decided not to stand for re-election.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nAgustín Carstens (born 1958) served as General Manager of the Bank of International Settlements (BIS) from 2017 to June 2025. Prior to that, he was Governor of the Bank of Mexico from 2010 to 2017. During his time as Governor, he was a Member of the BIS Board and chaired the Global Economy Meeting and the Economic Consultative Committee. Mr. Carstens also chaired the International Monetary and Financial Committee, the policy advisory committee of the International Monetary Fund (IMF), from 2015 to 2017. Earlier in his career, he served as Mexico's Finance Minister and as Deputy Managing Director at the IMF. From 2000 to 2003, he was Mexico's Deputy Finance Minister after holding the position of Executive Director at the IMF. Mr. Carstens began his career in 1980 at the Bank of Mexico. He holds a Master’s degree and a PhD in Economics from the University of Chicago. He is a citizen of Mexico. Mr. Carstens is a highly respected and distinguished professional with extensive experience in financial regulation and monetary policy, built over a long and accomplished career.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nLuca Maestri (born 1963) is currently Vice President of Apple Inc’s Corporate Services, reporting to the CEO. Previously, he was Apple’s CFO for more than a decade after joining the firm in 2013 as Vice President and Corporate Controller. Prior to that, he served as Executive Vice President and CFO at Xerox Corporation. From 2008 to 2011, he was Senior Vice President and CFO at Nokia Siemens Networks. Mr. Maestri spent two decades at General Motors (GM), holding various finance leadership roles across multiple countries, including CFO for GM Europe based in Zurich and CFO for GM Brazil in Sao Paulo. He also led the Fiat Alliance at GM Europe. His experience spans assignments in Thailand, Singapore, Ireland, Switzerland, Italy, Germany, Brazil and the United States. Mr. Maestri holds a Bachelor’s degree in Economics from Luiss University in Rome and a Master’s degree in Management from Boston University. He is a citizen of Italy and the United States. Mr. Maestri is a highly renowned executive and leader in the technology industry.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nUBS Chairman Colm Kelleher commented: “I am delighted to share the nomination of Agustín Carstens and Luca Maestri for election to the Board. The addition of these two highly experienced leaders will further strengthen the Board’s expertise, bringing outstanding regulatory knowledge and extensive CFO skills. This follows the earlier announcement of former UBS Group Executive Board member Markus Ronner’s nomination as Vice Chairman. I very much look forward to collaborating with them on the Board.”\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nAs previously communicated, Lukas Gähwiler has decided, after an exceptionally successful career spanning 45 years, to retire from his role as Vice Chairman of the Board of Directors and concluding his long career in banking. He was appointed Vice Chairman in 2022 and acted as UBS’s representative within Switzerland’s leading trade associations and financial industry bodies. Furthermore, as the final Chairman of Credit Suisse AG, he played an instrumental role in overseeing the seamless integration of Credit Suisse into UBS.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nWilliam C. Dudley and Jeanette Wong have also decided to step down after seven years on the Board. During this time, Mr. Dudley served on the Corporate Culture and Responsibility Committee, the Risk Committee and the Governance and Nominating Committee. Ms. Wong was a member of the Audit Committee, the Corporate Culture and Responsibility Committee and the Compensation Committee.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nChairman Colm Kelleher and the members of the Board extend their gratitude to Lukas Gähwiler, William C. Dudley and Jeanette Wong for their unwavering commitment and significant contributions over the past years.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img\" data-v-f0ef0696=\"\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20260226055790r1&amp;sid=mstr3&amp;distro=nx&amp;lang=en\"/></picture></span><span data-v-602de5d2=\"\"></span></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">UBS Group AG and UBS AG</strong>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nInvestor contact\n<br data-v-602de5d2=\"\"/>Switzerland: +41-44-234 41 00\n<br data-v-602de5d2=\"\"/>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nMedia contact\n<br data-v-602de5d2=\"\"/>Switzerland: +41-44-234 85 00\n<br data-v-602de5d2=\"\"/>UK: +44-207-567 47 14\n<br data-v-602de5d2=\"\"/>Americas: +1-212-882 58 58\n<br data-v-602de5d2=\"\"/>APAC: +852-297-1 82 00\n<br data-v-602de5d2=\"\"/>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.ubs.com%2Fmedia&amp;esheet=54434775&amp;newsitemid=20260226055790&amp;lan=en-US&amp;anchor=www.ubs.com%2Fmedia&amp;index=1&amp;md5=18777c1e3cbea33a8dcefdd265df27e3\" tabindex=\"0\">www.ubs.com/media</a>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span data-v-602de5d2=\"\">View source version on businesswire.com: </span><span data-v-602de5d2=\"\"><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://www.businesswire.com/news/home/20260226055790/en/\" tabindex=\"0\">https://www.businesswire.com/news/home/20260226055790/en/</a></span></p></div>",
            "pub_date": "2026-02-27 13:56:28",
            "link": "https://www.morningstar.com/news/business-wire/20260226055790/changes-to-the-ubs-board-of-directors",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "My grandpa retired happily at 70 with $750K after working as a missionary. I know where most Americans go wrong.",
            "description": "<div class=\"mdc-article-body\">\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  By Quentin Fottrell </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     'You could even retire at 55 with $500,000 and be perfectly fine. Am I right?' </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     \"Realistically, no one is going to spend $100,000 a year in retirement.\" (Photo subject is a model.) </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Dear Quentin, </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     The money people need to save for retirement keeps going up, and I don't like it. I am also very skeptical. Some people say you need $5 million to retire; some say $1 million; others will give a figure anywhere in between. I am highly skeptical about these numbers and wonder what assumptions they're making about how you'll use your money. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     My grandpa retired at 70 after working as a missionary for most of his life and later at a national laboratory. He hardly earned anything as a missionary. Between his coffeehouse, wife and three kids, it all got spent. He made a lot of money at the lab, but only worked there for about 10 to 15 years before retiring. And now? He's a part-time programmer, landlord and fixes cars. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Since the goal of his life was not money, he retired with $750,000 - and he's doing fine. You know why? Because he bought two mobile homes some time ago, and a 2.5-acre lot in the middle of nowhere and started renting them before he retired. In addition to being a landlord, he also had some of his money invested in income stocks. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     He finds low-effort ways to make money. He buys an underpriced car, fixes it up, and resells it for a $1,000 profit. He used to run a programming company with my dad. They made a little money, but gained experience. That probably helped him get accepted at the laboratory. Some people even still ask him to reprogram things for them and pay him a few thousand dollars. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Thrift shopping </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     He also doesn't spend much. He doesn't own a luxury Tesla; he owns a $5,000 Prius. The only reason he spent more on a car was that my grandma really wanted one that actually worked. The rent from their garage covers their property tax. They don't eat out except on special occasions, like birthdays or holidays, and live a comfortable, low-cost life. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     They take a 30-minute walk every day to stay healthy. My grandma loves shopping a bit too much, but she shops at thrift stores, so their shopping and entertainment expenses remain low. So my grandpa doesn't receive much Social Security, but he makes it work because he uses his money wisely. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     The American dream is to make six figures and buy a house. If you have $2.5 million in a money-market account with a 4% return, you get $100,000 a year. Realistically, no one is going to spend $100,000 a year in retirement. The average American spends $78,500 per year. That means, with no interest, $1 million would last about 12 years at that spending rate. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Is the problem really how much money we have - or how much we spend? I daresay that if you put your money in the right places and you are careful, you could even retire at 55 with $500,000 and be perfectly fine. Am I right? Of course, it's good to enjoy the fruits of our labor and spend some money on leisure. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Am I missing something big, or were my suspicions right all along? </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Skeptical Reader </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Don't miss: 'I spend $7,500 a month': I'm 47, earn $260K, and have $3 million. Can I retire at 50? </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     You can email The Moneyist with any financial and ethical questions at qfottrell@marketwatch.com. The Moneyist regrets he cannot reply to questions individually. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     To take your retirement-at-55-with-$500,000 scenario at face value would be tough. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Dear Skeptical, </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     I am on #teamgrandpa. He's done a lot right. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     He achieved three valuable things: He worked until he was 70. He found ways to make extra income, which includes renting his mobile homes for extra cash, and keeping his hand in freelance work for his former company, a job that was born from his willingness to take risks and experiment, and by using his assets to make money. And he keeps his costs low. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     It would be tough to retire at 55 with $500,000, even though it's a lot of money, although it again depends on your lifestyle and where you live. You would have to take into account healthcare costs, utilities, transportation, rent/mortgage, and property tax.  You could also explore a substantially equal periodic payment plan (SEPP) or employ the Rule of 55. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     It would be tough to retire at 55 with $500,000, even though it's a lot of money, </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     A reminder for readers out there: The \"rule of 55\" is an IRS provision that allows you to take penalty-free withdrawals from your current employer's 401(k) or 403(b) if you leave your job in the year you turn 55 - or later - without incurring a 10% early-withdrawal 10% penalty. SEPPs are IRS-approved, scheduled withdrawals from retirement accounts like 401(k)s and IRAs. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     To take your retirement-at-55-with-$500,000 scenario at face value would be tough. That money, all going well with your health, would need to last 35-40 years and inflation would also erode its value over time. Using the 4% rule, that would provide $20,000 per year (or $1,670 per month), especially as Medicare eligibility does not kick in until 65. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Your point about whether you need $1 million in retirement, as many surveys suggest - and also point out that $1 million is not enough - is well made. It all depends on your lifestyle, whether your income exceeds your expenses and how much you are willing to cut back in terms of all those extraneous expenses (from coffees and streaming services to eating out). </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Related: I'm 80 with $1 million. How do I prevent my son from being hit with inheritance tax? </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Retiring at 65 with $1 million </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     I have wondered in these pages whether people are squandering their retirement on eating out. All that pizza and spaghetti bolognese add up, as do the extras like drinks, side orders and desserts. Research suggests that people spend anywhere between $1,990 and $2,500 a year on restaurant food - and up to $3,640 on takeout. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     In fact, Americans spend almost as much on dining out ($1.5 trillion a year) as they owe in student debt ($1.8 trillion), according to the Department of Agriculture. Total spending on food exceeds $2.63 trillion. Taking those dining-out figures at face value, you would spend $123,750 by 80 if you started counting at 25. Or over $200,000, including takeout. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Americans spend almost as much on dining out as they owe in student debt. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     So, yes, I'm with your grandpa on this one. He pivoted from missionary work into the corporate sector and made enough money in the latter part of his working life to balance the books in retirement (otherwise known as \"making ends meet\"). That takes creativity, intelligence and gumption, and I'm sure your grandfather has those in spades. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     There are other roadblocks and/or forks in the road people face in retirement, including a gradual decline in health, which could lead to the need to live in an assisted-living facility. That too costs money (up to $100,000 a year or more, depending on the facility and location). Without long-term-care insurance, retirees often tap the equity in their homes. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Saving, which requires curtailing your spending, is just as critical for a comfortable retirement as investing in a 401(k), IRA or taxable brokerage account. I'm a big fan of shopping at thrift stores. (I just bought a pair of Dr. Martens boots in New York to get me through the snowstorm.) The freedom to travel after 65, if you have the ability, is also a reward for retirement. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     A healthy retirement fund rewards you with that. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     More columns from Quentin Fottrell: </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Can I stop my kids from using their inheritance to support political causes I vehemently oppose? </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     My wife's credit-card payment is three months overdue. As an authorized user, am I in trouble? </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     My stepmother cheated me out of $500K from my father's estate. What can I do? </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Check out The Moneyist's private Facebook group, where members help answer life's thorniest money issues. Post your questions, or weigh in on the latest Moneyist columns. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     By emailing your questions to The Moneyist or posting your dilemmas on The Moneyist Facebook group, you agree to have them published anonymously on MarketWatch. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     By submitting your story to Dow Jones &amp; Co., the publisher of MarketWatch, you understand and agree that we may use your story, or versions of it, in all media and platforms, including via third parties. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     -Quentin Fottrell </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     This content was created by MarketWatch, which is operated by Dow Jones &amp; Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal. </p>\n<pre class=\"mdc-article-pre\" data-v-370ea3ac=\"\"></pre>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  (END) Dow Jones Newswires</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  02-27-26 0016ET</p>\n\nCopyright (c) 2026 Dow Jones &amp; Company, Inc.</div>",
            "pub_date": "2026-02-27 13:36:29",
            "link": "https://www.morningstar.com/news/marketwatch/202602272/my-grandpa-retired-happily-at-70-with-750k-after-working-as-a-missionary-i-know-where-most-americans-go-wrong",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "EMEA Morning Briefing: Investor Focus Remain on Earnings",
            "description": "<div class=\"mdc-article-body\">\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     MARKET WRAPS </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Watch For: </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     France consumer spending, CPI; Germany unemployment, CPI; trading updates for IAG, BASF, Holcim, Pearson, Flutter Entertainment, Cellnex Telecom, </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Opening Call: </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     European stock futures were mixed after Asia stocks also traded mixed. U.S. Treasurys edged lower, the dollar weakened. Gold rose and oil rose. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Equities: </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     European stock futures were mixed as investors continued to digest earnings. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Technology stocks have borne the brunt of investors' skepticism, as concerns mount about stretched valuations and AI's impact on corporate earnings. The S&amp;P 500's information-technology sector is on track for its fourth straight monthly decline, its longest losing streak since 2018, according to Dow Jones Market Data. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     \"With higher valuations, obviously there's a lot more pressure on current earnings,\" said Chris Zaccarelli, chief investment officer for Northlight Asset Management. He attributed the dynamic to investors' looking past results and toward how AI disruption could squeeze earnings in the years ahead. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Forex: </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     The U.S. dollar weakened. A U.S. tech-led risk-off mood has returned and Treasurys have regained their hedging appeal, said two FX strategists at OCBC. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     \"With inflation concerns easing, Treasuries are regaining traction as a viable hedge during risk--off episodes, reinforcing the USD's safe--haven appeal,\" they added. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Bonds: </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     U.S. Treasury yields edged lower. While economic data have been mixed, most U.S. companies have avoided widespread layoffs - keeping a \"low-hire, low-fire\" labor market in place. So long as workers have jobs, lower mortgage rates could help improve affordability issues. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Yet fears of layoffs might still act as a counterbalance. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Within the bond market, \"there's been an ongoing bid related to job displacements from AI, and we've seen a drop in yields over the past couple of weeks because of that,\" LPL Financial's Gillum said in a phone interview. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Bond-market moves overnight \"seem like a continuation of that trade,\" he noted. The strategist added that traders seemed to be more focused on AI's disinflationary impacts than on the potential for elevated inflation pressures over the next few years. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Energy: </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Oil edged higher amid expectations that the U.S.-Iran talks will continue next week. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Although latest round of talks over Iran's nuclear program ended on Thursday without a deal, Oman's foreign minister and a U.S. official said the two sides had made progress and would likely meet again for talks. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     The Omani said negotiations at the level of technical experts will continue in Vienna next week. This has allayed worries over imminent U.S. military action, said ANZ Research analysts. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     However, it also \"leaves little time to reach a deal before President Trump's deadline of 1-6 March,\" the analysts added. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Metals: </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Gold rose as traders digest U.S.-Iran talks held overnight. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     The latest round of talks over Iran's nuclear program ended Thursday without a deal and both sides remained far apart on key issues. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     The U.S. increased pressure by presenting tough demands and sending more jets and warships to the region. Continuing tensions in the Middle East and Eastern Europe fuel risk aversion, said FXEM's Abdelaziz Albogdady. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     This could direct investment flows toward the precious metal, he added. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     - </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Copper fell as Chinese buyers have remained on the sidelines after returning from a weeklong Lunar New Year holiday, said ANZ Research analysts. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     The build-up of copper inventories in China was also greater than usual during the holiday period, they added. This comes as stockpiles in global exchanges rose to a record high in late January, supported by changes in U.S. trade policy and mine disruptions, they said. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     TODAY'S TOP HEADLINES </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Fed's Miran Says Four Cuts Are Appropriate This Year </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Federal Reserve governor Stephen Miran said he thinks the Fed needs to cut interest rates by about a percentage point this year in a Fox Business interview Thursday. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     \"Four cuts I think are appropriate,\" he said. \"I'd rather get them sooner than later,\" he added. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     U.K. Consumer Mood Darkens Amid Lingering Cost-Of-Living Squeeze </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     U.K. consumer sentiment fell unexpectedly in February as cost-of-living pressures continue to weigh on households. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Consumer confidence fell three points to minus 19 in the month, according to research group GfK's index, published with the Nuremberg Institute for Market Decisions on Friday. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Jack Dorsey's Block to Lay Off 40% of Its Workforce in AI Remake </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Block, the payments company founded by Jack Dorsey that includes Square and Cash App, said Thursday that it plans to lay off 40% of its workforce, or more than 4,000 employees. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Dorsey alluded to artificial-intelligence tools as the reason for the cuts in a letter to shareholders. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Write to singaporeeditors@dowjones.com </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Expected Major Events for Friday </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     00:01/UK: Feb UK Consumer Confidence Survey </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     00:01/UK: Jan UK monthly automotive manufacturing figures </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     05:30/NED: Jan PPI </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     06:00/FIN: 4Q GDP </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     06:00/FIN: Jan Retail sales </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     07:00/SWE: Jan Foreign trade </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     07:00/SWE: Jan Retail sales </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     07:00/NOR: Jan Retail Sales </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     07:00/SWE: 4Q GDP </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     07:00/DEN: Jan Unemployment </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     07:00/TUR: Jan Employment / Unemployment </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     07:00/GER: Jan Foreign trade price indices </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     07:30/HUN: Jan Employment &amp; unemployment </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     07:30/HUN: Jan PPI </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     07:45/FRA: Jan PPI </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     07:45/FRA: Jan Household consumption expenditure in manufactured goods </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     07:45/FRA: Feb Provisional CPI </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     07:45/FRA: 4Q GDP - detailed figures </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     07:45/FRA: 4Q Job creation </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     08:00/SPN: Feb Flash Estimate CPI </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     08:00/SWI: 4Q GDP </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     08:00/SWI: Feb KOF economic barometer </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     08:55/GER: Feb Labour market statistics (incl unemployment) </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     09:00/ITA: Dec Industrial turnover </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     09:00/BUL: Jan PPI </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     09:00/ICE: 4Q GDP </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     09:00/GER: Feb Bavaria CPI </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     09:00/GER: Feb North Rhine Westphalia CPI </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     09:00/GER: Feb Saxony CPI </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     09:00/GER: Feb Brandenburg CPI </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     09:00/GER: Feb Hesse CPI </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     09:00/GER: Feb Baden-Wuerttemberg CPI </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     10:00/MLT: Jan RPI </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     10:00/CRO: 4Q Flash Estimate GDP </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     10:00/CRO: 4Q GDP </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     10:00/BEL: 4Q Final GDP </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     10:00/ITA: Jan Foreign Trade non-EU </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     10:00/GRE: Jan PPI </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     10:00/GRE: Dec Turnover Index in Retail Trade </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     10:00/LUX: Jan PPI </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     All times in GMT. Powered by Onclusive and Dow Jones. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Write to us at newsletters@dowjones.com </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     We offer an enhanced version of this briefing that is optimized for viewing on mobile devices and sent directly to your email inbox. If you would like to sign up, please go to https://newsplus.wsj.com/subscriptions. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     This article is a text version of a Wall Street Journal newsletter published earlier today. </p>\n<pre class=\"mdc-article-pre\" data-v-370ea3ac=\"\"></pre>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  (END) Dow Jones Newswires</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  February 27, 2026 00:22 ET (05:22 GMT)</p>\n\nCopyright (c) 2026 Dow Jones &amp; Company, Inc.</div>",
            "pub_date": "2026-02-27 13:36:28",
            "link": "https://www.morningstar.com/news/dow-jones/2026022779/emea-morning-briefing-investor-focus-remain-on-earnings",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Dow Jones Top Energy Headlines at 12 AM ET: U.S.-Iran nuclear talks end, but with hope that negotiations continue. That still leaves the oil market in limbo. | Big ...",
            "description": "<div class=\"mdc-article-body\">\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  U.S.-Iran nuclear talks end, but with hope that negotiations continue. That still leaves the oil market in limbo. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Nuclear talks on Thursday were expected to ease the uncertainty surrounding tensions between the U.S. and Iran. They ended with the promise of further discussions. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     ---- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Big Oil Is Urging Trump to Stop Battle on Offshore Wind </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  The president's assault on wind farms is stalling a legislative push to speed permitting for energy projects. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     ---- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Engie to Buy UK Power Networks for $14.2 Billion From Hong Kong's CK Group </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  France's Engie will acquire UK Power Networks for 10.5 billion pounds in equity value, equivalent to about $14.2 billion, from Hong Kong billionaire Li Ka-shing's CK Group. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     ---- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Eni Earnings Rise on Higher Production </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Adjusted net profit-the company's preferred metric-jumped 35% and earnings were supported by a more than 7% rise in oil and gas production. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     ---- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Oil Futures Slip Amid Jitters Over U.S.-Iran Talks </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Crude futures settled lower in a volatile session as the U.S. and Iran wound up a day of talks in Geneva. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     ---- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Energy &amp; Utilities Roundup: Market Talk </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Find insight on oil futures, Veolia and more in the latest Market Talks covering Energy and Utilities. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     ---- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  U.S. Natural Gas Futures Fall on Weather Outlook </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  U.S. natural gas settled lower with the April contract moving to the front of the curve. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     ---- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  U.S. Opens the Way for Fuel-Starved Cuba to Get Oil Shipments </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  The Treasury Department also said some shipments of American fuel could be legal to relieve the humanitarian crisis on the Communist island. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     ---- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  U.S. Crude Oil Stockpiles Post Large Weekly Build </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Crude oil inventories rose by 16 million barrels, posting their biggest weekly increase in three years as imports rose, exports fell and refineries cut their capacity use. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     ---- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Nordex Surges 16% on Earnings Beat, Potential U.S. Expansion </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Energy demand from AI-driven data center expansion will drive demand momentum in North America, the wind-turbine manufacturer said. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     ---- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Iberdrola's Net Profit Rises, Reiterates Guidance </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Iberdrola said net profit rose in 2025, driven by its networks business, and the energy company reiterated its guidance for the year ahead. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     ---- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  E.ON's Earnings Rise as It Spends on European Energy Infrastructure </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  E.ON's earnings rose as it expanded and upgraded energy infrastructure across Europe and it raised its investment plan to 2030. </p>\n<pre class=\"mdc-article-pre\" data-v-370ea3ac=\"\"></pre>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  (END) Dow Jones Newswires</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  February 27, 2026 00:15 ET (05:15 GMT)</p>\n\nCopyright (c) 2026 Dow Jones &amp; Company, Inc.</div>",
            "pub_date": "2026-02-27 13:20:46",
            "link": "https://www.morningstar.com/news/dow-jones/2026022758/dow-jones-top-energy-headlines-at-12-am-et-us-iran-nuclear-talks-end-but-with-hope-that-negotiations-continue-that-still-leaves-the-oil-market-in-limbo-big",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Dow Jones Top Financial Services Headlines at 12 AM ET: Jack Dorsey's Block to Lay Off 40% of Its Workforce in AI Remake | How ...",
            "description": "<div class=\"mdc-article-body\">\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Jack Dorsey's Block to Lay Off 40% of Its Workforce in AI Remake </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  The company said the plan would cost it $450 million to $500 million in expenses and severance. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     ---- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  How JPMorgan's Bankers Stayed Close to Epstein After Bank Fired Him as a Client </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Two of the firm's bankers maintained close ties with Jeffrey Epstein as he took on a bigger role running the family office of Apollo Global Management co-founder Leon Black. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     ---- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Fed's Miran Says Four Cuts Are Appropriate This Year </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Federal Reserve governor Stephen Miran said he thinks the Fed needs to cut interest rates by about a percentage point this year. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     ---- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Brink's to Acquire NCR Atleos in $4 Billion Deal in Combo of ATM Players </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Brink's said the deal would boost its scale and geographic footprint, adding 78,000 owned-and-operated ATMs to its own network. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     ---- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Carlyle Aims to Haul In $200 Billion Over Three Years </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  The firm's strategies designed for individual investors are expected to attract about a fifth of the total raised through 2028. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     ---- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Victory Capital Files Competing Bid to Acquire Janus Henderson </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Victory Capital said it submitted a bid to acquire Janus Henderson that it says is higher than the $7.4 billion offered in December by Nelson Peltz's Trian Fund Management and venture firm General Catalyst. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     ---- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Vanguard Settles Texas Lawsuit Alleging Investors Conspired to Drive Up Coal Prices </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Vanguard Group agreed to pay several U.S. states $29.5 million to settle a lawsuit alleging it worked with other index-fund managers to pressure coal companies to reduce output. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     ---- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  TD Bank Quarterly Earnings Lifted by Growth Across Operations </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Toronto-Dominion Bank's earnings jumped in the first three months of its fiscal year as the big Canadian lender saw revenue growth across its operations. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     ---- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Royal Bank of Canada Earnings Lifted by Personal Banking, Markets Growth </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  The bank, Canada's biggest by market value, turned in a stronger-than-expected profit in the first quarter with gains across most business segments. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     ---- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  LSEG Shares Rise After Forecast of Profitability Boost, $4 Billion Buybacks </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  The financial-data provider and exchange operator said continued revenue growth and efficiencies would help it improve profitability beyond this year. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     ---- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Munich Re Profit Dented By Currency Headwinds </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  The reinsurer's fourth-quarter profit fell 11.5% as foreign exchange fluctuations dragged. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     ---- </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Allianz Posts Rise in Operating Profit, Issues In-Line Guidance </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Europe's largest insurer by market capitalization delivered record operating profit for 2025 as it reported growth across its key metrics in the final quarter. </p>\n<pre class=\"mdc-article-pre\" data-v-370ea3ac=\"\"></pre>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  (END) Dow Jones Newswires</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  February 27, 2026 00:15 ET (05:15 GMT)</p>\n\nCopyright (c) 2026 Dow Jones &amp; Company, Inc.</div>",
            "pub_date": "2026-02-27 13:20:45",
            "link": "https://www.morningstar.com/news/dow-jones/2026022759/dow-jones-top-financial-services-headlines-at-12-am-et-jack-dorseys-block-to-lay-off-40-of-its-workforce-in-ai-remake-how",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Medit Announces \"Glow Together\" International Women's Day Campaign",
            "description": "<div class=\"mdc-article-body\">\n            \n              \n              Medit Announces \"Glow Together\" International Women's Day Campaign\n              \n            \n            \n              <span>\n<h2 class=\"mdc-article-heading mdc-heading__mdc mdc-heading--level-5__mdc\" data-v-618d53ae=\"\">Medit Announces \"Glow Together\" International Women's Day Campaign</h2>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">PR Newswire</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">SEOUL, South Korea, Feb. 27, 2026</p>\n</span>\n<span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span data-v-602de5d2=\"\">SEOUL, South Korea</span>, <span data-v-602de5d2=\"\">Feb. 27, 2026</span> /PRNewswire/ -- Medit, a global provider of digital dentistry solutions, today announced that <span data-v-602de5d2=\"\">the </span>\"Glow Together\" <span data-v-602de5d2=\"\">campaign </span>will <span data-v-602de5d2=\"\">begin this</span> March. The 'Glow Together' initiative began with small steps taken by the female employees of Medit. <span data-v-602de5d2=\"\">Light </span>becomes more powerful when it is shared. Created in the spirit of International Women's Day, Glow Together is designed to spark connection across the dental community—and to translate participation into meaningful, real-world care beyond the clinic.</p>\n<span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://mma.prnewswire.com/media/2921516/Press_Release_I_Glow_Campaign__EN_20260210_064902.html\" tabindex=\"0\">\n<span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img\" data-v-f0ef0696=\"\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://mma.prnewswire.com/media/2921516/Press_Release_I_Glow_Campaign__EN_20260210_064902.jpg\"/></picture></span>\n</a>\n</p>\n</span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">While inspired by International Women's Day and the impact women help drive, Glow Together is open to all dental professionals who want to be part of a campaign that connects purpose with action.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Dental professionals can learn more about campaign details, eligibility, and registration: <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://www.medit.com/glow_together/\" tabindex=\"0\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">https://www.medit.com/glow_together/</strong></a></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">A Campaign Built on Shared Light</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Glow Together began as an internal conversation among Medit's female team members about how small acts—when shared—can create momentum and measurable impact. The campaign goes beyond a moment of recognition, highlighting how care, connection, and intention can move forward together and support communities in a tangible way.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Turning Participation into Real-World Care Through GDR</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Glow Together links participation to children's dental care through Medit's partnership with Global Dental Relief (GDR). When customers purchase and register a qualifying scanner—Medit i900 Mobility (or Medit i900 / i900 classic in markets where i900 Mobility is not available)—they become part of the Glow Together campaign.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">With each qualifying participation, Medit will provide a donation intended to help fund the equivalent cost of dental care for 10 children, with an impact goal aligned to supporting care for thousands of children through GDR's 2026 projects.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Learn more about Global Dental Relief (GDR): <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://www.globaldentalrelief.org/\" tabindex=\"0\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">https://www.globaldentalrelief.org/</strong></a></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Glow Together Campaign Kit for Participants</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">To thank participants, Medit will provide a Glow Together Campaign Kit as a tangible reminder of light, care, and connection<em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">.</em> The kit includes:</p><ul class=\"mdc-article-list mdc-article-list--unordered\" data-v-7b473e83=\"\"><li data-v-7b473e83=\"\">Scanner carrying case</li><li data-v-7b473e83=\"\">Scanner protection case (not for clinical use)</li><li data-v-7b473e83=\"\">Mini lamp</li><li data-v-7b473e83=\"\">Bracelet</li><li data-v-7b473e83=\"\">Exclusive Mentor-Led Insight Series</li></ul><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Mentor-led Insight Series (Inspiration &amp; Growth-Focused)</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">In addition to the kit, participants receive access to a mentor-led insight series featuring pre-recorded sessions from mentors across diverse fields. Designed to feel inspiring, practical, and confidence-building, the series explores themes such as:</p><ul class=\"mdc-article-list mdc-article-list--unordered\" data-v-7b473e83=\"\"><li data-v-7b473e83=\"\">Lessons from growth and real-world momentum</li><li data-v-7b473e83=\"\">Career crossroads and defining turning points</li><li data-v-7b473e83=\"\">Leadership that lasts through every stage of practice</li><li data-v-7b473e83=\"\">Redefining success with purpose and perspective</li></ul><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">This series is intended as inspiration and professional growth content, not clinical training. Access is provided via a QR code included in the campaign kit.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Limited-Time Availability</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Glow Together is available for a limited time during the campaign period. Dental professionals interested in participating are encouraged to visit the campaign page to review eligibility, local availability, and registration details: <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://www.medit.com/glow_together/\" tabindex=\"0\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">https://www.medit.com/glow_together/</strong></a></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">About Medit</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Medit is a global provider of 3D intraoral scanners and digital dentistry solutions based on proprietary technology. The company enables collaborative workflows between dental clinics and labs through innovative hardware and software solutions. Headquartered in Seoul, South Korea, since 2000, Medit has a strong global presence through its offices in the Americas and Europe and a distributor network spanning over 100 countries. For more information and updates, visit <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://www.medit.com/\" tabindex=\"0\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">https://www.medit.com/</strong></a></p>\n<span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://mma.prnewswire.com/media/1798058/Logo_MEDIT_Logo.html\" tabindex=\"0\">\n<span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img\" data-v-f0ef0696=\"\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://mma.prnewswire.com/media/1798058/Logo_MEDIT_Logo.jpg\"/></picture></span>\n</a>\n</p>\n</span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img mdc-article-image__img--12-width\" data-v-f0ef0696=\"\" style=\"width:12px;\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://edge.prnewswire.com/c/img/favicon.png?sn=CN97068&amp;sd=2026-02-27\"/></picture></span> View original content to download multimedia:<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://www.prnewswire.com/news-releases/medit-announces-glow-together-international-womens-day-campaign-302699106.html\" tabindex=\"0\">https://www.prnewswire.com/news-releases/medit-announces-glow-together-international-womens-day-campaign-302699106.html</a></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">SOURCE Medit</p></span>\n</div>",
            "pub_date": "2026-02-27 13:11:30",
            "link": "https://www.morningstar.com/news/pr-newswire/20260227cn97068/medit-announces-glow-together-international-womens-day-campaign",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Ultra Clean Prices Upsized $525.0 Million Convertible Senior Notes Offering",
            "description": "<div class=\"mdc-article-body\">\n            \n              \n              Ultra Clean Prices Upsized $525.0 Million Convertible Senior Notes Offering\n              \n            \n            \n              <span>\n<h2 class=\"mdc-article-heading mdc-heading__mdc mdc-heading--level-5__mdc\" data-v-618d53ae=\"\">Ultra Clean Prices Upsized $525.0 Million Convertible Senior Notes Offering</h2>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">PR Newswire</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">HAYWARD, Calif., Feb. 26, 2026</p>\n</span>\n<span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span data-v-602de5d2=\"\">HAYWARD, Calif.</span>, <span data-v-602de5d2=\"\">Feb. 26, 2026</span> /PRNewswire/ -- Ultra Clean Holdings, Inc. (Nasdaq: UCTT) today announced the pricing of its offering of $525.0 million aggregate principal amount of 0.00% convertible senior notes due 2031 (the \"notes\") in a private offering to persons reasonably believed to be qualified institutional buyers pursuant to Rule 144A under the Securities Act of 1933, as amended (the \"Securities Act\"). The offering size was increased from the previously announced offering size of $400.0 million aggregate principal amount of notes. The issuance and sale of the notes are scheduled to settle on March 3, 2026, subject to customary closing conditions. Ultra Clean also granted the initial purchasers of the notes an option to purchase, for settlement within a period of 13 days from, and including, the date the notes are first issued, up to an additional $75.0 million principal amount of notes.</p>\n<span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://mma.prnewswire.com/media/582701/Ultra_Clean_Holdings_Logo.html\" tabindex=\"0\">\n<span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img\" data-v-f0ef0696=\"\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://mma.prnewswire.com/media/582701/Ultra_Clean_Holdings_Logo.jpg\"/></picture></span>\n</a>\n</p>\n</span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Ultra Clean estimates that the net proceeds from the offering will be approximately $511.1 million (or approximately $584.2 million if the initial purchasers fully exercise their option to purchase additional notes), after deducting the initial purchasers' discounts and commissions and estimated offering expenses. Ultra Clean intends to use the net proceeds from the offering as follows:</p><ul class=\"mdc-article-list mdc-article-list--unordered\" data-v-7b473e83=\"\"><li data-v-7b473e83=\"\">approximately $21.9 million of the net proceeds from the offering to fund the cost of entering into the capped call transactions described below;</li><li data-v-7b473e83=\"\">approximately $40.0 million of the net proceeds from the offering to repurchase 672,608 shares of its common stock; and</li><li data-v-7b473e83=\"\">the remainder for working capital, prepayment of a portion of the company's outstanding term loan under its amended and restated credit agreement or other general corporate purposes.</li></ul><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">If the initial purchasers exercise their option to purchase additional notes, then Ultra Clean intends to use a portion of the additional net proceeds to fund the cost of entering into additional capped call transactions, as described below, and the remainder for the purposes described above.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">The notes will be senior, unsecured obligations of Ultra Clean. The notes will not bear regular interest and the principal amount of the notes will not accrete. The notes will mature on March 15, 2031, unless earlier repurchased, redeemed or converted. Before December 16, 2030, noteholders will have the right to convert their notes only upon the occurrence of certain events. From and after December 16, 2030, noteholders may convert their notes at any time at their election until the close of business on the second scheduled trading day immediately before the maturity date. Ultra Clean will settle conversions in cash and, if applicable, shares of its common stock. The initial conversion rate is 11.8001 shares of common stock per $1,000 principal amount of notes, which represents an initial conversion price of approximately $84.75 per share of common stock. The initial conversion price represents a premium of approximately 42.5% over the last reported sale price of $59.47 per share of Ultra Clean's common stock on February 26, 2026. The conversion rate and conversion price will be subject to adjustment upon the occurrence of certain events. If a \"make-whole fundamental change\" (as defined in the indenture for the notes) occurs, then Ultra Clean will, in certain circumstances, increase the conversion rate for a specified period of time for holders who convert their notes in connection with that make-whole fundamental change.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">The notes will be redeemable, in whole or in part (subject to certain limitations), for cash at Ultra Clean's option at any time, and from time to time, on or after March 20, 2029 and on or before the 40th scheduled trading day immediately before the maturity date, but only if the last reported sale price per share of Ultra Clean's common stock exceeds 130% of the conversion price for a specified period of time and certain other conditions are satisfied. The redemption price will be equal to the principal amount of the notes to be redeemed, plus accrued and unpaid special interest and additional interest, if any, to, but excluding, the redemption date. If Ultra Clean calls any or all notes for redemption, then holders of notes called for redemption may convert their notes during the related redemption conversion period, and such conversions will also constitute a make-whole fundamental change with respect to the notes so converted.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">If a \"fundamental change\" (as defined in the indenture for the notes) occurs, then, subject to a limited exception, noteholders may require Ultra Clean to repurchase their notes for cash. The repurchase price will be equal to the principal amount of the notes to be repurchased, plus accrued and unpaid special interest and additional interest, if any, to, but excluding, the applicable repurchase date.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">In connection with the pricing of the notes, Ultra Clean entered into privately negotiated capped call transactions with certain of the initial purchasers or their affiliates and certain other financial institutions (the \"option counterparties\"). The capped call transactions will cover, subject to anti-dilution adjustments substantially similar to those applicable to the notes, the number of shares of Ultra Clean's common stock initially underlying the notes. If the initial purchasers exercise their option to purchase additional notes, Ultra Clean expects to enter into additional capped call transactions with the option counterparties.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">The cap price of the capped call transactions will initially be $104.0725 per share, which represents a premium of 75.0% over the last reported sale price of Ultra Clean's common stock of $59.47 per share on February 26, 2026, and is subject to certain adjustments under the terms of the capped call transactions.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">The capped call transactions are expected generally to reduce the potential dilution to Ultra Clean's common stock upon any conversion of the notes and/or offset any potential cash payments Ultra Clean is required to make in excess of the principal amount of converted notes, as the case may be, upon conversion of the notes. If, however, the market price per share of Ultra Clean's common stock, as measured under the terms of the capped call transactions, exceeds the cap price of the capped call transactions, there would nevertheless be dilution and/or there would not be an offset of such potential cash payments, in each case, to the extent that such market price exceeds the cap price of the capped call transactions.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Ultra Clean has been advised that, in connection with establishing their initial hedges of the capped call transactions, the option counterparties or their respective affiliates expect to enter into various derivative transactions with respect to Ultra Clean's common stock and/or purchase shares of Ultra Clean's common stock concurrently with or shortly after the pricing of the notes. This activity could increase (or reduce the size of any decrease in) the market price of Ultra Clean's common stock or the notes at that time.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">In addition, the option counterparties or their respective affiliates may modify their hedge positions by entering into or unwinding various derivatives with respect to Ultra Clean's common stock and/or purchasing or selling Ultra Clean's common stock or other securities of Ultra Clean in secondary market transactions following the pricing of the notes and prior to the maturity of the notes (and (x) are likely to do so during the relevant valuation period under the capped call transactions and (y) are likely to do so following any early conversion or repurchase of the notes by Ultra Clean, if Ultra Clean elects to unwind a corresponding portion of the capped call transactions in connection with such early conversion or repurchase). This activity could also cause or avoid an increase or a decrease in the market price of Ultra Clean's common stock or the notes, which could affect the ability to convert the notes and, to the extent the activity occurs during any observation period related to a conversion of notes, it could affect the number of shares of common stock and value of the consideration that noteholders will receive upon conversion of the notes.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Concurrently with the pricing of the notes, Ultra Clean entered into privately negotiated transactions with or through one of the initial purchasers of the notes in this offering to use approximately $40.0 million of the net proceeds from the notes offering to repurchase shares of Ultra Clean's common stock at a purchase price of $59.47 per share. These share repurchases could increase (or reduce the size of any decrease in) the market price of Ultra Clean's common stock or the notes, and could result in a higher effective conversion price for the notes. The offering of the notes is not contingent upon the repurchase of any common stock.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">The offer and sale of the notes and any shares of common stock issuable upon conversion of the notes have not been, and will not be, registered under the Securities Act or any other securities laws, and the notes and any such shares cannot be offered or sold except pursuant to an exemption from, or in a transaction not subject to, the registration requirements of the Securities Act and any other applicable securities laws. This press release does not constitute an offer to sell, or the solicitation of an offer to buy, the notes or any shares of common stock issuable upon conversion of the notes, nor will there be any sale of the notes or any such shares, in any state or other jurisdiction in which such offer, sale or solicitation would be unlawful.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Forward-Looking Statements</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">This press release includes forward-looking statements, including statements regarding the completion of the offering and the share repurchases, the expected amount and intended use of the net proceeds and the effects of entering into the capped call transactions described above. Forward-looking statements represent Ultra Clean's current expectations regarding future events and are subject to known and unknown risks and uncertainties that could cause actual results to differ materially from those implied by the forward-looking statements. Among those risks and uncertainties are market conditions, the satisfaction of the closing conditions related to the offering and risks relating to Ultra Clean's business, including those described in periodic reports that Ultra Clean files from time to time with the SEC. Ultra Clean may not consummate the offering described in this press release and, if the offering is consummated, cannot provide any assurances regarding its ability to effectively apply the net proceeds as described above. The forward-looking statements included in this press release speak only as of the date of this press release, and Ultra Clean does not undertake to update the statements included in this press release for subsequent developments, except as may be required by law.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Contact</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Rhonda Bennetto<br data-v-602de5d2=\"\"/>SVP Investor Relations<br data-v-602de5d2=\"\"/><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"mailto:rbennetto@uct.com\" tabindex=\"0\">rbennetto@uct.com</a></p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img mdc-article-image__img--12-width\" data-v-f0ef0696=\"\" style=\"width:12px;\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://edge.prnewswire.com/c/img/favicon.png?sn=SF97545&amp;sd=2026-02-26\"/></picture></span> View original content to download multimedia:<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://www.prnewswire.com/news-releases/ultra-clean-prices-upsized-525-0-million-convertible-senior-notes-offering-302699294.html\" tabindex=\"0\">https://www.prnewswire.com/news-releases/ultra-clean-prices-upsized-525-0-million-convertible-senior-notes-offering-302699294.html</a></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">SOURCE Ultra Clean Holdings, Inc.</p></span>\n<span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img\" data-v-f0ef0696=\"\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://rt.prnewswire.com/rt.gif?NewsItemId=SF97545&amp;Transmission_Id=202602262341PR_NEWS_USPR_____SF97545&amp;DateId=20260226\"/></picture></span>\n</div>",
            "pub_date": "2026-02-27 13:05:49",
            "link": "https://www.morningstar.com/news/pr-newswire/20260226sf97545/ultra-clean-prices-upsized-5250-million-convertible-senior-notes-offering",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Insta360 Secures Complete Victory in ITC Final Ruling",
            "description": "<div class=\"mdc-article-body\">\n            \n              \n              Insta360 Secures Complete Victory in ITC Final Ruling\n              \n            \n            \n              <span>\n<h2 class=\"mdc-article-heading mdc-heading__mdc mdc-heading--level-5__mdc\" data-v-618d53ae=\"\">Insta360 Secures Complete Victory in ITC Final Ruling</h2>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">PR Newswire</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">LOS ANGELES, Feb. 26, 2026</p>\n</span>\n<span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">U.S. International Trade Commission rejects GoPro's patent infringement claims, affirming Insta360's independent innovation.</em></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span data-v-602de5d2=\"\">LOS ANGELES</span>, <span data-v-602de5d2=\"\">Feb. 26, 2026</span> /PRNewswire/ -- Insta360, trading as Arashi Vision Inc. (688775.SS), secured a complete victory in Investigation No. 337-TA-1400 as the U.S. International Trade Commission (ITC) issued a final determination in favor of the innovative 360 camera company.</p>\n<span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://mma.prnewswire.com/media/2921870/Insta360_Logo.html\" tabindex=\"0\">\n<span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img\" data-v-f0ef0696=\"\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://mma.prnewswire.com/media/2921870/Insta360_Logo.jpg\"/></picture></span>\n</a>\n</p>\n</span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">The Commission cleared Insta360 with respect to five utility patents relating to stabilization, horizon leveling, distortion correction, and aspect ratio conversion, confirming that the patents were invalid, not infringed, or both. The Commission also reversed the Administrative Law Judge (ALJ)'s prior finding of infringement as to the '052 patent relating to distortion and found additional non-infringement as to the '840 patent relating to stabilization.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">In addition, the ALJ's determination that Insta360's updated product designs fall outside the scope of GoPro's asserted design patent stands and is now final.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">As a result of the Commission's ruling, Insta360 will continue to import and sell its existing product lineup in the United States without restriction.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\"The ITC's decision reaffirms what the industry has long recognized: Insta360's technology is built on true innovation. The facts spoke for themselves,\" said JK Liu, Founder of Insta360. \"True innovators compete by building better tools. The ITC's decision allows us to continue doing what we do best: empowering users with bold, boundary-pushing technology.\"</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\"The future of this industry should be shaped by better products, not legal tactics that protect market share at the expense of consumers. Too often, successful companies are targeted by patent litigation from competitors looking to reclaim lost ground. What the industry needs is an environment where the best ideas prevail, not legal maneuvering. Only when innovation can compete freely will the entire ecosystem move forward.\"</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">The ITC's final determination is a total rebuke of Insta360's competitors' efforts to use meritless patent assertions to improperly block lawful competition. The evidentiary record developed during the investigation demonstrated that Insta360 independently developed its technology and that GoPro's allegations lacked merit. The Commission's final determination represents a complete resolution of the investigation in Insta360's favor.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">About Insta360</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">With a \"Think bold\" mindset, Insta360 empowers people to capture and share their lives in extraordinary ways. Recognized as a market leader and innovator, Insta360's vast lineup includes the world's best-selling 360 cameras in the X Series, the thumb-sized GO Series for everyday capture, as well as an extensive range of action cameras, gimbals, webcams, and professional photography solutions. With intuitive, AI-powered software, Insta360 simplifies the creative process, allowing users to focus on storytelling without technical barriers. Insta360 is dedicated to helping a new generation of athletes, creatives, travelers and professionals bring their ideas to life.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">For more details visit:<span class=\"mdc-article-underline\" data-v-1f1bdc8a=\"\"><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"http://www.insta360.com/\" tabindex=\"0\"> http://www.insta360.com</a><br data-v-1f1bdc8a=\"\"/></span>About the Think Bold Fund:<span class=\"mdc-article-underline\" data-v-1f1bdc8a=\"\"><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://www.insta360.com/ThinkBoldFund\" tabindex=\"0\"> https://www.insta360.com/ThinkBoldFund</a><br data-v-1f1bdc8a=\"\"/></span>Read our blog:<span class=\"mdc-article-underline\" data-v-1f1bdc8a=\"\"><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"http://blog.insta360.com/\" tabindex=\"0\"> </a><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://www.insta360.com/blog\" tabindex=\"0\">https://www.insta360.com/blog</a><br data-v-1f1bdc8a=\"\"/></span>Follow us on Facebook:<span class=\"mdc-article-underline\" data-v-1f1bdc8a=\"\"><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://www.facebook.com/Insta360/\" tabindex=\"0\"> https://www.facebook.com/Insta360</a><br data-v-1f1bdc8a=\"\"/></span>Follow us on X:<span class=\"mdc-article-underline\" data-v-1f1bdc8a=\"\"><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"http://twitter.com/insta360\" tabindex=\"0\"> </a><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://x.com/insta360\" tabindex=\"0\">https://x.com/insta360</a><br data-v-1f1bdc8a=\"\"/></span>Follow us on Instagram:<span class=\"mdc-article-underline\" data-v-1f1bdc8a=\"\"><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"http://www.instagram.com/insta360/\" tabindex=\"0\"> http://www.instagram.com/insta360</a><br data-v-1f1bdc8a=\"\"/></span>Follow us on TikTok:<span class=\"mdc-article-underline\" data-v-1f1bdc8a=\"\"><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"http://tiktok.com/@insta360_official\" tabindex=\"0\"> http://tiktok.com/@insta360_official</a><br data-v-1f1bdc8a=\"\"/></span>Follow us on LinkedIn: <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://www.linkedin.com/company/insta360\" tabindex=\"0\">https://www.linkedin.com/company/insta360</a> <br data-v-602de5d2=\"\"/>Subscribe to our YouTube Channel:<span class=\"mdc-article-underline\" data-v-1f1bdc8a=\"\"><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"http://www.youtube.com/insta360\" tabindex=\"0\"> http://www.youtube.com/insta360</a></span></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Press Contact<br data-v-479a2324=\"\"/></strong>Insta360<br data-v-602de5d2=\"\"/><span class=\"mdc-article-underline\" data-v-1f1bdc8a=\"\"><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"mailto:pr@insta360.com\" tabindex=\"0\">pr@insta360.com</a></span> </p>\n<span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://mma.prnewswire.com/media/2921832/slogan_black_on_yellow_16_9_high_quality.html\" tabindex=\"0\">\n<span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img\" data-v-f0ef0696=\"\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://mma.prnewswire.com/media/2921832/slogan_black_on_yellow_16_9_high_quality.jpg\"/></picture></span>\n</a>\n</p>\n</span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img mdc-article-image__img--12-width\" data-v-f0ef0696=\"\" style=\"width:12px;\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://edge.prnewswire.com/c/img/favicon.png?sn=CN97449&amp;sd=2026-02-26\"/></picture></span> View original content to download multimedia:<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://www.prnewswire.com/news-releases/insta360-secures-complete-victory-in-itc-final-ruling-302699307.html\" tabindex=\"0\">https://www.prnewswire.com/news-releases/insta360-secures-complete-victory-in-itc-final-ruling-302699307.html</a></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">SOURCE Insta360</p></span>\n<span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img\" data-v-f0ef0696=\"\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://rt.prnewswire.com/rt.gif?NewsItemId=CN97449&amp;Transmission_Id=202602262351PR_NEWS_USPR_____CN97449&amp;DateId=20260226\"/></picture></span>\n</div>",
            "pub_date": "2026-02-27 13:05:48",
            "link": "https://www.morningstar.com/news/pr-newswire/20260226cn97449/insta360-secures-complete-victory-in-itc-final-ruling",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Japan Government to Become Top Shareholder in Chipmaker Rapidus",
            "description": "<div class=\"mdc-article-body\">\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  By Yang Jie </p>\n<pre class=\"mdc-article-pre\" data-v-370ea3ac=\"\"></pre>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Japan's government is tightening its grip on the nation's fledgling semiconductor industry, unveiling a funding structure under which it could take a stake of over 50% in Rapidus, the country's bet on advanced chipmaking. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Ryosei Akazawa, Japan's minister of economy, trade and industry, said Friday that the government has invested 100 billion yen, or about $640 million, in the chip maker. It has voting rights of 11.5% but with the option to boost that to more than 50% if Rapidus runs into any financial or operational problems. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  The initial capital injection will be deployed immediately, with an additional 150 billion yen earmarked in the upcoming budget, bringing the government's total equity commitment in Rapidus to 250 billion yen for the 2026 fiscal year. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  The move signals a shift toward a more aggressive industrial policy as Japan pushes to regain its footing in the global silicon arms race, industry analysts said. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Japan has pinned its hopes on Rapidus, a state-backed venture established in 2022 with the mission of developing home-grown advanced chipmaking capacity. It has also been courting foreign companies, seeking to bring their expertise into the domestic ecosystem. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Earlier this month, Taiwan Semiconductor Manufacturing Co. finalized an agreement to produce 3-nanometer chips at its second Japanese facility in Kumamoto, an upgrade from previous plans for more mature nodes. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  That was a major leap for Japan, which doesn't yet have capacity to mass produce advanced chips essential for artificial intelligence. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  The government has been pushing to change that, backing projects like the Kumamoto expansion, which provides a high-volume manufacturing baseline for the country. Rapidus meanwhile is focused on the even more ambitious goal of making 2-nanometer logic chips. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  To further safeguard its investment in the state-backed venture, the government will hold a so-called \"golden share\" in Rapidus, granting it veto power over board decisions to protect against economic security risks and foreign influence. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  A combined $1.07 billion investment pledge in Rapidus from 32 companies reflects renewed interest from the private sector too. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  The investment pool, which includes contributions from a broad range of domestic industry leaders, surpassed the government's initial projections for private funding. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  The capital commitment \"exceeds the initial target of 130 billion yen,\" a sign that \"expectations for the project are clearly mounting\", Akazawa said. </p>\n<pre class=\"mdc-article-pre\" data-v-370ea3ac=\"\"></pre>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Write to Yang Jie at jie.yang@wsj.com </p>\n<pre class=\"mdc-article-pre\" data-v-370ea3ac=\"\"></pre>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  (END) Dow Jones Newswires</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  February 26, 2026 23:25 ET (04:25 GMT)</p>\n\nCopyright (c) 2026 Dow Jones &amp; Company, Inc.</div>",
            "pub_date": "2026-02-27 12:36:35",
            "link": "https://www.morningstar.com/news/dow-jones/2026022619857/japan-government-to-become-top-shareholder-in-chipmaker-rapidus",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Sony Group Shares Surge After Expanding Share Buyback Plan",
            "description": "<div class=\"mdc-article-body\">\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  By Jason Chau </p>\n<pre class=\"mdc-article-pre\" data-v-370ea3ac=\"\"></pre>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Japanese conglomerate Sony Group's shares surged after the company again expanded its ongoing share buyback program. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Its stock was recently 6.5% higher around midday in Tokyo on Friday, on track for its largest single-day gain in almost five months. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  The gains followed Sony's announcement on Thursday that it would expand its share repurchase program amount to as much as 250 billion yen, or $1.6 billion, from 150 billion yen. This was the second time it has expanded its buyback program after initially approving 100 billion yen in November last year. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n   The company now plans to repurchase up to 90 million shares by May, representing more than 1.5% of its outstanding shares. This is a substantial increase from the 55 million shares originally announced. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Sony said it had launched the share buyback in a bid to improve capital efficiency. It added that the plan was expanded to allow more flexibility in repurchases, after considering the current pace of buybacks and stock market trends. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  The share price move may also reflect a shift in investor flows, as stocks of other gaming companies have also risen. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  \"Sony's stock increase is likely part of a broader movement to take profits on semiconductor-related stocks following Nvidia's earnings and to repurchase gaming-related stocks that had been recently sold off heavily,\" said Morningstar equity research director Kazunori Ito. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Sony's shares, which outperformed other gaming stocks, gained even further in reaction to the share buyback expansion, he added. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  \"We are seeing rotation into laggards like...Sony that [had] been trading woefully with AI and semiconductor related names sucking in all the flows,\" with the shift expected to continue into March, said Andrew Jackson, head of Japan equity strategy at Ortus Advisors. </p>\n<pre class=\"mdc-article-pre\" data-v-370ea3ac=\"\"></pre>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Write to Jason Chau at jason.chau@wsj.com </p>\n<pre class=\"mdc-article-pre\" data-v-370ea3ac=\"\"></pre>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  (END) Dow Jones Newswires</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  February 26, 2026 23:29 ET (04:29 GMT)</p>\n\nCopyright (c) 2026 Dow Jones &amp; Company, Inc.</div>",
            "pub_date": "2026-02-27 12:36:35",
            "link": "https://www.morningstar.com/news/dow-jones/2026022619860/sony-group-shares-surge-after-expanding-share-buyback-plan",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        }
    ]
}