{
    "data": [
        {
            "title": "Best Creatine for Women (2026): iHerb's California Gold Nutrition Creatine Recognized for Clean Formula and Performance Support by Consumer365",
            "description": "<div class=\"mdc-article-body\">\n            \n              \n              Best Creatine for Women (2026): iHerb's California Gold Nutrition Creatine Recognized for Clean Formula and Performance Support by Consumer365\n              \n            \n            \n              <span>\n<h2 class=\"mdc-article-heading mdc-heading__mdc mdc-heading--level-5__mdc\" data-v-618d53ae=\"\">Best Creatine for Women (2026): iHerb's California Gold Nutrition Creatine Recognized for Clean Formula and Performance Support by Consumer365</h2>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">PR Newswire</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">NEW YORK, Feb. 28, 2026</p>\n</span>\n<span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span data-v-602de5d2=\"\">NEW YORK</span>, <span data-v-602de5d2=\"\">Feb. 28, 2026</span> /PRNewswire/ -- Consumer365 has recognized <strong class=\"mdc-article-strong\" data-v-479a2324=\"\"><span class=\"mdc-article-underline\" data-v-1f1bdc8a=\"\"><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4629123-1&amp;h=1434528285&amp;u=https%3A%2F%2Fconsumer365.org%2Fiherb-creatine&amp;a=California+Gold+Nutrition+Creatine\" tabindex=\"0\">California Gold Nutrition Creatine</a></span></strong> in its 2026 review of the best creatine for women, citing its clean formulation, transparent manufacturing standards, and alignment with current research on performance and women's health.</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Best Creatine for Women</strong></p><ul class=\"mdc-article-list mdc-article-list--unordered\" data-v-7b473e83=\"\"><li data-v-7b473e83=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\"><span class=\"mdc-article-underline\" data-v-1f1bdc8a=\"\"><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4629123-1&amp;h=1434528285&amp;u=https%3A%2F%2Fconsumer365.org%2Fiherb-creatine&amp;a=California+Gold+Nutrition+Creatine\" tabindex=\"0\">California Gold Nutrition Creatine</a></span></strong> - delivers a single ingredient, micronized creatine monohydrate formula produced in GMP compliant facilities to support strength, recovery, and cellular energy production.</li></ul><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">The recognition reflects growing consumer interest in evidence based supplements that support strength, recovery, and cognitive function without unnecessary additives. Creatine monohydrate remains one of the most studied sports nutrition ingredients, with expanding research focused on women across different life stages.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Clean Formulation Backed by Research</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Creatine plays a central role in cellular energy production. Once ingested, it supports the regeneration of adenosine triphosphate, or ATP, the primary energy source used during short bursts of high intensity activity. This process supports strength output, muscular endurance, and post exercise recovery.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">For women, research suggests creatine may also support lean muscle maintenance, bone health, and cognitive performance. These benefits are particularly relevant during hormonal transitions such as menopause, when muscle mass and bone density may decline more rapidly.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\"><span class=\"mdc-article-underline\" data-v-1f1bdc8a=\"\"><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4629123-1&amp;h=3875187319&amp;u=https%3A%2F%2Fconsumer365.org%2Fiherb-creatine&amp;a=California+Gold+Nutrition+Sport+Pure+Creatine+Monohydrate\" tabindex=\"0\">California Gold Nutrition Sport Pure Creatine Monohydrate</a></span></strong> delivers 5 grams of micronized creatine monohydrate per serving. The formula contains no added sugars, artificial colors, or unnecessary fillers. The unflavored powder format allows flexible use in water, smoothies, or protein shakes without altering taste profiles.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Micronization improves mixability and reduces grittiness, supporting consistent daily use. Studies generally support a daily intake of 3 to 5 grams for most adults, placing the product within evidence based dosing guidelines.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Multiple Formats Designed for Everyday Use</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">While the unflavored powder remains the core format, California Gold Nutrition's creatine line extends beyond a single product configuration. The broader range includes powder options in various container sizes, capsule formats for those who prefer pre-measured servings, and single serving packets designed for portability.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Advanced blends that combine creatine with amino acids and other functional ingredients are also available within the lineup.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Offering multiple delivery formats reflects an understanding that supplement users prioritize different features. Some focus on cost efficiency and flexible dosing. Others value convenience, travel readiness, or simplified routines. Maintaining creatine monohydrate as the foundational ingredient across formats supports consistency in performance expectations.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Manufacturing Standards and Controlled Distribution</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Quality assurance remains a central issue in the supplement industry. Inconsistent sourcing and unauthorized reselling have raised concerns about product integrity across open marketplace platforms.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">California Gold Nutrition states that its products are manufactured in facilities that follow Good Manufacturing Practice guidelines. GMP standards are intended to support batch level consistency, ingredient traceability, and accurate labeling. These practices form part of a broader quality control framework designed to reduce contamination and formulation errors.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Distribution through iHerb adds another layer of oversight. Unlike open third party marketplace systems, iHerb operates a centralized fulfillment model. Products are stored in climate controlled warehouses located in the United States and Asia. Facilities operate under GMP and ISO aligned standards.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Product listings include detailed ingredient disclosures and visible expiration or best by dates prior to purchase. This structure is intended to reduce risks related to improper storage or unauthorized reselling, factors that can affect supplement stability and potency.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">For supplements designed for daily use, controlled storage conditions and transparent labeling can play a meaningful role in consumer confidence.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Women's Health Context and Performance Support</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Creatine has historically been marketed toward male athletes. However, research has expanded significantly in recent years to evaluate its impact on women's physiology.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Studies suggest that women typically have lower natural creatine stores compared to men. Supplementation may help support improved strength output, lean muscle development, and exercise capacity. These effects do not equate to unwanted bulk. Instead, creatine supports muscular function and tone by enhancing cellular energy availability.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Emerging data also indicates potential cognitive benefits, particularly in areas such as memory and mental fatigue. Because the brain relies on ATP for energy, creatine's mechanism of action extends beyond skeletal muscle.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">In addition, resistance training combined with creatine supplementation has been studied in relation to bone density support and muscle preservation in postmenopausal populations. While supplementation does not replace exercise, it may complement structured strength programs.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Retail Transparency and Access Through iHerb</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\"><span class=\"mdc-article-underline\" data-v-1f1bdc8a=\"\"><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4629123-1&amp;h=2380382486&amp;u=https%3A%2F%2Fconsumer365.org%2Fiherb-creatine&amp;a=Availability+through+iHerb\" tabindex=\"0\">Availability through iHerb</a></span></strong> contributes to the product's accessibility and distribution reliability. The platform ships to more than 185 countries and maintains centralized inventory control rather than relying on independent third party sellers.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Customer reviews are tied to verified purchases, supporting transparency in user feedback. Climate controlled fulfillment centers are designed to maintain product stability during storage and distribution.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">The combination of GMP aligned manufacturing and centralized retail distribution addresses two common areas of concern in the supplement category: production integrity and post production handling.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Consumer365 has recognized California Gold Nutrition Creatine for its clean formula, research aligned dosing, and performance support in its 2026 evaluation of the best creatine for women. The product's micronized creatine monohydrate formulation, multiple delivery formats, and GMP aligned manufacturing standards were central to the recognition.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Distribution through iHerb further supports controlled storage, transparent labeling, and global accessibility. As consumer awareness of supplement quality continues to evolve, factors such as ingredient simplicity, manufacturing transparency, and centralized fulfillment models are gaining importance.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">The full review is available at <strong class=\"mdc-article-strong\" data-v-479a2324=\"\"><span class=\"mdc-article-underline\" data-v-1f1bdc8a=\"\"><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4629123-1&amp;h=2329755871&amp;u=https%3A%2F%2Fconsumer365.org%2Fbest-creatine-for-women%2F&amp;a=Consumer365\" tabindex=\"0\">Consumer365</a></span></strong>.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">About iHerb</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">iHerb, LLC, is one of the world's leading online retailers dedicated to offering an unbeatable selection of vitamins, minerals, supplements and other health and wellness products, including sports nutrition, beauty, bath and personal care, grocery, baby, and pet care from over 1,800 reputable brands. Supported by a global workforce of 3,000 team members, iHerb serves over 14 million global customers across 180 countries and 36 languages. iHerb's sophisticated global logistics network is anchored by nine climate-controlled logistics centers located in the U.S., Asia, and Saudi Arabia, providing customers with a seamless and reliable shopping experience. Founded in 1996 and based in Irvine, California, iHerb is on a mission to make health and wellness accessible to all. For more information, please visit<strong class=\"mdc-article-strong\" data-v-479a2324=\"\"> <span class=\"mdc-article-underline\" data-v-1f1bdc8a=\"\"><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4629123-1&amp;h=2109362200&amp;u=https%3A%2F%2Fconsumer365.org%2Fiherb-creatine&amp;a=www.iherb.com\" tabindex=\"0\">www.iherb.com</a></span></strong>.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">About Consumer365.org:</strong> Consumer365 provides consumer news and industry insights. As an affiliate, Consumer365 may earn commissions from sales generated using links provided.</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img mdc-article-image__img--12-width\" data-v-f0ef0696=\"\" style=\"width:12px;\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://edge.prnewswire.com/c/img/favicon.png?sn=PH97662&amp;sd=2026-02-28\"/></picture></span> View original content:<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://www.prnewswire.com/news-releases/best-creatine-for-women-2026-iherbs-california-gold-nutrition-creatine-recognized-for-clean-formula-and-performance-support-by-consumer365-302699569.html\" tabindex=\"0\">https://www.prnewswire.com/news-releases/best-creatine-for-women-2026-iherbs-california-gold-nutrition-creatine-recognized-for-clean-formula-and-performance-support-by-consumer365-302699569.html</a></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">SOURCE Consumer365.org</p></span>\n<span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img\" data-v-f0ef0696=\"\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://rt.prnewswire.com/rt.gif?NewsItemId=PH97662&amp;Transmission_Id=202602280530PR_NEWS_USPR_____PH97662&amp;DateId=20260228\"/></picture></span>\n</div>",
            "pub_date": "2026-02-28 18:45:47",
            "link": "https://www.morningstar.com/news/pr-newswire/20260228ph97662/best-creatine-for-women-2026-iherbs-california-gold-nutrition-creatine-recognized-for-clean-formula-and-performance-support-by-consumer365",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Trump says 'massive' strike against Iran underway - bitcoin tumble points to rocky start for markets next week",
            "description": "<div class=\"mdc-article-body\">\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  By Barbara Kollmeyer </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Strategist says expect equities to take a hit and crude and gold to gain </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     A plume of smoke rises following a reported explosion in Tehran on Feb. 28, 2026. Two loud blasts were heard in Tehran on Feb. 28 morning by AFP journalists, and two plumes of thick smoke were seen over the center and east of the Iranian capital. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Investors roiled for weeks by AI disruption and then hotter-than-expected inflation on Friday faced a fresh level of stress after the U.S. and Israel launched attacks on Iran to destabilize its nuclear ambitions. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     \"A short time ago, the United States military began major combat operations in Iran. Our objective is to defend the American people by eliminating imminent threats from the Iranian regime, a vicious group of very hard, terrible people,\" President Donald Trump said in a video message published on his Truth Social account early Saturday. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Cryptocurrencies, which trade 24/7, offered the first glimpse of how investors might react, as they wait for Asian markets to open on Sunday. Bitcoin (BTCUSD) slid 3.1% to $63,561, a level not seen since early February. Oil (CL.1) (BRN00) prices jumped on Friday as traders began to sense strikes could be nearing, with Trump suggesting to reporters that the window for diplomacy with Iran could be closing. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     \"At this stage there are many unknowns, and the situation is incredibly fast moving. The damage done by U.S.-Israeli strikes, and the targets of those strikes, is not yet clear; nor is the impact of any Iranian retaliatory action,\" said Michael Brown, senior research strategist at Pepperstone, in a note to clients. \"In addition, the precise scope of the action, nor mission aims, are obvious at this stage. Furthermore, it is not known whether any crude infrastructure has been targeted, or impacted, at the present time.\" </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Apart from surging oil prices on Friday, the S&amp;P 500 SPX and Nasdaq Composite COMP  and Dow industrials DJIA tumbled after a surprise spike in producer prices. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Brown said investors could see a \"relatively predictable\" reaction to the strikes on Iran, starting with a big leap in crude prices. Also likely to get bid are haven assets, such as gold (GC00), which jumped nearly 11% in February, finishing at $5,230.50 an ounce on Friday. That marked gold's biggest one-month percentage gain since January 2012, and its monthly gain of $516.60 was the biggest one-month net gain on record, according to Dow Jones Market Data. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Brown said the Japanese yen (USDJPY), Swiss franc (USDCHF) and U.S. Treasurys BX:TMUBMUSD10Y BX:TMUBMUSD30Ywould also likely be in the outperformer category. Investors have been increasingly pushing into U.S. government debt recently, a move strategists have attributed to fears over AI threats to employment and economic growth. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Read: The bond market has been doing something strange despite a hot inflation report </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     While equities will likely \"face headwinds,\" Brown said investors should remember that \"geopolitical events tend not to be a trigger for durable or longer-lasting market moves in any asset. Of course, there's a risk that this time could be different, however it is unlikely to be the case once participants have discounted the initial shock triggered by this weekend's events.\" </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Trump last week offered a deadline of 10 to 15 days to make a deal with Iran, which left this weekend as a possibility for a U.S. strike. Iran has been one of the world's biggest oil producers, controlling to several crucial \"chokepoints,\" such as the Strait of Hormuz. That waterway connects the Persian Gulf with the Gulf of Oman and the Arabian Sea. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     In his social-media post, Trump did not indicate how long the strikes would last. The Associated Press reported a daylight Saturday attack on Tehran, with initial blasts hitting near the offices of Supreme Leader Ayatollah Ali Khamenei. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     He said after the U.S. launched strikes on three Iranian nuclear sites last June, Iran was warned never to resume its pursuit of nuclear weapons and the U.S. \"sought repeatedly to make a deal.\" </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     \"They rejected every opportunity to renounce their nuclear ambitions and we can't take it anymore. Instead they attempted to rebuild their nuclear program and continue developing long-range missiles that can now threaten our very good friends and allies in Europe and could soon reach the American homeland,\" Trump said in his address. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     \"It has always been the policy of the United States, in particular, my administration, that this terrorist regime can never have a nuclear weapon,\" he said, recounting \"an unending campaign of bloodshed and mass murder\" against the U.S. over 47 years, as well as attacks on Israel. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     \"We're going to destroy their missiles and raze their missile industry to the ground. It will be totally, again, obliterated. We're going to annihilate their navy, we're going to ensure that the region's terrorist proxies can no longer destabilize the region or the world and attack our forces,\" he said. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Addressing the people of Iran - thousands of protesters were killed during protests at the start of the year - Trump also said the U.S. was giving them their \"only chance for generations\" to rise up against their government. He advised citizens in Iran to stay sheltered as \"bombs will be dropping everywhere,\" but after that they would have that opportunity. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     \"Now is the time to seize control of your destiny,\" he said. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Myra P. Saefong contributed. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     -Barbara Kollmeyer </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     This content was created by MarketWatch, which is operated by Dow Jones &amp; Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal. </p>\n<pre class=\"mdc-article-pre\" data-v-370ea3ac=\"\"></pre>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  (END) Dow Jones Newswires</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  02-28-26 0508ET</p>\n\nCopyright (c) 2026 Dow Jones &amp; Company, Inc.</div>",
            "pub_date": "2026-02-28 18:20:48",
            "link": "https://www.morningstar.com/news/marketwatch/20260228137/trump-says-massive-strike-against-iran-underway-bitcoin-tumble-points-to-rocky-start-for-markets-next-week",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Iran strikes will likely boost defense stocks - but here's what will keep the cash flowing long after the conflict ends",
            "description": "<div class=\"mdc-article-body\">\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  By Jurica Dujmovic </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     A massive backlog of maintenance and software contracts will ensure recurring revenue </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     A Lockheed Martin F-22 Raptor 4001 stealth fighter is silhouetted against the setting sun in this undated file photo. Saturday's strikes on Iran by the U.S. and Israel will likely shine an even bigger spotlight on defense stocks. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Wars end. Maintenance contracts do not. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Defense stocks have been treated as geopolitical barometer. When tensions rise and military conflict breaks out, shares climb. When headlines cool, the trade fades. It's a narrative built around procurement cycles and crisis-driven spending. The attack on Tehran on Saturday by Israel and the U.S. should repeat this pattern for defense stocks in coming days. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     But something more structural and long-term has been unfolding, something that looks far less like a one-off weapons sale and more like a long-term service contract. Parts of the defense industry are beginning to resemble subscription businesses, recurring revenue layered on top of a growing installed base. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     For investors focused on earnings durability rather than war headlines, that distinction matters. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Weapons systems have evolved from disposable purchases to multi-decade ecosystems nowadays. Once a country fields a fleet of fighter jets, missile defense batteries, or naval destroyers, it commits to years or even decades of operating and support costs. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     The Government Accountability Office has repeatedly noted that operating and support costs can account for roughly 70% of a major weapon system's total life-cycle cost, according to recent GAO report. Upkeep includes spare parts, depot maintenance, training, software updates, systems integration and availability guarantees. Since national defense cannot tolerate downtime, readiness spending tends to persist even when procurement ebbs. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     In practical terms, the contractor that builds the platform often remains embedded in its upkeep. Every additional aircraft delivered expands the pool of long-term maintenance, logistics and modernization revenue. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     That dynamic increasingly resembles aerospace aftermarket economy (and, in some respects, enterprise software) where installed bases drive recurring cash flow. Three companies that stand to benefit: Lockheed Martin (LMT); RTX (RTX) and Northrop Grumman (NOC). </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Lockheed Martin: The ecosystem model: Lockheed Martin provides the clearest example of this shift. The F-35 program represented 26% of consolidated net sales in 2024, according to the company's latest Form 10-K. The filing explicitly states that F-35 revenue includes development, production, and maintenance, underscoring how support and logistics are embedded in the program's economy. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Service sales increased in 2024, driven in part by higher volume on F-35 upkeep contracts, the company disclosed in that same annual report. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     By the end of 2025, Lockheed Martin reported a record $194 billion backlog and strong free cash flow generation in its full-year earnings release. That backlog provides multi-year revenue visibility that many industrial companies lack. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Support performance is not immune from scrutiny; a Pentagon watchdog has recently criticized aspects of F-35 maintenance and aircraft availability. Recurring revenue in defense is contractual and performance-based, not automatic. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Even so, the installed-base effect is unmistakable: every aircraft delivered expands a long-term revenue stream tied to readiness and modernization. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     RTX: Installed base, diversified: RTX offers a different version of installed-base economy. The company has recently reported strong sales growth and highlighted a backlog approaching $268 billion, according to its latest earnings results. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     On the defense side, missile systems and air defense platforms require ongoing upgrades and upkeep. Collins Aerospace operates within a vast installed base of aircraft systems that generate recurring parts and maintenance demand, the approach the company emphasizes in its investor materials. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Commercial aftermarket revenue behaves in many ways like an annuity tied to flight hours, while defense modernization cycles add a second layer of durability. The combination smooths earnings compared to pure production-driven models. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Northrop Grumman and the long arc of modernization: Northrop Grumman's portfolio is heavily weighted toward advanced systems - stealth aircraft, space assets, sensors and mission technologies. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Once fielded, those systems demand continuous upgrades and integration work as modern defense doctrine emphasizes ongoing modernization rather than static platforms. Sensors are refreshed. Software evolves. Networks expand. The company ended 2025 with backlog nearing $95.7 billion, according to its most recent annual report. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Northrop's strength in high-end systems integration positions it to benefit from that long modernization arc, although development-heavy programs can introduce project timing volatility. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     The software layer: Defense as ongoing service: The transformation is perhaps the most visible in defense's growing digital footprint. The U.S. Defense Department's Joint Warfighting Cloud Capability contract vehicle reflects a shift toward acquiring commercial cloud services across classification levels. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Software-native companies like Palantir Technologies (PLTR) operate directly in that layer, providing analytics and AI systems through multi-year government contracts. Recent analyst coverage has highlighted the company's expanding government engagements and recurring revenue profile. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     While valuation and volatility differ from traditional primes, the software layer most closely resembles true subscription economy within defense budgets. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     The market may be behind the curve </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Despite these structural shifts, defense contractors are often valued like cyclical industrial companies. The implicit assumption is that earnings are driven primarily by procurement wins and geopolitical events. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     If maintenance, modernization and software continue rising as a share of revenue, that assumption will grow increasingly incomplete. Recurring support contracts and installed-base monetization can dampen earnings swings and support steadier free cash flow. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     At the same time, intellectual property and data rights in maintenance contracts is a critical issue that the U.S. Government Accountability Office examined in its recent review of IP and sustainment planning. Control over technical data can shape who captures margin over the life of a program. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Markets tend to reward predictability. Businesses with durable cash flows often command stronger valuation multiples than those dependent on episodic demand. If defense contractors continue migrating toward service-heavy revenue mixes, the sector's risk profile may increasingly resemble infrastructure rather than crisis trade. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Defense stocks will continue to react to geopolitical headlines, but beneath those swings lies a structural evolution in how revenue is generated and sustained. The companies that control large, technologically complex installed bases -aircraft fleets, missile systems, naval platforms, secure networks - are not merely selling equipment. They are managing ecosystems that require continuous funding to remain operational. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     This shift reframes the opportunity. Defense may no longer be just a trade on conflict. Increasingly, it resembles a long-duration cash-flow business anchored in readiness, modernization and software-driven support. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     The market may still be pricing yesterday's model. Wars end. Maintenance contracts do not. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Read: Trump says 'massive' strike against Iran underway - bitcoin plunge offers a glimpse of how markets could react </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     -Jurica Dujmovic </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     This content was created by MarketWatch, which is operated by Dow Jones &amp; Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal. </p>\n<pre class=\"mdc-article-pre\" data-v-370ea3ac=\"\"></pre>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  (END) Dow Jones Newswires</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  02-28-26 0512ET</p>\n\nCopyright (c) 2026 Dow Jones &amp; Company, Inc.</div>",
            "pub_date": "2026-02-28 18:20:47",
            "link": "https://www.morningstar.com/news/marketwatch/20260228139/iran-strikes-will-likely-boost-defense-stocks-but-heres-what-will-keep-the-cash-flowing-long-after-the-conflict-ends",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Chongli Through a Milan Lens: China's Answer to Winter Olympic Legacy",
            "description": "<div class=\"mdc-article-body\">\n            \n              \n              Chongli Through a Milan Lens: China's Answer to Winter Olympic Legacy\n              \n            \n            \n              <span>\n<h2 class=\"mdc-article-heading mdc-heading__mdc mdc-heading--level-5__mdc\" data-v-618d53ae=\"\">Chongli Through a Milan Lens: China's Answer to Winter Olympic Legacy</h2>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">PR Newswire</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">SHIJIAZHUANG, China, Feb. 28, 2026</p>\n</span>\n<span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span data-v-602de5d2=\"\">SHIJIAZHUANG, China</span>, <span data-v-602de5d2=\"\">Feb. 28, 2026</span> /PRNewswire/ -- A News Report from Great Wall New Media: </p>\n<span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"></p>\n</span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">As the Milano–Cortina 2026 Winter Olympics drew to a close in the early hours of February 23, Beijing time, the Olympic flame was extinguished on the Apennine Peninsula, marking the end of the 25th Winter Games.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">For host cities, the Olympic spotlight marks not an endpoint, but the starting line of a new journey. Post-Games legacy utilization—among the most pressing challenges facing Olympic venues worldwide—now awaits Milan's response.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">At this moment, our gaze turns from Italy to China. Chongli, host district of the 2022 Winter Games, has transformed into a premier ice-and-snow destination, drawing over ten million visitors annually. What powers this post-Games success? And what lessons might it hold for the world?</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Viewing Chongli through a Milan lens: this is a dialogue across eras and continents—a meditation on how Winter Olympic legacy endures. Long after the flame is extinguished, the true answer is only beginning to reveal itself.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"> </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img mdc-article-image__img--12-width\" data-v-f0ef0696=\"\" style=\"width:12px;\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://edge.prnewswire.com/c/img/favicon.png?sn=CN97607&amp;sd=2026-02-28\"/></picture></span> View original content to download multimedia:<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://www.prnewswire.com/news-releases/chongli-through-a-milan-lens-chinas-answer-to-winter-olympic-legacy-302700159.html\" tabindex=\"0\">https://www.prnewswire.com/news-releases/chongli-through-a-milan-lens-chinas-answer-to-winter-olympic-legacy-302700159.html</a></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">SOURCE Great Wall New Media</p></span>\n<span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img\" data-v-f0ef0696=\"\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://rt.prnewswire.com/rt.gif?NewsItemId=CN97607&amp;Transmission_Id=202602280453PR_NEWS_USPR_____CN97607&amp;DateId=20260228\"/></picture></span>\n</div>",
            "pub_date": "2026-02-28 18:06:28",
            "link": "https://www.morningstar.com/news/pr-newswire/20260228cn97607/chongli-through-a-milan-lens-chinas-answer-to-winter-olympic-legacy",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Xinhua Silk Road: Dehua unveils three visions in Geneva, promoting cultural exchange and industrial cooperation",
            "description": "<div class=\"mdc-article-body\">\n            \n              \n              Xinhua Silk Road: Dehua unveils three visions in Geneva, promoting cultural exchange and industrial cooperation\n              \n            \n            \n              <span>\n<h2 class=\"mdc-article-heading mdc-heading__mdc mdc-heading--level-5__mdc\" data-v-618d53ae=\"\">Xinhua Silk Road: Dehua unveils three visions in Geneva, promoting cultural exchange and industrial cooperation</h2>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">PR Newswire</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">BEIJING, Feb. 28, 2026</p>\n</span>\n<span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span data-v-602de5d2=\"\">BEIJING</span>, <span data-v-602de5d2=\"\">Feb. 28, 2026</span> /PRNewswire/ -- More than 30 fine Dehua white porcelain pieces debuted at the Palais des Nations in Geneva on Feb. 24, highlighting the contemporary vitality of traditional Chinese craftsmanship.</p>\n<span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://mma.prnewswire.com/media/2922750/ece16db5420943edace0923ccea8b3ea.html\" tabindex=\"0\">\n<span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img\" data-v-f0ef0696=\"\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://mma.prnewswire.com/media/2922750/ece16db5420943edace0923ccea8b3ea.jpg\"/></picture></span>\n</a>\n</p>\n</span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">The exhibits blending traditional aesthetics with contemporary design drew UN officials, diplomats in Geneva and representatives from China and Switzerland, showcasing the unique charm of Chinese ceramic culture.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">During a symposium on global governance and high-quality enterprise development, Dehua County in southeast China's Fujian Province held a promotion event for \"Blanc de Chine • Porcelain from Dehua\", marking its efforts to align cultural heritage with global development and advance high-quality industrial growth.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Meanwhile, a promotion center for \"Blanc de Chine • Porcelain from Dehua\" was also inaugurated. Fang Junqin, Party Chief of Dehua County, said the launch of the center marks a key step for Dehua ceramics to further expand into the European market.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">With a ceramic industry cluster exceeding 76 billion yuan and products exported to more than 190 countries and regions, Dehua has grown into a key production and innovation hub. The county has established a full industrial chain spanning design, manufacturing and marketing, supported by advanced technologies such as AI-assisted design and 3D printing.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Dehua has also strengthened global brand building and intellectual property protection, with its experience recognized by the World Intellectual Property Organization as a model case in copyright protection.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">At the promotion event, Fang outlined three visions for international cooperation: building a global creative workshop for designers, fostering long-term exchanges with museums and cultural institutions, and expanding mutually beneficial trade partnerships.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">As Dehua advances toward the goal of building a 100-billion-yuan industrial cluster, it will continue to take culture as its soul, industry as its foundation and cooperation as its bridge, making the gentle hue of \"Blanc de Chine\" a bond connecting the world and bringing its exquisite ceramics to more international consumers, according to Fang.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Original link: <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://en.imsilkroad.com/p/349646.html\" tabindex=\"0\">https://en.imsilkroad.com/p/349646.html</a></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"> </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img mdc-article-image__img--12-width\" data-v-f0ef0696=\"\" style=\"width:12px;\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://edge.prnewswire.com/c/img/favicon.png?sn=CN98448&amp;sd=2026-02-28\"/></picture></span> View original content to download multimedia:<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://www.prnewswire.com/news-releases/xinhua-silk-road-dehua-unveils-three-visions-in-geneva-promoting-cultural-exchange-and-industrial-cooperation-302700157.html\" tabindex=\"0\">https://www.prnewswire.com/news-releases/xinhua-silk-road-dehua-unveils-three-visions-in-geneva-promoting-cultural-exchange-and-industrial-cooperation-302700157.html</a></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">SOURCE Xinhua Silk Road</p></span>\n</div>",
            "pub_date": "2026-02-28 17:26:29",
            "link": "https://www.morningstar.com/news/pr-newswire/20260228cn98448/xinhua-silk-road-dehua-unveils-three-visions-in-geneva-promoting-cultural-exchange-and-industrial-cooperation",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Trump says 'massive' strike against Iran underway - bitcoin plunge offers a glimpse of how markets could react",
            "description": "<div class=\"mdc-article-body\">\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  By Barbara Kollmeyer </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     'We're going to destroy their missiles,' says Trump </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     A plume of smoke rises following a reported explosion in Tehran on Feb. 28, 2026. Two loud blasts were heard in Tehran on Feb. 28 morning by AFP journalists, and two plumes of thick smoke were seen over the center and east of the Iranian capital. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Investors roiled for weeks by AI disruption and then hotter-than-expected inflation on Friday faced a fresh level of stress after the U.S. and Israel launched attacks on Iran to destabilize its nuclear ambitions. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     \"A short time ago, the United States military began major combat operations in Iran. Our objective is to defend the American people by eliminating imminent threats from the Iranian regime, a vicious group of very hard, terrible people,\" President Donald Trump said in a video message published on his Truth Social account early Saturday. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Cryptocurrencies, which trade 24/7, offered the first glimpse of how investors might react, until Asian markets open on Sunday. Bitcoin (BTCUSD) slid 3.1% to $63,561, a level not seen since early February. Oil (CL.1) (BRN00) prices jumped on Friday as traders began to sense strikes could be nearing, with Trump suggesting to reporters that the window for diplomacy with Iran could be closing. The S&amp;P 500 SPX and Nasdaq Composite COMP  and Dow industrials DJIA tumbled on Friday after a surprise spike in producer prices. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Trump last week offered a deadline of 10 to 15 days to make a deal with Iran, which left this weekend as a possibility for a U.S. strike. Iran has been one of the world's biggest oil producers, controlling to several crucial \"chokepoints,\" such as the Strait of Hormuz. That waterway connects the Persian Gulf with the Gulf of Oman and the Arabian Sea. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     In his social-media post, Trump did not indicate how long the strikes would last. The Associated Press reported a daylight Saturday attack on Tehran, with initial blasts hitting near the offices of Supreme Leader Ayatollah Ali Khamenei. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Trump said in his post that after the U.S. launched strikes on three Iranian nuclear sites last June, Iran was warned never to resume its pursuit of nuclear weapons and the U.S. \"sought repeatedly to make a deal.\" </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     \"They rejected every opportunity to renounce their nuclear ambitions and we can't take it anymore. Instead they attempted to rebuild their nuclear program and continue developing long-range missiles that can now threaten our very good friends and allies in Europe and could soon reach the American homeland,\" Trump said in his address. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     \"It has always been the policy of the United States, in particular, my administration, that this terrorist regime can never have a nuclear weapon,\" he said, recounting \"an unending campaign of bloodshed and mass murder\" against the U.S. over 47 years, as well as attacks on Israel. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     \"We're going to destroy their missiles and raze their missile industry to the ground. It will be totally, again, obliterated. We're going to annihilate their navy, we're going to ensure that the region's terrorist proxies can no longer destabilize the region or the world and attack our forces,\" he said. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Addressing the people of Iran - thousands of protesters were killed during protests at the start of the year - Trump also said the U.S. was giving them their \"only chance for generations\" to rise up against their government. He advised citizens in Iran to stay sheltered as \"bombs will be dropping everywhere,\" but after that they would have that opportunity. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     \"Now is the time to seize control of your destiny,\" he said. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Myra P. Saefong contributed. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     -Barbara Kollmeyer </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     This content was created by MarketWatch, which is operated by Dow Jones &amp; Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal. </p>\n<pre class=\"mdc-article-pre\" data-v-370ea3ac=\"\"></pre>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  (END) Dow Jones Newswires</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  02-28-26 0357ET</p>\n\nCopyright (c) 2026 Dow Jones &amp; Company, Inc.</div>",
            "pub_date": "2026-02-28 17:20:50",
            "link": "https://www.morningstar.com/news/marketwatch/20260228135/trump-says-massive-strike-against-iran-underway-bitcoin-plunge-offers-a-glimpse-of-how-markets-could-react",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Storm Exploration Issues Shares to Eabametoong First Nation",
            "description": "<div class=\"mdc-article-body\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">VANCOUVER, BC / <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://www.accessnewswire.com/\" tabindex=\"0\">ACCESS Newswire</a> / February 28, 2026 / </strong><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Storm Exploration Inc.</strong> (TSXV:STRM) (\"<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Storm</strong>\" or the \"<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Company</strong>\") today announced that it has issued 318,629 common shares to the Eabametoong First Nation (\"<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">EFN</strong>\"), pursuant to the Exploration Agreement dated May 16, 2024, and further amended on April 29, 2025 (the \"<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Exploration Agreement</strong>\") between the Company and the EFN.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Storm issued the shares to the EFN at a 30-day volume-weighted average price of $0.235 per share, having an aggregate value of $75,000. This completes complete the initial and first anniversary share payments outlined in the Exploration Agreement.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">The Company also announced that it has granted 870,000 stock options to certain directors, officers and consultants of the Company. Each stock option is exercisable at $0.25 per common share and expires on February 27, 2031.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">About Storm Exploration Inc.</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Storm Exploration is a Canadian mineral exploration company focused on the discovery and development of economic precious and base metal deposits on three district-scale projects in northwest Ontario: Keezhik, Attwood and Gold Standard.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">For further information, please contact:</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Storm Exploration Inc. <br data-v-602de5d2=\"\"/>T: +1 (604) 506-2804<br data-v-602de5d2=\"\"/>E: <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"mailto:bcounts@stormex.ca\" tabindex=\"0\">bcounts@stormex.ca</a></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) has reviewed or accepts responsibility for the adequacy or accuracy of this release.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">SOURCE: </strong>Storm Exploration Inc.</p><br/><br/>View the original <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://www.accessnewswire.com/newsroom/en/metals-and-mining/storm-exploration-issues-shares-to-eabametoong-first-nation-1142514\" tabindex=\"0\">press release</a> on ACCESS Newswire<br/><br/>\n<span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img mdc-article-image__img--0-width\" data-v-f0ef0696=\"\" style=\"width:0;\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://app.accessnewswire.com/img.ashx?id=1142514\"/></picture></span></div>",
            "pub_date": "2026-02-28 17:20:49",
            "link": "https://www.morningstar.com/news/accesswire/1142514msn/storm-exploration-issues-shares-to-eabametoong-first-nation",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Foreign Experts: China's Innovation Ecosystem to Benefit the World",
            "description": "<div class=\"mdc-article-body\">\n            \n              \n              Foreign Experts: China's Innovation Ecosystem to Benefit the World\n              \n            \n            \n              <span>\n<h2 class=\"mdc-article-heading mdc-heading__mdc mdc-heading--level-5__mdc\" data-v-618d53ae=\"\">Foreign Experts: China's Innovation Ecosystem to Benefit the World</h2>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">PR Newswire</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">BEIJING, Feb. 28, 2026</p>\n</span>\n<span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span data-v-602de5d2=\"\">BEIJING</span>, <span data-v-602de5d2=\"\">Feb. 28, 2026</span> /PRNewswire/ -- <span data-v-602de5d2=\"\">A report from Science and Technology Daily: </span></p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">As China's 2026 Two Sessions approach, the global community is looking not just for economic targets, but for insights into China's unique development path, a path defined by people-centered development, open scientific collaboration, sustainable green transitions, and the harmonious coexistence of deep cultural roots with frontier technology.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\"How can a civilization honor Liangzhu while racing ahead in quantum computing, microchips and AI?\" asked Shahbaz Khan, director and UNESCO representative to the Regional Office for East Asia.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">For Khan, who has been visiting China since 1999, the answer lies in a unique coexistence that defines the nation's modernization. Recalling a time when \"China was still catching up with the rest of the world,\" Khan said he is struck by the \"consistency of effort\" seen today. \"People work hard and they also cherish family, tradition and festivals,\" he said. \"There's a balance between ambition and humanity.\"</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">For Khan, China is a living model where \"science serves society, innovation lifts communities, and progress is measured not just in patents or GDP, but in human dignity.\" \"That's the beauty of China,\" he remarked.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Foreign experts framed their expectations for the upcoming Two Sessions within this broader context of balanced and human-centric development. They anticipate that the policies discussed will not only drive technological breakthroughs but also institutionalize the open ecosystems and sustainable practices that allow this unique \"Chinese model\" to flourish and contribute globally.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Francesco Faiola, an Italian researcher at the Research Center for Eco-Environmental Sciences of the Chinese Academy of Sciences, has spent 12 years in China, witnessing its transformation from \"a phase of rapid catch-up to one characterized by systematic innovation.\"</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">His expectations are built upon this solid foundation. He said recent policies focus on regional integration initiatives like the coordinated development of the \"Beijing-Tianjin-Hebei\" region and \"Yangtze River Delta,\" signaling China's clear intention to build collaborative innovation ecosystems rather than isolated \"peaks\" of scientific excellence.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">He welcomed the ongoing establishment of an open governance framework grounded in clear rules. \"Clear rules inspire far greater confidence for long-term collaboration than ambiguous discretion,\" Faiola said.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Regarding the 15th Five-Year Plan (2026-2030), Faiola observed that China's commitment to international collaboration is evolving from \"one-way introduction\" to a deeper model of \"two-way exchange\" and \"joint ecosystem building.\" Chinese scientists are already taking a leading role in global discussions on ethical standards for stem cell research, marking a shift from \"participant\" to \"contributor.\"</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Building on this positive momentum, Faiola anticipates continued empowerment for major international scientific programs jointly led by Chinese and foreign teams. Citing global research on emerging pollutants as a prime example, he said such collaborations will significantly enhance China's growing influence in shaping the global scientific agenda.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Confident in the ecosystem's current vitality, Faiola highlighted its proven ability to provide a complete pathway \"from curiosity-driven research to real-world impact,\" empowering global talent to translate discoveries into solutions for shared human challenges.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Extending this vision of systemic strength to the critical field of sustainability, Muhammad Salman Nasir, a 37-year-old Pakistani scholar and associate professor at Tianjin University, said China is already \"playing a pivotal role in advancing global carbon neutrality.\"</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Nasir highlighted China's key strength: its ability to \"integrate national policy with academic and industrial innovation, enabling rapid scaling of technologies like green hydrogen, solar fuels, and carbon capture.\" He described China's research system, marked by strategic funding, interdisciplinary collaboration, and effective pilot-to-industry pathways, as a valuable model for other nations.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Regarding the 15th Five-Year Plan, Nasir expressed confidence that proposals for building a new energy system and developing a circular economy will further reinforce these strengths, enabling China to continue leading global efforts in sustainable technological innovations and offering a replicable blueprint for the world's green transition.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">The perspectives of the three experts illustrate a comprehensive expectation that the Two Sessions will not only refine the mechanisms of scientific collaboration and green development but also continue to foster the unique harmony that makes China's path to modernization so distinct.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"> </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img mdc-article-image__img--12-width\" data-v-f0ef0696=\"\" style=\"width:12px;\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://edge.prnewswire.com/c/img/favicon.png?sn=CN97645&amp;sd=2026-02-28\"/></picture></span> View original content:<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://www.prnewswire.com/news-releases/foreign-experts-chinas-innovation-ecosystem-to-benefit-the-world-302700151.html\" tabindex=\"0\">https://www.prnewswire.com/news-releases/foreign-experts-chinas-innovation-ecosystem-to-benefit-the-world-302700151.html</a></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">SOURCE Science and Technology Daily</p></span>\n</div>",
            "pub_date": "2026-02-28 16:15:59",
            "link": "https://www.morningstar.com/news/pr-newswire/20260228cn97645/foreign-experts-chinas-innovation-ecosystem-to-benefit-the-world",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "MWC Barcelona 2026: YOFC to Unveil Hollow-Core Fibre (HCF) Solution, Advancing Optical Connectivity in the Era of AI",
            "description": "<div class=\"mdc-article-body\">\n            \n              \n              MWC Barcelona 2026: YOFC to Unveil Hollow-Core Fibre (HCF) Solution, Advancing Optical Connectivity in the Era of AI\n              \n            \n            \n              <span>\n<h2 class=\"mdc-article-heading mdc-heading__mdc mdc-heading--level-5__mdc\" data-v-618d53ae=\"\">MWC Barcelona 2026: YOFC to Unveil Hollow-Core Fibre (HCF) Solution, Advancing Optical Connectivity in the Era of AI</h2>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">PR Newswire</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">BARCELONA, Spain, Feb. 28, 2026</p>\n</span>\n<span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">AI x Fibre: the company will highlight next-generation ultra-low latency optical communication technology, strengthening global AI infrastructure.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span data-v-602de5d2=\"\">BARCELONA, Spain</span>, <span data-v-602de5d2=\"\">Feb. 28, 2026</span> /PRNewswire/ -- Yangtze Optical Fibre and Cable (YOFC) will showcase its latest innovative optical connectivity solutions for the AI era at MWC Barcelona 2026, taking place from March 2 to 5. Under the theme \"<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">AI x Fibre – Leading an Intelligent Future</strong>,\" the company will also host a dedicated launch event for its <strong class=\"mdc-article-strong\" data-v-479a2324=\"\">hollow-core fibre (HCF) </strong>solutions on March 4 at one of the world's largest and most influential connectivity events.</p>\n<span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"> </p>\n</span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">As AI is rapidly reshaping global industries and societal operations, high-speed, low-latency, and highly reliable optical connectivity is becoming essential infrastructure for an intelligent world. As a key transmission technology supporting next-generation AI computing networks, HCF will take centre stage of YOFC's exhibition at booth 5A30.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\"Artificial intelligence is profoundly reshaping the global industrial landscape, placing unprecedented demands on ultra‑high‑speed, ultra‑low‑latency optical connectivity. As a premier global platform for mobile communications and digital technology, MWC provides a vital window to showcase cutting‑edge innovations and deepen international collaboration,\" remarked Zhuang Dan, Executive Director and President of YOFC.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\"We believe that advanced optical connectivity not only drives the efficient flow of computing power and data but also contributes to the development of the digital society, connecting us to a more inclusive and sustainable future. YOFC looks forward to working with global industry partners to co‑create a smarter, greener, and more efficient future of optical connectivity.\"</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Centring on \"AI X Fibre,\" YOFC's exhibition at MWC Barcelona 2026 will especially spotlight five key technological highlights, demonstrating how optical fibre technology serves as the core backbone of global AI computing networks:</p><ul class=\"mdc-article-list mdc-article-list--unordered\" data-v-7b473e83=\"\"><li data-v-7b473e83=\"\">AI computing hub: Ultra-high-speed optical fibre interconnection solutions for AI data centres;</li><li data-v-7b473e83=\"\">Connecting global AI networks: Supporting backbone network upgrades and cross-border data transmission;</li><li data-v-7b473e83=\"\">Empowering AI applications: Covering high-bandwidth scenarios such as high-frequency financial trading, AI data centre interconnection, and quantum communication;</li><li data-v-7b473e83=\"\">All-optical connectivity for home and business: Driving all-optical upgrades in residential and enterprise settings.</li><li data-v-7b473e83=\"\">VIP showcase: Featuring cutting-edge achievements in optical communication technology.</li></ul><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">As a flagship innovation on display, YOFC's HCF represents the forefront of next-generation optical transmission technology. Offering significant advantages over traditional fibre including lower latency, higher transmission efficiency, and enhanced signal quality, it provides critical infrastructure for ultra-high-speed data transmission and AI computing networks. Further details will be unveiled at the launch event during MWC.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">As the world accelerates into the AI era, YOFC reinforced its commitment and unveiled the \"AI-2030\" strategy in 2025, positioning itself as a global leader in AI optical connectivity infrastructure. Built on its three core preform technologies—PCVD, VAD, and OVD—the company has developed a comprehensive \"Superior Fibre\" portfolio that includes G.654.E fibre, multi-core fibre, and hollow-core fibre (HFC), designed to meet the most demanding transmission needs.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">With over a decade of global expansion, YOFC now operates eight production facilities across six countries, serving more than 100 markets worldwide. Through active participation in international standard-setting and cross-industry collaboration, YOFC continues to drive digital and intelligent transformation on a global scale, making high-speed, reliable optical connectivity a driving force behind the advancement of digital society—supporting a smarter, more connected, and more inclusive digital future.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Global industry partners, customers and media are invited to join YOFC at <strong class=\"mdc-article-strong\" data-v-479a2324=\"\">booth 5A30</strong> at MWC Barcelona 2026 from March 2 to 5.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">The press conference for HCF launch will take place from <strong class=\"mdc-article-strong\" data-v-479a2324=\"\">10 a.m. to 12 p.m. </strong>on <strong class=\"mdc-article-strong\" data-v-479a2324=\"\">March 4</strong> at <strong class=\"mdc-article-strong\" data-v-479a2324=\"\">T6, Hall 8.0</strong>.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">For more information, please visit <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://en.yofc.com/\" tabindex=\"0\">https://en.yofc.com/</a></p>\n<span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://mma.prnewswire.com/media/2922014/20260227151721_437_39.html\" tabindex=\"0\">\n<span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img\" data-v-f0ef0696=\"\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://mma.prnewswire.com/media/2922014/20260227151721_437_39.jpg\"/></picture></span>\n</a>\n</p>\n</span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img mdc-article-image__img--12-width\" data-v-f0ef0696=\"\" style=\"width:12px;\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://edge.prnewswire.com/c/img/favicon.png?sn=CN97598&amp;sd=2026-02-28\"/></picture></span> View original content to download multimedia:<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://www.prnewswire.com/news-releases/mwc-barcelona-2026-yofc-to-unveil-hollow-core-fibre-hcf-solution-advancing-optical-connectivity-in-the-era-of-ai-302700133.html\" tabindex=\"0\">https://www.prnewswire.com/news-releases/mwc-barcelona-2026-yofc-to-unveil-hollow-core-fibre-hcf-solution-advancing-optical-connectivity-in-the-era-of-ai-302700133.html</a></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">SOURCE YOFC</p></span>\n</div>",
            "pub_date": "2026-02-28 13:26:25",
            "link": "https://www.morningstar.com/news/pr-newswire/20260228cn97598/mwc-barcelona-2026-yofc-to-unveil-hollow-core-fibre-hcf-solution-advancing-optical-connectivity-in-the-era-of-ai",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CGTN: How China's path of democracy safeguards people's rights and interests",
            "description": "<div class=\"mdc-article-body\">\n            \n              \n              CGTN: How China's path of democracy safeguards people's rights and interests\n              \n            \n            \n              <span>\n<h2 class=\"mdc-article-heading mdc-heading__mdc mdc-heading--level-5__mdc\" data-v-618d53ae=\"\">CGTN: How China's path of democracy safeguards people's rights and interests</h2>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">PR Newswire</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">BEIJING, Feb. 27, 2026</p>\n</span>\n<span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">Ahead of China's annual key political meetings – the Two Sessions, CGTN published an article elaborating how China's whole-process people's democracy works at the grassroots level and how it safeguards the rights and interests of the people. Through a comprehensive introduction of China's democratic practice, the article stresses that this approach fosters broad and continuous participation, ensuring that governance decisions reflect the collective will and evolving needs of society.</em></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span data-v-602de5d2=\"\">BEIJING</span>, <span data-v-602de5d2=\"\">Feb. 27, 2026</span> /PRNewswire/ -- A legislative outreach office in Shanghai's Changning District, established in 2015 in the Hongqiao Subdistrict by the Legislative Affairs Commission of the Standing Committee of the National People's Congress (NPC), has become a landmark in China's democratic progress.</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Residents can offer suggestions and feedback on legislative work close to home. Through this office, the opinions of local residents gathered by legislators were relayed to higher levels and taken into consideration during the legislation process.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">The Shanghai neighborhood has come to epitomize the country's whole-process people's democracy following a visit by Chinese President Xi Jinping in November 2019, when he coined the term for the first time.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">As of 2025, the Legislative Affairs Commission of the NPC Standing Committee had established 54 such outreach offices across the country, and there were more than 7,800 such offices established by provincial or municipal legislatures. These platforms have served as vital bridges between residents and lawmakers, ensuring that democratic participation is embedded in the legislative process.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">While Western democracies often equate democracy with elections, China's whole-process people's democracy ensures public participation throughout the entire process of governance, covering all aspects of the democratic process and all sectors of society. This approach fosters broad and continuous participation, ensuring that governance decisions reflect the collective will and evolving needs of society.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Extensive participation</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">China's whole-process people's democracy integrates democratic practices across all government levels and at every stage of policymaking – from election and consultation to decision-making, implementation and oversight.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">It is embodied in the Two Sessions – the annual meetings of China's top legislature, the NPC and the top political advisory body, the National Committee of the Chinese People's Political Consultative Conference (CPPCC). Thousands of NPC deputies and CPPCC National Committee members convene in Beijing to deliberate on and discuss major policies and governance matters, representing a broad cross-section of society.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Over the years, innovation and creativity in grassroots democracy across urban and rural areas nationwide have become more dynamic than ever, unleashing great vitality at the grassroots level. From \"courtyard meeting halls\" and \"bench meetings\" to offline \"roundtable meetings\" and online \"deliberation groups,\" these pragmatic democratic practices based on local characteristics have provided sustained momentum for the development of China's democracy.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">In 2025, various departments of the State Council handled a total of 8,754 suggestions from NPC deputies and 4,868 proposals from CPPCC National Committee members, accounting for 95.6 percent and 97.3 percent of the total number of suggestions and proposals, respectively, according to a press conference held by the State Council Information Office on Friday. In particular, these departments adopted more than 4,900 suggestions and proposals from deputies and members, and issued more than 2,200 related policies and measures.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Pooling wisdom for 15th Five-Year Plan</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">The drafting of China's 15th Five-Year Plan (2026–2030) for economic and social development provides another vivid example. Deliberations on the draft outline are among the most closely watched items on the agenda of this year's Two Sessions.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">On Friday, a key leadership meeting was held to discuss a draft outline of the 15th Five-Year Plan and a draft government work report to be submitted by the State Council to the upcoming annual session of the national legislature for review.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Formulating the 15th Five-Year Plan has been a process of practicing whole-process people's democracy. From May 20 to June 20 last year, China launched an online public consultation to gather opinions for its next five-year plan. The initiative drew over 3.11 million valid submissions, yielding more than 1,500 constructive suggestions across 27 topics.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">A summary of these findings was reviewed by Xi and submitted to the Party leadership, ensuring that citizens' voices were heard at the highest level. By September, a total of 2,112 suggestions had been collected from various regions, departments and sectors, resulting in 218 revisions to the document.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">This broad-based participation demonstrates that national development strategies are rooted in public will, gathering strong momentum for Chinese modernization.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\"This whole-process people's democracy China is carrying out aligns with the goal of putting the people at the center. It enables them to decide and feel that they are the protagonists of the historical process that is taking place in China and the beneficiaries of the transformations that are happening,\" said Argentine sociologist Marcelo Rodriguez, director of the Hector P. Agosti Center for Marxist Studies and Training.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">For more information, please click:<br data-v-370fea16=\"\"/></em><em class=\"mdc-article-emphasis\" data-v-370fea16=\"\"><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://news.cgtn.com/news/2026-02-27/How-China-s-path-of-democracy-safeguards-people-s-rights-and-interests-1L6w4JWN8yI/p.html\" tabindex=\"0\">https://news.cgtn.com/news/2026-02-27/How-China-s-path-of-democracy-safeguards-people-s-rights-and-interests-1L6w4JWN8yI/p.html</a></em></p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img mdc-article-image__img--12-width\" data-v-f0ef0696=\"\" style=\"width:12px;\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://edge.prnewswire.com/c/img/favicon.png?sn=CN98414&amp;sd=2026-02-27\"/></picture></span> View original content:<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://www.prnewswire.com/news-releases/cgtn-how-chinas-path-of-democracy-safeguards-peoples-rights-and-interests-302700125.html\" tabindex=\"0\">https://www.prnewswire.com/news-releases/cgtn-how-chinas-path-of-democracy-safeguards-peoples-rights-and-interests-302700125.html</a></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">SOURCE CGTN</p></span>\n</div>",
            "pub_date": "2026-02-28 12:25:52",
            "link": "https://www.morningstar.com/news/pr-newswire/20260227cn98414/cgtn-how-chinas-path-of-democracy-safeguards-peoples-rights-and-interests",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        }
    ]
}