{
    "data": [
        {
            "title": "KEYTRUDA® (pembrolizumab) Plus Paclitaxel With or Without Bevacizumab Significantly Improved Key Secondary Endpoint of Overall Survival (OS) Versus Paclitaxel With or Without Bevacizumab in Patients With Platinum-Resistant Recurrent Ovarian Cancer",
            "description": "<div class=\"mdc-article-body\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">KEYTRUDA<span data-v-479a2324=\"\">®</span> (pembrolizumab) Plus Paclitaxel With or Without Bevacizumab Significantly Improved Key Secondary Endpoint of Overall Survival (OS) Versus Paclitaxel With or Without Bevacizumab in Patients With Platinum-Resistant Recurrent Ovarian Cancer</strong>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">KEYTRUDA plus paclitaxel with or without bevacizumab is the first PD-1 inhibitor-based regimen to show a statistically significant improvement in OS regardless of PD-L1 status</strong>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Results from the final analysis of the Phase 3 KEYNOTE-B96 trial to be presented during a Best Oral Session at the European Society of Gynaecological Oncology 2026 Congress</strong>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Positive EU CHMP opinion granted for KEYTRUDA plus paclitaxel with or without bevacizumab in certain adults with PD-L1 (CPS ≥1) platinum-resistant ovarian carcinoma who have received one or two prior systemic treatment regimens</strong>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nMerck (NYSE: MRK), known as MSD outside of the United States and Canada, today announced results from the final analysis of the pivotal Phase 3 KEYNOTE-B96 trial, also known as ENGOT-ov65, showing that KEYTRUDA<span data-v-602de5d2=\"\">® </span>(pembrolizumab), Merck’s anti-PD-1 therapy, in combination with chemotherapy (paclitaxel) with or without bevacizumab significantly improved overall survival (OS), a key secondary endpoint, for patients with platinum-resistant recurrent ovarian cancer regardless of PD-L1 status versus paclitaxel with or without bevacizumab alone, the most active standard of care control arm for patients who are bevacizumab-eligible. These data will be presented for the first time today during a Best Oral Session at the European Society of Gynaecological Oncology (ESGO) 2026 Congress (abstract #526).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nAs <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.merck.com%2Fnews%2Fkeytruda-pembrolizumab-plus-chemotherapy-with-or-without-bevacizumab-reduced-risk-of-disease-progression-or-death-versus-chemotherapy-with-or-without-bevacizumab-in-certain-patients-with-plati%2F&amp;esheet=54435066&amp;newsitemid=20260227462624&amp;lan=en-US&amp;anchor=previously+reported&amp;index=1&amp;md5=d19adc0f1fb2f29d4a66f38582801ff1\" tabindex=\"0\">previously reported</a> at the European Society for Medical Oncology (ESMO) Congress 2025, KEYTRUDA plus paclitaxel with or without bevacizumab met its primary endpoint of progression-free survival (PFS) in the all comers population of patients with platinum-resistant recurrent ovarian cancer, as well as in patients whose tumors express PD-L1 (Combined Positive Score [CPS] ≥1). The KEYTRUDA regimen also met its key secondary endpoint of OS in patients with platinum-resistant recurrent ovarian cancer whose tumors express PD-L1 (CPS ≥1).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nAt the final analysis, after a median follow-up of 32.7 months (range, 26.1-44.1), KEYTRUDA plus paclitaxel with or without bevacizumab demonstrated a statistically significant and clinically meaningful improvement in OS in all comers, reducing the risk of death by 18% (HR=0.82 [95% CI, 0.69-0.97]; p=0.0115) compared to paclitaxel with or without bevacizumab alone. For patients who received the KEYTRUDA regimen, median OS was 17.7 months versus 14.0 months for patients receiving the placebo regimen. The observed OS is among the longest reported in any clinical trial for platinum-resistant recurrent ovarian cancer, showing a clinically meaningful benefit of this regimen relative to the most active standard of care control arm, weekly paclitaxel with bevacizumab in bevacizumab-eligible patients.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n“Patients with platinum-resistant ovarian cancer show reduced responses to traditional treatment regimens and may experience poor overall survival,” said Dr. Nicoletta Colombo, director of the Gynecologic Oncology Program at the European Institute of Oncology in Milan, Italy. “These results build on prior data from the KEYNOTE-B96 trial and further define the clinical impact of this pembrolizumab-based regimen in appropriate patients with platinum-resistant recurrent ovarian cancer.”\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nAdditionally, the European Medicines Agency’s Committee for Medicinal Products for Human Use (CHMP) adopted a positive opinion recommending approval of KEYTRUDA in combination with paclitaxel with or without bevacizumab for the treatment of platinum-resistant epithelial ovarian, fallopian tube or primary peritoneal carcinoma in adults whose tumors express PD-L1 (CPS ≥1), and who have received one or two prior systemic treatment regimens.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nIn February, KEYTRUDA plus paclitaxel with or without bevacizumab was <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.merck.com%2Fnews%2Fkeytruda-pembrolizumab-and-keytruda-qlex-pembrolizumab-and-berahyaluronidase-alfa-pmph-plus-paclitaxel-%25c2%25b1-bevacizumab-approved-for-certain-adults-with-pd-l1-cps-%25e2%2589%25a51%2F&amp;esheet=54435066&amp;newsitemid=20260227462624&amp;lan=en-US&amp;anchor=approved&amp;index=2&amp;md5=8928d6374d9fc9ad0a0325d817f44ce3\" tabindex=\"0\">approved</a> by the U.S. Food and Drug Administration (FDA) to treat adult patients with platinum-resistant epithelial ovarian, fallopian tube or primary peritoneal carcinoma whose tumors express PD-L1 (CPS ≥1) as determined by an FDA-authorized test, and who have received one or two prior systemic treatment regimens based on previous data from the KEYNOTE-B96 trial.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n“Results from the final analysis of KEYNOTE-B96, including overall survival data in the all comers population, demonstrate the continued clinical benefit of KEYTRUDA plus paclitaxel with or without bevacizumab for certain patients with platinum-resistant recurrent ovarian cancer,” said Dr. Gursel Aktan, vice president, global clinical development, Merck Research Laboratories. “Taken together, the recent FDA approval and CHMP positive opinion underscore our commitment to the ovarian cancer community and our ongoing focus on delivering therapies that can help patients with unmet needs across women’s cancers.”\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Study design and additional data from KEYNOTE-B96/ENGOT-ov65\n<br data-v-479a2324=\"\"/></strong>KEYNOTE-B96, also known as ENGOT-ov65, is a multicenter, randomized, double-blind placebo-controlled Phase 3 trial (ClinicalTrials.gov, <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.clinicaltrials.gov%2Fstudy%2FNCT05116189&amp;esheet=54435066&amp;newsitemid=20260227462624&amp;lan=en-US&amp;anchor=NCT05116189&amp;index=3&amp;md5=331bbb1862c743fa5cae552cf47a3be6\" tabindex=\"0\">NCT05116189</a>) sponsored by Merck and conducted in collaboration with the European Network for Gynecologic Oncology Trial (ENGOT) groups investigating KEYTRUDA, Merck’s anti-PD-1 therapy, in combination with chemotherapy (paclitaxel) with or without bevacizumab compared to placebo plus paclitaxel with or without bevacizumab for the treatment of platinum-resistant recurrent ovarian cancer. The primary endpoint is PFS, as assessed by investigator according to Response Evaluation Criteria in Solid Tumors version 1.1 (RECIST v1.1), and OS is a key secondary endpoint. The trial enrolled 643 patients with epithelial ovarian, fallopian tube or primary peritoneal carcinoma, regardless of PD-L1 tumor expression status, who received one or two prior lines of systemic therapy for ovarian carcinoma, including at least one line of platinum-based chemotherapy. Of the 643 enrolled patients, 72% of patients had tumors expressing PD-L1 (CPS ≥1). Patients were enrolled in KEYNOTE-B96 regardless of PD-L1 tumor expression status. Patients were randomized (1:1) to receive either KEYTRUDA plus paclitaxel with or without bevacizumab, or placebo plus paclitaxel with or without bevacizumab. KEYTRUDA (400 mg) or placebo were administered on Day 1 of each six-week treatment cycle and paclitaxel (80 mg/m<span data-v-602de5d2=\"\">2</span>) was administered on Days 1, 8 and 15 of each three-week treatment cycle. The option to use bevacizumab was by investigator choice prior to randomization. Bevacizumab (10 mg/kg) was administered on Day 1 of a two-week treatment cycle.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nAt the final analysis, in the all comers population, KEYTRUDA plus paclitaxel with or without bevacizumab reduced the risk of disease progression or death by 27% (HR=0.73 [95% CI, 0.62-0.87]) compared to paclitaxel with or without bevacizumab alone. In patients with platinum-resistant recurrent ovarian cancer whose tumors express PD-L1 (CPS ≥1), the KEYTRUDA regimen reduced the risk of disease progression or death by 24% (HR=0.76 [95% CI, 0.62-0.93]) versus paclitaxel with or without bevacizumab alone. The KEYTRUDA regimen also continued to demonstrate a clinically meaningful improvement in OS, a key secondary endpoint of the study, in patients with platinum-resistant recurrent ovarian cancer whose tumors express PD-L1 (CPS ≥1), reducing the risk of death by 24% (HR=0.76 [95% CI, 0.62-0.93]) compared to paclitaxel with or without bevacizumab.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nThe safety profile of KEYTRUDA in this trial was consistent with that observed in previously reported studies; no new safety concerns were identified. Grade ≥3 treatment-related adverse events (TRAEs) occurred in 67.8% of patients receiving the KEYTRUDA regimen (n=320) versus 55.3% of patients receiving the placebo regimen (n=318). TRAEs led to death in 1.3% of patients receiving the KEYTRUDA regimen and 1.6% of patients receiving the placebo regimen.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nImmune-mediated adverse events (AEs) and infusion reactions of any grade occurred in 39.4% of patients receiving the KEYTRUDA regimen and 18.9% of patients receiving the placebo regimen. The most common of these events (occurring in ≥10% of patients) was hypothyroidism (18.1%) in patients receiving the KEYTRUDA regimen. Immune-mediated AEs led to death in 0.6% of patients in the KEYTRUDA arm and in no patients in the placebo arm.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">About platinum-resistant ovarian cancer\n<br data-v-479a2324=\"\"/></strong>Ovarian cancer often begins in the fallopian tubes or the ovaries. As of 2022, it is the eighth most commonly diagnosed cancer and the eighth leading cause of cancer death among women worldwide. Globally, there were more than 324,000 patients diagnosed with ovarian cancer and almost 207,000 deaths from the disease in 2022. In many regions, its incidence has been increasing, with estimates projecting a 42% increase in new cases worldwide by 2040. Over 80% of patients diagnosed with ovarian cancer will experience disease progression following standard treatment with platinum-based chemotherapy regimens. Of these patients, approximately 25% will experience disease progression within six months of completing first-line platinum-based chemotherapy – defined as primary platinum-resistant ovarian cancer. Prognosis is particularly poor for these patients and approved treatment options are limited.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">About Merck’s research in women’s cancers\n<br data-v-479a2324=\"\"/></strong>Merck is advancing research aimed at expanding treatment options for certain breast and gynecologic (ovarian, cervical and endometrial) cancers, with a goal of improving outcomes for more patients affected by these diseases. Breast cancer and gynecologic cancers are the first and second most commonly occurring cancer types among women worldwide, respectively, and Merck aims to give patients facing these devastating diseases options. With more than 20 clinical trials in nearly 20,000 patients around the world, Merck is driving innovative research to purposefully advance standards of care in women’s cancers. Merck’s research efforts include trials focused on evaluating its medicines in earlier stages, as well as identifying novel mechanisms and new combinations with these treatments. Merck is working to develop a portfolio and pipeline to address the impact of women’s cancers on patients, their families and communities globally.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">About KEYTRUDA<span data-v-479a2324=\"\">®</span> (pembrolizumab) injection for intravenous use, 100 mg\n<br data-v-479a2324=\"\"/></strong>KEYTRUDA is an anti-programmed death receptor-1 (PD-1) therapy that works by increasing the ability of the body’s immune system to help detect and fight tumor cells. KEYTRUDA is a humanized monoclonal antibody that blocks the interaction between PD-1 and its ligands, PD-L1 and PD-L2, thereby activating T lymphocytes which may affect both tumor cells and healthy cells.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nMerck has the industry’s largest immuno-oncology clinical research program. There are currently more than 1,600 trials studying KEYTRUDA across a wide variety of cancers and treatment settings. The KEYTRUDA clinical program seeks to understand the role of KEYTRUDA across cancers and the factors that may predict a patient's likelihood of benefitting from treatment with KEYTRUDA, including exploring several different biomarkers.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Selected KEYTRUDA<span data-v-479a2324=\"\">®</span> (pembrolizumab) Indications in the U.S.\n<br data-v-479a2324=\"\"/></strong><em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">Ovarian Cancer\n<br data-v-370fea16=\"\"/></em>KEYTRUDA, in combination with paclitaxel, with or without bevacizumab, is indicated for the treatment of adult patients with platinum-resistant epithelial ovarian, fallopian tube, or primary peritoneal carcinoma whose tumors express PD-L1 (CPS ≥1) as determined by an FDA-authorized test, and who have received one or two prior systemic treatment regimens.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">See additional selected KEYTRUDA indications in the U.S. after the Selected Important Safety Information.</em>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Selected Important Safety Information for KEYTRUDA\n<br data-v-479a2324=\"\"/></strong><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Severe and Fatal Immune-Mediated Adverse Reactions\n<br data-v-479a2324=\"\"/></strong>KEYTRUDA is a monoclonal antibody that belongs to a class of drugs that bind to either the programmed death receptor-1 (PD-1) or the programmed death ligand 1 (PD-L1), blocking the PD-1/PD-L1 pathway, thereby removing inhibition of the immune response, potentially breaking peripheral tolerance and inducing immune-mediated adverse reactions. Immune-mediated adverse reactions, which may be severe or fatal, can occur in any organ system or tissue, can affect more than one body system simultaneously, and can occur at any time after starting treatment or after discontinuation of treatment. Important immune-mediated adverse reactions listed here may not include all possible severe and fatal immune-mediated adverse reactions.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nMonitor patients closely for symptoms and signs that may be clinical manifestations of underlying immune-mediated adverse reactions. Early identification and management are essential to ensure safe use of anti–PD-1/PD-L1 treatments. Evaluate liver enzymes, creatinine, and thyroid function at baseline and periodically during treatment. For patients with TNBC treated with KEYTRUDA in the neoadjuvant setting, monitor blood cortisol at baseline, prior to surgery, and as clinically indicated. In cases of suspected immune-mediated adverse reactions, initiate appropriate workup to exclude alternative etiologies, including infection. Institute medical management promptly, including specialty consultation as appropriate.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nWithhold or permanently discontinue KEYTRUDA depending on severity of the immune-mediated adverse reaction. In general, if KEYTRUDA requires interruption or discontinuation, administer systemic corticosteroid therapy (1 to 2 mg/kg/day prednisone or equivalent) until improvement to Grade 1 or less. Upon improvement to Grade 1 or less, initiate corticosteroid taper and continue to taper over at least 1 month. Consider administration of other systemic immunosuppressants in patients whose adverse reactions are not controlled with corticosteroid therapy.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<span data-v-602de5d2=\"\">Immune-Mediated Pneumonitis\n<br data-v-602de5d2=\"\"/></span>KEYTRUDA can cause immune-mediated pneumonitis. The incidence is higher in patients who have received prior thoracic radiation. Immune-mediated pneumonitis occurred in 3.4% (94/2799) of patients receiving KEYTRUDA, including fatal (0.1%), Grade 4 (0.3%), Grade 3 (0.9%), and Grade 2 (1.3%) reactions. Systemic corticosteroids were required in 67% (63/94) of patients. Pneumonitis led to permanent discontinuation of KEYTRUDA in 1.3% (36) and withholding in 0.9% (26) of patients. All patients who were withheld reinitiated KEYTRUDA after symptom improvement; of these, 23% had recurrence. Pneumonitis resolved in 59% of the 94 patients.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nPneumonitis occurred in 8% (31/389) of adult patients with cHL receiving KEYTRUDA as a single agent, including Grades 3-4 in 2.3% of patients. Patients received high-dose corticosteroids for a median duration of 10 days (range: 2 days to 53 months). Pneumonitis rates were similar in patients with and without prior thoracic radiation. Pneumonitis led to discontinuation of KEYTRUDA in 5.4% (21) of patients. Of the patients who developed pneumonitis, 42% interrupted KEYTRUDA, 68% discontinued KEYTRUDA, and 77% had resolution.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nPneumonitis occurred in 7% (41/580) of adult patients with resected NSCLC who received KEYTRUDA as a single agent for adjuvant treatment of NSCLC, including fatal (0.2%), Grade 4 (0.3%), and Grade 3 (1%) adverse reactions. Patients received high-dose corticosteroids for a median duration of 10 days (range: 1 day to 2.3 months). Pneumonitis led to discontinuation of KEYTRUDA in 26 (4.5%) of patients. Of the patients who developed pneumonitis, 54% interrupted KEYTRUDA, 63% discontinued KEYTRUDA, and 71% had resolution.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<span data-v-602de5d2=\"\">Immune-Mediated Colitis\n<br data-v-602de5d2=\"\"/></span>KEYTRUDA can cause immune-mediated colitis, which may present with diarrhea. Cytomegalovirus infection/reactivation has been reported in patients with corticosteroid-refractory immune-mediated colitis. In cases of corticosteroid-refractory colitis, consider repeating infectious workup to exclude alternative etiologies. Immune-mediated colitis occurred in 1.7% (48/2799) of patients receiving KEYTRUDA, including Grade 4 (&lt;0.1%), Grade 3 (1.1%), and Grade 2 (0.4%) reactions. Systemic corticosteroids were required in 69% (33/48); additional immunosuppressant therapy was required in 4.2% of patients. Colitis led to permanent discontinuation of KEYTRUDA in 0.5% (15) and withholding in 0.5% (13) of patients. All patients who were withheld reinitiated KEYTRUDA after symptom improvement; of these, 23% had recurrence. Colitis resolved in 85% of the 48 patients.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<span data-v-602de5d2=\"\">Hepatotoxicity and Immune-Mediated Hepatitis\n<br data-v-602de5d2=\"\"/></span><em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">KEYTRUDA as a Single Agent\n<br data-v-370fea16=\"\"/></em>KEYTRUDA can cause immune-mediated hepatitis. Immune-mediated hepatitis occurred in 0.7% (19/2799) of patients receiving KEYTRUDA, including Grade 4 (&lt;0.1%), Grade 3 (0.4%), and Grade 2 (0.1%) reactions. Systemic corticosteroids were required in 68% (13/19) of patients; additional immunosuppressant therapy was required in 11% of patients. Hepatitis led to permanent discontinuation of KEYTRUDA in 0.2% (6) and withholding in 0.3% (9) of patients. All patients who were withheld reinitiated KEYTRUDA after symptom improvement; of these, none had recurrence. Hepatitis resolved in 79% of the 19 patients.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">KEYTRUDA With Axitinib\n<br data-v-370fea16=\"\"/></em>KEYTRUDA in combination with axitinib can cause hepatic toxicity. Monitor liver enzymes before initiation of and periodically throughout treatment. Consider monitoring more frequently as compared to when the drugs are administered as single agents. For elevated liver enzymes, interrupt KEYTRUDA and axitinib, and consider administering corticosteroids as needed. With the combination of KEYTRUDA and axitinib, Grades 3 and 4 increased alanine aminotransferase (ALT) (20%) and increased aspartate aminotransferase (AST) (13%) were seen at a higher frequency compared to KEYTRUDA alone. Fifty-nine percent of the patients with increased ALT received systemic corticosteroids. In patients with ALT ≥3 times upper limit of normal (ULN) (Grades 2-4, n=116), ALT resolved to Grades 0-1 in 94%. Among the 92 patients who were rechallenged with either KEYTRUDA (n=3) or axitinib (n=34) administered as a single agent or with both (n=55), recurrence of ALT ≥3 times ULN was observed in 1 patient receiving KEYTRUDA, 16 patients receiving axitinib, and 24 patients receiving both. All patients with a recurrence of ALT ≥3 ULN subsequently recovered from the event.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<span data-v-602de5d2=\"\">Immune-Mediated Endocrinopathies\n<br data-v-602de5d2=\"\"/></span><em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">Adrenal Insufficiency\n<br data-v-370fea16=\"\"/></em>KEYTRUDA can cause primary or secondary adrenal insufficiency. For Grade 2 or higher, initiate symptomatic treatment, including hormone replacement as clinically indicated. Withhold KEYTRUDA depending on severity. Adrenal insufficiency occurred in 0.8% (22/2799) of patients receiving KEYTRUDA, including Grade 4 (&lt;0.1%), Grade 3 (0.3%), and Grade 2 (0.3%) reactions. Systemic corticosteroids were required in 77% (17/22) of patients; of these, the majority remained on systemic corticosteroids. Adrenal insufficiency led to permanent discontinuation of KEYTRUDA in &lt;0.1% (1) and withholding in 0.3% (8) of patients. All patients who were withheld reinitiated KEYTRUDA after symptom improvement.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">Hypophysitis\n<br data-v-370fea16=\"\"/></em>KEYTRUDA can cause immune-mediated hypophysitis. Hypophysitis can present with acute symptoms associated with mass effect such as headache, photophobia, or visual field defects. Hypophysitis can cause hypopituitarism. Initiate hormone replacement as indicated. Withhold or permanently discontinue KEYTRUDA depending on severity. Hypophysitis occurred in 0.6% (17/2799) of patients receiving KEYTRUDA, including Grade 4 (&lt;0.1%), Grade 3 (0.3%), and Grade 2 (0.2%) reactions. Systemic corticosteroids were required in 94% (16/17) of patients; of these, the majority remained on systemic corticosteroids. Hypophysitis led to permanent discontinuation of KEYTRUDA in 0.1% (4) and withholding in 0.3% (7) of patients. All patients who were withheld reinitiated KEYTRUDA after symptom improvement.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">Thyroid Disorders\n<br data-v-370fea16=\"\"/></em>KEYTRUDA can cause immune-mediated thyroid disorders. Thyroiditis can present with or without endocrinopathy. Hypothyroidism can follow hyperthyroidism. Initiate hormone replacement for hypothyroidism or institute medical management of hyperthyroidism as clinically indicated. Withhold or permanently discontinue KEYTRUDA depending on severity. Thyroiditis occurred in 0.6% (16/2799) of patients receiving KEYTRUDA, including Grade 2 (0.3%). None discontinued, but KEYTRUDA was withheld in &lt;0.1% (1) of patients.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nHyperthyroidism occurred in 3.4% (96/2799) of patients receiving KEYTRUDA, including Grade 3 (0.1%) and Grade 2 (0.8%). It led to permanent discontinuation of KEYTRUDA in &lt;0.1% (2) and withholding in 0.3% (7) of patients. All patients who were withheld reinitiated KEYTRUDA after symptom improvement. Hypothyroidism occurred in 8% (237/2799) of patients receiving KEYTRUDA, including Grade 3 (0.1%) and Grade 2 (6.2%). It led to permanent discontinuation of KEYTRUDA in &lt;0.1% (1) and withholding in 0.5% (14) of patients. All patients who were withheld reinitiated KEYTRUDA after symptom improvement. The majority of patients with hypothyroidism required long-term thyroid hormone replacement. The incidence of new or worsening hypothyroidism was higher in 1185 patients with HNSCC, occurring in 16% of patients receiving KEYTRUDA as a single agent or in combination with platinum and FU, including Grade 3 (0.3%) hypothyroidism. The incidence of new or worsening hypothyroidism was higher in 389 adult patients with cHL (17%) receiving KEYTRUDA as a single agent, including Grade 1 (6.2%) and Grade 2 (10.8%) hypothyroidism. The incidence of new or worsening hyperthyroidism was higher in 580 patients with resected NSCLC, occurring in 11% of patients receiving KEYTRUDA as a single agent as adjuvant treatment, including Grade 3 (0.2%) hyperthyroidism. The incidence of new or worsening hypothyroidism was higher in 580 patients with resected NSCLC, occurring in 22% of patients receiving KEYTRUDA as a single agent as adjuvant treatment (KEYNOTE-091), including Grade 3 (0.3%) hypothyroidism.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">Type 1 Diabetes Mellitus (DM), Which Can Present With Diabetic Ketoacidosis\n<br data-v-370fea16=\"\"/></em>Monitor patients for hyperglycemia or other signs and symptoms of diabetes. Initiate treatment with insulin as clinically indicated. Withhold KEYTRUDA depending on severity. Type 1 DM occurred in 0.2% (6/2799) of patients receiving KEYTRUDA. It led to permanent discontinuation in &lt;0.1% (1) and withholding of KEYTRUDA in &lt;0.1% (1) of patients. All patients who were withheld reinitiated KEYTRUDA after symptom improvement.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<span data-v-602de5d2=\"\">Immune-Mediated Nephritis With Renal Dysfunction\n<br data-v-602de5d2=\"\"/></span>KEYTRUDA can cause immune-mediated nephritis. Immune-mediated nephritis occurred in 0.3% (9/2799) of patients receiving KEYTRUDA, including Grade 4 (&lt;0.1%), Grade 3 (0.1%), and Grade 2 (0.1%) reactions. Systemic corticosteroids were required in 89% (8/9) of patients. Nephritis led to permanent discontinuation of KEYTRUDA in 0.1% (3) and withholding in 0.1% (3) of patients. All patients who were withheld reinitiated KEYTRUDA after symptom improvement; of these, none had recurrence. Nephritis resolved in 56% of the 9 patients.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<span data-v-602de5d2=\"\">Immune-Mediated Dermatologic Adverse Reactions\n<br data-v-602de5d2=\"\"/></span>KEYTRUDA can cause immune-mediated rash or dermatitis. Exfoliative dermatitis, including Stevens-Johnson syndrome, drug rash with eosinophilia and systemic symptoms, and toxic epidermal necrolysis, has occurred with anti–PD-1/PD-L1 treatments. Topical emollients and/or topical corticosteroids may be adequate to treat mild to moderate nonexfoliative rashes. Withhold or permanently discontinue KEYTRUDA depending on severity. Immune-mediated dermatologic adverse reactions occurred in 1.4% (38/2799) of patients receiving KEYTRUDA, including Grade 3 (1%) and Grade 2 (0.1%) reactions. Systemic corticosteroids were required in 40% (15/38) of patients. These reactions led to permanent discontinuation in 0.1% (2) and withholding of KEYTRUDA in 0.6% (16) of patients. All patients who were withheld reinitiated KEYTRUDA after symptom improvement; of these, 6% had recurrence. The reactions resolved in 79% of the 38 patients.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<span data-v-602de5d2=\"\">Other Immune-Mediated Adverse Reactions\n<br data-v-602de5d2=\"\"/></span>The following clinically significant immune-mediated adverse reactions occurred at an incidence of &lt;1% (unless otherwise noted) in patients who received KEYTRUDA or were reported with the use of other anti–PD-1/PD-L1 treatments. Severe or fatal cases have been reported for some of these adverse reactions. <em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">Cardiac/Vascular:</em> Myocarditis, pericarditis, vasculitis; <em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">Nervous System:</em> Meningitis, encephalitis, myelitis and demyelination, myasthenic syndrome/myasthenia gravis (including exacerbation), Guillain-Barré syndrome, nerve paresis, autoimmune neuropathy; <em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">Ocular:</em> Uveitis, iritis and other ocular inflammatory toxicities can occur. Some cases can be associated with retinal detachment. Various grades of visual impairment, including blindness, can occur. If uveitis occurs in combination with other immune-mediated adverse reactions, consider a Vogt-Koyanagi-Harada-like syndrome, as this may require treatment with systemic steroids to reduce the risk of permanent vision loss; <em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">Gastrointestinal:</em> Pancreatitis, to include increases in serum amylase and lipase levels, gastritis, duodenitis; <em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">Musculoskeletal and Connective Tissue:</em> Myositis/polymyositis, rhabdomyolysis (and associated sequelae, including renal failure), arthritis (1.5%), polymyalgia rheumatica; <em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">Endocrine: </em>Hypoparathyroidism; <em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">Hematologic/Immune:</em> Hemolytic anemia, aplastic anemia, hemophagocytic lymphohistiocytosis, systemic inflammatory response syndrome, histiocytic necrotizing lymphadenitis (Kikuchi lymphadenitis), sarcoidosis, immune thrombocytopenic purpura, solid organ transplant rejection, other transplant (including corneal graft) rejection.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Infusion-Related Reactions\n<br data-v-479a2324=\"\"/></strong>KEYTRUDA can cause severe or life-threatening infusion-related reactions, including hypersensitivity and anaphylaxis, which have been reported in 0.2% of 2799 patients receiving KEYTRUDA. Monitor for signs and symptoms of infusion-related reactions. Interrupt or slow the rate of infusion for Grade 1 or Grade 2 reactions. For Grade 3 or Grade 4 reactions, stop infusion and permanently discontinue KEYTRUDA.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Complications of Allogeneic Hematopoietic Stem Cell Transplantation (HSCT)\n<br data-v-479a2324=\"\"/></strong>Fatal and other serious complications can occur in patients who receive allogeneic HSCT before or after anti–PD-1/PD-L1 treatments. Transplant-related complications include hyperacute graft-versus-host disease (GVHD), acute and chronic GVHD, hepatic veno-occlusive disease after reduced intensity conditioning, and steroid-requiring febrile syndrome (without an identified infectious cause). These complications may occur despite intervening therapy between anti–PD-1/PD-L1 treatments and allogeneic HSCT. Follow patients closely for evidence of these complications and intervene promptly. Consider the benefit vs risks of using anti–PD-1/PD-L1 treatments prior to or after an allogeneic HSCT.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Increased Mortality in Patients With Multiple Myeloma\n<br data-v-479a2324=\"\"/></strong>In trials in patients with multiple myeloma, the addition of KEYTRUDA to a thalidomide analogue plus dexamethasone resulted in increased mortality. Treatment of these patients with an anti–PD-1/PD-L1 treatment in this combination is not recommended outside of controlled trials.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Embryofetal Toxicity\n<br data-v-479a2324=\"\"/></strong>Based on its mechanism of action, KEYTRUDA can cause fetal harm when administered to a pregnant woman. Advise women of this potential risk. In females of reproductive potential, verify pregnancy status prior to initiating KEYTRUDA and advise them to use effective contraception during treatment and for 4 months after the last dose.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Adverse Reactions\n<br data-v-479a2324=\"\"/></strong>In KEYNOTE-006, KEYTRUDA was discontinued due to adverse reactions in 9% of 555 patients with advanced melanoma; adverse reactions leading to permanent discontinuation in more than one patient were colitis (1.4%), autoimmune hepatitis (0.7%), allergic reaction (0.4%), polyneuropathy (0.4%), and cardiac failure (0.4%). The most common adverse reactions (≥20%) with KEYTRUDA were fatigue (28%), diarrhea (26%), rash (24%), and nausea (21%).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nIn KEYNOTE-054, when KEYTRUDA was administered as a single agent to patients with stage III melanoma, KEYTRUDA was permanently discontinued due to adverse reactions in 14% of 509 patients; the most common (≥1%) were pneumonitis (1.4%), colitis (1.2%), and diarrhea (1%). Serious adverse reactions occurred in 25% of patients receiving KEYTRUDA. The most common adverse reaction (≥20%) with KEYTRUDA was diarrhea (28%). In KEYNOTE-716, when KEYTRUDA was administered as a single agent to patients with stage IIB or IIC melanoma, adverse reactions occurring in patients with stage IIB or IIC melanoma were similar to those occurring in 1011 patients with stage III melanoma from KEYNOTE-054.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nIn KEYNOTE-189, when KEYTRUDA was administered with pemetrexed and platinum chemotherapy in metastatic nonsquamous NSCLC, KEYTRUDA was discontinued due to adverse reactions in 20% of 405 patients. The most common adverse reactions resulting in permanent discontinuation of KEYTRUDA were pneumonitis (3%) and acute kidney injury (2%). The most common adverse reactions (≥20%) with KEYTRUDA were nausea (56%), fatigue (56%), constipation (35%), diarrhea (31%), decreased appetite (28%), rash (25%), vomiting (24%), cough (21%), dyspnea (21%), and pyrexia (20%).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nIn KEYNOTE-407, when KEYTRUDA was administered with carboplatin and either paclitaxel or paclitaxel protein-bound in metastatic squamous NSCLC, KEYTRUDA was discontinued due to adverse reactions in 15% of 101 patients. The most frequent serious adverse reactions reported in at least 2% of patients were febrile neutropenia, pneumonia, and urinary tract infection. Adverse reactions observed in KEYNOTE-407 were similar to those observed in KEYNOTE-189 with the exception that increased incidences of alopecia (47% vs 36%) and peripheral neuropathy (31% vs 25%) were observed in the KEYTRUDA and chemotherapy arm compared to the placebo and chemotherapy arm in KEYNOTE-407.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nIn KEYNOTE-042, KEYTRUDA was discontinued due to adverse reactions in 19% of 636 patients with advanced NSCLC; the most common were pneumonitis (3%), death due to unknown cause (1.6%), and pneumonia (1.4%). The most frequent serious adverse reactions reported in at least 2% of patients were pneumonia (7%), pneumonitis (3.9%), pulmonary embolism (2.4%), and pleural effusion (2.2%). The most common adverse reaction (≥20%) was fatigue (25%).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nIn KEYNOTE-010, KEYTRUDA monotherapy was discontinued due to adverse reactions in 8% of 682 patients with metastatic NSCLC; the most common was pneumonitis (1.8%). The most common adverse reactions (≥20%) were decreased appetite (25%), fatigue (25%), dyspnea (23%), and nausea (20%).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nIn KEYNOTE-671, adverse reactions occurring in patients with resectable NSCLC receiving KEYTRUDA in combination with platinum-containing chemotherapy, given as neoadjuvant treatment and continued as single-agent adjuvant treatment, were generally similar to those occurring in patients in other clinical trials across tumor types receiving KEYTRUDA in combination with chemotherapy.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nThe most common adverse reactions (reported in ≥20%) in patients receiving KEYTRUDA in combination with chemotherapy or chemoradiotherapy were fatigue/asthenia, nausea, constipation, diarrhea, decreased appetite, rash, vomiting, cough, dyspnea, pyrexia, alopecia, peripheral neuropathy, mucosal inflammation, stomatitis, headache, weight loss, abdominal pain, arthralgia, myalgia, insomnia, palmar-plantar erythrodysesthesia, urinary tract infection, hypothyroidism, radiation skin injury, dysphagia, dry mouth, and musculoskeletal pain.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nIn the neoadjuvant phase of KEYNOTE-671, when KEYTRUDA was administered in combination with platinum-containing chemotherapy as neoadjuvant treatment, serious adverse reactions occurred in 34% of 396 patients. The most frequent (≥2%) serious adverse reactions were pneumonia (4.8%), venous thromboembolism (3.3%), and anemia (2%). Fatal adverse reactions occurred in 1.3% of patients, including death due to unknown cause (0.8%), sepsis (0.3%), and immune-mediated lung disease (0.3%). Permanent discontinuation of any study drug due to an adverse reaction occurred in 18% of patients who received KEYTRUDA in combination with platinum-containing chemotherapy; the most frequent adverse reactions (≥1%) that led to permanent discontinuation of any study drug were acute kidney injury (1.8%), interstitial lung disease (1.8%), anemia (1.5%), neutropenia (1.5%), and pneumonia (1.3%).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nOf the KEYTRUDA-treated patients who received neoadjuvant treatment, 6% of 396 patients did not receive surgery due to adverse reactions. The most frequent (≥1%) adverse reaction that led to cancellation of surgery in the KEYTRUDA arm was interstitial lung disease (1%).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nIn the adjuvant phase of KEYNOTE-671, when KEYTRUDA was administered as a single agent as adjuvant treatment, serious adverse reactions occurred in 14% of 290 patients. The most frequent serious adverse reaction was pneumonia (3.4%). One fatal adverse reaction of pulmonary hemorrhage occurred. Permanent discontinuation of KEYTRUDA due to an adverse reaction occurred in 12% of patients who received KEYTRUDA as a single agent, given as adjuvant treatment; the most frequent adverse reactions (≥1%) that led to permanent discontinuation of KEYTRUDA were diarrhea (1.7%), interstitial lung disease (1.4%), increased aspartate aminotransferase (1%), and musculoskeletal pain (1%).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nAdverse reactions observed in KEYNOTE-091 were generally similar to those occurring in other patients with NSCLC receiving KEYTRUDA as a single agent, with the exception of hypothyroidism (22%), hyperthyroidism (11%), and pneumonitis (7%). Two fatal adverse reactions of myocarditis occurred.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nAdverse reactions observed in KEYNOTE-483 were generally similar to those occurring in other patients receiving KEYTRUDA in combination with pemetrexed and platinum chemotherapy.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nIn KEYNOTE-689, the most common adverse reactions (≥20%) in patients receiving KEYTRUDA were stomatitis (48%), radiation skin injury (40%), weight loss (36%), fatigue (33%), dysphagia (29%), constipation (27%), hypothyroidism (26%), nausea (24%), rash (22%), dry mouth (22%), diarrhea (22%), and musculoskeletal pain (22%).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nIn the neoadjuvant phase of KEYNOTE-689, of the 361 patients who received at least one dose of single agent KEYTRUDA, 11% experienced serious adverse reactions. Serious adverse reactions that occurred in more than one patient were pneumonia (1.4%), tumor hemorrhage (0.8%), dysphagia (0.6%), immune-mediated hepatitis (0.6%), cellulitis (0.6%), and dyspnea (0.6%). Fatal adverse reactions occurred in 1.1% of patients, including respiratory failure, clostridium infection, septic shock, and myocardial infarction (one patient each). Permanent discontinuation of KEYTRUDA due to an adverse reaction occurred in 2.8% of patients who received KEYTRUDA as neoadjuvant treatment. The most frequent adverse reaction which resulted in permanent discontinuation of neoadjuvant KEYTRUDA in more than one patient was arthralgia (0.6%).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nOf the 361 patients who received KEYTRUDA as neoadjuvant treatment, 11% did not receive surgery. Surgical cancellation on the KEYTRUDA arm was due to disease progression in 4%, patient decision in 3%, adverse reactions in 1.4%, physician’s decision in 1.1%, unresectable tumor in 0.6%, loss of follow-up in 0.3%, and use of non-study anti-cancer therapy in 0.3%.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nOf the 323 KEYTRUDA-treated patients who received surgery following the neoadjuvant phase, 1.2% experienced delay of surgery (defined as on-study surgery occurring ≥9 weeks after initiation of neoadjuvant KEYTRUDA) due to adverse reactions, and 2.8% did not receive adjuvant treatment due to adverse reactions.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nIn the adjuvant phase of KEYNOTE-689, of the 255 patients who received at least one dose of KEYTRUDA, 38% experienced serious adverse reactions. The most frequent serious adverse reactions reported in ≥1% of KEYTRUDA- treated patients were pneumonia (2.7%), pyrexia (2.4%), stomatitis (2.4%), acute kidney injury (2.0%), pneumonitis (1.6%), COVID-19 (1.2%), death not otherwise specified (1.2%), diarrhea (1.2%), dysphagia (1.2%), gastrostomy tube site complication (1.2%), and immune-mediated hepatitis (1.2%). Fatal adverse reactions occurred in 5% of patients, including death not otherwise specified (1.2%), acute renal failure (0.4%), hypercalcemia (0.4%), pulmonary hemorrhage (0.4%), dysphagia/malnutrition (0.4%), mesenteric thrombosis (0.4%), sepsis (0.4%), pneumonia (0.4%), COVID-19 (0.4%), respiratory failure (0.4%), cardiovascular disorder (0.4%), and gastrointestinal hemorrhage (0.4%). Permanent discontinuation of adjuvant KEYTRUDA due to an adverse reaction occurred in 17% of patients. The most frequent (≥1%) adverse reactions that led to permanent discontinuation of adjuvant KEYTRUDA were pneumonitis, colitis, immune-mediated hepatitis, and death not otherwise specified.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nIn KEYNOTE-048, KEYTRUDA monotherapy was discontinued due to adverse events in 12% of 300 patients with HNSCC; the most common adverse reactions leading to permanent discontinuation were sepsis (1.7%) and pneumonia (1.3%). The most common adverse reactions (≥20%) were fatigue (33%), constipation (20%), and rash (20%).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nIn KEYNOTE-048, when KEYTRUDA was administered in combination with platinum (cisplatin or carboplatin) and FU chemotherapy, KEYTRUDA was discontinued due to adverse reactions in 16% of 276 patients with HNSCC. The most common adverse reactions resulting in permanent discontinuation of KEYTRUDA were pneumonia (2.5%), pneumonitis (1.8%), and septic shock (1.4%). The most common adverse reactions (≥20%) were nausea (51%), fatigue (49%), constipation (37%), vomiting (32%), mucosal inflammation (31%), diarrhea (29%), decreased appetite (29%), stomatitis (26%), and cough (22%).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nIn KEYNOTE-012, KEYTRUDA was discontinued due to adverse reactions in 17% of 192 patients with HNSCC. Serious adverse reactions occurred in 45% of patients. The most frequent serious adverse reactions reported in at least 2% of patients were pneumonia, dyspnea, confusional state, vomiting, pleural effusion, and respiratory failure. The most common adverse reactions (≥20%) were fatigue, decreased appetite, and dyspnea. Adverse reactions occurring in patients with HNSCC were generally similar to those occurring in patients with melanoma or NSCLC who received KEYTRUDA as a monotherapy, with the exception of increased incidences of facial edema and new or worsening hypothyroidism.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nIn KEYNOTE-204, KEYTRUDA was discontinued due to adverse reactions in 14% of 148 patients with cHL. Serious adverse reactions occurred in 30% of patients receiving KEYTRUDA; those ≥1% were pneumonitis, pneumonia, pyrexia, myocarditis, acute kidney injury, febrile neutropenia, and sepsis. Three patients died from causes other than disease progression: 2 from complications after allogeneic HSCT and 1 from unknown cause. The most common adverse reactions (≥20%) were upper respiratory tract infection (41%), musculoskeletal pain (32%), diarrhea (22%), and pyrexia, fatigue, rash, and cough (20% each).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nIn KEYNOTE-087, KEYTRUDA was discontinued due to adverse reactions in 5% of 210 patients with cHL. Serious adverse reactions occurred in 16% of patients; those ≥1% were pneumonia, pneumonitis, pyrexia, dyspnea, GVHD, and herpes zoster. Two patients died from causes other than disease progression: 1 from GVHD after subsequent allogeneic HSCT and 1 from septic shock. The most common adverse reactions (≥20%) were fatigue (26%), pyrexia (24%), cough (24%), musculoskeletal pain (21%), diarrhea (20%), and rash (20%).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nIn KEYNOTE-170, KEYTRUDA was discontinued due to adverse reactions in 8% of 53 patients with PMBCL. Serious adverse reactions occurred in 26% of patients and included arrhythmia (4%), cardiac tamponade (2%), myocardial infarction (2%), pericardial effusion (2%), and pericarditis (2%). Six (11%) patients died within 30 days of start of treatment. The most common adverse reactions (≥20%) were musculoskeletal pain (30%), upper respiratory tract infection and pyrexia (28% each), cough (26%), fatigue (23%), and dyspnea (21%).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nIn KEYNOTE-A39, when KEYTRUDA was administered in combination with enfortumab vedotin to patients with locally advanced or metastatic urothelial cancer (n=440), fatal adverse reactions occurred in 3.9% of patients, including acute respiratory failure (0.7%), pneumonia (0.5%), and pneumonitis/ILD (0.2%). Serious adverse reactions occurred in 50% of patients receiving KEYTRUDA in combination with enfortumab vedotin; the serious adverse reactions in ≥2% of patients were rash (6%), acute kidney injury (5%), pneumonitis/ILD (4.5%), urinary tract infection (3.6%), diarrhea (3.2%), pneumonia (2.3%), pyrexia (2%), and hyperglycemia (2%). Permanent discontinuation of KEYTRUDA occurred in 27% of patients. The most common adverse reactions (≥2%) resulting in permanent discontinuation of KEYTRUDA were pneumonitis/ILD (4.8%) and rash (3.4%). The most common adverse reactions (≥20%) occurring in patients treated with KEYTRUDA in combination with enfortumab vedotin were rash (68%), peripheral neuropathy (67%), fatigue (51%), pruritus (41%), diarrhea (38%), alopecia (35%), weight loss (33%), decreased appetite (33%), nausea (26%), constipation (26%), dry eye (24%), dysgeusia (21%), and urinary tract infection (21%).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nIn KEYNOTE-052, KEYTRUDA was discontinued due to adverse reactions in 11% of 370 patients with locally advanced or metastatic urothelial carcinoma. Serious adverse reactions occurred in 42% of patients; those ≥2% were urinary tract infection, hematuria, acute kidney injury, pneumonia, and urosepsis. The most common adverse reactions (≥20%) were fatigue (38%), musculoskeletal pain (24%), decreased appetite (22%), constipation (21%), rash (21%), and diarrhea (20%).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nIn KEYNOTE-045, KEYTRUDA was discontinued due to adverse reactions in 8% of 266 patients with locally advanced or metastatic urothelial carcinoma. The most common adverse reaction resulting in permanent discontinuation of KEYTRUDA was pneumonitis (1.9%). Serious adverse reactions occurred in 39% of KEYTRUDA-treated patients; those ≥2% were urinary tract infection, pneumonia, anemia, and pneumonitis. The most common adverse reactions (≥20%) in patients who received KEYTRUDA were fatigue (38%), musculoskeletal pain (32%), pruritus (23%), decreased appetite (21%), nausea (21%), and rash (20%).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nIn KEYNOTE-905, the most common adverse reactions (≥20%) occurring in cisplatin-ineligible patients with MIBC treated with KEYTRUDA in combination with enfortumab vedotin (n=167) were rash (54%), pruritus (47%), fatigue (47%), peripheral neuropathy (39%), alopecia (35%), dysgeusia (35%), diarrhea (34%), constipation (28%), decreased appetite (28%), nausea (26%), urinary tract infection (24%), dry eye (21%), and weight loss (20%).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nIn the neoadjuvant phase of KEYNOTE-905, serious adverse reactions occurred in 27% (n=167) of patients; the most frequent (≥2%) were urinary tract infection (3.6%) and hematuria (2.4%). Fatal adverse reactions occurred in 1.2% of patients, including myasthenia gravis and toxic epidermal necrolysis (0.6% each). Additional fatal adverse reactions were reported in 2.7% of patients in the post-surgery phase before adjuvant treatment started, including sepsis and intestinal obstruction (1.4% each). Permanent discontinuation of KEYTRUDA due to an adverse reaction occurred in 15% of patients; the most frequent (&gt;1%) were rash (2.4%, including generalized exfoliative dermatitis), increased alanine aminotransferase, increased aspartate aminotransferase, diarrhea, dysgeusia, and toxic epidermal necrolysis (1.2% each). Of the 167 patients in the KEYTRUDA in combination with enfortumab vedotin arm who received neoadjuvant treatment, 7 (4.2%) patients did not receive surgery due to adverse reactions. The adverse reactions that led to cancellation of surgery were acute myocardial infarction, bile duct cancer, colon cancer, respiratory distress, urinary tract infection, and the two deaths due to myasthenia gravis and toxic epidermal necrolysis (0.6% each).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nOf the 146 patients who received neoadjuvant treatment with KEYTRUDA in combination with enfortumab vedotin and underwent radical cystectomy, 6 (4.1%) patients experienced delay of surgery (defined as time from last neoadjuvant treatment to surgery exceeding 8 weeks) due to adverse reactions.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nIn the adjuvant phase of KEYNOTE-905, serious adverse reactions occurred in 43% (n=100) of patients; the most frequent (≥2%) were urinary tract infection (8%); acute kidney injury and pyelonephritis (5% each); urosepsis (4%); and hypokalemia, intestinal obstruction, and sepsis (2% each). Fatal adverse reactions occurred in 7% of patients, including urosepsis, intracranial hemorrhage, death, myocardial infarction, multiple organ dysfunction syndrome, and pseudomonal pneumonia (1% each). Permanent discontinuation of KEYTRUDA due to an adverse reaction occurred in 28% of patients; the most frequent (&gt;1%) were diarrhea (5%), peripheral neuropathy, acute kidney injury, and pneumonitis (2% each).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nIn KEYNOTE-057, KEYTRUDA was discontinued due to adverse reactions in 11% of 148 patients with high-risk NMIBC. The most common adverse reaction resulting in permanent discontinuation of KEYTRUDA was pneumonitis (1.4%). Serious adverse reactions occurred in 28% of patients; those ≥2% were pneumonia (3%), cardiac ischemia (2%), colitis (2%), pulmonary embolism (2%), sepsis (2%), and urinary tract infection (2%). The most common adverse reactions (≥20%) were fatigue (29%), diarrhea (24%), and rash (24%).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nAdverse reactions occurring in patients with MSI-H or dMMR CRC were similar to those occurring in patients with melanoma or NSCLC who received KEYTRUDA as a monotherapy.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nIn KEYNOTE-158 and KEYNOTE-164, adverse reactions occurring in patients with MSI-H or dMMR cancer were similar to those occurring in patients with other solid tumors who received KEYTRUDA as a single agent.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nIn KEYNOTE-811, fatal adverse reactions occurred in 3 patients who received KEYTRUDA in combination with trastuzumab and CAPOX (capecitabine plus oxaliplatin) or FP (5-FU plus cisplatin) and included pneumonitis in 2 patients and hepatitis in 1 patient. KEYTRUDA was discontinued due to adverse reactions in 13% of 350 patients with locally advanced unresectable or metastatic HER2-positive gastric or GEJ adenocarcinoma. Adverse reactions resulting in permanent discontinuation of KEYTRUDA in ≥1% of patients were pneumonitis (2.0%) and pneumonia (1.1%). In the KEYTRUDA arm vs placebo, there was a difference of ≥5% incidence between patients treated with KEYTRUDA vs standard of care for diarrhea (53% vs 47%), rash (35% vs 28%), hypothyroidism (11% vs 5%), and pneumonia (11% vs 5%).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nIn KEYNOTE-859, when KEYTRUDA was administered in combination with fluoropyrimidine- and platinum-containing chemotherapy, serious adverse reactions occurred in 45% of 785 patients. Serious adverse reactions in &gt;2% of patients included pneumonia (4.1%), diarrhea (3.9%), hemorrhage (3.9%), and vomiting (2.4%). Fatal adverse reactions occurred in 8% of patients who received KEYTRUDA, including infection (2.3%) and thromboembolism (1.3%). KEYTRUDA was permanently discontinued due to adverse reactions in 15% of patients. The most common adverse reactions resulting in permanent discontinuation of KEYTRUDA (≥1%) were infections (1.8%) and diarrhea (1.0%). The most common adverse reactions (reported in ≥20%) in patients receiving KEYTRUDA in combination with chemotherapy were peripheral neuropathy (47%), nausea (46%), fatigue (40%), diarrhea (36%), vomiting (34%), decreased appetite (29%), abdominal pain (26%), palmar-plantar erythrodysesthesia syndrome (25%), constipation (22%), and weight loss (20%).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nIn KEYNOTE-590, when KEYTRUDA was administered with cisplatin and fluorouracil to patients with metastatic or locally advanced esophageal or GEJ (tumors with epicenter 1 to 5 centimeters above the GEJ) carcinoma who were not candidates for surgical resection or definitive chemoradiation, KEYTRUDA was discontinued due to adverse reactions in 15% of 370 patients. The most common adverse reactions resulting in permanent discontinuation of KEYTRUDA (≥1%) were pneumonitis (1.6%), acute kidney injury (1.1%), and pneumonia (1.1%). The most common adverse reactions (≥20%) with KEYTRUDA in combination with chemotherapy were nausea (67%), fatigue (57%), decreased appetite (44%), constipation (40%), diarrhea (36%), vomiting (34%), stomatitis (27%), and weight loss (24%).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nAdverse reactions occurring in patients with esophageal cancer who received KEYTRUDA as a monotherapy were similar to those occurring in patients with melanoma or NSCLC who received KEYTRUDA as a monotherapy.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nIn KEYNOTE-A18, when KEYTRUDA was administered with CRT (cisplatin plus external beam radiation therapy [EBRT] followed by brachytherapy [BT]) to patients with FIGO 2014 Stage III-IVA cervical cancer, fatal adverse reactions occurred in 1.4% of 294 patients, including 1 case each (0.3%) of large intestinal perforation, urosepsis, sepsis, and vaginal hemorrhage. Serious adverse reactions occurred in 34% of patients; those ≥1% included urinary tract infection (3.1%), urosepsis (1.4%), and sepsis (1%). KEYTRUDA was discontinued for adverse reactions in 9% of patients. The most common adverse reaction (≥1%) resulting in permanent discontinuation was diarrhea (1%). For patients treated with KEYTRUDA in combination with CRT, the most common adverse reactions (≥10%) were nausea (56%), diarrhea (51%), urinary tract infection (35%), vomiting (34%), fatigue (28%), hypothyroidism (23%), constipation (20%), weight loss (19%), decreased appetite (18%), pyrexia (14%), abdominal pain and hyperthyroidism (13% each), dysuria and rash (12% each), back and pelvic pain (11% each), and COVID-19 (10%).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nIn KEYNOTE-826, when KEYTRUDA was administered in combination with paclitaxel and cisplatin or paclitaxel and carboplatin, with or without bevacizumab (n=307), to patients with persistent, recurrent, or first-line metastatic cervical cancer regardless of tumor PD-L1 expression who had not been treated with chemotherapy except when used concurrently as a radio-sensitizing agent, fatal adverse reactions occurred in 4.6% of patients, including 3 cases of hemorrhage, 2 cases each of sepsis and due to unknown causes, and 1 case each of acute myocardial infarction, autoimmune encephalitis, cardiac arrest, cerebrovascular accident, femur fracture with perioperative pulmonary embolus, intestinal perforation, and pelvic infection. Serious adverse reactions occurred in 50% of patients receiving KEYTRUDA in combination with chemotherapy with or without bevacizumab; those ≥3% were febrile neutropenia (6.8%), urinary tract infection (5.2%), anemia (4.6%), and acute kidney injury and sepsis (3.3% each).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nKEYTRUDA was discontinued in 15% of patients due to adverse reactions. The most common adverse reaction resulting in permanent discontinuation (≥1%) was colitis (1%).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nFor patients treated with KEYTRUDA, chemotherapy, and bevacizumab (n=196), the most common adverse reactions (≥20%) were peripheral neuropathy (62%), alopecia (58%), anemia (55%), fatigue/asthenia (53%), nausea and neutropenia (41% each), diarrhea (39%), hypertension and thrombocytopenia (35% each), constipation and arthralgia (31% each), vomiting (30%), urinary tract infection (27%), rash (26%), leukopenia (24%), hypothyroidism (22%), and decreased appetite (21%).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nFor patients treated with KEYTRUDA in combination with chemotherapy with or without bevacizumab, the most common adverse reactions (≥20%) were peripheral neuropathy (58%), alopecia (56%), fatigue (47%), nausea (40%), diarrhea (36%), constipation (28%), arthralgia (27%), vomiting (26%), hypertension and urinary tract infection (24% each), and rash (22%).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nIn KEYNOTE-158, KEYTRUDA was discontinued due to adverse reactions in 8% of 98 patients with previously treated recurrent or metastatic cervical cancer. Serious adverse reactions occurred in 39% of patients receiving KEYTRUDA; the most frequent included anemia (7%), fistula, hemorrhage, and infections [except urinary tract infections] (4.1% each). The most common adverse reactions (≥20%) were fatigue (43%), musculoskeletal pain (27%), diarrhea (23%), pain and abdominal pain (22% each), and decreased appetite (21%).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nIn KEYNOTE-394, KEYTRUDA was discontinued due to adverse reactions in 13% of 299 patients with previously treated hepatocellular carcinoma. The most common adverse reaction resulting in permanent discontinuation of KEYTRUDA was ascites (2.3%). The most common adverse reactions in patients receiving KEYTRUDA (≥10%) were pyrexia (18%), rash (18%), diarrhea (16%), decreased appetite (15%), pruritus (12%), upper respiratory tract infection (11%), cough (11%), and hypothyroidism (10%).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nIn KEYNOTE-966, when KEYTRUDA was administered in combination with gemcitabine and cisplatin, KEYTRUDA was discontinued for adverse reactions in 15% of 529 patients with locally advanced unresectable or metastatic biliary tract cancer. The most common adverse reaction resulting in permanent discontinuation of KEYTRUDA (≥1%) was pneumonitis (1.3%). Adverse reactions leading to the interruption of KEYTRUDA occurred in 55% of patients. The most common adverse reactions or laboratory abnormalities leading to interruption of KEYTRUDA (≥2%) were decreased neutrophil count (18%), decreased platelet count (10%), anemia (6%), decreased white blood cell count (4%), pyrexia (3.8%), fatigue (3.0%), cholangitis (2.8%), increased ALT (2.6%), increased AST (2.5%), and biliary obstruction (2.3%).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nIn KEYNOTE-017 and KEYNOTE-913, adverse reactions occurring in patients with MCC (n=105) were generally similar to those occurring in patients with melanoma or NSCLC who received KEYTRUDA as a single agent.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nIn KEYNOTE-426, when KEYTRUDA was administered in combination with axitinib, fatal adverse reactions occurred in 3.3% of 429 patients. Serious adverse reactions occurred in 40% of patients, the most frequent (≥1%) were hepatotoxicity (7%), diarrhea (4.2%), acute kidney injury (2.3%), dehydration (1%), and pneumonitis (1%). Permanent discontinuation due to an adverse reaction occurred in 31% of patients; KEYTRUDA only (13%), axitinib only (13%), and the combination (8%); the most common were hepatotoxicity (13%), diarrhea/colitis (1.9%), acute kidney injury (1.6%), and cerebrovascular accident (1.2%). The most common adverse reactions (≥20%) were diarrhea (56%), fatigue/asthenia (52%), hypertension (48%), hepatotoxicity (39%), hypothyroidism (35%), decreased appetite (30%), palmar-plantar erythrodysesthesia (28%), nausea (28%), stomatitis/mucosal inflammation (27%), dysphonia (25%), rash (25%), cough (21%), and constipation (21%).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nIn KEYNOTE-564, when KEYTRUDA was administered as a single agent for the adjuvant treatment of renal cell carcinoma, serious adverse reactions occurred in 20% of patients receiving KEYTRUDA; the serious adverse reactions (≥1%) were acute kidney injury, adrenal insufficiency, pneumonia, colitis, and diabetic ketoacidosis (1% each). Fatal adverse reactions occurred in 0.2% including 1 case of pneumonia. Discontinuation of KEYTRUDA due to adverse reactions occurred in 21% of 488 patients; the most common (≥1%) were increased ALT (1.6%), colitis (1%), and adrenal insufficiency (1%). The most common adverse reactions (≥20%) were musculoskeletal pain (41%), fatigue (40%), rash (30%), diarrhea (27%), pruritus (23%), and hypothyroidism (21%).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nIn KEYNOTE-868, when KEYTRUDA was administered in combination with chemotherapy (paclitaxel and carboplatin) to patients with advanced or recurrent endometrial carcinoma (n=382), serious adverse reactions occurred in 35% of patients receiving KEYTRUDA in combination with chemotherapy, compared to 19% of patients receiving placebo in combination with chemotherapy (n=377). Fatal adverse reactions occurred in 1.6% of patients receiving KEYTRUDA in combination with chemotherapy, including COVID-19 (0.5%) and cardiac arrest (0.3%). KEYTRUDA was discontinued for an adverse reaction in 14% of patients. Adverse reactions occurring in patients treated with KEYTRUDA and chemotherapy were generally similar to those observed with KEYTRUDA alone or chemotherapy alone, with the exception of rash (33% all Grades; 2.9% Grades 3-4).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nAdverse reactions occurring in patients with MSI-H or dMMR endometrial carcinoma who received KEYTRUDA as a single agent were similar to those occurring in patients with melanoma or NSCLC who received KEYTRUDA as a single agent.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nAdverse reactions occurring in patients with TMB-H cancer were similar to those occurring in patients with other solid tumors who received KEYTRUDA as a single agent.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nAdverse reactions occurring in patients with recurrent or metastatic cSCC or locally advanced cSCC were similar to those occurring in patients with melanoma or NSCLC who received KEYTRUDA as a monotherapy.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nIn KEYNOTE-522, when KEYTRUDA was administered with neoadjuvant chemotherapy (carboplatin and paclitaxel followed by doxorubicin or epirubicin and cyclophosphamide) followed by surgery and continued adjuvant treatment with KEYTRUDA as a single agent (n=778) to patients with newly diagnosed, previously untreated, high-risk early-stage TNBC, fatal adverse reactions occurred in 0.9% of patients, including 1 each of adrenal crisis, autoimmune encephalitis, hepatitis, pneumonia, pneumonitis, pulmonary embolism, and sepsis in association with multiple organ dysfunction syndrome and myocardial infarction. Serious adverse reactions occurred in 44% of patients receiving KEYTRUDA; those ≥2% were febrile neutropenia (15%), pyrexia (3.7%), anemia (2.6%), and neutropenia (2.2%). KEYTRUDA was discontinued in 20% of patients due to adverse reactions. The most common reactions (≥1%) resulting in permanent discontinuation were increased ALT (2.7%), increased AST (1.5%), and rash (1%). The most common adverse reactions (≥20%) in patients receiving KEYTRUDA were fatigue (70%), nausea (67%), alopecia (61%), rash (52%), constipation (42%), diarrhea and peripheral neuropathy (41% each), stomatitis (34%), vomiting (31%), headache (30%), arthralgia (29%), pyrexia (28%), cough (26%), abdominal pain (24%), decreased appetite (23%), insomnia (21%), and myalgia (20%).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nIn KEYNOTE-355, when KEYTRUDA and chemotherapy (paclitaxel, paclitaxel protein-bound, or gemcitabine and carboplatin) were administered to patients with locally recurrent unresectable or metastatic TNBC who had not been previously treated with chemotherapy in the metastatic setting (n=596), fatal adverse reactions occurred in 2.5% of patients, including cardio-respiratory arrest (0.7%) and septic shock (0.3%). Serious adverse reactions occurred in 30% of patients receiving KEYTRUDA in combination with chemotherapy; the serious reactions in ≥2% were pneumonia (2.9%), anemia (2.2%), and thrombocytopenia (2%). KEYTRUDA was discontinued in 11% of patients due to adverse reactions. The most common reactions resulting in permanent discontinuation (≥1%) were increased ALT (2.2%), increased AST (1.5%), and pneumonitis (1.2%). The most common adverse reactions (≥20%) in patients receiving KEYTRUDA in combination with chemotherapy were fatigue (48%), nausea (44%), alopecia (34%), diarrhea and constipation (28% each), vomiting and rash (26% each), cough (23%), decreased appetite (21%), and headache (20%).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nIn KEYNOTE-B96, when KEYTRUDA was administered in combination with paclitaxel, with or without bevacizumab, serious adverse reactions occurred in 54% of patients. Serious adverse reactions in ≥2% of patients were pneumonia (4.3%), urinary tract infection (3.9%), adrenal insufficiency (3%), hyponatremia (3%), COVID-19, decreased neutrophil count, pulmonary embolism (2.6% each), abdominal pain, anemia, colitis, diarrhea, febrile neutropenia, pyrexia, and vomiting (2.1% each).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nFatal adverse reactions occurred in 3.9% of patients receiving KEYTRUDA and paclitaxel, with or without bevacizumab, including assisted suicide (0.9%), death, intestinal perforation, sepsis, COVID-19, cardio-respiratory arrest, colitis, and embolic stroke (0.4% each).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nKEYTRUDA was permanently discontinued for adverse reactions in 16% of patients. The most common adverse reactions resulting in permanent discontinuation of KEYTRUDA (≥1%) were colitis and increased alanine aminotransferase (1.3% each). Adverse reactions leading to the interruption of KEYTRUDA occurred in 44% of patients. The most common adverse reactions leading to interruption of KEYTRUDA in ≥2% were urinary tract infection (3.9%), adrenal insufficiency, pyrexia, pneumonitis, upper respiratory tract infection (2.6% each), neutropenia, diarrhea, and COVID-19 (2.1% each).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nThe most common adverse reactions (≥20%) for patients treated with KEYTRUDA in combination with paclitaxel, with or without bevacizumab, were diarrhea (45%), fatigue (43%), nausea (41%), alopecia, peripheral neuropathy (38% each), epistaxis (31%), urinary tract infection (27%), constipation (25%), abdominal pain, decreased appetite, vomiting (24% each), hypothyroidism (21%), cough, hypertension, and rash (20% each).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nFor patients treated with KEYTRUDA in combination with paclitaxel and bevacizumab (N=169), decreased white blood cell count (27%), stomatitis (22%), and pyrexia (21%) were also reported as adverse reactions.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Lactation\n<br data-v-479a2324=\"\"/></strong>Because of the potential for serious adverse reactions in breastfed children, advise women not to breastfeed during treatment and for 4 months after the last dose.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Pediatric Use\n<br data-v-479a2324=\"\"/></strong>In KEYNOTE-051, 173 pediatric patients (65 pediatric patients aged 6 months to younger than 12 years and 108 pediatric patients aged 12 years to 17 years) were administered KEYTRUDA 2 mg/kg every 3 weeks. The median duration of exposure was 2.1 months (range: 1 day to 25 months).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nAdverse reactions that occurred at a ≥10% higher rate in pediatric patients when compared to adults were pyrexia (33%), leukopenia (30%), vomiting (29%), neutropenia (28%), headache (25%), abdominal pain (23%), thrombocytopenia (22%), Grade 3 anemia (17%), decreased lymphocyte count (13%), and decreased white blood cell count (11%).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Geriatric Use\n<br data-v-479a2324=\"\"/></strong>Of the 564 patients with locally advanced or metastatic urothelial cancer treated with KEYTRUDA in combination with enfortumab vedotin, 44% (n=247) were 65-74 years and 26% (n=144) were 75 years or older. No overall differences in effectiveness were observed between patients 65 years of age or older and younger patients. Patients 75 years of age or older treated with KEYTRUDA in combination with enfortumab vedotin experienced a higher incidence of fatal adverse reactions than younger patients. The incidence of fatal adverse reactions was 4% in patients younger than 75 and 7% in patients 75 years or older.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nOf the 167 patients with MIBC treated with KEYTRUDA in combination with enfortumab vedotin, 37% (n=61) were 65-74 years and 46% (n=77) were 75 years or older. Patients 75 years of age or older treated with KEYTRUDA in combination with enfortumab vedotin experienced a higher incidence of fatal adverse reactions than younger patients. The incidence of fatal adverse reactions was 4% in patients younger than 75 and 12% in patients 75 years or older.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Additional Selected KEYTRUDA Indications in the U.S.\n<br data-v-479a2324=\"\"/></strong><em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">Melanoma\n<br data-v-370fea16=\"\"/></em>KEYTRUDA is indicated for the treatment of patients with unresectable or metastatic melanoma.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nKEYTRUDA is indicated for the adjuvant treatment of adult and pediatric (12 years and older) patients with Stage IIB, IIC, or III melanoma following complete resection.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">Non-Small Cell Lung Cancer\n<br data-v-370fea16=\"\"/></em>KEYTRUDA, in combination with pemetrexed and platinum chemotherapy, is indicated for the first-line treatment of patients with metastatic nonsquamous non-small cell lung cancer (NSCLC), with no EGFR or ALK genomic tumor aberrations.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nKEYTRUDA, in combination with carboplatin and either paclitaxel or paclitaxel protein-bound, is indicated for the first-line treatment of patients with metastatic squamous NSCLC.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nKEYTRUDA, as a single agent, is indicated for the first-line treatment of patients with NSCLC expressing PD-L1 [Tumor Proportion Score (TPS) ≥1%] as determined by an FDA-authorized test, with no EGFR or ALK genomic tumor aberrations, and is:\n\n</p><ul class=\"mdc-article-list mdc-article-list--unordered\" data-v-7b473e83=\"\">\n<li data-v-7b473e83=\"\">\nStage III where patients are not candidates for surgical resection or definitive chemoradiation, or\n\n</li>\n<li data-v-7b473e83=\"\">\nmetastatic.\n\n</li>\n</ul><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nKEYTRUDA, as a single agent, is indicated for the treatment of patients with metastatic NSCLC whose tumors express PD-L1 (TPS ≥1%) as determined by an FDA-authorized test, with disease progression on or after platinum-containing chemotherapy. Patients with EGFR or ALK genomic tumor aberrations should have disease progression on FDA-approved therapy for these aberrations prior to receiving KEYTRUDA.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nKEYTRUDA is indicated for the treatment of patients with resectable (tumors ≥4 cm or node positive) NSCLC in combination with platinum-containing chemotherapy as neoadjuvant treatment, and then continued as a single agent as adjuvant treatment after surgery.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nKEYTRUDA, as a single agent, is indicated as adjuvant treatment following resection and platinum-based chemotherapy for adult patients with Stage IB (T2a ≥4 cm), II, or IIIA NSCLC.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">Malignant Pleural Mesothelioma\n<br data-v-370fea16=\"\"/></em>KEYTRUDA, in combination with pemetrexed and platinum chemotherapy, is indicated for the first-line treatment of adult patients with unresectable advanced or metastatic malignant pleural mesothelioma (MPM).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">Head and Neck Squamous Cell Cancer\n<br data-v-370fea16=\"\"/></em>KEYTRUDA is indicated for the treatment of adult patients with resectable locally advanced head and neck squamous cell carcinoma (HNSCC) whose tumors express PD-L1 [Combined Positive Score (CPS) ≥1] as determined by an FDA-authorized test, as a single agent as neoadjuvant treatment, continued as adjuvant treatment in combination with radiotherapy (RT) with or without cisplatin and then as a single agent.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nKEYTRUDA, in combination with platinum and fluorouracil (FU), is indicated for the first-line treatment of patients with metastatic or with unresectable, recurrent HNSCC.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nKEYTRUDA, as a single agent, is indicated for the first-line treatment of patients with metastatic or with unresectable, recurrent HNSCC whose tumors express PD-L1 (CPS ≥1) as determined by an FDA-authorized test.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nKEYTRUDA, as a single agent, is indicated for the treatment of patients with recurrent or metastatic HNSCC with disease progression on or after platinum-containing chemotherapy.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">Classical Hodgkin Lymphoma\n<br data-v-370fea16=\"\"/></em>KEYTRUDA is indicated for the treatment of adult patients with relapsed or refractory classical Hodgkin lymphoma (cHL).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nKEYTRUDA is indicated for the treatment of pediatric patients with refractory cHL, or cHL that has relapsed after 2 or more lines of therapy.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">Primary Mediastinal Large B-Cell Lymphoma\n<br data-v-370fea16=\"\"/></em>KEYTRUDA is indicated for the treatment of adult and pediatric patients with refractory primary mediastinal large B-cell lymphoma (PMBCL), or who have relapsed after 2 or more prior lines of therapy. KEYTRUDA is not recommended for treatment of patients with PMBCL who require urgent cytoreductive therapy.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">Urothelial Cancer\n<br data-v-370fea16=\"\"/></em>KEYTRUDA, in combination with enfortumab vedotin, is indicated for the treatment of adult patients with locally advanced or metastatic urothelial cancer.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nKEYTRUDA, as a single agent, is indicated for the treatment of patients with locally advanced or metastatic urothelial carcinoma:\n\n</p><ul class=\"mdc-article-list mdc-article-list--unordered\" data-v-7b473e83=\"\">\n<li data-v-7b473e83=\"\">\nwho are not eligible for any platinum-containing chemotherapy, or\n\n</li>\n<li data-v-7b473e83=\"\">\nwho have disease progression during or following platinum-containing chemotherapy or within 12 months of neoadjuvant or adjuvant treatment with platinum-containing chemotherapy.\n\n</li>\n</ul><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nKEYTRUDA, in combination with enfortumab vedotin, as neoadjuvant treatment and then continued after cystectomy as adjuvant treatment, is indicated for the treatment of adult patients with muscle invasive bladder cancer (MIBC) who are ineligible for cisplatin-containing chemotherapy.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nKEYTRUDA, as a single agent, is indicated for the treatment of patients with Bacillus Calmette-Guerin (BCG)-unresponsive, high-risk, non-muscle invasive bladder cancer (NMIBC) with carcinoma in situ (CIS) with or without papillary tumors who are ineligible for or have elected not to undergo cystectomy.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">Microsatellite Instability-High or Mismatch Repair Deficient Cancer\n<br data-v-370fea16=\"\"/></em>KEYTRUDA is indicated for the treatment of adult and pediatric patients with unresectable or metastatic microsatellite instability-high (MSI-H) or mismatch repair deficient (dMMR) solid tumors, as determined by an FDA-authorized test, that have progressed following prior treatment and who have no satisfactory alternative treatment options.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">Microsatellite Instability-High or Mismatch Repair Deficient Colorectal Cancer\n<br data-v-370fea16=\"\"/></em>KEYTRUDA is indicated for the treatment of patients with unresectable or metastatic MSI-H or dMMR colorectal cancer (CRC) as determined by an FDA-authorized test.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">Gastric Cancer\n<br data-v-370fea16=\"\"/></em>KEYTRUDA, in combination with trastuzumab, fluoropyrimidine- and platinum-containing chemotherapy, is indicated for the first-line treatment of adults with locally advanced unresectable or metastatic HER2-positive gastric or gastroesophageal junction (GEJ) adenocarcinoma whose tumors express PD-L1 (CPS ≥1) as determined by an FDA-authorized test.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nKEYTRUDA, in combination with fluoropyrimidine- and platinum-containing chemotherapy, is indicated for the first-line treatment of adults with locally advanced unresectable or metastatic HER2-negative gastric or gastroesophageal junction (GEJ) adenocarcinoma whose tumors express PD-L1 (CPS ≥ 1) as determined by an FDA-authorized test.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">Esophageal Cancer\n<br data-v-370fea16=\"\"/></em>KEYTRUDA is indicated for the treatment of patients with locally advanced or metastatic esophageal or gastroesophageal junction (GEJ) (tumors with epicenter 1 to 5 centimeters above the GEJ) carcinoma that is not amenable to surgical resection or definitive chemoradiation either:\n\n</p><ul class=\"mdc-article-list mdc-article-list--unordered\" data-v-7b473e83=\"\">\n<li data-v-7b473e83=\"\">\nin combination with platinum- and fluoropyrimidine-based chemotherapy for patients with tumors that express PD-L1 (CPS ≥ 1), or\n\n</li>\n<li data-v-7b473e83=\"\">\nas a single agent after one or more prior lines of systemic therapy for patients with tumors of squamous cell histology that express PD-L1 (CPS ≥10) as determined by an FDA-authorized test.\n\n</li>\n</ul><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">Cervical Cancer\n<br data-v-370fea16=\"\"/></em>KEYTRUDA, in combination with chemoradiotherapy (CRT), is indicated for the treatment of patients with locally advanced cervical cancer involving the lower third of the vagina, with or without extension to pelvic sidewall, or hydronephrosis/non-functioning kidney, or spread to adjacent pelvic organs (FIGO 2014 Stage III-IVA).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nKEYTRUDA, in combination with chemotherapy, with or without bevacizumab, is indicated for the treatment of patients with persistent, recurrent, or metastatic cervical cancer whose tumors express PD-L1 (CPS ≥1) as determined by an FDA-authorized test.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nKEYTRUDA, as a single agent, is indicated for the treatment of patients with recurrent or metastatic cervical cancer with disease progression on or after chemotherapy whose tumors express PD-L1 (CPS ≥1) as determined by an FDA-authorized test.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">Hepatocellular Carcinoma\n<br data-v-370fea16=\"\"/></em>KEYTRUDA is indicated for the treatment of patients with hepatocellular carcinoma (HCC) secondary to hepatitis B who have received prior systemic therapy other than a PD-1/PD-L1-containing regimen.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">Biliary Tract Cancer\n<br data-v-370fea16=\"\"/></em>KEYTRUDA, in combination with gemcitabine and cisplatin, is indicated for the treatment of patients with locally advanced unresectable or metastatic biliary tract cancer (BTC).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">Merkel Cell Carcinoma\n<br data-v-370fea16=\"\"/></em>KEYTRUDA is indicated for the treatment of adult and pediatric patients with recurrent locally advanced or metastatic Merkel cell carcinoma (MCC).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">Renal Cell Carcinoma\n<br data-v-370fea16=\"\"/></em>KEYTRUDA, in combination with axitinib, is indicated for the first-line treatment of adult patients with advanced renal cell carcinoma (RCC).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nKEYTRUDA is indicated for the adjuvant treatment of patients with RCC at intermediate-high or high risk of recurrence following nephrectomy, or following nephrectomy and resection of metastatic lesions.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">Endometrial Carcinoma\n<br data-v-370fea16=\"\"/></em>KEYTRUDA, in combination with carboplatin and paclitaxel, followed by KEYTRUDA as a single agent, is indicated for the treatment of adult patients with primary advanced or recurrent endometrial carcinoma.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nKEYTRUDA, as a single agent, is indicated for the treatment of adult patients with advanced endometrial carcinoma that is MSI-H or dMMR, as determined by an FDA-authorized test, who have disease progression following prior systemic therapy in any setting and are not candidates for curative surgery or radiation.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">Tumor Mutational Burden-High Cancer\n<br data-v-370fea16=\"\"/></em>KEYTRUDA is indicated for the treatment of adult and pediatric patients with unresectable or metastatic tumor mutational burden-high (TMB-H) [≥10 mutations/megabase (mut/Mb)] solid tumors, as determined by an FDA-authorized test, that have progressed following prior treatment and who have no satisfactory alternative treatment options.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nThis indication is approved under accelerated approval based on tumor response rate and durability of response. Continued approval for this indication may be contingent upon verification and description of clinical benefit in the confirmatory trials. The safety and effectiveness of KEYTRUDA in pediatric patients with TMB-H central nervous system cancers have not been established.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">Cutaneous Squamous Cell Carcinoma\n<br data-v-370fea16=\"\"/></em>KEYTRUDA is indicated for the treatment of patients with recurrent or metastatic cutaneous squamous cell carcinoma (cSCC) or locally advanced cSCC that is not curable by surgery or radiation.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">Triple-Negative Breast Cancer\n<br data-v-370fea16=\"\"/></em>KEYTRUDA is indicated for the treatment of patients with high-risk early-stage triple-negative breast cancer (TNBC) in combination with chemotherapy as neoadjuvant treatment, and then continued as a single agent as adjuvant treatment after surgery.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nKEYTRUDA, in combination with chemotherapy, is indicated for the treatment of patients with locally recurrent unresectable or metastatic TNBC whose tumors express PD-L1 (CPS ≥10) as determined by an FDA-authorized test.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Merck’s focus on cancer\n<br data-v-479a2324=\"\"/></strong>Every day, we follow the science as we work to discover innovations that can help patients, no matter what stage of cancer they have. As a leading oncology company, we are pursuing research where scientific opportunity and medical need converge, underpinned by our diverse pipeline of more than 25 novel mechanisms. With one of the largest clinical development programs across more than 30 tumor types, we strive to advance breakthrough science that will shape the future of oncology. By addressing barriers to clinical trial participation, screening and treatment, we work with urgency to reduce disparities and help ensure patients have access to high-quality cancer care. Our unwavering commitment is what will bring us closer to our goal of bringing life to more patients with cancer. For more information, visit <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.merck.com%2Fresearch%2Foncology%2F&amp;esheet=54435066&amp;newsitemid=20260227462624&amp;lan=en-US&amp;anchor=www.merck.com%2Fresearch%2Foncology&amp;index=4&amp;md5=50f3f0f18c101400e297f3789179faa0\" tabindex=\"0\">www.merck.com/research/oncology</a>.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">About Merck\n<br data-v-479a2324=\"\"/></strong>At Merck, known as MSD outside of the United States and Canada, we are unified around our purpose: We use the power of leading-edge science to save and improve lives around the world. For more than 130 years, we have brought hope to humanity through the development of important medicines and vaccines. We aspire to be the premier research-intensive biopharmaceutical company in the world – and today, we are at the forefront of research to deliver innovative health solutions that advance the prevention and treatment of diseases in people and animals. We foster a diverse and inclusive global workforce and operate responsibly every day to enable a safe, sustainable and healthy future for all people and communities. For more information, visit <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.merck.com%2F&amp;esheet=54435066&amp;newsitemid=20260227462624&amp;lan=en-US&amp;anchor=www.merck.com&amp;index=5&amp;md5=6d0ba1936a699d07a10fba24bdd63ca1\" tabindex=\"0\">www.merck.com</a> and connect with us on <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fx.com%2FMerck&amp;esheet=54435066&amp;newsitemid=20260227462624&amp;lan=en-US&amp;anchor=X+%28formerly+Twitter&amp;index=6&amp;md5=b4dadbee42b06fa059704c87a5e506e6\" tabindex=\"0\">X (formerly Twitter</a>), <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.facebook.com%2FMerckInvents%2F&amp;esheet=54435066&amp;newsitemid=20260227462624&amp;lan=en-US&amp;anchor=Facebook&amp;index=7&amp;md5=bdb50ed0ac44ea80d2f3b590b0fb1b72\" tabindex=\"0\">Facebook</a>, <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.instagram.com%2Fmerck%2F&amp;esheet=54435066&amp;newsitemid=20260227462624&amp;lan=en-US&amp;anchor=Instagram&amp;index=8&amp;md5=438f88c9216a0da8abbb8a0acf7647d1\" tabindex=\"0\">Instagram</a>, <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.youtube.com%2FMerck&amp;esheet=54435066&amp;newsitemid=20260227462624&amp;lan=en-US&amp;anchor=YouTube&amp;index=9&amp;md5=6f21b63d5419c808cb26593784e3de9f\" tabindex=\"0\">YouTube</a> and <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.linkedin.com%2Fcompany%2Fmerck&amp;esheet=54435066&amp;newsitemid=20260227462624&amp;lan=en-US&amp;anchor=LinkedIn&amp;index=10&amp;md5=4d7eb51858f74632db197bd9edb72dc0\" tabindex=\"0\">LinkedIn</a>.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Forward-Looking Statement of Merck &amp; Co., Inc., Rahway, N.J., USA\n<br data-v-479a2324=\"\"/></strong>This news release of Merck &amp; Co., Inc., Rahway, N.J., USA (the “company”) includes “forward-looking statements” within the meaning of the safe harbor provisions of the U.S. Private Securities Litigation Reform Act of 1995. These statements are based upon the current beliefs and expectations of the company’s management and are subject to significant risks and uncertainties. There can be no guarantees with respect to pipeline candidates that the candidates will receive the necessary regulatory approvals or that they will prove to be commercially successful. If underlying assumptions prove inaccurate or risks or uncertainties materialize, actual results may differ materially from those set forth in the forward-looking statements.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nRisks and uncertainties include but are not limited to, general industry conditions and competition; general economic factors, including interest rate and currency exchange rate fluctuations; the impact of pharmaceutical industry regulation and health care legislation in the United States and internationally; global trends toward health care cost containment; technological advances, new products and patents attained by competitors; challenges inherent in new product development, including obtaining regulatory approval; the company’s ability to accurately predict future market conditions; manufacturing difficulties or delays; financial instability of international economies and sovereign risk; dependence on the effectiveness of the company’s patents and other protections for innovative products; and the exposure to litigation, including patent litigation, and/or regulatory actions.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nThe company undertakes no obligation to publicly update any forward-looking statement, whether as a result of new information, future events or otherwise. Additional factors that could cause results to differ materially from those described in the forward-looking statements can be found in the company’s Annual Report on Form 10-K for the year ended December 31, 2025 and the company’s other filings with the Securities and Exchange Commission (SEC) available at the SEC’s Internet site (<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.sec.gov%2F&amp;esheet=54435066&amp;newsitemid=20260227462624&amp;lan=en-US&amp;anchor=www.sec.gov&amp;index=11&amp;md5=d7cc3418d9772c7b3fd3e3d46c4147cc\" tabindex=\"0\">www.sec.gov</a>).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Please see Prescribing Information for KEYTRUDA (pembrolizumab) at </strong><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.merck.com%2Fproduct%2Fusa%2Fpi_circulars%2Fk%2Fkeytruda%2Fkeytruda_pi.pdf&amp;esheet=54435066&amp;newsitemid=20260227462624&amp;lan=en-US&amp;anchor=http%3A%2F%2Fwww.merck.com%2Fproduct%2Fusa%2Fpi_circulars%2Fk%2Fkeytruda%2Fkeytruda_pi.pdf&amp;index=12&amp;md5=6eec41b51b5f73ee14e526df9b410df3\" tabindex=\"0\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">http://www.merck.com/product/usa/pi_circulars/k/keytruda/keytruda_pi.pdf</strong></a><strong class=\"mdc-article-strong\" data-v-479a2324=\"\"> and Medication Guide for KEYTRUDA at </strong><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.merck.com%2Fproduct%2Fusa%2Fpi_circulars%2Fk%2Fkeytruda%2Fkeytruda_mg.pdf&amp;esheet=54435066&amp;newsitemid=20260227462624&amp;lan=en-US&amp;anchor=https%3A%2F%2Fwww.merck.com%2Fproduct%2Fusa%2Fpi_circulars%2Fk%2Fkeytruda%2Fkeytruda_mg.pdf&amp;index=13&amp;md5=16f3ddc059c8e878f45ab06cd40e85cf\" tabindex=\"0\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">https://www.merck.com/product/usa/pi_circulars/k/keytruda/keytruda_mg.pdf</strong></a><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">.</strong>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img\" data-v-f0ef0696=\"\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20260227462624r1&amp;sid=mstr3&amp;distro=nx&amp;lang=en\"/></picture></span><span data-v-602de5d2=\"\"></span></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nMedia Contacts:\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nJulie Cunningham\n<br data-v-602de5d2=\"\"/>(617) 519-6264\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nSofia DiMartino Bu\n<br data-v-602de5d2=\"\"/>(857) 274-4296\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nInvestor Contacts:\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nPeter Dannenbaum\n<br data-v-602de5d2=\"\"/>(732) 594-1579\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nSteven Graziano\n<br data-v-602de5d2=\"\"/>(732) 594-1583\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span data-v-602de5d2=\"\">View source version on businesswire.com: </span><span data-v-602de5d2=\"\"><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://www.businesswire.com/news/home/20260227462624/en/\" tabindex=\"0\">https://www.businesswire.com/news/home/20260227462624/en/</a></span></p></div>",
            "pub_date": "2026-02-27 23:25:55",
            "link": "https://www.morningstar.com/news/business-wire/20260227462624/keytruda-pembrolizumab-plus-paclitaxel-with-or-without-bevacizumab-significantly-improved-key-secondary-endpoint-of-overall-survival-os-versus-paclitaxel-with-or-without-bevacizumab-in-patients-with-platinum-resistant-recurrent-ovarian-cancer",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Flam Taps AdTech Veteran Noriyuki Imai to Lead Agency Partnerships in Japan as Part of Global Expansion",
            "description": "<div class=\"mdc-article-body\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Flam Taps AdTech Veteran Noriyuki Imai to Lead Agency Partnerships in Japan as Part of Global Expansion</strong>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nFlam, the deep-tech startup pioneering AI-native content, has announced the appointment of Noriyuki Imai as Head of Agency Partnerships, Japan.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nNoriyuki is a senior commercial leader with over 20 years of experience launching, scaling, and institutionalizing global AdTech, MarTech, and SaaS platforms in Japan. He has led market entry, strategic partnerships, and revenue growth for category-defining companies including LiveRamp, Yahoo! Ad Exchange, MediaMath, Sizmek, CNN International, and Zoho. Throughout his career, he has worked closely with Japan's largest advertisers, agencies, publishers, and technology partners.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nNoriyuki is known for translating globally successful products into Japan-ready offerings through deep localization, strategic go-to-market execution, and long-term partner growth.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nAt Flam, Imai will focus on expanding strategic agency relationships, building partner-led growth programs, and helping brands and agencies unlock measurable, interactive storytelling across channels and consumer touchpoints.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n“Japan represents a pivotal market for Flam, and Noriyuki's deep-rooted relationships and market expertise bring exactly the caliber of leadership this phase of growth demands,\" said Shourya Agrawal, CEO and Founder of Flam. \"His track record of building enduring partnerships rooted in cultural fluency and commercial rigor positions us to move with speed and conviction.\"\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n“I’m excited to join Flam at a moment when AI is transforming the way brands interact with consumers,” said Noriyuki Imai. “I look forward to scaling Flam’s presence in Japan and powering world class brands with Flam’s truly world class products.”\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\"><span data-v-479a2324=\"\">About Flam</span></strong>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nSan Francisco-based Flam is building the deep tech infrastructure for AI-native content for brands and enterprises, transforming passive customer touchpoints into human-like visual interactions across marketing, communication, and commerce.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fflamapp.ai%2F&amp;esheet=54435284&amp;newsitemid=20260227525398&amp;lan=en-US&amp;anchor=https%3A%2F%2Fflamapp.ai%2F&amp;index=1&amp;md5=0dae689dde531508ded3c85bfc75df2b\" tabindex=\"0\">https://flamapp.ai/</a>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img\" data-v-f0ef0696=\"\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20260227525398r1&amp;sid=mstr3&amp;distro=nx&amp;lang=en\"/></picture></span><span data-v-602de5d2=\"\"></span></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\"><span data-v-479a2324=\"\">Media Contact: \n</span></strong><br data-v-602de5d2=\"\"/>Velocitas Interactive Marketing + PR\n<br data-v-602de5d2=\"\"/><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"mailto:media@velocitas.com\" tabindex=\"0\">media@velocitas.com \n</a><br data-v-602de5d2=\"\"/>305.735.9845\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span data-v-602de5d2=\"\">View source version on businesswire.com: </span><span data-v-602de5d2=\"\"><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://www.businesswire.com/news/home/20260227525398/en/\" tabindex=\"0\">https://www.businesswire.com/news/home/20260227525398/en/</a></span></p></div>",
            "pub_date": "2026-02-27 23:25:53",
            "link": "https://www.morningstar.com/news/business-wire/20260227525398/flam-taps-adtech-veteran-noriyuki-imai-to-lead-agency-partnerships-in-japan-as-part-of-global-expansion",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "ICE Canola: China Announces Expected Tariff Move",
            "description": "<div class=\"mdc-article-body\">\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  WINNIPEG, Manitoba--Canola futures on the Intercontinental Exchange turned around to pull back on Friday morning, after posting gains in the overnight session. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  China announced that it is suspending its 100% tariff on imports of Canadian agricultural products, effective March 1. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  This is part of a trade deal Canada struck with China in January. The move includes China's levy on canola meal, while its surcharge on canola seed drops to 15%. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Crude oil was sharply higher, with the spillover underpinning the Chicago soy complex, MATIF rapeseed and Malaysian palm oil. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Ample canola supplies from Canada's record harvest and the strong likelihood of large ending stocks continued to hover on the market. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Statistics Canada is set to release its planted acre projections on Thursday. With the farmer surveys completed before the Canada-China trade deal, there may be more canola seeded for 2026/27 than anticipated. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  The March canola contract was quickly becoming less relevant as Friday marked first notice day for March futures. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  The Canadian dollar was higher on Friday morning, with the loonie at 73.20 U.S. cents compared with Thursday's close of 73.06. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Approximately 20,550 contracts had been traded by 9:38 a.m. EST and prices in Canadian dollars per metric ton were: </p>\n<pre class=\"mdc-article-pre\" data-v-370ea3ac=\"\"> \n           Price      Change \nMar       677.70     dn 2.90 \nMay       690.60     dn 2.40 \nJul       701.40     dn 2.20 \nNov       695.90     dn 2.00 \n </pre>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Source: Commodity News Service Canada, news@marketsfarm.com </p>\n<pre class=\"mdc-article-pre\" data-v-370ea3ac=\"\"></pre>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  (END) Dow Jones Newswires</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  February 27, 2026 10:01 ET (15:01 GMT)</p>\n\nCopyright (c) 2026 Dow Jones &amp; Company, Inc.</div>",
            "pub_date": "2026-02-27 23:05:59",
            "link": "https://www.morningstar.com/news/dow-jones/202602276825/ice-canola-china-announces-expected-tariff-move",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "I told my boss I need an ADHD coach and his response was unhelpful. Can we fix our working relationship?",
            "description": "<div class=\"mdc-article-body\">\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  By Aditi Shrikant </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     'I feel like I'm just in shut-down and discouraged mode' </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     \"I don't know how to deal with a boss who wants me to improve, but gets frustrated if I ask any questions.\" (Photo subjects are models.) </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Dear Dollar Signs, </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     I'm having trouble with my boss. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     My background is in partnerships and nonprofits, and I was hired for philanthropy. They thought my skills could transfer, which they can. However, my boss's feedback is always rude and discouraging. It has been challenging. There's so much jargon, and things are constantly happening. Everyone around me said, \"It's going to take you a minute to learn.\" That first year, though, I had many moments with my boss where he seemed impatient with me for not catching on quickly. He told me to ask questions if I didn't know something, but when I did, he would say, \"I feel like we talked about this.\" </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     In one instance, he asked me to do a task that wasn't in my job description. I made a mistake because I had never done something like that before and didn't realize it would be my responsibility. My boss came to me and said, \"You know you only have so many tries asking people for favors before they won't help you again. You have to come correct. Don't waste people's time.\" During our midyear review, he told me, \"I just feel like I don't know who's going to show up. I hired this really cool rock star, and I don't feel like that person is here.\" </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n      'I suggested we get an ADHD coach, and he said we don't have the budget.' </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Last year, when I told him that I have ADHD and anxiety, his first response was to tell me that the biggest things he wants me to focus on are long-term strategy and attention to detail. How comical is that response when someone is literally telling you that those are the two areas they struggle with? He clearly didn't care. I suggested we get an ADHD coach, and he said we don't have the budget. (I can hold myself accountable. I did start dating a guy who was a narcissist, and my world shifted a bit, which temporarily turned my priorities upside down. I was distracted.) </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     But it feels like my boss doesn't actually want to manage. He just wants to be called a manager. He doesn't want to deal with anything - he just asks if this is done or that is done. I haven't been put on a performance improvement plan or anything formal, but I don't know how to deal with a boss who wants me to improve, but gets frustrated if I ask any questions. I feel like I'm just stuck in shut-down and discouraged mode. How do I approach this and express my concerns without adding to the problems? </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Down &amp; Defeated </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     If you're just starting out on your money or career journey and have questions about how to navigate your finances, we want to hear from you. Write to Dollar Signs, MarketWatch's new advice column, at dollarsigns@marketwatch.com. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Dear Defeated, </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     There is quite a bit going on here. Your boss is expressing his frustration in a way that wouldn't encourage anyone to work harder and could even impair your performance. At the same time, it sounds like you recognize that perhaps you haven't been performing as well as you could. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     But the biggest problem is that you two are simply not communicating effectively. Not all bosses are going to be good communicators, even if you think it's part of the job (and you would be correct in that assumption). \"You only have so many tries\" suggests his attempts to help could backfire; that language is inflammatory and shaming at worst and unhelpful at best. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     \"This is clearly an example of an interpersonal dynamic that has gone off the rails,\" says Tessa West, a psychology professor at New York University and author of the book \"Jerks at Work: Toxic Coworkers and What to Do About Them.\" </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Good feedback is specific, actionable, and clearly stated. Telling you that you often don't show up as the \"rock star\" he hired isn't helping anyone. You may be digging a dry well by telling him you have ADHD and anxiety and asking for an ADHD coach. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     \"A lot of people have a tendency to divulge that health information in order to explain themselves, and we need to push that aside,\" West says. \"We should not be talking about those types of things with our bosses.\" </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     I would suggest a middle ground. If it helps you, let him know where you need support and how he can help you (give you goals, for example, and/or a more rigid schedule). Disclosing mental health issues to a boss or HR is generally legally protected under the Americans with Disabilities Act. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     It feels like you two are talking past one another. At this point, you just don't like each other, which makes communication feel even more caustic. To move forward, you need to have an honest conversation about his expectations of you and your work and about how you can better communicate. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     You can differentiate between (1.) goals that you need to hit and (2.) responsibilities that you are expected to meet without necessarily checking in with your boss: \"I want to find the line between circling back, asking qualifying questions, and, as you say, going over old material.\" </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     How to Repair Your Relationship </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     One remedy is to make \"repair attempts.\" This term, coined by clinical psychologists and relationship researchers John Gottman and Julie Gottman, refers to a simple bid for a positive connection - a small interaction that reminds you both that you see each other as people, not enemies. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     This technique is often used in romantic relationships, but it can be effective in the workplace, too. With your boss, a repair could be as simple as grabbing him a coffee on your way in or asking about his weekend. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     It's critical that you feel empowered and see the difference between improved communication and unclear expectations or inconsistent feedback from your boss. You may have to \"manage up\" if your boss is lacking key communication skills. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     When every interaction you have is about your performance and his guidance (or lack thereof), it's easy for tension to persist. Making an effort to build some rapport outside of work might improve how you interact about your role. After all, a manager affects your emotional state as much as a partner, according to a 2023 UKG study. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Next, you both need to sit down and have a candid conversation about what exactly he expects from you. Just because he seems annoyed when you ask questions doesn't mean you should stop; you just need to be more discerning about which issues you bring to him. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     One solution, which may not need to be permanent, is to make a list of your tasks and achievements for the week, send it to him via email, and have weekly check-ins. This could help clear communication gaps and bring you reassurance. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     \"Don't argue about personality or management style or who is right and who is wrong,\" West says. \"What matters is that she knows how to do her job, they agree on what that job is, and they both have what they need to get there.\" </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     You should also get clarification about which tasks he expects you to have mastered and which tasks he doesn't mind assisting you with or answering questions about. Be honest about your limitations, because if you don't know how to do something, it will be evident in your work. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     It would also serve you well not to assume that he is trying to be mean or discouraging. When we assign deeper intentions to a person's actions, we might unnecessarily hurt our own feelings. He might simply be a poor communicator. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Lastly - and this might be the hardest part - you need patience. You're not going to mend this relationship in a week or even a month. It will take time for you two to learn to trust each other. If your communication improves, there is every reason to believe your relationship will, too.improves, there is every reason to believe your relationship will, too. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Write to Dollar Signs at dollarsigns@marketwatch.com. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     By submitting your story to Dow Jones &amp; Co., the publisher of MarketWatch, you understand and agree that we may use your story, or versions of it, in all media and platforms. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     -Aditi Shrikant </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     This content was created by MarketWatch, which is operated by Dow Jones &amp; Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal. </p>\n<pre class=\"mdc-article-pre\" data-v-370ea3ac=\"\"></pre>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  (END) Dow Jones Newswires</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  02-27-26 1003ET</p>\n\nCopyright (c) 2026 Dow Jones &amp; Company, Inc.</div>",
            "pub_date": "2026-02-27 23:05:57",
            "link": "https://www.morningstar.com/news/marketwatch/20260227175/i-told-my-boss-i-need-an-adhd-coach-and-his-response-was-unhelpful-can-we-fix-our-working-relationship",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Eli Lilly, Incyte Get CHMP Backing for Olumiant in Adolescents With Severe Alopecia Areata",
            "description": "<div class=\"mdc-article-body\">\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  By Colin Kellaher </p>\n<pre class=\"mdc-article-pre\" data-v-370ea3ac=\"\"></pre>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Eli Lilly and Incyte said a key European regulatory committee has recommended expanded approval of their Olumiant drug for adolescents with severe alopecia areata. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  The companies on Friday said the recommendation from the European Medicines Agency's Committee for Medicinal Products for Human Use covers the use of Olumiant in patients 12 and older with the autoimmune disease that causes sudden hair loss. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  The European Commission, which generally follows the CHMP's advice, is expected to make a final decision in one to two months, the companies said. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Olumiant is already approved in Europe for people 18 and older with severe alopecia areata. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Indianapolis-based Eli Lilly in 2009 signed an agreement with Incyte, a Wilmington, Del., biopharmaceutical company, to develop and commercialize Olumiant for inflammatory and autoimmune diseases. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  In addition to severe alopecia areata, Olumiant is approved in dozens of countries around the world for use in rheumatoid arthritis and atopic dermatitis. </p>\n<pre class=\"mdc-article-pre\" data-v-370ea3ac=\"\"></pre>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Write to Colin Kellaher at colin.kellaher@wsj.com </p>\n<pre class=\"mdc-article-pre\" data-v-370ea3ac=\"\"></pre>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  (END) Dow Jones Newswires</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  February 27, 2026 09:38 ET (14:38 GMT)</p>\n\nCopyright (c) 2026 Dow Jones &amp; Company, Inc.</div>",
            "pub_date": "2026-02-27 22:46:04",
            "link": "https://www.morningstar.com/news/dow-jones/202602276604/eli-lilly-incyte-get-chmp-backing-for-olumiant-in-adolescents-with-severe-alopecia-areata",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Hunt Military Communities Announces $3.65 Million Capital Improvement Investment at Robins Air Force Base",
            "description": "<div class=\"mdc-article-body\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Hunt Military Communities Announces $3.65 Million Capital Improvement Investment at Robins Air Force Base</strong>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nHunt Military Communities (HMC) announced today the execution of a $3.65 million capital improvement project at Robins Air Force Base, reinforcing the company’s systematic reinvestment strategy focused on housing quality, reliability, and long-term readiness.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nThe investment targets critical infrastructure upgrades in the Turner Park and Crestview neighborhoods and reflects the Air Force’s and HMC’s<em class=\"mdc-article-emphasis\" data-v-370fea16=\"\"></em>continued commitment to proactive capital planning and responsible asset stewardship.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Planned Improvements</strong>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nThe project includes high-impact infrastructure upgrades designed to modernize aging building systems and improve sustained durability, including:\n\n</p><ul class=\"mdc-article-list mdc-article-list--unordered\" data-v-7b473e83=\"\">\n<li data-v-7b473e83=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Roof replacements on 76 residential structures in Turner Park</strong>, the majority of which are duplexes\n\n</li>\n<li data-v-7b473e83=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Replacement of metal fascia trim</strong> in conjunction with roofing work, providing more durable, weather-resistant materials\n\n</li>\n<li data-v-7b473e83=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Installation of 173 new HVAC systems</strong> across the Turner Park and Crestview neighborhoods, including new indoor and outdoor heat pump units and thermostats\n\n</li>\n<li data-v-7b473e83=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Full duct cleaning</strong> for all homes receiving HVAC upgrades to improve ongoing system performance\n\n</li>\n</ul><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n“These improvements focus on the fundamentals of reliable housing, including roofs, HVAC systems, and building exteriors, where reinvestment has the greatest long-term impact,” said Brian Stann, CEO &amp; President of Hunt Military Communities. “By reinvesting available resources into targeted, high-impact projects like this one, we’re helping ensure housing at Robins Air Force Base remains reliable, resilient, and mission-ready well into the future.”\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nConstruction is expected to begin within the next month and be completed later this year.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nThis new investment builds on more than $735,000 committed in 2025, which included tankless water-heater upgrades in 47 homes, full window replacements in 20 Forest Park homes, a new community playground, community-wide tree maintenance, and 100% preventive maintenance completed across all Robins Family Housing properties.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">About Hunt Military Communities</strong>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nHunt Military Communities (HMC), the largest military housing owner, offers unsurpassed quality and service to approximately 175,000 residents in more than 60,000 homes across the United States on Navy, Air Force, Marine Corps, Army, and Space Force installations. Hunt does this through its company pillars: excellence, customer commitment, accountability, integrity, and continuous improvement. With a 50-year legacy and a partnership with the Department of Defense, HMC strives to ensure the integrity of our military communities and the families who live there. For more information, visit <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.huntmilitarycommunities.com%2F&amp;esheet=54434976&amp;newsitemid=20260226408707&amp;lan=en-US&amp;anchor=www.huntmilitarycommunities.com&amp;index=1&amp;md5=ec761c90d1cce8f21cbb6b31c1e6aaca\" tabindex=\"0\">www.huntmilitarycommunities.com</a>.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img\" data-v-f0ef0696=\"\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20260226408707r1&amp;sid=mstr3&amp;distro=nx&amp;lang=en\"/></picture></span><span data-v-602de5d2=\"\"></span></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">For media inquiries, please contact:</em>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nCarolyn Baker\n<br data-v-602de5d2=\"\"/>SVP Corporate Communications\n<br data-v-602de5d2=\"\"/>Hunt Companies\n<br data-v-602de5d2=\"\"/><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"mailto:Carolyn.baker@huntcompanies.com\" tabindex=\"0\">Carolyn.baker@huntcompanies.com \n</a><br data-v-602de5d2=\"\"/>856/298-2036\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span data-v-602de5d2=\"\">View source version on businesswire.com: </span><span data-v-602de5d2=\"\"><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://www.businesswire.com/news/home/20260226408707/en/\" tabindex=\"0\">https://www.businesswire.com/news/home/20260226408707/en/</a></span></p></div>",
            "pub_date": "2026-02-27 22:46:03",
            "link": "https://www.morningstar.com/news/business-wire/20260226408707/hunt-military-communities-announces-365-million-capital-improvement-investment-at-robins-air-force-base",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Global Dredging Market Outlook 2026-2036: Infrastructure & Coastal Resilience Drive 2.1% CAGR",
            "description": "<div class=\"mdc-article-body\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><em class=\"mdc-article-emphasis\" data-v-370fea16=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Port Modernization, Coastal Protection, and Climate-Resilient Infrastructure Sustain Long-Term Global Demand</strong></em></p> <p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">NEWARK, DE / <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://www.accessnewswire.com/\" tabindex=\"0\">ACCESS Newswire</a> / February 27, 2026 / </strong>The global dredging market is entering a decade of measured, infrastructure-led expansion as governments and port authorities intensify investments in maritime trade corridors, coastal resilience, and inland waterway modernization. Valued at <strong class=\"mdc-article-strong\" data-v-479a2324=\"\">USD 17.3 billion in 2026</strong>, the market is forecast to reach <strong class=\"mdc-article-strong\" data-v-479a2324=\"\">USD 21.3 billion by 2036</strong>, progressing at a compound annual growth rate (CAGR) of <strong class=\"mdc-article-strong\" data-v-479a2324=\"\">2.1%</strong>.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Dredging remains a foundational pillar of global infrastructure-supporting port deepening, shoreline stabilization, flood mitigation, and environmental remediation. As vessel sizes increase and trade volumes rebound across major economies, maintaining navigable waterways has become a strategic priority rather than a routine maintenance task.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Get Access of Report Sample: </strong><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://pr.report/j47r\" tabindex=\"0\">https://www.futuremarketinsights.com/reports/sample/rep-gb-4821</a></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Market Snapshot (2026-2036)</strong></p><table class=\"mdc-article-table mds-data-table mds-data-table--large\" data-v-0db7e951=\"\"><thead class=\"mdc-article-table-header mds-data-table__header\"><tr class=\"mdc-article-table-row mds-data-table__row\"><th class=\"mdc-article-table-head mds-data-table__header-cell\"><div class=\"mds-data-table__header-cell-inner\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Metric</strong></p></div></th><th class=\"mdc-article-table-head mds-data-table__header-cell\"><div class=\"mds-data-table__header-cell-inner\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Value</strong></p></div></th></tr></thead><tbody class=\"mdc-article-table-body mds-data-table__body\"><tr class=\"mdc-article-table-row mds-data-table__row\"><td class=\"mdc-article-table-cell mds-data-table__cell\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Market Value (2026)</p></td><td class=\"mdc-article-table-cell mds-data-table__cell\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">USD 17.3 Billion</p></td></tr><tr class=\"mdc-article-table-row mds-data-table__row\"><td class=\"mdc-article-table-cell mds-data-table__cell\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Forecast Value (2036)</p></td><td class=\"mdc-article-table-cell mds-data-table__cell\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">USD 21.3 Billion</p></td></tr><tr class=\"mdc-article-table-row mds-data-table__row\"><td class=\"mdc-article-table-cell mds-data-table__cell\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Projected CAGR</p></td><td class=\"mdc-article-table-cell mds-data-table__cell\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">2.1%</p></td></tr><tr class=\"mdc-article-table-row mds-data-table__row\"><td class=\"mdc-article-table-cell mds-data-table__cell\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Leading Customer Segment</p></td><td class=\"mdc-article-table-cell mds-data-table__cell\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Government (46% Share)</p></td></tr><tr class=\"mdc-article-table-row mds-data-table__row\"><td class=\"mdc-article-table-cell mds-data-table__cell\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Leading Application</p></td><td class=\"mdc-article-table-cell mds-data-table__cell\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Trade Maintenance (31% Share)</p></td></tr><tr class=\"mdc-article-table-row mds-data-table__row\"><td class=\"mdc-article-table-cell mds-data-table__cell\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Fastest Growing Region</p></td><td class=\"mdc-article-table-cell mds-data-table__cell\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Japan</p></td></tr></tbody></table><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Growth Forecast: Stable Expansion with Low Volatility</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">A peak-to-trough analysis indicates consistent and gradual expansion over the forecast period.</p><ul class=\"mdc-article-list mdc-article-list--unordered\" data-v-7b473e83=\"\"><li data-v-7b473e83=\"\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">2026-2031:</strong> Market rises from USD 17.3 billion to USD 19.6 billion</p></li><li data-v-7b473e83=\"\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">2031-2036:</strong> Market grows further to USD 21.3 billion</p></li></ul><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Growth remains steady, driven primarily by long-term port modernization projects and regular maintenance dredging activities. Unlike cyclical construction sectors, dredging benefits from recurring operational demand due to natural sedimentation processes that continuously reduce channel depths.</p><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://app.accessnewswire.com/imagelibrary/51d16e5a-e410-4002-991f-c981ee05d827/dredging-market-accesswire.jpg\" tabindex=\"0\"><span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img\" data-v-f0ef0696=\"\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://app.accessnewswire.com/imagelibrary/51d16e5a-e410-4002-991f-c981ee05d827/1142175/dredging-market-accesswire.jpg\"/></picture></span></a><span> </span><span> </span><span> </span><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">What Is Driving Demand?</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">1. Expansion of Maritime Trade Infrastructure</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Global shipping networks are adapting to larger vessels requiring deeper drafts and expanded berths. Continuous dredging ensures operational efficiency in major logistics hubs.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">2. Government-Led Infrastructure Investment</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Government entities account for <strong class=\"mdc-article-strong\" data-v-479a2324=\"\">46% of total demand</strong>, reflecting their responsibility for:</p><ul class=\"mdc-article-list mdc-article-list--unordered\" data-v-7b473e83=\"\"><li data-v-7b473e83=\"\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Port expansion and modernization</p></li><li data-v-7b473e83=\"\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Inland waterway development</p></li><li data-v-7b473e83=\"\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Flood defense systems</p></li><li data-v-7b473e83=\"\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Coastal erosion management</p></li><li data-v-7b473e83=\"\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Environmental restoration initiatives</p></li></ul><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">3. Climate Resilience &amp; Coastal Protection</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Rising sea levels and increased storm intensity are pushing nations to strengthen shoreline defenses, increasing demand for protective dredging projects.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">4. Environmental Remediation</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Growing regulatory emphasis on water quality has elevated demand for sediment removal and ecosystem restoration.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Leading Market Segments</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">By Customer Type</strong></p><ul class=\"mdc-article-list mdc-article-list--unordered\" data-v-7b473e83=\"\"><li data-v-7b473e83=\"\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Government - 46% Share (Dominant Segment)</strong></p></li><li data-v-7b473e83=\"\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">O&amp;G Companies</p></li><li data-v-7b473e83=\"\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Mining Companies</p></li><li data-v-7b473e83=\"\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Renewable Energy Companies</p></li><li data-v-7b473e83=\"\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Others</p></li></ul><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Governments remain the largest buyers due to ongoing public works and coastal management responsibilities.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">By Application</strong></p><ul class=\"mdc-article-list mdc-article-list--unordered\" data-v-7b473e83=\"\"><li data-v-7b473e83=\"\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Trade Maintenance - 31% Share (Leading Segment)</strong></p></li><li data-v-7b473e83=\"\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Trade Activity Expansion</p></li><li data-v-7b473e83=\"\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Energy Infrastructure</p></li><li data-v-7b473e83=\"\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Urban Development</p></li><li data-v-7b473e83=\"\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Coastal Protection</p></li><li data-v-7b473e83=\"\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Leisure &amp; Others</p></li></ul><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Trade maintenance leads as ports must remain operational regardless of broader economic cycles.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Regional Outlook: Asia Gains Momentum</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Japan - 5.7% CAGR</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Japan emerges as the fastest-growing market. As an island economy reliant on maritime trade, Japan prioritizes navigational channel maintenance, port modernization, and flood prevention infrastructure.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">China - 5.1% CAGR</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">China's position as the world's largest trading nation fuels port deepening and land reclamation activities. Ongoing coastal urbanization further strengthens demand.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">India - 4.4% CAGR</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">India's long coastline and maritime expansion initiatives, including inland waterway upgrades, are supporting steady dredging investments.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Germany - 3.8% CAGR</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Germany continues to invest in maintaining North Sea and Baltic Sea port competitiveness while strengthening flood protection systems.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">France - 2.1% CAGR</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">France sees moderate but stable demand, driven by ongoing port modernization and environmental compliance initiatives.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Key Market Dynamics</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Primary Growth Drivers</strong></p><ul class=\"mdc-article-list mdc-article-list--unordered\" data-v-7b473e83=\"\"><li data-v-7b473e83=\"\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Port expansion to accommodate mega vessels</p></li><li data-v-7b473e83=\"\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Inland waterway modernization</p></li><li data-v-7b473e83=\"\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Offshore energy and seabed preparation</p></li><li data-v-7b473e83=\"\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Climate resilience infrastructure</p></li><li data-v-7b473e83=\"\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Government infrastructure funding</p></li></ul><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Market Restraints</strong></p><ul class=\"mdc-article-list mdc-article-list--unordered\" data-v-7b473e83=\"\"><li data-v-7b473e83=\"\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Lengthy environmental permitting processes</p></li><li data-v-7b473e83=\"\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Sediment disposal regulations</p></li><li data-v-7b473e83=\"\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">High capital investment in advanced dredging vessels</p></li><li data-v-7b473e83=\"\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Skilled labor shortages</p></li></ul><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Emerging Trends</strong></p><ul class=\"mdc-article-list mdc-article-list--unordered\" data-v-7b473e83=\"\"><li data-v-7b473e83=\"\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Precision dredging technologies using sonar mapping</p></li><li data-v-7b473e83=\"\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">GPS-enabled automation systems</p></li><li data-v-7b473e83=\"\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Beneficial reuse of dredged materials</p></li><li data-v-7b473e83=\"\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Low-emission and hybrid dredging fleets</p></li><li data-v-7b473e83=\"\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Integrated coastal zone management strategies</p></li></ul><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Competitive Landscape: Specialized Expertise Defines Leaders</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">The dredging market remains highly specialized, with technical expertise and fleet capability forming key competitive differentiators.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Major Industry Participants</strong></p><ul class=\"mdc-article-list mdc-article-list--unordered\" data-v-7b473e83=\"\"><li data-v-7b473e83=\"\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Dredging, Environmental and Marine Engineering NV (DEME)</strong></p></li><li data-v-7b473e83=\"\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">HYUNDAI E&amp;C</strong></p></li><li data-v-7b473e83=\"\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Great Lakes Dredge &amp; Dock Company, LLC</strong></p></li><li data-v-7b473e83=\"\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">TOA Corporation</strong></p></li><li data-v-7b473e83=\"\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Penta-Ocean Construction Co., Ltd.</strong></p></li><li data-v-7b473e83=\"\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">National Marine Company</strong></p></li><li data-v-7b473e83=\"\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">CALLAN MARINE, LTD.</strong></p></li><li data-v-7b473e83=\"\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">CASHMAN DREDGING, INC.</strong></p></li><li data-v-7b473e83=\"\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">COTTRELL CONTRACTING CORPORATION</strong></p></li><li data-v-7b473e83=\"\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">J.F. Brennan Company, Inc.</strong></p></li></ul><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Market leaders compete through:</p><ul class=\"mdc-article-list mdc-article-list--unordered\" data-v-7b473e83=\"\"><li data-v-7b473e83=\"\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Advanced fleet modernization</p></li><li data-v-7b473e83=\"\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Environmentally responsible dredging techniques</p></li><li data-v-7b473e83=\"\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Turnkey project delivery models</p></li><li data-v-7b473e83=\"\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Regulatory navigation expertise</p></li><li data-v-7b473e83=\"\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Cost optimization through operational efficiency</p></li></ul><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Strategic Outlook: Essential Infrastructure, Predictable Growth</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Unlike high-volatility construction segments, dredging remains a mission-critical service industry tied to global trade continuity and climate adaptation strategies. Natural sedimentation ensures recurring maintenance demand, while long-term infrastructure planning provides multi-year project visibility.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">As governments balance economic competitiveness with environmental sustainability, companies capable of delivering precision dredging solutions within strict regulatory frameworks will secure long-term contracts.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">By 2036, dredging will remain an indispensable enabler of maritime trade, coastal protection, and resilient infrastructure-solidifying its role as a stable yet strategically vital component of global infrastructure development.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">For an in-depth analysis of evolving formulation trends and to access the complete strategic outlook for the Dredging Market through 2036, Full Report Request: </strong><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://pr.report/j47s\" tabindex=\"0\">https://www.futuremarketinsights.com/reports/dredging-market</a></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Related Reports:</p><ul class=\"mdc-article-list mdc-article-list--unordered\" data-v-7b473e83=\"\"><li data-v-7b473e83=\"\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Dredging Equipment Market- <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://pr.report/j47t\" tabindex=\"0\">https://www.futuremarketinsights.com/reports/dredging-equipment-market</a></p></li><li data-v-7b473e83=\"\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Laser Vibrometer Market- <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://pr.report/j47u\" tabindex=\"0\">https://www.futuremarketinsights.com/reports/laser-vibrometer-market</a></p></li><li data-v-7b473e83=\"\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Fiberglass Centrifugal Fan Market- <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://pr.report/j47v\" tabindex=\"0\">https://www.futuremarketinsights.com/reports/fiberglass-centrifugal-fan-market</a></p></li></ul><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">About Future Market Insights (FMI)</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Future Market Insights (FMI) is a leading provider of market intelligence and consulting services, serving clients in over 150 countries. Headquartered in Delaware, USA, with a global delivery center in India and offices in the UK and UAE, FMI delivers actionable insights to businesses across industries including automotive, technology, consumer products, manufacturing, energy, and chemicals.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">An ESOMAR-certified research organization, FMI provides custom and syndicated market reports and consulting services, supporting both Fortune 1,000 companies and SMEs. Its team of 300+ experienced analysts ensures credible, data-driven insights to help clients navigate global markets and identify growth opportunities.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">For Press &amp; Corporate Inquiries:</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Rahul Singh</strong><br data-v-602de5d2=\"\"/><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">AVP - Marketing and Growth Strategy</strong><br data-v-602de5d2=\"\"/><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Future Market Insights, Inc.</strong><br data-v-602de5d2=\"\"/>+91 8600020075</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">For Sales - <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"mailto:sales@futuremarketinsights.com\" tabindex=\"0\">sales@futuremarketinsights.com</a><br data-v-602de5d2=\"\"/>For Media - <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"mailto:Rahul.singh@futuremarketinsights.com\" tabindex=\"0\">Rahul.singh@futuremarketinsights.com</a><br data-v-602de5d2=\"\"/>For web - <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://pr.report/j47w\" tabindex=\"0\">https://www.futuremarketinsights.com/</a></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">SOURCE:</strong> Future Market Insights, Inc.</p><br/><br/>View the original <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://www.accessnewswire.com/newsroom/en/business-and-professional-services/global-dredging-market-outlook-2026-2036-infrastructure-and-coas-1142175\" tabindex=\"0\">press release</a> on ACCESS Newswire<br/><br/>\n<span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img mdc-article-image__img--0-width\" data-v-f0ef0696=\"\" style=\"width:0;\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://app.accessnewswire.com/img.ashx?id=1142175\"/></picture></span></div>",
            "pub_date": "2026-02-27 22:30:52",
            "link": "https://www.morningstar.com/news/accesswire/1142175msn/global-dredging-market-outlook-2026-2036-infrastructure-coastal-resilience-drive-21-cagr",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "SMR SHAREHOLDER ACTION REMINDER: Faruqi & Faruqi, LLP Reminds Nuscale (SMR) Investors of Securities Class Action Deadline on April 20, 2026",
            "description": "<div class=\"mdc-article-body\">\n            \n              \n              SMR SHAREHOLDER ACTION REMINDER: Faruqi &amp; Faruqi, LLP Reminds Nuscale (SMR) Investors of Securities Class Action Deadline on April 20, 2026\n              \n            \n            \n              <span>\n<h2 class=\"mdc-article-heading mdc-heading__mdc mdc-heading--level-5__mdc\" data-v-618d53ae=\"\">SMR SHAREHOLDER ACTION REMINDER: Faruqi &amp; Faruqi, LLP Reminds Nuscale (SMR) Investors of Securities Class Action Deadline on April 20, 2026</h2>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">PR Newswire</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">NEW YORK, Feb. 27, 2026</p>\n</span>\n<span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Faruqi &amp; Faruqi, LLP Securities Litigation Partner <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4628503-1&amp;h=3072820841&amp;u=https%3A%2F%2Fwww.faruqilaw.com%2Fattorney%2F22%2Fjames-m-wilson-jr&amp;a=James+(Josh)+Wilson\" tabindex=\"0\">James (Josh) Wilson</a> Encourages Investors Who Suffered Losses In Nuscale To Contact Him Directly To Discuss Their Options</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">If you purchased or acquired securities in <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4628503-1&amp;h=2887704267&amp;u=https%3A%2F%2Fwww.faruqilaw.com%2FSMR&amp;a=Nuscale\" tabindex=\"0\">Nuscale</a> between May 13, 2025 and November 6, 2025 </strong>and would like to discuss your legal rights, call Faruqi &amp; Faruqi partner <strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Josh Wilson directly </strong>at <strong class=\"mdc-article-strong\" data-v-479a2324=\"\">877-247-4292 </strong>or <strong class=\"mdc-article-strong\" data-v-479a2324=\"\">212-983-9330</strong><strong class=\"mdc-article-strong\" data-v-479a2324=\"\"> (Ext. 1310)</strong>.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\"><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4628503-1&amp;h=2245729806&amp;u=https%3A%2F%2Fwww.faruqilaw.com%2FSMR&amp;a=%5BYou+may+also+click+here+for+additional+information%5D\" tabindex=\"0\">[You may also click here for additional information]</a></strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span data-v-602de5d2=\"\">NEW YORK</span>, <span data-v-602de5d2=\"\">Feb. 27, 2026</span> /PRNewswire/ -- <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4628503-1&amp;h=1478987515&amp;u=https%3A%2F%2Fwww.faruqilaw.com%2F&amp;a=Faruqi+%26+Faruqi%2C+LLP\" tabindex=\"0\">Faruqi &amp; Faruqi, LLP</a>, a leading national securities law firm, is investigating potential claims against NuScale Power Corporation (\"Nuscale\" or the \"Company\") (NYSE: SMR) and reminds investors of the <strong class=\"mdc-article-strong\" data-v-479a2324=\"\">April 20, 2026 deadline</strong> to seek the role of lead plaintiff in a federal securities class action that has been filed against the Company.</p>\n<span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://mma.prnewswire.com/media/2745617/Faruqi__Faruqi_LLP_James_Josh_Wilson.html\" tabindex=\"0\">\n<span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img\" data-v-f0ef0696=\"\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://mma.prnewswire.com/media/2745617/Faruqi__Faruqi_LLP_James_Josh_Wilson.jpg\"/></picture></span>\n</a>\n</p>\n</span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Faruqi &amp; Faruqi is a leading national securities law firm with offices in New York, Pennsylvania, California and Georgia. The firm has recovered hundreds of millions of dollars for investors since its founding in 1995. See <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4628503-1&amp;h=1185751283&amp;u=https%3A%2F%2Fwww.faruqilaw.com%2F&amp;a=www.faruqilaw.com\" tabindex=\"0\">www.faruqilaw.com</a>.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">As detailed below, the complaint <span data-v-602de5d2=\"\">alleges</span> that the Company and its executives violated federal securities laws by making false and/or misleading statements and/or failing to disclose that: (i) ENTRA1 had never built, financed, or operated any significant projects – let alone projects in the highly technical and complicated field of nuclear power generation – during its entire operating history; (ii) NuScale had entrusted its commercialization, distribution, and deployment of its NPMs and hundreds of millions of dollars of NuScale capital to an entity that lacked any significant prior experience owning, financing, or operating nuclear energy generation facilities; (iii) the purported experience and qualifications attributed to ENTRA1 by defendants during the Class Period in fact referred to the purported experience and qualifications of the principals of the Habboush Group, a distinct entity without significant experience in the field of nuclear power generation; and (iv) as a result, NuScale's commercialization strategy was exposed to material, undisclosed risks of failure, delays, regulatory challenges, or other negative setbacks.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">On November 6, 2025, NuScale surprised investors by revealing that the Company's general and administrative expenses had ballooned more than 3,000% to $519 million during its third fiscal quarter, up from $17 million in the prior year period, due largely to NuScale's payment of $495 million to ENTRA1 for its TVA agreement. As a result, NuScale's quarterly net loss skyrocketed to $532 million, up from $46 million in the prior year period.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">On this news, the price of NuScale Class A shares declined more than 12% over a two-day trading period, from approximately $32 per share on November 6, 2025 to approximately $28 per share on November 10, 2025. The price of NuScale Class A stock continued to fall in subsequent days, dropping to a low of just $17 per share by November 21, 2025 – more than 70% below the class period high of more than $57 per share.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">The court-appointed lead plaintiff is the investor with the largest financial interest in the relief sought by the class who is adequate and typical of class members who directs and oversees the litigation on behalf of the putative class. Any member of the putative class may move the Court to serve as lead plaintiff through counsel of their choice, or may choose to do nothing and remain an absent class member. Your ability to share in any recovery is not affected by the decision to serve as a lead plaintiff or not. </p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Faruqi &amp; Faruqi, LLP also encourages anyone with information regarding Nuscale's conduct to contact the firm, including whistleblowers, former employees, shareholders and others.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">To learn more about the <strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Nuscale</strong> class action, go to <strong class=\"mdc-article-strong\" data-v-479a2324=\"\"><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4628503-1&amp;h=2057098132&amp;u=https%3A%2F%2Fwww.faruqilaw.com%2FSMR&amp;a=www.faruqilaw.com%2FSMR\" tabindex=\"0\">www.faruqilaw.com/SMR</a></strong> or <strong class=\"mdc-article-strong\" data-v-479a2324=\"\">call</strong> Faruqi &amp; Faruqi partner <strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Josh Wilson directly </strong>at <strong class=\"mdc-article-strong\" data-v-479a2324=\"\">877-247-4292 </strong>or <strong class=\"mdc-article-strong\" data-v-479a2324=\"\">212-983-9330</strong><strong class=\"mdc-article-strong\" data-v-479a2324=\"\"> (Ext. 1310)</strong>.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Follow us for updates on <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4628503-1&amp;h=1296183528&amp;u=https%3A%2F%2Fwww.linkedin.com%2Fcompany%2Ffaruqi-%26-faruqi-llp%2F&amp;a=LinkedIn\" tabindex=\"0\">LinkedIn</a>, on <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4628503-1&amp;h=890004952&amp;u=https%3A%2F%2Fx.com%2Ffaruqilaw&amp;a=X\" tabindex=\"0\">X</a>, or on <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4628503-1&amp;h=2267470213&amp;u=https%3A%2F%2Fwww.facebook.com%2FFaruqiLaw%2F&amp;a=Facebook\" tabindex=\"0\">Facebook</a>.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Attorney Advertising. The law firm responsible for this advertisement is Faruqi &amp; Faruqi, LLP (<span>www.faruqilaw.com</span>). Prior results do not guarantee or predict a similar outcome with respect to any future matter. We welcome the opportunity to discuss your particular case. All communications will be treated in a confidential manner.</p>\n<span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://mma.prnewswire.com/media/2457438/Faruqi_Logo.html\" tabindex=\"0\">\n<span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img\" data-v-f0ef0696=\"\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://mma.prnewswire.com/media/2457438/Faruqi_Logo.jpg\"/></picture></span>\n</a>\n</p>\n</span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img mdc-article-image__img--12-width\" data-v-f0ef0696=\"\" style=\"width:12px;\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://edge.prnewswire.com/c/img/favicon.png?sn=NY96939&amp;sd=2026-02-27\"/></picture></span> View original content to download multimedia:<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://www.prnewswire.com/news-releases/smr-shareholder-action-reminder-faruqi--faruqi-llp-reminds-nuscale-smr-investors-of-securities-class-action-deadline-on-april-20-2026-302699378.html\" tabindex=\"0\">https://www.prnewswire.com/news-releases/smr-shareholder-action-reminder-faruqi--faruqi-llp-reminds-nuscale-smr-investors-of-securities-class-action-deadline-on-april-20-2026-302699378.html</a></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">SOURCE Faruqi &amp; Faruqi, LLP</p></span>\n</div>",
            "pub_date": "2026-02-27 22:30:50",
            "link": "https://www.morningstar.com/news/pr-newswire/20260227ny96939/smr-shareholder-action-reminder-faruqi-faruqi-llp-reminds-nuscale-smr-investors-of-securities-class-action-deadline-on-april-20-2026",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Canoly's C16 Cold Press Juicer Hits 100,000 Sales Milestone Within Six Months of Launch",
            "description": "<div class=\"mdc-article-body\">\n            \n              \n              Canoly's C16 Cold Press Juicer Hits 100,000 Sales Milestone Within Six Months of Launch\n              \n            \n            \n              <span>\n<h2 class=\"mdc-article-heading mdc-heading__mdc mdc-heading--level-5__mdc\" data-v-618d53ae=\"\">Canoly's C16 Cold Press Juicer Hits 100,000 Sales Milestone Within Six Months of Launch</h2>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">PR Newswire</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">ATLANTA, Feb. 27, 2026</p>\n</span>\n<span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span data-v-602de5d2=\"\">ATLANTA</span>, <span data-v-602de5d2=\"\">Feb. 27, 2026</span> /PRNewswire/ -- Emerging kitchen appliance brand Canoly announced that its flagship product, the C16 cold press juicer, has exceeded cumulative sales of 100,000 units within six months of its launch in 2025. This milestone positions Canoly as one of the fastest-growing players in the US$200 juicer segment, a category that has seen renewed interest as consumers prioritize at-ho<span data-v-602de5d2=\"\">me wellness. </span></p>\n<span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://mma.prnewswire.com/media/2922064/canoly_c16_cold_press_juicer_in_kitchen_setting_celebrating_100000_sales_milestone.html\" tabindex=\"0\">\n<span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img\" data-v-f0ef0696=\"\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://mma.prnewswire.com/media/2922064/canoly_c16_cold_press_juicer_in_kitchen_setting_celebrating_100000_sales_milestone.jpg\"/></picture></span>\n</a>\n</p>\n</span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">The market segment of 3-in-1 cold press juicers around the price range of USD 200 had long been overlooked. In 2025, Canoly identified the gap and seized the opportunity with the launch of the <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://canoly.com/products/c16-cold-press-juicer\" tabindex=\"0\">C16 cold press juicer</a>, which combines the functionalities of cold press juicing, making plant-based milk, and preparing sorbet, and it quickly became the brand's best-selling model.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\"In an era of rising health consciousness, the rapid expansion of the global juicer market reflects people's pursuit of a higher quality of life. Since its inception, Canoly has been committed to leveraging technology to lower the barriers to healthy living, making it easy for every household to enjoy fresh, nutritious food,\" said James Collins, CEO of Canoly. \"This sales milestone affirms our belief that the juicing category, which is long overlooked because it was seen as complicated and hard to maintain, can be transformed with the right technology. Moving forward, we will continue to invest in innovations that reduce barriers for households and bring fresh, nutritious food into everyday routines.\"</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Cold pressing uses slow, controlled pressure rather than high-speed blades to crush and press ingredients. This low-speed process reduces heat and oxidation, preserving nutrients, enzymes, and flavor. The result is juice with higher nutrient stability and better absorption.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">The C16 features hands-free juicing, ideal for frequent use or large batches. It comes with a powerful 250W brushless AC motor and a large 90-oz hopper with a built-in pre-cutting blade, allowing users to simply place whole fruits, such as an entire apple, into the hopper and effortlessly produce a cup of richly nutritious juice. It delivers up to 96% juice yield with the help of a 0.1 mm fine filter, and all parts are made from BPA‑free plastic. Cleanup is also quick and easy, taking just about one minute. </p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">In addition, Canoly's expanded product portfolio also includes the C09 3-in-1 model, which meets varied capacity needs.  It is engineered for unparalleled performance and convenience. Meanwhile, the C03 is a more compact edition, ideal for small kitchens or light-duty uses. The slow-turning auger gently presses to minimize heat and protect nutrients, while the fine mesh strainer ensures a pure, smooth texture in every glass.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Founded in 2019, Canoly is a kitchen appliance brand dedicated to making healthy living accessible through innovative, multifunctional products. Its cold press juicers are now sold in 12 countries, with a 4.2/5 rating on Trustpilot. Canoly cold press juicers have been widely praised for their performance, quiet operation, and value for money, steadily building the brand's reputation within the healthy living community.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Looking forward, Canoly will further strengthen its presence in the cold press juicer category through continuous innovation while expanding its portfolio of multifunctional kitchen solutions, bringing everyday wellness within reach for more households around the world. <span data-v-602de5d2=\"\">To celebrate the brand's continued growth, Canoly will launch an International Women's Day promotion with an exclusive discount of USD 38.</span></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"http://canoly.com\" tabindex=\"0\"><span>Canoly's official website &gt; canoly.com</span></a></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span data-v-602de5d2=\"\">Media Contact:<br data-v-602de5d2=\"\"/>Canoly Official<br data-v-602de5d2=\"\"/>Email: <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"mailto:support@canoly.com\" tabindex=\"0\">support@canoly.com</a> <br data-v-602de5d2=\"\"/>Phone: +1 (347) 470-6888<br data-v-602de5d2=\"\"/>WhatsApp: +1 (213) 773-5416</span></p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img mdc-article-image__img--12-width\" data-v-f0ef0696=\"\" style=\"width:12px;\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://edge.prnewswire.com/c/img/favicon.png?sn=CN97631&amp;sd=2026-02-27\"/></picture></span> View original content to download multimedia:<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://www.prnewswire.com/news-releases/canolys-c16-cold-press-juicer-hits-100-000-sales-milestone-within-six-months-of-launch-302699654.html\" tabindex=\"0\">https://www.prnewswire.com/news-releases/canolys-c16-cold-press-juicer-hits-100-000-sales-milestone-within-six-months-of-launch-302699654.html</a></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">SOURCE Canoly</p></span>\n</div>",
            "pub_date": "2026-02-27 22:21:39",
            "link": "https://www.morningstar.com/news/pr-newswire/20260227cn97631/canolys-c16-cold-press-juicer-hits-100000-sales-milestone-within-six-months-of-launch",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "The End of \"What's for Dinner?\" - MDCE Launches AI App That Thinks Like a Chef! Download Snapshot Recipes Today!",
            "description": "<div class=\"mdc-article-body\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">MESA, ARIZONA / <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://www.accessnewswire.com/\" tabindex=\"0\">ACCESS Newswire</a> / February 27, 2026 / </strong><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Medical Care Technologies, Inc. (OTC PINK:MDCE) today announced the official launch</strong> of its first consumer-based artificial intelligence mobile application, <strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Snapshot Recipes</strong>, now available on both the Apple iOS App Store and the Google Play Store.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Users can learn more and download the app at:</strong><br data-v-602de5d2=\"\"/><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://pr.report/j46e\" tabindex=\"0\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">www.snapshotrecipes.app</strong></a></p><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://app.accessnewswire.com/imagelibrary/6c00bcb3-5495-4d91-9b88-3c1f1b060407/snapshot-recipes.png\" tabindex=\"0\"><span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img\" data-v-f0ef0696=\"\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://app.accessnewswire.com/imagelibrary/6c00bcb3-5495-4d91-9b88-3c1f1b060407/1142167/snapshot-recipes.png\"/></picture></span></a><span></span><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Snapshot Recipes leverages advanced artificial intelligence to revolutionize how consumers prepare meals.</strong> The app allows users to:</p><ul class=\"mdc-article-list mdc-article-list--unordered\" data-v-7b473e83=\"\"><li data-v-7b473e83=\"\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Take a photo of available ingredients and instantly generate customized meals from global cuisines</p></li><li data-v-7b473e83=\"\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Upload or snap a photo of a prepared dish to receive the full recipe</p></li><li data-v-7b473e83=\"\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Access step-by-step cooking instructions</p></li><li data-v-7b473e83=\"\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">View complete nutrition facts</p></li><li data-v-7b473e83=\"\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Receive a visually stunning AI-generated dish image</p></li></ul><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Whether a user has a refrigerator full of ingredients and no idea what to cook, or is dining out and wants to recreate a favorite meal later, Snapshot Recipes delivers intelligent, instant solutions.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">The Company's marketing campaign begins this weekend</strong>, with promotional rollouts across Instagram, Facebook, and X. In addition, Medical Care Technologies is actively engaging in discussions with celebrity figures in the podcast space through iHeartRadio's marketing division, including marketing representatives connected to major personalities such as Ryan Seacrest.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\"<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">This is a defining milestone for Medical Care Technologies</strong>,\" said <strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Marshall Perkins III, CEO</strong>. \"Snapshot Recipes represents our first scalable AI consumer product, and we believe it positions the Company squarely within one of the fastest-growing segments of the mobile application economy.\"</p><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://app.accessnewswire.com/imagelibrary/75591846-5934-40e9-9ce0-3f63afb76648/mdce-new-logo.png\" tabindex=\"0\"><span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img\" data-v-f0ef0696=\"\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://app.accessnewswire.com/imagelibrary/75591846-5934-40e9-9ce0-3f63afb76648/1142167/mdce-new-logo.png\"/></picture></span></a><span></span><span></span><span></span><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">About Medical Care Technologies, Inc.</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Medical Care Technologies, Inc. (OTC PINK:MDCE) focuses on developing and deploying artificial intelligence-based mobile applications in consumer lifestyle, wellness, and medical pre-screening sectors. The Company also operates in high-end memorabilia authentication markets through its subsidiaries.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Corporate Website: <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://pr.report/j46f\" tabindex=\"0\">www.medicalcaretechnologies.com</a><br data-v-602de5d2=\"\"/>Snapshot Recipes: <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://pr.report/j46g\" tabindex=\"0\">www.snapshotrecipes.app</a></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Contact:</strong><br data-v-602de5d2=\"\"/>Medical Care Technologies, Inc.<br data-v-602de5d2=\"\"/>1910 S. Stapley Drive, Suite 221, Mesa, AZ 85204<br data-v-602de5d2=\"\"/>Email: <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"mailto:noreply@snapshotrecipes.app\" tabindex=\"0\">noreply@snapshotrecipes.app</a></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Safe Harbor Statement</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">This press release contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. Such forward-looking statements include, but are not limited to, statements regarding anticipated revenue growth, market expansion, marketing partnerships, future product launches, scalability, and financial impact. These statements are based on current expectations and assumptions that involve risks and uncertainties which could cause actual results to differ materially from those anticipated. Factors that may affect future results include market acceptance of the Company's products, competitive pressures, regulatory developments, economic conditions, and the Company's ability to execute its strategic plans. Medical Care Technologies, Inc. undertakes no obligation to update forward-looking statements to reflect events or circumstances occurring after the date of this release.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">SOURCE:</strong> Medical Care Technologies Inc.</p><br/><br/>View the original <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://www.accessnewswire.com/newsroom/en/healthcare-and-pharmaceutical/the-end-of-%22whats-for-dinner%22-mdce-launches-ai-app-that-thinks-like-a-1142167\" tabindex=\"0\">press release</a> on ACCESS Newswire<br/><br/>\n<span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img mdc-article-image__img--0-width\" data-v-f0ef0696=\"\" style=\"width:0;\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://app.accessnewswire.com/img.ashx?id=1142167\"/></picture></span></div>",
            "pub_date": "2026-02-27 22:21:38",
            "link": "https://www.morningstar.com/news/accesswire/1142167msn/the-end-of-whats-for-dinner-mdce-launches-ai-app-that-thinks-like-a-chef-download-snapshot-recipes-today",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        }
    ]
}