{
    "data": [
        {
            "title": "No Fed, no safety net: Private credit will face a moment of truth in its first real recession",
            "description": "<div class=\"mdc-article-body\">\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  By Fabio Natalucci </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Private credit is easy to enter but hard to exit. Retail investors seeking fast cash could trigger a financial crisis. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     A spiral of illiquidity, forced selling, markdowns and deleveraging could emerge. Sound familiar? It happened with securitization markets during the 2007-08 financial crisis. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     The recent selloff of Blue Owl Capital's (OWL) stock after a redemption at one of its retail private-credit funds has become the poster child for increasing anxiety about the health of the private-credit market. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Private credit has grown rapidly in recent years - approaching $2 trillion - and it has never been tested through a full recession or financial-market stress without the backstop of the U.S. Federal Reserve. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     The fault line exposed now is that private credit is being offered to retail investors and wealthy individuals whose liquidity preferences are different from sophisticated, more patient institutional investors. These new investors line up to get their money back, effectively forcing sales of illiquid assets, as in the case of Blue Owl, at a time when entire segments of financial markets are getting repriced based on investor estimates of how artificial intelligence will disrupt the economy. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Shares of Blue Owl hit a 52-week low earlier this month, as did shares of Blackstone (BX). Other major firms including Carlyle Group (CG), KKR (KKR), Apollo Global Management (APO) and Ares Management (ARES) were also caught in the selloff. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     It is worth noting that vulnerabilities in private credit are increasing at a time when economic growth is still strong and financial conditions are very accommodative, while the credit cycle is still benign. The answer to whether the stress in this nearly $2 trillion market can turn into something more systemic, like the 2008 global financial crisis, lies in its structure and interconnectedness. Let's take a look. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Liquidity risk </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Liquidity risk has historically been limited in private credit. Pension funds and insurance companies have long investing time horizons and understand that illiquid assets are the source of the higher yield or \"illiquidity premium\" they earn. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     But the industry is expanding aggressively into retail, private wealth and 401(k)s through offerings like interval funds, business development companies (BDCs) and integrated technology platforms. Retail investors generally have shorter horizons and stronger liquidity preferences. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     The Blue Owl episode highlights the friction that can emerge when periodic, albeit limited, liquidity is promised against fundamentally illiquid underlying assets. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     To provide cash to investors in its OBDC II fund, Blue Owl said it sold $1.4 billion of senior secured credit from 27 industries across three of its funds. Four pension funds and insurance companies were among the buyers at an average price close to par, and it was later reported that one of the buyers was an insurance asset manager it owns. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Saba Capital and Cox Capital Partners announced their intention to launch tender offers to purchase shares in three Blue Owl BDCs, with offer price reportedly at a 20% to 35% discount to estimated NAVs - a significant haicut for investors in those vehicles to access immediate liquidity. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Leverage: Layered and opaque </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Leverage in the private-credit ecosystem, while limited relative to institutions like banks, exists in complex and opaque layers. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     The companies doing the borrowing are leveraged. There also is leverage at the fund level - through subscription lines or capital-call facilities, net-asset-value lending and BDC structures. There is potentially leverage at the investor level through the use of derivatives and other mechanisms. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     This layering makes it difficult for investors and regulators to assess overall financial leverage in the system. More importantly, it complicates understanding how these layers may interact in stress - especially when combined with illiquid assets. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Interconnectedness: Strength or vulnerability? </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Distributing risk enhances financial stability. But under stress, this interconnectedness could rapidly transmit shocks. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     In principle, distributing risk across diverse investors with different horizons and risk appetites enhances financial stability. But under stress, this interconnectedness could rapidly transmit shocks. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     For example, insurance companies play a central role in channeling funding into private-credit markets, and some are owned by private-credit managers. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Imagine a situation where, amid rising strains in credit markets, an insurance company needing liquidity but unable to retrieve capital from illiquid investments is forced to sell other more liquid assets, like equities or investment-grade bonds. Correlations across asset classes could rise abruptly, propagating the initial stress like a wave across segments of the financial system seemingly uncorrelated. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Credit quality: Calm on the surface </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Private-credit funds appear to have diversified exposures across industries. Yet the broader economy is increasingly exposed to what amounts to a massive macro bet on AI. Investors have aggressively repriced sectors perceived as losers from AI disruption - software, data analytics, tax strategies, cybersecurity and, most recently, delivery and payments. Blue Owl said about 13% of the credit sold represented the internet software and services industries. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Other developments should give investors pause: increased use of payment-in-kind (PIK) interest and the growing use of continuation funds to generate secondary liquidity. These tools can smooth short-term pressures, but they may mask underlying fragilities. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Private-credit markets remain opaque. Prices of loans can vary widely across funds holding similar assets. Secondary liquidity and price discovery are limited. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     This opacity matters most for retail investors, who have more immediate liquidity needs and rely more on timely and trustworthy pricing to assess risk. But it also matters for insurance companies, which depend heavily on ratings in determining capital treatment. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     If trust in marks, ratings or valuations were to evaporate, the lack of transparent price discovery could lead to a sudden rush for liquidity by retail investors that would amplify stress. Once credit assets are sold at a discount in secondary markets, that price becomes an actual mark for the entire industry. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     A spiral of illiquidity, forced selling, markdowns and deleveraging could emerge - amplified by opacity and rapidly fading trust. Sound familiar? It happened with securitization markets during the 2007-08 financial crisis. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Read: Hedge funds offer locked-up private credit investors a way out - at a hefty discount </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Such a crisis is a tail risk for now, and possible knock-on effects from the Blue Owl episode seem limited at the moment. But while private credit may not necessarily be the source of systemic stress, it may become an important conduit for it, given its high degree of interconnectedness - particularly in the event of a sharp slowdown of the economy. Investors and policymakers should ask themselves whether the push into the retail space may turn out to be private credit's Achilles' heel. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Fabio Natalucci is CEO of the Andersen Institute for Finance &amp; Economics. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     More: 'I'm shocked that people are shocked,' says JPMorgan executive about private-credit meltdown </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Plus: This fund that now says it'll never open up for withdrawals has El-Erian making Bear Stearns parallels </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     -Fabio Natalucci </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     This content was created by MarketWatch, which is operated by Dow Jones &amp; Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal. </p>\n<pre class=\"mdc-article-pre\" data-v-370ea3ac=\"\"></pre>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  (END) Dow Jones Newswires</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  02-26-26 1335ET</p>\n\nCopyright (c) 2026 Dow Jones &amp; Company, Inc.</div>",
            "pub_date": "2026-02-27 02:45:48",
            "link": "https://www.morningstar.com/news/marketwatch/20260226242/no-fed-no-safety-net-private-credit-will-face-a-moment-of-truth-in-its-first-real-recession",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "DPCG Wins Two More Virtual Patient Monitoring Awards Supporting the Department of Veterans Affairs",
            "description": "<div class=\"mdc-article-body\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">DPCG Wins Two More Virtual Patient Monitoring Awards Supporting the Department of Veterans Affairs</strong>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nDecisive Point Consulting Group and CareView Communications Awarded Two New Virtual Patient Monitoring Contracts at Atlanta and Central Alabama VA Medical Centers\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nDecisive Point Consulting Group, LLC (DPCG), a Small Business Administration (SBA) verified Service-Disabled Veteran-Owned Small Business (SDVOSB) and Woman-Owned Small Business (WOSB) headquartered in Waco, Texas, today announced two new contract awards supporting the Department of Veterans Affairs (VA) at the Atlanta VA Medical Center and the Central Alabama VA Medical Centers.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nThese awards expand the deployment of DPCG’s next-generation Virtual Patient Monitoring and Fall Prevention capabilities delivered in partnership with CareView Communications. Together, DPCG and CareView bring a proven, clinically focused approach to proactive patient safety—through CareView’s Patient Safety System with patented Virtual Bed Rails<span data-v-602de5d2=\"\">®</span> and Virtual Chair Rails<span data-v-602de5d2=\"\">®</span> technologies, advanced motion detection, and real-time two-way audio/video communication. This integrated solution enables clinical teams to monitor at-risk patients remotely from centralized monitoring stations, helping reduce preventable falls, improve staff efficiency, and strengthen overall patient safety.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n“Our partnership with CareView Communications is strong, deliberate, and built for responsiveness and performance—aligned on patient safety outcomes, clinical workflow efficiency, and uncompromising compliance,” said Dan Wilcox, Program Manager at DPCG. “We are honored to support the Atlanta and Central Alabama VA Medical Centers with a proven solution that improves observation efficiency while helping protect Veterans. As a Service-Disabled Veteran- and Woman-Owned small business, DPCG is relentless about delivering secure, compliant, and cost-effective capabilities that directly enhance Veteran care.”\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nDPCG and CareView also share an unwavering commitment to delivering these outcomes efficiently through the responsible application of machine learning and artificial intelligence—strengthening detection and prioritization, supporting faster clinical response, and continuously improving performance through data-driven insights.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nThese awards further expand DPCG’s footprint across VA healthcare facilities and reinforce the VA’s confidence in DPCG’s ability to deliver secure, compliant, and cost-effective healthcare technology solutions. By modernizing patient observation and fall prevention programs, DPCG remains committed to improving clinical outcomes and safeguarding Veterans nationwide.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img\" data-v-f0ef0696=\"\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20260226023648r1&amp;sid=mstr3&amp;distro=nx&amp;lang=en\"/></picture></span><span data-v-602de5d2=\"\"></span></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nDoug Basile, <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"mailto:doug.basile@dpcggov.net\" tabindex=\"0\">doug.basile@dpcggov.net</a>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span data-v-602de5d2=\"\">View source version on businesswire.com: </span><span data-v-602de5d2=\"\"><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://www.businesswire.com/news/home/20260226023648/en/\" tabindex=\"0\">https://www.businesswire.com/news/home/20260226023648/en/</a></span></p></div>",
            "pub_date": "2026-02-27 02:45:47",
            "link": "https://www.morningstar.com/news/business-wire/20260226023648/dpcg-wins-two-more-virtual-patient-monitoring-awards-supporting-the-department-of-veterans-affairs",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CINC Systems Unveils Payables+ AI-Powered Accounts Payable Solution",
            "description": "<div class=\"mdc-article-body\">\n            \n              \n              CINC Systems Unveils Payables+ AI-Powered Accounts Payable Solution\n              \n            \n            \n              <span>\n<h2 class=\"mdc-article-heading mdc-heading__mdc mdc-heading--level-5__mdc\" data-v-618d53ae=\"\">CINC Systems Unveils Payables+ AI-Powered Accounts Payable Solution</h2>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">PR Newswire</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">DULUTH, Ga., Feb. 26, 2026</p>\n</span>\n<span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">New CAM solution automates invoice ingestion, ledger coding, digital vendor payments</em></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span data-v-602de5d2=\"\">DULUTH, Ga.</span>, <span data-v-602de5d2=\"\">Feb. 26, 2026</span> /PRNewswire/ -- <strong class=\"mdc-article-strong\" data-v-479a2324=\"\">CINC Systems</strong>, the largest and most innovative technology partner in community association management (CAM) industry, today announced the official launch of <strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Payables+</strong>, the market's most advanced accounts payable (AP) automation solution. Payables+ delivers a powerful combination of artificial intelligence, seamless invoice processing, and integrated electronic payments — all designed to streamline financial workflows, eliminate manual back-office bottlenecks, and minimize human errors and <span data-v-602de5d2=\"\">fraud</span>.</p>\n<span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://mma.prnewswire.com/media/2921291/CINC_Systems__CINC_Announces_Payables__with_AvidXchange.html\" tabindex=\"0\">\n<span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img\" data-v-f0ef0696=\"\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://mma.prnewswire.com/media/2921291/CINC_Systems__CINC_Announces_Payables__with_AvidXchange.jpg\"/></picture></span>\n</a>\n</p>\n</span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Additionally, Payables+ offers its users the ability to generate incremental revenue with digital payment transactions. This enables community association management companies to transform accounts payable from a pure cost center into a high-margin revenue operation.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">With mounting expectations for operational efficiency in a competitive CAM market, Payables+ automated invoice ingestion, coding, and payments provides CAM companies the ability to grow without proportional increases in staffing. Consolidating AP automation, intelligence, and payment execution into one seamless experience, CINC Systems helps finance leaders refocus talent on higher value work.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Payables+ couples CINC's proprietary Cephai+ AI functionality with electronic payment capabilities powered by AvidXchange, unifying invoice processing and vendor payments from start to finish on a single platform. Users have real-time visibility and can leverage automated workflows to strengthen accuracy, compliance, and minimize risk exposure.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Bryan Chan, who uses Payables+ at Neighborhood Community Management, said about the product, \"Payables+ seamless integration with the rest of CINC's software platform and AvidXchange's industry leading payments platform means end-to-end workflow benefits. We used to review and code each of our invoices manually and then send checks to vendors. Now all we do is verify that each invoice has been coded accurately and pay our vendors electronically with a click of a button, saving us so much time.\"</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">CINC Systems' CEO Ryan Davis added about the new product, \"Payables+ addresses our clients' most frequent AI use case- paying vendors efficiently and safely every day. We're already seeing enormous client interest in Payables+ based on the product's operational benefits and attractive economics for both top- and bottom-lines.\"</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">To learn more about Payables+, <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4628280-1&amp;h=1896198234&amp;u=https%3A%2F%2Fcincsystems.zoom.us%2Fwebinar%2Fregister%2F7217719019594%2FWN_upcFXO5xRg-QUBDm68w9DA&amp;a=register+here+for+CINC%27s+Payables%2B+webinar\" tabindex=\"0\">register here for CINC's Payables+ webinar</a> on Thursday, March 12<span data-v-602de5d2=\"\">th</span> from 2PM to 3PM EST.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">About CINC Systems</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Since 2005, CINC Systems has been the largest and most innovative technology partner to community association management companies, powering more than 50,000 communities and more than 6 million doors.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Its single, integrated, AI-powered platform unifies accounting, banking, operations, and resident engagement across all community types—from single-family homes and condominiums to high-rises and lifestyle communities. Backed by Hg Capital and Spectrum Equity, CINC empowers management companies to deliver exceptional service and stronger financial outcomes.  For more information, visit <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4628280-1&amp;h=1128444521&amp;u=https%3A%2F%2Fwww.cincsystems.com&amp;a=www.cincsystems.com\" tabindex=\"0\">www.cincsystems.com</a>.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">About AvidXchange</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">AvidXchange is a leading provider in accounts payable (AP) automation, offering intelligent AP software and payment solutions specifically designed for mid-market businesses and their suppliers. With 25 years of industry experience, AvidXchange modernizes the way businesses manage their expenses and payments by offering AI-enhanced software coupled with support from experts. Empowering over 8,500 growth-driven businesses, AvidXchange increases efficiency, control, and visibility in financial operations and has securely processed payments to more than 1.3 million suppliers through its proprietary payment network over the past five years. Additionally, AvidXchange is a licensed money transmitter for B2B payments in the United States, licensed as a Money Transmitter by the New York State Department of Financial Services, as well as all other states that require AvidXchange to have a license. For more information, visit avidxchange.com.</p>\n<span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://mma.prnewswire.com/media/2533721/CINC_Logo.html\" tabindex=\"0\">\n<span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img\" data-v-f0ef0696=\"\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://mma.prnewswire.com/media/2533721/CINC_Logo.jpg\"/></picture></span>\n</a>\n</p>\n</span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img mdc-article-image__img--12-width\" data-v-f0ef0696=\"\" style=\"width:12px;\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://edge.prnewswire.com/c/img/favicon.png?sn=CL96711&amp;sd=2026-02-26\"/></picture></span> View original content to download multimedia:<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://www.prnewswire.com/news-releases/cinc-systems-unveils-payables-ai-powered-accounts-payable-solution-302698610.html\" tabindex=\"0\">https://www.prnewswire.com/news-releases/cinc-systems-unveils-payables-ai-powered-accounts-payable-solution-302698610.html</a></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">SOURCE CINC Systems</p></span>\n</div>",
            "pub_date": "2026-02-27 02:35:53",
            "link": "https://www.morningstar.com/news/pr-newswire/20260226cl96711/cinc-systems-unveils-payables-ai-powered-accounts-payable-solution",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Will the bank get suspicious if I deposit $150,000 in cash into my account?",
            "description": "<div class=\"mdc-article-body\">\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  By Quentin Fottrell </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     'I live in a state with no inheritance tax. I assume I can make this deposit legally.' </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     \"I assume I can make this deposit legally and that there are no tax consequences.\" (Photo subject is a model.) </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Dear Quentin, </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Is it legal to deposit a large cash inheritance - say, $150,000 - into a bank? The money is not currently in a bank account and it is not part of an estate - let's assume it's just cash in an envelope - and I live in a state with no inheritance tax. I assume I can make this deposit legally and that there will be no tax consequences. Am I correct? Must I provide a recent death certificate? </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Lone Ranger </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Related: 2025 has been one hell of a year. Consumers should expect more 'silent pain' in 2026. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     You can email The Moneyist with any financial and ethical questions at qfottrell@marketwatch.com. The Moneyist regrets he cannot reply to questions individually. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Depositing more than $10,000 into your bank account will likely trigger a mandatory currency-transaction report to both the Internal Revenue Service and the Financial Crimes Enforcement Network. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Dear Ranger, </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     I don't know why or how this money was withdrawn from a bank and put in an envelope - and I'm not sure I want to know. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     In any case, depositing more than $10,000 into your bank account will likely trigger a mandatory currency-transaction report to both the Internal Revenue Service and the Financial Crimes Enforcement Network under the Bank Secrecy Act of 1970. This is standard procedure to detect potential money laundering. It does not mean that you have done anything wrong, so as long as you haven't - well - done anything wrong, it should not create a problem for you. But there should be a paper trail in case you are audited. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     What if you were to deposit this money in $10,000 increments to avoid triggering an alert? Deliberately breaking up financial transactions to avoid triggering reports that are required by law is called \"structuring,\" and it's illegal. The authorities can spot structured transactions during a Bank Secrecy Act audit, a Form 8300 review or an income-tax audit. While there are similarities between transactions designed to avoid different reporting requirements, investigators will look at them with a magnifying glass. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     You could be asked for probate documents, a letter from the executor or a death certificate to confirm this cash is from a legal source. However, that would be less likely if the cash was already legally yours and was not being transferred directly from a deceased person's account. In most other cases, you would be required to submit a certified copy of a death certificate to a financial institution in order to transfer or deposit inherited funds into your account. Banks use these official documents to confirm an individual's death. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Inheritance tax versus estate tax </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Only a handful of states levy an inheritance tax - Kentucky, Maryland, Nebraska, New Jersey and Pennsylvania - and the amount owed typically depends on the heir's relationship to the deceased. While there is no federal inheritance tax, the IRS does impose a federal estate tax, and the exemption threshold is adjusted annually for inflation. For 2026, estates generally must file and potentially pay federal estate tax only if their taxable value exceeds $15 million, up from $13.99 million in 2025. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     An inheritance tax is paid by the recipient, and the amount typically depends on the heir's relationship to the deceased. By contrast, an estate tax is paid by the estate itself before any assets are distributed, although any interest or investment earnings generated after you receive it would be taxable. This includes the federal estate tax administered by the IRS. In other words, beneficiaries generally do not directly pay federal estate tax; it is settled by the estate prior to distribution. (Read more here.) </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     If you don't need this money, TurboTax suggests putting it into a trust. \"A trust allows you to pass assets to beneficiaries after your death without having to go through probate,\" it notes. \"Trusts are similar to wills, but trusts generally avoid state probate requirements and the associated expenses that wills typically have to go through. With a revocable trust, the grantor can take the assets out if necessary. An irrevocable trust usually ties up the assets until the grantor dies.\" </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Bottom line: When you deposit a large cash amount - in this case, a $150,000 inheritance - the bank teller verifies your identity, records your explanation of the money's source and processes the deposit normally. The transaction is then reviewed by automated monitoring systems, and if something seems inconsistent, the bank might request documentation like estate paperwork. As for this $150,000: It's better off in your bank account than in a drawer. Follow the rules and you won't - fingers crossed - experience any problems. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Don't miss: 'It's my money': My $800K inheritance is paying for a $1.6 million house. Shouldn't I decide where my husband and I live? </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Check out the Moneyist private Facebook group, where members help answer life's thorniest money issues. Post your questions, or weigh in on the latest Moneyist columns. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Previous columns by Quentin Fottrell: </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     'The house has quadrupled in value': I bought a house with my brother, but he did not contribute. How do I fix this? </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     My sister is buying our parents' $3 million house, but wants to deduct $100K for renovations. Who's right? </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     'I'm simply exhausted': I'm 55 and have $1.3 million for retirement. Can I retire next year? </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     By submitting your story to Dow Jones &amp; Co., the publisher of MarketWatch, you understand and agree that we may use your story, or versions of it, in all media and platforms. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     -Quentin Fottrell </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     This content was created by MarketWatch, which is operated by Dow Jones &amp; Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal. </p>\n<pre class=\"mdc-article-pre\" data-v-370ea3ac=\"\"></pre>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  (END) Dow Jones Newswires</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  02-26-26 1331ET</p>\n\nCopyright (c) 2026 Dow Jones &amp; Company, Inc.</div>",
            "pub_date": "2026-02-27 02:35:52",
            "link": "https://www.morningstar.com/news/marketwatch/20260226240/will-the-bank-get-suspicious-if-i-deposit-150000-in-cash-into-my-account",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Best’s Insurance Law Podcast Examines Rig Collapse Anatomy and Resulting Legal Issues",
            "description": "<div class=\"mdc-article-body\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Best’s Insurance Law Podcast Examines Rig Collapse Anatomy and Resulting Legal Issues</strong>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">AM Best </strong>and <em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">Best’s Insurance Professional Resources</em> have<em class=\"mdc-article-emphasis\" data-v-370fea16=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\"></strong></em>released the latest installment of the <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fredcircle.com%2Fshows%2Fffd402aa-085a-4991-a3c1-2cf4c77c95f8%2Fepisodes%2F16456fa1-2a3b-45ec-80c7-3d8cfcf9a3c1&amp;esheet=54434613&amp;newsitemid=20260226150643&amp;lan=en-US&amp;anchor=Best%27s+Insurance+Law+Podcast&amp;index=1&amp;md5=a24bb77f4bb716f39b48988947eae35e\" tabindex=\"0\">Best's Insurance Law Podcast</a> series, which examines timely insurance issues from a legal perspective.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nThe latest episode features Dr. Janine McCartney of <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fclaimsresource.ambest.com%2Fsearch%2FCompanyDisplay.aspx%3Fdpid%3D47503%26nid%3D6%26_gl%3D1&amp;esheet=54434613&amp;newsitemid=20260226150643&amp;lan=en-US&amp;anchor=HHC+Safety+Engineering+Services+and+HHC+Safety+Consulting+Services%2C+Corporation&amp;index=2&amp;md5=ca2724f34c87b692fce91ea9b5ffd7d9\" tabindex=\"0\">HHC Safety Engineering Services and HHC Safety Consulting Services, Corporation</a>, who discusses how rig collapse investigations are conducted.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nHHC Safety Engineering Services and HHC Safety Consulting Services, Corporation is a qualified member in <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fclaimsresource.ambest.com%2Fsearch%2FDirectoryCenter.aspx%2FDirectoryCenter.aspx%3F&amp;esheet=54434613&amp;newsitemid=20260226150643&amp;lan=en-US&amp;anchor=Best%26%238217%3Bs+Insurance+Professional+Resources&amp;index=3&amp;md5=3afc0c9437bd8e4274133c2fb168ddef\" tabindex=\"0\"><em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">Best’s Insurance Professional Resources</em></a>, which has featured qualified legal counsel, independent insurance adjusting services and expert service providers since 1929.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nListen or subscribe to <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fredcircle.com%2Fshows%2Fffd402aa-085a-4991-a3c1-2cf4c77c95f8%2Fepisodes%2F16456fa1-2a3b-45ec-80c7-3d8cfcf9a3c1&amp;esheet=54434613&amp;newsitemid=20260226150643&amp;lan=en-US&amp;anchor=Best%26%238217%3Bs+Insurance+Law+Podcast&amp;index=4&amp;md5=f3c20fa14ec6e20ed8719cda96134047\" tabindex=\"0\">Best’s Insurance Law Podcast</a>.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">AM Best is a global credit rating agency, news publisher and data analytics provider specializing in the insurance industry. Headquartered in the United States, the company does business in over 100 countries with regional offices in London, Amsterdam, Dubai, Hong Kong, Singapore and Mexico City. For more information, visit </strong><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.ambest.com&amp;esheet=54434613&amp;newsitemid=20260226150643&amp;lan=en-US&amp;anchor=www.ambest.com&amp;index=5&amp;md5=acb0ffb9e09df5d64e367bb3dd50aff7\" tabindex=\"0\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">www.ambest.com</strong></a><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">.</strong>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Copyright © 2026 by A.M. Best Company, Inc.</strong> <strong class=\"mdc-article-strong\" data-v-479a2324=\"\">and/or its affiliates. ALL RIGHTS RESERVED.</strong>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img\" data-v-f0ef0696=\"\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20260226150643r1&amp;sid=mstr3&amp;distro=nx&amp;lang=en\"/></picture></span><span data-v-602de5d2=\"\"></span></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">John Czuba \n</strong><br data-v-602de5d2=\"\"/><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Manager \n</strong><br data-v-602de5d2=\"\"/><strong class=\"mdc-article-strong\" data-v-479a2324=\"\"><em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">Best’s Insurance Professional Resources \n</em></strong><br data-v-602de5d2=\"\"/><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">+1 908 882 1722 \n</strong><br data-v-602de5d2=\"\"/><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"mailto:john.czuba@ambest.com\" tabindex=\"0\">john.czuba@ambest.com</a>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span data-v-602de5d2=\"\">View source version on businesswire.com: </span><span data-v-602de5d2=\"\"><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://www.businesswire.com/news/home/20260226150643/en/\" tabindex=\"0\">https://www.businesswire.com/news/home/20260226150643/en/</a></span></p></div>",
            "pub_date": "2026-02-27 02:30:51",
            "link": "https://www.morningstar.com/news/business-wire/20260226150643/bests-insurance-law-podcast-examines-rig-collapse-anatomy-and-resulting-legal-issues",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Wife of Pilot Killed in Deadly UPS Aircraft Crash Sues Boeing, General Electric",
            "description": "<div class=\"mdc-article-body\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Wife of Pilot Killed in Deadly UPS Aircraft Crash Sues Boeing, General Electric</strong>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">Lawsuit is the first filed on behalf of a flight crew member’s surviving family</em>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nThe wife of one of the pilots killed in last November’s crash of UPS Flight 2976 near Louisville’s Muhammad Ali International Airport has filed suit against airplane maker Boeing and engine maker General Electric, among others.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nThe complaint was filed on February 25 by the spouse of Dana Justin Diamond, a Caldwell, Texas, resident who was serving as an international relief officer with responsibilities that included piloting the Boeing MD-11F aircraft on the long-haul cargo flight bound for Honolulu.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nAccording to the complaint filed by attorneys with <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.lanierlawfirm.com%2F&amp;esheet=54434624&amp;newsitemid=20260226000681&amp;lan=en-US&amp;anchor=The+Lanier+Law+Firm&amp;index=1&amp;md5=d80c6396dcbb5b3ecfb35082a7e7fa40\" tabindex=\"0\">The Lanier Law Firm</a>, the aircraft’s left engine and pylon separated from the wing shortly after takeoff, followed by a fire and subsequent crash in an industrial area south of the airport. Three crew members, including Diamond, as well as 12 individuals on the ground died as a result of the incident.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n\"When an engine separates from a wing seconds after takeoff, that's not an accident, says <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.lanierlawfirm.com%2Fattorneys%2Fw-mark-lanier%2F&amp;esheet=54434624&amp;newsitemid=20260226000681&amp;lan=en-US&amp;anchor=Mark+Lanier&amp;index=2&amp;md5=26e72ef17020efa1860ddb4acca8f4d0\" tabindex=\"0\">Mark Lanier</a>, lead attorney for the plaintiff. “That's a failure by the companies responsible for building and maintaining that aircraft.\"\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nMr. Diamond was employed by UPS for more than 37 years and had achieved the No. 1 seniority position on the MD-11 and No. 5 overall seniority among all of the company’s pilots. He played a significant role in union leadership and served as vice chairman of the Independent Pilot Association’s Aircraft Rescue and Firefighting Committee from 2012 to 2017, helping educate more than a thousand personnel from across the nation in airport emergency services.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n“Dana was passionate about pilot safety and devoted to his family, friends and community,” says <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.lanierlawfirm.com%2Fattorneys%2Fsam-e-taylor%2F&amp;esheet=54434624&amp;newsitemid=20260226000681&amp;lan=en-US&amp;anchor=Sam+E.+Taylor&amp;index=3&amp;md5=13e44b5be33b3e0337d08ed38070df0b\" tabindex=\"0\">Sam E. Taylor</a>, a senior litigation counsel with The Lanier Law Firm. “This tragedy was an absolute betrayal of everything Dana stood for and the professional and personal contributions he made in his life. Through this litigation and Dana’s sacrifice, we will learn more about the causes of this crash and steps to prevent a reoccurrence.”\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nThe lawsuit names aircraft manufacturer Boeing Co., engine manufacturer General Electric Co. and maintenance provider VT San Antonio Aerospace as defendants. The aircraft, which had been converted for cargo operations and operated by UPS since 2006, was equipped with CF6 engines designed and manufactured by General Electric. The aircraft had recently undergone maintenance work performed by VT San Antonio Aerospace in the weeks prior to the crash.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nAccording to flight data information, the aircraft failed to reach over 100 feet in altitude in the 37 seconds it was airborne before crashing into warehouses and other buildings in an industrial district at the southern edge of the airport.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nThe lawsuit asserts claims for wrongful death, negligence, loss of consortium and related damages for the multiple failures of the defendants that contributed to the engine separation and resulting crash. The complaint also requests punitive damages and a trial by jury.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nThe case is <em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">Donna Lynn Diamond v. VT San Antonio Aerospace Inc. et al</em>., No. 26-CI-001690, filed in Division Six Circuit Court of Jefferson County.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">About Lanier Law Firm</strong>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nThe Lanier Law Firm is an award-winning national trial firm specializing in a variety of practice areas, including asbestos exposure, pharmaceutical liability, business litigation and product liability. As one of the most experienced asbestos litigation law firms in the world, Lanier provides mesothelioma legal services in all 50 states. With talented attorneys in Houston, New York and Los Angeles, the firm has won more than $20 billion for clients since its founding in 1990. <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.lanierlawfirm.com%2F&amp;esheet=54434624&amp;newsitemid=20260226000681&amp;lan=en-US&amp;anchor=Learn+more+about+the+firm&amp;index=4&amp;md5=4d20bd03dcbca8fc54e2bf02da91ec78\" tabindex=\"0\">Learn more about the firm</a>.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img\" data-v-f0ef0696=\"\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20260226000681r1&amp;sid=mstr3&amp;distro=nx&amp;lang=en\"/></picture></span><span data-v-602de5d2=\"\"></span></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Media Contact: \n</strong><br data-v-602de5d2=\"\"/>Kevin Roberts\n<br data-v-602de5d2=\"\"/>(713) 659-5200\n<br data-v-602de5d2=\"\"/><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"mailto:kevin.roberts@lanierlawfirm.com\" tabindex=\"0\">kevin.roberts@lanierlawfirm.com</a>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span data-v-602de5d2=\"\">View source version on businesswire.com: </span><span data-v-602de5d2=\"\"><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://www.businesswire.com/news/home/20260226000681/en/\" tabindex=\"0\">https://www.businesswire.com/news/home/20260226000681/en/</a></span></p></div>",
            "pub_date": "2026-02-27 02:30:49",
            "link": "https://www.morningstar.com/news/business-wire/20260226000681/wife-of-pilot-killed-in-deadly-ups-aircraft-crash-sues-boeing-general-electric",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "EBay to cut 800 jobs, joining other tech names in announcing layoffs as AI reshapes workforces",
            "description": "<div class=\"mdc-article-body\">\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  By Bill Peters </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     The layoff announcement comes a week after eBay agreed to buy secondhand-clothing site Depop and follows job cuts earlier this year by Amazon and Pinterest </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     EBay's stock is up almost 30% over the past 12 months, nearly double the S&amp;P 500's performance. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     EBay plans to cut around 800 jobs globally, or 6% of its workforce, amid a bigger push by the e-commerce and auction platform into artificial intelligence. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     The move comes a week after eBay announced a deal to buy fashion site Depop. It follows job cuts announced by companies like Amazon (AMZN) and Pinterest (PINS) this year as they shift more resources toward AI. Some tech companies are also still recalibrating after the boom in digital demand during the pandemic. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     In a statement emailed to MarketWatch, an eBay (EBAY) spokesperson wrote that the company was \"taking steps to reinvest across our business and align our structure with our strategic priorities, which will affect certain roles across our workforce.\" </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     The company said it is still hiring in high-priority areas. Bloomberg and CNBC reported the news about the layoffs earlier in the day. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Shares of eBay were up 3.4% in recent midday trading on Thursday. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     The company had 12,300 employees worldwide as of the end of last year, with around 7,200 in the U.S., according to a filing. EBay also announced layoffs in 2024 and 2023, Bloomberg noted. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Last week, online shopping platform Etsy (ETSY) said it would sell secondhand-clothing site Depop to eBay for around $1.2 billion. The deal gives eBay deeper access to younger, fashion-conscious shoppers, with whom Depop has become popular. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Meanwhile, eBay has made efforts to introduce AI into the services it offers buyers and sellers and to help with marketing, pricing and listings. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     The cuts at eBay were announced after the company's most recent quarterly results topped expectations. Trading cards and collectibles, like bullion and coins, were standouts, the company said. Its sales outlook for the first quarter was above Wall Street's estimates. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     EBay's stock has rallied 27.6% over the past 12 months, while the S&amp;P 500 index SPX has advanced 15.4%. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     -Bill Peters </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     This content was created by MarketWatch, which is operated by Dow Jones &amp; Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal. </p>\n<pre class=\"mdc-article-pre\" data-v-370ea3ac=\"\"></pre>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  (END) Dow Jones Newswires</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  02-26-26 1309ET</p>\n\nCopyright (c) 2026 Dow Jones &amp; Company, Inc.</div>",
            "pub_date": "2026-02-27 02:16:00",
            "link": "https://www.morningstar.com/news/marketwatch/20260226238/ebay-to-cut-800-jobs-joining-other-tech-names-in-announcing-layoffs-as-ai-reshapes-workforces",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Mortgage rates fall below 6%, giving buyers a glimpse of affordability",
            "description": "<div class=\"mdc-article-body\">\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  By Leslie Albrecht </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Falling rates could 'drive more potential buyers into the market for spring home-buying season,' says Freddie Mac's chief economist </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Elevated mortgage rates and high home prices have forced many house hunters to put off buying plans in recent years. Rates have fallen overall since the start of 2026. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Falling mortgage rates are giving home buyers something they haven't seen in a long time: a glimpse of affordability. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     The average 30-year mortgage rate hit 5.98% as of Feb. 26, according to Freddie Mac, down from 6.01% the prior week. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     A year ago, the average rate on a 30-year fixed-rate mortgage was 6.76%. Elevated mortgage rates and high home prices have forced many house hunters to put off buying plans in recent years. That's driven home sales down and pushed the average age of a first-time home buyer to an all-time high of 40. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     But falling mortgage rates have now pumped up buyers' purchasing power. A household making the median income of about $86,300 can now \"comfortably afford\" a $331,483 home with a 20% down payment, according to a new analysis from the real-estate platform Zillow (Z). That's $30,000 more than a year ago, Zillow said. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     The median price of a home in the U.S. was $396,800 as of January, according to the National Association of Realtors. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     \"A more than $30,000 gain in buying power is meaningful for households that have been stretched thin by high rates. It can mean the difference between settling and choosing,\" noted Kara Ng, senior economist at Zillow, in the report. \"That doesn't suddenly make this market affordable for everyone, but it does crack open doors that had firmly shut when rates peaked.\" </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Mortgage rates under 3% during the COVID-19 pandemic fueled a rush of home buyers. But when rates soared to over 7% in late 2023 and home prices continued to tick upward, many would-be buyers were shut out of the market. That pushed home sales to 31-year low in 2025. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Some see the chance for increased home sales in the coming months. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     \"For the first time in three-and-a-half years, the 30-year fixed-rate mortgage dropped into the 5% range, falling even lower than last week's milestone,\" said Sam Khater, Freddie Mac's (FMCC) chief economist. \"This rate, combined with the improving availability of homes for sale, is meaningful and will drive more potential buyers into the market for spring home-buying season.\" </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Do you have questions about real estate that you would like to see covered in MarketWatch? We would like to hear from readers. You can write to us at readerstories@marketwatch.com. A reporter may be in touch to learn more. MarketWatch will not attribute your answers to you by name without your permission. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     -Leslie Albrecht </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     This content was created by MarketWatch, which is operated by Dow Jones &amp; Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal. </p>\n<pre class=\"mdc-article-pre\" data-v-370ea3ac=\"\"></pre>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  (END) Dow Jones Newswires</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  02-26-26 1309ET</p>\n\nCopyright (c) 2026 Dow Jones &amp; Company, Inc.</div>",
            "pub_date": "2026-02-27 02:15:57",
            "link": "https://www.morningstar.com/news/marketwatch/20260226239/mortgage-rates-fall-below-6-giving-buyers-a-glimpse-of-affordability",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Arthrex Releases TightRope® SB All-Suture Implant for ACL Fixation",
            "description": "<div class=\"mdc-article-body\">\n            \n              \n              Arthrex Releases TightRope® SB All-Suture Implant for ACL Fixation\n              \n            \n            \n              <span>\n<h2 class=\"mdc-article-heading mdc-heading__mdc mdc-heading--level-5__mdc\" data-v-618d53ae=\"\">Arthrex Releases TightRope® SB All-Suture Implant for ACL Fixation</h2>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">PR Newswire</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">NAPLES, Fla., Feb. 26, 2026</p>\n</span>\n<span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\"><em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">Facilitates Least Invasive All-Inside, No Metal ACL Reconstruction</em></strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span data-v-602de5d2=\"\">NAPLES, Fla.</span>, <span data-v-602de5d2=\"\">Feb. 26, 2026</span> /PRNewswire/ -- Arthrex, a global leader in minimally invasive surgical technology, announced that it has released the TightRope<span data-v-602de5d2=\"\">®</span> SB implant, the first device on the market for anterior cruciate ligament (ACL) reconstruction using all-suture, soft-button technology. To date, nearly two thousand implants have been used in procedures across the U.S.</p>\n<span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"> </p>\n</span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">ACL reconstruction is one of the most performed orthopedic procedures worldwide, helping patients across all activity levels—from elite athletes to active adults—return to stability, confidence and movement. The TightRope® SB implant represents the evolution of Arthrex ACL technology, offering a fully all‑suture solution while maintaining the procedural flexibility and reproducibility surgeons expect.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">By eliminating rigid materials and preserving strong, adjustable fixation, the device expands graft-fixation options for both ACL reconstruction and repair. This less invasive approach supports improved knee stability and range of motion,<span data-v-602de5d2=\"\">1,2</span> while eliminating the presence of metal implants.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\"We look forward to seeing how patients benefit from this revolutionary solution for ACL reconstruction,\" said Arthrex Knee Ligament Senior Group Product Manager Justin Boyle. \"The TightRope SB builds on Arthrex's foundation of knee ligament innovation and reflects how ACL surgery continues to evolve.\"</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">The all-suture, soft-button technology used in the TightRope SB implant offers high-strength fixation and features a flat-tape loop that holds the new ligament in place.<span data-v-602de5d2=\"\">2</span> The implant is also radiopaque, which helps surgeons confirm its position during and after surgery. The implant is available in a variety of configurations to support ACL reconstruction using all graft types as well as ACL primary repair procedures.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">CU Anschutz Orthopedics and UCHealth surgeon <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4628457-1&amp;h=204527156&amp;u=https%3A%2F%2Fwww.rachelfrankmd.com%2F&amp;a=Rachel+M.+Frank%2C+MD\" tabindex=\"0\">Rachel M. Frank, MD</a> (Aurora, Colorado), completed the first cases with the TightRope SB implant in June 2025. Both cases were QuadLink™ all-inside ACL reconstructions with the <em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">Internal</em>Brace™ technique.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\"The TightRope SB implant introduces a metal-free, screw-free option for ACL reconstruction fixation,\" said Dr. Frank. \"The adjustable, all-suture construct provides intraoperative flexibility in graft tensioning and a low-profile footprint. Together, these design features reflect an important step forward in ACL fixation, with continued evaluation underway to assess clinical outcomes.\"</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">In April 2025, the TightRope SB implant received gold in the Healthcare Environment and Patient Care Solutions category at the 38th annual <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4628457-1&amp;h=730338170&amp;u=https%3A%2F%2Fedisonawards.com%2Fwinner%2Fsoft-button-tightrope%2F&amp;a=Edison+Awards\" tabindex=\"0\">Edison Awards</a>.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\"Winning gold at the Edison Awards is a powerful validation of our shared commitment to innovation and our mission of Helping Surgeons Treat Their Patients Better<span data-v-602de5d2=\"\">®,</span>\" said Boyle. \"This recognition reflects the purpose‑driven design behind TightRope SB and its role in advancing ACL reconstruction.\"</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">For more information, downloadable multimedia assets and interview requests for subject matter experts, contact <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"mailto:media@arthrex.com\" tabindex=\"0\">Arthrex Media Relations.</a></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\"><span class=\"mdc-article-underline\" data-v-1f1bdc8a=\"\">About Arthrex<br data-v-1f1bdc8a=\"\"/></span></strong>Arthrex, headquartered in Naples, Florida, is a global medical device company and leader in multispecialty minimally invasive surgical technology innovation, scientific research, manufacturing and medical education. The company has pioneered the field of arthroscopy and sports medicine and develops more than 1,000 new products and related procedures annually to advance minimally invasive surgery for orthopedics, trauma, and spine, in addition to arthroplasty, cardiothoracic, and biologic innovations. Arthrex also specializes in the latest 4K multispecialty surgical visualization and OR integration technology solutions. For more information, visit Arthrex.com.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">References</strong></p><ol class=\"mdc-article-list mdc-article-list--ordered\" data-v-7b473e83=\"\"><li data-v-7b473e83=\"\">van der List JP, DiFelice GS. Primary repair of the anterior cruciate ligament: A paradigm shift. Surgeon. 2017;15(3):161-168. doi:10.1016/j.surge.2016.09.006</li><li data-v-7b473e83=\"\">Arthrex, Inc. Data on file (APT-07399). Naples, FL; 2025.</li></ol><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">The <em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">Internal</em>Brace surgical technique is intended only to augment the primary repair/reconstruction by expanding the area of tissue approximation during the healing period and is not intended as a replacement for the native ligament. The <em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">Internal</em>Brace technique is for use during soft tissue-to-bone fixation procedures and is not cleared for bone-to-bone fixation.</p>\n<span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://mma.prnewswire.com/media/2921456/Xray_comparison.html\" tabindex=\"0\">\n<span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img\" data-v-f0ef0696=\"\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://mma.prnewswire.com/media/2921456/Xray_comparison.jpg\"/></picture></span>\n</a>\n</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://mma.prnewswire.com/media/2921457/250708_or_Dr__Frank___Soft_Button_TightRope_Live_ST_321_PSD_Large.html\" tabindex=\"0\">\n<span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img\" data-v-f0ef0696=\"\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://mma.prnewswire.com/media/2921457/250708_or_Dr__Frank___Soft_Button_TightRope_Live_ST_321_PSD_Large.jpg\"/></picture></span>\n</a>\n</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://mma.prnewswire.com/media/2921458/250708_or_Dr__Frank___Soft_Button_TightRope_Live_ST_887_PSD_Large.html\" tabindex=\"0\">\n<span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img\" data-v-f0ef0696=\"\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://mma.prnewswire.com/media/2921458/250708_or_Dr__Frank___Soft_Button_TightRope_Live_ST_887_PSD_Large.jpg\"/></picture></span>\n</a>\n</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://mma.prnewswire.com/media/2921459/ILL1_001171_en_US_B_QuadLink_All_Suture_FiberTag_TightRope_II_Bluewire_240322_0004_CMYK_merged__1__P.html\" tabindex=\"0\">\n<span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img\" data-v-f0ef0696=\"\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://mma.prnewswire.com/media/2921459/ILL1_001171_en_US_B_QuadLink_All_Suture_FiberTag_TightRope_II_Bluewire_240322_0004_CMYK_merged__1__P.jpg\"/></picture></span>\n</a>\n</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://mma.prnewswire.com/media/1389187/Arthrex_Logo.html\" tabindex=\"0\">\n<span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img\" data-v-f0ef0696=\"\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://mma.prnewswire.com/media/1389187/Arthrex_Logo.jpg\"/></picture></span>\n</a>\n</p>\n</span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img mdc-article-image__img--12-width\" data-v-f0ef0696=\"\" style=\"width:12px;\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://edge.prnewswire.com/c/img/favicon.png?sn=FL96893&amp;sd=2026-02-26\"/></picture></span> View original content to download multimedia:<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://www.prnewswire.com/news-releases/arthrex-releases-tightrope-sb-all-suture-implant-for-acl-fixation-302698724.html\" tabindex=\"0\">https://www.prnewswire.com/news-releases/arthrex-releases-tightrope-sb-all-suture-implant-for-acl-fixation-302698724.html</a></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">SOURCE Arthrex, Inc.</p></span>\n</div>",
            "pub_date": "2026-02-27 02:10:44",
            "link": "https://www.morningstar.com/news/pr-newswire/20260226fl96893/arthrex-releases-tightrope-sb-all-suture-implant-for-acl-fixation",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Arna Pharma Inc. and Slate Run Pharmaceuticals to form a Joint Venture to Create Scaled-Up U.S. Specialty Pharmaceutical Platform",
            "description": "<div class=\"mdc-article-body\">\n            \n              \n              Arna Pharma Inc. and Slate Run Pharmaceuticals to form a Joint Venture to Create Scaled-Up U.S. Specialty Pharmaceutical Platform\n              \n            \n            \n              <span>\n<h2 class=\"mdc-article-heading mdc-heading__mdc mdc-heading--level-5__mdc\" data-v-618d53ae=\"\">Arna Pharma Inc. and Slate Run Pharmaceuticals to form a Joint Venture to Create Scaled-Up U.S. Specialty Pharmaceutical Platform</h2>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">PR Newswire</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">AUSTIN, Texas, Feb. 26, 2026</p>\n</span>\n<span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span data-v-602de5d2=\"\">AUSTIN, Texas</span>, <span data-v-602de5d2=\"\">Feb. 26, 2026</span> /PRNewswire/ -- Arna Pharma Inc<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">. </strong>and Slate Run Pharmaceuticals announced they have signed an MOU to create a scaled-up U.S.-based specialty pharmaceutical joint venture focused on branded products, 505(b)(2) medicines, and specialized generics.</p>\n<span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://mma.prnewswire.com/media/2921293/Slate_Run_Pharmaceuticals_logo_Logo.html\" tabindex=\"0\">\n<span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img\" data-v-f0ef0696=\"\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://mma.prnewswire.com/media/2921293/Slate_Run_Pharmaceuticals_logo_Logo.jpg\"/></picture></span>\n</a>\n</p>\n</span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">The joint venture brings together Arna Pharma's development capabilities and portfolio expansion strategy with Slate Run Pharmaceuticals' established U.S. commercial, regulatory, and supply chain infrastructure.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\"This represents a significant milestone for Arna Pharma and a powerful step forward in our long-term strategy,\" said Ram Iyer, Senior Vice President of Arna Pharma Inc. \"By combining Arna's development expertise with Slate Run's proven U.S. commercial and operational infrastructure, we have created a platform that is uniquely positioned to expand specialized generics in high-value therapeutic segments and accelerate market access, reimbursement, and physician engagement.\"</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Founded in 2014, Slate Run Pharmaceuticals has built a strong U.S. footprint, consisting of an experienced commercial and regulatory team. The joint venture will be well-positioned to scale branded and specialized products efficiently across the U.S. market.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\"We are excited to unite our organizations and begin this next chapter together,\" said Michael Plessinger, CEO of Slate Run Pharmaceuticals. \"This combination strengthens our ability to execute, expand our portfolio, and continue to serve as a trusted U.S. partner for the industry.\"</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Leadership from both organizations will work closely to ensure seamless integration, maintain operational continuity, and uphold the highest standards of regulatory compliance, product quality, and patient care.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Arna Pharma Inc and Slate Run Pharmaceuticals welcome engagement with strategic partners, investors, licensors, and portfolio companies interested in collaborating with the combined organization as it executes its growth strategy and builds a leading U.S. specialty pharmaceutical platform.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">For more information please contact:</p><ul class=\"mdc-article-list mdc-article-list--unordered\" data-v-7b473e83=\"\"><li data-v-7b473e83=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\"><em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">Arna Pharma Inc.:</em></strong> Ram Iyer, <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"mailto:ram.i@arnapharma.com\" tabindex=\"0\">ram.i@arnapharma.com</a></li><li data-v-7b473e83=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\"><em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">Slate Run Pharmaceuticals LLC</em></strong> : Mike Plessinger, <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"mailto:mike.plessinger@slaterunpharma.com\" tabindex=\"0\">mike.plessinger@slaterunpharma.com</a></li></ul><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">About Arna Pharma Inc.</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">The USA Operation started in 2024 with a vision to create a healthier world, Arna Pharma Inc. blends patent-level innovation with smart, sustainable business practices. Founded by industry experts with a strong focus on innovation and patient outcomes, our commitment to quality and integrity drives us to deliver safe, effective, and reliable therapies.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">As a fully integrated pharmaceutical organization, Arna Pharma Inc. offers end-to-end capabilities, from formulation development and manufacturing to global marketing and commercialization. Our portfolio emphasizes niche dosage forms and treatments for rare and underserved diseases, reflecting our mission to address unmet medical needs with specialized focus on Respiratory Indications.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">About Slate Run Pharmaceuticals: </strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Founded in 2014, Slate Run Pharmaceuticals has built a strong and expanding presence in the U.S. generic pharmaceutical market. The company is led by a seasoned leadership team with over 200 years of combined industry experience across commercial operations, regulatory affairs, quality, and supply chain management. Slate Run's team has been directly involved in the selection, FDA approval, commercialization, and supply of a broad portfolio of generic pharmaceuticals spanning multiple therapeutic areas.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Today, Slate Run markets more than 30 product families and serves customers across the U.S., including wholesalers, distributors, pharmacies, and healthcare providers. Through disciplined portfolio development, strategic manufacturing partnerships, and a commitment to regulatory compliance and supply reliability, Slate Run is dedicated to expanding patient access to high-quality, affordable medications while driving sustainable growth.</p>\n<span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://mma.prnewswire.com/media/2921294/Arna_Logo.html\" tabindex=\"0\">\n<span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img\" data-v-f0ef0696=\"\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://mma.prnewswire.com/media/2921294/Arna_Logo.jpg\"/></picture></span>\n</a>\n</p>\n</span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img mdc-article-image__img--12-width\" data-v-f0ef0696=\"\" style=\"width:12px;\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://edge.prnewswire.com/c/img/favicon.png?sn=CL96714&amp;sd=2026-02-26\"/></picture></span> View original content to download multimedia:<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://www.prnewswire.com/news-releases/arna-pharma-inc-and-slate-run-pharmaceuticals-to-form-a-joint-venture-to-create-scaled-up-us-specialty-pharmaceutical-platform-302698556.html\" tabindex=\"0\">https://www.prnewswire.com/news-releases/arna-pharma-inc-and-slate-run-pharmaceuticals-to-form-a-joint-venture-to-create-scaled-up-us-specialty-pharmaceutical-platform-302698556.html</a></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">SOURCE Slate Run Pharmaceuticals; Arna Pharma Inc.</p></span>\n</div>",
            "pub_date": "2026-02-27 02:10:43",
            "link": "https://www.morningstar.com/news/pr-newswire/20260226cl96714/arna-pharma-inc-and-slate-run-pharmaceuticals-to-form-a-joint-venture-to-create-scaled-up-us-specialty-pharmaceutical-platform",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        }
    ]
}