{
    "data": [
        {
            "title": "My brother is paranoid, alone and has forgotten that he sold his house. How can we help?",
            "description": "<div class=\"mdc-article-body\">\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  By Quentin Fottrell </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     His lawyer said, 'He's gone off the deep end' </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     \"The lawyer's last words to us was we might have to appoint a new executor if his condition continues to deteriorate.\" (Photo subject is a model.) </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Dear Quentin, </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     My sister and I have held power of attorney for my brother, who lives six hours away. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     He has been in an assisted-living facility for over three years. Physically, he is not able to live independently, but was or is pretty sharp mentally. We take care of all his bills; his house and car were sold over three years ago. His wife died in 2020; they had no children. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Over the last 10 days, he started calling my sister about bills he needed to pay; all his bills are being paid by her. He also wants to know the balance in his bank accounts. My sister has always given him this information when he asks. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     He wanted to see the lawyer recently. He was very paranoid, asking staff to witness their conversation. He doesn't remember that he sold his house or car. In an email, his lawyer said, \"He's gone off the deep end.\" </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     The lawyer's last words to us were we might have to appoint a new executor if his condition continues to deteriorate. My sister and I are his only family, the will is made and we would inherit his estate. What do we do next? </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     The Other Sibling </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Don't miss: 'I spend $7,500 a month': I'm 47, earn $260K, and have $3 million. Can I retire at 50? </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     You can email The Moneyist with any financial and ethical questions at qfottrell@marketwatch.com. The Moneyist regrets he cannot reply to questions individually. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     A durable power of attorney would continue to carry out these duties after if/when your brother becomes incapacitated. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Dear Sibling, </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     I'm not encouraged by the tone or content of his attorney's email. It lacks compassion, professionalism and respect. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Your brother is confused and needs help. But he doesn't need an executor. An executor is appointed by the probate court after your brother passes away (and would typically be designated executor in his will). A power of attorney usually looks after a person's finances while they have diminished capacity; a durable power of attorney would continue to carry out these duties after if/when your brother becomes incapacitated. A conservator/guardian would be appointed by the courts to oversee his financial, physical and medical wellbeing. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Take immediate steps to safeguard your brother's safety: He may need an assessment for dementia or cognitive impairment from a neurologist or geriatrician. I hope that the assisted-living facility is aware of this change of behavior, and is equipped to help him navigate this next stage. You will all need to work together until you figure out the next steps for your brother. Questions remain: What kind of power of attorney document currently exists? What legal capacity does your brother have to make decisions for himself - everything from hiring a new lawyer to revoking a POA? Has your brother been actually diagnosed with dementia? </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     A durable power of attorney would continue if/when your brother becomes incapacitated. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Most of all, you will require health advocates and a competent lawyer. If the lawyer mentioned in your letter is not equipped to deal with your brother's situation - and it could be so given his reaction to the decline in your brother's health - you need a new lawyer to oversee your brother's affairs; as his joint powers of attorney, you can help him to appoint one. They will be able to help outline your options, which will depend on what kind of POA you hold and whether or not your brother requires conservatorship/guardianship, which should be a last resort. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Laws regarding a conservator/guardian vary by state. In Texas, you would need to file a petition with the court. \"A hearing will be held, and the judge will examine the evidence and make a decision,\" says Childs Legacy Law Firm in Houston. \"In the second instance, absent a pending petition, and in lieu of a family member, living will or another relevant document, the court will appoint a conservator. The conservator can be any number of people, like a friend, social worker, neighbor, church member, attorney, nurse [or] another qualified person.\" </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     General conservatorship </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     \"A general conservatorship is created when an adult - typically an elderly person but can be a younger adult person - cannot manage their finances or health due to deteriorated mental capacity or impairment caused by an illness or injury,\" it adds. \"While they recover from the illness or injury, a conservator may be appointed by a court to address their medical and financial needs.\" Reasons include a person falling into a coma, a form of dementia like Alzheimer's, head injury or a stroke that impairs their ability to think or express their wishes. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Your brother's condition appears to be deteriorating, quite suddenly. \"People who suffer from any of the above can become vulnerable to bad actors who may try to manipulate the situation for their own financial gain. These bad actors may, for example, attempt to divert your disability payments (fraud) or coerce you into changing a will (undue influence),\" the law firm says. It is always better to draft an estate plan while you have the legal capacity to write and sign such a document. Otherwise, it will be left up to the courts. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Your brother's condition appears to be deteriorating. He needs calm and legal protection. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Right now, your brother needs reassurance and validation, clear and comforting communication, a routine so he feels safe, and legal protection; document everything, especially his changes in behavior. If he does not already have a healthcare proxy or healthcare power of attorney, and your brother is not of sound mind, the courts will appoint one for him. If he is in assisted living, for example, there may come a time when you will have to move him to a full-time care facility. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     In the absence of long-term-care insurance or Medicaid, I assume you will use (or have used) the proceeds from the sale of his house to pay for his care. Selling a primary residence turns the home's equity from an exempt asset into countable cash, which often exceeds the strict monthly $2,000-$3,000 individual limit for Medicaid, which would lead to a temporary loss of benefits until those funds are spent. A trust and estate attorney can talk through your options. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     You can do this. But you can't - nor should you - do it alone. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Related: 'I am fearful': My ailing relative is being forced into assisted living. What can I do? </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     More columns from Quentin Fottrell: </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Can I stop my kids from using their inheritance to support political causes I vehemently oppose? </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     My wife's credit-card payment is three months overdue. As an authorized user, am I in trouble? </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     My stepmother cheated me out of $500K from my father's estate. What can I do? </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Check out The Moneyist's private Facebook group, where members help answer life's thorniest money issues. Post your questions, or weigh in on the latest Moneyist columns. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     By emailing your questions to The Moneyist or posting your dilemmas on The Moneyist Facebook group, you agree to have them published anonymously on MarketWatch. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     By submitting your story to Dow Jones &amp; Co., the publisher of MarketWatch, you understand and agree that we may use your story, or versions of it, in all media and platforms, including via third parties. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     -Quentin Fottrell </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     This content was created by MarketWatch, which is operated by Dow Jones &amp; Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal. </p>\n<pre class=\"mdc-article-pre\" data-v-370ea3ac=\"\"></pre>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  (END) Dow Jones Newswires</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  02-27-26 1900ET</p>\n\nCopyright (c) 2026 Dow Jones &amp; Company, Inc.</div>",
            "pub_date": "2026-02-28 08:15:57",
            "link": "https://www.morningstar.com/news/marketwatch/20260227551/my-brother-is-paranoid-alone-and-has-forgotten-that-he-sold-his-house-how-can-we-help",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "First Commerce Bancorp, Inc. Announces Conclusion of Tender Offer for its Common Stock",
            "description": "<div class=\"mdc-article-body\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">LAKEWOOD, NJ / <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://www.accessnewswire.com/\" tabindex=\"0\">ACCESS Newswire</a> / February 27, 2026 / </strong>First Commerce Bancorp, Inc., (OTCID:CMRB) (the \"Company\") today announced the conclusion of its previously initiated tender offer to repurchase up to 3,000,000 shares of the Company's common stock (\"Shares\") at a purchase price of $7.00 per Share (the \"Tender Offer\"). The conclusion of the Tender Offer has occurred with the close of business today, Friday, February 27, 2026, at 5:00 P.M. EST.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Performance Trust Capital Partners, LLC, served as Deal Manager for the Tender Offer. Computershare, Inc. served as the Depositary for the Tender Offer while Georgeson, LLC acted as the Company's Information Agent for the Tender Offer.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Based on a preliminary count by the Depository and Deal Manager for the Tender Offer, a total of 2,974,738 shares have been validly tendered and not properly withdrawn pursuant to the tender offer, representing approximately 14.9% of the outstanding Shares. All Shares validly tendered cannot be withdrawn and no additional tenders will be accepted.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">This press release is for informational purposes only and is neither an offer to purchase nor a solicitation of an acceptance of securities. No offer, solicitation, purchase, or sale will be made in any jurisdiction in which such offer, solicitation, or sale would be unlawful. The Tender Offer is being made solely pursuant to the terms and conditions set forth in the Offer to Purchase dated January 28, 2026 (the \"Offer to Purchase\"), and accompanying materials. Shareholders should read such Offer to Purchase and related materials carefully and in their entirety because they contain important information, including the various terms and conditions of the tender offer.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">This press release contains \"forward-looking statements\". Forward-looking statements contain words such as \"anticipate,\" \"believe,\" \"can,\" \"would,\" \"should,\" \"could,\" \"may,\" \"predict,\" \"seek,\" \"potential,\" \"will,\" \"estimate,\" \"target,\" \"plan,\" \"project,\" \"continuing,\" \"ongoing,\" \"expect,\" \"intend\" or similar expressions that relate to the Company's strategy, plans or intentions. Forward-looking statements involve certain important risks, uncertainties and other factors, any of which could cause actual results to differ materially from those in such statements. Such factors include, without limitation, the \"Risk Factors\" referenced in the Offer to Purchase and the following additional factors: ability to execute our business strategy; business and economic conditions; economic, market, operational, liquidity, credit and interest rate risks associated with the Company's business; effects of any changes in trade, monetary and fiscal policies and laws; effects of inflation as well as interest rate, securities market and monetary supply fluctuations; changes in consumer spending, borrowings and savings habits; the Company's ability to achieve organic loan and deposit growth and the composition of such growth; changes in sources and uses of funds; increased competition in the financial services industry; the effect of changes in accounting policies and practices; the share price of the Company's stock; ability to maintain or increase market share and control expenses; costs and effects of changes in laws and regulations and of other legal and regulatory developments; technological changes; the timely development and acceptance of new products and services; ability to implement or improve operational management and other internal risk controls and processes and reporting system and procedures; changes in estimates of future loan reserve requirements based upon the periodic review thereof under relevant regulatory and accounting requirements; widespread natural and other disasters, dislocations, political instability, acts of war or terrorist activities, cyberattacks or international hostilities; impact of reputational risk; and success at managing the risks involved in the foregoing items. The Company can give no assurance that any goal or plan or expectation set forth in forward-looking statements can be achieved and readers are cautioned not to place undue reliance on such statements. The forward-looking statements are made as of the date of this press release, and the Company does not intend, and assumes no obligation, to update any forward-looking statement to reflect events or circumstances after the date on which the statement is made or to reflect the occurrence of unanticipated events or circumstances, except as required by applicable law.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Press Contact:</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Donald Mindiak<br data-v-602de5d2=\"\"/>First Commerce Bancorp, Inc.<br data-v-602de5d2=\"\"/>Lakewood, NJ 08701<br data-v-602de5d2=\"\"/>(732) 364-0032<br data-v-602de5d2=\"\"/><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"mailto:dmindiak@firstcommercebk.com\" tabindex=\"0\">dmindiak@firstcommercebk.com</a><br data-v-602de5d2=\"\"/><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://pr.report/j5h1\" tabindex=\"0\">http://firstcommercebk.com</a></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">SOURCE:</strong> First Commerce Bancorp, Inc.</p><br/><br/>View the original <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://www.accessnewswire.com/newsroom/en/banking-and-financial-services/first-commerce-bancorp-inc.-announces-conclusion-of-tender-offer-for-1142390\" tabindex=\"0\">press release</a> on ACCESS Newswire<br/><br/>\n<span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img mdc-article-image__img--0-width\" data-v-f0ef0696=\"\" style=\"width:0;\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://app.accessnewswire.com/img.ashx?id=1142390\"/></picture></span></div>",
            "pub_date": "2026-02-28 08:15:57",
            "link": "https://www.morningstar.com/news/accesswire/1142390msn/first-commerce-bancorp-inc-announces-conclusion-of-tender-offer-for-its-common-stock",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Secretary of War Pete Hegseth Visits L3Harris Solid Rocket Motor Site",
            "description": "<div class=\"mdc-article-body\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nSecretary of War Pete Hegseth Visits L3Harris Solid Rocket Motor Site\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nSecretary of War Pete Hegseth visited the L3Harris Technologies (NYSE: LHX) Camden site today as part of his nationwide “Arsenal of Freedom” tour, highlighting the importance of American manufacturing capacity in strengthening the defense industrial base and supporting U.S. and allied warfighters.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">This press release features multimedia. View the full release here: <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://www.businesswire.com/news/home/20260227797011/en/\" tabindex=\"0\">https://www.businesswire.com/news/home/20260227797011/en/</a></p><span><span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img\" data-v-f0ef0696=\"\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://mms.businesswire.com/media/20260227797011/en/2733957/4/SecWar_Camden_Visit_for_Business_Wire.jpg\"/></picture></span><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Secretary of War Pete Hegseth addresses a crowd of approximately 1,500 L3Harris employees in Camden, Arkansas, as part of his “Arsenal of Freedom” tour.</p></span><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nSecretary Hegseth toured several of the site’s solid rocket motor production facilities and spoke with the 1,500 employees who design, build and deliver propulsion systems for critical missile programs. L3Harris is investing billions of dollars into modernizing and expanding its sites across the nation to significantly increase solid rocket motor production, including for Munitions Acceleration Council programs.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n“Thank you for being the backbone of our department and our great nation, for having the backs of our warfighters because what you build right here in Camden is absolutely central to the 21st Century Arsenal of Freedom,” Secretary Hegseth said. “You are the patriots ensuring that our warriors are never, ever in a fair fight. The more than 115,000 solid rocket motors that you’re building every single year can’t be matched.”\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n“Industrial capacity has become a strategic element of deterrence; the ability to deliver at scale, with speed and reliability, directly impacts how effectively the United States can deter threats and project peace through strength,” said Christopher Kubasik, Chairman and CEO, L3Harris. “Thank you, Secretary Hegseth, for reinforcing to our Camden team that what L3Harris builds here directly contributes to the safety of our warfighters and our homeland.”\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nDuring the visit, Secretary Hegseth engaged employees who produce the propulsion systems that power the PAC-3 air and missile defense system and met with the teams who manufacture the large solid rocket motors for strategic deterrence, interceptors, hypersonic systems and target missiles. He also reviewed construction progress on the company’s new Arkansas Advanced Propulsion Facilities (AAPF).\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nThe AAPF facilities are an expansive new campus that will support medium and large solid rocket motor production. The 110-acre campus will include more than 20 new buildings and increase large solid rocket motor manufacturing capacity sixfold. The expansion incorporates advanced manufacturing technologies, automation and digital process controls L3Harris designed to improve safety, efficiency and throughput while providing long-term, domestic surge capacity.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nThe Camden site produces thousands of solid rocket motors a year that support a wide range of Department of War programs. L3Harris is investing billions in this competitive market to deliver at the scale and speed the Department of War demands. The company’s 2,000-acre Camden site is one of the nation’s largest solid rocket motor manufacturing centers and has supported national and allied defense missions for more than four decades.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nL3Harris acquired the solid rocket motor business in 2023 and has transformed and grown its production operations to align with the Department of War’s increasing demand for missile programs. L3Harris intends to pursue an initial public offering of the solid rocket motor business in the second half of the year.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">About L3Harris Technologies</strong>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nL3Harris is the Trusted Disruptor in defense tech. With customers’ mission-critical needs always in mind, our employees deliver end-to-end technology solutions connecting the space, air, land, sea and cyber domains in the interest of national security. Visit <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.l3harris.com%2F&amp;esheet=54435301&amp;newsitemid=20260227797011&amp;lan=en-US&amp;anchor=L3Harris.com&amp;index=1&amp;md5=7865616000cb981852c830a95f457183\" tabindex=\"0\">L3Harris.com</a> for more information.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Forward-Looking Statements</strong>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nThis press release contains forward-looking statements that reflect management's current expectations, assumptions and estimates of future performance and economic conditions. Such statements are made in reliance upon the safe harbor provisions of Section 27A of the Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934. The company cautions investors that any forward-looking statements are subject to risks and uncertainties that may cause actual results and future trends to differ materially from those matters expressed in or implied by such forward-looking statements. Statements about future investments and expansions are forward-looking and involve risks and uncertainties. L3Harris disclaims any intention or obligation to update or revise any forward-looking statements, whether as a result of new information, future events, or otherwise.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img\" data-v-f0ef0696=\"\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20260227797011r1&amp;sid=mstr3&amp;distro=nx&amp;lang=en\"/></picture></span><span data-v-602de5d2=\"\"></span></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<em class=\"mdc-article-emphasis\" data-v-370fea16=\"\"><span data-v-370fea16=\"\">Media Contacts</span>:</em>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Eileen Lainez \n</strong><br data-v-602de5d2=\"\"/>Missile Solutions\n<br data-v-602de5d2=\"\"/><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"mailto:Eileen.Lainez@L3Harris.com\" tabindex=\"0\">Eileen.Lainez@L3Harris.com \n</a><br data-v-602de5d2=\"\"/>571-239-7839\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Sara Banda \n</strong><br data-v-602de5d2=\"\"/>Corporate\n<br data-v-602de5d2=\"\"/><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"mailto:Media@L3Harris.com\" tabindex=\"0\">Media@L3Harris.com \n</a><br data-v-602de5d2=\"\"/>321-306-8927\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span data-v-602de5d2=\"\">View source version on businesswire.com: </span><span data-v-602de5d2=\"\"><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://www.businesswire.com/news/home/20260227797011/en/\" tabindex=\"0\">https://www.businesswire.com/news/home/20260227797011/en/</a></span></p></div>",
            "pub_date": "2026-02-28 08:01:29",
            "link": "https://www.morningstar.com/news/business-wire/20260227797011/secretary-of-war-pete-hegseth-visits-l3harris-solid-rocket-motor-site",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Stocks to Watch: Aardvark Therapeutics, Blue Moon Metals",
            "description": "<div class=\"mdc-article-body\">\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  By Katherine Hamilton </p>\n<pre class=\"mdc-article-pre\" data-v-370ea3ac=\"\"></pre>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Aardvark Therapeutics is voluntarily pausing a trial after finding safety issues. Shares slumped 54% to $5.75 in after-hours trading Friday. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Blue Moon Metals plans to acquire a Utah mine from Teck Resources. Shares rose 5.9% to $5.41 after closing up 17%. </p>\n<pre class=\"mdc-article-pre\" data-v-370ea3ac=\"\"></pre>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Write to Katherine Hamilton at katherine.hamilton@wsj.com </p>\n<pre class=\"mdc-article-pre\" data-v-370ea3ac=\"\"></pre>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  (END) Dow Jones Newswires</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  February 27, 2026 18:53 ET (23:53 GMT)</p>\n\nCopyright (c) 2026 Dow Jones &amp; Company, Inc.</div>",
            "pub_date": "2026-02-28 08:01:28",
            "link": "https://www.morningstar.com/news/dow-jones/2026022711903/stocks-to-watch-aardvark-therapeutics-blue-moon-metals",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "University Credit Union Earns GreenPath Growth Guru Partner Excellence Award",
            "description": "<div class=\"mdc-article-body\">\n            \n              \n              University Credit Union Earns GreenPath Growth Guru Partner Excellence Award\n              \n            \n            \n              <span>\n<h2 class=\"mdc-article-heading mdc-heading__mdc mdc-heading--level-5__mdc\" data-v-618d53ae=\"\">University Credit Union Earns GreenPath Growth Guru Partner Excellence Award</h2>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">PR Newswire</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">LOS ANGELES, Feb. 27, 2026</p>\n</span>\n<span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">This Recognition Highlights Leadership in Financial Wellness, Member Impact, and Strategic Collaboration</em></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span data-v-602de5d2=\"\">LOS ANGELES</span>, <span data-v-602de5d2=\"\">Feb. 27, 2026</span> /PRNewswire/ -- University Credit Union (UCU) has been awarded the GreenPath Growth Guru Partner Excellence Award, recognizing outstanding collaboration, measurable impact, and continued leadership in advancing financial wellness for members and communities served.</p>\n<span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://mma.prnewswire.com/media/2847965/University_Credit_Union_Logo.html\" tabindex=\"0\">\n<span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img\" data-v-f0ef0696=\"\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://mma.prnewswire.com/media/2847965/University_Credit_Union_Logo.jpg\"/></picture></span>\n</a>\n</p>\n</span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">The Partner Excellence Awards celebrate organizations that demonstrate exceptional commitment to improving financial well-being through education, counseling, and innovative partnership. UCU was selected for its strategic integration of financial wellness resources, strong member outcomes, and ongoing investment in holistic financial education.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\"By embedding financial education into everyday member interactions and ensuring that resources and guidance are accessible, University Credit Union is creating lasting impact for their members, empowering them to lead financially healthy lives through increased confidence, reduced debt, and financial education,\" said Kristen Holt, GreenPath's President &amp; CEO.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Through its partnership with GreenPath, University Credit Union has expanded access to personalized financial counseling, debt management solutions, and educational programming designed to help members build long-term financial stability.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\"Our partnership with GreenPath highlights what's possible when commitment meets collaboration,\" said University Credit Union's President and Chief Executive Officer, Richard Wada, before adding, \"It is powerful testimony of how we are working hard together to support the financial well-being of our members throughout their financial journeys.\" </p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">UCU continues to embed financial wellness into its broader member experience through workshops, digital education, campus partnerships, and one-on-one counseling referrals. The credit union's approach centers on reducing financial stress, improving decision-making confidence, and strengthening long-term member resilience.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">About University Credit Union</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">University Credit Union is a purpose-driven financial cooperative dedicated to providing a financial edge to the university community. Founded in 1951 by UCLA employees, UCU focuses on member-owner participation and returns profits to its members through better loan rates, higher savings rates, and lower fees. Today, serving over 58,000 members, UCU offers a range of financial products and services, including checking accounts, loans, and insurance, while emphasizing community support and financial education. Learn more at <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4629773-1&amp;h=3719963012&amp;u=https%3A%2F%2Fwww.ucu.org%2F&amp;a=ucu.org\" tabindex=\"0\">ucu.org</a>.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">About GreenPath Financial Wellness</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">As one of the largest financial counseling agencies in the nation, for more than 60 years, GreenPath Financial Wellness has assisted millions of people with debt and credit management, student loans, homeownership, and foreclosure prevention. Headquartered in Michigan, GreenPath and its affiliates work directly with individuals and 580+ credit union, bank, retirement/insurance and employer partners across the U.S. from more than 20 locations and through phone access and online tools. GreenPath is a member of the National Foundation for Credit Counseling and is accredited by the Council on Accreditation. The GreenPath family of companies now includes CONSUMER, Homeownership Preservation Foundation (995-HOPE), Clarifi, and Rural Dynamics, Inc. To learn more, visit <strong class=\"mdc-article-strong\" data-v-479a2324=\"\"><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://edge.prnewswire.com/c/link/?t=0&amp;l=en&amp;o=4629773-1&amp;h=2698506264&amp;u=http%3A%2F%2Fwww.greenpath.org%2F&amp;a=greenpath.org\" tabindex=\"0\">greenpath.org</a></strong> or call 800-550-1961. Follow the nonprofit on Facebook and Instagram @greenpathfinancial and on Twitter @GreenPath.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Contact: Derek Knowlton<br data-v-602de5d2=\"\"/>University Credit Union<br data-v-602de5d2=\"\"/>Email: <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"mailto:marketing@ucu.org\" tabindex=\"0\">marketing@ucu.org</a><br data-v-602de5d2=\"\"/>Phone: 800.UCU.4510</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img mdc-article-image__img--12-width\" data-v-f0ef0696=\"\" style=\"width:12px;\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://edge.prnewswire.com/c/img/favicon.png?sn=LA98323&amp;sd=2026-02-27\"/></picture></span> View original content to download multimedia:<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://www.prnewswire.com/news-releases/university-credit-union-earns-greenpath-growth-guru-partner-excellence-award-302700074.html\" tabindex=\"0\">https://www.prnewswire.com/news-releases/university-credit-union-earns-greenpath-growth-guru-partner-excellence-award-302700074.html</a></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">SOURCE University Credit Union</p></span>\n<span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img\" data-v-f0ef0696=\"\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://rt.prnewswire.com/rt.gif?NewsItemId=LA98323&amp;Transmission_Id=202602271835PR_NEWS_USPR_____LA98323&amp;DateId=20260227\"/></picture></span>\n</div>",
            "pub_date": "2026-02-28 07:51:34",
            "link": "https://www.morningstar.com/news/pr-newswire/20260227la98323/university-credit-union-earns-greenpath-growth-guru-partner-excellence-award",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "TEAMSTERS TO HOST LABOR RALLY AGAINST WAYMO OUTSIDE SAN FRANCISCO CITY HALL",
            "description": "<div class=\"mdc-article-body\">\n            \n              \n              TEAMSTERS TO HOST LABOR RALLY AGAINST WAYMO OUTSIDE SAN FRANCISCO CITY HALL\n              \n            \n            \n              <span>\n<h2 class=\"mdc-article-heading mdc-heading__mdc mdc-heading--level-5__mdc\" data-v-618d53ae=\"\">TEAMSTERS TO HOST LABOR RALLY AGAINST WAYMO OUTSIDE SAN FRANCISCO CITY HALL</h2>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">PR Newswire</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Feb. 27</p>\n</span>\n<span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\"><em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">Unions, Supervisors Demand Answers After Power Outage Fiasco</em></strong></p>\n<span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://mma.prnewswire.com/media/2655485/Teamsters_new_Logo.html\" tabindex=\"0\">\n<span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img\" data-v-f0ef0696=\"\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://mma.prnewswire.com/media/2655485/Teamsters_new_Logo.jpg\"/></picture></span>\n</a>\n</p>\n</span>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">(SAN FRANCISCO) – Teamsters will be joined by members of the Service Employees International Union (SEIU), the International Association of Firefighters (IAFF), and the San Francisco Board of Supervisors for a rally to demand accountability from Waymo on <strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Monday, March 2, at 12:30 p.m. </strong>The rally for good jobs and safe streets will be ahead of a hearing in the Land Use and Transportation Committee, where Waymo representatives will be compelled to testify regarding massive operational failures following a widespread power outage last December.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">During the crisis, Waymo vehicles froze in place, causing traffic jams and exacerbating public safety threats. The robotaxis even blocked first responders and delayed responses to the electrical substation fire that caused the initial outage. It's the latest of many fiascos the robotaxi company has caused as it wages war on public safety and California's middle class.</p><span><table class=\"mdc-article-table mds-data-table mds-data-table--large\" data-v-0db7e951=\"\"><tbody class=\"mdc-article-table-body mds-data-table__body\"><tr class=\"mdc-article-table-row mds-data-table__row\"><td class=\"mdc-article-table-cell mds-data-table__cell\"><br/></td><td class=\"mdc-article-table-cell mds-data-table__cell\"><br/></td></tr><tr class=\"mdc-article-table-row mds-data-table__row\"><td class=\"mdc-article-table-cell mds-data-table__cell\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">WHAT: </strong></span></p></td><td class=\"mdc-article-table-cell mds-data-table__cell\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span data-v-602de5d2=\"\">Labor Rally Against Waymo</span></p></td><td class=\"mdc-article-table-cell mds-data-table__cell\"><br/></td></tr><tr class=\"mdc-article-table-row mds-data-table__row\"><td class=\"mdc-article-table-cell mds-data-table__cell\"><br/></td><td class=\"mdc-article-table-cell mds-data-table__cell\"><br/></td><td class=\"mdc-article-table-cell mds-data-table__cell\"><br/></td></tr><tr class=\"mdc-article-table-row mds-data-table__row\"><td class=\"mdc-article-table-cell mds-data-table__cell\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">WHO: </strong></span></p></td><td class=\"mdc-article-table-cell mds-data-table__cell\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span data-v-602de5d2=\"\">Peter Finn, President of Teamsters Joint Council 7</span></p></td><td class=\"mdc-article-table-cell mds-data-table__cell\"><br/></td></tr><tr class=\"mdc-article-table-row mds-data-table__row\"><td class=\"mdc-article-table-cell mds-data-table__cell\"><br/></td><td class=\"mdc-article-table-cell mds-data-table__cell\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span data-v-602de5d2=\"\">Tony Delorio, Secretary-Treasurer of Teamsters Local 665</span></p></td><td class=\"mdc-article-table-cell mds-data-table__cell\"><br/></td></tr><tr class=\"mdc-article-table-row mds-data-table__row\"><td class=\"mdc-article-table-cell mds-data-table__cell\"><br/></td><td class=\"mdc-article-table-cell mds-data-table__cell\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span data-v-602de5d2=\"\">Quentin Booker, member of Teamsters Local 350</span></p></td><td class=\"mdc-article-table-cell mds-data-table__cell\"><br/></td></tr><tr class=\"mdc-article-table-row mds-data-table__row\"><td class=\"mdc-article-table-cell mds-data-table__cell\"><br/></td><td class=\"mdc-article-table-cell mds-data-table__cell\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span data-v-602de5d2=\"\">Sal Medina, member of Teamsters Local 2785</span></p></td><td class=\"mdc-article-table-cell mds-data-table__cell\"><br/></td></tr><tr class=\"mdc-article-table-row mds-data-table__row\"><td class=\"mdc-article-table-cell mds-data-table__cell\"><br/></td><td class=\"mdc-article-table-cell mds-data-table__cell\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span data-v-602de5d2=\"\">Sam Gebler, President of IAFF Local 798</span></p></td><td class=\"mdc-article-table-cell mds-data-table__cell\"><br/></td></tr><tr class=\"mdc-article-table-row mds-data-table__row\"><td class=\"mdc-article-table-cell mds-data-table__cell\"><br/></td><td class=\"mdc-article-table-cell mds-data-table__cell\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span data-v-602de5d2=\"\">Theresa Rutherford, President of SEIU Local 1021</span></p></td><td class=\"mdc-article-table-cell mds-data-table__cell\"><br/></td></tr><tr class=\"mdc-article-table-row mds-data-table__row\"><td class=\"mdc-article-table-cell mds-data-table__cell\"><br/></td><td class=\"mdc-article-table-cell mds-data-table__cell\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span data-v-602de5d2=\"\">Jackie Fielder, Supervisor for District 9</span></p></td><td class=\"mdc-article-table-cell mds-data-table__cell\"><br/></td></tr><tr class=\"mdc-article-table-row mds-data-table__row\"><td class=\"mdc-article-table-cell mds-data-table__cell\"><br/></td><td class=\"mdc-article-table-cell mds-data-table__cell\"><br/></td><td class=\"mdc-article-table-cell mds-data-table__cell\"><br/></td></tr><tr class=\"mdc-article-table-row mds-data-table__row\"><td class=\"mdc-article-table-cell mds-data-table__cell\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">WHEN: </strong></span></p></td><td class=\"mdc-article-table-cell mds-data-table__cell\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span data-v-602de5d2=\"\">Monday, March 2, at 12:30 p.m.</span></p></td><td class=\"mdc-article-table-cell mds-data-table__cell\"><br/></td></tr><tr class=\"mdc-article-table-row mds-data-table__row\"><td class=\"mdc-article-table-cell mds-data-table__cell\"><br/></td><td class=\"mdc-article-table-cell mds-data-table__cell\"><br/></td><td class=\"mdc-article-table-cell mds-data-table__cell\"><br/></td></tr><tr class=\"mdc-article-table-row mds-data-table__row\"><td class=\"mdc-article-table-cell mds-data-table__cell\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">WHERE: </strong></span></p></td><td class=\"mdc-article-table-cell mds-data-table__cell\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span data-v-602de5d2=\"\">Steps of San Francisco City Hall</span></p></td><td class=\"mdc-article-table-cell mds-data-table__cell\"><br/></td></tr><tr class=\"mdc-article-table-row mds-data-table__row\"><td class=\"mdc-article-table-cell mds-data-table__cell\"><br/></td><td class=\"mdc-article-table-cell mds-data-table__cell\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span data-v-602de5d2=\"\">1 Dr Carlton B Goodlett Place</span></p></td><td class=\"mdc-article-table-cell mds-data-table__cell\"><br/></td></tr><tr class=\"mdc-article-table-row mds-data-table__row\"><td class=\"mdc-article-table-cell mds-data-table__cell\"><br/></td><td class=\"mdc-article-table-cell mds-data-table__cell\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span data-v-602de5d2=\"\">San Francisco, CA 94102</span></p></td><td class=\"mdc-article-table-cell mds-data-table__cell\"><br/></td></tr><tr class=\"mdc-article-table-row mds-data-table__row\"><td class=\"mdc-article-table-cell mds-data-table__cell\"><br/></td><td class=\"mdc-article-table-cell mds-data-table__cell\"><br/></td><td class=\"mdc-article-table-cell mds-data-table__cell\"><br/></td></tr><tr class=\"mdc-article-table-row mds-data-table__row\"><td class=\"mdc-article-table-cell mds-data-table__cell\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">VISUALS: </strong></span></p></td><td class=\"mdc-article-table-cell mds-data-table__cell\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span data-v-602de5d2=\"\">Speakers, large crowd holding signs that say, \"Driverless is Dangerous\" and \"People Over Robots.\"</span></p></td><td class=\"mdc-article-table-cell mds-data-table__cell\"><br/></td></tr></tbody></table></span><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Contact:<br data-v-479a2324=\"\"/></strong><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Alexandra Banash, (510) 418-2612<br data-v-479a2324=\"\"/></strong><strong class=\"mdc-article-strong\" data-v-479a2324=\"\"><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"mailto:alexandra@teamjc7.org\" tabindex=\"0\">alexandra@teamjc7.org</a></strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">/PRNewswire -- Feb. 27, 2026/</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">SOURCE Teamsters Joint Council 7</p></span>\n</div>",
            "pub_date": "2026-02-28 07:46:21",
            "link": "https://www.morningstar.com/news/pr-newswire/20260227ph98316/teamsters-to-host-labor-rally-against-waymo-outside-san-francisco-city-hall",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Private-credit 'cockroaches' and the AI 'scare trade' hammered stocks in February. Here's what else has investors shaken up.",
            "description": "<div class=\"mdc-article-body\">\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  By Joseph Adinolfi, Joy Wiltermuth and Isabel Wang </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     A plethora of issues pushed U.S. stocks lower in the final trading session of a rough month </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     The S&amp;P 500 stumbled amid a turbulent February for stocks </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Stocks were caught up Friday in a whirlwind of market-moving headlines, making for a wild final trading day in a rough month for U.S. equities. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     The penultimate day of February saw President Trump signal that the U.S. military remains ready to strike Iran. There also were more problems on the inflation and private-credit fronts, with shares of financial stocks - banks and asset managers alike - selling off hard. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Investors largely blamed the collapse of U.K.-based mortgage lender Market Financial Solutions for reviving fears about more \"cockroaches\" to come in the private-credit industry. But there was also an announcement from Apollo Global Management (APO) that it had reduced a dividend at a private-credit fund and re-evaluated some asset values due to challenges with its loan portfolio. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     The KBW Nasdaq Bank Index BKX fell nearly 5% to cap off the month. Shares of Blue Owl Capital (OWL) fell nearly 6%, while Apollo's stock was down more than 8%, FactSet data showed. Blue Owl spooked investors earlier in February when it limited investor withdrawals and sold $1.4 billion in private-credit assets, including some software loans. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Other issues for investors arrived ahead of the opening bell, including a troubling inflation report that showed wholesale prices rose by 0.5% in January - faster than the 0.3% increase economists had expected. Meanwhile, what some have called the artificial-intelligence \"fear trade\" remained in full effect. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     \"Investors are readjusting their risk budget right now in a risk-off mood on Friday, and that the AI momentum is now becoming AI anxiety,\" said Brian Mulberry, chief market strategist at Zacks Investment Management. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     A 'shoot first, ask questions later' market </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Software stocks and megacap technology players like Nvidia (NVDA) continued to struggle on Friday, adding to their already punishing losses over the past month. This time, semiconductor stocks - particularly highflying memory names like Sandisk (SNDK) and Micron Technology (MU), which have soared recently while software has plunged - joined in the selling as well. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Stocks trading outside of the U.S. mostly continued to trundle higher in February, with big gains particularly in the South Korean market. But in the U.S., a dour mood has been underscored by a couple of apparent contradictions, as Jay Hatfield, a portfolio manager at Infrastructure Capital Advisors, pointed out during a conversation with MarketWatch. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     First, sentiment in certain corners of the market has soured dramatically, even though the S&amp;P 500 SPX finished Friday roughly 2 percentage points shy of record territory. Second, there are seemingly contradictory narratives causing havoc within the technology sector, the largest and most important sector for the U.S. equity market's overall stability. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Megacap tech stocks are struggling as investors balk at the massive spending on AI infrastructure, seemingly worried about the possibility that the return on investment might be too weak to justify the tremendous cost. Recent earnings reports from Microsoft (MSFT) and Amazon.com (AMZN) elicited negative reactions from investors, while even blockbuster earnings from Nvidia earlier this week weren't enough to turn the tide. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Meanwhile, fears that AI might be so successful it turns whole industries on their heads have hammered shares of software companies, asset managers, commercial real-estate and brokerage firms, cybersecurity companies, and even transportation and logistics firms. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     \"These ideas don't even make sense internally - but they're all out there, and all of these companies are going down,\" Hatfield told MarketWatch Friday. \"This is a 'shoot first, ask questions later' kind of market.\" </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     A Substack post penned by Citrini Research that went viral Monday was widely credited with inspiring the worst selloff in stocks in three weeks. The report envisioned an economy in 2028 where AI is successful enough to cause widespread white-collar job destruction, without new industries emerging to absorb displaced workers. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     \"AI has been disrupting a different segment of the economy on a daily basis,\" said Michael Hans, chief investment officer at Citizens Wealth, in a phone interview Friday. He noted that \"the narrative has been shifting\" away from talk of huge productivity gains from AI to worries over potential job losses and damage to the economy. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     A puzzling bid for bonds </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     There also has been a sudden bid for bonds. Instead of Treasury yields rising on signs that inflation might be rearing back up, the benchmark 10-year rate BX:TMUBMUSD10Y slipped below the 4% threshold on Friday. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Read: The bond market has been doing something strange despite a hot inflation report </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Inflation can be kryptonite for bonds. But lately, inflation and the timing of any future Federal Reserve interest-rate cuts have taken a backseat to investors seeking safety from the selloff in software names, said Sweta Singh, a portfolio manager at City Different Investments. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     \"It's the legacy [software-as-a-service] scared money that is being parked into the Treasury market,\" Singh told MarketWatch. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     This dynamic has also helped bonds shrug off the Supreme Court's decision to rule most of President Trump's tariffs illegal, Singh noted. The ruling raised new questions about the size of U.S. fiscal deficits. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     In other haven plays, the U.S. dollar DXY failed to gain ground Friday against a basket of rival currencies, despite Trump saying he would \"love not to\" attack Iran. Yet gold (GC00,) which global central banks have been stockpiling as a dollar alternative, has been playing second fiddle to silver (SI00) as investors grow more nervous about a splintering world order. Both metals saw their largest monthly gains on record in February, Dow Jones Market Data showed. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     A \"panic\" rotation has also helped boost shares of defensive stocks in the consumer-staples sector. Investors trawling for value stocks have also boosted shares of energy and materials names. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     See: February's 'panic' rotation in stocks sets the stage for more tumult in March </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Both the S&amp;P 500 and the Nasdaq Composite COMP finished in the red on Friday, and both indexes capped off their worst monthly drop since March 2025, according to Dow Jones Market Data. The tech-heavy Nasdaq has now fallen during three of the past four months. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     Yet it wasn't all bad news. The blue-chip Dow Jones Industrial Average DJIA managed to eke out a gain for the month - taking its winning streak to 10 months, its longest such run since January 2018. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     -Joseph Adinolfi -Joy Wiltermuth -Isabel Wang </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n     This content was created by MarketWatch, which is operated by Dow Jones &amp; Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal. </p>\n<pre class=\"mdc-article-pre\" data-v-370ea3ac=\"\"></pre>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  (END) Dow Jones Newswires</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  02-27-26 1830ET</p>\n\nCopyright (c) 2026 Dow Jones &amp; Company, Inc.</div>",
            "pub_date": "2026-02-28 07:46:20",
            "link": "https://www.morningstar.com/news/marketwatch/20260227549/private-credit-cockroaches-and-the-ai-scare-trade-hammered-stocks-in-february-heres-what-else-has-investors-shaken-up",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Algo Grande Copper Closes Oversubscribed $6.52 Million Financing and Strengthens Board at AGM",
            "description": "<div class=\"mdc-article-body\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><em class=\"mdc-article-emphasis\" data-v-370fea16=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">THIS NEWS RELEASE IS NOT FOR DISTRIBUTION TO U.S. NEWSWIRE SERVICES FOR DISSEMINATION IN THE UNITED STATES</strong></em></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">VANCOUVER, BC / <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://www.accessnewswire.com/\" tabindex=\"0\">ACCESS Newswire</a> / February 27, 2026 / </strong>Algo Grande Copper Corp. (\"Algo Grande\") (TSXV:ALGR)(OTC:KNDYF)(FRA:KM00) announces the closing of its previously announced non-brokered private placement and the election of three new directors at its Annual General Meeting held on February 25, 2026.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Pursuant to its news releases dated February 11, 2026 and February 19, 2026, the Company has closed its previously announced non-brokered private placement (the \"Offering\") of common shares in the capital of the Company (the \"Shares\"), at a deemed price of $0.65 per Share. The Offering consisted of 10,037,020 Shares for aggregate gross proceeds of $6,524,063.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">The Offering will fund the next phase of exploration at the Company's 100%-owned Adelita Project in Sonora, Mexico, focused on a Phase II drill program. Phase I drilling at the Cerro Grande skarn intersected multiple stacked Cu-Au-Ag skarn horizons at depth, including skarn zones that had not been identified by historic drilling. The upcoming program will target expansion drilling at Cerro Grande and first-pass drilling along an approximately 6-kilometre prospective limestone corridor hosting multiple, undrilled, outcropping skarn targets. Proceeds from the Offering will also be used for additional operating costs and general working capital requirements.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Commenting on the opportunity at Adelita, newly elected Director Raymond Jannas stated: \"The Adelita Project exhibits many of the characteristics we look for in emerging district-scale systems, high-grade skarn mineralization with clear geological vectors toward a deeper potential porphyry source. What excites me most is the combination of compelling geology and a focused, determined team that is executing with discipline. With capital in place and a clear exploration roadmap, Algo Grande is well positioned to unlock the broader potential of this system.\"</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">In connection with the closing of the Offering, the Company paid certain eligible finders (each, a \"Finder\") aggregate cash commissions of $169,605.44, being equal to 7% of the aggregate gross proceeds raised from those purchasers introduced by such Finder, and issued 355,863 common share purchase warrants (each, a \"Finder Warrant\") being equal to 7% of the number of Shares purchased by those purchasers introduced by such Finder. Each Finder Warrant entitles the holder thereof to acquire a Share (each, a \"Finder's Warrant Share\") at an exercise price of $0.65 per Finder's Warrant Share until the date that is three years after issuance.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Additionally, Canaccord Genuity Corp. (\"Canaccord\") acted as financial advisor to the Company in connection with the Offering. The Company paid Canaccord a corporate finance fee of $50,000 (the \"Corporate Finance Fee\"). The Corporate Finance Fee was settled through the issuance of 76,923 Shares at a deemed price of $0.65 per Share.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Securities issued in the Offering are subject to a four-month hold period in accordance with applicable securities laws, which will expire four months and one day from the date of closing of the Offering. The Offering is subject to certain conditions including, but not limited to, receipt of all necessary approvals, including approval of the TSX Venture Exchange.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">The Company also announces that at its Annual General Meeting held on February 25, 2026, shareholders approved all matters brought before the meeting, including the election of three new directors:</p><ul class=\"mdc-article-list mdc-article-list--unordered\" data-v-7b473e83=\"\"><li data-v-7b473e83=\"\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Raymond Jannas</p></li><li data-v-7b473e83=\"\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Hunter Scharfe</p></li><li data-v-7b473e83=\"\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Enrico Gay</p></li></ul><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">The appointments follow the Company's previously announced board strengthening initiatives (see news release dated February 11, 2026).</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Certain directors of the Company (the \"Insiders\") subscribed for an aggregate of 77,155 Shares for aggregate gross proceeds of $50,150.75 in the Offering. The Insiders' participation constitutes a \"related party transaction\" within the meaning of Multilateral Instrument 61-101 - <em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">Protection of Minority Security Holders in Special Transactions</em> (\"MI 61-101\"). The Company is relying on the exemption from the valuation requirements and minority shareholder approvals in MI 61-101 pursuant to subsections 5.5(a) and 5.7(1)(a) of MI 61-101, respectively, as the value of the Insiders' participation in the Offering does not represent more than 25% of the Company's market capitalization, as determined in accordance with MI 61-101.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">This news release does not constitute an offer to sell or a solicitation of an offer to buy any of the securities in the United States. The securities have not been and will not be registered under the United States Securities Act of 1933, as amended (the \"U.S. Securities Act\"), or any state securities laws, and may not be offered or sold within the United States or to U.S. persons unless registered under the U.S. Securities Act and applicable state securities laws or an exemption from such registration is available.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">About Algo Grande Copper Corp.</strong><br data-v-602de5d2=\"\"/>Algo Grande Copper Corp. is a growth-focused mineral exploration company advancing the Adelita Project, a district-scale, multi-system copper-gold-silver opportunity positioned in the prolific Arizona-Sonora copper belt.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">The company is dedicated to unlocking the full potential of this under-explored corridor through disciplined data-driven exploration, technical excellence, and a firm commitment to value creation for shareholders. The 5,895-hectare Adelita Project is anchored by the high-grade Cerro Grande Cu-Au-Ag skarn discovery, which exhibits strong continuity along a defined corridor extending over 6 kilometers. Reprocessing of legacy geophysical data and field mapping indicate the presence of a potential porphyry system at depth, suggesting a classic skarn-porphyry mineralization model similar to major deposits found throughout northwestern Mexico.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">ON BEHALF OF ALGO GRANDE COPPER CORP.</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Enrico Gay<br data-v-602de5d2=\"\"/>Chief Executive Officer</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">For more information, please contact:</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">E-mail: <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"mailto:info@algo-grande.com\" tabindex=\"0\">info@algo-grande.com</a></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">Website: <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://pr.report/j58y\" tabindex=\"0\">www.algo-grande.com</a></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Cautionary Statement on Forward-Looking Information</strong></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">NEITHER THE TSX VENTURE EXCHANGE NOR ITS REGULATION SERVICES PROVIDER (AS THAT TERM IS DEFINED IN THE POLICIES OF THE TSX VENTURE EXCHANGE) ACCEPTS RESPONSIBILITY FOR THE ADEQUACY OR ACCURACY OF THIS RELEASE.</em></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">This news release contains statements and information that, to the extent that they are not historical fact, constitute \"forward-looking information\" within the meaning of applicable securities legislation. Forward-looking information is based on the reasonable assumptions, estimates, analysis and opinions of management made in light of its experience and its perception of trends, current conditions and expected developments, as well as other factors that management believes to be relevant and reasonable in the circumstances at the date that such statements are made, but which may prove to be incorrect. Forward-looking information involves known and unknown risks, uncertainties and other factors that may cause the actual results, performance or achievements of the Algo Grande to differ materially from any future results, performance or achievements expressed or implied by the forward-looking information, including, but not limited to, regulatory approvals for the Offering and the anticipated use of proceeds therefrom, and those listed in filings made by Algo Grande with the Canadian securities regulatory authorities (which may be viewed at </em><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://pr.report/j58z\" tabindex=\"0\"><em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">www.sedarplus.ca</em></a><em class=\"mdc-article-emphasis\" data-v-370fea16=\"\">). Accordingly, readers should not place undue reliance on any such forward-looking information. Further, any forward-looking statement speaks only as of the date on which such statement is made. New factors emerge from time to time, and it is not possible for Algo Grande's management to predict all of such factors and to assess in advance the impact of each such factor on Algo Grande's business or the extent to which any factor, or combination of factors, may cause actual results to differ materially from those contained in any forward- looking statements. Algo Grande does not undertake any obligation to update any forward-looking information to reflect information, events, results, circumstances or otherwise after the date hereof or to reflect the occurrence of unanticipated events, except as required by law including securities laws.</em></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><strong class=\"mdc-article-strong\" data-v-479a2324=\"\">SOURCE: </strong>Algo Grande Copper Corp.</p><br/><br/>View the original <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://www.accessnewswire.com/newsroom/en/business-and-professional-services/algo-grande-copper-closes-oversubscribed-6.52-million-financing-1142397\" tabindex=\"0\">press release</a> on ACCESS Newswire<br/><br/>\n<span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img mdc-article-image__img--0-width\" data-v-f0ef0696=\"\" style=\"width:0;\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://app.accessnewswire.com/img.ashx?id=1142397\"/></picture></span></div>",
            "pub_date": "2026-02-28 07:31:38",
            "link": "https://www.morningstar.com/news/accesswire/1142397msn/algo-grande-copper-closes-oversubscribed-652-million-financing-and-strengthens-board-at-agm",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Moody's Raises Slovenia's Rating to A2",
            "description": "<div class=\"mdc-article-body\">\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  By Amira McKee </p>\n<pre class=\"mdc-article-pre\" data-v-370ea3ac=\"\"></pre>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Moody's upgraded Slovenia citing the country's recent pension reform and strong debt management. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  The ratings agency upgraded the government of Slovenia's long-term issuer and senior unsecured bond ratings to A2 from A3. The outlook was revised to stable from positive. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Slovenia's recent pension reform has enhanced the country's economic and fiscal resilience by keeping workers in the labour force for longer, Moody's said. The change in pension policy reduces the fiscal headwinds from ageing costs and suggests that the debt burden will remain stable despite population ageing, Moody's said. </p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  The country's rating is also supported by a strong capital base, productivity growth and high debt affordability, reflecting Slovenia's strong debt management, Moody's said. Though Slovenia faces geopolitical risks and defense spending pressures, the country's strong institutions and resilient economy will contain fiscal risks and preserve macroeconomic stability, Moody's said. </p>\n<pre class=\"mdc-article-pre\" data-v-370ea3ac=\"\"></pre>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  Write to Amira McKee at amira.mckee@wsj.com </p>\n<pre class=\"mdc-article-pre\" data-v-370ea3ac=\"\"></pre>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  (END) Dow Jones Newswires</p>\n<p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n  February 27, 2026 18:15 ET (23:15 GMT)</p>\n\nCopyright (c) 2026 Dow Jones &amp; Company, Inc.</div>",
            "pub_date": "2026-02-28 07:31:37",
            "link": "https://www.morningstar.com/news/dow-jones/2026022711783/moodys-raises-slovenias-rating-to-a2",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "National Condom Month: Why Today’s Protection Is About Pleasure, Confidence and Connection, According to Sex & Relationship Expert, Dr. Deb Laino",
            "description": "<div class=\"mdc-article-body\"><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">National Condom Month: Why Today’s Protection Is About Pleasure, Confidence and Connection, According to Sex &amp; Relationship Expert, Dr. Deb Laino</strong>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nIn recognition of National Condom Month, sex and relationship therapist Dr. Deb Laino is encouraging young adults to prioritize safer sex practices - not just for protection, but for the emotional and relational benefits that come with feeling secure and aligned with your partner. As conversations around consent and sexual wellness continue to evolve, Dr. Laino emphasizes that condoms are not just about prevention - they help create a shared understanding of responsibility, reduce anxiety around unintended consequences, and allow couples to be more present with one another.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n“Being responsible and using condoms should feel seamless, not awkward,” says Dr. Laino. “When you feel confident and comfortable, you can focus on the chemistry, the closeness, and the experience you’re creating together - which is what truly enhances pleasure and connection.”\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nWhen used correctly and consistently, condoms remain one of the most effective and accessible methods for helping prevent sexually transmitted infections (STIs) and unintended pregnancy. But beyond protection, they can also increase emotional safety, build mutual trust, and remove distractions or worry that can interfere with intimacy - ultimately allowing partners to feel more relaxed, confident, and connected in the moment.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nAmong one of the newest sexual health innovations is <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.trojanbrands.com%2Fen%2Fproducts%2Fcondoms%2Ftrojan-goat-non-latex-lubricated-condoms&amp;esheet=54435690&amp;newsitemid=20260227512574&amp;lan=en-US&amp;anchor=Trojan+G.O.A.T.%26%238482%3B+%28Greatest+of+All+Trojan%29&amp;index=1&amp;md5=381cf76f158d740af1f7cf2b11a378fe\" tabindex=\"0\">Trojan G.O.A.T.™ (Greatest of All Trojan)</a> from Trojan Brand Condoms. Made with patent-pending UltraFlex™ Non-Latex material, G.O.A.T. is designed to be soft, flexible, strong, odorless, and colorless - helping partners experience a closer, more natural feel. The material is engineered to enhance body heat transfer and adapt to movement, supporting comfort and a sense of next-level intimacy without compromising reliability.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nTrojan also offers a range of condoms to meet different preferences, including <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.trojanbrands.com%2Fen%2Fproducts%2Fcondoms%2Ftrojan-pleasure-pack-lubricated-condoms&amp;esheet=54435690&amp;newsitemid=20260227512574&amp;lan=en-US&amp;anchor=Trojan+Pleasure+Pack&amp;index=2&amp;md5=a3284e703410bf2ec39275cfd468c5d4\" tabindex=\"0\">Trojan Pleasure Pack</a>, which provides a mix of textures and sensations; <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.trojanbrands.com%2Fen%2Fproducts%2Fcondoms%2Ftrojan-raw-thin-lubricated-condoms&amp;esheet=54435690&amp;newsitemid=20260227512574&amp;lan=en-US&amp;anchor=Trojan+BareSkin+Raw&amp;index=3&amp;md5=d2a48cb755f8df2a6ce9d5c810f5121d\" tabindex=\"0\">Trojan BareSkin Raw</a>, designed for an ultra-thin feel; and <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.trojanbrands.com%2Fen%2Fproducts%2Fcondoms%2Fmagnum-xl-lubricated-condoms&amp;esheet=54435690&amp;newsitemid=20260227512574&amp;lan=en-US&amp;anchor=Trojan+Magnum&amp;index=4&amp;md5=9229d45b44d6ea45fec93edb24a67b14\" tabindex=\"0\">Trojan Magnum</a> condoms, created for those who prefer a larger fit for added comfort and security.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nDr. Laino encourages individuals to approach safe sex proactively - having conversations with partners ahead of time, choosing products that feel comfortable, and viewing condom use as a shared responsibility.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\nFor more information on Dr. Deb Laino, please visit the following <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.yoursexdoc.com%2F&amp;esheet=54435690&amp;newsitemid=20260227512574&amp;lan=en-US&amp;anchor=website&amp;index=5&amp;md5=ce85328e6fc2379b73aec50a82d24173\" tabindex=\"0\">website</a>.\n\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span class=\"mdc-article-image\" data-v-f0ef0696=\"\"><picture class=\"mdc-responsive-image mdc-article-image__img\" data-v-f0ef0696=\"\"> <img alt=\"\" class=\"mdc-responsive-image__image\" src=\"https://cts.businesswire.com/ct/CT?id=bwnews&amp;sty=20260227512574r1&amp;sid=mstr3&amp;distro=nx&amp;lang=en\"/></picture></span><span data-v-602de5d2=\"\"></span></p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\">\n<strong class=\"mdc-article-strong\" data-v-479a2324=\"\">Media Contact\n<br data-v-479a2324=\"\"/></strong>Kaitlin Boyle, <a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"mailto:kaitlin.boyle@gcw.agency\" tabindex=\"0\">kaitlin.boyle@gcw.agency</a>\n</p><p class=\"mdc-article-paragraph\" data-v-602de5d2=\"\"><span data-v-602de5d2=\"\">View source version on businesswire.com: </span><span data-v-602de5d2=\"\"><a class=\"mdc-link__mdc mdc-link--body__mdc\" href=\"https://www.businesswire.com/news/home/20260227512574/en/\" tabindex=\"0\">https://www.businesswire.com/news/home/20260227512574/en/</a></span></p></div>",
            "pub_date": "2026-02-28 07:11:29",
            "link": "https://www.morningstar.com/news/business-wire/20260227512574/national-condom-month-why-todays-protection-is-about-pleasure-confidence-and-connection-according-to-sex-relationship-expert-dr-deb-laino",
            "source": "morningstar",
            "kind": 1,
            "language": "en"
        }
    ]
}