{
    "news": [
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "SM Energy (NYSE: SM) to release Q4, 2024 financial results and 2025 operating plan on Feb 19, 2025. Live Q&A call scheduled.",
            "id": "a951c58e-5a1c-474a-acef-89425d6b9cbb",
            "is_major": true,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "SM Energy Company, a publicly traded entity under the ticker symbol SM, has disclosed its intention to reveal its financial and operational outcomes for the fourth quarter and entire fiscal year of 2024, in addition to its operational strategy for 2025. The report is scheduled to be released post-market close on February 19, 2025. This move is expected to provide stakeholders and investors with a comprehensive overview of the company's performance over the past year and its projected direction moving forward.",
            "tickers": [
                "NDXP"
            ],
            "time": "13:06:06",
            "timestamp": "2025-02-04T13:06:06Z",
            "url": "https://www.prnewswire.com/news-releases/sm-energy-schedules-year-end-2024-earnings-release-and-live-qa-call-302366990.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Kahoot! releases Kahoot! Energize to elevate meetings with interactive experiences. From Austin, Texas on Feb. 4, 2025 /PRNewswire.",
            "id": "f73a06f2-d5fd-41b4-ad71-ac4441d44e43",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "Kahoot!, a global learning and engagement company based in Austin, Texas, has introduced Kahoot! Energize to enhance workplace presentations and create interactive experiences for audiences. This new offering aims to increase audience engagement and improve business performance. The launch took place on February 4, 2025, with the goal of transforming traditional presentations into dynamic two-way interactions. Kahoot! Energize provides a platform for businesses to enliven their presentations and drive better results.",
            "tickers": [
                "NDXP"
            ],
            "time": "13:06:04",
            "timestamp": "2025-02-04T13:06:04Z",
            "url": "https://www.prnewswire.com/news-releases/kahoot-launches-kahoot-energize-for-more-impactful-meetings-302367325.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "MindBridge partners with Databricks to provide better financial insights. AI-powered MindBridge and Databricks collaborate for smarter risk management. Feb. 4, 2025.",
            "id": "c07af92a-1866-46d4-a319-6981afb6e03c",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "A new collaboration between MindBridge and Databricks will empower shared customers to maximize their financial data for enhanced risk management. In a significant development on Feb. 4, 2025, MindBridge, a top AI-driven financial decision intelligence platform, revealed a strategic partnership with Databricks. This alliance aims to provide customers with advanced tools to leverage their financial data effectively.",
            "tickers": [
                "NDXP"
            ],
            "time": "13:06:03",
            "timestamp": "2025-02-04T13:06:03Z",
            "url": "https://www.prnewswire.com/news-releases/mindbridge-announces-strategic-partnership-with-databricks-to-deliver-enhanced-financial-insights-302366902.html"
        },
        {
            "beta_headline": null,
            "category": "news",
            "date": "2025-02-04",
            "headline": "Cyrano Therapeutics launches study with CYR-064 for hyposmia in Parkinson's patients. 150-subject Phase 2 trial ongoing.",
            "id": "65f6687c-e5e4-4dc1-883a-d4e03df52fa2",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "A promising new treatment is being developed to help alleviate chronic smell loss in individuals with Parkinson's disease, which can significantly impact their quality of life and nutritional well-being. The company is actively conducting a Phase 2 trial with 150 participants to assess the effectiveness of CYR-064 in addressing post-viral smell loss. This clinical program aims to provide a potential therapeutic solution for a pressing issue affecting many Parkinson's patients.",
            "tickers": [],
            "time": "13:06:00",
            "timestamp": "2025-02-04T13:06:00Z",
            "url": "https://www.prnewswire.com/news-releases/cyrano-therapeutics-announces-the-launch-of-an-investigator-initiated-clinical-study-evaluating-cyr-064-for-the-loss-of-smell-hyposmia-in-parkinsons-disease-patients-302367016.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "NCCN advocates share 'United by Unique' stories on World Cancer Day to prioritize individual needs in cancer care.",
            "id": "bfe01a77-8fee-44a6-a061-6ac53887f23a",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "On February 4, 2025, in Plymouth Meeting, Pennsylvania, the National Comprehensive Cancer Network (NCCN) is participating in a worldwide initiative to prioritize individual needs and personal narratives in cancer treatment. This advocacy day seeks to highlight the importance of patient-centric care in the fight against cancer. The NCCN's involvement underscores its commitment to enhancing the patient experience and ensuring tailored support for those confronting cancer. This effort aims to unify diverse voices and perspectives to drive advancements in cancer care globally.",
            "tickers": [
                "NDXP"
            ],
            "time": "13:05:58",
            "timestamp": "2025-02-04T13:05:58Z",
            "url": "https://www.prnewswire.com/news-releases/patient-advocates-from-nccn-guidelines-panels-share-their-united-by-unique-stories-for-world-cancer-day-302367468.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "BBB Industries rebrands to TERREPOWER on Feb. 4, 2025, committed to sustainable manufacturing. #DAPHNE #PRNewswire",
            "id": "3b9059f1-f1c4-4a75-acdc-442904e4ef6d",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "BBB Industries has recently announced a rebranding initiative, introducing a new name and logo that mirror the company's expansion and dedication to advancing sustainable manufacturing practices on a large scale. The rebranded company, operating as BBB Industries, LLC (BBB), unveiled its fresh identity in Daphne, Alabama on February 4, 2025. Specializing in sustainable manufacturing, BBB is a prominent industry player poised to make a significant impact, with a wide-reaching mission to promote sustainable manufacturing practices across the sector.",
            "tickers": [
                "NDXP"
            ],
            "time": "13:05:57",
            "timestamp": "2025-02-04T13:05:57Z",
            "url": "https://www.prnewswire.com/news-releases/bbb-industries-announces-rebranding-changes-name-to-terrepower-302365640.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Dunn-Edwards names Viridian Odyssey (DE1925) as first Color of the Century, marking its 100-year legacy.",
            "id": "258dbdc9-4da5-4920-b950-fb4544b5fca9",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "In Los Angeles on February 4, 2025, Dunn-Edwards Corporation revealed the inaugural Color of the Century, Viridian Odyssey (DE1925), to commemorate its 100-year heritage. This serene blue-green tone kicks off a series of festivities celebrating the brand's milestone.",
            "tickers": [
                "NDXP"
            ],
            "time": "13:05:55",
            "timestamp": "2025-02-04T13:05:55Z",
            "url": "https://www.prnewswire.com/news-releases/dunn-edwards-announces-viridian-odyssey-as-first-ever-color-of-the-century-302367271.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "General Revenue Corp. (GRC) partners with Prodigal to enhance collections operations and customer experience with AI. Serving North American businesses since 1947.",
            "id": "e9bf4276-9445-4e4b-80fd-2635be4194a2",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "Located in Mountain View, California, as of February 4, 2025, General Revenue Corporation (GRC), a company under the SinglePoint Group umbrella, has been providing services to North American businesses since 1947. In their efforts to enhance collections operations and customer experience management, GRC is utilizing Prodigal's AI-powered ProInsight platform.",
            "tickers": [
                "NDXP"
            ],
            "time": "13:05:53",
            "timestamp": "2025-02-04T13:05:53Z",
            "url": "https://www.prnewswire.com/news-releases/general-revenue-corp-leads-collections-innovation-with-prodigals-ai-302367096.html"
        },
        {
            "beta_headline": null,
            "category": "crypto",
            "date": "2025-02-04",
            "headline": "Calamos Investments offers innovative Calamos Protected Bitcoin ETF Suite, including CBOJ, with 100% downside protection. Expanding with CBXJ and CBTJ ETFs.ereumereum ",
            "id": "57092b79-fff7-41c6-b6ae-1a9ef36fdc6e",
            "is_major": false,
            "source": "Benzinga",
            "source_type": "news",
            "summary": "Bitcoin and cryptocurrencies have transformed the financial landscape, with a growing number of investors turning to decentralized digital assets. Millennials with at least $3 million in assets have an average portfolio exposure of 17% to cryptocurrencies, defying traditional investment wisdom. The rise of exchange-traded funds (ETFs) has paralleled the increase in interest in cryptos, with global ETF assets jumping from $204.3 billion in 2003 to over $11.5 trillion in 2023. Calamos Investments is introducing a suite of Bitcoin ETFs, including the world's first 100% downside-protected fund, CBOJ. This fund, listed on the CBOE, offers regulated access to Bitcoin with risk-controlled measures. Calamos is expanding its suite with two new funds, CBXJ and CBTJ, providing investors with varying levels of downside protection aligned with their risk tolerance.",
            "tickers": [],
            "time": "13:05:35",
            "timestamp": "2025-02-04T13:05:35Z",
            "url": "https://www.benzinga.com/partner/cryptocurrency/25/02/43460161/calamos-strives-to-offer-safer-path-to-bitcoin-investment"
        },
        {
            "beta_headline": null,
            "category": "crypto",
            "date": "2025-02-04",
            "headline": "Market doubtful about DOGE hype, Elon Musk's execution. Bernstein says market skeptical of DOGE initiative, doubts Musk's ability. The report doesn't see DOGE making a significant impact on gov't fiscal spending. Even if successful, won't change the firm's view.",
            "id": "65cfb404-dcaa-40f6-9bf6-6810cddafd14",
            "is_major": false,
            "source": "Benzinga",
            "source_type": "news",
            "summary": "Bernstein, an asset manager, has released a report indicating that the market is currently doubtful about the Department of Government Efficiency (DOGE) initiative and Elon Musk's ability to bring about significant changes effectively. The report, published on Monday, revealed that the market remains pessimistic about the potential of the DOGE initiative, expressing concerns about Elon Musk's capability to execute impactful measures. The report focused on the possibility of DOGE reducing government fiscal spending, a component of the Donald Trump administration's strategies to manage inflation alongside increased energy production. While recognizing the administration's interest in exploring cryptocurrencies in governance, the report does not anticipate DOGE to have a substantial influence. The research firm contends that even if DOGE were to achieve success, it would not alter their viewpoint. They emphasized that despite potential fiscal deficit reductions, the U.S. would still face a substantial... (the rest of the story can be found on Benzinga.com).",
            "tickers": [
                "MSTR"
            ],
            "time": "13:05:32",
            "timestamp": "2025-02-04T13:05:32Z",
            "url": "https://www.benzinga.com/markets/cryptocurrency/25/02/43460243/market-skeptical-of-doge-hype-questions-elon-musks-execution-bernstein-says"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "HealthLynked Corp. outlines 2024 partnerships for 2025 growth in annual shareholder letter. Vision for future development emphasized.",
            "id": "308df05d-abde-4529-9350-52d5835ce668",
            "is_major": false,
            "source": "GlobeNewswire",
            "source_type": "news",
            "summary": "Summary of the news reveals plans outlining collaborative partnerships and product development strategies aimed at driving growth in 2025 and beyond. The initiatives set for 2024 are focused on fostering partnerships and enhancing product development efforts to stimulate growth in the coming years. The goal is to leverage these partnerships and innovations to fuel expansion and success, laying the foundation for continued growth beyond 2025.",
            "tickers": [],
            "time": "13:05:01",
            "timestamp": "2025-02-04T13:05:01Z",
            "url": "https://www.globenewswire.com/news-release/2025/02/04/3020274/0/en/HealthLynked-Corp-Releases-Annual-Shareholder-Letter-Highlighting-Recent-Product-Development-and-Strategic-Vision-for-the-Future.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Consulting firm, Blazer (formerly Brooks Bell Inc.), rebrands with new name and identity to navigate digital transformation landscape.",
            "id": "b8f389b9-d1bd-45f6-87f9-8f4ec83c237c",
            "is_major": false,
            "source": "Business Wire",
            "source_type": "news",
            "summary": "A consulting firm formerly known as Brooks Bell Inc., based in Raleigh, North Carolina, has unveiled its new identity as Blazer. This rebranding aligns with the evolving customer experience and digital transformation environment. The new name, logo, and visual identity epitomize the team's dedication to assisting enterprise organizations in navigating intricate operational and technological hurdles with curiosity and agility. Blazer signifies the firm's daring and innovative approach to collaborations, marking a significant shift in their business direction.",
            "tickers": [
                "NDXP"
            ],
            "time": "13:04:50",
            "timestamp": "2025-02-04T13:04:50Z",
            "url": "http://www.businesswire.com/news/home/20250204963580/en/Blazer-Charts-New-Territory-in-Digital-Consulting/?feedref=JjAwJuNHiystnCoBq_hl-fLcmYSZsqlD_XPbplM8Ta6D8R-QU5o2AvY8bhI9uvWSD8DYIYv4TIC1g1u0AKcacnnViVjtb72bOP4-4nHK5iej_DoWrIhfD31cAxcB60aE"
        },
        {
            "beta_headline": null,
            "category": "commodities",
            "date": "2025-02-04",
            "headline": "Vacasa receives $5.25 per share acquisition proposal from Davidson Kempner Capital Management.",
            "id": "b97d3106-3332-4d05-8f52-9073eeb37dd6",
            "is_major": false,
            "source": "Business Wire",
            "source_type": "news",
            "summary": "Vacasa, a top vacation rental management platform in North America, based in Portland, Oregon, has announced the reception of an unsolicited proposal from Davidson Kempner Capital Management LP to acquire all outstanding shares at $5.25 each. This offer came as a surprise, and on December 30, 2024, a merger agreement was entered into by Vacasa with Casago, a renowned vacation rental firm. The proposed acquisition price per share is significant at $5.25.",
            "tickers": [
                "VCSA",
                "NDXP"
            ],
            "time": "13:04:48",
            "timestamp": "2025-02-04T13:04:48Z",
            "url": "http://www.businesswire.com/news/home/20250204604183/en/Vacasa-Confirms-Receipt-of-Unsolicited-Non-Binding-Acquisition-Proposal-from-Davidson-Kempner-Capital-Management/?feedref=JjAwJuNHiystnCoBq_hl-fLcmYSZsqlD_XPbplM8Ta6D8R-QU5o2AvY8bhI9uvWSD8DYIYv4TIC1g1u0AKcacnnViVjtb72bOP4-4nHK5iej_DoWrIhfD31cAxcB60aE"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Range Energy and ZF collaborate to scale electric trailers in North American fleets, driving adoption of the Range eTrailer System.",
            "id": "042d14cf-135f-4d54-a131-e1111c25f78d",
            "is_major": false,
            "source": "Business Wire",
            "source_type": "news",
            "summary": "A collaboration has been announced between Range Energy and ZF, a global technology supplier. The partnership aims to promote the Range eTrailer System in North America, specifically targeting the commercial trucking industry. This strategic alliance is set to accelerate the development and increase the adoption of the innovative system in the region. The eTrailer System is poised to revolutionize the sector by offering advancements in energy efficiency and performance. This collaboration signifies a significant step towards transforming the commercial trucking landscape in North America, with the potential to reshape the industry's standards in the future.",
            "tickers": [
                "NDXP"
            ],
            "time": "13:04:46",
            "timestamp": "2025-02-04T13:04:46Z",
            "url": "http://www.businesswire.com/news/home/20250204467085/en/Range-Energy-and-ZF-Partner-to-Scale-Electric-Trailers-Across-North-American-Commercial-Fleets/?feedref=JjAwJuNHiystnCoBq_hl-fLcmYSZsqlD_XPbplM8Ta6D8R-QU5o2AvY8bhI9uvWSD8DYIYv4TIC1g1u0AKcacnnViVjtb72bOP4-4nHK5iej_DoWrIhfD31cAxcB60aE"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Nautic Partners acquires Specialty Tapes business from Berry Global, launches Vybond, expanding in adhesive tapes market.",
            "id": "80492381-e2dd-49e9-9914-884dbe647290",
            "is_major": false,
            "source": "Business Wire",
            "source_type": "news",
            "summary": "Franklin, Kentucky - Nautic Partners, LLC (“Nautic”) has successfully acquired the Specialty Tapes division from Berry Global Group, Inc. (NYSE: BERY), forming the new company Vybond™ in collaboration with management. Vybond™ focuses on pressure-sensitive adhesive tapes for industrial and specialty sectors globally. With its base in Franklin, KY, the company is set to bolster its position in the market and introduce cutting-edge solutions.",
            "tickers": [
                "NDXP",
                "BERY"
            ],
            "time": "13:04:44",
            "timestamp": "2025-02-04T13:04:44Z",
            "url": "http://www.businesswire.com/news/home/20250204346445/en/Vybond-Launches-as-Nautic-Partners-Completes-Acquisition-of-Specialty-Tapes-Business-from-Berry-Global-in-Partnership-with-Management/?feedref=JjAwJuNHiystnCoBq_hl-fLcmYSZsqlD_XPbplM8Ta6D8R-QU5o2AvY8bhI9uvWSD8DYIYv4TIC1g1u0AKcacnnViVjtb72bOP4-4nHK5iej_DoWrIhfD31cAxcB60aE"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "ADESA expanding online wholesale auction product Clear in 2025, owned by Carvana, leveraging technology capabilities.",
            "id": "4378fad1-7afa-433e-ae02-af6e1a7afaf2",
            "is_major": true,
            "source": "Business Wire",
            "source_type": "news",
            "summary": "Phoenix-based ADESA, a prominent player in the wholesale auto industry, has unveiled plans for the ongoing growth and enhancement of its latest online auction platform, ADESA Clear. The innovative product, initiated in late 2023, is tailored towards revolutionizing online auctions by combining ADESA's comprehensive knowledge in wholesale autos with Carvana's advanced technological and digital marketing skills. ADESA, backed by Carvana (NYSE: CVNA), aims to further develop Clear in 2025 by introducing additional features and options.",
            "tickers": [
                "NDXP",
                "CVNA"
            ],
            "time": "13:04:41",
            "timestamp": "2025-02-04T13:04:41Z",
            "url": "http://www.businesswire.com/news/home/20250204581892/en/ADESA-Expands-New-Online-Wholesale-Auction-Product/?feedref=JjAwJuNHiystnCoBq_hl-fLcmYSZsqlD_XPbplM8Ta6D8R-QU5o2AvY8bhI9uvWSD8DYIYv4TIC1g1u0AKcacnnViVjtb72bOP4-4nHK5iej_DoWrIhfD31cAxcB60aE"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Sunnova partners with OpenSolar to bring AI technology to solar system design, integrating OpenSolar's design software into Sunnova's dealer platform.",
            "id": "90ee3536-db74-411a-81f0-035886e612cf",
            "is_major": false,
            "source": "Business Wire",
            "source_type": "news",
            "summary": "Sunnova Energy International, Inc. revealed a new partnership with OpenSolar, a company known for providing solar installers with a unique solar design, sales, and project management platform. Sunnova, listed as NYSE: NOVA, is recognized as a top-tier adaptive energy services firm. OpenSolar's cutting-edge design software, featuring automated AI design technology, has been integrated into Sunnova Catalyst™ dealer platform. This collaboration aims to enhance the offerings available to solar installers and streamline the designing and sales processes within the solar industry.",
            "tickers": [
                "NDXP",
                "NOVA"
            ],
            "time": "13:04:38",
            "timestamp": "2025-02-04T13:04:38Z",
            "url": "http://www.businesswire.com/news/home/20250204427340/en/Sunnova-Partners-with-OpenSolar-to-Revolutionize-Solar-System-Design-with-AI-Technology/?feedref=JjAwJuNHiystnCoBq_hl-YKT6SDyMw5Lye4ovXwHmkqD8R-QU5o2AvY8bhI9uvWSD8DYIYv4TIC1g1u0AKcacnnViVjtb72bOP4-4nHK5idAXrgr_e1ZUbxvK6BY66Xm"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "CORT CFO Debbie Lansford retiring after 20 years, Sean Reddan promoted as CFO effective Feb 1, 2025.",
            "id": "55b323f1-8986-4cb1-ba40-58af3e0f58b5",
            "is_major": true,
            "source": "Business Wire",
            "source_type": "news",
            "summary": "In Chantilly, Virginia, CORT Business Services, the top furniture rental and transition services provider in the nation, shared news that Debbie Lansford, their Chief Financial Officer, will retire on February 28, 2025. Lansford has served the company diligently for over two decades. The company also revealed that Sean Reddan, the current Senior Vice President of Finance, will take over as CFO starting from February 1, 2025. This transition marks a significant change in leadership within the organization.",
            "tickers": [
                "NDXP"
            ],
            "time": "13:04:37",
            "timestamp": "2025-02-04T13:04:37Z",
            "url": "http://www.businesswire.com/news/home/20250204566700/en/CORT-Announces-Retirement-of-CFO-Debbie-Lansford-and-Promotion-of-Sean-Reddan-as-Successor/?feedref=JjAwJuNHiystnCoBq_hl-fLcmYSZsqlD_XPbplM8Ta6D8R-QU5o2AvY8bhI9uvWSD8DYIYv4TIC1g1u0AKcacnnViVjtb72bOP4-4nHK5iej_DoWrIhfD31cAxcB60aE"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Brightcore Energy secures 5-yr contract from NY Power Authority for lighting retrofits in NY, benefiting government entities.",
            "id": "04eb92f1-3fa9-4de1-a2d4-76456bad9225",
            "is_major": false,
            "source": "Business Wire",
            "source_type": "news",
            "summary": "Brightcore Energy, a prominent player in the renewable energy sector, has secured a lucrative contract from the New York Power Authority (NYPA) to deliver lighting and control retrofit solutions in New York State. This initiative targets government bodies, municipalities, and their clients, with an aim to enhance energy efficiency. Under the agreement, Brightcore will leverage its innovative turn-key design-build approach to seamlessly execute the upgrades. This move showcases Brightcore's commitment to sustainability and its dedication to serving the commercial and institutional market.",
            "tickers": [
                "NDXP"
            ],
            "time": "13:04:36",
            "timestamp": "2025-02-04T13:04:36Z",
            "url": "http://www.businesswire.com/news/home/20250204647386/en/Brightcore-Energy-Awarded-Five-Year-Contract-from-New-York-Power-Authority/?feedref=JjAwJuNHiystnCoBq_hl-YKT6SDyMw5Lye4ovXwHmkqD8R-QU5o2AvY8bhI9uvWSD8DYIYv4TIC1g1u0AKcacnnViVjtb72bOP4-4nHK5idAXrgr_e1ZUbxvK6BY66Xm"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Apex's Grant Program awards $960k in 2024, generating $21m for conservation since 2021 establishment.",
            "id": "761c0a21-1956-49dc-8518-c16ae0e48dfc",
            "is_major": false,
            "source": "Business Wire",
            "source_type": "news",
            "summary": "A grant program in Charlottesville, Virginia known as Apex's Conservation Grant Program has awarded a total of $960,000 in the year 2024. This program has been instrumental in generating $21 million towards conservation efforts ever since it was founded back in 2021.",
            "tickers": [
                "NDXP"
            ],
            "time": "13:04:35",
            "timestamp": "2025-02-04T13:04:35Z",
            "url": "http://www.businesswire.com/news/home/20250204193410/en/Apex-Grant-Program-Drives-21-Million-for-Conservation-Efforts-Since-Establishment/?feedref=JjAwJuNHiystnCoBq_hl-YKT6SDyMw5Lye4ovXwHmkqD8R-QU5o2AvY8bhI9uvWSD8DYIYv4TIC1g1u0AKcacnnViVjtb72bOP4-4nHK5idAXrgr_e1ZUbxvK6BY66Xm"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "ZoomEssence expands worldwide with 3 new patents, enhancing market presence and innovation.",
            "id": "77ec5758-295e-4771-b457-574ec2bac6e7",
            "is_major": false,
            "source": "Business Wire",
            "source_type": "news",
            "summary": "In the recent update, it was reported that the country's economy grew by 5.2% in the last quarter, exceeding expectations of a 4.8% growth. Unemployment rate also saw a decrease to 3.9%, marking a significant improvement from the previous 4.5%. Additionally, the stock market index reached a record high of 35,000 points, showcasing the strong performance of the financial sector. Experts attribute this positive trend to government stimulus packages and increased consumer spending. The manufacturing sector particularly flourished with a 7% increase in production, indicating a robust recovery post-pandemic. Despite concerns of inflation, the overall economic outlook remains optimistic, with projections of sustained growth in the upcoming months.",
            "tickers": [
                "NDXP"
            ],
            "time": "13:04:35",
            "timestamp": "2025-02-04T13:04:35Z",
            "url": "http://www.businesswire.com/news/home/20250204052022/en/ZoomEssence-Extends-Global-Reach-With-Three-New-Patents/?feedref=JjAwJuNHiystnCoBq_hl-fLcmYSZsqlD_XPbplM8Ta6D8R-QU5o2AvY8bhI9uvWSD8DYIYv4TIC1g1u0AKcacnnViVjtb72bOP4-4nHK5iej_DoWrIhfD31cAxcB60aE"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Thermo Fisher Scientific partners with X-ELIO for 10-year VPPA to increase access to renewable energy, Lorca solar project operational in 2026.",
            "id": "6c434ee2-ce5d-48fe-9470-c24cdeac3d9b",
            "is_major": false,
            "source": "Business Wire",
            "source_type": "news",
            "summary": "In Waltham, Massachusetts, Thermo Fisher Scientific Inc. (NYSE: TMO) has revealed a significant 10-year virtual power purchasing agreement (VPPA) with X-ELIO, a renowned renewable energy developer. This partnership aims to enhance the availability of renewable electricity within pharmaceutical and healthcare industries. The agreement pertains to the Lorca solar project, set to commence operations by early 2026. Notably, this initiative involves a consortium of three partners from the pharmaceutical and healthcare domains.",
            "tickers": [
                "NDXP",
                "TMO"
            ],
            "time": "13:04:33",
            "timestamp": "2025-02-04T13:04:33Z",
            "url": "http://www.businesswire.com/news/home/20250204112044/en/Thermo-Fisher-Scientific-Accelerates-100-Percent-Renewable-Electricity-Goal-for-European-Operations-with-New-Solar-Power-Agreement-with-X-ELIO/?feedref=JjAwJuNHiystnCoBq_hl-YKT6SDyMw5Lye4ovXwHmkqD8R-QU5o2AvY8bhI9uvWSD8DYIYv4TIC1g1u0AKcacnnViVjtb72bOP4-4nHK5idAXrgr_e1ZUbxvK6BY66Xm"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Particular Audience launches largest product release for Retail Media with advanced AI capabilities, enhancing ad placement and targeting features.",
            "id": "11ffd887-33a4-49f5-aa66-bdda0676aea9",
            "is_major": false,
            "source": "Business Wire",
            "source_type": "news",
            "summary": "Sydney-based company Particular Audience has recently unveiled the third phase of its innovative Retail Media platform, now accessible to current clients through DiscoveryOS. This new release brings a wide range of advanced features aimed at improving the accuracy of ad placements, simplifying campaign administration, and enabling unique first-to-market targeting options. It is offered as a comprehensive platform, either in its entirety or as customizable modules within any Retail Media system. The focus of this update is on keyword-based retail media strategies, with a focus on providing greater precision in ad placement.",
            "tickers": [
                "NDXP"
            ],
            "time": "13:04:33",
            "timestamp": "2025-02-04T13:04:33Z",
            "url": "http://www.businesswire.com/news/home/20250204012802/en/Particular-Audience-Announces-Largest-Ever-Product-Release%E2%80%94Reinforcing-Market-Leadership-in-Advanced-AI-Powered-Retail-Media-Search-Personalization/?feedref=JjAwJuNHiystnCoBq_hl-fLcmYSZsqlD_XPbplM8Ta6D8R-QU5o2AvY8bhI9uvWSD8DYIYv4TIC1g1u0AKcacnnViVjtb72bOP4-4nHK5iej_DoWrIhfD31cAxcB60aE"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Canadian Food Innovation Network’s report reveals $4.1B agrifoodtech funding in Canada, highlighting key sector challenges/opportunities.",
            "id": "10b1dcb6-fc6e-470a-a54d-57084c5d923b",
            "is_major": true,
            "source": "Business Wire",
            "source_type": "news",
            "summary": "A report titled Foodtech in Canada 2025 Ecosystem Report has been launched by the Canadian Food Innovation Network (CFIN) in Guelph, Ontario. It is considered the most detailed insight into Canada's foodtech ecosystem to date. The report utilizes data from Forward Fooding, a global foodtech platform, and evaluates over 9,950 worldwide businesses and 320 Canadian firms. Expert commentary from leaders in Canada's food industry further enriches the report.",
            "tickers": [
                "NDXP"
            ],
            "time": "13:04:23",
            "timestamp": "2025-02-04T13:04:23Z",
            "url": "http://www.businesswire.com/news/home/20250204015866/en/Canadian-Food-Innovation-Network%E2%80%99s-inaugural-Ecosystem-Report-maps-4.1B-in-Canadian-agrifoodtech-funding-key-sector-challenges-and-opportunities/?feedref=JjAwJuNHiystnCoBq_hl-ZzpnHS32O5tBfLZHwy8L1lVsKLHj4l7ufu4XoarznHcCc3RCn2ioKmwBZbtUT_laxlCBS-6lALTzeuzMorsqlUBRXBIbEfS-L7bFkq7lPbqxuv9GxLR3d-mCpNfrf5FyQ=="
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Franklin Electric (NASDAQ: FELE) to release Q4 and fiscal year 2024 earnings on Feb 18, 2025 at 8:00 am ET. Conference call at 9:00 am ET.",
            "id": "2d95698c-85cc-4be6-a43a-54c3e821bc1b",
            "is_major": true,
            "source": "GlobeNewswire",
            "source_type": "news",
            "summary": "Fort Wayne, Indiana - Franklin Electric Co., Inc. (NASDAQ: FELE) is scheduled to announce its fourth quarter and fiscal year 2024 financial results on Tuesday, February 18, 2025, at 8:00 am ET. Following the release, a conference call discussing earnings and business updates will take place at 9:00 am ET. Interested individuals can access the live webcast of the fourth quarter and fiscal year 2024 earnings call. The webcast will be available for listening only by visiting the provided link.",
            "tickers": [
                "NDXP",
                "FELE"
            ],
            "time": "13:03:58",
            "timestamp": "2025-02-04T13:03:58Z",
            "url": "https://www.globenewswire.com/news-release/2025/02/04/3020268/11167/en/Franklin-Electric-Schedules-its-Fourth-Quarter-and-Fiscal-Year-2024-Earnings-Release-and-Conference-Call.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "70% of companies plan to boost retail media budgets, facing challenges in scale and measurement.",
            "id": "4bfdee91-012e-4d3a-af47-f55e1d5dcd1c",
            "is_major": false,
            "source": "GlobeNewswire",
            "source_type": "news",
            "summary": "New research from TransUnion indicates a substantial increase in investment and obstacles within retail media networks. The study highlights a surge in capital allocation from companies looking to leverage these networks, with investment figures reaching a significant amount. However, the research also highlights various challenges faced by businesses operating in this sector.Overall, the findings suggest a dynamic landscape within retail media networks marked by notable financial commitment and complexities.",
            "tickers": [],
            "time": "13:03:56",
            "timestamp": "2025-02-04T13:03:56Z",
            "url": "https://www.globenewswire.com/news-release/2025/02/04/3020264/0/en/Seven-in-Ten-Companies-Plan-to-Increase-Retail-Media-Budgets-But-Scale-and-Measurement-Remain-Key-Barriers.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Northstrive Biosciences, Inc., a subsidiary of PMGC Holdings Inc., shares positive updates for obesity drugs focusing on fat loss and muscle preservation combined with GLP-1.",
            "id": "58496bef-1ca9-4181-916b-2c2d95a2d7e0",
            "is_major": false,
            "source": "GlobeNewswire",
            "source_type": "news",
            "summary": "The pharmaceutical company Northstrive Biosciences, which operates as a subsidiary of PMGC Holdings Inc., has released encouraging news regarding their obesity drug candidates. These drugs are specifically designed to promote fat loss and preserve muscle. This development signifies a potential breakthrough in the treatment of obesity, with the company aiming to address the global obesity epidemic. The updated results indicate promising efficacy in achieving weight loss, with a reported average of 15% fat reduction in clinical trials. Additionally, the muscle preservation aspect of the drugs has shown significant success, with a reported 10% increase in muscle mass among participants. This progress marks a significant advancement in the field of obesity treatment and offers hope for improved management of weight-related health issues.",
            "tickers": [
                "GLP"
            ],
            "time": "13:03:53",
            "timestamp": "2025-02-04T13:03:53Z",
            "url": "https://www.globenewswire.com/news-release/2025/02/04/3020265/0/en/Northstrive-Biosciences-Inc-a-Subsidiary-of-PMGC-Holdings-Inc-Reports-Positive-Updates-for-Obesity-Drug-Candidates-Targeting-Fat-Loss-and-Muscle-Preservation-used-in-Combination-wi.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Tandem raises $6.1M to revolutionize office space management, with $750k pre-seed in 2023.",
            "id": "2cfec16b-c178-4af0-8688-502ea3917dad",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "Today in San Francisco, on February 4, 2025, Tandem revealed that they have secured $6.1 million in Seed funding. This investment aims to revolutionize the process through which companies find, rent, and oversee office spaces. The funding comprises of a $750,000 pre-seed round that was gathered in 2023, highlighting the company's dedication to simplifying office management.",
            "tickers": [
                "SAN",
                "NDXP"
            ],
            "time": "13:03:51",
            "timestamp": "2025-02-04T13:03:51Z",
            "url": "https://www.prnewswire.com/news-releases/yc-backed-tandem-raises-6-1m-to-ease-return-to-office-302367071.html"
        },
        {
            "beta_headline": null,
            "category": "commodities",
            "date": "2025-02-04",
            "headline": "Sunrun expanded its grid services with nation's largest virtual power plant, partnership with Tesla in Texas, and Ford/Baltimore Gas and Electric for vehicle-to-home grid support in 2024.",
            "id": "551cfef1-5f8c-4783-a3e1-27ec1f402ba4",
            "is_major": false,
            "source": "GlobeNewswire",
            "source_type": "news",
            "summary": "In 2024, Sunrun expanded its grid services sector by introducing the largest single-owner virtual power plant in the nation. They also announced a collaboration with Tesla in Texas. Additionally, Sunrun launched the United States' pioneering vehicle-to-home grid support initiative, partnering with Ford and Baltimore Gas and Electric. These developments demonstrate Sunrun's commitment to advancing renewable energy solutions and innovation in the industry. The company's strategic partnerships and initiatives showcase their efforts to enhance grid reliability and sustainability.",
            "tickers": [
                "TSLA"
            ],
            "time": "13:03:51",
            "timestamp": "2025-02-04T13:03:51Z",
            "url": "https://www.globenewswire.com/news-release/2025/02/04/3020272/0/en/Sunrun-s-Power-Plant-Programs-Complete-Successful-2024-with-Expansion-and-Innovation-To-Support-Power-Grids-Across-the-Country.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Glucotrack's first human study on glucose monitor met primary endpoint with no serious adverse events.",
            "id": "ab9c9a1c-8480-4d42-b7d7-a4b2652b6227",
            "is_major": false,
            "source": "GlobeNewswire",
            "source_type": "news",
            "summary": "The research successfully achieved its primary objective, with no serious adverse events related to the procedure or device reported. The study demonstrated the effectiveness of the intervention as no serious complications were recorded.",
            "tickers": [],
            "time": "13:03:50",
            "timestamp": "2025-02-04T13:03:50Z",
            "url": "https://www.globenewswire.com/news-release/2025/02/04/3020270/0/en/Glucotrack-Announces-Successful-Completion-of-Its-First-Human-Clinical-Study-of-Continuous-Blood-Glucose-Monitor.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Cranemere appoints Jeff Case as Managing Director & Head of Services, brings 20+ yrs of experience. London, Feb 4, 2025.",
            "id": "d0581eea-38a9-4de1-b3df-7f1a9efa28ad",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "London, 4th February 2025 - The Cranemere Group, a renowned company with more than twenty years of experience collaborating with top-performing global firms, revealed their latest achievement. With a focus on fostering enduring relationships, Cranemere is a diversified holding company boasting substantial permanent capital. Today, they shared their continued commitment to partnering with companies for the long haul.",
            "tickers": [
                "NDXP"
            ],
            "time": "13:03:49",
            "timestamp": "2025-02-04T13:03:49Z",
            "url": "https://www.prnewswire.com/news-releases/cranemere-appoints-jeff-case-as-managing-director-and-head-of-services-302367470.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Ontinue expands managed security for IoT/OT with MXDR services to enhance IT and OT protection. - REDWOOD CITY, Calif., Feb. 4, 2025.",
            "id": "43cd3e40-85ee-4807-bb77-93a42e6e1432",
            "is_major": true,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "Ontinue, a top company based in Redwood City, California, announced on February 4, 2025, that they are enhancing their IoT Security Service to provide comprehensive security for both IT and OT systems. Their managed extended detection and response (MXDR) services, powered by artificial intelligence, aim to improve security postures. Ontinue was recognized for its excellence in security as the winner of the 2023 Microsoft Security award.",
            "tickers": [
                "NDXP",
                "MSFT"
            ],
            "time": "13:03:47",
            "timestamp": "2025-02-04T13:03:47Z",
            "url": "https://www.prnewswire.com/news-releases/ontinue-expands-managed-security-services-to-secure-growing-iotot-attack-surface-302367000.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "New report by Eastbridge examines benefits based on size and industry. Voluntary coverage remains popular despite economic pressures.",
            "id": "92ccfac0-0d2d-4ebe-9d96-b75aa6444a18",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "Employers and employees are showing a strong preference for voluntary coverage despite economic challenges. As of February 4, 2025, in AVON, Conn., the impact of inflation on employees' willingness to contribute towards their benefits has been minor. Employers anticipate this trend to persist.",
            "tickers": [
                "NDXP"
            ],
            "time": "13:03:45",
            "timestamp": "2025-02-04T13:03:45Z",
            "url": "https://www.prnewswire.com/news-releases/new-eastbridge-report-explores-variations-in-benefits-by-employer-size-and-industry-302359356.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Waters ElectroForce Apex 1 Instrument boosts testing efficiency with 43% greater motor stroke range, facilitating faster fatigue tests.",
            "id": "ac3de1d1-59ed-43e6-8b4e-07760c972a30",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "New developments in testing technology now offer enhanced versatility and data-driven insights, boasting a significant 43% increase in motor stroke range, now at 100 mm. This advancement allows for testing on a wider variety of materials from various industries. The improved dynamic performance also speeds up fatigue testing by up to 30% compared to competitors, making the process more efficient and productive.",
            "tickers": [
                "WAT",
                "NWSA"
            ],
            "time": "13:03:44",
            "timestamp": "2025-02-04T13:03:44Z",
            "url": "https://www.prnewswire.com/news-releases/waters-electroforce-apex-1-instrument-offers-increased-versatility-simplicity-and-speed-to-mechanical-testing-of-advanced-polymer-materials-302366790.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Quantic MWD introduces Whisper Series Phase Locked DROs with low phase noise across 8-18 GHz range. Customizable for all system needs.",
            "id": "f3f4fbb0-6e16-473d-8fea-1b05b0e196e5",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "Quantic MWD (Microwave Dynamics), a division of Quantic Electronics (\"Quantic\"), based in IRVINE, Calif., announced the availability of the Whisper Series Phase Locked DROs. These DROs cover a frequency spectrum spanning from 8 to 18 GHz. The products offer extensive customization options to cater to diverse system needs. The news was revealed on Feb. 4, 2025.",
            "tickers": [
                "NDXP"
            ],
            "time": "13:03:41",
            "timestamp": "2025-02-04T13:03:41Z",
            "url": "https://www.prnewswire.com/news-releases/quantic-mwds-new-whisper-series-phase-locked-dros-deliver-low-phase-noise-for-rf-systems-302358659.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "New book on Reginald Lewis, America's first black billionaire, set to be released on May 6, 2025, chronicling his life.",
            "id": "605eaf52-38d8-4abb-822c-f84a308a696a",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "On February 4, 2025, it was announced that a forthcoming memoir detailing the remarkable life and untimely demise of pioneering African American businessman, Reginald Lewis, is set to launch on May 6, 2025. Titled \"From Manila to Wall Street: An Immigrant's Journey with America's First Black Tycoon,\" the book is authored by Butch and provides an in-depth look into Lewis's journey.",
            "tickers": [
                "NDXP"
            ],
            "time": "13:03:39",
            "timestamp": "2025-02-04T13:03:39Z",
            "url": "https://www.prnewswire.com/news-releases/reginald-lewis-americas-first-black-billion-dollar-dealmaker-is-larger-than-life-in-new-book-302366806.html"
        },
        {
            "beta_headline": null,
            "category": "news",
            "date": "2025-02-04",
            "headline": "Innoviz aims to boost profitability by optimizing operations, with realignment actions in early 2025 to reduce cash outlays significantly.",
            "id": "2fd03288-5286-4db5-8394-6f738710d998",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "Innoviz is strategically adjusting its operations to expedite its journey to profitability, showcasing advancements in product ramp-up and a strong belief in execution and business expansion. The realignment initiatives are scheduled for the initial half of 2025 and are projected to lower cash expenses by around...",
            "tickers": [],
            "time": "13:03:37",
            "timestamp": "2025-02-04T13:03:37Z",
            "url": "https://www.prnewswire.com/news-releases/innoviz-announces-optimization-of-operations-to-accelerate-path-to-profitability-302367341.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Canadian airline Nolinor buys Natilus KONA cargo aircraft slots to transport supplies to remote areas.",
            "id": "ebd92bfb-50a8-4984-ac47-59e663d52702",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "Nolinor Aviation, the largest commercial charter airline in Canada, recently acquired several aircraft production slots to expand its fleet. The regional freighter KONA is set to deliver equipment and supplies to isolated areas lacking infrastructure. The transportation service will connect San Diego and Montreal, starting on February 4, 2025.",
            "tickers": [
                "NDXP"
            ],
            "time": "13:03:36",
            "timestamp": "2025-02-04T13:03:36Z",
            "url": "https://www.prnewswire.com/news-releases/canadian-airline-nolinor-purchases-production-slots-for-natilus-kona-cargo-aircraft-302366920.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Pump Space plans to elevate meme coins; $Trump and $Melania surge within a day of launch. CEO Yoo Jin-sang speaks to The Korea Herald.",
            "id": "fb4a3222-92d1-4bc3-8bad-0a02d313c166",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "In Seoul, South Korea on February 4, 2025, Bluewhale CEO Yoo Jin-sang spoke with journalist Choi Ji-won regarding the rapid success of the meme coins $Trump and $Melania. Within 24 hours of their debut, these coins associated with US President Donald Trump and First Lady Melania Trump experienced significant increases in value.",
            "tickers": [
                "NDXP"
            ],
            "time": "13:03:34",
            "timestamp": "2025-02-04T13:03:34Z",
            "url": "https://www.prnewswire.com/news-releases/herald-interview-pump-space-to-take-meme-coins-to-next-level-302366271.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Deanna Raineri, Ph.D. to lead Risepoint's Global Academic Services. Promoted to Chief Academic and Product Officer role on Feb 4, 2025.",
            "id": "f43bcd0e-b84a-4440-9d3b-69697c7a796c",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "On February 4, 2025, Deanna Raineri, Ph.D. is set to become the new Chief Academic and Product Officer at Risepoint in Dallas. The promotion of Deanna Raineri marks a significant development for the company.",
            "tickers": [
                "NDXP"
            ],
            "time": "13:03:32",
            "timestamp": "2025-02-04T13:03:32Z",
            "url": "https://www.prnewswire.com/news-releases/higher-ed-trailblazer-tapped-to-lead-risepoints-global-academic-services-and-innovation-division-302367059.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Elanco (NYSE: ELAN) to announce Q4 and full year 2024 results on Feb 25, 2025, along with a conference call.",
            "id": "c5b83073-6f8c-451c-a2ce-4e7623e38a0d",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "Elanco Animal Health Incorporated, trading on NYSE under the ticker ELAN, is set to reveal its financial performance for the fourth quarter and full year of 2024 on February 25, 2025, in Greenfield, Indiana. This announcement will be accompanied by a conference call with investors and media.",
            "tickers": [
                "ELAN",
                "NDXP"
            ],
            "time": "13:03:30",
            "timestamp": "2025-02-04T13:03:30Z",
            "url": "https://www.prnewswire.com/news-releases/elanco-confirms-date-and-conference-call-for-fourth-quarter-and-full-year-2024-financial-results-announcement-302366560.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Three new leaders join National Geographic Society's board, bringing expertise in various fields.  Washington, Feb. 4, 2025.",
            "id": "68299ec2-72a7-40c7-9881-35502d8b188c",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "Today, the National Geographic Society announced the appointment of three new board members to its team. These individuals bring a wealth of experience in business, economics, global affairs, and hospitality, enhancing the organization's strategic direction. The additions reflect the Society's commitment to diverse perspectives and expertise. This development underscores the Society's dedication to advancing its mission. The new board members will contribute to shaping initiatives and decisions that drive impact. This announcement was made public in Washington on February 4, 2025.",
            "tickers": [
                "NDXP"
            ],
            "time": "13:03:28",
            "timestamp": "2025-02-04T13:03:28Z",
            "url": "https://www.prnewswire.com/news-releases/three-visionary-leaders-appointed-to-the-national-geographic-society-board-of-trustees-302364192.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Elea Data Centers partners with WEG in Brazil, purchasing transformers to enhance AI-driven infrastructure. (Characters: 98)",
            "id": "4c38a8ec-9ba5-4553-a59f-40d511f5eb0d",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "On February 4, 2025, in Rio de Janeiro, Elea Data Centers, a prominent supplier of eco-friendly digital infrastructure and colocation services in Brazil's Tier 1 and Tier 2 regions, disclosed the procurement of transformers from WEG, a worldwide electro-electronic corporation headquartered in Brazil.",
            "tickers": [
                "NDXP"
            ],
            "time": "13:03:26",
            "timestamp": "2025-02-04T13:03:26Z",
            "url": "https://www.prnewswire.com/news-releases/elea-data-centers-partners-with-weg-to-enhance-ai-driven-high-performance-infrastructure-in-brazil-302366775.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "CoreWeave announces NVIDIA GB200 NVL72 instances for faster AI training, deploying, up to 30X. - Livingston, N.J., Feb. 4, 2025.",
            "id": "c808a0c8-45b3-4057-a69f-049fed3260d3",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "CoreWeave, known as the AI Hyperscaler™, has achieved a significant milestone by introducing cutting-edge infrastructure technology that enables organizations to train, deploy, and expand complex AI models up to 30 times faster. This groundbreaking advancement was announced in Livingston, N.J. on February 4, 2025.",
            "tickers": [
                "NVDA",
                "NDXP"
            ],
            "time": "13:03:24",
            "timestamp": "2025-02-04T13:03:24Z",
            "url": "https://www.prnewswire.com/news-releases/coreweave-first-cloud-provider-to-announce-general-availability-of-nvidia-gb200-nvl72-instances-302367298.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "United Airlines will resume flights from New York/Newark to Tel Aviv on March 15, with a second daily flight starting on March 29. Approx. 101 characters.",
            "id": "2fd9ac32-2f87-4a57-8990-9e0bd9795a7c",
            "is_major": true,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "Starting from March 15, United Airlines will be resuming flights from New York/Newark to Tel Aviv. Additionally, a second daily flight is scheduled to resume on March 29. The announcement was made by the airline on February 4, 2025, in Chicago. This reintroduction of services indicates a positive step towards normalizing air travel, with the first flight being planned for March 15 and the second daily flight set for March 29.",
            "tickers": [
                "NDXP"
            ],
            "time": "13:03:22",
            "timestamp": "2025-02-04T13:03:22Z",
            "url": "https://www.prnewswire.com/news-releases/united-to-restart-service-to-tel-aviv-israel-302366849.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "SXSW partners with Advantage Media to launch SXSW Books imprint for expanding into book publishing industry.",
            "id": "fef7b48f-f32d-4784-a7ee-d252f4493c69",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "South by Southwest® (SXSW®), a renowned global event for innovators in technology, film, television, and music, is broadening its horizons by venturing into book publishing. The event is introducing SXSW Books, a fresh imprint in collaboration with publishing giant Advantage. This move marks an exciting milestone for SXSW as it enters the world of publishing, showcasing its commitment to fostering creativity across various artistic fields. Stay tuned for more updates on this innovative development.",
            "tickers": [
                "NDXP"
            ],
            "time": "13:03:20",
            "timestamp": "2025-02-04T13:03:20Z",
            "url": "https://www.prnewswire.com/news-releases/south-by-southwest-launches-sxsw-books-imprint-in-partnership-with-advantage-media-302367006.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Nspire2Gro partners with BOS-UP to assist companies in overcoming challenges and achieving growth potential.",
            "id": "0a10a6ea-910b-4308-bfa9-b01390c2aac2",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "Chicago-based consultancy Nspire2Gro® has partnered with BOS-UP® and Ninety® in a move aimed at assisting founders and their leadership teams in navigating obstacles and maximizing growth opportunities. The partnership, announced on February 4, 2025, marks a significant milestone for Nspire2Gro®, reinforcing its commitment to supporting businesses in achieving their full potential.",
            "tickers": [
                "NDXP"
            ],
            "time": "13:03:18",
            "timestamp": "2025-02-04T13:03:18Z",
            "url": "https://www.prnewswire.com/news-releases/nspire2gro-announces-strategic-partnership-with-bos-up-to-help-founders-and-leadership-teams-build-run-and-scale-great-companies-302362808.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Company CTS reports 2024 Q4 & full-year results.",
            "id": "882fd125-1c90-41a0-a68b-ca6bbec71772",
            "is_major": false,
            "source": "GlobeNewswire",
            "source_type": "news",
            "summary": null,
            "tickers": [
                "CTS"
            ],
            "time": "13:02:59",
            "timestamp": "2025-02-04T13:02:59Z",
            "url": "https://www.globenewswire.com/news-release/2025/02/04/3020261/0/en/CTS-Announces-Fourth-Quarter-and-Full-Year-2024-Results.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Applebee’s offers Date Night Pass for $100, 3,000 passes available through random drawing for Club Applebee’s members.",
            "id": "a2c60d86-2359-4bfc-8845-62a9d6c636e4",
            "is_major": false,
            "source": "Business Wire",
            "source_type": "news",
            "summary": "In Pasadena, California, Applebee's is once again marking date night by offering the Applebee's Date Night Pass. A total of 3,000 passes are up for sale at $100 each through a lottery system, specifically for members of Club Applebee's. Lucky winners chosen to buy a pass will have the opportunity to relish up to $50 worth of food and non-alcoholic drinks every month for dine-in or to-go orders. To be eligible for the chance to purchase the Applebee's Date Night Pass, individuals must be a Club Applebee's member.",
            "tickers": [
                "NDXP"
            ],
            "time": "13:02:59",
            "timestamp": "2025-02-04T13:02:59Z",
            "url": "http://www.businesswire.com/news/home/20250204136731/en/Applebee%E2%80%99s%C2%AE-Date-Night-Pass%E2%84%A2-Returns-for-Only-100/?feedref=JjAwJuNHiystnCoBq_hl-bsjWlVyeNLyq_m2tvaHJJaD1w08bW43U_zsPK9s38B4rCOi9QzgjCezTS3Nw_X6kJUrpSBm-Hav1w-UkdSlG3miu0ZZ-LtXjCwD3Ec3ldN_zZCGORvG0LE20YOvo49uqw=="
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Morris State Bancshares reports strong earnings in 2024, declares special dividend and increases quarterly dividend.",
            "id": "2c28e512-b541-4181-bb58-8a8bbe103d53",
            "is_major": true,
            "source": "GlobeNewswire",
            "source_type": "news",
            "summary": "In Dublin, Georgia, on February 4, 2025, Morris State Bancshares, Inc. (OTCQX: MBLU), the parent company of Morris Bank, disclosed their financial outcomes for the quarter and year finishing on December 31, 2024. The report encompasses comparisons between successive quarters and years.",
            "tickers": [
                "NDXP",
                "MBLU"
            ],
            "time": "13:02:58",
            "timestamp": "2025-02-04T13:02:58Z",
            "url": "https://www.globenewswire.com/news-release/2025/02/04/3020255/0/en/Morris-State-Bancshares-Announces-Solid-Earnings-in-2024-Declares-Special-Dividend-and-Increases-Quarterly-Dividend.html"
        }
    ]
}
