{
    "news": [
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-05",
            "headline": "loanDepot and Onx Homes form joint venture, Onx X+ Mortgage, for new homebuyers in Florida and Texas.(Numbers: loanDepot - NYSE: \"LDI\")",
            "id": "5eaba0da-103d-4bde-9687-7d0fc15d12aa",
            "is_major": false,
            "source": "Business Wire",
            "source_type": "news",
            "summary": "A collaboration between loanDepot, Inc. (NYSE: \"LDI\") and Onx Homes has been unveiled, introducing the Onx X+ Mortgage in Florida and Texas. This joint venture aims to offer a simplified financing option for new homebuyers by combining the expertise of both companies in utilizing technology to enhance the home buying experience. Onx X+ Mortgage is set to cater to individuals in these states looking to embark on homeownership, reflecting a strategic partnership between these industry leaders.",
            "tickers": [
                "NDXP"
            ],
            "time": "15:58:46",
            "timestamp": "2025-02-05T15:58:46Z",
            "url": "http://www.businesswire.com/news/home/20250205402242/en/loanDepot-and-Onx-Homes-Announce-New-Joint-Venture/?feedref=JjAwJuNHiystnCoBq_hl-a2-DX8EjssEmMYWAmn7L6JnP4KQ0-VuR_Ed1_p6a8aSQvj2g8ZtgMSWm4nAO4sO4nr0TKd7CILvKt8KtThduJU_d6mxM68GteRxmy6jDm8WOZiG4SwpSv6tLEhMuQ8iTnO1u3OvtUKtPLlU5Ry9otk="
        },
        {
            "beta_headline": null,
            "category": "investing",
            "date": "2025-02-05",
            "headline": "Spokesperson: We will take all possible actions to defend legitimate interests, including considering taking up matters in WTO - Xinhua.",
            "id": "a11a2bcb-5f85-410c-8c72-8a5a51e4d63e",
            "is_major": false,
            "source": "Tradex",
            "source_type": "news",
            "summary": null,
            "tickers": [],
            "time": "15:58:02",
            "timestamp": "2025-02-05T15:58:02Z",
            "url": null
        },
        {
            "beta_headline": null,
            "category": "crypto",
            "date": "2025-02-05",
            "headline": "Michael Saylor teases '₿ig Strategy Day' as Bitcoin reserve odds fall on Kalshi to 58% from a peak of 68.5% in January. Government considering Bitcoin inclusion in sovereign wealth fund.",
            "id": "0c07a735-da68-461e-b53e-7f13f989b2e6",
            "is_major": false,
            "source": "Benzinga",
            "source_type": "news",
            "summary": "A discussion about setting up a strategic reserve of Bitcoin (CRYPTO: BTC) is underway, with 'Crypto Czar' David Sacks making it a top priority for the digital assets committee. However, the likelihood of this reserve being established by 2025 has decreased from 68.5% in January to 58% according to prediction market site Kalshi. Sacks mentioned at a press conference that the potential inclusion of Bitcoin in a new sovereign wealth fund would be overseen by Howard Lutnick, the upcoming Secretary of Commerce. Meanwhile, Michael Saylor, the executive chairman of MicroStrategy (NASDAQ:MSTR), generated buzz by sharing his thoughts on the matter on social media.",
            "tickers": [
                "MSTR",
                "BTC"
            ],
            "time": "15:58:01",
            "timestamp": "2025-02-05T15:58:01Z",
            "url": "https://www.benzinga.com/markets/cryptocurrency/25/02/43499020/michael-saylor-hints-at-ig-strategy-day-as-chances-of-bitcoin-reserve-odds-on-kalshi-fall"
        },
        {
            "beta_headline": null,
            "category": "investing",
            "date": "2025-02-05",
            "headline": "Hong Kong Special Administrative Region Govermemt expresses strong dissatisfaction with the US tariff policy - Xinhua.",
            "id": "313b6071-4958-4ffd-8028-98f0ddbfad65",
            "is_major": false,
            "source": "Tradex",
            "source_type": "news",
            "summary": null,
            "tickers": [],
            "time": "15:57:02",
            "timestamp": "2025-02-05T15:57:02Z",
            "url": null
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-05",
            "headline": "Acarix partners with Geo-Med to expand CADScor system availability for veterans. Strategic partnership announced on Feb. 5, 2025.",
            "id": "73efb923-0b7b-4b50-914e-d7b399496648",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "On February 5, 2025, in Oklahoma City, Acarix, a leading developer of innovative acoustic-based cardiac diagnostic solutions, revealed its latest collaboration with Geo-Med, LLC. Geo-Med, LLC, a well-known Service-Disabled Veteran-Owned Small Business, has expertise in specific healthcare services. This partnership aims to enhance their offerings and reach a wider audience, combining Acarix's cutting-edge technology with Geo-Med's established presence. The partnership signifies a strategic move forward for both companies, leveraging each other's strengths to maximize their impact in the industry.",
            "tickers": [
                "NDXP"
            ],
            "time": "15:57:01",
            "timestamp": "2025-02-05T15:57:01Z",
            "url": "https://www.prnewswire.com/news-releases/acarix-partners-with-geo-med-to-extend-the-availability-of-the-cadscor-system-for-veterans-302369048.html"
        },
        {
            "beta_headline": null,
            "category": "commodities",
            "date": "2025-02-05",
            "headline": "Gas company Avance Gas Holding Ltd announces results from Special General Meeting.",
            "id": "0ac9623c-f205-44fd-a9e7-6f5fb002ff11",
            "is_major": false,
            "source": "GlobeNewswire",
            "source_type": "news",
            "summary": null,
            "tickers": [],
            "time": "15:56:03",
            "timestamp": "2025-02-05T15:56:03Z",
            "url": "https://www.globenewswire.com/news-release/2025/02/05/3021378/0/en/Avance-Gas-Holding-Ltd-SGM-Results-Notification.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-05",
            "headline": "California REALTORS® support wildfire victims with open letter in statewide newspapers.",
            "id": "1b75a487-0fe1-4fe8-8134-d1fe9748bd85",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "On February 5, 2025, following the harmful wildfires in Southern California, the California Association of Realtors (C.A.R.) issued an open letter in various newspapers across California to offer assistance and guidance to homeowners affected by the disaster. The letter aims to help displaced individuals comprehend the forthcoming procedures and provide support during this challenging time.",
            "tickers": [
                "NDXP"
            ],
            "time": "15:54:59",
            "timestamp": "2025-02-05T15:54:59Z",
            "url": "https://www.prnewswire.com/news-releases/california-realtors-place-open-letter-in-statewide-california-newspapers-to-provide-crucial-information-to-support-and-protect-wildfire-victims-302368959.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-05",
            "headline": "BizClik Media releases February editions of Sustainability & Energy Digital Magazines featuring leaders from 3M, IBM, Schneider Electric, and Ventas.",
            "id": "fb482131-c3de-4089-9d9f-abf6adc839df",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "In the latest February releases of Sustainability and Energy Digital Magazines, interviews with prominent experts and executives from industry leaders like 3M, IBM, Schneider Electric, and Ventas can be found. The publications, released on February 5, 2025, are from BizClik, UK's rapidly expanding publishing firm. The magazines feature insights and perspectives from key figures in the sustainable energy sector, offering valuable information to the audience. This edition showcases the views and strategies of industry giants, contributing to the conversation around sustainability and energy.",
            "tickers": [
                "MMM",
                "IBM",
                "VTR",
                "NDXP"
            ],
            "time": "15:52:56",
            "timestamp": "2025-02-05T15:52:56Z",
            "url": "https://www.prnewswire.com/news-releases/bizclik-media-launches-the-february-editions-of-sustainability--energy-digital-magazines-302369044.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-05",
            "headline": "PSB launches Nesto in Denver to enhance customer relationships, increase franchisee efficiency. Feb 5, 2025. #PremiumServiceBrands #Nesto #PSB",
            "id": "210061bc-8add-4c40-b7f1-cbfb6529c598",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "An established franchisor in the home services industry, Premium Service Brands (PSB), has introduced Nesto in Denver on Feb. 5, 2025. This move aims to enhance customer relationships and improve franchisee efficiency. PSB is a prominent player in the North American home services sector.",
            "tickers": [
                "NDXP"
            ],
            "time": "15:50:53",
            "timestamp": "2025-02-05T15:50:53Z",
            "url": "https://www.prnewswire.com/news-releases/premium-service-brands-rolls-out-game-changing-all-in-one-home-services-platform-302369040.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-05",
            "headline": "Sto Corp. introduces StoVentec® Fiber Cement Rainscreen® System for modern design, performance in building solutions.",
            "id": "4f520581-2d91-4b73-9d1a-309f8a0f087e",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "In Atlanta on February 5, 2025, Sto Corp. introduced the StoVentec® Fiber Cement Rainscreen® System. This system is part of their renowned building envelope solutions and includes wall cladding systems, air barriers, coatings, and restoration systems. Sto Corp. is a global leader in this industry and continues to innovate. The StoVentec® Fiber Cement Rainscreen® System provides a complete ventilated solution for buildings.",
            "tickers": [
                "NDXP"
            ],
            "time": "15:50:51",
            "timestamp": "2025-02-05T15:50:51Z",
            "url": "https://www.prnewswire.com/news-releases/sto-corp-unveils-versatile-fiber-cement-rainscreen-system-for-modern-design-and-performance-302363570.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-05",
            "headline": "Armexa's John Cusimano to speak on Industrial Cybersecurity panel at ARC Industry Leadership Forum 2025 in Orlando.",
            "id": "92dde6f4-5ba7-4a21-bf23-03a31ee8a15d",
            "is_major": true,
            "source": "Business Wire",
            "source_type": "news",
            "summary": "Armexa, a cybersecurity firm focusing on industrial sector security, announced that John Cusimano, VP of Operational Technology (OT) Cybersecurity, will be a panelist at ARC Industry Leadership Forum 2025 in Orlando from February 10-13. The panel, \"Case Studies in Industrial Cybersecurity,\" will showcase insights from experts. The event aims to address key industry challenges and innovations. Cusimano's participation highlights Armexa's commitment to enhancing industrial cybersecurity.",
            "tickers": [
                "NDXP"
            ],
            "time": "15:49:51",
            "timestamp": "2025-02-05T15:49:51Z",
            "url": "http://www.businesswire.com/news/home/20250205239385/en/Armexa-Vice-President-and-OT-Cybersecurity-Expert-John-Cusimano-to-Speak-on-a-Panel-at-the-ARC-Industry-Leadership-Forum-2025/?feedref=JjAwJuNHiystnCoBq_hl-fLcmYSZsqlD_XPbplM8Ta6D8R-QU5o2AvY8bhI9uvWSD8DYIYv4TIC1g1u0AKcacnnViVjtb72bOP4-4nHK5iej_DoWrIhfD31cAxcB60aE"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-05",
            "headline": "Appfire acquires Flow software engineering intelligence platform to enhance developer productivity. - Feb 5, 2025.",
            "id": "1602b8fb-39d2-495c-b918-02d3d94463ec",
            "is_major": true,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "Appfire, a premier global software provider, has broadened its product offerings by integrating Flow into its portfolio. Flow is dedicated to driving engineering transformation and boosting developer productivity. The announcement was made in Boston on February 5, 2025. This move signifies Appfire's commitment to enhancing, extending, and interconnecting the top platforms worldwide.",
            "tickers": [
                "NDXP"
            ],
            "time": "15:48:50",
            "timestamp": "2025-02-05T15:48:50Z",
            "url": "https://www.prnewswire.com/news-releases/appfire-acquires-flow-a-best-in-class-software-engineering-intelligence-platform-enabling-data-driven-insights-for-engineering-organizations-302369029.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-05",
            "headline": "Pivot Point Consulting ranked #1 Best in KLAS for Managed IT Services for the third year in a row.",
            "id": "aaf12b7d-542b-4a7a-bb1d-3080bed86eac",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "For the third year in a row, Pivot Point Consulting, a Vaco company, has been recognized as the top performer in Managed IT Services according to KLAS Research, a leading healthcare IT insights company. The company received exceptional client feedback and was ranked #1 Best in KLAS for Managed IT Services. The announcement was made in Nashville, Tennessee on February 5, 2025. This achievement highlights the consistency and quality of service provided by Pivot Point Consulting, showcasing their dedication to client satisfaction and industry excellence.",
            "tickers": [
                "NDXP"
            ],
            "time": "15:48:47",
            "timestamp": "2025-02-05T15:48:47Z",
            "url": "https://www.prnewswire.com/news-releases/pivot-point-consulting-named-best-in-klas-managed-it-services-302369037.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-05",
            "headline": "QCMaiven and One Diligence partner to offer Natural Disaster Risk Evaluation solution for mortgage servicers in Dallas.",
            "id": "dc4cec7a-d1d1-4b02-a744-686db4297aeb",
            "is_major": false,
            "source": "Business Wire",
            "source_type": "news",
            "summary": "Dallas - QCMaiven's Natural Disaster Risk Evaluation solution is revolutionizing the way mortgage servicers assess underwriting risks, allowing them to accurately quantify these risks and enhance the profitability of their portfolios. By leveraging artificial intelligence technology, QCMaiven enables servicers to make more informed decisions, ultimately improving the overall performance of their mortgage portfolios.",
            "tickers": [
                "NDXP"
            ],
            "time": "15:48:44",
            "timestamp": "2025-02-05T15:48:44Z",
            "url": "http://www.businesswire.com/news/home/20250205677751/en/QCMaiven-from-Rocktop-Technologies-and-One-Diligence-Introduces-Natural-Disaster-Risk-Evaluation/?feedref=JjAwJuNHiystnCoBq_hl-a2-DX8EjssEmMYWAmn7L6JnP4KQ0-VuR_Ed1_p6a8aSQvj2g8ZtgMSWm4nAO4sO4nr0TKd7CILvKt8KtThduJU_d6mxM68GteRxmy6jDm8WOZiG4SwpSv6tLEhMuQ8iTnO1u3OvtUKtPLlU5Ry9otk="
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-05",
            "headline": "Avid Bioservices notifies holders of its 7.00% Convertible Senior Notes due 2029 of Fundamental and Make-Whole Fundamental Changes post-merger.",
            "id": "9d404781-c6fd-4c55-9697-9d6b1c10724e",
            "is_major": false,
            "source": "GlobeNewswire",
            "source_type": "news",
            "summary": "On February 5, 2025, Avid Bioservices, Inc. based in Tustin, California, a biologics contract development and manufacturing organization, issued a Notice to holders of its 7.00% Convertible Senior Notes due 2029. The Notice was in accordance with the terms of the Indenture signed on March 12, 2024, with U.S. Bank Trust Company, National Association as trustee. The notice was regarding a Fundamental Change and a Make-Whole Fundamental Change as per the Indenture, due to the closing of a merger transaction on November 6, 2024. Avid aims to enhance patient lives by offering top-notch development and manufacturing services to biotech and pharmaceutical firms.",
            "tickers": [
                "CDMO",
                "NDXP"
            ],
            "time": "15:46:56",
            "timestamp": "2025-02-05T15:46:56Z",
            "url": "https://www.globenewswire.com/news-release/2025/02/05/3021370/0/en/Avid-Bioservices-Inc-Provides-Notice-of-Fundamental-Change-and-Make-Whole-Fundamental-Change-to-Holders-of-its-Convertible-Notes-in-Connection-with-Completed-Merger.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-05",
            "headline": "Global on-body drug delivery devices market hit $390.7 million in 2023, projected to reach $796.1 million by 2034 with 6.8% CAGR. Dominated by North America at 45%, Europe follows closely, with Asia-Pacific being the fastest-growing region. Industry giants like BD and Medtronic shaping healthcare's future. Key players include BD, Insulet, Medtronic, and recent developments include advancements in wearable injectors and auto-injectors for chronic diseases like diabetes and osteoporosis.",
            "id": "549e31c5-db11-4460-aab8-4a0296a62f4b",
            "is_major": false,
            "source": "Benzinga",
            "source_type": "news",
            "summary": "The global on-body drug delivery devices market is rapidly expanding, reaching $390.7 million in revenue in 2023 and projected to hit $796.1 million by 2034, growing at a CAGR of 6.8%. Industry giants like BD, Insulet, and Medtronic are driving innovation with smart connected devices for chronic diseases. North America leads with 45% market share, Europe is supported by regulations, and Asia-Pacific shows the fastest growth with rising healthcare access and diabetes cases. Key players include BD, Insulet, and Medtronic, with recent developments like BD's BD Libertas™ Wearable Injector and Insulet's partnership with Dexcom. The market is evolving to provide patient-centric care amidst a surge in chronic diseases. Read more on Benzinga.com.",
            "tickers": [
                "NDXP",
                "PODD",
                "DXCM"
            ],
            "time": "15:46:54",
            "timestamp": "2025-02-05T15:46:54Z",
            "url": "https://www.benzinga.com/pressreleases/25/02/g43498547/on-body-drug-delivery-devices-market-hits-us-390-7-million-in-2023-set-to-reach-us-796-1-million-b"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-05",
            "headline": "Medtronic (NYSE: MDT) to announce Q3 fiscal year 2025 results on Feb 18, 2025 in Galway, Ireland.",
            "id": "0fb813d6-1ec6-4b83-9f5f-4fcf22919929",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "In Galway, Ireland, on February 5, 2025, Medtronic plc, a prominent healthcare technology company traded on NYSE under the symbol MDT, revealed its plans to disclose financial updates for the third quarter of fiscal year 2025. This announcement is scheduled for Tuesday, February 18, 2025. Interested parties can anticipate a detailed news release around that date.",
            "tickers": [
                "MDT",
                "NDXP",
                "NWSA"
            ],
            "time": "15:46:44",
            "timestamp": "2025-02-05T15:46:44Z",
            "url": "https://www.prnewswire.com/news-releases/medtronic-to-announce-financial-results-for-its-third-quarter-of-fiscal-year-2025-302369035.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-05",
            "headline": "Kenvue confirms receipt of Starboard Value's submission of nominees for election - emphasizing shareholder value.",
            "id": "cca68b24-e78e-47f6-ac1a-76535eab627e",
            "is_major": false,
            "source": "Business Wire",
            "source_type": "news",
            "summary": "In Skillman, New Jersey, Kenvue has officially acknowledged the receipt of nominations from Starboard Value for individuals to be considered for election to the Kenvue Board of Directors.",
            "tickers": [
                "KVUE",
                "NDXP"
            ],
            "time": "15:43:47",
            "timestamp": "2025-02-05T15:43:47Z",
            "url": "http://www.businesswire.com/news/home/20250205461417/en/Kenvue-Highlights-Commitment-to-Shareholder-Value/?feedref=JjAwJuNHiystnCoBq_hl-fLcmYSZsqlD_XPbplM8Ta6D8R-QU5o2AvY8bhI9uvWSD8DYIYv4TIC1g1u0AKcacnnViVjtb72bOP4-4nHK5iej_DoWrIhfD31cAxcB60aE"
        },
        {
            "beta_headline": null,
            "category": "economy",
            "date": "2025-02-05",
            "headline": "Major US economic sector slows down, leading to a decrease in inflation.",
            "id": "c0bd9f14-6621-430e-ad48-7c93303002f7",
            "is_major": false,
            "source": "Market Watch",
            "source_type": "news",
            "summary": null,
            "tickers": [],
            "time": "15:40:40",
            "timestamp": "2025-02-05T15:40:40Z",
            "url": "https://www.marketwatch.com/bulletins/redirect/go?g=19a182ba-5979-430f-846f-cb2ba5696485&mod=mw_rss_bulletins"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-05",
            "headline": "CDW's Q4 earnings show sales up 3.3% to $5.186B, Corporate segment up 4.2% to $2.35B, Public segment up 6.1% to $1.854B.",
            "id": "3bf5d6c5-8c37-45dd-8501-d5037825752b",
            "is_major": true,
            "source": "Benzinga",
            "source_type": "news",
            "summary": "CDW Corporation (NASDAQ:CDW) saw its shares rise following the release of its fourth-quarter results, which surpassed expectations. The company reported a 3.3% year-over-year increase in net sales, totaling $5.186 billion, exceeding the anticipated $4.954 billion. Net sales from the Corporate segment rose by 4.2% to $2.35 billion, while the Small Business segment saw a 4.4% increase to $380 million. The Public segment experienced a 6.1% increase in net sales to $1.854 billion, driven by a substantial 29.5% rise in net sales to Healthcare customers. Additionally, CDW’s U.K. and Canadian operations collectively recorded a 5.1% year-over-year increase in net sales, reaching $607 million. Average daily sales surged by 5.0% to $83.6 million. However, gross margin contracted to 22.3% from 23.0% in the quarter. The adjusted operating margin was reported at 9.6%, down from 10.3% the previous year. Adjusted EPS of $2.48 outperformed the expectations.",
            "tickers": [
                "CDW",
                "QTEC",
                "TDV"
            ],
            "time": "15:39:49",
            "timestamp": "2025-02-05T15:39:49Z",
            "url": "https://www.benzinga.com/25/02/43498181/cdw-delivers-robust-q4-earnings-targets-continued-market-outperformance-in-2025"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-05",
            "headline": "US services index declines as order growth slows, impacting economy.",
            "id": "00319940-8e59-4ab9-baee-7c952396919a",
            "is_major": false,
            "source": "Bloomberg",
            "source_type": "news",
            "summary": null,
            "tickers": [
                "NDXP"
            ],
            "time": "15:38:45",
            "timestamp": "2025-02-05T15:38:45Z",
            "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxPemhMTlVYNmc4a1ZTUVNESUtNY09oZzA1OVVwa2NBRFQtVkJvY0phdXFQQW9GMnZDclAzWXc3aW90R3dqR2pLblhzS0RhZkNvU0tEVWUyLTdCbXp4SHZfRmVOR0xFVk05YURFYXNyZGw4bElBbFh2MzJqRDRtai1DMGRLaU9TTFh6WWF0NmszUGE5Z3hjREpqSTdBQVpnQ3RpdEIw?oc=5"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-05",
            "headline": "Argentina withdraws from WHO, following Trump's lead.",
            "id": "dac6ada0-8271-4b83-bac7-c378c93319b1",
            "is_major": true,
            "source": "Bloomberg",
            "source_type": "news",
            "summary": null,
            "tickers": [
                "NDXP"
            ],
            "time": "15:38:44",
            "timestamp": "2025-02-05T15:38:44Z",
            "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxPNllZcmkyNUFHM1ZRVHFjelFOaU9SVE1TVEhjNUxPdENKMXdQb0h3by1KdnRTRlpueVMweHc4bVlXWTkxT2djY254d2dUYjBJT0F2VEdJQWNfNlQ1dXZ3X0c1TS1kRTUzTEVDYTdNTk1lZjBDUUlFbkt1b0pJYW9SSHJOeThmcElIN1U3M2czY1p6dndMOE5rUFdNemlKUlQzaUhsTkJWUkNTbVgzVXc?oc=5"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-05",
            "headline": "Trump imposes tariffs using the International Emergency Economic Powers Act, leading to uncertainty in trade relations.",
            "id": "c23ea95e-bdab-4936-ba6f-3406709c6e80",
            "is_major": false,
            "source": "Politico",
            "source_type": "news",
            "summary": "The executive authority of President Donald Trump has reached uncharted territory with his utilization of the International Emergency Economic Powers Act to enforce significant tariffs on U.S. trading partners. This move has stirred debate and concern among lawmakers and experts due to its unprecedented nature.",
            "tickers": [],
            "time": "15:38:41",
            "timestamp": "2025-02-05T15:38:41Z",
            "url": "https://www.politico.com/newsletters/weekly-trade/2025/02/03/tariffs-tariffs-and-tariffs-00202040"
        },
        {
            "beta_headline": null,
            "category": "investing",
            "date": "2025-02-05",
            "headline": "EIA: US gasoline stockpiles rose in the latest week to the highest since January 2024.",
            "id": "866b488f-3283-4496-95c8-79f70729de8d",
            "is_major": false,
            "source": "Tradex",
            "source_type": "news",
            "summary": null,
            "tickers": [],
            "time": "15:37:56",
            "timestamp": "2025-02-05T15:37:56Z",
            "url": null
        },
        {
            "beta_headline": null,
            "category": "economy",
            "date": "2025-02-05",
            "headline": "President Trump fired Democrats Jocelyn Samuels and Charlotte Burrows from the Equal Employment Opportunity Commission.",
            "id": "376b1ac9-e18e-4468-8a1a-cf2df0f3faa3",
            "is_major": false,
            "source": "Politico",
            "source_type": "news",
            "summary": "Last week, President Donald Trump removed Jocelyn Samuels and Charlotte Burrows, both Democrats, from their positions as the heads of the Equal Employment Opportunity Commission.",
            "tickers": [],
            "time": "15:37:41",
            "timestamp": "2025-02-05T15:37:41Z",
            "url": "https://www.politico.com/newsletters/weekly-shift/2025/02/03/ousted-eeoc-commissioner-speaks-out-on-removal-00202017"
        },
        {
            "beta_headline": null,
            "category": "economy",
            "date": "2025-02-05",
            "headline": "Fed halts rate cuts due to inflation, robust job market; S&P 500 dips. Policy uncertainty looms.",
            "id": "a954b2dd-9c02-4300-a7c9-fa21efa8cdbf",
            "is_major": false,
            "source": "Investors.com",
            "source_type": "news",
            "summary": "Amid ongoing policy uncertainty and a strong labor market, the Federal Reserve has decided to halt further rate cuts, citing persistently high inflation levels. The pause comes as President Trump unveils new policies. This move has led to a slight decrease in the S&P 500 index.",
            "tickers": [],
            "time": "15:33:09",
            "timestamp": "2025-02-05T15:33:09Z",
            "url": "https://www.investors.com/news/economy/federal-reserve-meeting-jan-jerome-powell-trump-tariffs-sp-500/"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-05",
            "headline": "Treasury bond auction announced for RIKB 27 0415 and RIKB 42 0217. Auction on the date, 10:30 - 11:00 am. Up to 10% additional purchase allowed. Bonds delivered electronically on Settlement Date.",
            "id": "7ff3e4c3-1502-4e9e-98f4-9ddefd37e337",
            "is_major": false,
            "source": "GlobeNewswire",
            "source_type": "news",
            "summary": "During the Auction Date, the Government Debt Management will conduct an auction of Treasury bonds in the Series between 10:30 a.m. and 11:00 a.m. Interested parties can participate in the auction using ISIN numbers and should take note of the Maturity Dates listed in the table. As outlined in Article 6 of the General Terms of Auction for Treasury bonds, buyers have the option to acquire an additional 10% beyond their initial purchase. The Treasury bonds will be transferred electronically on the Settlement Date as per the terms of the auction.",
            "tickers": [
                "NDXP"
            ],
            "time": "15:33:06",
            "timestamp": "2025-02-05T15:33:06Z",
            "url": "https://www.globenewswire.com/news-release/2025/02/05/3021360/0/en/Treasury-Bond-Auction-Announcement-RIKB-27-0415-RIKB-42-0217-Switch-Auction-or-Cash-payment.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-05",
            "headline": "Flowater names Tina Swanson as Chief Revenue Officer, expands national accounts team to serve increased demand for plastic-free drinking water. Schools, hotels, fitness centers, and workplaces embracing the transformation with FloWater refill stations. Denver, Feb. 5, 2025. (Characters: 276)",
            "id": "3bf05c68-711b-4a5f-acda-31115735abb8",
            "is_major": true,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "In cities nationwide, schools, hotels, fitness centers, and workplaces are leading a shift by replacing tap water with FloWater Refill Stations. A study revealed that up to 27% of the U.S. population could be using these stations to access clean, filtered water. This transformation is being driven by a variety of establishments to provide better hydration options for their patrons and employees.",
            "tickers": [
                "NDXP"
            ],
            "time": "15:33:00",
            "timestamp": "2025-02-05T15:33:00Z",
            "url": "https://www.prnewswire.com/news-releases/flowater-appoints-tina-swanson-chief-revenue-officer-expands-national-accounts-team-to-meet-growing-demand-for-safe-plastic-free-drinking-water-302368990.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-05",
            "headline": "Patients with Friedreich's ataxia struggle due to limited medical specialists and health insurance barriers despite an FDA-approved treatment.",
            "id": "8df5a6ac-1afb-4ff9-bea3-f02f0487318a",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "A new policy paper released by physicians in Washington on February 5, 2025, highlights the challenges faced by individuals with Friedreich's ataxia. Despite an FDA-approved medication now available to treat the condition, patients continue to struggle due to a lack of medical specialists and numerous health insurance barriers. The paper underscores the urgent need for improved access to care for the estimated [insert number] individuals affected by this debilitating disorder.",
            "tickers": [
                "NDXP"
            ],
            "time": "15:32:58",
            "timestamp": "2025-02-05T15:32:58Z",
            "url": "https://www.prnewswire.com/news-releases/rare-disease-patients-face-barriers-in-access-and-care-302367845.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-05",
            "headline": "Peptide Synthesis Market to surge, reaching $1.41 billion by 2029 with 11.7% CAGR growth from $0.78 billion in 2023.",
            "id": "6eecef48-c724-4ede-8966-e69608a1670f",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "In Delray Beach, Florida, as of February 5, 2025, the Peptide Synthesis market was worth around US$ 0.78 billion in 2023. It is anticipated to exhibit strong growth, with a projected Compound Annual Growth Rate (CAGR) of 11.7%. The market is expected to achieve US$ 0.81 billion in 2024 and is forecasted to surge significantly to US$ 1.41 billion by 2029. Various factors are propelling the growth of the peptide synthesis market, including...",
            "tickers": [
                "NDXP"
            ],
            "time": "15:32:55",
            "timestamp": "2025-02-05T15:32:55Z",
            "url": "https://www.prnewswire.com/news-releases/peptide-synthesis-market-to-hit-usd-1-41-billion-by-2029-with-11-7-cagr--marketsandmarkets-302368449.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-05",
            "headline": "Elon Musk's interest in the Bureau of the Fiscal Service for its spending power and privacy concerns sparks political controversy.",
            "id": "b739c896-264a-44e1-8b38-80c12dac74d0",
            "is_major": false,
            "source": "NYT",
            "source_type": "news",
            "summary": "The bureau is currently embroiled in a political dispute due to issues surrounding spending power, privacy concerns, and conflicts of interest. With significant numbers involved in these areas, tensions have heightened as the bureau's actions come under scrutiny.",
            "tickers": [],
            "time": "15:32:54",
            "timestamp": "2025-02-05T15:32:54Z",
            "url": "https://www.nytimes.com/2025/02/05/us/politics/trump-musk-bureau-fiscal-service.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-05",
            "headline": "Genesis Rail Company appoints Rance Randle as CEO to boost growth. Randle brings 20 years of experience in railroad operations.",
            "id": "acfc34c3-2011-4fa6-a258-f1638bdb56a3",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "Genesis Rail Company, based in Roanoke, Virginia, disclosed on February 5, 2025, that Rance Randle has been appointed as the new CEO. Randle brings more than twenty years of expertise in railroad operations, logistics, and intermodal transportation to the company. Genesis Rail Company is affiliated with Auxo Investment Partners.",
            "tickers": [
                "NDXP"
            ],
            "time": "15:32:53",
            "timestamp": "2025-02-05T15:32:53Z",
            "url": "https://www.prnewswire.com/news-releases/genesis-rail-company-welcomes-rance-randle-as-ceo-to-drive-market-growth-and-operational-excellence-302368976.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-05",
            "headline": "STARFIRE Lubricants adds 2 industry veterans for sales growth and retail expansion, with 54 years combined experience.",
            "id": "a25cea70-c2e2-4855-9642-e62967bec4fb",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "In Cincinnati on February 5, 2025, STARFIRE Lubricants, a renowned provider of top-notch lubrication products, excitedly disclosed the recruitment of two exceptional individuals - Brian Hayes and Pat McLaughlin. The duo collectively boasts 54 years of industry experience.",
            "tickers": [
                "NDXP"
            ],
            "time": "15:32:52",
            "timestamp": "2025-02-05T15:32:52Z",
            "url": "https://www.prnewswire.com/news-releases/starfire-lubricants-welcomes-two-industry-veterans-to-drive-sales-growth-and-retail-expansion-302368956.html"
        },
        {
            "beta_headline": null,
            "category": "crypto",
            "date": "2025-02-05",
            "headline": "Ethereum expects L2 interoperability within months, ending ecosystem’s woes since embracing L2 scaling.",
            "id": "d4a07bb8-ded0-4781-911e-48fb0055f5da",
            "is_major": false,
            "source": "Cointelegraph",
            "source_type": "news",
            "summary": "Ethereum is on the verge of resolving long-standing interoperability issues within its ecosystem after adopting the Layer 2 scaling roadmap. This development comes as a relief to many users and developers, as it will improve efficiency and connectivity across the network. This advancement marks a significant milestone for Ethereum, as it aims to address the challenges that have hindered seamless interactions within the platform. This move is expected to enhance user experience and overall performance, with the potential to attract more participants to the ecosystem.",
            "tickers": [],
            "time": "15:31:44",
            "timestamp": "2025-02-05T15:31:44Z",
            "url": "https://cointelegraph.com/magazine/ethereum-l2s-interoperability-roadmap-complete-guide/?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-05",
            "headline": "Sila names Lindsay Caldwell as VP, People, bringing HR expertise to build company culture.",
            "id": "91dadc89-13dc-4884-8a62-af2b5d6b5ac1",
            "is_major": false,
            "source": "Business Wire",
            "source_type": "news",
            "summary": "Sila, a cutting-edge battery materials firm based in Alameda, California, has recently named Lindsay Caldwell as the Vice President of People. Caldwell brings a wealth of HR knowledge from various industries such as biotech, biopharma, and aerospace. In this role, Caldwell will oversee the development of the company's people strategy, focusing on fostering a high-performance, inclusive, and collaborative environment. With Caldwell's background in leading teams across multiple companies, her appointment marks a significant step in enhancing Sila's organizational framework.",
            "tickers": [
                "NDXP"
            ],
            "time": "15:31:40",
            "timestamp": "2025-02-05T15:31:40Z",
            "url": "http://www.businesswire.com/news/home/20250205116623/en/Sila-Appoints-Lindsay-Caldwell-as-VP-People/?feedref=JjAwJuNHiystnCoBq_hl-Q-tiwWZwkcswR1UZtV7eGe24xL9TZOyQUMS3J72mJlQ7fxFuNFTHSunhvli30RlBNXya2izy9YOgHlBiZQk2LOzmn6JePCpHPCiYGaEx4DL1Rq8pNwkf3AarimpDzQGuQ=="
        },
        {
            "beta_headline": null,
            "category": "investing",
            "date": "2025-02-05",
            "headline": "EIA Distillate Inventories Actual -5.471M (Forecast -2.069M, Previous -4.994M)",
            "id": "0a8ed9c9-027c-459a-812f-779e4eba4961",
            "is_major": false,
            "source": "Tradex",
            "source_type": "news",
            "summary": null,
            "tickers": [],
            "time": "15:30:54",
            "timestamp": "2025-02-05T15:30:54Z",
            "url": null
        },
        {
            "beta_headline": null,
            "category": "investing",
            "date": "2025-02-05",
            "headline": "EIA Crude Oil Inventories Actual 8.664M (Forecast 1.9M, Previous 3.463M)",
            "id": "2a6b57ad-6323-4078-8b14-47574bd63b6c",
            "is_major": true,
            "source": "Tradex",
            "source_type": "news",
            "summary": null,
            "tickers": [],
            "time": "15:30:53",
            "timestamp": "2025-02-05T15:30:53Z",
            "url": null
        },
        {
            "beta_headline": null,
            "category": "investing",
            "date": "2025-02-05",
            "headline": "EIA Gasoline Inventories Actual 2.233M (Forecast 0.21M, Previous 2.957M)",
            "id": "a4ac89cf-9c73-4e57-847b-eb6d0e14dc53",
            "is_major": false,
            "source": "Tradex",
            "source_type": "news",
            "summary": null,
            "tickers": [],
            "time": "15:30:53",
            "timestamp": "2025-02-05T15:30:53Z",
            "url": null
        },
        {
            "beta_headline": null,
            "category": "investing",
            "date": "2025-02-05",
            "headline": "EIA Crude Cushing Inventories Actual -0.034M (Forecast -, Previous 0.326M)",
            "id": "f210de83-15c8-4bb3-adc6-9a3f4c835664",
            "is_major": true,
            "source": "Tradex",
            "source_type": "news",
            "summary": null,
            "tickers": [],
            "time": "15:30:53",
            "timestamp": "2025-02-05T15:30:53Z",
            "url": null
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-05",
            "headline": "Bond trading in the UK approaches 2018 levels amid market turbulence, fueling high activity.",
            "id": "31b0c221-eee4-4325-8819-214cbef520f2",
            "is_major": false,
            "source": "Bloomberg",
            "source_type": "news",
            "summary": null,
            "tickers": [
                "NDXP"
            ],
            "time": "15:29:44",
            "timestamp": "2025-02-05T15:29:44Z",
            "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxOS3lVdEROWmdZNUZKMl80N1p2MXIwTl81bWNWWkVkM3l1LURRNDB2Ry1iWFRRb0ZOeFhHX0hGcTBaT2h2QjdaWlNCcjZCMFNnLVRWRFhjTEcyOVBnVTNVeDhaN2Rrc0U2TTZHWjIwUXVPR3hnTmtPVlBJcnlNOWU3NTZuVXY1VTE3REhoOVRrVU0xQUk1UVlEcHlTeVI2a3JoQ3JZWjVWSnBlaEprSXhFOGZRb1RYZw?oc=5"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-05",
            "headline": "Amante 1530 wins WSWA's 2025 Brand Battle in Denver, beating competitors at premier industry showdown.",
            "id": "6735b5e0-88a1-495b-ab32-dd0ff0727901",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "Amante 1530, an up-and-coming aperitif brand, claimed victory at the prestigious 2025 Brand Battle competition at the Wine & Spirits Wholesalers of America (WSWA) event in Denver on February 5th. The brand outshone competitors and emerged as the champion, showcasing its rising popularity and quality in the industry. This achievement highlights Amante 1530's success and potential, solidifying its position as a standout player in the market. The event drew attention from industry professionals and enthusiasts, further boosting the brand's recognition and influence.",
            "tickers": [
                "NDXP"
            ],
            "time": "15:28:49",
            "timestamp": "2025-02-05T15:28:49Z",
            "url": "https://www.prnewswire.com/news-releases/amante-1530-wins-wswas-2025-brand-battle-at-access-live-in-denver-302369015.html"
        },
        {
            "beta_headline": null,
            "category": "crypto",
            "date": "2025-02-05",
            "headline": "Medical tech firm adds $88M to Bitcoin treasury, yielding 152% since July 1, 2024, says chairman.",
            "id": "9692dd3e-3600-4e45-a170-3ab12f866dd3",
            "is_major": false,
            "source": "Decrypt",
            "source_type": "news",
            "summary": "The chairman of a medical technology company stated that their Bitcoin treasury has yielded a return of 152% since July 1, 2024.",
            "tickers": [
                "BTC"
            ],
            "time": "15:28:45",
            "timestamp": "2025-02-05T15:28:45Z",
            "url": "https://decrypt.co/304545/semler-scientific-88-million-bitcoin-treasury"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-05",
            "headline": "Euna Solutions awarded Sourcewell contract for Software Solutions, expanding to provide services to public agencies in US.",
            "id": "4845e2e6-50cc-4071-a60e-eec175a0def1",
            "is_major": false,
            "source": "Business Wire",
            "source_type": "news",
            "summary": "Euna Solutions®, a prominent provider of specialized cloud-based solutions for the public sector, has recently been granted a Sourcewell cooperative purchasing contract in the Software Solutions and Related Services for Public Sector and Education Administration sector, after announcing this in Toronto and Chicago. This contract enables Euna Solutions to broaden its services to public entities throughout the United States. Sourcewell caters to government, education, and nonprofit entities across the U.S., encompassing a wide range of clients. This development signifies a significant opportunity for Euna Solutions to extend its reach and impact in the sector, potentially benefiting a large number of organizations seeking tailored cloud-based solutions.",
            "tickers": [
                "NDXP"
            ],
            "time": "15:27:35",
            "timestamp": "2025-02-05T15:27:35Z",
            "url": "http://www.businesswire.com/news/home/20250205236896/en/Euna-Solutions-Awarded-Sourcewell-Cooperative-Contract/?feedref=JjAwJuNHiystnCoBq_hl-Q-tiwWZwkcswR1UZtV7eGe24xL9TZOyQUMS3J72mJlQ7fxFuNFTHSunhvli30RlBNXya2izy9YOgHlBiZQk2LOzmn6JePCpHPCiYGaEx4DL1Rq8pNwkf3AarimpDzQGuQ=="
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-05",
            "headline": "NZero secures contract with Michigan to manage carbon data program, boosting sustainability efforts.",
            "id": "136dc4ae-0bff-4b11-8a1a-12912f820459",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "In Reno, Nevada on February 5, 2025, NZero, a prominent company specializing in carbon management and sustainability software, secured a contract from the Michigan Department of Technology, Management & Budget (DTMB). The contract entails the execution of a thorough live carbon tracking program. This strategic move by NZero aligns with the commitment to enhancing environmental sustainability and is set to significantly impact carbon management efforts.",
            "tickers": [
                "NDXP"
            ],
            "time": "15:26:46",
            "timestamp": "2025-02-05T15:26:46Z",
            "url": "https://www.prnewswire.com/news-releases/nzero-wins-prestigious-contract-with-michigan-to-power-the-states-carbon-data-management-program-302369013.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-05",
            "headline": "Trust in government reaches historic low with only 23% of Americans trusting federal gov't in 2024, down from 35% in 2022.",
            "id": "9d0f1c90-c949-40aa-ab95-4653e9dbc1cb",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "As of February 5, 2025, it has been observed that public confidence in the government has reached record low levels, a trend that has been ongoing for years. In 2024, only 23% of the American population stated that they have faith in the federal government. This percentage represents a significant decrease from the 35% reported in 2022, as indicated by a nationwide survey conducted recently.",
            "tickers": [
                "NDXP"
            ],
            "time": "15:26:44",
            "timestamp": "2025-02-05T15:26:44Z",
            "url": "https://www.prnewswire.com/news-releases/trust-and-the-government--a-virtual-briefing-for-journalists-this-friday-feb-7-302369012.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-05",
            "headline": "Park Street Imports seals $100M deal with King Henri Christophe Spirits LLC, a major milestone for the brand.",
            "id": "067118e3-31e8-49b3-a1d9-48747c579208",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "In Miami on February 5, 2025, it was announced that Park Street Imports, a prominent American alcohol distribution firm, has formed a valuable partnership valued at 100 million USD with King Henri Christophe Spirits LLC. This agreement represents a major achievement for the brand, which is under the ownership of Emmanuel Fritz Paret.",
            "tickers": [
                "NDXP"
            ],
            "time": "15:26:42",
            "timestamp": "2025-02-05T15:26:42Z",
            "url": "https://www.prnewswire.com/news-releases/park-street-imports-signs-deal-worth-100-million-with-king-henri-christophe-spirits-llc-302369014.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-05",
            "headline": "Illinois Tool Works Q4: Revenue $3.932B, decline 1.3% YoY. EPS beats estimates. Outlook shows modest growth by 2025.",
            "id": "d12255db-068d-46dc-8665-25ed818088a6",
            "is_major": true,
            "source": "Benzinga",
            "source_type": "news",
            "summary": "Illinois Tool Works Inc. (NYSE:ITW) announced fourth-quarter revenue totaling $3.932 billion, marking a 1.3% decline compared to the previous year and falling short of the expected $3.99 billion consensus. Organic revenue growth decreased by 0.5%, but excluding a 0.9% impact from Product Line Simplification, organic growth turned positive at 0.4%. Revenue by segments included: Automotive OEM at $785 million (-4% YoY), Food Equipment at $672 million (+3% YoY), Test & Measurement and Electronics at $747 million (+2% YoY), Welding at $447 million (-1% YoY), Polymers & Fluids at $430 million (-2% YoY), Construction Products at $438 million (-5% YoY), and Specialty Products at $416 million (-5% YoY). The operating income saw a 4.4% increase year over year, reaching $1.031 billion, with the operating margin expanding by 140 basis points to 26.2%. *Note: Full story available on Benzinga.com.",
            "tickers": [
                "ITW"
            ],
            "time": "15:24:53",
            "timestamp": "2025-02-05T15:24:53Z",
            "url": "https://www.benzinga.com/news/earnings/25/02/43497501/illinois-tool-works-q4-revenue-declines-eps-tops-estimates-2025-outlook-signals-modest-growth-more"
        },
        {
            "beta_headline": null,
            "category": "investing",
            "date": "2025-02-05",
            "headline": "Senate Committee votes to advance Commerce Secretary nominee Lutnick on 16-12 vote.",
            "id": "59aab67a-8871-4a47-bcb6-2b096b6288f4",
            "is_major": false,
            "source": "Tradex",
            "source_type": "news",
            "summary": null,
            "tickers": [],
            "time": "15:24:52",
            "timestamp": "2025-02-05T15:24:52Z",
            "url": null
        },
        {
            "beta_headline": null,
            "category": "investing",
            "date": "2025-02-05",
            "headline": "Fed's Barkin: The US labor market has stabilized.",
            "id": "fddce6c6-5520-4f05-8621-814e40faaf7b",
            "is_major": true,
            "source": "Tradex",
            "source_type": "news",
            "summary": null,
            "tickers": [],
            "time": "15:22:49",
            "timestamp": "2025-02-05T15:22:49Z",
            "url": null
        },
        {
            "beta_headline": null,
            "category": "investing",
            "date": "2025-02-05",
            "headline": "Fed's Barkin: The jobs market could break toward more hiring or firing.",
            "id": "d84d9499-56ee-4b65-9180-c1b51d005bd7",
            "is_major": true,
            "source": "Tradex",
            "source_type": "news",
            "summary": null,
            "tickers": [],
            "time": "15:22:49",
            "timestamp": "2025-02-05T15:22:49Z",
            "url": null
        }
    ]
}
