{
    "news": [
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-05",
            "headline": "Scenic Valley Ranch Vineyards excels, wins awards at top wine competitions in California.",
            "id": "ae4c3fa7-ca76-40eb-af7c-697f8c8062d4",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "In Ramona Valley, California, on February 4, 2025, Scenic Valley Ranch Vineyards (SVR) achieved national recognition by winning numerous awards at two prestigious wine competitions: the San Francisco Chronicle Wine Competition and the San Francisco International Wine Competition. These accolades highlight SVR's excellence in the industry.",
            "tickers": [
                "NDXP"
            ],
            "time": "03:27:57",
            "timestamp": "2025-02-05T03:27:57Z",
            "url": "https://www.prnewswire.com/news-releases/scenic-valley-ranch-vineyards-earns-top-honors-at-prestigious-wine-competitions-302368305.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-05",
            "headline": "US stops parcel service from China as trade restrictions kick in. About 3M parcels a day imported, sparking fentanyl fears.",
            "id": "53c30b6a-06b7-4460-b876-bbb6b76077e1",
            "is_major": false,
            "source": "NYT",
            "source_type": "news",
            "summary": "Every day, approximately three million parcels are being imported into the United States with minimal customs inspection, leading to concerns about the effortless transfer of fentanyl.",
            "tickers": [],
            "time": "03:26:50",
            "timestamp": "2025-02-05T03:26:50Z",
            "url": "https://www.nytimes.com/2025/02/04/business/china-us-usps-de-minimis.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-05",
            "headline": "Global information services market to expand by USD 182.8 billion by 2029, fueled by AI use for risk management - Technavio.",
            "id": "2dd44199-770a-4568-9639-a8f995137374",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "A recent report highlights the significant impact of AI on transforming markets. The global information services market is projected to increase by a substantial USD 182.8 billion between 2025 and 2029. Research from Technavio indicates a forecasted compound annual growth rate (CAGR) of over 15.8% during this period, showcasing the rapid growth and influence of AI technologies in driving market evolution.",
            "tickers": [
                "NDXP"
            ],
            "time": "03:23:54",
            "timestamp": "2025-02-05T03:23:54Z",
            "url": "https://www.prnewswire.com/news-releases/information-services-market-to-grow-by-usd-182-8-billion-by-2029--use-of-services-for-risk-management-boosts-market-ai-powered-market-evolution-report---technavio-302367701.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-05",
            "headline": "Allianz and IAG reportedly considering bids for leading Western Australia insurer RAC.",
            "id": "046e8463-2531-48db-8b64-e5d95a051538",
            "is_major": false,
            "source": "Bloomberg",
            "source_type": "news",
            "summary": null,
            "tickers": [
                "IAG",
                "NDXP"
            ],
            "time": "03:22:46",
            "timestamp": "2025-02-05T03:22:46Z",
            "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxPZzZOUlJSZksyTDdWMUtKQ2lpSHE3YUp1TU44MlZScXR1R2Q5VjRrMjdNNXdacHRXMWM5Zm5TeWhEQkxmN1hGZm1RWDFROE9xZFlSOGhqN09XU2NoXzk2WjZTZkZnakVvenpzNzYwcHl1UnM2SkRfQTVmLVJQcFAxRmhJZmczcC1rWWdXYVFVZWR0VUNENVRlMUhuVWs3VXhqSWJIbzlubXBWVl9OcFRiZVNXRmI?oc=5"
        },
        {
            "beta_headline": null,
            "category": "crypto",
            "date": "2025-02-05",
            "headline": "Senator Sandra O’Brien of Ohio introduces bill for state’s second Bitcoin reserve, aiming to create Ohio Bitcoin Reserve Fund.",
            "id": "450c1972-1867-40dc-9e9a-8421709a2d8a",
            "is_major": true,
            "source": "Cointelegraph",
            "source_type": "news",
            "summary": "Senator Sandra O’Brien of Ohio is proposing a plan to authorize the state’s treasurer to invest in Bitcoin exclusively, forming the \"Ohio Bitcoin Reserve Fund.\" O’Brien's initiative aims to capitalize on the potential of Bitcoin by allowing the treasurer to incorporate it into the state’s investment portfolio. This move is significant as it marks a departure from traditional investment strategies and could potentially open up new avenues for the state to leverage the digital currency. The proposal to limit investments to Bitcoin specifically, rather than other cryptocurrencies, underscores a focused approach to digital asset investment. If approved, this initiative could have far-reaching implications for Ohio's financial future.",
            "tickers": [],
            "time": "03:18:59",
            "timestamp": "2025-02-05T03:18:59Z",
            "url": "https://cointelegraph.com/news/ohio-senator-state-second-bitcoin-reserve-bill?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound"
        },
        {
            "beta_headline": null,
            "category": "crypto",
            "date": "2025-02-05",
            "headline": "Gold prices reach record high at $2,849.05 per ounce, driven by US-China tensions and Middle East issues. Gold outperforms Bitcoin by posting 7.31% YTD gain compared to Bitcoin's 4.27%. Peter Schiff sees selling as bullish.",
            "id": "abafdf84-7b79-48ff-b4d4-0678a22d1571",
            "is_major": false,
            "source": "Benzinga",
            "source_type": "news",
            "summary": "On Wednesday, gold prices hit a record high of $2,849.05 per ounce due to escalating U.S.-China trade tensions and Middle East geopolitical uncertainties. The precious metal has shown strength in 2021, with a year-to-date increase of 7.31%, surpassing Bitcoin's 4.27% rise. This spike followed ex-President Trump imposing a 10% tariff on Chinese imports, prompting a cautious response from China. Economist Peter Schiff, a gold advocate, sees the current market sentiment as positive, noting that the public selling rather than buying is a bullish sign for gold. For detailed information, refer to Benzinga.com.",
            "tickers": [
                "BTC"
            ],
            "time": "03:14:50",
            "timestamp": "2025-02-05T03:14:50Z",
            "url": "https://www.benzinga.com/markets/commodities/25/02/43485292/gold-outshines-bitcoin-as-trumps-gaza-plan-us-china-tensions-fuel-rally-peter-schiff-calls-it"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-05",
            "headline": "Global high-end bicycle market to increase by $6.5 billion by 2029 due to rising e-bike adoption, growing at CAGR of 7.5%.",
            "id": "d92b53a6-bef1-4702-ac72-6e32778d955b",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "A recent report utilizing AI analysis reveals a projected growth in the global high-end bicycle market, estimated to increase by approximately $6.5 billion between 2025 and 2029, as highlighted by Technavio. The market is anticipated to exhibit a Compound Annual Growth Rate (CAGR) of nearly 7.5% throughout the forecast period.",
            "tickers": [
                "NDXP"
            ],
            "time": "03:13:51",
            "timestamp": "2025-02-05T03:13:51Z",
            "url": "https://www.prnewswire.com/news-releases/high-end-bicycle-market-to-grow-by-usd-6-5-billion-by-2029--growing-e-bike-adoption-in-developing-countries-boosts-market-ai-redefined-landscape-report---technavio-302367688.html"
        },
        {
            "beta_headline": null,
            "category": "crypto",
            "date": "2025-02-05",
            "headline": "NVIDIA warns shareholders about TRC Capital's mini-tender for <0.01% of shares. Shareholder details provided.",
            "id": "81d10021-7a65-46b7-a78f-54cc67e7492c",
            "is_major": false,
            "source": "Blockchain News",
            "source_type": "news",
            "summary": "NVIDIA has issued a warning regarding TRC Capital's unsolicited mini-tender offer for the company's shares, which accounts for under 0.01% of total outstanding stock. The company urges shareholders to be cautious and has provided important information regarding the offer.",
            "tickers": [
                "TRC",
                "NVDA"
            ],
            "time": "03:11:56",
            "timestamp": "2025-02-05T03:11:56Z",
            "url": "https://Blockchain.News/news/nvidia-cautions-shareholders-trc-capital-mini-tender-offer"
        },
        {
            "beta_headline": null,
            "category": "crypto",
            "date": "2025-02-05",
            "headline": "Crypto market recovery may take over 2 months if 2022 pattern repeats, analyst warns. Altcoin prices may not rebound until April.",
            "id": "e6c6aa96-5de5-4ad8-ace8-661e9e30fb74",
            "is_major": false,
            "source": "Cointelegraph",
            "source_type": "news",
            "summary": "According to crypto analyst Matthew Hyland, it is unlikely that altcoin prices will reach the levels seen in December until April at the earliest.",
            "tickers": [],
            "time": "03:10:48",
            "timestamp": "2025-02-05T03:10:48Z",
            "url": "https://cointelegraph.com/news/crypto-market-bitcoin-full-recovery-2022-pattern-repeats?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound"
        },
        {
            "beta_headline": null,
            "category": "commodities",
            "date": "2025-02-05",
            "headline": "Stocks stall as gold nears record highs, dollar faces worst week since July 2023 with a 1.7% decline. Gold benefits from dollar's weakness. Bank of Japan raised interest rates by 25 basis points to 0.5%.",
            "id": "04835876-1d72-4c55-9a34-26d20c723d94",
            "is_major": false,
            "source": "Benzinga",
            "source_type": "news",
            "summary": "Wall Street took a pause on Friday, as the S&amp;P 500 index held steady near the flatline during midday trading in New York following a five-day rally that propelled the market to new record highs. Attention of investors shifted towards the forex and gold markets. The US dollar saw its most significant weekly decline since July 2023 after President Donald Trump avoided implementing new tariffs in his first week and urged the Federal Reserve to cut interest rates. The US dollar index, monitored by the Invesco DB USD Index Bullish Fund ETF (NYSE: UUP), fell by 0.7% on Friday, extending its weekly drop to 1.7%. Further contributing to the dollar's decline, the Bank of Japan raised interest rates by 25 basis points to 0.5%, hitting the highest level since 2008, meeting broader expectations. Gold benefitted from the weakness in the dollar.",
            "tickers": [
                "NVO",
                "CSX",
                "AXP",
                "ISRG",
                "FCNCA",
                "ERIC",
                "XLU",
                "XLI",
                "XLE",
                "UUP",
                "SPY",
                "IWM",
                "QQQ",
                "GLD",
                "HCA",
                "DIA",
                "NEE",
                "VZ",
                "TXN"
            ],
            "time": "03:04:56",
            "timestamp": "2025-02-05T03:04:56Z",
            "url": "https://www.benzinga.com/economics/macro-economic-events/25/01/43201014/stocks-stall-gold-nears-record-highs-as-dollar-faces-worst-week-since-july-2023-w"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-05",
            "headline": "IonQ partners with TII to boost quantum research. Abu Dhabi's TII will use IonQ's platform for various research areas. IonQ shares down premarket.",
            "id": "06689410-2a4e-46e8-af3d-cc49f010ef4f",
            "is_major": false,
            "source": "Benzinga",
            "source_type": "news",
            "summary": "Shares of IonQ, Inc. (NYSE: IONQ) were down in premarket trading on Monday after the company extended its partnership with Abu Dhabi's Quantum Research Center - Technology Innovation Institute (TII). This renewed agreement aims to bolster the UAE's standing in the global science and technology sectors. Under the terms of the agreement, TII will leverage IonQ's quantum computing platform to further research in various fields, including but not limited to simulating physical systems, quantum image processing, and solving linear equations. The platform will also play a key role in improving financial portfolio optimization and estimating quantum system properties. This strategic collaboration highlights the commitment of both parties to pushing the boundaries of technological advancement.",
            "tickers": [
                "FCUS",
                "SPRX",
                "IONQ"
            ],
            "time": "03:04:54",
            "timestamp": "2025-02-05T03:04:54Z",
            "url": "https://www.benzinga.com/news/contracts/25/01/43231290/ionq-partners-with-uaes-tii-to-accelerate-quantum-research-and-hybrid-algorithm"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-05",
            "headline": "Atlas Energy is set to acquire Moser Energy for $220 million in a deal involving cash and stock consideration.",
            "id": "d99d2ecc-9bf0-44e1-8c2e-2c7dc8f2b2b3",
            "is_major": true,
            "source": "Benzinga",
            "source_type": "news",
            "summary": "Atlas Energy Solutions Inc. (NYSE:AESI) saw a rise in shares today following the announcement of its acquisition of Moser Energy Systems for a total of $220 million. The deal consists of $180 million in cash and around 1.7 million shares of Atlas’ common stock, valued at $40 million based on the 20-day trailing volume-weighted average price as of January 24, 2025. Atlas has the option to pay the full amount in cash if preferred over stock issuance. The final payment structure will be determined at closing, with potential adjustments to the stock portion. In the event the cash option is not utilized, Atlas has the right to redeem some or all of the issued shares for cash post-closing. The transaction is set to close by a specified date. For further details, refer to the complete article on Benzinga.com.",
            "tickers": [
                "SDVD",
                "AESI"
            ],
            "time": "03:04:52",
            "timestamp": "2025-02-05T03:04:52Z",
            "url": "https://www.benzinga.com/25/01/43240220/atlas-energy-to-acquire-moser-energy-in-220-million-sees-q4-fy-revenue-below-consensus"
        },
        {
            "beta_headline": null,
            "category": "commodities",
            "date": "2025-02-05",
            "headline": "Analyst downgrades Plug Power stock to Sell, gives price forecast of $1 due to hydrogen policy risks and limited growth.",
            "id": "11315301-93aa-4ea8-87c8-933f9bb97584",
            "is_major": false,
            "source": "Benzinga",
            "source_type": "news",
            "summary": "Shares of Plug Power Inc. (NASDAQ:PLUG) experienced a decline in trading on Monday after Seaport Global analyst Tom Curran downgraded the rating from Neutral to Sell, setting a price forecast of $1. In a recent update on the clean hydrogen sector in September, Curran highlighted concerns regarding low post-FID activity and an imbalanced pipeline favoring supply. The analyst noted negative developments in North America and Europe, which account for 93% of the company's projected 2024 revenue. Specifically, in the U.S., President Trump's executive order \"Unleashing American Energy\" triggered a 90-day review of the DOE's H2Hubs program, jeopardizing approximately $8 billion in grants. This scrutiny has left much of the funding at risk, as per Curran's assessment. For further details, the complete story is accessible on Benzinga.com.",
            "tickers": [
                "HYDR",
                "HDRO",
                "PLUG",
                "NVDA"
            ],
            "time": "03:04:50",
            "timestamp": "2025-02-05T03:04:50Z",
            "url": "https://www.benzinga.com/25/01/43243414/plug-power-analyst-downgrade-cites-weak-north-american-and-eu-hydrogen-outlook"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-05",
            "headline": "AST SpaceMobile's (NASDAQ:ASTS) stock is up as they received FCC approval for testing their satellites with smartphones.",
            "id": "d48385ec-0b76-449a-b8bb-cd3a7bae44ac",
            "is_major": false,
            "source": "Benzinga",
            "source_type": "news",
            "summary": "Shares of AST SpaceMobile, Inc. (NASDAQ:ASTS) are seeing an increase in premarket trading on Friday following the news that the company has obtained Special Temporary Authority (STA) from the Federal Communications Commission (FCC). This approval allows AST SpaceMobile to conduct testing in the U.S. using their first five commercial BlueBird satellites, which are currently in low Earth orbit. These satellites will be able to interact with regular smartphones from AT&T and Verizon through the use of low-band spectrum. The testing will enable various functionalities such as voice calls, data usage, video applications, and other cellular broadband capabilities without the need for specialized equipment or software updates. The FCC's green light for this initiative aligns with AST SpaceMobile's goals of expanding digital access, improving emergency communications, and advancing digital transformation efforts.",
            "tickers": [
                "ASTS",
                "UFO",
                "XTL"
            ],
            "time": "03:04:47",
            "timestamp": "2025-02-05T03:04:47Z",
            "url": "https://www.benzinga.com/news/contracts/25/01/43390269/why-is-ast-spacemobile-stock-jumping-today"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-05",
            "headline": "Top mid-cap gainers last week include Akero Therapeutics (NASDAQ: AKRO) up 106.57%, Surgery Partners (NASDAQ: SGRY) up 25.44%, and Flagstar Financial (NYSE: FLG) up 24.40%.",
            "id": "89c3e6e7-1f2a-4859-aaf5-3b7fc3fd5127",
            "is_major": false,
            "source": "Benzinga",
            "source_type": "news",
            "summary": "In the past week, these ten mid-cap stocks delivered outstanding performances. Among them were Akero Therapeutics, Inc. (NASDAQ: AKRO), which saw a remarkable surge of 106.57% following the release of positive preliminary Week 96 results from the SYMMETRY Phase 2B study of Efruxifermin. This boost led to multiple analysts raising their price targets for the stock. Surgery Partners, Inc. (NASDAQ: SGRY) also experienced a notable increase of 25.44% after revealing a non-binding acquisition proposal from Bain Capital Private Equity. Similarly, Flagstar Financial, Inc. (NYSE: FLG) witnessed a rise of 24.40% after surpassing financial expectations. Barclays analyst Jared Shaw continued to recommend an Overweight rating on the stock. For more detailed information, the complete article can be found on Benzinga.com.",
            "tickers": [
                "HIMS",
                "AKRO",
                "BHF",
                "SGRY",
                "VIAV",
                "KC",
                "FLG",
                "NXT",
                "OSK",
                "EAT",
                "BCS"
            ],
            "time": "03:04:44",
            "timestamp": "2025-02-05T03:04:44Z",
            "url": "https://www.benzinga.com/news/mid-cap/25/02/43423259/akero-therapeutics-brinker-international-and-viavi-are-among-top-mid-cap-gainers-last-week-jan-27-ja"
        },
        {
            "beta_headline": null,
            "category": "crypto",
            "date": "2025-02-05",
            "headline": "El Salvador's failed Bitcoin experiment is a cautionary tale for developing nations pursuing economic autonomy through crypto adoption.",
            "id": "9940c4cf-0dd0-415e-984c-4b0538cf34e0",
            "is_major": false,
            "source": "Cointelegraph",
            "source_type": "news",
            "summary": "The movement for economic autonomy in El Salvador through making cryptocurrency legal tender has come to an end. This development serves as a cautionary tale for other developing nations looking to follow a similar path.",
            "tickers": [],
            "time": "03:04:43",
            "timestamp": "2025-02-05T03:04:43Z",
            "url": "https://cointelegraph.com/news/el-salvador-s-failed-bitcoin-experiment?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound"
        },
        {
            "beta_headline": null,
            "category": "investing",
            "date": "2025-02-05",
            "headline": "Taiwanese 10-Year Government Bond Yield Drops 2.5 Basis Points to 1.5750%",
            "id": "4f8a483c-c62b-494a-b11d-84555e9ef370",
            "is_major": true,
            "source": "Tradex",
            "source_type": "news",
            "summary": null,
            "tickers": [],
            "time": "03:03:49",
            "timestamp": "2025-02-05T03:03:49Z",
            "url": null
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-05",
            "headline": "2025 Foxconn TLPGA Players Championship to host 90 women athletes from 11 countries, including former world No. 1's from South Korea and Taiwan.",
            "id": "102b1dfb-1325-4c8b-9170-7c8319b63606",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "Two former world No. 1 golfers, one from South Korea and the other from Taiwan, are set to compete in the upcoming tournament in Taipei on February 4, 2025. The event, organized by the LPGA of Taiwan (TLPGA) and sponsored by Hon Hai Technology Group (Foxconn), will feature a prominent lineup of players for the 2nd annual Foxconn TLPGA Players competition.",
            "tickers": [
                "NDXP"
            ],
            "time": "03:03:46",
            "timestamp": "2025-02-05T03:03:46Z",
            "url": "https://www.prnewswire.com/news-releases/2025-foxconn-tlpga-players-championship-to-host-90-women-athletes-from-11-countries-302368195.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-05",
            "headline": "Trump used IEEPA to impose tariffs on top US trading partners, citing powers from the law.",
            "id": "161d7a6e-e2a5-4944-8b7f-57e49047a599",
            "is_major": false,
            "source": "NYT",
            "source_type": "news",
            "summary": "The President announced his decision to enforce tariffs on America's biggest trade allies, citing authority granted by the law.",
            "tickers": [],
            "time": "03:03:45",
            "timestamp": "2025-02-05T03:03:45Z",
            "url": "https://www.nytimes.com/2025/02/02/us/politics/trump-tariffs-ieepa.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-05",
            "headline": "Cosmetic skin care market to increase by $101.9 billion by 2029 due to AI impact and growing population aged 30-50 - Technavio.",
            "id": "7eaf3fbd-eda3-4978-a212-d58c91fdd971",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "A recent report discusses the impact of AI on the market, predicting a significant growth in the global cosmetic skin care market. According to Technavio, the market size is expected to increase by USD 101.9 billion between 2025 and 2029. The forecast indicates a Compound Annual Growth Rate (CAGR) of 9.5% during this period, reflecting the transformative influence of AI technologies on the market landscape.",
            "tickers": [
                "NDXP"
            ],
            "time": "03:03:44",
            "timestamp": "2025-02-05T03:03:44Z",
            "url": "https://www.prnewswire.com/news-releases/cosmetic-skin-care-market-to-grow-by-usd-101-9-billion-by-2029--growing-population-aged-30-50-boosts-market-report-on-ai-impact-on-market-trends---technavio-302367677.html"
        },
        {
            "beta_headline": null,
            "category": "crypto",
            "date": "2025-02-05",
            "headline": "Robinhood suspends Super Bowl betting post CFTC request, stopping bets for 1% of customers after Feb. 4 launch.",
            "id": "f9f567ec-cf50-4a9b-b2ea-40243e492a2a",
            "is_major": false,
            "source": "Cointelegraph",
            "source_type": "news",
            "summary": "Robinhood Derivatives has suspended Super Bowl betting after introducing the feature to 1% of its clients following its launch on February 4th.",
            "tickers": [
                "HOOD"
            ],
            "time": "02:56:32",
            "timestamp": "2025-02-05T02:56:32Z",
            "url": "https://cointelegraph.com/news/robinhood-suspends-super-bowl-bets-cftc-request?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-05",
            "headline": "Husqvarna Group partners with Flex Ltd., divest manufacturing in South Carolina, for enhanced flexibility and profits.",
            "id": "69879a19-74ca-4195-8512-261c6216b23d",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "Today, on February 4, 2025, Husqvarna Group revealed a significant move by forming a strategic collaboration with Flex Ltd., a prominent global manufacturer. As part of this partnership, Husqvarna has made the decision to sell its manufacturing operations in Orangeburg, South Carolina, USA without delay. This development marks a crucial shift in the company's operational structure and signifies a new phase in its business approach.",
            "tickers": [
                "USA",
                "NDXP",
                "FLEX"
            ],
            "time": "02:54:29",
            "timestamp": "2025-02-05T02:54:29Z",
            "url": "https://www.prnewswire.com/news-releases/husqvarna-group-continues-transformation-in-north-america-for-increased-flexibility-and-long-term-profitability-302368274.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-05",
            "headline": "Global online language learning market to reach USD 81.55 billion by 2029, growing at CAGR of 27.5% fueled by AI tech.",
            "id": "9ee39b97-06c0-444a-a772-a8409411b5d7",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "A recent report analyzing the influence of AI on market trends indicates that the worldwide online language learning sector is projected to increase significantly by USD 81.55 billion between 2025 and 2029. This growth is expected to occur at a compound annual growth rate (CAGR) of 27.5% throughout the forecast period.",
            "tickers": [
                "NDXP"
            ],
            "time": "02:52:23",
            "timestamp": "2025-02-05T02:52:23Z",
            "url": "https://www.prnewswire.com/news-releases/online-language-learning-market-to-grow-by-usd-81-55-billion-by-2029--cost-benefits-and-flexibility-boost-market-report-on-how-ai-is-driving-transformation---technavio-302367673.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-05",
            "headline": "Reliance's partnership with Shein impacts Trent's shares. #India #Ambani #Reliance #Shein #Trent",
            "id": "74951825-f071-40b4-8265-ece39779db86",
            "is_major": false,
            "source": "Bloomberg",
            "source_type": "news",
            "summary": null,
            "tickers": [
                "NDXP"
            ],
            "time": "02:47:02",
            "timestamp": "2025-02-05T02:47:02Z",
            "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxOclJXTUJkbkhXcWpYcFNock9XVVpqZk5PbzRVRFYtRVNaSGtwRHJlTlFuQzRYSTg5TlJHcVpDSVpOeHhHU1o0MUFpYkVFMERSaXRQNjlXYXFoeUZ5UHA0QTJtSDA1eXJuRnNQWVp2QWRsNHF5VkRfMUd2THg3YWw2Q0h6UkJoZXlndWJxMElBVzJfRHRlOG1OUXlrYlh2M0diZHdzTmVvd2ZwSE5J?oc=5"
        },
        {
            "beta_headline": null,
            "category": "investing",
            "date": "2025-02-05",
            "headline": "Australian bonds increase slightly following pricing for 2036 syndication",
            "id": "45050e36-6c84-4f76-a74e-933bef132638",
            "is_major": false,
            "source": "Tradex",
            "source_type": "news",
            "summary": null,
            "tickers": [],
            "time": "02:43:13",
            "timestamp": "2025-02-05T02:43:13Z",
            "url": null
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-05",
            "headline": "Home services market to grow by USD 1.03 trillion by 2029, propelled by AI and urbanization, reports Technavio.",
            "id": "4cde6d09-c96d-4fdd-ab0d-384b8f536395",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "A recent report highlighted the significant impact of AI on market evolution, particularly in the home services sector. Forecasts indicate a substantial growth of approximately USD 1.03 trillion in the global home services market between 2025 and 2029. The market is anticipated to maintain a compound annual growth rate (CAGR) of 10.5% throughout the forecast period.",
            "tickers": [
                "NDXP"
            ],
            "time": "02:42:20",
            "timestamp": "2025-02-05T02:42:20Z",
            "url": "https://www.prnewswire.com/news-releases/home-services-market-to-grow-by-usd-1-03-trillion-by-2029--increasing-urbanization-boosts-market-ai-powered-market-evolution-report---technavio-302367666.html"
        },
        {
            "beta_headline": null,
            "category": "crypto",
            "date": "2025-02-05",
            "headline": "AI model by BioTuring transforms cancer research, providing cellular-level insights for better understanding of tumor dynamics and drug development.",
            "id": "2875f4d5-9ed9-4154-9ff6-ea449e317611",
            "is_major": false,
            "source": "Blockchain News",
            "source_type": "news",
            "summary": "BioTuring's artificial intelligence model provides in-depth cellular visualizations of cancer, leading to improved comprehension of tumor dynamics and supporting drug development efforts. The model has been featured in NVIDIA's blog for its significant impact in advancing the understanding of cancer research. This advanced technology is revolutionizing the field by offering detailed insights into cellular structures, with a potential to accelerate drug discovery processes.",
            "tickers": [
                "NVDA"
            ],
            "time": "02:41:51",
            "timestamp": "2025-02-05T02:41:51Z",
            "url": "https://Blockchain.News/news/ai-model-revolutionizes-cancer-research"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-05",
            "headline": "Bus Duct Market to hit $16.60 billion by 2029, with a 5.2% CAGR driven by smart tech and energy transition.",
            "id": "268f95b8-2303-4ffa-9bb0-4f683689c52f",
            "is_major": false,
            "source": "Benzinga",
            "source_type": "news",
            "summary": "The Bus Duct Market size is expected to increase from USD 12.91 billion in 2024 to USD 16.60 billion by 2029, representing a Compound Annual Growth Rate (CAGR) of 5.2%. This growth is driven by factors such as heightened electrification and infrastructure development, particularly in industries like utilities and transportation that require efficient distribution systems. Government policies promoting renewable power and grid modernization are also contributing to market growth. The integration of smart technologies like automation and data analytics in bus duct systems is enhancing performance, efficiency, and reliability, while reducing energy waste and operational costs. These trends are likely to further boost the Bus Duct Market, positioning it as a crucial component of industrial modernization and the transition to sustainable energy sources.",
            "tickers": [
                "NDXP"
            ],
            "time": "02:36:17",
            "timestamp": "2025-02-05T02:36:17Z",
            "url": "https://www.benzinga.com/pressreleases/25/02/g43485139/bus-duct-market-size-to-grow-16-60-billion-at-a-5-2-cagr-by-2029-report-by-marketsandmarkets"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-05",
            "headline": "US stops parcel service from China as Trump's trade curbs start. Daily imports of 3M parcels had no inspections or duties.",
            "id": "b6a77ad9-e6f3-492e-b387-7b46b8adb363",
            "is_major": false,
            "source": "NYT",
            "source_type": "news",
            "summary": "Every day, the United States receives approximately 3 million packages through imports without undergoing customs inspection or paying any duties.",
            "tickers": [],
            "time": "02:35:55",
            "timestamp": "2025-02-05T02:35:55Z",
            "url": "https://www.nytimes.com/2025/02/04/business/china-us-usps-de-minimis.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-05",
            "headline": "Global fast fashion market expected to grow by $79.2 billion by 2029 due to youth demand, fueled by AI-defined report.",
            "id": "cb712318-30a1-4f14-8cb3-ec157212b2bb",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "On February 4, 2025, a report utilizing AI to track market trends reveals that the global fast fashion industry is projected to increase by USD 79.2 billion between 2025 and 2029, as per Technavio. During this period, the market is expected to expand at a compound annual growth rate (CAGR) of 11%. The sector is witnessing significant growth, indicating a promising future for the fast fashion segment.",
            "tickers": [
                "NDXP"
            ],
            "time": "02:30:17",
            "timestamp": "2025-02-05T02:30:17Z",
            "url": "https://www.prnewswire.com/news-releases/fast-fashion-market-to-grow-by-usd-79-2-billion-by-2029--burgeoning-youth-populations-demand-for-fast-fashion-clothing-boosts-market-ai-redefined-report---technavio-302367665.html"
        },
        {
            "beta_headline": null,
            "category": "crypto",
            "date": "2025-02-05",
            "headline": "Malicious software found in Android, iOS app kits per Kaspersky: Malware can scan images for crypto wallet passwords.",
            "id": "6c73138f-7766-466e-ace9-96e6a72a9dad",
            "is_major": false,
            "source": "Cointelegraph",
            "source_type": "news",
            "summary": "The software development kit for phone apps by Google and Apple has been reportedly identified by Kaspersky Labs to contain malware capable of scanning images for crypto wallet recovery phrases. This poses a significant security threat to users as their sensitive information could be at risk. It is crucial for users to remain vigilant and ensure their devices are protected from such malicious activity.",
            "tickers": [
                "AAPL"
            ],
            "time": "02:27:20",
            "timestamp": "2025-02-05T02:27:20Z",
            "url": "https://cointelegraph.com/news/crypto-stealing-malware-andriod-ios-app-kits-kaspersky?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound"
        },
        {
            "beta_headline": null,
            "category": "investing",
            "date": "2025-02-05",
            "headline": "Havasht does not comment on Honda-Nissan tie-up report.",
            "id": "1b25c1dd-67b7-441e-b845-ec48933fc349",
            "is_major": false,
            "source": "Tradex",
            "source_type": "news",
            "summary": null,
            "tickers": [],
            "time": "02:21:09",
            "timestamp": "2025-02-05T02:21:09Z",
            "url": null
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-05",
            "headline": "Former Google employee accused of spying to promote AI development in China, facing charges for espionage.",
            "id": "b09ce5ef-1330-4ec5-8069-80639701152f",
            "is_major": false,
            "source": "Bloomberg",
            "source_type": "news",
            "summary": null,
            "tickers": [
                "NDXP"
            ],
            "time": "02:20:56",
            "timestamp": "2025-02-05T02:20:56Z",
            "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxPM19qc19nZlFJMEhNLWM0X2NIZFBPNzY3UDAzTTg0VVA1RDFxUWV3UHZYREtHWFI2MXZZYTI2NklIcUxfbHdnTnVJQ2JoLWxLM0xpV3luQkNhMlM1N0NmZHZEc21kUFZhR3RiX2UyVk5jQlRyYlFTVDZ2cDNETnlvN0U5aE9VV1lUbXdRSUVrcHEyR3FaakxEOXlNbkZFeVF4LVlyUnZoUWlqbFFMM25pcUJNWQ?oc=5"
        },
        {
            "beta_headline": null,
            "category": "investing",
            "date": "2025-02-05",
            "headline": "Yen Rises 0.7% Against Dollar",
            "id": "e0ec89e8-d1f6-4aa6-a5f5-454dae02689c",
            "is_major": false,
            "source": "Tradex",
            "source_type": "news",
            "summary": null,
            "tickers": [],
            "time": "02:20:09",
            "timestamp": "2025-02-05T02:20:09Z",
            "url": null
        },
        {
            "beta_headline": null,
            "category": "investing",
            "date": "2025-02-05",
            "headline": "China Ministry of Finance to Issue 12.5 Billion Yuan Bonds in Hong Kong in February",
            "id": "4ccae7e2-e688-43e0-a38f-7659bed08c1b",
            "is_major": false,
            "source": "Tradex",
            "source_type": "news",
            "summary": null,
            "tickers": [],
            "time": "02:19:09",
            "timestamp": "2025-02-05T02:19:09Z",
            "url": null
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-05",
            "headline": "US cleaning services market to surge by $37.8 billion by 2029; AI reshapes market dynamics, with expected CAGR of 5.9%.",
            "id": "6f068b2b-5c9a-41aa-a818-d082806d2ed6",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "As of February 4, 2025, recent research indicates that artificial intelligence (AI) is significantly transforming the market environment. The commercial and residential cleaning services sector in the United States is projected to expand by a substantial USD 37.8 billion during the period from 2025 to 2029, as outlined by Technavio. This market segment is expected to experience a compound annual growth rate (CAGR) of 5.9% during this time frame, showcasing the impact of AI integration in shaping the industry landscape.",
            "tickers": [
                "NDXP"
            ],
            "time": "02:18:13",
            "timestamp": "2025-02-05T02:18:13Z",
            "url": "https://www.prnewswire.com/news-releases/commercial-and-residential-cleaning-services-market-in-the-us-to-grow-by-usd-37-8-billion-by-2029--rising-popularity-of-multifamily-dwellings-boosts-market-ai-impact-report---technavio-302367693.html"
        },
        {
            "beta_headline": null,
            "category": "crypto",
            "date": "2025-02-05",
            "headline": "EigenLayer launches Level 1 Agents, marrying authentic tools with AVSs for more transparent AI systems. #OnchainAI",
            "id": "63899fb5-bc17-4af7-968d-0124636b6cfd",
            "is_major": false,
            "source": "Blockchain News",
            "source_type": "news",
            "summary": "EigenLayer has recently launched a new feature called 'Level 1 Agents,' which aims to improve transparency and accountability in AI systems by combining verifiable tools with AVSs. This step is crucial in ensuring that AI technologies are operating ethically and responsibly. By incorporating verifiable tools, EigenLayer is taking a significant stride towards creating more trustworthy AI systems.",
            "tickers": [],
            "time": "02:12:12",
            "timestamp": "2025-02-05T02:12:12Z",
            "url": "https://Blockchain.News/news/verifiable-agents-on-eigenlayer-a-new-era-for-onchain-ai"
        },
        {
            "beta_headline": null,
            "category": "crypto",
            "date": "2025-02-05",
            "headline": "Cryptocurrencies drop as Trump's 'Crypto Czar' announces oversight committee. Liquidations hit nearly $485 million. BTC -2.96%, ETH -4.15%, DOGE -7.19%. Total crypto market cap falls to $3.23 trillion. Trend triggered by regulatory news.",
            "id": "9accc2e4-b93e-42a7-a27d-83d8c1daba4c",
            "is_major": true,
            "source": "Benzinga",
            "source_type": "news",
            "summary": "Major cryptocurrencies saw a significant decline following the announcement of a new regulatory oversight committee. Total market liquidations amounted to nearly $485 million in the past 24 hours. Bitcoin dropped by 2.96% to $98,240.17, Ethereum decreased by 4.15% to $2,735.57, and Dogecoin fell by 7.19% to $0.2649. The leading cryptocurrency hit its lowest point in 24 hours of trading at $97,924.27. Ethereum also faced downward pressure despite attention from Eric Trump. The market turbulence led to over 161,000 traders being liquidated. The total cryptocurrency open interest decreased by 5.61% to $113.45 trillion.",
            "tickers": [
                "BTC"
            ],
            "time": "02:12:05",
            "timestamp": "2025-02-05T02:12:05Z",
            "url": "https://www.benzinga.com/markets/cryptocurrency/25/02/43484922/bitcoin-ethereum-dogecoin-drops-as-trumps-crypto-czar-announces-oversight-committee-eric-t"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-05",
            "headline": "Global AI market in education to grow by $2.32 billion by 2028 due to customized learning paths.",
            "id": "eb85bdb6-ce0b-4a4f-b938-30505b39aac5",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "A recent report analyzing the influence of artificial intelligence on market trends reveals significant growth in the global AI market within the education sector. Predictions indicate a substantial increase of an estimated USD 2.32 billion between 2024 and 2028. The market is projected to maintain a Compound Annual Growth Rate (CAGR) of approximately...",
            "tickers": [
                "NDXP"
            ],
            "time": "02:08:09",
            "timestamp": "2025-02-05T02:08:09Z",
            "url": "https://www.prnewswire.com/news-releases/artificial-intelligence-ai-market-in-education-to-grow-by-usd-2-32-billion-by-2028--emphasis-on-customized-learning-paths-boosts-market-report-on-how-ai-is-driving-transformation---technavio-302367659.html"
        },
        {
            "beta_headline": null,
            "category": "investing",
            "date": "2025-02-05",
            "headline": "Australia Government Plans AUD 1.7 Billion Hospital Funding",
            "id": "95b1dcf8-25b2-4f58-a081-04fdea6d2eec",
            "is_major": false,
            "source": "Tradex",
            "source_type": "news",
            "summary": null,
            "tickers": [],
            "time": "02:07:06",
            "timestamp": "2025-02-05T02:07:06Z",
            "url": null
        },
        {
            "beta_headline": null,
            "category": "investing",
            "date": "2025-02-05",
            "headline": "Australia's Prime Minister Albanese Announces Funding in Canberra",
            "id": "cfe0ee33-6a4f-41e6-86de-f23f16979335",
            "is_major": true,
            "source": "Tradex",
            "source_type": "news",
            "summary": null,
            "tickers": [],
            "time": "02:07:06",
            "timestamp": "2025-02-05T02:07:06Z",
            "url": null
        },
        {
            "beta_headline": null,
            "category": "investing",
            "date": "2025-02-05",
            "headline": "(10MIN OLD) - US POSTAL SERVICE SUSPENDS INBOUND PARCELS FROM CHINA & HK\n\n$BABA $PDD",
            "id": "f376165c-ff7a-4462-9b9e-0a33cb8becff",
            "is_major": true,
            "source": "Tradex",
            "source_type": "news",
            "summary": null,
            "tickers": [
                "BABA",
                "PDD"
            ],
            "time": "02:05:32",
            "timestamp": "2025-02-05T02:05:32Z",
            "url": null
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-05",
            "headline": "Chinese brand Blokees showcases IP products at Spielwarenmesse 2025 in Nuremberg, attended by top 3 toy fairs with trends from Jan 28 - Feb 1.",
            "id": "84171b37-3b0c-4f27-9ccb-111df67b6ae0",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "In Shanghai on February 4, 2025, the Spielwarenmesse International Toy Fair, ranked among the top three toy-focused trade shows, took place in Nuremberg from January 28 to February 1, 2025. Blokees, a Chinese brand, showcased an extensive collection of building toys at this significant exhibition.",
            "tickers": [
                "NDXP"
            ],
            "time": "02:04:07",
            "timestamp": "2025-02-05T02:04:07Z",
            "url": "https://www.prnewswire.com/news-releases/blokees-exhibits-multiple-ip-series-products-at-spielwarenmesse-2025-in-nuremberg-302368245.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-05",
            "headline": "Maxar launches fifth and sixth WorldView Legion satellites from Kennedy Space Center, now has seven satellites in orbit.",
            "id": "dd9ea041-1858-409c-bc4b-c1440b0e2c1f",
            "is_major": false,
            "source": "Business Wire",
            "source_type": "news",
            "summary": "In Westminster, Colorado, Maxar Intelligence, a leading provider of secure and precise geospatial insights, has reported that its fifth and sixth WorldView Legion satellites are operating effectively following their launch into a mid-inclination orbit from Kennedy Space Center in Florida. The satellites were launched today onboard a SpaceX Falcon 9 rocket. This successful launch brings Maxar's total number of satellites in orbit to seven, all equipped to capture 30 cm-class imagery. This launch signifies a notable advancement in very-high resolution imaging capabilities for the company.",
            "tickers": [
                "NDXP"
            ],
            "time": "01:58:40",
            "timestamp": "2025-02-05T01:58:40Z",
            "url": "http://www.businesswire.com/news/home/20250204832232/en/Maxar-Successfully-Launches-Fifth-and-Sixth-WorldView-Legion-Satellites/?feedref=JjAwJuNHiystnCoBq_hl-Q-tiwWZwkcswR1UZtV7eGe24xL9TZOyQUMS3J72mJlQ7fxFuNFTHSunhvli30RlBNXya2izy9YOgHlBiZQk2LOzmn6JePCpHPCiYGaEx4DL1Rq8pNwkf3AarimpDzQGuQ=="
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-05",
            "headline": "Faraday Future appoints Tommy Zhao as Senior Director of FF Par Sales and After-Sales to drive future sales. (includes Nasdaq: FFIE)",
            "id": "abb34d4b-f4e4-46c0-8410-73d857edf7a4",
            "is_major": false,
            "source": "Business Wire",
            "source_type": "news",
            "summary": "Faraday Future Intelligent Electric Inc., a global intelligent electric mobility company based in California, has appointed Tommy Zhao as the new Senior Director of FF Par Sales and After-Sales. As part of his responsibilities, Mr. Zhao will be in charge of overseeing FF's Par Sales and the After-Sales department to enhance operational efficiency. With his extensive background in retail, sales strategy, and cost optimization, Mr. Zhao is set to drive excellence in these areas for the company. Faraday Future is listed on Nasdaq as FFIE.",
            "tickers": [
                "NDXP",
                "FFIE"
            ],
            "time": "01:58:38",
            "timestamp": "2025-02-05T01:58:38Z",
            "url": "http://www.businesswire.com/news/home/20250204681596/en/Faraday-Future-Appoints-Tommy-Zhao-as-Senior-Director-of-FF-Par-Sales-and-After-Sales-to-Help-Drive-Future-FF-and-FX-Sales/?feedref=JjAwJuNHiystnCoBq_hl-Q-tiwWZwkcswR1UZtV7eGe24xL9TZOyQUMS3J72mJlQ7fxFuNFTHSunhvli30RlBNXya2izy9YOgHlBiZQk2LOzmn6JePCpHPCiYGaEx4DL1Rq8pNwkf3AarimpDzQGuQ=="
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-05",
            "headline": "Swimming pool market to reach USD 7.28 billion growth by 2029 due to increasing demand for luxurious lifestyles.",
            "id": "b5e92ea7-5d51-49f3-946e-5c5053ecb66c",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "In a recent report on the impact of AI on market dynamics, it has been projected that the global swimming pool market is set to expand significantly by USD 7.28 billion between 2025 and 2029. Research conducted by Technavio forecasts a steady growth trajectory for the market, with a Compound Annual Growth Rate (CAGR) of 4.4% expected during this period.",
            "tickers": [
                "POOL",
                "NDXP"
            ],
            "time": "01:58:05",
            "timestamp": "2025-02-05T01:58:05Z",
            "url": "https://www.prnewswire.com/news-releases/swimming-pool-market-to-grow-by-usd-7-28-billion-by-2029--increasing-demand-for-luxurious-lifestyles-boosts-market-ai-powered-market-evolution-report---technavio-302367600.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-05",
            "headline": "Tokyo's first IPO of the year soars in trading debut, rising over 20%.",
            "id": "e7a59ede-61e7-495e-bf8b-9c48cac75a3d",
            "is_major": false,
            "source": "Bloomberg",
            "source_type": "news",
            "summary": null,
            "tickers": [
                "NDXP"
            ],
            "time": "01:56:51",
            "timestamp": "2025-02-05T01:56:51Z",
            "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxNaGhkT1NlbHB6ZlVkNjJjX0htQ2YwMXlKX1c0Tnd5V2JEQ1Z5Ni1SQ19USVBPTnVzMXdPVjdscjlsT1FYMjJxQmFTdE1Fd2NHWTI4RmlBRGpQQzVPZmhrMzlaSFBVc1RIRHQzMzY2SlhZU05EbG9Gb3dCbnVxNW9FMDREc0FzSlhjWHlHcXc2SUwtRl9ST3VhSlVPOWRXMDRQSHJxdWIzRVdMZklsMFFWeWJRbXM?oc=5"
        },
        {
            "beta_headline": null,
            "category": "crypto",
            "date": "2025-02-05",
            "headline": "CoreWeave unveils NVIDIA Blackwell Cloud Instances with NVIDIA GB200 NVL72, heralding unmatched AI potential.",
            "id": "56599d1d-78d2-490c-841b-71349738e67e",
            "is_major": false,
            "source": "Blockchain News",
            "source_type": "news",
            "summary": "CoreWeave has introduced NVIDIA GB200 NVL72-based instances to the market, becoming the first provider to offer NVIDIA Blackwell in the cloud. These instances deliver exceptional AI performance and scalability, setting a new standard in cloud computing. This release signifies a significant advancement in GPU technology, providing users with enhanced capabilities for their AI workloads.",
            "tickers": [
                "NVDA"
            ],
            "time": "01:56:45",
            "timestamp": "2025-02-05T01:56:45Z",
            "url": "https://Blockchain.News/news/coreweave-introduces-nvidia-blackwell-cloud-instances"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-05",
            "headline": "GH Research PLC priced $150 million public offering by selling 10,000,000 shares at $15/share. Additional 1,500,000 shares optional.",
            "id": "a01a3f92-860a-4014-b46a-9a10fbc8199b",
            "is_major": true,
            "source": "GlobeNewswire",
            "source_type": "news",
            "summary": "GH Research PLC, a biopharmaceutical company listed on Nasdaq under GHRS, has disclosed the pricing of its public offering in the U.S. The company declared the sale of 10,000,000 ordinary shares at $15.00 per share, totaling $150 million in gross proceeds. The offering is exclusive to GH Research PLC and is set to conclude on February 6, 2025, pending standard closing requirements. Furthermore, a provision has been made for underwriters to procure an extra 1,500,000 ordinary shares within a 30-day window following the offering's closure at the public price, deducting underwriting fees.",
            "tickers": [
                "NDXP",
                "GHRS"
            ],
            "time": "01:53:04",
            "timestamp": "2025-02-05T01:53:04Z",
            "url": "https://www.globenewswire.com/news-release/2025/02/05/3020875/0/en/GH-Research-Announces-Pricing-of-150-Million-Public-Offering.html"
        },
        {
            "beta_headline": null,
            "category": "investing",
            "date": "2025-02-05",
            "headline": "Enphase moves battery cell manufacturing away from China",
            "id": "72cb7858-25bf-44f5-a2c8-a66a4f817fb5",
            "is_major": false,
            "source": "Tradex",
            "source_type": "news",
            "summary": null,
            "tickers": [],
            "time": "01:52:04",
            "timestamp": "2025-02-05T01:52:04Z",
            "url": null
        }
    ]
}
