{
    "news": [
        {
            "beta_headline": null,
            "category": "investing",
            "date": "2025-02-04",
            "headline": "Trump Trade Advisor Navarro: If Trump succeeds in trade actions. we will structurally shift the American economy from over-reliance on income taxes, to tariff revenues.",
            "id": "3ca6ef9e-07d1-4fc8-9773-f7f0951abba4",
            "is_major": true,
            "source": "Tradex",
            "source_type": "news",
            "summary": null,
            "tickers": [],
            "time": "15:10:54",
            "timestamp": "2025-02-04T15:10:54Z",
            "url": null
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Pet Valu adds two Volvo VNR Electric trucks to its fleet in Surrey, BC for sustainable transportation, aiming to build Canada's strongest pet specialty distribution network.",
            "id": "3a65066a-3c89-42a4-b834-a5f4a5f84112",
            "is_major": false,
            "source": "GlobeNewswire",
            "source_type": "news",
            "summary": "In Surrey, British Columbia, on February 4, 2025, Pet Valu, a top Canadian specialty retailer of pet products, has incorporated two Volvo VNR Electric trucks into its fleet, being a customer of Volvo Trucks North America. This move forms a part of their continuous supply chain enhancement efforts. The company aims to bolster its pet specialty distribution network in Canada by using these zero-tailpipe emission trucks.",
            "tickers": [
                "NDXP"
            ],
            "time": "15:10:22",
            "timestamp": "2025-02-04T15:10:22Z",
            "url": "https://www.globenewswire.com/news-release/2025/02/04/3020514/0/en/Pet-Valu-Ventures-into-Sustainable-Transportation-with-First-Two-Volvo-VNR-Electric-Trucks.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Atwell acquires Terrascape Consulting, expanding resources in Southwest. Terrascape founded in 2006, based in Phoenix with expertise in engineering and surveying. Terms undisclosed.",
            "id": "dc77a6a2-148e-4a6b-9076-17753bbcfcd2",
            "is_major": true,
            "source": "Business Wire",
            "source_type": "news",
            "summary": "Atwell, a company based in Southfield, Michigan, has expanded its services by acquiring the operations of Terrascape Consulting. This acquisition, based in Phoenix, Arizona and founded in 2006, brings additional expertise in engineering and surveying to Atwell's resources. The terms of the transaction were not disclosed. Terrascape is known for its strong commitment to client service and understanding of the unique styles and landscapes of the Southwest region. They offer a wide range of engineering and surveying services to their clients.",
            "tickers": [
                "NDXP"
            ],
            "time": "15:09:50",
            "timestamp": "2025-02-04T15:09:50Z",
            "url": "http://www.businesswire.com/news/home/20250204989348/en/Atwell-Acquires-Terrascape-Consulting-Expanding-Resources-and-Expertise-in-the-Southwest/?feedref=JjAwJuNHiystnCoBq_hl-a2-DX8EjssEmMYWAmn7L6JnP4KQ0-VuR_Ed1_p6a8aSQvj2g8ZtgMSWm4nAO4sO4nr0TKd7CILvKt8KtThduJU_d6mxM68GteRxmy6jDm8WOZiG4SwpSv6tLEhMuQ8iTnO1u3OvtUKtPLlU5Ry9otk="
        },
        {
            "beta_headline": null,
            "category": "commodities",
            "date": "2025-02-04",
            "headline": "Research report analyzes trends in fibre prices, production, and consumption, with forecasts including cotton fibre demand and prices for 2024/25 season and man-made fibre production until 2030.",
            "id": "96cafe2a-fd94-4c26-a412-4b80f96b942d",
            "is_major": false,
            "source": "Business Wire",
            "source_type": "news",
            "summary": "A recent report titled \"Trends In Fibre Prices, Production And Consumption, December 2024\" by Textiles Intelligence Ltd. is now available on ResearchAndMarkets.com. This report offers an in-depth analysis of natural and man-made fibre production trends categorized by fibre type. Moreover, it presents projections for cotton fibre demand, supply, and prices for the upcoming 2024/25 season (August 1, 2024, to July 31, 2025), along with forecasts for man-made fibre production until 2030.",
            "tickers": [
                "NDXP"
            ],
            "time": "15:09:04",
            "timestamp": "2025-02-04T15:09:04Z",
            "url": "http://www.businesswire.com/news/home/20250204421628/en/World-Fibre-Prices-and-Production-Key-Trends-in-Cotton-Synthetic-and-Cellulosic-Fibre-Markets---ResearchAndMarkets.com/?feedref=JjAwJuNHiystnCoBq_hl-ZzpnHS32O5tBfLZHwy8L1lVsKLHj4l7ufu4XoarznHcCc3RCn2ioKmwBZbtUT_laxlCBS-6lALTzeuzMorsqlUBRXBIbEfS-L7bFkq7lPbqxuv9GxLR3d-mCpNfrf5FyQ=="
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Reju partners with Cibutex to create circular textile system for sustainability.[CHARACTER COUNT: 88]",
            "id": "b0444e82-09a0-413f-8fdf-28275a583064",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "In Paris on February 4, 2025, Reju™, a forward-thinking company specializing in textile-to-textile regeneration, joined hands with Cibutex, a cooperative of businesses working towards a greener textile supply chain. The partnership agreement between the two firms aims to enhance sustainability in the textile industry through innovative solutions and collaboration initiatives. The partnership is set to combine Reju's expertise in regeneration with Cibutex's commitment to sustainability, catalyzing positive change in the sector.",
            "tickers": [
                "NDXP",
                "PGR"
            ],
            "time": "15:09:04",
            "timestamp": "2025-02-04T15:09:04Z",
            "url": "https://www.prnewswire.com/news-releases/reju-partners-with-cibutex-to-establish-a-circular-textile-ecosystem-302367636.html"
        },
        {
            "beta_headline": null,
            "category": "commodities",
            "date": "2025-02-04",
            "headline": "Radico Khaitan's Rampur Barrel Blush Indian Single Malt Whisky launched in the US, expanding its presence nationwide. ",
            "id": "b33d9305-e947-45a6-a51b-b746befdb5f4",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "On February 4, 2025, Radico Khaitan Limited (NSE: RADC), a prominent Indian Made Foreign Liquor (IMFL) producer operating as the parent company of Rampur Distillery, unveiled the introduction of Rampur Barrel Blush Indian Single Malt Whisky in the United States market. This launch marks a significant step for the company as it expands its offerings globally.",
            "tickers": [
                "NDXP"
            ],
            "time": "15:09:02",
            "timestamp": "2025-02-04T15:09:02Z",
            "url": "https://www.prnewswire.com/news-releases/radico-khaitan-expands-united-states-presence-with-nationwide-distribution-of-rampur-barrel-blush-indian-single-malt-whisky-302367635.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Phoenix-based Drive Health launches AI nurse with Google Public Sector to democratize healthcare access and address a shortage of healthcare professionals.",
            "id": "728fde37-59cc-4477-bbac-d9d17b8ceecf",
            "is_major": true,
            "source": "Business Wire",
            "source_type": "news",
            "summary": "Phoenix-based startup Drive Health has unveiled its groundbreaking AI nurse in partnership with Google Public Sector, signaling a major advancement in democratizing healthcare access and tackling the shortage of healthcare professionals across the country. The company aims to enhance patient outcomes by leveraging AI technology. The collaboration highlights the pressing demand for scalable healthcare solutions as the industry faces a critical juncture.",
            "tickers": [
                "NDXP"
            ],
            "time": "15:07:42",
            "timestamp": "2025-02-04T15:07:42Z",
            "url": "http://www.businesswire.com/news/home/20250204019781/en/Drive-Health-Introduces-Nurse-Avery-an-AI-Health-Assistant-Powered-by-Google/?feedref=JjAwJuNHiystnCoBq_hl-Q-tiwWZwkcswR1UZtV7eGe24xL9TZOyQUMS3J72mJlQ7fxFuNFTHSunhvli30RlBNXya2izy9YOgHlBiZQk2LOzmn6JePCpHPCiYGaEx4DL1Rq8pNwkf3AarimpDzQGuQ=="
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "CNH Industrial Q4: Revenue of $4.876B, EPS $0.15 (down from $0.39). Industrial Activities net sales down 31% to $4.129B. EBIT contracted by 630 bps YoY.",
            "id": "0f8d721d-2ce6-4ee0-a4c9-b9f0fbd90ae1",
            "is_major": true,
            "source": "Benzinga",
            "source_type": "news",
            "summary": "Shares of CNH Industrial NV (NYSE:CNH) have risen following the release of their fourth-quarter results. The company reported a 28.2% year-over-year decrease in quarterly revenue, amounting to $4.876 billion, surpassing the estimated $4.513 billion. Adjusted earnings per share (EPS) declined to $0.15 from $0.39 a year ago, falling short of the projected $0.18. Net sales for Industrial Activities dropped by 31% year over year to $4.129 billion due to lower industry demand and dealer inventory reductions. The gross profit margin for Industrial Activities also decreased by 230 basis points to 19.5%, while the Adjusted EBIT margin contracted 630 bps YoY to 4.7%, resulting in a 71% decrease in Adjusted EBIT to $194 million. Operating activities yielded $1.692 billion in cash flow for the quarter, compared to $1.515 billion the previous year, with free cash flow for Industrial Activities amounting to $848 million. In the Agriculture Segment, net sales saw a 31% decline year over year, totaling $3.4 billion.",
            "tickers": [
                "CNH"
            ],
            "time": "15:07:19",
            "timestamp": "2025-02-04T15:07:19Z",
            "url": "https://www.benzinga.com/25/02/43465388/cnh-industrial-shares-drop-after-mixed-q4-earnings-and-weaker-2025-outlook-citing-prolonged-market-headwinds"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Admitad enhances affiliate revenues by 30% with hybrid tracking, addressing browser tracking limitations.",
            "id": "4be7928f-0fe2-48ae-b421-3ce60d1ebf42",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "In Chicago, on February 4, 2025, the affiliate marketing industry is grappling with the impact of browser-based tracking restrictions. This issue has led to data losses, missed conversions, and decreased accuracy in attributions for networks, advertisers, and publishers. The industry is struggling with significant challenges as a result.",
            "tickers": [
                "NDXP"
            ],
            "time": "15:07:00",
            "timestamp": "2025-02-04T15:07:00Z",
            "url": "https://www.prnewswire.com/news-releases/admitads-new-approach-boosts-affiliate-revenues-by-30-via-hybrid-tracking-integration-302367631.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Cetera Wealth Partners gains Corporate Plans Retirement Strategies LLC with $250 million in AUA.",
            "id": "59de461f-a9e5-42ea-81c5-8d18e40c9e43",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "A financial advisory firm, Corporate Plans Retirement Strategies LLC, recently moved from Equity Services to join Cetera Financial Group's Wealth Hub. This transition was announced on February 4, 2025. Corporate Plans Retirement Strategies LLC is now a part of Cetera Wealth Partners, expanding the group's portfolio. This collaboration will bring new opportunities for both firms as they aim to strengthen their offerings.",
            "tickers": [
                "NDXP"
            ],
            "time": "15:06:58",
            "timestamp": "2025-02-04T15:06:58Z",
            "url": "https://www.prnewswire.com/news-releases/cetera-welcomes-team-with-250-million-in-aua-to-cetera-wealth-partners-302366876.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "McCaffrey family introduces McCaffrey Protein Bites nationwide. 3X Super Bowl Champion, Ed McCaffrey leads this venture.",
            "id": "37aa3466-c6bc-4bb1-91a5-475dcfdb83ae",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "The McCaffrey family, consisting of Ed and Lisa McCaffrey and their sons Max, Christian, Dylan, and Luke, are introducing McCaffrey Protein Bites to a wider audience across the country. This venture stems from their dedication to performance nutrition. The announcement was made in Denver on February 4, 2025. Ed McCaffrey, a 3-time Super Bowl champion and renowned NFL figure, is spearheading this initiative.",
            "tickers": [
                "NDXP"
            ],
            "time": "15:06:56",
            "timestamp": "2025-02-04T15:06:56Z",
            "url": "https://www.prnewswire.com/news-releases/mccaffrey-family-launches-mccaffrey-protein-bites-302367630.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Squarespace and Barry Keoghan collaborate in 2025 Super Bowl campaign, Keoghan's first appearance, Squarespace's 11th.",
            "id": "8e4b9f21-547b-4f07-ba50-f08265d9cb30",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "In a significant development on February 4, 2025, Squarespace announced their 11th Super Bowl campaign, which will feature Barry Keoghan making his debut appearance at the event. Squarespace, known for their design-focused approach in aiding entrepreneurs to establish their online presence, is set to make a remarkable return to the monumental game. Keoghan's participation adds a unique element to this campaign, highlighting the company's commitment to innovative marketing strategies.",
            "tickers": [
                "NDXP"
            ],
            "time": "15:06:54",
            "timestamp": "2025-02-04T15:06:54Z",
            "url": "https://www.prnewswire.com/news-releases/a-tale-as-old-as-websites-squarespace-and-barry-keoghan-celebrate-the-timeless-spirit-of-entrepreneurship-in-2025-super-bowl-campaign-302367098.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Zafrens secures USD 31 million in total funding, welcoming imec.xpand to its investor syndicate.",
            "id": "a09ce92f-2792-4db8-9119-f5f5ed338a2c",
            "is_major": true,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "In San Diego on February 4, 2025, Zafrens, a leading biotech firm revolutionizing drug development, announced the addition of imec.xpand to its Series A funding group, boosting the total amount raised to $31 million. imec.xpand joins previous investors Prime Movers Lab and Kofa Healthcare.",
            "tickers": [
                "SAN",
                "NDXP"
            ],
            "time": "15:06:52",
            "timestamp": "2025-02-04T15:06:52Z",
            "url": "https://www.prnewswire.com/news-releases/zafrens-expands-investor-syndicate-to-scale-revolutionary-drug-discovery-platform-302367633.html"
        },
        {
            "beta_headline": null,
            "category": "commodities",
            "date": "2025-02-04",
            "headline": "Lennar opens first community in Eugene, Oregon - Meadowview, offers competitively priced single-family homes with outdoor recreation.",
            "id": "f0298468-a71a-4bf1-8334-45d75823697e",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "Lennar, a top homebuilder in the country, recently introduced its first community in Eugene, Oregon named Meadowview on February 4, 2025. This development offers modern single-family homes at competitive prices, set amidst open spaces and ample outdoor activities. Located in Eugene, the neighborhood provides a welcoming environment for potential homebuyers looking for a new home in the area.",
            "tickers": [
                "LEN",
                "NDXP"
            ],
            "time": "15:06:50",
            "timestamp": "2025-02-04T15:06:50Z",
            "url": "https://www.prnewswire.com/news-releases/lennar-debuts-its-first-community-in-eugene-oregon-with-the-grand-opening-of-meadowview-302367580.html"
        },
        {
            "beta_headline": null,
            "category": "crypto",
            "date": "2025-02-04",
            "headline": "Ethereum price surges by 7.85% to $2,820.05 in last 24 hours, opposite its 12% loss in the past week. All-time high: $4,878.26.",
            "id": "7a1e2c99-bd5f-4854-b101-2f1c7b3f56b3",
            "is_major": false,
            "source": "Benzinga",
            "source_type": "news",
            "summary": "The price of Ethereum (CRYPTO: ETH) has surged by 7.85% in the last 24 hours, reaching $2,820.05. This marks a reversal from the previous week's trend, during which the cryptocurrency faced a 12.0% decrease from $3,175.82 to its current value. Ethereum's all-time high stands at $4,878.26. The comparison chart illustrating these fluctuations can be found on Benzinga.com.",
            "tickers": [
                "ETH"
            ],
            "time": "15:06:04",
            "timestamp": "2025-02-04T15:06:04Z",
            "url": "https://www.benzinga.com/insights/cryptocurrency/25/02/43465405/ethereum-rises-more-than-7-in-24-hours"
        },
        {
            "beta_headline": null,
            "category": "crypto",
            "date": "2025-02-04",
            "headline": "First tokenization wave missed shot, but next one can succeed, eyeing a resilient growth of numbers.",
            "id": "f7943cdc-d1f4-4877-84c9-51dd809ac4db",
            "is_major": false,
            "source": "Cointelegraph",
            "source_type": "news",
            "summary": "Yesterday, a new report was released indicating that the global economy is projected to grow by 3.5% in the coming year. This growth is attributed to various factors such as increased consumer spending, expansion of global trade, and continued investment in technology and infrastructure. However, it is important to note that this growth is not evenly distributed across all regions. Emerging markets are expected to experience a growth rate of 5.1%, while developed economies are projected to grow by 2.3%. This disparity highlights the ongoing economic challenges facing various countries and regions. Additionally, the report also predicts that the unemployment rate will decrease by 0.7% globally, with around 50 million new jobs expected to be created. This positive outlook is tempered by concerns about rising inflation rates and potential trade conflicts that could impact economic stability in the future. Overall, while there are positive indicators for global economic growth, there are also warning signs that suggest continued caution and strategic planning will be necessary in the coming year.",
            "tickers": [],
            "time": "15:05:01",
            "timestamp": "2025-02-04T15:05:01Z",
            "url": "https://cointelegraph.com/news/the-first-wave-of-tokenization-was-a-missed-opportunity?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Eugene Levy promotes Little Caesars' new Bacon & Cheese Crazy Puffs in Super Bowl ad, causing a stir.",
            "id": "b14bbc2e-68f3-459a-9983-0644d65b3416",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "Little Caesars, the NFL's Official Pizza Sponsor and the third largest pizza chain globally, debuted an innovative commercial during Super Bowl LIX in Detroit on February 4, 2025. The ad spotlights their newest product, Bacon & Cheese Crazy Puffs, which quickly became a sensation. The commercial, featuring various celebrities, captured widespread attention and raised many eyebrows.",
            "tickers": [
                "NDXP"
            ],
            "time": "15:04:48",
            "timestamp": "2025-02-04T15:04:48Z",
            "url": "https://www.prnewswire.com/news-releases/emmy-winner-eugene-levy-raises-eyebrows-in-little-caesars-super-bowl-lix-ad-302367466.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Digital Product Passport Market to reach $1,780.5 million by 2030 with a CAGR of 45.7% from $185.9 million in 2024.",
            "id": "ee56c68f-7727-4246-9e6d-6ad62d7baff2",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "A recent report by MarketsandMarkets™ predicts substantial growth in the Digital Product Passport Market, with the market size projected to increase from USD 185.9 million in 2024 to USD 1,780.5 million by the year 2030. This growth represents a noteworthy compound annual growth rate (CAGR) of 45.7% over the forecast period. For more information, interested parties can browse the full report for further insights.",
            "tickers": [
                "NDXP"
            ],
            "time": "15:04:46",
            "timestamp": "2025-02-04T15:04:46Z",
            "url": "https://www.prnewswire.com/news-releases/digital-product-passport-market-worth-1-780-5-million-by-2030--exclusive-report-by-marketsandmarkets-302367089.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Outsourced bookkeeping services popular in Texas for efficiency, market projected to reach USD 46.1 billion in 2024.",
            "id": "ed506033-6ae8-44ef-80e8-efcbed9279cd",
            "is_major": true,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "In Miami on February 4, 2025, it was reported that the need for outsourced bookkeeping services is increasing in Texas, with businesses looking to external financial professionals to enhance operational efficiency and ensure compliance. The global market for bookkeeping services is expected to increase from $46.1 billion in 2024.",
            "tickers": [
                "IBN",
                "NDXP"
            ],
            "time": "15:04:43",
            "timestamp": "2025-02-04T15:04:43Z",
            "url": "https://www.prnewswire.com/news-releases/ibn-technologies-outsourced-bookkeeping-services-becoming-a-key-strategy-for-texas-businesses-efficiency-302367474.html"
        },
        {
            "beta_headline": null,
            "category": "commodities",
            "date": "2025-02-04",
            "headline": "Gold Coast Health Plan is a top performer in health care quality, connecting more Medi-Cal members with screenings and immunizations in 2023.",
            "id": "cd29a8d8-e61e-4ba6-a3a6-760a3f286881",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "In Camarillo, California, on February 4, 2025, Gold Coast Health Plan (GCHP) in Ventura County demonstrated outstanding performance in various care metrics for its Medi-Cal plan members. In 2023, GCHP successfully facilitated increased access to crucial health screenings and immunizations for Medi-Cal beneficiaries, exceeding industry health standards. The achievement highlights the plan's commitment to providing quality healthcare to its members and signifies a significant impact on improving the well-being of the local community.",
            "tickers": [
                "NDXP"
            ],
            "time": "15:04:41",
            "timestamp": "2025-02-04T15:04:41Z",
            "url": "https://www.prnewswire.com/news-releases/gold-coast-health-plan-among-states-top-performers-for-outstanding-health-care-quality-302367495.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Credit Unions in Elgin, IL reaffirm their relevance in 2025 amidst fintech advances, with confidence in their future.",
            "id": "8ef7c6ca-99cd-4b21-a3c4-94877795ba6f",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "In Elgin, Illinois, as of February 4, 2025, traditional financial institutions such as credit unions are proving their ability to stay relevant in the rapidly evolving landscape of finance alongside fintech, digital wallets, and artificial intelligence. Despite the advancements in technology, credit unions are demonstrating resilience and adaptability, with their continued relevance and importance in the industry underscored by their ability to keep pace with emerging trends. This showcases their enduring strength and ability to serve their members effectively in the modern era.",
            "tickers": [
                "NDXP"
            ],
            "time": "15:04:39",
            "timestamp": "2025-02-04T15:04:39Z",
            "url": "https://www.prnewswire.com/news-releases/cafcu-credit-unions-are-here-to-stay-817299915.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "RegTech market expected to hit $83.8 billion by 2033, growing at 21.6% CAGR, driven by GDPR concerns & opportunities.",
            "id": "32b6f154-233e-47b2-ba60-934ddd1d730d",
            "is_major": false,
            "source": "Benzinga",
            "source_type": "news",
            "summary": "The news article discusses a report by Allied Market Research on the RegTech market, which was valued at $11.7 billion in 2023 and is projected to reach $83.8 billion by 2033, growing at a CAGR of 21.6% from 2024 to 2033. The report highlights the increasing General Data Protection Regulation (GDPR) concerns as a significant opportunity for market growth, but also notes challenges such as varied regulations across jurisdictions and privacy/security concerns. The report covers components, deployment modes, enterprise sizes, applications, and end-users in the RegTech market.",
            "tickers": [
                "NDXP"
            ],
            "time": "15:04:28",
            "timestamp": "2025-02-04T15:04:28Z",
            "url": "https://www.benzinga.com/pressreleases/25/02/g43465185/regtech-market-to-reach-83-8-billion-globally-by-2033-at-21-6-cagr-allied-market-research"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "NAVR supports Veterans' ACCESS Act to strengthen healthcare choice, hold VA accountable for implementing MISSION Act.",
            "id": "72147d18-6148-44e8-952d-a7783aba0d86",
            "is_major": false,
            "source": "Business Wire",
            "source_type": "news",
            "summary": "A bill aimed at improving Veteran choice and ensuring accountability within the U.S. Department of Veterans Affairs (VA) has been introduced by Senate Committee on Veterans’ Affairs Chairman Jerry Moran and House Committee on Veterans Affairs Chairman Mike Bost. The Veterans’ ACCESS Act is lauded by the National Association for Veteran Rights (NAVR) as pivotal in advancing these objectives. This bill seeks to bolster the implementation of the VA MISSION Act of 2018, signed by President Trump, which aims to enhance Veterans' healthcare options through reforms. This legislative effort is crucial in providing essential support to Veterans, with numbers standing at over 20 million Veterans in the U.S. who rely on VA services for their healthcare needs.",
            "tickers": [
                "NDXP"
            ],
            "time": "15:04:01",
            "timestamp": "2025-02-04T15:04:01Z",
            "url": "http://www.businesswire.com/news/home/20250204488951/en/NAVR-Applauds-Congressional-Action-to-Uphold-and-Protect-Veteran-Healthcare-Choice-with-the-Veterans%E2%80%99-ACCESS-Act/?feedref=JjAwJuNHiystnCoBq_hl-d9cWptq3LFKqvWRRM6VXqVcgiwDl5F89IquLVWUqfRVgLxDkSKfgoruKb9yWl5as-PbWreMWuYBefATrZ0EPTXUYDHrCfzvcc7PfEC8QrAfBSvR87oUDgbHejiywQBpbg=="
        },
        {
            "beta_headline": null,
            "category": "investing",
            "date": "2025-02-04",
            "headline": "Trump Trade Adviser Navarro: We are transferring $1 trillion of us assets abroad every year due to trade deficit.",
            "id": "47799830-08ea-44e2-bea1-d87b6caf06ab",
            "is_major": true,
            "source": "Tradex",
            "source_type": "news",
            "summary": null,
            "tickers": [],
            "time": "15:03:53",
            "timestamp": "2025-02-04T15:03:53Z",
            "url": null
        },
        {
            "beta_headline": null,
            "category": "investing",
            "date": "2025-02-04",
            "headline": "Trump Trade Adviser Navarro: Europe is sticking it to the US with their VAT tax, won't buy American cars.",
            "id": "448891bf-822e-401a-aa2a-8dba6a14441e",
            "is_major": false,
            "source": "Tradex",
            "source_type": "news",
            "summary": null,
            "tickers": [],
            "time": "15:03:53",
            "timestamp": "2025-02-04T15:03:53Z",
            "url": null
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Govplace acquired by Digital Capital Partners, enhancing federal IT support. DigiCap's first investment in sector. CEO Simone Feldman stays.",
            "id": "c44990a1-8ba4-4c12-b161-9cda91002961",
            "is_major": true,
            "source": "Business Wire",
            "source_type": "news",
            "summary": "Govplace, a prominent provider of secure IT solutions for federal agencies, has been purchased by Digital Capital Partners (DigiCap), a private equity firm helmed by technology entrepreneur Jay Sunny Bajaj. This acquisition marks DigiCap's initial foray into the federal sector and sets the stage for Govplace's enhanced expansion in the federal IT domain. The leadership team at Govplace, headed by CEO Simone Feldman, will continue to steer the company, guaranteeing operational stability.",
            "tickers": [
                "NDXP"
            ],
            "time": "15:03:36",
            "timestamp": "2025-02-04T15:03:36Z",
            "url": "http://www.businesswire.com/news/home/20250204915096/en/Govplace-Acquired-by-Digital-Capital-Partners-Strengthening-Support-for-Federal-IT-Modernization-and-Cybersecurity/?feedref=JjAwJuNHiystnCoBq_hl-Q-tiwWZwkcswR1UZtV7eGe24xL9TZOyQUMS3J72mJlQ7fxFuNFTHSunhvli30RlBNXya2izy9YOgHlBiZQk2LOzmn6JePCpHPCiYGaEx4DL1Rq8pNwkf3AarimpDzQGuQ=="
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "LicenseFortress wins 2025 Best of IT Services Award for service excellence in LA with a NPS score 70% higher than industry.",
            "id": "73ac8370-921c-401b-94cc-c6f7ff3ffc8a",
            "is_major": false,
            "source": "Business Wire",
            "source_type": "news",
            "summary": "In Los Angeles, LicenseFortress, a top software asset management (SAM) solution provider, has been honored with the Best of IT Services Award for exceptional client service. The award, given by ClearlyRated, recognizes companies with outstanding service quality as rated by their clients. Winners in 2025 demonstrated a Net Promoter®️ Score over 70% higher than the industry average. LicenseFortress was commended for surpassing this benchmark, showcasing their commitment to excellence in the IT services sector.",
            "tickers": [
                "NDXP"
            ],
            "time": "15:03:27",
            "timestamp": "2025-02-04T15:03:27Z",
            "url": "http://www.businesswire.com/news/home/20250204846354/en/LicenseFortress-Wins-ClearlyRated%E2%80%99s-2025-Best-of-IT-Services-Award-for-Service-Excellence/?feedref=JjAwJuNHiystnCoBq_hl-Q-tiwWZwkcswR1UZtV7eGe24xL9TZOyQUMS3J72mJlQ7fxFuNFTHSunhvli30RlBNXya2izy9YOgHlBiZQk2LOzmn6JePCpHPCiYGaEx4DL1Rq8pNwkf3AarimpDzQGuQ=="
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Gigamon VP Worldwide Channel Sales named to 2025 CRN® Channel Chiefs list. Dee Dee Acquista recognized.",
            "id": "96d6385d-f838-4334-8fd0-0655be42972b",
            "is_major": false,
            "source": "Business Wire",
            "source_type": "news",
            "summary": "A prominent company in Santa Clara, California, Gigamon, revealed that Dee Dee Acquista, who holds the position of Vice President of Worldwide Channel Sales, has been recognized on the 2025 CRN® Channel Chiefs list. This accolade signifies Acquista's exceptional leadership in the industry.",
            "tickers": [
                "NDXP"
            ],
            "time": "15:03:26",
            "timestamp": "2025-02-04T15:03:26Z",
            "url": "http://www.businesswire.com/news/home/20250204573462/en/Gigamon-Vice-President-of-Worldwide-Channel-Sales-Dee-Dee-Acquista-Recognized-as-2025-CRN%C2%AE-Channel-Chief/?feedref=JjAwJuNHiystnCoBq_hl-Q-tiwWZwkcswR1UZtV7eGe24xL9TZOyQUMS3J72mJlQ7fxFuNFTHSunhvli30RlBNXya2izy9YOgHlBiZQk2LOzmn6JePCpHPCiYGaEx4DL1Rq8pNwkf3AarimpDzQGuQ=="
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Taylor Grosso, Alex Matos, and Allison Young of Laserfiche named to 2025 CRN Channel Chiefs list.",
            "id": "ad266816-9603-4f32-a451-5494898bec8b",
            "is_major": false,
            "source": "Business Wire",
            "source_type": "news",
            "summary": "In Long Beach, California, Laserfiche, a prominent enterprise platform aiding organizations in content and workflow management, revealed that CRN®, part of The Channel Company, has honored Taylor Grosso, Senior Director of Global Channels and Alliances; Alex Matos, Associate Director for the East region; and Allison Young, Senior Director overseeing Presales and Service Delivery, on the esteemed 2025 CRN® Channel Chiefs list. This recognition highlights their contributions to the IT sector and distribution industry.",
            "tickers": [
                "NDXP"
            ],
            "time": "15:03:24",
            "timestamp": "2025-02-04T15:03:24Z",
            "url": "http://www.businesswire.com/news/home/20250204485017/en/Taylor-Grosso-Alex-Matos-and-Allison-Young-of-Laserfiche-Recognized-as-2025-CRN%C2%AE-Channel-Chiefs/?feedref=JjAwJuNHiystnCoBq_hl-Q-tiwWZwkcswR1UZtV7eGe24xL9TZOyQUMS3J72mJlQ7fxFuNFTHSunhvli30RlBNXya2izy9YOgHlBiZQk2LOzmn6JePCpHPCiYGaEx4DL1Rq8pNwkf3AarimpDzQGuQ=="
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Ncontracts had a record year with strong demand for compliance & risk solutions; leader in financial services.",
            "id": "50c7a532-be11-4f76-b5bc-1249547d2f70",
            "is_major": false,
            "source": "Business Wire",
            "source_type": "news",
            "summary": "Ncontracts, a company based in Brentwood, Tennessee, experienced significant growth momentum in the previous year as there was a surge in the need for its risk and compliance management software within the financial services sector. The company specializes in offering integrated compliance, risk, and third-party management solutions and is known for combining extensive industry knowledge with cutting-edge technology to deliver top-notch risk management and compliance tools. This success was driven by the increasing demand for their services, resulting in record growth numbers. Ncontracts prides itself on providing the most effective and comprehensive integrated risk management and compliance solutions in the industry, supported by unparalleled customer service.",
            "tickers": [
                "NDXP"
            ],
            "time": "15:03:21",
            "timestamp": "2025-02-04T15:03:21Z",
            "url": "http://www.businesswire.com/news/home/20250204099048/en/Ncontracts-Experiences-Another-Record-Year-as-Demand-for-Vendor-Compliance-Risk-Management-Solutions-Accelerates/?feedref=JjAwJuNHiystnCoBq_hl-Q-tiwWZwkcswR1UZtV7eGe24xL9TZOyQUMS3J72mJlQ7fxFuNFTHSunhvli30RlBNXya2izy9YOgHlBiZQk2LOzmn6JePCpHPCiYGaEx4DL1Rq8pNwkf3AarimpDzQGuQ=="
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "CACI (NYSE: CACI) to join Citi 2025 Global Industrial Tech and Mobility Conference on Feb. 18 at 4:20 p.m. Eastern time.",
            "id": "23b7677e-77df-4e37-8ef8-ccfe6d27a3e2",
            "is_major": false,
            "source": "Business Wire",
            "source_type": "news",
            "summary": "CACI International Inc (NYSE: CACI) from Reston, Va., revealed their involvement in the Citi 2025 Global Industrial Tech and Mobility Conference. Scheduled for Tuesday, February 18 at 4:20 p.m. Eastern time, the event will feature a fireside chat with President and CEO John Mengucci and CFO and Treasurer Jeff MacLauchlan. Following this, attendees can participate in a Q&A session. The session will be accessible through a live audio webcast on CACI's investor relations website.",
            "tickers": [
                "NDXP",
                "CACI"
            ],
            "time": "15:03:19",
            "timestamp": "2025-02-04T15:03:19Z",
            "url": "http://www.businesswire.com/news/home/20250204023742/en/CACI-to-Participate-in-Citi-2025-Global-Industrial-Tech-and-Mobility-Conference/?feedref=JjAwJuNHiystnCoBq_hl-Q-tiwWZwkcswR1UZtV7eGe24xL9TZOyQUMS3J72mJlQ7fxFuNFTHSunhvli30RlBNXya2izy9YOgHlBiZQk2LOzmn6JePCpHPCiYGaEx4DL1Rq8pNwkf3AarimpDzQGuQ=="
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Observo AI hires SVP of Marketing after $15M seed round, plans global expansion to meet enterprise demand.",
            "id": "49d8a0ed-dfc3-46a9-9760-23cf684d5d3f",
            "is_major": false,
            "source": "Business Wire",
            "source_type": "news",
            "summary": "In Fremont, California, Observo AI has named Steven Hua as the new Senior Vice President of Marketing. This move comes after the company secured $15 million in seed funding from Lightspeed Venture Partners and Felicis Ventures. Hua will be responsible for leading the global marketing strategy as Observo AI expands to meet the growing demand in the enterprise sector for their agentic AI-powered data pipelines, which enhance observability and security data autonomously.",
            "tickers": [
                "NDXP"
            ],
            "time": "15:03:17",
            "timestamp": "2025-02-04T15:03:17Z",
            "url": "http://www.businesswire.com/news/home/20250204083157/en/Observo-AI-Accelerates-Growth-with-Key-Executive-Hire-Following-Recent-15M-Seed-Round/?feedref=JjAwJuNHiystnCoBq_hl-Q-tiwWZwkcswR1UZtV7eGe24xL9TZOyQUMS3J72mJlQ7fxFuNFTHSunhvli30RlBNXya2izy9YOgHlBiZQk2LOzmn6JePCpHPCiYGaEx4DL1Rq8pNwkf3AarimpDzQGuQ=="
        },
        {
            "beta_headline": null,
            "category": "investing",
            "date": "2025-02-04",
            "headline": "Panama said to mull canceling a port deal with a Hong Kong firm.",
            "id": "954c4c80-efc1-4ec6-a0eb-fad260b487ef",
            "is_major": false,
            "source": "Tradex",
            "source_type": "news",
            "summary": null,
            "tickers": [],
            "time": "15:02:53",
            "timestamp": "2025-02-04T15:02:53Z",
            "url": null
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Particles for Humanity invited to present at Nigeria's NFA meeting in Dec 2024, showcased successful scale up of PFH-VAP.",
            "id": "99b114d5-983a-4c98-827d-d9944ddb0263",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "In February 4, 2025, at Cambridge, Massachusetts, Particles for Humanity was asked to participate in Nigeria's National Fortification Alliance (NFA) meeting held in Lagos in December 2024. During the meeting, the company provided an overview of the progress made in scaling up the production of PFH-VAP to commercial quantities.",
            "tickers": [
                "PFH",
                "NDXP"
            ],
            "time": "15:02:37",
            "timestamp": "2025-02-04T15:02:37Z",
            "url": "https://www.prnewswire.com/news-releases/particles-for-humanity-invited-to-present-to-nigerias-national-fortification-alliance-302366574.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Transtar Aftermarket Solutions to sponsor 2025 ATSG seminars, part of NexaMotion Group, transmission industry support.",
            "id": "326485bb-6556-4ac9-8ebe-c469c41fc5e5",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "Transtar Aftermarket Solutions, a division of NexaMotion Group (NMG), recently revealed plans to sponsor the Automatic Transmission Service Group (ATSG) training seminar events in 2025. ATSG, known as the top authority in the transmission industry, will benefit from this sponsorship. The events in 2025 are anticipated to be significant with a surge in attendee numbers expected, in line with previous trends. The sponsorship from Transtar Aftermarket Solutions will enhance the quality of these training seminars, providing valuable knowledge and resources to participants.",
            "tickers": [
                "NDXP"
            ],
            "time": "15:02:34",
            "timestamp": "2025-02-04T15:02:34Z",
            "url": "https://www.prnewswire.com/news-releases/transtar-aftermarket-solutions-announces-sponsorship-of-2025-atsg-seminar-events-302366658.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Oikos promotes \"Surprising Strength\" ad with Juno Temple and Myles Garrett. Features high-quality Oikos Triple Zero Greek yogurt.",
            "id": "cc451e77-34c2-415e-be2a-bdc100d7bc33",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "Oikos has launched a new advertisement campaign to promote everyday strength through their protein-rich products - Oikos Triple Zero® Greek yogurt and Oikos Pro® snack cups. The campaign is making waves on the night of the Super Bowl, highlighting the high-quality, complete protein content of their offerings. This initiative is taking place in White Plains, N.Y. and Louisville, Colo. on February 4, 2025.",
            "tickers": [
                "NDXP"
            ],
            "time": "15:02:32",
            "timestamp": "2025-02-04T15:02:32Z",
            "url": "https://www.prnewswire.com/news-releases/oikos-flexes-surprising-strength-in-its-return-to-the-big-game-with-surprising-strength-starring-television-actress-juno-temple-and-football-star-myles-garrett-302366894.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "AIIR study reveals 37% industry leaders overlook HVAC efficiency; 61% interested in smart tech.",
            "id": "6ad3f105-2482-4643-b462-95f4a18fe879",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "Recently released data indicates that the enthusiasm for smart building technology among building professionals is at 61%. Despite this, an alarming 37% overlook the inclusion of HVAC systems in their efficiency plans. This research comes from a report by AIIR, a prominent company specializing in AI-driven heating and cooling solutions. The findings were disclosed on February 4, 2025, in Austin, Texas.",
            "tickers": [
                "NDXP"
            ],
            "time": "15:02:30",
            "timestamp": "2025-02-04T15:02:30Z",
            "url": "https://www.prnewswire.com/news-releases/aiir-products-study-exposes-gaps-in-energy-plans-as-37-of-industry-leaders-overlook-hvac-efficiency-302367598.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Real estate commission rates bounce back 5 months after NAR Settlement; improved data revealed, surprising analysts.",
            "id": "b5af5b32-1e2c-4fed-8236-b4cc1cc1deb3",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "In Boston on February 4, 2025, recently released data showcases surprising advancements in real estate commission fees following the resolution of the National Association of Realtors (NAR) Settlement in August 2024. Initial assessments at the 60-day milestone indicated that there were positive changes for both buyers and sellers.",
            "tickers": [
                "NDXP"
            ],
            "time": "15:02:28",
            "timestamp": "2025-02-04T15:02:28Z",
            "url": "https://www.prnewswire.com/news-releases/5-months-after-nar-settlement-commission-rates-recover-302367576.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Black Health Matters to host 2025 Health Summit & Expo in Atlanta, addressing disease prevention in Black communities.",
            "id": "0c6a8fde-00c7-461d-8bcb-e579acaa422a",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "A summit will be held in Atlanta on February 4, 2025, to discuss the critical issue of disease prevention and management in Black communities. Black Health Matters, a prominent nonprofit health advocacy organization, is leading the event. They focus on providing vital health and wellness resources to these communities. This summit aims to address the pressing need for better healthcare among Blacks. It will bring together experts, community leaders, and stakeholders to find solutions. This initiative responds to the significant health disparities faced by Black individuals. Stay tuned for further updates on this important event.",
            "tickers": [
                "NDXP"
            ],
            "time": "15:02:26",
            "timestamp": "2025-02-04T15:02:26Z",
            "url": "https://www.prnewswire.com/news-releases/black-health-matters-to-host-2025-health-summit--expo-in-atlanta-302367475.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "FirstLight announced a data center expansion in Brunswick, ME, doubling power capacity to cater to more customers.",
            "id": "9c5e06fa-b788-4f2c-8722-f9a7d28f392a",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "A prominent digital infrastructure services provider, FirstLight, recently revealed the completion of renovations at the ex-NATO facility in Albany, New York. These renovations have resulted in a doubling of the power capacity at the facility. The company, well-known for serving enterprise and carrier clients in the Northeast and mid-Atlantic regions, made this significant announcement on February 4, 2025. The upgraded facility in Brunswick now boasts enhanced capabilities that cater to the increasing demands of its clientele. It is a strategic move to bolster the region's digital infrastructure, with this initiative reflecting a substantial investment by FirstLight.",
            "tickers": [
                "NATO",
                "NDXP"
            ],
            "time": "15:02:24",
            "timestamp": "2025-02-04T15:02:24Z",
            "url": "https://www.prnewswire.com/news-releases/brunswick-maine-data-center-expansion-results-in-additional-power-and-increased-capacity-302367621.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Spiro® partners with Brand Innovators for year-long experiential marketing initiative, driving conversations at major events.",
            "id": "408f9afa-4953-406a-813c-daeafaadf88d",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "In Las Vegas on February 4, 2025, Spiro®, a top experiential agency, revealed its exclusive partnership with Brand Innovators for the inaugural Experiential Marketing initiative. This year-long program aims to spark discussions on experiential marketing during key industry events.",
            "tickers": [
                "NDXP"
            ],
            "time": "15:02:20",
            "timestamp": "2025-02-04T15:02:20Z",
            "url": "https://www.prnewswire.com/news-releases/spiro-exclusive-partner-of-first-ever-brand-innovators-experiential-advisory-board-302367462.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Frontier Dermatology, the largest physician-owned dermatology practice in the Pacific Northwest, celebrates 25 years of service.",
            "id": "d1080003-79ec-43db-abce-1e66c8223d94",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "Frontier Dermatology, the leading dermatology practice in the Pacific Northwest, marks its 25th anniversary with a focus on modern and ethical care. Founded and run by physicians, the company looks forward to continued growth. Based in Seattle, as of February 4, 2025, Frontier Dermatology has solidified its reputation as a trusted healthcare provider in the region.",
            "tickers": [
                "NDXP"
            ],
            "time": "15:02:18",
            "timestamp": "2025-02-04T15:02:18Z",
            "url": "https://www.prnewswire.com/news-releases/frontier-dermatology-celebrates-25-years-of-excellence-in-dermatologic-care-302367588.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Denny’s offers $10 off $30 orders for limited time starting Feb 5, perfect for the Big Game fans.",
            "id": "d10c2d93-36d9-4d99-b2c9-cf13cd2c20e8",
            "is_major": false,
            "source": "GlobeNewswire",
            "source_type": "news",
            "summary": "Starting on Wednesday, February 5, Denny's is launching a special offer in anticipation of the Big Game. Get ready to take advantage of this limited-time promotion at your nearest Denny's location.",
            "tickers": [],
            "time": "15:02:17",
            "timestamp": "2025-02-04T15:02:17Z",
            "url": "https://www.globenewswire.com/news-release/2025/02/04/3020509/0/en/Denny-s-Kicks-Off-Their-Biggest-Deal-Fans-Score-10-Off-Any-30-Order-For-Limited-Time.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "FirstEnergy appoints Arsalan Azarsa as VP, Finance and Regulatory for West Virginia/Maryland & Kevin Keller as VP for Ohio. Effective Feb 10.",
            "id": "53df3094-3ae7-4f5f-b113-5fe3ecd94d78",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "In Akron, Ohio, on February 4, 2025, FirstEnergy Corp. revealed the appointment of Arsalan Azarsa as the new Vice President of Finance and Regulatory for West Virginia and Maryland, starting on February 10. Additionally, Kevin Keller has been named as the Vice President of Finance and Regulatory for Ohio. The company's stock is listed under the symbol NYSE: FE.",
            "tickers": [
                "NDXP"
            ],
            "time": "15:02:16",
            "timestamp": "2025-02-04T15:02:16Z",
            "url": "https://www.prnewswire.com/news-releases/firstenergy-names-two-to-vice-president-finance-and-regulatory-roles-for-west-virginiamaryland-and-ohio-302367520.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Milestone Scientific's CompuFlo® Epidural System expands adoption, integrated by Dr. Ilana Etelzon at Pain Doctors Medical.",
            "id": "61f7d238-5613-4c73-8928-22d9013c57c1",
            "is_major": true,
            "source": "GlobeNewswire",
            "source_type": "news",
            "summary": "After a successful clinical trial, Dr. Ilana Etelzon has decided to incorporate the CompuFlo® Epidural System into her practice. The system, known for its precise delivery of medication during epidural procedures, has received positive feedback from patients and medical professionals. Dr. Etelzon's decision highlights the growing recognition of the system's benefits, with a reported increase in patient satisfaction rates by 20% and a reduction in procedure-related complications by 15%. This integration marks a significant advancement in pain management technology, showcasing a shift towards more accurate and efficient medical practices.",
            "tickers": [],
            "time": "15:02:15",
            "timestamp": "2025-02-04T15:02:15Z",
            "url": "https://www.globenewswire.com/news-release/2025/02/04/3020499/15852/en/Milestone-Scientific-Expands-Adoption-of-CompuFlo-Epidural-System-with-Commercial-Rollout-at-Pain-Doctors-Medical-LLC.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Rocky Rosen's stop smoking program has helped 1,000+ people quit, gaining popularity in Hollywood.",
            "id": "e9374c84-ad85-4eed-bed0-9298a3c389de",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "In Hollywood, California, on February 4, 2025, Rocky Rosen, also known as \"The Cigarette Whisperer,\" is making a significant impact with his effective smoking cessation program. Once a heavy smoker consuming two packs a day, Rosen has shifted gears to become an advocate for quitting smoking. Through his evidence-based methodology, he has successfully assisted more than 1,000 individuals in overcoming their smoking habits.",
            "tickers": [
                "NDXP"
            ],
            "time": "15:02:13",
            "timestamp": "2025-02-04T15:02:13Z",
            "url": "https://www.prnewswire.com/news-releases/from-stars-to-everyday-smokers-and-vapers-rocky-rosens-revolutionary-stop-smoking-program-302366407.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "New caregiver training program \"Step into the Story\" launched by Southminster and Memory & Movement Charlotte for healthcare professionals in senior living environments in Charlotte, N.C. - PRNewswire, Feb. 4, 2025.",
            "id": "e76da3d3-f07a-4f60-a73a-4ef64f9eecea",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "In Charlotte, North Carolina, as of February 4, 2025, healthcare professionals in senior living settings can now enroll in a new training initiative named \"Step into the Story.\" This program, a collaboration between Southminster, a non-profit senior living community, and a undisclosed partner, aims to equip professionals with essential skills.",
            "tickers": [
                "NDXP"
            ],
            "time": "15:02:11",
            "timestamp": "2025-02-04T15:02:11Z",
            "url": "https://www.prnewswire.com/news-releases/southminster-and-memory--movement-charlotte-introduce-new-caregiver-training-program-302367406.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Hall County Schools in Georgia achieve 15% growth in literacy scores for students in the 2023–2024 academic year.",
            "id": "b585e0a2-ddb3-41ee-bff5-7793943b2185",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "In Oak Park, Illinois on February 4, 2025, data shows that Hall County Schools in Georgia have achieved a notable advancement in early literacy. Students in the 2023-2024 academic year have demonstrated an impressive 15% rise in MAP Growth literacy scores. This information stems from a research analysis conducted by LXD Research.",
            "tickers": [
                "NDXP"
            ],
            "time": "15:02:09",
            "timestamp": "2025-02-04T15:02:09Z",
            "url": "https://www.prnewswire.com/news-releases/hall-county-schools-achieve-15-literacy-growth-transforming-early-reading-outcomes-302367496.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Xello wins two Tech & Learning Awards of Excellence for Best of 2024 in Secondary & Primary Education.",
            "id": "5a0aa9c1-56b2-43e7-933a-420ee6e85a00",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "In the recent Tech & Learning Awards of Excellence for 2024, Xello emerged as the winner in both the Secondary Education and Primary Education divisions. This recognition marks a significant achievement for Xello, demonstrating their excellence in providing educational technology solutions. The Best of 2024 Awards, which highlight exceptional contributions in the industry, showcased Xello as a top performer in the education sector. This double win solidifies Xello's position as a leading provider in the field, with their innovative solutions impressing judges and educators alike. Congratulations to Xello for this remarkable success.",
            "tickers": [
                "NDXP"
            ],
            "time": "15:02:07",
            "timestamp": "2025-02-04T15:02:07Z",
            "url": "https://www.prnewswire.com/news-releases/double-header-win-two-tech--learning-awards-of-excellence-for-xello-302366846.html"
        },
        {
            "beta_headline": null,
            "category": "commodities",
            "date": "2025-02-04",
            "headline": "Lazer Technologies achieves top-tier Shopify Platinum Partner status, recognized for industry leadership.",
            "id": "03b44d7c-1f0d-42ff-a480-4991cd37789e",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "In February 4, 2025, Lazer Technologies proudly revealed its recognition as a Shopify Platinum Partner, denoting the highest accolade in the 2025 revision of the Shopify Partner initiative. This distinction highlights Lazer's position as a top player dedicated to assisting merchants in developing strategic approaches.",
            "tickers": [
                "SHOP",
                "NDXP"
            ],
            "time": "15:02:05",
            "timestamp": "2025-02-04T15:02:05Z",
            "url": "https://www.prnewswire.com/news-releases/lazer-technologies-earns-shopifys-top-tier-platinum-partner-status-302366684.html"
        }
    ]
}
