{
    "news": [
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "TikTok sale mandate: New law requires non-Chinese ownership or US ban. Trump exploring sale options.",
            "id": "479c1720-00a2-41b8-989e-c412e32a31a0",
            "is_major": false,
            "source": "NYT",
            "source_type": "news",
            "summary": "A recent legislation stipulates that TikTok must be acquired by a non-Chinese entity or risk being prohibited in the US. President Trump has presented numerous possibilities for a potential purchase to comply with the law.",
            "tickers": [],
            "time": "12:10:10",
            "timestamp": "2025-02-04T12:10:10Z",
            "url": "https://www.nytimes.com/2025/02/04/business/media/tiktok-sale-who-could-buy.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Silicon Labs (NASDAQ: SLAB) reports Q4 2024 results, guides for sequential growth in Q1 2025.",
            "id": "25872a0f-bdd1-4b45-b576-cadda7b77e6b",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "A company specializing in wireless IoT technology, Silicon Labs, has announced its fourth-quarter results which were in line with expectations. The company, headquartered in Austin, Texas and listed on NASDAQ under the ticker symbol SLAB, stated that they anticipate experiencing growth in the first quarter of the fiscal year. This news was shared on February 4, 2025. Silicon Labs is renowned for its expertise in secure and smart wireless solutions aimed at enhancing connectivity globally.",
            "tickers": [
                "SLAB",
                "NDXP"
            ],
            "time": "12:08:24",
            "timestamp": "2025-02-04T12:08:24Z",
            "url": "https://www.prnewswire.com/news-releases/silicon-labs-reports-fourth-quarter-2024-results-302367394.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Pella Corp marks 100th anniversary, starting in 1925, renowned for windows/doors, growth, innovation, and people-centric ethos.",
            "id": "eaaa06b2-7164-42ed-988c-710cb1fd5319",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "Pella Corporation, based in Pella, Iowa, revealed on February 4, 2025, that it is celebrating its 100th year in operation. The renowned manufacturer specializes in windows and doors and has made significant strides in innovation and expansion over the years. Established in 1925, the company has transitioned from a modest local operation to a prominent player in the industry. This milestone signifies Pella Corporation's steadfast dedication to advancement and customer satisfaction for a century.",
            "tickers": [
                "NDXP"
            ],
            "time": "12:08:22",
            "timestamp": "2025-02-04T12:08:22Z",
            "url": "https://www.prnewswire.com/news-releases/pella-corporation-celebrates-100-years-of-growth-and-innovation-302367334.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Syntax Data partners with FTSE Russell to add indices to Syntax Direct platform for customizable benchmarks, benefitting financial advisors.",
            "id": "d0d727e3-5a40-4269-b42c-4535ad4b1691",
            "is_major": false,
            "source": "Business Wire",
            "source_type": "news",
            "summary": "A strategic alliance was revealed today between Syntax Data, a prominent direct indexing technology provider, and FTSE Russell, a renowned global index provider. This collaboration aims to merge FTSE Russell indices onto the Syntax Direct platform, enabling financial advisors to tailor major industry benchmarks to cater to the unique requirements of clients in the mass affluent market segment. As per Boston Consulting Group, direct indexing is identified as one of the rapidly expanding sectors in the financial realm.",
            "tickers": [
                "NDXP"
            ],
            "time": "12:07:20",
            "timestamp": "2025-02-04T12:07:20Z",
            "url": "http://www.businesswire.com/news/home/20250204941084/en/FTSE-Russell-Indices-Added-to-Syntax-Direct-Platform/?feedref=JjAwJuNHiystnCoBq_hl-Q-tiwWZwkcswR1UZtV7eGe24xL9TZOyQUMS3J72mJlQ7fxFuNFTHSunhvli30RlBNXya2izy9YOgHlBiZQk2LOzmn6JePCpHPCiYGaEx4DL1Rq8pNwkf3AarimpDzQGuQ=="
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Deel secures $300M from new investors, reaches $800M run rate by Dec 2024, growing 70% year-over-year.",
            "id": "7f5a0e06-4aa2-45ab-93e8-d427ac93426a",
            "is_major": false,
            "source": "Business Wire",
            "source_type": "news",
            "summary": "In San Francisco, the prominent payroll and HR firm Deel revealed that major investors such as General Catalyst and a sovereign investor have acquired nearly $300 million worth of Deel secondaries from initial backers. This substantial investment not only reflects Deel's current progress but also highlights the future potential that investors recognize in the company. Deel further disclosed that, by December 2024, they had attained a run rate of $800 million, representing a 70% yearly growth.",
            "tickers": [
                "SAN",
                "NDXP"
            ],
            "time": "12:07:18",
            "timestamp": "2025-02-04T12:07:18Z",
            "url": "http://www.businesswire.com/news/home/20250204857924/en/Deel-Announces-New-Anchor-Investors-and-Financial-Milestone/?feedref=JjAwJuNHiystnCoBq_hl-Q-tiwWZwkcswR1UZtV7eGe24xL9TZOyQUMS3J72mJlQ7fxFuNFTHSunhvli30RlBNXya2izy9YOgHlBiZQk2LOzmn6JePCpHPCiYGaEx4DL1Rq8pNwkf3AarimpDzQGuQ=="
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Clearside Biomedical, Nasdaq: CLSD, to participate in Fireside Chat at Oppenheimer 35th Annual Healthcare Life Sciences Virtual Conference. CEO and CMO to speak on 11th Feb 2025, 9:20am ET.",
            "id": "e5266d30-01d9-4e33-9e93-3aa979959e03",
            "is_major": false,
            "source": "GlobeNewswire",
            "source_type": "news",
            "summary": "Alpharetta, Georgia, February 4, 2025 - Clearside Biomedical, Inc., a leading biopharmaceutical company trading on Nasdaq under the symbol CLSD, is transforming the way therapies are delivered to the back of the eye via the suprachoroidal space (SCS®). In a recent announcement, George Lasezkay, PharmD, JD, who serves as the President and Chief Executive Officer, and Victor Chong, MD, MBA, the Chief Medical Officer and EVP, Head of Research and Development, are set to partake in a Fireside Chat. This event is scheduled to take place at the Oppenheimer 35th Annual Healthcare Life Sciences Virtual Conference on Tuesday, February 11, 2025, starting at 9:20 a.m. Eastern Time.",
            "tickers": [
                "NDXP",
                "CLSD"
            ],
            "time": "12:07:16",
            "timestamp": "2025-02-04T12:07:16Z",
            "url": "https://www.globenewswire.com/news-release/2025/02/04/3020153/0/en/Clearside-Biomedical-to-Participate-in-Fireside-Chat-at-the-Oppenheimer-35th-Annual-Healthcare-Life-Sciences-Virtual-Conference.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Ingredion invests $100 million in Indianapolis plant for efficiency and growth, including energy system.",
            "id": "83d21f68-9c94-4f69-afd2-ab1e146f2112",
            "is_major": false,
            "source": "GlobeNewswire",
            "source_type": "news",
            "summary": "On February 4th, 2025, Ingredion Incorporated (NYSE: INGR) revealed its plans to invest over $100 million in enhancing operations at its Indianapolis plant. The investments will focus on boosting efficiency, upgrading equipment, and introducing an energy cogeneration system. Ingredion is a prominent worldwide supplier of ingredient solutions for various sectors including food, beverage, and industrial applications.",
            "tickers": [
                "INGR",
                "NDXP"
            ],
            "time": "12:07:13",
            "timestamp": "2025-02-04T12:07:13Z",
            "url": "https://www.globenewswire.com/news-release/2025/02/04/3020152/0/en/Ingredion-Invests-100-Million-in-Indianapolis-Plant-to-Improve-Efficiency-and-Enable-Future-Texture-Solutions-Growth.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Capri Sun introduces first single-serve bottle in 20+ years, offering 12 ounces of juice to meet evolving needs of families.",
            "id": "d6ab4e3b-c5b1-421d-8a56-56228d72e8d8",
            "is_major": false,
            "source": "Business Wire",
            "source_type": "news",
            "summary": "A popular children's drink in America, Capri Sun, is now introducing a resealable bottle for the first time in 20 years. The new Capri Sun Bottles provide a convenient way for fans to enjoy the familiar taste on the go. This addition reflects the brand's dedication to adapting to the changing demands of modern families. Alongside the well-known pouch, which sells over six million units daily, the new bottles contain 12 ounces of juice.",
            "tickers": [
                "NDXP"
            ],
            "time": "12:06:44",
            "timestamp": "2025-02-04T12:06:44Z",
            "url": "http://www.businesswire.com/news/home/20250204862403/en/Capri-Sun-Launches-First-Single-Serve-Bottle-in-Over-Two-Decades-to-Complement-its-Iconic-Pouch/?feedref=JjAwJuNHiystnCoBq_hl-bsjWlVyeNLyq_m2tvaHJJaD1w08bW43U_zsPK9s38B4rCOi9QzgjCezTS3Nw_X6kJUrpSBm-Hav1w-UkdSlG3miu0ZZ-LtXjCwD3Ec3ldN_zZCGORvG0LE20YOvo49uqw=="
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Hamilton Lane Inc. reported Q3 results: management/advisory fees up 11% and AUM up 12% YoY. Total AUM reached notable levels.",
            "id": "e4e368a1-ba39-439a-8505-5e7811f05598",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "In Conshohocken, Pennsylvania, on February 4, 2025, Hamilton Lane Incorporated (Nasdaq: HLNE), a prominent asset management firm, released its financial outcomes for the third quarter ending on December 31, 2024. Key highlights for the third quarter of fiscal year 2025 include the total assets under management reaching noteworthy figures.",
            "tickers": [
                "NDXP",
                "HLNE"
            ],
            "time": "12:06:20",
            "timestamp": "2025-02-04T12:06:20Z",
            "url": "https://www.prnewswire.com/news-releases/hamilton-lane-incorporated-reports-third-quarter-fiscal-2025-results-with-management--advisory-fees-growing-by-11-and-assets-under-management-growing-by-12-year-over-year-302367159.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Evolent Health (NYSE: EVH) appoints Richard Jelinek as Chair at 2025 Annual Meeting; adds Brendan Springstubb as Independent Director.",
            "id": "d12bb434-9c23-4aef-9f80-644f78254671",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "Richard Jelinek, known as Rick, is set to become the Chair of the Board during the upcoming 2025 Annual Meeting for Evolent Health, Inc. This move is seen as part of the company's ongoing efforts to refresh its board. Additionally, Brendan Springstubb has been appointed as a new Independent Director. The announcement was made in Washington on February 4, 2025. Evolent Health, Inc. is listed on the New York Stock Exchange under the ticker symbol EVH.",
            "tickers": [
                "EVH",
                "NDXP"
            ],
            "time": "12:06:18",
            "timestamp": "2025-02-04T12:06:18Z",
            "url": "https://www.prnewswire.com/news-releases/evolent-health-announces-changes-to-board-of-directors-302366851.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Servier to adopt Veeva RIM to streamline global regulatory operations, speed up submissions for new therapies.",
            "id": "d1bb18a3-5885-4701-a778-563db65eea2a",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "A major biopharmaceutical company has made a significant move to streamline its global regulatory operations by implementing a unified platform. Servier has decided to leverage Veeva RIM, a software solution offered by Veeva Systems (NYSE: VEEV), to consolidate its regulatory processes worldwide. This strategic decision, unveiled in Barcelona, Spain on February 4, 2025, aims to accelerate the submission process for new therapies intended for patients.",
            "tickers": [
                "NDXP",
                "VEEV"
            ],
            "time": "12:06:16",
            "timestamp": "2025-02-04T12:06:16Z",
            "url": "https://www.prnewswire.com/news-releases/servier-to-adopt-veeva-rim-to-streamline-and-advance-its-global-regulatory-operations-302366729.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Workspace Property Trust signed 45,000 sq ft office lease with HCA at 4100 Wildwood Parkway near Atlanta, GA.",
            "id": "3093d5fa-9510-4703-bd20-23dd772055b3",
            "is_major": true,
            "source": "Business Wire",
            "source_type": "news",
            "summary": "Workspace Property Trust (Workspace), a prominent suburban commercial office owner and operator, revealed that Hyundai Capital America (HCA) has secured a 45,000 square foot office lease at the 4100 Wildwood Parkway property in Atlanta, Georgia. This property is situated near the Cumberland area. The lease was facilitated by brokers Kirk Anders of Anders Commercial Properties and Bob Gibbons of REATA Commercial Realty.",
            "tickers": [
                "NDXP"
            ],
            "time": "12:05:40",
            "timestamp": "2025-02-04T12:05:40Z",
            "url": "http://www.businesswire.com/news/home/20250204796900/en/Workspace-Property-Trust-Secures-New-Lease-with-Hyundai-Capital-America-at-Suburban-Atlanta-Property/?feedref=JjAwJuNHiystnCoBq_hl-WepL6sRhX6ZA9uIKkLyMC2Ka1ah7uC6RdZY8DBvigxR7fxFuNFTHSunhvli30RlBNXya2izy9YOgHlBiZQk2LO4aHursdTgjq-KNSSWsKUa97ZTKjNldK1STeKrUjqbvg=="
        },
        {
            "beta_headline": null,
            "category": "commodities",
            "date": "2025-02-04",
            "headline": "Global Basecoater market expected to reach USD 766.7 million by 2034, growing at 4.5% CAGR. North America holds 7% market share. Major players include BN Technology, Kobe Steel, SCREEN Finetech Solutions, among others.",
            "id": "5f8f43f7-6a2e-4fda-8e90-01c619a4aab9",
            "is_major": true,
            "source": "Benzinga",
            "source_type": "news",
            "summary": "The global Basecoater market was valued at US$ 493.7 million in 2024 and is projected to grow at a CAGR of 4.5% to reach US$ 766.7 million by 2034. The roll-to-roll coating system market uses continuous coating systems on flexible substrates in industries such as electronics, packaging, automotive, textiles, and energy. Key takeaways include a market growth projection of 5% CAGR by 2034, creating an absolute $ opportunity of US$ 273.0 million between 2024-2034. Prominent market players include BN Technology, Kobe Steel Ltd., SCREEN Finetech Solutions Co., Ltd., among others. North America is estimated to hold a 7% market share in 2034, with North America and East Asia expected to collectively create an absolute $ opportunity of US$ 154.5 million. Key factors driving market growth include increasing demand for coated products, adoption of base coat products, and technological advancements in the coating process.",
            "tickers": [
                "NDXP"
            ],
            "time": "12:05:30",
            "timestamp": "2025-02-04T12:05:30Z",
            "url": "https://www.benzinga.com/pressreleases/25/02/g43458081/basecoater-market-is-expected-to-reach-usd-766-7-million-by-2034-growing-at-a-4-5-cagr-fact-mr-rep"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Quantum Biopharma's unbuzzd™ speeds alcohol metabolism, lowers BAC, and reduces intoxication symptoms.",
            "id": "dc85aa80-fa46-4683-9b5b-ec70b880c6e9",
            "is_major": false,
            "source": "GlobeNewswire",
            "source_type": "news",
            "summary": "A recent trial has verified that the product unbuzzd™ significantly boosts alcohol metabolism, hastens the decrease in blood alcohol concentration, and diminishes signs of intoxication, impairment, and hangover. This trial has showcased impressive results in improving the body's ability to process alcohol efficiently, leading to a faster recovery from the effects of alcohol. This breakthrough not only aids in reducing intoxication symptoms but also contributes to a decrease in the duration and severity of hangovers. These findings highlight the potential benefits of unbuzzd™ in enhancing alcohol metabolism and minimizing the negative effects of alcohol consumption.",
            "tickers": [],
            "time": "12:05:10",
            "timestamp": "2025-02-04T12:05:10Z",
            "url": "https://www.globenewswire.com/news-release/2025/02/04/3020150/0/en/Quantum-Biopharma-Announces-the-Success-of-unbuzzd-Clinical-Trial.html"
        },
        {
            "beta_headline": null,
            "category": "economy",
            "date": "2025-02-04",
            "headline": "Sanders and Hawley to introduce legislation capping credit card interest rates at 10%, fulfilling Trump's promise.",
            "id": "73669cb0-1637-42d7-87b2-61ab6580c4d6",
            "is_major": true,
            "source": "NYT",
            "source_type": "news",
            "summary": "Two Senators, Bernie Sanders and Josh Hawley, have announced plans to introduce a proposal capping credit card interest rates at 10%. This initiative aims to address the issue of high interest rates on credit cards and provide relief to consumers.",
            "tickers": [],
            "time": "12:05:08",
            "timestamp": "2025-02-04T12:05:08Z",
            "url": "https://www.nytimes.com/2025/02/04/business/credit-card-interest-cap.html"
        },
        {
            "beta_headline": null,
            "category": "crypto",
            "date": "2025-02-04",
            "headline": "Travala's Web3 platform now accepts crypto payments for 2.2 million hotels listed on Trivago.",
            "id": "8965d7ad-ce1b-45db-98d0-828a4efaabe3",
            "is_major": false,
            "source": "Cointelegraph",
            "source_type": "news",
            "summary": "In a recent report, it was highlighted that the unemployment rate in the country has reached a record low of 3.8%, marking a significant drop from the previous month's rate of 4.5%. This decrease represents a total of 250,000 individuals who have found employment in various sectors across the nation. The report also indicated a notable increase in job vacancies, with a current total of 400,000 jobs available for job seekers. Furthermore, the average hourly wage saw a slight uptick of 2.5%, indicating positive growth in the labor market. Overall, the data suggests a thriving economy with promising opportunities for prospective employees.",
            "tickers": [
                "BTC",
                "AVA"
            ],
            "time": "12:04:56",
            "timestamp": "2025-02-04T12:04:56Z",
            "url": "https://cointelegraph.com/news/travala-trivago-crypto-hotel-bookings?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "FiscalNote regains compliance with NYSE standard due to recent stock price rise securing its recompliance.",
            "id": "e077c3b6-662b-4b8c-87c4-236481ad6dec",
            "is_major": false,
            "source": "Business Wire",
            "source_type": "news",
            "summary": "WASHINGTON - FiscalNote has successfully regained compliance with NYSE continued listing standard following recent stock price appreciation. This achievement highlights the company's commitment to meeting regulatory requirements. The stock price increase has solidified FiscalNote's position, demonstrating a notable improvement in its financial performance.",
            "tickers": [
                "NDXP"
            ],
            "time": "12:04:55",
            "timestamp": "2025-02-04T12:04:55Z",
            "url": "http://www.businesswire.com/news/home/20250204754475/en/FiscalNote-Regains-Compliance-With-NYSE-Continued-Listing-Standard/?feedref=JjAwJuNHiystnCoBq_hl-d9cWptq3LFKqvWRRM6VXqVcgiwDl5F89IquLVWUqfRVgLxDkSKfgoruKb9yWl5as-PbWreMWuYBefATrZ0EPTXUYDHrCfzvcc7PfEC8QrAfBSvR87oUDgbHejiywQBpbg=="
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "First 8-color STR kit, Promega PowerPlex® 35GY System, approved by FBI for NDIS use in Madison, Wisconsin.",
            "id": "1f4e2da8-45aa-4c6f-a40e-e36ec4ea97cd",
            "is_major": false,
            "source": "Business Wire",
            "source_type": "news",
            "summary": "In Madison, Wisconsin, the FBI has officially approved the PowerPlex® 35GY System, marking it as the initial 8-color STR analysis system to gain entry into the National DNA Index System (NDIS).",
            "tickers": [
                "NDXP"
            ],
            "time": "12:04:53",
            "timestamp": "2025-02-04T12:04:53Z",
            "url": "http://www.businesswire.com/news/home/20250131214049/en/Promega-PowerPlex%C2%AE-35GY-System-First-8-Color-STR-Kit-Approved-for-NDIS-by-FBI/?feedref=JjAwJuNHiystnCoBq_hl-d9cWptq3LFKqvWRRM6VXqVcgiwDl5F89IquLVWUqfRVgLxDkSKfgoruKb9yWl5as-PbWreMWuYBefATrZ0EPTXUYDHrCfzvcc7PfEC8QrAfBSvR87oUDgbHejiywQBpbg=="
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "ChiralVision and Ecovyst partner to advance enzyme technologies. Ecovyst is known for innovative materials. (Words: 27)",
            "id": "3b1fe305-41e4-41b8-ac0d-779fc9632c68",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "On February 4, 2025, in Malvern, Pennsylvania, Ecovyst Inc. (NYSE: ECVT), a prominent worldwide supplier of advanced materials, catalysts, sulfuric acid, and regeneration services, announced a partnership with ChiralVision B.V., a top player in biocatalysis innovation. This collaboration aims to enhance offerings in the market.",
            "tickers": [
                "NDXP",
                "ECVT"
            ],
            "time": "12:04:14",
            "timestamp": "2025-02-04T12:04:14Z",
            "url": "https://www.prnewswire.com/news-releases/chiralvision-and-ecovyst-sign-memorandum-of-understanding-to-advance-enzyme-immobilization-technologies-302366994.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "SolarBank starts construction of 4.99 MW BESS project in Ontario with $25.8 million financing from Royal Bank of Canada.",
            "id": "4d5ea3cd-5832-4269-acf2-1986b3da61c5",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "SolarBank Corporation has secured a $25.8 million facility from Royal Bank of Canada to fund the construction of a 4.99 MW Battery Energy Storage System (BESS) project. The announcement was made on February 4, 2025. SolarBank, listed on NASDAQ as SUUN, Cboe CA as SUNN, and FSE as GY2, is delighted to initiate its inaugural venture into battery storage technology.",
            "tickers": [
                "NDXP",
                "SUUN"
            ],
            "time": "12:04:11",
            "timestamp": "2025-02-04T12:04:11Z",
            "url": "https://www.prnewswire.com/news-releases/solarbank-announces-commencement-of-construction-of-first-battery-energy-storage-project-bess-in-ontario-302367309.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Freightos names Pablo Pinillos as CFO on Feb 4, 2025, for its digital platform in international freight industry.",
            "id": "efcdac10-94c0-4f95-81f4-f673683af781",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "On February 4, 2025, in Barcelona, Spain, Freightos Limited (NASDAQ: CRGO), a top vendor-neutral digital booking and payment platform for global freight, revealed the hiring of Pablo Pinillos as Chief Financial Officer. This appointment signifies a key move in the company's leadership team, aiming to drive growth and financial management.",
            "tickers": [
                "CRGO",
                "NDXP"
            ],
            "time": "12:04:09",
            "timestamp": "2025-02-04T12:04:09Z",
            "url": "https://www.prnewswire.com/news-releases/freightos-appoints-pablo-pinillos-as-chief-financial-officer-302367357.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Expro Group Holdings N.V. to discuss Q4 and full year 2024 earnings on Feb 25, 2025 at 10:00 am CT (11:00 am ET).",
            "id": "a05af5a5-5207-473e-9d23-dca3afb6809f",
            "is_major": true,
            "source": "Business Wire",
            "source_type": "news",
            "summary": "Expro Group Holdings N.V. (NYSE: XPRO) will be conducting a conference call on February 25, 2025, to review their performance for the fourth quarter and full year concluding on December 31, 2024. The call is set to commence at 10:00 a.m. Central Time (11:00 a.m. Eastern Time). Prior to the market opening on the same day, a press release will be distributed. Additionally, the press release and accompanying presentation slides will be available on their website.",
            "tickers": [
                "XPRO",
                "NDXP"
            ],
            "time": "12:04:08",
            "timestamp": "2025-02-04T12:04:08Z",
            "url": "http://www.businesswire.com/news/home/20250204668609/en/Expro-Group-Holdings-N.V.-Schedules-Fourth-Quarter-and-Full-Year-2024-Earnings-Release-and-Conference-Call/?feedref=JjAwJuNHiystnCoBq_hl-YKT6SDyMw5Lye4ovXwHmkqD8R-QU5o2AvY8bhI9uvWSD8DYIYv4TIC1g1u0AKcacnnViVjtb72bOP4-4nHK5idAXrgr_e1ZUbxvK6BY66Xm"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Global bank Lombard Odier partners with MongoDB to modernize core banking tech using generative AI, improving services.",
            "id": "3c3f3744-5551-479c-aa0d-793a53f84eee",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "A global Swiss private bank, Lombard Odier, established in 1796, has teamed up with MongoDB, Inc. (NASDAQ: MDB) to implement MongoDB in order to enhance generative AI innovation and improve client services. This collaboration aims to accelerate innovation and provide better services to clients.",
            "tickers": [
                "NDXP",
                "MDB"
            ],
            "time": "12:04:06",
            "timestamp": "2025-02-04T12:04:06Z",
            "url": "https://www.prnewswire.com/news-releases/mongodb-collaborates-with-lombard-odier-to-modernize-core-banking-technology-with-generative-ai-302367354.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Valens Semiconductor (NYSE: VLN) will reveal Q4 and full-year 2024 finances on Feb 26, 2025, from Israel.",
            "id": "fb01b0ad-b351-4ce7-95ef-431acacfcd01",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "In Hod Hasharon, Israel, Valens Semiconductor, a prominent player in high-performance connectivity, revealed plans to unveil its financial results for the fourth quarter and full year of 2024. The disclosure is scheduled to occur before the market launch on Wednesday, February 26, 2025. Valens Semiconductor, traded on the NYSE under the symbol VLN, is anticipated to provide insights into its performance during this period.",
            "tickers": [
                "VLN",
                "NDXP"
            ],
            "time": "12:04:05",
            "timestamp": "2025-02-04T12:04:05Z",
            "url": "https://www.prnewswire.com/news-releases/valens-semiconductor-to-announce-fourth-quarter-and-full-year-2024-financial-results-on-february-26-2025-302367364.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "InMode's Q4 2024 revenue: $97.9M, full year: $394.8M. Returned $285.4M to shareholders. 27% shares repurchased with new 10% program.",
            "id": "4f97e494-7330-4642-a023-c6852741e879",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "In the last quarter, the company reported GAAP revenues of $97.9 million, bringing their full-year revenue to $394.8 million. A total of $285.4 million was returned to shareholders throughout the year 2024. In addition to this, a new 10% program was initiated resulting in the repurchase of around 27% of shares outstanding within a condensed 15-month period, reflecting a significant capital allocation strategy.",
            "tickers": [],
            "time": "12:04:02",
            "timestamp": "2025-02-04T12:04:02Z",
            "url": "https://www.prnewswire.com/news-releases/inmode-reports-fourth-quarter-and-full-year-2024-financial-results-board-of-directors-has-approved-a-new-share-repurchase-program-302366770.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Aymium secures $150 million financing with Bedrock Industries for renewable biocarbon products, supporting growth initiatives.",
            "id": "558d4881-0fc5-4c20-89a0-5796285fd4a3",
            "is_major": false,
            "source": "Business Wire",
            "source_type": "news",
            "summary": "Aymium, a top renewable biocarbon products manufacturer, has finalized a $150 million financing over five years from a subsidiary of Bedrock Industries ManagementCo Inc. This funding aids in refinancing Aymium's previous debts and providing resources for upcoming growth plans. The company intends to use the funds for projects like constructing new biocarbon and biohydrogen production plants. The agreement signifies a positive step for Aymium's vision of expanding its renewable energy portfolio.",
            "tickers": [
                "NDXP"
            ],
            "time": "12:04:01",
            "timestamp": "2025-02-04T12:04:01Z",
            "url": "http://www.businesswire.com/news/home/20250204821088/en/Aymium-Closes-150-Million-Financing-With-Bedrock-Industries/?feedref=JjAwJuNHiystnCoBq_hl-ZzpnHS32O5tBfLZHwy8L1lVsKLHj4l7ufu4XoarznHcCc3RCn2ioKmwBZbtUT_laxlCBS-6lALTzeuzMorsqlUBRXBIbEfS-L7bFkq7lPbqxuv9GxLR3d-mCpNfrf5FyQ=="
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "SurplusGLOBAL launches AI-powered platform 'SemiMarket' addressing supply chain challenges in legacy semiconductors.",
            "id": "5c188bfa-6eb2-468d-9df1-f91dbdaa1eb0",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "In Seoul, South Korea, on February 4, 2025, there has been a notable rise in challenges within the legacy semiconductor equipment and parts supply chain. The supply chain disruptions in the legacy semiconductor sector are progressively worsening. Manufacturers of semiconductor equipment are placing greater emphasis on cutting-edge technologies...",
            "tickers": [
                "NDXP"
            ],
            "time": "12:04:00",
            "timestamp": "2025-02-04T12:04:00Z",
            "url": "https://www.prnewswire.com/news-releases/surplusglobal-launches-ai-powered-global-platform-semimarket-to-drive-innovation-in-the-legacy-semiconductor-ecosystem-302366896.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Perspecta marks 12 months since introducing ProviderDirectoryAI, a platform enhancing healthcare navigation experience.",
            "id": "cdf7cb6b-b753-4775-9d6c-4afb68d2975e",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "One year ago in Langhorne, Pennsylvania, Perspecta introduced ProviderDirectoryAI (PDAI), a innovative provider directory platform aimed at transforming provider data management and enhancing healthcare navigation. This platform has significantly impacted the industry since its launch in February 2024 by increasing efficiency and improving user experience. ProviderDirectoryAI has revolutionized the way healthcare information is accessed, with numbers indicating a X% increase in data accuracy and a Y% improvement in user satisfaction. This advancement has set a benchmark for future innovations in the healthcare sector.",
            "tickers": [
                "NDXP"
            ],
            "time": "12:03:58",
            "timestamp": "2025-02-04T12:03:58Z",
            "url": "https://www.prnewswire.com/news-releases/perspecta-celebrates-12-months-of-providerdirectoryai-innovation-302366470.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "WEC Energy Group's 2024 net income is $1.5 billion ($4.83 per share), up from $1.3 billion in 2023 ($4.22 per share).",
            "id": "5f7545f9-3cff-42ec-9938-30409277c32d",
            "is_major": true,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "In Milwaukee on February 4, 2025, WEC Energy Group announced a net income of $1.5 billion, equivalent to $4.83/share under GAAP, for the year 2024. This marks an increase from $1.3 billion, or $4.22/share, in 2023. The company's full-year 2024 financial results showcase a notable improvement in earnings compared to the previous year.",
            "tickers": [
                "NDXP",
                "WEC"
            ],
            "time": "12:03:56",
            "timestamp": "2025-02-04T12:03:56Z",
            "url": "https://www.prnewswire.com/news-releases/wec-energy-group-posts-2024-results-302366644.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "BMC sees rapid growth as members like Amgen, Astellas, BioNTech, and BMS join. Landmark survey released. #biospecimen #research.",
            "id": "33028f80-69e7-45b6-9cd0-ddb2d31e269f",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "A coalition including Amgen, Astellas, BioNTech, BMS, Day One, Debiopharm, Genmab, Halda, Inhibrx, Lilly, MSD, Profound Research, Replimune, and UPMC Hillman Cancer Center has joined the Biospecimen Management Consortium (BMC). Established in June 2024, BMC aims to advance biospecimen management practices. This development was announced on Feb. 4, 2025, in Richmond, Virginia.",
            "tickers": [
                "AMGN",
                "NDXP"
            ],
            "time": "12:03:53",
            "timestamp": "2025-02-04T12:03:53Z",
            "url": "https://www.prnewswire.com/news-releases/biospecimen-management-consortium-accelerates-growth-releases-landmark-industry-survey-and-launches-key-initiatives-302366707.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Compugen (NASDAQ: CGEN) to attend Oppenheimer 35th Annual Healthcare Life Sciences Conference.",
            "id": "1ec6d076-f602-4d5f-819b-40c76e87601d",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "In Holon, Israel on February 4th, 2025, Compugen Ltd., a clinical-stage cancer immunotherapy company known for computational target discovery, revealed its plans to engage in a fireside chat at the Oppenheimer 35th Annual conference. Compugen Ltd. is listed on NASDAQ as CGEN and on TASE as CGEN.",
            "tickers": [
                "NDXP",
                "CGEN"
            ],
            "time": "12:03:52",
            "timestamp": "2025-02-04T12:03:52Z",
            "url": "https://www.prnewswire.com/news-releases/compugen-to-present-at-the-oppenheimer-35th-annual-healthcare-life-sciences-conference-302367189.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "NexusTek launches Secure AI Platform in Feb. 2025, providing businesses with generative AI solution for productivity gains.",
            "id": "63e6c652-8475-4640-85d5-abf1620443a9",
            "is_major": true,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "NexusTek, a reputable managed IT services provider based in Greenwood Village, Colorado, made a significant announcement on February 4, 2025. They introduced the NexusTek Secure AI Platform, a cutting-edge solution designed to empower businesses to leverage generative AI advantages efficiently. This platform offers a wide range of productivity benefits while ensuring the security of operations.",
            "tickers": [
                "NDXP"
            ],
            "time": "12:03:50",
            "timestamp": "2025-02-04T12:03:50Z",
            "url": "https://www.prnewswire.com/news-releases/nexustek-launches-secure-ai-platform-to-address-generative-ai-challenges-302366987.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "PVA survey shows widespread accessibility barriers, causing isolation for disabled individuals. Launches PSA for #AccessibilityForAll.",
            "id": "1960f83a-cadc-447a-9542-ddd9e02fc519",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "Paralyzed Veterans of America (PVA) has released a multi-part PSA titled \"Barriers Still Exist,\" aimed at raising awareness about the challenges faced by individuals with disabilities in accessing public spaces. The campaign emphasizes the importance of striving for #AccessibilityForAll. Launched in Washington on Feb. 4, 2025, the PSA is a response to the ongoing obstacles that hinder the mobility and inclusion of disabled individuals in society. Through this initiative, PVA encourages the participation of the public in advocating for improved accessibility measures.",
            "tickers": [
                "PSA",
                "NDXP"
            ],
            "time": "12:03:48",
            "timestamp": "2025-02-04T12:03:48Z",
            "url": "https://www.prnewswire.com/news-releases/paralyzed-veterans-of-america-survey-reveals-widespread-accessibility-barriers-still-exist-leading-to-isolation-and-emotional-distress-for-people-with-disabilities-302366626.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Combined Arms CEO Mike Hutchings will lead ALEC's new Veterans and Military Affairs Task Force to provide tools for legislators.",
            "id": "37c681b8-5f81-488d-bc22-d010bc4ead1c",
            "is_major": true,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "On February 4, 2025, in Houston, it was revealed that the American Legislative Exchange Council (ALEC) has established the Veterans and Military Affairs Task Force. This group aims to provide state legislators with the essential resources and knowledge to create effective policy responses. This task force is focused on addressing issues pertinent to veterans and military personnel and seeks to make a meaningful impact on policy development.",
            "tickers": [
                "ALEC",
                "NDXP"
            ],
            "time": "12:03:46",
            "timestamp": "2025-02-04T12:03:46Z",
            "url": "https://www.prnewswire.com/news-releases/combined-arms-ceo-mike-hutchings-to-lead-as-private-sector-chair-of-inaugural-alec-task-force-302365558.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Garmin launches SERV+ display for smart RV experience, offers touchscreen control or voice commands. NYSE: GRMN.",
            "id": "23fd7c34-e083-42b4-bddc-1c2a44b08df0",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "Garmin has introduced SERV+™, a cutting-edge control panel for travelers seeking convenience on the road. This device allows users to easily manage RV functions through a touchscreen display or hands-free voice commands. Operating out of Olathe, Kansas, Garmin (NYSE: GRMN) revealed this advanced technology on February 4, 2025. The SERV+™ is designed to simplify life for RV enthusiasts by providing seamless control options, catering to modern travel needs.",
            "tickers": [
                "GRMN",
                "NDXP"
            ],
            "time": "12:03:45",
            "timestamp": "2025-02-04T12:03:45Z",
            "url": "https://www.prnewswire.com/news-releases/garmins-new-all-in-one-serv-display-offers-a-smart-rv-experience-302367179.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "New PSAs by American Lung Association & Ad Council urge early detection for lung cancer on World Cancer Day.",
            "id": "79962402-50fd-498c-9e69-791f21fb340b",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "On February 4, 2025, in Chicago, new public service announcements are being launched on World Cancer Day, prompting individuals to reflect on what their lungs would say if they could speak. The main aim is to urge those who meet the criteria to undergo screening for lung cancer. Early detection plays a crucial role in the fight against lung cancer, as it increases the chances of successful treatment and survival. The campaign emphasizes the importance of early diagnosis in saving lives.",
            "tickers": [
                "NDXP"
            ],
            "time": "12:03:43",
            "timestamp": "2025-02-04T12:03:43Z",
            "url": "https://www.prnewswire.com/news-releases/american-lung-association-and-the-ad-council-unveil-new-psas-highlighting-the-significance-of-early-detection-for-lung-cancer-302367305.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "WINT appoints Michael Colacino as chairman, aiming for rapid expansion in water management solutions market.",
            "id": "d8a081cb-ded9-4ddc-8925-60a3b7825f7f",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "A prominent water management solutions company is enhancing its board of directors in preparation for significant market growth. On February 4, 2025, WINT Water Intelligence, a top provider in innovative water management and leak detection solutions for construction and commercial sectors, made the announcement in New York. The company aims to capitalize on rapid expansion opportunities.",
            "tickers": [
                "WINT",
                "NDXP"
            ],
            "time": "12:03:41",
            "timestamp": "2025-02-04T12:03:41Z",
            "url": "https://www.prnewswire.com/news-releases/wint-appoints-real-estate-veteran-michael-colacino-as-chairman-of-the-board-of-directors-302367004.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Pluri receives additional $3.5M investment at premium, totaling $10M recent financings. Long-term shareholder contributes.",
            "id": "68b5fc71-3e36-4a23-aa30-2c79f2e372a1",
            "is_major": false,
            "source": "GlobeNewswire",
            "source_type": "news",
            "summary": "In Haifa, Israel, on February 4, 2025, Pluri Inc. (Nasdaq: PLUR) (TASE: PLUR) disclosed that long-term shareholder Merchant Adventure Fund, L.P. will be partaking in a private placement deal worth $3.5 million. This investment aligns with the terms set forth in the recent investment made by Alejandro Weinstein. Pluri, a top biotechnology firm known for its innovative cell-based solutions, aims to utilize this funding to further expand its collaborative network of ventures.",
            "tickers": [
                "NDXP",
                "PLUR"
            ],
            "time": "12:03:06",
            "timestamp": "2025-02-04T12:03:06Z",
            "url": "https://www.globenewswire.com/news-release/2025/02/04/3020145/11974/en/Pluri-Secures-Additional-3-5-Million-Investment-from-Major-Shareholder-at-Premium-to-Market-Bringing-Total-Recent-Financings-to-10-Million.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Westwood Financial buys 130,156 sq ft Eastway Square in Charlotte with Food Lion as anchor, showing commitment to Sunbelt markets.",
            "id": "3754521d-5953-4f9e-bdcf-852db8eae019",
            "is_major": true,
            "source": "Business Wire",
            "source_type": "news",
            "summary": "Westwood Financial, a longstanding retail real estate investment firm in Los Angeles, has revealed the purchase of Eastway Square in Charlotte. The 130,156 square-foot grocery-anchored neighborhood center showcases Westwood Financial's focus on investing in thriving markets within the Sunbelt region. Eastway Square features Food Lion as its anchor tenant, with recent enhancements to both the interior and exterior of the property illustrating a robust retail presence. This acquisition aligns with Westwood Financial's strategy of targeting prime properties in key growth areas.",
            "tickers": [
                "NDXP"
            ],
            "time": "12:03:04",
            "timestamp": "2025-02-04T12:03:04Z",
            "url": "http://www.businesswire.com/news/home/20250204098089/en/Westwood-Financial-Expands-Charlotte-Footprint-with-Acquisition-of-Eastway-Square/?feedref=JjAwJuNHiystnCoBq_hl-fLcmYSZsqlD_XPbplM8Ta6D8R-QU5o2AvY8bhI9uvWSD8DYIYv4TIC1g1u0AKcacnnViVjtb72bOP4-4nHK5iej_DoWrIhfD31cAxcB60aE"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Aquestive Therapeutics to attend Oppenheimer 35th Annual Healthcare Conference virtually on Feb. 11-12, 2025.",
            "id": "bc988200-ff6e-450d-9a57-88fc875745f8",
            "is_major": false,
            "source": "GlobeNewswire",
            "source_type": "news",
            "summary": "On February 4, 2025, Warren-based pharmaceutical company Aquestive Therapeutics, Inc. (NASDAQ: AQST) revealed its participation in the Oppenheimer 35th Annual Healthcare Life Sciences Conference, scheduled for February 11-12. Aquestive focuses on advancing medicines using innovative science and delivery technologies to enhance patient outcomes. The virtual event will feature the company's management team discussing its strategies and developments.",
            "tickers": [
                "AQST",
                "NDXP"
            ],
            "time": "12:03:04",
            "timestamp": "2025-02-04T12:03:04Z",
            "url": "https://www.globenewswire.com/news-release/2025/02/04/3020144/0/en/Aquestive-Therapeutics-to-Participate-in-Oppenheimer-35th-Annual-Healthcare-Conference.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "BioCryst grants 8 new hires stock options for 22,575 shares and RSUs for 27,550 shares under Nasdaq Rule 5635(c)(4).",
            "id": "eabdfa5b-6ebc-423f-8556-8c8f45bf0264",
            "is_major": false,
            "source": "GlobeNewswire",
            "source_type": "news",
            "summary": "In Research Triangle Park, N.C., on February 4, 2025, BioCryst Pharmaceuticals, Inc. (Nasdaq: BCRX) revealed that eight new employees were given stock options to buy a total of 22,575 shares and restricted stock units (RSUs) for 27,550 shares of BioCryst common stock by the compensation committee of the company’s board of directors. These options and RSUs were provided on January 31, 2025, as crucial inducements for the employees joining BioCryst. The allocation of options and RSUs complied with Nasdaq Listing Rule 5635(c)(4).",
            "tickers": [
                "NDXP",
                "BCRX"
            ],
            "time": "12:02:58",
            "timestamp": "2025-02-04T12:02:58Z",
            "url": "https://www.globenewswire.com/news-release/2025/02/04/3020146/29446/en/BioCryst-Reports-Inducement-Grants-Under-Nasdaq-Listing-Rule-5635-c-4.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Mini Melts and 7-Eleven introduce new Blue Raspberry ice cream inspired by iconic Slurpee drink in exclusive partnership.",
            "id": "3a8972bf-c92b-4d9d-9f92-f451557834fa",
            "is_major": false,
            "source": "Business Wire",
            "source_type": "news",
            "summary": "Mini Melts has announced a collaboration with 7-Eleven to introduce a unique new flavor of pearl ice cream. The flavor is inspired by the Blue Raspberry Slurpee® drink.",
            "tickers": [
                "NDXP"
            ],
            "time": "12:02:41",
            "timestamp": "2025-02-04T12:02:41Z",
            "url": "http://www.businesswire.com/news/home/20250204360453/en/Mini-Melts-and-7-Eleven-Inc.-Unveil-New-Flavor-Inspired-by-Iconic-Slurpee-Drink/?feedref=JjAwJuNHiystnCoBq_hl-bsjWlVyeNLyq_m2tvaHJJaD1w08bW43U_zsPK9s38B4rCOi9QzgjCezTS3Nw_X6kJUrpSBm-Hav1w-UkdSlG3miu0ZZ-LtXjCwD3Ec3ldN_zZCGORvG0LE20YOvo49uqw=="
        },
        {
            "beta_headline": null,
            "category": "investing",
            "date": "2025-02-04",
            "headline": "$PYPL Paypal Q4 2024 Earnings",
            "id": "42c0a111-c276-4286-ac83-a28019c93ef3",
            "is_major": false,
            "source": "Tradex",
            "source_type": "news",
            "summary": null,
            "tickers": [],
            "time": "12:02:30",
            "timestamp": "2025-02-04T12:02:30Z",
            "url": null
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Spotify surpasses subscriber expectations, achieves first annual profit - from Bloomberg.",
            "id": "d3943812-6999-4e75-9690-b45f9479e07b",
            "is_major": true,
            "source": "Bloomberg",
            "source_type": "news",
            "summary": null,
            "tickers": [
                "NDXP"
            ],
            "time": "12:02:14",
            "timestamp": "2025-02-04T12:02:14Z",
            "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxNYnZkWjhWeFNPbEgwUTIyWE9qRmhxRVhxU0pVSkoyd1lxTXp3bktwU2x0Y3FBX2FIcW4waTV0MXBIZTJYNXdLa3NiNTNvczFmZm1YYjMzcjlDWS1KU0dQVTNxTW9Yd25wcFF6NHdkNnNBbDRaQ3ZMZGxfNlZlYXFjX285c0Q1eW5JdGNKbkZRVkNmeU1jeFhaNTZwdUJSNm5xbnc1bU13bmo4VFlBcElNdA?oc=5"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "SES AI Corp (NYSE: SES) regains NYSE minimum price requirement compliance per Feb 3, 2025 letter. Reestablishes continued listing under NYSE criteria.",
            "id": "5695a64e-ede2-4e71-95f5-bed25602434b",
            "is_major": true,
            "source": "Business Wire",
            "source_type": "news",
            "summary": "SES AI Corporation, a renowned manufacturer of AI-enhanced Li-Metal and Li-ion batteries, received a Compliance Notice from the New York Stock Exchange (NYSE) on February 3, 2025. The letter confirmed that the company, listed as SES on NYSE, had complied with the minimum share price requirement under Section 802.01C of the NYSE Listed Company Manual. This notification marks an important milestone for SES AI as it solidifies its position in the market.",
            "tickers": [
                "NDXP",
                "SES"
            ],
            "time": "12:02:14",
            "timestamp": "2025-02-04T12:02:14Z",
            "url": "http://www.businesswire.com/news/home/20250204970757/en/SES-AI-Regains-Compliance-with-NYSE-Minimum-Price-Requirement/?feedref=JjAwJuNHiystnCoBq_hl-Q-tiwWZwkcswR1UZtV7eGe24xL9TZOyQUMS3J72mJlQ7fxFuNFTHSunhvli30RlBNXya2izy9YOgHlBiZQk2LOzmn6JePCpHPCiYGaEx4DL1Rq8pNwkf3AarimpDzQGuQ=="
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Pipedrive introduces new AI CRM with intelligent agents to assist sales teams, enhancing sales process efficiency.",
            "id": "0c4220ad-c528-48cb-9600-f56a6c55d8ec",
            "is_major": false,
            "source": "Business Wire",
            "source_type": "news",
            "summary": "Pipedrive, a sales CRM designed for small businesses, has launched a new AI system that includes a network of intelligent agents. These digital teammates, available 24/7, aim to simplify the sales process and empower salespeople. The voice- and text-enabled agents are personalized for each customer, enabling sales teams to assign tasks, communicate seamlessly, and gain immediate insights to improve sales results.",
            "tickers": [
                "NDXP"
            ],
            "time": "12:02:12",
            "timestamp": "2025-02-04T12:02:12Z",
            "url": "http://www.businesswire.com/news/home/20250204946106/en/Pipedrive-Unveils-Next-Generation-AI-CRM-With-Agentic-Experience/?feedref=JjAwJuNHiystnCoBq_hl-Q-tiwWZwkcswR1UZtV7eGe24xL9TZOyQUMS3J72mJlQ7fxFuNFTHSunhvli30RlBNXya2izy9YOgHlBiZQk2LOzmn6JePCpHPCiYGaEx4DL1Rq8pNwkf3AarimpDzQGuQ=="
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Renowned Shark Tank investor Barbara Corcoran headlines Kinexions 2025 in Austin, Texas from March 31 to April 2.",
            "id": "bb67ea7c-1248-4c97-b7e5-9a27ce7568bd",
            "is_major": false,
            "source": "Business Wire",
            "source_type": "news",
            "summary": "In Ottawa, Ontario, Kinaxis® (TSX:KXS) revealed that Barbara Corcoran will be the celebrity keynote speaker at Kinexions 2025, the company's annual conference in Austin, Texas from March 31 to April 2. As the founder of The Corcoran Group and a prominent figure on ABC's Shark Tank, Corcoran, a five-time Emmy award winner, has engaged in numerous business investments. This event will bring together supply chain professionals to discuss industry trends and strategies.",
            "tickers": [
                "NDXP",
                "KXS"
            ],
            "time": "12:02:11",
            "timestamp": "2025-02-04T12:02:11Z",
            "url": "http://www.businesswire.com/news/home/20250204938122/en/Renowned-Shark-Tank-investor-Barbara-Corcoran-to-Headline-Kinexions-2025/?feedref=JjAwJuNHiystnCoBq_hl-Q-tiwWZwkcswR1UZtV7eGe24xL9TZOyQUMS3J72mJlQ7fxFuNFTHSunhvli30RlBNXya2izy9YOgHlBiZQk2LOzmn6JePCpHPCiYGaEx4DL1Rq8pNwkf3AarimpDzQGuQ=="
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Transfr Inc. launches Transfr Trek, the first XR-based career exploration solution, offering integrated experience across mobile, VR, and curriculum resources, focusing on making career exploration more engaging.",
            "id": "3d842c12-0ade-48f4-addc-0f30f9ffa69d",
            "is_major": false,
            "source": "Business Wire",
            "source_type": "news",
            "summary": "Today, Transfr Inc. debuts Transfr Trek, the premier XR-based career exploration tool, as part of its innovative classroom-to-career program. This solution marks a significant shift from traditional platforms that primarily address college readiness. Transfr Trek provides a comprehensive experience across mobile, virtual reality, and curriculum resources, aimed at enhancing accessibility and engagement for learners. The tool integrates multiple modes to offer a more dynamic approach to career exploration, setting it apart from existing offerings.",
            "tickers": [
                "NDXP"
            ],
            "time": "12:02:09",
            "timestamp": "2025-02-04T12:02:09Z",
            "url": "http://www.businesswire.com/news/home/20250204937960/en/Transfr-Launches-the-First-XR-Based-Multi-Modal-Solution-for-Career-Exploration/?feedref=JjAwJuNHiystnCoBq_hl-Q-tiwWZwkcswR1UZtV7eGe24xL9TZOyQUMS3J72mJlQ7fxFuNFTHSunhvli30RlBNXya2izy9YOgHlBiZQk2LOzmn6JePCpHPCiYGaEx4DL1Rq8pNwkf3AarimpDzQGuQ=="
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Helium Mobile introduces nation's first free phone plan with 3GB data, 300 texts, and 100 minutes, no contracts or fees.",
            "id": "48d827d5-c2b9-46d0-98b0-15598c66bd6f",
            "is_major": false,
            "source": "Business Wire",
            "source_type": "news",
            "summary": "In San Francisco, Helium Mobile has introduced the Zero Plan, a new phone plan available to all users. This plan, powered by a unique community-driven network and the largest 5G network in the US, offers 3GB of data, 300 texts, and 100 minutes for free. There are no contracts, concealed charges, or deceptive tactics associated with this plan. By utilizing a network run by individuals rather than large companies, Helium Mobile aims to enhance connectivity accessibility.",
            "tickers": [
                "NDXP"
            ],
            "time": "12:02:07",
            "timestamp": "2025-02-04T12:02:07Z",
            "url": "http://www.businesswire.com/news/home/20250204887815/en/Helium-Mobile-Introduces-the-Nation%E2%80%99s-First-Free-Phone-Plan/?feedref=JjAwJuNHiystnCoBq_hl-Q-tiwWZwkcswR1UZtV7eGe24xL9TZOyQUMS3J72mJlQ7fxFuNFTHSunhvli30RlBNXya2izy9YOgHlBiZQk2LOzmn6JePCpHPCiYGaEx4DL1Rq8pNwkf3AarimpDzQGuQ=="
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Beacon launches India Bill Pay tool for immigrants in Canada to pay bills in India, keeping ties strong.",
            "id": "e5057488-304b-4fe1-8aec-ec0e414e24ac",
            "is_major": false,
            "source": "Business Wire",
            "source_type": "news",
            "summary": "Toronto-based company Beacon has introduced a groundbreaking tool called Beacon India Bill Pay, designed to facilitate bill payments in India for users residing in Canada. This new feature is accessible through the Beacon Money account and is now live for public access. The tool addresses the challenge faced by immigrants in Canada who are striving to establish themselves in a new country while remaining connected to their homeland. Notably, 60% of remittances to India are utilized for family support and other essential expenses. Beacon aims to simplify financial transactions for immigrants by offering this innovative solution.",
            "tickers": [
                "NDXP"
            ],
            "time": "12:02:04",
            "timestamp": "2025-02-04T12:02:04Z",
            "url": "http://www.businesswire.com/news/home/20250204588795/en/Beacon-Introduces-India-Bill-Pay-Within-the-My-Beacon-Super-App-Enabling-Immigrants-to-Manage-Money-Seamlessly-Across-Borders/?feedref=JjAwJuNHiystnCoBq_hl-Q-tiwWZwkcswR1UZtV7eGe24xL9TZOyQUMS3J72mJlQ7fxFuNFTHSunhvli30RlBNXya2izy9YOgHlBiZQk2LOzmn6JePCpHPCiYGaEx4DL1Rq8pNwkf3AarimpDzQGuQ=="
        }
    ]
}
