{
    "news": [
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Gator Air Conditioning acquired by Del-Air Heating in Tampa. JTW Advisors client deal. Tampa and Sarasota region focus.",
            "id": "12524b89-b6a3-4d3e-a273-1ef76a0ce2ec",
            "is_major": true,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "In Tampa, Florida on February 4, 2025, JTW Advisors LLC revealed the acquisition of Gator Air Conditioning by Del-Air Heating, Air Conditioning & Refrigeration. Gator Air Conditioning, known for offering top-notch residential HVAC services in Sarasota and Tampa, is now under the ownership of Del-Air. The acquiring company is financially supported by Astara.",
            "tickers": [
                "NDXP"
            ],
            "time": "16:05:36",
            "timestamp": "2025-02-04T16:05:36Z",
            "url": "https://www.prnewswire.com/news-releases/jtw-advisors-gator-air-conditioning-acquired-by-del-air-heating-air-conditioning--refrigeration-in-tampa-302367703.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Jon Batiste and He Gets Us collaborate for Love Riot Festival in New Orleans' 9th Ward on Feb. 8, 2025.",
            "id": "e0193a1c-7fbd-4d5e-af62-62eef1900f8c",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "A special event named Jon Batiste's Love Riot Festival, organized by He Gets Us, will take place in the Desire Area of New Orleans' 9th Ward on February 8, 2025. The festival promises a unique experience featuring music, love, and community service. This event aims to bring joy and positive energy to the area, with various activities planned for attendees to enjoy. The event is set to attract a large crowd and is expected to have a significant impact on the local community.",
            "tickers": [
                "NDXP"
            ],
            "time": "16:05:33",
            "timestamp": "2025-02-04T16:05:33Z",
            "url": "https://www.prnewswire.com/news-releases/jon-batiste-and-he-gets-us-team-up-to-reveal-big-game-weekend-plans-302367680.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Alloy.ai and CloudPaths team up for supply chain planning, aiding consumer brands with SAP expertise and real-time data.",
            "id": "3f541a16-fea9-4fb4-988f-dffead45d997",
            "is_major": false,
            "source": "Business Wire",
            "source_type": "news",
            "summary": "Alloy.ai, a prominent data integration and retail analytics provider, has partnered with CloudPaths, a recognized SAP specialist. Together, they offer comprehensive digital supply chain planning services. This collaboration aims to revolutionize supply chain and planning processes for consumer product companies by leveraging CloudPaths’ SAP proficiency and Alloy.ai’s cutting-edge real-time data integration platform. This strategic alliance will empower businesses to optimize their operations with enhanced tools and expertise to drive efficiency and profitability.",
            "tickers": [
                "NDXP"
            ],
            "time": "16:04:11",
            "timestamp": "2025-02-04T16:04:11Z",
            "url": "http://www.businesswire.com/news/home/20250204164034/en/Alloy.ai-and-CloudPaths-Partner-to-Transform-Supply-Chain-Planning-for-Consumer-Products-Businesses/?feedref=JjAwJuNHiystnCoBq_hl-Q-tiwWZwkcswR1UZtV7eGe24xL9TZOyQUMS3J72mJlQ7fxFuNFTHSunhvli30RlBNXya2izy9YOgHlBiZQk2LOzmn6JePCpHPCiYGaEx4DL1Rq8pNwkf3AarimpDzQGuQ=="
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "NTT DATA appoints Sudhir Chaturvedi as Global Chief Growth Officer & North America CEO to lead growth strategies globally.",
            "id": "0944d892-1c00-4761-b6e6-a208b5f39a8a",
            "is_major": false,
            "source": "Business Wire",
            "source_type": "news",
            "summary": "In a recent announcement, NTT DATA, a worldwide digital business and IT services frontrunner, revealed that Sudhir Chaturvedi is set to take on the roles of Global Chief Growth Officer and North America Chief Executive Officer at NTT DATA, Inc. In this new position, Chaturvedi will spearhead the drive for sustained growth strategies on a global scale, particularly emphasizing global industries, strategic accounts, and collaborative market approaches with essential partners.",
            "tickers": [
                "NDXP"
            ],
            "time": "16:04:08",
            "timestamp": "2025-02-04T16:04:08Z",
            "url": "http://www.businesswire.com/news/home/20250204070250/en/NTT-DATA-Inc.-Appoints-Sudhir-Chaturvedi-as-Global-Chief-Growth-Officer-and-North-America-CEO/?feedref=JjAwJuNHiystnCoBq_hl-Q-tiwWZwkcswR1UZtV7eGe24xL9TZOyQUMS3J72mJlQ7fxFuNFTHSunhvli30RlBNXya2izy9YOgHlBiZQk2LOzmn6JePCpHPCiYGaEx4DL1Rq8pNwkf3AarimpDzQGuQ=="
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Peach Finance to power Square's credit card program, integrating with broader ecosystem for sellers to manage cash flow effectively.",
            "id": "d7651ba8-3eb6-467c-9cda-132dd83ef008",
            "is_major": false,
            "source": "Business Wire",
            "source_type": "news",
            "summary": "Peach Finance, a prominent loan management and servicing technology platform based in Oakland, California, has revealed its collaboration with Square for its credit card services. This alliance allows Square’s credit card to seamlessly integrate with its range of business solutions, empowering sellers to streamline their cash flow management within a singular platform. By leveraging Peach’s adaptable servicing platform, Square aims to enhance the scalability of its products for businesses.",
            "tickers": [
                "NDXP"
            ],
            "time": "16:04:06",
            "timestamp": "2025-02-04T16:04:06Z",
            "url": "http://www.businesswire.com/news/home/20250204668965/en/Square-Selects-Peach-to-Power-Innovative-Credit-Card-Program/?feedref=JjAwJuNHiystnCoBq_hl-Q-tiwWZwkcswR1UZtV7eGe24xL9TZOyQUMS3J72mJlQ7fxFuNFTHSunhvli30RlBNXya2izy9YOgHlBiZQk2LOzmn6JePCpHPCiYGaEx4DL1Rq8pNwkf3AarimpDzQGuQ=="
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "IQVIA ranked #1 on Fortune's Most Admired Companies list in 2025 for the fourth year. It's 8th consecutive year on the list.",
            "id": "7fb31018-098d-4068-9f6f-1b1a401eeb88",
            "is_major": true,
            "source": "Business Wire",
            "source_type": "news",
            "summary": "IQVIA, a prominent provider of clinical research services and healthcare intelligence, has been ranked as the top company in its category on the 2025 Fortune® World’s Most Admired Companies™ list. This marks the fourth consecutive year IQVIA has secured the first position in the Health Care: Pharmacy and Other Services sector and its eighth consecutive appearance on the list. Noteworthy is the fact that IQVIA has consistently achieved first place in its category for four years.",
            "tickers": [
                "NDXP",
                "IQV"
            ],
            "time": "16:04:03",
            "timestamp": "2025-02-04T16:04:03Z",
            "url": "http://www.businesswire.com/news/home/20250204874891/en/IQVIA-named-to-the-Fortune%C2%AE-World%E2%80%99s-Most-Admired-Companies%E2%84%A2-list-ranked-No.-1-in-its-sector-for-fourth-consecutive-year/?feedref=JjAwJuNHiystnCoBq_hl-Q-tiwWZwkcswR1UZtV7eGe24xL9TZOyQUMS3J72mJlQ7fxFuNFTHSunhvli30RlBNXya2izy9YOgHlBiZQk2LOzmn6JePCpHPCiYGaEx4DL1Rq8pNwkf3AarimpDzQGuQ=="
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Apple introduces Apple Invites app for creating custom invitations, RSVP, and share playlists for events. Download now!",
            "id": "5c0dbae1-b32a-4327-bf93-1de39053d048",
            "is_major": false,
            "source": "Business Wire",
            "source_type": "news",
            "summary": "In Cupertino, California, Apple unveiled Apple Invites, a new iPhone app enabling users to design personalized invitations for gatherings. The app allows for easy sharing, RSVP management, participation in Shared Albums, and interaction with Apple Music playlists. As of today, the app is available for download on the App Store and via icloud.com/invites online. iCloud+ members have the ability to create invitations.",
            "tickers": [
                "AAPL",
                "NDXP"
            ],
            "time": "16:04:01",
            "timestamp": "2025-02-04T16:04:01Z",
            "url": "http://www.businesswire.com/news/home/20250203932522/en/Introducing-Apple-Invites-a-new-app-that-brings-people-together-for-life%E2%80%99s-special-moments/?feedref=JjAwJuNHiystnCoBq_hl-Q-tiwWZwkcswR1UZtV7eGe24xL9TZOyQUMS3J72mJlQ7fxFuNFTHSunhvli30RlBNXya2izy9YOgHlBiZQk2LOzmn6JePCpHPCiYGaEx4DL1Rq8pNwkf3AarimpDzQGuQ=="
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "NEXE to present at Small Cap Growth Virtual Investor Conference on Feb 6, inviting investors and analysts. ",
            "id": "9bd9aaa8-c26a-4550-a826-7f4f09e7a805",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "NEXE Innovations Inc. (stock symbols: TSXV: NEXE, Frankfurt: NX5, OTC: NEXNF) is encouraging individual and institutional investors, as well as advisors and analysts, to participate in an online event on Feb. 4, 2025. The event will be held on VirtualInvestorConferences.com and will take place in Toronto and New York.",
            "tickers": [
                "NDXP",
                "NEXE"
            ],
            "time": "16:03:31",
            "timestamp": "2025-02-04T16:03:31Z",
            "url": "https://www.prnewswire.com/news-releases/nexe-innovations-to-present-at-the-small-cap-growth-virtual-investor-conference-on-february-6th-302367700.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Sequins™ releases first commercial products: Metagenomics, Whole Genome Sequencing Core Controls.",
            "id": "a5b0cedb-a320-4d50-a993-9b9887df14d1",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "In San Francisco on February 4, 2025, Sequins, a recently funded start-up operating in the next generation sequencing (NGS) sector, unveiled their inaugural commercial offerings. The products, which include the Sequins Metagenomics Core Control and Whole Genome Sequencing Core Control Sets, are now accessible to the market.",
            "tickers": [
                "SAN",
                "NGS",
                "NDXP"
            ],
            "time": "16:03:29",
            "timestamp": "2025-02-04T16:03:29Z",
            "url": "https://www.prnewswire.com/news-releases/sequins-announces-availability-of-first-products--bolsters-team-for-commercialization-302367076.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Northeastern Electronics partners with Manufacturo to enhance aerospace harness manufacturing efficiency for microsatellites.",
            "id": "242ecd71-7663-49ac-bbd9-f0a83bb67c61",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "In BREA, California on February 4, 2025, Northeastern Electronics Co., Inc., a prominent company specializing in build-to-print aerospace harness manufacturing for microsatellite uses, has announced a collaboration with Manufacturo. This partnership aims to enhance operational efficiency and enhance production processes.",
            "tickers": [
                "BREA",
                "NDXP"
            ],
            "time": "16:03:27",
            "timestamp": "2025-02-04T16:03:27Z",
            "url": "https://www.prnewswire.com/news-releases/northeastern-partners-with-manufacturo-to-redefine-efficiency-in-aerospace-harness-manufacturing-302367649.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "LBB Specialties partners with Kerry Group to launch new personal care ingredients, expanding distribution in NA.",
            "id": "cc5ea585-184b-4f58-80a3-aa35fd567008",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "A collaboration has been established between LBB Specialties (LBBS), a prominent distributor of specialty chemicals and ingredients in North America, and Kerry Group, a global leader in taste and nutrition solutions for the food and beverage industries. This partnership, revealed on February 4, 2025, in Norwalk, Connecticut, signifies a significant development in the sector. LBBS, known for its expertise in specialty chemicals, joins forces with Kerry Group, a renowned player in the field, to enhance their offerings and services. This strategic alliance is anticipated to drive growth and innovation, consolidating their positions in the market. The collaboration aims to leverage LBBS's extensive network and Kerry Group's expertise to provide top-notch solutions to clients in the food and beverage industry. This move aligns with the companies' commitment to delivering quality products and fostering customer satisfaction. The partnership is expected to usher in new opportunities, enabling the firms to tap into the burgeoning market demand and expand their reach. It represents a step forward in the companies' endeavors to meet the evolving needs of consumers and stay at the forefront of the industry. Investors and stakeholders are eager to witness the outcomes of this collaboration, which holds promise for both parties in terms of growth and success.",
            "tickers": [
                "NDXP"
            ],
            "time": "16:03:24",
            "timestamp": "2025-02-04T16:03:24Z",
            "url": "https://www.prnewswire.com/news-releases/lbb-specialties-partners-with-kerry-group-to-launch-innovative-ingredients-to-the-personal-care-market-302367251.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Arrival Home Loans and zavvie partner to offer enhanced homebuying solutions. Leading providers in bridge financing and AI tech.",
            "id": "dbdcf33f-57b8-416d-bb4c-d5a7e44b2225",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "On February 4th, 2025, Arrival Home Loans, a prominent provider of bridge financing solutions, and zavvie, a top technology firm focusing on AI-powered platforms for real estate lending professionals, revealed a strategic collaboration. This partnership aims to leverage zavvie's innovative technology to enhance services provided by Arrival Home Loans, benefitting clients with cutting-edge solutions. The strategic alliance between the two companies signifies a significant move towards revolutionizing the real estate lending sector by integrating advanced technologies.",
            "tickers": [
                "SAN",
                "NDXP"
            ],
            "time": "16:03:22",
            "timestamp": "2025-02-04T16:03:22Z",
            "url": "https://www.prnewswire.com/news-releases/arrival-home-loans-and-zavvie-announce-strategic-partnership-to-enhance-homebuying-solutions-302366778.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Four Seasons Resort Maui at Wailea opens KOMO, a 50-seat Japanese dining destination in Hawaii.",
            "id": "1001a763-476c-4a6c-a7ef-003dcd735cc6",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "In Wailea, Hawaii on February 4, 2025, Four Seasons Resort Maui at Wailea introduced its latest culinary venture, KOMO. This restaurant offers masterful Japanese cuisine within a setting that beautifully embodies Maui's renowned radiance. KOMO is an intimate space with seating for 50 guests, featuring a unique 14-seat interactive dining experience.",
            "tickers": [
                "NDXP"
            ],
            "time": "16:03:20",
            "timestamp": "2025-02-04T16:03:20Z",
            "url": "https://www.prnewswire.com/news-releases/four-seasons-resort-maui-at-wailea-unveils-komo-a-next-generation-dining-destination-where-japanese-mastery-meets-hawaiian-hospitality-302367165.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Scientists discover two immense canyons on the lunar far side. Discovery made by team at LPI in Washington and Houston.",
            "id": "2cb52e8a-6b02-47b8-8c21-4293bdb070b1",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "On February 4, 2025, researchers at the Lunar and Planetary Institute (LPI) in Washington and Houston made a groundbreaking find. The team, part of the Universities Space Research Association (USRA), uncovered two massive canyons on the far side of the moon that bear resemblance in their characteristics. This discovery sheds new light on lunar geography and marks an important milestone in lunar research. The exact dimensions of the canyons and other specifics were not disclosed.",
            "tickers": [
                "NDXP"
            ],
            "time": "16:03:17",
            "timestamp": "2025-02-04T16:03:17Z",
            "url": "https://www.prnewswire.com/news-releases/grand-canyons-of-the-moon-302367674.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Dirac Links LLC releases D-Band \"Visionary Series\" wearable platform with real-time AI support. Revolutionary tech advancement.",
            "id": "f5438c0d-8434-4a1e-b3d2-f001f69facb3",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "Woodbridge, Virginia, on February 4, 2025 - Dirac Links has unveiled the D-Band: The Visionary Series, a revolutionary wearable platform designed as the next step in AI-powered personal support technologies. The D-Band merges various cutting-edge features to provide advanced assistance to users.",
            "tickers": [
                "NDXP"
            ],
            "time": "16:03:15",
            "timestamp": "2025-02-04T16:03:15Z",
            "url": "https://www.prnewswire.com/news-releases/dirac-links-llc-unveils-the-revolutionary-d-band-visionary-series-wearable-platform-real-time-ai-support-for-your-tomorrows-vision-today-302367577.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "ATIS enhances Open RAN MVP requirements to drive adoption in North America, aiming for unified tech standards.",
            "id": "9040a155-b083-4963-bec8-06ddf08fe538",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "On February 4, 2025, in Washington, ATIS revealed the extension of the initial rollout of the Open RAN Minimum Viable Profile (MVP). This framework sets out essential technical standards that are uniform among all telecom operators in North America. The aim is to facilitate the advancement and incorporation of this technology.",
            "tickers": [
                "NDXP"
            ],
            "time": "16:03:13",
            "timestamp": "2025-02-04T16:03:13Z",
            "url": "https://www.prnewswire.com/news-releases/atis-evolves-minimum-viable-profile-requirements-to-accelerate-open-ran-adoption-in-north-america-302365705.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Appdome releases 24 new defense plugins targeting Android & iOS Trojans globally, enhancing Account Takeover Protection.",
            "id": "42c99f58-b256-43b0-b6b7-9221e1730c47",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "Appdome continues to enhance its leadership in Account Takeover Protection (ATO) by introducing 24 new Dynamic Defense Plugins aimed at combating banking trojans, trojan spyware, and remote access trojans (RATs). The company, based in REDWOOD CITY, Calif., shared this news on Feb. 4, 2025. The upgraded platform solidifies Appdome's position as the top provider of mobile business security solutions.",
            "tickers": [
                "NDXP"
            ],
            "time": "16:03:11",
            "timestamp": "2025-02-04T16:03:11Z",
            "url": "https://www.prnewswire.com/news-releases/appdome-breaks-the-surge-in-android--ios-trojans-globally-302367506.html"
        },
        {
            "beta_headline": null,
            "category": "commodities",
            "date": "2025-02-04",
            "headline": "Service Compression secures $95 million credit facility increase led by J.P. Morgan, boosting growth and fleet expansion.",
            "id": "5a16a725-f344-4cf5-9fa6-298ac21c2c84",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "Service Compression, a prominent natural gas compression services provider based in Lubbock, Texas, is set for significant market growth, fleet expansion, and technological advancements following a substantial investment from lenders. The company, known for its expertise in compression services, is gearing up to enhance its operations with the influx of funds. This development is expected to boost the company's presence and capabilities in the industry.",
            "tickers": [
                "NDXP"
            ],
            "time": "16:03:09",
            "timestamp": "2025-02-04T16:03:09Z",
            "url": "https://www.prnewswire.com/news-releases/service-compression-announces-95-million-credit-facility-upsize-led-by-jp-morgan-302367504.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "CloudMoyo named #1 Top Company to Work For 2024 by Seattle Business Magazine, expert in data analytics, cloud; founded in 2015.",
            "id": "b3333b2c-7283-49a4-9167-83a01f6fb198",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "Based in Bellevue, Washington, CloudMoyo, a top digital engineering company, secured the top spot on the Best Companies to Work For list by Seattle Business Magazine. This win marks a significant achievement for the firm, which was established in 2015 and specializes in data analytics and cloud technology. The recognition once again reinforces CloudMoyo's reputation as a premier employer in the industry.",
            "tickers": [
                "NDXP"
            ],
            "time": "16:03:07",
            "timestamp": "2025-02-04T16:03:07Z",
            "url": "https://www.prnewswire.com/news-releases/cloudmoyo-ranked-1-top-company-to-work-for-2024-by-seattle-business-magazine-302367005.html"
        },
        {
            "beta_headline": null,
            "category": "commodities",
            "date": "2025-02-04",
            "headline": "G.O.A.T. Fuel releases second limited edition featuring Jerry Rice, following sold-out release of Muhammad Ali can.",
            "id": "afc4ba39-99b1-405f-a905-d16d9890dcb3",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "G.O.A.T. Fuel, the premium sports energy drink co-founded by Pro Football Hall of Famer Jerry Rice, is launching its second limited edition can in February 2025. Following the successful sale of the first can in October, this new release celebrates the legacy of Muhammad Ali. The company is based in Santa Clara, California and continues to gain popularity with consumers. Stay tuned for this exclusive can release as demand is expected to be high, with initial sales figures indicating a strong interest from fans and collectors alike.",
            "tickers": [
                "NDXP"
            ],
            "time": "16:03:04",
            "timestamp": "2025-02-04T16:03:04Z",
            "url": "https://www.prnewswire.com/news-releases/goat-fuel-sports-energy-drink-releases-limited-edition-cans-featuring-co-founder-jerry-rice-302367558.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Dr. Travis Gayles appointed as new CEO of Howard Brown Health, leading health center in Midwest.",
            "id": "dc5b3d50-9f3f-4d6d-8753-3380edebe636",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "In a press release dated February 4, 2025, Howard Brown Health of Chicago declared the selection of Dr. Travis Gayles, MD, PhD as a demonstration of their dedication to health equity and advancement. Dr. Gayles' appointment marks a significant move by the Midwest's primary health center for inclusive care. This news highlights the organization's continued efforts towards innovation and ensuring equal access to healthcare services for all individuals.",
            "tickers": [
                "NDXP"
            ],
            "time": "16:03:02",
            "timestamp": "2025-02-04T16:03:02Z",
            "url": "https://www.prnewswire.com/news-releases/howard-brown-health-announces-dr-travis-gayles-to-serve-as-new-ceo-302366624.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "RiverBeat Music Festival in Memphis announces daily lineup for May 2-4, with headliners like Missy Elliott, The Killers, and Anderson .Paak.",
            "id": "b75c224f-c609-4303-b18e-f1c67f7bdcb3",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "On February 4, 2025, in Memphis, Tennessee, Mempho Presents' RiverBeat unveiled the schedule for the biggest music festival in the mid-South. Set for May 2-4, the event will feature renowned artists such as Missy Elliott headlining on Friday, The Killers on Saturday, and Anderson .Paak & The Free Nationals closing out the festival. Be prepared for an unforgettable weekend filled with music from some of the industry's top performers.",
            "tickers": [
                "NDXP"
            ],
            "time": "16:03:00",
            "timestamp": "2025-02-04T16:03:00Z",
            "url": "https://www.prnewswire.com/news-releases/riverbeat-music-festival-announces-highly-anticipated-daily-lineup-and-single-day-ticket-sales-302367522.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "ISA's 3rd Annual OT Cybersecurity Summit in Brussels on 18-21 June 2025 to draw hundreds of experts.",
            "id": "01251fa6-4be1-4158-ab30-145b0acb9395",
            "is_major": true,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "In Durham, North Carolina on February 4, 2025, the International Society of Automation (ISA) revealed details about its upcoming third annual OT Cybersecurity Summit to be held in Brussels from June 18 to 21, 2025. This significant event, organized by the top professional society in the automation field, will feature a comprehensive program and is anticipated to attract hundreds of industry experts.",
            "tickers": [
                "NDXP"
            ],
            "time": "16:02:57",
            "timestamp": "2025-02-04T16:02:57Z",
            "url": "https://www.prnewswire.com/news-releases/isas-third-annual-industrial-cybersecurity-event-releases-full-program-302367643.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "American Heart Association promotes CPR training during Heart Month to save 23,000 child cardiac arrest cases yearly.",
            "id": "dbacb678-3e82-4833-9512-ff9a42e38dd5",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "In February, the American Heart Association emphasizes the importance of acquiring CPR skills as a lifesaving measure. Reports reveal that approximately 23,000 children suffer from sudden cardiac arrests annually in the United States. This initiative aims to create a Nation of Lifesavers, recognizing the potential impact of CPR training in reducing fatalities.",
            "tickers": [
                "NDXP"
            ],
            "time": "16:02:55",
            "timestamp": "2025-02-04T16:02:55Z",
            "url": "https://www.prnewswire.com/news-releases/cardiac-arrests-where-we-live-learn-and-play--is-north-texas-prepared-302367660.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "CheckIT Learning introduces neuroscience-based AI tech for education, launching at largest conference. Pilot projects at major school districts.",
            "id": "8f03c5e9-f182-4700-bcc7-1098b53b0a41",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "In Orlando, Florida, on February 4, 2025, CheckIT Learning, a recently launched educational technology company showcased at a leading education conference in January, is now commencing pilot initiatives in prominent elementary and high school districts nationwide. Visit their website (www.checkitlearning.com) for more information.",
            "tickers": [
                "NDXP"
            ],
            "time": "16:02:53",
            "timestamp": "2025-02-04T16:02:53Z",
            "url": "https://www.prnewswire.com/news-releases/checkit-learning-debuts-neuroscience-based-ai-technology-platform-for-students-teachers-and-administrators-302367533.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "MODE Global partners with Highway to enhance carrier sourcing and fraud prevention. Leading logistics company, Feb. 4, 2025 announcement.",
            "id": "8b499bc9-9b28-4dde-a466-ab5ac37f36bc",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "In Dallas on February 4, 2025, MODE Global, a top logistics company, revealed a key partnership with Highway, renowned for Carrier Identity® and anti-fraud services. This venture seeks to enhance MODE Global's network integrity and combat fraudulent activities in the industry.",
            "tickers": [
                "NDXP"
            ],
            "time": "16:02:51",
            "timestamp": "2025-02-04T16:02:51Z",
            "url": "https://www.prnewswire.com/news-releases/mode-global-partners-with-highway-to-elevate-carrier-sourcing-and-fraud-prevention-capabilities-302367571.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "TOPDON US sees 258% sales growth from 2022 to 2024. 7+ new products added in 2024, expanding into new markets like motorcycle and HVAC.",
            "id": "9602dfaf-3ec2-4266-8f3f-928b69070722",
            "is_major": false,
            "source": "GlobeNewswire",
            "source_type": "news",
            "summary": "In Rockaway, New Jersey, on February 4, 2025, TOPDON US, a leading supplier of innovative technology and advanced equipment for auto repair experts and hobbyists, has experienced remarkable progress. They have recorded a notable 258% increase in sales from 2022 to 2024. Among the noteworthy advancements in the company's U.S. sector are the introduction of over 7 fresh products to their auto repair and diagnostic range in 2024. Furthermore, they have diversified into new sectors such as motorcycles, outdoor adventure, and HVAC, indicating their expansion into diverse markets.",
            "tickers": [
                "NDXP"
            ],
            "time": "16:02:16",
            "timestamp": "2025-02-04T16:02:16Z",
            "url": "https://www.globenewswire.com/news-release/2025/02/04/3020558/0/en/TOPDON-US-Reports-Significant-Growth-Increased-Product-Offerings-New-Market-Expansion-and-Charitable-Donations-Across-US-Market.html"
        },
        {
            "beta_headline": null,
            "category": "crypto",
            "date": "2025-02-04",
            "headline": "City in South Korea to track and seize crypto from tax evaders to ensure tax justice and fairness for all citizens.",
            "id": "5502da1f-6d7d-4fe6-ba4f-732fbf53c54d",
            "is_major": false,
            "source": "Decrypt",
            "source_type": "news",
            "summary": "The decision to implement this measure is aimed at ensuring tax fairness to prevent any disadvantages for citizens who dutifully pay their taxes, stated a local official.",
            "tickers": [],
            "time": "16:01:13",
            "timestamp": "2025-02-04T16:01:13Z",
            "url": "https://decrypt.co/304321/south-korea-city-seize-crypto-tax-evaders"
        },
        {
            "beta_headline": null,
            "category": "investing",
            "date": "2025-02-04",
            "headline": "US to sell $95 bln 4-week bills on February 6th, to settle on February 11th.",
            "id": "e9058e58-89fb-4c03-ac28-6e29ba2305ea",
            "is_major": false,
            "source": "Tradex",
            "source_type": "news",
            "summary": null,
            "tickers": [],
            "time": "16:01:09",
            "timestamp": "2025-02-04T16:01:09Z",
            "url": null
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Global Fintech as a Service market valued at US$387.4B in 2024, expected to reach US$1.1T by 2030 with 18.4% CAGR growth per ResearchAndMarkets.",
            "id": "2eebb8ac-ca35-4c3a-9b21-f93a36c8c3df",
            "is_major": false,
            "source": "Business Wire",
            "source_type": "news",
            "summary": "Dublin-based ResearchAndMarkets.com has released a new report titled \"Fintech as a Service (FaaS) - Global Strategic Business Report,\" now available for purchase. The global Fintech as a Service market was valued at US$387.4 billion in 2024 and is anticipated to reach US$1.1 trillion by 2030, with a projected compound annual growth rate (CAGR) of 18.4% between 2024 and 2030. This detailed analysis covers market trends, drivers, and forecasts to assist businesses in making well-informed decisions regarding Fintech as a Service.",
            "tickers": [
                "NDXP"
            ],
            "time": "15:58:55",
            "timestamp": "2025-02-04T15:58:55Z",
            "url": "http://www.businesswire.com/news/home/20250204407110/en/Fintech-as-a-Service-Business-Research-Report-2024-2030-Cloud-Computing-Throws-the-Spotlight-on-the-Scalability-FaaS-Cross-Border-Payment-Innovations-Generate-Demand---ResearchAndMarkets.com/?feedref=JjAwJuNHiystnCoBq_hl-Q-tiwWZwkcswR1UZtV7eGe24xL9TZOyQUMS3J72mJlQ7fxFuNFTHSunhvli30RlBNXya2izy9YOgHlBiZQk2LOzmn6JePCpHPCiYGaEx4DL1Rq8pNwkf3AarimpDzQGuQ=="
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "NeuroOne® (NMTC) complies with Nasdaq's minimum share price standard, solidifying listing status.",
            "id": "16e8e43d-2c89-4f6b-be33-4b9d1e2734e6",
            "is_major": false,
            "source": "GlobeNewswire",
            "source_type": "news",
            "summary": "EDEN PRAIRIE, Minnesota – NeuroOne Medical Technologies Corporation (Nasdaq: NMTC), a company specializing in medical technology for patients with neurological disorders, has recently announced its successful compliance with the Nasdaq Capital Market’s listing standard for minimum share price requirements. This milestone marks a significant achievement for NeuroOne, ensuring their continued presence in the market. Through their innovative approach to improving surgical care, NeuroOne aims to enhance treatment options and outcomes for individuals with neurological conditions.",
            "tickers": [
                "NDXP",
                "NMTC"
            ],
            "time": "15:57:51",
            "timestamp": "2025-02-04T15:57:51Z",
            "url": "https://www.globenewswire.com/news-release/2025/02/04/3020553/0/en/NeuroOne-Regains-Compliance-with-Nasdaq-Listing-Requirements.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Strategist starts American Opposition to combat fascism in US. Super PAC sets Natl Day of Protest on Feb. 5, 2025.",
            "id": "4c69977b-dce2-4dc6-861a-edd4969c91d6",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "A Super PAC has announced a National Day of Protest set to take place on Wednesday, February 5, 2025 in Boulder, Colorado. With mounting worries regarding the fate of democracy in the country, Carlos Álvarez-Aranyos has introduced American Opposition, a fresh organization committed to addressing the issue.",
            "tickers": [
                "PAC",
                "NDXP"
            ],
            "time": "15:56:48",
            "timestamp": "2025-02-04T15:56:48Z",
            "url": "https://www.prnewswire.com/news-releases/top-strategist-launches-american-opposition-to-counter-the-rise-of-fascism-in-the-united-states-302367691.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "The Reading League expands with 7 new chapters in 7 states, totaling 40 chapters in under 10 years.",
            "id": "e7adff89-ff42-407d-8f79-e7887fa133cf",
            "is_major": true,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "In less than ten years, The Reading League, founded in Syracuse, has rapidly expanded from its origins at a kitchen table to establish a presence in 40 chapters. Recently, on February 4, 2025, the nonprofit organization announced the addition of seven new chapters, further solidifying its on-the-ground reach and impact.",
            "tickers": [
                "NDXP"
            ],
            "time": "15:56:46",
            "timestamp": "2025-02-04T15:56:46Z",
            "url": "https://www.prnewswire.com/news-releases/the-reading-league-welcomes-new-chapters-in-seven-states-as-evidence-aligned-reading-instruction-expands-in-the-us-302367692.html"
        },
        {
            "beta_headline": null,
            "category": "crypto",
            "date": "2025-02-04",
            "headline": "Bitcoin mining stocks are volatile as Riot Platforms mined 527 bitcoin in January, holding 18,221 bitcoin. Hasrate climbed to 29.3 EH/s.",
            "id": "fec44a62-880b-4d07-8ec8-9a3e69f70647",
            "is_major": false,
            "source": "Benzinga",
            "source_type": "news",
            "summary": "Bitcoin (CRYPTO: BTC) mining stocks experienced volatility on Tuesday as several miners provided updates for operations in January. Riot Platforms Inc (NASDAQ:RIOT) disclosed that it mined 527 bitcoin during the month, marking a 2% increase from December's 516. By the end of January, Riot held a total of 18,221 bitcoin. The company's average deployed hashrate in January was 33.5 EH/s, with the average operational hashrate rising to 29.3 EH/s. CleanSpark Inc also... (For the full story, visit a financial news website)",
            "tickers": [
                "RIOT",
                "CLSK",
                "MARA"
            ],
            "time": "15:53:30",
            "timestamp": "2025-02-04T15:53:30Z",
            "url": "https://www.benzinga.com/25/02/43467982/whats-going-on-with-bitcoin-mining-stocks-tuesday"
        },
        {
            "beta_headline": null,
            "category": "investing",
            "date": "2025-02-04",
            "headline": "Russia's February crude oil exports from western ports revised up by 300.000 bpd to 1.9 mln bpd - Traders.",
            "id": "5279b3ef-dbe1-47a0-96db-f678f0264da0",
            "is_major": true,
            "source": "Tradex",
            "source_type": "news",
            "summary": null,
            "tickers": [],
            "time": "15:53:07",
            "timestamp": "2025-02-04T15:53:07Z",
            "url": null
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "New president Ed Kelley to lead National Press Club Journalism Institute with 15-member Board of Directors in 2025.",
            "id": "ab01e4b3-2d91-4abd-a9cf-f1b8873e5da9",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "The National Press Club Journalism Institute has announced Ed Kelley as the new president of its volunteer Board of Directors for the 2025-26 term. Kelley, a strong advocate for journalists with experience in local media and academia, will lead the 15-member board.",
            "tickers": [
                "NDXP"
            ],
            "time": "15:52:43",
            "timestamp": "2025-02-04T15:52:43Z",
            "url": "https://www.prnewswire.com/news-releases/national-press-club-journalism-institute-has-new-president-welcomes-2025-board-of-directors-302367686.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Amazon's Q4 earnings report impending amidst tariff worries, DeepSeek impact on tech markets. Key focus on AI shake-up. Test for stock.",
            "id": "dd641ac0-1c16-49fa-9ea7-e41eb5fb1adf",
            "is_major": true,
            "source": "Investors.com",
            "source_type": "news",
            "summary": "Despite worries about tariffs and the impact of DeepSeek on the tech market, Amazon's stock has remained steady. The fourth-quarter results, set to be released on Thursday, will be a significant indicator of the company's performance. Investors are eagerly anticipating how Amazon has navigated through the challenges posed by DeepSeek, the shake-up caused by artificial intelligence, and the looming threats of tariffs. This quarterly report will be a crucial milestone for Amazon as it seeks to maintain its stability amidst these unpredictable market conditions.",
            "tickers": [],
            "time": "15:51:40",
            "timestamp": "2025-02-04T15:51:40Z",
            "url": "https://www.investors.com/news/technology/amazon-stock-q4-earnings-2024-deepseek-tariffs-trump/"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Palantir CTO warns of U.S., China 'AI Arms Race' with the rise of Chinese startup DeepSeek. #Tech #AI #Competition",
            "id": "0054ca97-985c-4c82-92a5-130fedcd076a",
            "is_major": false,
            "source": "Investors.com",
            "source_type": "news",
            "summary": "During Palantir's fourth quarter earnings call, Chief Technology Officer Shyam Sankar discussed the rapid rise of Chinese startup DeepSeek. Sankar emphasized the escalating \"AI Arms Race\" between the United States and China, with DeepSeek posing a significant challenge. This information was not specified by the source provided.[Character count: 370]",
            "tickers": [
                "CTO",
                "PLTR"
            ],
            "time": "15:51:38",
            "timestamp": "2025-02-04T15:51:38Z",
            "url": "https://www.investors.com/news/technology/palantir-stock-chief-technology-officer-declares-us-china-ai-arms-race/"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Merck stock drops 10% due to a weak 2025 outlook despite beating Q4 expectations. Gardasil dynamics impact.",
            "id": "305b32c0-df10-4329-a171-b1ae239aa072",
            "is_major": false,
            "source": "Investors.com",
            "source_type": "news",
            "summary": "Merck stock took a hit on Tuesday as investors reacted negatively to the company's strong performance in the fourth quarter but disappointing outlook for 2025. The stock plummeted by 10% following the news. The poor performance was attributed to concerns surrounding Gardasil dynamics and the weak guidance provided for the upcoming year. This news was reported by Investor's Business Daily.",
            "tickers": [],
            "time": "15:51:36",
            "timestamp": "2025-02-04T15:51:36Z",
            "url": "https://www.investors.com/news/technology/merck-stock-merck-earnings-q4-2024/"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Pfizer's stock slightly down despite revenue boost from Covid products in fourth quarter, sustainability uncertain.",
            "id": "1511a7d0-e02c-4720-b7de-203f143f2727",
            "is_major": false,
            "source": "Investors.com",
            "source_type": "news",
            "summary": "The stock of Pfizer slightly decreased on Tuesday following a relatively uneventful quarter, with revenue from its Covid products contributing to a fourth-quarter surpass. The company's Covid products played a significant role in its positive performance. However, there are doubts about the sustainability of this trend.",
            "tickers": [
                "PFE"
            ],
            "time": "15:51:35",
            "timestamp": "2025-02-04T15:51:35Z",
            "url": "https://www.investors.com/news/technology/pfizer-stock-pfizer-earnings-q4-2024/"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Dow Jones dips due to China tariffs; Palantir stock jumps 27% on earnings.",
            "id": "84ee2744-4654-4d73-83be-50788e57698a",
            "is_major": true,
            "source": "Investors.com",
            "source_type": "news",
            "summary": "On Tuesday, the Dow Jones Industrial Average experienced a decline following China's implementation of tariffs on imports from the U.S. as a retaliatory measure against President Trump's tariffs. Meanwhile, Palantir saw a significant surge of 27% in response to its earnings report. This news was reported by Investor's Business Daily.",
            "tickers": [
                "DOW",
                "NWSA",
                "PLTR"
            ],
            "time": "15:51:15",
            "timestamp": "2025-02-04T15:51:15Z",
            "url": "https://www.investors.com/market-trend/stock-market-today/dow-jones-sp500-nasdaq-trump-tariff-palantir-stock-pltr/"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Stocks rise: Dow Jones, S&P 500 up as Palantir surges on strong earnings. Palantir stock hits new high.",
            "id": "368a3cbd-6dcb-4492-9aeb-ee4cec69af6d",
            "is_major": false,
            "source": "Investors.com",
            "source_type": "news",
            "summary": "Palantir's stock surged to an all-time high following the release of a strong earnings report. Today's stock market saw gains in the Dow Jones and S&P 500 indices as China responded to tariffs. Palantir experienced a significant spike after reporting its earnings, indicating investor confidence in the company's performance.",
            "tickers": [
                "DOW",
                "PLTR"
            ],
            "time": "15:51:12",
            "timestamp": "2025-02-04T15:51:12Z",
            "url": "https://www.investors.com/market-trend/stock-market-today/stock-market-today-dow-jones-sp-500-palantir-stock-pltr-nvidia-nvda/"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Trump selects scientist involved in ‘Sharpiegate’ to head US Weather Agency.",
            "id": "2d7ac316-7df6-40bf-b943-ec99466bd2e4",
            "is_major": true,
            "source": "Bloomberg",
            "source_type": "news",
            "summary": null,
            "tickers": [
                "NDXP"
            ],
            "time": "15:48:41",
            "timestamp": "2025-02-04T15:48:41Z",
            "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxOMXNaWHJKd2dpUldvUzJMZWo0aURCbGV3Ml9lWTFQdG9hLXFtbE1lU2U5Tk1zRkZUdGdLdGVaWHFXMzdNcm40djlFQVhHdi1UdGZ5VUZyRDNPSEtwclRtb0NXTndnNlJ3M0xoc0xYVENtendZVGdWem5rTHhQYVlWdzNZb0pRT3oycFBsVkI1UlNvRVZPZ0VubHlXM1BBTDc2NFZNaGNJVEVndWNsZnc?oc=5"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Dove Men+Care introduces all-in-one Body and Face Scrubs for men's skin needs, enhancing wellness routines. Englewood Cliffs, N.J., Feb. 4, 2025.",
            "id": "166da617-12c5-4170-bfac-cc1e2c198a13",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "A company is dedicated to enhancing men's skincare routines by introducing a multi-functional product. The new Body and Face Scrubs by Dove Men+Care have been launched, aimed at addressing men's specific skin requirements. The innovative formulation is designed to provide a comprehensive solution for skincare needs. This announcement was made in Englewood Cliffs, New Jersey on February 4, 2025.",
            "tickers": [
                "NDXP"
            ],
            "time": "15:48:39",
            "timestamp": "2025-02-04T15:48:39Z",
            "url": "https://www.prnewswire.com/news-releases/dove-mencare-launches-new-body-and-face-scrubs-302367679.html"
        },
        {
            "beta_headline": null,
            "category": "crypto",
            "date": "2025-02-04",
            "headline": "DOJ actions on DeFi developers spark industry fears over liability, emphasizing the need for legal clarity and policy changes.",
            "id": "53e56966-53a4-4b32-a848-3bce23fa73dc",
            "is_major": false,
            "source": "Blockchain News",
            "source_type": "news",
            "summary": "The recent actions taken by the Department of Justice against DeFi developers have sparked worries about accountability and regulation, leading to demands for more precise legal definitions and policy changes regarding decentralized finance. These developments have drawn attention from experts and the wider community, as they grapple with the implications for the rapidly growing DeFi sector. Clarifying the legal landscape surrounding DeFi has become a pressing issue, as it navigates challenges regarding control and responsibility in this innovative space. The need for reform is underscored by the increasing number of individuals and entities involved in DeFi, with the industry's worth estimated at approximately billions of dollars. As discussions continue, stakeholders are advocating for a more coherent approach to address the legal uncertainties surrounding DeFi and ensure a stable regulatory framework for its further development.",
            "tickers": [],
            "time": "15:47:31",
            "timestamp": "2025-02-04T15:47:31Z",
            "url": "https://Blockchain.News/news/doj-stance-defi-industry-concerns-liability"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "US job openings hit lowest level since September.",
            "id": "42630f37-5f8a-45bf-9265-dcd750364db8",
            "is_major": false,
            "source": "Bloomberg",
            "source_type": "news",
            "summary": null,
            "tickers": [
                "NDXP"
            ],
            "time": "15:46:40",
            "timestamp": "2025-02-04T15:46:40Z",
            "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxQQy1qWkpsNTd0OUc2SHkydjN1aExBUmpqeThvbTBBMWhKcFFnaUc1c2Y4aTRTOVc3SkZqeHVyV2QxcHRFcmdKY084QTUzZkZMdWdyemE5UjFVUFBHbl9OLWgxZHVycS1IYjBvY3ZqNWVkNEdpbi1UdXFEU0tHZWh1cUpKVmpTaWRPZDdsXzBuN2hHcFpnbFByY1ctVDFERU1lWnRZ?oc=5"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Red Lobster introduces Ocean Sustainability Challenge to educate youth on protecting marine ecosystems. #Orlando #Seafood #Sustainability",
            "id": "60679437-0021-40c8-87d8-c3ce4b629959",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "Red Lobster, a leading seafood restaurant company based in Orlando, Florida, revealed on February 4, 2025, the debut of its new initiative, the Red Lobster Ocean project. This project is part of the company's commitment to providing top-notch, freshly prepared seafood that is both traceable and responsibly sourced. Red Lobster is recognized as the largest seafood restaurant company globally and is dedicated to ensuring sustainable practices within its seafood supply chain.",
            "tickers": [
                "NDXP"
            ],
            "time": "15:46:34",
            "timestamp": "2025-02-04T15:46:34Z",
            "url": "https://www.prnewswire.com/news-releases/red-lobster-launches-ocean-sustainability-challenge-to-inspire-young-minds-to-protect-and-preserve-marine-ecosystems-302367676.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Narrative I/O partners with Yahoo DSP to empower data activation, accelerating data monetization for advertisers.",
            "id": "54c335bc-6e46-4776-adfb-1034a55b98e2",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "In a recent announcement on February 4, 2025, Narrative I/O, a renowned player in data collaboration, revealed a groundbreaking collaboration with Yahoo DSP. This new integration within Narrative's platform empowers advertisers to leverage their first-party data and offers data providers the opportunity to capitalize on monetization opportunities.",
            "tickers": [
                "DSP",
                "NDXP"
            ],
            "time": "15:46:32",
            "timestamp": "2025-02-04T15:46:32Z",
            "url": "https://www.prnewswire.com/news-releases/narrative-io-launches-new-partnership-with-yahoo-dsp-empowering-first-party-data-activation-and-accelerating-data-monetization-302367502.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "KBRA research on AI in insurance: AI is increasingly used for efficiency, productivity; insurers using AI-driven processes.",
            "id": "0b6bf191-8657-4114-beaf-7d6d3652dbbf",
            "is_major": false,
            "source": "Business Wire",
            "source_type": "news",
            "summary": "In New York, KBRA has published a study on the impact of artificial intelligence (AI) in the insurance industry, focusing on benefits, risks, and governance factors. The use of AI in insurance has significantly increased, with numerous insurers adopting AI-powered systems and strategies. KBRA believes that insurers utilizing AI efficiently can experience improved efficiency, enhanced agent and employee productivity. The study emphasizes the importance of understanding the potential of AI implementation for better performance.",
            "tickers": [
                "NDXP"
            ],
            "time": "15:44:46",
            "timestamp": "2025-02-04T15:44:46Z",
            "url": "http://www.businesswire.com/news/home/20250204109858/en/KBRA-Releases-Research-%E2%80%93-AI-in-Insurance-The-Future-Is-Now/?feedref=JjAwJuNHiystnCoBq_hl-Q-tiwWZwkcswR1UZtV7eGe24xL9TZOyQUMS3J72mJlQ7fxFuNFTHSunhvli30RlBNXya2izy9YOgHlBiZQk2LOzmn6JePCpHPCiYGaEx4DL1Rq8pNwkf3AarimpDzQGuQ=="
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Impartner's Ryan Knapp named 2025 CRN Channel Chief for second year in a row, celebrates executives driving innovation.",
            "id": "3e80e19d-5ac3-4c3c-ab1c-2f603df95560",
            "is_major": false,
            "source": "Business Wire",
            "source_type": "news",
            "summary": "Impartner, a top company in Partner Relationship Management (PRM), is excited to share that Ryan Knapp, the Global Head of Partnerships, has been named to the 2025 Channel Chiefs list by CRN®, a division of The Channel Company. This is Knapp's second consecutive year receiving this honor. The Channel Chiefs list recognizes outstanding leaders in the IT channel industry who are instrumental in fostering innovation and influencing partner success. Knapp brings over 15 years of experience to his role.",
            "tickers": [
                "NDXP"
            ],
            "time": "15:44:44",
            "timestamp": "2025-02-04T15:44:44Z",
            "url": "http://www.businesswire.com/news/home/20250204263043/en/Impartners-Ryan-Knapp-Honored-as-a-2025-CRN%C2%AE-Channel-Chief/?feedref=JjAwJuNHiystnCoBq_hl-Q-tiwWZwkcswR1UZtV7eGe24xL9TZOyQUMS3J72mJlQ7fxFuNFTHSunhvli30RlBNXya2izy9YOgHlBiZQk2LOzmn6JePCpHPCiYGaEx4DL1Rq8pNwkf3AarimpDzQGuQ=="
        }
    ]
}
