{
    "news": [
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-05",
            "headline": "Global Automotive SoC market valued at USD 54.50B in 2023, to grow at CAGR of 6.7%, projected to reach USD 114.87B by 2034. Rise driven by advanced features in passenger vehicles. Asia Pacific leads regional performance. Key players include Intel, NVIDIA, Qualcomm. Major growth drivers are increasing EV adoption, demand for connected cars, prominence of safety features and autonomous driving development.",
            "id": "cd0cbe28-5f0a-4210-9396-62b917eb6e2e",
            "is_major": false,
            "source": "Benzinga",
            "source_type": "news",
            "summary": "The global automotive System-on-Chip (SoC) market was valued at US$54.50 billion in 2023 and is expected to grow at a CAGR of 6.7% between 2024 and 2034, reaching over US$114.87 billion by 2034. Automotive SoCs are crucial for advanced features such as AI, machine learning, and autonomous driving. Passenger vehicles are driving demand, with analog ICs leading market growth. The Asia Pacific region dominates the market, with key players including Intel, NVIDIA, and Qualcomm. Growth drivers include the rise of electric vehicles and connected cars, driving demand for safety features and advanced driver-assistance systems. The development of autonomous vehicles further emphasizes the importance of automotive SoCs.",
            "tickers": [
                "NDXP"
            ],
            "time": "13:50:56",
            "timestamp": "2025-02-05T13:50:56Z",
            "url": "https://www.benzinga.com/pressreleases/25/02/g43494187/global-automotive-soc-market-set-for-growth-valued-at-usd-54-50-bn-in-2023-projected-to-reach-usd-"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-05",
            "headline": "Private employment rose by 183,000 in January 2025, beating expectations. Consumer-facing industries led hiring growth.",
            "id": "261d4f7e-b4dd-408e-93e2-30e7132e8934",
            "is_major": true,
            "source": "Benzinga",
            "source_type": "news",
            "summary": "In January 2025, private employers in the United States added 183,000 new jobs, showing a slight increase from the previous month's revised 176,000 and surpassing the anticipated 150,000 jobs. The ADP National Employment Report by Automatic Data Processing Inc. unveiled this news, illustrating the persistent strength in the private labor sector. With the upcoming non-farm payrolls report by the Bureau of Labor Statistics, there is anticipation of a hiring slowdown. Economists predict a decrease from 256,000 new jobs in December to 170,000. Reflecting on this data, Nela Richardson, ADP's chief economist, noted a disparity in the labor market where consumer-oriented industries led hiring, while business services and production sectors exhibited weaker job growth. The detailed analysis of job growth in January can be found in the complete story on Benzinga.com.",
            "tickers": [
                "GOOGL",
                "AAPL",
                "UUP",
                "SPY",
                "GLD",
                "ADP"
            ],
            "time": "13:50:49",
            "timestamp": "2025-02-05T13:50:49Z",
            "url": "https://www.benzinga.com/25/02/43494246/private-employment-rises-by-183000-beats-estimates-in-january-consumer-facing-industries-drove-hiring"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-05",
            "headline": "Proposal by Trump to have US control Gaza sparks tensions in Middle East, with a divided response.",
            "id": "0f398f30-71b3-46de-be3b-ee785d9926d1",
            "is_major": true,
            "source": "Bloomberg",
            "source_type": "news",
            "summary": null,
            "tickers": [
                "NDXP"
            ],
            "time": "13:49:59",
            "timestamp": "2025-02-05T13:49:59Z",
            "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxNVEoya2haU0RSdlhERGZmazBXWUpOV1BMODU2cVlxOEZTMDYtLVFMUjF5UFowSVp2ajNsaC13Sm9YRG5CQjVCNHNLYVBBUzZMakpuUkFmd3BMRVpVMUFzeU5PSzZXNzBqekJOelUySzFOZy16Nm1vR2VTaWtUVVZiNExJVWdRclFGeWlIa2k0aFJBNFhQMm1XWTBtWGJsa2lxZVYxdzlMMjQ0bHNSb0NIUXlVWEk?oc=5"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-05",
            "headline": "Recur360, a top QuickBooks add-on, now accessible to Canadian businesses for streamlined billing & payments.",
            "id": "ef792548-874b-49a9-baf3-6f98f8f6ec2c",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "In Auburn, Alabama on February 5, 2025, Recur360, a top QuickBooks add-on for billing and payment solutions, is excited to share that QuickBooks users in Canada now have the opportunity to enhance their billing and payment procedures with the help of Recur360. This innovative tool offers robust features aimed at streamlining the billing and payment systems for users.",
            "tickers": [
                "NDXP"
            ],
            "time": "13:49:27",
            "timestamp": "2025-02-05T13:49:27Z",
            "url": "https://www.prnewswire.com/news-releases/recur360-leading-billing--payments-quickbooks-add-on-now-available-for-businesses-in-canada-302368454.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-05",
            "headline": "Overlap Holdings launches a new flagship fund led by Wall Street veteran Justin Stevens, focusing on funding startups addressing global challenges. New York, Feb. 5, 2025.",
            "id": "4cbf8a1f-111d-47d4-8779-67372440ac96",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "A venture capital firm called Overlap Holdings, led by Justin Stevens, a seasoned professional from Wall Street, has launched a new fund on February 5, 2025. The firm aims to support startups dedicated to addressing significant global challenges. This fund combines strategies from Wall Street and Silicon Valley to guide these startups through their financial journey.",
            "tickers": [
                "NDXP"
            ],
            "time": "13:49:22",
            "timestamp": "2025-02-05T13:49:22Z",
            "url": "https://www.prnewswire.com/news-releases/overlap-holdings-launches-flagship-fund-bringing-a-novel-capital-first-approach-to-frontier-tech-302368878.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-05",
            "headline": "Notice of UPM-Kymmene Corporation's Annual General Meeting on Feb 5, 2025 at 15:00 EET in Helsinki.",
            "id": "2217ddf7-576f-4358-a3e1-d18c18b99320",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "On February 5, 2025, at 15:00 EET, in Helsinki, the UPM-Kymmene Corporation announced its Annual General Meeting notice to its shareholders. The meeting aims to address various company matters and discuss the future direction. Shareholders of the corporation are encouraged to participate and engage in the decision-making process. This meeting marks a crucial opportunity for shareholders to express their views and vote on key agenda items. It is an integral part of UPM-Kymmene Corporation's corporate governance framework and plays a significant role in shaping the company's strategies. The AGM will cover important aspects of the company's financial performance, future outlook, and any proposed resolutions. It is vital for shareholders to attend this meeting to actively contribute to the decision-making process.",
            "tickers": [
                "NDXP"
            ],
            "time": "13:49:20",
            "timestamp": "2025-02-05T13:49:20Z",
            "url": "https://www.prnewswire.com/news-releases/notice-of-the-annual-general-meeting-of-upm-kymmene-corporation-302368880.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-05",
            "headline": "Lydia Dishman appointed as VP Content Strategy at Method Communications, bringing expertise as former Fast Company editor.",
            "id": "a28a3572-419f-4d4a-937b-ec2726bfd992",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "A seasoned journalist and editor, Lydia Dishman, has recently been appointed as the VP of Content Strategy at Method Communications in Salt Lake City. With an impressive track record and experience in Tier 1 media outlets, Dishman's addition underscores the agency's commitment to recruiting top talent. This move, announced on February 5, 2025, strengthens the agency's team which includes a growing number of former Tier 1 media professionals. Dishman's expertise will undoubtedly contribute to the agency's continued success.",
            "tickers": [
                "NDXP"
            ],
            "time": "13:49:18",
            "timestamp": "2025-02-05T13:49:18Z",
            "url": "https://www.prnewswire.com/news-releases/method-communications-names-fast-company-editor-lydia-dishman-as-vp-of-content-strategy-302368879.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-05",
            "headline": "Alegeus and Empower join forces in strategic partnership merging health and wealth services.",
            "id": "866547c3-cc97-4429-8500-e1780bc782bb",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "In WALTHAM, Massachusetts, on February 5, 2025, Alegeus, a prominent healthcare benefit and payment solutions provider, disclosed a significant strategic collaboration with Empower, a top player in retirement and wealth management services. This partnership marks a notable development in the industry, with both companies set to leverage their expertise to enhance their offerings. This move symbolizes a forward-thinking strategy aimed at tapping into new opportunities in the market.",
            "tickers": [
                "NDXP"
            ],
            "time": "13:49:16",
            "timestamp": "2025-02-05T13:49:16Z",
            "url": "https://www.prnewswire.com/news-releases/alegeus-and-empower-forge-partnership-to-bring-together-health-and-wealth-302368864.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-05",
            "headline": "Tim Ager becomes VP Sales at BreachLock amidst rapid growth after successful 2024, leading in attack surface discovery.",
            "id": "8f8482c9-9e0c-49a1-b51d-83c3fd692746",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "On February 5, 2025, BreachLock, recognized globally for its expertise in Continuous Attack Surface Discovery and Penetration Testing, revealed the selection of Tim Ager as the Vice President of Sales for the Europe, Middle East, and Africa (EMEA) region. This decision comes after a prosperous year in 2024 for BreachLock amidst significant expansion.",
            "tickers": [
                "NDXP"
            ],
            "time": "13:49:14",
            "timestamp": "2025-02-05T13:49:14Z",
            "url": "https://www.prnewswire.com/news-releases/tim-ager-joins-breachlock-as-vp-of-sales-emea-amid-rapid-growth-302368868.html"
        },
        {
            "beta_headline": null,
            "category": "news",
            "date": "2025-02-05",
            "headline": "Study shows 81% of business leaders adapting to post-COVID \"new normal,\" with 76% to use GenAI and 46% to implement automation.",
            "id": "6632ec10-e18a-4e9f-9985-c2145e8c1768",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "FM:Systems recently released their 2025 Inside the Workplace Report, revealing key statistics. The report shows that 76% of organizations are gearing up to introduce generative artificial intelligence (GenAI), with 46% intending to incorporate automation to aid in workplace operations and maintenance within the next year. Additionally, 82% of business leaders have plans to...",
            "tickers": [],
            "time": "13:49:13",
            "timestamp": "2025-02-05T13:49:13Z",
            "url": "https://www.prnewswire.com/news-releases/fmsystems-study-finds-81-of-business-leaders-have-reached-or-are-nearing-a-new-normal-five-years-after-covid-19-balancing-business-priorities-and-employee-needs-302368427.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-05",
            "headline": "Designium Inc. in Tokyo announces WebAR Template Service revolutionizing AR dev & customer engagement on Feb. 5, 2025.",
            "id": "7728fc5a-e8b9-46ba-94f0-a1c3dff324be",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "In Tokyo on February 5, 2025, Designium Inc., a prominent AR/XR studio, introduced its latest innovation, the WebAR Template Service. This service is designed to revolutionize customer interaction for businesses by providing immersive digital experiences. With the increasing popularity of augmented reality, Designium's cutting-edge service seeks to meet the growing demand for engaging AR experiences.",
            "tickers": [
                "NDXP"
            ],
            "time": "13:49:11",
            "timestamp": "2025-02-05T13:49:11Z",
            "url": "https://www.prnewswire.com/news-releases/designium-launches-innovative-webar-template-service-revolutionizing-augmented-reality-development-302368441.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-05",
            "headline": "GetWhys raises $2.75MM to boost AI customer insights platform for marketing teams, aiding companies like Docusign and Docker.",
            "id": "7278ad18-c542-4b8b-b4d0-226b37739e74",
            "is_major": true,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "A company known as GetWhys is ramping up marketing team efficiency for firms like Docusign, Commvault, and Docker by integrating customer insights into their operations. Recently, on February 5, 2025, in Boise, Idaho, GetWhys disclosed securing a significant $2.75 million seed funding to boost the expansion of its AI-driven customer-centric platform.",
            "tickers": [
                "DOCU",
                "NDXP"
            ],
            "time": "13:49:08",
            "timestamp": "2025-02-05T13:49:08Z",
            "url": "https://www.prnewswire.com/news-releases/getwhys-secures-2-75mm-seed-round-to-fuel-growth-of-ai-powered-customer-insights-platform-302368444.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-05",
            "headline": "EO Baltimore is hosting an event for Maryland entrepreneurs to network and gain inspiration for growth.",
            "id": "e1b4fc4b-12ef-4ec8-b477-1ee61244f0cb",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "On February 5, 2025, in Baltimore, it was highlighted that the journey of every entrepreneur commences with a dream, a strong vision that propels them through challenging nights, significant risks, and a tireless endeavor to achieve success. However, even the most determined business proprietors reach a point where they inquire about the future, pondering on what lies ahead and how to progress further in their ventures.",
            "tickers": [
                "NDXP"
            ],
            "time": "13:49:06",
            "timestamp": "2025-02-05T13:49:06Z",
            "url": "https://www.prnewswire.com/news-releases/eo-baltimore-invites-maryland-entrepreneurs-to-explore-eo--a-morning-of-inspiration-connection-and-growth-302368764.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-05",
            "headline": "RNR Tire Express marks 25 years, opened 200th location, promoted 5 leaders, CEO Adam Sutton, on Franchise 500.",
            "id": "831b993b-2c72-4b48-ad68-be8924c04ca7",
            "is_major": true,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "RNR Tire Express (RNR) recently achieved a significant milestone by inaugurating its 200th location, marking a pivotal point in its expansion journey. The company also made notable promotions within its leadership team, which includes the appointment of Adam Sutton as CEO. Commencing the year on a positive note, RNR garnered recognition on Entrepreneur's prestigious Franchise 500 list. The news was disseminated from TAMPA, Fla., on Feb. 5, 2025.",
            "tickers": [
                "NDXP"
            ],
            "time": "13:49:05",
            "timestamp": "2025-02-05T13:49:05Z",
            "url": "https://www.prnewswire.com/news-releases/rnr-tire-express-celebrates-25-years-of-success-following-milestone-year-in-2024-302368298.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-05",
            "headline": "Giovanni Eco Chic Beauty to present Makeup & Hair Stylist Guild Awards with L'Oréal Groupe on Feb 15, 2025 in LA. Hollywood style masters to be honored for best hair looks in film and TV. #GiovanniEcoChicBeauty #HairCare #EntertainmentIndustry #MakeupandHairStylistGuildAwards #LOréalGroupe.",
            "id": "6ee47afe-5a74-4336-92db-f8645fa50b97",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "Recognition will be given to the top hairstylists in the entertainment industry for creating the best hair looks in movies and television. The event is set to take place in Los Angeles on February 5, 2025. Giovanni Eco Chic Beauty will be highlighted as a key sponsor alongside other major events like the GRAMMYs and the Oscars©. This event will showcase the talents of these Hollywood stylists as they glam up celebrities for various high-profile appearances.",
            "tickers": [
                "NDXP"
            ],
            "time": "13:49:02",
            "timestamp": "2025-02-05T13:49:02Z",
            "url": "https://www.prnewswire.com/news-releases/the-hair-care-brand-of-the-entertainment-industry-giovanni-eco-chic-beauty--presents-the-makeup--hair-stylist-guild-awards-in-conjunction-with-loreal-groupe-saturday-february-15-2025-302368447.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-05",
            "headline": "Clearway Pain Solutions acquires Eastern Neurodiagnostic Associates. Expanding reach and expertise in pain management.",
            "id": "7e700208-9a06-45eb-8eaf-256c77fe86aa",
            "is_major": true,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "In Annapolis, Maryland on February 5th, 2025, Clearway Pain Solutions, a prominent provider of pain management and neurological care, has acquired Eastern Neurodiagnostic Associates P.C., a respected multi-specialty medical practice. This acquisition marks a significant move in Clearway's expansion strategy, further solidifying its position as a national leader in the healthcare industry. The transaction is expected to enhance Clearway's service offerings and geographical reach, benefiting the numerous patients who rely on their expertise.",
            "tickers": [
                "NDXP"
            ],
            "time": "13:49:00",
            "timestamp": "2025-02-05T13:49:00Z",
            "url": "https://www.prnewswire.com/news-releases/clearway-pain-solutions-expands-reach-and-expertise-with-acquisition-of-eastern-neurodiagnostic-associates-302368790.html"
        },
        {
            "beta_headline": null,
            "category": "commodities",
            "date": "2025-02-05",
            "headline": "Avance Gas Holding Ltd will release Q4 2024 results on Feb 12, 2025, with an audio webcast and conference call at 14:00 CET. Visit www.avancegas.com for more info.",
            "id": "37125bbf-285d-4f87-95e0-d6a602c6b43a",
            "is_major": false,
            "source": "GlobeNewswire",
            "source_type": "news",
            "summary": "Bermuda, 02/05/2025 - Avance Gas Holding Ltd. (AGAS) is set to unveil its unaudited Q4 2024 results on 02/12/2025. A conference call and audio webcast are scheduled for 14:00 (CET) on the same day. The event will be accessible via the Investor Relations section on Avance Gas' official website, www.avancegas.com. Link details for the presentation and webcast will be provided prior to the session.",
            "tickers": [
                "CET"
            ],
            "time": "13:47:43",
            "timestamp": "2025-02-05T13:47:43Z",
            "url": "https://www.globenewswire.com/news-release/2025/02/05/3021208/0/en/Avance-Gas-Holding-Ltd-Invitation-to-the-2024-Fourth-Quarter-Presentation.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-05",
            "headline": "Hungary election: Orban focuses on rural pensioners, increases spending ahead of vote.",
            "id": "bc93836d-c65c-423a-9b15-aa6190e6db63",
            "is_major": false,
            "source": "Bloomberg",
            "source_type": "news",
            "summary": "The number of confirmed COVID-19 cases in the country has reached 100,000, with 10,000 new cases reported in the last week alone. The death toll has also risen to 2,000. Health officials are urging the public to continue practicing social distancing and wearing masks to slow the spread of the virus. Additionally, hospitals are at 80% capacity and are facing a shortage of medical supplies. The government is considering implementing stricter lockdown measures to curb the rising number of cases.",
            "tickers": [
                "NDXP"
            ],
            "time": "13:45:56",
            "timestamp": "2025-02-05T13:45:56Z",
            "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxNX0F1RzZHMGF5RTRETmJxdm5Ka1pZWktkeEt6dFZJWUNFaU5OZncxY1dGQXNPX3NlT3c3SVVCcXZwcW5EYmdVX1RBTDhGZUVZVWtYX3R1eDhkYjlIaDRQYzBRX21LUEZRTmNZZlJvLUpDUWRGcUF6MDF2a2RMVHFJZGpTajdEcExYZmEzR1dlRWFBQ0lib1M3Sk1vRzduQkl4SjZReHltVFdEa1pTUWFXWEhpZk1SUQ?oc=5"
        },
        {
            "beta_headline": null,
            "category": "commodities",
            "date": "2025-02-05",
            "headline": "Firebird Energy launches new protein-coffee blend for prolonged energy and endurance. Released on Feb. 5, 2025 in Fort Lauderdale.",
            "id": "971552d1-5fa4-442a-9ba3-29a5e34314f0",
            "is_major": true,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "A groundbreaking protein-coffee blend has been developed to boost energy levels and enhance endurance. Released in Fort Lauderdale, Florida on February 5, 2025, this innovative product aims to meet the global demand for increased energy. Whether it's professionals in the workplace, students in educational settings, or parents caring for young children, people of all walks of life are seeking a sustainable energy solution. The blend is meticulously crafted to provide the necessary stamina for daily activities, offering a unique combination of protein and caffeine to keep individuals performing at their best.",
            "tickers": [
                "NDXP"
            ],
            "time": "13:44:57",
            "timestamp": "2025-02-05T13:44:57Z",
            "url": "https://www.prnewswire.com/news-releases/firebird-energy-kicks-in-fast-and-keeps-you-going-longer-302368410.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-05",
            "headline": "Auto Link appoints Stephen Riley as GM for growth and strategic initiatives. 25-year industry veteran. Leading auto-lending solutions provider.",
            "id": "f5a824ae-d14b-4343-8c6d-552c69471b37",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "Stephen Riley has been appointed as the General Manager of Sales, Technology, and Operations at Auto Link, a prominent auto-lending solutions provider for financial institutions based in HARAHAN, La. Effective February 5, 2025, Riley will spearhead growth and strategic plans for the company.",
            "tickers": [
                "NDXP"
            ],
            "time": "13:44:56",
            "timestamp": "2025-02-05T13:44:56Z",
            "url": "https://www.prnewswire.com/news-releases/auto-link-taps-25-year-industry-veteran-to-lead-growth-and-strategic-initiatives-302368423.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-05",
            "headline": "Engaged Golf in Pinehurst, NC introduces program for those with dementia who enjoy the game.",
            "id": "1b0ea2f7-1ad1-4cd6-abc6-b6a4e6cb7009",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "In Pinehurst, North Carolina on February 5, 2025, it is not unusual to hear the exclaimed warning \"Fore!\" on the numerous golf courses spread across Moore County as golfers attempt to steer their shots towards the fairway. Just like an errant golf shot, dementia, which is essentially a form of brain change, can also veer individuals off course. In some cases, this condition could lead to significant loss...",
            "tickers": [
                "NDXP"
            ],
            "time": "13:44:54",
            "timestamp": "2025-02-05T13:44:54Z",
            "url": "https://www.prnewswire.com/news-releases/engaged-golf-tees-up-program-for-those-living-with-dementia-who-still-love-the-game-302368440.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-05",
            "headline": "YMX Logistics Executives named among top 2025 Rock Stars of the Supply Chain by Food Logistics. Henderson, NV.",
            "id": "4ffcae30-ef26-4ff4-93ce-53fdb19e67e3",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "Henderson, Nevada - On February 5, 2025, Matt Yearling and Erin Mitchell were acknowledged for their exceptional leadership skills in enhancing yard logistics for large-scale shippers. The recognition was awarded by Food Logistics, a prominent publication focused on the transportation of goods in the international cold food supply chain. This recognition is a testament to their pioneering work in this field and highlights their dedication to improving operational efficiency in the industry.",
            "tickers": [
                "NDXP"
            ],
            "time": "13:44:51",
            "timestamp": "2025-02-05T13:44:51Z",
            "url": "https://www.prnewswire.com/news-releases/food-logistics-names-ymx-logistics-executives-among-2025-rock-stars-of-the-supply-chain-302368426.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-05",
            "headline": "Cutting Edge Health partners with Limitless Guided Visualizations for neuroscience-based patient care.",
            "id": "897870df-ecbe-43a8-bf06-fb277db98b64",
            "is_major": true,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "Elkhart, Indiana - On February 5, 2025, Cutting Edge Health, headed by Orlando A. Landrum, MD, MBA, known for their advanced interventional neuroscience techniques, revealed a significant collaboration with Limitless Guided Visualizations. This partnership aims to combine Cutting Edge Health's expertise with Limitless Guided Visualizations' mental wellness app to provide innovative solutions.",
            "tickers": [
                "NDXP"
            ],
            "time": "13:44:50",
            "timestamp": "2025-02-05T13:44:50Z",
            "url": "https://www.prnewswire.com/news-releases/a-new-era-in-neuroscience-informed-patient-care-cutting-edge-health-partners-with-limitless-guided-visualizations-302368455.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-05",
            "headline": "US patent granted for repurposed malaria drug by Armaceutica, Inc. for cancer treatment. By Renato Aguilera, Ph.D.",
            "id": "3b74f32c-143a-4d9d-b92c-654bd5dd55c7",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "In El Paso, Texas on February 5th, 2025, a US patent was issued for a groundbreaking drug titled \"Bifunctional Compositions for the Treatment of Cancer\". This medication, originally intended for malaria treatment, is being repurposed by Armaceutica, Inc. to combat different forms of cancer. Renato Aguilera, Ph.D., a prominent figure in biology and research, is leading the developments in this innovative approach.",
            "tickers": [
                "NDXP"
            ],
            "time": "13:44:47",
            "timestamp": "2025-02-05T13:44:47Z",
            "url": "https://www.prnewswire.com/news-releases/us-patent-granted-titled-bifunctional-compositions-for-the-treatment-of-cancer-302368432.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-05",
            "headline": "AITX sees an increase in SLED market with multiple ROSA orders, boosting growth further.",
            "id": "8572c1aa-2b7a-4376-8602-e40d9c20b63c",
            "is_major": false,
            "source": "GlobeNewswire",
            "source_type": "news",
            "summary": null,
            "tickers": [],
            "time": "13:42:41",
            "timestamp": "2025-02-05T13:42:41Z",
            "url": "https://www.globenewswire.com/news-release/2025/02/05/3021205/0/en/AITX-s-RAD-Continues-SLED-Market-Growth-with-Multiple-ROSA-Orders.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-05",
            "headline": "REPAY integrates with Lightspeed DMS, expanding beyond auto industry, offering payment automation to retailers. (Words: 23)",
            "id": "373f5e89-cc7b-4740-9c4d-93bc03831b95",
            "is_major": false,
            "source": "Business Wire",
            "source_type": "news",
            "summary": "Repay Holdings Corporation (NASDAQ: RPAY) has revealed a recent partnership with Lightspeed DMS, a top recreational dealer management software provider. This move signifies REPAY's initial venture outside the automotive sector, providing payment automation services to a broader array of retailers and dealerships. This integration is expected to enhance revenue generation and productivity for various businesses.",
            "tickers": [
                "NDXP",
                "RPAY"
            ],
            "time": "13:42:02",
            "timestamp": "2025-02-05T13:42:02Z",
            "url": "http://www.businesswire.com/news/home/20250205638392/en/REPAY-Optimizes-Vendor-Payments-for-Recreational-Vehicle-Dealerships-with-Lightspeed-DMS-Integration/?feedref=JjAwJuNHiystnCoBq_hl-Q-tiwWZwkcswR1UZtV7eGe24xL9TZOyQUMS3J72mJlQ7fxFuNFTHSunhvli30RlBNXya2izy9YOgHlBiZQk2LOzmn6JePCpHPCiYGaEx4DL1Rq8pNwkf3AarimpDzQGuQ=="
        },
        {
            "beta_headline": null,
            "category": "crypto",
            "date": "2025-02-05",
            "headline": "Bullish Global, backed by Peter Thiel, considers IPO in 2025 amid crypto market boom. Company manages $10B.",
            "id": "3f064aa9-e7fa-406c-9858-c7cc2169f38b",
            "is_major": true,
            "source": "Benzinga",
            "source_type": "news",
            "summary": "Following a surge in the cryptocurrency market, reports suggest that crypto exchange Bullish Global is considering an initial public offering (IPO) in 2025. The subsidiary of Block.one is potentially partnering with Jefferies Financial Group for the IPO. Bullish Global, headed by CEO Tom Farley, has a workforce of over 275 employees worldwide and operates in Hong Kong, the U.S., and Europe. Its parent company, Block.one, led by Brendan Blumer and supported by Peter Thiel, Alan Howard, and Richard Li, was established in 2021. Bullish Global currently manages around $10 billion in assets.",
            "tickers": [
                "IPO"
            ],
            "time": "13:41:51",
            "timestamp": "2025-02-05T13:41:51Z",
            "url": "https://www.benzinga.com/25/02/43493995/bullish-global-backed-by-peter-thiel-mulls-over-ipo-in-2025-amid-crypto-market-boom"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-05",
            "headline": "Robert Seidel steps down as CEO after 12 years at Alerion Aviation, to take on role as Chairman. Daniel Ramirez to succeed.",
            "id": "8b16c5cd-426b-44d2-bf56-381125eef135",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "In West Palm Beach, Florida, on February 5, 2025, Alerion Aviation revealed that Robert Seidel will be resigning from his role as Chief Executive Officer following a successful twelve-year tenure. His position will be assumed by Daniel Ramirez. Seidel played a vital role in driving the company's expansion and success during his time as CEO.",
            "tickers": [
                "WEST",
                "NDXP"
            ],
            "time": "13:40:44",
            "timestamp": "2025-02-05T13:40:44Z",
            "url": "https://www.prnewswire.com/news-releases/robert-seidel-ceo-of-alerion-aviation-takes-on-new-role-as-chairman-302368866.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-05",
            "headline": "\"Christmas Tree of Kindness debuting at 2025 NYC Toy Fair, inspiring kindness with storybook, craft activity, app #ToyFairLife\"",
            "id": "467ec142-6731-421f-a123-edcb75018446",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "Christmas Tree of Kindness, Inc. will be featured at the 2025 NYC Toy Fair from March 1-4 at the Javitz Center. The event, #ToyFairLife, will be held in New York City.",
            "tickers": [
                "NDXP"
            ],
            "time": "13:40:43",
            "timestamp": "2025-02-05T13:40:43Z",
            "url": "https://www.prnewswire.com/news-releases/this-new-christmas-tradition-entertains-and-inspires-kindness-with-a-beautiful-storybook-craft-activity-and-interactive-app-and-may-make-santa-so-happy-that-he-brings-you-milk-and-cookies-this-year-302368802.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-05",
            "headline": "ACR Poker introduces Team Online Championships Home Game on Feb 6 to play with members and win cash.",
            "id": "1cf995a4-269c-44cc-b2ef-e18779b38bc7",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "Join in weekly games with members of the popular ACR Team Online for a chance to secure a spot in a special cash game with them. The exciting initiative by ACR Poker gives players the chance to compete against their favorite team members regularly. This opportunity comes as the company kicks off the program on February 5, 2025, in San Jose, Costa Rica. Join now to play with the ACR Team Online and win your way into an exclusive cash game with them.",
            "tickers": [
                "NDXP"
            ],
            "time": "13:40:41",
            "timestamp": "2025-02-05T13:40:41Z",
            "url": "https://www.prnewswire.com/news-releases/acr-poker-announces-team-online-championships-home-game-starting-thursday-february-6th-302368446.html"
        },
        {
            "beta_headline": null,
            "category": "crypto",
            "date": "2025-02-05",
            "headline": "León Y Sol Tequila partners with Bay Area's Back of the House, Inc., in a move to boost presence in hospitality.",
            "id": "1ae71f0e-0685-4f5c-85d5-8362c76564ec",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "On February 5, 2025, in San Francisco, León Y Sol Tequila, a rapidly growing brand in the premium tequila market, announced a significant collaboration in the Bay Area's hospitality industry. The company is joining forces with Back of the House, Inc., a renowned restaurant group known for operating several highly popular dining establishments in the region. This strategic partnership is poised to bring innovative experiences to consumers in the area and further bolster the presence of both entities in the market.",
            "tickers": [
                "SAN",
                "NDXP"
            ],
            "time": "13:40:39",
            "timestamp": "2025-02-05T13:40:39Z",
            "url": "https://www.prnewswire.com/news-releases/leon-y-sol-tequila-joins-forces-with-bay-area-hospitality-powerhouse-back-of-the-house-inc-302368398.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-05",
            "headline": "Porte Brown wins Client Service Excellence Award for fourth year. This Chicagoland firm offers accounting, audit, tax, tech, and wealth services.",
            "id": "7e9527bb-51cd-4290-a9aa-44f54b7176e4",
            "is_major": true,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "Today, Elk Grove Village, Illinois-based firm Porte Brown LLC, known for offering a wide range of services including accounting, audit, tax, technology, and wealth management, has been awarded the prestigious Best of Accounting Award. This award signifies their excellence in delivering top-notch services to their clients. Established in 2025, Porte Brown LLC has quickly become a renowned name in the Chicagoland area. More information about their services can be found on their website www.portebrown.com.",
            "tickers": [
                "NDXP"
            ],
            "time": "13:40:37",
            "timestamp": "2025-02-05T13:40:37Z",
            "url": "https://www.prnewswire.com/news-releases/porte-brown-receives-client-service-excellence-award-for-fourth-consecutive-year-302368404.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-05",
            "headline": "Tortally Therapeutics, LLC in Md redefining mental health care with client-centered approach since June 2023.",
            "id": "d26555af-91bf-407e-a51a-51a59be7c5f5",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "In Glen Burnie, Maryland on February 5, 2025, Tortally Therapeutics, LLC, a Maryland-based psychotherapy and counseling practice, has shared its dedication to providing client-focused mental health services amidst a competitive landscape. Established in June 2023, the practice aims to offer unique services to its clients.",
            "tickers": [
                "NDXP"
            ],
            "time": "13:40:35",
            "timestamp": "2025-02-05T13:40:35Z",
            "url": "https://www.prnewswire.com/news-releases/tortally-therapeutics-llc-redefining-mental-health-care-inspired-by-tortoise-symbolism-302368439.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-05",
            "headline": "National Hardware Show in Las Vegas introduces NHS Influencer Summit for exclusive access, immersive experiences, and networking. Feb. 5, 2025.",
            "id": "ac688c88-90d2-4808-bbee-46d7b2c27375",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "Announcing The NHS Influencer Summit: Offering Unique Access, Engaging Experiences, and Genuine Networking Opportunities LAS VEGAS, February 5, 2025 - The National Hardware Show (NHS) is excited to introduce The NHS Influencer Summit. This exclusive event caters to the home improvement and hardware sector, bringing together industry professionals for a one-of-a-kind experience. Expect immersive activities, valuable networking connections, and insider access to cutting-edge trends.",
            "tickers": [
                "NDXP"
            ],
            "time": "13:40:33",
            "timestamp": "2025-02-05T13:40:33Z",
            "url": "https://www.prnewswire.com/news-releases/national-hardware-show-announces-new-influencer-event-that-will-unite-the-industry-at-its-annual-trade-show-in-las-vegas-302368417.html"
        },
        {
            "beta_headline": null,
            "category": "crypto",
            "date": "2025-02-05",
            "headline": "NettyWorth launches NettyScore, a Web3 credit score, for decentralized lending. Revolutionizing loan protocols with AI.",
            "id": "fccb231b-be6a-478b-95a7-d2b875e5ca1f",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "In San Francisco on February 5, 2025, NettyWorth, a platform utilizing artificial intelligence for loans secured by NFTs and Real-World Assets (RWAs), has unveiled NettyScore. This new feature is a cutting-edge credit assessment system implemented within the Web3 framework. It reviews borrowers' loan activities on blockchain, such as repayments, to evaluate creditworthiness in a decentralized manner.",
            "tickers": [
                "NDXP"
            ],
            "time": "13:40:31",
            "timestamp": "2025-02-05T13:40:31Z",
            "url": "https://www.prnewswire.com/news-releases/nettyworth-introduces-web3-credit-score-technology-to-revolutionize-decentralized-lending-302368401.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-05",
            "headline": "NFL Hall of Famer Jerome Bettis partners with CDC Foundation to raise awareness on hypertension's impact on Black adults, a leading cause of cardiovascular deaths.",
            "id": "999f8ae2-5271-4696-b0e4-31731314ffb9",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "In recent news from Atlanta on February 5, 2025, the Centers for Disease Control and Prevention (CDC) revealed that uncontrolled hypertension stands out as a top reason behind cardiovascular disease-related fatalities. Shockingly, a significant number of individuals remain unaware of their elevated blood pressure levels due to the condition often being asymptomatic. This highlights the urgent need for greater awareness and proactive health monitoring to combat this prevalent issue.",
            "tickers": [
                "CDC",
                "NDXP"
            ],
            "time": "13:38:27",
            "timestamp": "2025-02-05T13:38:27Z",
            "url": "https://www.prnewswire.com/news-releases/nfl-hall-of-famer-jerome-bettis-shares-his-personal-story-to-help-the-cdc-foundations-live-to-the-beat-campaign-reveal-hypertensions-silent-deadly-toll-on-black-adults-302368309.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-05",
            "headline": "Nordic wins 2025 Best in KLAS award for Clinical Optimization marking its 15th anniversary.",
            "id": "181708fb-7b7a-4935-b83b-8959b4140400",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "In Madison, Wisconsin on February 5, 2025, Nordic®, an international consulting company specializing in health and technology, was recognized with a Best in KLAS award for Clinical Optimization in the latest 2025 Best in KLAS Awards - Software and Services report. This prestigious designation is based on feedback collected from customers and stakeholders in the industry. The report highlights Nordic®'s top-ranking performance in the field of Clinical Optimization, solidifying its position as a leader in the industry for offering outstanding services.",
            "tickers": [
                "NDXP"
            ],
            "time": "13:38:24",
            "timestamp": "2025-02-05T13:38:24Z",
            "url": "https://www.prnewswire.com/news-releases/nordic-wins-2025-best-in-klas-award-for-clinical-optimization-as-firm-celebrates-its-15th-anniversary-302368863.html"
        },
        {
            "beta_headline": null,
            "category": "commodities",
            "date": "2025-02-05",
            "headline": "Leverage with Media PR appoints Kayce Brown as Head of Strategic Partnerships & Brand Integrations. #PRNewswire #NewYork",
            "id": "17ad466b-0856-44f2-8472-b6a51cd0ba9d",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "On February 5, 2025, in New York City, Leverage with Media PR, a leading agency with top clients like Olympic gold medalist Kurt Angle and biohacker Dave Asprey, has appointed Kayce Brown as the new Head of Strategic Partnerships and Brand.",
            "tickers": [
                "NDXP"
            ],
            "time": "13:38:22",
            "timestamp": "2025-02-05T13:38:22Z",
            "url": "https://www.prnewswire.com/news-releases/leverage-with-media-pr-welcomes-kayce-brown-as-head-of-strategic-partnerships-and-brand-integrations-302368405.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-05",
            "headline": "Oral care brand quip launches professional grade sonic toothbrush: quip Ultra Next Generation Smart Sonic Toothbrush.",
            "id": "8487f69a-73b1-492f-a073-eace205b8cbe",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "Introducing the groundbreaking quip Ultra Next Generation Smart Sonic Toothbrush, unveiled in New York on February 5, 2025. Created by the design-led oral wellness company, quip, this innovative product boasts cutting-edge features for improved dental care. This smart toothbrush combines advanced technology with sleek design, promising a new level of oral hygiene. Stay tuned for more details on this revolutionary device.",
            "tickers": [
                "NDXP"
            ],
            "time": "13:38:20",
            "timestamp": "2025-02-05T13:38:20Z",
            "url": "https://www.prnewswire.com/news-releases/quip-revolutionizes-oral-care-with-launch-of-ultra-its-first-professional-grade-sonic-toothbrush-302368200.html"
        },
        {
            "beta_headline": null,
            "category": "crypto",
            "date": "2025-02-05",
            "headline": "Bitcoin expected to reach $500,000 before Trump's exit, says Standard Chartered, nearing gold's market cap.",
            "id": "bf674cbc-6ebe-44c0-b349-9fc5882f9e3c",
            "is_major": true,
            "source": "Decrypt",
            "source_type": "news",
            "summary": "Standard Chartered anticipates that under the leadership of Donald Trump, the value of Bitcoin will surge to $500,000, potentially nearing the market capitalization of gold.",
            "tickers": [],
            "time": "13:38:04",
            "timestamp": "2025-02-05T13:38:04Z",
            "url": "https://decrypt.co/304527/bitcoin-price-500000-before-trump-leaves-office"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-05",
            "headline": "IMAX breaks record with $53M in Chinese New Year box office, exceeding previous record by 57% with 5.5M admissions.",
            "id": "87f95c9b-c35b-4ef2-929c-8337d1a5a141",
            "is_major": false,
            "source": "Business Wire",
            "source_type": "news",
            "summary": "IMAX Corporation (NYSE: IMAX) has broken its box office record for Chinese New Year, generating an impressive $53 million in revenue over the 7-day holiday period ending on February 4. The 2025 Chinese New Year holiday marked the peak moviegoing period in China, with IMAX surpassing its previous record of $34 million set in 2023 by an impressive 57%. Additionally, IMAX achieved its highest-ever attendance for Chinese New Year, recording 5.5 million admissions across the country. This success underscores IMAX's significant growth and popularity within the Chinese market during key festive seasons.",
            "tickers": [
                "NDXP",
                "IMAX"
            ],
            "time": "13:36:58",
            "timestamp": "2025-02-05T13:36:58Z",
            "url": "http://www.businesswire.com/news/home/20250205632324/en/IMAX-Soars-to-Highest-Grossing-Chinese-New-Year-Ever-with-53-Million/?feedref=JjAwJuNHiystnCoBq_hl-Q-tiwWZwkcswR1UZtV7eGe24xL9TZOyQUMS3J72mJlQ7fxFuNFTHSunhvli30RlBNXya2izy9YOgHlBiZQk2LOzmn6JePCpHPCiYGaEx4DL1Rq8pNwkf3AarimpDzQGuQ=="
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-05",
            "headline": "Riverbed launches Smart OTel, a game changer in OpenTelemetry integration, promising advancements in data monitoring.",
            "id": "184b0722-a7f1-451e-a1f2-76ed2abd9b2f",
            "is_major": false,
            "source": "Business Wire",
            "source_type": "news",
            "summary": "Riverbed, headquartered in Redwood City, California, has recently introduced Smart OTel, a revolutionary development in the field of OpenTelemetry. This innovation is set to transform the way data is collected and analyzed, ushering in a new era of efficiency and effectiveness.",
            "tickers": [
                "NDXP"
            ],
            "time": "13:36:56",
            "timestamp": "2025-02-05T13:36:56Z",
            "url": "http://www.businesswire.com/news/home/20250205620625/en/Riverbed-Launches-Smart-OTel-a-Game-Changer-in-OpenTelemetry/?feedref=JjAwJuNHiystnCoBq_hl-Q-tiwWZwkcswR1UZtV7eGe24xL9TZOyQUMS3J72mJlQ7fxFuNFTHSunhvli30RlBNXya2izy9YOgHlBiZQk2LOzmn6JePCpHPCiYGaEx4DL1Rq8pNwkf3AarimpDzQGuQ=="
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-05",
            "headline": "Actelis Networks appoints Dr. Niel Ransom to Board of Directors amidst infrastructure defense demand surge. #ASNS",
            "id": "0a7f77e4-b65f-42c1-8033-0c5c7181caa5",
            "is_major": false,
            "source": "Business Wire",
            "source_type": "news",
            "summary": "In a recent announcement, Actelis Networks* (NASDAQ: ASNS) has named Dr. Niel Ransom to its Board of Directors. With a wealth of experience spanning nearly 50 years in networking, cybersecurity, and deep-tech investment, Ransom's appointment brings valuable expertise to the company. This move comes as Actelis witnesses a growing demand for secure and high-performance networks. The appointment closely follows Actelis' introduction of MetaShield, an AI-driven cybersecurity product aimed at safeguarding critical networks.",
            "tickers": [
                "NWSA",
                "NDXP",
                "ASNS"
            ],
            "time": "13:36:54",
            "timestamp": "2025-02-05T13:36:54Z",
            "url": "http://www.businesswire.com/news/home/20250205470259/en/Market-News-Alerts-Reports-Actelis-Adds-Key-Industry-Leader-Amidst-Surging-Infrastructure-Defense-Demand-Geopolitical-Tailwinds/?feedref=JjAwJuNHiystnCoBq_hl-Q-tiwWZwkcswR1UZtV7eGe24xL9TZOyQUMS3J72mJlQ7fxFuNFTHSunhvli30RlBNXya2izy9YOgHlBiZQk2LOzmn6JePCpHPCiYGaEx4DL1Rq8pNwkf3AarimpDzQGuQ=="
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-05",
            "headline": "Cantaloupe, Inc. partners with Fundbox to create Cantaloupe Capital, providing small business financing for equipment and cash flow.",
            "id": "34c84e10-2695-4914-a450-2c26d7e39fde",
            "is_major": false,
            "source": "Business Wire",
            "source_type": "news",
            "summary": "A collaboration between Cantaloupe, Inc. and Fundbox has led to the launch of Cantaloupe Capital, a financing platform focused on supporting small businesses with equipment and cash flow needs. The platform aims to provide crucial financial assistance to small businesses by offering them access to funding. This collaboration is part of Cantaloupe, Inc.'s strategic efforts to cater to the financial requirements of small businesses.",
            "tickers": [
                "CTLP",
                "NDXP"
            ],
            "time": "13:36:52",
            "timestamp": "2025-02-05T13:36:52Z",
            "url": "http://www.businesswire.com/news/home/20250205421401/en/Cantaloupe-Inc.-Collaborates-with-Fundbox-to-Launch-Cantaloupe-Capital-Making-Small-Business-Financing-Available-for-Self-Service-Operators/?feedref=JjAwJuNHiystnCoBq_hl-Q-tiwWZwkcswR1UZtV7eGe24xL9TZOyQUMS3J72mJlQ7fxFuNFTHSunhvli30RlBNXya2izy9YOgHlBiZQk2LOzmn6JePCpHPCiYGaEx4DL1Rq8pNwkf3AarimpDzQGuQ=="
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-05",
            "headline": "Provana strengthens dispute solutions by acquiring Palinode, enhancing credit dispute management for financial institutions.",
            "id": "681f6a09-3acf-4b5b-bc8f-420128ccf65c",
            "is_major": true,
            "source": "Business Wire",
            "source_type": "news",
            "summary": "In Lisle, Illinois, Provana, a prominent provider of tech-enabled services for financial and receivables management, has revealed the acquisition of Palinode, a renowned leader in credit dispute management solutions for financial institutions. This acquisition aims to bolster credit dispute investigation and resolution capabilities, ultimately providing great value to customers. The acquisition brings in Palinode's Sonnet product, identified as a robust solution that aligns perfectly with Provana's core mission. This strategic move is set to improve services for clients and expand the prowess of Provana in the sector.",
            "tickers": [
                "NDXP"
            ],
            "time": "13:36:50",
            "timestamp": "2025-02-05T13:36:50Z",
            "url": "http://www.businesswire.com/news/home/20250205372163/en/Provana-Acquires-Palinode-Further-Strengthening-Dispute-Solutions-for-Financial-Institutions/?feedref=JjAwJuNHiystnCoBq_hl-Q-tiwWZwkcswR1UZtV7eGe24xL9TZOyQUMS3J72mJlQ7fxFuNFTHSunhvli30RlBNXya2izy9YOgHlBiZQk2LOzmn6JePCpHPCiYGaEx4DL1Rq8pNwkf3AarimpDzQGuQ=="
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-05",
            "headline": "Inovalon's Pharmacy Surveillance Software wins Best in KLAS for 8th year, highlighting its role in patient safety.",
            "id": "dc15a94d-2008-4b26-949f-aa83b694191c",
            "is_major": false,
            "source": "Business Wire",
            "source_type": "news",
            "summary": "Software from Inovalon has been awarded Best In KLAS for the 8th consecutive year in Bowie, Maryland. The Pharmacy Surveillance Software is recognized for its role in ensuring patient safety.",
            "tickers": [
                "NDXP"
            ],
            "time": "13:36:49",
            "timestamp": "2025-02-05T13:36:49Z",
            "url": "http://www.businesswire.com/news/home/20250205161077/en/Inovalon%E2%80%99s-Pharmacy-Surveillance-Software-Achieves-Best-in-KLAS-For-Eight-Years-in-a-Row/?feedref=JjAwJuNHiystnCoBq_hl-Q-tiwWZwkcswR1UZtV7eGe24xL9TZOyQUMS3J72mJlQ7fxFuNFTHSunhvli30RlBNXya2izy9YOgHlBiZQk2LOzmn6JePCpHPCiYGaEx4DL1Rq8pNwkf3AarimpDzQGuQ=="
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-05",
            "headline": "Wedbush Securities introduces Real-Time Automated Locate Service for easy-to-borrow and hard-to-borrow securities. Great news for brokers.",
            "id": "cc61288e-b114-4266-aed7-a8b255007c68",
            "is_major": true,
            "source": "Business Wire",
            "source_type": "news",
            "summary": "Los Angeles-based Wedbush Securities, a top financial services and investment company, has introduced a new service for quick and effective access to easy-to-borrow and hard-to-borrow securities. This initiative aims to streamline the short-selling process for clients, providing a comprehensive solution for broker-dealer correspondents to enhance their operations. The state-of-the-art automated locate system by Wedbush promises efficiency and support for correspondents conducting short-selling activities.",
            "tickers": [
                "NDXP"
            ],
            "time": "13:36:47",
            "timestamp": "2025-02-05T13:36:47Z",
            "url": "http://www.businesswire.com/news/home/20250205823555/en/Wedbush-Securities-Announces-the-Launch-of-Real-Time-Automated-Locate-Service/?feedref=JjAwJuNHiystnCoBq_hl-Q-tiwWZwkcswR1UZtV7eGe24xL9TZOyQUMS3J72mJlQ7fxFuNFTHSunhvli30RlBNXya2izy9YOgHlBiZQk2LOzmn6JePCpHPCiYGaEx4DL1Rq8pNwkf3AarimpDzQGuQ=="
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-05",
            "headline": "Financial firms optimistic about growth, plan to increase software budgets; 70% regret recent tech purchase. ",
            "id": "5895ecaa-30a2-40a4-8e8c-725ac4b29a7b",
            "is_major": false,
            "source": "Business Wire",
            "source_type": "news",
            "summary": "A recent study by Capterra in Arlington, Virginia revealed that a majority of financial companies are looking to boost their software budgets in the near future. However, the research also indicated that 70% of these firms have experienced remorse over a recent technology acquisition.",
            "tickers": [
                "NDXP"
            ],
            "time": "13:36:45",
            "timestamp": "2025-02-05T13:36:45Z",
            "url": "http://www.businesswire.com/news/home/20250205784996/en/Financial-Organizations-Optimistic-About-Growth-But-Are-Stunted-By-Poor-Software-Investments/?feedref=JjAwJuNHiystnCoBq_hl-Q-tiwWZwkcswR1UZtV7eGe24xL9TZOyQUMS3J72mJlQ7fxFuNFTHSunhvli30RlBNXya2izy9YOgHlBiZQk2LOzmn6JePCpHPCiYGaEx4DL1Rq8pNwkf3AarimpDzQGuQ=="
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-05",
            "headline": "Trade tensions could impact Apple as Beijing considers investigating the iPhone maker amid President Trump's tariff threat.",
            "id": "733dfb71-6d4e-4061-8e16-8284ee43e75f",
            "is_major": false,
            "source": "NYT",
            "source_type": "news",
            "summary": "Reports indicate that Beijing is considering launching an investigation into the company responsible for producing the iPhone, highlighting China's potential strategies in response to President Trump's tariff warning. This move reflects the increasing tensions between the two nations, as China evaluates its options amid the trade dispute.",
            "tickers": [
                "AAPL",
                "NWSA"
            ],
            "time": "13:36:44",
            "timestamp": "2025-02-05T13:36:44Z",
            "url": "https://www.nytimes.com/2025/02/05/business/dealbook/apple-trump-china-trade-tariffs.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-05",
            "headline": "Qlik Connect 2025 focuses on AI certification and real results, highlighting modern data strategies and automation.",
            "id": "8e4159f2-87a2-4c21-87b7-f74fee7f042f",
            "is_major": false,
            "source": "Business Wire",
            "source_type": "news",
            "summary": "In Philadelphia, Qlik revealed significant details for Qlik Connect 2025, highlighting key themes such as modern data strategies, AI integration, and automation. The event aims to address vital industry topics and trends to shape the future of data analytics.",
            "tickers": [
                "NDXP"
            ],
            "time": "13:36:43",
            "timestamp": "2025-02-05T13:36:43Z",
            "url": "http://www.businesswire.com/news/home/20250205752721/en/Qlik-Connect-2025-Turns-Ambition-Into-Action-With-New-AI-Certification-and-Breakouts-Focused-on-Real-Results/?feedref=JjAwJuNHiystnCoBq_hl-Q-tiwWZwkcswR1UZtV7eGe24xL9TZOyQUMS3J72mJlQ7fxFuNFTHSunhvli30RlBNXya2izy9YOgHlBiZQk2LOzmn6JePCpHPCiYGaEx4DL1Rq8pNwkf3AarimpDzQGuQ=="
        }
    ]
}
