{
    "news": [
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Empower, a leader in compounding pharmacy, announces new logo, signaling evolution in advancement.",
            "id": "649bda1e-0625-44b7-8616-9ef032782bc1",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "On February 4, 2025, in Houston, Empower, a prominent company in the compounding pharmacy and pharmaceutical manufacturing sectors, unveiled its updated corporate logo. This launch symbolizes a pivotal moment in the company's growth towards a more cohesive and progressive direction.",
            "tickers": [
                "NDXP"
            ],
            "time": "20:51:50",
            "timestamp": "2025-02-04T20:51:50Z",
            "url": "https://www.prnewswire.com/news-releases/empower-enters-a-new-era-of-advancement-and-partnerships-302367979.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "DISA Global Solutions buys American DataBank, forming healthcare tech division on Feb. 4, 2025.",
            "id": "294b788f-f618-47f4-b948-78dba2bbe4f8",
            "is_major": true,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "On February 4, 2025, in Houston, DISA Global Solutions announced the acquisition of American DataBank (ADB), a company specializing in immunization, compliance, and clinical rotation tracking solutions. DISA Global Solutions is a prominent provider of workplace compliance management and employee screening services. This acquisition strengthens DISA's position in the industry and expands its range of services.",
            "tickers": [
                "NDXP"
            ],
            "time": "20:49:47",
            "timestamp": "2025-02-04T20:49:47Z",
            "url": "https://www.prnewswire.com/news-releases/disa-global-solutions-acquires-american-databank-launches-healthcare-technology-division-302368032.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Latest news and analysis on Alphabet (GOOGL) stock from Investor's Business Daily. Stay updated on Google's parent company.",
            "id": "11d90b77-c4e7-4ec0-871e-3d23d0243275",
            "is_major": false,
            "source": "Investors.com",
            "source_type": "news",
            "summary": "Read about the most recent updates concerning Alphabet, the parent company of Google, including stock quotes, company news, and a chart analysis of the search giant's performance. Explore more in-depth insights and analysis of Alphabet's stock on Investor's Business Daily.",
            "tickers": [
                "GOOGL",
                "NWSA"
            ],
            "time": "20:49:12",
            "timestamp": "2025-02-04T20:49:12Z",
            "url": "https://www.investors.com/news/technology/alphabet-googl-stock-quotes-company-news-google-stock-chart-analysis/"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Uber's stock is rallying in 2025 after a rough year. Q4 earnings reported early Wed; focus on robotaxi debate.",
            "id": "8c9aa4f8-429c-4bfc-9436-72bcc69393f2",
            "is_major": false,
            "source": "Investors.com",
            "source_type": "news",
            "summary": "Uber's stock has shown promising performance at the beginning of 2025 following a decline in the previous year. The ride-hailing company is set to announce its fourth-quarter results on Wednesday. The upcoming earnings report is anticipated to be crucial for Uber as it strives to regain momentum amid ongoing discussions about the adoption of robotaxis. This information was reported by Investor's Business Daily.",
            "tickers": [
                "UBER"
            ],
            "time": "20:49:10",
            "timestamp": "2025-02-04T20:49:10Z",
            "url": "https://www.investors.com/news/technology/uber-stock-q4-2024-earnings-results-uber-news-robotaxi/"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Viavi Solutions stock's RS Rating rises to 91, reflecting elite 90-plus level, as per Investor's Business Daily.",
            "id": "416cd627-7e53-46cc-9d07-822c942885d9",
            "is_major": false,
            "source": "Investors.com",
            "source_type": "news",
            "summary": "Viavi Solutions has achieved a significant milestone as its Relative Strength Rating has surged to an exceptional level of 91. This impressive accomplishment highlights the company's strong performance compared to its peers. This news demonstrates Viavi Solutions’ continued success and solidifies its position within the industry.",
            "tickers": [],
            "time": "20:49:09",
            "timestamp": "2025-02-04T20:49:09Z",
            "url": "https://www.investors.com/news/technology/viavi-solutions-stocks-scores-rs-rating-jump-to-91/"
        },
        {
            "beta_headline": null,
            "category": "crypto",
            "date": "2025-02-04",
            "headline": "Newly appointed 'Crypto Czar' David Sacks forms committee to regulate digital assets, will prioritize evaluating a potential Bitcoin reserve.",
            "id": "15c49d6d-44f1-408d-8892-26d8b6b917c3",
            "is_major": false,
            "source": "Benzinga",
            "source_type": "news",
            "summary": "President Trump's newly appointed \"Crypto Czar,\" David Sacks, has announced the creation of a bipartisan, bicameral committee to develop a regulatory framework for the digital asset industry. One of the committee's initial tasks will be to assess the possibility of a Bitcoin reserve. Sacks emphasized the need to keep value creation within the U.S., highlighting that regulatory uncertainties have pushed crypto innovation offshore. To combat this trend, the committee aims to provide clear guidance and support for crypto founders in the U.S. The full story is available on Benzinga.com.",
            "tickers": [
                "BTC"
            ],
            "time": "20:48:17",
            "timestamp": "2025-02-04T20:48:17Z",
            "url": "https://www.benzinga.com/markets/cryptocurrency/25/02/43477333/crypto-czar-sacks-says-potential-bitcoin-reserve-to-be-one-of-crypto-committees-first-prio"
        },
        {
            "beta_headline": null,
            "category": "investing",
            "date": "2025-02-04",
            "headline": "BoC's Gov. Macklem to speak by video at the BIS Mexico event Thursday.",
            "id": "60101392-b3ba-4e0c-905e-a856ad06d2c8",
            "is_major": false,
            "source": "Tradex",
            "source_type": "news",
            "summary": null,
            "tickers": [
                "BIS"
            ],
            "time": "20:48:14",
            "timestamp": "2025-02-04T20:48:14Z",
            "url": null
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "21st Red, White & Snow event in Park City features 27 chefs and 31 wineries from Napa, Sonoma, and Willamette Valley to benefit National Ability Center.",
            "id": "2df6bf25-6b54-42fa-b6ca-8e9b02fbd42c",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "In Park City, Utah, the National Ability Center (NAC) is excited to announce the upcoming annual Red, White & Snow fundraising weekend, set to take place over four days. The event will showcase the talents of 27 chefs and offer tastings from 31 prestigious wineries hailing from Napa, Sonoma, and Willamette Valley. This gathering, scheduled for February 4, 2025, promises a delightful experience for attendees while supporting a great cause.",
            "tickers": [
                "NAC",
                "NDXP"
            ],
            "time": "20:47:45",
            "timestamp": "2025-02-04T20:47:45Z",
            "url": "https://www.prnewswire.com/news-releases/red-white--snow-park-citys-biggest-food--wine-festival-returns-for-its-21st-year-to-support-national-ability-center-302366244.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Italian Wine Travel and YouTube Channel Mamma Jumbo Shrimp explore Bordeaux in new series, unlocking 1855 Classification.",
            "id": "cf09318d-959e-4030-8c62-b5099023b012",
            "is_major": true,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "Stevie Kim's Italian Wine Travel, in partnership with Mamma Jumbo Shrimp YouTube Channel and Italian Wine Podcast, introduces its inaugural French wine series focusing on the renowned Bordeaux region. This exciting venture is set to commence with the first episode premiering on Feb. 4, 2025, from Verona, Italy. Stay tuned to explore the world of Bordeaux wines through this collaboration.",
            "tickers": [
                "NDXP"
            ],
            "time": "20:47:44",
            "timestamp": "2025-02-04T20:47:44Z",
            "url": "https://www.prnewswire.com/news-releases/unlocking-bordeaux-stevie-kim--bernard-burtschy-reveal-the-secrets-of-the-1855-classification-302367534.html"
        },
        {
            "beta_headline": null,
            "category": "news",
            "date": "2025-02-04",
            "headline": "BaseRock Partners advises sale of American Structural Concrete to ESOP. Exclusive financial advisor. Feb 4, 2025.",
            "id": "3950ab5d-18e7-4005-91ff-2e41df270ed1",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "BaseRock Partners has finalized the sale of American Structural Concrete (ASC) to an Employee Stock Ownership Plan (ESOP). Acting as the sole financial advisor for ASC, BaseRock Partners facilitated the transaction. The announcement was made in Denver on February 4, 2025.",
            "tickers": [],
            "time": "20:47:42",
            "timestamp": "2025-02-04T20:47:42Z",
            "url": "https://www.prnewswire.com/news-releases/baserock-partners-advises-american-structural-concrete-on-its-sale-to-an-esop-302366246.html"
        },
        {
            "beta_headline": null,
            "category": "news",
            "date": "2025-02-04",
            "headline": "ReconMR chosen by Gallup for US phone surveys, with 500 on-site CATI stations and 250 remote interviewers.",
            "id": "f8288423-de8a-4ff0-85e1-88c432e56e55",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "ReconMR has been chosen by Gallup as the data collection provider for U.S. phone surveys. This decision highlights ReconMR's proficiency in providing trustworthy survey data. They have 500 on-site CATI stations and 250 remote interviewers to assist Gallup in their telephone research utilizing strict RDD methodologies.",
            "tickers": [],
            "time": "20:47:41",
            "timestamp": "2025-02-04T20:47:41Z",
            "url": "https://www.prnewswire.com/news-releases/reconmr-named-data-collection-provider-for-gallups-us-phone-survey-work-302367540.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Pete Shelton appointed as Chief Revenue Officer at Fullcast, a leading GTM platform, aiming to accelerate growth.",
            "id": "25ae9529-18e6-4325-a12e-6c87851eafeb",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "A seasoned executive with experience at Domo, Simplus, and Adobe has recently joined Fullcast, a rapidly expanding revenue operations SaaS platform based in Salt Lake City, Utah. On February 4, 2025, Fullcast disclosed through PRNewswire-PRWeb that Pete Shelton will take on the role of Chief Revenue Officer. This move comes as Fullcast solidifies its position as a premier go-to-market (GTM) operations platform.",
            "tickers": [
                "ADBE",
                "NDXP"
            ],
            "time": "20:47:39",
            "timestamp": "2025-02-04T20:47:39Z",
            "url": "https://www.prnewswire.com/news-releases/fullcast-names-pete-shelton-as-chief-revenue-officer-to-drive-next-phase-of-growth-302367415.html"
        },
        {
            "beta_headline": null,
            "category": "economy",
            "date": "2025-02-04",
            "headline": "Brown & Brown Absence Services Group recognized by SSA as stand-alone Employment Network, aiding disabled individuals in Ticket to Work program.",
            "id": "d9233e59-da50-4577-9fe0-8d2ae9baddab",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "The Absence Services Group of Brown & Brown has achieved independent recognition from the Social Security Administration as an Employment Network. This designation enhances job placement and benefit counseling services for individuals with disabilities participating in the Ticket to Work program. By becoming a stand-alone EN, they can provide more tailored support to clients, ultimately empowering them to secure employment opportunities.",
            "tickers": [],
            "time": "20:47:37",
            "timestamp": "2025-02-04T20:47:37Z",
            "url": "https://www.prnewswire.com/news-releases/brown--brown-absence-services-group-llc-recognized-by-ssa-as-a-stand-alone-employment-network-guiding-clients-through-ssas-ticket-to-work-program-302366251.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Survey by ResumeTemplates.com: 3 in 10 companies planning a full 5-day in-office workweek this year due to corporate trends and government policies. #RemoteWork #WorkplaceTrends",
            "id": "e27e6748-da97-4162-ac82-dd242d517079",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "In Seattle on February 4, 2025, a study by ResumeTemplates.com analyzed corporate return-to-office trends. The survey, conducted in January 2025, highlighted the impact of corporate trends and government policies on the movement away from remote work practices. As per the findings, a significant shift in professional settings was observed. This data emphasizes the evolving work dynamics due to influences from both corporate strategies and governmental regulations.",
            "tickers": [
                "NDXP"
            ],
            "time": "20:47:35",
            "timestamp": "2025-02-04T20:47:35Z",
            "url": "https://www.prnewswire.com/news-releases/resumetemplatescom-survey-finds-3-in-10-companies-will-enforce-a-full-5-day-in-office-workweek-this-year-302365093.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Fierce Software Corp. gains GSA-MAS contract modification to provide MongoDB products for public sector clients.",
            "id": "0fdff0d4-153d-436c-8d80-9d26a05890b6",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "Recently, Fierce Software Corporation secured a GSA-MAS contract modification to provide MongoDB products in Herndon, Virginia. The contract was awarded on February 4, 2025. Fierce Software Corporation, known as FIERCE, specializes in offering Enterprise Open Source solutions to public sector clients. This development signifies a significant achievement for the company as it expands its product offerings in the government sector.",
            "tickers": [
                "NDXP"
            ],
            "time": "20:47:33",
            "timestamp": "2025-02-04T20:47:33Z",
            "url": "https://www.prnewswire.com/news-releases/fierce-software-achieves-gsa-modification-adding-mongodb-products-302367429.html"
        },
        {
            "beta_headline": null,
            "category": "news",
            "date": "2025-02-04",
            "headline": "Mortgage Calculator offers One-Time Close Construction Mortgages for financing construction and permanent costs with single loan.",
            "id": "bc95172b-4171-468e-92dd-03477fd7b22c",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "A new offering from The Mortgage Calculator allows borrowers to utilize One-Time Close Construction Mortgages, enabling them to fund both construction and permanent financing through a single loan. Homebuyers can use a construction mortgage calculator to gauge their expenses and monthly payments accurately. This service was recently introduced in MIAMI in February, providing individuals with a simplified approach to managing their finances for home building projects.",
            "tickers": [],
            "time": "20:47:32",
            "timestamp": "2025-02-04T20:47:32Z",
            "url": "https://www.prnewswire.com/news-releases/the-mortgage-calculator-simplifies-homebuilding-with-one-time-close-construction-mortgages-302366253.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Free newsletter gives aspiring authors a behind-the-scenes look at publishing journey with expert insights. Jonathan Matei leads with real-time updates.",
            "id": "1d52ad10-10d1-41f9-be8c-26df15ccfaec",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "Writers looking to break into the publishing industry can now access a complimentary behind-the-scenes view of the process, complete with guidance, resources, and live information from a seasoned author. Located in SURPRISE, Ariz., a significant development emerged on Feb. 4, 2025, as Jonathan Matei unveiled a unique opportunity for budding and established writers to gain firsthand insights...",
            "tickers": [
                "NDXP"
            ],
            "time": "20:47:30",
            "timestamp": "2025-02-04T20:47:30Z",
            "url": "https://www.prnewswire.com/news-releases/inside-the-publishing-journey-a-free-newsletter-giving-aspiring-authors-an-exclusive-behind-the-scenes-look-302365383.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Cybersecurity training provider SANS Institute joins ONE-ISAC as an Allied Partner, enhancing info-sharing. - 75 characters",
            "id": "59b69792-b98a-424f-b558-5a9dd4846e42",
            "is_major": true,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "The alliance of ONE-ISAC Allied Partners is enhancing cybersecurity by facilitating information-sharing opportunities. Recently, the SANS Institute joined as a trusted Allied Partner, strengthening the joint effort to advance cybersecurity. This partnership marks a significant step in collectively improving cybersecurity practices.",
            "tickers": [
                "NDXP"
            ],
            "time": "20:47:28",
            "timestamp": "2025-02-04T20:47:28Z",
            "url": "https://www.prnewswire.com/news-releases/leading-cybersecurity-training-provider-sans-institute-joins-one-isac-as-an-allied-partner-302367605.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "30th annual butterfly exhibition at Meijer Gardens with thousands of butterflies in Grand Rapids, Mich.",
            "id": "2848c23b-bd30-4925-9506-764f323660f4",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "The Lena Meijer Tropical Conservatory in Grand Rapids, Michigan is offering visitors the chance to witness thousands of tropical butterflies up close. The exhibit will feature new butterfly-themed elements for visitors to enjoy. Frederik Meijer Gardens & Sculpture Park made the announcement on February 4, 2025. This is a great opportunity for nature enthusiasts to experience the beauty of these magnificent creatures and appreciate the wonders of the natural world.",
            "tickers": [
                "NDXP"
            ],
            "time": "20:47:26",
            "timestamp": "2025-02-04T20:47:26Z",
            "url": "https://www.prnewswire.com/news-releases/butterflies-return-to-meijer-gardens-for-30th-annual-fred--dorothy-fichter-butterflies-are-blooming-exhibition-302367655.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Skyvia processed 30B records monthly in 2024, with 200+ connectors and 380+ global partners, reinforcing industry position.",
            "id": "4dd109ca-b34e-42eb-b04e-f4b7260b81fe",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "In a recent announcement on February 4, 2025, Skyvia disclosed its outstanding performance in 2024, solidifying its status as a leading data integration platform. Throughout the year, Skyvia garnered substantial industry acclaim, reinforcing its position as the go-to solution for data integration. The platform's achievements in 2024 highlighted its unmatched capabilities, with significant increases in user adoption and market recognition. This success underscores Skyvia's commitment to providing top-tier data integration services.",
            "tickers": [
                "NDXP"
            ],
            "time": "20:47:24",
            "timestamp": "2025-02-04T20:47:24Z",
            "url": "https://www.prnewswire.com/news-releases/skyvias-2024-in-milestones-30-billion-records-processed-monthly-over-200-connectors-and-380-global-partners-302365371.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "ClimateMaster teams up with EcoRebates to offer single online tool for finding incentives, making geothermal energy more affordable.",
            "id": "3e78ae52-6b03-4cf5-94a6-6584ac14bb12",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "In an innovative collaboration with EcoRebates, ClimateMaster has launched a convenient online platform designed to assist homeowners and commercial enterprises in locating various financial incentives. This tool consolidates information on federal, commercial, and local rebates, aiming to aid in cost-saving efforts for individuals and businesses. The partnership between ClimateMaster and EcoRebates marks a significant step towards promoting energy efficiency and sustainability. The initiative, unveiled on February 4, 2025, is set to benefit residents and businesses in Oklahoma City and Menlo Park. ClimateMaster, known for its expertise in geothermal HVAC solutions, continues to drive innovation in the industry, contributing to a greener future.",
            "tickers": [
                "NDXP"
            ],
            "time": "20:47:22",
            "timestamp": "2025-02-04T20:47:22Z",
            "url": "https://www.prnewswire.com/news-releases/climatemaster-rebate-center-makes-geothermal-energy-more-affordable-302366257.html"
        },
        {
            "beta_headline": null,
            "category": "commodities",
            "date": "2025-02-04",
            "headline": "Mercy Medical Center's NICU receives Gold-Level Beacon Award for Excellence from AACN.554 Beacon Award recipients, including 186 Gold-Level.",
            "id": "de38a441-9953-488b-b105-04b467c5d846",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "The Neonatal Intensive Care Unit (NICU) at Mercy Medical Center has been recognized with a Gold-Level Beacon Award for Excellence from the American Association of Critical-Care Nurses (AACN). The award was received on February 4, 2025, in Baltimore. This accolade highlights the exceptional level of care provided to critically ill newborns at the NICU, underscoring the commitment of the medical staff. The prestigious award signifies the dedication and expertise of the healthcare professionals, showcasing their ability to meet the highest standards in neonatal care. Mercy Medical Center's NICU's achievement is a testament to their outstanding performance, with the Gold-Level Beacon Award representing a significant milestone in their continuous pursuit of excellence in critical care. The recognition serves as a validation of the quality of service offered at the NICU, reinforcing Mercy Medical Center's position as a leading healthcare institution in providing specialized care for newborns in critical condition.",
            "tickers": [
                "NDXP"
            ],
            "time": "20:47:16",
            "timestamp": "2025-02-04T20:47:16Z",
            "url": "https://www.prnewswire.com/news-releases/mercy-medical-centers-neonatal-intensive-care-unit-receives-american-association-for-critical-care-nurses-gold-level-beacon-award-for-excellence-302367670.html"
        },
        {
            "beta_headline": null,
            "category": "news",
            "date": "2025-02-04",
            "headline": "Amy O'Shields joins WellVisor as new VP of National Sales bringing years of industry experience in leadership and strategy.",
            "id": "4a08f2db-66d4-4d42-9b2f-7a87cd7c634d",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "WellVisor is excited to announce the appointment of Amy O'Shields as the new Vice President of National Sales. Amy joins with extensive experience in the employee benefits sector, showcasing exceptional skills in leadership, strategy, and fostering client expansion. Her dedication to innovation and track record of success make her a valuable addition to the team.",
            "tickers": [],
            "time": "20:47:14",
            "timestamp": "2025-02-04T20:47:14Z",
            "url": "https://www.prnewswire.com/news-releases/wellvisor-welcomes-amy-oshields-as-vice-president-of-national-sales-302365095.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "\"Imperialism sees resurgence with alarming impact, warns Bloomberg.\"",
            "id": "ebfbb907-e4d4-4f85-a788-43d96d848767",
            "is_major": false,
            "source": "Bloomberg",
            "source_type": "news",
            "summary": null,
            "tickers": [
                "NDXP"
            ],
            "time": "20:47:12",
            "timestamp": "2025-02-04T20:47:12Z",
            "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxQRXU2dUxhd2tzR3FUUFRQRjNFVXB4Zkt1bi1RR3U1d1F2MmFZb1l6NV9NeGQ5RmhCSXN6eWsza3VoZm9keXpHNWdOdFQ1aEdWdE1WN1A0T2RfZEVpbTdTaUZlcW9Sc3BiSUlmbTBzQ1NsS1J0d0ZmSHZCQjdvQmtORG5ESjBYV0J0REs4X2RWTjJZVFpoYlR6V0VkSnI2NW45cUZsZjdVS21veGdDZjJjZWtuSQ?oc=5"
        },
        {
            "beta_headline": null,
            "category": "news",
            "date": "2025-02-04",
            "headline": "Doomsday Clock revamped after 80 years, integrating AI & 3D printing, to signify humanity’s proximity to disaster.",
            "id": "4b075012-c2c9-43fe-9f88-ce687d285b97",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "The Doomsday Clock, a symbol of how close humanity is to catastrophe for almost 80 years, has been redesigned using a mix of traditional craftsmanship, AI, and 3D printing. The new design is a striking update that enhances the impact of its grim warning.",
            "tickers": [],
            "time": "20:47:12",
            "timestamp": "2025-02-04T20:47:12Z",
            "url": "https://www.prnewswire.com/news-releases/ticking-towards-midnight-a-look-at-the-doomsday-clocks-striking-new-design-and-its-grim-message-302367786.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Hood College hosting event with $4,000 cash awards for entrepreneurship pitch competition and academic research conference.",
            "id": "5f7cc1c0-a1df-4081-aa99-322c93a40c0c",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "A new event is set to take place, showcasing an entrepreneurship pitch competition and academic research conference with a combined cash prize of $4,000. The Delaplaine School of Business at Hood College located in FREDERICK, Md. unveiled this exciting opportunity on Feb. 4, 2025. Participants can look forward to competing for cash awards in this innovative business-focused event.",
            "tickers": [
                "NDXP"
            ],
            "time": "20:47:10",
            "timestamp": "2025-02-04T20:47:10Z",
            "url": "https://www.prnewswire.com/news-releases/hood-college-to-host-entrepreneurship-pitch-competition-and-conference-302367566.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Tripleseat wins \"Best Of\" awards for value and support from Gartner Digital Market. Recognized for Best Value and Customer Support.",
            "id": "732b5d56-64b0-40c3-a32b-61683c3e1b25",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "On February 4, 2025, Tripleseat, a top provider of cloud-based sales and event management solutions for the hospitality industry, was honored for its exceptional value and customer support by industry experts. Based in Concord, Massachusetts, the company has been lauded for its dedication to offering quality services to its clientele at competitive rates. Specializing in assisting restaurants, hotels, and distinct venues, Tripleseat has established itself as a leader in the sector.",
            "tickers": [
                "NDXP"
            ],
            "time": "20:47:08",
            "timestamp": "2025-02-04T20:47:08Z",
            "url": "https://www.prnewswire.com/news-releases/tripleseat-wins-best-of-awards-for-value-and-support-from-gartner-digital-market-302367423.html"
        },
        {
            "beta_headline": null,
            "category": "crypto",
            "date": "2025-02-04",
            "headline": "Bitcoin's block size may reach 4 MB following Taproot upgrade, says Mempool Research.",
            "id": "97925cd3-4b44-4208-a244-0a023d7f65f5",
            "is_major": false,
            "source": "Cointelegraph",
            "source_type": "news",
            "summary": "Following Bitcoin's Taproot upgrade, the sizes of blocks have seen a steady increase. However, Mempool Research suggests that there is still potential for further growth in block sizes. This development indicates a positive trend in the scalability of Bitcoin, with the current block sizes not yet reaching their maximum capacity. The data shows a promising outlook for the future of Bitcoin transactions, as the network continues to accommodate larger block sizes efficiently.",
            "tickers": [],
            "time": "20:46:12",
            "timestamp": "2025-02-04T20:46:12Z",
            "url": "https://cointelegraph.com/news/bitcoin-block-size-4-mb-inscriptions-research?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound"
        },
        {
            "beta_headline": null,
            "category": "investing",
            "date": "2025-02-04",
            "headline": "US Treasury Secretary Bessent affirmed the importance of US-EU economic relationship and transatlantic cooperation in a call with ECB's President Lagarde - Statement.",
            "id": "f81a63e1-632e-4192-a37d-ae13b49a23df",
            "is_major": true,
            "source": "Tradex",
            "source_type": "news",
            "summary": null,
            "tickers": [],
            "time": "20:45:14",
            "timestamp": "2025-02-04T20:45:14Z",
            "url": null
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Waffle House adds 50-cent surcharge on eggs due to bird flu shortage, serves breakfast all day.",
            "id": "831ee497-a834-4db8-9daf-afbb4f9cbb33",
            "is_major": false,
            "source": "NYT",
            "source_type": "news",
            "summary": "A popular restaurant chain known for serving breakfast at any time has announced a temporary surcharge of 50 cents due to a shortage in the egg supply caused by the bird flu. The chain, which normally operates without time limits on their breakfast menu, made this decision in response to the current situation.",
            "tickers": [],
            "time": "20:44:13",
            "timestamp": "2025-02-04T20:44:13Z",
            "url": "https://www.nytimes.com/2025/02/04/business/waffle-house-egg-surcharge.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Trump's tariffs pose danger to global economy; potential for disruption in trade system could benefit China.",
            "id": "17b16356-8aa4-4715-b8af-ec598d6a26a0",
            "is_major": true,
            "source": "NYT",
            "source_type": "news",
            "summary": "The use of national security concerns to renegotiate trade deals may disrupt the global trading framework, potentially tilting the balance in China's direction.",
            "tickers": [],
            "time": "20:43:07",
            "timestamp": "2025-02-04T20:43:07Z",
            "url": "https://www.nytimes.com/2025/02/02/us/politics/trump-tariffs-global-economic-order.html"
        },
        {
            "beta_headline": null,
            "category": "crypto",
            "date": "2025-02-04",
            "headline": "BTC price surged by 122% in 2024, with lowest volatility recorded; stablecoin transaction value exceeded Visa's.",
            "id": "87bcbc68-0c9f-4be5-9764-47abb3fae5bc",
            "is_major": true,
            "source": "Cointelegraph",
            "source_type": "news",
            "summary": "In 2024, the price of Bitcoin surged by an impressive 122%, marking a significant increase in value. Concurrently, the annualized volatility of Bitcoin hit its lowest point on record, showcasing a remarkable level of stability in its market performance.",
            "tickers": [
                "BTC"
            ],
            "time": "20:43:07",
            "timestamp": "2025-02-04T20:43:07Z",
            "url": "https://cointelegraph.com/news/btc-volatility-low-stablecoin-transaction-tops-visa-ark?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Spirit Daughter launches Moment app on Feb. 4, 2025, empowering users with mindfulness for calm, clarity, and abundance.",
            "id": "c33a0e10-f5cc-4e3d-a03b-220b07287d30",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "A wellness brand, Spirit Daughter, famous for enabling individuals to live purposefully and intentionally, has introduced Moment, a new transformative energy tool on Feb. 4, 2025, in Los Angeles. The tool aims to help users cultivate calm, clarity, and abundance in their daily lives.",
            "tickers": [
                "NDXP"
            ],
            "time": "20:43:04",
            "timestamp": "2025-02-04T20:43:04Z",
            "url": "https://www.prnewswire.com/news-releases/spirit-daughter-launches-moment-app-a-new-era-in-mindfulness-practice-302368041.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Otter Tail Corporation raises quarterly dividend by 12% to $0.525 per share, equating to an annual rate of $2.10.",
            "id": "32203247-311d-4952-94f0-7c25ecdff8bb",
            "is_major": true,
            "source": "Business Wire",
            "source_type": "news",
            "summary": "A company based in Fergus Falls, Minnesota, Otter Tail Corporation (Nasdaq: OTTR), recently declared a rise in its quarterly common stock dividend to $0.525 per share. This adjustment elevates the yearly indicated dividend rate to $2.10 per share, showcasing a $0.23, or 12.3 percent, enhancement compared to the previous year. The decision to boost the dividend was influenced by the strong financial standing of Otter Tail Corporation at the conclusion of 2024, signifying the company's dedication to providing value to its shareholders.",
            "tickers": [
                "OTTR",
                "NDXP"
            ],
            "time": "20:35:54",
            "timestamp": "2025-02-04T20:35:54Z",
            "url": "http://www.businesswire.com/news/home/20250204422675/en/Otter-Tail-Corporation-Increases-Quarterly-Dividend-by-12-Percent/?feedref=JjAwJuNHiystnCoBq_hl-YKT6SDyMw5Lye4ovXwHmkqD8R-QU5o2AvY8bhI9uvWSD8DYIYv4TIC1g1u0AKcacnnViVjtb72bOP4-4nHK5idAXrgr_e1ZUbxvK6BY66Xm"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Mortgage brokers using ARIVE can now choose Freedom Mortgage, providing competitive pricing. Fla, Feb. 4, 2025.",
            "id": "5f942266-2b90-4cb4-9cc2-50997d973134",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "On February 4th, 2025, Freedom Mortgage, a leading full-service independent mortgage company and a top Department of Veterans Affairs (VA) lender, partnered with ARIVE's innovative platform in Boca Raton, Florida. This collaboration aims to provide competitive pricing to the mortgage broker community. Freedom Mortgage, with its significant market presence, offers a wide range of mortgage products and services. This partnership is expected to benefit brokers by providing access to competitive pricing options from a well-established player in the mortgage industry.",
            "tickers": [
                "NDXP"
            ],
            "time": "20:33:49",
            "timestamp": "2025-02-04T20:33:49Z",
            "url": "https://www.prnewswire.com/news-releases/mortgage-brokers-on-arives-lender-platform-can-now-select-freedom-mortgage-302368033.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Diversity Woman Media celebrates 20 years with brand refresh, launches new magazine \"Executive Woman Magazine.\"",
            "id": "b27f9b40-b45f-4063-a19d-13814103f2a4",
            "is_major": false,
            "source": "Business Wire",
            "source_type": "news",
            "summary": "Celebrating two decades in business, Diversity Woman Media announces a brand update with the launch of \"Executive Woman Magazine: Elevating Women to New Heights.\"",
            "tickers": [
                "NDXP"
            ],
            "time": "20:33:44",
            "timestamp": "2025-02-04T20:33:44Z",
            "url": "http://www.businesswire.com/news/home/20250204509784/en/Diversity-Woman-Media-Cheers-20-Years-with-a-Brand-Refresh/?feedref=JjAwJuNHiystnCoBq_hl-bsjWlVyeNLyq_m2tvaHJJaD1w08bW43U_zsPK9s38B4rCOi9QzgjCezTS3Nw_X6kJUrpSBm-Hav1w-UkdSlG3miu0ZZ-LtXjCwD3Ec3ldN_zZCGORvG0LE20YOvo49uqw=="
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Nokia Corp buys back shares on 04.02.2025. #stockmarket #news",
            "id": "40e421d3-4764-457f-9fc1-423b8ab1e7ce",
            "is_major": false,
            "source": "GlobeNewswire",
            "source_type": "news",
            "summary": null,
            "tickers": [
                "EET",
                "NOK"
            ],
            "time": "20:31:51",
            "timestamp": "2025-02-04T20:31:51Z",
            "url": "https://www.globenewswire.com/news-release/2025/02/04/3020743/0/en/Nokia-Corporation-Repurchase-of-own-shares-on-04-02-2025.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Eunhong (Edward) Min appointed as StarKist President & CEO, with extensive global experience.",
            "id": "efda917a-b8ad-4a96-943c-d386bd35729c",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "Today, on February 4, 2025, in Reston, Virginia, StarKist Co. revealed the selection of Eunhong (Edward) Min as the company's latest President & CEO. With a strong background in global leadership, Min has excelled in fostering growth, operational efficiency, and creativity. The appointment reflects the company's dedication to further advancement under Min's guidance.",
            "tickers": [
                "NDXP"
            ],
            "time": "20:31:46",
            "timestamp": "2025-02-04T20:31:46Z",
            "url": "https://www.prnewswire.com/news-releases/eunhong-edward-min-named-starkist-president--ceo-302368030.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "SFC to launch 12 sports facilities nationwide in 2025, aiming to boost economy and community growth through amateur sports.",
            "id": "a298b08e-84e0-4ecb-9dbb-7c599b300c1c",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "Clearwater, Florida - February 4, 2025 - The Sports Facilities Companies (SFC) are set to launch new projects aimed at fostering economic impact and community growth through youth and amateur sports. SFC, known for its expertise in developing and running sports, recreation, and entertainment facilities, will be spearheading initiatives to utilize sports as a catalyst for societal development. These projects are anticipated to generate a significant economic boost and provide numerous opportunities for local residents. With a focus on nurturing sports talent and engagement, the initiatives aim to benefit the community at large. The projects are expected to create jobs and enhance the city’s appeal, with projected numbers indicating a substantial increase in revenue and footfall. Through these endeavors, SFC is committed to leveraging sports to drive positive change and prosperity within Clearwater and beyond.",
            "tickers": [
                "NDXP"
            ],
            "time": "20:31:44",
            "timestamp": "2025-02-04T20:31:44Z",
            "url": "https://www.prnewswire.com/news-releases/the-sports-facilities-companies-to-open-or-break-ground-on-12-facilities-nationwide-in-2025-302367966.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Mary Barley of Everglades Foundation inducted into Hall of Fame. Important honor at annual conference.",
            "id": "be42ecb8-475f-4084-8738-04b381b7fe0d",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "In Miami on February 4, 2025, the Everglades Foundation is commending Mary Barley, a Founding Director, for a notable achievement. This past weekend, the well-known philanthropist and activist was officially welcomed into the esteemed Hall of Fame at the yearly conference of...",
            "tickers": [
                "NDXP"
            ],
            "time": "20:31:42",
            "timestamp": "2025-02-04T20:31:42Z",
            "url": "https://www.prnewswire.com/news-releases/the-everglades-foundation-congratulates-mary-barley-for-induction-into-everglades-coalition-hall-of-fame-302367994.html"
        },
        {
            "beta_headline": null,
            "category": "news",
            "date": "2025-02-04",
            "headline": "Dr. Benjamin Stong of Kalos Facial Plastic Surgery in Atlanta selected as Castle Connolly 2025 Top Doctor® for excellence.",
            "id": "816cbf47-3764-4375-9824-9ee283d257be",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "Atlanta-based plastic surgeon, Dr. Benjamin Stong from Kalos Facial Plastic Surgery, has recently been honored as a Castle Connolly 2025 Top Doctor®. This prestigious title recognizes his expertise in advanced facial plastic surgery and exceptional patient services. Dr. Stong's ongoing dedication to innovative techniques in the field has solidified his reputation as a top practitioner in the industry.",
            "tickers": [],
            "time": "20:31:40",
            "timestamp": "2025-02-04T20:31:40Z",
            "url": "https://www.prnewswire.com/news-releases/atlanta-facelift-and-rhinoplasty-specialist-dr-benjamin-stong-selected-as-a-castle-connolly-2025-top-doctor-302367820.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Seth Messner appointed as new managing partner of Katten's DC office, replacing Timothy Lynes who led for 8 years.",
            "id": "d38718f8-a20d-494c-a0b7-70403375a099",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "Katten has appointed Seth M. Messner as the new managing partner of its Washington, DC office, taking over from Timothy J. Lynes after his eight-year tenure. Messner, a prominent attorney in Structured Finance and Securitization, will now lead the office. This development was announced on Feb. 4, 2025.",
            "tickers": [
                "NDXP"
            ],
            "time": "20:29:38",
            "timestamp": "2025-02-04T20:29:38Z",
            "url": "https://www.prnewswire.com/news-releases/katten-appoints-seth-messner-to-head-dc-office-302368027.html"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Wiland launches GivingSignals to boost nonprofit fundraising with predictive insights. Aims to optimize donor engagement.",
            "id": "4ad723cd-1f45-4ead-930b-c82774d4e600",
            "is_major": false,
            "source": "Business Wire",
            "source_type": "news",
            "summary": "A new initiative has been launched by Wiland in Niwot, Colorado, called GivingSignals™, aimed at assisting nonprofits in enhancing donor engagement and fundraising success. This innovative tool provides predictive insights to help optimize strategies, ultimately benefiting these organizations in achieving their goals.",
            "tickers": [
                "NDXP"
            ],
            "time": "20:28:51",
            "timestamp": "2025-02-04T20:28:51Z",
            "url": "http://www.businesswire.com/news/home/20250204680023/en/Wiland-Introduces-GivingSignals%E2%84%A2-A-Solution-to-Elevate-Nonprofit-Fundraising-Performance/?feedref=JjAwJuNHiystnCoBq_hl-Q-tiwWZwkcswR1UZtV7eGe24xL9TZOyQUMS3J72mJlQ7fxFuNFTHSunhvli30RlBNXya2izy9YOgHlBiZQk2LOzmn6JePCpHPCiYGaEx4DL1Rq8pNwkf3AarimpDzQGuQ=="
        },
        {
            "beta_headline": null,
            "category": "crypto",
            "date": "2025-02-04",
            "headline": "Shiba Inu and Dogecoin could see significant rallies, with Shiba potentially surging 393% to $0.000081. Dogecoin targets 333% gains to $1.2511.",
            "id": "d365ed26-bc1d-4188-a644-5b1ecabd25b6",
            "is_major": false,
            "source": "Benzinga",
            "source_type": "news",
            "summary": "Dogecoin (DOGE) and Shiba Inu (SHIB) are exhibiting stable price movements, but indicators hint at a significant rally in the near future.DOGE is currently priced at $0.2636, down by 5.7% in the last 24 hours. SHIB stands at $0.00001563, indicating a 3.4% decrease, while PEPE is at $0.00001001, reflecting a fall of 5.0%.Trader Javon Marks anticipates SHIB to potentially surge by nearly 10 times to $0.0001553. The initial target is set at $0.000081 (+393%), with the possibility of a larger movement driven by increased buyer accumulation during dips. The ongoing consolidation phase could bolster a sustained breakout, elevating the likelihood of surpassing $0.000081 and aiming for $0.0001553 (+840%).For DOGE, Marks predicts a robust breakout with a target of $0.6533. Clearing this resistance level may propel DOGE towards $1.2511, representing a potential gain of 333%.Despite challenges faced by meme coins, according to analyst Bluntz Capital, DOGE displays resilience and potential for growth.",
            "tickers": [],
            "time": "20:27:51",
            "timestamp": "2025-02-04T20:27:51Z",
            "url": "https://www.benzinga.com/markets/cryptocurrency/25/02/43476777/shiba-inu-eyes-393-rally-dogecoin-targets-333-gains-whats-happening"
        },
        {
            "beta_headline": null,
            "category": "crypto",
            "date": "2025-02-04",
            "headline": "New Speech AI by Golden Gemini boosts efficiency, cuts computational demands by fixing flaws; more accurate; Read more.",
            "id": "db3ce4c0-43d3-41a5-b070-4c88f193dc17",
            "is_major": false,
            "source": "Blockchain News",
            "source_type": "news",
            "summary": "Golden Gemini has unveiled an innovative approach in Speech AI that enhances accuracy and minimizes computational requirements by rectifying key shortcomings in conventional speech processing models. This breakthrough technology is set to revolutionize the industry through its unparalleled advancements.",
            "tickers": [],
            "time": "20:26:57",
            "timestamp": "2025-02-04T20:26:57Z",
            "url": "https://Blockchain.News/news/golden-gemini-revolutionizes-speech-ai"
        },
        {
            "beta_headline": null,
            "category": "investing",
            "date": "2025-02-04",
            "headline": "Wednesday's FX Option Expiries",
            "id": "8d45bc34-7d70-44e3-8d3c-78124427c5e2",
            "is_major": false,
            "source": "Tradex",
            "source_type": "news",
            "summary": null,
            "tickers": [],
            "time": "20:23:43",
            "timestamp": "2025-02-04T20:23:43Z",
            "url": null
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Tri-County Financial Group, Inc. reports net income of $2.4 million in Q4 2024, up from $2.3 million in Q4 2023.",
            "id": "1b782667-5299-4bfa-83c2-9ec4a0c75689",
            "is_major": false,
            "source": "PR NewsWire",
            "source_type": "news",
            "summary": "In Mendota, Illinois, Tri-County Financial Group, Inc. reported their financial performance for Q4 2024. The company disclosed a net income of $2.4 million, translating to $1.00 per share. This marks a slight increase from the previous quarter's net income of $2.3 million ($0.94 per share). The company is traded on the OTCQX under the symbol TYFG.",
            "tickers": [
                "NDXP",
                "TYFG"
            ],
            "time": "20:23:35",
            "timestamp": "2025-02-04T20:23:35Z",
            "url": "https://www.prnewswire.com/news-releases/tri-county-financial-group-inc-reports-fourth-quarter-2024-financial-results-302368022.html"
        },
        {
            "beta_headline": null,
            "category": "crypto",
            "date": "2025-02-04",
            "headline": "Robert F. Kennedy Jr. supports Bitcoin, bought 2 BTC each for his kids; speculations on possible HHS role for him.",
            "id": "c5951e67-edf5-4c62-a471-96cf1826ce70",
            "is_major": false,
            "source": "Benzinga",
            "source_type": "news",
            "summary": "Following the 2024 presidential election, Robert F. Kennedy Jr. did not secure victory but is now speculated to potentially join President Donald Trump's cabinet as the head of the Department of Health and Human Services. This move would further bolster the new administration's support for the cryptocurrency sector, especially Bitcoin (CRYPTO: BTC). Kennedy, a prominent figure known for his public appearances at various Bitcoin conferences, as well as his acceptance of cryptocurrency donations during his campaign, has been vocal about advocating for U.S. Bitcoin investments and pushing for capital gains tax exemptions for digital currencies. Despite exiting the presidential race, Kennedy remains a significant proponent of Bitcoin. To read more about this development, the full article is accessible on Benzinga.com.",
            "tickers": [
                "BTC"
            ],
            "time": "20:22:46",
            "timestamp": "2025-02-04T20:22:46Z",
            "url": "https://www.benzinga.com/25/02/43476651/if-you-invested-1000-in-bitcoin-when-robert-f-kennedy-jr-said-he-bought-2-btc-each-for-his-kids-heres-how-much-yo"
        },
        {
            "beta_headline": null,
            "category": "crypto",
            "date": "2025-02-04",
            "headline": "SEC acting chair recruits ex-Coin Center director Landon Zinda for crypto task force as senior adviser.",
            "id": "7952d6b9-4127-4c1f-b218-2322881d0601",
            "is_major": true,
            "source": "Cointelegraph",
            "source_type": "news",
            "summary": "Landon Zinda, the previous policy director at Coin Center, recently made the transition to the Securities and Exchange Commission (SEC) where he has taken on the role of senior adviser. This move marks a significant change in Zinda's career, shifting from the advocacy group to a position within the regulatory body. His expertise and experience in the cryptocurrency industry are expected to bring valuable insights to the SEC. This transition underscores the increasing importance of crypto regulations, with key figures like Zinda playing a crucial role in shaping the regulatory landscape.",
            "tickers": [],
            "time": "20:19:38",
            "timestamp": "2025-02-04T20:19:38Z",
            "url": "https://cointelegraph.com/news/sec-mark-uyeda-coin-center-director-crypto-task-force?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound"
        },
        {
            "beta_headline": null,
            "category": "securities",
            "date": "2025-02-04",
            "headline": "Holladay Distillery expands with new ironclad rickhouse to meet higher demand in its latest growth spurt.",
            "id": "e5467a17-bb44-4bdc-958c-7a12cd17e40a",
            "is_major": false,
            "source": "GlobeNewswire",
            "source_type": "news",
            "summary": "A well-known bourbon distillery located in Weston is increasing its production operations to meet growing demand. The distillery is expanding its facilities to accommodate the surge in popularity. This expansion will enable them to produce approximately [insert number] more bottles of bourbon annually. The move comes as the company experiences a significant boost in consumer interest and sales of their products. The distillery's decision to expand underscores the strong demand for their bourbon and their commitment to meeting the needs of their customers.",
            "tickers": [],
            "time": "20:18:41",
            "timestamp": "2025-02-04T20:18:41Z",
            "url": "https://www.globenewswire.com/news-release/2025/02/04/3020740/0/en/Holladay-Distillery-breaks-ground-on-ironclad-rickhouse-in-latest-growth-spurt.html"
        }
    ]
}
