{
    "data": [
        {
            "id": 212735,
            "title": "Tether Integrates AI into Finance with “Tether Data,” an AI-Powered SDK Platform with Self-Custodial Tools",
            "description": "<div class=\"share___SVvtl\"><div><h1>AI SDK Platform Introduced to Enhance Crypto Applications</h1><p><a href=\"https://www.coinlive.com/news/tether-and-its-founders-are-relocating-to-el-salvador-to \" target=\"\">Tether</a> is expanding beyond stablecoins with Tether Data, an AI-driven initiative aimed at integrating artificial intelligence (AI) into financial and communication tools. </p><p></p><p>CEO Paolo Ardoino announced the launch of an open-source AI SDK built on Bare, a JavaScript runtime from Holepunch. </p><div class=\"media-wrap embed-wrap\"><div><blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\">Tether Data, AI model training platform preview.<br/><br/>This PaaS will be available to any company interested in (pre-)training own models.<br/>Bonus, at the core of this platform we're leveraging Holepunch's tech for all data-structures to make training and models highly-resilient and… <a href=\"https://t.co/j9PXtP5B2U\">pic.twitter.com/j9PXtP5B2U</a></p>— Paolo Ardoino 🤖🍐 (@paoloardoino) <a href=\"https://twitter.com/paoloardoino/status/1886439714632110348?ref_src=twsrc%5Etfw\">February 3, 2025</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p>Designed for broad compatibility, the SDK supports various hardware—from low-end mobile devices to high-performance servers and embedded systems—enhancing accessibility for AI-powered financial applications. </p><p></p><p>Unlike centralised cloud-based AI models, <a href=\"https://www.coinlive.com/news/tether-and-its-founders-are-relocating-to-el-salvador-to \" target=\"\">Tether </a>Data prioritises privacy and decentralisation by enabling local device processing, reducing reliance on external data servers and minimising risks related to surveillance and data breaches. </p><p></p><h1>Tether Data to Support Multiple Functionalities</h1><p><a href=\"https://www.coinlive.com/news/tether-s-newly-rolled-out-wdk-toolkit-enables-self-custody-wallets-for-ai \" target=\"\">Tether</a>’s AI SDK will enable a range of functionalities, including AI-powered translation, voice assistants, and Bitcoin wallet assistants, all designed to streamline crypto transactions and improve user accessibility. </p><p></p><p>Built on Holepunch’s Bare JavaScript runtime, the platform supports AI-driven applications tailored for financial interactions. </p><div class=\"media-wrap embed-wrap\"><div><blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\">Tether Data, preview of some of the AI apps we're developing: AI translate, AI voice assistant, AI bitcoin wallet assistant.<br/><br/>Tether will launch soon its own AI SDK platform, open-source, built upon Bare (Holepunch's javascript runtime), working on every hardware, from embedded… <a href=\"https://t.co/W5JFmoVcnh\">pic.twitter.com/W5JFmoVcnh</a></p>— Paolo Ardoino 🤖🍐 (@paoloardoino) <a href=\"https://twitter.com/paoloardoino/status/1886793478459330754?ref_src=twsrc%5Etfw\">February 4, 2025</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p>As AI adoption accelerates, industry leaders are addressing its risks—<a href=\"https://www.coinlive.com/news/meta-rolls-out-frontier-ai-framework-to-constrain-high-risk-ai \" target=\"\">Meta, for instance, has introduced the Frontier AI Framework</a>, classifying AI risks as high or critical and imposing development restrictions based on severity. </p><p></p><p>This growing focus on security and governance highlights the challenges of integrating AI into financial ecosystems.</p><p></p><h1>USDT Sees $1B Increase in Market Cap Following Announcement</h1><p>The announcement sparked a surge in cryptocurrency market activity, with <a href=\"https://coinmarketcap.com/currencies/tether/ \" target=\"\">USDT’s market cap rising by $1 billion</a>—from $139.5 billion to $140.52 billion—reflecting growing investor confidence in AI-driven financial innovations. </p><p></p><p>On-chain data showed a sharp increase in active USDT addresses, climbing from 350,000 to 410,000 within hours, signalling heightened engagement within the Tether ecosystem. </p><p></p><p>By integrating AI into its framework, <a href=\"https://www.coinlive.com/news/tether-s-newly-rolled-out-wdk-toolkit-enables-self-custody-wallets-for-ai \" target=\"\">Tether</a> is further bridging the gap between AI and blockchain technology. </p><p></p><p>The AI SDK’s capabilities hint at future advancements in crypto applications, enhancing market analysis and transaction efficiency.</p><p></p><p></p><p></p></div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/1564c320d8e115d815700e1957dbbeee.jpeg",
            "link": "https://www.coinlive.com/news/tether-integrates-ai-into-finance-with-tether-data-an-ai-powered",
            "pub_date": "2025-02-05 17:15:00",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 212733,
            "title": "a16z: What kind of Bitcoin strategic reserve should the United States implement?",
            "description": "<div class=\"share___SVvtl\"><div><p>Source: <a href=\"https://a16zcrypto.com/posts/article/us-crypto-capital-policy/#section--7\" target=\"_self\">a16z crypto editorial \"Making the United States the Capital of Cryptocurrency: What It Takes to Do\"</a></p><p>Author: <em>Christian Catalini</em>, co-founder of Lightspark and MIT Cryptoeconomics Lab</p><p>Translated by: 0xjs@黄金财经</p><p>The United States benefits from what economists call an \"exorbitant privilege.\" As the issuer of the world's reserve currency, it can borrow in its own currency and support new spending. However, this does not mean that it can simply print money - U.S. Treasuries still have to attract buyers on the open market. Fortunately, U.S. debt is widely regarded as the safest asset in the world, ensuring strong demand, especially in times of crisis when investors scramble for safe assets. </p><p>Who profits from this exorbitant privilege? First are U.S. policymakers, who gain extra flexibility in fiscal and monetary decisions. Second are banks - they are at the center of global financial flows, charging fees and exerting influence. But who are the real winners? American companies and multinationals, who are able to conduct much of their business in their own currency and can issue bonds and borrow more cheaply than foreign competitors. Let’s not forget consumers, who enjoy greater purchasing power, lower borrowing costs, and more affordable mortgages and loans. </p><p>The result? The United States can borrow more cheaply, run larger deficits longer, and withstand economic shocks that would cripple other countries. However, <span style=\"color: rgb(0, 112, 192);\"><strong>this exorbitant privilege is not inevitable—it must be earned. It depends on America’s economic, financial, and geopolitical power. Ultimately, the entire system depends on one key factor: trust. Trust in America’s institutions, governance, and military</strong>. And most importantly, trust that the dollar is ultimately still the safest place for global savings. </span></p><p>All of this has a direct impact on the Trump administration’s proposed Bitcoin reserve plan. <strong>Proponents are not wrong about Bitcoin’s long-term strategic role—they’re just premature</strong>. Today, the real opportunity lies not in simply hoarding Bitcoin; it lies in intentionally shaping Bitcoin’s integration into the global financial system in a way that strengthens, not undermines, America’s economic leadership. This means leveraging USD stablecoins and Bitcoin to ensure that the next era of financial infrastructure is one in which America leads — not reacts. Before we get to that, let’s first analyze the role of reserve currencies and the countries that control them. The Rise and Fall of Reserve Currencies History is clear: reserve currencies belong to the world’s economic and geopolitical leaders — until they no longer do. At their peak, dominant nations dictate the rules of trade, finance, and military power, providing global credibility and trust in their currencies. From the Portuguese real in the 15th century to the U.S. dollar in the 20th century, reserve currency issuers shape the markets and institutions that others emulate. But no currency stays on the throne forever. Overreaching—whether through war, expensive expansion, or unsustainable social promises—ultimately erodes credibility. The Spanish real, once backed by vast Latin American silver reserves, depreciated as Spain’s mounting debt and economic mismanagement undermined its dominance. The Dutch guilder also depreciated as relentless warfare drained the Netherlands’ resources. The French franc dominated in the 18th and early 19th centuries but depreciated under the weight of revolution, the Napoleonic wars, and financial mismanagement. And the pound, once a cornerstone of global finance, collapsed under the weight of postwar debt and the rise of American industrial dominance. </p><p><span style=\"color: rgb(0, 112, 192);\"><strong>The lesson is simple: Economic and military strength can create a reserve currency, but financial stability and institutional leadership are what sustain it. Lose that foundation, and the privilege is gone. </strong></span></p><h2><strong>Is the dollar’s ​​reign coming to an end? </strong></h2><p>The answer to that question depends on where you start counting. The dollar cemented its position as the world’s reserve currency around World War II, with the Bretton Woods Agreement, and even earlier, as the United States became the world’s leading creditor after World War I. In any case, the dollar has been dominant for more than 80 years. That’s a long time by historical standards, but not unprecedented—the British pound dominated for about a century before declining. </p><p>Today, some argue that the Pax Americana is unravelling. China’s rapid advances in artificial intelligence, robotics, electric vehicles, and advanced manufacturing signal a shift in power. Beyond that, China also holds significant control over critical minerals necessary to shape our future. Other warning signs are emerging. Marc Andreessen called DeepSeek’s R1 launch America’s AI Sputnik moment—a reminder that American leadership in emerging technologies is no longer guaranteed. Meanwhile, China’s expanding military presence in the air, at sea, and in cyberspace, along with its growing economic influence, raises a pressing question: Is the dollar’s ​​dominance threatened? </p><p><img alt=\"iwRUgD4ung9QI9C6WpgzPnwA7andPbvn7U3OOIQR.png\" src=\"https://img.jinse.cn/7346773_watermarknone.png\" title=\"7346773\"/></p><p style=\"text-align: center;\">Debt as a percent of GDP. Source: IMF</p><p>The short answer: Not yet. Despite rising debt and false propaganda predicting an imminent collapse, the U.S. is not on the verge of a fiscal crisis. Yes, the debt-to-GDP ratio is high, especially after pandemic spending, but it’s in line with other major economies. More importantly, global trade is still largely based on the dollar. The renminbi is closing the gap with the euro in some international settlements, but it is far from replacing the dollar. The real question is not whether the dollar will collapse. It hasn’t collapsed yet. The real concern is whether the United States can maintain its lead in innovation and economic strength. If trust in U.S. institutions declines or the United States loses its competitive advantage in key industries, cracks in the dollar’s ​​dominance may begin to show. Those who are short the dollar are not just market speculators—they are also geopolitical rivals of the United States. This does not mean that fiscal discipline does not matter. It is extremely important. Reducing spending and making government more efficient, through a Department of Government Efficiency (DOGE) or otherwise, would be a welcome shift. Streamlining outdated bureaucracies, removing barriers to entrepreneurship, and promoting innovation and competition would not only reduce wasteful public spending; it would also strengthen the economy and bolster the dollar’s ​​position. </p><p>Combined with the United States’ continued breakthroughs in artificial intelligence, cryptography, robotics, biotechnology, and defense technology, this approach could reflect how the United States regulates and commercializes the Internet—driving a new wave of economic growth and ensuring that the dollar remains the world’s undisputed reserve currency.</p><h2><strong>Can a Bitcoin Reserve Solidify U.S. Financial Leadership?</strong></h2><p>The idea of ​​a strategic Bitcoin reserve is discussed below. Unlike traditional reserve assets, Bitcoin lacks the historical backing of national institutions and geopolitical power. But that’s exactly the point. It represents a new paradigm: no state sponsor, no single point of failure, fully globalized, and politically neutral. Bitcoin offers an alternative that is not constrained by the traditional financial system.</p><p>While many consider Bitcoin a breakthrough in computer science, its true innovation is much more profound: it redefines how economic activity is coordinated and how value moves across borders. Operating as a decentralized, trustless system (and with a single anonymous creator who has no control), the Bitcoin blockchain can serve as a neutral universal ledger—an independent framework for recording global credits and debits without relying on central banks, financial institutions, political alliances, or other intermediaries. This is not only a technological advancement, but also a tectonic shift in how global financial coordination operates.</p><p>This neutrality makes Bitcoin uniquely resilient to the debt crises and political entanglements that have historically unravelled fiat currencies. Unlike traditional monetary systems, which are closely tied to national policies and geopolitical shifts, Bitcoin is not controlled by any single government. This also makes it possible to serve as a common economic language between countries that would otherwise resist financial integration or reject a unified ledger system altogether. For example, the United States and China are unlikely to trust each other’s payment channels – especially as financial sanctions become an increasingly powerful tool of economic warfare.</p><p>So how will these fragmented systems interact? Bitcoin can serve as a bridge: a global, trust-minimized settlement layer that connects otherwise competing economic sectors. When this reality becomes a reality, it would certainly make sense for the United States to hold a strategic Bitcoin reserve.</p><p>But we are not there yet. For Bitcoin to move beyond an investment asset, critical infrastructure must be developed to ensure scalability, a modern compliance framework, and seamless integration with fiat currencies to achieve mainstream adoption. </p><p><span style=\"color: rgb(0, 112, 192);\"><strong>Bitcoin reserve proponents aren’t wrong about its potential long-term strategic role. They’re just premature. </strong></span>Let’s unpack why. </p><h2><strong>Why do countries keep strategic reserves? </strong></h2><p>The reason countries keep strategic reserves is simple: in a crisis, access is more important than price. Oil is the classic example—while futures markets allow price hedging, no amount of financial engineering can replace having physical reserves on hand when supply chains are disrupted by war, geopolitics, or other disruptions. </p><p>The same logic applies to other necessities—natural gas, grains, medical supplies, and, increasingly, raw materials. As the world transitions to battery-driven technology, governments have begun stockpiling lithium, nickel, cobalt, and manganese to prepare for future shortages. </p><p>And then there’s currency. Countries with large foreign debts (often denominated in dollars) hold dollar reserves to facilitate the rollover of debt and guard against domestic currency crises. But here’s the key difference: No country is currently holding a significant amount of debt in Bitcoin — at least not yet.</p><p>Bitcoin proponents argue that Bitcoin’s long-term price action makes it an obvious reserve asset. If the U.S. buys now and continues to adopt, the investment could multiply in value. However, this approach is more in line with the strategy of a sovereign wealth fund, which focuses on capital returns rather than reserves that are critical to national security. It’s more suited to resource-rich but economically unbalanced countries seeking asymmetric financial windfalls, or to countries with weak central banks hoping Bitcoin can stabilize their balance sheets.</p><p>So where does that leave the U.S.? The U.S. doesn’t need Bitcoin to run its economy just yet, and despite President Trump’s recent announcement of a sovereign wealth fund, cryptocurrency investments may still (rightly) be left primarily to private markets for efficient allocation.<span style=\"color: rgb(0, 112, 192);\">The strongest case for Bitcoin reserves is not economic need, but strategic positioning. </span>Holding a reserve could signal that the U.S. is determined to lead in crypto, establish a clear regulatory framework, and position itself as the global hub for DeFi, just as it has dominated traditional finance for decades. However, at this stage, the costs of such a move could outweigh the benefits.</p><h2><strong>Why a Bitcoin Reserve Could Backfire</strong></h2><p><strong>Beyond the logistical challenges of accumulating and securing a Bitcoin reserve, the bigger issue is one of perception, and the costs could be high. At worst, it could signal a lack of confidence in the U.S. government’s ability to sustain its debt, a strategic misstep</strong>handing victory to geopolitical rivals like Russia and China, both of which have long sought to weaken the dollar.</p><p>Not only has Russia pushed for de-dollarization abroad, its state-backed media has for years pushed a narrative that questions the dollar’s ​​stability and predicts its imminent devaluation. Meanwhile, China has taken a more direct approach by expanding the reach of the yuan and digital payments infrastructure—including through a domestically focused digital yuan—to challenge the U.S.-dominated financial system, especially in cross-border trade and payments. In global finance, perceptions matter. Expectations don’t just reflect reality; they help shape it. </p><p><strong><span style=\"color: rgb(0, 112, 192);\">If the U.S. government began hoarding Bitcoin on a massive scale, markets might interpret it as a hedge against the dollar. That perception alone could trigger investors to sell dollars or reallocate capital, undermining the position the U.S. wants to protect. In global finance, beliefs drive behavior. If enough investors begin to doubt the dollar’s ​​stability, their collective actions will turn that doubt into reality. </span></strong></p><p>U.S. monetary policy relies on the Fed’s ability to manage interest rates and inflation. <strong><span style=\"color: rgb(0, 112, 192);\">Holding Bitcoin reserves could send a conflicting message: If the government has confidence in its own economic tools, why would it store assets that the Fed can’t control? </span></strong></p><p>Could Bitcoin reserves alone trigger a dollar crisis? Very unlikely. But it also might not strengthen the system—and in geopolitics and finance, unforced errors are often the most costly. </p><h2><strong>Lead with Strategy, Not Speculation</strong></h2><p>The best way for the United States to reduce its debt-to-GDP ratio is not through speculation, but through fiscal discipline and economic growth. History shows: reserve currencies do not last forever, and those that do depreciate do so due to economic mismanagement and overextension. To avoid following the footsteps of the Spanish real, the Dutch guilder, the French livre, and the British pound, the United States must focus on sustainable economic strength rather than risky financial bets.</p><p><span style=\"color: rgb(0, 112, 192);\"><strong>The United States has the most to lose if Bitcoin becomes the global reserve currency.</strong></span>The transition from dollar dominance to a Bitcoin-based system will not be smooth.<span style=\"color: rgb(0, 112, 192);\">Some believe that a rising Bitcoin value could help the United States “pay down” its debt, but the reality is much harsher. Such a shift would make it much more difficult for the United States to finance its debt and maintain its economic influence.  </span></p><p>While many believe that Bitcoin cannot possibly become a true medium of exchange and unit of account, history suggests otherwise. Gold and silver are valuable not only because they are scarce, but also because they are divisible, durable, and portable, making them effective money—even without sovereign backing or issuance, as Bitcoin is today. Similarly, China’s early paper currency was not a government-mandated medium of exchange. It evolved from commercial promissory notes and certificates of deposit (representing an already trusted store of value) before becoming widely accepted as a medium of exchange.</p><p>Fiat currencies are often viewed as an exception to this pattern—once declared legal tender by a government, they immediately become a medium of exchange and subsequently a store of value. But this oversimplifies reality. Fiat currencies have power not just because of legal decree, but because of the government’s ability to enforce taxation and debt obligations through that power. Money backed by a state with a strong tax base has inherent demand because businesses and individuals need it to pay their debts. This power to tax allows fiat currencies to retain value even without direct commodity backing. </p><p>But even fiat money systems aren’t built from scratch. Historically, their credibility has been underpinned by commodities that people already trust, most notably gold. Paper money gained acceptance precisely because it was once redeemable for gold or silver. Only after that trust had been reinforced for decades did the transition to pure fiat money become feasible.</p><p>Bitcoin is on a similar trajectory. Today, it’s viewed primarily as a store of value—volatile but increasingly viewed as digital gold. However, as adoption grows and financial infrastructure matures, its role as a medium of exchange may follow. History shows that once an asset is widely recognized as a reliable store of value, the transition to effective money is a natural progression.</p><p>For the United States, this presents a significant challenge. While there are some policy levers, Bitcoin operates largely outside of the traditional controls that countries have over their currencies. If it becomes a global medium of exchange, the United States will face a stark reality—reserve currency status is not easily relinquished or shared. </p><p>This doesn’t mean the U.S. should crack down on or ignore Bitcoin—if anything, it should actively participate in and shape its role in the financial system. But buying and holding Bitcoin simply for appreciation isn’t the answer either. <span style=\"color: rgb(0, 112, 192);\">The real opportunity is larger—but also more challenging: promoting Bitcoin’s integration into the global financial system in a way that strengthens, not undermines, America’s economic leadership</span>. </p><h2><strong>Bitcoin Platforms for the U.S.</strong></h2><p>Bitcoin is the most established cryptocurrency, with an unparalleled record of security and decentralization. That makes it the strongest candidate for mainstream adoption, first as a store of value and eventually as a medium of exchange. </p><p>For many, the appeal of Bitcoin is its decentralization and scarcity—factors that drive its price higher as adoption increases. But that’s a narrow view. While Bitcoin’s value will continue to rise as it becomes more popular, the real long-term opportunity for the U.S. lies not just in holding Bitcoin, but in actively shaping its integration into the global financial system and establishing itself as an international hub for Bitcoin finance. </p><p>Simply buying and holding Bitcoin is a perfectly viable strategy for all countries outside the United States—both accelerating adoption and capturing financial upside. But the United States has more at stake and must do more. It needs to take a different approach—not only to maintain its status as the issuer of the world’s reserve currency, but also to enable massive financial innovation on the dollar’s ​​“platform.” </p><p>The key precedent here is the Internet, which transformed the economy by moving information exchange from proprietary to open networks. Today, as the financial rails shift toward a more open and decentralized infrastructure, the U.S. government faces a similar choice to the incumbent governments that predated the Internet. Just as those companies that embraced the Internet’s open architecture flourished and those that resisted eventually became irrelevant, the United States’ attitude toward this shift will determine whether it can maintain its global financial influence or cede ground to other countries. </p><p><span style=\"color: rgb(0, 112, 192);\"><strong>The first pillar of a more ambitious, future-oriented strategy is to treat Bitcoin as a network, not just an asset. </strong></span>As open, permissionless networks drive new financial infrastructure, incumbents must be willing to give up some control. By doing so, however, the United States can unlock significant new opportunities. History shows that those who adapt to disruptive technologies strengthen their position, while those who resist them ultimately lose. </p><p><strong><span style=\"color: rgb(0, 112, 192);\">The second key pillar of Bitcoin is to accelerate the adoption of U.S. dollar stablecoins. </span></strong>With proper regulation, stablecoins can strengthen the public-private partnerships that have underpinned America’s financial dominance for more than a century. <span style=\"color: rgb(0, 112, 192);\"><strong>Stablecoins, far from undermining the dollar’s ​​hegemony, will strengthen it, expanding the dollar’s ​​influence, enhancing its utility, and ensuring its relevance in the digital economy. Moreover, they offer a more agile and flexible solution than slow-moving, bureaucratic central bank digital currencies or ill-defined unified ledger schemes such as the Bank for International Settlements’ “internet of finance.” </strong></span></p><p>But not every country is willing to adopt a dollar stablecoin or operate entirely within the U.S. regulatory framework. Bitcoin plays a key strategic role here—acting as a bridge between core dollar platforms and non-geopolitically aligned economies. In this context, Bitcoin can act as a neutral network and asset, facilitating the flow of funds while strengthening the U.S.’s central position in global finance, thereby preventing it from ceding ground to alternative currencies such as the renminbi. Even if it becomes a pressure-release valve for countries seeking alternatives to the dollar’s ​​hegemony, Bitcoin’s decentralized, open nature ensures that it is closer to the economic and social values ​​of the United States than to those of authoritarian regimes. </p><p>If the U.S. successfully implements this strategy, it will be at the center of Bitcoin financial activity and have greater influence to shape these flows in line with U.S. interests and principles. </p><p>It’s a subtle but viable strategy that, if implemented effectively, will allow the dollar’s ​​influence to last for decades to come. <strong><span style=\"color: rgb(0, 112, 192);\">Rather than simply hoarding Bitcoin reserves (which could indicate concerns about the stability of the dollar), Bitcoin could be strategically integrated into the financial system, driving the development of the dollar and dollar stablecoins on the network, so that the U.S. government becomes an active manager rather than a passive spectator. </span></strong></p><p>What’s the benefit? A more open financial infrastructure, while the U.S. still controls the “killer app” — the dollar. This approach mirrors what companies like Meta and DeepSeek are doing by open-sourcing AI models to set industry standards while monetizing elsewhere. For the U.S., it means expanding the dollar platform to make it interoperable with Bitcoin, ensuring continued relevance in a future where cryptocurrencies play a central role. </p><p>Of course, like any strategy to oppose disruptive innovation, this one has risks. But the cost of resisting innovation is obsolescence. If any administration can do that, it’s the current one — with its deep expertise in platform wars and its clear understanding that staying ahead is not about controlling entire ecosystems but about shaping how value is captured within them.</p></div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/6e48ebc8daef7161c3164f5bb30c8903.jpg",
            "link": "https://www.coinlive.com/news/a16z-what-kind-of-bitcoin-strategic-reserve-should-the-united",
            "pub_date": "2025-02-05 16:51:17",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 212734,
            "title": "Why is this round of Bitcoin bull market so difficult? Is there still a chance?",
            "description": "<div class=\"share___SVvtl\"><div><p></p><p></p><p>Author: Aylo; Translator: Plain Language Blockchain</p><p>First of all, this cycle is indeed difficult, don't let anyone fool you into saying it is not difficult. <strong>But the reality is that each cycle is more difficult than the previous one. The number of market participants is increasing, the competition is getting more and more fierce, the old players are more savvy, and naturally more people fail in the end.</strong></p><p>If you didn't have a large position in BTC or SOL during the bear market, you probably didn't make any money at all, and you might even have gone crazy. If I didn't use SOL to denominate myself, I would probably have a very hard time.</p><p>Yes, there are some individual big winners in this round, but I bet that if you have a large position in these assets, you will probably give back some or even most of your gains in the end. <strong>After all, most people don't stop after a wave of big profits. They always feel that \"the cycle is not over yet\" and want to try again, but the result is that they give back the money they made. </strong></p><p>“Play stupid games, get stupid prizes” This principle always applies, but for traders and gamblers, this process is sometimes prolonged. </p><p><strong>So why is this cycle so difficult? </strong></p><h2><strong>01 Post-Traumatic Stress Disorder (PTSD)</strong></h2><p>In the past two large-scale altcoin cycles, most currencies experienced a 90-95% plunge. The collapse of Luna and FTX exacerbated the chain reaction in the industry, and the market fell more than expected. A large number of heavyweight players were liquidated, and crypto lending platforms have not yet recovered. </p><p>This \"post-traumatic stress disorder (PTSD)\" has deeply affected crypto native users. In this cycle, the trading pattern of the altcoin market largely reflects a mainstream view that \"all projects are scams.\" <strong>In the past two rounds of crypto market cycles, people generally believe that \"this technology represents the future.\" But in the current cycle, this belief has been greatly weakened or even destroyed, and many people no longer believe in the long-term prospects of the crypto industry. Instead, the view that \"everything is a scam\" has become one of the mainstream perceptions. </strong></p><p>No one dares to hold any assets for a long time because they don't want to experience the pain of their assets being halved or even wiped out again. <strong>This has led to an extreme \"Max Jeet Cycle\" - everyone wants to get ahead and treat others as the savior. </strong></p><p>Social media (crypto tweets on X) has exacerbated this emotional trading, and market participants are looking for the top of the cycle every day, causing market sentiment to fluctuate more violently. <br/><img src=\"https://img.jinse.cn/7346778_image3.png\"/><strong>This psychological impact is not only reflected in trading behavior, it also affects the construction and investment methods of the entire ecosystem. </strong>Today, projects face stricter scrutiny and the trust threshold has been greatly increased. This has a dual impact: on the one hand, it helps to screen out obvious scams; on the other hand, it makes it more difficult for truly valuable projects to gain attention and development opportunities. </p><h2><strong>02 </strong><strong>Innovation</strong></h2><p>Current innovation is more iterative, and the infrastructure is constantly being optimized, but there is no disruptive 0→1 breakthrough like when DeFi was born, and there is also a lack of major progress that makes people shine. <strong>This makes it easier for views such as \"there is no substantial progress in the crypto industry\" to resonate, and it also spawns more narratives such as \"the crypto industry has achieved nothing.\" </strong></p><p>The entire innovation landscape has shifted from revolutionary breakthroughs to incremental improvements. Although this is in line with the natural law of any technological development, this change brings new challenges to the narrative-driven market. </p><p><strong>In addition, we still lack real \"killer applications\" - those breakthrough products that can push the scale of on-chain users to hundreds of millions have not yet appeared. </strong></p><h2><strong>03 </strong><strong>Regulation</strong></h2><p>The previously overbearing SEC has caused great chaos in the industry and seriously hindered development. Especially DeFi, which could have attracted a wider range of users and found a market fit (PMF), was strangled and failed to grow further. In addition, the SEC also forcibly prevented all governance tokens from delivering value to holders, ultimately shaping the market narrative that \"these tokens are worthless\", which to some extent did become a reality.</p><p><strong>The SEC not only forced away a large number of developers (for example, Andre Cronje publicly stated that the SEC's suppression made him completely withdraw from the industry), but also blocked the integration of traditional finance (TradFi) and the crypto industry, ultimately forcing the entire industry to rely on venture capital (VC) financing.</strong>This directly led to an imbalance in the supply and demand structure, a distorted price discovery mechanism, and a market value that was firmly controlled by a few institutions.</p><p>However, the market is now ushering in some positive changes. As more and more projects appear in the form of public sales, the crypto industry is gradually breaking the shackles imposed by the SEC. </p><p style=\"text-align: center;\"><img src=\"https://img.jinse.cn/7346779_image3.png\"/><span style=\"font-size: 14px;\">Cronje’s excerpt on his experience with the SEC</span></p><p>Translation: The letters kept coming, each with a new angle of attack. Initially, they were “investigating” me for financing and SEC violations, which was very confusing - after all, I was neither a US citizen nor a US resident, and I had not sold anything to US citizens or residents. <br/>I spent weeks and even months trying to gather information and answer their questions (many of which were data they requested that I simply did not have). This ordeal took a huge toll on my time, energy, and resources. At this stage, I was almost forced to stop development and R&amp;D completely and focus all my attention on this legal and regulatory battle. </p><h2><strong>04 Financial Nihilism</strong></h2><p>The above factors have jointly promoted the prevalence of \"financial nihilism\" in this cycle. The essence of financial nihilism is to lose faith in the market, but have to play. Since you have seen through everything, then speculate to the end, and make a profit. Even if it is betting on Memecoin, it is better than holding it foolishly. </p><p>The narrative of \"useless governance tokens\", coupled with the high FDV and low circulation supply (low float) pattern caused by the SEC, <strong>has made many crypto-native users completely abandon the fantasy of long-term holding and turn to Memecoin to find more \"fair\" opportunities in it. </strong></p><p>In addition, in real society, young people can only rely on gambling-style investment to achieve class transition. Asset prices are soaring, but wages are far behind the endless depreciation of fiat currencies, making Memecoin, a \"crypto-version lottery\", particularly attractive. <strong>The core value of lottery has never been the odds, but the hope it carries, which is why it has always been so popular. </strong></p><p>Because gambling culture has a natural market fit in the crypto market, and related technologies (such as Solana and Pump.fun) are becoming more and more mature, the number of new tokens issued has ushered in explosive growth. <strong>In essence, there is only one core logic to all this - there are a large number of users in the market who are eager for extreme speculation, and demand determines the market. </strong><br/><img src=\"https://img.jinse.cn/7346780_image3.png\"/>The crypto market has always been said to be \"fighting on the front line\", but in this cycle, this concept has been widely recognized.</p><p>This nihilistic investment mentality is reflected in many aspects:</p><p><strong>· </strong>The rise of the so-and-so speculation culture and its entry into the mainstream</p><p><strong>· </strong>The investment cycle is further shortened</p><p><strong>· </strong> strong&gt;Trading behavior is more inclined to short-term speculation rather than long-term investment</p><p><strong>· </strong>The prevalence of extreme leverage and high-risk operations</p><p><strong>· </strong>An \"indifferent\" attitude towards fundamental analysis</p><h2><strong>05 </strong><strong>The experience of past cycles has become an obstacle</strong></h2><p>The past few cycles have taught investors that as long as they buy some altcoins in the bear market, they will eventually gain transcendence BTC's returns. </p><p><img src=\"https://img.jinse.cn/7346781_image3.png\"/></p><p>Almost no one is a naturally good trader, so in past cycles, the safest strategy for most people was to hold on - even the most depressed altcoins will eventually see a wave of increases. </p><p><strong>But this cycle is entirely a trader's market, which is more favorable to sellers than long-term holders. Traders even got the biggest profit opportunity in this cycle through HYPE airdrops. </strong></p><p>The market narratives in this cycle are generally short-lived and lack sufficiently convincing themes. Market participants are more mature than before and are good at extracting value more efficiently, so the local bubble of altcoins has not been blown to the extreme as in the past. </p><p>Using AI agents (Agent) Take the first round of hype for a narrative for example - this may be the first time the market really feels \"this is the new narrative we've been waiting for\". However, it is still very early and the long-term winners may not have really emerged yet. </p><h2><strong>06 </strong><strong>BTC has welcomed new buyers, while altcoins mostly have not</strong></h2><p>The differentiation between Bitcoin and other crypto assets has never been more obvious. </p><p><strong>BTC has successfully attracted buying from traditional finance (TradFi), gaining a strong and sustained source of passive demand for the first time. Even some central banks have begun to discuss adding BTC to their balance sheets. </strong></p><p>In contrast, altcoins are finding it harder than ever to compete with BTC. <strong>This is not difficult to understand - BTC has a clear growth goal in front of it, which is to challenge the market value of gold, while altcoins do not have a similar grand narrative. </strong></p><p>Altcoins have almost no new buyers. Although some retail investors re-entered the market after BTC hit a record high (but they bought XRP), overall, the inflow of new retail funds is still limited, and the negative reputation problem of the crypto industry still exists. </p><h2><strong>07 </strong><strong>The transformation of ETH's role</strong></h2><p>The decline in BTC's market capitalization share is mainly affected by the growth of ETH's market capitalization. </p><p><strong>In past cycles, the rise of ETH was often seen as a signal for the start of the \"altcoin season\", but this rule of thumb did not work in this cycle. </strong>The fundamental reason is that ETH has been performing poorly and has been dragged down by fundamental factors. </p><p><img src=\"https://img.jinse.cn/7346782_image3.png\"/></p><p>Many traders and investors are confused because ETH is no longer the trigger that drives the market to take more risk. Instead, it has become a sign of the end of many mini alt-szn seasons, which is completely different from the market rhythm in the past.</p><p>Although there are already many narratives and tracks that have been independently launched and operated without ETH, many traders still firmly believe that ETH needs to rise to start a real alt season.</p><p>Of course, there are more reasons for market changes, but these are some of the key points that come to my mind first when I drink coffee and empty my mind.</p><p><strong>So, what to do next? Either work harder or smarter.</strong></p><p><strong>I still believe that in the long run, fundamentals will ultimately decide everything.</strong></p><p> But the premise is that you must really understand the projects you support and how they can actually surpass BTC. There are indeed some potential candidates in the market, but the number is still small. You can look for projects with the following characteristics: · Clear profit model · True market fit (PMF) · Sustainable Token economic model · Fundamentals supported by strong narratives (currently, AI and RWA are two areas that meet this standard) I think that with the changes in the US regulatory environment, those projects with strong fundamentals and PMF can eventually deliver value to the token, and these will be relatively more stable investment options. And those protocols that can generate stable income are now in a good development cycle. This is in sharp contrast to the token model dominated by the \"greater fool theory\" in the past. If your strategy is to \"wait for retail investors to enter the market and then smash the market\", then you may be in trouble. The market has evolved and no longer relies solely on retail investors to drive cycles, and smarter funds tend to plan ahead and rush these obvious strategies. </p><p>Possible strategy directions:</p><p><strong>1) Become a better trader</strong></p><p>Try to build a trading advantage and focus on short-term trading, because there are still many stable short-term opportunities in the current market.</p><p>Onchain trading has a higher return multiple, but it is also more volatile and is not suitable for people with poor stress resistance. </p><p><strong>2) The \"barbell portfolio\" still applies (for most people who don't have a clear trading advantage</strong></p><p>70-80% of funds are allocated to BTC &amp; SOL, leaving a small portion of funds for more speculative investments.</p><p>Regularly rebalance to maintain a reasonable asset allocation.</p><p><strong>3) Evaluate your available time and adjust your strategy</strong></p><p>If you are just an ordinary person with a job and can't be in the market all day, then you can't compete with young traders who sit in the trenches and watch the market for 16 hours a day.</p><p>But passively holding underperforming altcoins and waiting for the market to take its turn will not be an effective strategy.</p><p><strong>4) Explore diversified strategies (combine different fields to increase the winning rate)</strong></p><p>Core portfolio (BTC &amp; SOL) + low-risk arbitrage strategies (such as airdrop mining, although the difficulty has increased now, there are still opportunities). </p><p>Pre-position new ecology and occupy a position in the immature ecology, such as HyperLiquid, Movement, Berachain, etc. </p><p>Deepen a niche field and become an expert in that track. </p><h2><strong>08</strong><strong>The altcoin market still has room for growth, but the competition is more intense</strong></h2><p>I still believe that the altcoin market still has room for growth in 2025, and the overall market environment is still affected by the global liquidity cycle. <strong>But only a few tracks and a few projects can really outperform BTC &amp; SOL significantly. Moreover, the pace of altcoin rotation will be faster, which means that investors need to adjust their positions more sensitively. </strong></p><p>If the market really ushers in crazy monetary easing, we <strong>may</strong> see a similar altcoin bull market in the past, but I think the probability of this happening is lower than the probability of not happening. Even if it does happen, the increase of most altcoins is only the market average, and it will not take off as it did in the past. </p><p>There are still a large number of altcoin projects to be launched this year, and market liquidity will still be diluted and dispersed, which requires special attention. </p><h2><strong>09 </strong><strong>Summary: A little hope</strong></h2><p>I have never seen a person who has studied the crypto market seriously for several years and finally failed to make money. </p><p><img src=\"https://img.jinse.cn/7346783_image3.png\"/>There are still many opportunities in the market, and the growth of this field is still worth looking forward to. In the final analysis, I don’t know anything better than others, but I keep adjusting myself according to the actual situation in this cycle. </p><p>One thing is also clear-we are no longer in the early stage of the bull market. Whether you make money or not, the bull market has lasted for a long time, and this fact will not change. </p><p>\"Control the downside risk, and the rise will follow naturally.\" This sentence is always applicable. </p><p><mp-style-type></mp-style-type></p></div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/d4fa7e7217438c0e61c46553250c3823.jpg",
            "link": "https://www.coinlive.com/news/why-is-this-round-of-bitcoin-bull-market-so-difficult",
            "pub_date": "2025-02-05 16:58:46",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 212732,
            "title": "FTX Creditors Set to Finally Receive Repayments After 3 Years of Waiting, First Payouts for Claims Under $50K Set for 18 February",
            "description": "<div class=\"share___SVvtl\"><div><h2>FTX to Begin Repayments for Smaller Creditors on 18 February 2025</h2><p>FTX creditors are finally seeing light at the end of the tunnel following a long and arduous legal battle that has lasted more than two years. </p><p></p><p>Creditors who filed claims under $50,000 in the FTX bankruptcy case are set to receive their first repayments on 18 February 2025 at 10:00 a.m. Eastern Time.</p><p></p><p>This marks a crucial moment in the long-running bankruptcy process that followed the exchange’s collapse in November 2022.</p><p></p><h2>Early Repayments For Small Creditors Begin This Month  </h2><p>A representative of FTX creditors, Sunil, confirmed that the repayments will be processed via BitGo, a crypto custody provider.  </p><p></p><p>Creditors eligible under the “Convenience Class” category—those with claims up to $50,000—will receive their full adjudicated claim value along with 9% annual interest, calculated from the date FTX filed for bankruptcy.</p><p></p><div class=\"media-wrap embed-wrap\"><div><blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\">Important: FTX Distribution<br/><br/>3rd Jan 25: Initial Distribution Record Date<br/>Feb/Mar 25: Convenience class holders &lt;$50k = $1.2bn (119% paid within 60 days of today)<br/><br/>&gt; $50k = $10.5bn<br/><br/>FTX customers need to complete<br/><br/>1) KYC<br/>2) Complete W-8 Ben form<br/>3) Onboard with distribution… <a href=\"https://t.co/43ZfirJNX3\">pic.twitter.com/43ZfirJNX3</a></p>— Sunil (FTX Creditor Champion) (@sunil_trades) <a href=\"https://twitter.com/sunil_trades/status/1875114649768907057?ref_src=twsrc%5Etfw\">January 3, 2025</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p></p><p>These creditors will access their funds through the FTX Digital Claim Portal, with many already receiving email confirmations regarding the payout schedule.  </p><p></p><p>Payments will be officially processed on 18 February, and once completed, the associated claims will be canceled.</p><p></p><div class=\"media-wrap embed-wrap\"><div><blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\">FTX Repayments: 18 Feb 2025 <br/><br/>Funds available from 10am ET<br/>FTX Claims &lt; $50k<br/><br/>FTX Creditors in the Bahamas process have email confirmation that repayments will start on 18 Feb 2025<br/><br/>9% interest per annum from 11 Nov 2022 <a href=\"https://t.co/FrmDN4qiK7\">pic.twitter.com/FrmDN4qiK7</a></p>— Sunil (FTX Creditor Champion) (@sunil_trades) <a href=\"https://twitter.com/sunil_trades/status/1886796657259376733?ref_src=twsrc%5Etfw\">February 4, 2025</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p></p><h2>Interest Compensation For Delayed Repayments  </h2><p>To compensate for the prolonged legal and financial uncertainty faced by creditors, the bankruptcy estate has included a 9% annual interest on eligible claims.  </p><p></p><p>This interest is calculated from 11 November 2022 until the payment date.  </p><p></p><p>The addition of post-petition interest is a response to the significant delays in returning funds, particularly as the appreciation in crypto asset values since FTX’s collapse has complicated the bankruptcy proceedings.  </p><p></p><h2>FTX Users Outside The Bahamas Must Wait Longer  </h2><p>While creditors in the Bahamas liquidation process will be the first to receive payments, other former FTX users will have to wait.  </p><p></p><p>According to a creditor advocate, reimbursements for non-Bahamian creditors will begin on 4 March 2025.  </p><p></p><div class=\"media-wrap embed-wrap\"><div><blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\">FTX To Begin Creditor Repayments on Feb 18<br/><br/>🚨 Three years after its collapse, FTX will start repaying creditors on Feb 18, 2024—beginning with claims under $50K in the Bahamas via BitGo.<br/><br/>💰 Other creditors expected to receive payouts by March 4.<br/><br/>📈 FTX’s crypto holdings have… <a href=\"https://t.co/GBKXBdy9vw\">pic.twitter.com/GBKXBdy9vw</a></p>— Crypto Junction (@CJunctionX) <a href=\"https://twitter.com/CJunctionX/status/1887009193397248366?ref_src=twsrc%5Etfw\">February 5, 2025</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p></p><p>BitGo will handle all transactions, though payments may appear as pending up to 10 days before the official distribution date.  </p><p></p><p>Funds will only be accessible once the transactions are fully processed.  </p><p></p><h2>Uncertainty Remains For Large Creditors  </h2><p>While this initial repayment brings relief to many smaller creditors, uncertainty looms over those with claims exceeding $50,000.  </p><p></p><p>There is no confirmed timeline for when they will receive their share, as the bankruptcy estate continues to work on asset recovery and settlement negotiations.  </p><p></p><p>FTX’s restructuring plan, approved in October 2024, prioritised smaller creditors to receive repayments first.  </p><p></p><p>Larger creditors are expected to receive distributions in later phases, though specific details remain unclear.  </p><p></p><h2>Potential Impact On The Crypto Market  </h2><p>The repayment process could inject significant capital into the crypto market, with industry analysts predicting a potential boost in trading activity.  </p><p></p><p>Some speculate that Bitcoin’s value could exceed $200,000, driven by FTX repayments and increasing regulatory clarity in the United States.  </p><p></p><p>FTX’s collapse left thousands of creditors in financial limbo, and while this marks a step forward, the bankruptcy estate continues its efforts to maximise recoveries for all affected parties.  </p><p></p><p>Further updates on additional repayments are expected in the coming months.  </p><p></p></div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/7a4c8124113f1acb8da4c06c95ceaf77.jpeg",
            "link": "https://www.coinlive.com/news/ftx-creditors-set-to-finally-receive-repayments-after-3-years",
            "pub_date": "2025-02-05 16:39:31",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 212730,
            "title": "Asian Super Rich Investors Are Eyeing Singapore's Crypto Landscape As A Safe Haven To Safekeep Their Digital Assets",
            "description": "<div class=\"share___SVvtl\"><div><p>Trump's presidential election victory seems to have boldened rich Asian investors to invest more of their money into digital assets. </p><p></p><div class=\"media-wrap embed-wrap\"><div><blockquote class=\"twitter-tweet\" data-media-max-width=\"560\"><p dir=\"ltr\" lang=\"en\">JUST IN: 🇺🇸 Mike Novogratz says after Trump's win, he sees a \"substantial shift in the energy\" of the crypto industry.<br/><br/>This will bring “hundreds of billions” into the ecosystem 🙌 <a href=\"https://t.co/HAi4Q2MToC\">pic.twitter.com/HAi4Q2MToC</a></p>— Bitcoin Magazine (@BitcoinMagazine) <a href=\"https://twitter.com/BitcoinMagazine/status/1854164028517384440?ref_src=twsrc%5Etfw\">November 6, 2024</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p></p><p>In a recent interview with Nikkei, Gerald Goh, the CEO of Sygnum-a Singapore-based virtual asset banking group-revealed that his firm's new client onboarding rate nearly tripled in the weeks following Trump's win. </p><p></p><div class=\"media-wrap embed-wrap\"><div><blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\">Singapore Leads The World In Blockchain Adoption<br/><br/>The Lion City stacked the biggest wins in 2024, ranking number one in the world for overall blockchain positivity.<br/><br/>The dropped 13 MPI crypto licenses like it’s nothing and solidified their rep as a hub for decentralized dreams.… <a href=\"https://t.co/wJIBE1OYHl\">pic.twitter.com/wJIBE1OYHl</a></p>— Mario Nawfal’s Roundtable (@RoundtableSpace) <a href=\"https://twitter.com/RoundtableSpace/status/1874642798105833568?ref_src=twsrc%5Etfw\">January 2, 2025</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p></p><p>Goh noted that investors are generally more open to incorporating crypto investments as part of their investment portfolio. </p><blockquote> “We’ve already seen in 2024 an improvment in mood, let's say, in the sentiment, on the crypto side.”</blockquote><p></p><h1>Singapore: A Magnet for Crypto Wealth</h1><p>In a January report, Singaporean financial regulators revealed that the number of family offices (private wealth management firms that cater to high-net-worth individuals and families) in Singapore spiked to over 2,000 compared to 1,400 the year before. </p><p></p><p>Singapore's political stability has long attracted investors from Malaysia, Thailand, China and Bangladesh seeking to safeguard their wealth. The victory of President Trump has further elevated investors' interest in crypto, resulting in an influx of investors flocking to Singapore. </p><p></p><div class=\"media-wrap embed-wrap\"><div><blockquote class=\"twitter-tweet\" data-media-max-width=\"560\"><p dir=\"ltr\" lang=\"en\">“A lot of Indonesian, Chinese and Indonesians and Malaysians coming to Singapore as the port of safe haven.”<br/><br/>Singapore is more crazy rich than ever as Asia’s wealthiest try to ride out the <a href=\"https://twitter.com/hashtag/Covid19?src=hash&amp;ref_src=twsrc%5Etfw\">#Covid19</a> pandemic with prolonged stays, <a href=\"https://twitter.com/Davidramli?ref_src=twsrc%5Etfw\">@Davidramli</a> reports <a href=\"https://t.co/5Pz7Gc4woO\">pic.twitter.com/5Pz7Gc4woO</a></p>— Bloomberg Originals (@bbgoriginals) <a href=\"https://twitter.com/bbgoriginals/status/1397752113019691009?ref_src=twsrc%5Etfw\">May 27, 2021</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p></p><p>Independent Reserve, a crypto exchange based in Singapore revealed that the number of family offices in its client base grew 20% in 2024 compared to 2023. During his interview with Nikkei, Ceo Lasanka Perera said </p><p>\"We've seen more interest and inquiries from private bankers and family offices. The postelection rally and a crypto friendly administration has raised expectations for constructive U.S regulations, which could reduce risks and encourage greater participation from wealthy investors.\"</p><p></p><p>Despite growing enthusiasm, challenges persist. The Monetary Authority of Singapore-a government agency which regulates crypto and other financial markets-infamously holds a very strict stance when it comes to the direct marketing of crypto to retail investors, and exchange platforms often have to walk a fine line to avoid regulatory sanctions. </p><p></p><div class=\"media-wrap embed-wrap\"><div><blockquote class=\"twitter-tweet\" data-media-max-width=\"560\"><p dir=\"ltr\" lang=\"en\">Asia is one of the dominant forces in crypto. 🌏<br/><br/>From China’s mining power to Singapore’s progressive regulations, the East is leading the way. 🚀<br/><br/>Which Asian country do YOU think will shape the future of crypto? 🇨🇳🇯🇵🇰🇷 <a href=\"https://t.co/HjiNLrKoNH\">pic.twitter.com/HjiNLrKoNH</a></p>— ThePrivateKey (@PrivateKeyProd) <a href=\"https://twitter.com/PrivateKeyProd/status/1885730450007552061?ref_src=twsrc%5Etfw\">February 1, 2025</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p></p></div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/6f7f69b5e5cbdb4e7ec5d778fa54406f.png",
            "link": "https://www.coinlive.com/news/asian-super-rich-investors-are-eyeing-singapore-s-crypto-landscape-as",
            "pub_date": "2025-02-05 16:18:19",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 212728,
            "title": "OpenAI Partners with South Korea's Tech Giant Kakao to Launch Korean-Language AI Assistant",
            "description": "<div class=\"share___SVvtl\"><div><h2>OpenAI Expands Reach in Asia with Kakao Partnership</h2><p>OpenAI has taken another significant step in its international expansion by forming a partnership with Kakao, South Korea's tech giant.  </p><p></p><p>This collaboration, announced during a press conference in Seoul, will see OpenAI’s technology integrated into Kakao's services, including the popular messaging app KakaoTalk, which dominates the South Korean market with a staggering 97% share.</p><p></p><div class=\"media-wrap embed-wrap\"><div><blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\">OpenAI’s CEO Sam Altman has signed a deal with South Korean tech giant Kakao as his firm seeks new alliances after Chinese rival DeepSeek shook the global AI industry. <a href=\"https://t.co/m3BCXeAFKZ\">pic.twitter.com/m3BCXeAFKZ</a></p>— Al Jazeera English (@AJEnglish) <a href=\"https://twitter.com/AJEnglish/status/1886724094600863845?ref_src=twsrc%5Etfw\">February 4, 2025</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p></p><p>The companies will also work on developing a new Korean-language assistant, Kanana, powered by OpenAI's advanced capabilities.  </p><p></p><p>Additionally, Kakao will adopt OpenAI's ChatGPT Enterprise for internal use across its operations.  </p><p></p><h2>Strategic Moves in Asia Fuel AI Growth</h2><p>This partnership with Kakao is part of a broader strategic shift by OpenAI, with CEO Sam Altman actively engaging with key tech leaders across Asia. </p><p></p><div class=\"media-wrap image-wrap\"><img class=\"media-wrap image-wrap\" src=\"https://image.coinlive.com/cryptotwits-static/290205992406e1b720201bcc25c3d43d.jpg\"/></div><p style=\"text-align:center;\"><em><span style=\"color:#999999\">Kakao is a South Korean tech giant that powers many aspects of daily life for Koreans, from messaging and social media to ride-hailing and finance. </span></em></p><p></p><p>Altman highlighted the region’s rapid growth in AI adoption, noting the importance of countries like South Korea for the future of OpenAI.</p><p></p><p>He remarked, </p><p></p><blockquote>\"Korea is a very impressive market. The adoption of AI in Korea is remarkably advanced. Considering various industries, from energy to semiconductors and internet companies, there is a very strong environment conducive to applying AI. It is a market that is extremely important to us and is growing rapidly.”</blockquote><p></p><h2>SoftBank, Samsung, and AI Infrastructure Projects</h2><p>Alongside the Kakao deal, Altman has been meeting with major industry players such as SoftBank, Samsung Electronics, and semiconductor producer SK Hynix.  </p><p></p><p>SoftBank’s involvement is particularly significant, as the Japanese conglomerate has <a href=\"https://www.coinlive.com/news/softbank-collaborates-with-openai-to-launch-ai-tools-for-corporations\" target=\"\">pledged $3 billion annually to implement OpenAI’s solutions</a> across its global operations.  </p><p></p><p>This includes the creation of SB OpenAI Japan, a joint venture aimed at delivering OpenAI’s enterprise solutions to Japanese businesses.  </p><p></p><p>Altman also visited Samsung's offices to discuss potential collaborations on AI-powered devices, including custom-designed chips, with SK Hynix and Samsung playing a crucial role in developing high-bandwidth memory chips for AI processors.</p><p></p><h2>AI Data Centres and The Stargate Initiative</h2><p>A key component of OpenAI's growth strategy is the Stargate project, a venture with Oracle and SoftBank to build advanced AI data centres in the United States.</p><p></p><div class=\"media-wrap embed-wrap\"><div><blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\">Samsung Chairman Lee Jae-Yong, OpenAI CEO Sam Altman, and Softbank Chairman Son Jeong-ui Discuss 'Stargate' AI Project 🚀 <a href=\"https://t.co/yp4pw7JilD\">pic.twitter.com/yp4pw7JilD</a></p>— Ai Times (@timeforainews) <a href=\"https://twitter.com/timeforainews/status/1886809436846494205?ref_src=twsrc%5Etfw\">February 4, 2025</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p></p><p>Altman revealed that many Korean companies will contribute to this initiative, though specific details were not disclosed.  </p><p></p><p>The Stargate project, backed by significant investments, aims to enhance the AI infrastructure needed to support generative AI services like ChatGPT.  </p><p></p><h2>Deepening Engagement with Regional Markets</h2><p>The move into South Korea and Japan is also part of OpenAI’s ongoing effort to expand its presence in non-English-speaking markets.  </p><p></p><p>With the emergence of new AI players like <a href=\"https://www.coinlive.com/news/chinese-ai-app-deepseek-tops-us-app-charts-but-it\" target=\"\">DeepSeek</a> in China, OpenAI is keen to ensure its services cater to a more diverse user base, training models on regional languages and user behaviours.</p><p></p><p>The deal with Kakao gives OpenAI access to millions of consumers in South Korea, marking an important step in enhancing its multilingual capabilities.  </p><p></p><p>In addition to the Kakao partnership, Altman’s visit to South Korea has allowed OpenAI to further cement its relationships with local tech giants, ensuring its products remain at the forefront of AI innovation in the region.</p></div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/f70d6b6f612350eb0fe2a4efcbc08890.jpeg",
            "link": "https://www.coinlive.com/news/openai-partners-with-kakao-to-launch-korean-language-ai-assistant",
            "pub_date": "2025-02-05 15:27:01",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 212727,
            "title": "Google CEO Forecasts $75 Billion in Spending for 2025 with AI Heavily Dominating Capital Expenditures: Strategic Vision or Overreach?",
            "description": "<div class=\"share___SVvtl\"><div><h1>Google’s $75B Capex for 2025 is Mainly Set Aside for AI</h1><p><a href=\"https://www.coinlive.com/news/google-sees-surge-in-how-to-buy-crypto-queries-amidst \" target=\"\">Google</a> CEO Sundar Pichai plans to invest approximately $75 billion in capital expenditures for 2025, a 43% increase from the company’s $32.3 billion in 2023, with AI expected to be the primary focus. </p><p></p><p>Pichai said in a statement in Google parent <a href=\"https://abc.xyz/assets/a3/91/6d1950c148fa84c7d699abe05284/2024q4-alphabet-earnings-release.pdf  “We expect to invest approximately $75 billion in capital expenditures in 2025.”\" target=\"\">Alphabet’s fourth-quarter 2024 earnings report:</a></p><blockquote>“We expect to invest approximately $75 billion in capital expenditures in 2025.”</blockquote><div class=\"media-wrap embed-wrap\"><div><blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\">Despite Google parent Alphabet announcing a plan to invest $75 billion on its AI buildout, the company’s shares slid in after-hours trade <a href=\"https://t.co/Rm5gKvUv9E\">https://t.co/Rm5gKvUv9E</a><a href=\"https://t.co/faGDNgsFvq\">pic.twitter.com/faGDNgsFvq</a></p>— Reuters Business (@ReutersBiz) <a href=\"https://twitter.com/ReutersBiz/status/1887014541218996733?ref_src=twsrc%5Etfw\">February 5, 2025</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p>He emphasized that the investment will accelerate AI advancements while strengthening Google’s core businesses. </p><p></p><p>Though the exact AI allocation remains undisclosed, the majority is likely earmarked for expanding AI infrastructure. </p><p></p><p>This move aligns with broader industry trends, as <a href=\"https://www.coinlive.com/news/meta-rolls-out-frontier-ai-framework-to-constrain-high-risk-ai \" target=\"\">Meta has also announced a $65 billion investment to scale its AI capabilities. </a></p><div class=\"media-wrap embed-wrap\"><div><iframe allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen=\"\" frameborder=\"0\" height=\"315\" referrerpolicy=\"strict-origin-when-cross-origin\" src=\"https://www.youtube.com/embed/URIsVKPmhGg?si=N8bF9OjIgNYd1irN\" title=\"YouTube video player\" width=\"560\"></iframe></div></div><p></p><h1>Alphabet’s Revenue Dropped</h1><p>AI has been a major revenue driver for <a href=\"https://www.coinlive.com/news/tech-meets-academia-google-harvard-collaboration-1-million-books-as-ai \" target=\"\">Google</a>, contributing to a 12% year-over-year increase, bringing total revenue to $96.5 billion. </p><p></p><p>Google Cloud revenue also saw a 10% rise to $12 billion, fuelled by steady growth in AI infrastructure, core cloud products, and generative AI solutions. </p><div class=\"media-wrap embed-wrap\"><div><blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\">2/ AI Overviews are now in 100+ countries, and drive higher satisfaction + Search usage. Circle to Search is going great too. 2025 is going to be a big year for Search innovation as AI continues to expand the universe of queries people can ask.</p>— Sundar Pichai (@sundarpichai) <a href=\"https://twitter.com/sundarpichai/status/1886894687467798615?ref_src=twsrc%5Etfw\">February 4, 2025</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p>However, Alphabet’s total revenue narrowly missed analyst projections of $96.7 billion, leading to a 7% drop in its share price after hours, according to Yahoo Finance. https://finance.yahoo.com/quote/GOOG/ </p><p></p><p>During a 4 February investor call, Pichai downplayed competitive threats, including <a href=\"https://www.coinlive.com/news/chinese-ai-app-deepseek-tops-us-app-charts-but-it \" target=\"\">China-based AI model DeepSeek,</a> which disrupted the market in January. </p><p></p><p>He emphasized that Google’s Gemini 2.0 Flash models rank among the most efficient, even when compared to DeepSeek’s latest iterations.</p><p></p><p></p></div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/3f33310040de625798358d5fc87135a2.jpeg",
            "link": "https://www.coinlive.com/news/google-ceo-forecasts-75-billion-in-spending-for-2025-with",
            "pub_date": "2025-02-05 15:19:29",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 212725,
            "title": "Telegram CEO Pavel Durov Lauds China's AI Success As A Direct Result Of China's Soviet-Style Educational System. Is U.S Really Losing Its Innovation Edge?",
            "description": "<div class=\"share___SVvtl\"><div><p>Telegram founder Pavel Durov recently praised China's educational system, attributing the country's rapid advancement in artificial intelligence to its rigorous and competitive approach.</p><p></p><div class=\"media-wrap embed-wrap\"><div><blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\">Telegram founder Pavel Durov says China’s rise in AI, shown by DeepSeek’s success, stems from its Soviet-style education system, which fosters fierce competition—unlike Western schools that hide grades to protect feelings. “Eliminate the losers, and you eliminate the winners.” <a href=\"https://t.co/AHbrEsd9xY\">pic.twitter.com/AHbrEsd9xY</a></p>— Brian McDonald (@27khv) <a href=\"https://twitter.com/27khv/status/1884650510063440087?ref_src=twsrc%5Etfw\">January 29, 2025</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p></p><p>Durov's statement came in light of the recent rise of Chinese AI company DeepSeek. Durov praised China for its ability to so quickly catch up with U.S companies like OpenAI in terms of technological innovation. </p><p></p><p>He pointed out that China's AI progress is not a sudden phenomenon but a result of long-term educational practices.</p><p></p><h1>A soviet style education system</h1><p>This competitive and cut-throat educational system has allowed China to nurture students that has consistently outperformed children from other countries in the fields of math, science, and programming.</p><p></p><p>Durov cited China's success in mathematics and programming at international Olympiads, noting that China leads the U.S in gold medals in both the international Mathematics Olympiad and the international Olympiad in Informatics.</p><p></p><div class=\"media-wrap embed-wrap\"><div><blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\">China’s success in AI stems from its Soviet-style education system, which fosters strong competition — unlike Western schools that hide grades to protect feelings. If the US doesn’t reform its education system, it risks ceding tech leadership to China. <a href=\"https://t.co/VmO6hRvkJX\">https://t.co/VmO6hRvkJX</a></p>— Pavel Durov (@durov) <a href=\"https://twitter.com/durov/status/1884710931260694555?ref_src=twsrc%5Etfw\">January 29, 2025</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p></p><p>Durov gave an example of how Western schools tend to discourage competition and even shy away from sharing students grades publicly to protect students from pressure. </p><p></p><p>He argued that while such a move is understandable to protect your students from pressure, these measures can demotivate high-achieving students. Durov strongly believes that victory and defeat are intrinsic parts of a child's personal growth...</p><p>\"Victory and defeat are two sides of the same coin. Elimate the losers-and you eliminate the winners.\"</p><p></p><p>He further explained that telling all your students they are champions regardless of performance may seem kind at first, but it doesn't reflect the reality of the real world, where achievements are measured through performance and rankings in fields like science, business, and technology. </p><p></p><h1>Netizens reacts to Durov's statement </h1><p>While many netizens have agreed with Durov to some degree, stating the famous saying \"no pain,no gain.\" </p><p></p><p>Others are stating that only through competition can we really fuel innovation.</p><p></p><div class=\"media-wrap embed-wrap\"><div><blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\"><a href=\"https://twitter.com/durov?ref_src=twsrc%5Etfw\">@durov</a> True words! 🚀 Competition fuels innovation. Just like in AI, it's the same in GameFi – only the strongest ecosystems survive. We're building the first RPG clicker on TON with AI-driven content. Hope to see Telegram leading the way in both tech and gaming! 🔥💪</p>— LitrBull (@litrbull) <a href=\"https://twitter.com/litrbull/status/1884925543893668335?ref_src=twsrc%5Etfw\">January 30, 2025</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p></p><p>But there are also many others who disagreed with Durov as well. For example, one users called China's communist model of education an abject failure and claimed that China will never be able to surpass the U.S in innovation. </p><p></p><div class=\"media-wrap embed-wrap\"><div><blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\">You are a successful entrepreneur but your knowledge of China is shallow, I was educated in China for half my life and I can responsibly tell you that the communist model of education is an abject failure and China will never be able to surpass the US in innovation.</p>— WangHanzhe (@wang_hanzhe) <a href=\"https://twitter.com/wang_hanzhe/status/1885145394998632815?ref_src=twsrc%5Etfw\">January 31, 2025</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p></p><p>Another netizen expressed that the situation is more nuanced than how Durov is putting it, adding that China's AI success is also a result of other factors such as diversity, creativity and critical thinking and not just competition. The writer adds that the western schools prioritize empathy and collaboration, which created a whole different success story for the U.S.</p><p></p><div class=\"media-wrap embed-wrap\"><div><blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\">Not so Sir. China's AI success can't be attributed solely to its education system. Innovation thrives on diversity, creativity &amp; critical thinking &amp; not just competition. Western schools prioritize empathy, collaboration &amp; individuality essential for groundbreaking advancements.</p>— Dr Coins (@coinses) <a href=\"https://twitter.com/coinses/status/1884985889194979597?ref_src=twsrc%5Etfw\">January 30, 2025</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p></p><p>Regardless of what you think of China's educational system, one thing remains unchanged-China students are outperforming their western counterparts in STEM. </p><p></p><p>For this reason, Durov warns that if the U.S does not fix its educational system, it risks losing its tech dominance to the Chinese.</p><p></p></div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/3232283cba4b06c7e3b5cd0f6a253f8e.png",
            "link": "https://www.coinlive.com/news/telegram-ceo-pavel-durov-lauds-china-s-ai-success-as-a",
            "pub_date": "2025-02-05 14:23:07",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 212724,
            "title": "Travala’s Web3 Expansion: Crypto Payments Now Accepted at Over 2.2M Hotels on Trivago, Will More Users Be Onboarded to Crypto?",
            "description": "<div class=\"share___SVvtl\"><div><h1>Travala Partners Trivago with Crypto Payments for Hotel Bookings</h1><p><a href=\"https://www.coinlive.com/news/travala-ava-momentum-wanes-despite-record-rally-and-cz-s-faithful \" target=\"\">Travala, a leading Web3 travel platform</a>, is expanding crypto-powered hotel bookings through a new partnership with Trivago, a global accommodation metasearch engine. </p><p></p><p>This collaboration enables Trivago users to book over 2.2 million properties from Travala’s inventory using cryptocurrencies like Bitcoin, Ether, and more than 100 other digital assets. </p><div class=\"media-wrap embed-wrap\"><div><blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\">Travala continues to bridge the gap between crypto and mainstream with giants like Trivago, Skyscanner, and Kayak. Paving the way to onboard the next billion users to crypto. 💪 <a href=\"https://t.co/c72YeMbT1j\">https://t.co/c72YeMbT1j</a></p>— Juan Otero (@joterovila) <a href=\"https://twitter.com/joterovila/status/1886754997138022903?ref_src=twsrc%5Etfw\">February 4, 2025</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p>Travala co-founder and CEO Juan Otero emphasized that the partnership aligns with a growing industry shift toward alternative payment methods. </p><p></p><p>He noted:</p><blockquote>“With the ongoing widespread adoption of crypto, it’ll only take one major player to integrate crypto payments into their travel platform for everyone else to follow suit.”</blockquote><p>With Trivago operating in over 190 countries and attracting more than three million unique monthly users, this integration could significantly boost crypto adoption in the travel sector.</p><p></p><h1>Book With Crypto &amp; Earn BTC and AVA Rewards</h1><p>Travala is enhancing its cryptocurrency-based bookings on Trivago by offering rewards in Bitcoin and its native Ava (AVA) loyalty tokens. </p><p></p><p>This initiative follows the <a href=\"https://www.coinlive.com/news/crypto-travel-platform-travala-expands-with-bitcoin-and-ava-reserves \" target=\"\">platform’s 11 December 2024, launch of a Bitcoin and AVA treasury reserve plan, a milestone reached after surpassing $100 million in gross annual revenue. </a></p><div class=\"media-wrap embed-wrap\"><div><blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\">Real utility wins 💪<a href=\"https://twitter.com/hashtag/Travala?src=hash&amp;ref_src=twsrc%5Etfw\">#Travala</a> has smashed $100m in annual revenue powered by <a href=\"https://twitter.com/search?q=%24AVA&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$AVA</a> and the unstoppable force of <a href=\"https://twitter.com/hashtag/Bitcoin?src=hash&amp;ref_src=twsrc%5Etfw\">#Bitcoin</a> ✈️🔥<br/><br/>Thank you for believing in us - this is just the beginning 🙏<a href=\"https://twitter.com/hashtag/CryptoTravel?src=hash&amp;ref_src=twsrc%5Etfw\">#CryptoTravel</a><a href=\"https://t.co/F7sK4AIQQs\">https://t.co/F7sK4AIQQs</a></p>— Juan Otero (@joterovila) <a href=\"https://twitter.com/joterovila/status/1866834224894099884?ref_src=twsrc%5Etfw\">December 11, 2024</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p>Unlike traditional booking platforms, <a href=\"https://www.coinlive.com/news/travala-enhances-crypto-travel-with-solana-payments-and-up-to \" target=\"\">Travala </a>differentiates itself with crypto-based incentives, aligning with industry calls for blockchain applications that drive real-world adoption. </p><p></p><p>Otero added:</p><blockquote>“On top of this, Travala has an integrated crypto-based loyalty program that offers crypto rewards instead of traditional loyalty points.”</blockquote><p>Experts emphasize that onboarding the next 500 million users will require intuitive apps with practical use cases. </p><p></p><p>Justin Hyun, director of investments at The Open Network Foundation, suggests that tools like <a href=\"https://www.coinlive.com/news/telegram-crypto-game-trump-s-empire-leverages-trump-s-hype-will-the \" target=\"\">Telegram</a> Mini Apps could serve as a “Trojan Horse” for mainstream adoption. </p><p></p><p></p></div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/6444939fa682446915041d07d94da837.jpeg",
            "link": "https://www.coinlive.com/news/travala-s-web3-expansion-crypto-payments-now-accepted-at-over-2-2m",
            "pub_date": "2025-02-05 13:45:21",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 212722,
            "title": "Hayes: Why BTC may fall to $70,000 before rising to $250,000",
            "description": "<div class=\"share___SVvtl\"><div><p>Original title: <a href=\"https://cryptohayes.medium.com/the-ugly-dfba4f46ebd4\" target=\"_blank\" textvalue=\"The Ugly\">The Ugly</a></p><p>Author: Arthur Hayes, founder of BitMEX; Translator: Deng Tong, Golden Finance</p><p><em>\"The Ugly\" is the first of three articles. \"The Good\" will focus on the rise of political meme coins. \"The Bad\" will discuss the risk that US cryptocurrency holders face being deceived by the Trump administration in terms of cryptocurrency regulatory policies.</em></p><p><em>Disclaimer: I am an investor and advisor to Ethena, the parent company of the $USDe stablecoin I mentioned many times in this article.</em></p><p>\"Stop - keep thirty meters on this slope\", that's what my guide instructed me when he suddenly slowed down while we were skiing on a dormant volcano a few weeks ago. Before that, it had been cold to climb the slope. But at 1600m, something changes. </p><p>As we stop together on the ridgeline, my guide says, “The last section gives me a stomach churning. The avalanche risk is too high, so we’ll ski from here.” I feel differently as I detect subtle yet profound changes in the snowpack. This is why I always ski with a certified guide. A seemingly innocuous patch of terrain could seal me in a frozen tomb. One never knows if skiing a particular terrain will trigger an avalanche. Still, if the perceived probability is outside one’s comfort zone, it’s wise to stop, reassess, and change course. </p><p>For at least the first quarter, in my first post of the year, I showed the world my optimism. But as January ended, my excitement faded. I was distracted by the subtle shifts in the levels of central bank balance sheets, the pace of bank credit expansion, the relationship between the US 10-year Treasury/stock/Bitcoin prices, and the crazy $TRUMP memecoin price action. This feeling is similar to how I felt in late 2021, just before the crypto markets hit bottom. </p><p>History doesn’t repeat itself, but it always rhymes. <span style=\"color: rgb(0, 112, 192);\"><strong>I don’t believe this bull cycle is over; however, looking at forward-looking probabilities, I think it’s more likely that we see Bitcoin prices fall to $70,000-$75,000 and then rise to $250,000 by the end of 2025 than continue higher without a substantial correction. </strong></span>As a result, Maelstrom has increased his Ethena $USDe stake to record levels and continues to take profits on several altcoin positions. We remain net long, but if my feeling is correct, then we have a lot of capital ready to buy dips in Bitcoin and big dips in many quality altcoins. </p><p>With bullish sentiment so high right now, a pullback of this magnitude would be unwelcome. Trump continues to say the right things via executive orders, improve sentiment by pardoning Ross Ulbricht, and inspire crypto spirits with his recent memecoin launch. But aside from the memecoin launch, these things were mostly expected. The rest of this article will discuss the charts and monetary policy announcements that led me to reduce my Maelstrom cryptocurrency holdings. </p><h2>U.S. Monetary Policy<br/></h2><p>There are two firm views that influence my view of U.S. monetary policy:</p><p><span style=\"color: rgb(0, 112, 192);\"><strong>- The 10-year Treasury yield will rise to between 5% and 6% and will cause a mini financial crisis.</strong></span></p><p><span style=\"color: rgb(0, 112, 192);\"><strong>- The Federal Reserve Board hates Trump but will do what is necessary to protect the financial system under the U.S. rule.</strong></span></p><p>Let me explain the interplay between these two views. <span style=\"font-size: 16px;\"></span></p><h2>10-Year Treasury Bond</h2><p>The dollar is the world's reserve currency and U.S. Treasury bonds are the reserve asset. This means that if you have extra dollars, buying Treasury bonds is the safest place to store them and earn a yield. Accountants consider Treasury bonds to be risk-free, and therefore, financial institutions are allowed to borrow money and assets using almost unlimited leverage. In the end, if the value of Treasury bonds falls rapidly, the accounting fairy tale will turn into an economic nightmare and systemically important financial players will go bankrupt.</p><p><span style=\"color: rgb(0, 112, 192);\"><strong>The 10-year Treasury bond is the benchmark for pricing most medium- to long-term fixed income instruments, such as mortgages or car loans. It is the most important asset price in the dirty fiat system, and that is why the 10-year yield is so important. </strong></span></p><p>Given that every financial crisis since 1913 (the day the Fed was founded) has been “solved” by printing dollars, leverage has been building up in the system for over a century. As a result, the execution yields when large financial institutions fail are gradually decreasing. When the 10-year Treasury briefly broke that level, former US Treasury Secretary Bad Gurl Yellen initiated a policy of issuing more and more T-bills as a covert way of printing money. The direct result was a drop in the 10-year Treasury yield to 3.60%, a local low for this cycle. </p><p>If 5% is the level, why did the yield rise from around 4.6% to over 5%? To answer this question, we need to understand who the marginal large buyers of Treasury bonds are. </p><p>It is well known that the United States is issuing debt at a rate unparalleled in the history of the empire. The total debt now stands at $36.22 trillion, up from $16.70 trillion at the end of 2019. Who is buying this crap? </p><p>Let’s look at the usual buyers. </p><p><strong>The Federal Reserve</strong> – The Fed ran a money-printing shenanigans called Quantitative Easing (QE) from 2008 to 2022. It bought trillions of dollars in U.S. Treasuries. However, starting in 2022, it turned off the printing presses, which is called quantitative tightening (QT). </p><p><strong>U.S. Commercial Banks</strong> – They were getting hammered buying Treasuries at all-time highs before being hit by temporary inflation and the Fed’s fastest rate hikes in 40 years. Worse, in order to comply with the pesky capital adequacy rules set by Basel III, they can’t buy Treasuries unless they pledge more expensive equity. As a result, their balance sheets are fully utilized and they can’t buy more Treasuries. </p><p><strong>Major Foreign Surplus Countries</strong> – I’m talking about oil exporters like Saudi Arabia and commodity exporters like China and Japan. As the dollars they earn from global trade surge, they have not been buying U.S. Treasuries. For example, China’s trade surplus as of November 2024 is $962 billion. During the same time frame, China’s holdings of Treasuries have fallen by about $14 billion. </p><p>Given that the U.S. has shoved Treasuries down the throat of the world’s financial system, there has not yet been a debt crisis. </p><p>Let’s applaud the relative value (RV) hedge funds. These funds, which are domiciled in places like the UK, the Cayman Islands, and Luxembourg for tax reasons, are marginal buyers of Treasuries. How do I know? The most recent Treasury Quarterly Refinancing Announcement (QRA) clearly states that they are marginal buyers of yield-constrained Treasuries. Moreover, if you read the monthly TIC reports published by the Treasury, you’ll see that the aforementioned places have accumulated significant holdings. </p><p>Here’s how the trade works. Whenever a cash Treasuries trade at a discount to its corresponding listed futures contract, the hedge funds can profit from the basis arbitrage. [1] The basis is so small that the only way to make money is to trade billions of dollars in notional amounts. Hedge funds don't have that much idle cash, so they need to turn to the banking system for leverage. The hedge fund buys the bonds with cash, but before the cash is delivered, a repurchase agreement (repo) is made with a large bank. The hedge fund delivers the bonds and receives cash. This cash is then used to pay for the bond purchase. Voila, the hedge fund bought the bonds with someone else's money. The only money the hedge fund paid was the margin at a bond futures exchange like the CME. </p><p>In theory, RV hedge funds can buy an endless amount of treasure, provided the following conditions are true:</p><p><span style=\"color: rgb(0, 112, 192);\"><strong>- The bank has enough balance sheet capacity to facilitate the repo.</strong></span></p><p><span style=\"color: rgb(0, 112, 192);\"><strong>- The repo yield is affordable. If the yield is too high, the underlying trade will not be profitable and the hedge fund will not buy the Treasury. - Margin requirements remain low. If a hedge fund has to pay more margin to hedge its bond purchases using futures contracts, it will buy fewer bonds. Hedge funds have limited capital; if much of it is tied up in trading, they will trade less. RV hedge fund buyers are at risk due to the factors above. Bank Balance Sheet/Repo Yields: Under Basel III, balance sheets are a finite resource. Supply and demand dictate that the closer supply gets to exhaustion, the higher the price of balance sheet space. So as the Treasury issues more debt and RV hedge funds do more underlying trades, which requires more repo, using more balance sheet, at some point the price of overnight repo spikes. Once that happens, the buying stops abruptly and the Treasury market starts to collapse. <span style=\"font-size: 16px;\"></span></strong></span></p><h3>Exchange Margin Requirements:</h3><p>Quite simply, the more volatile an asset is, the higher the margin requirements. When bond prices fall, volatility rises. If bond prices fall/yields rise, volatility (look at the MOVE index) spikes. When that happens, margin requirements on bond futures increase and RV hedge fund bond buying quickly decreases.</p><p>These two factors interact in a reflexive way. The question then becomes, is there a way to use monetary policy to sever the Gordon knot and allow RV hedge funds to continue financing the Treasury?</p><p>Of course, our monetary masters can always implement accounting gimmicks to fix the financial crisis. In this case, the Fed could suspend the Supplementary Leverage Ratio (SLR). Suspending the SLR in relation to Treasury holdings and related repo allows banks to use unlimited leverage. </p><p>After the SLR waiver, here’s what happens:</p><p>- Banks can buy as many Treasuries as they want without pledging any capital, freeing up space on their balance sheets.</p><p>- With an unrestricted balance sheet, banks can facilitate repos at affordable prices.</p><p><span style=\"color: rgb(0, 0, 0);\">The Treasury gains two more marginal buyers: commercial banks and RV hedge funds.</span></p><p>Bond prices rise, yields fall, margin requirements fall. Boom, happy days.</p><p>If the Fed is really feeling generous, it can stop QT and resume QE. That’s three marginal buyers.</p><p>What I wrote is not news to the Fed or the Treasury. The banking community has been begging for years for an SLR waiver like the one they got during the 2020 flu crisis. The latest Treasury Lending Advisory Committee (TABCO) report makes it clear that they need an SLR exemption and the Fed needs to start QE again to fix the Treasury market. The only thing missing is the political will of the Fed, so I take the second view. </p><h2>Fed Policy</h2><p>The comments of former and current Fed Governors and the Fed's actions during the Biden presidency lead me to believe that the Fed will do everything in its power to thwart Trump's agenda. However, there are limits to the Fed's obstruction. If the failure of large financial institutions or the solvency of the Empire itself requires changes in bank regulations, lowering the price of money, or printing money, then the Fed will not hesitate to act accordingly. <span style=\"font-size: 16px;\"></span></p><h3>What did they say to Trump? </h3><p>Here are two quotes, the first from former Fed Governor William Dudley (who served as president of the New York Fed from 2009 to 2018), the second from Powell:</p><p><em>U.S. President Donald Trump’s trade war with China continues to undermine business and consumer confidence and worsen the economic outlook. This manufactured disaster has put the Fed in a dilemma: Should it mitigate the damage by providing offsetting stimulus, or refuse to cooperate? … Officials can make it clear that the central bank will not bail out an administration that repeatedly makes poor choices on trade policy, making it clear that Trump will face the consequences of his actions … Some even argue that the election itself falls within the Fed’s purview. After all, Trump’s reelection arguably poses a threat to the U.S. and global economies, the Fed’s independence, and its ability to achieve its employment and inflation goals. </em></p><p><em>– The Fed Should Not Coddle Donald Trump, William Dudley</em></p><p>When asked at the policy meeting press conference how the Fed views Trump’s recent victory, Powell said that <em>“some did take a very preliminary step to start incorporating highly conditional estimates of the impact of policy on the economy into their forecasts.”</em>This is interesting. Before the election, one set of economic estimates was used to lower rates and help Harris, but now a different set of estimates is being considered because of Trump’s victory. In fact, the Fed should have used the same estimates in the months leading up to the election. But what do I know? I’m just a crypto fool. <span style=\"font-size: 16px;\"></span></p><h3>What did they do for Biden?</h3><p>In the beginning, inflation was temporary. Remember? Powell claimed in all seriousness that the inflation spike caused directly by the most money printing in the shortest period of time in US history was just a blip that would soon go away. Four years later, inflation has been running above their own manipulated, stupid, dishonest inflation measure. They use this sophistry to prevent the inevitable rate hikes from starting until 2022, knowing that it could lead to a financial crisis or recession. They are not wrong; the Fed is directly responsible for the regional banking crisis of 2023. </p><p>Then the Fed plays dumb. Yellen completely nullifies their monetary tightening campaign by issuing more T-bills to exhaust the Reverse Repurchase Program (RRP) starting in September 2022. At least the Fed can oppose the Treasury since they are supposedly independent of the federal government. </p><p>The Fed pauses rate hikes in September 2023, when inflation is still above target. In September 2024, they fuel money printing by initiating a rate cut cycle. Is inflation below their target? Not yet. </p><p>The Fed talks a lot about keeping inflation in check, but when it becomes a political imperative to keep government money flowing at affordable prices and stimulate financial asset markets, the Fed acts. It becomes a political imperative because the Biden administration was screwed from the start. In hindsight, the claim that Biden is a fraud may also be true. Regardless, in order to prevent the Republicans from taking back the House and Senate and Trump from winning reelection in 2024, the Fed did whatever it took to prevent a financial and economic crisis. <span style=\"font-size: 16px;\"></span></p><h3>What did they do for the system? </h3><p>In some cases, the Fed went beyond the call of duty to help the Democrats. For example, in response to the regional banking crisis in early 2023, the Fed created the Bank Term Funding Program (BTFP). The rate hike regime and subsequent bond crash led to a financial disaster, with banks losing money on the Treasury bonds they purchased at all-time high prices between 2020 and 2021. The Fed took notice of this corruption and, after letting three crypto-friendly banks fail to appease Pocahontas (U.S. Senator Elizabeth Warren), it essentially backstopped $4 trillion worth of Treasury bonds and mortgage-backed securities on the balance sheets of U.S. banks. </p><p>In hindsight, BTFP may have been an overkill. However, the Fed wants markets to have no doubt that it will preemptively fire the printing presses at full steam if there is a significant threat to the financial system under American rule. </p><h2>Powell the Traitor</h2><p>Powell is a traitor because he was appointed by Trump in 2018. This is not surprising, as the full force of Trumpism was weakened by a group of disloyal lieutenants during his first term. Whether you think this is a good or bad thing is irrelevant; the point is that the relationship between Trump and Powell is toxic at this point. After Trump's recent victory over Biden, Powell immediately quelled any doubts about a possible resignation; he intends to serve until May 2026. </p><p>Trump has often argued that the Fed must lower interest rates to make America great again. Powell responded, in his way, by saying that the Fed is “data dependent,” meaning they do whatever they want and tell the interns in their basement to make up some economic mumbo jumbo to justify their decisions. Remember DSGE, IS/LM, and the Ricardian equivalence? All of that is bullshit unless you work in the Marriner Eccles building. </p><p>How did Trump get the Fed on his side? He allowed a mini financial crisis to happen. Here’s one possible solution:</p><p>Continue to run huge deficits, which would require the Treasury to issue lots of debt. It’s telling that Trump chose Elon Musk to lead a meme department with no real power. Musk wouldn’t be as rich as he is without the billions of dollars the government has given Tesla in the form of subsidies and tax breaks. The Department of Government Efficiency (DOGE) is not a federal department because creating one requires congressional approval. It’s a glorified advisory role that reports to Trump. <span style=\"color: rgb(0, 112, 192);\"><strong>Musk’s power is purely meme. </strong></span>Memes are powerful, but they won’t cut health benefits and defense spending; only direct action by lawmakers can accomplish those difficult tasks. Why would a politician do this and jeopardize their reelection chances in 2026?</p><p>An immediate fight over the debt ceiling. Presumptive Treasury Secretary Bessant has many tools to head off a shutdown date. Yellen used them in the summer of 2023 when she was fighting the debt ceiling. Drawings from the Treasury General Account (TGA) provide fiscal stimulus to markets and keep the government well-funded for months; this delays the point at which politicians must reach a compromise to allow the Treasury to borrow again. Bessant can sit on the sidelines and not spend the TGA money. The Treasury market will grind to a halt, and nervous traders will sell Treasury bonds because they fear a default.</p><p>This recipe for a flammable cocktail will quickly push the 10-year Treasury yield above 5%. If Bessant confirms the debt ceiling date, and his department does not cut the TGA to keep the government running for a few months, this could happen in a matter of days.</p><p><span style=\"color: rgb(0, 112, 192);\"><strong>As Treasury yields soar, the stock market will plunge, and some large financial institutions in the US or abroad will come under great pressure.</strong></span>The Fed will be in a political dilemma, and in order to save the system, they will do some or all of the following:</p><p>- Provide SLR exemptions for Treasury bonds</p><p>- Cut interest rates significantly</p><p>- Stop QE</p><p>- Restart QE</p><p>Trump will then praise the Fed for its commitment to the US, and financial markets will re-energize.</p><p>The problem I described above could turn into a crisis caused by uncertainty about the debt ceiling now or later; the timing is up to Trump. The longer the crisis begins under Trump, the more likely he and his Republican Party will be blamed for a crisis that is largely due to the leverage accumulated during the Biden administration. In transactional terms, Trump must fix it once and for all. Voters must blame Biden and the Democrats, not Trump and the Republicans, for the crisis — otherwise Trumpism and Make America Great Again will become another stillborn American political movement that lasts less than two years until the Democrats return to power in the 2026 midterm elections. </p><p>The money printing spurt will come, but only if the Fed stands with Team Trump. The Fed is not the only game in town; is the banking system creating credit? </p><p><img alt=\"pZ3jizD7PdbQCfLqnA5LLOLx0i65Zhv84ohmUXtP.jpeg\" src=\"https://img.jinse.cn/7346741_watermarknone.png\" title=\"7346741\"/></p><p>No, as you can see from my custom bank credit index, it is the sum of bank reserves and other deposits and liabilities held by the Fed. </p><p>Credit must flow. If the pace of credit creation disappoints, the market will give back Trump’s shock. Let’s move on to China.</p><h2>China’s stimulus</h2><p>In the third quarter of last year, the People’s Bank of China (PBOC) announced a series of measures aimed at stimulating the economy. They cut bank reserve requirements, began buying Chinese government bonds (CGBs), and helped local governments refinance their debt burdens, to name just a few. This triggered a wild rally in the A-share market.</p><p><img alt=\"ffaKZckXksIkfMX4WCbqEyDQh4dE53S91G7xpEAl.jpeg\" src=\"https://img.jinse.cn/7346742_watermarknone.png\" title=\"7346742\"/></p><p>If your TikTok-swiping brain can’t figure out when the PBOC and the central government announced their reflationary policies, I circled them for you. Above is the Shanghai Composite Index. </p><p>I have pointed out that the Chinese government was prepared to let the RMB depreciate if necessary, as a result of the RMB credit expansion program.</p><p><img alt=\"lPvPA6xwY6bMXLvnRwgqYIX4NKCcfHTlNwCPVRsn.jpeg\" src=\"https://img.jinse.cn/7346744_watermarknone.png\" title=\"7346744\"/></p><p>The USD/RMB was allowed to appreciate, which meant that the USD would strengthen and the RMB would weaken. Everything went according to plan, but in early January, the Chinese government changed course.</p><p>On January 9, the People's Bank of China announced that it would end its bond purchase program. As can be seen in the above chart, the People's Bank of China intervened in the market and began to manipulate the RMB to strengthen. On the one hand, the central bank could not use RMB domestically to ease financial conditions, and on the other hand, it could destroy RMB to strengthen the currency.</p><h2>Japan's interest rate policy</h2><p>The Bank of Japan (BOJ) fulfilled its promise to continue raising interest rates. In their most recent meeting, they raised the policy rate by 0.25% to 0.50%. The consequence of the rate normalization program is that the central bank's balance sheet growth has stagnated. </p><p><img alt=\"cAHWgDyrVnNpfElZzQPEoomK1eez8gj7eng1W8sC.jpeg\" src=\"https://img.jinse.cn/7346745_watermarknone.png\" title=\"7346745\"/></p><p>With the policy rate rising, Japanese Government Bond (JGB) yields have also reached their lowest level in nearly 15 years. </p><p>The quantity of money is growing much slower than in modern times, while its price is rising rapidly. This is not a good time for the price of fiat-priced financial assets to rise. </p><p>USD/JPY is topping out. I believe USD/JPY will reach 100 (weaker USD, stronger JPY) in the next 3-5 years. As I have written extensively, the strengthening of the yen has caused Japanese companies to repatriate trillions of dollars in capital, and anyone who has borrowed in yen has had to sell assets as their holding costs have soared. The main concern in the fiat financial markets is how this sell-off will negatively impact Treasury prices. This is a long-term structural headwind that Bessent must deal with. It will eventually be dealt with using printed dollars issued through some kind of swap line facility, but until then, the pain must be felt to provide the political cover to provide the needed monetary support. Eroding Correlations</p><p>I have already explained why fiat liquidity conditions in the USD, RMB, and JPY are not conducive to price appreciation in fiat financial assets. Now, let me explain what this means for Bitcoin and crypto capital markets.</p><h2>Bond Investor Concerns</h2><p>We need to discuss what bond investors are worried about in Pax Americana. I will spend some time drawing conclusions from an excellent chart produced by Bianco Research that shows the price correlation of stocks and bonds over the 1-year and 5-year periods. </p><p><img alt=\"t4oi9EARJarBiCApYjlEie70JlJRwFbKi7hA0YPw.jpeg\" src=\"https://img.jinse.cn/7346746_watermarknone.png\" title=\"7346746\"/></p><p>Inflation was the nightmare of American investors from the 1970s to the early 2000s. Therefore, stock and bond prices were correlated. As inflation raged and had a negative impact on the economy, investors sold bonds and stocks at the same time. After China joined the World Trade Organization in 2001, the situation changed. American capitalists could outsource the US manufacturing base to China in exchange for better corporate profits at home, and growth rather than inflation became the main concern. In this case, falling bond prices meant that growth was accelerating, so stocks should do well. Stocks and bonds became uncorrelated. </p><p>As you can see, the one-year correlation surged in 2021, when inflation re-emerged during the COVID-19 crisis and hit a 40-year high. In the early stages of the Fed's rate hike cycle that began in early 2022, bond prices fell in lockstep with stocks. The relationship between stocks and bonds reverted to that of the 1970s-2000s. Inflation was the biggest concern. </p><p>This was clearly shown by the performance of the 10-year Treasury when the Fed paused rate hikes in September 2023 and began cutting rates in September 2024, when inflation was still above its 2% target. </p><p>Three charts below: Fed Funds Rate Cap (white) vs. 10-Year Treasury Yield (yellow)</p><p><img alt=\"wx5U6062vt7K1BuautnKcqyd1LrJs8fWXflbSGOD.jpeg\" src=\"https://img.jinse.cn/7346747_watermarknone.png\" title=\"7346747\"/></p><p><img alt=\"UI4ipbc9hYDY37aFSqHdK0sZGkOt4Sbg5h9Pb2n7.jpeg\" src=\"https://img.jinse.cn/7346748_watermarknone.png\" title=\"7346748\"/></p><p>As you can see, the market is worried about inflation because yields are rising even though the Fed is easing monetary conditions. </p><p><img alt=\"dc9Y60tiUPu75qHo892krbjErt1dMH5lBBlnUEwG.jpeg\" src=\"https://img.jinse.cn/7346749_watermarknone.png\" title=\"7346749\"/></p><p>Contrast the first two charts with the last rate cut cycle, which began in late 2018 and ended in March 2020. As you can see, yields fell when the Fed cut rates. </p><p>No matter what anyone says, money prices always affect fiat assets. Tech stocks are very sensitive to interest rates. You can think of them as a bond with an infinite maturity or duration. Simple math tells you that when you increase the discount rate on an infinite cash flow, its present value goes down. This math comes to the fore when the financial dysfunction yields hit the strike price. </p><p><img alt=\"U1hblaFWviifkeEwxKAWPOJzp7qazogHXrPCRJCj.jpeg\" src=\"https://img.jinse.cn/7346750_watermarknone.png\" title=\"7346750\"/></p><p>The chart above shows the Nasdaq 100 (white) versus the 10-year U.S. Treasury yield (yellow). At around 5%, stocks fell as yields rose, and rallied sharply when yields fell. This is part of a financial system focused on inflation rather than growth. </p><p>Let's put this together. The dollar, yuan, and yen are interchangeable in global financial markets. They all have their way into U.S. big tech stocks in some form or another. You may not like it, but it's true. I've just laid out step-by-step why, at least in the short term, the U.S., China, and Japan are not speeding up fiat money creation and, in some cases, raising the price of money. Inflation remains high and is likely to rise further in the near future as the world economies decouple. That is why I expect the 10-year yield to rise. What will happen to the stock market if it rises because of inflation fears and a rapidly increasing US debt with no marginal buyers in sight? The stock market will plummet. </p><p><span style=\"color: rgb(0, 112, 192);\"><strong>In the long term, Bitcoin is not correlated with stock prices, but in the short term the correlation can be high. This is the 30-day correlation of Bitcoin with the Nasdaq 100. The correlation is high and rising. If stocks fall because the 10-year yield rises, this is not good for short-term price predictions. </strong></span></p><p>Another belief of mine is that <span style=\"color: rgb(0, 112, 192);\"><strong>Bitcoin is the only truly global free market that exists. </strong></span>It is extremely sensitive to global fiat liquidity conditions; therefore, if a fiat liquidity crunch is imminent, its price will fall before stocks and will be a leading indicator of financial stress. If it is a leading indicator, then Bitcoin will bottom before stocks, predicting that the fiat money printing spigot will reopen.</p><p>If financial stress is due to a bond market crash, then the answer from the authorities will be to print money. First, the Fed will stand with Team Trump and do their patriotic duty…press the dat USD Brrr button. Then, China can reflate with the Fed without suffering currency weakness. Remember, everything is relative, and if the Fed creates more dollars, the People's Bank of China can create more yuan and the USD/CNY exchange rate will remain the same. The largest holdings of Japanese companies are in US dollar financial assets. Therefore, if the prices of the above assets fall, the Bank of Japan will pause its rate hike plans and ease financial conditions for the yen.</p><p>In short, a small financial crisis in the United States will provide the monetary mana that cryptocurrencies crave. It will also be politically expedient for Trump. Overall, this gives me a 60% confidence interval for the above scenario in Q1 or early Q2. <span style=\"font-size: 16px;\"></span></p><h2>Trading Probability and Expected Value</h2><p>As mentioned in the introduction, the increased risk of avalanches prevents us from continuing to ski. The key is not to fool around and not to find out. Extending this metaphor to cryptocurrencies, Maelstrom will hedge himself by underinvesting in the market. It's all about expected value, not whether I'm right. </p><p>How do I know I'm wrong? You never know, but in my opinion, if Bitcoin trades strongly with volume above $110,000 (a level reached during the peak of the $TRUMP memecoin mania) and the open interest continues to expand, then I would throw in the towel and buy back in with higher risk. More precisely, it's crazy that $TRUMP memecoin rose to a fully diluted value of nearly $100 billion in 24 hours. I bought it a few hours after its launch and sold it halfway through a weekend spa vacation. My travel expenses were paid for many times with just a few clicks on a smartphone. Trading shouldn’t be that easy, but it is during the manic phase. In my opinion, $TRUMP is a top signal, just like FTX buying the rights to the MLB umpire logo in the 2021 bull run. </p><p>Trading is not about being right or wrong, it’s about trading perceived probabilities and maximizing expected value. Let me explain my thought process. Obviously, these are perceived probabilities that can never be objectively known, but the game of investing involves making decisions with incomplete information. </p><p><span style=\"color: rgb(0, 112, 192);\"><strong>Why do I believe Bitcoin will have a 30% correction? </strong></span>I have been trading this market for over a decade and through three bull cycles. Given Bitcoin’s volatility, this type of pullback has occurred frequently throughout the bull run. What’s more, the market surpassed its all-time high in March 2024, right after Trump won reelection in early November 2024. Many people, myself included, have written extensively about how Trumpism portends an acceleration in money printing in the US and how other countries will boost their domestic economies with money printing programs. I think we will fall back to our previous all-time highs and give back all of the gains from Trump. 60% chance of a 30% correction in Bitcoin 40% chance of a continued bull run and a 10% increase in Bitcoin buybacks (60% * -30%) + (40% * 10%) = -14% expected value The math tells me that my approach to reducing risk is correct. I reduce risk by selling Bitcoin for the long term and holding more of my funds as collateral in USDe, which currently yields about 10% to 20% annually. If Bitcoin plummets, it will be Armageddon in the altcoin space, which is where I really want to play. As mentioned at the outset, Maelstrom has many liquid altcoin positions due to various early stage investments and advisory placements. We sold most of them. If Bitcoin drops 30%, the best quality stuff will sell for over 50%. The last super liquidation candle in Bitcoin will tell me when to reverse and buy crypto alts. </p><p>Let me repeat; if I am wrong, my downside is that we took profits early and sold some of the Bitcoin we purchased with our previous altcoin investment profits. But if I am right, then we have cash to quickly double or triple our money on the quality altcoins that took advantage of the general crypto market sell-off. </p><p>As a final note, when this article was delivered to my editor on the trading day of Monday, January 27, 2025, the market was in full panic mode as investors reassessed their bullish case for NVIDIA and American tech exceptionalism due to the launch of DeepSeek. Nasdaq futures were falling and cryptocurrencies were falling with them. DeepSeek is an AI model developed by a Chinese team that reportedly costs 95% less to train, yet outperforms the latest and greatest models from OpenAI and Anthropic. The problem with bubbles is that when investors start questioning one core tenet of their bullishness, they start questioning them all. And my concern is that they believe interest rates don’t matter. The panic among Western investors over DeepSeek may be the catalyst for their own panic about the current poor fiat liquidity situation and the secular rise in 10-year Treasury yields. Isn’t it interesting that China is embracing the open source movement while capitalist America clings to its walled garden? Competition is a beautiful thing. </p></div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/40a8a8a64ee9835efb6aa2ccc9741586.jpg",
            "link": "https://www.coinlive.com/news/hayes-why-btc-may-fall-to-70-000-before-rising-to",
            "pub_date": "2025-02-05 12:35:55",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        }
    ]
}