{
    "data": [
        {
            "id": 250253,
            "title": "Samsung Galaxy S26 Launches Its First “Agentic AI Phone.” What Does That Mean?",
            "description": "<div class=\"share___SVvtl\"><div><p>Samsung has unveiled the Galaxy S26 lineup, marketing it as the world’s first “agentic AI phone,” a device designed not just to answer prompts but to execute multi-step actions across apps on a user’s behalf.</p><p></p><p>At launch, Samsung is positioning the S26 as a turning point for mobile artificial intelligence — moving beyond reactive assistants toward proactive software agents capable of navigating apps, synthesizing information and completing tasks with minimal input.</p><p></p><h1>Gemini-powered agent takes control across apps</h1><p>At the center of the Galaxy S26 is a new implementation of Google’s Gemini, designed to function as an operating-level AI agent. </p><p></p><div class=\"media-wrap embed-wrap\"><div><blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\">Samsung announced that Galaxy AI will expand with multi-agent support and Perplexity integration on the upcoming S26 series. The update aims to enhance contextual understanding, real-time information retrieval, and smarter on-device AI experiences ahead of Galaxy Unpacked 2026. <a href=\"https://t.co/Fz2XHDl6cU\">pic.twitter.com/Fz2XHDl6cU</a></p>— EverImagineTech (@EverImagineTech) <a href=\"https://twitter.com/EverImagineTech/status/2025412240145605051?ref_src=twsrc%5Etfw\">February 22, 2026</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p></p><p>Rather than waiting for a command and returning a response, Gemini can open apps in background windows, move through interfaces and assemble multi-step workflows while the user continues using the phone.</p><p></p><p>During the product demonstration, Gemini parsed a busy family group chat discussing pizza orders, identified each person’s preferences, opened a food delivery app, built the cart and prepared checkout while waiitng for the user to give the final confirmation. </p><p></p><p>Hence the baseline is that the system does not complete payments without your final confirmation, maintaining a manual approval safeguard. At launch, the feature supports a limited list of major apps including food delivery, ride-hailing and retail platforms, rolling out first in the United States and South Korea as a preview release. </p><p></p><p>The shift is significant. For more than a decade, mobile AI assistants have largely been query-response tools. Samsung is now attempting to embed autonomous task execution directly into the smartphone operating layer, eliminating the need for repeated taps, app switching or voice commands.</p><p></p><h1>Multi-agent intelligence and AI-embedded hardware</h1><p>The Galaxy S26 does not rely on a single AI engine. Samsung is layering multiple agents to create what it describes as a collaborative AI stack. Alongside Gemini, the company has integrated Perplexity as a system-level research assistant capable of scanning open browser tabs and recent activity to synthesize answers without manual navigation.</p><p></p><div class=\"media-wrap embed-wrap\"><div><blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"ja\">🚨 Samsung が Perplexity への140億円投資でGoogle依存脱却を本格化<br/><br/>Galaxy S26からPerplexityをデフォルトAIに？この動きが示す重要なビジネス教訓について考えてみました。<br/><br/>多くの企業が陥る「一強依存」の罠<br/>・検索→Google一択 ・クラウド→AWS一択<br/>・AI→ChatGPT/Gemini一択… <a href=\"https://t.co/izafJxTW1W\">pic.twitter.com/izafJxTW1W</a></p>— 池田 朋弘 | ChatGPT最強の仕事術4万部突破！ (@pop_ikeda) <a href=\"https://twitter.com/pop_ikeda/status/1932362112195854537?ref_src=twsrc%5Etfw\">June 10, 2025</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p></p><p>Meanwhile, Bixby — Samsung’s long-standing assistant — has been rebuilt with contextual awareness. The assistant can interpret conversational cues such as eye strain and immediately surface relevant settings, or provide real-time information without redirecting users into separate apps.</p><p></p><p>Additional agent-driven features extend across the device.  For example, “now brief” proactively compiles daily schedules and surfaced reservations, even from notification history; while \"call screening” summarizes unknown callers before users answer. </p><p></p><p>The AI integration extends into imaging. The S26 Ultra supports 8K video recording using a new APV codec designed for near-lossless quality retention during editing. </p><p></p><div class=\"media-wrap embed-wrap\"><div><blockquote class=\"twitter-tweet\" data-media-max-width=\"560\"><p dir=\"ltr\" lang=\"en\">The camera quality and the AI features of this Samsung Galaxy S26 Ultra is unmatched chale 👌💥<a href=\"https://twitter.com/hashtag/GalaxyUnpacked?src=hash&amp;ref_src=twsrc%5Etfw\">#GalaxyUnpacked</a><a href=\"https://twitter.com/hashtag/WithGalaxy?src=hash&amp;ref_src=twsrc%5Etfw\">#WithGalaxy</a><a href=\"https://twitter.com/hashtag/SamsungGH?src=hash&amp;ref_src=twsrc%5Etfw\">#SamsungGH</a><a href=\"https://t.co/YzDZQITZwy\">pic.twitter.com/YzDZQITZwy</a></p>— Fabulous❤️ (@KingFabulo) <a href=\"https://twitter.com/KingFabulo/status/2026738611505475986?ref_src=twsrc%5Etfw\">February 25, 2026</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p></p><p>New features like “photo assist” allows users to generate missing visual elements through text prompts, while AI-driven image signal processing enhances selfies and improves low-light video clarity. The computational photography pipeline is tightly coupled with the device’s hardware architecture.</p><p></p><h1>Samsung stakes early claim in the agentic AI race</h1><p>Samsung’s move comes amid intensifying competition in mobile AI. While Apple has signaled upgrades to Siri and Google’s Pixel devices are expected to integrate similar Gemini capabilities, Samsung is first to broadly commercialize what it calls an “agentic” framework at scale.</p><p></p><p>The company is also positioning the S26 as proof that smartphones — rather than standalone AI gadgets — remain the natural home for advanced autonomous software. Recent AI hardware launches attempted to replace or supplement phones but struggled to deliver meaningful adoption.</p><p></p><p>Whether the “agentic AI phone” label endures will depend on how quickly Samsung expands app support and how reliably its agents execute complex tasks. But with the Galaxy S26, the company has made a clear assertion: the future of mobile computing is not just conversational AI — it is AI that acts.</p></div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/ae97747bfa2101799a458ec9b388fada.png",
            "link": "https://www.coinlive.com/news/samsung-galaxy-s26-launches-its-first-agentic-ai-phone-what",
            "pub_date": "2026-02-26 18:40:28",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 250251,
            "title": "Vitalik Buterin Sells More ETH Than Initially Planned, Total Sales Hit Nearly $35 Million",
            "description": "<div class=\"share___SVvtl\"><div><h2>Vitalik Buterin Navigates Ethereum Through A New Era Of Austerity</h2><p>The founder of Ethereum is currently reshaping his financial stake in the ecosystem he helped create.</p><p></p><p>Vitalik Buterin has moved a substantial portion of his personal ETH holdings throughout February 2026, a move that coincides with a broader strategic shift for the Ethereum Foundation.</p><p></p><p>While the market often reacts with nerves when a founder sells, this particular sequence of transactions appears to be a calculated effort to fund a leaner, more focused future for the network.</p><p></p><p>By shifting from his original 700,000 ETH down to approximately 224,000 ETH over the years, Buterin is increasingly positioning himself as a participant rather than just a majority holder.</p><p></p><h2>How Much ETH Did Vitalik Buterin Actually Sell</h2><p>Recent on-chain data from Arkham and Lookonchain reveals that the scale of these sales has slightly exceeded initial expectations.</p><p></p><p>While Buterin originally disclosed a plan to withdraw 16,384 ETH on 30 January 2025, the total has since climbed to 17,196 ETH.</p><p></p><div class=\"media-wrap embed-wrap\"><div><blockquote align=\"center\" class=\"twitter-tweet\" data-dnt=\"true\"><p dir=\"ltr\" lang=\"en\">Vitalik (<a href=\"https://twitter.com/VitalikButerin?ref_src=twsrc%5Etfw\">@VitalikButerin</a>) has now sold 16,420 <a href=\"https://twitter.com/search?q=%24ETH&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$ETH</a> for $32.84M at $2,000, exceeding the originally planned 16,384 <a href=\"https://twitter.com/search?q=%24ETH&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$ETH</a>.<br/><br/>The move aligns with the Ethereum Foundation’s “mild austerity” strategy - redirecting funds toward security, privacy, core R&amp;D, and long-term ecosystem… <a href=\"https://t.co/Xqa3KIv1FH\">https://t.co/Xqa3KIv1FH</a><a href=\"https://t.co/8pVroM76ZZ\">pic.twitter.com/8pVroM76ZZ</a></p>— Onchain Lens (@OnchainLens) <a href=\"https://twitter.com/OnchainLens/status/2026855661792096763?ref_src=twsrc%5Etfw\">February 26, 2026</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p></p><p>This represents a 4.9% increase over the intended target, with the total value of these transactions reaching roughly $34.96 million.</p><p></p><p>Buterin described that initial withdrawal as his \"own share of the austerity\" as the Foundation prioritises long-term sustainability.</p><p></p><div class=\"media-wrap embed-wrap\"><div><blockquote align=\"center\" class=\"twitter-tweet\" data-dnt=\"true\"><p dir=\"ltr\" lang=\"en\">In these five years, the Ethereum Foundation is entering a period of mild austerity, in order to be able to simultaneously meet two goals:<br/><br/>1. Deliver on an aggressive roadmap that ensures Ethereum's status as a performant and scalable world computer that does not compromise on…</p>— vitalik.eth (@VitalikButerin) <a href=\"https://twitter.com/VitalikButerin/status/2017145595819933745?ref_src=twsrc%5Etfw\">January 30, 2026</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p></p><p>The funds are not merely being liquidated for cash; they are being converted into various stablecoins like USDTB, GHO, PYUSD, and EUROC via the Cow Protocol, while some assets remain in DeFi protocols like Aave to accrue reserves.</p><p></p><h2>Is The Ethereum Foundation Running Out Of Money</h2><p>The context behind these sales is a period of \"mild austerity\" for the Ethereum Foundation.</p><p></p><p>Currently holding around 172,000 ETH, the Foundation is tightening its belt to ensure it can support core protocol development for years to come.</p><p></p><div class=\"media-wrap image-wrap\"><img src=\"https://image.coinlive.com/cryptotwits-static/7b72380aceef931f6a1ee5cad4c00c2a.png\"/></div><p style=\"text-align:center;\"><em><span style=\"color:#999999\">Source: <a href=\"https://intel.arkm.com/explorer/entity/ethereum-foundation\" target=\"\">Arkham</a></span></em></p><p></p><p>Buterin noted that the capital would be used to build an \"open-source, secure and verifiable full stack\" of software and hardware.</p><p></p><p>This ambitious goal spans several sectors, including finance, communication, governance, operating systems, and even biotech applications.</p><p></p><p>Despite the sales, the Foundation continues to issue smaller grants, ensuring that affiliated projects do not lose momentum during this transition.</p><p></p><h2>Why Did The Ethereum Price Drop During The Sell Off</h2><p>Market observers have noted a rocky relationship between Buterin’s wallet activity and the token’s market value.</p><p></p><p>Over the last month, ETH has faced a 37% decline, struggling to maintain its footing as staking returns compressed to 2.8%.</p><p></p><p>During one specific sale of 6,958 ETH, the price tumbled 22.7% from $2,360 to $1,825.</p><p></p><div class=\"media-wrap embed-wrap\"><div><blockquote align=\"center\" class=\"twitter-tweet\" data-dnt=\"true\"><p dir=\"ltr\" lang=\"fr\">Ethereum ETH Current Price:<br/>$1,825.89<br/><br/>1h: -0.46%<br/>24h: -2.57%<br/>7d: -7.69%<br/><br/>30d: -37.72%<br/>60d: -38.66%<br/>90d: -37.83%<a href=\"https://twitter.com/hashtag/eth?src=hash&amp;ref_src=twsrc%5Etfw\">#eth</a><a href=\"https://twitter.com/search?q=%24ETH&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$ETH</a><a href=\"https://twitter.com/hashtag/ethereum?src=hash&amp;ref_src=twsrc%5Etfw\">#ethereum</a></p>— aWebAnalysis | Crypto (@aWebAnalysis) <a href=\"https://twitter.com/aWebAnalysis/status/2026180810211250418?ref_src=twsrc%5Etfw\">February 24, 2026</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p></p><p>Another sale of 1,869 ETH saw a 5.7% dip.</p><p></p><p>However, the most recent tranche of sales showed a break in this trend, occurring as the price recovered to $2,059.05.</p><p></p><p>While some institutional holders like ETHZilla are reportedly pivotting toward RWA tokenization, the general consensus is that Buterin’s individual sales are not large enough to dictate the market’s long-term direction.</p><p></p><div class=\"media-wrap embed-wrap\"><div><blockquote align=\"center\" class=\"twitter-tweet\" data-dnt=\"true\"><p dir=\"ltr\" lang=\"en\">ETHZilla pivoted from biotech to accumulating <a href=\"https://twitter.com/search?q=%24ETH&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$ETH</a> in July 2025 during the crypto treasury boom.<br/><br/>When <a href=\"https://twitter.com/search?q=%24ETH&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$ETH</a> crashed, its stock collapsed 96%.<br/><br/>The company has now exited the crypto hoarding strategy, rebranded to Forum Markets, and shifted to RWA tokenization - starting with two… <a href=\"https://t.co/rF9Pglv8hQ\">pic.twitter.com/rF9Pglv8hQ</a></p>— Zev (@Zevweb3) <a href=\"https://twitter.com/Zevweb3/status/2026937959312986608?ref_src=twsrc%5Etfw\">February 26, 2026</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p></p><h2>Will The Strawmap Roadmap Make Ethereum Faster Than Solana</h2><p>To combat the perception of a slowing ecosystem, the Foundation recently introduced \"Strawmap,\" a technical roadmap designed to make the L1 layer significantly faster and more competitive.</p><p></p><p>The plan focuses on five pillars, including \"Gigagas\" for 10,000 transactions per second and \"Teragas\" for 10 million transactions via data availability sampling.</p><p></p><div class=\"media-wrap embed-wrap\"><div><blockquote align=\"center\" class=\"twitter-tweet\" data-dnt=\"true\"><p dir=\"ltr\" lang=\"en\">Introducing strawmap, a strawman roadmap by EF Protocol.<br/><br/>Believe in something. Believe in an Ethereum strawmap.<br/><br/>Who is this for?<br/><br/>The document, available at strawmap[.]org, is intended for advanced readers. It is a dense and technical resource primarily for researchers,… <a href=\"https://t.co/gIZh5I8Not\">pic.twitter.com/gIZh5I8Not</a></p>— Justin Drake (@drakefjustin) <a href=\"https://twitter.com/drakefjustin/status/2026755969540108659?ref_src=twsrc%5Etfw\">February 25, 2026</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p></p><p>The ultimate goal is to achieve \"finality in seconds,\" a move that would allow Ethereum to compete directly with high-speed networks like Solana.</p><p></p><p>As the network looks toward quantum-proofing and privacy-shielded transfers, these sales by Buterin appear to be the fuel intended to turn these technical discussions into a functional reality.</p></div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/41bfbbdf18d17130b01d54ee1d94036a.jpeg",
            "link": "https://www.coinlive.com/news/vitalik-buterin-sells-more-eth-than-initially-planned-total-sales",
            "pub_date": "2026-02-26 18:34:07",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 250244,
            "title": "What's wrong with Ethereum?",
            "description": "<div class=\"share___SVvtl\"><div><p style=\"text-align: left;\">Author: Pavel Paramonov &amp; Translation: Plain Language Blockchain</p><p style=\"text-align: left;\">This article is primarily inspired by Vitalik's recent tweets about the current state and changes in the market. While the entire market is declining, it's difficult to pinpoint a specific individual, and I don't intend to do so.</p><p style=\"text-align:center\"><img src=\"https://img.jinse.com.cn/7435790_watermarknone.png\"/></p><p style=\"text-align: left;\">I have worked with many Ethereum teams and invested in multiple protocols built on Ethereum on behalf of venture funds. In general, I used to be a huge fan of Ethereum and EVM-related things.</p><p style=\"text-align: left;\">Unfortunately, I can no longer say the same thing, because I feel that Ethereum doesn't know where it's headed (and many others share this sentiment).</p><p style=\"text-align: left;\"> I don't want to discuss ETH's price movements, but I can't ignore the fact that the world's second-largest cryptocurrency has been extremely volatile. Regardless of global market trends, ETH behaves more like a stablecoin that's going off-target. This essay aims to explore what has happened to Ethereum over the past few years and why many are losing hope or have already lost hope. Ethereum didn't lose to Solana or other competitors; it lost to itself. When Ethereum introduced its Rollup-centric roadmap, almost everyone was excited. The promise at the time was that Rollups (and Validiums) would handle scaling, end-user transactions would occur on Rollups, and Ethereum would act as a validation layer—focusing on being the L1 for Rollups, rather than a direct-to-user L1. Developing Rollups is much faster and easier than developing L1, so the vision of \"thousands upon thousands of Rollups\" seems very likely and optimistic. Where did things go wrong? It turns out, everything went wrong. Endless arguments, ideology overriding needs, ongoing infighting within the community, an identity crisis, and abandoning the vision of \"centralized aggregation\" too late. Everything that could go wrong went wrong. Most of the community initially considered Max Resnick a completely incompetent villain, only to find he was right about almost everything. During his time at Consensys, Max offered numerous suggestions on how Ethereum should move forward, but these were met with criticism and little support. The most foolish peak was when the entire industry started debating whether a certain L2 layer was truly \"Ethereum,\" for example: Viewpoint A: \"Base is an extension of Ethereum; we've made huge contributions to the Ethereum ecosystem.\" Viewpoint B: \"Base is not an extension of Ethereum; it's an independent entity.\" What the hell are we even discussing? How can this kind of dialogue guide Ethereum and its ecosystem towards a better future? Why are people seriously debating what constitutes core Ethereum and what it isn't? Don't we have more important issues to address? This ideological debate isn't a debate at all; it's a confrontation between two small circles trying to prove who's right. We don't need internal friction (PvP); we need external expansion (PvE). We need to understand that this isn't a confrontation between us, but rather a shared understanding of our problems and future. Unfortunately, many people prefer the pursuit of fleeting pleasure to considering that their opinions might be wrong. Technological ideology takes precedence over user needs. Based Rollups, Booster Rollups, Native Rollups, Gigagas Rollups, Keystore Rollups... Which is better, what will the future hold, and how do they connect? \"This type is the future,\" \"No, that type is the future.\" All these discussions... result in Arbitrum and Base continuing to dominate. Technological superiority brings advantages, but these advantages disappear when you compare \"apples and pears\" or \"oranges and tangerines.\" They are too similar, so similar that users simply don't care. Nobody outside the bubble cares. One more pre-compilation, one less—you won't win. \"Oh, we are actually 'Ethereum-aligned,' we have an advantage, we are very close to Ethereum, we embody its core values, and users will choose us.\" I want to ask, which values? And which users will choose you? @0xFacet became the first Rollup to reach Stage 2, they are a model of Ethereum alignment. But where are they? Where are their users, developers, tech KOLs, and those who support the Ethereum ecosystem and alignment? How many of you have heard of Facet? How many applications are available on Facet? I have no problem with Facet personally, I respect its founders. But where are those who keep saying we need more Stage 2 Rollups? I don't know, and you don't know either. Financial incentives are far more powerful than technical incentives. I used to be a fan of Taiko, especially their research on Based Rollups. This model has many advantages: stronger censorship resistance, neutrality, no risk of sequencer downtime, and L1 validators earning more money. Where's the trap? The trap lies in the finances behind the model. You can't force people to give up income for so-called \"alignment.\" Arbitrum promised centralized sequencers, as did Scroll, Linea, zkSync, and Optimism. Where are they? Where are those sequencers? Every Rollup team writes in their documentation: \"We currently use centralized sequencers, but have a strong desire for decentralization in the future.\" Almost no one delivers. Metis delivered, but luckily or unfortunately, people didn't care about Metis. Did I think they over-promised to pander to influential ETH purists (Maxis)? Yes. Did I think they really wanted a decentralized sequencer? Certainly, but it doesn't make business sense. Coinbase (Base) has a legal obligation to make as much money as possible and create value for the company. The same goes for other teams; why would you kill your own revenue stream? It simply doesn't make sense. Only about 5% of Base's revenue flows back to Ethereum. Rollups have never been an extension of Ethereum. Taiko had days when it paid Ethereum more in ordering fees than it collected from user transactions. Clearly, companies like Taiko have many other expenses besides paying Ethereum. Based Rollups or any vision of “Ethereum alignment” are only possible if the team is willing to forgo revenue. I haven't underestimated the importance of decentralization, security, and permissionlessness. But when your sole objective is “ideological correctness” rather than “user-centricity,” it all loses its meaning. Unsurprisingly, this weakness and the promise of “Ethereum alignment” have attracted a large number of grifters. Summarizing the consequences of centralized roadmaps: Eclipse, Movement, Blast, Gasp (Mangata), Mantra: These protocols were never intended for the long-term future. It's easy to hide behind masks of “Ethereum alignment,” making Ethereum better, and introducing SVM to Ethereum. They've all been, to some extent, “rugged.” All Rollups realize their tokens are practically useless because they pay fees with ETH while their tokens have almost no utility. Speculators realize you can create massive hype around a Rollup's central narrative and then cash out by dumping worthless tokens on retail investors. Ethereum has never acknowledged Polygon as a true L2, despite their significant role in securing ETH's value. If you believe Rollups are an extension of Ethereum's \"culture,\" why not acknowledge a project so closely tied to Ethereum's security and usability? Polygon was crucial to Ethereum during the 2021 bull market, contributing significantly to ETH's growth as an asset. But yes, it's not L2 and doesn't deserve the Ethereum community's praise. If Polygon were L1, its valuation would be much higher. Even Paradigm, a top VC that has arguably contributed the most to the Ethereum ecosystem and even developed its own L2 (Ithaca), has shifted its focus to collaborating with Stripe on L1 (Tempo). I believe that when your biggest believer starts building your competitors, something is definitely wrong. The Ethereum Foundation (EF) lacks direction. While Ethereum is technically decentralized, its culture is highly centralized around Vitalik. Ethereum's internal circles are real. As people say, to succeed, all you need to do is get the attention of people around Vitalik and a few influential VCs. I'm not saying you have to agree with everything Vitalik says, but his views essentially define what's good and bad for Ethereum, and you can't compete with that. First, there's ultrasound money. Due to EIP-1559 and the merger, ETH's economic model became deflationary, suggesting it would be a better store of value than Bitcoin. But in 2024, ETH's annual inflation rate turned positive. So the vision of ultrasound money only lasted 3 years? That's not enough to become a store of value. This narrative is dead, and it was never true, because ETH wasn't designed to be a store of value; that's Bitcoin's mission, and you can't compete with that. Then, Ethereum couldn't decide whether its token was a commodity (inapplicable due to dynamic supply changes and staking mechanisms) or more like a tech stock (inapplicable because revenue wasn't sufficient to support a tech company's valuation). There's also the argument that ETH isn't money at all. What's going on? We need to choose a direction. Ethereum can't be multiple things at once—you either have a globally unified definition or you'll fall behind. Financial incentives…missing again. I still can't imagine a lead engineer like Péter Szilágyi receiving only about $100,000 a year for his contributions to Ethereum. This contributor, who has been here from the very beginning and helped Ethereum reach a market capitalization of $450 billion from scratch, received a salary of only 0.0001% of the market capitalization. The most influential and successful protocol in crypto history (second only to Bitcoin) didn't offer any incentives or equity. It's easy to justify hiding behind the creed of decentralization, open source, and permissionless principles: \"We're not in it for the money, we're in it for progress.\" But you have to incentivize even the most loyal warriors, or they'll leave or take on private projects. Péter left, Danny Ryan left, and Dankrad Feist went straight to Tempo. Justin Drake and Dankrad accepted advisory positions at EigenLayer in 2024 and received token allocations, resulting in community resentment. These people at EF, earning a \"peanut\" salary (compared to FAANG companies and AI labs), are being attacked simply for making money and helping a protocol that wants to make Ethereum better (even if it's not Ethereum itself). Are you idiots? Sometimes I feel that if you're an honest, hardworking person on Ethereum, you're deprived of the right to earn money and expected to work like a slave to gain \"approval\" from Ethereum. EF has been dumping ETH to fund various operations and research. But perhaps they should pay their researchers enough first? Zero tolerance for adaptability. \"Day 1. Ethereum will win. The decentralized blockchain with the highest uptime.\" We hear this every day, just like we hear Ethereum's excuses every day. Yes, Ethereum is expensive and slow. But we have Rollups, use Rollups, Rollups are Ethereum! Yes, ETH prices lag. But Ethereum has the largest developer ecosystem, we have a solid foundation, and demand will follow. Ethereum is the most decentralized! Solana is garbage, they lack client diversity. Ethereum is 100% uptime! Solana is garbage, it has crashed several times. Ethereum's network activity is lower than Solana's. That's because Solana's activity is mostly spam and smurfs. We are an ethical chain! You know, it makes me happy to see people realize their mistakes; it takes courage. But I think it might be too late. Ethereum has once again found the path it has needed to take in the long run, but progress remains slow. EF has indeed seen some changes recently: new leadership, treasury transparency, R&amp;D restructuring, and so on. EF has started hiring young and talented DevRels and marketing talent like Abbas Khan, Binji, and Lou3e. But change must be fast. Ethereum must sprint to prove everyone wrong. Let's see if, after these reforms and changes at EF, we can see Ethereum become an exciting object again, rather than an object of blind, delusional faith and disappointment. Same excuses, same answers, same reactions, year after year. Everything except Ethereum and Rollups is garbage. If Ethereum underperforms on any metric, we say, \"This is only day one,\" we know what we're doing, and there's no better place than Ethereum. Everyone's tired of the community's endless excuses. Ethereum feels like a wealthy old lady who struggles to walk, refuses any innovation, but distributes her wealth to her parasitic descendants. Change. Just hours before I finished writing this, Vitalik tweeted that the centralized roadmap was a failure and they needed to find another path and scale L1. You know, it's gratifying to see people realize their mistakes; it takes courage. But I think it might be too late. Ethereum has once again found the path it needs to take in the long run, but progress remains slow. EF has indeed undergone some changes recently: a new leadership, increased treasury transparency, R&amp;D restructuring, and more. EF has begun hiring young and talented DevRels and marketing professionals like Abbas Khan, Binji, and Lou3e. But change must be swift. Ethereum must sprint ahead to prove everyone wrong. Let's see if, after these reforms and changes at EF, we can see Ethereum once again become an exciting object of study, rather than an object of blind, delusional faith and disappointment.</p></div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/2522cbcde4123404eef5960a428d96d6.jpg",
            "link": "https://www.coinlive.com/news/what-s-wrong-with-ethereum",
            "pub_date": "2026-02-26 18:03:10",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 250230,
            "title": "The cases of Chen Zhi of Prince Group and Zhao Changpeng of Binance have greatly benefited the United States.",
            "description": "<div class=\"share___SVvtl\"><div><p style=\"text-align: left;\"><span leaf=\"\"><span text=\"\">Chen Zhi, the head of a cross-border gambling and fraud crime syndicate, was extradited from Cambodia to China earlier this year. On February 26, 2026, the WeChat official account of the National Computer Virus Emergency Response Center published an article titled \"Ready Player One—An In-Depth Analysis of the Global Virtual Currency Asset Harvesting Operation Under the US Technological Hegemony,\" revealing that the US seized approximately 127,000 Bitcoins in the Chen Zhi case, profiting $15 billion.</span></span></p><p style=\"text-align: left;\"><span leaf=\"\"><span text=\"\">The article lists four authors: the National Computer Virus Emergency Response Center, the National Engineering Laboratory for Computer Virus Prevention and Control Technology, 360 Digital Security Group, and Antiy Labs Technology Group Co., Ltd. ...&gt;</span></span></p> According to statistics from CoinGecko, a well-known cryptocurrency tracking and research institution, as of the end of January 2026, the total market capitalization of global cryptocurrency assets was approximately US$2.73 trillion, of which Bitcoin's total market capitalization reached approximately US$1.57 trillion. During the same period, the value of gold reserves held by central banks worldwide was approximately US$5.83 trillion. This means that the market capitalization of cryptocurrency assets has reached about 47% of the total market capitalization of global official gold reserves, approaching half, becoming an undeniable new type of financial asset. A few countries have even recognized Bitcoin as legal tender. The article points out that cryptocurrency assets, as a new type of wealth carrier in the digital age, have become a significant target for the US economy. Leveraging its technological advantages and rule-making power, and with the cooperation of its allies, the United States has incorporated global virtual currency asset transactions into its own regulatory framework and cross-border law enforcement system based on long-arm jurisdiction. Through civil confiscation, criminal prosecution, and fines, it has massively seized overseas virtual currency assets. According to incomplete statistics, from 2022 to 2025, the United States seized over $30 billion worth of global virtual currency assets through various cases. The Chen Zhi case alone accounted for $15 billion in seized assets, representing 50% of the total. The article argues that this unilateral harvesting not only disrupts the law enforcement activities of other countries, causing secondary losses to victims, but also interferes with the global flow of virtual currency assets, undermines the financial stability of emerging market countries, and ultimately aims to consolidate the dollar's hegemonic position in the digital finance sector. Public information shows that Chen Zhi was born in Lianjiang County, Fujian Province in 1987 and also holds British and Cambodian citizenship. According to the website of DW Capital Group, a Singapore-based fund management company in which he personally invests, Chen Zhi is described as \"a young business prodigy.\" His first entrepreneurial venture was investing in a small internet cafe in Fujian Province. In 2011, Chen Zhi entered the Cambodian real estate market and subsequently founded the Prince Group. Previous media reports indicated that the Prince Group, located in Phnom Penh, the capital of Cambodia, is one of Cambodia's largest conglomerates. It claims to operate over 100 business entities in more than 30 countries, with businesses covering real estate development, financial services, tourism, and consumer services. In reality, the Prince Group is one of Asia's largest transnational criminal organizations, operating 10 telecom fraud industrial parks in Cambodia. The U.S. Treasury Department has designated the group as a transnational criminal organization and imposed sanctions on more than 100 related individuals and entities. The article above describes the Chen Zhi and Zhao Changpeng cases as two typical examples of the U.S. using its technological hegemony to harvest global virtual assets. The two cases fully demonstrate the U.S.'s closed-loop harvesting process of \"technological breakthrough—legal support—institutional execution,\" with its process logic and technical details exhibiting distinct hegemonic characteristics. In October 2025, the U.S. Attorney's Office for the Eastern District of New York announced criminal charges against Chen Zhi, founder of the Cambodian Prince Group, involving charges of telecommunications fraud and money laundering. Simultaneously, it announced the confiscation of approximately 127,000 bitcoins under his control, valued at approximately $15 billion at the time, setting a record for the largest virtual asset confiscation in U.S. judicial history. The article states that the US Department of Justice, under the guise of \"combating transnational telecom fraud and money laundering,\" hastily pieced together so-called evidence, evaded the original source, and \"legalized\" the confiscation of Bitcoin stolen from the Prince Group in 2020 through state-sponsored hacking. This is a typical case of the US exploiting technological vulnerabilities to carry out cross-border asset plunder and exert technological bullying—a classic example of \"double-crossing.\" The \"Technical Source Analysis Report on the LuBian Mining Pool Hacking and Stealing of a Huge Amount of Bitcoin,\" released by the National Computer Virus Emergency Response Center in November 2025, has already revealed this core truth through technical evidence: a US state-sponsored hacking organization precisely cracked the underlying encryption vulnerability, attacked the LuBian mining pool's cold wallet, and transferred assets, demonstrating the US's mature state-sponsored virtual currency asset theft capabilities. This clearly contradicts the US government's claim that \"Bitcoin has never been hacked,\" or its true meaning is that \"Bitcoin has never been hacked by hackers outside the US government.\" In another case, from 2023 to 2025, the United States pursued both civil and criminal charges against Binance, a well-known international cryptocurrency exchange, and its founder, Changpeng Zhao. The case ultimately ended with Binance paying a $4.35 billion fine (including $2.7 billion in confiscation of illegal gains, $1.35 billion in civil penalties, and $150 million in personal fines), and Changpeng Zhao signing a plea agreement and being pardoned. This case is another typical example of the United States using judicial hegemony and technological surveillance to force global virtual asset platforms to comply with its regulatory rules, thereby achieving economic exploitation and the export of its rules. The article points out that the above cases demonstrate that for a large number of fraud victims, it's a case of the mantis stalking the cicada, unaware of the oriole behind; the US's indulgence of telecom fraud and the fact that the vast majority of the huge profits it has seized through technological hegemony have not been returned to the victims, effectively constituting indirect plunder of other countries' assets. In fact, this model not only applies to the virtual currency asset sector but is also a common paradigm used by the US to infringe upon global interests through its technological hegemony. Clearly, the successful practices of cases like Chen Zhi's have given the US government sufficient confidence to fully control the global virtual currency market and have become an important driving force for the US government to establish a national strategic reserve of virtual currency assets represented by Bitcoin.</div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/802b904d3bdf3e1e15bc1af9b6615e74.jpg",
            "link": "https://www.coinlive.com/news/the-cases-of-chen-zhi-of-prince-group-and-zhao",
            "pub_date": "2026-02-26 17:14:01",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 250228,
            "title": "Crypto Market Macro Research Report: Crypto Asset Repricing Amid Liquidity Retreat",
            "description": "<div class=\"share___SVvtl\"><div><h2 style=\"text-align: left;\">Summary</h2><p style=\"text-align: left;\">In the first quarter of 2026, the crypto market experienced a historic deleveraging storm. Bitcoin retreated by more than 40% from its highs, Ethereum fell even more sharply, and altcoins generally halved in value. This round of crashes was not simply caused by cooling market sentiment or regulatory rumors; it was the result of the convergence of three factors tightening liquidity: large-scale unwinding of yen carry trades, the US Treasury's TGA account reconstruction withdrawing funds from the market, and a systemic increase in margin requirements in the derivatives market. These factors, combined with the crypto market's own high leverage structure and valuation bubble, triggered a stampede-like clearing. Looking ahead, the crypto market has moved beyond the \"liquidity-driven\" extensive growth phase and entered a new normal dominated by macroeconomic factors. Against the backdrop of an unclear Federal Reserve policy path and the contraction of global central bank balance sheets, crypto assets will face continued repricing pressure.</p> I. Historically High US Stock Valuations: The \"Ceiling Effect\" of Risk Asset Pricing When analyzing the cryptocurrency market trend, an undeniable macroeconomic backdrop is that US stock valuations are at historically high levels. As the \"pricing anchor\" for global risk assets, the valuation level of US stocks not only reflects market expectations for US corporate profits but also profoundly influences the valuation ceiling of the cryptocurrency market through asset price comparisons, investor risk appetite, and global capital flows. Multiple indicators confirm the current high valuation of US stocks. The Buffett Indicator shows that the ratio of total stock market capitalization to GDP has climbed to a historically extreme high of 230%, far exceeding the levels before the 2000 dot-com bubble and the 2007 financial crisis. The S&amp;P 500's 12-month forward P/E ratio is 22.0 times, significantly higher than the 30-year historical average of 17.1 times, and close to the 25.2 times during the dot-com bubble. The Shiller cyclically adjusted price-to-earnings ratio is approximately 38, second only to 44 in 2000. The price-to-sales ratio has exceeded 3.0, reaching a historical high. These indicators collectively point to one conclusion: US stocks are significantly overvalued. The high valuation of US stocks is transmitted to the crypto market through various mechanisms. From the perspective of asset valuation effects, when US stock valuations are at historical highs, it means that their expected future returns are declining. Rational investors will reassess the allocation ratio of all risky assets, and crypto assets, as \"marginal risk assets\" with higher volatility, are often the first to be reduced. From the perspective of Federal Reserve policy constraints, the high valuation of US stocks presents the Fed with a dilemma, limiting its room for easing and potentially leading to a longer period of hawkishness than the market expects, which is depressing for all risk assets. From the perspective of profit-taking, after years of gains, institutional investors are generally overweight in US stocks. When valuations reach extreme levels, they will systematically reduce their risk exposure, typically by selling the most appreciating and liquid assets—including Bitcoin. From a risk sentiment perspective, as a bellwether for global risk assets, the high valuation of US stocks will trigger investor wariness towards all assets with excessive gains and difficult-to-quantify valuations; crypto assets are most vulnerable to being dumped. Looking back at history, any valuation reaching current levels has ultimately ended in a painful mean reversion. The lessons of 1929, 2000, and 2007 are still fresh in our minds. The current uniqueness of US stock valuations lies in the fact that they are a direct product of the longest and largest-scale experiment in loose monetary policy over the past 15 years. When these policies begin to be withdrawn, and valuations are at historical highs, the reversion process may be more severe than before. For the crypto market, this means that even if the fundamentals of the crypto industry itself continue to improve, valuation suppression at the macro level will remain a significant obstacle for the next 1-2 years. Only when US stock valuations return to a reasonable range through time or price adjustments can the crypto market truly begin a new, healthy upward cycle. <h2 style=\"text-align: left;\">II. Yen Carry Trade Unwinding: The \"Invisible Pump\" of Global Liquidity</h2><p style=\"text-align: left;\">The reversal of the Yen Carry Trade was the trigger for this round of crypto market crash and the most crucial macroeconomic driver. For a long time, the Bank of Japan's zero-interest-rate policy has made the yen the currency with the lowest global financing cost. International investors have borrowed yen on a large scale, converted it into US dollars or other high-interest currencies, and invested in high-yield assets globally—including highly volatile cryptocurrencies.</p><p style=\"text-align: left;\"> In early 2026, the underlying logic of this arbitrage model began to falter. As inflationary pressures emerged in Japan, market expectations for the Bank of Japan to exit its negative interest rate policy surged. Japanese government bond yields jumped multiple times, with the 10-year yield breaking through 1.2%, reaching a multi-year high. This change directly compressed the interest rate differential between the yen and the dollar: when the cost of borrowing yen rises, while the expected return on dollar assets remains unchanged or even declines, the attractiveness of arbitrage trading decreases dramatically. Even more critically, when the yen begins to appreciate (the USD/JPY exchange rate falls from above 150 to the 140 range), arbitrage traders not only face narrowing interest rate differentials but also incur exchange rate losses. In this situation, the most rational choice is to close out positions: sell previously held overseas assets (including crypto assets such as Bitcoin and Ethereum) and exchange them for yen to repay loans. The crypto market's 24/7 trading and high liquidity make it a prime target for arbitrage traders to sell off their holdings. Data clearly shows that during the few trading days of rapid yen appreciation in mid-February, Bitcoin and yen exchange rates exhibited a high degree of negative correlation, a typical characteristic of arbitrage position closing. It is worth noting that the scale of yen arbitrage trading is estimated at trillions of dollars, and its closing process is often continuous. As long as the Japan-US interest rate differential does not widen again and the yen's appreciation trend does not reverse, this \"pump\" will continue to draw funds from global risk asset markets. For the crypto market, which relies on incremental funds, this is undoubtedly a devastating blow. III. TGA Account Reconstruction and Treasury Issuance: Liquidity Siphoning by Fiscal Policy If yen carry trade represents international liquidity tightening, then changes in the balance of the US Treasury's General Account (TGA) represent a direct drain on liquidity within the dollar system. The TGA account is essentially the Treasury's \"wallet\": when the Treasury increases its TGA balance by issuing treasury bonds or collecting taxes, it means funds flow from the commercial banking system into the Treasury's account, leading to a decrease in bank reserves and tightening market liquidity; conversely, when the Treasury spends (such as paying government contracts, social security, etc.), funds flow back into the market, increasing liquidity. From February to March 2026, the market is facing a rapid reconstruction period for the TGA balance. According to the financing plan announced by the US Treasury, the TGA balance target for the end of March is maintained at $850 billion, and it will reach a peak of approximately $1.025 trillion in the April tax season. This means that the Treasury Department will withdraw nearly $200 billion from the financial system in just two months. Meanwhile, to replenish the TGA and finance the fiscal deficit, the Treasury announced a large-scale quarterly refinancing plan in early February, with bond issuance exceeding market expectations. This combination of \"bond issuance + increasing the TGA balance\" directly led to a continuous decline in bank reserves. For the crypto market, the transmission mechanism is more indirect but equally devastating: reduced bank reserves → financial institutions tightening credit → decreased financing capacity of hedge funds and market makers → forced reduction of risk exposure → crypto assets facing selling pressure. Stablecoin issuers' reserve assets are mainly US Treasury bonds; the TGA reconstruction has led to increased volatility in US Treasury yields, indirectly affecting the redemption pressure and liquidity support capacity of stablecoins. Historically, sharp changes in the TGA balance are often highly correlated with the price trends of risky assets. In early 2021, when the TGA balance rapidly declined (due to fiscal spending), Bitcoin experienced a bull market surge; conversely, the TGA rebuilding process in early 2026 corresponded to a sustained decline and eventual collapse in the crypto market. This is not a coincidence, but rather an inevitable reflection of the liquidity cycle. </p><h2 style=\"text-align: left;\">IV. Margin Increases and Derivatives Deleveraging: Forced Liquidation at the Exchange Level</h2><p style=\"text-align: left;\">Besides the tightening of liquidity at the macro level, the fragility of the crypto market's derivatives structure itself was a significant amplifier of the crash. In early February, as the gold and silver markets experienced extreme volatility, the Chicago Mercantile Exchange (CME) repeatedly raised margin requirements for gold and silver futures. Although this measure directly targeted the precious metals market, its chain reaction quickly spread to the crypto market. </p><p style=\"text-align: left;\">Firstly, as the world's most important derivatives exchange, the CME's margin adjustments have a demonstrative effect.</p><p style=\"text-align: left;\"> After observing increased market volatility, risk control departments of major cryptocurrency exchanges followed suit by raising margin requirements and lowering leverage limits for perpetual contracts and futures. This effectively forced deleveraging for the cryptocurrency market, which heavily relies on leveraged trading. The forced liquidation of numerous high-leverage positions triggered further price declines, leading to more liquidations and a negative spiral. Secondly, the cryptocurrency market shares a common bullish group with the precious metals market—macro hedge funds and trend traders. When these institutions suffer losses in the precious metals market due to margin increases, they often need to sell other assets (including crypto assets) to replenish margin or cover losses. This cross-asset risk liquidation further exacerbates selling pressure in the cryptocurrency market. More importantly, during this crash, the Bitcoin-Ethereum futures premium quickly turned negative (forward discount), and the perpetual contract funding rate remained negative, indicating that the market has shifted from bullish to bearish dominance. When funding rates are negative for an extended period, it means that long positions not only suffer losses from price declines but also have to pay funding fees to short positions. This further weakens the willingness of long positions to hold and prolongs the market's bottom-finding process. Historically, only when funding rates return to neutral or even positive and futures premiums recover can the market truly stabilize. V. The Structure of the Crypto Market: The Dual Vulnerability of High Valuation and Liquidity Dependence Against the backdrop of tightening macro liquidity, the high valuation and high leverage characteristics of the crypto market amplified the severity of the decline. Although crypto assets do not have a traditional price-to-earnings ratio valuation, we can assess their valuation levels through multiple dimensions: First, Bitcoin's market capitalization share. Before this crash, Bitcoin's market capitalization share once fell below 40%, with a large influx of funds into various altcoins and DeFi tokens. This is a typical characteristic of the late bull market—funds chasing high-risk, high-return tail assets rather than leading assets. When liquidity reverses, these high-beta assets are often the first to be hit, experiencing declines far exceeding those of Bitcoin. Secondly, there's the change in the total market capitalization of stablecoins. Stablecoins serve as \"backup cash\" in the crypto market, and changes in their total market capitalization reflect the willingness of off-exchange funds to enter. Data shows that since January 2026, the total market capitalization growth of USDT and USDC has stagnated or even slightly declined, indicating that the speed of new funds entering the market has not kept pace with the market's expansion needs. When the market relies on existing funds and leverage to maintain high levels, any liquidity shock could lead to a collapse. Thirdly, there's the divergence between on-chain activity and price. In the months leading up to the crash, although Bitcoin prices remained high, indicators such as the number of active on-chain addresses and transactions did not reach new highs simultaneously, and even declined. This indicates that the price increase was mainly driven by leveraged trading within exchanges, rather than genuine fundamental improvements or increased adoption. Leveraged-driven rises are often short-lived; once liquidity tightens, prices will quickly revert to their previous levels. The unique characteristic of the crypto market lies in the fact that its participants are far more sensitive to macroeconomic liquidity than other asset classes. This is because the crypto market lacks traditional \"endogenous cash flow,\" and its price is entirely determined by the willingness of marginal buyers to enter the market. When macroeconomic liquidity is abundant, these marginal buyers (mainly retail investors and hedge funds with higher risk appetites) have ample funds, driving up prices; when macroeconomic liquidity tightens, they are also the first to withdraw funds. This round of crash is the most vivid illustration of this mechanism. VI. Market Outlook: Crypto Asset Repricing under the Liquidity Indicator Framework Looking ahead, the trend of the crypto market will no longer be determined by a single factor, but will enter a new stage dominated by macroeconomic factors. Investors need to establish an analytical framework centered on liquidity indicators, focusing on the following variables: First, the Federal Reserve's monetary policy path. Although the market has some concerns about Warsh's hawkish stance after becoming Chairman of the Federal Reserve, it is more important to observe actual economic data. If the job market cools significantly and inflation continues to decline, the Fed's tightening pace may be slower than expected. The CME FedWatch tool shows that market expectations for a rate cut in 2026 have been significantly lowered, but this has already been partially priced in. The key is when the Fed will release a clear signal of a policy shift. Secondly, changes in TGA balance and net liquidity are crucial. Investors should closely monitor the weekly TGA balance data released by the US Treasury, as well as changes in the Fed's balance sheet and ON RRP balance. Net liquidity (Fed Total Assets - TGA - ON RRP) is the most direct indicator of available cash in the market. If net liquidity continues to decline, the crypto market will continue to be under pressure; conversely, if net liquidity bottoms out and rebounds, a phase of rebound may occur. Thirdly, the evolution of yen carry trades is important. The USD/JPY exchange rate and the spread between the US and Japan 2-year government bond yields are two key points to observe. If the yen's appreciation trend stops and the Japan-US interest rate differential stabilizes or even widens, the pressure to unwind arbitrage positions will ease, which is a positive signal for global risk assets, including the crypto market. Conversely, if the yen continues to appreciate, further deleveraging should be anticipated. Finally, there are the structural indicators of the crypto market itself. Whether the total market capitalization of stablecoins has resumed growth, whether Bitcoin's market capitalization share has stabilized, and whether perpetual contract funding rates have turned positive are all important references for judging whether the market has bottomed out. Historically, only when funding rates remain positive, futures premiums recover, and stablecoins flow back into exchanges does it signify a true restoration of market confidence. In terms of specific timing, the second quarter is typically a period of relatively tight liquidity (TGA balances peak during tax season), coupled with the ongoing Fed balance sheet reduction, the crypto market may continue its volatile bottom-seeking trend. A real turnaround may not occur until the second half of the year—when TGA balances begin to decline and the market forms clearer expectations regarding the Fed's policy path. </p><h2 style=\"text-align: left;\">VII. Conclusion: Saying Goodbye to Extensive Growth and Embracing the New Macroeconomic Normal</h2><p style=\"text-align: left;\">The cryptocurrency market crash in the first quarter of 2026 was a systemic deleveraging event driven by macroeconomic liquidity and amplified by the cryptocurrency's own structural issues. It marks the end of the extensive growth phase driven by loose liquidity since 2023, and the cryptocurrency market has officially entered a new macroeconomic normal.</p><p style=\"text-align: left;\">Under this new normal, cryptocurrency assets, like other risky assets, will be profoundly affected by macroeconomic variables such as global central bank balance sheets, fiscal policies, and exchange rate fluctuations. The narratives of \"crypto market desensitization to macroeconomics\" and \"the safe-haven attribute of digital gold\" have been disproven in this crash—when a real liquidity crisis arrives, Bitcoin's decline is no less than that of tech stocks, and its correlation with the Nasdaq has risen to a historical high.</p><p style=\"text-align: left;\">For investors, this means a need to establish a more macroeconomic analytical perspective, rather than simply focusing on project fundamentals or technological progress.</p><p style=\"text-align: left;\"> Liquidity indicators should be a core basis for investment decisions: pay attention to changes in net liquidity, whether SOFR rates are rising abnormally, whether the US Treasury volatility index MOVE is rising, and whether high-yield credit spreads are widening. These macroeconomic variables will determine the beta direction of the crypto market, while project fundamentals only provide alpha opportunities after the beta is determined. Of course, a crash often breeds new opportunities. When leverage is cleared, speculators leave, and valuations return to rationality, projects with genuine long-term value will present an opportunity to build positions. However, caution is advised until a clear turning point in the macro liquidity environment is observed. For the crypto market, cash is the last scarce commodity, and liquidity is the only truth.</p></div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/9eb0b8f202c2cc555b2b7c75b8783a13.jpg",
            "link": "https://www.coinlive.com/news/crypto-market-macro-research-report-crypto-asset-repricing-amid-liquidity",
            "pub_date": "2026-02-26 17:08:40",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 250224,
            "title": "Romance Turns Into Crypto Trap as US Authorities Seize $61 Million From Fake Dating and Investment Scheme",
            "description": "<div class=\"share___SVvtl\"><div><h2>The Costly Illusion Of A Perfect Partner</h2><p>A massive $61 million in cryptocurrency has been recovered by United States federal agents following a sophisticated pig butchering scam that stripped victims of their life savings.</p><p></p><p>This enforcement action, led by the U.S. Attorney’s Office for the Eastern District of North Carolina, targeted a criminal network that thrived on a cruel blend of romantic manipulation and technical deception.</p><p></p><p>The recovery of such a large sum of Tether (USDT) represents one of the most successful interventions against digital asset fraud to date.</p><p></p><p>The scheme functioned like a meticulously planned stage play.</p><p></p><p>Scammers spent months grooming targets through online platforms, posing as either potential romantic partners or elite investment gurus.</p><p></p><p>Once they gained enough emotional leverage, they nudged their victims toward fraudulent trading websites.</p><p></p><p>These platforms were designed to look professional, displaying fake portfolios with soaring profits to entice people into depositing more funds.</p><p></p><div class=\"media-wrap embed-wrap\"><div><blockquote align=\"center\" class=\"twitter-tweet\" data-dnt=\"true\"><p dir=\"ltr\" lang=\"en\">🚨$61 MILLION IN USDT SEIZED IN ROMANCE CRYPTO SCAM<br/><br/>U.S. Attorney’s Office in North Carolina says federal agents seized over $61M in USDT tied to a “pig butchering” scam.<br/><br/>Fraudsters posed as romantic partners and fake trading experts to lure victims into sending crypto. <a href=\"https://t.co/CVwcuEUkfx\">pic.twitter.com/CVwcuEUkfx</a></p>— Coin Bureau (@coinbureau) <a href=\"https://twitter.com/coinbureau/status/2026643349982118063?ref_src=twsrc%5Etfw\">February 25, 2026</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p></p><h2>How Did The Pig Butchering Scam Trap Victims?</h2><p>The term pig butchering refers to the practice of fattening up a victim with false gains before slaughtering them by stealing their entire investment.</p><p></p><p>When users eventually tried to pull their money out, the facade broke.</p><p></p><p>The scammers would suddenly demand taxes or processing fees to release the funds.</p><p></p><p>Even if these extra payments were made, the criminals simply blocked the accounts and vanished.</p><p></p><p>In one heartbreaking instance from December 2025, a Bitcoin investor lost his entire retirement fund.</p><p></p><p>He was manipulated by an online trader who used AI-generated images to create a believable, yet entirely fake, persona.</p><p></p><p>By the time he realized the platform was a sham, his coins had already been moved into a complex web of digital wallets.</p><p></p><div class=\"media-wrap embed-wrap\"><div><blockquote align=\"center\" class=\"twitter-tweet\" data-dnt=\"true\"><p dir=\"ltr\" lang=\"en\">A Bitcoin investor ust lost his entire retirement fund -- not to a hack, but to an AI-generated romance scam<br/><br/>No malware.<br/>No exploit.<br/>Just blackmail <br/>He sent the BTC himself <a href=\"https://t.co/x3b7pZHziY\">pic.twitter.com/x3b7pZHziY</a></p>— Jered King⚡Trading (@JeredKing) <a href=\"https://twitter.com/JeredKing/status/2001078264887140522?ref_src=twsrc%5Etfw\">December 16, 2025</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p></p><h2>Where Did The Stolen Millions Go?</h2><p>Tracking the money was a monumental task for Homeland Security Investigations (HSI).</p><p></p><p>The criminals laundered the proceeds by shuffling the USDT through a dizzying array of wallets to hide its origin.</p><p></p><p>However, investigators used advanced blockchain analysis to follow the digital breadcrumbs.</p><p></p><p>They eventually identified several addresses that still held massive balances, allowing them to freeze the assets before they could be cashed out.</p><p></p><p>Tether, the issuer of the stablecoin, played a critical role in this recovery.</p><p></p><p>By cooperating with the Department of Justice, the company helped freeze the suspicious addresses and facilitate the transfer of funds back under legal control.</p><p></p><p>The Department of Justice and HSI accepts Tether for its assistance in moving these assets, the official release stated, highlighting a growing trend of private-public partnerships in the fight against cybercrime.</p><p></p><div class=\"media-wrap embed-wrap\"><div><blockquote align=\"center\" class=\"twitter-tweet\" data-dnt=\"true\"><p dir=\"ltr\" lang=\"en\">Tether Acknowledged by DOJ for Support in $61 Million Seizure Linked to Pig Butchering Fraud<br/>Learn more: <a href=\"https://t.co/yp0F6oXmR5\">https://t.co/yp0F6oXmR5</a></p>— Tether (@tether) <a href=\"https://twitter.com/tether/status/2026723884976816270?ref_src=twsrc%5Etfw\">February 25, 2026</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p></p><h2>Can Law Enforcement Actually Stop Crypto Fraud?</h2><p>The sheer scale of the problem is reflected in the 2026 Crypto Scam Report by Chainalysis, which found that total losses reached $17 billion last year.</p><p></p><p>Most concerning is the 1,400% rise in AI-driven social engineering, where scammers use deepfakes and automated scripts to hunt for targets.</p><p></p><div class=\"media-wrap embed-wrap\"><div><blockquote align=\"center\" class=\"twitter-tweet\" data-dnt=\"true\"><p dir=\"ltr\" lang=\"en\">In our latest 2026 Crypto Crime Report chapter, we examine how crypto scams reached $17 billion in 2025, driven by sophisticated operations using AI, phishing-as-a-service tools, and professional money laundering networks. Our analysis reveals that impersonation scams grew 1400%… <a href=\"https://t.co/ioiVFu4OJv\">pic.twitter.com/ioiVFu4OJv</a></p>— Chainalysis (@chainalysis) <a href=\"https://twitter.com/chainalysis/status/2011055151558054393?ref_src=twsrc%5Etfw\">January 13, 2026</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p></p><p>Despite these challenges, U.S. Attorney Ellis Boyle remains firm that the tide is turning, stating that the seizure of $61 million proves that criminals will not keep their profits from cryptocurrency fraud schemes.</p><p></p><p>This $61 million seizure follows another major win in early 2026, where $400 million linked to darknet laundering was intercepted.</p><p></p><p>While authorities continue to expand their ability to trace illicit movements on the blockchain, they emphasize that prevention is the best defence.</p><p></p><p>Investors are urged to verify any platform through independent sources before moving digital assets, as the emotional and financial scars left by these partners can be permanent.</p></div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/9f8c56bc2f6b6dd2eb4fc225d3c2671a.jpeg",
            "link": "https://www.coinlive.com/news/romance-turns-into-crypto-trap-as-us-authorities-seize-61",
            "pub_date": "2026-02-26 16:39:43",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 250221,
            "title": "Circle surges 35%, fueling a crypto rebound; Circle becomes a beneficiary of AI panic.",
            "description": "<div class=\"share___SVvtl\"><div><p>Deng Tong, Jinse Finance</p>&gt;<p>On Sunday, the cryptocurrency market reacted sharply to the financial market crash triggered by the \"Global Smart Crisis of 2028\" report. The price of BTC once fell below the $63,000 mark. However, today, the overall cryptocurrency market has rebounded, with the price of BTC even briefly rising above $69,000. As of press time, BTC was trading at $68,368.86, a 24-hour increase of 5.2%. ETH also briefly rose above $2,100, and as of press time, it was trading at $2,064.98, a 24-hour increase of 9.3%.</p> What drove today's widespread surge in crypto prices? It's Circle! Circle may be one of the biggest beneficiaries of the \"Global Smart Crisis of 2028\" report. Circle's stock price surged 35.47% today, marking its largest single-day gain ever. <p><img alt=\"ao7vUPh0coXOOPsY2tJPMtBfsNNu363lBiG3LepH.jpeg\" src=\"https://img.jinse.com.cn/7435749_watermarknone.png\" title=\"7435749\"/></p><p>Circle's impressive financial report directly drove a surge in its stock price, ultimately leading to a general rise in the crypto market.</p><h2>I. Starting with AI Agents and Stablecoins</h2><p>With the rise of AI, the widespread adoption of AI agents is an inevitable trend and will become the main body of future economic activities. AI agent payments require a programmable, automatically executed, and human-free settlement method.</p><p>However, traditional payment systems, such as credit cards and bank transfers, are usually expensive, time-consuming, and require manual operation. They do not support real-time automation or machine-to-machine payments.</p><p> To address this issue, Coinbase developed the x402 protocol—x402 supports features such as automatic payments to creators, pay-per-article, and transactions between AIs. x402 boasts speed, autonomy, and ease of integration. Payments are completed instantly, without the need for credit cards, KYC verification, or third-party payment processors. Developers can embed stablecoin payment functionality into any application, website, or service with just a few lines of code. Undoubtedly, stablecoins can already replace traditional payment systems, meeting the economic activity needs of AI agents and becoming the payment fuel for them. Therefore, Circle, as the world's second-largest stablecoin issuer, will be one of the biggest winners in this AI wave. In January of this year, Circle CEO Jeremy Allaire pointed out that stablecoins will become the foundational payment layer for artificial intelligence. \"Billions of AI agents\" will soon need a native medium of exchange, and no traditional payment system can meet this demand. \"AI agents will continuously engage in economic activities at breakneck speed, often involving transactions amounting to only a fraction of a cent. Using your credit card or making a bank transfer is utterly absurd. In my view, there is currently no other way besides stablecoins.\" II. Circle's Strategy Last December, Jeremy Allaire explicitly mentioned Circle's vision for the AI ​​era: Circle will build an \"economic operating system\" for the internet and AI age. Circle is best known for its stablecoin USDC, but in itself, it is no longer just a payments company. It aims to become a neutral foundational layer for humans and AI agents to conduct transactions, investments, lending, and coordination globally. At the heart of Circle's strategy is Arc—an open Layer-1 blockchain designed specifically for payment and financial workflows. Allaire calls it the \"economic operating system of the internet.\" According to Circle, its key features include: Fees are denominated in USD—allowing developers and businesses to calculate costs using a stable currency, rather than the volatile native token. Fast payment and settlement—like a credit card transaction, funds arrive instantly. Privacy features—supporting real-world business activities while adhering to regulations. Building on this, Circle has also built its existing infrastructure: APIs, programmable wallets, and tools to embed USDC and smart contracts into any application or workflow. They collectively refer to this technology stack as an \"economic operating system.\" Circle is committed to enabling AI agents to operate economically. Their developer content demonstrates a model where agents collaborate on research tasks and then autonomously pay API or service fees using USDC, leveraging Circle's programmable wallet and blockchain infrastructure for secure settlement. Circle is attempting to redefine how humans and AI systems participate in the global economy—who can access it, what rules to follow, and whose infrastructure to use. Perhaps, in this AI revolution, Circle will become the new rule-maker. III. Market Expectations Reflected in Circle's Financial Report Yesterday, Circle released its financial results for the fourth quarter and full year of fiscal year 2025. The following are Circle's financial data: Fourth Quarter Revenue: As of the end of the year, USDC circulation was $75.3 billion, an increase of 72%. USDC on-chain transaction volume in the fourth quarter of 2025 was $11.9 trillion, an increase of 247%. Total revenue and reserve income in the fourth quarter of 2025 was $770 million, an increase of 77%. Net income from continuing operations in the fourth quarter of 2025 was $133 million, an increase of $129 million year-over-year. Adjusted EBITDA for the fourth quarter of 2025 was $167 million, a 412% increase. Full-Year Revenue: Total revenue and reserve income for fiscal year 2025 was $2.7 billion, a 64% increase. Net loss from continuing operations for fiscal year 2025 was $70 million, primarily due to $424 million in equity incentive expenses related to the initial public offering (IPO), compared to a net profit of $157 million from continuing operations in fiscal year 2024. Adjusted EBITDA for fiscal year 2025 was $582 million, a 104% increase. Business Highlights: Arc: The public testnet has been launched, attracting over 100 participants from sectors including banking, capital markets, digital assets, payments, and technology. The testnet is running robustly with near 100% uptime and a transaction confirmation speed of 0.5 seconds. In the 30 days ending February 20, 2026, it averaged 2.3 million transactions per day. Since the testnet launch, total transaction volume has exceeded 166 million. The Arc mainnet is still scheduled to launch this year. Circle Payments Network (CPN) Extension: As of February 20, 2026, 55 financial institutions have registered, and another 74 are undergoing qualification review. As of February 20, 2026, the network's activity continues to grow, with an annualized transaction volume of $5.7 billion in the past 30 days. Digital Asset Growth: As of the end of the year, the circulating supply of EURC was €310 million, representing a year-on-year increase of 284% and a quarter-on-quarter increase of 44%. As of the end of the year, USYC assets totaled $1.5 billion, a year-on-year decrease of 6% but a quarter-on-quarter increase of 111%, thanks to our relaunch of USYC in early Q3 2025. Continued Growth Momentum: Major enterprises continue to adopt Circle's infrastructure for the secure and compliant use of stablecoins. Visa announced that US card issuers and acquirers can use USDC for full settlement with Visa, enabling continuous settlement outside of traditional banking hours. Intuit launched a multi-year strategic partnership aimed at integrating USDC and Circle's supporting infrastructure into its platform. Circle has partnered with Polymarket, the world's largest prediction market, to promote USDC as a core collateral and settlement asset in its market. The Bermuda government announced plans to become the world's first fully on-chain national economy, powered by Circle's digital asset infrastructure. National Trust Charter: In December, Circle received conditional approval from the Office of the Comptroller of the Currency to establish a National Trust Bank, further strengthening USDC's infrastructure. These performance figures and market results are seen by some analysts as a reflection of investors' expectations for the \"AI-driven payment narrative.\" Conclusion From the panic triggered by the \"Global Smart Crisis of 2028\" report, which caused a sharp drop in the crypto market, to Circle's stock price soaring due to the AI ​​wave, driving a general rise in the crypto market, perhaps beyond the risks, there is more market optimism for the future. Whether looking at Circle's financial reports or the signals released by Circle executives, the trend of stablecoins evolving from a medium of exchange into financial infrastructure is undeniable. Holding USDC, the world's second-largest stablecoin, Circle is already at the forefront of this transformation.</p></div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/41f16d57c3e0ab9d85f153ba8fc8be7a.jpg",
            "link": "https://www.coinlive.com/news/circle-surges-35-fueling-a-crypto-rebound-circle-becomes-a",
            "pub_date": "2026-02-26 16:28:36",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 250222,
            "title": "Who exactly is Jane Street?",
            "description": "<div class=\"share___SVvtl\"><div><p style=\"text-align: left;\">Author: CoolFish Source: X, @kricspan</p><p style=\"text-align: left;\">A company with 3,000 employees earns more than Citibank and Bank of America. It doesn't advertise, has no CEO, and doesn't have non-compete agreements. Its name rarely appears in the news until it appears in the dock.</p><p style=\"text-align: left;\">On February 24, Terraform liquidators sued Todd Snyder, who sued high-frequency trading giant Jane Street, accusing it of using insider information to trade, illegally profiting, and ultimately accelerating the collapse of the Do Kwon crypto empire.</p><p style=\"text-align: left;\">Although Jane Street denied the allegations, calling them baseless, the market's attention has already begun to turn to this company. At the same time, a Jane Street internship recruitment posting circulated on Twitter.</p><p style=\"text-align: left;\"> The screenshot shows that the company is recruiting quantitative trading interns with a 4-month contract and a base salary of $300,000. Crucially, it doesn't require a financial background or programming experience; it only asks one thing: Can you solve problems? Seeing the salary and requirements at first glance is truly surprising. Who exactly is this company? Are quantitative intern salaries really this high? How does it make so much money? What role does it play in the global financial market? These questions deserve serious answers. Because once you peel back the layers of secrecy and truly understand this company, you'll realize one thing: Jane Street's existence itself is an extreme experiment about information, speed, and the boundaries of rules. Its name rarely appears in the news until it appears in the dock. A small, windowless office and four gamblers. New York, 1999. Three traders who left Susquehanna International Group (SIG), plus a programmer who jumped ship from IBM, rented a small, windowless office and started a business that most people would scorn: ADR arbitrage. ADRs, American Depositary Receipts, are stock certificates of foreign companies traded on the U.S. market. Theoretically, their price should be consistent with the original shares listed in the home country, but time zone differences, exchange rate fluctuations, and information delays can create tiny gaps between the two. The four founders of Jane Street—Tim Reynolds, Robert Granieri, Michael Jenkins, and Marc Gerstein—targeted these gaps, trading algorithms and speed for profits. This business is almost devoid of color: it lacks grand narratives and disruptive ambitions, possessing only an extreme sensitivity to numbers and a morbid pursuit of execution. According to research firm Alphacution, the company may have initially registered as \"Henry Capital,\" changing its name to Jane Street in August 2000. Externally, they maintain an almost obsessive low profile. This obsession seems to have been part of the company's DNA from the very beginning. Of the four founders, three came from the same company, leaving to start their own venture. Susquehanna even sued Jane Street for \"stealing proprietary information and poaching key talent\"—although the lawsuit ultimately fizzled out. This sensitivity may have profoundly influenced Jane Street's subsequent approach to its strategic secrets: no media interviews, no industry conference speeches, and no unnecessary exposure. They quietly worked on their problems in that small, windowless room. ETFs: The Bet That Changed Everything In the early 21st century, Jane Street made a decision that would later prove to be a game-changer: to focus its efforts on ETFs, a niche product at the time. ETFs (Exchange Traded Funds) were relatively marginal products in the early 2000s. They had low liquidity, few participants, and large institutions found them inconvenient to enter and exit, largely avoiding them. But it was precisely this \"unpopularity\" that made it Jane Street's ideal hunting ground. Market makers were the core logic of this game. Market makers simultaneously posted bids and asks, ready to trade with any counterparty and profit from the bid-ask spread. It sounds simple, but in practice, it requires accurate asset pricing at the millisecond level, managing massive inventory risk, and maintaining continuous operation in global markets. Jane Street achieved this with algorithms, and quickly and accurately. What followed was one of history's classic \"choosing the right track\" stories. ETFs experienced explosive growth over the next two decades, growing from hundreds of billions of dollars to trillions of dollars, with institutions, retail investors, and pension funds flocking in. Jane Street has become one of the most indispensable infrastructures in this market. 3,000 people, taking down Citigroup and Bank of America. Here are some figures that give you a clear sense of Jane Street's earning power: In 2024, Jane Street's net trading revenue was $20.5 billion. In the same year, Citigroup's trading division had net revenue of $19.8 billion. Bank of America's trading division had $18.8 billion. Jane Street won, surpassing Citigroup by $700 million and Bank of America by $1.7 billion. According to online data, Citigroup has approximately 220,000 employees worldwide. Bank of America has approximately 210,000 employees worldwide, while Jane Street has over 3,000 employees. This is an almost abnormal level of efficiency. </p><p style=\"text-align:center\"><img src=\"https://img.jinse.com.cn/7435772_watermarknone.png\"/></p><p style=\"text-align: left;\"><strong>Source: MSTIMES</strong></p><p style=\"text-align: left;\">By 2025, the data is even more astonishing. According to Bloomberg and other reports, Jane Street's net trading revenue in Q2 2025 was $10.1 billion, surpassing all major Wall Street banks. Its total revenue for the first three quarters of 2025 was $24 billion, exceeding its total revenue for the entire year of 2024...</p><p style=\"text-align: left;\">Comparing these figures to industry benchmarks: Citadel Securities' trading revenue in 2024 was approximately $9.7 billion, Virtu Financial's was approximately $2.9 billion, and Flow Traders' was approximately $500 million. Jane Street is at least twice as big as its competitors.</p><p style=\"text-align: left;\"> Beyond the scale figures, there are some market share data that can help you understand just how deeply this company has penetrated the market: In 2024, Jane Street held a 24% share of the primary market for listed ETFs in the United States, 41% of the trading volume of bond ETFs, and 17% of the secondary market for ETFs in Europe. Its average monthly stock trading volume reached $2 trillion, and it accounted for approximately 8% of all trading volume of Options Clearing Corporation in the US options market and over 10% of North American stock trading. In other words: every time you, your fund, or your pension fund buys or sells an ETF, there is a very high probability that the counterparty is Jane Street. And you might not even know it exists. OCaml, the Puzzle, and the Real War Machine Jane Street is headquartered at 250 Vesey Street in Manhattan's Financial District, New York. In the office, there's a genuine World War II-era Enigma encryption machine—the kind Nazi Germany used to encrypt communications. This machine isn't just decoration; it's a manifesto. This company loves encryption, loves puzzles, and loves building its world in a language only a select few can decipher. Jane Street's core trading system is programmed in OCaml. OCaml is a functional programming language known for its strong typing and logical rigor, but it's rarely used by other companies in the financial industry. As of 2023, Jane Street's OCaml codebase exceeded 25 million lines—the Financial Times points out, roughly half the size of the Large Hadron Collider's codebase. This choice seems unusual, but it has profound engineering logic: in financial trading systems, a single line of code bug can cause hundreds of millions of dollars in losses. OCaml's type system forces the elimination of a large number of potential errors during the compilation phase, making it harder to write runtime-crashing code than C++. A side effect is that engineers who have worked at Jane Street are often difficult for other companies to \"swallow\" because of their OCaml proficiency. As headhunters describe it: \"People stay at Jane Street because they love it, but also because no one can poach you with their OCaml skills.\" This creates an unexpected moat: the technology stack binds talent. It's worth noting that Jane Street has no CEO. There is no hierarchical bureaucracy, no management levels, and no familiar financial industry titles like \"Vice President\" or \"Managing Director.\" The Financial Times describes it as \"an extremely profitable anarchic commune.\" The company is decided by 30 to 40 senior employees and operates through a management committee and a risk committee. These 40 individuals hold approximately $24 billion in equity and run various trading desks and business units, but they are not called \"presidents\"; they are simply—owners. All employee compensation is linked to the company's overall profits, not individual trading performance. This means no one will take excessive risks for their own bonus, because losses are shared by everyone, and wins are shared by everyone. In 2024, Jane Street paid $1.4 million in compensation to its approximately 3,000 employees. The screenshot of the Jane Street internship recruitment ad wasn't a marketing gimmick, but rather Jane Street's consistent self-perception: they weren't looking for financial experts, but rather \"people who enjoy solving interesting problems.\" The interview process was notoriously difficult. Candidates were required to solve probability problems, game theory problems, and expected value calculations under pressure, testing their fundamental logical abilities rather than industry knowledge. According to the company, only a \"very small percentage\" of applicants were invited to the interview stage. </p><p style=\"text-align:center\"><img src=\"https://img.jinse.com.cn/7435774_watermarknone.png\"/></p><p style=\"text-align: left;\">The company does not use non-compete agreements—a rare exception in the financial industry where signing non-compete agreements for departing employees is almost standard practice. Jane Street believes that its competitive advantage is not a particular algorithm, but rather the culture and capability density of the entire system, which cannot be easily replicated.</p><p style=\"text-align: left;\">A senior hedge fund quantitative analyst pointed out that Jane Street is a haven for traders, while Citadel Securities is more suitable for quantitative analysts and developers.</p><p style=\"text-align: left;\">A senior hedge fund quantitative analyst pointed out that Jane Street is a haven for traders, while Citadel Securities is more suitable for quantitative analysts and developers.</p> ... “Jane Street was trader-oriented, while Citadel Securities was more systemic,” he explained. “Traders are more sociable, which is why Jane Street had a relaxed atmosphere and a strong poker culture.” Michael Lewis, author of the SBF biography *Going Infinite*, recalled that when SBF was still on Jane Street, its trading floor had a “sound system”: different prompts corresponded to different trading states. There was Homer’s “D’oh!” from *The Simpsons*, the 1-Up sound effect from *Mario*, and even the famous line from the 1998 strategy game *StarCraft*, “You must construct additional pylons.” The noise was everywhere. Some even thought the traders they were talking to were playing video games because the noise was so loud. This relaxed yet deliberately eccentric atmosphere is a cultural marker they consciously maintain while operating at full capacity. SBF and the 2016 Election Night: From the Most Profitable to the Most Lossful in History. In 2014, a young man who graduated from MIT joined Jane Street with a starting salary of $300,000. His name was Sam Bankman-Fried, known as SBF. He later founded FTX, then destroyed it, and was sentenced to 25 years in prison. But before that, his three years at Jane Street left behind the most dramatic night in the company's history. During his initial interview, SBF wasn't asked the usual questions like \"What did you do this summer?\" Instead, he faced a series of game-like challenges—essentially gambling games. He had to quickly solve math problems or probability questions, such as \"What is the probability of rolling at least one three when rolling two six-sided dice?\" or \"What is the probability of rolling two threes with two dice?\" These kinds of questions were easy for SBF, and he thrived in them. As the questions became more complex and the pace faster, his performance improved dramatically. He \"immediately realized that the key to the game was to quickly assess the expected value of bizarre situations and act accordingly.\" He understood that the interviewer was \"testing his judgment and execution in handling chaotic situations—not getting bogged down in questions he couldn't answer.\" This game-like format was testing the potential of a future trader. But the real reward came from applying these skills in real-world trading. And that real-world experience came two years later. During the 2016 presidential election, Jane Street traders believed that global stock markets would crash if Donald Trump were elected. According to Lewis, to gain a competitive edge, Jane Street put SBF in charge of a project designed to develop a system capable of predicting election results. Their goal: to know the election results before CNN and then trade faster than anyone else. SBF assigned different traders to analyze voting data in various states. The system performed remarkably well—Jane Street predicted results minutes or even hours earlier than CNN in several key states. On election night, shortly before midnight, the system signaled that Florida's voting data heavily favored Trump, with his chances of winning jumping from 5% to 60%. \"We even had time to break down, think there must be a typo in the number, confirm there isn't, and then say: 'Fuck it, sell.'\" —SBF later told biographer Michael Lewis. According to Lewis's account, Jane Street shorted the S&amp;P 500 index, holding positions worth billions of dollars, while simultaneously shorting stock markets in multiple countries around the world, betting on a market crash after Trump's election. When SBF went to sleep, he had a paper profit of $300 million. This was the company's largest single profit in history. Three hours later, he returned to the trading desk and found the world had changed. The market had digested Trump's victory, and then… it started to rise. The US market rose instead of falling—because Trump was seen by many as a pro-business candidate. Jane Street's short positions were squeezed out during this rally. \"What was once Jane Street's largest single profitable trade in history became its largest single loss—a loss of $300 million.\" —SBF. From +300 million to -300 million, a net change of $600 million overnight. Jane Street didn't punish SBF. They chose a different evaluation method: SBF's predictive system was accurate; his model wasn't wrong. The mistake lay in his judgment of the market's reaction direction, which wasn't purely a mathematical problem. Reportedly, he even received internal praise for the accuracy of the predictive machine itself. Based on his outstanding trading performance, Jane Street paid SBF $300,000 in his first year, $600,000 the following year, and a $1 million bonus in his third year. It was estimated that if he maintained this performance, his annual salary would reach $75 million in ten years. But he chose to leave to establish Alameda Research and FTX—and then, in another way, made history again. The Jane Street Exodus List After the FTX collapse, it was surprising to find that Jane Street's alumni network almost dominated the list of key figures in the entire event: SBF himself (Jane Street trader, 2014-2017). Caroline Ellison (Alameda CEO, SBF's ex-girlfriend, former Jane Street trader). Gabe Bankman-Fried (SBF's brother, former Jane Street trader, but briefly and in a somewhat awkward position). Lily Zhang and Duncan Rheingans-Yoo (former SBF colleague, later founder of Modulo Capital, which received approximately $400 million in investment from Alameda and is headquartered in the same building as SBF's Bahamas residence). The density of this circle is undeniable. Jane Street nurtured some of the most important people in the crypto world of this era, in whatever sense they are considered \"important.\" * Part of the reason was that his brother had just left Jane Street and started poaching people from Jane Street to join his own competing trading firm. Sources say the brothers went for a long time without speaking to each other. A $1 Billion Secret<p style=\"text-align: left;\">This story began with a lawsuit, which unexpectedly ignited an even larger crisis.</p><p style=\"text-align: left;\">In February 2024, two traders at Jane Street—Douglas Schadewald and Daniel Spottiswood—abruptly resigned and jumped ship to hedge fund giant Millennium Management.</p><p style=\"text-align: left;\">Jane Street subsequently filed a lawsuit against the two and Millennium in April, accusing them of stealing a \"highly valuable\" proprietary trading strategy.</p><p style=\"text-align: left;\">What was the core of this strategy? A seemingly insignificant detail in court revealed to everyone that it was a short-term index options strategy specifically targeting the Indian options market—which generated over $1 billion in profits for Jane Street in 2023 alone.</p><p style=\"text-align: left;\"> More specifically, after two traders took this strategy to Millennium, Jane Street's profits in the Indian market plummeted by 50% in March 2024. Meanwhile, Millennium's Indian operations began a rapid expansion. In December 2024, the case was settled under a confidentiality agreement, the specific terms of which were not disclosed. However, Jane Street's disclosure of a \"$1 billion Indian options strategy\" in the lawsuit attracted the attention of the Securities and Exchange Commission of India (SEBI). Many Indian retail investors suffered heavy losses in options trading; why was a foreign company able to earn such enormous profits? On July 3, 2025, the SEBI issued a 105-page temporary injunction, announcing the conclusion of its investigation. SEBI's description paints a picture like this: On the expiration date of Bank Nifty options, Jane Street's algorithm buys a large number of Bank Nifty constituent stocks and stock index futures after the market opens (9:15-11:46), sometimes accounting for more than 20% of the total market trading volume, including core heavyweight stocks such as Kotak Bank, SBI, and Axis Bank. Simultaneously, Jane Street establishes a large short position in the options market: selling call options and buying put options. In the afternoon (11:49 to the close), Jane Street begins to reverse its strategy: selling a large number of stocks and futures bought in the morning, artificially putting downward pressure on the index. The closing price on the expiration date shifts lower, and the previously established short option positions profit significantly. On a particular day during SEBI's focused audit, Jane Street incurred a loss of approximately $7.5 million in spot and futures trading, but gained approximately $89 million in options trading. Net profit: $81.5 million. From January 2023 to March 2025, SEBI statistics show that Jane Street's total profits across all trading segments reached 365.0212 billion rupees (approximately $4 billion). Notably, Jane Street profited 432.8933 billion rupees in index and stock options trading, but incurred a net loss of 72.08 billion rupees in stock futures trading. SEBI's original statement: \"This outrageous behavior, blatantly ignoring the explicit warning issued to it by the NSE in February 2025, clearly demonstrates that Jane Street is not a bona fide market participant like the vast majority of foreign institutions and is not worthy of trust.\" SEBI also added an unsettling context: the institution had previously conducted its own statistics showing that 93% of retail options traders in the Indian derivatives market lost money, with annual losses exceeding 1 trillion rupees. During the same period, professional trading institutions—represented by Jane Street—profited handsomely. On July 4, 2025, SEBI suspended Jane Street's trading qualifications in India, and its bank accounts were frozen, prohibiting any unauthorized deductions. On July 14, Jane Street deposited approximately 4.84 billion rupees (about $560 million) into an escrow account as required, applying to have its trading privileges reinstated. On July 21, SEBI allowed it to resume trading—on the condition that it continue to cooperate with the investigation. In an internal memo, Jane Street denied all allegations, calling the Securities and Exchange Commission of India's charges \"highly inflammatory\" and arguing that its activities involved arbitrage trading of underlying indices, \"a core and pervasive mechanism for maintaining price consistency in financial markets,\" and filed an appeal. As of February 2026, the case was still pending. A New Footnote to the Luna Crash</p><p style=\"text-align: left;\">In May 2022, TerraUSD and Luna collapsed. The UST algorithmic stablecoin plummeted from $1 to worthless, and Luna fell from $116 to near zero, wiping out $40 billion in value instantly.</p><p style=\"text-align: left;\">Perhaps we didn't consider the culprit behind the collapse at the time, but four years later, this collapse has a new footnote.</p><p style=\"text-align: left;\">On February 23, 2026, Todd Snyder, the liquidator of Terraform Labs, filed a lawsuit in Manhattan federal court against Jane Street.</p><p style=\"text-align: left;\">At the heart of the lawsuit is a private chat group called \"Bryce's Secret\".</p><p style=\"text-align: left;\"> The group chat was created by Bryce Pratt, an employee of Jane Street. He was a former intern at Terraform before joining Jane Street, but his old network remained intact—the other two members of the group were a software engineer and a business development manager at Terraform. According to the lawsuit, this group chat was created in February 2022 and became an information conduit connecting Terraform internally with Jane Street. On May 7, 2022, at 5:44 PM, Terraform Labs quietly withdrew $150 million of UST from the Curve decentralized liquidity pool. This operation was not publicly announced, and no outsiders knew about it. Ten minutes later, a wallet associated with Jane Street withdrew $85 million of UST from the same liquidity pool. Terraform and Jane Street together withdrew a total of $235 million of UST from this liquidity pool, directly breaking through UST's liquidity support. UST began to decouple, and panic began to spread. Bloomberg quoted a key statement in the lawsuit: Jane Street's actions allowed it to \"cover hundreds of millions of dollars in potential exposure in the hours before the Terraform ecosystem collapsed.\" Two days later, on May 9, UST had fallen to $0.8, and the collapse was irreversible. Bryce Pratt messaged Do Kwon and the Terraform team via group chat, indicating that Jane Street \"could consider buying Luna at a significant discount.\" First, they moved the valuables out of the fire, then came back to ask the homeowner if they wanted to sell at a loss. The defendants named in the lawsuit, besides Pratt, include Jane Street co-founder Robert Granieri (the only one of the four founders still employed) and employee Michael Huang. Jane Street's response was concise: \"A desperate lawsuit, transparent extortion.\" They added that the losses suffered by Terra and Luna investors stemmed from \"billions of dollars in fraud\" by Do Kwon and Terraform management, and they would fight back forcefully. They weren't wrong. Do Kwon did plead guilty and was sentenced to 15 years; Terraform did pay a $4.47 billion fine. However, \"Do Kwon is guilty\" and \"everyone else is innocent\" are not mutually exclusive. A building had a fatal structural flaw—that's a fact. The fact that someone emptied the most valuable items before it collapsed is a separate legal issue. What exactly is this company? The story of Jane Street is difficult to summarize in a single word. Its $20.5 billion net income in 2024 is enough to prove it as \"one of the most profitable companies on Wall Street.\" It's also considered \"the most elite talent selection machine\"—its extremely low acceptance rate, the OCaml skill set that's not readily accepted by external markets, and its ultra-high-salary executives all point to this conclusion. The SEBI's 105-page ruling, Terraform's lawsuit, and Millennium's secret settlement all point to this conclusion, suggesting it is a \"deep player in the gray areas of the rules.\" It may simultaneously be all of these. Information asymmetry always exists in financial markets. Jane Street's uniqueness lies in its ability to leverage this asymmetry at a systemic level. \"At Jane Street, a good trader isn't a truly good trader unless they can explain why they are good.\" —Michael Lewis, *Going Infinite*. What is the true price of the market at any given moment? Where are pricing discrepancies? How to discover and trade faster than everyone else? Jane Street seems to be constantly solving these mysteries. The math questions in an interview can be a mystery, Terra's crash can be a mystery, and the disappearance of Bitcoin's \"10 AM sell-off\" after it was sued is also a mystery. Jane Street describes itself as \"a collection of puzzle solvers.\" But when the market's attention begins to turn to Jane Street itself, it itself becomes a mystery.</p></div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/cd4a4a5d14d1796bf9fa5a03f9149b7a.jpg",
            "link": "https://www.coinlive.com/news/who-exactly-is-jane-street",
            "pub_date": "2026-02-26 16:30:45",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 250210,
            "title": "Who created Aave?",
            "description": "<div class=\"share___SVvtl\"><div><p style=\"text-align: left;\">Author: Atomist Source: castlelabs Translation: Shan Ouba, Jinse Finance</p><p style=\"text-align: left;\">Aave is the largest lending protocol in the DeFi space. With a total value locked of $26 billion and annual revenue of $140 million, it holds a 60% share of the DeFi lending market. Now, the question of how it got to where it is today has sparked heated debate on its governance forum: the founding company and the most influential representatives of the DAO have released conflicting narratives about the same period of history. Neither side is neutral; both possess significant governance power and financial interests in the resolutions soon to be voted on by token holders.</p><p style=\"text-align: left;\">The following text, based on the original documents, reconstructs the full picture of the events.</p><p style=\"text-align: left;\"> On February 12th, Aave Labs released a framework proposal titled \"Aave Will Prevail.\" According to the proposal, 100% of the protocol's product revenue will belong to the DAO, and Labs is requesting $42.5 million in stablecoins and 75,000 AAVE tokens as funding in the first year, totaling approximately $51 million. This funding represents 31.5% of the protocol's total treasury value and 42% of its non-AAVE reserves, and will be allocated entirely to a single service provider through a bundled vote. The framework also proposes formally establishing V4 as the future technical version of the protocol, suspending new feature development for V3, and planning to eventually abandon V3. Currently, V4 is still in the testnet phase, while all of Aave's revenue is generated by V3. Before the snapshot vote, community feedback requested: disclosure of relevant wallets, establishment of a foundation structure before fund disbursement, and linking the deprecation of V3 to the adoption milestone of V4. However, the vote proceeded without making any mandatory commitments to these points. Two Narratives On February 25th, two posts appeared on the Aave governance forum within hours. Aave Labs released a contribution report. Their narrative is that they created every protocol version from V1 to V4, flash loans, eMode, security modules, GHO, front-end interface, and branding. Since 2017, they have written over 570,000 lines of code. Regarding revenue attribution, their position is that the underlying architecture supporting various strategies originated from their original design, and attributing revenue to any single contributor distorts the actual operation of layered protocol development. ACI founder Marc Zeller released a financial breakdown analysis. According to his data, Aave Labs has accumulated $86 million in funding, including its 2017 initial coin offering, venture capital, DAO payments, and what he claims are exchange fees transferred from the DAO without governance voting. He traced 23% of the token supply to 52 wallets linked to the founding infrastructure. He calculated that for every $1 in revenue earned by Horizon, Aave Labs' institutional-grade real-world asset product, the DAO incurred approximately $24 in costs—based on $4.2 million in Merkl incentive expenses compared to only $216,000 in revenue. He listed six independent products he believes have failed or are still unprofitable, and claimed that 98% of V3's revenue comes from code delivered by BGD Labs and other DAO service providers, rather than development directly by Aave Labs. Both sides' arguments are well-founded and driven by self-interest. The core development team has left. Eight days after the \"Aave will prevail\" framework proposal was released, BGD Labs announced that its contract would expire on April 1st and would not be renewed. BGD developed versions V3.1 through V3.7, the liquidity eMode, and a crucial part of Aave's governance infrastructure. Their official reason for leaving was that Labs pressured V3 to promote V4 but failed to collaborate with BGD on V4 development, and imposed what BGD called \"artificial restrictions\" on V3 improvements. The team that wrote all the code supporting Aave's current revenue generation believed that the current environment was no longer suitable for them to continue working. They pledged two months of security support to handle major incidents, after which they would completely withdraw from the market in June. Market Background: Since the brand ownership dispute erupted in December 2025, the AAVE token price has fallen by approximately 32%. During the same period, Morpho, which waives protocol fees, has risen by approximately 42%. It's difficult to definitively say whether governance uncertainty caused this divergence or other factors played a dominant role. What is certain is that Aave has annual revenue of $140 million and is currently implementing buybacks, yet its token has lagged behind its direct competitors by over 70 percentage points in the past two months. Core of the Controversy: Putting aside the conflicting data, the core controversy is quite straightforward: Aave Labs, as the creators of the protocol, believe they should receive continued funding commensurate with their contributions. A coalition of DAO representatives argues that Labs is just one of many service providers and should be subject to the same accountability standards as other parties. Both positions are logically consistent. The tension between the two sides is not a dysfunction, but rather signifies something unusual happening at Aave. Most DeFi protocols don't have this problem. The founding teams of most protocols simultaneously act as DAOs, leading decision-making and receiving funding. In most cases, governance is merely a formality. Aave is different: it possesses a genuine ecosystem of technically capable and financially independent service providers (BGD, ACI, Chaos Labs, TokenLogic) capable of genuinely challenging the founding team's proposals. This is extremely rare. Building such a distributed contributor infrastructure is incredibly difficult, and most protocols have never achieved it. This conflict exists precisely because, regardless of how \"Aave\" is defined, it is inherently successful. The question now is whether the DAO can recognize its own strengths and weaknesses before voting. BGD's departure is the clearest warning sign. If the governance environment evolves into one where the best independent contributors leave because the Labs roadmap squeezes out all other space, then the distributed model that made Aave stand out may begin to crumble.</p></div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/fa852d563141a24f7fedddf3380d034e.jpg",
            "link": "https://www.coinlive.com/news/who-created-aave",
            "pub_date": "2026-02-26 15:41:59",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 250207,
            "title": "Macroeconomic and Bitcoin On-Chain Data for Week 8 of 2026: The Shocks Caused by Tariffs",
            "description": "<div class=\"share___SVvtl\"><div><p style=\"text-align: left;\">Author: Phyr<span style=\"text-align: justify;\">ex；Source: X，</span><span style=\"text-align: justify;\">@Phyre</span><span style=\"text-align: justify;\">xNi</span></p><p></p><p style=\"text-align: left;\">Trump's IEEPA tariffs have finally been deemed illegal, marking the end of Trump's largest tariff diplomacy and weaponization of tariffs since his second term. Although Section 122 is currently being used as a transitional measure, the total tariff of 15% is still lower than IEEPA, especially for China, Japan, South Korea, and Taiwan, where actual tariffs have been significantly reduced. Moreover, Section 122 only has 150 days to expire and requires congressional approval. Democrats have stated that they will do everything in their power to prevent the tariffs from continuing, meaning that there may be further easing of tariffs by mid-to-late July.</p> Of course, Trump isn't going to take this lying down. The White House is still looking for new tariff solutions, but their impact is likely to be less than that of IEEPA. It will become increasingly difficult for Trump to weaponize tariffs, which is certainly good for risk markets. Markets fear uncertainty, and Trump is the biggest uncertainty factor. Currently, the EU has temporarily suspended tariff negotiations with the US due to the complexity of tariffs, which also brings with it many related investments planned for the US, such as investments by Japan and South Korea in the US to reduce tariffs. <p style=\"text-align:center\"><img alt=\"e6sTYNjVlixvC3pRxcD0ckp61BIJ04AERAUjKMxP.jpeg\" src=\"https://img.jinse.com.cn/7435733_watermarknone.png\" title=\"7435733\"/></p><p style=\"text-align: center;\"><span style=\"font-size: 16px;\">Kalshi's predictions on the outcome of the two houses</span><br/></p><p style=\"text-align: left;\">Now that tariffs have been substantially reduced, whether these investments will continue is a question mark, and the Supreme Court's rejection of the IEEPA tariff path will indeed damage the Trump administration's policy authority and market expectations.</p><p style=\"text-align: left;\"> Prediction platforms have already bet on a potential better result for the Democrats in the midterm elections. Based on current trends, the Republicans are likely to lose the House of Representatives, and may even lose the Senate. If this happens, it would represent the disappointment of American voters with Trump and the Republican Party. After the tariffs were ruled illegal, refunds became a key focus. Tariff revenue has already been incorporated into the overall federal cash flow system, and this money has been largely spent. Therefore, once the substantive refund process begins, the pressure will directly fall on the Treasury's cash management and debt issuance arrangements. Currently, the IEEPA is estimated to involve around $134 billion, which is not a small amount for the Treasury, especially given the simultaneous increase in other spending pressures. If the refund process proceeds too quickly, and the Treasury does not want to significantly reduce TGA, then it will likely have to offset the cash flow gap by issuing more short-term Treasury bonds. The new supply of short-term Treasury bonds will redistribute liquidity among money market funds, bank reserves, and overnight reverse repurchase agreements. If the liquidity shock felt by the market is mainly absorbed by money market funds migrating from overnight reverse repos, it will be relatively mild. However, if the absorption is mainly from bank system reserves or crowds out other short-term asset allocations, liquidity tightening may occur. This, coupled with escalating geopolitical conflicts in the Middle East and adjustments to defense-related spending, could put pressure on risk markets. However, a refund is unlikely in the short term; it will probably remain a subject of legal and administrative maneuvering for some time. At this stage, it's more appropriate to treat the refund as a medium-term liquidity variable that needs continuous monitoring, rather than an event to be bet on immediately. It's worth noting that when refund expectations shift from legal discussions to explicit cash arrangements from the Ministry of Finance, the market will more acutely reassess liquidity, potentially putting short-term pressure on the market. The impact of tariffs on risk markets began in February 2025, and the trade war with China in April caused a significant market pullback. Although the market is currently in a period of volatility, the impact of tariffs on the market will gradually decrease, as will their impact on inflation. Therefore, in the long run, the removal of IEEPA tariffs is beneficial to risk markets, and market dynamics will return to the Federal Reserve's monetary policy. The Federal Reserve is likely to further loosen its control over negative factors. For risk markets, the Supreme Court's rejection of IEEPA has significantly weakened Trump's tariff toolbox. Even if the White House continues to seek alternatives, the market will increasingly tend to assess them within the framework of legal constraints and bipartisan bargaining, rather than being repeatedly swayed by a single statement as before. Therefore, the impact of Trump's announcement of a 15% alternative tariff globally will not be significant. From a broader perspective, the peak of tariff suppression on risk markets has likely passed. Going forward, the real determinants of market rhythm will be liquidity and fundamentals, namely monetary policy. </p><p style=\"text-align:center\"><img alt=\"qI3geB1ufLjWa52bOZheuyAOq88J7mcXJp60iwqE.jpeg\" src=\"https://img.jinse.com.cn/7435735_watermarknone.png\" title=\"7435735\"/></p><p style=\"text-align: center;\"><span style=\"font-size: 16px;\">Net inflow of Bitcoin spot ETFs in the past year</span><br/></p><p style=\"text-align: left;\">Short-term volatility caused by tariffs is inevitable, especially since cryptocurrencies themselves are already illiquid, and traditional investors are continuously reducing their holdings. Even Bitcoin is showing signs of a lack of confidence. From the perspective of traditional investors, spot ETFs...</p> ... Although there are still signs of outflows, it is clear that the outflow volume has been gradually decreasing over the past month. This likely indicates that the exit of panic investors is coming to an end, and with the price of BTC now at the shutdown price of mining machines, buying BTC is more cost-effective than mining. <p style=\"text-align:center\"><img alt=\"ZRMwXhCgcRxSsvzDLKd9TKNwLbxKfv9YtWBhPp9q.jpeg\" src=\"https://img.jinse.com.cn/7435736_watermarknone.png\" title=\"7435736\"/></p><p style=\"text-align: center;\"><span style=\"font-size: 16px;\">Bitcoin Mining Difficulty in the Last Five Years</span><br/></p><p style=\"text-align: left;\">I originally thought that Bitcoin mining difficulty would continue to decrease after entering the shutdown price range, but unexpectedly, the difficulty rebounded by nearly 14% this week. The rebound trend is very obvious. I wonder if it is due to the price reduction of mining machines. If it is the latest model of mining machine, the current shutdown price of pure electricity can be as low as 30,000.</p> ... The price is around $100,000, but regardless of the reason for the increased mining difficulty, it shows that miners are still quite interested in the current price. <p style=\"text-align:center\"><img alt=\"Jx4rqiQtZ7rPSX0kW8ze6oEThFpH4Vme2eijsz5H.jpeg\" src=\"https://img.jinse.com.cn/7435737_watermarknone.png\" title=\"7435737\"/></p><p style=\"text-align: center;\"><span style=\"font-size: 16px;\">All-time NUPL values ​​for long-term holders</span><br/></p><p style=\"text-align:center\"><img alt=\"ntAff2p4KDCvIjlYgy2Am1cDlvbmO3hPDgecNK5u.jpeg\" src=\"https://img.jinse.com.cn/7435738_watermarknone.png\" title=\"7435738\"/></p><p font-size:=\"\" style=\"text-align: &lt;p style=\">NUPL Value of Long-Term Holders in the Past Year</p><br/><p style=\"text-align: left;\">For the past three weeks, I've been saying that based on the NUPL data of long-term holders, Bitcoin is currently at a transitional point between bull and bear markets, almost entering a bear market. This is still the case now. The yellow area represents the transition zone, signifying anxiety. Indeed, many investors are currently in a state of anxiety, worried that BTC will fall further. However, from my personal perspective, even if there is further downward movement, it is unlikely to be too deep. Of course, this is not just a random thought.</p><p style=\"text-align:center\"><img alt=\"w2ciLgFZTKkqS4fqG6chHTJAFXWhf0HgCqEMU8xM.jpeg\" src=\"https://img.jinse.com.cn/7435739_watermarknone.png\" title=\"7435739\"/></p><p style=\"text-align: center;\"><span style=\"font-size: 16px;\">Net Positions of Bitcoin on Exchanges in the Past Year and a Half (30 Days)</span><br/></p><p style=\"text-align: left;\">Looking at the net positions of Bitcoin on exchanges in the past year and a half, the selling of BTC in the 30-day data has been gradually decreasing, which also indicates that spot and spot ETFs...</p><p style=\"text-align: left;\">From the net position data of Bitcoin on exchanges in the past year and a half, the selling of BTC in the 30-day data has been gradually decreasing, which also indicates that spot and spot ETFs...</p> ... The trend is very similar. Whether it is traditional investors or native cryptocurrency investors, they have very little interest in selling at the current price. Most investors are less likely to sell when the price is lower. Many people may not believe this view, but the actual data shows it very clearly. <p style=\"text-align:center\"><img alt=\"ypAO9FZ3CcUjsGYtG2CpbCtch6UV9sBJg352jCdR.jpeg\" src=\"https://img.jinse.com.cn/7435740_watermarknone.png\" title=\"7435740\"/></p><p style=\"text-align: center;\"><span style=\"font-size: 16px;\">Bitcoin price distribution on January 25, 2026</span><br/></p><p style=\"text-align:center\"><img alt=\"0ORQ8RJPhS6ZF4gGcv6PXYGeT8gEw6aYi8EKPcKw.jpeg\" src=\"https://img.jinse.com.cn/7435741_watermarknone.png\" title=\"7435741\"/></p><p style=\"text-align: center;\"><span style=\"font-size: 16px;\">Bitcoin Price Distribution on February 25, 2026</span><br/></p><p style=\"text-align: left;\">Because I have a habit of writing daily records, I selected Bitcoin price distribution data from a month ago and compared it with today's data. In one month, the price of BTC dropped from $90,000 to $65,000, but it can be seen that the change in price distribution during this month was not very large. In particular, the marked support levels did not show any signs of collapse. In other words, neither early profitable investors nor recent investors who suffered significant losses showed any obvious panic selling. Even investors with holding costs above $100,000 have not shown signs of leaving the market in large numbers. This is a situation that has almost never occurred in the history of bear markets. This also means that more investors, whether actively or passively, are shifting towards long-term holding. Short-term price fluctuations are no longer enough to make these investors give up their shares. In other words, low prices may not be enough to make long-term holders surrender. </p><p style=\"text-align:center\"><img alt=\"UIpi7TUusAvhidScYoLxg7n5tYK500Qy0WCiImAf.jpeg\" src=\"https://img.jinse.com.cn/7435742_watermarknone.png\" title=\"7435742\"/></p><p style=\"text-align: center;\"><span style=\"font-size: 16px;\">Bitcoin Flows of Holders Over One Year</span><br/></p><p style=\"text-align: left;\">Looking at the movement of investors who have held Bitcoin for over one year, after bottoming out in December 2025, the BTC held by long-term holders not only did not decrease, but actually increased. This is the most obvious data; the price reduction led more investors to hold, which also shows that more investors are still very much looking forward to Bitcoin's future performance.</p><p style=\"text-align:center\"><img alt=\"arZkE6HfKn9S1COpzykYrnTT9whikpUqC1Fcgut6.jpeg\" src=\"https://img.jinse.com.cn/7435743_watermarknone.png\" title=\"7435743\"/></p><p style=\"text-align: center;\"><span style=\"font-size: 16px;\">Bitcoin data transferred to all exchanges in the past year</span><br/></p><p style=\"text-align:center\"><img alt=\"AheiBkk2NtGHHj01R76nzpr4IBhirA3qKMLPdpNv.jpeg\" src=\"https://img.jinse.com.cn/7435744_watermarknone.png\" title=\"7435744\"/></p><p a=\"\" accordingly=\"\" already=\"\" also=\"\" among=\"\" amount=\"\" an=\"\" and=\"\" are=\"\" as=\"\" at=\"\" be=\"\" been=\"\" begun=\"\" bitcoin=\"\" btc=\"\" buying=\"\" by=\"\" caused=\"\" chairman=\"\" change=\"\" changes=\"\" could=\"\" cryptocurrency=\"\" current=\"\" cut=\"\" cycle.=\"\" data=\"\" decent=\"\" decline.=\"\" decrease=\"\" decreases=\"\" decreasing=\"\" demonstrating=\"\" despite=\"\" difficult=\"\" dips.=\"\" earlier=\"\" easing=\"\" elections.=\"\" even=\"\" evidence=\"\" evident=\"\" exchanges=\"\" excuse.=\"\" failing=\"\" fallen=\"\" fed=\"\" federal=\"\" focused=\"\" for=\"\" forward=\"\" from=\"\" funds=\"\" further=\"\" future=\"\" given=\"\" half=\"\" has=\"\" have=\"\" himself=\"\" hopefully=\"\" however=\"\" if=\"\" implementation=\"\" implemented.=\"\" important=\"\" improve=\"\" in=\"\" increase.=\"\" indicate=\"\" inflation=\"\" inflow=\"\" interest=\"\" investor=\"\" investors=\"\" is=\"\" it=\"\" lack=\"\" last=\"\" longer=\"\" looking=\"\" many=\"\" market=\"\" may=\"\" meetings=\"\" mentioned=\"\" midterm=\"\" most=\"\" net=\"\" no=\"\" not=\"\" of=\"\" on=\"\" over=\"\" past=\"\" points=\"\" powell=\"\" power=\"\" pressure=\"\" purchasing=\"\" rate=\"\" rebound.=\"\" reduced=\"\" reserve=\"\" said=\"\" second=\"\" sector=\"\" see=\"\" selling=\"\" selling.=\"\" sentiment.=\"\" shown=\"\" significant=\"\" so=\"\" still=\"\" suggests=\"\" surrounding=\"\" sustained=\"\" tariff=\"\" tariff-induced=\"\" tariffs=\"\" that=\"\" the=\"\" there=\"\" this=\"\" though=\"\" to=\"\" transferred=\"\" trend.=\"\" two=\"\" uncertainties=\"\" upward=\"\" us=\"\" volatility=\"\" weren=\"\" while=\"\" will=\"\" worth=\"\" would=\"\" year=\"\"></p></div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/c74235a7af82e0f9b0cbff37bf3735b5.jpg",
            "link": "https://www.coinlive.com/news/macroeconomic-and-bitcoin-on-chain-data-for-week-8-of-2026",
            "pub_date": "2026-02-26 15:29:23",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        }
    ]
}