{
    "data": [
        {
            "id": 212704,
            "title": "SEC’s New Crypto Task Force Aims for Regulatory Reset, Sets Bold New Agenda—But Can Years of Regulatory Chaos Be Undone?",
            "description": "<div class=\"share___SVvtl\"><div><h1>Crypto Task Force Details Plan, Pushes for Clearer Regulations</h1><p>The SEC’s newly formed Crypto Task Force aims to bring long-overdue regulatory clarity to the industry, <a href=\"https://www.sec.gov/newsroom/speeches-statements/peirce-journey-begins-020425 \" target=\"\">according to Commissioner Hester Peirce,</a> often referred to as \"Crypto Mom.\" </p><p></p><p>The initiative will shift some enforcement and policy decisions away from the SEC’s direct oversight, introducing both risks and opportunities for consumers.</p><p></p><p><a href=\"https://www.coinlive.com/news/crypto-mom-hester-peirce-leads-u-s-sec-task-force-to \" target=\"\">Peirce</a>, appointed by Acting Chair Mark Uyeda to lead the task force, outlined ten key priorities. </p><div class=\"media-wrap embed-wrap\"><div><blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\">🔥SEC Commissioner <a href=\"https://twitter.com/HesterPeirce?ref_src=twsrc%5Etfw\">@HesterPeirce</a> announces the initial list of priorities the SEC Crypto Task Force will tackle:<br/><br/>-security/commodity status<br/>-scoping out: identify areas outside the SEC's purview, and define them as such (no-action letters, etc) <br/>-token offerings: (potentially… <a href=\"https://t.co/Zsi9j26kl7\">pic.twitter.com/Zsi9j26kl7</a></p>— Alexander Grieve (@AlexanderGrieve) <a href=\"https://twitter.com/AlexanderGrieve/status/1886869439293067404?ref_src=twsrc%5Etfw\">February 4, 2025</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p>These include clarifying whether cryptocurrencies qualify as securities or commodities, establishing a more practical path for token registration, and determining the regulatory status of crypto lending and staking programmes. </p><p></p><p>She also emphasized the need for transparency regarding crypto ETFs, with new applications for XRP, Solana, and Dogecoin funds under review, along with proposals to introduce staking rewards for ETF holders.</p><p></p><p>In contrast to the previous administration’s enforcement-driven approach, Peirce highlighted the task force’s commitment to providing clear regulatory guidance. </p><p></p><p>The initiative marks a significant shift following <a href=\"https://www.coinlive.com/news/good-riddance-gary-gensler-as-crypto-friendly-mark-uyeda-steps-in \" target=\"\">former SEC Chair Gary Gensler’s departure. </a></p><p></p><p>Just two days after its creation, the SEC rescinded its contentious Staff Accounting Bulletin 121, a move Peirce hailed as a milestone in reshaping crypto oversight under the new administration.</p><div class=\"media-wrap embed-wrap\"><div><blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\">Bye, bye SAB 121! It's not been fun: <a href=\"https://t.co/cIwUc0isUE\">https://t.co/cIwUc0isUE</a> | Staff Accounting Bulletin No. 122</p>— Hester Peirce (@HesterPeirce) <a href=\"https://twitter.com/HesterPeirce/status/1882562977985114185?ref_src=twsrc%5Etfw\">January 23, 2025</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p></p><h1>Peirce Criticises SEC’s Past, Asks for Patience</h1><p>Peirce offered a sharp critique of the <a href=\"https://www.coinlive.com/news/soon-to-be-ex-sec-chair-gary-gensler-trashes-crypto-on-his-way \" target=\"\">SEC’s past approach to crypto regulation under Gensler</a>, describing it as a decade-long road trip riddled with detours and unnecessary risks. </p><p></p><p>Now, under the Crypto Task Force, she envisions a more constructive and less adversarial regulatory path.</p><p></p><p>Peirce said:</p><blockquote>“On that last trip, the Commission refused to use regulatory tools at its disposal and incessantly slammed on the enforcement brakes as it lurched along a meandering route with a destination not discernible to anyone.”</blockquote><p><a href=\"https://www.coinlive.com/news/crypto-mom-hester-peirce-leads-u-s-sec-task-force-to \" target=\"\">Peirce</a> acknowledged the legal ambiguity and commercial impracticality that characterised the previous administration’s enforcement-driven strategy, emphasizing that unwinding its legacy will take time. </p><p></p><p>She noted:</p><blockquote>“Many cases remain in litigation, many rules remain in the proposal stage, and many market participants remain in limbo. Determining how best to disentangle all these strands, including ongoing litigation, will take time. It will involve work across the whole agency and cooperation with other regulators. Please be patient. The Task Force wants to get to a good place, but we need to do so in an orderly, practical, and legally defensible way.”</blockquote><p>While the <a href=\"https://www.coinlive.com/news/sec-under-gary-gensler-loses-legal-battle-over-crypto-regulation \" target=\"\">SEC</a> is shifting toward a new regulatory paradigm, its core mission—protecting investors—remains unchanged. </p><p></p><p>She continued:</p><blockquote>“One of the reasons the U.S. capital markets are so robust, efficient, and effective is that we have rules designed to protect investors and the integrity of the marketplace, and we enforce those rules. We do not tolerate liars, cheaters, and scammers. As the Task Force works to help develop this regulatory framework, it will give careful consideration to antifraud protections. If the Commission spots fraud that lies outside our jurisdiction, it can refer the matter to a sister regulator. If it does not fall within any regulator’s jurisdiction, the Commission can bring that gap to Congress’s attention.”</blockquote><div class=\"media-wrap embed-wrap\"><div><blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\">🚨NEW: While we were all tuned into the digital assets presser this afternoon, <a href=\"https://twitter.com/HesterPeirce?ref_src=twsrc%5Etfw\">@HesterPeirce</a> dropped a rather important update on the new <a href=\"https://twitter.com/SECGov?ref_src=twsrc%5Etfw\">@SECGov</a><a href=\"https://twitter.com/hashtag/crypto?src=hash&amp;ref_src=twsrc%5Etfw\">#crypto</a> task force and what it’s doing.<br/><br/>Here’s the TLDR in case you missed it:<br/><br/>📌The task force is examining the security status of…</p>— Eleanor Terrett (@EleanorTerrett) <a href=\"https://twitter.com/EleanorTerrett/status/1886911217047929065?ref_src=twsrc%5Etfw\">February 4, 2025</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p>She also noted the overwhelming volume of policy and paperwork requests now facing the Commission, highlighting the complexity of reshaping crypto oversight.</p><p></p><p>The Task Force’s priorities include reassessing which digital assets should be classified as securities or commodities, defining clear regulatory boundaries, and engaging with market participants interested in tokenising securities or integrating blockchain into traditional finance. </p><p></p><p>Additionally, the group is working to establish appropriate custody rules for investment advisers managing digital assets.</p><p></p><p>Despite its more open approach, Peirce made it clear that the SEC will not tolerate fraud or noncompliance. </p><p></p><p>While regulatory clarity should not be mistaken for an endorsement of any asset, the Commission will take a more hands-off stance where appropriate—leaving economic freedom in the hands of market participants. </p><p></p><p>However, <a href=\"https://www.coinlive.com/news/crypto-mom-hester-peirce-leads-u-s-sec-task-force-to \" target=\"\">Peirce</a> cautioned that this shift comes with inherent risks, particularly for uninformed investors. </p><p></p><p>The SEC may be changing, but companies operating in the space should not expect a free pass, as enforcement remains a critical pillar of its oversight.</p><p></p><p>She warned:</p><blockquote>“We’re not endorsing any tokens, coins, or products. There is no SEC stamp of approval. People can buy whatever they want, but they can’t expect us to bail them out when prices crash.”</blockquote><p></p><h1>Crypto Task Force Website Goes Live, Feedback Welcomed</h1><p><a href=\"https://www.sec.gov/about/crypto-task-force \" target=\"\">The SEC’s new platform is officially live</a>, offering a direct channel for public input as the agency works to resolve over a decade of regulatory ambiguity in crypto. </p><div class=\"media-wrap embed-wrap\"><div><blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\">The crypto Task Force webpage is live. Join us for the drive (toward crypto clarity): <a href=\"https://t.co/o2jzNUhJ5D\">https://t.co/o2jzNUhJ5D</a> and <a href=\"https://t.co/9AwTYkmOCw\">https://t.co/9AwTYkmOCw</a></p>— Hester Peirce (@HesterPeirce) <a href=\"https://twitter.com/HesterPeirce/status/1886864054477815861?ref_src=twsrc%5Etfw\">February 4, 2025</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p>Open to developers, investors, and industry stakeholders, the site allows users to request meetings or submit written feedback, with public comments posted online unless marked confidential.</p><p></p><p>However, this is not a whistleblower or complaint portal—such matters must be directed to the <a href=\"https://www.coinlive.com/news/sec-under-gary-gensler-loses-legal-battle-over-crypto-regulation \" target=\"\">SEC</a>’s Complaint Center via its official online form or by mail. </p><p></p><p>The platform provides clear guidelines on submitting information, including instructions for handling confidential data and redacting sensitive materials. </p><p></p><p>The new crypto-focused US SEC page detailed:</p><blockquote>“Material received will be posted without modification; the Commission does not edit personal identifying information from submissions. You should provide only written input that you wish to make available publicly.” </blockquote><p>Additionally, the Crypto Task Force has introduced a dedicated email—<a class=\"__cf_email__\" data-cfemail=\"7714050e0703183704121459101801\" href=\"/cdn-cgi/l/email-protection\">[email protected]</a>—for further engagement with the digital asset community.</p><p></p><p></p><p></p></div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/9e41515f64c0ce9d62b2658a15d53188.jpeg",
            "link": "https://www.coinlive.com/news/sec-s-new-crypto-task-force-aims-for-regulatory-reset-sets",
            "pub_date": "2025-02-05 10:16:23",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 212703,
            "title": "Trump Project Increases ETH Holdings NYSE Submits 19b-4 Application for Grayscale LTC ETF",
            "description": "<div class=\"share___SVvtl\"><div><h2>Headline</h2><p><strong>▌</strong><strong>Trump's Cryptocurrency Project Appears to Build Tens of Millions of Dollars of Ethereum After Price Plunge</strong></p><p>After U.S. President Donald Trump's announcement of additional tariffs on Mexico and Canada caused the cryptocurrency market to plummet over the weekend, World Liberty Financial, a decentralized financial project associated with the Trump family, appears to have accumulated tens of millions of dollars worth of Ethereum. Trump's third child, Eric Trump, posted on social media platform X on Monday, \"In my opinion, now is a good time to increase your holdings of Ethereum. You can thank me later.\" He later edited the post and deleted the second sentence.</p><p><strong><strong>▌</strong></strong><strong>NYSE has submitted a 19b-4 filing application for Grayscale's Litecoin ETF</strong></p><p>Litecoin's official Twitter account said that NYSE has now submitted a 19b-4 filing application for Grayscale's Litecoin ETF to the U.S. SEC to seek to convert its Litecoin (LTC) Trust into a spot ETF. </p><ol class=\"list-paddingleft-2\"></ol><hr/><h2>Market</h2><p>As of press time, according to Coingecko data:</p><p>BTC's latest transaction price is $98,037.73, with a daily increase or decrease of <span style=\"color: rgb(255, 0, 0);\"><strong>-3.5%</strong></span>;</p><p>ETH's latest transaction price is $2,731.81, with a daily increase or decrease of <span style=\"color: rgb(255, 0, 0);\"><strong>-5.3%</strong></span>;</p><p>BNB's latest transaction price is $573.62, with a daily increase or decrease of <span style=\"color: rgb(255, 0, 0);\"><strong>-7.3%</strong></span>；</p><p>SOL's latest transaction price is 207.04 US dollars, and its intraday increase or decrease is <span style=\"color: rgb(255, 0, 0);\"><strong>-4.8%</strong></span>；</p><p>DOGE's latest transaction price is 0.2642 US dollars, and its intraday increase or decrease is <span style=\"color: rgb(255, 0, 0);\"><strong>-7</strong><strong>.6%</strong></span><strong>；</strong></p><p>XPR's latest transaction price is 2.54 US dollars, and its intraday increase or decrease is <span style=\"color: rgb(255, 0, 0);\"><strong>-6</strong><strong>.8%</strong></span>。 </p><hr/><h2>Policy</h2><p><strong>▌</strong><strong>New York Times: US SEC takes steps to scale back its enforcement efforts in the cryptocurrency field</strong></p><p>According to the New York Times: The US Securities and Exchange Commission (SEC) has taken steps to scale back its enforcement efforts in the cryptocurrency field.</p><p><strong>▌US SEC Acting Chairman Appoints Former Coin Center Director to Join Cryptocurrency Working Group</strong></p><p>Landon Zinda has resigned from his position as policy director at cryptocurrency advocacy organization Coin Center to join the US Securities and Exchange Commission's (SEC) cryptocurrency working group.</p><p>In a notice on February 4, Acting SEC Chairman Mark Uyeda said that Zinda has joined the commission as his legal counsel and senior advisor to the cryptocurrency working group. The former Coin Center director will join the task force led by Commissioner Hester Peirce, working alongside Chief of Staff Richard Gabbert and Chief Policy Advisor Taylor Asher.</p><p><strong><strong><strong>▌</strong></strong></strong><strong>Crypto Czar David Sacks: The feasibility of Bitcoin reserves is being studied</strong></p><p>Crypto Czar David Sacks said that the feasibility of Bitcoin reserves is being studied.</p><p><strong>▌</strong><strong>Chairman of the U.S. House Financial Services Committee: Both Houses of Congress will set up cryptocurrency working groups</strong></p><p>French Hill, chairman of the U.S. House Financial Services Committee, said that both houses of Congress will set up cryptocurrency working groups. </p><ol class=\"list-paddingleft-2\"></ol><hr/><h2>Blockchain Applications</h2><p><strong>▌</strong><strong>Mempool Research: Bitcoin Block Size May Increase to 4 MB</strong></p><p>Block size has grown steadily since Bitcoin's Taproot upgrade, but there is still room for more growth, Mempool Research said.  </p><p>Widespread adoption of inscriptions could bring the average block size of the Bitcoin network to 4 megabytes (MB) per block, far higher than the current average, according to a report released by Mempool Research on Feb. 4. Bitcoin's average block size (the amount of data contained in each block published to the network's public ledger) is currently just over 1.5 MB, the report said.  </p><p>Mempool Research said Bitcoin's block size could increase significantly if inscriptions (a method of efficiently encoding arbitrary data within a block) are more widely adopted. </p><ol class=\"list-paddingleft-2\"></ol><hr/><h2>Cryptocurrency</h2><p><strong>▌</strong><strong>Satoshi-era Bitcoin miners move $5 million in BTC when price was just 10 cents</strong></p><p>A wallet containing 50 bitcoins, mined about 15 years ago, suddenly became active, moving about $5 million worth of tokens that were originally worth just $0.10 each.  </p><p>Bitcoin historian Pete Rizzo discovered and shared the wallet transaction using a screenshot of mempool.space. The movement of this wallet has since sparked discussion and concern in the crypto community. Some onlookers have speculated that it may be related to Ross Ulbricht, the recently pardoned founder of \"Silk Road\".  </p><p>However, it is highly speculative to attribute old Bitcoin movements to any specific individual who has not voluntarily disclosed his wallet address. </p><p><strong><strong>▌</strong></strong><strong>Arkham announced that it has supported monitoring of Satoshi Nakamoto's holdings</strong></p><p>Arkham announced that it has supported monitoring of Satoshi Nakamoto's holdings. Satoshi Nakamoto's address currently holds 1,096,354 bitcoins, worth approximately $108.88 billion.</p><p><strong><strong><strong>▌</strong></strong></strong><strong>David Sacks: Cannot make any answer to \"whether sovereign wealth funds hold encryption\"</strong></p><p>David Sacks answered the last question in the Q&amp;A session of the press conference, saying that studying the feasibility of Bitcoin reserves is one of the top priorities the president has instructed him to do, and will be studied as part of an internal government working group. \"Putting cryptocurrency in a sovereign wealth fund\" is another question that cannot be answered at this press conference.  </p><p>As previously reported, U.S. President Donald Trump signed an executive order on Monday instructing the Treasury and Commerce Departments to establish a sovereign wealth fund. Although crypto was not mentioned, Treasury Secretary Scott Bessant has expressed some interest in cryptocurrencies, while Commerce Secretary nominee Howard Lutnick is a staunch supporter of the crypto industry.</p><p><strong><strong><strong><strong>▌</strong></strong></strong></strong><strong>SkyBridge Capital Founder: US Lawmakers Will Propose Crypto Regulation by November</strong></p><p>Anthony Scaramucci, founder of SkyBridge Capital, said that lawmakers in Congress will take action to win support from the cryptocurrency industry before the 2026 midterm elections. In an interview published in the Financial Times on Feb. 4, Scaramucci said that US lawmakers in the House and Senate, who are facing primary challenges and fierce elections in swing districts, may want to show a record of \"proposing positive cryptocurrency legislation\" before 2026.</p><p>The former White House communications director hinted that Congress may engage in \"a series of legislative activities\" before the 2025 holiday recess, possibly including a cryptocurrency market structure bill.  </p><p>\"You might get it in November this year, before the recess,\" Scaramucci said, referring to cryptocurrency regulation. \"But if you don't, I don't think you'll be much later than the timeline I suggest.\"</p><hr/><h2>Important Economic Dynamics</h2><p><strong><strong>▌</strong></strong><strong>The probability of the Fed keeping interest rates unchanged in March is 84.5%</strong></p><p>According to CME's \"Fed Watch\": The probability of the Fed keeping interest rates unchanged in March is 84.5%, and the probability of a 25 basis point rate cut is 15.5%. The probability of maintaining the current interest rate unchanged by May is 61.6%, the probability of a cumulative 25 basis point rate cut is 34.2%, and the probability of a cumulative 50 basis point rate cut is 4.2%. </p><p><strong><strong><strong>▌</strong></strong></strong><strong>U.S. stocks closed: the three major stock indexes closed higher, and the Chinese stock index rose by more than 2%</strong></p><p>The U.S. stock market closed on Tuesday, and the three major stock indexes closed higher, with the Dow Jones Industrial Average up 0.3%, the S&amp;P 500 up 0.72%, and the Nasdaq up 1.35%. Most of the star technology stocks closed higher, with AMD (AMD.O) up 4.58%, TSMC (TSM.N), Apple (AAPL.O), and Tesla (TSLA.O) up more than 2%, and Amazon (AMZN.O) up nearly 2%. The Nasdaq China Golden Dragon Index rose 2.65%, Xpeng Motors (XPEV.N) rose 8.3%, Li Auto (LI.O) rose nearly 6%, Baidu (BIDU.O) rose 5.8%, and Alibaba (BABA.N) rose 3.8%. </p><ol class=\"list-paddingleft-2\"></ol><ol class=\"list-paddingleft-2\"></ol><ol class=\"list-paddingleft-2\"></ol><ol class=\"list-paddingleft-2\"></ol><ol class=\"list-paddingleft-2\"></ol><hr/><h2>Golden Encyclopedia</h2><p>▌<a href=\"https://www.jinse.cn/blockchain/3702852.html\"><strong>What is chain abstraction? </strong></a></p><p>Chain abstraction in blockchain works by providing a single interface that enables users and developers to interact with multiple blockchains without having to manage the complexity of each individual chain. Chain abstraction solutions are still under development, and many companies are working on solving the problem. At present, how this all works is not an exact science, but multi-chain solutions may allow users to seamlessly use Web3 from a single account. </p><p><strong>Disclaimer: As a blockchain information platform, the content of the articles published by Jinse Finance is for information reference only and is not intended as actual investment advice. Please establish the correct investment concept and be sure to enhance risk awareness. </strong></p></div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/d13af8a04710040fcf12982c2091c281.jpg",
            "link": "https://www.coinlive.com/news/trump-project-increases-eth-holdings-nyse-submits-19b-4-application-for",
            "pub_date": "2025-02-05 08:12:18",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 212689,
            "title": "Bybit CEO Ben Zhou Predicts Crypto Liquidations Could Be 5 Times Worse Than the Reported $2 Billion",
            "description": "<div class=\"share___SVvtl\"><div><h2>Crypto Liquidations May Be Far Higher Than Reported, Warns Bybit CEO  </h2><p>Crypto market liquidations have reached alarming levels, with Bybit’s CEO Ben Zhou warning that the true figure could be as high as $10 billion, a staggering increase from the $2 billion widely reported.  </p><p></p><p>Zhou’s comments came in response to the fallout from US tariffs on Canada and Mexico, which contributed to a sharp downturn in the crypto market.  </p><p></p><p>This marks one of the most significant liquidations in crypto history, surpassing even previous major events like the COVID-19 crash and the FTX collapse.  </p><p></p><h2>Zhou Estimates Losses Much Greater Than Official Figures  </h2><p>While official reports indicated $2 billion in liquidations, Zhou firmly disagreed, stating, </p><p></p><blockquote>“I am afraid that today real total liquidation is a lot more than $2B, by my estimation it should be at least around $8-10b.”  </blockquote><p></p><p>Bybit alone accounted for over $2.1 billion of that amount, he revealed.  </p><p></p><p>Zhou also pointed out a crucial issue with liquidation data reporting.</p><p></p><p>Exchanges like Bybit restrict how much data is shared with aggregation platforms like CoinGlass.  </p><p></p><p>Due to these limitations, only a fraction of the real data makes it into public records. </p><p></p><div class=\"media-wrap embed-wrap\"><div><blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\">I am afraid that today real total liquidation is a lot more than $2B, by my estimation it should be at least around $8-10b. FYI, Bybit 24hr liquidation alone was $2.1B, As you can see in below screenshot, Bybit 24hr liquidations recorded on Coinglass was around $333m, however,… <a href=\"https://t.co/4WLkPxTYF4\">https://t.co/4WLkPxTYF4</a><a href=\"https://t.co/woTOHQvNkt\">pic.twitter.com/woTOHQvNkt</a></p>— Ben Zhou (@benbybit) <a href=\"https://twitter.com/benbybit/status/1886393172152156604?ref_src=twsrc%5Etfw\">February 3, 2025</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p></p><h2>API Limitations Cause Discrepancies in Liquidation Data  </h2><p>Zhou elaborated on how platforms like Bybit limit the amount of liquidation data sent out through APIs, preventing aggregators from reporting the full picture.  </p><p></p><p>He explained that, due to API restrictions, CoinGlass recorded only about $333 million of Bybit’s total $2.1 billion in liquidations.</p><p></p><p>The discrepancy, according to Zhou, suggests that the real losses “should be at least 4-6 times” of the reported numbers.</p><p></p><div class=\"media-wrap embed-wrap\"><div><blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\">need to dig out this data, but should be at least 4-6 times of what was reported basically.</p>— Ben Zhou (@benbybit) <a href=\"https://twitter.com/benbybit/status/1886394236628844864?ref_src=twsrc%5Etfw\">February 3, 2025</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p></p><p>This situation mirrors the aftermath of the 2022 FTX collapse, where the reported liquidation figures were vastly lower than the actual losses.  </p><p></p><p>Zhou noted that the market’s response to current events may similarly be underestimating the full scope of the crisis.</p><p></p><h2>Tariffs and AI Impacts Amplify Crypto Crisis  </h2><p>While the liquidation event itself was significant, Zhou attributed the downturn to a combination of factors, including DeepSeek, a Chinese AI project that negatively affected US tech stocks, and the tariffs imposed by President Trump on Canada and Mexico.  </p><p></p><p>These combined forces resulted in a serious blow to the already fragile crypto market, triggering widespread liquidations across several major cryptocurrencies.  </p><p></p><h2>Bybit Pledges Increased Transparency Moving Forward  </h2><p>Moving forward, Zhou emphasised Bybit’s commitment to increasing transparency.  </p><p></p><p>He announced that Bybit would begin sharing more accurate, real-time liquidation data to the public.  </p><p></p><p>To reinforce the importance of a clearer picture of the market’s health, especially during such volatile times, Zhou stated, </p><p></p><blockquote>“We believe in transparency.”</blockquote><p></p><h2>Crypto Market Faces Potential Deeper Crisis  </h2><p>If Zhou’s estimation is accurate, the total liquidation figure could be far higher than what has been publicly acknowledged.  </p><p></p><p>As other major platforms like FTX have shown, reported data can vastly understate the severity of liquidation events.  </p><p></p><p>With Bitcoin, Solana, and Ethereum all experiencing steep drops, the crypto market is facing a potential deeper crisis.</p><p></p><div class=\"media-wrap embed-wrap\"><div><blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\">🚨MARKET UPDATE🩸<br/><br/>$2B liquidated in 24H, even surpassing the FTX collapse &amp; COVID crash <a href=\"https://t.co/AVGdPMzNXt\">pic.twitter.com/AVGdPMzNXt</a></p>— Solana Daily (@solana_daily) <a href=\"https://twitter.com/solana_daily/status/1886313235273396284?ref_src=twsrc%5Etfw\">February 3, 2025</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p></p><p>However, many investors still view these market fluctuations as a buying opportunity, given crypto’s long-term growth potential.  </p><p></p><p>As the crypto space grapples with a turbulent market, the need for more transparent and accurate data has never been more pressing.</p></div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/223e6b6900fb6fc5bbf770b5c8a2d31b.jpeg",
            "link": "https://www.coinlive.com/news/bybit-ceo-ben-zhou-predicts-crypto-liquidations-could-be-5",
            "pub_date": "2025-02-04 18:33:36",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 212688,
            "title": "Trump Officially Gives Tech Billionaire, Elon Musk, The Title of 'Special Government Employee'",
            "description": "<div class=\"share___SVvtl\"><div><p>Elon Musk is officially serving under President Trump as a special government employee, according to a White House official.</p><p></p><p>This designation means that Musk-the billionaire tech entrepreneur who has been a force within the new Trump administration-is not working as a volunteer but also not a full-time federal employee.</p><p></p><p>This was confirmed by White House press secretary Karoline Leavitt during an interview with CNN on yesterday.</p><p></p><div class=\"media-wrap embed-wrap\"><div><blockquote class=\"twitter-tweet\" data-media-max-width=\"560\"><p dir=\"ltr\" lang=\"en\">Worldcoin is a scam. <a href=\"https://twitter.com/hashtag/Bitcoin?src=hash&amp;ref_src=twsrc%5Etfw\">#Bitcoin</a> only <a href=\"https://t.co/JKFghpn1gE\">pic.twitter.com/JKFghpn1gE</a></p>— Bitcoin Magazine (@BitcoinMagazine) <a href=\"https://twitter.com/BitcoinMagazine/status/1687503127879032832?ref_src=twsrc%5Etfw\">August 4, 2023</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p></p><p>According to the Justice Department website, a \"special government employee\" is anyone who works, or is expected to work for the government for 130 days or less in a 365-day period. </p><p></p><p>The website also states that while a \"special government employee\" is subjected to most rules, but those rules are sometimes implemented on them on a less restrictive way.</p><p></p><p>This title was given to Musk after he took over DOGE, also known as the Department of Government Efficiency, which is looking to significantly slash public spending. </p><p></p><p>In a X post, Musk wrote that he would rather prefer the title of a IT consultant, who helps the government to solve IT infrastructure in order to make the government work.</p></div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/a8d97254a184b2f89f28a4a92b7282d5.png",
            "link": "https://www.coinlive.com/news/trump-officially-gives-tech-billionaire-elon-musk-the-title-of",
            "pub_date": "2025-02-04 18:30:25",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 212686,
            "title": "DeepSeek's Popularity: How AI Makes DeFi Mainstream",
            "description": "<div class=\"share___SVvtl\"><div><p>Author: danielesesta; Source: Coinspire</p><p style=\"text-align: left;\"><strong>Editor's Note:</strong> With the rapid development of AI technology, it is no longer a problem for everyone to believe that Web3 can benefit from AI. The real focus is: which Web3 track can seize the dividends of AI the fastest, and how to maximize the use of AI to achieve breakthroughs - decentralized finance (DeFi) is undoubtedly one of the most promising areas, and the intersection of the two - <strong>DeFAI (DeFi+AI), is becoming one of the fastest growing tracks in the crypto economy. </strong></p><p style=\"text-align: left;\">The essence of DeFAI is to make AI the \"autopilot\" of the on-chain world. The complexity of DeFi has always been the entry barrier for ordinary users, and DeFAI is expected to simplify the user experience through AI and attract more mainstream users: they can <strong>parse on-chain data in real time, and can also help you complete complex strategies such as cross-chain arbitrage, dynamic staking, and flash loan combinations</strong>, and even participate in protocol upgrades through DAO governance. Just like search engines allow ordinary people to surf the Internet without understanding the TCP protocol, DeFAI will allow every novice user to have hedge fund-level asset management capabilities.</p><p style=\"text-align: left;\">Currently, some DeFAI projects have emerged. The author of this article, Daniele, is the founder of DeFAI's head project Hey Anon ($ANON). As a well-known DeFi developer, he has led the development of algorithmic stablecoin Wonderland, decentralized lending AbracadabraMoney, and DEX WAGMI. Today, Hey Anon, the company he founded, focuses on AI-driven DeFi automation tools. Its TypeScript-based solutions are designed to be integrated into DeFi protocols, enabling agents to manage on-chain interactions with unprecedented security and simplicity. Its market value ranks third in the CoinmarketCap DeFAI sector. </p><p style=\"text-align: left;\">Daniele was inspired by DeepseekR1's breakthrough in open source AI reasoning and explored in depth how DeFi can benefit from AI technology. I believe everyone will be able to gain some new insights from his insights. </p><p style=\"text-align: left;\">The following is the main text: </p><p style=\"text-align: left;\">Artificial intelligence is accelerating. Large language models (LLMs) are empowering everything from conversational assistants to DeFi multi-step transaction automation. However, the cost and complexity of deploying these models at scale remain major obstacles. The result is a new open source AI model, Deepseek R1, that delivers powerful inference capabilities at a lower cost—paving the way for millions of new users and application scenarios. </p><blockquote style=\"text-align: left;\"><strong>This article will explore:</strong></blockquote><p style=\"text-align: left;\"><strong>▶ Deepseek R1’s breakthrough in open source AI inference</strong></p><p style=\"text-align: left;\"><strong>▶ How low-cost inference and flexible licensing drive widespread adoption</strong></p><p style=\"text-align: left;\"><strong>▶ Why Jevons’ paradox suggests that efficiency gains may drive up usage (and costs)—but are still a net positive for AI developers</strong></p><p style=\"text-align: left;\"><strong>▶ How DeFAI benefits from the proliferation of AI in financial applications</strong></p><h2 style=\"text-align: left;\">Deepseek R1: Redefining open source AI</h2><p style=\"text-align: left;\">Deepseek R1 is a new type of open source AI trained on extensive text LLM is optimized for reasoning and contextual understanding. Its outstanding features include: </p><p style=\"text-align: left;\"><strong>• Efficient Architecture</strong>: Adopting a new generation of parameter structures, it can achieve near-top performance in complex reasoning tasks without the need for large GPU clusters. </p><p style=\"text-align: left;\"><strong>• Low Hardware Requirements</strong>: Designed to run on a small number of GPUs or even high-end CPU clusters, it lowers the barrier to entry for startups, independent developers, and the open source community. </p><p style=\"text-align: left;\"><strong>• Open Source License</strong>: Unlike most proprietary models, its permissive license allows companies to integrate directly into products—driving rapid adoption, plugin development, and professional fine-tuning. </p><p style=\"text-align: left;\">This trend of democratizing AI is reminiscent of the early days of open source projects such as Linux, Apache, and MySQL—which ultimately drove the exponential growth of the technology ecosystem. </p><h2 style=\"text-align: left;\">Value Proposition of Low-Cost AI</h2><ul class=\"list-paddingleft-2\"><li><p style=\"text-align: left;\"><strong>Accelerate Adoption</strong></p></li></ul><p style=\"text-align: left;\"><strong>• SMEs</strong>: Deploy AI solutions without relying on expensive proprietary services. </p><p style=\"text-align: left;\"><strong>• Developers</strong>: Free to experiment—from chatbots to automated research assistants, innovate and iterate on a budget. </p><p style=\"text-align: left;\"><strong>• Geographic Diversification</strong>: Emerging market companies can seamlessly access AI solutions to bridge the digital divide in industries such as finance, healthcare, and education. </p><ul class=\"list-paddingleft-2\"><li><p style=\"text-align: left;\"><strong>Democratization of Reasoning</strong></p></li></ul><p style=\"text-align: left;\">Low-cost reasoning not only drives adoption, but also democratizes reasoning:</p><p style=\"text-align: left;\"><strong>• Localized models</strong>: Small communities can train Deepseek R1 with language-specific or domain-specific corpora (e.g., professional medical/legal data).</p><p style=\"text-align: left;\"><strong>• Modular extensibility</strong>: Developers and independent researchers can build advanced plugins (e.g., code analysis, supply chain optimization, on-chain transaction verification) to break through licensing bottlenecks.</p><p style=\"text-align: left;\">Overall, cost savings enable more experiments, accelerating overall innovation in the AI ​​ecosystem. </p><h2 style=\"text-align: left;\">Jevons Paradox: Why Efficiency Improvement Drives Up Consumption</h2><ul class=\"list-paddingleft-2\"><li><p style=\"text-align: left;\"><strong>What is the Jevons Paradox?</strong></p></li></ul><p style=\"text-align: left;\">This theory states that efficiency improvements often lead to increased rather than reduced resource consumption. Initially discovered in the context of coal use, it means that when a process becomes more economical, people tend to expand its scale of use, offsetting (and sometimes exceeding) efficiency gains.</p><p style=\"text-align: left;\">In the context of Deepseek R1:</p><p style=\"text-align: left;\"><strong>• Low-cost model</strong>: Reduce hardware requirements, making AI more economical to run.</p><p style=\"text-align: left;\"><strong>• Result</strong>: More companies, researchers, and enthusiasts launch AI instances. </p><p style=\"text-align: left;\"><strong>• Effect</strong>: Although the cost of operating a single instance has decreased, the surge in total volume may push up overall computing power consumption (and costs). </p><ul class=\"list-paddingleft-2\"><li><p style=\"text-align: left;\"><strong>Is this a negative? </strong></p></li></ul><p style=\"text-align: left;\">Not necessarily. The widespread use of models such as Deepseek R1 signals a surge in successful adoption and applications, which will drive: </p><p style=\"text-align: left;\"><strong>• Ecosystem prosperity</strong>: More developers improve open source code functions, fix vulnerabilities, and optimize performance. </p><p style=\"text-align: left;\"><strong>• Hardware innovation</strong>: GPU, CPU, and dedicated AI chip manufacturers respond to surging demand and compete on price and energy efficiency. </p><p style=\"text-align: left;\"><strong>• Business Opportunities</strong>: Builders of analytical tools, process orchestration, specialized data pre-processing, and more will benefit from the surge in AI adoption.</p><p style=\"text-align: left;\">Thus, while the Jevons Paradox suggests that infrastructure costs may rise, it is a positive signal for the AI ​​industry as a whole—promoting an innovative environment that can lead to economic deployment breakthroughs (such as advanced compression techniques or task offloading to specialized chips).</p><h2 style=\"text-align: left;\">Impact on DeFAI</h2><ul class=\"list-paddingleft-2\"><li><p style=\"text-align: left;\"><strong>DeFAI: When AI Meets DeFi</strong></p></li></ul><p style=\"text-align: left;\">DeFAI combines decentralized finance with AI automation, enabling agents to manage on-chain assets, perform multi-step transactions, and interact with DeFi protocols. This emerging space directly benefits from open-source, low-cost AI because:</p><p style=\"text-align: left;\"><strong>• 24/7 autonomy</strong></p><p style=\"text-align: left;\">Agents can continuously scan DeFi markets, bridge assets between chains, and adjust positions. Low inference costs make 24/7 operations financially viable.</p><p style=\"text-align: left;\"><strong>• Infinitely scalable</strong></p><p style=\"text-align: left;\">When thousands of DeFAI agents need to serve different users or protocols simultaneously, low-cost models such as Deepseek R1 can control operating expenses.</p><p style=\"text-align: left;\"><strong>• Customization</strong></p><p style=\"text-align: left;\">Developers can fine-tune open-source AI with DeFi-specific data (price feeds, on-chain analytics, governance forums) without paying high licensing fees. </p><ul class=\"list-paddingleft-2\"><li><p style=\"text-align: left;\"><strong>More AI agents, stronger financial automation</strong></p></li></ul><p style=\"text-align: left;\">With Deepseek R1 lowering the AI ​​threshold, DeFAI forms a positive cycle:</p><p style=\"text-align: left;\"><strong>• Agent explosion</strong>: Developers create professional robots (such as yield hunting, liquidity provision, NFT trading, cross-chain arbitrage)</p><p style=\"text-align: left;\"><strong>• Efficiency improvement</strong>: Each agent optimizes the flow of funds, which may increase the overall activity and liquidity of DeFi</p><p style=\"text-align: left;\"><strong>• Industry growth</strong>: More complex DeFi products emerge, from advanced derivatives to conditional payments, all coordinated by easily accessible AI</p><p style=\"text-align: left;\">The final result --- the entire The DeFAI field benefits from the virtuous cycle of <strong>\"user growth - agent evolution\"</strong>. </p><h2 style=\"text-align: left;\">Outlook: Positive signals for AI developers</h2><ul class=\"list-paddingleft-2\"><li><p style=\"text-align: left;\"><strong>A thriving open source community</strong></p></li></ul><p style=\"text-align: left;\">After Deepseek R1 is open sourced, the community can:</p><p style=\"text-align: left;\">• Quickly fix vulnerabilities</p><p style=\"text-align: left;\">• Propose inference optimization solutions</p><p style=\"text-align: left;\">• Create field forks (such as finance, law, and healthcare)</p><p style=\"text-align: left;\">Collaborative development brings continuous model improvements and gives birth to ecological tools (fine-tuning frameworks, model service infrastructure, etc.)</p><ul class=\"list-paddingleft-2\"><li><p style=\"text-align: left;\"><strong>New profit paths</strong></p></li></ul><p style=\"text-align: left;\">AI developers in areas such as DeFAI can break through the traditional API call charging model:</p><p style=\"text-align: left;\"><strong>• Hosted AI instances</strong>: Provide enterprise-level Deepseek R1 hosting services with a friendly dashboard</p><p style=\"text-align: left;\"><strong>• Service layer construction</strong>: Based on the open source model, integrate advanced functions such as compliance review and real-time intelligence for DeFi operators</p><p style=\"text-align: left;\"><strong>• Agent marketplace</strong>: Host agent profiles with unique strategies or risk configurations, and provide subscription or performance sharing services</p><p style=\"text-align: left;\">When the underlying AI technology can scale to millions of concurrent users without bankrupting the supplier, this business model will flourish</p><ul class=\"list-paddingleft-2\"><li><p style=\"text-align: left;\"><strong>Low barriers = expanded talent pool</strong></p></li></ul><p style=\"text-align: left;\">With the reduced demand for Deepseek R1, more developers around the world can participate in AI experiments. This influx of talent:</p><p style=\"text-align: left;\">• Inspires innovative solutions to real-world and cryptographic problems;</p><p style=\"text-align: left;\">• Enriches the open source community with fresh ideas and improvements;</p><p style=\"text-align: left;\">• Releases global talent that was once shut out by high computing costs.</p><h2 style=\"text-align: left;\">Conclusion</h2><p style=\"text-align: left;\">The emergence of Deepseek R1 marks a key turning point: open source AI no longer requires expensive computing power or licensing fees. By providing powerful reasoning capabilities at low cost, it paves the way for widespread adoption from small development teams to large enterprises. While the Jevons Paradox suggests that infrastructure costs may rise due to surging demand, this phenomenon is ultimately good for the AI ​​ecosystem—driving hardware innovation, community contributions, and advanced application development. </p><p style=\"text-align: left;\">For DeFAI, AI agents coordinating financial operations on decentralized networks will have a significant ripple effect. Lower costs mean more complex agents, greater accessibility, and an expanding array of on-chain strategies. From yield aggregators to risk management, these advanced AI solutions can operate sustainably, opening up new paths for crypto adoption and innovation. </p><p style=\"text-align: left;\">Deepseek R1 demonstrates how open source advances can catalyze entire industries—both AI and DeFi. We stand on the threshold of a future where AI is no longer a tool for the privileged few, but will become a foundational element of everyday finance, creativity, and global decision-making—driven by open models, economical infrastructure, and unstoppable community momentum. </p></div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/97e74f9ed3eaec9535c8c18bd35a425d.jpg",
            "link": "https://www.coinlive.com/news/deepseek-s-popularity-how-ai-makes-defi-mainstream",
            "pub_date": "2025-02-04 18:10:10",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 212685,
            "title": "South Korea’s Crypto Exodus: The Outflow of Capital, Enterprises, and Talent",
            "description": "<div class=\"share___SVvtl\"><div><span style=\"font-size: 18px;\">Author: Jay Jo, Yoon Lee, Tiger Research; Translator: Luffy, Foresight News</span><h2 style=\"text-align: left;\"><strong>Key Points</strong></h2><p style=\"text-align: left;\"><strong>·  </strong>South Korea’s high cryptocurrency trading volume has attracted global attention, but unclear regulations and a lack of guidelines have hampered the industry’s development.</p><p style=\"text-align: left;\"><strong>·  </strong>The government prohibits the opening of real-name accounts for cryptocurrency trading for businesses. This restriction, coupled with an ambiguous regulatory framework, has led to an outflow of talent, capital, and businesses, weakening the competitiveness of the Web3 ecosystem.</p><p style=\"text-align: left;\"><strong>·  </strong>As the global Web3 industry is expected to develop rapidly under the Trump administration, South Korea must reform its regulatory policies to ensure the long-term sustainability of the industry. </p><h2 style=\"text-align: left;\">1. Introduction</h2><p style=\"text-align: left;\">The inauguration of \"crypto-friendly president\" Trump and the establishment of the Crypto 2.0 TF of the U.S. Securities and Exchange Commission (SEC) will accelerate the structural changes in the global Web3 market. This is a critical turning point. Talent, capital, and enterprises may migrate to countries with sound regulatory frameworks, while the outflow from countries with regulatory uncertainty will intensify. </p><p style=\"text-align:center\"><img alt=\"\" data-href=\"\" src=\"https://image.blockbeats.cn/file_v6/20250126/963c5cd9-e47e-46f0-a8cd-acda3864a9f8.png?x-oss-process=image/quality,q_50/format,webp\"/></p><blockquote style=\"text-align: center;\"><span style=\"font-size: 14px;\">2024 Capital Inflow/Outflow by Country, Data Source: Henry &amp; Partners</span></blockquote><p style=\"text-align: left;\">South Korea is also in this trend. Henry &amp; Partners' \"2024 Private Wealth Migration Report\" shows that South Korea ranks first in Asia's high-net-worth immigration. Economic, social and cultural factors have driven this immigration wave. Although not directly associated with the Web3 industry, these groups of people often act like canaries in a coal mine, foreshadowing changes in a country's business environment. </p><p style=\"text-align: left;\">Against this backdrop, it is crucial to revisit South Korea's Web3 industry. This report explores the flow of capital, companies, and talent in South Korea's Web3 market, as well as the key challenges the industry must address. </p><h2 style=\"text-align: left;\">2. Capital Outflow: Offshore Exchanges and Accelerated On-Chain Transfers</h2><p style=\"text-align: left;\">South Korea's cryptocurrency market has grown rapidly. There are 15.6 million cryptocurrency investors holding $73 billion in assets. The average daily trading volume of cryptocurrency exchanges is now comparable to the combined trading volume of the Korea Composite Stock Price Index (KOSPI) and the Korea Stock Exchange (KOSDAQ). This reflects the enthusiasm of South Korean investors for crypto assets, driven by low stock market returns and political instability associated with martial law. </p><p style=\"text-align:center\"><img alt=\"\" data-href=\"\" src=\"https://image.blockbeats.cn/file_v6/20250126/90b9808a-3ea8-410b-8cdc-f2a269a8b8c9.png?x-oss-process=image/quality,q_50/format,webp\"/></p><p style=\"text-align: left;\">However, the outflow of crypto assets has reached a worrying level recently. During the martial law, service disruptions at major local exchanges undermined people's trust in the stability of these platforms. At the same time, diversified investment opportunities offered by foreign exchanges and decentralized finance (DeFi) further promoted capital migration.</p><p style=\"text-align: left;\">The Financial Services Commission of South Korea's Virtual Asset Service Provider (VASP) Survey in the first half of 2024 showed that fund transfers to out-of-town VASP wallets increased 2.3 times year-on-year. On-chain data confirms this trend, indicating that the migration of assets from local exchanges to foreign platforms continues to increase. </p><p style=\"text-align: left;\">In the long run, capital migration may harm South Korea's Web3 industry. Transaction fees and service revenue flow abroad, weakening the competitiveness of the local ecosystem and reducing investor protection. This also raises concerns about the decline in demand for the won and the increase in volatility of its value. </p><h2 style=\"text-align: left;\">3. Migration Wave: Moving Headquarters to Crypto-Friendly Countries</h2><p style=\"text-align: left;\">South Korea's Web3 companies are accelerating offshore migration. In 2024, Nexon's blockchain unit Nexpace and Klaytn and Line Finschia's Kaia Foundation moved to Abu Dhabi. WeMade's Wemix moved to Dubai. The Web3 industry is rapidly moving to countries with clearer and more favorable regulations. </p><p style=\"text-align: left;\">South Korea faces many obstacles in promoting Web3-related businesses. Companies are unable to open corporate accounts for cryptocurrency transactions, making it difficult to use crypto assets. This brings complexity to the monetization of crypto assets and creates problems in accounting, taxation, and business operations. For example, in the cryptocurrency payment business, Company A may receive crypto assets from consumers and need to settle payments with sellers in Korean won. Without a corporate account, monetizing assets is almost impossible. </p><p style=\"text-align: left;\">Although South Korea has established a regulatory framework, the lack of specific guidelines for stablecoins, DeFi, and Web3 games has limited industry growth. The country's proactive regulatory approach restricts businesses that are not explicitly licensed. In contrast, the global market has benefited from regulatory sandboxes that support various demonstration projects. </p><p style=\"text-align: left;\">The Trump administration's stance on cryptocurrencies may highlight this difference, with a favorable regulatory environment overseas accelerating the migration of Web3 companies from South Korea. </p><h2 style=\"text-align: left;\">4. Brain drain: weakening the technological competitiveness of the Web3 industry</h2><p style=\"text-align: left;\">The relocation of South Korean Web3 companies abroad may have a negative impact on the domestic Web3 talent pool. As companies move to countries with clearer and more favorable regulations, domestic job opportunities may decrease, leading to a brain drain. This may hinder the development of the domestic Web3 ecosystem.</p><p style=\"text-align: left;\">The migration of talent is not just a problem for the Web3 industry in South Korea. South Korea has one of the highest rates of migration of key talent to the United States, especially those with master's and doctoral degrees. This trend is particularly evident in the technology-dependent Web3 industry and may harm the competitiveness of the industry.</p><p style=\"text-align: left;\">In contrast, countries such as the United States and the United Arab Emirates promote the development of their Web3 industries through clear regulations and supportive policies. South Korea's unclear regulatory environment has accelerated the brain drain, which poses a long-term threat to South Korea's technological competitiveness and industrial ecosystem. </p><h2 style=\"text-align: left;\">5. Challenges and Opportunities of the Korean Web3 Market in 2025: Regulatory Reform and Industry Growth</h2><p style=\"text-align: left;\">South Korea has received global attention for its cryptocurrency trading volume. However, this trading volume has not promoted industry development and made the country a liquidity channel for global traders. This structure is not conducive to sustainable growth. South Korea urgently needs to make progress in business and technology to strengthen the Web3 ecosystem. </p><p style=\"text-align:center\"><img alt=\"\" data-href=\"\" src=\"https://image.blockbeats.cn/file_v6/20250126/d727ff35-0d3b-4c60-9f04-de6986b767fa.png?x-oss-process=image/quality,q_50/format,webp\"/></p><blockquote style=\"text-align: center;\"><span style=\"font-size: 14px;\">Source: Arthur Hayes</span></blockquote><p style=\"text-align: left;\">South Korea has been marginalized in the global Web3 development due to insufficient local innovation and regulatory uncertainty. This over-reliance on transaction volume rather than ecosystem building has led to a \"Korea discount\" in the international market.</p><p style=\"text-align: left;\">In 2025, with the new government taking office, major changes are expected to occur in the global industry. South Korea is at a critical crossroads amid these changes. Positive moves include allowing cryptocurrency operators to open corporate accounts, developing stablecoin regulations, and advancing cryptocurrency legislation. However, these efforts are only scratching the surface. </p><p style=\"text-align: left;\">To make progress, South Korea must address risks, analyze global policy shifts, and develop a regulatory framework tailored to domestic circumstances. South Korea must shift from a singular focus on transaction volume to building a sustainable innovation hub characterized by outstanding business and technological leadership. </p></div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/109648c57e8e43522edd1723b1232853.jpg",
            "link": "https://www.coinlive.com/news/south-korea-s-crypto-exodus-the-outflow-of-capital-enterprises-and",
            "pub_date": "2025-02-04 18:14:29",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 212684,
            "title": "Argentina Police Arrest Scammers Who were Conducting Iris Scans At A Carpark In exchange For Cryptocurrencies And Cash",
            "description": "<div class=\"share___SVvtl\"><div><p>Authorities in Argentina have arrested five individuals for conducting illegal Iris scans on victims, promising cryptocurrency and cash in return.</p><p></p><p>According to local news outlets, what the criminals were doing greatly resembles the practices of the widely known Worldcoin(WLD) project.</p><p></p><h1>$600,000 in Cash Seized</h1><p>The police arrested the suspects at a parking lot near a local shopping mall, after receiving an anonymous tip from a mall's security personnel who exposed the suspect's whereabouts.</p><p></p><div class=\"media-wrap image-wrap\"><img src=\"https://image.coinlive.com/cryptotwits-static/6368988398de7fc17a832251bcf79568.png\"/></div><p></p><p>Four men and a woman, who were believed to be the main culprits behind the scam, were arrested at the scene. </p><p></p><p>Police officers also confiscated 29 cell phones, a Volkswagen car, and over $600,00 worth of cash from the suspect's vehicle. </p><p> </p><div class=\"media-wrap image-wrap\"><img src=\"https://image.coinlive.com/cryptotwits-static/7da04f413f3ca3b52f2a37ad65091282.png\"/></div><p></p><p>Police believe that the suspects were mimicking the practices of WorldCoin to conduct their scam, but all evidence is showing that there is no link between the suspects and WorldCoin.</p><p></p><p>They also believe that the suspect was harvesting data to use for identity theft. The suspects took advantage of the recent coverage of Worldcoin on local media agencies to gain the trust of residents.</p><p></p><div class=\"media-wrap embed-wrap\"><div><blockquote class=\"twitter-tweet\" data-media-max-width=\"560\"><p dir=\"ltr\" lang=\"en\">Worldcoin is a scam. <a href=\"https://twitter.com/hashtag/Bitcoin?src=hash&amp;ref_src=twsrc%5Etfw\">#Bitcoin</a> only <a href=\"https://t.co/JKFghpn1gE\">pic.twitter.com/JKFghpn1gE</a></p>— Bitcoin Magazine (@BitcoinMagazine) <a href=\"https://twitter.com/BitcoinMagazine/status/1687503127879032832?ref_src=twsrc%5Etfw\">August 4, 2023</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p></p><p>The police said they have handed the case over to the Santa Fe prosecutors to investigate the the scope of the suspects' activities. Santa Fe prosecutors also want to establish \"whether any victims\" had swapped their biometric data for coins. </p></div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/10cbe10f632cc5f4b95f4828b904e6eb.png",
            "link": "https://www.coinlive.com/news/argentina-police-arrest-scammers-who-were-conducting-iris-scans-at",
            "pub_date": "2025-02-04 18:05:33",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 212682,
            "title": "MicroStrategy Stops Buying Bitcoin After 12 Weeks of Aggressive Acquisitions – What’s Behind the Sudden Shift in Strategy?",
            "description": "<div class=\"share___SVvtl\"><div><h2>MicroStrategy Halts Bitcoin Purchases After 12-Week Streak  </h2><p>MicroStrategy, a major player in the business intelligence sector, has paused its Bitcoin buying strategy after 12 consecutive weeks of acquisitions.</p><p></p><p>The company, which holds 471,107 BTC valued in the billions, has not added to its Bitcoin stash in recent days.</p><p></p><div class=\"media-wrap image-wrap\"><img src=\"https://image.coinlive.com/cryptotwits-static/90294f8f086b48277f67513f10f6b23d.png\"/></div><p style=\"text-align:center;\"><em><span style=\"color:#999999\">Source: <a href=\"https://bitcointreasuries.net/entities/microstrategy\" target=\"\">Bitcoin Treasuries</a></span></em></p><p></p><p>This unexpected halt has raised questions about the company's future plans and the reasons behind the shift in its approach.</p><p></p><h2>Market Volatility Behind The Decision  </h2><p>Michael Saylor, the company’s CEO, confirmed that the firm had not sold shares of its Class A common stock or used proceeds from it to purchase more Bitcoin.  </p><p></p><p>The market volatility, marked by fluctuating Bitcoin prices, has prompted caution within the company.  </p><p></p><p>Recent drops, including a sharp decline from $106,400 to $91,530, have likely made MicroStrategy reassess its approach.</p><p></p><p>As the cryptocurrency market faces unpredictability, the firm may be opting for a more measured strategy to protect its large Bitcoin holdings.  </p><p></p><h2>Regulatory and Tax Concerns Come Into Play  </h2><p>The decision to pause Bitcoin acquisitions also points to potential tax implications.  </p><p></p><p>MicroStrategy may be facing significant tax liabilities due to its substantial unrealised profits from Bitcoin.  </p><p></p><div class=\"media-wrap embed-wrap\"><div><blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\">JUST IN: 🇺🇸 MicroStrategy may have to pay federal income taxes on its unrealised <a href=\"https://twitter.com/hashtag/Bitcoin?src=hash&amp;ref_src=twsrc%5Etfw\">#Bitcoin</a> gains of $18 billion - WSJ <a href=\"https://t.co/BS6ywDYaBE\">pic.twitter.com/BS6ywDYaBE</a></p>— Bitcoin Magazine (@BitcoinMagazine) <a href=\"https://twitter.com/BitcoinMagazine/status/1882782972472131627?ref_src=twsrc%5Etfw\">January 24, 2025</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p></p><p>With Bitcoin’s price swings, the company’s assets could lead to a large tax burden if not managed properly.  </p><p></p><p>This has likely added complexity to the firm’s strategy, as it now has to navigate the delicate balance between holding assets that have appreciated in value and addressing potential tax obligations.  </p><p></p><h2>US Tariffs and Broader Economic Factors  </h2><p>The recent increase in US tariffs on China, Mexico, and Canada has further intensified the economic uncertainty surrounding the move.</p><p></p><div class=\"media-wrap embed-wrap\"><div><blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\">The tariffs that President Trump has announced against 3 of the United States’ biggest trading partners—Canada, China, and Mexico—look poised to shatter the era of a rules-based order with global economic ramifications, writes trade expert <a href=\"https://twitter.com/edwardalden?ref_src=twsrc%5Etfw\">@edwardalden</a>. <a href=\"https://t.co/hJ2zFV8mY4\">https://t.co/hJ2zFV8mY4</a></p>— Council on Foreign Relations (@CFR_org) <a href=\"https://twitter.com/CFR_org/status/1886223591353581708?ref_src=twsrc%5Etfw\">February 3, 2025</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p></p><p>These tariffs have contributed to broader market instability, and MicroStrategy may be adopting a more cautious stance to navigate the shifting economic landscape.  </p><p></p><p>With global markets in flux, the company appears to be carefully weighing the risk of further volatility before deciding whether to resume its aggressive Bitcoin strategy.  </p><p></p><h2>Shift In Funding Strategy for Bitcoin Purchases  </h2><p>MicroStrategy has long used proceeds from issuing new stock to fund its Bitcoin purchases.  </p><p></p><p>However, the recent halt in Bitcoin acquisitions signals a shift in this approach.  </p><p></p><p>Without the same level of stock sales to finance new acquisitions, the company may struggle to maintain its aggressive Bitcoin buying strategy.  </p><p></p><p>The pause in purchases may reflect a reassessment of its funding options, as the firm waits for clearer market signals and better financial stability.  </p><p></p><h2>Strategic Pause, Not Permanent Exit  </h2><p>Despite the halt, MicroStrategy has not signalled a permanent end to its Bitcoin buying strategy.  </p><p></p><p>The company’s commitment to Bitcoin as a long-term asset remains intact, but it seems to be taking a break to reassess the market dynamics and its financial standing.  </p><p></p><p>This pause is likely a temporary adjustment while the company deals with market uncertainty, tax implications, and changing economic conditions.  </p><p></p><p>Investors will be keen to see when and how MicroStrategy returns to its Bitcoin accumulation strategy.  </p></div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/294d685214a1e092ef72cf14f0e337f1.jpeg",
            "link": "https://www.coinlive.com/news/microstrategy-stops-buying-bitcoin-after-12-weeks-of-aggressive-acquisitions",
            "pub_date": "2025-02-04 17:55:11",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 212681,
            "title": "Crypto market rebounds V-shaped: Is the bull market still on the way?",
            "description": "<div class=\"share___SVvtl\"><div><p style=\"text-align: left;\">On February 3, the crypto market experienced a waterfall-like decline. Bitcoin once plunged to $91,000, and Ethereum plunged to below $2,100, reaching its lowest level since November. Other altcoins fell even more severely, with an average drop of more than 15%. Just as investors were panicking, funds flowed back during the North American trading session, and the market rebounded in a V-shaped manner. In the early hours of this morning, Bitcoin once hit $102,500, completely recovering yesterday's losses.</p><p style=\"text-align: left;\">Before and after the Spring Festival holiday, Bitcoin has experienced short-term sharp declines many times. But it is worth noting that despite the large decline, Bitcoin has been quickly repaired every time, showing amazing market resilience. </p><p style=\"text-align:center\"><img src=\"https://lh7-rt.googleusercontent.com/docsz/AD_4nXc9FY5xMDwdsVqY661xUiULiB-WDM2takXPp9iJFf5ZF2qA3_aTV4sEZjfjei2Ux0OYui_XE8no7MmftNymeWoT-9kqaSl1yzazPPlGCLorAzyhVP2o1-DPV2BucILw_T7-kWQsqA?key=LrsLQvQP2GZON5t5x7VEGgWz\"/></p><h2 style=\"text-align: left;\">DeepSeek has hit the market hard</h2><p style=\"text-align: left;\">On the eve of the Lunar New Year, the download volume of the domestic AI large model DeepSeek surpassed ChatGPT and topped the US APP Store, attracting the attention and coverage of the global technology, investment industry and media. Because the model is extremely low-cost, but its effect is comparable to that of AI products of American companies such as OpenAI, it has brought great shock to the global market, shaking the foundation of the AI ​​industry that has always believed that \"great effort can produce miracles\". A stone stirs up a thousand waves, and US technology stocks are immediately hit hard. Nvidia's stock price once fell by nearly 17%. The crypto market was also not immune to the impact. Bitcoin and Ethereum also fell by 6% and 7% respectively, and some altcoins lost double digits. However, after the plunge, the market rebounded quickly, and mainstream currencies such as Bitcoin and Ethereum quickly recovered their losses, showing strong market bullish confidence. Trump's tariff policy caused market panic. During the Spring Festival, the tariff stick promised by Trump during his campaign for the US presidency has gradually been implemented in recent days. On February 2, US President Trump signed an order to impose a 25% tariff on Mexican and Canadian imports and a 10% tariff on China. The trade volume between the United States and these three countries is about 1.6 trillion US dollars. The relevant countries have also vowed to take retaliatory actions. The official start of the tariff war has shocked the global financial market.</p><p style=\"text-align: left;\">The market is worried that a full-scale trade war will disrupt the global supply chain, raise inflation, cause the Federal Reserve to raise interest rates again, and drag down the economy. Cryptocurrencies have fallen like waterfalls. Bitcoin once plunged to $91,000, Ethereum plunged to below $2,100, and many altcoins hit an all-time low.</p><p style=\"text-align: left;\">After the great turmoil in the global financial market, Trump said on Monday that after talking with the leaders of Canada and Mexico, he agreed to postpone the plan to impose a 25% tariff on the two neighboring countries for one month and continue negotiations. Market sentiment eased, and the crypto market rebounded in a V-shaped pattern. Bitcoin once reached $102,500, completely recovering yesterday's losses. </p><h2 style=\"text-align: left;\">Is the bull market still on the way? </h2><p style=\"text-align: left;\">During this period, Bitcoin has experienced sharp declines many times. Although each decline can be quickly repaired, these fluctuations are also constantly shaking investors' confidence, making market sentiment increasingly weak, triggering a debate on whether the bull market is still there. Overall, this round of bull market is still sustainable, mainly based on the following points:</p><p style=\"text-align: left;\">1. Tariff policy may only be a negotiating tool. During Trump's first term, tariff policies changed frequently and capriciously, and tariff threats were more of a bargaining chip than a long-term strategy. After Trump announced the imposition of tariffs on Mexico and Canada, the limited decline in technology stocks was a reaction to this. The market believed that Trump's \"false shot\" was intended to allow the Mexican and Canadian governments to crack down on drugs and illegal immigrants entering the United States. Sure enough, the next day, Trump said on social media that Mexico agreed to send 10,000 soldiers to the border to control illegal immigrants and drugs, and Canada would also take corresponding measures. The suspension of the tariff policy once again supported this view. Now it seems that Trump's wishful thinking is going well, and the negotiations with Mexico and Canada have yielded results. </p><p style=\"text-align: left;\">2. Trump's campaign promises are being fulfilled. Trump's crypto-friendly policies are being promoted and have been partially realized, such as the appointment of cryptocurrency-friendly officials and the issuance of executive orders, and the market's most concerned about the national strategic reserve of Bitcoin has also received further news. On Monday, Trump signed an executive order instructing the Treasury and Commerce Departments to submit a plan for a new U.S. sovereign wealth fund within 90 days and establish the fund within the next 12 months. Although Bitcoin was not explicitly mentioned when it was signed, the fund could become a tool for the government to purchase and hold cryptocurrencies. Cynthia Lummis, who first proposed that the United States establish a strategic reserve of Bitcoin and was appointed by the Trump administration as chairperson of the U.S. Senate Banking Subcommittee on Digital Assets, posted on X and used the Bitcoin symbol, implying that it was related to the Bitcoin strategic reserve. 3. Multiple BTC escape indicators did not appear. In every bull market, Bitcoin has shown obvious indicators of escaping the top. None of the 30 indicators currently recognized by the mainstream market, including the rainbow chart, ahr999 and other core indicators, has hit the target. In addition, the tops of all bull markets in history are not flat, but a needle, which does not give retail investors too much time to think. Now Bitcoin has stayed near $100,000 for more than a month, which is usually a sign that the bull market is still continuing. </p><p style=\"text-align:center\"><img src=\"https://lh7-rt.googleusercontent.com/docsz/AD_4nXdwaulWYVC2_QTCGeR6g2Ytmjcib0RUfI3HXJmCH3Bs35axUNgYlvnHUa4LL7A54KpUErWed4h9_3EZMnTnoRQizaDThSp5qDpcV1CSdq99D_1G6Fub_f8SyiWIMyLAb1kuLyRg-Q?key=LrsLQvQP2GZON5t5x7VEGgWz\"/></p><p style=\"text-align: left;\">On the whole, although the market volatility in early 2025 is intense, there are many signs that the current bull market still has the possibility of continuing to rise. Investors should remain cautiously optimistic and pay attention to policy changes and market indicators to cope with possible fluctuations and opportunities. </p><p style=\"text-align:center\"><img src=\"https://lh7-rt.googleusercontent.com/docsz/AD_4nXdy4ck2tzvCxzU9C2nu2svz3sEBmNCZMU1T5ObcrSbIzRlvOR8OSynOcQE0m RHUBVEWgXUQ0EV0W9kXy55XaOLoxJLLR4ET4yyFVkVPyUsaCzUKnn7iPcgVMQJql4PyMdnbR7_Ayg?key=LrsLQvQP2GZON5t5x7VEGgWz\"/></p><p ant-image=\"\" image_preview___3r7dm=\"\" style=\"text-align: As the official partner of the Argentine national team, 4E provides trading services covering more than 600 assets including cryptocurrencies, commodities, stocks, indexes, etc. It also supports financial products with an annualized rate of return of up to 5.5%. Users can invest at any time with one click by holding USDT. In addition, the 4E platform has a risk protection fund of US$100 million, which adds another layer of protection for the safety of users' funds. With 4E, investors can keep up with market trends, flexibly adjust strategies, and seize every potential opportunity.&lt;/p&gt;&lt;/div&gt;&lt;/div&gt;&lt;/div&gt;&lt;div class=\"><img class=\"ant-image-img\" style=\"display:none\"/></p><div class=\"ant-image-mask\" style=\"display:none\"><div class=\"ant-image-mask-info\"><span aria-label=\"eye\" class=\"anticon anticon-eye\" role=\"img\"><svg aria-hidden=\"true\" data-icon=\"eye\" fill=\"currentColor\" focusable=\"false\" height=\"1em\" viewbox=\"64 64 896 896\" width=\"1em\"><path d=\"M942.2 486.2C847.4 286.5 704.1 186 512 186c-192.2 0-335.4 100.5-430.2 300.3a60.3 60.3 0 000 51.5C176.6 737.5 319.9 838 512 838c192.2 0 335.4-100.5 430.2-300.3 7.7-16.2 7.7-35 0-51.5zM512 766c-161.3 0-279.4-81.8-362.7-254C232.6 339.8 350.7 258 512 258c161.3 0 279.4 81.8 362.7 254C791.5 684.2 673.4 766 512 766zm-4-430c-97.2 0-176 78.8-176 176s78.8 176 176 176 176-78.8 176-176-78.8-176-176-176zm0 288c-61.9 0-112-50.1-112-112s50.1-112 112-112 112 50.1 112 112-50.1 112-112 112z\"></path></svg></span>Preview</div></div></div><div class=\"star___3mQoc\"><div class=\"star_content___UUYe1\"><div class=\"star_wrap___ktGLD circle___35Flz\"><span><span class=\"anticon\" role=\"img\" style=\"font-size:28px;color:#a8a8a8\"><svg aria-hidden=\"true\" class=\"\" fill=\"currentColor\" focusable=\"false\" height=\"1em\" width=\"1em\"><use xlink:href=\"#icon-weidianzan\"></use></svg></span></span></div></div></div><div class=\"subscribe___1hFrM\"><span>Gain a broader understanding of the crypto industry through informative reports, and engage in in-depth discussions with other like-minded authors and readers. You are welcome to join us in our growing Coinlive community:</span><a href=\"https://t.me/CoinliveSG\" rel=\"noreferrer\" target=\"_blank\">https://t.me/CoinliveSG</a></div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/f4e74e10ec6f72d4b4b435f6ffc53ee4.jpg",
            "link": "https://www.coinlive.com/news/crypto-market-rebounds-v-shaped-is-the-bull-market-still-on",
            "pub_date": "2025-02-04 17:39:40",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 212680,
            "title": "Meta Rolls Out Frontier AI Framework to Constrain High-Risk AI Systems and Tackle Cybersecurity Threats",
            "description": "<div class=\"share___SVvtl\"><div><h1>Meta Introduces Framework to Restrict High-Risk AI Systems</h1><p><a href=\"https://www.coinlive.com/news/it-s-survival-of-the-fittest-amidst-meta-staff-facing-uncertainty \" target=\"\">Meta </a>has unveiled its Frontier AI Framework, a new policy aimed at addressing the potential dangers of high-risk artificial intelligence (AI) systems, particularly in cybersecurity and biosecurity. </p><p></p><p><a href=\"https://ai.meta.com/static-resource/meta-frontier-ai-framework/?utm_source=newsroom&amp;utm_medium=web&amp;utm_content=Frontier_AI_Framework_PDF&amp;utm_campaign=Our_Approach_to_Frontier_AI_blog \" target=\"\">The company has categorised AI models into two risk levels</a>: high-risk and critical-risk, each defined by the severity of their potential harm. </p><p></p><p>High-risk AI models, which could facilitate cyber or biological attacks, will remain restricted until adequate safeguards are in place. </p><p></p><p>Meanwhile, critical-risk AI—deemed capable of causing catastrophic consequences—will see development halted indefinitely. </p><div class=\"media-wrap embed-wrap\"><div><blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\">Company: Meta<br/>Date: February 3, 2024<br/>Change: Released a responsible scaling policy, called their Frontier AI Framework<br/>URL: <a href=\"https://t.co/OXoXHYMSrC\">https://t.co/OXoXHYMSrC</a></p>— The Midas Project Watchtower (@SafetyChanges) <a href=\"https://twitter.com/SafetyChanges/status/1886543498318344237?ref_src=twsrc%5Etfw\">February 3, 2025</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p><a href=\"https://www.coinlive.com/news/meta-s-free-speech-claims-ring-hollow-as-it-restricts-competitor \" target=\"\">Meta</a>'s strategy prioritises robust internal controls and security measures to prevent unauthorised access, reflecting the company's commitment to reducing the risks associated with advanced AI technology. </p><p></p><p>These moves come in response to growing concerns over AI's impact on data privacy and security.</p><p></p><h1>Robust AI Security Measures to Mitigate Risks</h1><p>Meta will assess AI system risks through a combination of internal and external research, acknowledging that no single test can comprehensively measure risk. </p><p></p><p>Expert evaluation will play a crucial role in decision-making, with a structured review process guided by senior leadership overseeing final risk classifications. </p><p></p><p>For high-risk AI systems, Meta will implement mitigation measures to ensure safe deployment, preventing misuse while preserving the system's intended function. </p><p></p><p>In the case of critical-risk AI models, development will be paused until effective safety protocols are in place to guarantee controlled and secure release. </p><p></p><p>This approach underscores <a href=\"https://www.coinlive.com/news/meta-to-see-big-changes-as-mark-zuckerberg-vows-to \" target=\"\">Meta</a>'s commitment to balancing innovation with responsibility in AI development. </p><div class=\"media-wrap embed-wrap\"><div><blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\">💥 Meta implements new AI security measures<br/><br/>Meta, an American holding company, has introduced (<a href=\"https://t.co/71SlbJOhsB\">https://t.co/71SlbJOhsB</a>) the Frontier AI Framework to regulate the development of high-risk AI.<br/><br/>✅ The company will classify AI models based on their threat level, restricting or… <a href=\"https://t.co/GV0CT4rIgU\">pic.twitter.com/GV0CT4rIgU</a></p>— Traders Union (@TradersUnion_TU) <a href=\"https://twitter.com/TradersUnion_TU/status/1886652187217887442?ref_src=twsrc%5Etfw\">February 4, 2025</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p></p><h1>Meta Addresses Worries, Commits to Transparent AI Development</h1><p>Meta has championed an open approach to AI development, providing widespread access to its Llama models, which has led to millions of downloads and broad adoption. </p><p></p><p>However, this openness has raised concerns about the potential for misuse, including reports of a US adversary leveraging Llama to create a defense chatbot. </p><p></p><p>In response, <a href=\"https://www.coinlive.com/news/meta-ray-ban-glasses-just-levelled-up-with-live-ai-translation \" target=\"\">Meta</a> is introducing the Frontier AI Framework, which aims to balance these risks while continuing to uphold its commitment to accessible, responsible AI innovation. </p><p></p></div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/4d1c30afbff72cbfffd755d60ed254b0.jpeg",
            "link": "https://www.coinlive.com/news/meta-rolls-out-frontier-ai-framework-to-constrain-high-risk-ai",
            "pub_date": "2025-02-04 17:23:34",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        }
    ]
}