{
    "data": [
        {
            "id": 250272,
            "title": "Detailed teardown of BIP-110 (10,000-word article)",
            "description": "<div class=\"share___SVvtl\"><div>In February 2026, the controversial Bitcoin proposal BIP-110 was officially merged into the official BIP proposal repository [1]. This Bitcoin improvement proposal, proposed by developer Dathon Ohm, strongly supported by developer Dash Luke Jr., and promoted by the implementation of the client Bitcoin Knots, aims to prevent the Bitcoin blockchain space from being occupied by non-BTC transactions (i.e., so-called ecosystem applications, such as inscriptions, BRC-20, and other use cases). It has received much attention and debate from the community before and after its inception. This article intends to dissect it to see if some insightful conclusions can be drawn. <h2 style=\"text-align: left;\"><span leaf=\"\"><span text=\"\">I. Core Content of the Proposal:</span></span>A \"Temporary Soft Fork\" for Data Storage</h2><p style=\"text-align: left;\"><span leaf=\"\">BIP-110 is titled \"Reduced Data Temporary Softfork,\" and its core objective is very clear: to temporarily limit the size of data fields at the consensus level to correct the incentive distortion caused by standardization supporting arbitrary data, and to refocus priorities on improving Bitcoin's function as a currency.</span></p><h2 style=\"text-align: left;\"><span leaf=\"\"> Specifically, the proposal stipulates that during the one-year temporary deployment period, blocks must comply with the following additional rules: (1) Script public key (scriptPubKey) length limit: Newly created output script public keys exceeding 34 bytes are invalid, unless the first opcode is OP_RETURN (in which case a maximum of 83 bytes is allowed). This means that, except for explicitly discardable outputs like OP_RETURN, the core identifiers of all UTXOs must be simplified. (2) Data push and witness element size limit: Data pushed by OP_PUSHDATA* series opcodes and witness stack elements exceeding 256 bytes are invalid (except for redeemScript in BIP16). This directly targets the practice of embedding large blocks of data into transactions, such as inscriptions. (3) Undefined Witness Versions Disabled: Spending undefined witness versions (i.e., non-Witness v0/BIP 141, Taproot/BIP 341, or P2A) is considered invalid. While creating such outputs is still allowed, they cannot be spent within the next year. (4) Taproot Annexes Disabled: Witness stacks containing Taproot annexes are considered invalid. Annexes, as undefined data fields reserved for future upgrades, are currently completely blocked. (5) Taproot Control Block Size Limit: Taproot control blocks exceeding 257 bytes (corresponding to a Merkle tree with a maximum of 128 script leaves) are invalid. This limits the script complexity that a single UTXO can support. (6) OP_SUCCESS* opcodes disabled: OP_SUCCESS* opcodes in Tapscript (whether executed or not) are invalid. These opcodes are also reserved for future upgrades. (7) Conditional opcodes disabled: OP_IF or OP_NOTIF instructions in Tapscript (regardless of the result) are invalid. This directly combats the use of conditional statements to hide data. It is worth noting that UTXOs created before the activation height are not subject to the new rules when spent. After the one-year period of the soft fork, all UTXOs will return to an unrestricted state. </span><h2 style=\"text-align: left;\"><span leaf=\"\"><span text=\"\">II. Motivation of the Proposal:</span></span> Combating “Data Abuse” and Defending the “Essence of Money”</h2></h2><p style=\"text-align: left;\"><span leaf=\"\">The motivation section of BIP-110 is strongly worded, reflecting the proposer’s fundamental rejection of so-called “data embedding” behavior. Its core logic can be summarized as follows:</span></p><p style=\"text-align: left;\"><span leaf=\"\">(1) Continuation of Historical Tradition</span></p><p style=\"text-align: left;\"><span leaf=\"\">The proposal points out that the Bitcoin community has historically treated the technology of embedding arbitrary data into Bitcoin transactions with an “adversarial” attitude. This adversarial attitude is seen as a necessary means to protect Bitcoin as the “native currency of the Internet”.</span></p><p style=\"text-align: left;\"><span leaf=\"\"> From the early discussions of OP_RETURN in 2010, to the debate about blockchain size in 2013-2014, and then to the inscription controversy since 2022, this line of thought has always existed. </span></p><p style=\"text-align: left;\"><span leaf=\"\">(2) Incentive Distortion and Negative Externalities</span></p><p style=\"text-align: left;\"><span leaf=\"\">This is the most convincing technical argument of the proposal. The proposal argues that fee markets cannot properly solve the incentive problem of data storage:</span></p><p style=\"text-align: left;\"><span leaf=\"\">- Payment Transaction: Payers pay miners a one-time fee to obtain a one-time settlement service. After the miners complete the service, node operators voluntarily maintain the historical ledger because it is the basis for Bitcoin's operation as a currency.</span></p><p style=\"text-align: left;\"><span leaf=\"\">- Data Storage Transaction: Payers only pay a one-time fee to the miners who contain the data, but the burden of storing the data permanently falls on all node operators.</span></p><p style=\"text-align: left;\"><span leaf=\"\"> Node operators never receive any fee sharing, yet they are forced to download, store, and provide this data indefinitely. This asymmetric incentive results in miners profiting while nodes bear the costs, objectively encouraging data embedding behavior and undermining network decentralization. (3) Response to emerging trends such as \"inscriptions\" The proposal explicitly mentions the \"inscription\" technology (i.e., Ordinals) that began to be \"exploited\" in 2022, arguing that it creates \"significantly unnecessary burdens on node operators\" and shifts the development focus—from Bitcoin's fundamental purpose as a \"sound, permissionless, borderless currency\" to supporting non-monetary use cases. (4) Protecting Payment Use Cases and Censorship Resistance The proposal argues that data storage and payments unfairly compete for block space, driving up Bitcoin payment costs and forcing people to rely on third-party payment processors, thus making Bitcoin payments more susceptible to censorship. By limiting data storage, payment costs can be reduced and censorship resistance enhanced. (5) Maintaining Low-Cost Node Operations Maintaining a low barrier to entry for running nodes (whether in terms of financial or other costs) has always been a core promise of Bitcoin's decentralization. Limiting the expansion of UTXO sets and the unlimited growth of block data directly serves this goal. </span></p><h2 style=\"text-align: left;\"><span leaf=\"\"><span text=\"\">III. Technical Details of the Proposal:</span></span>A Carefully Designed \"Containment\" Strategy</h2><p style=\"text-align: left;\"><span leaf=\"\">The technical design of BIP-110 embodies the idea of ​​\"minimal intervention, maximum effect,\" attempting to block the main data embedding pathways while minimizing impact on known currency use cases.</span></p><p style=\"text-align: left;\"><span leaf=\"\">(1) Why limit the script public key to 34 bytes?</span></p><p style=\"text-align: left;\"><span leaf=\"\">The script public key in the UTXO set must be stored in a fast medium (usually RAM), which is far more expensive than slow storage. Modern Bitcoin practice has moved all spending conditions to the witness, and the script public key only needs to commit to these conditions with a hash value, so 34 bytes is sufficient.</span></p><p style=\"text-align: left;\"><span leaf=\"\"> Large script public keys not only waste space, but can also be used to create \"poisoned blocks\" (maliciously crafted blocks with extremely long verification times). Limiting them has almost no impact on existing practices. </span></p><p style=\"text-align: left;\"><span leaf=\"\">(2) Why retain OP_RETURN? </span></p><p style=\"text-align: left;\"><span leaf=\"\">OP_RETURN output has been proven to be unspendable, and nodes do not need to store it in the UTXO set. Historically, a maximum of 83 bytes was tolerated simply to avoid garbage data flooding other types of output scripts. Although pay-to-contract and Taproot techniques can replace the functionality of OP_RETURN, the proposal retains this option to avoid breaking legacy protocols. </span></p><p style=\"text-align: left;\"><span leaf=\"\">(3) Why limit the data size to 256/257 bytes? </span></p><p style=\"text-align: left;\"><span leaf=\"\">256 bytes is sufficient for legitimate cryptographic uses (such as large number arithmetic). More importantly, with modern compression techniques, 300-400 bytes can represent an image. The proposer believes that images are the most harmful data storage use case, with high demand, leading to high costs, UTXO set expansion, and potentially controversial content. Limiting to 256 bytes can prevent the embedding of large, continuous blocks of data. </span></p><p style=\"text-align: left;\"><span leaf=\"\">(4) Why disable OP_IF/OP_NOTIF? </span></p><p style=\"text-align: left;\"><span leaf=\"\">In the Taproot design, conditions should be evaluated off-chain, with the final execution path only revealed on-chain. Ideally, key path spending should be used to avoid publishing any scripts. OP_IF is not only redundant in Tapscript, but is also often abused to inject \"skipped during execution\" junk data. While it cannot completely prevent steganography, banning OP_IF almost eliminates a common abuse route for free. (5) Why a temporary soft fork? This is one of the most controversial and ingenious designs in the proposal. The temporary (one year) nature serves several purposes: - Reduce censorship risk: Reassure the community that this is merely an intervention for a specific crisis, rather than a permanent change in the direction of development, thereby reducing resistance to acceptance. - Avoid hindering future upgrades: Some restrictions (such as Taproot tree depth) may be too stringent, but developing a more robust solution takes time. The temporary deployment buys developers a year to design more refined long-term rules. - Provide a market adaptation period: Any potentially affected projects (such as Miniscript, BitVM) can use this year to adjust or migrate. IV. Trade-offs and Risks: The Proposal's Achilles' Heel The authors of BIP-110 are surprisingly candid in the \"Trade-offs\" section, acknowledging the following potential problems with the proposal: (1) Taproot Control Block Limitation and Smart Contracts Limiting the Taproot control block to 257 bytes (maximum 128 script leaves) could affect advanced smart contracts such as BitVM that rely on large amounts of executable scripts. The proposal acknowledges this as an \"unfortunate trade-off\" but believes these use cases are still in the early stages of development and can continue to be experimented with on testnets or sidechains over the next year. (2) OP_IF/OP_NOTIF Restrictions and Existing Wallets Some wallet software (such as Miniscript) habitually creates Tapleafs containing OP_IF. The proposal mitigates the risk of fund freezing through \"exemption from UTXO created before activation\" and \"two-week grace period,\" but cannot completely rule out the theoretical possibility. (3) The “Perfect Storm” of Fund Freezing The proposal details the extreme conditions under which funds may be frozen or lost: all conditions must be met simultaneously—P2TR UTXO, pre-signed transaction, confirmation and spending within a one-year deployment period, selected Tapleaf containing OP_IF or depth &gt; 7, key path unavailable and no other suitable Tapleaf (frozen), or other Tapleaf spent in an unexpected manner (lost). (4) The “Disruption” of Developer Space The proposal frankly admits: “Yes, this proposal is intended to disrupt user space, specifically data storage user space.” This candor may exacerbate the concerns of opponents—if user space can be disrupted today for “anti-spam” purposes, will more use cases be disrupted tomorrow under other pretexts? V. Deployment Mechanism: Radical Political Statement The deployment parameters of BIP-110 are themselves a radical political statement: A 55% hashrate threshold (instead of the usual 95%): If more than 55% of miners' hashrate supports the move within a 2016-block cycle, BIP-110 will automatically launch after two weeks. The authors argue that only permanent consensus changes require 95% hashrate, and this temporary soft fork is urgent, making a lower threshold more ideal. This contrasts sharply with the traditional requirement of \"broad consensus\" (such as the 95% threshold for Segwit and Taproot). Opponents argue that this violates the spirit of \"rough consensus,\" which seeks broad acceptance. **Note from ChainTeach:** The concept of \"rough consensus\" was first proposed by the IETF, and its famous principle is: \"We reject kings, presidents, and voting. We believe in rough consensus and running code.\" Traditional understanding of \"rough consensus\" includes the following key characteristics: 1. Non-voting system – not relying on majority vote, avoiding \"tyranny of the majority\"; 2. Technology-driven – viewpoints prevail based on technical rationality and security, rather than numbers or influence; 3. Dissent is permissible – opposing opinions are allowed as long as they do not affect the overall ability to act; 4. Code is vote – final consensus is reflected in the actual code executed by nodes; 5. Long-term evolution – consensus formation takes time, not short-term decisions. - Forced signaling period: During a difficulty adjustment period before block height 965664 (approximately September 2026) is locked, miners are forced to signal support; if no explicit support signal is received from miners after this period, BIP-110 is unconditionally launched via UASF (User Activated Soft Fork), treating blocks carrying invalid data as invalid. This further reduces the space for opponents. Note: BIP-110 uses a modified version of the BIP9 signaling mechanism. Specific parameters are as follows: name: reduced_data bit: 4 starttime: 1764547200 (~December 1, 2025) timeout: NO_TIMEOUT min_activation_height: 0 max_activation_height: 965664 (~September 1, 2026)</span></p><p style=\"text-align: left;\"><span leaf=\"\">active_duration: 52416 blocks (~1 year after activation)</span></p><p style=\"text-align: left;\"><span leaf=\"\">threshold: 1109/2016 (55%)</span></p><p style=\"text-align: left;\"><span leaf=\"\">- One-year validity period: After activation, the rule is only effective for approximately one year (52416 blocks), after which it automatically expires. </span></p><p style=\"text-align: left;\"><span leaf=\"\">This deployment mechanism conveys a clear message: the proposer believes the situation is so urgent that it is necessary to bypass the traditional high-threshold consensus process.</span></p><p style=\"text-align: left;\"><span leaf=\"\"> As Renaud Cuny said, “After the inscription consumed 37% of the block space and no one took action for three years, the mechanism no longer requested permission.”[2] Opponents may argue that this sets a dangerous precedent—any group with 55% of the computing power could force temporary consensus changes in the future. </span></p><p style=\"text-align:center\"><img alt=\"NYS6szbLKenZWynqEDPcMM1vBELTTFJaA29wzV4e.png\" src=\"https://img.jinse.com.cn/7435816_image3.png\" title=\"7435816\"/></p><h2 style=\"text-align: left;\"><span leaf=\"\"><span text=\"\">VI. Community Controversy:</span></span>Monetary Purism vs. Protocol Minimalism</h2><p style=\"text-align: left;\"><span leaf=\"\">BIP-110 touches on the deepest ideological differences in the Bitcoin community:</span></p><p style=\"text-align: left;\"><span leaf=\"\">Main arguments of the supporters:</span></p><p style=\"text-align: left;\"><span leaf=\"\">1. Monetary Purism: The sole purpose of Bitcoin is to become a sound money.</span></p> Any non-payment use case is a waste of block space and should be resisted. 2. Node Decentralization First: Controlling the size of the UTXO set and block data expansion is a necessary measure to maintain node decentralization. 3. Incentive Distortion Needs Correction: The incentive mismatch where miners reap rewards while nodes bear costs must be corrected through consensus layer intervention. 4. Precedent and Signal: This proposal sends a clear signal to the market—data storage is undesirable, and development resources should focus on monetary functions. Key points of the opposition: 1. Protocol minimization: The consensus layer should be as simple as possible, enforcing only the minimum rules needed to prevent double-spending. Content filtering should remain at the policy or application layer. 2. The boundaries of \"adversarial\" approaches: Bitcoin is meant to \"defend against censorship,\" not \"defend against specific use cases.\" Actively excluding certain applications through consensus rules violates the principle of \"permissionless.\" 3. The slippery slope effect: Today we can restrict data for \"anti-spam,\" tomorrow can we restrict transaction amounts for \"anti-financial crime\"? The day after tomorrow, can we restrict scripts for \"anti-immoral content\"? 4. Technical Feasibility Questionable: Can the 256-byte limit truly prevent data storage? Circumvention methods such as fragmented storage and steganography still exist. Will disabling OP_IF affect the legitimate construction of complex scripts? 5. Controversy Regarding Program Legality: Does the 55% threshold and mandatory signaling period constitute a \"coup\" against existing governance processes? Will it be abused in the future? Interestingly, the opponents in this controversy are mostly influential opinion leaders with a larger voice, while the supporters lack figures of comparable stature. For example, OGs (old guards) who have explicitly expressed their opposition to BIP-110 include: - Adam Back, CEO of Blockstream and inventor of hashcash: People spent too much time in Q4 2025 educating others about the architectural limitations of filters. In short, \"it's stupid.\" We can't keep wasting endless time and attention on these bottomless pits. - Casey Rodarmor, inventor of the Ordinal inscription protocol: This is a technically flawed and confiscating proposal that removes important functionality and doesn't even achieve its stated goals. - Wang Chun, co-founder of F2Pool: BIP-110 is not just about limiting the size of OP_RETURN; it's an attempt to package a bunch of nonsense in the name of protecting children and then impose it on us as a whole, like a government censoring social media. - Jameson Lopp, co-founder of Casa, wrote a lengthy critique of BIP-110: BIP-110 is a high-risk and counterproductive governance adventure disguised as \"anti-spam.\" Its low 55% miner threshold and mandatory signaling period greatly increase the risk of chain splits; its forfeit rule changes could freeze existing funds that rely on Taproot functionality; it damages Bitcoin's neutral reputation against censorship without actually preventing data embedding (Peter Todd has demonstrated that the full proposal text can be embedded in compliant transactions); it restricts future innovations like BitVM, and the \"temporary\" rhetoric is misleading (supporters' real intention is permanent, extreme restrictions). From an economic perspective, miners lack incentives (zero signal rate, reduced transaction fee revenue), node signals lack economic weight (making them susceptible to manipulation by Sybil attacks), and prediction markets show a 98% failure rate. Ultimately, this is merely a culture war waged by a small group of moralistic purists, attempting to forcefully resolve issues that should be handled by the market and strategy layers. It's clear that the opposition represents the elite class within the entire Bitcoin ecosystem. Blockstream is a major supporter of Bitcoin Core, and it's perfectly logical for them to champion the removal of the default data embedding size limit for OP_RETURN in Core V30. Ordinal is a pioneering representative of the so-called \"Bitcoin (application) ecosystem.\" F2Pool is a well-known mining pool and a advocate for miners' interests. Finally, Jameson Lopp is a representative figure of independent developers and Bitcoin applications. Compared to the constellation of prominent opponents, voices explicitly supporting BIP-110 are relatively scarce in search results. This could be due to several reasons: - Supporters are mostly anonymous or technically savvy: the proposal's author, Dathon Ohm, is an anonymous developer, and while Luke Dashjr, a key promoter, has extensive experience in Bitcoin Knots clients, he is not a high-profile figure on social media. - Supporters may prefer to \"vote with code\": search results indicate that the proportion of Bitcoin Knots nodes supporting BIP-110 is rising—as of February 23, 2026, approximately 7.99% of Bitcoin nodes (1995/24981) have indicated their readiness to support BIP-110. Compared to 2.98% a month ago, support has increased by about 5% in one month. - Silent support from ordinary users in the community: Many long-term Bitcoin holders who have reservations about the inscription ecosystem may emotionally agree with BIP-110's \"monetary purism\" goals, but are simply unwilling to publicly engage in the debate. <h2 style=\"text-align: left;\"><span leaf=\"\"><span text=\"\">VII. Prelude to History:</span></span>Similar Situations for Satoshi Nakamoto</h2><p style=\"text-align: left;\"><span leaf=\"\">TeachChain found three cases related to on-chain data filtering and restrictions that Satoshi Nakamoto participated in discussions about in the early days of Bitcoin:</span></p><p style=\"text-align: left;\"><span leaf=\"\">(1) Before disappearing, Satoshi Nakamoto removed 15 opcodes, completely disabled them, and added a hard limit (520 bytes) to the size of data that could be manipulated on the script engine stack. He did this because, frankly, he messed up—leaving a large number of vulnerabilities that could allow complex scripts to be used to launch denial-of-service attacks against the entire network, create huge and costly transactions to verify, and cause node crashes.</span></p><p style=\"text-align: left;\"><span leaf=\"\"> (2) On December 8, 2010, Satoshi Nakamoto released Bitcoin Core version 0.3.18, which included a check called IsStandard() to determine whether transactions conform to standards (submitted by Gavin Andresen), which was met with much skepticism and opposition from the community. For example: Netizen theymos commented: This is meaningless. Why should miners adopt this change? It means they will receive fewer transaction fees because they lose non-standard transactions. He also pointed out that miners have clearly opposed it: ArtForz (which owns more than 15% of the network's computing power), tcatm (2 Ghash/s), and doublec (the mining pool maintainer) have stated that they will not use IsStandard. Therefore, non-standard transactions will still be possible. He also gave a threatening preview of his actions: \"When I have time, I will make a patch for Bitcoin to remove all non-network-enforced transaction restrictions so that other miners can easily configure themselves to include these transactions.\" jgarzik vehemently stated, \"Please launch your own blockchain, not fork the network like this. I want you to understand how much damage your forced inclusion of non-monetary data is causing. I never said this would lead to a blockchain fork. This is more fundamental: a rules fork. A forked network means that most miners no longer run the mainstream Bitcoin transaction rules. Theymos seems to be drawing a line, trying to convince most miners to stop focusing on the mainstream Bitcoin transaction verification rules. He has the right to do so. Miners also have the right to verify what they want to verify. But this fork will make working on the network more difficult in the future, and in effect, it opens the door for the blockchain to be filled with all sorts of non-monetary data, as mentioned in other discussions.\" (3) In December 2010, Satoshi Nakamoto commented on BitDNS, a non-monetary application on the Bitcoin blockchain, as follows: \"I think BitDNS could be a completely independent network and an independent blockchain, sharing CPU computing power with Bitcoin. The only overlap would be allowing miners to simultaneously search for proof-of-work for both networks. These networks don't need any coordination. Miners would subscribe to both networks in parallel. They would scan the SHA, so if they found a valid solution, they could potentially solve both networks simultaneously. If one network has a lower difficulty, the solution might only be valid for one network. I think external miners could call getwork from both programs and merge the work. Perhaps first call Bitcoin to get the work, then hand it over to BitDNS's getwork to merge it into a joint work.\" This isn't fragmentation, but rather a sharing and amplification of the combined CPU power between networks. This solves a problem: if multiple networks exist, they can become mutually threatening when available CPU power is concentrated to attack one of them. Instead, all networks in the world will share combined CPU power, increasing overall strength. This will make it easier for smaller networks to launch by connecting to an existing miner base. Regarding incentives, he added: \"The incentive is that you can also earn rewards from additional sidechains for the same work. Why not get free domain names for the same work you're generating Bitcoin? If you're generating 50 BTC per week now, you can now get 50 BTC plus some domain names.\" You have a job. If you solve it, it will simultaneously solve a block for both Bitcoin and BitDNS. Conceptually, they are connected by a Merkle tree. To commit to Bitcoin, you break the branch of BitDNS; to commit to BitDNS, you break the branch of Bitcoin. In practice, to modify Bitcoin, BitDNS might require about 200 extra bytes, but that's not a big deal. You've been talking about 50 domain names per block; compared to that, spending an extra 200 bytes per block for backward compatibility is negligible. If we really care about saving a few bytes, we could perhaps schedule a block in the distant future where Bitcoin will be upgraded to a more modern architecture with the Merkle tree at the top. Please note that both chains are under this new Merkle tree. This means that Bitcoin and BitDNS each have their own in-chain links within their respective blocks. This is the opposite of the common timestamp server architecture—that architecture places the chain at the top layer, followed by the Merkle tree, because that would create a common parent chain. Here, there are two timestamp servers that do not share the same chain. Clearly, Satoshi Nakamoto's idea was that non-monetary applications like BitDNS should ideally have their own independent chain and not share timestamp services with the Bitcoin main chain (i.e., a PoW chain). This certainly does not mean encouraging BitDNS to embed data into the Bitcoin main chain. VII. Thought Experiment: What would Satoshi Nakamoto think if he were still alive? Based on our understanding of Satoshi Nakamoto's historical statements, he might raise four questions about Bitcoin's non-monetary application ecosystem: (1) Did miners receive additional incentives? Yes (transaction fees), but these were \"stolen\" from the main chain payment market, not from rewards from external chains. When discussing BitDNS in 2010, Satoshi Nakamoto envisioned a model of \"one computing power, multiple rewards, data separation\"—miners received both Bitcoin rewards and BitDNS domain name rewards, while the data was stored on a side chain. Inscription's \"data embedded in the main chain\" model deviates from this vision. (2) Did the data change the core structure of Bitcoin? No (using existing witness fields), but it takes up space that would otherwise be used for payments. This touches on Satoshi Nakamoto's concerns in 2010 when he restricted non-standard transactions: keeping the blockchain focused on transaction records. (3) Is the data valuable? The market's willingness to pay fees indicates that it is valuable to some. But the question is: do payers bear all the social costs? Obviously not—nodes bear the cost of permanent storage. This is a new problem that Satoshi Nakamoto probably didn't have to consider in 2010. (4) Are there negative externalities that the market cannot regulate? Yes, node costs are borne by non-payers. When negative externalities reach a certain scale, is consensus layer intervention necessary? Based on Satoshi Nakamoto's actions back then, it is conceivable that if Satoshi Nakamoto were still alive, he would not have appeased these problems for a long time without taking any action. </span></p><h2 style=\"text-align: left;\"><span leaf=\"\"><span text=\"\">VIII. Reflections and Prospects:</span></span>An Experiment Destined to Be Recorded in History</h2><p style=\"text-align: left;\"><span leaf=\"\">BIP-110 was eventually merged into the official BIP library, which means that it gained a certain degree of \"discussion qualification\", but it was far from achieving activation consensus. Its significance may lie more in triggering a profound reflection on the essence of Bitcoin:</span></p><p style=\"text-align: left;\"><span leaf=\"\">(1) Technological Implications</span></p><p style=\"text-align: left;\"><span leaf=\"\">BIP-110 revealed a long-neglected problem: the potential divergence between miner incentives and node incentives.</span></p><p style=\"text-align: left;\"><span leaf=\"\">BIP-110 revealed a long-neglected problem: the potential divergence between miner incentives and node incentives.</span></p><p style=\"text-align: left;\"><span leaf=\"\"> Even without considering data storage, this discrepancy exists in ordinary payments—miners collect fees, and nodes store data permanently. It's just that data storage use cases amplify it to a degree that cannot be ignored. More sophisticated mechanisms may be needed in the future to fundamentally address this incentive mismatch. This leads us to further consider that if the Bitcoin blockchain is allowed to expand unchecked, it will significantly raise the barrier to entry for running an unincentivized full node, or user full node, thereby greatly reducing the number of user full nodes. The lack of constraints on user full node verification and block rejection will allow miners to further expand their influence and decision-making power derived from their block-producing rights, thus allowing mining interest groups to seize greater power and pushing Bitcoin towards an oligopoly, ultimately significantly weakening its decentralization. The situation will be exacerbated, especially when a group of maintainers adopts a policy of appeasement and non-resistance towards mining groups exists. Developers and miners, who are in the imagined system of checks and balances, will in fact tend to collude. (2) Impact on governance The proposal of the 55% threshold and mandatory signaling period may become a \"template\" or \"counterexample\" for future controversial changes. It forces the community to think: when faced with an \"imminent threat\", can and should the decision-making process be adjusted? Who has the right to define \"urgency\"? There are no simple answers to these questions. After studying the chain, we tend to regard BIP-110 as a \"riot\" launched by the people after the community failed to stop Bitcoin Core maintainers from constantly compromising on the data embedding of non-monetary use cases through off-chain discussions. So, unsurprisingly, this uprising was met with unanimous and strong opposition from vested interests, those in power, and the elite class. In a sense, the more the elites opposed it, the more it proved the grassroots and populist nature of BIP-110. (3) The Divergence of the Bitcoin Ecosystem Regardless of whether BIP-110 is ultimately activated, it has already exacerbated the divergence of the Bitcoin ecosystem. Some developers and users may turn to more \"open\" protocols (such as other UTXO chains or Layer 2 solutions), while others may more firmly support \"monetary purism.\" The debate between Bitcoin as \"digital gold\" and \"smart contract platform\" may intensify. Previously, numerous diverse ideas born from the Bitcoin community, unable to be accommodated by Bitcoin, left and incubated into numerous altcoin blockchains. This included Ethereum, the progenitor of smart contract blockchains. Now, so-called Bitcoin ecosystem applications like BRC-20, as their names suggest, are nothing more than clumsy imitations of Ethereum and its ecosystem (such as ERC-20). This prompts us to ponder: if Bitcoin begins to imitate Ethereum, if Bitcoin loses its long-held pride in its thought leadership, can it still attract the world's top developers to contribute unpaid? After all, the Ethereum Foundation and many other projects pay salaries. (4) Long-term impact on ecosystem applications such as inscriptions Even if BIP-110 is not activated, the opposition it represents will affect market expectations. Ecosystem projects such as inscriptions and BRC-20 that rely on large-block data embedding may need to consider migrating to more suitable infrastructure (such as the Lightning Network, RGB, Taproot Assets, etc., which are true Layer 2), or adjusting their technical solutions to adapt to possible future limitations. When inscription NFTs first appeared in early 2024, ChainChain once praised Casey Rodarmor's idea of ​​integrating rather than separating metadata and media data. This is because a major hidden danger of the Ethereum ERC-721 NFT standard is that metadata is on-chain, while media data such as images are off-chain, which is heavily dependent on centralized infrastructure. This has created a rift in the \"ownership\" that the NFT industry has always claimed, and even, to put it more seriously, has made it a joke due to the nature of centralized control. The Inscription concept repairs this. This is what ChainCall praises. However, as the discussion deepens, we can further realize that the most suitable carrier for maintaining the integration of Inscription might be an independent sidechain, rather than embedding it into or parasitizing the Bitcoin chain through special means. Following Satoshi Nakamoto's idea, this independent sidechain could allow Bitcoin miners to contribute blocks to it through joint mining, so that miners could simultaneously enjoy incentives from both the Bitcoin chain and the Inscription chain, while the Inscription data would not pollute the Bitcoin chain. (5) The final evaluation rests with time. The authors of BIP-110 designed the proposal as temporary, perhaps hoping that time would test its rationality. A year later, if data storage really \"poisons\" the network, leading to a sharp decrease in the number of nodes or high fees, BIP-110 may be regarded as a \"prophet who saved Bitcoin\". Conversely, if Bitcoin still functions well without BIP-110, and the inscription ecosystem brings unexpected innovation and adoption, then BIP-110 may be remembered as an \"overreaction panic\". ChainChain believes that regardless of whether BIP-110 will ultimately win, it will inevitably have a natural sense of justice, progressiveness and revolutionary nature in the historical process because of its bottom-up intention to break the existing power structure and interest structure. The historical cycle is inescapable. Any system capable of transcending cycles must be able to internally disrupt power structures and interest groups. Only when power and wealth are perpetual can a system be perpetual. The newly rich OGs must be constantly overthrown by the impoverished grassroots for civilization to continuously renew and continue. Otherwise, the system and civilization will only succumb to corruption and extinction under the constant drain of social stratification. This is the philosophical essence of \"popular uprisings, rebellion is justified.\" Regardless of the outcome, BIP-110 has added a significant chapter to the history of Bitcoin. It reminds us that Bitcoin is not just code, but a social experiment shaped by countless participants. In the clash between technology and ideology, the ultimate victor will be the wisdom that can balance innovation and stability, freedom and responsibility.</span></p></div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/b9a687f42eff613aa02632f154005520.jpg",
            "link": "https://www.coinlive.com/news/detailed-teardown-of-bip-110-10-000-word-article",
            "pub_date": "2026-02-26 20:11:13",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 250267,
            "title": "The US has seized over $30 billion in cryptocurrency assets, with the Chen Zhi case accounting for 50%.",
            "description": "<div class=\"share___SVvtl\"><div>Currently, virtual currencies have already exerted a structural influence on the international financial and monetary systems. However, due to their technological characteristics and regulatory gaps, they have also become a major target for cybercrime and a new arena for financial competition. A report jointly released on February 26, 2026, by the China National Computer Virus Emergency Response Center and other departments, titled \"Ready Player One: An In-Depth Analysis of the Global Virtual Currency Asset Harvesting Operation Under US Technological Hegemony\" (hereinafter referred to as the \"Report\"), shows that, according to incomplete statistics, from 2022 to 2025, the United States has confiscated over $30 billion worth of global virtual currency assets through various cases. \"In the digital age, virtual assets have become an indispensable financial asset, and also an object of strong regulation and competition among major powers,\" said a financial researcher. Domestically, virtual currencies do not have the same legal status as legal tender. On February 6, 2026, the People's Bank of China and eight other departments issued the \"Notice on Further Preventing and Handling Risks Related to Virtual Currencies\" (hereinafter referred to as the \"Notice\"), which states that virtual currency-related business activities are illegal financial activities. \"Currently, countries such as Singapore and the United States have recognized the legality of virtual currencies. Investors who have trade relations with countries that have legalized virtual currencies, or who legally hold foreign exchange, can invest in these countries through legal means. However, it should be noted that even if investment is legal in these countries, the realization and trading of virtual currencies within China are still illegal,\" Tang Chunlin, a senior lawyer in the financial field, told Caixin. \"Therefore, it is clear that if domestic investors invest in virtual currencies and derivatives and violate laws or public order and good morals, the relevant civil legal acts are invalid, and the resulting losses must be borne by the investors themselves,\" Yang Xiang, a PhD in Law from Tsinghua University and a lawyer at Beijing Hongfan Law Firm, told Caixin. He added that if investors have overseas businesses, they must examine whether the platform possesses compliance licenses in mainstream legal jurisdictions before participating in virtual currencies. In Yang Xiang's view, the biggest legal risk in virtual currencies is not \"holding\" them, but rather violating money laundering (offshore) or concealing/disguising the proceeds of crime (domestic) during the \"deposit and withdrawal\" process. Therefore, it is essential to retain original legal source proof for every transaction (such as salary, dividends, or property sales certificates). Under the penetrating supervision of 2026, only assets with a complete chain of evidence are considered \"real assets.\" The report shows that, according to incomplete statistics, from 2022 to 2025, the United States has confiscated over $30 billion worth of virtual currency assets globally through various cases. The Chen Zhi case alone accounted for $15 billion in confiscated assets, representing 50% of the total. The report states, “The United States’ use of technological hegemony to seize global virtual assets is essentially aimed at maintaining its economic hegemony and the status of the US dollar. On the one hand, it directly plunders global wealth through confiscation and fines to supplement its domestic economic strength; on the other hand, by controlling the regulatory rules and transaction flows of virtual assets, it integrates the digital financial system into the dollar-dominated global financial framework, curbing other countries’ attempts to bypass the dollar through virtual currency assets for settlement.” Four months ago, in October 2025, the U.S. Attorney's Office for the Eastern District of New York announced criminal charges against Chen Zhi, founder of the Prince Group in Cambodia, on charges including wire fraud and money laundering. Simultaneously, it announced the confiscation of approximately 127,000 Bitcoins under his control, valued at approximately $15 billion at the time, setting a record for the largest virtual asset confiscation in U.S. judicial history. In November 2025, the National Computer Virus Emergency Response Center pointed out that a U.S. national-level hacking group had precisely cracked the underlying encryption vulnerability, attacking the LuBian mining pool (belonging to the Prince Group) cold wallet and transferring assets, demonstrating the U.S.'s mature national-level virtual currency asset theft capabilities. This clearly contradicts the U.S. government's claim that \"Bitcoin has never been hacked,\" or its true meaning may be that \"Bitcoin has never been hacked by hackers outside the U.S. government.\" In another case, from 2023 to 2025, the United States pursued both civil and criminal charges against Binance, a renowned international cryptocurrency exchange, and its founder, Changpeng Zhao. The case ultimately ended with Binance paying a $4.35 billion fine (including $2.7 billion in forfeiture of illegal gains, $1.35 billion in civil penalties, and $150 million in personal fines), and Changpeng Zhao signing a plea agreement and being pardoned. The report states that during the investigation, the United States employed comprehensive technical monitoring methods to achieve complete penetration and evidence collection of Binance's operational, user, and transaction data, demonstrating its technological advantages in the field of digital asset platform monitoring. For example, regarding cross-border data theft and internal information acquisition, the United States used hacking techniques to penetrate Binance's internal servers, obtaining core operational data and executive communication records, proving that Binance executives were aware of US regulatory rules but deliberately circumvented compliance requirements. Regarding full-scale monitoring and analysis of transaction data, the report shows that by accessing global blockchain nodes and collaborating with on-chain data analysis companies, the United States has achieved real-time monitoring of Binance's transaction data, accurately locating the trading behavior of US users and the flow of funds to sanctioned regions. Data shows that while US users once accounted for nearly 20% of Binance's user base, only 30%-40% of users completed real-name authentication, which the US used as core evidence of violations. Furthermore, the US technical team conducted penetration tests on Binance's real-name authentication system and anti-money laundering monitoring system, discovering systemic flaws in its compliance mechanisms. Virtual assets are a new type of wealth carrier in the digital age, experiencing rapid development in recent years. According to statistics from CoinGecko (a well-known cryptocurrency tracking and research institution), as of the end of January 2026, the total market capitalization of global virtual currency assets was approximately US$2.73 trillion, of which Bitcoin's total market capitalization reached approximately US$1.57 trillion. Meanwhile, the value of gold reserves held by central banks around the world was approximately $5.83 trillion. This means that the market capitalization of virtual currency assets has reached about 47% of the total market capitalization of global official gold reserves, approaching half, making it a new type of financial asset that cannot be ignored. How can investors hedge against risks? Since 2021, speculative activities related to virtual currencies and RWA (Real-World Asset) tokenization have occurred frequently. These activities have been identified by Chinese financial regulators as significant acts disrupting economic and financial order. On February 6, 2026, the People's Bank of China and other departments clarified the essential nature of virtual currencies, the tokenization of real-world assets, and related business activities: All virtual currency-related business activities conducted within China, including the exchange of legal tender for virtual currencies, the exchange of virtual currencies among themselves, acting as a central counterparty in buying and selling virtual currencies, providing information intermediary and pricing services for virtual currency transactions, token issuance financing, and trading of virtual currency-related financial products, as well as illegal financial activities such as the illegal issuance of token vouchers, unauthorized public issuance of securities, illegal operation of securities and futures businesses, and illegal fundraising, are strictly prohibited and will be resolutely banned according to law. \"Conducting real-world asset tokenization activities within China, as well as providing related intermediary and information technology services, which are suspected of involving illegal issuance of tokenized securities, unauthorized public offerings of securities, illegal operation of securities and futures businesses, illegal fundraising, and other illegal financial activities, should be prohibited; except for related business activities conducted based on specific financial infrastructure with the approval of the competent business authorities in accordance with laws and regulations. Foreign entities and individuals are prohibited from illegally providing real-world asset tokenization-related services to domestic entities in any form,\" the aforementioned \"Notice\" also stated. However, the \"Notice\" also opened the floodgates for RWA tokenization activities: Domestic entities directly or indirectly engaging in real-world asset tokenization in the form of foreign debt overseas, or conducting asset securitization or equity-based real-world asset tokenization overseas based on domestic asset ownership, income rights, etc. (hereinafter collectively referred to as domestic equity), should be strictly regulated by the National Development and Reform Commission, the China Securities Regulatory Commission, the State Administration of Foreign Exchange, and other relevant departments according to their respective responsibilities, following the principle of \"same business, same risk, same rules.\" Tang Chunlin reminded that virtual currencies do not have the attributes of legal currency in China, nor are they legal financial investment tools. Furthermore, there is currently no indication that China will loosen regulations in this area or gradually recognize the legality of virtual currencies. Therefore, all virtual currency investment activities conducted within China are illegal investment activities, and investors should be highly vigilant. According to Yang Xiang, many projects claiming to tokenize RWA assets such as real estate and gold are often classified as illegal securities issuance or illegal fundraising in China. Investors participating in such projects are highly susceptible to falling into Ponzi schemes, and the authenticity of the assets is difficult to trace. \"Investors with overseas business or compliant overseas status who want to participate in virtual currencies must conduct thorough compliance due diligence. When it comes to cross-border operations or overseas asset allocation, they must examine whether the platform possesses compliant licenses in mainstream jurisdictions, such as a Virtual Asset Service Provider license in Hong Kong or an MPI license (a high-level payment institution license issued by the Monetary Authority of Singapore) in Singapore. At the same time, they should avoid participating in stablecoin transactions pegged to the RMB, which is currently a no-go zone for domestic regulation,\" Yang Xiang stated.</div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/bc4cb9e8836a5375e53b4461f29abfe7.jpg",
            "link": "https://www.coinlive.com/news/the-us-has-seized-over-30-billion-in-cryptocurrency-assets",
            "pub_date": "2026-02-26 19:33:45",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 250265,
            "title": "Token goes global: Selling Chinese electricity to the world",
            "description": "<div class=\"share___SVvtl\"><div><p style=\"text-align: left;\"><span leaf=\"\"><span text=\"\">Author:</span></span><span leaf=\"\"><span text=\"\">Black Lobster｜Deep Tide TechFlow</span></span></p><p style=\"text-align: left;\"><span leaf=\"\">In the summer of 1858, a copper-core cable traversed the Atlantic Ocean, connecting London and New York.</span></p><p style=\"text-align: left;\"><span leaf=\"\">The significance of this event was never about the transmission speed, but about the power structure. Whoever laid the undersea cable could profit from the flow of information. The British Empire, relying on this global telegraph network, held the intelligence of its colonies, cotton prices, and war news in its hands.</span></p><p style=\"text-align: left;\"><span leaf=\"\">The empire's strength lay not only in its fleet, but also in that cable.</span></p><p style=\"text-align: left;\"><span leaf=\"\"> More than 160 years later, this logic is repeating itself in an unexpected way. In 2026, large-scale Chinese models are quietly devouring the global developer market. Latest data from OpenRouter shows that Chinese models account for 61% of the token consumption of the platform's top ten models, with the top three all originating from China. API requests sent daily by developers in San Francisco, Berlin, and Singapore are traveling across the Pacific Ocean via undersea cables to data centers in China, where computing power is consumed, electricity flows, and results are transmitted back. Electricity never leaves the Chinese power grid, but its value is delivered across borders through tokens. On February 24, 2026, OpenRouter released weekly data: the total token consumption of the platform's top ten models was approximately 8.7 trillion, with Chinese models accounting for 5.3 trillion, or 61%. MiniMax M2.5 debuted at the top with 2.45 trillion tokens, followed by Kimi K2.5 and Zhipu GLM-5. The top three were all from China. This was no accident; a single spark ignited everything. At the beginning of this year, OpenClaw emerged, an open-source tool that truly enabled AI to \"do work,\" capable of directly controlling computers, executing commands, and completing complex workflows in parallel. Within weeks, its GitHub stars surpassed 210,000. John, a finance professional, immediately installed OpenClaw and integrated it with the Anthropic API. He began automatically monitoring stock market information and providing timely trading signals. A few hours later, he stared at his account balance for a few seconds, stunned: tens of dollars gone. This is the new reality brought about by OpenClaw. In the past, chatting with AI involved thousands of tokens per conversation, with negligible costs. After integrating OpenClaw, the AI ​​runs a dozen subtasks simultaneously in the background, repeatedly calling the context and iterating in loops. Token consumption is not linear, but exponential. The bills are like a car with its hood open accelerating, the fuel gauge dropping, and it just won't stop. A clever trick quickly circulated within the developer community: using OAuth tokens to directly connect Anthropic or Google subscription accounts to OpenClaw, turning the monthly \"unlimited\" credits into free fuel for the AI ​​Agent. This was a method adopted by many developers. Official countermeasures followed. On February 19th, Anthropic updated its agreement, explicitly prohibiting the use of Claude subscription credentials for third-party tools like OpenClaw. Access to Claude functionality required using the API billing channel. Google went even further, extensively blocking subscription accounts that accessed Antigravity and Gemini AI Ultra through OpenClaw. \"The world has suffered under Qin rule for too long,\" John immediately embraced domestically developed large-scale models. On OpenRouter, the domestically developed MiniMax M2.5 model scored 80.2% on software engineering tasks, while Claude Opus 4.6 scored 80.8%, a negligible difference. However, the prices were vastly different: the former cost $0.3 per million tokens of input, while the latter cost $5, a difference of approximately 17 times. John switched over, the workflow continued, and the bill shrank by an order of magnitude; this migration is happening simultaneously worldwide. OpenRouter's COO, Chris Clark, put it bluntly: The reason Chinese open-source models have captured a large market share is because they account for an exceptionally high percentage of proxy workflows run by US developers. To understand the essence of token globalization, one must first understand the cost structure of a token. It seems lightweight; one token is roughly equivalent to 0.75 English words, and a typical conversation with AI consumes only a few thousand tokens. But when these tokens are stacked in trillions, the underlying physical reality becomes incredibly heavy. Breaking down the cost of tokens, there are only two core components: computing power and electricity. Computing power is the depreciation and amortization of GPUs. If you buy an Nvidia H100 for about $30,000, its lifespan, calculated over each inference iteration, is the depreciation cost. Electricity is the fuel that keeps data centers running. A GPU at full load consumes about 700 watts of power. Adding the cost of the cooling system, the electricity bill for a large AI data center can easily exceed hundreds of millions of dollars annually. Now, let's map this physical process. An American developer in San Francisco makes an API request. Data travels from California, via a Pacific undersea fiber optic cable, to a data center in China. The GPU clusters begin operating, electricity flows from China's power grid to the chips, inference is completed, and the results are sent back. The entire process may only take a second or two. Electricity never leaves China's power grid, but its value is delivered across borders through tokens. Herein lies a magical aspect unattainable by ordinary trade: tokens have no physical form, do not pass through customs, are not subject to tariffs, and are not even included in any current trade statistics. China exports a large amount of computing power and electricity services, but this is almost invisible in official commodity trade data. Tokens become a derivative of electricity; the export of tokens is essentially the export of electricity. This is also thanks to China's relatively low electricity prices, which are about 40% lower than those in the United States. This is a physical cost difference that competitors can easily replicate. Furthermore, China's large-scale AI models also have algorithmic and \"involution\" advantages. DeepSeek V3's MoE architecture allows only a subset of parameters to be activated during inference. Independent tests show that its inference cost is about 36 times lower than GPT-4o, and MiniMax M2.5 also has 229 bytes of total parameters but only activates 10 bytes. The top layer is involution, with over a dozen companies like Alibaba, ByteDance, Baidu, Tencent, Lunar Dark Side, Zhipu, and MiniMax trampling each other on the same track. Prices have long since fallen below reasonable profit margins, and operating at a loss to gain market share has become the norm. Looking closer, this is similar to the \"Made in China\" export strategy, leveraging supply chain advantages and industry involution to drive down token prices. From Bitcoin to Tokens Before tokens, there was another instance of electricity export. Around 2015, power plant managers in Sichuan, Yunnan, and Xinjiang began receiving a group of strange visitors. These people rented abandoned factories, filled them with densely packed machines, and ran them 24/7. The machines produced nothing; they simply kept solving a mathematical problem, and occasionally, from this endless mathematical problem, they would calculate a Bitcoin. This was the first generation of electricity going global: cheap hydropower and wind power, through the hash calculations of mining machines, were converted into globally circulating digital assets, and then converted into US dollars on exchanges. Electricity didn't cross any borders, but the value of electricity, carried by Bitcoin, flowed to the global market. In those years, China's computing power once accounted for more than 70% of the global Bitcoin mining computing power. China's hydropower and coal-fired power, in this roundabout way, participated in a global redistribution of capital. In 2021, all of this came to an abrupt end. Regulatory hammer fell, miners scattered, and computing power migrated to Kazakhstan, Texas, and Canada. But the underlying logic never disappeared; it was just waiting for a new shell. Until ChatGPT emerged, large-scale models emerged, and former Bitcoin mining farms transformed into AI data centers, mining machines became computing GPUs, and the Bitcoins produced became tokens. The only thing that remained unchanged was electricity. Bitcoin's overseas expansion and token's overseas expansion are isomorphic in their underlying logic, but tokens currently have greater commercial value. Mining is purely mathematical computation; the resulting Bitcoin is a financial asset whose value comes from scarcity and market consensus, and has nothing to do with \"what was calculated.\" Computational power itself is not productive; it's more like a byproduct of a trust mechanism. Large-scale model inference is different. GPUs consume electricity but produce real cognitive services: code, analysis, translation, and creativity. The value of a token comes directly from its utility to the user. This is a deeper embedding; once a developer's workflow relies on a particular model, the cost of switching increases over time. Of course, there's another crucial difference: Bitcoin mining was driven out of China, while token globalization was actively chosen by global developers. The Token Wars The submarine cable laid in 1858 represented the British Empire's sovereignty over the information superhighway; whoever owns the infrastructure can define the rules of the game. Token going global is also an undeclared war, fraught with obstacles. Data sovereignty is the first barrier. An API request from an American developer is processed through a Chinese data center, physically passing through China. This isn't a problem for individual developers and small applications, but it's a major weakness in scenarios involving sensitive corporate data, financial information, and government compliance. This is why the Chinese model has the highest penetration rate in development tools and personal applications, but almost no presence in core enterprise systems. The chip ban is the second wall; China's AI development faces export controls on Nvidia's high-end GPUs. The MoE architecture and algorithm optimization can only partially offset this disadvantage; the ceiling remains. However, the current obstacles are just the prologue; a larger battlefield is taking shape. Tokens and AI models have become a new dimension of strategic competition between China and the US, no less significant than the semiconductor and internet competitions of the 20th century, and even closer to an older metaphor: a space race. In 1957, the Soviet Union launched Sputnik 1, shocking the United States and prompting the launch of the Apollo program, which poured resources equivalent to hundreds of billions of dollars today into the space race. The logic of the AI ​​race is strikingly similar, but the intensity will far surpass that of the space race. Space is, after all, a physical space, imperceptible to ordinary people; AI, however, permeates the capillaries of the economy. Behind every line of code, every contract, and every government decision-making system, there may be a large-scale model running for a particular country. Whoever's model becomes the default infrastructure option for global developers gains a structural influence on the global digital economy. This is precisely what makes Washington truly uneasy about the overseas expansion of Chinese tokens. When a developer's codebase, agent workflow, and product logic are all built around an API based on a certain Chinese model, the migration cost will increase exponentially over time. At that point, even if the US legislates restrictions, developers will resist with their feet, just as no programmer can abandon GitHub today. Today's token going global may only be the beginning of this long game. The Chinese model doesn't claim to be disrupting anything; it's simply delivering services to every developer worldwide with an API key at a lower price. This time, the cables are being laid by engineering teams writing code in Hangzhou, Beijing, and Shanghai, and GPU clusters operating day and night in a southern province. This battle for supremacy has no countdown; it takes place 24 hours a day, every day. The unit is tokens, and the battlefield is every developer's terminal.</span></p></div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/7b9e1ed11e1344932db2e66331966b35.jpg",
            "link": "https://www.coinlive.com/news/token-goes-global-selling-chinese-electricity-to-the-world",
            "pub_date": "2026-02-26 19:29:39",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 250262,
            "title": "Is Circle, whose stock price surged 30% in a single day, quietly becoming the \"Visa on the blockchain\"?",
            "description": "<div class=\"share___SVvtl\"><div><p style=\"text-align: left;\">Author: Michael Mach Source: X, @1912212eth</p><p style=\"text-align: left;\">A single quarter's settlement of $11.9 trillion: USDC's size is approaching half of the US GDP.</p><p style=\"text-align: left;\">On February 25th, Circle announced its total revenue and reserve income for fiscal year 2025 at $2.7 billion, a 64% increase. After the announcement, CRCL surged from $61 to $83, marking its largest single-day gain since October 2nd of last year. The market voted with real money, acknowledging the significance of this financial report.</p><p style=\"text-align:center\"><img alt=\"1gLiunjtW0YpYxnY15JZIkp6Ov6BvJy523tbkhOJ.png\" src=\"https://img.jinse.com.cn/7435802_watermarknone.png\" title=\"7435802\"/></p><p style=\"text-align: left;\">It's worth noting that after reaching a high of $298 following its IPO last June, CRCL's stock price steadily declined, even falling to a historic low of $49.90 on February 5th. This strong rebound is, to some extent, a correction of the market's previously excessive pessimism.</p> ... USDC's circulating supply reached $75.3 billion by the end of 2025, a year-on-year increase of 72%. Let's look at the most crucial metric: USDC's circulating supply reached $75.3 billion by the end of the year, a year-on-year increase of 72%. What does this figure mean? Against the backdrop of a slowdown in the overall stablecoin market, Circle's market share actually expanded by 4.26 percentage points, reaching 28%. The logic behind this shift is simple—Tether's compliance controversies gave USDC an opportunity, while Circle's long-term investment in regulatory compliance is translating into market share. On-chain USDC trading volume reached $11.9 trillion in Q4, a staggering 247% year-over-year increase. This figure is almost half of the US GDP. While there is significant arbitrage and wash trading involved in on-chain transactions, the 247% growth rate still demonstrates the rapid increase in USDC's penetration as a settlement infrastructure. On the revenue side, total revenue in Q4 reached $770 million, a 77% year-over-year increase, exceeding the average analyst expectation of $748 million from FactSet. Reserve income reached $733 million, a 69% year-over-year increase, contributing the vast majority of revenue. Here's an explanation of the reserve income logic: Circle uses user-deposited USD to purchase low-risk assets such as short-term US Treasury bonds, earning interest rate differentials. The reserve return rate in Q4 was 3.8%, a 68 basis point decrease year-over-year, but the doubling of USDC circulation completely offset the impact of declining interest rates. What truly excited the market was the explosive growth in profits. Adjusted EBITDA reached $167 million, a staggering 412% year-over-year increase, far exceeding analysts' expectations of $130 million. The RLDC profit margin (revenue minus distribution costs) jumped from 30% to 40%, a full 10 percentage points increase. Economies of scale are beginning to emerge; the marginal cost of issuing one more USDC is rapidly decreasing. The financial report reveals several noteworthy business signals. First, there's the progress of the Arc public testnet. Over 100 institutions participated, achieving nearly 100% uptime, 0.5-second transaction finality, and an average of 2.3 million transactions per day. These figures may seem like technical parameters, but they reflect the real demand for on-chain settlement from traditional financial infrastructure. Visa announced that US issuers and acquirers can use USDC to settle with Visa, signifying USDC's penetration into the underlying layers of the traditional payment system. It's also worth mentioning that Circle mentioned in its report plans to launch the Arc mainnet within 2026. Secondly, there's the expansion of the Circle Payment Network (CPN). 55 financial institutions have registered, with an annualized transaction volume of $5.7 billion. This figure is still small, but the direction is crucial—Circle is transforming from a simple stablecoin issuer into a payment network operator; the potential of this business model is far greater than simply collecting interest spreads. Regarding the Euro stablecoin EURC, its circulating supply reached €310 million, a year-on-year increase of 284%. Demand for Euro stablecoins is being activated following the implementation of the MiCA regulatory framework. USYC (tokenized US Treasury bonds) assets reached $1.5 billion, a quarter-on-quarter increase of 111%, indicating increased institutional acceptance of on-chain yield products. The financial report wasn't all good news. For the full year, Circle recorded a net loss of $69.5 million, primarily due to $424 million in equity incentive expenses triggered by its IPO. Excluding these non-cash expenses, the full-year adjusted EBITDA was $582 million, a year-on-year increase of 104%. The reserve return rate has fallen from 4.1% to 3.8%, and this trend is likely to continue. According to the latest data from Polymarket, the probability of the Federal Reserve not cutting interest rates was 97% in March, 86% in April, and 46% in June. If the Federal Reserve chooses to cut rates again in June, Circle's interest rate spread income will inevitably be under pressure. The management's guidance for 2026 also reflects this—the revenue margin guidance, excluding distribution costs, is 38%-40%, essentially maintaining the status quo, indicating that the room for profit margin expansion may already be limited.</div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/5bc2db1f5f38ff3c66b28732db0f2831.jpg",
            "link": "https://www.coinlive.com/news/is-circle-whose-stock-price-surged-30-in-a-single",
            "pub_date": "2026-02-26 19:19:12",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 250253,
            "title": "Samsung Galaxy S26 Launches Its First “Agentic AI Phone.” What Does That Mean?",
            "description": "<div class=\"share___SVvtl\"><div><p>Samsung has unveiled the Galaxy S26 lineup, marketing it as the world’s first “agentic AI phone,” a device designed not just to answer prompts but to execute multi-step actions across apps on a user’s behalf.</p><p></p><p>At launch, Samsung is positioning the S26 as a turning point for mobile artificial intelligence — moving beyond reactive assistants toward proactive software agents capable of navigating apps, synthesizing information and completing tasks with minimal input.</p><p></p><h1>Gemini-powered agent takes control across apps</h1><p>At the center of the Galaxy S26 is a new implementation of Google’s Gemini, designed to function as an operating-level AI agent. </p><p></p><div class=\"media-wrap embed-wrap\"><div><blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\">Samsung announced that Galaxy AI will expand with multi-agent support and Perplexity integration on the upcoming S26 series. The update aims to enhance contextual understanding, real-time information retrieval, and smarter on-device AI experiences ahead of Galaxy Unpacked 2026. <a href=\"https://t.co/Fz2XHDl6cU\">pic.twitter.com/Fz2XHDl6cU</a></p>— EverImagineTech (@EverImagineTech) <a href=\"https://twitter.com/EverImagineTech/status/2025412240145605051?ref_src=twsrc%5Etfw\">February 22, 2026</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p></p><p>Rather than waiting for a command and returning a response, Gemini can open apps in background windows, move through interfaces and assemble multi-step workflows while the user continues using the phone.</p><p></p><p>During the product demonstration, Gemini parsed a busy family group chat discussing pizza orders, identified each person’s preferences, opened a food delivery app, built the cart and prepared checkout while waiitng for the user to give the final confirmation. </p><p></p><p>Hence the baseline is that the system does not complete payments without your final confirmation, maintaining a manual approval safeguard. At launch, the feature supports a limited list of major apps including food delivery, ride-hailing and retail platforms, rolling out first in the United States and South Korea as a preview release. </p><p></p><p>The shift is significant. For more than a decade, mobile AI assistants have largely been query-response tools. Samsung is now attempting to embed autonomous task execution directly into the smartphone operating layer, eliminating the need for repeated taps, app switching or voice commands.</p><p></p><h1>Multi-agent intelligence and AI-embedded hardware</h1><p>The Galaxy S26 does not rely on a single AI engine. Samsung is layering multiple agents to create what it describes as a collaborative AI stack. Alongside Gemini, the company has integrated Perplexity as a system-level research assistant capable of scanning open browser tabs and recent activity to synthesize answers without manual navigation.</p><p></p><div class=\"media-wrap embed-wrap\"><div><blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"ja\">🚨 Samsung が Perplexity への140億円投資でGoogle依存脱却を本格化<br/><br/>Galaxy S26からPerplexityをデフォルトAIに？この動きが示す重要なビジネス教訓について考えてみました。<br/><br/>多くの企業が陥る「一強依存」の罠<br/>・検索→Google一択 ・クラウド→AWS一択<br/>・AI→ChatGPT/Gemini一択… <a href=\"https://t.co/izafJxTW1W\">pic.twitter.com/izafJxTW1W</a></p>— 池田 朋弘 | ChatGPT最強の仕事術4万部突破！ (@pop_ikeda) <a href=\"https://twitter.com/pop_ikeda/status/1932362112195854537?ref_src=twsrc%5Etfw\">June 10, 2025</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p></p><p>Meanwhile, Bixby — Samsung’s long-standing assistant — has been rebuilt with contextual awareness. The assistant can interpret conversational cues such as eye strain and immediately surface relevant settings, or provide real-time information without redirecting users into separate apps.</p><p></p><p>Additional agent-driven features extend across the device.  For example, “now brief” proactively compiles daily schedules and surfaced reservations, even from notification history; while \"call screening” summarizes unknown callers before users answer. </p><p></p><p>The AI integration extends into imaging. The S26 Ultra supports 8K video recording using a new APV codec designed for near-lossless quality retention during editing. </p><p></p><div class=\"media-wrap embed-wrap\"><div><blockquote class=\"twitter-tweet\" data-media-max-width=\"560\"><p dir=\"ltr\" lang=\"en\">The camera quality and the AI features of this Samsung Galaxy S26 Ultra is unmatched chale 👌💥<a href=\"https://twitter.com/hashtag/GalaxyUnpacked?src=hash&amp;ref_src=twsrc%5Etfw\">#GalaxyUnpacked</a><a href=\"https://twitter.com/hashtag/WithGalaxy?src=hash&amp;ref_src=twsrc%5Etfw\">#WithGalaxy</a><a href=\"https://twitter.com/hashtag/SamsungGH?src=hash&amp;ref_src=twsrc%5Etfw\">#SamsungGH</a><a href=\"https://t.co/YzDZQITZwy\">pic.twitter.com/YzDZQITZwy</a></p>— Fabulous❤️ (@KingFabulo) <a href=\"https://twitter.com/KingFabulo/status/2026738611505475986?ref_src=twsrc%5Etfw\">February 25, 2026</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p></p><p>New features like “photo assist” allows users to generate missing visual elements through text prompts, while AI-driven image signal processing enhances selfies and improves low-light video clarity. The computational photography pipeline is tightly coupled with the device’s hardware architecture.</p><p></p><h1>Samsung stakes early claim in the agentic AI race</h1><p>Samsung’s move comes amid intensifying competition in mobile AI. While Apple has signaled upgrades to Siri and Google’s Pixel devices are expected to integrate similar Gemini capabilities, Samsung is first to broadly commercialize what it calls an “agentic” framework at scale.</p><p></p><p>The company is also positioning the S26 as proof that smartphones — rather than standalone AI gadgets — remain the natural home for advanced autonomous software. Recent AI hardware launches attempted to replace or supplement phones but struggled to deliver meaningful adoption.</p><p></p><p>Whether the “agentic AI phone” label endures will depend on how quickly Samsung expands app support and how reliably its agents execute complex tasks. But with the Galaxy S26, the company has made a clear assertion: the future of mobile computing is not just conversational AI — it is AI that acts.</p></div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/ae97747bfa2101799a458ec9b388fada.png",
            "link": "https://www.coinlive.com/news/samsung-galaxy-s26-launches-its-first-agentic-ai-phone-what",
            "pub_date": "2026-02-26 18:40:28",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 250251,
            "title": "Vitalik Buterin Sells More ETH Than Initially Planned, Total Sales Hit Nearly $35 Million",
            "description": "<div class=\"share___SVvtl\"><div><h2>Vitalik Buterin Navigates Ethereum Through A New Era Of Austerity</h2><p>The founder of Ethereum is currently reshaping his financial stake in the ecosystem he helped create.</p><p></p><p>Vitalik Buterin has moved a substantial portion of his personal ETH holdings throughout February 2026, a move that coincides with a broader strategic shift for the Ethereum Foundation.</p><p></p><p>While the market often reacts with nerves when a founder sells, this particular sequence of transactions appears to be a calculated effort to fund a leaner, more focused future for the network.</p><p></p><p>By shifting from his original 700,000 ETH down to approximately 224,000 ETH over the years, Buterin is increasingly positioning himself as a participant rather than just a majority holder.</p><p></p><h2>How Much ETH Did Vitalik Buterin Actually Sell</h2><p>Recent on-chain data from Arkham and Lookonchain reveals that the scale of these sales has slightly exceeded initial expectations.</p><p></p><p>While Buterin originally disclosed a plan to withdraw 16,384 ETH on 30 January 2025, the total has since climbed to 17,196 ETH.</p><p></p><div class=\"media-wrap embed-wrap\"><div><blockquote align=\"center\" class=\"twitter-tweet\" data-dnt=\"true\"><p dir=\"ltr\" lang=\"en\">Vitalik (<a href=\"https://twitter.com/VitalikButerin?ref_src=twsrc%5Etfw\">@VitalikButerin</a>) has now sold 16,420 <a href=\"https://twitter.com/search?q=%24ETH&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$ETH</a> for $32.84M at $2,000, exceeding the originally planned 16,384 <a href=\"https://twitter.com/search?q=%24ETH&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$ETH</a>.<br/><br/>The move aligns with the Ethereum Foundation’s “mild austerity” strategy - redirecting funds toward security, privacy, core R&amp;D, and long-term ecosystem… <a href=\"https://t.co/Xqa3KIv1FH\">https://t.co/Xqa3KIv1FH</a><a href=\"https://t.co/8pVroM76ZZ\">pic.twitter.com/8pVroM76ZZ</a></p>— Onchain Lens (@OnchainLens) <a href=\"https://twitter.com/OnchainLens/status/2026855661792096763?ref_src=twsrc%5Etfw\">February 26, 2026</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p></p><p>This represents a 4.9% increase over the intended target, with the total value of these transactions reaching roughly $34.96 million.</p><p></p><p>Buterin described that initial withdrawal as his \"own share of the austerity\" as the Foundation prioritises long-term sustainability.</p><p></p><div class=\"media-wrap embed-wrap\"><div><blockquote align=\"center\" class=\"twitter-tweet\" data-dnt=\"true\"><p dir=\"ltr\" lang=\"en\">In these five years, the Ethereum Foundation is entering a period of mild austerity, in order to be able to simultaneously meet two goals:<br/><br/>1. Deliver on an aggressive roadmap that ensures Ethereum's status as a performant and scalable world computer that does not compromise on…</p>— vitalik.eth (@VitalikButerin) <a href=\"https://twitter.com/VitalikButerin/status/2017145595819933745?ref_src=twsrc%5Etfw\">January 30, 2026</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p></p><p>The funds are not merely being liquidated for cash; they are being converted into various stablecoins like USDTB, GHO, PYUSD, and EUROC via the Cow Protocol, while some assets remain in DeFi protocols like Aave to accrue reserves.</p><p></p><h2>Is The Ethereum Foundation Running Out Of Money</h2><p>The context behind these sales is a period of \"mild austerity\" for the Ethereum Foundation.</p><p></p><p>Currently holding around 172,000 ETH, the Foundation is tightening its belt to ensure it can support core protocol development for years to come.</p><p></p><div class=\"media-wrap image-wrap\"><img src=\"https://image.coinlive.com/cryptotwits-static/7b72380aceef931f6a1ee5cad4c00c2a.png\"/></div><p style=\"text-align:center;\"><em><span style=\"color:#999999\">Source: <a href=\"https://intel.arkm.com/explorer/entity/ethereum-foundation\" target=\"\">Arkham</a></span></em></p><p></p><p>Buterin noted that the capital would be used to build an \"open-source, secure and verifiable full stack\" of software and hardware.</p><p></p><p>This ambitious goal spans several sectors, including finance, communication, governance, operating systems, and even biotech applications.</p><p></p><p>Despite the sales, the Foundation continues to issue smaller grants, ensuring that affiliated projects do not lose momentum during this transition.</p><p></p><h2>Why Did The Ethereum Price Drop During The Sell Off</h2><p>Market observers have noted a rocky relationship between Buterin’s wallet activity and the token’s market value.</p><p></p><p>Over the last month, ETH has faced a 37% decline, struggling to maintain its footing as staking returns compressed to 2.8%.</p><p></p><p>During one specific sale of 6,958 ETH, the price tumbled 22.7% from $2,360 to $1,825.</p><p></p><div class=\"media-wrap embed-wrap\"><div><blockquote align=\"center\" class=\"twitter-tweet\" data-dnt=\"true\"><p dir=\"ltr\" lang=\"fr\">Ethereum ETH Current Price:<br/>$1,825.89<br/><br/>1h: -0.46%<br/>24h: -2.57%<br/>7d: -7.69%<br/><br/>30d: -37.72%<br/>60d: -38.66%<br/>90d: -37.83%<a href=\"https://twitter.com/hashtag/eth?src=hash&amp;ref_src=twsrc%5Etfw\">#eth</a><a href=\"https://twitter.com/search?q=%24ETH&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$ETH</a><a href=\"https://twitter.com/hashtag/ethereum?src=hash&amp;ref_src=twsrc%5Etfw\">#ethereum</a></p>— aWebAnalysis | Crypto (@aWebAnalysis) <a href=\"https://twitter.com/aWebAnalysis/status/2026180810211250418?ref_src=twsrc%5Etfw\">February 24, 2026</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p></p><p>Another sale of 1,869 ETH saw a 5.7% dip.</p><p></p><p>However, the most recent tranche of sales showed a break in this trend, occurring as the price recovered to $2,059.05.</p><p></p><p>While some institutional holders like ETHZilla are reportedly pivotting toward RWA tokenization, the general consensus is that Buterin’s individual sales are not large enough to dictate the market’s long-term direction.</p><p></p><div class=\"media-wrap embed-wrap\"><div><blockquote align=\"center\" class=\"twitter-tweet\" data-dnt=\"true\"><p dir=\"ltr\" lang=\"en\">ETHZilla pivoted from biotech to accumulating <a href=\"https://twitter.com/search?q=%24ETH&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$ETH</a> in July 2025 during the crypto treasury boom.<br/><br/>When <a href=\"https://twitter.com/search?q=%24ETH&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$ETH</a> crashed, its stock collapsed 96%.<br/><br/>The company has now exited the crypto hoarding strategy, rebranded to Forum Markets, and shifted to RWA tokenization - starting with two… <a href=\"https://t.co/rF9Pglv8hQ\">pic.twitter.com/rF9Pglv8hQ</a></p>— Zev (@Zevweb3) <a href=\"https://twitter.com/Zevweb3/status/2026937959312986608?ref_src=twsrc%5Etfw\">February 26, 2026</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p></p><h2>Will The Strawmap Roadmap Make Ethereum Faster Than Solana</h2><p>To combat the perception of a slowing ecosystem, the Foundation recently introduced \"Strawmap,\" a technical roadmap designed to make the L1 layer significantly faster and more competitive.</p><p></p><p>The plan focuses on five pillars, including \"Gigagas\" for 10,000 transactions per second and \"Teragas\" for 10 million transactions via data availability sampling.</p><p></p><div class=\"media-wrap embed-wrap\"><div><blockquote align=\"center\" class=\"twitter-tweet\" data-dnt=\"true\"><p dir=\"ltr\" lang=\"en\">Introducing strawmap, a strawman roadmap by EF Protocol.<br/><br/>Believe in something. Believe in an Ethereum strawmap.<br/><br/>Who is this for?<br/><br/>The document, available at strawmap[.]org, is intended for advanced readers. It is a dense and technical resource primarily for researchers,… <a href=\"https://t.co/gIZh5I8Not\">pic.twitter.com/gIZh5I8Not</a></p>— Justin Drake (@drakefjustin) <a href=\"https://twitter.com/drakefjustin/status/2026755969540108659?ref_src=twsrc%5Etfw\">February 25, 2026</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p></p><p>The ultimate goal is to achieve \"finality in seconds,\" a move that would allow Ethereum to compete directly with high-speed networks like Solana.</p><p></p><p>As the network looks toward quantum-proofing and privacy-shielded transfers, these sales by Buterin appear to be the fuel intended to turn these technical discussions into a functional reality.</p></div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/41bfbbdf18d17130b01d54ee1d94036a.jpeg",
            "link": "https://www.coinlive.com/news/vitalik-buterin-sells-more-eth-than-initially-planned-total-sales",
            "pub_date": "2026-02-26 18:34:07",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 250244,
            "title": "What's wrong with Ethereum?",
            "description": "<div class=\"share___SVvtl\"><div><p style=\"text-align: left;\">Author: Pavel Paramonov &amp; Translation: Plain Language Blockchain</p><p style=\"text-align: left;\">This article is primarily inspired by Vitalik's recent tweets about the current state and changes in the market. While the entire market is declining, it's difficult to pinpoint a specific individual, and I don't intend to do so.</p><p style=\"text-align:center\"><img src=\"https://img.jinse.com.cn/7435790_watermarknone.png\"/></p><p style=\"text-align: left;\">I have worked with many Ethereum teams and invested in multiple protocols built on Ethereum on behalf of venture funds. In general, I used to be a huge fan of Ethereum and EVM-related things.</p><p style=\"text-align: left;\">Unfortunately, I can no longer say the same thing, because I feel that Ethereum doesn't know where it's headed (and many others share this sentiment).</p><p style=\"text-align: left;\"> I don't want to discuss ETH's price movements, but I can't ignore the fact that the world's second-largest cryptocurrency has been extremely volatile. Regardless of global market trends, ETH behaves more like a stablecoin that's going off-target. This essay aims to explore what has happened to Ethereum over the past few years and why many are losing hope or have already lost hope. Ethereum didn't lose to Solana or other competitors; it lost to itself. When Ethereum introduced its Rollup-centric roadmap, almost everyone was excited. The promise at the time was that Rollups (and Validiums) would handle scaling, end-user transactions would occur on Rollups, and Ethereum would act as a validation layer—focusing on being the L1 for Rollups, rather than a direct-to-user L1. Developing Rollups is much faster and easier than developing L1, so the vision of \"thousands upon thousands of Rollups\" seems very likely and optimistic. Where did things go wrong? It turns out, everything went wrong. Endless arguments, ideology overriding needs, ongoing infighting within the community, an identity crisis, and abandoning the vision of \"centralized aggregation\" too late. Everything that could go wrong went wrong. Most of the community initially considered Max Resnick a completely incompetent villain, only to find he was right about almost everything. During his time at Consensys, Max offered numerous suggestions on how Ethereum should move forward, but these were met with criticism and little support. The most foolish peak was when the entire industry started debating whether a certain L2 layer was truly \"Ethereum,\" for example: Viewpoint A: \"Base is an extension of Ethereum; we've made huge contributions to the Ethereum ecosystem.\" Viewpoint B: \"Base is not an extension of Ethereum; it's an independent entity.\" What the hell are we even discussing? How can this kind of dialogue guide Ethereum and its ecosystem towards a better future? Why are people seriously debating what constitutes core Ethereum and what it isn't? Don't we have more important issues to address? This ideological debate isn't a debate at all; it's a confrontation between two small circles trying to prove who's right. We don't need internal friction (PvP); we need external expansion (PvE). We need to understand that this isn't a confrontation between us, but rather a shared understanding of our problems and future. Unfortunately, many people prefer the pursuit of fleeting pleasure to considering that their opinions might be wrong. Technological ideology takes precedence over user needs. Based Rollups, Booster Rollups, Native Rollups, Gigagas Rollups, Keystore Rollups... Which is better, what will the future hold, and how do they connect? \"This type is the future,\" \"No, that type is the future.\" All these discussions... result in Arbitrum and Base continuing to dominate. Technological superiority brings advantages, but these advantages disappear when you compare \"apples and pears\" or \"oranges and tangerines.\" They are too similar, so similar that users simply don't care. Nobody outside the bubble cares. One more pre-compilation, one less—you won't win. \"Oh, we are actually 'Ethereum-aligned,' we have an advantage, we are very close to Ethereum, we embody its core values, and users will choose us.\" I want to ask, which values? And which users will choose you? @0xFacet became the first Rollup to reach Stage 2, they are a model of Ethereum alignment. But where are they? Where are their users, developers, tech KOLs, and those who support the Ethereum ecosystem and alignment? How many of you have heard of Facet? How many applications are available on Facet? I have no problem with Facet personally, I respect its founders. But where are those who keep saying we need more Stage 2 Rollups? I don't know, and you don't know either. Financial incentives are far more powerful than technical incentives. I used to be a fan of Taiko, especially their research on Based Rollups. This model has many advantages: stronger censorship resistance, neutrality, no risk of sequencer downtime, and L1 validators earning more money. Where's the trap? The trap lies in the finances behind the model. You can't force people to give up income for so-called \"alignment.\" Arbitrum promised centralized sequencers, as did Scroll, Linea, zkSync, and Optimism. Where are they? Where are those sequencers? Every Rollup team writes in their documentation: \"We currently use centralized sequencers, but have a strong desire for decentralization in the future.\" Almost no one delivers. Metis delivered, but luckily or unfortunately, people didn't care about Metis. Did I think they over-promised to pander to influential ETH purists (Maxis)? Yes. Did I think they really wanted a decentralized sequencer? Certainly, but it doesn't make business sense. Coinbase (Base) has a legal obligation to make as much money as possible and create value for the company. The same goes for other teams; why would you kill your own revenue stream? It simply doesn't make sense. Only about 5% of Base's revenue flows back to Ethereum. Rollups have never been an extension of Ethereum. Taiko had days when it paid Ethereum more in ordering fees than it collected from user transactions. Clearly, companies like Taiko have many other expenses besides paying Ethereum. Based Rollups or any vision of “Ethereum alignment” are only possible if the team is willing to forgo revenue. I haven't underestimated the importance of decentralization, security, and permissionlessness. But when your sole objective is “ideological correctness” rather than “user-centricity,” it all loses its meaning. Unsurprisingly, this weakness and the promise of “Ethereum alignment” have attracted a large number of grifters. Summarizing the consequences of centralized roadmaps: Eclipse, Movement, Blast, Gasp (Mangata), Mantra: These protocols were never intended for the long-term future. It's easy to hide behind masks of “Ethereum alignment,” making Ethereum better, and introducing SVM to Ethereum. They've all been, to some extent, “rugged.” All Rollups realize their tokens are practically useless because they pay fees with ETH while their tokens have almost no utility. Speculators realize you can create massive hype around a Rollup's central narrative and then cash out by dumping worthless tokens on retail investors. Ethereum has never acknowledged Polygon as a true L2, despite their significant role in securing ETH's value. If you believe Rollups are an extension of Ethereum's \"culture,\" why not acknowledge a project so closely tied to Ethereum's security and usability? Polygon was crucial to Ethereum during the 2021 bull market, contributing significantly to ETH's growth as an asset. But yes, it's not L2 and doesn't deserve the Ethereum community's praise. If Polygon were L1, its valuation would be much higher. Even Paradigm, a top VC that has arguably contributed the most to the Ethereum ecosystem and even developed its own L2 (Ithaca), has shifted its focus to collaborating with Stripe on L1 (Tempo). I believe that when your biggest believer starts building your competitors, something is definitely wrong. The Ethereum Foundation (EF) lacks direction. While Ethereum is technically decentralized, its culture is highly centralized around Vitalik. Ethereum's internal circles are real. As people say, to succeed, all you need to do is get the attention of people around Vitalik and a few influential VCs. I'm not saying you have to agree with everything Vitalik says, but his views essentially define what's good and bad for Ethereum, and you can't compete with that. First, there's ultrasound money. Due to EIP-1559 and the merger, ETH's economic model became deflationary, suggesting it would be a better store of value than Bitcoin. But in 2024, ETH's annual inflation rate turned positive. So the vision of ultrasound money only lasted 3 years? That's not enough to become a store of value. This narrative is dead, and it was never true, because ETH wasn't designed to be a store of value; that's Bitcoin's mission, and you can't compete with that. Then, Ethereum couldn't decide whether its token was a commodity (inapplicable due to dynamic supply changes and staking mechanisms) or more like a tech stock (inapplicable because revenue wasn't sufficient to support a tech company's valuation). There's also the argument that ETH isn't money at all. What's going on? We need to choose a direction. Ethereum can't be multiple things at once—you either have a globally unified definition or you'll fall behind. Financial incentives…missing again. I still can't imagine a lead engineer like Péter Szilágyi receiving only about $100,000 a year for his contributions to Ethereum. This contributor, who has been here from the very beginning and helped Ethereum reach a market capitalization of $450 billion from scratch, received a salary of only 0.0001% of the market capitalization. The most influential and successful protocol in crypto history (second only to Bitcoin) didn't offer any incentives or equity. It's easy to justify hiding behind the creed of decentralization, open source, and permissionless principles: \"We're not in it for the money, we're in it for progress.\" But you have to incentivize even the most loyal warriors, or they'll leave or take on private projects. Péter left, Danny Ryan left, and Dankrad Feist went straight to Tempo. Justin Drake and Dankrad accepted advisory positions at EigenLayer in 2024 and received token allocations, resulting in community resentment. These people at EF, earning a \"peanut\" salary (compared to FAANG companies and AI labs), are being attacked simply for making money and helping a protocol that wants to make Ethereum better (even if it's not Ethereum itself). Are you idiots? Sometimes I feel that if you're an honest, hardworking person on Ethereum, you're deprived of the right to earn money and expected to work like a slave to gain \"approval\" from Ethereum. EF has been dumping ETH to fund various operations and research. But perhaps they should pay their researchers enough first? Zero tolerance for adaptability. \"Day 1. Ethereum will win. The decentralized blockchain with the highest uptime.\" We hear this every day, just like we hear Ethereum's excuses every day. Yes, Ethereum is expensive and slow. But we have Rollups, use Rollups, Rollups are Ethereum! Yes, ETH prices lag. But Ethereum has the largest developer ecosystem, we have a solid foundation, and demand will follow. Ethereum is the most decentralized! Solana is garbage, they lack client diversity. Ethereum is 100% uptime! Solana is garbage, it has crashed several times. Ethereum's network activity is lower than Solana's. That's because Solana's activity is mostly spam and smurfs. We are an ethical chain! You know, it makes me happy to see people realize their mistakes; it takes courage. But I think it might be too late. Ethereum has once again found the path it has needed to take in the long run, but progress remains slow. EF has indeed seen some changes recently: new leadership, treasury transparency, R&amp;D restructuring, and so on. EF has started hiring young and talented DevRels and marketing talent like Abbas Khan, Binji, and Lou3e. But change must be fast. Ethereum must sprint to prove everyone wrong. Let's see if, after these reforms and changes at EF, we can see Ethereum become an exciting object again, rather than an object of blind, delusional faith and disappointment. Same excuses, same answers, same reactions, year after year. Everything except Ethereum and Rollups is garbage. If Ethereum underperforms on any metric, we say, \"This is only day one,\" we know what we're doing, and there's no better place than Ethereum. Everyone's tired of the community's endless excuses. Ethereum feels like a wealthy old lady who struggles to walk, refuses any innovation, but distributes her wealth to her parasitic descendants. Change. Just hours before I finished writing this, Vitalik tweeted that the centralized roadmap was a failure and they needed to find another path and scale L1. You know, it's gratifying to see people realize their mistakes; it takes courage. But I think it might be too late. Ethereum has once again found the path it needs to take in the long run, but progress remains slow. EF has indeed undergone some changes recently: a new leadership, increased treasury transparency, R&amp;D restructuring, and more. EF has begun hiring young and talented DevRels and marketing professionals like Abbas Khan, Binji, and Lou3e. But change must be swift. Ethereum must sprint ahead to prove everyone wrong. Let's see if, after these reforms and changes at EF, we can see Ethereum once again become an exciting object of study, rather than an object of blind, delusional faith and disappointment.</p></div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/2522cbcde4123404eef5960a428d96d6.jpg",
            "link": "https://www.coinlive.com/news/what-s-wrong-with-ethereum",
            "pub_date": "2026-02-26 18:03:10",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 250230,
            "title": "The cases of Chen Zhi of Prince Group and Zhao Changpeng of Binance have greatly benefited the United States.",
            "description": "<div class=\"share___SVvtl\"><div><p style=\"text-align: left;\"><span leaf=\"\"><span text=\"\">Chen Zhi, the head of a cross-border gambling and fraud crime syndicate, was extradited from Cambodia to China earlier this year. On February 26, 2026, the WeChat official account of the National Computer Virus Emergency Response Center published an article titled \"Ready Player One—An In-Depth Analysis of the Global Virtual Currency Asset Harvesting Operation Under the US Technological Hegemony,\" revealing that the US seized approximately 127,000 Bitcoins in the Chen Zhi case, profiting $15 billion.</span></span></p><p style=\"text-align: left;\"><span leaf=\"\"><span text=\"\">The article lists four authors: the National Computer Virus Emergency Response Center, the National Engineering Laboratory for Computer Virus Prevention and Control Technology, 360 Digital Security Group, and Antiy Labs Technology Group Co., Ltd. ...&gt;</span></span></p> According to statistics from CoinGecko, a well-known cryptocurrency tracking and research institution, as of the end of January 2026, the total market capitalization of global cryptocurrency assets was approximately US$2.73 trillion, of which Bitcoin's total market capitalization reached approximately US$1.57 trillion. During the same period, the value of gold reserves held by central banks worldwide was approximately US$5.83 trillion. This means that the market capitalization of cryptocurrency assets has reached about 47% of the total market capitalization of global official gold reserves, approaching half, becoming an undeniable new type of financial asset. A few countries have even recognized Bitcoin as legal tender. The article points out that cryptocurrency assets, as a new type of wealth carrier in the digital age, have become a significant target for the US economy. Leveraging its technological advantages and rule-making power, and with the cooperation of its allies, the United States has incorporated global virtual currency asset transactions into its own regulatory framework and cross-border law enforcement system based on long-arm jurisdiction. Through civil confiscation, criminal prosecution, and fines, it has massively seized overseas virtual currency assets. According to incomplete statistics, from 2022 to 2025, the United States seized over $30 billion worth of global virtual currency assets through various cases. The Chen Zhi case alone accounted for $15 billion in seized assets, representing 50% of the total. The article argues that this unilateral harvesting not only disrupts the law enforcement activities of other countries, causing secondary losses to victims, but also interferes with the global flow of virtual currency assets, undermines the financial stability of emerging market countries, and ultimately aims to consolidate the dollar's hegemonic position in the digital finance sector. Public information shows that Chen Zhi was born in Lianjiang County, Fujian Province in 1987 and also holds British and Cambodian citizenship. According to the website of DW Capital Group, a Singapore-based fund management company in which he personally invests, Chen Zhi is described as \"a young business prodigy.\" His first entrepreneurial venture was investing in a small internet cafe in Fujian Province. In 2011, Chen Zhi entered the Cambodian real estate market and subsequently founded the Prince Group. Previous media reports indicated that the Prince Group, located in Phnom Penh, the capital of Cambodia, is one of Cambodia's largest conglomerates. It claims to operate over 100 business entities in more than 30 countries, with businesses covering real estate development, financial services, tourism, and consumer services. In reality, the Prince Group is one of Asia's largest transnational criminal organizations, operating 10 telecom fraud industrial parks in Cambodia. The U.S. Treasury Department has designated the group as a transnational criminal organization and imposed sanctions on more than 100 related individuals and entities. The article above describes the Chen Zhi and Zhao Changpeng cases as two typical examples of the U.S. using its technological hegemony to harvest global virtual assets. The two cases fully demonstrate the U.S.'s closed-loop harvesting process of \"technological breakthrough—legal support—institutional execution,\" with its process logic and technical details exhibiting distinct hegemonic characteristics. In October 2025, the U.S. Attorney's Office for the Eastern District of New York announced criminal charges against Chen Zhi, founder of the Cambodian Prince Group, involving charges of telecommunications fraud and money laundering. Simultaneously, it announced the confiscation of approximately 127,000 bitcoins under his control, valued at approximately $15 billion at the time, setting a record for the largest virtual asset confiscation in U.S. judicial history. The article states that the US Department of Justice, under the guise of \"combating transnational telecom fraud and money laundering,\" hastily pieced together so-called evidence, evaded the original source, and \"legalized\" the confiscation of Bitcoin stolen from the Prince Group in 2020 through state-sponsored hacking. This is a typical case of the US exploiting technological vulnerabilities to carry out cross-border asset plunder and exert technological bullying—a classic example of \"double-crossing.\" The \"Technical Source Analysis Report on the LuBian Mining Pool Hacking and Stealing of a Huge Amount of Bitcoin,\" released by the National Computer Virus Emergency Response Center in November 2025, has already revealed this core truth through technical evidence: a US state-sponsored hacking organization precisely cracked the underlying encryption vulnerability, attacked the LuBian mining pool's cold wallet, and transferred assets, demonstrating the US's mature state-sponsored virtual currency asset theft capabilities. This clearly contradicts the US government's claim that \"Bitcoin has never been hacked,\" or its true meaning is that \"Bitcoin has never been hacked by hackers outside the US government.\" In another case, from 2023 to 2025, the United States pursued both civil and criminal charges against Binance, a well-known international cryptocurrency exchange, and its founder, Changpeng Zhao. The case ultimately ended with Binance paying a $4.35 billion fine (including $2.7 billion in confiscation of illegal gains, $1.35 billion in civil penalties, and $150 million in personal fines), and Changpeng Zhao signing a plea agreement and being pardoned. This case is another typical example of the United States using judicial hegemony and technological surveillance to force global virtual asset platforms to comply with its regulatory rules, thereby achieving economic exploitation and the export of its rules. The article points out that the above cases demonstrate that for a large number of fraud victims, it's a case of the mantis stalking the cicada, unaware of the oriole behind; the US's indulgence of telecom fraud and the fact that the vast majority of the huge profits it has seized through technological hegemony have not been returned to the victims, effectively constituting indirect plunder of other countries' assets. In fact, this model not only applies to the virtual currency asset sector but is also a common paradigm used by the US to infringe upon global interests through its technological hegemony. Clearly, the successful practices of cases like Chen Zhi's have given the US government sufficient confidence to fully control the global virtual currency market and have become an important driving force for the US government to establish a national strategic reserve of virtual currency assets represented by Bitcoin.</div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/802b904d3bdf3e1e15bc1af9b6615e74.jpg",
            "link": "https://www.coinlive.com/news/the-cases-of-chen-zhi-of-prince-group-and-zhao",
            "pub_date": "2026-02-26 17:14:01",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 250228,
            "title": "Crypto Market Macro Research Report: Crypto Asset Repricing Amid Liquidity Retreat",
            "description": "<div class=\"share___SVvtl\"><div><h2 style=\"text-align: left;\">Summary</h2><p style=\"text-align: left;\">In the first quarter of 2026, the crypto market experienced a historic deleveraging storm. Bitcoin retreated by more than 40% from its highs, Ethereum fell even more sharply, and altcoins generally halved in value. This round of crashes was not simply caused by cooling market sentiment or regulatory rumors; it was the result of the convergence of three factors tightening liquidity: large-scale unwinding of yen carry trades, the US Treasury's TGA account reconstruction withdrawing funds from the market, and a systemic increase in margin requirements in the derivatives market. These factors, combined with the crypto market's own high leverage structure and valuation bubble, triggered a stampede-like clearing. Looking ahead, the crypto market has moved beyond the \"liquidity-driven\" extensive growth phase and entered a new normal dominated by macroeconomic factors. Against the backdrop of an unclear Federal Reserve policy path and the contraction of global central bank balance sheets, crypto assets will face continued repricing pressure.</p> I. Historically High US Stock Valuations: The \"Ceiling Effect\" of Risk Asset Pricing When analyzing the cryptocurrency market trend, an undeniable macroeconomic backdrop is that US stock valuations are at historically high levels. As the \"pricing anchor\" for global risk assets, the valuation level of US stocks not only reflects market expectations for US corporate profits but also profoundly influences the valuation ceiling of the cryptocurrency market through asset price comparisons, investor risk appetite, and global capital flows. Multiple indicators confirm the current high valuation of US stocks. The Buffett Indicator shows that the ratio of total stock market capitalization to GDP has climbed to a historically extreme high of 230%, far exceeding the levels before the 2000 dot-com bubble and the 2007 financial crisis. The S&amp;P 500's 12-month forward P/E ratio is 22.0 times, significantly higher than the 30-year historical average of 17.1 times, and close to the 25.2 times during the dot-com bubble. The Shiller cyclically adjusted price-to-earnings ratio is approximately 38, second only to 44 in 2000. The price-to-sales ratio has exceeded 3.0, reaching a historical high. These indicators collectively point to one conclusion: US stocks are significantly overvalued. The high valuation of US stocks is transmitted to the crypto market through various mechanisms. From the perspective of asset valuation effects, when US stock valuations are at historical highs, it means that their expected future returns are declining. Rational investors will reassess the allocation ratio of all risky assets, and crypto assets, as \"marginal risk assets\" with higher volatility, are often the first to be reduced. From the perspective of Federal Reserve policy constraints, the high valuation of US stocks presents the Fed with a dilemma, limiting its room for easing and potentially leading to a longer period of hawkishness than the market expects, which is depressing for all risk assets. From the perspective of profit-taking, after years of gains, institutional investors are generally overweight in US stocks. When valuations reach extreme levels, they will systematically reduce their risk exposure, typically by selling the most appreciating and liquid assets—including Bitcoin. From a risk sentiment perspective, as a bellwether for global risk assets, the high valuation of US stocks will trigger investor wariness towards all assets with excessive gains and difficult-to-quantify valuations; crypto assets are most vulnerable to being dumped. Looking back at history, any valuation reaching current levels has ultimately ended in a painful mean reversion. The lessons of 1929, 2000, and 2007 are still fresh in our minds. The current uniqueness of US stock valuations lies in the fact that they are a direct product of the longest and largest-scale experiment in loose monetary policy over the past 15 years. When these policies begin to be withdrawn, and valuations are at historical highs, the reversion process may be more severe than before. For the crypto market, this means that even if the fundamentals of the crypto industry itself continue to improve, valuation suppression at the macro level will remain a significant obstacle for the next 1-2 years. Only when US stock valuations return to a reasonable range through time or price adjustments can the crypto market truly begin a new, healthy upward cycle. <h2 style=\"text-align: left;\">II. Yen Carry Trade Unwinding: The \"Invisible Pump\" of Global Liquidity</h2><p style=\"text-align: left;\">The reversal of the Yen Carry Trade was the trigger for this round of crypto market crash and the most crucial macroeconomic driver. For a long time, the Bank of Japan's zero-interest-rate policy has made the yen the currency with the lowest global financing cost. International investors have borrowed yen on a large scale, converted it into US dollars or other high-interest currencies, and invested in high-yield assets globally—including highly volatile cryptocurrencies.</p><p style=\"text-align: left;\"> In early 2026, the underlying logic of this arbitrage model began to falter. As inflationary pressures emerged in Japan, market expectations for the Bank of Japan to exit its negative interest rate policy surged. Japanese government bond yields jumped multiple times, with the 10-year yield breaking through 1.2%, reaching a multi-year high. This change directly compressed the interest rate differential between the yen and the dollar: when the cost of borrowing yen rises, while the expected return on dollar assets remains unchanged or even declines, the attractiveness of arbitrage trading decreases dramatically. Even more critically, when the yen begins to appreciate (the USD/JPY exchange rate falls from above 150 to the 140 range), arbitrage traders not only face narrowing interest rate differentials but also incur exchange rate losses. In this situation, the most rational choice is to close out positions: sell previously held overseas assets (including crypto assets such as Bitcoin and Ethereum) and exchange them for yen to repay loans. The crypto market's 24/7 trading and high liquidity make it a prime target for arbitrage traders to sell off their holdings. Data clearly shows that during the few trading days of rapid yen appreciation in mid-February, Bitcoin and yen exchange rates exhibited a high degree of negative correlation, a typical characteristic of arbitrage position closing. It is worth noting that the scale of yen arbitrage trading is estimated at trillions of dollars, and its closing process is often continuous. As long as the Japan-US interest rate differential does not widen again and the yen's appreciation trend does not reverse, this \"pump\" will continue to draw funds from global risk asset markets. For the crypto market, which relies on incremental funds, this is undoubtedly a devastating blow. III. TGA Account Reconstruction and Treasury Issuance: Liquidity Siphoning by Fiscal Policy If yen carry trade represents international liquidity tightening, then changes in the balance of the US Treasury's General Account (TGA) represent a direct drain on liquidity within the dollar system. The TGA account is essentially the Treasury's \"wallet\": when the Treasury increases its TGA balance by issuing treasury bonds or collecting taxes, it means funds flow from the commercial banking system into the Treasury's account, leading to a decrease in bank reserves and tightening market liquidity; conversely, when the Treasury spends (such as paying government contracts, social security, etc.), funds flow back into the market, increasing liquidity. From February to March 2026, the market is facing a rapid reconstruction period for the TGA balance. According to the financing plan announced by the US Treasury, the TGA balance target for the end of March is maintained at $850 billion, and it will reach a peak of approximately $1.025 trillion in the April tax season. This means that the Treasury Department will withdraw nearly $200 billion from the financial system in just two months. Meanwhile, to replenish the TGA and finance the fiscal deficit, the Treasury announced a large-scale quarterly refinancing plan in early February, with bond issuance exceeding market expectations. This combination of \"bond issuance + increasing the TGA balance\" directly led to a continuous decline in bank reserves. For the crypto market, the transmission mechanism is more indirect but equally devastating: reduced bank reserves → financial institutions tightening credit → decreased financing capacity of hedge funds and market makers → forced reduction of risk exposure → crypto assets facing selling pressure. Stablecoin issuers' reserve assets are mainly US Treasury bonds; the TGA reconstruction has led to increased volatility in US Treasury yields, indirectly affecting the redemption pressure and liquidity support capacity of stablecoins. Historically, sharp changes in the TGA balance are often highly correlated with the price trends of risky assets. In early 2021, when the TGA balance rapidly declined (due to fiscal spending), Bitcoin experienced a bull market surge; conversely, the TGA rebuilding process in early 2026 corresponded to a sustained decline and eventual collapse in the crypto market. This is not a coincidence, but rather an inevitable reflection of the liquidity cycle. </p><h2 style=\"text-align: left;\">IV. Margin Increases and Derivatives Deleveraging: Forced Liquidation at the Exchange Level</h2><p style=\"text-align: left;\">Besides the tightening of liquidity at the macro level, the fragility of the crypto market's derivatives structure itself was a significant amplifier of the crash. In early February, as the gold and silver markets experienced extreme volatility, the Chicago Mercantile Exchange (CME) repeatedly raised margin requirements for gold and silver futures. Although this measure directly targeted the precious metals market, its chain reaction quickly spread to the crypto market. </p><p style=\"text-align: left;\">Firstly, as the world's most important derivatives exchange, the CME's margin adjustments have a demonstrative effect.</p><p style=\"text-align: left;\"> After observing increased market volatility, risk control departments of major cryptocurrency exchanges followed suit by raising margin requirements and lowering leverage limits for perpetual contracts and futures. This effectively forced deleveraging for the cryptocurrency market, which heavily relies on leveraged trading. The forced liquidation of numerous high-leverage positions triggered further price declines, leading to more liquidations and a negative spiral. Secondly, the cryptocurrency market shares a common bullish group with the precious metals market—macro hedge funds and trend traders. When these institutions suffer losses in the precious metals market due to margin increases, they often need to sell other assets (including crypto assets) to replenish margin or cover losses. This cross-asset risk liquidation further exacerbates selling pressure in the cryptocurrency market. More importantly, during this crash, the Bitcoin-Ethereum futures premium quickly turned negative (forward discount), and the perpetual contract funding rate remained negative, indicating that the market has shifted from bullish to bearish dominance. When funding rates are negative for an extended period, it means that long positions not only suffer losses from price declines but also have to pay funding fees to short positions. This further weakens the willingness of long positions to hold and prolongs the market's bottom-finding process. Historically, only when funding rates return to neutral or even positive and futures premiums recover can the market truly stabilize. V. The Structure of the Crypto Market: The Dual Vulnerability of High Valuation and Liquidity Dependence Against the backdrop of tightening macro liquidity, the high valuation and high leverage characteristics of the crypto market amplified the severity of the decline. Although crypto assets do not have a traditional price-to-earnings ratio valuation, we can assess their valuation levels through multiple dimensions: First, Bitcoin's market capitalization share. Before this crash, Bitcoin's market capitalization share once fell below 40%, with a large influx of funds into various altcoins and DeFi tokens. This is a typical characteristic of the late bull market—funds chasing high-risk, high-return tail assets rather than leading assets. When liquidity reverses, these high-beta assets are often the first to be hit, experiencing declines far exceeding those of Bitcoin. Secondly, there's the change in the total market capitalization of stablecoins. Stablecoins serve as \"backup cash\" in the crypto market, and changes in their total market capitalization reflect the willingness of off-exchange funds to enter. Data shows that since January 2026, the total market capitalization growth of USDT and USDC has stagnated or even slightly declined, indicating that the speed of new funds entering the market has not kept pace with the market's expansion needs. When the market relies on existing funds and leverage to maintain high levels, any liquidity shock could lead to a collapse. Thirdly, there's the divergence between on-chain activity and price. In the months leading up to the crash, although Bitcoin prices remained high, indicators such as the number of active on-chain addresses and transactions did not reach new highs simultaneously, and even declined. This indicates that the price increase was mainly driven by leveraged trading within exchanges, rather than genuine fundamental improvements or increased adoption. Leveraged-driven rises are often short-lived; once liquidity tightens, prices will quickly revert to their previous levels. The unique characteristic of the crypto market lies in the fact that its participants are far more sensitive to macroeconomic liquidity than other asset classes. This is because the crypto market lacks traditional \"endogenous cash flow,\" and its price is entirely determined by the willingness of marginal buyers to enter the market. When macroeconomic liquidity is abundant, these marginal buyers (mainly retail investors and hedge funds with higher risk appetites) have ample funds, driving up prices; when macroeconomic liquidity tightens, they are also the first to withdraw funds. This round of crash is the most vivid illustration of this mechanism. VI. Market Outlook: Crypto Asset Repricing under the Liquidity Indicator Framework Looking ahead, the trend of the crypto market will no longer be determined by a single factor, but will enter a new stage dominated by macroeconomic factors. Investors need to establish an analytical framework centered on liquidity indicators, focusing on the following variables: First, the Federal Reserve's monetary policy path. Although the market has some concerns about Warsh's hawkish stance after becoming Chairman of the Federal Reserve, it is more important to observe actual economic data. If the job market cools significantly and inflation continues to decline, the Fed's tightening pace may be slower than expected. The CME FedWatch tool shows that market expectations for a rate cut in 2026 have been significantly lowered, but this has already been partially priced in. The key is when the Fed will release a clear signal of a policy shift. Secondly, changes in TGA balance and net liquidity are crucial. Investors should closely monitor the weekly TGA balance data released by the US Treasury, as well as changes in the Fed's balance sheet and ON RRP balance. Net liquidity (Fed Total Assets - TGA - ON RRP) is the most direct indicator of available cash in the market. If net liquidity continues to decline, the crypto market will continue to be under pressure; conversely, if net liquidity bottoms out and rebounds, a phase of rebound may occur. Thirdly, the evolution of yen carry trades is important. The USD/JPY exchange rate and the spread between the US and Japan 2-year government bond yields are two key points to observe. If the yen's appreciation trend stops and the Japan-US interest rate differential stabilizes or even widens, the pressure to unwind arbitrage positions will ease, which is a positive signal for global risk assets, including the crypto market. Conversely, if the yen continues to appreciate, further deleveraging should be anticipated. Finally, there are the structural indicators of the crypto market itself. Whether the total market capitalization of stablecoins has resumed growth, whether Bitcoin's market capitalization share has stabilized, and whether perpetual contract funding rates have turned positive are all important references for judging whether the market has bottomed out. Historically, only when funding rates remain positive, futures premiums recover, and stablecoins flow back into exchanges does it signify a true restoration of market confidence. In terms of specific timing, the second quarter is typically a period of relatively tight liquidity (TGA balances peak during tax season), coupled with the ongoing Fed balance sheet reduction, the crypto market may continue its volatile bottom-seeking trend. A real turnaround may not occur until the second half of the year—when TGA balances begin to decline and the market forms clearer expectations regarding the Fed's policy path. </p><h2 style=\"text-align: left;\">VII. Conclusion: Saying Goodbye to Extensive Growth and Embracing the New Macroeconomic Normal</h2><p style=\"text-align: left;\">The cryptocurrency market crash in the first quarter of 2026 was a systemic deleveraging event driven by macroeconomic liquidity and amplified by the cryptocurrency's own structural issues. It marks the end of the extensive growth phase driven by loose liquidity since 2023, and the cryptocurrency market has officially entered a new macroeconomic normal.</p><p style=\"text-align: left;\">Under this new normal, cryptocurrency assets, like other risky assets, will be profoundly affected by macroeconomic variables such as global central bank balance sheets, fiscal policies, and exchange rate fluctuations. The narratives of \"crypto market desensitization to macroeconomics\" and \"the safe-haven attribute of digital gold\" have been disproven in this crash—when a real liquidity crisis arrives, Bitcoin's decline is no less than that of tech stocks, and its correlation with the Nasdaq has risen to a historical high.</p><p style=\"text-align: left;\">For investors, this means a need to establish a more macroeconomic analytical perspective, rather than simply focusing on project fundamentals or technological progress.</p><p style=\"text-align: left;\"> Liquidity indicators should be a core basis for investment decisions: pay attention to changes in net liquidity, whether SOFR rates are rising abnormally, whether the US Treasury volatility index MOVE is rising, and whether high-yield credit spreads are widening. These macroeconomic variables will determine the beta direction of the crypto market, while project fundamentals only provide alpha opportunities after the beta is determined. Of course, a crash often breeds new opportunities. When leverage is cleared, speculators leave, and valuations return to rationality, projects with genuine long-term value will present an opportunity to build positions. However, caution is advised until a clear turning point in the macro liquidity environment is observed. For the crypto market, cash is the last scarce commodity, and liquidity is the only truth.</p></div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/9eb0b8f202c2cc555b2b7c75b8783a13.jpg",
            "link": "https://www.coinlive.com/news/crypto-market-macro-research-report-crypto-asset-repricing-amid-liquidity",
            "pub_date": "2026-02-26 17:08:40",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 250224,
            "title": "Romance Turns Into Crypto Trap as US Authorities Seize $61 Million From Fake Dating and Investment Scheme",
            "description": "<div class=\"share___SVvtl\"><div><h2>The Costly Illusion Of A Perfect Partner</h2><p>A massive $61 million in cryptocurrency has been recovered by United States federal agents following a sophisticated pig butchering scam that stripped victims of their life savings.</p><p></p><p>This enforcement action, led by the U.S. Attorney’s Office for the Eastern District of North Carolina, targeted a criminal network that thrived on a cruel blend of romantic manipulation and technical deception.</p><p></p><p>The recovery of such a large sum of Tether (USDT) represents one of the most successful interventions against digital asset fraud to date.</p><p></p><p>The scheme functioned like a meticulously planned stage play.</p><p></p><p>Scammers spent months grooming targets through online platforms, posing as either potential romantic partners or elite investment gurus.</p><p></p><p>Once they gained enough emotional leverage, they nudged their victims toward fraudulent trading websites.</p><p></p><p>These platforms were designed to look professional, displaying fake portfolios with soaring profits to entice people into depositing more funds.</p><p></p><div class=\"media-wrap embed-wrap\"><div><blockquote align=\"center\" class=\"twitter-tweet\" data-dnt=\"true\"><p dir=\"ltr\" lang=\"en\">🚨$61 MILLION IN USDT SEIZED IN ROMANCE CRYPTO SCAM<br/><br/>U.S. Attorney’s Office in North Carolina says federal agents seized over $61M in USDT tied to a “pig butchering” scam.<br/><br/>Fraudsters posed as romantic partners and fake trading experts to lure victims into sending crypto. <a href=\"https://t.co/CVwcuEUkfx\">pic.twitter.com/CVwcuEUkfx</a></p>— Coin Bureau (@coinbureau) <a href=\"https://twitter.com/coinbureau/status/2026643349982118063?ref_src=twsrc%5Etfw\">February 25, 2026</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p></p><h2>How Did The Pig Butchering Scam Trap Victims?</h2><p>The term pig butchering refers to the practice of fattening up a victim with false gains before slaughtering them by stealing their entire investment.</p><p></p><p>When users eventually tried to pull their money out, the facade broke.</p><p></p><p>The scammers would suddenly demand taxes or processing fees to release the funds.</p><p></p><p>Even if these extra payments were made, the criminals simply blocked the accounts and vanished.</p><p></p><p>In one heartbreaking instance from December 2025, a Bitcoin investor lost his entire retirement fund.</p><p></p><p>He was manipulated by an online trader who used AI-generated images to create a believable, yet entirely fake, persona.</p><p></p><p>By the time he realized the platform was a sham, his coins had already been moved into a complex web of digital wallets.</p><p></p><div class=\"media-wrap embed-wrap\"><div><blockquote align=\"center\" class=\"twitter-tweet\" data-dnt=\"true\"><p dir=\"ltr\" lang=\"en\">A Bitcoin investor ust lost his entire retirement fund -- not to a hack, but to an AI-generated romance scam<br/><br/>No malware.<br/>No exploit.<br/>Just blackmail <br/>He sent the BTC himself <a href=\"https://t.co/x3b7pZHziY\">pic.twitter.com/x3b7pZHziY</a></p>— Jered King⚡Trading (@JeredKing) <a href=\"https://twitter.com/JeredKing/status/2001078264887140522?ref_src=twsrc%5Etfw\">December 16, 2025</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p></p><h2>Where Did The Stolen Millions Go?</h2><p>Tracking the money was a monumental task for Homeland Security Investigations (HSI).</p><p></p><p>The criminals laundered the proceeds by shuffling the USDT through a dizzying array of wallets to hide its origin.</p><p></p><p>However, investigators used advanced blockchain analysis to follow the digital breadcrumbs.</p><p></p><p>They eventually identified several addresses that still held massive balances, allowing them to freeze the assets before they could be cashed out.</p><p></p><p>Tether, the issuer of the stablecoin, played a critical role in this recovery.</p><p></p><p>By cooperating with the Department of Justice, the company helped freeze the suspicious addresses and facilitate the transfer of funds back under legal control.</p><p></p><p>The Department of Justice and HSI accepts Tether for its assistance in moving these assets, the official release stated, highlighting a growing trend of private-public partnerships in the fight against cybercrime.</p><p></p><div class=\"media-wrap embed-wrap\"><div><blockquote align=\"center\" class=\"twitter-tweet\" data-dnt=\"true\"><p dir=\"ltr\" lang=\"en\">Tether Acknowledged by DOJ for Support in $61 Million Seizure Linked to Pig Butchering Fraud<br/>Learn more: <a href=\"https://t.co/yp0F6oXmR5\">https://t.co/yp0F6oXmR5</a></p>— Tether (@tether) <a href=\"https://twitter.com/tether/status/2026723884976816270?ref_src=twsrc%5Etfw\">February 25, 2026</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p></p><h2>Can Law Enforcement Actually Stop Crypto Fraud?</h2><p>The sheer scale of the problem is reflected in the 2026 Crypto Scam Report by Chainalysis, which found that total losses reached $17 billion last year.</p><p></p><p>Most concerning is the 1,400% rise in AI-driven social engineering, where scammers use deepfakes and automated scripts to hunt for targets.</p><p></p><div class=\"media-wrap embed-wrap\"><div><blockquote align=\"center\" class=\"twitter-tweet\" data-dnt=\"true\"><p dir=\"ltr\" lang=\"en\">In our latest 2026 Crypto Crime Report chapter, we examine how crypto scams reached $17 billion in 2025, driven by sophisticated operations using AI, phishing-as-a-service tools, and professional money laundering networks. Our analysis reveals that impersonation scams grew 1400%… <a href=\"https://t.co/ioiVFu4OJv\">pic.twitter.com/ioiVFu4OJv</a></p>— Chainalysis (@chainalysis) <a href=\"https://twitter.com/chainalysis/status/2011055151558054393?ref_src=twsrc%5Etfw\">January 13, 2026</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p></p><p>Despite these challenges, U.S. Attorney Ellis Boyle remains firm that the tide is turning, stating that the seizure of $61 million proves that criminals will not keep their profits from cryptocurrency fraud schemes.</p><p></p><p>This $61 million seizure follows another major win in early 2026, where $400 million linked to darknet laundering was intercepted.</p><p></p><p>While authorities continue to expand their ability to trace illicit movements on the blockchain, they emphasize that prevention is the best defence.</p><p></p><p>Investors are urged to verify any platform through independent sources before moving digital assets, as the emotional and financial scars left by these partners can be permanent.</p></div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/9f8c56bc2f6b6dd2eb4fc225d3c2671a.jpeg",
            "link": "https://www.coinlive.com/news/romance-turns-into-crypto-trap-as-us-authorities-seize-61",
            "pub_date": "2026-02-26 16:39:43",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        }
    ]
}