{
    "data": [
        {
            "id": 250552,
            "title": "Tokenized Private Credit",
            "description": "<div class=\"share___SVvtl\"><div>What is private lending? Private lending refers to debt financing provided by non-bank lending institutions, such as direct loans to medium-sized enterprises, real estate loans, trade finance, consumer loans, and structured credit. These loans are not issued or traded on the public market. Unlike public bonds, these loans are negotiated bilaterally, recorded privately, and typically held by the originating fund until maturity. After 2008, as banks scaled back their operations under new regulatory restrictions (Basel III), the private lending asset class grew rapidly. Investment funds, private equity firms, and specialized financial companies flocked in, filling the lending gap. By 2020, the global private lending market had grown to approximately $2 trillion. By early 2025, the market had reached $3 trillion, and it is projected to reach $5 trillion by 2029 (Morgan Stanley, McKinsey). The traditional private lending market suffers from three core structural problems that make it an ideal target for tokenization. **Insufficient Liquidity:** Once a fund issues a loan, it typically holds it until maturity. There are currently no mature trading platforms for trading shares of private loans. Secondary market trading is customized, slow, and requires extensive due diligence from buyers. **Lack of Transparency:** Fragmented data means investors often lack a clear understanding of leverage ratios, collateral quality, or real-time performance. Reports are typically released quarterly, resulting in significant information asymmetry. Entry Threshold: The minimum investment is $5 million to $10 million, with a multi-year lock-up period and qualified investor requirements, effectively excluding everyone except the largest institutional investors. What is Tokenized Private Credit? Tokenized private credit is the process of converting private loans or debt instruments into blockchain-based digital tokens. These tokens represent claims to loan cash flows, ownership of fund units, or rights to interest and principal payments. In reality, the underlying loan or credit exposure remains off-chain, with the same legal structure and regulatory approach as traditional markets. However, ownership claims or rights to proceeds are represented on-chain in the form of tokens. These tokens can be issued, traded, and settled more efficiently using blockchain infrastructure. The working principle is as follows: Origin: The originating institution constructs private credit products (SME loans, structured credit, trade finance, home equity lines of credit, etc.). Legal Packaging: A legal entity (usually a special purpose entity) is created to hold the loan exposure. Tokenization: Digital tokens representing ownership or cash flow rights of the credit are minted. Subscription: Investors subscribe using fiat currency or stablecoins and receive tokens in return. Performance: The loan continues to be executed off-chain, but payments, investor reports, and ownership records are managed on-chain. <h2 style=\"text-align: left;\">Two Tokenization Models</h2><p style=\"text-align: left;\">This is a key distinction that most articles overlook.</p><p style=\"text-align: left;\">Representative Tokenization: The blockchain serves solely as a transparent record system for off-chain lending. These tokens are non-transferable and non-tradable; the blockchain only provides operational upgrades (immutable ledger, real-time tracking). Figure primarily employs this model.</p><p style=\"text-align:center\"><img src=\"https://img.jinse.com.cn/7436354_image3.png\"/></p><p style=\"text-align: left;\"><em>Figure's Data</em></p><p style=\"text-align: left;\">Distributable Tokenization: Loans are natively issued and held on-chain as transferable tokens. Investors can hold, trade, and combine these tokens within the DeFi ecosystem. Platforms like Maple, Centrifuge, and Tradable are closer to this model.</p> According to research data from HTX_Global, of the approximately $19 billion in active on-chain private lending, only about 12% is held in a transferable, distributable tokenized form. The remainder is \"recorded but immovable.\" This is a crucial nuance in assessing the true state of the market. **Evolution Process** **Phase 0: Prehistory (2017-2019)** **2017: Centrifuge was founded as one of the first DeFi projects to integrate RWA. It initially focused on tokenizing invoices and accounts receivable through its Tinlake protocol (an open asset pool powered by smart contracts).** **2018: Figure was founded by Mike Cagney (former CEO of SoFi). The company focused on integrating blockchain into financial services, first launching Home Equity Credit (HELOC) based on blockchain infrastructure. Figure developed the Provenance Blockchain Foundation (a Layer 1 based on the Cosmos SDK) as its infrastructure.** 2019: Cadence (later renamed Percent) launched its first tokenized private debt product, attempting to reduce back-office costs by standardizing and reusing smart contract templates for structured products. Early challenges followed, such as higher-than-expected on-chain contract mirroring costs and insufficient demand for tokenized debt due to a lack of sufficient crypto-native investors to invest effectively. Phase 1: DeFi Integration and Early Development (2020-2021) 2020 (Centrifuge V1): Centrifuge proved that tokenized private credit could serve as collateral in DeFi, notably its integration with SkyEcosystem. Early 2021: Goldfinch launched, focusing on decentralized lending in emerging markets. This protocol enables cryptocurrency investors to provide loan funds to fintech institutions in developing countries (Indonesia, Mexico, Peru, Kenya). It employs a dual-pool model: retail funds enter a senior pool for stable returns (7-10% annualized), while community-elected junior supporters provide first-loss funding in exchange for higher returns. 2021: Maple launched as an institutional lending platform on Ethereum, using \"pool representatives\" for credit assessment. Initially serving institutional borrowers such as hedge funds, trading firms, and cryptocurrency market makers. TrueFi and Clearpool also entered the market. 2021: Figure began settling Home Equity Credits (HELOCs) on the Provenance Blockchain Foundation, reducing financing cycles from months to days and eliminating intermediaries. Mid-2021 to end of 2022: Active lending in the on-chain private lending market peaked at nearly $1.5 billion. Lending was primarily driven by cryptocurrency exchanges and market makers. Phase 2: Crypto Winter and Reset (2022) 2022: The crypto winter severely impacted on-chain private lending. Maple defaulted on $69.3 million in debt during institutional turmoil (the collapses of FTX/Alameda/3AC). Low-collateralized loans to crypto companies proved disastrous. Goldfinch experienced bad credit through its emerging market offerings. Total on-chain private lending value plummeted from its peak. Lending to crypto-native companies (trading desks, market makers) created a cyclical risk. The market began to shift towards real-world lending as a driver of recovery. Phase 3: Real-world Transformation and Institutional Investor Entry (2023-2024) 2023 (Centrifuge V2): Multi-chain expansion and institutional-grade fund structuring tools. New growth primarily came from real-world lending. 2023: Hamilton Lane tokenized its Senior Credit Opportunities (SCOPE) private credit fund on Ethereum and Polygon through Securitize, lowering the minimum investment from $5 million to $20,000. 2022 (Early): KKR launched its healthcare strategic growth fund on the Avalanche blockchain via Securitize. 2024: Hamilton Lane extended SCOPE to the Solana chain via the Libre platform. Mid-2024: Centrifuge had an outstanding loan balance of $289 million, primarily invested in consumer asset-backed securities (ABS), real estate bridge loans, and trade finance. Over 85% of loans issued through Centrifuge were financed via the Sky Protocol (formerly MakerDAO). 2024 (Centrifuge V3): Interoperability, Standardization, and Composability. Develop ERC-7540, an extension of ERC-4626, for standardizing asynchronous investing and redemption. End of 2024: BlackRock launches BUIDL (a tokenized money market fund), reaching $1.2 billion in assets under management within six months. Early 2024: The private lending tokenization space reaches approximately $8 billion, primarily driven by Figure, Centrifuge, Maple, Goldfinch, Clearpool, and Credix. Phase 4: Institutional Acceleration (2025) January 2025: Apollo launches the tokenized diversified credit fund (ACRED) across six blockchains via Securitize. By November 2025, its assets under management reached $170 million. In February 2025: Figure formed a joint venture with Sixth Street (Sixth Street committed $200 million in equity to Figure Connect for continued private lending liquidity). By mid-2025: Figure had tokenized over $13 billion in loans (primarily home equity lines of credit). It became the number one non-bank home equity line of credit lender in the U.S. It settled over $600 million in loans monthly on Provenance. September 2025: Figure listed on Nasdaq under the ticker symbol FIGR, raising $787.5 million in its IPO, valuing the company at $5.3 billion (later reaching $7.6 billion). October 2025: Total tokenized real-world assets (RWA) reached approximately $33 billion, with private lending accounting for $16-18 billion. As of November 2025: On-chain private lending exceeded $18.91 billion, with cumulative disbursements reaching $33.66 billion (RWA.xyz data). The value increased by 82% from the end of 2024, reaching $17.9 billion as of October 2025 (PwC data). Securitize issued nearly $4 billion in tokenized assets and is a tokenization partner of BlackRock, Apollo, Hamilton Lane, KKR, and VanEck. **Phase 5: Status Quo (Early 2026)** February 2026: Figure Technologies currently leads the market with approximately $15 billion in active loans, representing 75% of the total active loan volume of approximately $20 billion (RWA.xyz data). The total value of tokenized assets on the Provenance platform reached $1.2 billion in TVL. Hamilton Lane and Securitize launched an RWA-backed stablecoin on OKX's X Layer platform. This stablecoin is backed by tokenized exposure from Hamilton Lane's SCOPE fund and employs a dual-token architecture to separate yields from the stablecoin itself. The tokenized private lending market continues to expand into the DeFi composability space: Apollo's ACRED fund is being used in leveraged cycles on platforms like Morpho and Kamino, demonstrating that on-chain assets can be combined in ways that are impossible in traditional finance. Industry expectations for 2026 include major institutions \"transitioning from pilot phases to large-scale, production-ready products,\" and the potential for on-chain lending to receive ratings from traditional rating agencies. How Tokenized Private Lending Works** **Token Standards and Structure** **Loan-Specific Tokens:** Each loan is tokenized into one or more ERC-20 tokens, representing a claim to the cash flow of that asset. For example, real estate lenders issue tokens that entitle holders to mortgage repayments. These tokens typically constitute securities and must be issued under exemptions (Reg D for accredited investors, and Reg A+ for broader but restricted retail investors).** **Loan Pool Model:** Lenders contribute to a public pool of funds, which then distributes loans to borrowers on their behalf. Loans are represented on-chain as debt securities (non-tradable tokens) linked to NFTs, while lenders receive ERC-20 tokens representing their share of the pool. Smart contract enforcement clauses mean that if a borrower fails to repay the loan, the loan defaults, triggering pre-defined remedies. Fund tokenization: The fund structure itself is tokenized (e.g., Hamilton Lane's SCOPE). Investors hold tokens representing fund units, rather than direct claims on individual loans. This is currently the mainstream institutional model. Key Standards: ERC-20: Standard fungible token for loan pool shares and fund tokens. ERC-721 (NFT): For individual loan representations in certain protocols. ERC-4626: Standard for tokenized vaults for yield positions. ERC-7540: An extension of ERC-4626 for asynchronous investing and redemption, a leading DeFi RWA standard developed by Centrifuge. Tiered Structure: Advanced/Junior Tiered Structure (Centrifuge's DROP/TIN model) allows for risk-return differentiation. Lifecycle Management. Smart Contract Processing: Loan Issuance and Interest Accumulation; Token Holder Collection and Distribution; Redemption and Principal Return; Compliance Checks (Whitelist, KYC/AML, Jurisdiction Restrictions); Default Trigger Mechanism and Waterfall Repayment Mechanism; Transparency Issues. This section of the article applies the RWA Transparency Framework, which distinguishes between the actual allocated content and the content merely presented on-chain. What does Figure's dominance really mean? Figure accounts for approximately 75% of tokenized private lending. However, Provenance is a specially constructed chain whose smart contracts require governance approval. As Glider co-founder Brian Huang points out: \"Unless the asset is composable, on-chain assets are no more useful than off-chain assets. Provenance is not composable.\" This means that, in dollar terms, the vast majority of tokenized private lending is essentially an operational upgrade, rather than a distributable, DeFi-composable asset. These loans are not tradable tokens that investors can freely transfer, combine, or use across ecosystems. This is crucial for transparency analysis. The 12% Problem: According to HTX research, only about 12% of on-chain private credit is held in a transferable tokenized form. The rest, while documented, cannot be distributed. While some say tokenized private credit is worth $20 billion, a more accurate figure for truly distributable, composable tokenized credit should be between $2 billion and $3 billion. On-Chain Verifiable Content: Fully verifiable: Token ownership, transfer history, fund share balance, smart contract terms, compliance status (whitelist), and payment and distribution. Partially verifiable: Total outstanding loan value (depending on oracle/report accuracy), collateral ratio (for overcollateralized models). On-chain verifiability includes: borrower creditworthiness, actual loan performance (still relying on off-chain reports), collateral quality of off-chain assets, true default rate, and recovery rate. Underlying credit risk assessment, underwriting, and counterparty evaluation remain entirely off-chain. Blockchain provides transparency at the token layer, but not necessarily at the asset layer.</div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/e023cbf10e4bd3a0ceefdd90c8c992b7.jpg",
            "link": "https://www.coinlive.com/news/tokenized-private-credit",
            "pub_date": "2026-02-27 21:18:21",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 250546,
            "title": "How can one kilowatt-hour of electricity be sold to the other side of the Pacific Ocean?",
            "description": "<div class=\"share___SVvtl\"><div><h1 style=\"text-align: left;\"><span leaf=\"\">How can one kilowatt-hour of electricity be sold to the other side of the Pacific?</span></h1><blockquote style=\"text-align: left;\"><p style=\"text-align: left;\"><span leaf=\"\">It took me two years to figure out one thing—China's cheapest export isn't clothing, solar panels, or electrolytic aluminum, but something most people haven't even realized. It doesn't need containers, it doesn't go through customs, and it can be delivered via undersea fiber optic cables. It's called Token.</span></p></blockquote><h2 style=\"text-align: left;\"><span leaf=\"\">A question I haven't figured out</span></h2><p style=\"text-align: left;\"><span leaf=\"\">In 2023, news about controlled nuclear fusion was everywhere, and the new energy sector was booming. I noticed a rather inconspicuous piece of news at the time: Sam Altman had invested in a small nuclear reactor company called OKLO.</span></p><blockquote style=\"text-align: left;\"><p style=\"text-align: left;\"><span leaf=\"\">In 2023, news about controlled nuclear fusion was everywhere, and the new energy sector was hot. I noticed a rather inconspicuous piece of news at the time: Sam Altman had invested in a small nuclear reactor company called OKLO.</span></p><p style=\"text-align: left;\"><span leaf=\"\"> At that time, ChatGPT had just come out, and everyone was talking about the emergence of intelligence in large models. Few people discussed AI and energy together. I remembered Altman's investment in OKLO, but I didn't understand it. Around the same time, I was discussing a far-fetched question with AI: If electricity could be transported and traded as freely as oil, could China leverage its electricity cost advantage to establish a pricing system similar to the petrodollar? This idea stemmed from a simple observation—China's electricity costs are indeed cheap globally. China has the world's largest installed capacity of wind and solar power, and while coal-fired power is not environmentally friendly, it is stable. If electricity could be directly exported, theoretically, this would be a huge comparative advantage. But the discussion quickly stalled. Two Impossible Paths There are two intuitively feasible paths for electricity export, which we have analyzed one by one. The first is direct grid connection. Laying transnational transmission lines to sell electricity directly to neighboring countries and even further afield. The problem is obvious: the construction cost of ultra-high-voltage transmission lines is staggering, each country along the route is a negotiation node, and geopolitical risks make this path almost impossible to scale up. China to Southeast Asia might still have some possibility, but covering the entire globe like oil pipelines is unrealistic. The second route is battery export. Storing electricity in batteries and shipping it out is like canning food. This route is hampered by the laws of physics—batteries have a ceiling on energy density, and the self-discharge losses, temperature control costs, and logistics weight during long-distance transportation can make it more expensive than generating electricity locally. Not to mention the production cost of the batteries themselves, where the price fluctuations of minerals like lithium and cobalt are far greater than the cost of electricity. We've also discussed indirect routes: exporting electricity through energy-intensive products, such as electrolytic aluminum and industrial silicon. However, the cost structure of these products is too complex; electricity is only one component, with layers of mining, processing, and transportation added on top. Unlike oil, where a barrel of oil is simply a barrel of oil with a clear price. At this point in the discussion, my conclusion is: Before a qualitative leap occurs in energy storage and power transmission technologies, electricity will be difficult to become a commodity that can be directly exported. This conclusion seemed reasonable at the time. </span></p><p style=\"text-align:center\"><img alt=\"cEdTuWfl3UWjMVweY4rn42WG5kfrfcnJD8XWf0H7.png\" src=\"https://img.jinse.com.cn/7436347_image3.png\" title=\"7436347\"/></p><figcaption style=\"text-align: center;\"><span leaf=\"\">Comparison of three paths for electricity export</span></figcaption><h2 style=\"text-align: left;\"><span leaf=\"\">Altman probably figured it out earlier than everyone else</span></h2><p style=\"text-align: left;\"><span leaf=\"\">Then the AI ​​era arrived.</span></p><p style=\"text-align: left;\"><span leaf=\"\">Not at the moment ChatGPT was released—back then, the discussion was still about \"whether AI can replace programmers.\"</span></p><p style=\"text-align: left;\"><span leaf=\"\">Not at the moment ChatGPT was released—back then, the discussion was still about \"whether AI can replace programmers.\"</span></p><p style=\"text-align: left;\"><span leaf=\"\"> It wasn't until 2024-2025, when large-scale models began to be commercially available on a large scale and token pricing became a business, that I suddenly realized something. Tokens are essentially the unit of electricity. This isn't a metaphor. If you open the pricing page of any AI API, the core costs of a token, broken down, are computing power and electricity. Computing power is the depreciation and amortization of GPUs, and electricity is the operating cost of data centers. Other costs—such as manual annotation and the amortization of model training R&amp;D—are actually a small percentage of each token. When a user sends a request to DeepSeek or MiniMax, they are essentially purchasing the electricity consumed in a data center in China at that instant. Looking back at Altman's investment in OKLO, the logic becomes clear. He wasn't making energy diversification investments; he was securing electricity supply for OpenAI's future. He foresaw the endgame early on: in the end, AI companies' competition will lead to convergent model architectures, talent mobility, and the only irreplaceable resource will be electricity. Google's TPU is the other side of the same logic. The GPU arms race is essentially a talent competition—when Nvidia engineers are poached, new chip companies emerge. But electricity isn't a talent issue; it's a resource issue, and it won't shift due to the movement of people. A New Way to Exit Electricity is indeed difficult to export directly. But tokens can. A US user calls DeepSeek's API; data travels from California, through a Pacific undersea fiber optic cable to a data center in China, where the GPU consumes power to complete inference, and the results are then transmitted back. Throughout the entire process, the electricity never leaves China's power grid, but its value is delivered across borders through tokens. There is no transmission line loss, no battery self-discharge, and no geopolitical negotiations. The signal loss from fiber optic transmission is negligible compared to grid transmission. Electricity has finally found its export form—not joules, but tokens. MiniMax and Zhipu can offer competitive token prices in the global market, partly because they are undervalued, due to China's electricity costs. Of course, it's not just electricity; the efficiency of the model architecture (such as MoE) and the optimization capabilities of the engineering team are also important. But if these \"soft\" factors are aligned, electricity cost becomes the hard, unreplicable differentiator. This differs from my previous refutation of the \"electricity export of electrolytic aluminum.\" In the cost structure of electrolytic aluminum, electricity may account for 30%-40%, with the remainder being ore and processing. However, in the cost structure of tokens, electricity plus computing power may account for over 70%, and the computing power itself also depends on electricity. Tokens are, to date, the purest electricity derivative. </span></p><p style=\"text-align:center\"><img alt=\"kMR6aOYxHyLWlmeCDWevcM0IadAIJwRfD1hCKFMZ.png\" src=\"https://img.jinse.com.cn/7436348_image3.png\" title=\"7436348\"/></p><figcaption style=\"text-align: center;\"><span leaf=\"\">Token Purity Comparison: Electrolytic Aluminum vs. Battery vs. Token</span></figcaption><h2 style=\"text-align: left;\"><span leaf=\"\">Opportunities and Risks in the Time Difference</span></h2><p style=\"text-align: left;\"><span leaf=\"\">But the current situation is not an equilibrium state.</span></p><p style=\"text-align: left;\"><span leaf=\"\">AI's demand for electricity is growing far faster than the construction speed of power infrastructure.</span></p><p style=\"text-align: left;\"><span leaf=\"\">The current situation is not an equilibrium state.</span></p><p style=\"text-align: left;\"><span leaf=\"\">AI's demand for electricity is growing much faster than the construction speed of power infrastructure.</span></p> The electricity required to train a cutting-edge large-scale model is increasing annually, while a new power plant typically takes 3-5 years from project initiation to grid connection. This time mismatch is the root cause of the current surge in energy prices. It's not that there isn't enough electricity—China's installed power generation capacity has been increasing year after year. Nor is it that the technology is inadequate—the cost per kilowatt-hour for solar and wind power is already lower than that for coal-fired power. The problem is that the demand for AI is growing too fast, so fast that the existing power allocation system cannot keep up. It's like a highway designed for 100,000 vehicles per day, but suddenly 500,000 vehicles flood in every day; it's not that the road isn't wide enough, it's that there's no time to expand it. This time lag creates short-term opportunities: whoever currently has sufficient electricity supply has a pricing advantage in the AI ​​token market. Regions like China, the Middle East, and Northern Europe, with their low electricity costs or abundant supply, are naturally suited to become the \"world's factory\" for AI inference. However, the other side of the time difference is risk. <p style=\"text-align:center\"><img alt=\"u6AZEfDhUWZXhaM378zupxrU6ct5KwsahP15HvY0.png\" src=\"https://img.jinse.com.cn/7436349_image3.png\" title=\"7436349\"/></p><figcaption style=\"text-align: center;\"><span leaf=\"\">AI Power Supply and Demand Time Mismatch</span></figcaption><p style=\"text-align: left;\"><span leaf=\"\">If, in 3-5 years, the power capacity built for AI comes online in a concentrated manner, while AI inference efficiency improves significantly due to advancements in model compression and quantization technologies (resulting in a continuous decrease in the power consumed per token), then a classic supply and demand reversal will occur—a sudden surplus of power prepared for AI.</span></p><p style=\"text-align: left;\"><span leaf=\"\">This is not just my wishful thinking.</span></p><p style=\"text-align: left;\"><span leaf=\"\">This is not just wishful thinking.</span></p><p style=\"text-align: left;\"><span leaf=\"\">This is not just my ... wishful thinking.</span></p><p style=\"text-align: left;\"><span leaf=\"\">This is not just wishful thinking.</span> Similar cycles have occurred repeatedly throughout history. The entrance to Jevons' paradox is possible, though things may not evolve so linearly. In 1865, British economist Jevons discovered a counterintuitive phenomenon: the increased efficiency of steam engines did not reduce coal consumption; on the contrary, the lower operating costs spurred more coal use, leading to an increase in total consumption. This is Jevons' paradox. Once the cost of AI reasoning decreases, it may well enter the same cycle. When a token is cheap enough, people will start using AI for things that currently seem \"unworthy\": automatically generated personalized educational content, 24/7 private health advisors, AI customer service for every product, and real-time translation accessible to everyone. The expansion of consumption scenarios may once again outpace supply growth, leading to an increase in electricity demand instead of a decrease. This leads us into a larger-scale spiral: electricity capacity expansion → decreased inference costs → explosion of new consumption scenarios → renewed surge in electricity demand → a new round of capacity expansion. In each spiral, the role of tokens as a unit for monetizing electricity is strengthened. </p><p style=\"text-align:center\"><img alt=\"YEdTuskFRE8z1lsyFgwFpQJXMnTwan0hx9e2B2mR.png\" src=\"https://img.jinse.com.cn/7436350_image3.png\" title=\"7436350\"/></p><figcaption style=\"text-align: center;\"><span leaf=\"\">Jevens' Paradox: The Spiral Cycle</span></figcaption><p style=\"text-align: left;\"><span leaf=\"\">I'm not sure how many times this spiral will turn, nor am I sure at which point the inflection point of true oversupply will occur. But one thing I'm increasingly certain of:</span><strong><span leaf=\"\">Understanding the AI ​​economy cannot be achieved by looking only at models and algorithms; we must look at the underlying energy structure.</span></strong></p><p style=\"text-align: left;\"><span leaf=\"\">I'm not sure how many times this spiral will turn, nor am I sure at which point the inflection point of true oversupply will occur.</span></p></blockquote></div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/03887be73eecd8f6606df05d000fb73b.jpg",
            "link": "https://www.coinlive.com/news/how-can-one-kilowatt-hour-of-electricity-be-sold-to-the",
            "pub_date": "2026-02-27 20:45:15",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 250532,
            "title": "A Chinese man mining Bitcoin received his enlistment notice in Russia.",
            "description": "<div class=\"share___SVvtl\"><div>On February 23, 2025, the Chinese Consulate in Russia once again reminded Chinese citizens in Russia to pay attention to Presidential Decree No. 821 issued by Putin. This decree presents Chinese miners in Russia with a very real \"either-or\" choice: either give up their residency status or enlist in the military. To legally stay and earn rubles, they may first have to go through a conflict zone. The decree is clear: foreign men aged 18 to 65 who wish to apply for a long-term residency permit in Russia must agree to serve in a Russian military unit for at least one year. Once, miners went to Siberia for cheap electricity, but now, before their mining equipment has even recouped its costs, they might be treated as \"expendable resources.\" Now, those gold miners, with their millions of dollars worth of computing power, will they be able to escape unscathed? I. The Vicious Cycle of Compliance: To Be Legal, First Join the Army. Many miners who went to Russia felt they were just passing through, making money across borders, and that the frontline battles had nothing to do with them. But since last year, a network specifically targeting foreign miners has been quietly laid. The first step, \"luring the snake out of its hole.\" Russia officially legalized cryptocurrency mining in 2024, which briefly became a paradise for miners. However, the prerequisite was that individuals or businesses with high electricity consumption must join the official \"miner register,\" fully disclosing their wallet addresses and income. Failure to report would result in hefty fines and equipment confiscation. This tactic forced all miners who wanted to earn a stable income legally to voluntarily hand over their names and details. Once the details were disclosed, the next step followed naturally. The second step, \"identity locking.\" As a foreigner, if you want to legally register for large-scale mining, you must have a Russian long-term residence permit or a registered address within Russia. This is precisely the most dangerous move in the entire scheme. The third step, \"hitting the snake's vital spot,\" came in 2025 when Russian Presidential Decree No. 821 took effect, completely changing the rules for applying for long-term residence permits. You must either submit a Russian military service contract or proof that you are unfit for military service. This move directly impacted a large number of foreign male miners working in Russia—their original hope of obtaining long-term residency by registering as sole proprietors or companies is now blocked. The closed loop is now locked. If you want to mine legally, you need to register with your real name; if you want to register, you need to get a residence permit; if you want a residence permit, you need to be ready to go to the front lines at any time. First, they lure you in with the bait of legality, then they force you to comply with the law with severe penalties, and finally, they use a residence permit to precisely turn you into a potential recruit. You think you're mining Bitcoin with a machine, but in the eyes of the machine in wartime, you are just the \"mine\". II. The Countdown to Nominee Ownership and \"Visa Abduction\" Since obtaining long-term residency is risky, is it feasible to \"play guerrilla warfare\" in the gray area using business visas? The answer is no; this path is being completely blocked. In the past, many miners exploited loopholes by \"leaving the country once every 90 days,\" and even had locals hold mining licenses on their behalf. However, starting in 2025, Russia has taken several drastic measures, targeting individuals, behaviors, and assets one by one. First, immigration controls have been tightened on individuals. The \"Register of Controlled Persons,\" which came into effect in Russia in February 2025, is extremely precise. If a visa issue arises, bank accounts are instantly controlled, with even daily spending subject to very low limits. More importantly, police can detain individuals and initiate deportation proceedings within 48 hours without court approval. Using a business visa to mine is essentially illegal work, and one could easily become the next person to be removed from the program. Furthermore, the legal definition of the act has changed. According to the draft amendment to the Criminal Code in December 2025, illegal mining carries a maximum penalty of five years imprisonment and hefty fines. Previously, it was at most considered a violation; now it's a criminal offense. The gray area's space for survival is being eroded inch by inch by the law. Next comes the targeting of assets. In February 2026, Putin further signed a new law, giving courts the power to directly confiscate mining equipment and Bitcoin involved in cases. Nasdaq-listed The9 once stated that Russia might \"nationalize and confiscate the assets of foreign companies under certain circumstances.\" In Russia, it doesn't matter whose name the machine is registered under; if it's suspected of being illegal, it will be confiscated. Besides, you can't hide it anyway. Since the end of 2024, the Russian power grid has established an integrated air-ground detection network. In the air, thermal imaging drones precisely locate targets; on the ground, AI meters monitor electricity in real time; and at the terminals, intelligent algorithms proactively identify threats. In Dagestan alone, from January to November 2025, 73 cases of illegal electricity mining were uncovered, resulting in losses of 85.7 million rubles. The four avenues—people, actions, assets, and hiding places—have all been blocked. The window for discreetly mining by exploiting visa loopholes is closing. <h2 style=\"text-align: left;\">Third, the state apparatus only wants energy, not computing power</h2><p style=\"text-align: left;\">Even if one manages to secure residency and weather the risks of nominee shareholding, there simply isn't enough electricity to mine in Russia.</p><p style=\"text-align: left;\">After China shut down mining in 2021, Siberia, Russia, with its naturally low temperatures and cheap electricity, became a haven for miners worldwide.</p><p style=\"text-align: left;\">BitRiver, Russia's largest mining company, started there, at its peak managing 175,000 mining rigs.</p><p style=\"text-align: left;\">In those years, as long as you had electricity and the guts, money followed.</p><p style=\"text-align: left;\">But the power grid couldn't hold up.</p><p style=\"text-align: left;\"> By the end of 2024, cryptocurrency mining had consumed 1.5% of Russia's total electricity, pushing power grids in many areas to the brink of overload. Aging infrastructure needed maintenance, and heating for residents couldn't be interrupted. In Russia's non-natural gas-powered regions, electric heating was the most affordable way to keep warm in winter. Therefore, these \"electricity hogs\" naturally became the first targets. Starting in 2025, a series of bans were implemented. Several regions in the North Caucasus and Siberia experienced complete power outages or seasonal power rationing, even BitRiver couldn't withstand it. However, what ultimately crushed it wasn't the price of Bitcoin, but the combined blows of legal debt collection, account freezes, and regional power rationing. As for foreign miners without local connections, under the triple strangulation of \"identity thresholds (military service contracts + controlled personnel registration) + energy regulations + asset confiscation,\" they will be the first to be sacrificed. The window of opportunity for rampant growth based on cheap electricity and audacity has closed. Faced with rigid policies, computing power is merely code that can be disconnected at any time. When they withdrew from China in 2021, everyone was betting on the same thing: with the emperor far away, electricity would be enough to survive. Four years later, reality has provided a different answer. You can outrun the regulations of one country, but not the conscription order of another. In the story of the global miners' migration, Russia's chapter is drawing to a close. Those who haven't yet evacuated, and their machinery, have little time left.</p></div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/2825289663044a5d439f2166974dc91b.jpg",
            "link": "https://www.coinlive.com/news/a-chinese-man-mining-bitcoin-received-his-enlistment-notice-in",
            "pub_date": "2026-02-27 19:38:51",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 250530,
            "title": "Did Marx already predict the future of AI?",
            "description": "<div class=\"share___SVvtl\"><div>When discussing AI, most people are still preoccupied with whether their jobs will be taken away. However, Deutsche Bank believes this perspective might be too narrow. According to a recent report by George Saravelos, Global Head of FX Research at Deutsche Bank, published on the TrendFocus Trading Platform, two extreme endgame scenarios for AI development are proposed: The first scenario is \"complete replacement.\" Similar to Marx's prediction over 180 years ago and Musk's vision today: in the factors of production in economics, \"capital\" itself becomes \"labor power\" itself, the value of labor becomes zero, and capitalism becomes obsolete. AI will massively replace human jobs, wealth and income will be highly concentrated in the hands of a few capital owners, the income and needs of ordinary people will be weakened, and the economy will fall into a predicament of \"plenty of things, but no one can afford them.\" Did Marx predict artificial intelligence? About 200 years ago, he wrote a book about \"machines,\" envisioning a scenario of full automation. In this world, the problem of scarcity is solved. However, as the value of labor falls to zero, capitalism becomes obsolete, and we transition to a completely new world of immense material abundance. The endpoint envisioned by Marx is strikingly similar to Elon Musk's vision today. The second outcome is a \"history repeating itself.\" AI, like previous technological revolutions, increases efficiency but doesn't completely replace human labor; it merely \"empowers\" humanity. New jobs constantly emerge, and the policy system can still patch up the shocks. In this scenario, the economic logic is similar to that of the past few decades, with inflation, interest rates, and the stock market more likely to rise moderately. Will we ultimately head towards an abyss, a paradise, or simply experience a normal industrial upgrade? This Deutsche Bank report offers a completely new perspective. When \"capital becomes labor,\" why might traditional economics fail? To understand the ultimate destructive power of AI on the economy, we must return to the starting point of modern economics. From Adam Smith onward, all classical economists have based their work on a fundamental assumption: capital and labor are two completely independent factors of production. The prices (interest rates and wages) of both capital and labor are determined by their relative scarcity in the market. Looking back over the past two centuries, all previous waves of technological innovation have largely conformed to this model. By analogy, the invention of the steam engine eliminated coachmen but created train drivers; the internet destroyed traditional print media but created countless programmers and delivery drivers. Throughout these historical cycles, labor always had something to do. Machines were capital, but operating, maintaining, and designing machines was still labor. Capital was merely a \"supplement\" to labor. However, fully automated robots possessing Artificial General Intelligence (AGI) completely shatter this classification. \"In this situation, capital becomes labor. It is no longer a supplement to labor, but a substitute,\" George Saravelos pointed out incisively in the report. When an AI machine can think, produce, and iterate completely autonomously, this machine is both capital and labor. The fundamental structure of modern economics breaks down at this moment. The report states bluntly: \"When capital equals labor, the value of work drops to zero, and wages also drop to zero. Economists call this an unacceptable equilibrium. Scientists call it a singularity. Classical economic theory collapses. Consequently, capitalism as a system also becomes obsolete.\" When the law of \"supply creates demand\" fails, growth may face \"long-term stagnation.\" Once labor is massively replaced, what kind of changes will occur in the gears of the macroeconomy? Deutsche Bank introduces a deeper theoretical deduction. In a world where AI replaces workers, wages decline, but material abundance increases unprecedentedly. Machines tirelessly produce massive quantities of goods and services for the market. According to classical economists like Say, Walras, and Wicksell, \"supply automatically creates its own demand.\" In their theoretical models, the market possesses self-correcting capabilities. Goods prices decrease as production costs fall, allowing workers to ultimately buy more with less money or find work in new fields. However, Deutsche Bank warns that in a world of fully automated AI, this self-correcting mechanism will completely fail. The logic is straightforward: automation will concentrate wealth and income extremely in the hands of a narrow class of \"capital owners.\" And according to economic principles, the \"marginal propensity to consume\" of the wealthy (capital owners) is far lower than that of ordinary workers. To illustrate: an AI factory could produce 10,000 cars a day at extremely low cost. However, all profits would go to the AI ​​owner. This owner couldn't possibly buy all 10,000 cars; and many ordinary people who lost their jobs and had zero income couldn't afford them even at the lowest prices. \"The supply-demand chain has broken,\" Saravelos writes. This completely cleared market equilibrium would manifest as structurally low labor income, deflationary price levels, and massive amounts of \"excess savings\" replacing strong demand for goods. Deutsche Bank points out that this is precisely the scenario of \"secular stagnation\" proposed by economists Eggertsson and Mehrotra, and in extreme cases, could trigger a Marxist-style revolution. \"Keynesianism can save the day, but it may not be enough,\" the key lies in the speed of government and institutional response. Faced with market failures, can Keynesianism, another major pillar of modern economics, turn the tide? Keynesianism's revolutionary nature lies in acknowledging the failure of classical theory. Within the Keynesian framework, economic imbalances are not permanent but cyclical. When price adjustments are slow and workforce retraining lags behind, strong government intervention is necessary. In the AI ​​era, this intervention might manifest as levying a high \"AI tax\" on AI companies, using this as a funding pool to distribute \"stimulus checks\" or universal basic income (UBI) to the entire population. Through this strong fiscal transfer, the economy will eventually reach a new equilibrium. However, this logic faces significant practical constraints. The report cites extensive research on the history of technology deployment by renowned economists Acemoglu and Johnson. History has shown that policy and institutional adjustments are often extremely slow. For example, in the early stages of the British Industrial Revolution, the lack of corresponding institutional protections suppressed workers' real wages for decades. To prevent a decline in living standards, Deutsche Bank has listed the necessary institutional reforms: \"a stronger labor bargaining body, competition policies that limit the monopolies of dominant firms, tax and subsidy structures that do not artificially favor capital at the expense of labor, public investment in skills and technologies for creating tasks, and expanding and even reforming corporate governance.\" If the pace of technological change outpaces the adaptation of governments and institutions, Keynesian remedies will not be effective in time. From Marx to Musk: The End of Property Rights and Scarcity<p style=\"text-align: left;\">Even with a highly proactive and responsive government, deeper political and economic challenges remain.</p><p style=\"text-align: left;\">The report raises a philosophically significant phenomenon: Karl Marx's vision of \"machines\" and full automation nearly 200 years ago bears a striking resemblance to Elon Musk's ultimate vision for AI today.</p><p style=\"text-align: left;\">In this endgame of full automation, humanity solves the age-old problem of \"scarcity.\"</p><p style=\"text-align: left;\">But this is accompanied by the disintegration of fundamental social consensus.</p><p style=\"text-align: left;\"> \"In this fully automated scenario, the very essence of capitalism collapses. Political questions no longer revolve around how to subsidize wages. They become more fundamental to social structures: if scarcity is resolved, what is the meaning of property rights?\" As Keynes famously asked in his 1930 essay, \"The Possible Economic Prospects for Our Descendants\": When humans no longer need to labor for survival, what is the meaning of human existence? While these topics seem grand, Deutsche Bank emphasizes that, given the existential nature of these questions, they are absolutely relevant to current financial market pricing. Deutsche Bank's Two End-Game Deductions and Pricing Logics For the market, it is essential to consider both the \"transition period to the end game\" and the \"end game itself.\" Deutsche Bank divides the future world into two extreme parallel universes and provides a clear asset pricing logic. Endgame 1: AI Completely Replaces Labor (Towards Extreme Disruption) This is a world where AI can quickly and (almost) completely replace human labor. From a living standards perspective, this is a euphoric world where the problem of economic scarcity is permanently solved. But Deutsche Bank warns that the road to it will be \"the most disruptive and uncertain.\" Macroeconomic Characteristics: Rising unemployment, continued pressure on government intervention, and escalating social conflict. An endless game will unfold between capital owners and labor over resource allocation. Market Pricing Logic: The macroeconomy will face extremely strong deflationary pressures, and real interest rates will structurally and continuously decline. Due to the extreme efficiency of AI, corporate profitability will soar. Stock and Foreign Exchange Performance: Despite soaring profits, the stock market will be mired in prolonged uncertainty and volatility. The logic is that the risk of corporate confiscation (such as extremely high taxes or nationalization) will increase significantly, and the distribution of profits among different stakeholders will remain unresolved. In the foreign exchange market, Deutsche Bank explicitly points out: \"The currencies of countries that can most successfully manage this smooth transition are most likely to reap the greatest benefits.\" Endgame Two: AI is merely an enabling technology (history repeating itself) In this world, AI does not trigger a singularity, but rather, like all innovations of the 20th century, it is merely an augmentation technology. Macroeconomic Characteristics: This is a coherent world. The limitations of technology adoption, gradual institutional evolution, and Keynesian countercyclical fiscal policies will be effective. Despite persistent distributional conflicts and labor market pains, new jobs will always be found. Market pricing logic: In stark contrast to the first endgame, macroeconomic indicators here will point upwards. Stock and currency market performance: Inflation levels, real interest rates, and the stock market are all more likely to move higher. Deutsche Bank concludes: \"History will rhyme, not break, as it has for the past few decades.\" What should we look at now? Deutsche Bank points out that the purpose of this report is not to provide an absolute prediction, but to establish an analytical framework. In this extremely broad range of results, the debate about the macroeconomic impact of AI will certainly not cease in the short term. From an investor's perspective, how should we observe the progress of the AI ​​economy's evolution? Deutsche Bank has identified clear \"observation indicators\": Qualitative changes in labor market data: Are we beginning to observe a rise in structural unemployment? Has the already declining share of labor compensation entered a trajectory of accelerated downward spiral? Shifts in fiscal and antitrust policies: How willing is the government to adopt proactive fiscal and institutional policies? Has it begun to strongly implement income redistribution? Has it taken substantial antitrust preventative measures against monopolistic capital conglomerates (tech giants)?</p></div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/95c73d0d50a7276d524d2a52e7dded83.jpg",
            "link": "https://www.coinlive.com/news/did-marx-already-predict-the-future-of-ai",
            "pub_date": "2026-02-27 19:20:09",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 250531,
            "title": "Is this the 2028 diamond bottom for BTC?",
            "description": "<div class=\"share___SVvtl\"><div><p style=\"text-align: left;\">Author: Chain Research Society Source: X, @lianyanshe</p><p style=\"text-align: left;\">Will now be the diamond bottom for BTC in 2028?</p><p style=\"text-align: left;\">2026 will undoubtedly be Bitcoin's worst start to the year in nearly a decade.</p><p style=\"text-align: left;\">From the dismal start on January 1st until now, BTC has fallen from $109K to $65K, a 24% drop year-to-date. ETH fared even worse, falling 34%. This is BTC's worst start to the year since 2016.</p><p style=\"text-align: left;\">But this time is different; this crash seems to have no reason.</p><p style=\"text-align: left;\"> </p><h2 style=\"text-align: left;\">I. The deepest fear is a drop without reason</h2><p style=\"text-align: left;\">The 73% drop in 2018 was due to the bursting of the ICO bubble, leaving countless worthless cryptocurrencies worthless. The 77% drop in 2022 was due to the Luna collapse, the collapse of Three Arrows Capital, and the disappearance of FTX. Every time there's a crash, you know why.</p><p style=\"text-align: left;\">Every time, you know where the enemy is, and you know how long it will take to rebuild trust. So what about 2026?</p><p style=\"text-align: left;\">• No exchange collapses</p><p style=\"text-align: left;\">• No algorithmic stablecoin collapses</p><p style=\"text-align: left;\">• No hacker attacks</p><p style=\"text-align: left;\">• No country banning BTC</p><p style=\"text-align: left;\">It just dropped. Fortune magazine said: the worst start to the year in history, but there's no clear catalyst for a crash.</p><p style=\"text-align: left;\"> A market crash with a valid reason will see a retaliatory rebound after the negative news has been fully priced in; however, a fall without a reason is like a slow, painful loss. When everyone is asking why the market is falling but can't get an answer, panic will amplify exponentially. II. Have the bottom-fishing indicators bottomed out? Current quantitative indicators show that the market has entered a vacuum zone of irrational selling. According to the latest data on February 25th, our bottom-fishing model currently only has a 1/5 signal, far from the true bottom (data source: fuckbtc). MVRV &lt; 1.0 Price ≤ 200-week moving average Price <p25 a=\"\" active=\"\" although=\"\" and=\"\" anymore.=\"\" approaching=\"\" are=\"\" as=\"\" at=\"\" be=\"\" becomes=\"\" been=\"\" beneath=\"\" billion=\"\" billion.=\"\" both=\"\" btc=\"\" built=\"\" capital=\"\" cases=\"\" cleared.=\"\" cold=\"\" contraction=\"\" crashed=\"\" crisis=\"\" cutting=\"\" days.=\"\" declines=\"\" defenses=\"\" depth=\"\" despite=\"\" doomsday=\"\" down=\"\" dry=\"\" end=\"\" extreme=\"\" extremely=\"\" fear=\"\" floating=\"\" for=\"\" four=\"\" ftx=\"\" funds=\"\" further=\"\" greed=\"\" half=\"\" has=\"\" have=\"\" higher=\"\" historically=\"\" ice:=\"\" iii.=\"\" illogical.=\"\" in=\"\" indicating=\"\" is=\"\" large=\"\" last=\"\" late=\"\" leaving=\"\" level=\"\" leverage=\"\" loss=\"\" losses=\"\" machines=\"\" magnitude=\"\" market=\"\" mode.=\"\" most=\"\" net=\"\" not=\"\" now=\"\" occurred=\"\" of=\"\" only=\"\" outflow=\"\" over=\"\" people=\"\" positions=\"\" positive=\"\" pressure=\"\" price=\"\" psychological=\"\" range=\"\" realized=\"\" retreated=\"\" saw=\"\" selling=\"\" sentiment=\"\" shares=\"\" short-term=\"\" shouldn=\"\" shut=\"\" shutdown=\"\" signals=\"\" signals:=\"\" significant=\"\" similar=\"\" some=\"\" still=\"\" strong=\"\" tends=\"\" than=\"\" that=\"\" the=\"\" then.=\"\" there=\"\" these=\"\" this=\"\" thoroughly=\"\" times=\"\" to=\"\" trapped=\"\" up=\"\" usdt=\"\" was=\"\" whales=\"\" when=\"\" who=\"\"><h4 style=\"text-align: left;\"> ➤ My View</h4><p style=\"text-align: left;\">I don't predict this is the bottom (most likely not)</p><p style=\"text-align: left;\">But I know:</p><p style=\"text-align: left;\">• Extreme fear (11) has already appeared</p><p style=\"text-align: left;\">• Historically, unexplained drops often fall deeper, but rebounds are also stronger</p><p style=\"text-align: left;\">• At the $65K level, the margin of safety is already relatively high</p><p style=\"text-align: left;\">Those who said $3K was the bottom in 2018 were right. Those who said $16K was the bottom in 2022 were right. Those who said $64K was the bottom in 2026—may be right, may be wrong.</p><p style=\"text-align: left;\">I don't know.</p><p style=\"text-align: left;\">I don't know.</p><p style=\"text-align: left;\"> But what I do know is that panic always passes, and once trust is rebuilt, prices will return. If you're currently holding no positions, at least you've avoided the most severe pullback. Historically, sentiment often bottoms out before prices. History repeats itself: After the Mt. Gox hack in 2015, many believed trust couldn't be rebuilt; but looking back, every seemingly inexplicable darkest moment ultimately became a diamond bottom leading to the next cycle. $64,000 in 2026 might be the number you most regret not adding to your position when you look back in 2028.</p></p25></p></div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/b09356eea2b7ea7425ac034643059866.jpg",
            "link": "https://www.coinlive.com/news/is-this-the-2028-diamond-bottom-for-btc",
            "pub_date": "2026-02-27 19:23:59",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 250529,
            "title": "Wall Street surpasses 21 million BTC with paper Bitcoin: What paper Bitcoins are available on the market?",
            "description": "<div class=\"share___SVvtl\"><div><p><em>Note: The recent lawsuit filed by Jane Street has sparked suspicion in the crypto community that Jane Street manipulated the BTC market through ETFs, further fueling concerns about so-called \"paper Bitcoin.\" Crypto blogger Bruce identified four types of paper Bitcoin, translated by Jinse Finance, as follows:</em></p><p>Wall Street couldn't break the 21 million on-chain Bitcoin hard cap, so they built a massive off-chain \"paper Bitcoin\" casino to suppress prices.</p><p>Below are the four categories of Bitcoin derivatives and the extent to which they allow institutions to cheat.</p><h2>Category 1: \"Pure Paper Bitcoin\"</h2><p>Cheating Level: Unlimited</p><p>Products: Perpetual contracts (Perps), CME cash-settled futures, cash options.</p><p> **Cheating Method:** 100% Paper Trading. Neither party holds actual Bitcoin. They simply bet on price with fiat currency. This creates an infinite synthetic supply and allows billions of dollars in leverage to manipulate price discovery, rather than genuine scarcity.\n**Category 2: Re-collateralization**\n**Cheating Level: High/Systemic Risk**\n**Products:** Prime Brokerage Services, OTC Swaps, Institutional Lending.\n**Cheating Method:** You deposit 1 physical Bitcoin. They lend it to a hedge fund to short it, and the hedge fund then sells it to a new buyer. Now, multiple people believe they own the exact same Bitcoin. This \"shadow finance\" multiplies the paper circulation and can lead to crashes like FTX/Celsius.\n**Category 3: Operational Short Selling**\n**Cheating Level: Temporary but Serious**\n**Products:** Spot Bitcoin ETFs (e.g., IBIT, FBTC). **Cheating Method:** The U.S. Securities and Exchange Commission's (SEC) \"Cash Create\" model + Reg SHO exemption. Authorized Participants (APs) can legally sell you ETF shares they haven't yet created. Due to the T+6 settlement delay, they absorb your spot buying pressure with synthetic shares, thus slowing down price increases.\n**Category 4: \"Fully Supported\"**\n**Cheating Level: Zero.**\n**Products:** Physically Delivered Futures, Transparent On-Chain Bitcoin\n**Facts:** These products require locking up 1:1 real Bitcoin before trading. They do not artificially increase the supply. Unfortunately, they only account for a small fraction of the total trading volume.\n**Conclusion:**\n**Wall Street uses paper derivatives to dilute your purchasing power and turn scarce assets into a fractional-reserve game.**\n**Break their casino and force genuine price discovery in one way: Buy real spot. Withdraw to a cold wallet.**</p></div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/268b027f9bf25fe41008c9157302d014.jpg",
            "link": "https://www.coinlive.com/news/wall-street-surpasses-21-million-btc-with-paper-bitcoin-what",
            "pub_date": "2026-02-27 19:07:28",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 250526,
            "title": "Citrini's lingering echo",
            "description": "<div class=\"share___SVvtl\"><div><p style=\"text-align: left;\">Author: SpecialistXBT</p><p style=\"text-align: left;\">Excellent articles can confuse the market with \"scenario projections\" as \"real-world predictions.\"</p><p style=\"text-align: left;\">On February 22, 2026, a report titled \"The 2028 Global Intelligence Crisis\" ignited social media and financial markets, garnering over 27 million views. On the day of its release, IBM's stock plummeted 13%, and the stock prices of DoorDash, American Express, KKR, and many other companies fell by more than 6%.</p><p style=\"text-align: left;\">This report was written by James van Geelen, founder of Citrini Research.</p><p style=\"text-align: left;\"> This 33-year-old researcher boasts over 180,000 followers on X, and is ranked number one among financial authors on Substack. He specializes in thematic equity investing and global macroeconomic research, known for his cross-asset and lateral analysis style. His real-world portfolio has returned over 200% since 2023. The report, presented as a scenario, imagines a future set in 2028: AI will massively replace white-collar workers within just two years, leading to a decline in consumption, software asset defaults, and credit tightening, ultimately pushing the economy into a distorted state of \"technological boom\" and \"social recession.\" Van Geelen notes at the beginning of the article: \"This article describes a possible scenario, not a prediction.\" But the market clearly lacks the patience to distinguish between the two. However, more noteworthy than the brief market panic is the widespread discussion this article has sparked over the past few days. From academia to the investment community, from Wall Street to the Chinese internet, more than a dozen articles from different perspectives have emerged. Rather than blindly accepting only one extreme conclusion, perhaps we can piece together a clearer picture of the future from the \"disagreements and overlaps\" of various viewpoints. What Citrini Said: The logical thread in Citrini's article is not complex: the leap forward in AI capabilities leads to large-scale replacement of white-collar jobs → rising unemployment causes a contraction in consumer spending → structured financial products with SaaS as their underlying asset face a wave of defaults → credit tightening spreads to the broader financial system → the economy falls into a distorted state of \"technological prosperity\" and \"social recession.\" Each link in this causal chain is not without basis. However, connecting them end-to-end and extrapolating them to a crisis requires a series of rather radical assumptions. There are many ways to dissect this chain. Let's explore it along three core sub-arguments: the speed and scale of labor replacement, the transmission mechanism of demand collapse, and the possibility of a financial crisis, to see what different voices are arguing about around each link. </p><h2 style=\"text-align: left;\">No destruction, no construction</h2><p style=\"text-align: left;\">Citrini's deduction begins with the large-scale replacement of white-collar labor by AI. In his narrative, this process accelerates sharply between 2026 and 2028, with practitioners in fields such as law, financial analysis, software development, and customer service bearing the brunt.</p><p style=\"text-align:center\"><img src=\"https://img.jinse.com.cn/7436295_watermarknone.png\"/></p><p style=\"text-align: left;\"><em>Changes in the percentage of corporate spending on AI model vendors and online workforce platforms, grouped by industry's AI exposure</em></p><p style=\"text-align: left;\">There is indeed evidence to support Citrini's view.</p></div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/4c678b8cb2309bb3dcc599ceed09f7ed.jpg",
            "link": "https://www.coinlive.com/news/citrini-s-lingering-echo",
            "pub_date": "2026-02-27 18:57:28",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 250512,
            "title": "What are the reasons behind Vitalik's dumping of nearly 20,000 ETH and the founder's market manipulation?",
            "description": "<div class=\"share___SVvtl\"><div><p style=\"text-align: left;\">Author: Sanqing, Foresight News</p><p style=\"text-align: left;\">In February 2026, the crypto market continued its downturn, with Ethereum experiencing its sixth consecutive month of decline, with a maximum monthly drop of nearly 30%. During this period, addresses associated with Ethereum co-founder Vitalik Buterin executed 532 sell orders. According to Etherscan data, the last sell order was completed at 19:40 on February 26th, with the address executing the sell order cumulatively selling approximately 19,326 ETH.</p> ... <p style=\"text-align:center\"><img src=\"https://img.jinse.com.cn/7436262_watermarknone.png\"/></p><p style=\"text-align: center;\"><em>Image source: Bitget Market Data</em></p><h2 style=\"text-align: left;\">Three \"transparencies\": Announcement, Purpose, and Execution Disclosure</h2><p style=\"text-align: left;\">Vitalik's plan for this fund transfer was announced in advance. On January 30, Vitalik published a long article through his X personal account, announcing that he would withdraw 16,384 ETH (worth approximately $44 million at the time) from his personal wallet and gradually monetize it.</p><p style=\"text-align: left;\"> </p><p style=\"text-align:center\"><img src=\"https://img.jinse.com.cn/7436263_watermarknone.png\"/></p><p style=\"text-align: left;\"><em>Image source: Vitalik's tweet</em></p><p style=\"text-align: left;\">He explained that this move was his personal response to the Ethereum Foundation (EF) entering a \"moderate austerity\" phase. EF plans to reduce its annual spending from 15% of treasury to 5% within 5 years, focusing more on core protocol development. </p><p style=\"text-align: left;\">Vitalik also detailed the use of the funds in the post. The funds from this sale will be used to fund open-source projects and public goods, with a focus on privacy technologies (ZK proofs, fully homomorphic encryption FHE, differential privacy), secure hardware, verifiable computing, encrypted communication, native-first software, open-source operating systems, biotechnology/public health tools, and governance coordination mechanisms.</p><p style=\"text-align: left;\"> These areas are mostly peripheral but crucial sectors after EF tightening, and Vitalik emphasized that this was his personal decision to share the responsibility for EF tightening. Furthermore, the entire sale process was fully traceable through on-chain tools. Vitalik used a single address (0xfEB016D0D14AC0Fa6d69199608B0776d007203B2) and executed the sale in small batches via a single protocol (CoW Swap) to minimize market impact. An \"unexpected\" event: the execution amount was slightly higher than initially announced. Despite high transparency, the execution result differed slightly from the initial announcement. The actual amount sold by Vitalik's address exceeded the previously announced 16,384 ETH, totaling approximately 19,326 ETH (exceeding the initial announcement by approximately 2,942 ETH). The sale began in the early morning of February 3rd, paused for about 10 days, and resumed on the 22nd, with the acceleration mainly occurring in the last two days. Specifically, approximately 4211.5 ETH were sold on February 5th, approximately 2283 on the 25th, and approximately 6297 on the 26th. Data source: Etherscan &amp; Bitget | Note: Data on the 26th is up to the time of the last sale. Vitalik has not yet provided further explanation regarding the fact that the announced total amount is only a rough target, or that undisclosed changes occurred during the execution process. Vitalik has stated, \"Since 2018, I have never sold ETH for personal wealth accumulation. All proceeds from sales have been donated, used to fund open-source projects, or for charitable causes.\" [Image source: Vitalik Farcaster] Furthermore, compared to some projects that quietly sell off their tokens, leading to subsequent collapses or trust crises, Vitalik's \"openly selling\" seems healthier. This ETH sale plan, at least superficially, continues the path of public disclosure and non-personal profit-seeking. However, objectively speaking, the founder's accelerated selling during a rebound after a continuous price decline may negatively impact community and investor confidence. Market sentiment was already fragile, and Vitalik's actions could amplify financiers (FUD) and even compound the overall bear market pressure, pushing ETH further down. In the short term, this could exacerbate selling by holders, impacting Ethereum's rebound trend and ecosystem stability.</p></div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/d483720885d82bdab3718f58cc6c3368.jpg",
            "link": "https://www.coinlive.com/news/what-are-the-reasons-behind-vitalik-s-dumping-of-nearly-20-000",
            "pub_date": "2026-02-27 18:04:43",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 250509,
            "title": "Nearly half of the workforce was laid off, yet the stock price rose by 23%.",
            "description": "<div class=\"share___SVvtl\"><div>On February 26, 2026, Block released its Q4 financial report, and its stock price surged by over 23% in after-hours trading. Its market capitalization increased by approximately $2.4 billion overnight. On the same day, 4,000 employees received termination notices. This contrast is the cruelest footnote to our times. A letter ignited Silicon Valley. What ignited all of this was a letter. That day, Block co-founder Jack Dorsey sent an open letter to all employees. He wrote: \"Smart tools have changed what it means to build and run a company. A significantly smaller team, using the tools we are building, can get more done and do it better.\" The implication was clear: the company was determined to achieve higher productivity with fewer, more efficient employees. This isn't a struggling company cutting back on spending. In Q4 2025, Block's total gross profit was $2.87 billion, a 24% year-over-year increase; full-year gross profit exceeded $10.36 billion. Cash App's gross profit increased by 33% year-over-year, with adjusted earnings per share of $0.65, exceeding analysts' expectations. Strong earnings, soaring stock price, then 40% layoffs. This logic has never been followed before. Block's employee count ballooned from 3,835 at the end of 2019 to over 10,000 during the pandemic. Dorsey admitted in a letter that this was a misjudgment of growth. The emergence of AI gave him the opportunity to correct this mistake. It wasn't that the company became weaker, but rather that AI made the company stronger. Dorsey calls this \"intelligent native\"—a way of redesigning the company with AI as the core productivity unit. AI has already started doing the work for you. The \"intelligent tools\" Dorsey refers to are not generic interfaces like ChatGPT. Over the past two years, Block has quietly built an internal AI ecosystem called \"Goose.\" Deeply integrated with over 150 software and data services within the company via the Model Context Protocol (MCP), it can read real-time financial data and perform actions directly within the codebase, invoicing system, and data dashboards, rather than simply generating text suggestions. The numbers speak for themselves: In customer service, AI currently handles approximately 60% of Cash App cases; in engineering, since the introduction of AI-assisted programming tools in September 2025, the amount of production code delivered per engineer has increased dramatically. In Q3 2025, Block launched the \"G2\" proxy interface built on Goose. This completely transformed the way employees work—the remaining 6,000 employees no longer engage in data entry or basic code writing, but instead use the G2 interface to command AI clusters to complete complex tasks. Legal document review, HR screening, and initial editing of video assets are now all handled by G2. People have transformed from \"operators\" to \"curators.\" The newly launched \"Neighborhoods\" feature further demonstrates the efficiency of this model—from concept to launch, it took less than six months. Dorsey envisioned that 6,000 people, plus Goose, could accomplish what 10,000 people couldn't. This logic is the true underlying support for this round of layoffs. \"A Gentle Knife\" Compared to Musk's layoffs after acquiring Twitter in 2022, Dorsey's methods are drastically different. Musk's approach was: suddenly locking down the system, issuing a \"hardcore\" ultimatum, offering only the legally mandated minimum compensation, subsequently triggering numerous lawsuits. Dorsey's approach is: a base salary of at least 20 weeks (with an additional week for each additional year of service; the industry standard is reportedly only 12 to 14 weeks), 6 months of full health insurance, a $5,000 cash transition allowance, and stock option vesting extended to the end of May 2026. Employees can also retain company-issued computers and mobile devices. This plan is almost at the top of the curve in the history of tech industry layoffs. But this doesn't diminish its sharpness. According to feedback from Wired magazine and the anonymous internal platform Blind, Block's internal culture is on the verge of collapse. Dorsey accused some employees of \"going through the motions.\" Attributing structural optimization to individual performance triggered widespread anxiety among retained employees. Those who remained faced double the workload while constantly worrying about being targeted in the next \"AI performance evaluation.\" Generous severance packages mitigated the risk of class-action lawsuits and helped Dorsey maintain a \"respectable employer\" image, diverting attention from the AI ​​efficiency narrative to the reality of 4,000 families losing their livelihoods. This \"cold-blooded business decision,\" wrapped in an \"emotional all-staff letter,\" constitutes a complex management model. Why Wall Street is cheering for layoffs. The logic of the capital market is faster than anyone else's. The stock price surged 23% in after-hours trading, adding approximately $2.4 billion to the company's market capitalization. Roughly speaking, this equates to creating about $600,000 in book value for the company for every employee laid off. Longer-term calculations are even more astonishing. In 2026, Block is projected to generate approximately $12.2 billion in gross profit. With fewer than 6,000 employees, this translates to a gross profit per employee approaching $2 million, far exceeding top tech companies like Google and Meta. In 2026, with the Federal Reserve maintaining high interest rates and tech company financing tightening, the capital market's focus has shifted from \"growth premium\" to \"profit premium\" and \"unit productivity premium.\" Block has successfully surpassed the \"40 rule\" (the sum of revenue growth rate and profit margin must be no less than 40%) and completed a $790 million stock buyback in Q4, bringing the total buyback amount for the year to $2.3 billion. The board of directors understood this strategy perfectly. Block's case may force the entire fintech industry to reassess its workforce cost structure. Layoffs \"in the name of AI\" are becoming an attractive strategic script. If CEOs find that announcing \"AI to replace layoffs\" can generate a stock price increase of over 20%, large-scale white-collar layoffs will no longer need an economic recession as a justification. Summary: From \"layoffs due to weaknesses\" to \"layoffs due to strengths,\" this shift poses an unprecedented challenge to the job security of white-collar workers. Block is simply the first to publicly acknowledge this. When a company cuts its workforce by 40% and its stock price surges in the opposite direction, it sends a clear signal to the market: In future corporate valuations, the number of people will no longer be considered an asset, but rather an \"operational friction\" that needs to be optimized through technology. Whether Dorsey's gamble succeeds depends on whether the 6,000 remaining employees can truly master Goose, whether the AI-assisted code can withstand the test of time in complex systems, and whether a company that has been streamlined to the extreme can continue to maintain its pace of innovation. The answer may not be known for several years. But the experiment has already begun, and no one knows where it will end.</div></div>",
            "image": "https://img.jinse.com.cn/7436259_small.png",
            "link": "https://www.coinlive.com/news/nearly-half-of-the-workforce-was-laid-off-yet-the",
            "pub_date": "2026-02-27 17:50:06",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 250496,
            "title": "Cryptocurrency venture capital in early 2026",
            "description": "<div class=\"share___SVvtl\"><div><p style=\"text-align: left;\">Author: insights4vc Translator: Shan Ouba, Jinse Finance</p><p style=\"text-align: left;\">As 2025 draws to a close, the venture capital market presents a stark contrast, with a market structure increasingly clearly exhibiting a \"winner-takes-all\" pattern. The momentum-driven underwriting model of 2021 has been replaced by more rigorous, data-driven investment strategies.</p><p style=\"text-align: left;\">Global</p><p style=\"text-align: left;\">Investable capital remains near historical highs at approximately $1.3 trillion, but its annual composition now presents a pressure rather than a benefit. A significant portion of this capital is concentrated in funds established between 2022 and 2023, which must invest in a market environment characterized by tighter liquidity, higher due diligence standards, and significantly higher criteria for judging \"outstanding\" investment results.</p><p style=\"text-align: left;\">Funding activity also reflects this adjustment.</p><p style=\"text-align: left;\">Funding activity also reflects this adjustment.</p> In 2025, US venture capital funding faces its most severe challenge in a decade: total funding has fallen to $66.1 billion, with only 537 funds raising capital, approximately 30% of the number of funds raised in 2021. The core driver is excess liquidity. A large number of unlisted venture-backed companies remain unsold, resulting in insufficient profit distributions to limited partners (LPs), making it more difficult to reinvest funds in new projects. <figure><p style=\"text-align:center\"><img alt=\"Private Equity 2026\" data-attrs=\"{\" equity=\"\" fetchpriority=\"high\" i=\"\" images=\"\" imagesize=\"\" insights4vc.substack.com=\"\" png=\"\" public=\"\" sizes=\"100vw\" src=\"https://img.jinse.com.cn/7436237_watermarknone.png\" srcset=\"https://substackcdn.com/image/fetch/$s_!wVjc!,w_424,c_limit,f_auto,q_auto:good,fl_progressive:steep/https% 3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F44f35b1d-439b-4a4d-98f6-a17080cfb1fb_2174x1150.png 424w, https://substackcdn.com/image/fetch/$s_!wVjc!,w_848,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2 F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F44f35b1d-439b-4a4d-98f6-a17080cfb1fb_2174x1150.png 848w, https://substackcdn.com/image/fetch/$s_!wVjc!,w_1272,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F44f35b1d-439b-4a4d-98f6-a17080cfb1fb_2174x1150.png 1272w, https://img.jinse.com.cn/7436237_watermarknone.png 1456w\" substack-post-media.s3.amazonaws.com=\"\" title=\"Private Equity 2026\"/></p><figcaption style=\"text-align: center;\">Global Private Equity Capital by Fund Type</figcaption></figure><p left=\"\" style=\"text-align: It is estimated that there are currently about 32,000 venture-backed companies with unrealized value of approximately $3.8 trillion. The subsequent impact is mechanical. By the end of 2025, 53% of limited partners (LPs) indicated that uncollected prior commitments limited their ability to make new investments, a 15 percentage point increase from the previous year. This environment creates a self-reinforcing consolidation cycle. Large fund managers with superior DPI (dividend payout ratio) and ranking in the top 25% receive a disproportionate share of new investment commitments, while emerging and mid-sized fund managers face a structurally more challenging market environment, with LPs less willing to underwrite long-term book value (TVPI) without reliable cash distribution channels. Andreessen Horowitz's $15 billion fundraising plan, to be completed in early 2026, is a prime example of this consolidation trend, even with median fund managers having significantly longer fundraising cycles and more stringent conditions. &lt;/p&gt;&lt;h2 style=\" text-align:=\"\"><strong>Shifting Towards Venture Growth and Expansion Funds</strong></p><p style=\"text-align: left;\">With IPOs remaining sporadic and strategic M&amp;A remaining cautious, the venture capital growth sector has become a focal point for capital deployment and liquidity engineering. In 2025, the annualized deal size of the venture capital growth sector climbed to $150.2 billion, surpassing the record of $91.6 billion set in 2021. This was largely driven by a few large AI funding rounds, including OpenAI's $40 billion investment and massive funding rounds for xAI and Anthropic. This not only indicates that \"AI is hot,\" but also that the most valuable companies are extending their private run and increasingly funding their growth through the private market rather than the IPO cycle.</p><p style=\"text-align: left;\">To maintain longer horizons without mandatory valuation resets, general partners (GPs) are increasingly relying on \"internal financing\" and deferred funds, aiming to stabilize equity structures and help companies ultimately achieve liquidity within a manageable timeframe.</p><p style=\"text-align: left;\"> This trade-off is structural: since 2020, reliance on these mechanisms has led to a significant expansion in venture capital net asset value, but actual returns have lagged, exacerbating tensions between fund managers and limited partners (LPs), who now focus not only on market valuations but also on subsequent returns (DPI). While cutting-edge sectors, particularly artificial intelligence, continue to command high valuation premiums, the long tail of the venture capital ecosystem faces more severe adjustments. In 2025, the median pre-funding valuation of US venture capital firms rose, with some sectors even exceeding 2021 levels, but this growth was concentrated in a few considered winners. Approximately 15% of venture capital rounds in 2025 were valuation decline rounds, approaching the ten-year high reached in 2024. This pressure is particularly pronounced among unicorn companies: it is estimated that, under updated market-clearing assumptions, 222 of the 857 active unicorn companies in the US may have actually fallen below the $1 billion valuation threshold. These equity resets directly lead to pressure on equity structure tables. As new investors seek downside protection, structured funding rounds with higher liquidation preference and “pay-to-participate” clauses are becoming increasingly common. The costs are typically borne by founders and employees, manifesting as equity dilution and incentive compression, which can harm the company’s long-term development. This is the real-world significance of the “software industry rethink”: the mainstream value creation model has shifted from pursuing growth at all costs to more rigorous unit economics, faster profit paths, and operational plans capable of withstanding higher discount rates. Since the beginning of 2025, private equity strategies have shifted from a defensive posture to a more sustainable and rigorous balance. Its core philosophy has shifted from \"surviving until 2025\" to rebuilding the revenue creation model in the face of scarce liquidity and unreliable public market exit mechanisms. For venture capital, this means stricter underwriting, more aggressive portfolio management, and more focused distribution channels. For acquisitions, it means higher operational intensity and a renewed emphasis on initial value creation. In the venture capital and acquisition space, the competitive landscape is shifting from capital supply to replicable operational excess returns, corporate governance, and liquidity management. The Evolution of the GP and LP Narrative General partners have gradually abandoned passive holding strategies. In the past 12 months, more and more companies have begun to adopt \"comprehensive potential due diligence,\" a multidisciplinary pre-closing process that integrates product and technology assessment, marketing execution plans, and increasingly AI-driven capability assessments. The real change is that due diligence is no longer just about mitigating downside risk, but about developing a concrete operational plan for immediate execution after closing. One example cited by the market is OneStream Software's privatization in early 2026, where investors reportedly merged commercial and technical due diligence into a single, integrated workflow to shorten the time to immediate post-closing impact. Meanwhile, limited partners (LPs) are becoming increasingly assertive. Their definition of success is no longer so uniform; diversification and portfolio construction are gaining more weight beyond absolute returns, especially in acquisition allocations. However, patience is conditional. LLPs are more willing to accept longer investment horizons if general partners can demonstrate a viable, repeatable profit model that goes beyond simply increasing asset prices. The key shift is that without a reliable path to realizing returns (whether through exits, secondary market transactions, continuation schemes, or structured liquidity initiatives), simply relying on \"good total value returns\" is no longer convincing. </p><h3 style=\"text-align: left;\"><strong>Macroeconomic Repricing and the Regression of Execution Risk</strong></h3><p style=\"text-align: left;\">In early 2025, market sentiment improved with the easing of financial conditions and the reopening of credit markets. However, the year also saw cyclical shocks and rapid repricing events, repeatedly disrupting trading. Policy uncertainty and inflation sensitivity led to divergences in future expectations between buyers and sellers, thus slowing down the trading process and resetting valuation anchors. By the second half of 2025, market activity began to rebound as market participants adjusted to new capital costs and accepted that the baseline scenario was not an immediate recession, but rather a market environment with higher interest rates and greater selectivity. The rebound was most pronounced in North America and was mainly concentrated in large, originator-driven transactions, further reinforcing the overall trend of higher concentration at the high end of the market.</p> The most significant behavioral shift is the widespread acceptance that the era of loose monetary policy is over, and returns are now built more on operational performance than on price-to-earnings ratio expansion. In the previous cycle, a typical acquisition target might have been a 2.5x return on capital (MOIC) while achieving mid-single-digit EBITDA growth, thanks to lower borrowing costs and higher leverage. In the current equilibrium, however, achieving similar goals requires higher potential earnings growth (typically between 10% and 12%) and more rigorous execution of value creation programs, due to rising financing costs and more conservative leverage. <figure><p style=\"text-align:center\"><img alt=\"Private Equity 2026\" data-attrs=\"{\" equity=\"\" i=\"\" images=\"\" imagesize=\"\" insights4vc.substack.com=\"\" loading=\"lazy\" png=\"\" public=\"\" sizes=\"100vw\" src=\"https://img.jinse.com.cn/7436238_watermarknone.png\" srcset=\"https://substackcdn.com/image/fetch/$s_!cDMr!,w_424,c_limit,f_auto,q_auto:good,fl_progressive:steep/https% 3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F46bb21ee-596f-4243-9bea-02129e456f22_2638x1008.png 424w, https://substackcdn.com/image/fetch/$s_!cDMr!,w_848,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2 F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F46bb21ee-596f-4243-9bea-02129e456f22_2638x1008.png 848w, [Image URLs: https://substackcdn.com/image/fetch/$s_!cDMr!,w_1272,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F46bb21ee-596f-4243-9bea-02129e456f22_2638x1008.png 1272w, https://img.jinse.com.cn/7436238_watermarknone.png 1456w\" substack-post-media.s3.amazonaws.com=\"\" title=\"Private Equity 2026\"/></p><figcaption style=\"text-align: center;\">Source: Bain &amp; Company, \"Global Private Equity Report 2026\".</figcaption><p> ... This \"alpha gap\" is forcing general partners (GPs) to transform into system builders. The most competitive firms are specializing in operational capabilities, talent, data infrastructure, and replicable marketing strategies, and increasingly leveraging internal AI resources to improve productivity and decision-making quality. Meanwhile, management firms are under pressure to generate profits as limited partners (LPs) increasingly seek fee reductions and commission-free co-investment, while the cost base is rising to support deeper due diligence, operational teams, and more complex investor relations. Ultimately, scale, processes, and verifiable cash flow outcomes are becoming the primary moats in the market. The rise of the secondary market as a primary liquidity channel is converging on a bottleneck: liquidity. In a market environment characterized by sporadic IPOs, selective M&amp;A, and increasingly longer fund durations, venture capital needs a scalable mechanism to convert book value into actual returns without waiting for a perfect listing window. It is against this backdrop that the secondary market has been repositioned, transforming from an opportunistic, peripheral tool into a core component of market infrastructure. In effect, the secondary market has become a systemic pressure relief valve, supporting limited partner (LP) rebalancing, general partner (GP)-led duration management, and direct corporate liquidity programs that incentivize talent while keeping companies private. According to data compiled by Theory Ventures and PitchBook, the composition of venture capital exits has changed significantly over the past decade. In 2015, secondary market transactions accounted for only a small fraction of realized exit value. By September 30, 2025, its share had climbed to about one-third, on par with exit methods such as initial public offerings (IPOs) and mergers and acquisitions (M&amp;A). The key is not the specific percentage, but its structural impact: liquidity is no longer defined solely by \"exit events,\" but rather shifts to a repeatable, programmatic allocation pathway. </p><figure><p style=\"text-align:center\"><img alt=\"vc exit type\" data-attrs=\"{\" exit=\"\" i=\"\" images=\"\" insights4vc.substack.com=\"\" l=\"\" loading=\"lazy\" png=\"\" public=\"\" sizes=\"100vw\" src=\"https://img.jinse.com.cn/7436239_watermarknone.png\" srcset=\"https://substackcdn.com/image/fetch/$s_!CWrI!,w_424,c_limit,f_auto,q_auto:good,fl_progressive:steep/https% 3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F3d85da88-4d1a-461c-8f7c-af5962746624_2922x1528.png 424w, https://substackcdn.com/image/fetch/$s_!CWrI!,w_848,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2 F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F3d85da88-4d1a-461c-8f7c-af5962746624_2922x1528.png 848w, [Image URLs: https://substackcdn.com/image/fetch/$s_!CWrI!,w_1272,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F3d85da88-4d1a-461c-8f7c-af5962746624_2922x1528.png 1272w, https://img.jinse.com.cn/7436239_watermarknone.png 1456w\" substack-post-media.s3.amazonaws.com=\"\" title=\"vc exit type\" type=\"\"/></p><figcaption style=\"text-align: center;\">Venture Capital Exit Value Share by Type (2015-2025)</figcaption></figure><h2 acceleration=\"\" catalysts=\"\" for=\"\" secondary=\"\"></h2><p style=\"text-align: left;\">The expansion of the secondary market is best understood as a sustained response to the long-term private market, rather than merely a cyclical expedient. Several factors are driving the global secondary market size to reach approximately $240 billion by 2025:</p><ul class=\"list-paddingleft-2\"><li><p style=\"text-align: left;\"><strong>Longer-Term Private Assets:</strong>Companies are staying private for longer periods, increasingly using private placements and tender schemes to manage liquidity rather than rushing to go public.</p></li><li><p style=\"text-align: left;\"><strong>DPI Scarcity:</strong>Distribution pressures intensify as limited partners rebalance their portfolios and fund new allocations, resulting in a stable sell-side supply. Secondary market trading volumes surged in early 2025, consistent with the market's trend towards seeking cash returns.</p></li><li><p style=\"text-align: left;\"><strong> IPO and M&amp;A Restrictions: Even with intermittent reopenings of the public market, the window of opportunity is not long enough to clear a large inventory of late-stage private equity assets. Institutionalization of Channels: Large banks, advisors, and professional secondary market managers have expanded their operations, viewing the secondary market as a long-term growth vertical for advisory and wealth management platforms. Disruption of the Secondary Market Structure: As the secondary market shifts towards centralization, it fragments into three main structures, each with distinct stakeholder objectives. Limited Partner-Led Transactions: Limited partner-led transactions remain the foundational layer, allowing limited partners to sell fund shares to rebalance portfolios and control investment pace. Limited partner-led deals are projected to reach approximately $117 billion by 2025. Pricing improved in early 2025 as public markets stabilized, but price discrepancies remained significant. Liquidation prices for venture capital and growth funds were typically lower than a percentage of net asset value for buyout funds, reflecting their longer duration, higher uncertainty in realized returns, and greater risk associated with market capitalization. GP-led continuation funds have evolved from a distress management tool into a mainstream duration management tool. By 2025, general partner (GP)-led continuation funds are projected to reach approximately $115 billion, accounting for nearly half of total deals in some datasets. Their application is increasingly consistent: providing liquidity to limited partners (LPs) upon fund maturity while maintaining exposure to assets that the GP believes still have significant upside potential. This structure can address practical time mismatch issues, but it also raises governance and conflict-of-interest problems, making pricing, fairness opinions, and alignment of interests increasingly important. Direct Secondary Market Transactions and Tender Offers Direct secondary market offerings and tender offers are becoming increasingly common among the most valuable private companies, serving as channels for internal liquidity among employees and early investors. OpenAI's stock sale in October 2025 is a prime example, reportedly worth approximately $6.6 billion and valuing the company at nearly $500 billion. SpaceX and Stripe have also adopted tender offer-style liquidity schemes, indicating that top private companies are increasingly replacing early IPO-driven liquidity with periodic tender offer windows. Pricing Dynamics and Adverse Selection A key point of contention is whether secondary market transactions introduce adverse selection, especially when the general partner (GP) moves the strongest assets to the equity contract (CV) while leaving the weaker companies in place. The market's response has been to increase transaction complexity and strengthen underwriting. Single-asset equity contracts with high-quality collateral are fetching increasingly higher prices, reaching higher proportions of net asset value (NAV), indicating that buyers are willing to pay higher prices when corporate governance, valuation support, and alignment of interests are credible. General partners are also relying more on signaling mechanisms, including making substantial commitments at the time of the transaction to demonstrate their confidence and reduce market expectations of their one-sided options. In the market, primary market valuations often lag behind actual value, and the secondary market also plays a role in price discovery. A common phenomenon is that a company's book valuation may be high when it raises funds in the primary market, but its implied valuation may be low when it is liquidated in the secondary market, especially for software assets developed during the pandemic. In this sense, the secondary market is increasingly becoming the birthplace of \"true\" liquidation prices, even if these prices are sometimes unacceptable. The launch of Robinhood Ventures marks a significant turning point in the \"democratization\" of private equity. The project, scheduled to launch at the end of 2025, aims to bridge the gap between the $10 trillion private equity market and ordinary retail investors. Its strategic logic is clear: as companies remain private for longer periods, the wealth created during their growth phase is increasingly captured by a small elite of institutions. Robinhood plans to address this \"long-standing injustice\" through its first fund. </strong></p><h3><strong>RVI Fund I: Structure and Positioning</strong></h3><p>RVI is a publicly traded closed-end fund established under the Investment Company Act of 1940, which provides standardized information disclosure and board oversight mechanisms not available to traditional venture capital funds. This structure allows the fund to trade on the New York Stock Exchange, providing daily liquidity to retail investors and enabling it to invest in assets that would otherwise be less liquid.</p><ul class=\"list-paddingleft-2\"><li><p><strong>Financial Terms:</strong> The fund charges a 2% annual management fee (reduced to 1% for the first six months), but crucially, it does not charge performance-based fees (commissions). This makes it more cost-effective for retail investors than traditional private equity funds. Investment Channels: RVI does not require accredited investor status and has no high minimum investment amount; retail investors can purchase one share at the expected IPO price of $25. Institutional Support: Goldman Sachs serves as the sole bookrunner for RVI's $1 billion IPO scheduled for February 2026. </p></li></ul><h3><strong>Investment Logic and Portfolio Analysis</strong></h3><p></p><figure><p><picture><source><img alt=\"Robinhood Ventures\" class=\"sizing-normal\" data-attrs=\"{\" i=\"\" images=\"\" insights4vc.substack.com=\"\" loading=\"lazy\" png=\"\" public=\"\" sizes=\"100vw\" src=\"https://img.jinse.com.cn/7436240_watermarknone.png\" srcset=\"https://substackcdn.com/image/fetch/$s_!GO7_!,w_424,c_limit,f_auto,q_auto:good,fl_progressive:steep/https% 3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F6b0fbe53-2d5f-4972-b7e5-a77db2c451fd_2408x876.png 424w, https://substackcdn.com/image/fetch/$s_!GO7_!,w_848,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2 F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F6b0fbe53-2d5f-4972-b7e5-a77db2c451fd_2408x876.png 848w, https://substackcdn.com/image/fetch/$s_!GO7_!,w_1272,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F6b0fbe53-2d5f-4972-b7e5-a77db2c451fd_2408x876.png 1272w, https://img.jinse.com.cn/7436240_watermarknone.png 1456w\" substack-post-media.s3.amazonaws.com=\"\" title=\"Robinhood Ventures\" ventures=\"\"/></source></picture></p></figure><p>RVI's investment focus is concentrated on investing in a range of high-profile late-stage \"frontier\" private companies spanning multiple sectors and continuing to attract demand from institutional investors.</p> The fund's investment objective is long-term capital appreciation, and it plans to hold companies up to the IPO and public market stages, where appropriate. According to information disclosed in early 2026, the portfolio includes a number of leading late-stage companies, such as: Artificial Intelligence Software: Databricks (valued at approximately $134 billion in its December 2025 funding round). Fintech Companies: Revolut, Airwallex, and Ramp. Aerospace: Boom Supersonic. Health and Consumer Technology: Ora. Equity Arrangements: Exposure to Stripe (based on its recent valuation of approximately $159 billion). Conceptually, Robinhood's model differs from corporate venture capital projects like Coinbase Ventures. Coinbase Ventures primarily acts as a strategic ecosystem investor, focused on achieving platform goals and network effects in the cryptocurrency space. Robinhood Ventures (RVI), on the other hand, is more like a distribution product, aiming to provide packaged private market investment opportunities to Robinhood's user base through regulatory mechanisms. Its deeper strategic goal is for private assets to become a mainstream category in retail portfolios, just as thematic ETFs broadened retail investors' access to equity portfolios. Robinhood aims to achieve liquidity, user engagement, and platform connectivity at every stage of the customer lifecycle. However, this structure also introduces some significant risks that retail investors often underestimate. The most immediate risk is \"packaging risk\": exchange-traded closed-end funds may consistently trade at a premium or discount to their net asset value, and liquidity at the packaging level does not eliminate the underlying portfolio's illiquidity. Secondly, there are risks related to concentration and news events: due to the limited number of constituent stocks, a single repricing event can have a significant impact on fund performance. Furthermore, there is capability risk: managing exposure to unlisted companies, valuation processes, and corporate governance dynamics is vastly different from the capabilities required for broker-dealer distribution, which is why some commentators have publicly questioned execution quality and investor returns. <h2><strong>Cryptocurrency and Blockchain Venture Capital in Q4 2025</strong></h2><p>In the fourth quarter of 2025, cryptocurrency venture capital activity rebounded strongly, primarily driven by large-scale late-stage funding. Venture capitalists completed 425 deals totaling $8.5 billion, marking the highest quarterly performance (in USD) since Q2 2022, although the number of deals was largely flat and far below the boom period of 2021-2022. The macroeconomic environment continues to suppress new investment demand, and the strong appeal of highly liquid cryptocurrencies (coupled with recent market volatility) may keep market sentiment cautious in the first quarter of 2026.</p><p></p><figure><p><picture><source><img alt=\"Cryptocurrency 2026\" class=\"sizing-normal\" data-attrs=\"{\" i=\"\" images=\"\" imagesize=\"\" insights4vc.substack.com=\"\" loading=\"lazy\" png=\"\" public=\"\" sizes=\"100vw\" src=\"https://img.jinse.com.cn/7436241_watermarknone.png\" srcset=\"https://substackcdn.com/image/fetch/$s_!KWqN!,w_424,c_limit,f_auto,q_auto:good,fl_progressive:steep/https% 3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F5dc83217-ea98-49cc-8a8d-948ddfa7aaae_1500x734.png 424w, https://substackcdn.com/image/fetch/$s_!KWqN!,w_848,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2 F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F5dc83217-ea98-49cc-8a8d-948ddfa7aaae_1500x734.png 848w, https://substackcdn.com/image/fetch/$s_!KWqN!,w_1272,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A% 2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F5dc83217-ea98-49cc-8a8d-948ddfa7aaae_1500x734.png 1272w, https://img.jinse.com.cn/7436241_watermarknone.png 1456w\" substack-post-media.s3.amazonaws.com=\"\" title=\"Cryptocurrency 2026\" vc=\"\"/></source></picture></p></figure><p></p><figure><figcaption alt=\"\" class=\"sizing-normal\" data-attrs=\"{\" https:=\"\" i=\"\" images=\"\" insights4vc.substack.com=\"\" loading=\"lazy\" null=\"\" png=\"\" public=\"\" sizes=\"100vw\" src=\"\" srcset=\"https://substackcdn.com/image/fetch/$s_!EG8q!,w_424,c_limit,f_auto,q_auto:good,fl_progressive:steep/https% 3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F9e1e46ce-1cf2-463a-9f0a-5fd132e929e7_2726x1092.png 424w, https://substackcdn.com/image/fetch/$s_!EG8q!,w_848,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2 F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F9e1e46ce-1cf2-463a-9f0a-5fd132e929e7_2726x1092.png 848w, [Image URL: https://substackcdn.com/image/fetch/$s_!EG8q!,w_1272,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F9e1e46ce-1cf2-463a-9f0a-5fd132e929e7_2726x1092.png 1272w, https://img.jinse.com.cn/7436242_watermarknone.png 1456w\" style=\"text-align: Despite these headwinds, the market structure remains healthy. Funds continue to flow to areas with clear revenue streams and sustained demand, including trading and brokerage, stablecoins, AI-related themes, and core infrastructure. Notably, pre-seed funding activity remains active, indicating that even after the “tourist capital” phase has ended, founders can still launch and fund new projects. The US remains the market center in terms of both funding volume and deal volume, and increasingly supportive policy directions further solidify its dominance. Key Takeaways: Total investment in 2025 exceeded $20 billion, with 1,660 deals, the largest annual figure since 2022 and more than double that of 2023. &lt;/p&gt;&lt;/li&gt;&lt;li&gt;&lt;p&gt;Q4 2025: $8.5 billion invested in 425 deals (84% QoQ increase) (2.6% QoQ increase).&lt;/p&gt;&lt;/li&gt;&lt;li&gt;&lt;p&gt;Funding skewed towards later stages: 56% of the funding came from later stages, compared to 44% from early stages (unchanged QoQ).&lt;/p&gt;&lt;/li&gt;&lt;li&gt;&lt;p&gt;Mega funding rounds dominated performance: 11 deals exceeding $100 million accounted for approximately 85% of the total amount in Q4 ($7.3 billion).&lt;/p&gt;&lt;/li&gt;&lt;li&gt;&lt;p&gt;The trading/exchange/investment/lending sector attracted the most funding ($5.5 billion), with Revolut ($3 billion), Touareg Group ($1 billion), and Kraken ($800 million) leading the pack.&lt;/p&gt;&lt;/li&gt;&lt;li&gt;&lt;p&gt;Funding improved but remained constrained: 11 new crypto venture capital funds raised a total of $1.98 billion in Q4; $8.75 billion was raised for the full year.&lt;/p&gt;&lt;/li&gt;&lt;li&gt;&lt;p&gt;Funding improved but remained constrained: 11 new crypto venture capital funds raised a total of $1.98 billion in Q4; $8.75 billion was raised for the full year.&lt;/p&gt;&lt;/li&gt;&lt;li&gt;&lt;p&gt; &lt;/p&gt;&lt;/li&gt;&lt;/ul&gt;&lt;h3&gt;&lt;strong&gt;Activity Rankings and Investor Sentiment&lt;/strong&gt;&lt;/h3&gt;&lt;p&gt;Coinbase Ventures remains the most active investor in the space, emphasizing that building the “Base” ecosystem is a long-term driver of on-chain profitability. The table below summarizes the top investors by transaction volume over the past 12 months (February 2025 to February 2026).&lt;/p&gt;&lt;/li&gt;&lt;/ul&gt;&lt;h3&gt;&lt;strong&gt;Activity Rankings and Investor Sentiment&lt;/strong&gt;&lt;/h3&gt;&lt;p&gt;Coinbase Ventures remains the most active investor in the space, emphasizing that building the “Base” ecosystem is a long-term driver of on-chain profitability. ...strong&gt;&lt;/p&gt;&lt;/li&gt;&lt;/ul&gt;&lt;h3&gt;&lt;strong&gt;Activ &lt;/p&gt;&lt;p&gt;&lt;/p&gt;&lt;figure&gt;&lt;p&gt;&lt;picture&gt;&lt;source&gt;&lt;img src=\" substack-post-media.s3.amazonaws.com=\"\"></figcaption></figure><h3>What factors led to the surge in the fourth quarter?</h3> The surge in the fourth quarter was less due to a general increase in risk appetite and more a result of a concentrated influx of capital into the high-end market. A few large funding rounds accounted for the vast majority of the funds, including those for Revolut, Touareg Group, Kraken, and others exceeding nine figures (such as Ripple, Tempo, Erebor, and Rain, all of which raised over $100 million this quarter). This means that the apparent recovery is real, but its distribution is uneven. The current cycle consists of two parallel realities: Later-stage companies are absorbing more capital. More and more capital is flowing to larger companies with mature business models, well-established distribution channels, and clear profit paths. Seed-stage companies are still alive, but their structural advantages are weak. By deal volume, pre-seed funding accounted for 23% in the fourth quarter, indicating strong entrepreneurial activity. However, long-term trends show a decline in the proportion of pre-seed funding and an increase in the proportion of mid-to-late stage funding, consistent with an ecosystem that has already built many \"first-wave\" foundations. The market's development resembles a maturing industry: no longer do entirely new categories requiring dozens of early experiments, but rather more incremental innovation, integration, and scaling based on existing successes. Category Chart Trading/Exchange/Investment/Lending still dominates total funding, reflecting its historically strongest monetization capabilities and most deeply rooted demand. Meanwhile, category share trends indicate a more pronounced shift in market preferences: Downgrade Trend: Web3 / NFT / DAO / Metaverse / Gaming are relatively declining. Upward Pressure: Payments/Rewards and Banking continue to gain market share, while the number of transactions in DeFi, infrastructure, and tokenization also continues to attract attention. When categorizing by stage, the pattern is obvious: Transaction-intensive capital is primarily biased towards later stages (driven by the largest funding rounds). The banking sector and some emerging sectors have received substantial early-stage funding, indicating that investors still see market gaps, but they are more selective in their investment timing. The US continues to lead in startup density, capital market depth, and accelerated adoption of new technologies by institutional investors. This advantage could widen further if regulatory transparency continues to improve. Valuation and Transaction Size Cryptocurrency valuations continue to climb until 2025, setting a new record in the fourth quarter, while median transaction size also matched all-time highs. In the fourth quarter, the median transaction size was $4 million, and the median pre-funding valuation was $70 million. However, the valuation data has limited coverage (only a few transactions reported valuations), and the proportion of later-stage financing in the published samples is too high. Therefore, the above valuation levels are for reference only and are not generally representative. <p></p><figure><p><picture><source><img a=\"\" about=\"\" alibaba=\"\" alt=\"\" an=\"\" analogy:=\"\" and=\"\" apt=\"\" aramco=\"\" as=\"\" at=\"\" because=\"\" but=\"\" by=\"\" can=\"\" capital=\"\" cited=\"\" come=\"\" constraints:=\"\" credible=\"\" currently=\"\" data-attrs=\"{\" demand.=\"\" demonstrated=\"\" digits=\"\" ends.=\"\" even=\"\" eventually=\"\" example=\"\" exceeded=\"\" expiration=\"\" float=\"\" formation.=\"\" free=\"\" highlights=\"\" i=\"\" images=\"\" in=\"\" initial=\"\" insights4vc.substack.com=\"\" ipo=\"\" is=\"\" its=\"\" later=\"\" liquidity=\"\" lock-up=\"\" market=\"\" market.=\"\" meaningful=\"\" more=\"\" not=\"\" of=\"\" often=\"\" only=\"\" period=\"\" png=\"\" possible=\"\" pressure=\"\" private=\"\" proper=\"\" provide=\"\" public=\"\" real=\"\" release=\"\" remains=\"\" required=\"\" saudi=\"\" scale=\"\" selling=\"\" several=\"\" shares=\"\" single=\"\" sovereign=\"\" src=\"https://img.jinse.com.cn/7436243_watermarknone.png\" srcset=\"https://substackcdn.com/image/fetch/$s_!-h2T!,w_424,c_limit,f_auto,q_auto:good,fl_progressive:steep/https% 3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F3b145bf2-ea81-4b47-a454-68890ea3f7c4_1500x728.png 424w, https://substackcdn.com/image/fetch/$s_!-h2T!,w_848,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2 F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F3b145bf2-ea81-4b47-a454-68890ea3f7c4_1500x728.png 848w, Despite improved investment activity in 2025, fundraising remains challenging. Following the market downturn of 2022-2023, asset allocators remain cautious, and crypto funds also face competition from artificial intelligence and liquidity instruments such as spot exchange-traded products (ETPs) and other public market investment options. While 11 funds raised $1.98 billion in the fourth quarter is progress, the broader signal suggests that fund formation is still near cyclical lows, and fund managers must work harder to secure investment commitments. The Liquidity Illusion Ultimately, the issue isn't whether mega-IPOs are \" strategy=\"\" stress=\"\" substack-post-media.s3.amazonaws.com=\"\" supply=\"\" test=\"\" than=\"\" the=\"\" they=\"\" this=\"\" time=\"\" times=\"\" traditional=\"\" ull=\"\" was=\"\" when=\"\" whether=\"\" will=\"\" with=\"\" years=\"\"/><p></p><figure><p><picture><source><img ai=\"\" alt=\"Open AI IPO\" class=\"sizing-normal\" data-attrs=\"{\" i=\"\" images=\"\" insights4vc.substack.com=\"\" ipo=\"\" loading=\"lazy\" png=\"\" public=\"\" sizes=\"100vw\" src=\"https://img.jinse.com.cn/7436244_watermarknone.png\" srcset=\"https://substackcdn.com/image/fetch/$s_!aZhJ!,w_424,c_limit,f_auto,q_auto:good,fl_progressive:steep/https% 3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F908b158d-1cef-413d-83b4-edaa69f667ab_2162x894.png 424w, https://substackcdn.com/image/fetch/$s_!aZhJ!,w_848,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2 F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F908b158d-1cef-413d-83b4-edaa69f667ab_2162x894.png 848w, https://substackcdn.com/image/fetch/$s_!aZhJ!,w_1272,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A% 2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F908b158d-1cef-413d-83b4-edaa69f667ab_2162x894.png 1272w, https://img.jinse.com.cn/7436244_watermarknone.png 1456w\" substack-post-media.s3.amazonaws.com=\"\" title=\"Open AI IPO\"/></source></picture></p></figure><p></p><figure><figcaption a=\"\" accessing=\"\" advantage=\"\" an=\"\" and=\"\" are=\"\" but=\"\" cash=\"\" competitive=\"\" event=\"\" exits=\"\" for=\"\" funding=\"\" general=\"\" in=\"\" key=\"\" less=\"\" lie=\"\" more=\"\" multi-year=\"\" not=\"\" obtaining=\"\" of=\"\" partners=\"\" project=\"\" returns.=\"\" style=\"text-align: Source: tomtunguz &lt;/figure&gt;&lt;/p&gt;&lt;/p&gt;&lt;p&gt;SpaceX, OpenAI, and Anthropic may be better prepared in some respects, as multiple tender offers have released some of their pent-up funds, but this does not solve the absorption challenges posed by their scale. Assuming a combined valuation of approximately $2.9 trillion, even using a conservative percentage of outstanding shares, this means that 15% of the tradable shares would amount to $432 billion, and 20% to $576 billion—figures far exceeding those of previous liquidity-driven IPO models. Therefore, secondary markets, continuation funds, and structured liquidity programs have become core infrastructure, not cyclical stopgap measures: until the public markets can smoothly absorb trillions of dollars in funding, venture capital \" the=\"\" will=\"\"></figcaption></figure></source></picture></p></figure></li></ul></figure></div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/1ba192dc70b690ceb52005c976eefca0.jpg",
            "link": "https://www.coinlive.com/news/cryptocurrency-venture-capital-in-early-2026",
            "pub_date": "2026-02-27 17:10:44",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        }
    ]
}