{
    "data": [
        {
            "id": 250414,
            "title": "Why did Bitcoin prices fall along with software stocks?",
            "description": "<div class=\"share___SVvtl\"><div><p style=\"text-align: left;\">Author: Anthony Pompliano, Founder and CEO of Professional Capital Management</p><p style=\"text-align: left;\">Over the past few weeks, investors have been most focused on the rapid sell-off in software stocks. To better understand why, I asked Silvia (our AI-driven CFO) for an explanation. Here's what she said:</p><ul class=\"list-paddingleft-2\" style=\"list-style-type: disc;\"><li><p style=\"text-align: left;\"><strong>This sell-off, dubbed the \"SaaS doomsday,\" has wiped out more than $1 trillion in market capitalization from software stocks since late January 2026.</strong> The primary driver is a sudden and intense investor concern: the emergence of artificial intelligence, particularly autonomous AI agents (such as Anthropic's Claude Cowork), is poised to disrupt the traditional SaaS business model. Investors worry that if AI tools can replace the entire software workflow—from coding to customer service to IT management—the seat-based subscription model that has underpinned SaaS valuations for a decade will be fundamentally threatened. According to USA Today and Reuters, the iShares Technology Software ETF (IGV) has fallen approximately 20% year-to-date, with major companies suffering heavy losses: Microsoft is down about 28% from its peak, Oracle is down about 55%, Salesforce is down about 30%, and Adobe is down about 27%. Adding to the woes, the sector is experiencing a massive rotation. Funds are flowing out of traditional SaaS companies and into AI infrastructure companies, value stocks, and industrial sectors. Despite largely stable fundamentals, the software sector's forward price-to-earnings ratio has compressed from approximately 39 times to 21 times, falling to a multi-year low. According to AInvest data, all software companies in the S&amp;P 500 that reported earnings beat expectations last quarter, with 80% exceeding revenue expectations. Companies like ServiceNow and AppLovin reported record earnings, but their share prices still suffered heavy losses because Wall Street's focus has shifted from current profitability to ultimate value—essentially questioning whether these established companies can survive in a world of autonomous AI agents. JPMorgan Chase called the sell-off driven by \"logical inconsistencies,\" believing the market is digesting a worst-case scenario that hasn't yet occurred. These are significant promises that short sellers rely on to support their investment logic. The sudden and significant reduction in the market capitalization of all software companies compared to just a few weeks ago is truly perplexing. </p><p style=\"text-align:center\"><img alt=\"zqUzHcsVjlq2sMnqSdwYUweDLaQaR8P6LjlWAjoS.jpeg\" src=\"https://img.jinse.com.cn/7436037_watermarknone.png\" title=\"7436037\"/></p><p style=\"text-align: left;\">Silvia then explained the crux of the debate: Is this an overreaction by investors, or a structural turning point in the market?</p> ... \"Short sellers argue that AI agents will commoditize software, squeeze profit margins, and erode the user base—some analysts at Bain and Forrester point out that CIOs are consolidating software budgets and reallocating spending to AI tools rather than expanding SaaS reach. Bulls counter that deeply embedded 'record systems' platforms (like Salesforce, ServiceNow, and Intuit) have a sticky customer base and recurring revenue that won't disappear overnight, making their current valuations potentially an attractive entry point. The truth may lie somewhere in between—AI will reshape the industry, but this indiscriminate sell-off has depressed the stock prices of many quality companies as if their businesses were already on the decline, a conclusion the data doesn't yet support.\" One question I've been pondering is the relationship between software stocks and Bitcoin. If software stocks are falling due to concerns about artificial intelligence, why is Bitcoin falling at the same time? Are investors genuinely worried that AI will impact Bitcoin's future? Silvia explains this clearly: \"In early 2026, the correlation between Bitcoin and software stocks surged to astonishing levels. As of February, Bitcoin's 30-day rolling correlation with the iShares Extended Technology Software ETF (IGV) reached 0.73, a very high figure. Bitcoin's correlation with the Nasdaq 100 also jumped from -0.68 to +0.72 in just a few weeks. Meanwhile, its correlation with gold was only 0.12. In effect, Bitcoin traded more like a high-beta software stock than a safe-haven asset.\" The mechanism driving this correlation is institutional fund flows, not fundamental overlap. Since the launch of spot Bitcoin ETFs in early 2024, Bitcoin has increasingly been included in institutional portfolios alongside growth and tech stocks. When risk aversion events occur—such as the sell-off in AI-driven software stocks triggered by the launch of Anthropic's Claude Cowork—portfolio managers broadly reduce risk, selling both software stocks and Bitcoin. At the peak of the sell-off, Bitcoin ETFs experienced average daily outflows of $272 million, with cumulative outflows from cryptocurrency products reaching $1.7 billion. This is not a phenomenon unique to cryptocurrencies—it's a broader risk aversion mechanism where funds shift from growth assets to gold, government bonds, and cash. Bitcoin, as a risk-averse asset, is also held by these institutions and is therefore affected by this countercurrent. The key nuance—and what makes this particularly tricky—lies in the negative skewness of Bitcoin's correlation with its price. Bitcoin falls much more sharply than it rises with software stocks. When IGV rises, Bitcoin's reaction is relatively muted; conversely, when IGV falls, Bitcoin tends to amplify the decline. This asymmetry exacerbates the situation—Bitcoin bears the risk of a decline in its correlation with tech stocks but fails to fully participate in their rallies. Stifel even predicts Bitcoin could fall to $38,000, pointing out that its 0.78 correlation with the Nasdaq 100 suggests that Bitcoin is now more like a leveraged bet on tech stocks than a safe-haven asset for the dollar. Clearly, the current sell-off is highly correlated. The most likely scenario for this correlation to disappear is that institutional investors no longer view Bitcoin as a growth/risk asset. As long as Bitcoin remains in the same category as software stocks in institutional portfolios and is influenced by the same macroeconomic factors (Fed policy, liquidity, risk appetite), it will continue to trade like leveraged tech stocks. To change this, a large number of marginal buyers of Bitcoin need to shift from momentum-chasing hedge funds and ETF-driven retail investors to structural, price-insensitive holders… primarily those who adhere to long-term holdings regardless of quarterly macroeconomic changes. The most likely catalyst is widespread adoption by sovereign nations. The United States has established a strategic Bitcoin reserve using seized assets, while countries like Brazil, El Salvador, and Bhutan are exploring or actively accumulating Bitcoin as a sovereign reserve. For the first time since 1996, central bank gold reserves have surpassed foreign holdings of US Treasury bonds, potentially representing a structural \"sovereign asset rotation\" from which Bitcoin could benefit if it ultimately proves to be a reliable neutral reserve asset. If major central banks (especially sovereign wealth funds) begin actively purchasing Bitcoin, this will create a large, price-insensitive demand base, absorbing selling pressure during periods of heightened risk aversion and fundamentally reducing its correlation with stocks. Gold's trajectory is largely consistent with this, and Bitcoin aspires to follow a similar path. The decoupling of Bitcoin from software stocks will be a multi-year process. This requires a gradual shift in the Bitcoin holder base from speculative/institutional investors to sovereign/structural investors, reduced volatility, and at least one crisis where Bitcoin doesn't sell off along with all other assets. The sovereign reserve trend is currently the most promising catalyst, but as long as exchange-traded fund (ETF)-driven institutional flows dominate Bitcoin's marginal pricing, it will still behave like an extension of the high-beta growth/tech sector during periods of market stress. Therefore, one way to understand Bitcoin's current correlation is that this asset is a victim of its own success. What we want is mainstream acceptance, and we have achieved that, but this mainstream acceptance (especially on Wall Street) has had side effects. The new correlation with software stocks is the most obvious example. Bitcoin is definitely fine. I expect it to continue to perform well in the future. The challenge for you as investors is to avoid getting bored. Good luck.</li></ul></div></div>",
            "image": "https://img.jinse.com.cn/jinse_1772157870385349140_small.png",
            "link": "https://www.coinlive.com/news/why-did-bitcoin-prices-fall-along-with-software-stocks",
            "pub_date": "2026-02-27 10:05:31",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 250397,
            "title": "The US's Hunt for Bitcoin: From the Silk Road to the World's Largest Government Holder",
            "description": "<div class=\"share___SVvtl\"><div>As of February 2026, the U.S. government held approximately 328,372 Bitcoins, representing approximately 1.64% of the global circulating supply (approximately 19.9 million Bitcoins). Based on current market prices, the value exceeds $20 billion. With this scale, the United States becomes the world's largest holder of Bitcoin, far exceeding any other government. Almost all of these Bitcoins came from law enforcement seizures, not from government appropriations or market purchases. While cracking down on the illicit uses of Bitcoin, the United States has quietly transformed these \"criminal assets\" into a national strategic reserve. Looking back at the US law enforcement and regulatory actions surrounding cryptocurrencies over the past decade, from cracking down on dark web markets to on-chain tracking and cross-border collaboration, it's clear that the US has never truly intended to \"eliminate\" Bitcoin. Instead, it has focused on controlling its flow and use, incorporating it into national strategic reserves, and forming a closed loop that integrates technology, law, and assets. <p style=\"text-align:center\"><span leaf=\"\"><img alt=\"6Mid5q5dwxSSDq6F3EwFJKFL45JlYfEcDMQT7goP.jpeg\" src=\"https://img.jinse.com.cn/7436001_image3.png\" title=\"7436001\"/></span></p><h2 style=\"text-align: left;\"><strong><span style=\"mso-bidi-font-weight: bold;\"><span leaf=\"\"><span text=\"\">Timeline: Landmark Actions in the US Hunt for Bitcoin</span></span></span></strong></h2><h3 style=\"text-align: left;\"><strong><span lang=\"EN-US\"><span leaf=\"\"><span text=\"\">2011-2013</span></span></span><span leaf=\"\"><span a=\"\" accounted=\"\" action=\"\" address=\"\" all=\"\" also=\"\" american=\"\" an=\"\" and=\"\" anonymous=\"\" approximately=\"\" arrested=\"\" as=\"\" at=\"\" basis=\"\" battle=\"\" becoming=\"\" bitcoin=\"\" bitcoins=\"\" built=\"\" but=\"\" by=\"\" came=\"\" captcha=\"\" case=\"\" combination=\"\" complete=\"\" completely=\"\" control=\"\" controlled=\"\" counterfeit=\"\" cracking=\"\" crime=\"\" custody.=\"\" daily=\"\" data=\"\" directly=\"\" documents.=\"\" drugs=\"\" enforcement=\"\" era=\"\" eye=\"\" fbi=\"\" files=\"\" for=\"\" francisco=\"\" from=\"\" goods=\"\" icelandic=\"\" illegal=\"\" imprisonment.=\"\" in=\"\" infiltration=\"\" into=\"\" its=\"\" just=\"\" key.=\"\" label=\"\" laptop=\"\" law=\"\" leads=\"\" legitimacy=\"\" library=\"\" life=\"\" located=\"\" means=\"\" million.=\"\" narrative=\"\" network=\"\" not=\"\" october=\"\" of=\"\" officers=\"\" offline=\"\" on=\"\" on-chain=\"\" only=\"\" operation=\"\" over=\"\" payment=\"\" peak=\"\" platform=\"\" private=\"\" public=\"\" raids=\"\" regulations.=\"\" resulted=\"\" road=\"\" ross=\"\" san=\"\" seizure=\"\" sentenced=\"\" server=\"\" shaping=\"\" silk=\"\" slightly=\"\" sole=\"\" solidified=\"\" subsequent=\"\" such=\"\" taken=\"\" taking=\"\" the=\"\" then=\"\" these=\"\" this=\"\" time=\"\" to=\"\" tool=\"\" tor.=\"\" total=\"\" trace=\"\" tracking=\"\" trade=\"\" transaction=\"\" transactions.=\"\" ulbricht=\"\" ulbricht.=\"\" used=\"\" volume=\"\" wallet=\"\" was=\"\" weapons=\"\" were=\"\" which=\"\" william=\"\" without=\"\" worth=\"\" youth=\"\"><p style=\"text-align:center\"><span leaf=\"\"><img alt=\"RzxmUeXzVEGZNVVcASxsVzwoE73f6oQ7Hz3bEIdi.jpeg\" src=\"https://img.jinse.com.cn/7436002_image3.png\" title=\"7436002\"/></span></p><h3 style=\"text-align: left;\"><strong><span lang=\"EN-US\"><span leaf=\"\"><span text=\"\">2013-2014</span></span></span><span leaf=\"\"><span text=\"\">Year: The Hunting of Multiple Dark Web Markets and the Laying of a Regulatory Framework</span></span></strong></h3><p style=\"text-align: left;\"><span leaf=\"\">After the Silk Road ended, the United States did not stop. On March 18, 2013, FinCEN (Financial Crimes Enforcement Network) issued guidance classifying Bitcoin exchanges and similar services as \"money services businesses\". The requirement for registration and implementation of KYC/AML (Know Your Customer) anti-money laundering mechanisms (MBL) by the US (Manufacturing Transaction Management System) marked the true beginning of the US Bitcoin regulatory framework, forcing exchanges to comply with regulations. In November 2014, the FBI, along with Europol and law enforcement agencies from 17 countries, launched Operation Onymous, simultaneously shutting down over 400 [unclear - possibly related to security measures]. The dark web market includes major drug and counterfeit money laundering sites such as Silk Road 2.0, Cloud 9, and Hydra. Arrests were made against more than 17 operators, including Blake Benthall, operator of Silk Road 2.0, and “Defcon”, a San Francisco software developer; approximately $1 million in Bitcoin and €180,000 in cash, gold, drugs, etc., were seized. The key weapon at this stage is the \"civil forfeiture\" system, which allows assets to be frozen with only a preponderance of evidence and without criminal conviction. The U.S. Marshals Service subsequently began regularly auctioning off confiscated Bitcoin. In 2014, investor Tim Draper participated in the auction, becoming one of the early public buyers. With a two-pronged approach of crackdown and compliance, Bitcoin was pulled from the underground into the regulatory order. 2017-2018: ICO Bubble Burst and Securities Regulation. After the ICO craze swept the globe, US regulators began a systematic cleanup. The SEC considers a large number of ICOs as “unregistered securities” and initiates enforcement actions against the project teams; the CFTC, on the other hand, has confirmed that Bitcoin is a “commodity”. The government has incorporated these regulations into its own oversight. Administrative fines, asset freezes, and litigation threats have been implemented. Centralized projects are forced to comply with regulations, reshaping the industry's financing model. While decentralized systems have gained room for development, compliance costs have increased significantly. 2020: The Aftermath of the Silk Road The 2012-2013 Silk Road hacking incident. This operation spanned seven years. Law enforcement used on-chain analytics tools such as Chainalysis and TRM Labs to track the flow of cold wallets through cluster analysis and transaction pattern matching, completing civil seizures without the need for private keys. </span></p><h3 style=\"text-align: left;\"><strong><span lang=\"EN-US\"><span leaf=\"\"><span text=\"\">2021</span></span></span><span leaf=\"\"><span text=\"\">Year: Second Largest Encrypted Forfeiture</span></span><span lang=\"EN-US\"><span leaf=\"\"><span text=\"\">James Zhong</span></span></span><span leaf=\"\"><span text=\"\">Case</span></span></strong></h3><p style=\"text-align: left;\"><span lang=\"EN-US\"><span leaf=\"\">IRS</span></span><span leaf=\"\">The Bureau of Criminal Investigation (IRS-CI) raided a Georgia home and found a hardware wallet in a floor safe and a popcorn bucket.</span></p></span><span leaf=\"\"> As early as 2012, during the Silk Road era, Zhong used a fake merchant account to exploit a vulnerability in \"Instant Withdrawal\" to steal approximately 50,000 Bitcoins within a few days. When arrested in 2021, police seized 50,676 bitcoins, worth approximately $3.36 billion. Even though Bitcoin is designed to be decentralized, operational security errors can still lead to arrest. The IRS achieves asset seizure through physical searches, on-chain intelligence, and plea bargaining. Zhong ultimately pleaded guilty and was sentenced to just over one year in prison. </span><p style=\"text-align:center\"><span leaf=\"\"><img alt=\"Uc6R4tAYNIjXCyPjJKqRyLp00yXTDBHH6dtkMw5D.jpeg\" src=\"https://img.jinse.com.cn/7436003_image3.png\" title=\"7436003\"/></span></p><h3 style=\"text-align: left;\"><strong><span lang=\"EN-US\"><span leaf=\"\"><span text=\"\">2022-2023</span></span></span><span leaf=\"\"><span text=\"\">Year:</span></span><span lang=\"EN-US\"><span leaf=\"\"><span text=\"\">Bitfinex</span></span></span><span leaf=\"\"><span a=\"\" achieving=\"\" address=\"\" after=\"\" and=\"\" any=\"\" arrested=\"\" arrested.=\"\" as=\"\" asset=\"\" assets=\"\" at=\"\" august=\"\" be=\"\" began=\"\" between=\"\" billion=\"\" boundaries=\"\" capital=\"\" cash=\"\" classified=\"\" closed=\"\" cloud=\"\" combined=\"\" compliance=\"\" compressed=\"\" conjunction=\"\" containing=\"\" controlled=\"\" cooperation=\"\" could=\"\" couple=\"\" crypto=\"\" cryptocurrencies=\"\" data=\"\" decryption=\"\" directly=\"\" encrypted=\"\" evidence=\"\" exchange=\"\" fbi=\"\" february=\"\" files=\"\" fixation.=\"\" flows=\"\" for=\"\" formed=\"\" forming=\"\" freezes=\"\" from=\"\" further=\"\" global=\"\" guilty=\"\" hacking.=\"\" has=\"\" heather=\"\" high-risk.=\"\" history.=\"\" hunting=\"\" ilya=\"\" imposed=\"\" in=\"\" interacting=\"\" international=\"\" it=\"\" keys.=\"\" kyc=\"\" largest=\"\" later=\"\" lichtenstein=\"\" location=\"\" loop=\"\" making=\"\" methods=\"\" mixers=\"\" mixing=\"\" morgan=\"\" network.=\"\" new=\"\" obtained=\"\" of=\"\" ofac=\"\" off-chain=\"\" on=\"\" on-chain=\"\" one=\"\" operational=\"\" penetrate=\"\" pleaded=\"\" precise=\"\" private=\"\" process=\"\" same=\"\" sanctions=\"\" search=\"\" seized=\"\" seizures=\"\" service=\"\" single=\"\" space=\"\" stage=\"\" storage=\"\" such=\"\" the=\"\" them=\"\" they=\"\" this=\"\" tightened=\"\" time=\"\" to=\"\" tornado=\"\" tracking=\"\" upgraded=\"\" use=\"\" using=\"\" wallets=\"\" warrant=\"\" was=\"\" were=\"\" with=\"\" worth=\"\" year=\"\" york=\"\"><p style=\"text-align:center\"><span leaf=\"\"><img alt=\"z6SMth8jIgr7Irn8v8GnkNw44uczmSlLRMRep6SP.jpeg\" src=\"https://img.jinse.com.cn/7436004_image3.png\" title=\"7436004\"/></span></p><h3 style=\"text-align: left;\"><strong><span lang=\"EN-US\"><span leaf=\"\"><span text=\"\">2023-2025</span></span></span><span leaf=\"\"><span text=\"\">Year: Zhao Changpeng (</span></span><span lang=\"EN-US\"><span leaf=\"\"><span text=\"\">CZ</span></span></span><span leaf=\"\"><span>) and the Binance case</span></span></strong></h3><p style=\"text-align: left;\"><span lang=\"EN-US\"><span leaf=\"\">In November 2023</span></span><span lang=\"EN-US\"><span leaf=\"\">, Binance admitted to failing to effectively implement anti-money laundering measures, allowing sanctioned users to trade, and paying a fine of $4.35 billion, including the confiscation of $2.7 billion in illicit gains; founder Changpeng Zhao</span></span></p></span></span></strong></h3> $50 million. During the investigation, US law enforcement not only relied on on-chain fund flow monitoring but also pieced together management's understanding of compliance risks by obtaining internal communication records. This included details such as the use of encrypted communication software to handle sensitive information and the deliberate downplaying of \"US user\" identification in internal discussions, forming evidence of the company's long-term evasion of KYC obligations. In April 2024, Zhao Changpeng was sentenced to four months in prison and served his sentence. In October 2025, President Trump announced a pardon for him. 2025: A Strategic Shift and the Largest Confiscation in History If the actions of the previous decade or so were a process of hunting down and purging, then 2025 saw a directional shift. On March 6, 2025, Trump signed an executive order establishing the Strategic Bitcoin Reserve and the U.S. Digital Asset Reserve. Previously, all Bitcoins seized by law enforcement would no longer be auctioned off, but instead become long-term national reserve assets and could not be sold. The policy logic has thus been rewritten, shifting from \"post-crackdown auction for monetization\" to \"zero-cost strategic holding\". On October 14th, the U.S. Department of Justice imposed sanctions on Chinese citizens of Cambodia's Prince Group. Chen Zhi, founder of [company name], was charged with criminal offenses including conspiracy to commit wire fraud and conspiracy to commit money laundering, and was ordered to forfeit approximately 127,271 Bitcoins, which at the time were worth approximately $15 billion, setting a record for the largest forfeiture of virtual assets in U.S. judicial history. The US claims the assets are related to cross-border telecom fraud and money laundering, and have entered a government escrow system. The China National Computer Virus Emergency Response Center released a technical tracing report, pointing out that a large-scale Bitcoin theft occurred at LuBian's mining pool in 2020, with the amount highly consistent with the scale of this seizure, and raising technical questions about the acquisition method. This incident is not only an unprecedented seizure of virtual assets, but also a landmark case of the intertwined struggle between law enforcement power, technical capabilities, and narrative power in the digital asset field. Concurrently, the Russian-operated Garantex exchange and its successor, Grinex, have been accused of providing money laundering channels for sanctioned countries' hacking and fraud, and have continued to face sanctions and infrastructure attacks. The interplay between on-chain tracking, pressure on the dollar clearing system, and control of physical servers systematically demonstrates cross-border law enforcement capabilities. After being placed on the sanctions list in early 2022, in March 2025, the U.S. Secret Service, in conjunction with German and Finnish law enforcement agencies, seized its domain name and froze approximately $26 million in assets; the Department of Justice indicted several executives, including Aleksej Besciokov, who was arrested in India; In August, the U.S. Treasury Department further expanded the scope of sanctions against OFAC, and the State Department offered a reward of up to $5 million for the capture of those responsible. With this, the U.S. has completed a closed loop in its handling of crypto assets, enabling it to both suppress, freeze, and confiscate them, as well as hold them long-term and incorporate them into national reserves. From technological suppression to asset integration, Bitcoin has been incorporated into the national strategic framework. From Hunting to Nationalization The United States' approach to Bitcoin has shifted from viewing it as a tool to combating crime to incorporating it as a national strategic asset. It's not just about law enforcement and regulation of cryptocurrencies; it's about achieving control over the entire Bitcoin supply chain and integrating national interests through a high degree of synergy between technology, law, and strategic reserves. Leveraging its globally leading on-chain tracing technology, national-level cyberattack capabilities, and transnational collaboration, the United States has constructed a three-pronged closed loop of \"technological advantage—regulatory binding—institutional enforcement,\" making Bitcoin a crucial component of its financial resilience and international dominance. </span><h3 style=\"text-align: left;\"><span leaf=\"\"><span text=\"\">1. </span></span><strong><span leaf=\"\"><span text=\"\">Technical Aspect</span></span></strong></h3><p style=\"text-align: left;\"><span leaf=\"\">The United States, relying on its globally leading on-chain tracing technology, national-level cyber attack capabilities, and transnational cooperation, has achieved precise control over the entire Bitcoin chain. On-chain traceability capabilities: The United States possesses the world's most advanced on-chain traceability technology, with leading US companies such as Chainalysis and Elliptic holding over 90% of the market share. The above market share allows for clustering and tracking of over 99% of Bitcoin transactions. Even using CoinJoin or mixers, on/off-ramp (fiat currency inflows and outflows) often exposes address associations. Combining Physics and Law: Without cracking private keys, hardware wallets, exchange accounts, or cloud storage files can be directly controlled through search warrants or court orders. In the Chen Zhi case, 25 cold wallet addresses were precisely located; in the Bitfinex case, direct control of assets was achieved by obtaining private keys through cloud storage. National-level cyberattack capabilities: The United States has launched targeted attacks against global exchanges and mining pools, including backdoor implantation, spear-phishing, supply chain infiltration, and exploitation of underlying encryption vulnerabilities. The LuBian mining pool case exploited the weakness of pseudo-random numbers, precisely transferring over 127,000 Bitcoins within 2 hours, demonstrating technological dominance. International Cooperation and Long-Arm Jurisdiction: Sharing intelligence with the EU, the UK, etc., and imposing sanctions on companies like OFAC, Tornado Cash, and Garantex, combined with dollar clearing hegemony, domain name seizures, and transnational arrests, to form a global hunting network and achieve full-chain control of digital assets. 2. Legal and Institutional Levels The United States, through legal systems and technological cooperation, has incorporated Bitcoin into its national control system, providing a solid guarantee for its strategic reserves. The GENIUS Act requires stablecoin issuers to use over 80% of their reserve assets to purchase U.S. Treasury bonds, creating sustained demand for U.S. Treasury bonds and binding the crypto ecosystem to the dollar system. The BITCOIN Act establishes the link between virtual assets and the U.S. financial system, clarifies civil forfeiture mechanisms, and provides legal support for the transfer of assets to state ownership. Civil confiscation: Assets can be seized without criminal conviction, resulting in extremely high efficiency. From 2022 to 2025, the United States confiscated over $30 billion worth of virtual assets globally through various cases, with the Chen Zhi case alone accounting for 50%. This synergy between law and technology forms a complete closed loop of \"rule pre-setting — technology forensics — asset harvesting,\" providing institutional guarantees for strategic reserves. 3. Strategic Reserve Approach The US's handling of Bitcoin reflects a complete evolution from precise targeting to systematic harvesting, and finally to its inclusion in national strategic reserves. Through a high degree of synergy in technology, regulations, and international cooperation, the US has established full-chain control over global virtual assets. Its methods include: precise monitoring and control of transactions using on-chain tracking technology and state-level cyberattack capabilities; direct transfer of assets through court orders and civil forfeiture; and forming a global encirclement loop through cooperation with allies, OFAC sanctions, domain name seizures, and transnational law enforcement. Case studies demonstrate the high efficiency of this capability: in the Chen Zhi case, confiscated assets were directly placed under state control; in the Zhao Changpeng case, through rule-based export and technological tracking, the United States rapidly transformed cross-border assets into strategic reserves. This strategy allows the United States to incorporate seized assets into its national reserves without requiring market purchases, using Bitcoin as a hedge against inflation and volatility in the dollar system, essentially as \"digital gold.\" As of February 2026, the United States held approximately 328,372 Bitcoins, representing 1.64% of the global circulating supply, with a value exceeding $20 billion, almost entirely from confiscation operations. On March 6, 2025, the United States signed an executive order entitled \"Establishing a Strategic Bitcoin Reserve and a U.S. Digital Asset Reserve,\" officially designating Bitcoin as a strategic reserve asset and requiring the Treasury Department to cease auctioning and selling Bitcoin obtained through judicial seizures and to transfer it to a newly established strategic reserve account. Although the BITCOIN Act recommended purchasing 1 million tokens over five years, this has not yet been implemented; the executive order only authorizes a potential strategy of \"budget neutrality and no additional taxpayer costs.\" Open market purchases have not been implemented, nor has any explicit commitment been made. Overall, the United States' strategy is highly systematic, neither completely eliminating nor completely abandoning Bitcoin, thus achieving precise control and strategic utilization. From a tool of crime in the \"Silk Road\" era to a core asset of national strategic reserves, the evolution of Bitcoin reflects a new landscape of national technological hegemony in the digital age, strengthening the United States' dominance in the global digital financial system and profoundly impacting technological sovereignty, economic interests, and political security.</span></p></strong></h3></div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/daba5de8d02de72ba61bb347f83e8f99.jpg",
            "link": "https://www.coinlive.com/news/the-us-s-hunt-for-bitcoin-from-the-silk-road-to",
            "pub_date": "2026-02-27 08:25:41",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 250390,
            "title": "Vitalik Buterin unveils Ethereum's quantum-resistant roadmap; US lawmakers propose blockchain innovation bill.",
            "description": "<div class=\"share___SVvtl\"><div><h2 style=\"text-align: left;\">Headline</h2><p style=\"text-align: left;\"><strong>▌Vitalik Buterin Announces Ethereum's Quantum-Resistant Roadmap</strong></p><p style=\"text-align: left;\">Vitalik Buterin has proposed a technical roadmap for Ethereum to address the long-term risks of quantum computing. At the validator level, Ethereum currently uses BLS digital signatures. Vitalik suggests switching to a \"hash-based\" signature scheme in the future, and enhancing signature switching capabilities and reducing verification costs through EIP-8141. Previously, the Ethereum Foundation had established a post-quantum research team.</p><p></p><p style=\"text-align: left;\"><strong>▌US Bipartisan Lawmakers Introduce Blockchain Innovation Act to Protect Non-Custodial Developers from Unlawful Liability</strong></p><p style=\"text-align: left;\">Crypto journalist Eleanor Terrett wrote on the X platform that US Representatives Scott Fitzgerald, Ben Cline, and Zoe Lofgren jointly introduced the \"Blockchain Innovation Promotion Act of 2026,\" which aims to protect software developers from criminal liability under Section 1960 of the United States Code. The bill explicitly states that Section 1960 only applies to institutions that control customer funds, not just developers who write code. This distinction is precisely what the crypto industry (especially DeFi) has been pushing for to be included in the Clarity Act. Section 1960 originally targeted institutions that custodied fund transfers, but recent cases (such as Tornado Cash and Samourai Wallet) have applied it to non-custodial software developers who do not control user funds, sparking conflict between crypto builders and regulators.</p> ... As of press time, according to CoinGecko data: BTC price is $67,559.56, a 24-hour change of -1.1%; ETH price is $2,030.99, a 24-hour change of -1.9%; BNB price is $626.08, a 24-hour change of -0.8%. SOL price is $85.97, a 24-hour change of -2.9%; DOGE price is $0.09701, a 24-hour change of -4.3%; XRP price is $1.40, a 24-hour change of -2.8%; TRX price is $0.2856, a 24-hour change of +0.1%. The price of WLFI is $0.1155, with a 24-hour change of -2.1%; the price of HYPE is $28.37, with a 24-hour change of +0.6%. Policy ▌US lawmakers reiterate concerns about stablecoin yields, focusing on the risk of bank deposit outflows. At a hearing of the US Senate Banking Committee, several senators expressed concerns about the stablecoin yield mechanism, arguing that its form is similar to bank deposits but lacks corresponding regulation, potentially leading to an outflow of bank deposits. Senator Thom Tillis stated that he will request regulatory agencies to provide an independent assessment of the relevant risks. Under the already enacted GENIUS Act, stablecoin issuers are prohibited from directly paying interest to holders, but third-party platforms are not prohibited from providing rewards. Regulators stated at a hearing that no large-scale deposit outflows have been observed, and the banking system as a whole is operating soundly. The Office of the Comptroller of the Currency (OCC) recently released a 376-page document proposing draft rules for implementing stablecoins under the GENIUS Act. The new rules explicitly restrict stablecoin issuers from indirectly paying interest or returns, while allowing merchants to make independent payments and white-label stablecoin businesses where issuers share returns with third parties. However, some existing circumvention methods will be prohibited; for example, Paxos' practice of paying rewards for PayPal's PYUSD will not be allowed. The regulatory focus is on preventing circumvention of the interest rate ban, while still retaining some permissible payment options. <p style=\"text-align: left;\"><strong>▌Federal Reserve Governor Bowman: Ensuring the Banking System's Capability to Support Digital Asset Activities</strong></p><p style=\"text-align: left;\">The Block reporter Sarah Wynn wrote on the X platform that Federal Reserve Governor Bowman testified before the U.S. Senate Committee on Finance, Housing, and Urban Affairs. It is understood that the Federal Reserve is advancing Project GENIUS and plans to \"clarify how digital assets are handled and ensure the banking system's capability to support digital asset activities.\" Bowman emphasized: \"As a regulator, my responsibility is to encourage innovation responsibly while continuously improving oversight to address the safety and robustness risks that innovation may bring.\"</p><p style=\"text-align: left;\"><strong>▌Crypto ETNs Cannot Be Included in Mainstream ISA Tax-Free Accounts from the New UK Fiscal Year</strong></p><p style=\"text-align: left;\">From April 6th, the new fiscal year, UK investors will no longer be able to add crypto ETNs to their \"Equities and Shares ISA\" tax-free accounts.</p><p style=\"text-align: left;\"> The UK tax authority, HM Revenue and Customs (HMRC), classifies it only as an asset eligible for \"Innovative Financial ISAs,\" and currently no platform plans to support related products. Investors already holding crypto ETNs do not need to sell. HMRC stated that given its innovative nature and the early stage of the market, it will continue to assess whether to adjust its policy in the future. </p><hr/><h2 style=\"text-align: left;\">Blockchain Applications</h2><p style=\"text-align: left;\"><strong>▌Tools for Humanity partners with Gap, Visa, and Tinder to promote World ID human verification product</strong></p><p style=\"text-align: left;\">According to the Wall Street Journal: Tools for Humanity, founded by OpenAI founder Sam Altman, is partnering with Gap, Visa, and Tinder to promote World ID human verification product (an identity verification technology that distinguishes between humans and bots).</p><p style=\"text-align: left;\"> Cryptocurrency </p><h2 style=\"text-align: left;\">MetaMask Partners with Mastercard to Launch Crypto Card in the US</h2><p style=\"text-align: left;\">According to market news, MetaMask has partnered with Mastercard to officially launch a cryptocurrency card in the United States.</p><p style=\"text-align: left;\"><strong>▌Morgan Stanley Plans to Offer Bitcoin Trading and Custody Services</strong></p><p style=\"text-align: left;\">According to market news, Morgan Stanley stated that it plans to offer Bitcoin trading, lending, yield, and custody services in the future, involving assets of up to $1.3 trillion.</p><p style=\"text-align: left;\"><strong>▌BlackRock Withdraws 4,309 BTC from Coinbase</strong></p><p style=\"text-align: left;\">According to Lookonchain monitoring, BlackRock ETF addresses continue to increase their BTC holdings.</p><p style=\"text-align: left;\"> The address received 4,309 BTC (worth $289.6 million) from Coinbase. </p><p style=\"text-align: left;\"><strong>▌Willy Woo: Bitcoin Bear Market Originates from Large-Scale Selling of Bitcoin by Early Whales</strong></p><p style=\"text-align: left;\">Renowned analyst Willy Woo commented on the event that \"since November 2025, Jane Street Group has been experiencing large-scale selling of Bitcoin and related ETF shares every day at 10 AM when the US stock market opens,\" stating that the essence of the Bitcoin bear market is that the large-scale selling of Bitcoin by early whales far exceeds the amount of new funds entering the market. This is clearly visible on the blockchain.</p> ... AllianceDAO Co-founder: Bitcoin Bear Market Needs No \"Scapegoats,\" Prices Are More Driven by Market Psychology AllianceDAO co-founder qw posted on social media that the market has been constantly looking for \"scapegoats\" for the Bitcoin bear market in recent months, including factors such as Jane Street, the threat of quantum computing, and the sell-off in the software sector. He believes that Bitcoin is not an asset anchored to cash flow, and its price fluctuations are more driven by market sentiment and technical patterns, essentially reflecting changes in investor psychology rather than being caused by a single external event. According to The Data Nerd, four hours ago, whale 0x69A bought another 8033 ETH (approximately $16.47 million) through Galaxy Digital. Over the past three months, this whale has purchased a total of 14,551 ETH at an average price of approximately $2,206. It currently holds 37,576 ETH (approximately $77.53 million), with a paper loss of approximately $38.45 million. Nasdaq has filed for a rule change with the U.S. Securities and Exchange Commission (SEC) to list the VanEck JitoSOL ETF. This fund will directly hold JitoSOL, a liquidity-based staking token based on Solana. According to the filing, if approved, staking yields will not be distributed separately but will be automatically added to the fund's net asset value. <p style=\"text-align: left;\"><strong>▌Grant Cardone Plans to Tokenize $5 Billion in Real Estate Assets</strong></p><p style=\"text-align: left;\">Real estate investor Grant Cardone stated that his company, Cardone Capital, is preparing to tokenize a portfolio of approximately $5 billion in real estate assets. The plan is to issue asset tokens via blockchain to provide investors with \"collateral and secondary market liquidity,\" and the company aims to achieve market leadership in the large-scale asset tokenization field. Previously, the company had already advanced its crypto asset strategy, including purchasing 1,000 Bitcoins and planning to continue increasing its holdings.</p> ... **Nationwide National Pension Service of Korea (NPS) Increases Holdings in MSTR by 614,409 Shares, Worth $83.2 Million** According to market news, the world's third-largest pension fund, the NPS, has increased its holdings in Bitcoin treasury company Strategy (stock code $MSTR) by 20%, bringing its total holdings to 614,409 shares, worth $83.2 million. **ETHZilla Removes \"Ethereum Treasury\" Label and Rebrands After Stock Price Crash** Former Ethereum treasury company ETHZilla announced that it will be renamed Forum Markets next month and adopt a new Nasdaq stock code, officially shifting its business from cryptocurrency exposure on its balance sheet to tokenized real-world assets (RWA). This move comes a week after the company announced it was abandoning the Ethereum balance sheet model, prompting investors to withdraw. Observers point out that the single-asset treasury strategy relies on a sustained equity premium and a strong market environment. Coinbase will launch spot trading for Robo Token (ROBO). If liquidity conditions are met, the ROBO-USD trading pair will open in supported regions. USDC Treasury mints 340 million new USDC. According to Whale Alert monitoring, the USDC Treasury minted a total of 340 million USDC in two transactions early this morning. **Important Economic Developments** **Federal Reserve's Goolsby: Interest Rates Could Cut More This Year If Inflation Falls** Federal Reserve Chairman Goolsby stated that interest rates could be lowered, but he doesn't want to cut rates significantly before inflation eases; if inflation falls, interest rates could be cut more this year; the job market is stable, and the economy has remained robust. **According to CME's \"FedWatch\":** The probability of the Fed cutting rates by 25 basis points by March is 4%, and the probability of keeping rates unchanged is 96.0%. The probability of the Fed cumulatively cutting rates by 25 basis points by April is 17.3%, the probability of keeping rates unchanged is 82.1%, and the probability of cumulatively cutting rates by 50 basis points is 0.6%. The probability of a cumulative 25 basis point interest rate cut by June is 43%. <hr/><h2 style=\"text-align: left;\">Golden Encyclopedia</h2><p style=\"text-align: left;\"><strong>▌What is the value of BTC?</strong></p><p style=\"text-align: left;\">BTC is often compared to \"digital gold,\" but its core value is actually the \"promise of immutable scarcity.\" First, BTC has monetary properties, but it is not a currency because it lacks a stable unit of account. It is a pure \"monetary property,\" that is, a consensus game among humans regarding \"what can serve as a store of value.\" Gold also has this core value, but gold's scarcity depends on the physical geological constraints, while BTC's scarcity depends on mathematics and game theory—it's an information-level scarcity.</p><p style=\"text-align: left;\">But what makes BTC truly unique is not the coin itself, nor the \"digital gold\" narrative, but rather that blockchain is the first permissionless, unclosable value settlement layer in human history. This is a completely new category of infrastructure.</p><p style=\"text-align: left;\"> No sovereign entity can unilaterally prevent the final settlement of a BTC transaction. This property may be underestimated in peacetime, but it will be repriced during periods of geopolitical conflict and escalating capital controls. BTC is a systemic hedge. It is not a hedge against inflation, nor against the US dollar. It hedges against the structural degradation of institutional trust. In other words, BTC's value is not endogenous, but reflexive: the more people believe it has value, the more valuable it becomes, and vice versa. Therefore, BTC is a financialized expression of humanity's distrust of its own institutional capabilities. Its ceiling depends on the depth and breadth of this distrust, and its floor depends on the existence of a superior alternative.</p></div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/207da1a905ff22bf46d438aba27e60d5.jpg",
            "link": "https://www.coinlive.com/news/vitalik-buterin-unveils-ethereum-s-quantum-resistant-roadmap-us-lawmakers-propose-blockchain",
            "pub_date": "2026-02-27 07:43:24",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 250292,
            "title": "Golden Web3.0 Daily Report | Citigroup to Integrate Bitcoin This Year",
            "description": "<div class=\"share___SVvtl\"><div><h2 style=\"text-align: left;\"><strong>DeFi Data</strong></h2><p style=\"text-align: left;\"><strong>1. Total Market Cap of DeFi Tokens: $50.601 billion</strong></p><p style=\"text-align:center\"><strong><img alt=\"0kKooctvKUnmAH04vlxznn62MOcSYCSivR5Ld7Jv.png\" src=\"https://img.jinse.com.cn/7435822_watermarknone.png\" title=\"7435822\"/></strong></p><p style=\"text-align:center\"><img ...=\"\" alt=\"SifEy5tOCMyCri6IuGgh5kHfwZMH0LHP2cZThq3P.png\" src=\"https://img.jinse.com.cn/7435823_watermarknone.png\" title=\"7435823\"/></p><p style=\"text-align: center;\">DeFi Total Market Cap Data Source: coingecko</p><p style=\"text-align: left;\"><strong>2. Trading volume of decentralized exchanges in the past 24 hours: $52.89</strong></p><p style=\"text-align:center\"><strong><img alt=\"TSEmglkJEFy8MF8zGAwn7clQWKHRzhUfseQzC0WD.png\" src=\"https://img.jinse.com.cn/7435825_watermarknone.png\" title=\"7435825\"/></strong></p><p style=\"text-align:center\"><strong><img src=\"https://img.jinse.com.cn/7435824_watermarknone.png\"/></strong></p> title=\"7435824\" alt=\"XeuZd7hCxAI2rXm4t06FlJMOR6RGg2ZHImgxWFgP.png\"&gt;<p style=\"text-align: center;\">Trading volume of decentralized exchanges in the past 24 hours. Data source: coingecko</p><p style=\"text-align: left;\"><strong>3. Assets locked in DeFi: $963.99 billion</strong><strong>$100 million</strong></p><p style=\"text-align:center\"><img alt=\"FgzeSNWbrK5pEow6znTgHPdgyOHtOFGhW3FKCIkf.png\" src=\"https://img.jinse.com.cn/7435826_watermarknone.png\" title=\"7435826\"/></p><p style=\"text-align:center\"><img and=\"\" assets=\"\" by=\"\" defi=\"\" defillama=\"\" locked=\"\" projects=\"\" source:=\"\" style=\"text-align: center;\" top=\"\" total=\"\" value=\"\"/>Top 10 DeFi Projects by Locked Assets and Total Value Locked (Data Source: defillama)</p><h2 style=\"text-align: left;\"><strong>NFT Data</strong></h2><p style=\"text-align: left;\"><strong>1. Total Market Value of NFTs: $7.595 Billion</strong></p><p style=\"text-align:center\"><strong><img src=\"https://img.jinse.com.cn/7435828_watermarknone.png\" title=\"7435828\"/></strong></p> alt=\"nvqThxYW4cL6hw0mp2Vz37gki0nSqHaaE4jIOthy.png\"&gt;<p style=\"text-align:center\"><strong><img alt=\"u71uTRMWR3iGOIxTmy67VIn2OVttYJobGyLBVFnh.png\" src=\"https://img.jinse.com.cn/7435829_watermarknone.png\" title=\"7435829\"/></strong></p><p style=\"text-align: center;\">NFT Total Market Capitalization, Top Ten Projects by Market Capitalization Data Source: Coinmarketcap</p><p style=\"text-align: left;\"><strong>2.24-hour NFT transaction volume: $1.367 billion</strong><strong>USD</strong></p><p style=\"text-align:center\"><strong><img ...=\"\" according=\"\" ago=\"\" an=\"\" analyst=\"\" banking=\"\" be=\"\" billion=\"\" bitcoin=\"\" citigroup=\"\" core=\"\" ember=\"\" first=\"\" for=\"\" from=\"\" hour=\"\" in=\"\" included=\"\" integrate=\"\" is=\"\" it=\"\" july=\"\" kraken=\"\" last=\"\" launched=\"\" linked=\"\" million=\"\" of=\"\" on-chain=\"\" pump=\"\" received=\"\" representing=\"\" saying=\"\" stated=\"\" supply.=\"\" system.=\"\" that=\"\" the=\"\" this=\"\" to=\"\" total=\"\" transferred=\"\" vault=\"\" wallet=\"\" was=\"\" were=\"\" when=\"\" will=\"\" year=\"\" year.=\"\"/><h2 style=\"text-align: left;\">DeFi Hot Topics</h2><p style=\"text-align: left;\"><strong>1. Tether and Circle Expand Recruitment and Business in South Korea</strong></p><p style=\"text-align: left;\">According to South Korean media News1, industry insiders revealed that stablecoin issuer Tether recently posted recruitment information for South Korean employees, including public relations managers, blockchain investigators, and government relations specialists. Tether entered the South Korean market last year by hiring a South Korean market representative, but after that representative left the company, the company decided to expand its workforce on a larger scale. In addition, another virtual asset industry insider said, \"Circle has been effectively developing its lending business in South Korea since Circle's CEO visited South Korea last August.\" This move seems to be in response to South Korean regulations targeting overseas stablecoin issuers. The upcoming Digital Assets Basic Law (Phase II Virtual Assets Act) is expected to include relevant provisions requiring overseas stablecoin issuers to establish branches in South Korea in order to distribute their tokens in the South Korean domestic market. This means that even stablecoin issuers like Tether and Circle will need to establish branches in South Korea. 2. Willy Woo: Bitcoin Bear Market Originated from Large-Scale Selling of Bitcoin by Early Whales According to Jinse Finance, renowned analyst Willy Woo commented on the event that \"since November 2025, Jane Street Group has been experiencing large-scale selling of Bitcoin and related ETF shares every day at 10 AM when the US stock market opens,\" stating that the essence of the Bitcoin bear market is that the large-scale selling of Bitcoin by early whales far exceeds the amount of new funds entering the market. This is clearly visible on the blockchain. 3. ListaDAO Launches On-Chain Credit System, Focusing on Unsecured Loans According to Jinse Finance, DeFi protocol ListaDAO announced the launch of Lista Credit, claiming it to be the first on-chain credit lending system, aiming to provide users with a financing channel without collateral. This product allows users to borrow money at any time based on their cash flow needs, attempting to break through the current DeFi lending model that mainly relies on over-collateralization.\n\nAccording to the official introduction, Lista Credit uses a token incentive mechanism to support repayment. Borrowers can reduce repayment costs through daily and weekly LISTA incentives, while also supporting lending and repayment with the stable asset U to enhance the flexibility of fund use.\n\nListaDAO stated that this move marks a shift in the DeFi lending model from \"collateral-driven\" to \"credit-driven.\" If this model is successfully implemented, it may open up new application spaces for on-chain consumer finance, operating finance, and cash flow management scenarios. </p><ol class=\"list-paddingleft-2\"></ol><p style=\"text-align: left;\"><strong>4. GoPlus: Android malware PromptSpy can remotely control victim devices</strong></p><p style=\"text-align: left;\">According to Jinse Finance, security agency GoPlus Security disclosed a new type of Android malware, PromptSpy. This software can remotely control victim devices and use artificial intelligence technology to make malicious behavior decisions in real time, improving stealth and attack accuracy.</p><p> GoPlus advises users not to install APK files from unofficial channels, to be cautious when granting applications accessibility permissions, and to enable Google Play Protect real-time protection. According to Jinse Finance, ETHZilla, the former Ethereum vault company, announced that it will rebrand as Forum Markets next month and adopt a new Nasdaq stock code, officially shifting its business from cryptocurrency exposure on its balance sheet to tokenized real-world assets (RWA).\n\nThis move comes a week after the company announced it was abandoning the Ethereum balance sheet model, prompting investors to withdraw. Observers point out that the single-asset vault strategy relies on a sustained equity premium and a strong market environment. </p><ol class=\"list-paddingleft-2\"></ol><p style=\"text-align: left;\"><strong>Disclaimer: Jinse Finance, as a blockchain information platform, publishes articles for informational purposes only and does not constitute actual investment advice. Please establish sound investment principles and be sure to enhance your risk awareness.</strong></p></strong></p></div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/10a3cb04c639e2601c05d94c93aebf67.jpg",
            "link": "https://www.coinlive.com/news/golden-web3-0-daily-report-citigroup-to-integrate-bitcoin-this",
            "pub_date": "2026-02-26 21:50:31",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 250291,
            "title": "Whose fig leaf did ZachXBT just tear off?",
            "description": "<div class=\"share___SVvtl\"><div>An anonymous investigator with a cartoon platypus head could trigger a panic-driven self-investigation of the entire crypto industry with just a single teaser tweet—this isn't science fiction, but a real industry earthquake that occurred in February 2026. On February 24, 2026, renowned blockchain detective ZachXBT posted a short teaser on the X platform: \"On February 26th, I will expose one of the most profitable companies in the crypto industry, whose multiple employees have been using insider information for large-scale insider trading.\" This tweet quickly garnered 8 million views and 27,000 likes, setting a new personal record for him. The market reaction was far more intense than anticipated. The prediction market Polymarket quickly launched a contract predicting which company ZachXBT would expose for insider trading, with total trading volume soaring to over $30 million. The Solana ecosystem protocol Meteora was initially considered the prime suspect with a 48% probability. The entire crypto community descended into a game of fear and intrigue, searching for the \"insider.\" This precisely exposes a harsh reality within the crypto industry: insider trading is not an isolated phenomenon, but a systemic problem. When a mere mention of a platypus can send shivers down the spine of the entire industry, we are compelled to ask: Whose veil has ZachXBT lifted? <h2 style=\"text-align: left;\">01 Detective and Prey: An Asymmetrical War of Transparency</h2><p style=\"text-align: left;\">To understand the industry earthquake triggered by ZachXBT, we must first recognize the unique position of this \"on-chain Sherlock Holmes.\" This retail investor, who lost $15,000 in a 2018 wallet hack and subsequently taught himself blockchain analysis, has now become one of the most feared investigative forces in the crypto world.</p><p style=\"text-align: left;\">ZachXBT's working methods embody the paradox of blockchain technology's transparency. He utilizes fully public on-chain data—transaction flows, wallet clusters, mixer models—combined with traditional open-source intelligence gathering to construct a convincing chain of evidence. His past achievements include: directly recovering $210 million in stolen funds, assisting in the arrest of suspects related to the Terra crash, and exposing more than 25 attacks by the North Korean hacking group Lazarus Group.</p><p> The narrative of \"one man against the entire dark forest\" holds true because of the regulatory vacuum in the crypto industry. Traditional financial markets have regulatory bodies like the SEC and CFTC, with clear definitions and legal consequences for insider trading. In the crypto world, however, the gap between regulatory lag and the speed of technological innovation creates enormous arbitrage opportunities. ZachXBT's influence is essentially a form of \"alternative regulation.\" While formal regulatory bodies are still trying to understand the basic concepts of blockchain, this anonymous detective has already conducted enforcement actions using code and data analysis. His presence has changed industry behavior—fraudsters now know that transferring stolen funds could be the start of a public investigation. 02 Under the Fig Leaf: The Three Masks of Insider Trading ZachXBT's investigation announcement triggered industry-wide panic because it touched on the three most sensitive nerves regarding insider trading in the crypto industry. **First Mask: Exchange Employees' \"Information Privileges\"**. This model is considered classic insider trading in traditional financial markets, but it has long existed in a gray area in the crypto world. Exchanges play the dual role of referee and player, giving their employees far more access to core data than traditional brokerages. **Second Mask: Market Makers' \"Algorithmic Manipulation\"**. Almost simultaneously with the ZachXBT investigation, Wall Street quantitative giant Jane Street is facing insider trading allegations. The lawsuit alleges that Jane Street employees obtained non-public information about Terraform Labs' liquidity operations through a private chat group called \"Bryce's Secret.\" On May 7, 2022, less than ten minutes after Terraform Labs withdrew $150 million of UST from Curve 3pool, wallets associated with Jane Street withdrew $85 million of UST, directly accelerating UST's de-anchoring and the evaporation of $40 billion in market value. Even more disturbingly, Jane Street was accused of running a \"10 AM crash algorithm.\" Blockchain analysts discovered that throughout 2025, Bitcoin experienced a sudden sell-off every trading day at 10 AM Eastern Time (coinciding with the opening time of the US stock market), triggering leveraged long liquidations followed by a rapid price rebound. After Jane Street was sued, this pattern abruptly stopped, and Bitcoin saw its largest single-day gain in months. The third mask: \"Legitimized insider trading\" in prediction markets. The frenzied betting on ZachXBT investigation subjects on Polymarket is itself an irony of the industry's current state. Users are attempting to \"trade insider information about insider trading investigations.\" This is not an isolated case: in December 2025, multiple accounts accurately bet on the week before OpenAI released GPT-5.2, profiting over $13,000; one account profited $1 million in a single day by betting on Google search data. In January 2026, a new account placed a $30,000 bet before Maduro was detained and profited $400,000 within 24 hours. Polymarket's rules actually encourage betting based on private information, arguing that this reflects market efficiency. However, when this \"efficiency\" is built on information asymmetry, it is essentially a variant of insider trading. 03 Systemic Disease: Why is Insider Trading So Difficult to Eradicate in the Crypto Industry? The rampant insider trading in the crypto industry is not accidental, but a systemic disease determined by its underlying logic and current stage of development. The conflict between technological transparency and human greed is the fundamental contradiction. Blockchain technology is inherently transparent; every transaction is recorded on a public ledger. However, this technological transparency does not automatically translate into behavioral transparency. Instead, it creates the illusion that since everything is on-chain, there should be no black box operations. The reality is quite the opposite—transparent data requires professional interpretation, and the right to interpret it often resides in the hands of a few. The business model of regulatory arbitrage fuels this phenomenon. Many crypto companies headquartered in jurisdictions with lax regulations, exploiting differences in regulatory standards across countries for arbitrage. Jane Street was fined $560 million in India for cross-market manipulation, but this did not deter similar activities in other markets. The culture of early, unregulated growth in the industry has not completely faded. From its inception, the crypto industry has been strongly anti-establishment and anti-regulatory; the concept of \"code is law\" was initially simplified to \"no law.\" Although mainstream institutions are entering the market, the cultural inertia of profiting from information asymmetry remains strong. The difficulty of investigating complex violations further complicates the issue. Insider trading in the crypto industry is often intertwined with other violations such as market manipulation, money laundering, and fraud. As the Jane Street case illustrates, insider trading accelerated market crashes, which in turn created new opportunities for manipulation. This \"illegal ecosystem\" makes investigation and evidence collection exceptionally difficult. </p><h2 style=\"text-align: left;\">04 Traditional vs. Crypto: The \"Evolution\" of Insider Trading</h2><p style=\"text-align: left;\">Comparing insider trading models in traditional and crypto finance reveals some disturbing \"evolutionary\" trends.</p><p style=\"text-align: left;\"><strong>Anonymity shifts from interpersonal networks to technological networks.</strong> Traditional insider trading relies on offline communication such as phone calls and meetings, while insider information in the crypto world can be instantly transmitted globally through encrypted chat software and dark web forums. Jane Street's \"Bryce's Secret\" Telegram group is a typical example.</p><p style=\"text-align: left;\"><strong>Operational methods shift from manual decision-making to algorithmic execution.</strong> Traditional insider traders need to place orders manually, while crypto market makers can write algorithms to automatically execute insider trading strategies.</p><p style=\"text-align: left;\"><strong>Operational methods shift from manual decision-making to algorithmic execution.</strong> If the allegations against Jane Street regarding the \"10 AM crash algorithm\" are true, it represents an extreme case of algorithmic insider trading. The impact has shifted from localized markets to global reach. Traditional insider trading typically affects a single market or asset, but the 24/7 global trading nature of the crypto market allows its effects to instantly impact investors worldwide. The Terra crash wiped out $40 billion in market capitalization, with victims across the globe. Regulatory arbitrage has shifted from geographical avoidance to technological avoidance. Traditional financial institutions evade regulation by registering in tax havens, while crypto companies leverage the anonymity and cross-border nature of blockchain to create a more sophisticated form of regulatory arbitrage. 05 Behind the Fig Leaf: What Kind of Transparency Revolution Does the Industry Need? ZachXBT's investigation acts as a mirror, reflecting the truth the crypto industry least wants to face. The issue isn't whether insider trading exists, but whether the industry is prepared for a genuine revolution in transparency. Technological transparency is not ethical transparency—this is the first lesson the industry must learn. Blockchain can ensure the immutability of transaction data, but it cannot guarantee the purity of transaction motives. The industry needs to establish ethical standards that go beyond code. The paradox of decentralized ideals requiring centralized accountability urgently needs to be resolved. The crypto world champions decentralization, but effective regulation requires a clearly defined accountable body. How to maintain the advantages of decentralization while establishing an effective governance structure is key to the industry's maturity. Regulatory innovation must keep pace with technological innovation. Traditional financial regulatory frameworks, built on paper transactions and T+2 settlements, are completely unsuitable for the real-time and global nature of the crypto world. Regulators need to learn, like ZachXBT, to use blockchain tools to regulate the blockchain world. Investor education needs to shift from \"get-rich-quick myths\" to \"risk awareness.\" Too many investors are attracted by high returns but lack basic understanding of systemic risks such as insider trading and market manipulation. The industry has a responsibility to provide more comprehensive risk disclosure. ZachXBT's platypus icon cast a shadow over the crypto world that is far longer than many are willing to admit. The market panic triggered by his investigative announcements was not fear of a specific company, but a collective anxiety about the ethical bottom line of the entire industry. When Polymarket users frantically bet on who the next \"mole\" will be, when Jane Street's algorithm is accused of regularly dumping tokens and profiting from retail investors, when exchange employees use listing information for personal gain—these are not isolated incidents, but different symptoms of the same disease. The disease is called structural information asymmetry, and the cure is called systemic transparency. The veil lifted by ZachXBT exposes not just a few bad apples, but an entire orchard in dire need of overhaul. The crypto industry stands at a crossroads: will it continue its unchecked growth in a regulatory vacuum, ultimately self-destructing due to a collapse in trust; or will it proactively embrace a revolution in transparency, establishing a trustworthy new financial paradigm? The answer will determine whether this industry becomes the hope for financial democratization or merely a speculative casino of Wall Street 2.0. And time is ticking away.</p></div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/e23dd43c4b42b7ec1840003fb552b958.jpg",
            "link": "https://www.coinlive.com/news/whose-fig-leaf-did-zachxbt-just-tear-off",
            "pub_date": "2026-02-26 21:53:12",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 250289,
            "title": "Jane Street scandal exposed",
            "description": "<div class=\"share___SVvtl\"><div>This powerful trading firm, which you may have never heard of, has been caught red-handed. And twice, on two different continents. This is precisely why Bitcoin has finally gained its freedom. Let me explain: Jane Street Group is a New York-based quantitative trading firm. They don't have a CEO. According to their own description, they operate like an \"anarchist commune.\" In the first nine months of 2025 alone, their net trading revenue reached $24 billion, surpassing their total revenue of $20.5 billion for the entire year of 2024. In the second quarter of 2025 alone, their revenue reached $10.1 billion, the highest quarterly trading revenue ever recorded by any Wall Street firm. From any perspective, they are the most profitable trading firm in the world. This week, the bankruptcy administrator of Terraform Labs filed a lawsuit in Manhattan federal court, accusing Jane Street of using insider information to manipulate the Terra Luna crash in May 2022. This crash wiped out $40 billion in market capitalization and triggered a chain reaction, ultimately leading to the collapse of companies such as Celsius, Three Arrows Capital, and FTX. The accusation is shockingly simple. On May 7, 2022, Terraform Labs quietly withdrew $150 million worth of UST from Curve3pool, a large decentralized liquidity pool. There was no public announcement; the liquidity was withdrawn silently. Ten minutes later, a wallet associated with Jane Street withdrew $85 million from the same liquidity pool. Just ten minutes later. The lawsuit alleges that former Terraform intern Bryce Pratt (who joined Jane Street as a full-time employee in September 2021) established secret contacts with his former colleagues at Terraform. He allegedly passed significant, non-public information regarding changes in Terraform liquidity directly to Jane Street's trading department. The lawsuit names four defendants: Jane Street Group LLC, co-founder Robert Granieri, and employees Bryce Pratt and Michael Huang. The administrator's statement hits the nail on the head: Jane Street conducted \"trades that would have been impossible without its unique insider information.\" Worse still, the lawsuit claims Jane Street's withdrawal triggered the decoupling from UST, causing the entire Terraform ecosystem to collapse. LUNA's price plummeted from over $80 to near zero, wiping out $40 billion. Ordinary people suffered devastating losses; retirement savings, children's education funds, and life's work vanished in just a few days. What was Jane Street's response? They called it \"desperate\" and \"baseless.\" But the problem is: this wasn't the first time they'd done something like this. In July 2025, the Securities and Exchange Commission of India (SEBI) filed one of the most serious market manipulation charges against Jane Street in the country's history. The SEBI investigation found that Jane Street had engaged in textbook pump-and-dump operations on the Bank Nifty index across 18 derivative maturities between January 2023 and March 2025. <p style=\"text-align:center\"><img src=\"https://img.jinse.com.cn/7435837_image3.png\"/></p><p style=\"text-align: left;\">Their methods were highly mechanical:</p><p style=\"text-align: left;\">In the morning: Jane Street's algorithm heavily bought the constituent stocks of the bank stock index and their futures, pushing the index up by 1% to 1.3%. SEBI found that on some trading days, Jane Street alone had the entire impact on the index's rise.</p><p style=\"text-align: left;\">At the same time, they bought a large number of short options, mainly selling call options and buying put options, in a ratio severely imbalanced with their stock holdings. SEBI found that, calculated by delta, option holdings were 7.3 times that of stock and futures holdings. This is not hedging or arbitrage, but rather directional manipulation with additional steps.</p> Afternoon: They reversed their actions, selling all the stocks they had bought in the morning. The index fell, and the short options profited. This operation was repeated every expiry date. The Securities and Exchange Commission of India (SEBI) assessed that the illegal profits amounted to 48.43 billion rupees, approximately $580 million. The SEBI called Jane Street's actions \"a means of deliberately manipulating settlement prices.\" They noted that Jane Street continued this strategy even after the National Stock Exchange of India (NSE) issued a clear warning in February 2025. The SEBI's wording was unusually harsh for the regulator: \"The integrity of the market, and the trust of millions of small investors and traders, can no longer be held hostage by such untrustworthy manipulators.\" Jane Street was subsequently banned from the Indian securities market. They deposited over $560 million into a third-party escrow account and immediately filed an appeal. As of now, the case is still being heard in the Indian Securities Appeals Court. Now let's talk about Bitcoin. Since November 2025, Bitcoin traders have noticed some strange phenomena. Every morning around 10 AM (Eastern Time), when the US stock market opens, the selling volume of Bitcoin and its related ETFs increases significantly. This pattern is unusually stable. Bitcoin surges overnight during Asian and European trading sessions, then immediately plummets after the New York Stock Exchange opens. (For details, please refer to Trading View's analysis and statistics)<p style=\"text-align:center\"><img src=\"https://img.jinse.com.cn/7435839_image3.png\"/></p><p style=\"text-align: left;\">These numbers are significant. The chart from December 2025 shows that on some days, the price of Bitcoin plummeted from $89,700 to $87,700 within minutes, resulting in losses of up to $171 million for leveraged long positions before recovering. This occurred repeatedly on December 1st, 5th, 8th, 10th, 12th, 15th, and in January and February 2026.</p> ... The crypto Twitter community calls this the \"10am crash.\" The blame is being placed on Jane Street, and for good reason. Jane Street is one of only four authorized participants in BlackRock's IBIT (the world's largest spot Bitcoin ETF). The other three are Virtu Americas, JPMorgan Securities, and Marex. As an authorized participant, Jane Street has unique authority to create and redeem ETF shares, meaning they are directly involved in the flow of Bitcoin among institutional investors. Their 13F filings confirm their large holdings. As of the third quarter of 2025, Jane Street held $5.7 billion worth of IBIT stock. They added another $276 million in the fourth quarter of 2025, bringing their total holdings to over 20 million shares, worth approximately $790 million at year-end prices. At its peak, their IBIT stock holdings were worth close to $2.5 billion. However, what is suspicious is that Jane Street allegedly sold off spot Bitcoin every morning, while simultaneously increasing their holdings of MSTR (Strategy, formerly MicroStrategy) stock by 473% in the fourth quarter of 2025, accumulating 951,187 shares, worth approximately $121 million. Meanwhile, other large funds, such as BlackRock and Vanguard, were selling billions of dollars worth of MSTR stock. Think about it: sell Bitcoin at the open, causing a price crash, liquidating leveraged long positions, and then buying it back at an even lower price. Simultaneously, buy large amounts of the most leveraged Bitcoin alternatives on the market, then wait for the inevitable rebound. Glassnode co-founders Jan Happel and Yann Allemann reignited this theory through their Negentropic account, linking algorithmic trading to the Terraform lawsuit. The Milk Road account further reinforced the theory, describing \"persistent rumors\" about institutional trading departments operating \"very specific/questionable operating manuals.\" Then the lawsuit was filed. Then something extraordinary happened. The expected 10am crash after Terraform filed its lawsuit against Jane Street…didn't happen. For the first time in months, Bitcoin didn't crash at the US open. Instead, it rose. On February 25, 2026, Bitcoin surged over 3%, breaking through multiple resistance levels and trading above $68,000, whereas just days earlier it might have even fallen below $60,000. Over $323 million in short positions were liquidated. The Stochastic Relative Strength Index (Stochastic RSI) reached 100. ETFs saw a record $257.7 million in inflow in a single day, the highest since early February. This pattern has been broken. Now, I want to be cautious. Correlation does not equal causation. Multiple factors are at play: Trump's State of the Union address, oversold technical conditions, and short covering. The Fear &amp; Greed Index reached 11, indicating extreme panic, which typically signals a turning point for contrarian trading. The RSI fell to 15.80, a level not seen since the 2020 COVID-19 crash, which was followed by a 1400% rebound. But timing is not to be ignored. Rumors are circulating on X that Jane Street was \"forced to shut down their trading algorithm\" after the lawsuit. Jane Street told Cointelegraph that these claims are \"baseless and opportunistic accusations.\" Whether they were forced to stop or chose to suspend operations out of legal caution, the result was the same: the selling pressure disappeared. What does this really mean for Bitcoin? Spot Bitcoin ETFs were initially expected to act as market equalizers. They had institutional access, were regulated products, and were endorsed by BlackRock. And they did achieve tremendous success, with IBIT alone raising over $20 billion since its launch. However, the structure of ETFs introduced something Bitcoin originally intended to circumvent: privileged, trusted intermediaries with access to the core trading system. When the U.S. Securities and Exchange Commission (SEC) approved spot Bitcoin ETFs in January 2024, it stipulated that subscriptions and redemptions could only be made in cash. Each time subscriptions or redemptions were needed, someone had to buy and sell actual Bitcoin. The institutions participating in this process, i.e., authorized participants, possess a structural advantage over all other participants in the market. In September 2025, the U.S. Securities and Exchange Commission (SEC) approved the physical creation and redemption of IBIT, meaning authorized participants can now directly exchange Bitcoin for ETF units without going through fiat currency. This gives institutions like Jane Street, Virtu, JPMorgan Chase, and Marex greater direct control over Bitcoin inflows and outflows in this largest institutional-grade ETF. The 10am plunge is essentially a symptom of the same intractable problem that has plagued the gold market for decades. As I explained in my article \"The Beginning of the Gold Endgame\": the competition between simulated trading platforms allows institutions with the most privileges to manipulate prices before other market participants can react. JPMorgan Chase traders Greg Smith and Michael Novak were convicted of fraud in the precious metals futures market, a scheme that lasted eight years and involved thousands of illegal transactions. JPMorgan Chase paid a $920 million settlement. Deutsche Bank also paid $30 million for the same offense. UBS, HSBC, and six individual traders faced charges from the Commodity Futures Trading Commission (CFTC) for violating anti-fraud measures. Same tactics, different assets. Each time, these companies called it \"market making,\" \"arbitrage,\" or \"hedging\"—the euphemisms are numerous. The result is always the same: ordinary people get ripped off, while insiders profit. So, what do we do next? The broader structural problems haven't changed. The $4.5 billion outflow from ETFs in the first eight weeks of 2026 is worrying, but Strategy (Saylor's company) just bought $39 million worth of Bitcoin, accounting for 99% of all publicly traded companies' Bitcoin purchases during that period. Large institutions aren't selling off; they're waiting for the algorithm to finish its work. Perhaps, the algorithm really has. If Jane Street is forced to halt its so-called daily sell-off program (whether due to legal risks, multi-continental regulatory scrutiny, or simply self-preservation), the structural resistance that has plagued Bitcoin for four months will be eliminated. Bitcoin was born for this moment. It is a monetary system that does not rely on trusted intermediaries, requires no authorized participants, and cannot be preemptively traded by former interns through private channels. But let's not forget what brought us to this point. Companies that were supposed to be \"market makers\" and \"liquidity providers\" have been accused of front-trading, manipulating national stock indices, and running daily algorithmic sell-off programs to trade assets tracked by their ETFs. And this is precisely the system that Bitcoin aims to replace.</div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/d48055b229a989e0984fd1c4011f57da.jpg",
            "link": "https://www.coinlive.com/news/jane-street-scandal-exposed",
            "pub_date": "2026-02-26 21:45:32",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 250287,
            "title": "Deciphering EF's Latest Protocol Roadmap: Is It Officially Entering the Era of Engineering Upgrades?",
            "description": "<div class=\"share___SVvtl\"><div><p style=\"text-align: left;\"><strong>Written by:</strong>imToken</p><p style=\"text-align: left;\">On February 18th, the Ethereum Foundation (EF) released the \"Protocol Priorities Update for 2026.\" Compared to previous fragmented updates centered around EIPs, this roadmap is more like a strategic schedule, clearly defining the upgrade pace, priority allocation, and the three main themes that the protocol layer will revolve around in the coming year: Scale, Improve UX, and Harden the L1.</p><p style=\"text-align: left;\">Behind this, from the successful delivery of the two hard forks (Pectra/Fusaka) in 2025 to the early planning of the dual main themes of Glamsterdam and Hegotá in 2026, we have also seen a profound shift in Ethereum development towards \"predictable engineering delivery,\" which may be the most important protocol layer signal in recent years.</p><h2 style=\"text-align: left;\"><span style=\"font-size:24px;\">I. Ethereum in 2025: Turmoil and Institutionalization</span></h2><p style=\"text-align: left;\">If you've been following Ethereum, you'll know that 2025 was a year of intertwined contradictions for the protocol. While the price of ETH may have hovered at a low level, the protocol layer underwent unprecedented and intensive changes.</p><p style=\"text-align: left;\"> Especially in early 2025, Ethereum experienced a rather awkward period. At that time, EF was at the center of a media storm—community criticism was rampant, and some even called for the introduction of a so-called \"wartime CEO\" to drive change. Ultimately, a series of internal power struggles became public, forcing the highest-level power reorganization in EF's history: In February, Executive Director Aya Miyaguchi was promoted to President, and Vitalik Buterin promised to restructure the leadership; Subsequently, Hsiao-Wei Wang and Tomasz K. Stańczak became co-executive directors; and Etherealize, a new marketing narrative agency led by former researcher Danny Ryan, was established; Meanwhile, EF further restructured its board of directors and clarified its cypherpunk values; By mid-year, the foundation also restructured its R&amp;D department, integrating teams and making personnel adjustments to ensure that core protocol priorities were focused; This series of measures proved effective, significantly strengthening Ethereum's execution capabilities. Especially with the successful implementation of the Fusaka upgrade at the end of the year, just seven months after the Pectra upgrade in May, it demonstrated that EF, despite significant leadership changes, still had the ability to drive major updates, marking Ethereum's entry into an accelerated development pace of \"two hard forks per year.\" Since the network transitioned to PoS through The Merge in September 2022, the Ethereum network has essentially focused on only one major upgrade per year, such as the Shapella upgrade in April 2023 and the Dencun upgrade in March 2024: the former opened staking withdrawals, completing a key step in the PoS transition; the latter launched EIP-4844, officially opening the Blob data channel, significantly reducing L2 costs. In 2025, two important hard fork upgrades, Pectra and Fusaka, were completed. More importantly, 2025 saw the first systematic planning of naming upgrades for the next two years: Glamsterdam and Hegotá. While there's no official written rule, it's interesting that late last year, The Block cited a Consensys source saying that since The Merge, Ethereum researchers aimed for a major upgrade every year, but now they are planning to \"accelerate the pace of hard forks, switching to once every six months,\" and explicitly stated that Fusaka initiated Ethereum's twice-yearly upgrade cycle. This \"institutional\" change regarding the upgrade schedule can be considered a milestone. The reason is simple: previously, the release schedule depended more on the development readiness, and for developers and infrastructure, the expected window was unstable, and as those familiar with the industry know, delays were not uncommon. This also means that the successful delivery of the two major upgrades in 2025 validated the feasibility of \"upgrades every six months.\" The systematic planning of two named upgrades (Glamsterdam and Hegotá) in 2026, with priority arrangements around these two nodes across three development tracks, represents a further institutionalization. Theoretically, this is somewhat similar to the release schedule of Apple or Android systems, aiming to reduce uncertainty for developers and potentially bringing three positive impacts: enhanced L2 predictability, such as allowing Rollups to plan parameter adjustments and protocol adaptations in advance; clear wallet and infrastructure adaptation windows, enabling product teams to plan compatibility and feature launches according to schedule; and stable institutional risk assessment cycles, meaning upgrades are no longer unexpected events but a regular engineering practice. This structured rhythm is essentially a manifestation of engineering management and also highlights Ethereum's shift from scientific research to engineering delivery. II. The Three Pillars of Protocol Development in 2026 A closer look at the 2026 protocol priority update plan reveals that EF no longer simply lists scattered EIPs, but reorganizes protocol development into three strategic directions: Scale, Improve UX, and Harden the L1. First is Scale, which merges the original \"Scale L1\" and \"Scale blobs\" because EF recognizes that scaling the L1 execution layer and broadening the data availability layer are two sides of the same coin. Therefore, the most eye-catching technology in the upcoming Glamsterdam upgrade in the first half of the year is \"Block-level Access Lists,\" which aims to completely change Ethereum's existing transaction execution model—which can be understood as changing from a \"single lane\" of sequential processing to a \"multi-lane\" of parallel processing: Block producers will pre-calculate and mark which transactions can run simultaneously without conflict, and clients can then allocate transactions to multiple CPU cores for parallel processing, thereby greatly improving efficiency; at the same time, ePBS (built-in proposer-builder separation) will also be included in the upgrade, embedding the MEV-Boost process, which currently relies on external relays, into the protocol itself, not only reducing the risk of centralization but also providing validators with a more ample time window to verify ZK proofs. With these underlying optimizations, the race to increase the Gas cap will intensify in 2026. EF has already set a clear goal of \"moving towards 100 million and above,\" with radical proponents even predicting that after ePBS, the Gas cap could double to 200 million or even higher. For L2, increasing the number of blobs is equally crucial, with the number of data blocks per block expected to increase to over 72, supporting hundreds of thousands of transactions per second on the L2 network. Secondly, there's the Improve UX, aiming to eliminate cross-chain barriers and popularize cross-chain interoperability and native account abstraction. As mentioned earlier, EF believes the core of solving L2 fragmentation lies in making Ethereum \"feel like a chain again,\" a vision that relies on the maturity of the intent architecture. For example, the Open Intents Framework, launched by EF in collaboration with multiple teams, is becoming a universal standard. It allows users to simply declare their desired outcome when transferring assets between L2 blockchains, while the underlying solver network performs the complex path calculations. The Ethereum Interoperability Layer (EIL) goes a step further, attempting to build a trustless transport layer, aiming to provide cross-L2 transactions with an experience indistinguishable from single-chain transactions. At the wallet level, native account abstraction will remain a key focus this year. Following the first step with EIP-7702 in Pectra in 2025, EF plans to push for proposals such as EIP-7701 or EIP-8141 in 2026. The ultimate goal is to make every wallet on Ethereum a smart contract wallet by default, completely eliminating complex EOA wallets and additional gas payment intermediaries. Furthermore, the implementation of L1 fast confirmation rules will significantly reduce confirmation time from the current 13-19 minutes to 15-30 seconds. This will directly benefit all cross-chain applications that rely on L1 finality, which is of great significance for cross-chain bridges, stablecoin settlement, and RWA asset trading. Finally, there's Harden the L1, aiming at a trillion-dollar security defense line. This is also due to the increasing value locked in the Ethereum ecosystem, elevating the security resilience of the L1 layer to a strategic level. Regarding censorship resistance, FOCIL (Fork Selective Include List, EIP-7805) is becoming a core solution. It empowers multiple validators to force specific transactions to be included in blocks. Even if block producers attempt to censor, as long as a portion of the network is honest, the user's transaction will eventually be recorded on the chain. Facing the long-term threat of quantum computing, EF established a new post-quantum (PQ) research team at the beginning of the year. Their work in 2026 will focus on researching quantum-resistant signature algorithms and considering how to seamlessly migrate them to the Ethereum mainnet, ensuring the security of billions of dollars in assets in the future is not threatened by quantum algorithm cracking. III. A More \"Collaborative\" Ethereum is Coming. In general, if one word could summarize Ethereum in 2026, it would be \"collaboration.\" Upgrades will no longer revolve around a single explosive innovation, but rather around the coordinated advancement of three main lines: **Scale** handles throughput and cost; **Improve UX** handles usability and adoption; and **Harden the L1** handles security and neutrality. These three elements together determine whether Ethereum can support the on-chain economy of the next decade. Meanwhile, more noteworthy than the technology roadmap is the strategic shift reflected behind this \"three-track\" structure. As mentioned above, when the Fusaka upgrade is successfully completed at the end of 2025 and the rhythm of two hard forks per year is established, Ethereum has actually completed a \"systematic\" leap in its development model. The priority update released in early 2026 further extends this institutionalization to the planning level of technology direction—in the past, Ethereum upgrades often revolved around a \"star proposal\" (such as EIP-1559, merge, EIP-4844), but now, upgrades are no longer defined by a single proposal, but consist of the coordinated advancement of three tracks. From a broader perspective, 2026 is also a crucial year for the reconstruction of Ethereum's \"value narrative.\" In recent years, market pricing of Ethereum has largely revolved around the \"fee increases brought about by L2 scaling.\" However, with improvements in mainnet performance and the shift of L2's positioning from \"sharding\" to \"trust spectrum,\" Ethereum's core value is being re-anchored to its irreplaceable position as \"the world's most secure settlement layer.\" What does this mean? Simply put, Ethereum is transforming from a platform reliant on \"transaction fee revenue\" into an asset anchor reliant on a \"security premium.\" The profound impact of this shift may gradually become apparent in the coming years—when stablecoin issuers, RWA tokenization institutions, and sovereign wealth funds choose their settlement layer, they will not choose the cheapest network, but the most secure one. Ethereum is truly evolving from a \"technology testing ground\" into an \"engineering delivery platform,\" and the institutionalization of Ethereum protocol governance may truly mature by 2026. And we may be at a peculiar juncture: the underlying technology is becoming increasingly complex (such as parallel execution and the PQ algorithm), but the user experience is becoming increasingly simple. The maturity of account abstraction and intent frameworks is pushing Ethereum towards that ideal endpoint—returning Web3 to user intuition. If this can truly be achieved, Ethereum in 2026 could very well transform from a blockchain testing ground into a global financial foundation capable of supporting trillions of dollars in assets, where users don't need to understand the underlying protocol.</p></div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/a37e598cc058d09ce6cee2f712f2822c.jpg",
            "link": "https://www.coinlive.com/news/deciphering-ef-s-latest-protocol-roadmap-is-it-officially-entering-the",
            "pub_date": "2026-02-26 21:39:31",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 250272,
            "title": "Detailed teardown of BIP-110 (10,000-word article)",
            "description": "<div class=\"share___SVvtl\"><div>In February 2026, the controversial Bitcoin proposal BIP-110 was officially merged into the official BIP proposal repository [1]. This Bitcoin improvement proposal, proposed by developer Dathon Ohm, strongly supported by developer Dash Luke Jr., and promoted by the implementation of the client Bitcoin Knots, aims to prevent the Bitcoin blockchain space from being occupied by non-BTC transactions (i.e., so-called ecosystem applications, such as inscriptions, BRC-20, and other use cases). It has received much attention and debate from the community before and after its inception. This article intends to dissect it to see if some insightful conclusions can be drawn. <h2 style=\"text-align: left;\"><span leaf=\"\"><span text=\"\">I. Core Content of the Proposal:</span></span>A \"Temporary Soft Fork\" for Data Storage</h2><p style=\"text-align: left;\"><span leaf=\"\">BIP-110 is titled \"Reduced Data Temporary Softfork,\" and its core objective is very clear: to temporarily limit the size of data fields at the consensus level to correct the incentive distortion caused by standardization supporting arbitrary data, and to refocus priorities on improving Bitcoin's function as a currency.</span></p><h2 style=\"text-align: left;\"><span leaf=\"\"> Specifically, the proposal stipulates that during the one-year temporary deployment period, blocks must comply with the following additional rules: (1) Script public key (scriptPubKey) length limit: Newly created output script public keys exceeding 34 bytes are invalid, unless the first opcode is OP_RETURN (in which case a maximum of 83 bytes is allowed). This means that, except for explicitly discardable outputs like OP_RETURN, the core identifiers of all UTXOs must be simplified. (2) Data push and witness element size limit: Data pushed by OP_PUSHDATA* series opcodes and witness stack elements exceeding 256 bytes are invalid (except for redeemScript in BIP16). This directly targets the practice of embedding large blocks of data into transactions, such as inscriptions. (3) Undefined Witness Versions Disabled: Spending undefined witness versions (i.e., non-Witness v0/BIP 141, Taproot/BIP 341, or P2A) is considered invalid. While creating such outputs is still allowed, they cannot be spent within the next year. (4) Taproot Annexes Disabled: Witness stacks containing Taproot annexes are considered invalid. Annexes, as undefined data fields reserved for future upgrades, are currently completely blocked. (5) Taproot Control Block Size Limit: Taproot control blocks exceeding 257 bytes (corresponding to a Merkle tree with a maximum of 128 script leaves) are invalid. This limits the script complexity that a single UTXO can support. (6) OP_SUCCESS* opcodes disabled: OP_SUCCESS* opcodes in Tapscript (whether executed or not) are invalid. These opcodes are also reserved for future upgrades. (7) Conditional opcodes disabled: OP_IF or OP_NOTIF instructions in Tapscript (regardless of the result) are invalid. This directly combats the use of conditional statements to hide data. It is worth noting that UTXOs created before the activation height are not subject to the new rules when spent. After the one-year period of the soft fork, all UTXOs will return to an unrestricted state. </span><h2 style=\"text-align: left;\"><span leaf=\"\"><span text=\"\">II. Motivation of the Proposal:</span></span> Combating “Data Abuse” and Defending the “Essence of Money”</h2></h2><p style=\"text-align: left;\"><span leaf=\"\">The motivation section of BIP-110 is strongly worded, reflecting the proposer’s fundamental rejection of so-called “data embedding” behavior. Its core logic can be summarized as follows:</span></p><p style=\"text-align: left;\"><span leaf=\"\">(1) Continuation of Historical Tradition</span></p><p style=\"text-align: left;\"><span leaf=\"\">The proposal points out that the Bitcoin community has historically treated the technology of embedding arbitrary data into Bitcoin transactions with an “adversarial” attitude. This adversarial attitude is seen as a necessary means to protect Bitcoin as the “native currency of the Internet”.</span></p><p style=\"text-align: left;\"><span leaf=\"\"> From the early discussions of OP_RETURN in 2010, to the debate about blockchain size in 2013-2014, and then to the inscription controversy since 2022, this line of thought has always existed. </span></p><p style=\"text-align: left;\"><span leaf=\"\">(2) Incentive Distortion and Negative Externalities</span></p><p style=\"text-align: left;\"><span leaf=\"\">This is the most convincing technical argument of the proposal. The proposal argues that fee markets cannot properly solve the incentive problem of data storage:</span></p><p style=\"text-align: left;\"><span leaf=\"\">- Payment Transaction: Payers pay miners a one-time fee to obtain a one-time settlement service. After the miners complete the service, node operators voluntarily maintain the historical ledger because it is the basis for Bitcoin's operation as a currency.</span></p><p style=\"text-align: left;\"><span leaf=\"\">- Data Storage Transaction: Payers only pay a one-time fee to the miners who contain the data, but the burden of storing the data permanently falls on all node operators.</span></p><p style=\"text-align: left;\"><span leaf=\"\"> Node operators never receive any fee sharing, yet they are forced to download, store, and provide this data indefinitely. This asymmetric incentive results in miners profiting while nodes bear the costs, objectively encouraging data embedding behavior and undermining network decentralization. (3) Response to emerging trends such as \"inscriptions\" The proposal explicitly mentions the \"inscription\" technology (i.e., Ordinals) that began to be \"exploited\" in 2022, arguing that it creates \"significantly unnecessary burdens on node operators\" and shifts the development focus—from Bitcoin's fundamental purpose as a \"sound, permissionless, borderless currency\" to supporting non-monetary use cases. (4) Protecting Payment Use Cases and Censorship Resistance The proposal argues that data storage and payments unfairly compete for block space, driving up Bitcoin payment costs and forcing people to rely on third-party payment processors, thus making Bitcoin payments more susceptible to censorship. By limiting data storage, payment costs can be reduced and censorship resistance enhanced. (5) Maintaining Low-Cost Node Operations Maintaining a low barrier to entry for running nodes (whether in terms of financial or other costs) has always been a core promise of Bitcoin's decentralization. Limiting the expansion of UTXO sets and the unlimited growth of block data directly serves this goal. </span></p><h2 style=\"text-align: left;\"><span leaf=\"\"><span text=\"\">III. Technical Details of the Proposal:</span></span>A Carefully Designed \"Containment\" Strategy</h2><p style=\"text-align: left;\"><span leaf=\"\">The technical design of BIP-110 embodies the idea of ​​\"minimal intervention, maximum effect,\" attempting to block the main data embedding pathways while minimizing impact on known currency use cases.</span></p><p style=\"text-align: left;\"><span leaf=\"\">(1) Why limit the script public key to 34 bytes?</span></p><p style=\"text-align: left;\"><span leaf=\"\">The script public key in the UTXO set must be stored in a fast medium (usually RAM), which is far more expensive than slow storage. Modern Bitcoin practice has moved all spending conditions to the witness, and the script public key only needs to commit to these conditions with a hash value, so 34 bytes is sufficient.</span></p><p style=\"text-align: left;\"><span leaf=\"\"> Large script public keys not only waste space, but can also be used to create \"poisoned blocks\" (maliciously crafted blocks with extremely long verification times). Limiting them has almost no impact on existing practices. </span></p><p style=\"text-align: left;\"><span leaf=\"\">(2) Why retain OP_RETURN? </span></p><p style=\"text-align: left;\"><span leaf=\"\">OP_RETURN output has been proven to be unspendable, and nodes do not need to store it in the UTXO set. Historically, a maximum of 83 bytes was tolerated simply to avoid garbage data flooding other types of output scripts. Although pay-to-contract and Taproot techniques can replace the functionality of OP_RETURN, the proposal retains this option to avoid breaking legacy protocols. </span></p><p style=\"text-align: left;\"><span leaf=\"\">(3) Why limit the data size to 256/257 bytes? </span></p><p style=\"text-align: left;\"><span leaf=\"\">256 bytes is sufficient for legitimate cryptographic uses (such as large number arithmetic). More importantly, with modern compression techniques, 300-400 bytes can represent an image. The proposer believes that images are the most harmful data storage use case, with high demand, leading to high costs, UTXO set expansion, and potentially controversial content. Limiting to 256 bytes can prevent the embedding of large, continuous blocks of data. </span></p><p style=\"text-align: left;\"><span leaf=\"\">(4) Why disable OP_IF/OP_NOTIF? </span></p><p style=\"text-align: left;\"><span leaf=\"\">In the Taproot design, conditions should be evaluated off-chain, with the final execution path only revealed on-chain. Ideally, key path spending should be used to avoid publishing any scripts. OP_IF is not only redundant in Tapscript, but is also often abused to inject \"skipped during execution\" junk data. While it cannot completely prevent steganography, banning OP_IF almost eliminates a common abuse route for free. (5) Why a temporary soft fork? This is one of the most controversial and ingenious designs in the proposal. The temporary (one year) nature serves several purposes: - Reduce censorship risk: Reassure the community that this is merely an intervention for a specific crisis, rather than a permanent change in the direction of development, thereby reducing resistance to acceptance. - Avoid hindering future upgrades: Some restrictions (such as Taproot tree depth) may be too stringent, but developing a more robust solution takes time. The temporary deployment buys developers a year to design more refined long-term rules. - Provide a market adaptation period: Any potentially affected projects (such as Miniscript, BitVM) can use this year to adjust or migrate. IV. Trade-offs and Risks: The Proposal's Achilles' Heel The authors of BIP-110 are surprisingly candid in the \"Trade-offs\" section, acknowledging the following potential problems with the proposal: (1) Taproot Control Block Limitation and Smart Contracts Limiting the Taproot control block to 257 bytes (maximum 128 script leaves) could affect advanced smart contracts such as BitVM that rely on large amounts of executable scripts. The proposal acknowledges this as an \"unfortunate trade-off\" but believes these use cases are still in the early stages of development and can continue to be experimented with on testnets or sidechains over the next year. (2) OP_IF/OP_NOTIF Restrictions and Existing Wallets Some wallet software (such as Miniscript) habitually creates Tapleafs containing OP_IF. The proposal mitigates the risk of fund freezing through \"exemption from UTXO created before activation\" and \"two-week grace period,\" but cannot completely rule out the theoretical possibility. (3) The “Perfect Storm” of Fund Freezing The proposal details the extreme conditions under which funds may be frozen or lost: all conditions must be met simultaneously—P2TR UTXO, pre-signed transaction, confirmation and spending within a one-year deployment period, selected Tapleaf containing OP_IF or depth &gt; 7, key path unavailable and no other suitable Tapleaf (frozen), or other Tapleaf spent in an unexpected manner (lost). (4) The “Disruption” of Developer Space The proposal frankly admits: “Yes, this proposal is intended to disrupt user space, specifically data storage user space.” This candor may exacerbate the concerns of opponents—if user space can be disrupted today for “anti-spam” purposes, will more use cases be disrupted tomorrow under other pretexts? V. Deployment Mechanism: Radical Political Statement The deployment parameters of BIP-110 are themselves a radical political statement: A 55% hashrate threshold (instead of the usual 95%): If more than 55% of miners' hashrate supports the move within a 2016-block cycle, BIP-110 will automatically launch after two weeks. The authors argue that only permanent consensus changes require 95% hashrate, and this temporary soft fork is urgent, making a lower threshold more ideal. This contrasts sharply with the traditional requirement of \"broad consensus\" (such as the 95% threshold for Segwit and Taproot). Opponents argue that this violates the spirit of \"rough consensus,\" which seeks broad acceptance. **Note from ChainTeach:** The concept of \"rough consensus\" was first proposed by the IETF, and its famous principle is: \"We reject kings, presidents, and voting. We believe in rough consensus and running code.\" Traditional understanding of \"rough consensus\" includes the following key characteristics: 1. Non-voting system – not relying on majority vote, avoiding \"tyranny of the majority\"; 2. Technology-driven – viewpoints prevail based on technical rationality and security, rather than numbers or influence; 3. Dissent is permissible – opposing opinions are allowed as long as they do not affect the overall ability to act; 4. Code is vote – final consensus is reflected in the actual code executed by nodes; 5. Long-term evolution – consensus formation takes time, not short-term decisions. - Forced signaling period: During a difficulty adjustment period before block height 965664 (approximately September 2026) is locked, miners are forced to signal support; if no explicit support signal is received from miners after this period, BIP-110 is unconditionally launched via UASF (User Activated Soft Fork), treating blocks carrying invalid data as invalid. This further reduces the space for opponents. Note: BIP-110 uses a modified version of the BIP9 signaling mechanism. Specific parameters are as follows: name: reduced_data bit: 4 starttime: 1764547200 (~December 1, 2025) timeout: NO_TIMEOUT min_activation_height: 0 max_activation_height: 965664 (~September 1, 2026)</span></p><p style=\"text-align: left;\"><span leaf=\"\">active_duration: 52416 blocks (~1 year after activation)</span></p><p style=\"text-align: left;\"><span leaf=\"\">threshold: 1109/2016 (55%)</span></p><p style=\"text-align: left;\"><span leaf=\"\">- One-year validity period: After activation, the rule is only effective for approximately one year (52416 blocks), after which it automatically expires. </span></p><p style=\"text-align: left;\"><span leaf=\"\">This deployment mechanism conveys a clear message: the proposer believes the situation is so urgent that it is necessary to bypass the traditional high-threshold consensus process.</span></p><p style=\"text-align: left;\"><span leaf=\"\"> As Renaud Cuny said, “After the inscription consumed 37% of the block space and no one took action for three years, the mechanism no longer requested permission.”[2] Opponents may argue that this sets a dangerous precedent—any group with 55% of the computing power could force temporary consensus changes in the future. </span></p><p style=\"text-align:center\"><img alt=\"NYS6szbLKenZWynqEDPcMM1vBELTTFJaA29wzV4e.png\" src=\"https://img.jinse.com.cn/7435816_image3.png\" title=\"7435816\"/></p><h2 style=\"text-align: left;\"><span leaf=\"\"><span text=\"\">VI. Community Controversy:</span></span>Monetary Purism vs. Protocol Minimalism</h2><p style=\"text-align: left;\"><span leaf=\"\">BIP-110 touches on the deepest ideological differences in the Bitcoin community:</span></p><p style=\"text-align: left;\"><span leaf=\"\">Main arguments of the supporters:</span></p><p style=\"text-align: left;\"><span leaf=\"\">1. Monetary Purism: The sole purpose of Bitcoin is to become a sound money.</span></p> Any non-payment use case is a waste of block space and should be resisted. 2. Node Decentralization First: Controlling the size of the UTXO set and block data expansion is a necessary measure to maintain node decentralization. 3. Incentive Distortion Needs Correction: The incentive mismatch where miners reap rewards while nodes bear costs must be corrected through consensus layer intervention. 4. Precedent and Signal: This proposal sends a clear signal to the market—data storage is undesirable, and development resources should focus on monetary functions. Key points of the opposition: 1. Protocol minimization: The consensus layer should be as simple as possible, enforcing only the minimum rules needed to prevent double-spending. Content filtering should remain at the policy or application layer. 2. The boundaries of \"adversarial\" approaches: Bitcoin is meant to \"defend against censorship,\" not \"defend against specific use cases.\" Actively excluding certain applications through consensus rules violates the principle of \"permissionless.\" 3. The slippery slope effect: Today we can restrict data for \"anti-spam,\" tomorrow can we restrict transaction amounts for \"anti-financial crime\"? The day after tomorrow, can we restrict scripts for \"anti-immoral content\"? 4. Technical Feasibility Questionable: Can the 256-byte limit truly prevent data storage? Circumvention methods such as fragmented storage and steganography still exist. Will disabling OP_IF affect the legitimate construction of complex scripts? 5. Controversy Regarding Program Legality: Does the 55% threshold and mandatory signaling period constitute a \"coup\" against existing governance processes? Will it be abused in the future? Interestingly, the opponents in this controversy are mostly influential opinion leaders with a larger voice, while the supporters lack figures of comparable stature. For example, OGs (old guards) who have explicitly expressed their opposition to BIP-110 include: - Adam Back, CEO of Blockstream and inventor of hashcash: People spent too much time in Q4 2025 educating others about the architectural limitations of filters. In short, \"it's stupid.\" We can't keep wasting endless time and attention on these bottomless pits. - Casey Rodarmor, inventor of the Ordinal inscription protocol: This is a technically flawed and confiscating proposal that removes important functionality and doesn't even achieve its stated goals. - Wang Chun, co-founder of F2Pool: BIP-110 is not just about limiting the size of OP_RETURN; it's an attempt to package a bunch of nonsense in the name of protecting children and then impose it on us as a whole, like a government censoring social media. - Jameson Lopp, co-founder of Casa, wrote a lengthy critique of BIP-110: BIP-110 is a high-risk and counterproductive governance adventure disguised as \"anti-spam.\" Its low 55% miner threshold and mandatory signaling period greatly increase the risk of chain splits; its forfeit rule changes could freeze existing funds that rely on Taproot functionality; it damages Bitcoin's neutral reputation against censorship without actually preventing data embedding (Peter Todd has demonstrated that the full proposal text can be embedded in compliant transactions); it restricts future innovations like BitVM, and the \"temporary\" rhetoric is misleading (supporters' real intention is permanent, extreme restrictions). From an economic perspective, miners lack incentives (zero signal rate, reduced transaction fee revenue), node signals lack economic weight (making them susceptible to manipulation by Sybil attacks), and prediction markets show a 98% failure rate. Ultimately, this is merely a culture war waged by a small group of moralistic purists, attempting to forcefully resolve issues that should be handled by the market and strategy layers. It's clear that the opposition represents the elite class within the entire Bitcoin ecosystem. Blockstream is a major supporter of Bitcoin Core, and it's perfectly logical for them to champion the removal of the default data embedding size limit for OP_RETURN in Core V30. Ordinal is a pioneering representative of the so-called \"Bitcoin (application) ecosystem.\" F2Pool is a well-known mining pool and a advocate for miners' interests. Finally, Jameson Lopp is a representative figure of independent developers and Bitcoin applications. Compared to the constellation of prominent opponents, voices explicitly supporting BIP-110 are relatively scarce in search results. This could be due to several reasons: - Supporters are mostly anonymous or technically savvy: the proposal's author, Dathon Ohm, is an anonymous developer, and while Luke Dashjr, a key promoter, has extensive experience in Bitcoin Knots clients, he is not a high-profile figure on social media. - Supporters may prefer to \"vote with code\": search results indicate that the proportion of Bitcoin Knots nodes supporting BIP-110 is rising—as of February 23, 2026, approximately 7.99% of Bitcoin nodes (1995/24981) have indicated their readiness to support BIP-110. Compared to 2.98% a month ago, support has increased by about 5% in one month. - Silent support from ordinary users in the community: Many long-term Bitcoin holders who have reservations about the inscription ecosystem may emotionally agree with BIP-110's \"monetary purism\" goals, but are simply unwilling to publicly engage in the debate. <h2 style=\"text-align: left;\"><span leaf=\"\"><span text=\"\">VII. Prelude to History:</span></span>Similar Situations for Satoshi Nakamoto</h2><p style=\"text-align: left;\"><span leaf=\"\">TeachChain found three cases related to on-chain data filtering and restrictions that Satoshi Nakamoto participated in discussions about in the early days of Bitcoin:</span></p><p style=\"text-align: left;\"><span leaf=\"\">(1) Before disappearing, Satoshi Nakamoto removed 15 opcodes, completely disabled them, and added a hard limit (520 bytes) to the size of data that could be manipulated on the script engine stack. He did this because, frankly, he messed up—leaving a large number of vulnerabilities that could allow complex scripts to be used to launch denial-of-service attacks against the entire network, create huge and costly transactions to verify, and cause node crashes.</span></p><p style=\"text-align: left;\"><span leaf=\"\"> (2) On December 8, 2010, Satoshi Nakamoto released Bitcoin Core version 0.3.18, which included a check called IsStandard() to determine whether transactions conform to standards (submitted by Gavin Andresen), which was met with much skepticism and opposition from the community. For example: Netizen theymos commented: This is meaningless. Why should miners adopt this change? It means they will receive fewer transaction fees because they lose non-standard transactions. He also pointed out that miners have clearly opposed it: ArtForz (which owns more than 15% of the network's computing power), tcatm (2 Ghash/s), and doublec (the mining pool maintainer) have stated that they will not use IsStandard. Therefore, non-standard transactions will still be possible. He also gave a threatening preview of his actions: \"When I have time, I will make a patch for Bitcoin to remove all non-network-enforced transaction restrictions so that other miners can easily configure themselves to include these transactions.\" jgarzik vehemently stated, \"Please launch your own blockchain, not fork the network like this. I want you to understand how much damage your forced inclusion of non-monetary data is causing. I never said this would lead to a blockchain fork. This is more fundamental: a rules fork. A forked network means that most miners no longer run the mainstream Bitcoin transaction rules. Theymos seems to be drawing a line, trying to convince most miners to stop focusing on the mainstream Bitcoin transaction verification rules. He has the right to do so. Miners also have the right to verify what they want to verify. But this fork will make working on the network more difficult in the future, and in effect, it opens the door for the blockchain to be filled with all sorts of non-monetary data, as mentioned in other discussions.\" (3) In December 2010, Satoshi Nakamoto commented on BitDNS, a non-monetary application on the Bitcoin blockchain, as follows: \"I think BitDNS could be a completely independent network and an independent blockchain, sharing CPU computing power with Bitcoin. The only overlap would be allowing miners to simultaneously search for proof-of-work for both networks. These networks don't need any coordination. Miners would subscribe to both networks in parallel. They would scan the SHA, so if they found a valid solution, they could potentially solve both networks simultaneously. If one network has a lower difficulty, the solution might only be valid for one network. I think external miners could call getwork from both programs and merge the work. Perhaps first call Bitcoin to get the work, then hand it over to BitDNS's getwork to merge it into a joint work.\" This isn't fragmentation, but rather a sharing and amplification of the combined CPU power between networks. This solves a problem: if multiple networks exist, they can become mutually threatening when available CPU power is concentrated to attack one of them. Instead, all networks in the world will share combined CPU power, increasing overall strength. This will make it easier for smaller networks to launch by connecting to an existing miner base. Regarding incentives, he added: \"The incentive is that you can also earn rewards from additional sidechains for the same work. Why not get free domain names for the same work you're generating Bitcoin? If you're generating 50 BTC per week now, you can now get 50 BTC plus some domain names.\" You have a job. If you solve it, it will simultaneously solve a block for both Bitcoin and BitDNS. Conceptually, they are connected by a Merkle tree. To commit to Bitcoin, you break the branch of BitDNS; to commit to BitDNS, you break the branch of Bitcoin. In practice, to modify Bitcoin, BitDNS might require about 200 extra bytes, but that's not a big deal. You've been talking about 50 domain names per block; compared to that, spending an extra 200 bytes per block for backward compatibility is negligible. If we really care about saving a few bytes, we could perhaps schedule a block in the distant future where Bitcoin will be upgraded to a more modern architecture with the Merkle tree at the top. Please note that both chains are under this new Merkle tree. This means that Bitcoin and BitDNS each have their own in-chain links within their respective blocks. This is the opposite of the common timestamp server architecture—that architecture places the chain at the top layer, followed by the Merkle tree, because that would create a common parent chain. Here, there are two timestamp servers that do not share the same chain. Clearly, Satoshi Nakamoto's idea was that non-monetary applications like BitDNS should ideally have their own independent chain and not share timestamp services with the Bitcoin main chain (i.e., a PoW chain). This certainly does not mean encouraging BitDNS to embed data into the Bitcoin main chain. VII. Thought Experiment: What would Satoshi Nakamoto think if he were still alive? Based on our understanding of Satoshi Nakamoto's historical statements, he might raise four questions about Bitcoin's non-monetary application ecosystem: (1) Did miners receive additional incentives? Yes (transaction fees), but these were \"stolen\" from the main chain payment market, not from rewards from external chains. When discussing BitDNS in 2010, Satoshi Nakamoto envisioned a model of \"one computing power, multiple rewards, data separation\"—miners received both Bitcoin rewards and BitDNS domain name rewards, while the data was stored on a side chain. Inscription's \"data embedded in the main chain\" model deviates from this vision. (2) Did the data change the core structure of Bitcoin? No (using existing witness fields), but it takes up space that would otherwise be used for payments. This touches on Satoshi Nakamoto's concerns in 2010 when he restricted non-standard transactions: keeping the blockchain focused on transaction records. (3) Is the data valuable? The market's willingness to pay fees indicates that it is valuable to some. But the question is: do payers bear all the social costs? Obviously not—nodes bear the cost of permanent storage. This is a new problem that Satoshi Nakamoto probably didn't have to consider in 2010. (4) Are there negative externalities that the market cannot regulate? Yes, node costs are borne by non-payers. When negative externalities reach a certain scale, is consensus layer intervention necessary? Based on Satoshi Nakamoto's actions back then, it is conceivable that if Satoshi Nakamoto were still alive, he would not have appeased these problems for a long time without taking any action. </span></p><h2 style=\"text-align: left;\"><span leaf=\"\"><span text=\"\">VIII. Reflections and Prospects:</span></span>An Experiment Destined to Be Recorded in History</h2><p style=\"text-align: left;\"><span leaf=\"\">BIP-110 was eventually merged into the official BIP library, which means that it gained a certain degree of \"discussion qualification\", but it was far from achieving activation consensus. Its significance may lie more in triggering a profound reflection on the essence of Bitcoin:</span></p><p style=\"text-align: left;\"><span leaf=\"\">(1) Technological Implications</span></p><p style=\"text-align: left;\"><span leaf=\"\">BIP-110 revealed a long-neglected problem: the potential divergence between miner incentives and node incentives.</span></p><p style=\"text-align: left;\"><span leaf=\"\">BIP-110 revealed a long-neglected problem: the potential divergence between miner incentives and node incentives.</span></p><p style=\"text-align: left;\"><span leaf=\"\"> Even without considering data storage, this discrepancy exists in ordinary payments—miners collect fees, and nodes store data permanently. It's just that data storage use cases amplify it to a degree that cannot be ignored. More sophisticated mechanisms may be needed in the future to fundamentally address this incentive mismatch. This leads us to further consider that if the Bitcoin blockchain is allowed to expand unchecked, it will significantly raise the barrier to entry for running an unincentivized full node, or user full node, thereby greatly reducing the number of user full nodes. The lack of constraints on user full node verification and block rejection will allow miners to further expand their influence and decision-making power derived from their block-producing rights, thus allowing mining interest groups to seize greater power and pushing Bitcoin towards an oligopoly, ultimately significantly weakening its decentralization. The situation will be exacerbated, especially when a group of maintainers adopts a policy of appeasement and non-resistance towards mining groups exists. Developers and miners, who are in the imagined system of checks and balances, will in fact tend to collude. (2) Impact on governance The proposal of the 55% threshold and mandatory signaling period may become a \"template\" or \"counterexample\" for future controversial changes. It forces the community to think: when faced with an \"imminent threat\", can and should the decision-making process be adjusted? Who has the right to define \"urgency\"? There are no simple answers to these questions. After studying the chain, we tend to regard BIP-110 as a \"riot\" launched by the people after the community failed to stop Bitcoin Core maintainers from constantly compromising on the data embedding of non-monetary use cases through off-chain discussions. So, unsurprisingly, this uprising was met with unanimous and strong opposition from vested interests, those in power, and the elite class. In a sense, the more the elites opposed it, the more it proved the grassroots and populist nature of BIP-110. (3) The Divergence of the Bitcoin Ecosystem Regardless of whether BIP-110 is ultimately activated, it has already exacerbated the divergence of the Bitcoin ecosystem. Some developers and users may turn to more \"open\" protocols (such as other UTXO chains or Layer 2 solutions), while others may more firmly support \"monetary purism.\" The debate between Bitcoin as \"digital gold\" and \"smart contract platform\" may intensify. Previously, numerous diverse ideas born from the Bitcoin community, unable to be accommodated by Bitcoin, left and incubated into numerous altcoin blockchains. This included Ethereum, the progenitor of smart contract blockchains. Now, so-called Bitcoin ecosystem applications like BRC-20, as their names suggest, are nothing more than clumsy imitations of Ethereum and its ecosystem (such as ERC-20). This prompts us to ponder: if Bitcoin begins to imitate Ethereum, if Bitcoin loses its long-held pride in its thought leadership, can it still attract the world's top developers to contribute unpaid? After all, the Ethereum Foundation and many other projects pay salaries. (4) Long-term impact on ecosystem applications such as inscriptions Even if BIP-110 is not activated, the opposition it represents will affect market expectations. Ecosystem projects such as inscriptions and BRC-20 that rely on large-block data embedding may need to consider migrating to more suitable infrastructure (such as the Lightning Network, RGB, Taproot Assets, etc., which are true Layer 2), or adjusting their technical solutions to adapt to possible future limitations. When inscription NFTs first appeared in early 2024, ChainChain once praised Casey Rodarmor's idea of ​​integrating rather than separating metadata and media data. This is because a major hidden danger of the Ethereum ERC-721 NFT standard is that metadata is on-chain, while media data such as images are off-chain, which is heavily dependent on centralized infrastructure. This has created a rift in the \"ownership\" that the NFT industry has always claimed, and even, to put it more seriously, has made it a joke due to the nature of centralized control. The Inscription concept repairs this. This is what ChainCall praises. However, as the discussion deepens, we can further realize that the most suitable carrier for maintaining the integration of Inscription might be an independent sidechain, rather than embedding it into or parasitizing the Bitcoin chain through special means. Following Satoshi Nakamoto's idea, this independent sidechain could allow Bitcoin miners to contribute blocks to it through joint mining, so that miners could simultaneously enjoy incentives from both the Bitcoin chain and the Inscription chain, while the Inscription data would not pollute the Bitcoin chain. (5) The final evaluation rests with time. The authors of BIP-110 designed the proposal as temporary, perhaps hoping that time would test its rationality. A year later, if data storage really \"poisons\" the network, leading to a sharp decrease in the number of nodes or high fees, BIP-110 may be regarded as a \"prophet who saved Bitcoin\". Conversely, if Bitcoin still functions well without BIP-110, and the inscription ecosystem brings unexpected innovation and adoption, then BIP-110 may be remembered as an \"overreaction panic\". ChainChain believes that regardless of whether BIP-110 will ultimately win, it will inevitably have a natural sense of justice, progressiveness and revolutionary nature in the historical process because of its bottom-up intention to break the existing power structure and interest structure. The historical cycle is inescapable. Any system capable of transcending cycles must be able to internally disrupt power structures and interest groups. Only when power and wealth are perpetual can a system be perpetual. The newly rich OGs must be constantly overthrown by the impoverished grassroots for civilization to continuously renew and continue. Otherwise, the system and civilization will only succumb to corruption and extinction under the constant drain of social stratification. This is the philosophical essence of \"popular uprisings, rebellion is justified.\" Regardless of the outcome, BIP-110 has added a significant chapter to the history of Bitcoin. It reminds us that Bitcoin is not just code, but a social experiment shaped by countless participants. In the clash between technology and ideology, the ultimate victor will be the wisdom that can balance innovation and stability, freedom and responsibility.</span></p></div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/b9a687f42eff613aa02632f154005520.jpg",
            "link": "https://www.coinlive.com/news/detailed-teardown-of-bip-110-10-000-word-article",
            "pub_date": "2026-02-26 20:11:13",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 250267,
            "title": "The US has seized over $30 billion in cryptocurrency assets, with the Chen Zhi case accounting for 50%.",
            "description": "<div class=\"share___SVvtl\"><div>Currently, virtual currencies have already exerted a structural influence on the international financial and monetary systems. However, due to their technological characteristics and regulatory gaps, they have also become a major target for cybercrime and a new arena for financial competition. A report jointly released on February 26, 2026, by the China National Computer Virus Emergency Response Center and other departments, titled \"Ready Player One: An In-Depth Analysis of the Global Virtual Currency Asset Harvesting Operation Under US Technological Hegemony\" (hereinafter referred to as the \"Report\"), shows that, according to incomplete statistics, from 2022 to 2025, the United States has confiscated over $30 billion worth of global virtual currency assets through various cases. \"In the digital age, virtual assets have become an indispensable financial asset, and also an object of strong regulation and competition among major powers,\" said a financial researcher. Domestically, virtual currencies do not have the same legal status as legal tender. On February 6, 2026, the People's Bank of China and eight other departments issued the \"Notice on Further Preventing and Handling Risks Related to Virtual Currencies\" (hereinafter referred to as the \"Notice\"), which states that virtual currency-related business activities are illegal financial activities. \"Currently, countries such as Singapore and the United States have recognized the legality of virtual currencies. Investors who have trade relations with countries that have legalized virtual currencies, or who legally hold foreign exchange, can invest in these countries through legal means. However, it should be noted that even if investment is legal in these countries, the realization and trading of virtual currencies within China are still illegal,\" Tang Chunlin, a senior lawyer in the financial field, told Caixin. \"Therefore, it is clear that if domestic investors invest in virtual currencies and derivatives and violate laws or public order and good morals, the relevant civil legal acts are invalid, and the resulting losses must be borne by the investors themselves,\" Yang Xiang, a PhD in Law from Tsinghua University and a lawyer at Beijing Hongfan Law Firm, told Caixin. He added that if investors have overseas businesses, they must examine whether the platform possesses compliance licenses in mainstream legal jurisdictions before participating in virtual currencies. In Yang Xiang's view, the biggest legal risk in virtual currencies is not \"holding\" them, but rather violating money laundering (offshore) or concealing/disguising the proceeds of crime (domestic) during the \"deposit and withdrawal\" process. Therefore, it is essential to retain original legal source proof for every transaction (such as salary, dividends, or property sales certificates). Under the penetrating supervision of 2026, only assets with a complete chain of evidence are considered \"real assets.\" The report shows that, according to incomplete statistics, from 2022 to 2025, the United States has confiscated over $30 billion worth of virtual currency assets globally through various cases. The Chen Zhi case alone accounted for $15 billion in confiscated assets, representing 50% of the total. The report states, “The United States’ use of technological hegemony to seize global virtual assets is essentially aimed at maintaining its economic hegemony and the status of the US dollar. On the one hand, it directly plunders global wealth through confiscation and fines to supplement its domestic economic strength; on the other hand, by controlling the regulatory rules and transaction flows of virtual assets, it integrates the digital financial system into the dollar-dominated global financial framework, curbing other countries’ attempts to bypass the dollar through virtual currency assets for settlement.” Four months ago, in October 2025, the U.S. Attorney's Office for the Eastern District of New York announced criminal charges against Chen Zhi, founder of the Prince Group in Cambodia, on charges including wire fraud and money laundering. Simultaneously, it announced the confiscation of approximately 127,000 Bitcoins under his control, valued at approximately $15 billion at the time, setting a record for the largest virtual asset confiscation in U.S. judicial history. In November 2025, the National Computer Virus Emergency Response Center pointed out that a U.S. national-level hacking group had precisely cracked the underlying encryption vulnerability, attacking the LuBian mining pool (belonging to the Prince Group) cold wallet and transferring assets, demonstrating the U.S.'s mature national-level virtual currency asset theft capabilities. This clearly contradicts the U.S. government's claim that \"Bitcoin has never been hacked,\" or its true meaning may be that \"Bitcoin has never been hacked by hackers outside the U.S. government.\" In another case, from 2023 to 2025, the United States pursued both civil and criminal charges against Binance, a renowned international cryptocurrency exchange, and its founder, Changpeng Zhao. The case ultimately ended with Binance paying a $4.35 billion fine (including $2.7 billion in forfeiture of illegal gains, $1.35 billion in civil penalties, and $150 million in personal fines), and Changpeng Zhao signing a plea agreement and being pardoned. The report states that during the investigation, the United States employed comprehensive technical monitoring methods to achieve complete penetration and evidence collection of Binance's operational, user, and transaction data, demonstrating its technological advantages in the field of digital asset platform monitoring. For example, regarding cross-border data theft and internal information acquisition, the United States used hacking techniques to penetrate Binance's internal servers, obtaining core operational data and executive communication records, proving that Binance executives were aware of US regulatory rules but deliberately circumvented compliance requirements. Regarding full-scale monitoring and analysis of transaction data, the report shows that by accessing global blockchain nodes and collaborating with on-chain data analysis companies, the United States has achieved real-time monitoring of Binance's transaction data, accurately locating the trading behavior of US users and the flow of funds to sanctioned regions. Data shows that while US users once accounted for nearly 20% of Binance's user base, only 30%-40% of users completed real-name authentication, which the US used as core evidence of violations. Furthermore, the US technical team conducted penetration tests on Binance's real-name authentication system and anti-money laundering monitoring system, discovering systemic flaws in its compliance mechanisms. Virtual assets are a new type of wealth carrier in the digital age, experiencing rapid development in recent years. According to statistics from CoinGecko (a well-known cryptocurrency tracking and research institution), as of the end of January 2026, the total market capitalization of global virtual currency assets was approximately US$2.73 trillion, of which Bitcoin's total market capitalization reached approximately US$1.57 trillion. Meanwhile, the value of gold reserves held by central banks around the world was approximately $5.83 trillion. This means that the market capitalization of virtual currency assets has reached about 47% of the total market capitalization of global official gold reserves, approaching half, making it a new type of financial asset that cannot be ignored. How can investors hedge against risks? Since 2021, speculative activities related to virtual currencies and RWA (Real-World Asset) tokenization have occurred frequently. These activities have been identified by Chinese financial regulators as significant acts disrupting economic and financial order. On February 6, 2026, the People's Bank of China and other departments clarified the essential nature of virtual currencies, the tokenization of real-world assets, and related business activities: All virtual currency-related business activities conducted within China, including the exchange of legal tender for virtual currencies, the exchange of virtual currencies among themselves, acting as a central counterparty in buying and selling virtual currencies, providing information intermediary and pricing services for virtual currency transactions, token issuance financing, and trading of virtual currency-related financial products, as well as illegal financial activities such as the illegal issuance of token vouchers, unauthorized public issuance of securities, illegal operation of securities and futures businesses, and illegal fundraising, are strictly prohibited and will be resolutely banned according to law. \"Conducting real-world asset tokenization activities within China, as well as providing related intermediary and information technology services, which are suspected of involving illegal issuance of tokenized securities, unauthorized public offerings of securities, illegal operation of securities and futures businesses, illegal fundraising, and other illegal financial activities, should be prohibited; except for related business activities conducted based on specific financial infrastructure with the approval of the competent business authorities in accordance with laws and regulations. Foreign entities and individuals are prohibited from illegally providing real-world asset tokenization-related services to domestic entities in any form,\" the aforementioned \"Notice\" also stated. However, the \"Notice\" also opened the floodgates for RWA tokenization activities: Domestic entities directly or indirectly engaging in real-world asset tokenization in the form of foreign debt overseas, or conducting asset securitization or equity-based real-world asset tokenization overseas based on domestic asset ownership, income rights, etc. (hereinafter collectively referred to as domestic equity), should be strictly regulated by the National Development and Reform Commission, the China Securities Regulatory Commission, the State Administration of Foreign Exchange, and other relevant departments according to their respective responsibilities, following the principle of \"same business, same risk, same rules.\" Tang Chunlin reminded that virtual currencies do not have the attributes of legal currency in China, nor are they legal financial investment tools. Furthermore, there is currently no indication that China will loosen regulations in this area or gradually recognize the legality of virtual currencies. Therefore, all virtual currency investment activities conducted within China are illegal investment activities, and investors should be highly vigilant. According to Yang Xiang, many projects claiming to tokenize RWA assets such as real estate and gold are often classified as illegal securities issuance or illegal fundraising in China. Investors participating in such projects are highly susceptible to falling into Ponzi schemes, and the authenticity of the assets is difficult to trace. \"Investors with overseas business or compliant overseas status who want to participate in virtual currencies must conduct thorough compliance due diligence. When it comes to cross-border operations or overseas asset allocation, they must examine whether the platform possesses compliant licenses in mainstream jurisdictions, such as a Virtual Asset Service Provider license in Hong Kong or an MPI license (a high-level payment institution license issued by the Monetary Authority of Singapore) in Singapore. At the same time, they should avoid participating in stablecoin transactions pegged to the RMB, which is currently a no-go zone for domestic regulation,\" Yang Xiang stated.</div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/bc4cb9e8836a5375e53b4461f29abfe7.jpg",
            "link": "https://www.coinlive.com/news/the-us-has-seized-over-30-billion-in-cryptocurrency-assets",
            "pub_date": "2026-02-26 19:33:45",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 250265,
            "title": "Token goes global: Selling Chinese electricity to the world",
            "description": "<div class=\"share___SVvtl\"><div><p style=\"text-align: left;\"><span leaf=\"\"><span text=\"\">Author:</span></span><span leaf=\"\"><span text=\"\">Black Lobster｜Deep Tide TechFlow</span></span></p><p style=\"text-align: left;\"><span leaf=\"\">In the summer of 1858, a copper-core cable traversed the Atlantic Ocean, connecting London and New York.</span></p><p style=\"text-align: left;\"><span leaf=\"\">The significance of this event was never about the transmission speed, but about the power structure. Whoever laid the undersea cable could profit from the flow of information. The British Empire, relying on this global telegraph network, held the intelligence of its colonies, cotton prices, and war news in its hands.</span></p><p style=\"text-align: left;\"><span leaf=\"\">The empire's strength lay not only in its fleet, but also in that cable.</span></p><p style=\"text-align: left;\"><span leaf=\"\"> More than 160 years later, this logic is repeating itself in an unexpected way. In 2026, large-scale Chinese models are quietly devouring the global developer market. Latest data from OpenRouter shows that Chinese models account for 61% of the token consumption of the platform's top ten models, with the top three all originating from China. API requests sent daily by developers in San Francisco, Berlin, and Singapore are traveling across the Pacific Ocean via undersea cables to data centers in China, where computing power is consumed, electricity flows, and results are transmitted back. Electricity never leaves the Chinese power grid, but its value is delivered across borders through tokens. On February 24, 2026, OpenRouter released weekly data: the total token consumption of the platform's top ten models was approximately 8.7 trillion, with Chinese models accounting for 5.3 trillion, or 61%. MiniMax M2.5 debuted at the top with 2.45 trillion tokens, followed by Kimi K2.5 and Zhipu GLM-5. The top three were all from China. This was no accident; a single spark ignited everything. At the beginning of this year, OpenClaw emerged, an open-source tool that truly enabled AI to \"do work,\" capable of directly controlling computers, executing commands, and completing complex workflows in parallel. Within weeks, its GitHub stars surpassed 210,000. John, a finance professional, immediately installed OpenClaw and integrated it with the Anthropic API. He began automatically monitoring stock market information and providing timely trading signals. A few hours later, he stared at his account balance for a few seconds, stunned: tens of dollars gone. This is the new reality brought about by OpenClaw. In the past, chatting with AI involved thousands of tokens per conversation, with negligible costs. After integrating OpenClaw, the AI ​​runs a dozen subtasks simultaneously in the background, repeatedly calling the context and iterating in loops. Token consumption is not linear, but exponential. The bills are like a car with its hood open accelerating, the fuel gauge dropping, and it just won't stop. A clever trick quickly circulated within the developer community: using OAuth tokens to directly connect Anthropic or Google subscription accounts to OpenClaw, turning the monthly \"unlimited\" credits into free fuel for the AI ​​Agent. This was a method adopted by many developers. Official countermeasures followed. On February 19th, Anthropic updated its agreement, explicitly prohibiting the use of Claude subscription credentials for third-party tools like OpenClaw. Access to Claude functionality required using the API billing channel. Google went even further, extensively blocking subscription accounts that accessed Antigravity and Gemini AI Ultra through OpenClaw. \"The world has suffered under Qin rule for too long,\" John immediately embraced domestically developed large-scale models. On OpenRouter, the domestically developed MiniMax M2.5 model scored 80.2% on software engineering tasks, while Claude Opus 4.6 scored 80.8%, a negligible difference. However, the prices were vastly different: the former cost $0.3 per million tokens of input, while the latter cost $5, a difference of approximately 17 times. John switched over, the workflow continued, and the bill shrank by an order of magnitude; this migration is happening simultaneously worldwide. OpenRouter's COO, Chris Clark, put it bluntly: The reason Chinese open-source models have captured a large market share is because they account for an exceptionally high percentage of proxy workflows run by US developers. To understand the essence of token globalization, one must first understand the cost structure of a token. It seems lightweight; one token is roughly equivalent to 0.75 English words, and a typical conversation with AI consumes only a few thousand tokens. But when these tokens are stacked in trillions, the underlying physical reality becomes incredibly heavy. Breaking down the cost of tokens, there are only two core components: computing power and electricity. Computing power is the depreciation and amortization of GPUs. If you buy an Nvidia H100 for about $30,000, its lifespan, calculated over each inference iteration, is the depreciation cost. Electricity is the fuel that keeps data centers running. A GPU at full load consumes about 700 watts of power. Adding the cost of the cooling system, the electricity bill for a large AI data center can easily exceed hundreds of millions of dollars annually. Now, let's map this physical process. An American developer in San Francisco makes an API request. Data travels from California, via a Pacific undersea fiber optic cable, to a data center in China. The GPU clusters begin operating, electricity flows from China's power grid to the chips, inference is completed, and the results are sent back. The entire process may only take a second or two. Electricity never leaves China's power grid, but its value is delivered across borders through tokens. Herein lies a magical aspect unattainable by ordinary trade: tokens have no physical form, do not pass through customs, are not subject to tariffs, and are not even included in any current trade statistics. China exports a large amount of computing power and electricity services, but this is almost invisible in official commodity trade data. Tokens become a derivative of electricity; the export of tokens is essentially the export of electricity. This is also thanks to China's relatively low electricity prices, which are about 40% lower than those in the United States. This is a physical cost difference that competitors can easily replicate. Furthermore, China's large-scale AI models also have algorithmic and \"involution\" advantages. DeepSeek V3's MoE architecture allows only a subset of parameters to be activated during inference. Independent tests show that its inference cost is about 36 times lower than GPT-4o, and MiniMax M2.5 also has 229 bytes of total parameters but only activates 10 bytes. The top layer is involution, with over a dozen companies like Alibaba, ByteDance, Baidu, Tencent, Lunar Dark Side, Zhipu, and MiniMax trampling each other on the same track. Prices have long since fallen below reasonable profit margins, and operating at a loss to gain market share has become the norm. Looking closer, this is similar to the \"Made in China\" export strategy, leveraging supply chain advantages and industry involution to drive down token prices. From Bitcoin to Tokens Before tokens, there was another instance of electricity export. Around 2015, power plant managers in Sichuan, Yunnan, and Xinjiang began receiving a group of strange visitors. These people rented abandoned factories, filled them with densely packed machines, and ran them 24/7. The machines produced nothing; they simply kept solving a mathematical problem, and occasionally, from this endless mathematical problem, they would calculate a Bitcoin. This was the first generation of electricity going global: cheap hydropower and wind power, through the hash calculations of mining machines, were converted into globally circulating digital assets, and then converted into US dollars on exchanges. Electricity didn't cross any borders, but the value of electricity, carried by Bitcoin, flowed to the global market. In those years, China's computing power once accounted for more than 70% of the global Bitcoin mining computing power. China's hydropower and coal-fired power, in this roundabout way, participated in a global redistribution of capital. In 2021, all of this came to an abrupt end. Regulatory hammer fell, miners scattered, and computing power migrated to Kazakhstan, Texas, and Canada. But the underlying logic never disappeared; it was just waiting for a new shell. Until ChatGPT emerged, large-scale models emerged, and former Bitcoin mining farms transformed into AI data centers, mining machines became computing GPUs, and the Bitcoins produced became tokens. The only thing that remained unchanged was electricity. Bitcoin's overseas expansion and token's overseas expansion are isomorphic in their underlying logic, but tokens currently have greater commercial value. Mining is purely mathematical computation; the resulting Bitcoin is a financial asset whose value comes from scarcity and market consensus, and has nothing to do with \"what was calculated.\" Computational power itself is not productive; it's more like a byproduct of a trust mechanism. Large-scale model inference is different. GPUs consume electricity but produce real cognitive services: code, analysis, translation, and creativity. The value of a token comes directly from its utility to the user. This is a deeper embedding; once a developer's workflow relies on a particular model, the cost of switching increases over time. Of course, there's another crucial difference: Bitcoin mining was driven out of China, while token globalization was actively chosen by global developers. The Token Wars The submarine cable laid in 1858 represented the British Empire's sovereignty over the information superhighway; whoever owns the infrastructure can define the rules of the game. Token going global is also an undeclared war, fraught with obstacles. Data sovereignty is the first barrier. An API request from an American developer is processed through a Chinese data center, physically passing through China. This isn't a problem for individual developers and small applications, but it's a major weakness in scenarios involving sensitive corporate data, financial information, and government compliance. This is why the Chinese model has the highest penetration rate in development tools and personal applications, but almost no presence in core enterprise systems. The chip ban is the second wall; China's AI development faces export controls on Nvidia's high-end GPUs. The MoE architecture and algorithm optimization can only partially offset this disadvantage; the ceiling remains. However, the current obstacles are just the prologue; a larger battlefield is taking shape. Tokens and AI models have become a new dimension of strategic competition between China and the US, no less significant than the semiconductor and internet competitions of the 20th century, and even closer to an older metaphor: a space race. In 1957, the Soviet Union launched Sputnik 1, shocking the United States and prompting the launch of the Apollo program, which poured resources equivalent to hundreds of billions of dollars today into the space race. The logic of the AI ​​race is strikingly similar, but the intensity will far surpass that of the space race. Space is, after all, a physical space, imperceptible to ordinary people; AI, however, permeates the capillaries of the economy. Behind every line of code, every contract, and every government decision-making system, there may be a large-scale model running for a particular country. Whoever's model becomes the default infrastructure option for global developers gains a structural influence on the global digital economy. This is precisely what makes Washington truly uneasy about the overseas expansion of Chinese tokens. When a developer's codebase, agent workflow, and product logic are all built around an API based on a certain Chinese model, the migration cost will increase exponentially over time. At that point, even if the US legislates restrictions, developers will resist with their feet, just as no programmer can abandon GitHub today. Today's token going global may only be the beginning of this long game. The Chinese model doesn't claim to be disrupting anything; it's simply delivering services to every developer worldwide with an API key at a lower price. This time, the cables are being laid by engineering teams writing code in Hangzhou, Beijing, and Shanghai, and GPU clusters operating day and night in a southern province. This battle for supremacy has no countdown; it takes place 24 hours a day, every day. The unit is tokens, and the battlefield is every developer's terminal.</span></p></div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/7b9e1ed11e1344932db2e66331966b35.jpg",
            "link": "https://www.coinlive.com/news/token-goes-global-selling-chinese-electricity-to-the-world",
            "pub_date": "2026-02-26 19:29:39",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        }
    ]
}