{
    "data": [
        {
            "id": 250512,
            "title": "What are the reasons behind Vitalik's dumping of nearly 20,000 ETH and the founder's market manipulation?",
            "description": "<div class=\"share___SVvtl\"><div><p style=\"text-align: left;\">Author: Sanqing, Foresight News</p><p style=\"text-align: left;\">In February 2026, the crypto market continued its downturn, with Ethereum experiencing its sixth consecutive month of decline, with a maximum monthly drop of nearly 30%. During this period, addresses associated with Ethereum co-founder Vitalik Buterin executed 532 sell orders. According to Etherscan data, the last sell order was completed at 19:40 on February 26th, with the address executing the sell order cumulatively selling approximately 19,326 ETH.</p> ... <p style=\"text-align:center\"><img src=\"https://img.jinse.com.cn/7436262_watermarknone.png\"/></p><p style=\"text-align: center;\"><em>Image source: Bitget Market Data</em></p><h2 style=\"text-align: left;\">Three \"transparencies\": Announcement, Purpose, and Execution Disclosure</h2><p style=\"text-align: left;\">Vitalik's plan for this fund transfer was announced in advance. On January 30, Vitalik published a long article through his X personal account, announcing that he would withdraw 16,384 ETH (worth approximately $44 million at the time) from his personal wallet and gradually monetize it.</p><p style=\"text-align: left;\"> </p><p style=\"text-align:center\"><img src=\"https://img.jinse.com.cn/7436263_watermarknone.png\"/></p><p style=\"text-align: left;\"><em>Image source: Vitalik's tweet</em></p><p style=\"text-align: left;\">He explained that this move was his personal response to the Ethereum Foundation (EF) entering a \"moderate austerity\" phase. EF plans to reduce its annual spending from 15% of treasury to 5% within 5 years, focusing more on core protocol development. </p><p style=\"text-align: left;\">Vitalik also detailed the use of the funds in the post. The funds from this sale will be used to fund open-source projects and public goods, with a focus on privacy technologies (ZK proofs, fully homomorphic encryption FHE, differential privacy), secure hardware, verifiable computing, encrypted communication, native-first software, open-source operating systems, biotechnology/public health tools, and governance coordination mechanisms.</p><p style=\"text-align: left;\"> These areas are mostly peripheral but crucial sectors after EF tightening, and Vitalik emphasized that this was his personal decision to share the responsibility for EF tightening. Furthermore, the entire sale process was fully traceable through on-chain tools. Vitalik used a single address (0xfEB016D0D14AC0Fa6d69199608B0776d007203B2) and executed the sale in small batches via a single protocol (CoW Swap) to minimize market impact. An \"unexpected\" event: the execution amount was slightly higher than initially announced. Despite high transparency, the execution result differed slightly from the initial announcement. The actual amount sold by Vitalik's address exceeded the previously announced 16,384 ETH, totaling approximately 19,326 ETH (exceeding the initial announcement by approximately 2,942 ETH). The sale began in the early morning of February 3rd, paused for about 10 days, and resumed on the 22nd, with the acceleration mainly occurring in the last two days. Specifically, approximately 4211.5 ETH were sold on February 5th, approximately 2283 on the 25th, and approximately 6297 on the 26th. Data source: Etherscan &amp; Bitget | Note: Data on the 26th is up to the time of the last sale. Vitalik has not yet provided further explanation regarding the fact that the announced total amount is only a rough target, or that undisclosed changes occurred during the execution process. Vitalik has stated, \"Since 2018, I have never sold ETH for personal wealth accumulation. All proceeds from sales have been donated, used to fund open-source projects, or for charitable causes.\" [Image source: Vitalik Farcaster] Furthermore, compared to some projects that quietly sell off their tokens, leading to subsequent collapses or trust crises, Vitalik's \"openly selling\" seems healthier. This ETH sale plan, at least superficially, continues the path of public disclosure and non-personal profit-seeking. However, objectively speaking, the founder's accelerated selling during a rebound after a continuous price decline may negatively impact community and investor confidence. Market sentiment was already fragile, and Vitalik's actions could amplify financiers (FUD) and even compound the overall bear market pressure, pushing ETH further down. In the short term, this could exacerbate selling by holders, impacting Ethereum's rebound trend and ecosystem stability.</p></div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/d483720885d82bdab3718f58cc6c3368.jpg",
            "link": "https://www.coinlive.com/news/what-are-the-reasons-behind-vitalik-s-dumping-of-nearly-20-000",
            "pub_date": "2026-02-27 18:04:43",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 250509,
            "title": "Nearly half of the workforce was laid off, yet the stock price rose by 23%.",
            "description": "<div class=\"share___SVvtl\"><div>On February 26, 2026, Block released its Q4 financial report, and its stock price surged by over 23% in after-hours trading. Its market capitalization increased by approximately $2.4 billion overnight. On the same day, 4,000 employees received termination notices. This contrast is the cruelest footnote to our times. A letter ignited Silicon Valley. What ignited all of this was a letter. That day, Block co-founder Jack Dorsey sent an open letter to all employees. He wrote: \"Smart tools have changed what it means to build and run a company. A significantly smaller team, using the tools we are building, can get more done and do it better.\" The implication was clear: the company was determined to achieve higher productivity with fewer, more efficient employees. This isn't a struggling company cutting back on spending. In Q4 2025, Block's total gross profit was $2.87 billion, a 24% year-over-year increase; full-year gross profit exceeded $10.36 billion. Cash App's gross profit increased by 33% year-over-year, with adjusted earnings per share of $0.65, exceeding analysts' expectations. Strong earnings, soaring stock price, then 40% layoffs. This logic has never been followed before. Block's employee count ballooned from 3,835 at the end of 2019 to over 10,000 during the pandemic. Dorsey admitted in a letter that this was a misjudgment of growth. The emergence of AI gave him the opportunity to correct this mistake. It wasn't that the company became weaker, but rather that AI made the company stronger. Dorsey calls this \"intelligent native\"—a way of redesigning the company with AI as the core productivity unit. AI has already started doing the work for you. The \"intelligent tools\" Dorsey refers to are not generic interfaces like ChatGPT. Over the past two years, Block has quietly built an internal AI ecosystem called \"Goose.\" Deeply integrated with over 150 software and data services within the company via the Model Context Protocol (MCP), it can read real-time financial data and perform actions directly within the codebase, invoicing system, and data dashboards, rather than simply generating text suggestions. The numbers speak for themselves: In customer service, AI currently handles approximately 60% of Cash App cases; in engineering, since the introduction of AI-assisted programming tools in September 2025, the amount of production code delivered per engineer has increased dramatically. In Q3 2025, Block launched the \"G2\" proxy interface built on Goose. This completely transformed the way employees work—the remaining 6,000 employees no longer engage in data entry or basic code writing, but instead use the G2 interface to command AI clusters to complete complex tasks. Legal document review, HR screening, and initial editing of video assets are now all handled by G2. People have transformed from \"operators\" to \"curators.\" The newly launched \"Neighborhoods\" feature further demonstrates the efficiency of this model—from concept to launch, it took less than six months. Dorsey envisioned that 6,000 people, plus Goose, could accomplish what 10,000 people couldn't. This logic is the true underlying support for this round of layoffs. \"A Gentle Knife\" Compared to Musk's layoffs after acquiring Twitter in 2022, Dorsey's methods are drastically different. Musk's approach was: suddenly locking down the system, issuing a \"hardcore\" ultimatum, offering only the legally mandated minimum compensation, subsequently triggering numerous lawsuits. Dorsey's approach is: a base salary of at least 20 weeks (with an additional week for each additional year of service; the industry standard is reportedly only 12 to 14 weeks), 6 months of full health insurance, a $5,000 cash transition allowance, and stock option vesting extended to the end of May 2026. Employees can also retain company-issued computers and mobile devices. This plan is almost at the top of the curve in the history of tech industry layoffs. But this doesn't diminish its sharpness. According to feedback from Wired magazine and the anonymous internal platform Blind, Block's internal culture is on the verge of collapse. Dorsey accused some employees of \"going through the motions.\" Attributing structural optimization to individual performance triggered widespread anxiety among retained employees. Those who remained faced double the workload while constantly worrying about being targeted in the next \"AI performance evaluation.\" Generous severance packages mitigated the risk of class-action lawsuits and helped Dorsey maintain a \"respectable employer\" image, diverting attention from the AI ​​efficiency narrative to the reality of 4,000 families losing their livelihoods. This \"cold-blooded business decision,\" wrapped in an \"emotional all-staff letter,\" constitutes a complex management model. Why Wall Street is cheering for layoffs. The logic of the capital market is faster than anyone else's. The stock price surged 23% in after-hours trading, adding approximately $2.4 billion to the company's market capitalization. Roughly speaking, this equates to creating about $600,000 in book value for the company for every employee laid off. Longer-term calculations are even more astonishing. In 2026, Block is projected to generate approximately $12.2 billion in gross profit. With fewer than 6,000 employees, this translates to a gross profit per employee approaching $2 million, far exceeding top tech companies like Google and Meta. In 2026, with the Federal Reserve maintaining high interest rates and tech company financing tightening, the capital market's focus has shifted from \"growth premium\" to \"profit premium\" and \"unit productivity premium.\" Block has successfully surpassed the \"40 rule\" (the sum of revenue growth rate and profit margin must be no less than 40%) and completed a $790 million stock buyback in Q4, bringing the total buyback amount for the year to $2.3 billion. The board of directors understood this strategy perfectly. Block's case may force the entire fintech industry to reassess its workforce cost structure. Layoffs \"in the name of AI\" are becoming an attractive strategic script. If CEOs find that announcing \"AI to replace layoffs\" can generate a stock price increase of over 20%, large-scale white-collar layoffs will no longer need an economic recession as a justification. Summary: From \"layoffs due to weaknesses\" to \"layoffs due to strengths,\" this shift poses an unprecedented challenge to the job security of white-collar workers. Block is simply the first to publicly acknowledge this. When a company cuts its workforce by 40% and its stock price surges in the opposite direction, it sends a clear signal to the market: In future corporate valuations, the number of people will no longer be considered an asset, but rather an \"operational friction\" that needs to be optimized through technology. Whether Dorsey's gamble succeeds depends on whether the 6,000 remaining employees can truly master Goose, whether the AI-assisted code can withstand the test of time in complex systems, and whether a company that has been streamlined to the extreme can continue to maintain its pace of innovation. The answer may not be known for several years. But the experiment has already begun, and no one knows where it will end.</div></div>",
            "image": "https://img.jinse.com.cn/7436259_small.png",
            "link": "https://www.coinlive.com/news/nearly-half-of-the-workforce-was-laid-off-yet-the",
            "pub_date": "2026-02-27 17:50:06",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 250496,
            "title": "Cryptocurrency venture capital in early 2026",
            "description": "<div class=\"share___SVvtl\"><div><p style=\"text-align: left;\">Author: insights4vc Translator: Shan Ouba, Jinse Finance</p><p style=\"text-align: left;\">As 2025 draws to a close, the venture capital market presents a stark contrast, with a market structure increasingly clearly exhibiting a \"winner-takes-all\" pattern. The momentum-driven underwriting model of 2021 has been replaced by more rigorous, data-driven investment strategies.</p><p style=\"text-align: left;\">Global</p><p style=\"text-align: left;\">Investable capital remains near historical highs at approximately $1.3 trillion, but its annual composition now presents a pressure rather than a benefit. A significant portion of this capital is concentrated in funds established between 2022 and 2023, which must invest in a market environment characterized by tighter liquidity, higher due diligence standards, and significantly higher criteria for judging \"outstanding\" investment results.</p><p style=\"text-align: left;\">Funding activity also reflects this adjustment.</p><p style=\"text-align: left;\">Funding activity also reflects this adjustment.</p> In 2025, US venture capital funding faces its most severe challenge in a decade: total funding has fallen to $66.1 billion, with only 537 funds raising capital, approximately 30% of the number of funds raised in 2021. The core driver is excess liquidity. A large number of unlisted venture-backed companies remain unsold, resulting in insufficient profit distributions to limited partners (LPs), making it more difficult to reinvest funds in new projects. <figure><p style=\"text-align:center\"><img alt=\"Private Equity 2026\" data-attrs=\"{\" equity=\"\" fetchpriority=\"high\" i=\"\" images=\"\" imagesize=\"\" insights4vc.substack.com=\"\" png=\"\" public=\"\" sizes=\"100vw\" src=\"https://img.jinse.com.cn/7436237_watermarknone.png\" srcset=\"https://substackcdn.com/image/fetch/$s_!wVjc!,w_424,c_limit,f_auto,q_auto:good,fl_progressive:steep/https% 3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F44f35b1d-439b-4a4d-98f6-a17080cfb1fb_2174x1150.png 424w, https://substackcdn.com/image/fetch/$s_!wVjc!,w_848,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2 F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F44f35b1d-439b-4a4d-98f6-a17080cfb1fb_2174x1150.png 848w, https://substackcdn.com/image/fetch/$s_!wVjc!,w_1272,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F44f35b1d-439b-4a4d-98f6-a17080cfb1fb_2174x1150.png 1272w, https://img.jinse.com.cn/7436237_watermarknone.png 1456w\" substack-post-media.s3.amazonaws.com=\"\" title=\"Private Equity 2026\"/></p><figcaption style=\"text-align: center;\">Global Private Equity Capital by Fund Type</figcaption></figure><p left=\"\" style=\"text-align: It is estimated that there are currently about 32,000 venture-backed companies with unrealized value of approximately $3.8 trillion. The subsequent impact is mechanical. By the end of 2025, 53% of limited partners (LPs) indicated that uncollected prior commitments limited their ability to make new investments, a 15 percentage point increase from the previous year. This environment creates a self-reinforcing consolidation cycle. Large fund managers with superior DPI (dividend payout ratio) and ranking in the top 25% receive a disproportionate share of new investment commitments, while emerging and mid-sized fund managers face a structurally more challenging market environment, with LPs less willing to underwrite long-term book value (TVPI) without reliable cash distribution channels. Andreessen Horowitz's $15 billion fundraising plan, to be completed in early 2026, is a prime example of this consolidation trend, even with median fund managers having significantly longer fundraising cycles and more stringent conditions. &lt;/p&gt;&lt;h2 style=\" text-align:=\"\"><strong>Shifting Towards Venture Growth and Expansion Funds</strong></p><p style=\"text-align: left;\">With IPOs remaining sporadic and strategic M&amp;A remaining cautious, the venture capital growth sector has become a focal point for capital deployment and liquidity engineering. In 2025, the annualized deal size of the venture capital growth sector climbed to $150.2 billion, surpassing the record of $91.6 billion set in 2021. This was largely driven by a few large AI funding rounds, including OpenAI's $40 billion investment and massive funding rounds for xAI and Anthropic. This not only indicates that \"AI is hot,\" but also that the most valuable companies are extending their private run and increasingly funding their growth through the private market rather than the IPO cycle.</p><p style=\"text-align: left;\">To maintain longer horizons without mandatory valuation resets, general partners (GPs) are increasingly relying on \"internal financing\" and deferred funds, aiming to stabilize equity structures and help companies ultimately achieve liquidity within a manageable timeframe.</p><p style=\"text-align: left;\"> This trade-off is structural: since 2020, reliance on these mechanisms has led to a significant expansion in venture capital net asset value, but actual returns have lagged, exacerbating tensions between fund managers and limited partners (LPs), who now focus not only on market valuations but also on subsequent returns (DPI). While cutting-edge sectors, particularly artificial intelligence, continue to command high valuation premiums, the long tail of the venture capital ecosystem faces more severe adjustments. In 2025, the median pre-funding valuation of US venture capital firms rose, with some sectors even exceeding 2021 levels, but this growth was concentrated in a few considered winners. Approximately 15% of venture capital rounds in 2025 were valuation decline rounds, approaching the ten-year high reached in 2024. This pressure is particularly pronounced among unicorn companies: it is estimated that, under updated market-clearing assumptions, 222 of the 857 active unicorn companies in the US may have actually fallen below the $1 billion valuation threshold. These equity resets directly lead to pressure on equity structure tables. As new investors seek downside protection, structured funding rounds with higher liquidation preference and “pay-to-participate” clauses are becoming increasingly common. The costs are typically borne by founders and employees, manifesting as equity dilution and incentive compression, which can harm the company’s long-term development. This is the real-world significance of the “software industry rethink”: the mainstream value creation model has shifted from pursuing growth at all costs to more rigorous unit economics, faster profit paths, and operational plans capable of withstanding higher discount rates. Since the beginning of 2025, private equity strategies have shifted from a defensive posture to a more sustainable and rigorous balance. Its core philosophy has shifted from \"surviving until 2025\" to rebuilding the revenue creation model in the face of scarce liquidity and unreliable public market exit mechanisms. For venture capital, this means stricter underwriting, more aggressive portfolio management, and more focused distribution channels. For acquisitions, it means higher operational intensity and a renewed emphasis on initial value creation. In the venture capital and acquisition space, the competitive landscape is shifting from capital supply to replicable operational excess returns, corporate governance, and liquidity management. The Evolution of the GP and LP Narrative General partners have gradually abandoned passive holding strategies. In the past 12 months, more and more companies have begun to adopt \"comprehensive potential due diligence,\" a multidisciplinary pre-closing process that integrates product and technology assessment, marketing execution plans, and increasingly AI-driven capability assessments. The real change is that due diligence is no longer just about mitigating downside risk, but about developing a concrete operational plan for immediate execution after closing. One example cited by the market is OneStream Software's privatization in early 2026, where investors reportedly merged commercial and technical due diligence into a single, integrated workflow to shorten the time to immediate post-closing impact. Meanwhile, limited partners (LPs) are becoming increasingly assertive. Their definition of success is no longer so uniform; diversification and portfolio construction are gaining more weight beyond absolute returns, especially in acquisition allocations. However, patience is conditional. LLPs are more willing to accept longer investment horizons if general partners can demonstrate a viable, repeatable profit model that goes beyond simply increasing asset prices. The key shift is that without a reliable path to realizing returns (whether through exits, secondary market transactions, continuation schemes, or structured liquidity initiatives), simply relying on \"good total value returns\" is no longer convincing. </p><h3 style=\"text-align: left;\"><strong>Macroeconomic Repricing and the Regression of Execution Risk</strong></h3><p style=\"text-align: left;\">In early 2025, market sentiment improved with the easing of financial conditions and the reopening of credit markets. However, the year also saw cyclical shocks and rapid repricing events, repeatedly disrupting trading. Policy uncertainty and inflation sensitivity led to divergences in future expectations between buyers and sellers, thus slowing down the trading process and resetting valuation anchors. By the second half of 2025, market activity began to rebound as market participants adjusted to new capital costs and accepted that the baseline scenario was not an immediate recession, but rather a market environment with higher interest rates and greater selectivity. The rebound was most pronounced in North America and was mainly concentrated in large, originator-driven transactions, further reinforcing the overall trend of higher concentration at the high end of the market.</p> The most significant behavioral shift is the widespread acceptance that the era of loose monetary policy is over, and returns are now built more on operational performance than on price-to-earnings ratio expansion. In the previous cycle, a typical acquisition target might have been a 2.5x return on capital (MOIC) while achieving mid-single-digit EBITDA growth, thanks to lower borrowing costs and higher leverage. In the current equilibrium, however, achieving similar goals requires higher potential earnings growth (typically between 10% and 12%) and more rigorous execution of value creation programs, due to rising financing costs and more conservative leverage. <figure><p style=\"text-align:center\"><img alt=\"Private Equity 2026\" data-attrs=\"{\" equity=\"\" i=\"\" images=\"\" imagesize=\"\" insights4vc.substack.com=\"\" loading=\"lazy\" png=\"\" public=\"\" sizes=\"100vw\" src=\"https://img.jinse.com.cn/7436238_watermarknone.png\" srcset=\"https://substackcdn.com/image/fetch/$s_!cDMr!,w_424,c_limit,f_auto,q_auto:good,fl_progressive:steep/https% 3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F46bb21ee-596f-4243-9bea-02129e456f22_2638x1008.png 424w, https://substackcdn.com/image/fetch/$s_!cDMr!,w_848,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2 F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F46bb21ee-596f-4243-9bea-02129e456f22_2638x1008.png 848w, [Image URLs: https://substackcdn.com/image/fetch/$s_!cDMr!,w_1272,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F46bb21ee-596f-4243-9bea-02129e456f22_2638x1008.png 1272w, https://img.jinse.com.cn/7436238_watermarknone.png 1456w\" substack-post-media.s3.amazonaws.com=\"\" title=\"Private Equity 2026\"/></p><figcaption style=\"text-align: center;\">Source: Bain &amp; Company, \"Global Private Equity Report 2026\".</figcaption><p> ... This \"alpha gap\" is forcing general partners (GPs) to transform into system builders. The most competitive firms are specializing in operational capabilities, talent, data infrastructure, and replicable marketing strategies, and increasingly leveraging internal AI resources to improve productivity and decision-making quality. Meanwhile, management firms are under pressure to generate profits as limited partners (LPs) increasingly seek fee reductions and commission-free co-investment, while the cost base is rising to support deeper due diligence, operational teams, and more complex investor relations. Ultimately, scale, processes, and verifiable cash flow outcomes are becoming the primary moats in the market. The rise of the secondary market as a primary liquidity channel is converging on a bottleneck: liquidity. In a market environment characterized by sporadic IPOs, selective M&amp;A, and increasingly longer fund durations, venture capital needs a scalable mechanism to convert book value into actual returns without waiting for a perfect listing window. It is against this backdrop that the secondary market has been repositioned, transforming from an opportunistic, peripheral tool into a core component of market infrastructure. In effect, the secondary market has become a systemic pressure relief valve, supporting limited partner (LP) rebalancing, general partner (GP)-led duration management, and direct corporate liquidity programs that incentivize talent while keeping companies private. According to data compiled by Theory Ventures and PitchBook, the composition of venture capital exits has changed significantly over the past decade. In 2015, secondary market transactions accounted for only a small fraction of realized exit value. By September 30, 2025, its share had climbed to about one-third, on par with exit methods such as initial public offerings (IPOs) and mergers and acquisitions (M&amp;A). The key is not the specific percentage, but its structural impact: liquidity is no longer defined solely by \"exit events,\" but rather shifts to a repeatable, programmatic allocation pathway. </p><figure><p style=\"text-align:center\"><img alt=\"vc exit type\" data-attrs=\"{\" exit=\"\" i=\"\" images=\"\" insights4vc.substack.com=\"\" l=\"\" loading=\"lazy\" png=\"\" public=\"\" sizes=\"100vw\" src=\"https://img.jinse.com.cn/7436239_watermarknone.png\" srcset=\"https://substackcdn.com/image/fetch/$s_!CWrI!,w_424,c_limit,f_auto,q_auto:good,fl_progressive:steep/https% 3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F3d85da88-4d1a-461c-8f7c-af5962746624_2922x1528.png 424w, https://substackcdn.com/image/fetch/$s_!CWrI!,w_848,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2 F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F3d85da88-4d1a-461c-8f7c-af5962746624_2922x1528.png 848w, [Image URLs: https://substackcdn.com/image/fetch/$s_!CWrI!,w_1272,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F3d85da88-4d1a-461c-8f7c-af5962746624_2922x1528.png 1272w, https://img.jinse.com.cn/7436239_watermarknone.png 1456w\" substack-post-media.s3.amazonaws.com=\"\" title=\"vc exit type\" type=\"\"/></p><figcaption style=\"text-align: center;\">Venture Capital Exit Value Share by Type (2015-2025)</figcaption></figure><h2 acceleration=\"\" catalysts=\"\" for=\"\" secondary=\"\"></h2><p style=\"text-align: left;\">The expansion of the secondary market is best understood as a sustained response to the long-term private market, rather than merely a cyclical expedient. Several factors are driving the global secondary market size to reach approximately $240 billion by 2025:</p><ul class=\"list-paddingleft-2\"><li><p style=\"text-align: left;\"><strong>Longer-Term Private Assets:</strong>Companies are staying private for longer periods, increasingly using private placements and tender schemes to manage liquidity rather than rushing to go public.</p></li><li><p style=\"text-align: left;\"><strong>DPI Scarcity:</strong>Distribution pressures intensify as limited partners rebalance their portfolios and fund new allocations, resulting in a stable sell-side supply. Secondary market trading volumes surged in early 2025, consistent with the market's trend towards seeking cash returns.</p></li><li><p style=\"text-align: left;\"><strong> IPO and M&amp;A Restrictions: Even with intermittent reopenings of the public market, the window of opportunity is not long enough to clear a large inventory of late-stage private equity assets. Institutionalization of Channels: Large banks, advisors, and professional secondary market managers have expanded their operations, viewing the secondary market as a long-term growth vertical for advisory and wealth management platforms. Disruption of the Secondary Market Structure: As the secondary market shifts towards centralization, it fragments into three main structures, each with distinct stakeholder objectives. Limited Partner-Led Transactions: Limited partner-led transactions remain the foundational layer, allowing limited partners to sell fund shares to rebalance portfolios and control investment pace. Limited partner-led deals are projected to reach approximately $117 billion by 2025. Pricing improved in early 2025 as public markets stabilized, but price discrepancies remained significant. Liquidation prices for venture capital and growth funds were typically lower than a percentage of net asset value for buyout funds, reflecting their longer duration, higher uncertainty in realized returns, and greater risk associated with market capitalization. GP-led continuation funds have evolved from a distress management tool into a mainstream duration management tool. By 2025, general partner (GP)-led continuation funds are projected to reach approximately $115 billion, accounting for nearly half of total deals in some datasets. Their application is increasingly consistent: providing liquidity to limited partners (LPs) upon fund maturity while maintaining exposure to assets that the GP believes still have significant upside potential. This structure can address practical time mismatch issues, but it also raises governance and conflict-of-interest problems, making pricing, fairness opinions, and alignment of interests increasingly important. Direct Secondary Market Transactions and Tender Offers Direct secondary market offerings and tender offers are becoming increasingly common among the most valuable private companies, serving as channels for internal liquidity among employees and early investors. OpenAI's stock sale in October 2025 is a prime example, reportedly worth approximately $6.6 billion and valuing the company at nearly $500 billion. SpaceX and Stripe have also adopted tender offer-style liquidity schemes, indicating that top private companies are increasingly replacing early IPO-driven liquidity with periodic tender offer windows. Pricing Dynamics and Adverse Selection A key point of contention is whether secondary market transactions introduce adverse selection, especially when the general partner (GP) moves the strongest assets to the equity contract (CV) while leaving the weaker companies in place. The market's response has been to increase transaction complexity and strengthen underwriting. Single-asset equity contracts with high-quality collateral are fetching increasingly higher prices, reaching higher proportions of net asset value (NAV), indicating that buyers are willing to pay higher prices when corporate governance, valuation support, and alignment of interests are credible. General partners are also relying more on signaling mechanisms, including making substantial commitments at the time of the transaction to demonstrate their confidence and reduce market expectations of their one-sided options. In the market, primary market valuations often lag behind actual value, and the secondary market also plays a role in price discovery. A common phenomenon is that a company's book valuation may be high when it raises funds in the primary market, but its implied valuation may be low when it is liquidated in the secondary market, especially for software assets developed during the pandemic. In this sense, the secondary market is increasingly becoming the birthplace of \"true\" liquidation prices, even if these prices are sometimes unacceptable. The launch of Robinhood Ventures marks a significant turning point in the \"democratization\" of private equity. The project, scheduled to launch at the end of 2025, aims to bridge the gap between the $10 trillion private equity market and ordinary retail investors. Its strategic logic is clear: as companies remain private for longer periods, the wealth created during their growth phase is increasingly captured by a small elite of institutions. Robinhood plans to address this \"long-standing injustice\" through its first fund. </strong></p><h3><strong>RVI Fund I: Structure and Positioning</strong></h3><p>RVI is a publicly traded closed-end fund established under the Investment Company Act of 1940, which provides standardized information disclosure and board oversight mechanisms not available to traditional venture capital funds. This structure allows the fund to trade on the New York Stock Exchange, providing daily liquidity to retail investors and enabling it to invest in assets that would otherwise be less liquid.</p><ul class=\"list-paddingleft-2\"><li><p><strong>Financial Terms:</strong> The fund charges a 2% annual management fee (reduced to 1% for the first six months), but crucially, it does not charge performance-based fees (commissions). This makes it more cost-effective for retail investors than traditional private equity funds. Investment Channels: RVI does not require accredited investor status and has no high minimum investment amount; retail investors can purchase one share at the expected IPO price of $25. Institutional Support: Goldman Sachs serves as the sole bookrunner for RVI's $1 billion IPO scheduled for February 2026. </p></li></ul><h3><strong>Investment Logic and Portfolio Analysis</strong></h3><p></p><figure><p><picture><source><img alt=\"Robinhood Ventures\" class=\"sizing-normal\" data-attrs=\"{\" i=\"\" images=\"\" insights4vc.substack.com=\"\" loading=\"lazy\" png=\"\" public=\"\" sizes=\"100vw\" src=\"https://img.jinse.com.cn/7436240_watermarknone.png\" srcset=\"https://substackcdn.com/image/fetch/$s_!GO7_!,w_424,c_limit,f_auto,q_auto:good,fl_progressive:steep/https% 3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F6b0fbe53-2d5f-4972-b7e5-a77db2c451fd_2408x876.png 424w, https://substackcdn.com/image/fetch/$s_!GO7_!,w_848,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2 F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F6b0fbe53-2d5f-4972-b7e5-a77db2c451fd_2408x876.png 848w, https://substackcdn.com/image/fetch/$s_!GO7_!,w_1272,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F6b0fbe53-2d5f-4972-b7e5-a77db2c451fd_2408x876.png 1272w, https://img.jinse.com.cn/7436240_watermarknone.png 1456w\" substack-post-media.s3.amazonaws.com=\"\" title=\"Robinhood Ventures\" ventures=\"\"/></source></picture></p></figure><p>RVI's investment focus is concentrated on investing in a range of high-profile late-stage \"frontier\" private companies spanning multiple sectors and continuing to attract demand from institutional investors.</p> The fund's investment objective is long-term capital appreciation, and it plans to hold companies up to the IPO and public market stages, where appropriate. According to information disclosed in early 2026, the portfolio includes a number of leading late-stage companies, such as: Artificial Intelligence Software: Databricks (valued at approximately $134 billion in its December 2025 funding round). Fintech Companies: Revolut, Airwallex, and Ramp. Aerospace: Boom Supersonic. Health and Consumer Technology: Ora. Equity Arrangements: Exposure to Stripe (based on its recent valuation of approximately $159 billion). Conceptually, Robinhood's model differs from corporate venture capital projects like Coinbase Ventures. Coinbase Ventures primarily acts as a strategic ecosystem investor, focused on achieving platform goals and network effects in the cryptocurrency space. Robinhood Ventures (RVI), on the other hand, is more like a distribution product, aiming to provide packaged private market investment opportunities to Robinhood's user base through regulatory mechanisms. Its deeper strategic goal is for private assets to become a mainstream category in retail portfolios, just as thematic ETFs broadened retail investors' access to equity portfolios. Robinhood aims to achieve liquidity, user engagement, and platform connectivity at every stage of the customer lifecycle. However, this structure also introduces some significant risks that retail investors often underestimate. The most immediate risk is \"packaging risk\": exchange-traded closed-end funds may consistently trade at a premium or discount to their net asset value, and liquidity at the packaging level does not eliminate the underlying portfolio's illiquidity. Secondly, there are risks related to concentration and news events: due to the limited number of constituent stocks, a single repricing event can have a significant impact on fund performance. Furthermore, there is capability risk: managing exposure to unlisted companies, valuation processes, and corporate governance dynamics is vastly different from the capabilities required for broker-dealer distribution, which is why some commentators have publicly questioned execution quality and investor returns. <h2><strong>Cryptocurrency and Blockchain Venture Capital in Q4 2025</strong></h2><p>In the fourth quarter of 2025, cryptocurrency venture capital activity rebounded strongly, primarily driven by large-scale late-stage funding. Venture capitalists completed 425 deals totaling $8.5 billion, marking the highest quarterly performance (in USD) since Q2 2022, although the number of deals was largely flat and far below the boom period of 2021-2022. The macroeconomic environment continues to suppress new investment demand, and the strong appeal of highly liquid cryptocurrencies (coupled with recent market volatility) may keep market sentiment cautious in the first quarter of 2026.</p><p></p><figure><p><picture><source><img alt=\"Cryptocurrency 2026\" class=\"sizing-normal\" data-attrs=\"{\" i=\"\" images=\"\" imagesize=\"\" insights4vc.substack.com=\"\" loading=\"lazy\" png=\"\" public=\"\" sizes=\"100vw\" src=\"https://img.jinse.com.cn/7436241_watermarknone.png\" srcset=\"https://substackcdn.com/image/fetch/$s_!KWqN!,w_424,c_limit,f_auto,q_auto:good,fl_progressive:steep/https% 3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F5dc83217-ea98-49cc-8a8d-948ddfa7aaae_1500x734.png 424w, https://substackcdn.com/image/fetch/$s_!KWqN!,w_848,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2 F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F5dc83217-ea98-49cc-8a8d-948ddfa7aaae_1500x734.png 848w, https://substackcdn.com/image/fetch/$s_!KWqN!,w_1272,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A% 2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F5dc83217-ea98-49cc-8a8d-948ddfa7aaae_1500x734.png 1272w, https://img.jinse.com.cn/7436241_watermarknone.png 1456w\" substack-post-media.s3.amazonaws.com=\"\" title=\"Cryptocurrency 2026\" vc=\"\"/></source></picture></p></figure><p></p><figure><figcaption alt=\"\" class=\"sizing-normal\" data-attrs=\"{\" https:=\"\" i=\"\" images=\"\" insights4vc.substack.com=\"\" loading=\"lazy\" null=\"\" png=\"\" public=\"\" sizes=\"100vw\" src=\"\" srcset=\"https://substackcdn.com/image/fetch/$s_!EG8q!,w_424,c_limit,f_auto,q_auto:good,fl_progressive:steep/https% 3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F9e1e46ce-1cf2-463a-9f0a-5fd132e929e7_2726x1092.png 424w, https://substackcdn.com/image/fetch/$s_!EG8q!,w_848,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2 F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F9e1e46ce-1cf2-463a-9f0a-5fd132e929e7_2726x1092.png 848w, [Image URL: https://substackcdn.com/image/fetch/$s_!EG8q!,w_1272,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F9e1e46ce-1cf2-463a-9f0a-5fd132e929e7_2726x1092.png 1272w, https://img.jinse.com.cn/7436242_watermarknone.png 1456w\" style=\"text-align: Despite these headwinds, the market structure remains healthy. Funds continue to flow to areas with clear revenue streams and sustained demand, including trading and brokerage, stablecoins, AI-related themes, and core infrastructure. Notably, pre-seed funding activity remains active, indicating that even after the “tourist capital” phase has ended, founders can still launch and fund new projects. The US remains the market center in terms of both funding volume and deal volume, and increasingly supportive policy directions further solidify its dominance. Key Takeaways: Total investment in 2025 exceeded $20 billion, with 1,660 deals, the largest annual figure since 2022 and more than double that of 2023. &lt;/p&gt;&lt;/li&gt;&lt;li&gt;&lt;p&gt;Q4 2025: $8.5 billion invested in 425 deals (84% QoQ increase) (2.6% QoQ increase).&lt;/p&gt;&lt;/li&gt;&lt;li&gt;&lt;p&gt;Funding skewed towards later stages: 56% of the funding came from later stages, compared to 44% from early stages (unchanged QoQ).&lt;/p&gt;&lt;/li&gt;&lt;li&gt;&lt;p&gt;Mega funding rounds dominated performance: 11 deals exceeding $100 million accounted for approximately 85% of the total amount in Q4 ($7.3 billion).&lt;/p&gt;&lt;/li&gt;&lt;li&gt;&lt;p&gt;The trading/exchange/investment/lending sector attracted the most funding ($5.5 billion), with Revolut ($3 billion), Touareg Group ($1 billion), and Kraken ($800 million) leading the pack.&lt;/p&gt;&lt;/li&gt;&lt;li&gt;&lt;p&gt;Funding improved but remained constrained: 11 new crypto venture capital funds raised a total of $1.98 billion in Q4; $8.75 billion was raised for the full year.&lt;/p&gt;&lt;/li&gt;&lt;li&gt;&lt;p&gt;Funding improved but remained constrained: 11 new crypto venture capital funds raised a total of $1.98 billion in Q4; $8.75 billion was raised for the full year.&lt;/p&gt;&lt;/li&gt;&lt;li&gt;&lt;p&gt; &lt;/p&gt;&lt;/li&gt;&lt;/ul&gt;&lt;h3&gt;&lt;strong&gt;Activity Rankings and Investor Sentiment&lt;/strong&gt;&lt;/h3&gt;&lt;p&gt;Coinbase Ventures remains the most active investor in the space, emphasizing that building the “Base” ecosystem is a long-term driver of on-chain profitability. The table below summarizes the top investors by transaction volume over the past 12 months (February 2025 to February 2026).&lt;/p&gt;&lt;/li&gt;&lt;/ul&gt;&lt;h3&gt;&lt;strong&gt;Activity Rankings and Investor Sentiment&lt;/strong&gt;&lt;/h3&gt;&lt;p&gt;Coinbase Ventures remains the most active investor in the space, emphasizing that building the “Base” ecosystem is a long-term driver of on-chain profitability. ...strong&gt;&lt;/p&gt;&lt;/li&gt;&lt;/ul&gt;&lt;h3&gt;&lt;strong&gt;Activ &lt;/p&gt;&lt;p&gt;&lt;/p&gt;&lt;figure&gt;&lt;p&gt;&lt;picture&gt;&lt;source&gt;&lt;img src=\" substack-post-media.s3.amazonaws.com=\"\"></figcaption></figure><h3>What factors led to the surge in the fourth quarter?</h3> The surge in the fourth quarter was less due to a general increase in risk appetite and more a result of a concentrated influx of capital into the high-end market. A few large funding rounds accounted for the vast majority of the funds, including those for Revolut, Touareg Group, Kraken, and others exceeding nine figures (such as Ripple, Tempo, Erebor, and Rain, all of which raised over $100 million this quarter). This means that the apparent recovery is real, but its distribution is uneven. The current cycle consists of two parallel realities: Later-stage companies are absorbing more capital. More and more capital is flowing to larger companies with mature business models, well-established distribution channels, and clear profit paths. Seed-stage companies are still alive, but their structural advantages are weak. By deal volume, pre-seed funding accounted for 23% in the fourth quarter, indicating strong entrepreneurial activity. However, long-term trends show a decline in the proportion of pre-seed funding and an increase in the proportion of mid-to-late stage funding, consistent with an ecosystem that has already built many \"first-wave\" foundations. The market's development resembles a maturing industry: no longer do entirely new categories requiring dozens of early experiments, but rather more incremental innovation, integration, and scaling based on existing successes. Category Chart Trading/Exchange/Investment/Lending still dominates total funding, reflecting its historically strongest monetization capabilities and most deeply rooted demand. Meanwhile, category share trends indicate a more pronounced shift in market preferences: Downgrade Trend: Web3 / NFT / DAO / Metaverse / Gaming are relatively declining. Upward Pressure: Payments/Rewards and Banking continue to gain market share, while the number of transactions in DeFi, infrastructure, and tokenization also continues to attract attention. When categorizing by stage, the pattern is obvious: Transaction-intensive capital is primarily biased towards later stages (driven by the largest funding rounds). The banking sector and some emerging sectors have received substantial early-stage funding, indicating that investors still see market gaps, but they are more selective in their investment timing. The US continues to lead in startup density, capital market depth, and accelerated adoption of new technologies by institutional investors. This advantage could widen further if regulatory transparency continues to improve. Valuation and Transaction Size Cryptocurrency valuations continue to climb until 2025, setting a new record in the fourth quarter, while median transaction size also matched all-time highs. In the fourth quarter, the median transaction size was $4 million, and the median pre-funding valuation was $70 million. However, the valuation data has limited coverage (only a few transactions reported valuations), and the proportion of later-stage financing in the published samples is too high. Therefore, the above valuation levels are for reference only and are not generally representative. <p></p><figure><p><picture><source><img a=\"\" about=\"\" alibaba=\"\" alt=\"\" an=\"\" analogy:=\"\" and=\"\" apt=\"\" aramco=\"\" as=\"\" at=\"\" because=\"\" but=\"\" by=\"\" can=\"\" capital=\"\" cited=\"\" come=\"\" constraints:=\"\" credible=\"\" currently=\"\" data-attrs=\"{\" demand.=\"\" demonstrated=\"\" digits=\"\" ends.=\"\" even=\"\" eventually=\"\" example=\"\" exceeded=\"\" expiration=\"\" float=\"\" formation.=\"\" free=\"\" highlights=\"\" i=\"\" images=\"\" in=\"\" initial=\"\" insights4vc.substack.com=\"\" ipo=\"\" is=\"\" its=\"\" later=\"\" liquidity=\"\" lock-up=\"\" market=\"\" market.=\"\" meaningful=\"\" more=\"\" not=\"\" of=\"\" often=\"\" only=\"\" period=\"\" png=\"\" possible=\"\" pressure=\"\" private=\"\" proper=\"\" provide=\"\" public=\"\" real=\"\" release=\"\" remains=\"\" required=\"\" saudi=\"\" scale=\"\" selling=\"\" several=\"\" shares=\"\" single=\"\" sovereign=\"\" src=\"https://img.jinse.com.cn/7436243_watermarknone.png\" srcset=\"https://substackcdn.com/image/fetch/$s_!-h2T!,w_424,c_limit,f_auto,q_auto:good,fl_progressive:steep/https% 3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F3b145bf2-ea81-4b47-a454-68890ea3f7c4_1500x728.png 424w, https://substackcdn.com/image/fetch/$s_!-h2T!,w_848,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2 F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F3b145bf2-ea81-4b47-a454-68890ea3f7c4_1500x728.png 848w, Despite improved investment activity in 2025, fundraising remains challenging. Following the market downturn of 2022-2023, asset allocators remain cautious, and crypto funds also face competition from artificial intelligence and liquidity instruments such as spot exchange-traded products (ETPs) and other public market investment options. While 11 funds raised $1.98 billion in the fourth quarter is progress, the broader signal suggests that fund formation is still near cyclical lows, and fund managers must work harder to secure investment commitments. The Liquidity Illusion Ultimately, the issue isn't whether mega-IPOs are \" strategy=\"\" stress=\"\" substack-post-media.s3.amazonaws.com=\"\" supply=\"\" test=\"\" than=\"\" the=\"\" they=\"\" this=\"\" time=\"\" times=\"\" traditional=\"\" ull=\"\" was=\"\" when=\"\" whether=\"\" will=\"\" with=\"\" years=\"\"/><p></p><figure><p><picture><source><img ai=\"\" alt=\"Open AI IPO\" class=\"sizing-normal\" data-attrs=\"{\" i=\"\" images=\"\" insights4vc.substack.com=\"\" ipo=\"\" loading=\"lazy\" png=\"\" public=\"\" sizes=\"100vw\" src=\"https://img.jinse.com.cn/7436244_watermarknone.png\" srcset=\"https://substackcdn.com/image/fetch/$s_!aZhJ!,w_424,c_limit,f_auto,q_auto:good,fl_progressive:steep/https% 3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F908b158d-1cef-413d-83b4-edaa69f667ab_2162x894.png 424w, https://substackcdn.com/image/fetch/$s_!aZhJ!,w_848,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2 F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F908b158d-1cef-413d-83b4-edaa69f667ab_2162x894.png 848w, https://substackcdn.com/image/fetch/$s_!aZhJ!,w_1272,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A% 2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F908b158d-1cef-413d-83b4-edaa69f667ab_2162x894.png 1272w, https://img.jinse.com.cn/7436244_watermarknone.png 1456w\" substack-post-media.s3.amazonaws.com=\"\" title=\"Open AI IPO\"/></source></picture></p></figure><p></p><figure><figcaption a=\"\" accessing=\"\" advantage=\"\" an=\"\" and=\"\" are=\"\" but=\"\" cash=\"\" competitive=\"\" event=\"\" exits=\"\" for=\"\" funding=\"\" general=\"\" in=\"\" key=\"\" less=\"\" lie=\"\" more=\"\" multi-year=\"\" not=\"\" obtaining=\"\" of=\"\" partners=\"\" project=\"\" returns.=\"\" style=\"text-align: Source: tomtunguz &lt;/figure&gt;&lt;/p&gt;&lt;/p&gt;&lt;p&gt;SpaceX, OpenAI, and Anthropic may be better prepared in some respects, as multiple tender offers have released some of their pent-up funds, but this does not solve the absorption challenges posed by their scale. Assuming a combined valuation of approximately $2.9 trillion, even using a conservative percentage of outstanding shares, this means that 15% of the tradable shares would amount to $432 billion, and 20% to $576 billion—figures far exceeding those of previous liquidity-driven IPO models. Therefore, secondary markets, continuation funds, and structured liquidity programs have become core infrastructure, not cyclical stopgap measures: until the public markets can smoothly absorb trillions of dollars in funding, venture capital \" the=\"\" will=\"\"></figcaption></figure></source></picture></p></figure></li></ul></figure></div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/1ba192dc70b690ceb52005c976eefca0.jpg",
            "link": "https://www.coinlive.com/news/cryptocurrency-venture-capital-in-early-2026",
            "pub_date": "2026-02-27 17:10:44",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 250490,
            "title": "The debate is over: Haseeb is to Dragonfly what Musk is to Tesla.",
            "description": "<div class=\"share___SVvtl\"><div>Written by: jsai@Jinse Finance<p>The dispute between the two co-founders of Dragonfly has ended.</p><p>Two key figures at crypto VC Dragonfly Capital—current managing partner Haseeb Qureshi and former co-founder Alexander Pack (now co-founder of Hack VC)—recently engaged in a heated public debate on the X platform. This dispute, which erupted around February 26, 2026, has become a hot topic in the crypto VC community.</p><p>However, with the subsequent statements from former Dragonfly employee and founder Feng Bo, stating that \"Haseeb is to Dragonfly what Musk is to Tesla,\" and \"Haseeb is the brightest star...undoubtedly the leader and core figure of Dragonfly,\" the debate was definitively resolved.</p> The core of the debate: The controversy was sparked by a long article published by Haseeb Qureshi on X (titled \"How to Build a VC Firm\"), in which he detailed how he built a successful venture capital firm from scratch. He implied in the article that Dragonfly's early brand, structure, and influence were virtually nonexistent, and that it was only after he joined that the company truly started from \"zero,\" transformed, and achieved scaled growth, including ending the \"fund of funds\" model, building a technology team, and leading investments. Alexander Pack quickly retaliated in the comments section and in direct replies, accusing Haseeb of \"rewriting history\" and \"lying about founding the VC.\" Pack's main points included: He and another founder, Feng Bo, co-founded Dragonfly as early as 2018, more than a year before Haseeb joined (around 2019). Before Haseeb joined, the company had already raised a $100 million fund and led investments in several well-known crypto projects, such as Bybit, Amber Group, and Crusoe Energy Systems. Pack emphasized that these investments and fund announcements occurred before Haseeb's arrival, meaning the company wasn't starting from scratch but already had operational and deal-making capabilities. Haseeb strongly countered, calling Pack's statement \"don't embarrass yourself,\" and refuted it point by point: Dragonfly before his arrival was essentially just a fund of funds (investing in other funds rather than directly leading projects), and had never actually led any deals. In the projects Pack mentioned, Dragonfly was not a lead investor, but rather a participant; some decisions (such as the IC investment committee) were made after he joined. His first action after joining was to terminate the fund-of-funds model, push the company towards direct VC investment, and lead subsequent fundraising, team building, and brand development. Haseeb also mentioned that he informed Pack of severing contact four years ago, implying that their relationship had already broken down. This debate quickly escalated into a war of words, focusing on: Who is Dragonfly's \"true founder\" and early contributor? What was the company's early positioning (fund-of-funds vs. active VC)? And who led the specific investments and their timelines? The crypto community reacted strongly to this controversy, with many media outlets reporting on it immediately, describing it as an \"explosive clash\" and a \"public declaration of merit.\" Community opinions were polarized: some believed Pack was \"revealing the truth,\" and that Haseeb was trying to downplay his predecessor's contributions to elevate himself; others supported Haseeb, arguing that he was the key figure in taking Dragonfly from its early, small-scale growth to its current $4 billion AUM (assets under management), and that Pack's departure (around 2020) rendered him irrelevant. This controversy is seen as a common \"founding father-son inheritance battle\" in the crypto VC industry, highlighting the importance of personal reputation and narrative control in fundraising and branding. Many observers found it \"awkward but real,\" while others jokingly called it a \"VC infighting soap opera.\" This public confrontation occurred shortly after Dragonfly recently completed its $650 million fourth fund, a sensitive timing that could influence public perception of the company's history and internal stability. Dragonfly founder Feng Bo and his partners speak out in support of Haseeb. Outsiders can only speculate; only Dragonfly insiders know who the true hero of Dragonfly is. Unsurprisingly, Dragonfly's real boss, Feng Bo, and a former employee have spoken out, but they have both chosen to side with Haseeb. Former Dragonfly research partner Ivan Bogatyy: Haseeb is to Dragonfly what Musk is to Tesla. I was Dragonfly's first research partner, and I worked with Feng Bo, Alex, and Haseeb from the company's early days, so I wanted to say a few words. Haseeb is to Dragonfly what Musk is to Tesla; he is absolutely qualified to tell the story of how he built Dragonfly from scratch. If Haseeb isn't a co-founder of Dragonfly, then Alex isn't either. Alex didn't join until Feng Bo had already raised $40 million. Haseeb joined later, when they had raised approximately $55 million, with the fund size set at $100 million. Both of them joined before the fund was fully raised, helping to raise capital and launch the first fund. Haseeb joined as the first technology investor and insisted on completely transforming the company into a pure venture capital firm, leading deals—previously, Dragonfly was a fund of funds company. He brought with him all the connections he'd built at Meta Stable: NEAR, Avalanche, and so on. He recruited Tom, who later became a general partner and gradually developed into the venture capital firm it is today. Less than a year later, Alex left. Ultimately, \"co-founder\" is just an honorary title, awarded to those who contribute to the company's growth. All three of them are actually managing partners; Alex and Haseeb are equal partners. They are co-founders, and Haseeb has grown the company to its current size, which he absolutely deserves to celebrate, but Alex has reason to protest, arguing that he shouldn't be erased from the story. Feng Bo, founder and true big boss of Dragonfly: Haseeb is undoubtedly the leader and core figure of Dragonfly. Ivan is right. I don't tweet much, but I wanted to clarify something. When I first founded Dragonfly, it was a fund of funds, and through that, I met many talented venture capitalists. Of all these people, Haseeb was undoubtedly the brightest star, so I invited him to join us in founding our venture capital firm. Over the years, we've weathered three or four bull and bear market cycles, gradually becoming the first global venture capital firm focused solely on the cryptocurrency space. It's been a rewarding journey, filled with both the crazy and dramatic moments. Having worked in venture capital for many years, the partnership I've built with Haseeb is one of the best in my 30-year experience. In our collaboration, I focus on centralized finance (CeFi) and global exchange businesses, Dragonfly Investment Partner Tom Schmidt is one of the best DeFi and consumer investors of his generation, Dragonfly General Partner Rob Hadick has been one of the most active and influential stablecoin and fintech investors in the industry, and Haseeb is undoubtedly our leader and core figure. Founding our venture capital firm with Haseeb has been a very meaningful journey, and I look forward to working with him for many years to come.</div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/c238206ac152cc33891903568f8f71b7.jpg",
            "link": "https://www.coinlive.com/news/the-debate-is-over-haseeb-is-to-dragonfly-what-musk",
            "pub_date": "2026-02-27 16:50:04",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 250480,
            "title": "Wall Street begins buying altcoins",
            "description": "<div class=\"share___SVvtl\"><div><p style=\"text-align: left;\">Author: thedefinvestor Translator: Shan Ouba, Jinse Finance</p><p style=\"text-align: left;\">Leaving aside price movements, some very noteworthy changes are currently taking place in the crypto market.</p> Some of the world's top asset management firms have begun buying DeFi tokens this month: BlackRock purchased an undisclosed number of UNI tokens after launching its tokenized fund BUIDL on Uniswap. Apollo Global Management announced it will acquire up to 90 million MORPHO tokens (worth approximately $170 million) over the next 48 months. Citadel Securities and Ark Capital have invested in LayerZero's ZRO tokens. This marks the first time several large traditional financial institutions have included DeFi tokens in their portfolios. In addition, several weeks ago, Jupiter received a $35 million JUP investment from ParaFi Capital at spot prices. This was unheard of a few years ago. The reality is that in the past, most venture capitalists bought tokens at huge off-exchange discounts and sold them immediately after unlocking. But now, some institutions/venture capitalists are willing to buy DeFi tokens directly at market prices, which is a very positive long-term signal. Why is all this important? The buying of altcoins by top global institutions could put significant buying pressure on some high-quality altcoins, just as Bitcoin experienced in the past two years. More importantly, this could legitimize the entire industry and potentially persuade a large number of retail investors who were previously skeptical of altcoins to enter the market. Coupled with the recent buyback mechanisms launched by most mainstream dApps, this may be the condition needed for altcoins to make a strong comeback in the next cycle. I know that most people have completely lost faith in altcoins, which is often understandable. Frankly speaking, the tokens of the vast majority of projects in this field will never reach new all-time highs again. But at the same time, I firmly believe that projects with strong fundamentals may still experience huge gains in the next bull market, allowing us to witness a true \"altcoin season\" again. It was precisely because of institutional investment that Bitcoin rose from $16,000 to $124,000 in this round. Altcoins, on the other hand, require much less buying power to pump their price. What can we expect next? What are my plans? I believe what we're seeing now is just the beginning. BlackRock, which recently bought UNI, has historically been a trendsetter. Its actions often sway the entire financial industry. I expect more institutions to announce altcoin purchases in the coming months. That said, I don't think it's necessary to rush into buying altcoins now. Even with institutional inflows, altcoins are unlikely to perform well until Bitcoin hits the bottom of this cycle. Historically, Bitcoin bottoms typically occur a year after the cycle peak, around October. Considering the current macroeconomic environment, I wouldn't be surprised if history repeats itself and Bitcoin bottoms out in late Q3/early Q4 of 2026. Historically, March 2026 could be a good month for the crypto market, but even if a rebound occurs, I believe it will only last a few weeks. Based on the above assessment, my current plan is to significantly increase my allocation to altcoins and Bitcoin starting at the end of Q3 2026. Before that, I will only engage in dollar-cost averaging (DCA) when Bitcoin reaches key support levels. Which altcoins do I plan to buy? There's still plenty of time until Q3, but I'm mainly focusing on the following criteria: Low P/E ratio: Fully diluted token valuation / annual revenue (below 15x is excellent) High circulating supply, low inflation release A buyback mechanism or other design that brings real value to the token The team is still developing rapidly even in a bear market True product-market fit: The product is used because it's high-quality, not just for mining tokens Frankly, there aren't many projects that meet these criteria, but they are the most likely to attract institutional investors. The projects I'm currently watching include: Fluid, Jupiter, AAVE, Pendle, Hyperliquid, Lighter, EtherFi, and Sky. I may publicly disclose specific purchase plans closer to Q3. This cycle has already shown how institutions are legitimizing Bitcoin. Now, they are starting to legitimize altcoins by investing real money. As the crypto market enters an era dominated by institutions, I believe that large institutional buying of altcoins will be a significant catalyst for the next bull market. The bear market may not be over yet, but I have no doubt that a new bull market will eventually arrive. Please ensure you are prepared to position yourself.</div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/2e142987a670788eadb7610f7983b281.jpg",
            "link": "https://www.coinlive.com/news/wall-street-begins-buying-altcoins",
            "pub_date": "2026-02-27 16:08:34",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 250469,
            "title": "From the Terra crash to the Indian ban, what did Jane Street do?",
            "description": "<div class=\"share___SVvtl\"><div><p>Deng Tong, Jinse Finance</p><p>On February 23, 2026, Terraform sued Jane Street for alleged insider trading. The lawsuit alleges that Jane Street used insider information to withdraw funds before Terraform's collapse. The lawsuit also alleges that a Jane Street employee created a secret group chat to leak information. Jane Street called the lawsuit \"a desperate gamble\" and \"a blatant attempt to make money.\"</p><p>Why did Terraform and India sue Jane Street? Did Jane Street orchestrate the 10 AM crash? What was Jane Street's profit-making logic? Did Jane Street trigger the bear market?</p><h2>I. Did Jane Street cause the Terra Luna collapse?</h2><p>The lawsuit was filed by Todd Snyder, the administrator in charge of Terraform's bankruptcy liquidation plan. The defendants include Jane Street Group, Jane Street Capital, co-founder Robert Granieri, and two employees: Bryce Pratt and Michael Huang. The lawsuit documents describe a channel that allowed material non-public information to be passed directly from the Terraform team to Jane Street's trading department.</p> According to the indictment, Pratt interned at Terraform Labs in the summer of 2021 and joined Jane Street in September of the same year. By February 2022, he had created a group chat called “Bryce’s Secret,” which included a Terraform software engineer and members of the Terraform business development team. A chat log cited in the indictment shows the Terraform engineer writing, “Bro, we all know who the buyer is. It’s where you work… Jane Street.” When asked whether Jane Street’s handling of this information was legal, Pratt allegedly responded, “Everything. Maybe. If Jump can do something legally, we probably can too.” The core allegation in the complaint concerns May 7, 2022. On that day, Terraform withdrew 150 million UST from the decentralized exchange Curve3pool as part of an unannounced liquidity migration plan. Within 10 minutes, a wallet associated with Jane Street withdrew 85 million UST from the same pool, the largest single transaction ever processed on the platform. These two withdrawals caused UST liquidity instability. Within a week, the Terra Luna ecosystem collapsed, wiping out approximately $40 billion in market value, and Terraform also crashed. However, the market generally believes that UST's algorithmic stabilization mechanism itself has structural vulnerabilities, and whether a single liquidity fluctuation was sufficient to cause a systemic collapse remains controversial. According to the lawsuit, this transaction \"could not have been completed without insider information.\" Jane Street responded that the losses were caused by \"billions of dollars in fraud perpetrated by Terraform Labs management.\" Terraform founder Do Kwon was sentenced to 15 years in prison in December 2025 for wire fraud and conspiracy. Another $4 billion lawsuit filed in December of the same year accused Jump Trading of participating in a secret transaction: buying Luna at $0.40, while the market price at the time was $110. The indictment has been heavily redacted. Specific profit data, internal communication records, and details of Jane Street's trading strategies have been sealed. The case contains 13 charges involving insider trading, securities fraud, violation of the Commodity Exchange Act, unjust enrichment, and breach of confidentiality. II. Why did India ban Jane Street? In early July 2025, the Securities and Exchange Commission of India (SEBI) issued a temporary injunction against four Jane Street entities (JSI Investments, JSI2 Investments, Jane Street Singapore, and Jane Street Asia Trading), prohibiting them from entering the Indian securities market. This 105-page injunction alleges that Jane Street manipulated the BANKNIFTY and NIFTY 50 indices on 18 derivative expiry dates between January 2023 and March 2025. SEBI calculated that its illegal profits totaled 365.02 billion rupees, approximately $4.3 billion. The regulator described a two-stage strategy known as the \"expiration date trap.\" During the morning trading session, Jane Street's firms would aggressively buy index stocks and futures, typically accounting for over 20% of individual stock market trading volume, thus driving up the index. In the afternoon, they would reverse course, selling their positions, causing the index to fall. The short option positions established in the morning would profit as the index declined. On January 17, 2024, they profited 7.35 billion rupees. The Securities and Exchange Commission of India (SEBI) described these trades as “violent, large, and aggressive,” creating a “false or misleading illusion of market activity.” In February 2025, the National Stock Exchange of India (NSE) issued a written warning to Jane Street, demanding it cease such activities. Despite receiving the warning, the company continued the same trading. The SEBI called this behavior “serious and a blatant disregard/defeat of explicit warnings.” Jane Street dismissed the SEBI's investigation, calling it “biased” and “pre-set.” The company appealed to the Securities and Exchange Commission of India. The hearing was postponed on February 25, 2026, the same week Terraform filed a lawsuit in New York. SEBI seized 48.4357 billion rupees (approximately $566 million) in alleged illicit proceeds. <h2>III. Did Jane Street orchestrate the 10 AM crash?</h2><p>Several market observers, including prominent cryptocurrency figure Justin Bechler, believe that Jane Street's holdings in the BlackRock iShares Bitcoin Trust ETF (IBIT) may have concealed its net short Bitcoin position through undisclosed hedging operations. Bechler points out that Jane Street manipulated Bitcoin prices by algorithmically coordinating Bitcoin sell-offs daily at 10 AM Eastern Time.</p><p>Recent 13-F filings show that as of the fourth quarter of 2025, Jane Street held approximately $790 million worth of IBIT stock.</p><p> Jan Happel and Yann Allemann, co-founders of blockchain analytics firm Glassnode, also documented these patterns through their shared X account, Negentropic, stating, \"The 10 AM Bitcoin crash miraculously disappeared after the Jane Street lawsuit went public.\" Onchain analyst Nonzee posted a Bitcoin hourly chart on Wednesday, claiming that Jane Street had been \"manipulating\" the market during that period for months. Cryptocurrency market watchdog Whale Factor claimed that Bitcoin experienced a sustained 2% to 3% daily drop within minutes of the US market opening and accused programmatic manipulation of the issue since early November. “Many traders believe that Jane Street’s massive position of over $2.5 billion in BlackRock IBIT may be the main driver: artificially manipulating liquidity to buy the spot ETF at a discount.” Macro analyst Alex Krüger disagrees with this claim, sharing blockchain data showing that Bitcoin has accumulated a 0.9% return in the 10:00-10:30 AM window since January 1st, and claims this is not a “systemic sell-off.” “Everyone says Bitcoin crashes every day at 10:00 AM. I looked at the data and found that’s not the case.” The “10:00 AM crash” theory is a widely used risk asset repricing mechanism that is closely correlated with the price performance of the Nasdaq stock index. IV. Jane Street’s Profit-Making Logic: Privileged Status The Terraform case alleges that the defendants used insider information to trade, while the Securities and Exchange Commission of India (SEBI) order describes market manipulation through trading patterns. Both cases reveal a similar structural logic: leveraging privileged positions to influence the market and then profiting from derivatives trading. According to allegations by the Securities and Exchange Commission of India (SEBI), Jane Street profited from short option positions in India by manipulating index stock prices. In the cryptocurrency space, complaints allege that Jane Street used insider information about Terraform liquidity withdrawals to close positions before the crash. At the heart of both cases, the allegations are that Jane Street possessed informational or channel advantages that ordinary market participants lacked. V. Did Jane Street Trigger the Bear Market? Jane Street Triggers the Bear Market Posts circulating on forums claim that Bitcoin rose by approximately 10% in two days, coinciding with the disappearance of the so-called intraday selling pattern, suggesting that the legal action against Jane Street altered market behavior. <br/></p><p><img alt=\"XXSH3fhan8novqtPK1hb9HnpnqG2YEATLA5R3yOI.png\" src=\"https://img.jinse.com.cn/7436147_watermarknone.png\" title=\"7436147\"/></p><h3>Jane Street Did Not Trigger the Bear Market</h3><ul class=\"list-paddingleft-2\" style=\"list-style-type: disc;\"><li><p>AllianceDAO co-founder @QwQiao posted: People have spent months looking for scapegoats for the Bitcoin bear market (such as Jane Street, Quantum, software sell-offs, etc.), but ultimately, as an asset without a cash flow anchor, the main driver of Bitcoin's price movement is simply \"technical analysis (TA),\" which is essentially psychology. More people believe in the four-year cycle than the five-year cycle. Once a trend breaks, people start taking profits or cutting losses. Most other explanations seem more correlated than causal. Now, we just need to patiently wait for the mass psychology to completely capitulate (which may have already happened) and for the trend to reverse, which doesn't necessarily need a catalyst. <br/></p></li><li><p>Yale ReiSoleil, CTO of Ethereum financial infrastructure company Untrading: \"No company sits in front of a terminal and presses the 'sell Bitcoin' button. But Bitcoin's very structure—the ETF structure, AP exemption, the shift to physical creation—creates a gray area where price discovery can be suppressed without anyone breaking the rules.\"</p></li><li><p>Nick Puckrin, co-founder and chief market analyst of education platform Coin Bureau: \"Whether there is market manipulation or not, Bitcoin's price is not driven by just one company, no matter how influential that company is. It's not a meme. Understandably, investors who are confident in Bitcoin will look for scapegoats when the market crashes. But the reality of Bitcoin market dynamics is much more complex.\" Puckrin believes that Bitcoin's recent weakness is best explained by geopolitical uncertainty, global liquidity conditions, and competition for investor attention from the rapidly growing artificial intelligence industry.</p></li><li><p>Bitcoin futures trader @traderamericano believes: All this noise makes it seem like Jane Street is the only market maker.</p></li> They're not the only trading firm. I can accept insider trading... but to put all the blame for Bitcoin's decline on them... is going too far. <br/></ul><h2>Conclusion</h2><p>Jane Street is currently in the eye of the storm.</p><p>Currently, regulators and courts have not found Jane Street responsible for any major cryptocurrency crashes. The Terraform case may clarify whether Jane Street's trading activities crossed legal boundaries or reflected standard market-making practices. This outcome may also influence how the judiciary interprets insider information in decentralized markets.</p><p>Both lawsuits and injunctions raise the same question: when a quantitative giant with technological, financial, and informational advantages is deeply embedded in the market structure, is its highly structured profit model what modern finance should look like?</p></div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/7b5fd52acab655a72eed051528d1fe95.jpg",
            "link": "https://www.coinlive.com/news/from-the-terra-crash-to-the-indian-ban-what-did",
            "pub_date": "2026-02-27 15:16:20",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 250450,
            "title": "When Block laid off half the company, there were no bad guys in the AI ​​unemployment wave.",
            "description": "<div class=\"share___SVvtl\"><div><p style=\"text-align: left;\"><span style=\"font-size: 16px;\">Author: Yellow Lobster, Deep Tide TechFlow</span><span leaf=\"\" style=\"\"> </span></p><p style=\"text-align: left;\"><span leaf=\"\">On February 22nd, an article titled \"The 2028 Global Intelligent Crisis\" went viral in the financial world. The author, Citrini Research, a macro research firm, presented the article as a \"memorandum from the future,\" setting the timeline to June 2028 and reviewing how this AI-triggered economic crisis gradually evolved into a systemic collapse.</span></p><p style=\"text-align: left;\"><span leaf=\"\">One ​​sentence in the article stated, \"In early 2026, the first wave of layoffs triggered by the replacement of human intelligence began. Profits expanded, earnings exceeded expectations, and stock prices hit record highs.\"</span></p><p style=\"text-align: left;\"><span leaf=\"\">Four days later, this statement was no longer a thought experiment.</span></p> On February 26th, Jack Dorsey posted on X: \"we're making @blocks smaller today.\" Block, the fintech company that owns Square and Cash App, released its fourth-quarter earnings report that day. Gross profit increased by 24% year-over-year, and earnings per share exceeded analysts' expectations. At the same time, Dorsey announced layoffs of over 4,000 employees, representing 46% of the company's total workforce. Following the announcement, Block's stock price rose 24% in after-hours trading. The company's performance increased by 24%, the stock price increased by 24%, and then 4,000 people received resignation notices. Citrini's \"2028 nightmare\" didn't even reach 2028; it began its first act this Thursday. <p style=\"text-align:center\"><span leaf=\"\"><img alt=\"Bec2pbXoM0LbaTOqqsSw9kRm6P21437EBvjK7aGC.jpeg\" src=\"https://img.jinse.com.cn/7436139_image3.png\" title=\"7436139\"/></span></p><h2 style=\"text-align: left;\"><strong><span leaf=\"\">We are not in trouble</span></strong></h2><p style=\"text-align: left;\"><span leaf=\"\">In history, every large-scale layoff has been accompanied by a set formula in the CEO's open letter:</span><strong><span leaf=\"\"><span text=\"\">The market environment is severe, and we have made a difficult decision due to adjustments in our strategic direction. We thank every colleague for their contributions.</span></span></strong></p><p style=\"text-align: left;\"><span leaf=\"\"> Dorsey's letter is different. \"We're not in trouble. Our business is strong… but something has changed. We've seen internally that smaller teams are doing more and better, working with the smart tools we're building and using. And the capabilities of these tools are compounding every week.\" There's no mention of a market downturn; the company is doing great, but you don't need them anymore. This candor is unsettling. Past layoff narratives always included an implicit promise: we'll rehire once the market improves. This time, Dorsey didn't even make that promise. He offered a different logic: A small team plus AI can do the same things as a large team, or even better. If that's the case, why are so many people needed? Investors completely agreed with this logic, voting with a 24% increase in the stock price. There's another detail that might have been overlooked. To promote an \"AI-first\" work culture, Dorsey previously required every employee in the company to send him a weekly email listing five recently completed tasks. Thousands of emails flooded in, and Dorsey's approach was to use AI to summarize them and then read the summaries. Using AI to determine who can prove they won't be replaced by AI, and letting AI analyze who will be laid off—this detail is the most precise metaphor in the whole story. A timeline, an acceleration. Block isn't an isolated case; it's a trend that has been running for two years. Looking back, the acceleration of this trajectory is dazzling. In 2024, Klarna CEO Sebastian Siemiatkowski announced that the company's AI customer service assistant handled the equivalent of 700 full-time employees' workload. At the time, most people saw it as a tech show; the CEO needed headline-grabbing numbers and a story to convince investors. In April 2025, an internal memo from Shopify CEO Tobi Lütke was leaked. One sentence in the memo, which has since been repeatedly quoted, stated: \"Before requesting additional staff, the team must first prove that AI cannot do this.\" That same year, Duolingo announced its \"AI-first\" strategy, terminating a large number of content creation outsourcing contracts. IBM admitted to replacing 8,000 HR positions with AI; CEO Arvind Krishna, in an interview, made no attempt to conceal this, directly naming the department and the number of people involved. Salesforce laid off 4,000 customer support positions, with CEO Marc Benioff stating, \"AI can now handle about half of the company's work.\" By the end of 2025, data from Challenger, Gray &amp; Christmas, a US employment tracking agency, showed that over 55,000 jobs were directly attributable to AI. At the beginning of 2026, Amazon announced two rounds of layoffs totaling approximately 30,000 corporate jobs. Law firm Baker McKenzie followed suit, laying off 600 to 1,000 research, marketing, and administrative support positions—an industry widely considered one of the most difficult for AI to penetrate. On February 26, 2026, in Block, a profitable company laid off 46% of its employees in one go. But layoffs are just the most visible weapon. A Harvard University study reveals a more insidious statistic: With the widespread adoption of AI, tech companies are hiring an average of five fewer junior employees per quarter. Without announcements or press releases, positions quietly disappear from job postings, and resumes submitted by recent graduates vanish without a trace; the reasons are never stated in rejection letters. Let's return to that viral article. Citrini's projections are unsettling not only because they depict a dystopian scenario of AI sweeping the job market, but also because they depict a logically consistent, perfectly rational death spiral. The spiral works like this: AI expands company profits. Funds from profit expansion were reinvested in AI, leading to even stronger AI capabilities. Stronger AI capabilities made more jobs replaceable. More unemployment meant less consumption. Shrinking consumption put pressure on more companies, forcing them to further reduce costs using AI. AI's capabilities advanced another step. Citrini named this cycle the Intelligence Displacement Spiral. They wrote in their article, \"Individual decisions by each company are rational, but the collective result is disastrous.\" Now, let's look at what happened on Block. Gross profit rose 24%, stock price rose 24%, 4,000 people lost their jobs, and the money saved was reinvested in AI tools. From Dorsey's perspective, this was a completely rational decision. He even explained in an open letter why he chose a one-time large-scale layoff instead of multiple rounds of gradual reductions: because that would continuously damage morale and trust. From a corporate governance perspective, this is textbook-level execution. From the perspective of those 4,000 people, this is a disruption to their lives. In Citrini's deduction, there is a real person (presented anonymously): a friend who was a senior product manager at Salesforce, earning $180,000 a year, lost his job in the third round of layoffs in 2025. After searching for six months, he couldn't find a position at the same level. Finally, he started driving for Uber, and his annual income dropped to $45,000. This isn't just one person's story. Citrini, in her article, makes a simple multiplication: multiply this individual's trajectory by the hundreds of thousands of white-collar workers in major cities experiencing similar fates, and the decline in consumption ceases to be abstract macro data, but a predictable and calculable reality. This story is unfolding globally, perhaps even around us. Citrini's article states: \"The historical disruption model posits that existing companies resist new technologies, ultimately allowing agile new entrants to erode their market share and lead to their demise. Kodak, Blockbuster, and BlackBerry are examples of this. However, the situation in 2026 is entirely different; existing companies are not resisting because they cannot afford the cost of resistance.\" This is the key to understanding the entire situation. Klarna was impacted by AI, and then used AI to cut costs, laying off a number of employees. Salesforce's software products were challenged by AI, and then AI replaced 4,000 customer service jobs. Block was hit by the AI ​​wave in the fintech industry, and then announced that it would restructure its entire organization with AI, laying off nearly half of its employees. These companies were not victims defeated by AI. They were the most active adopters of AI, and what was defeated were their own employees. This is the part that is hardest to deal with within a moral framework. After the 2008 financial crisis, people knew who to hate. Wall Street bankers, traders who packaged and sold junk bonds, and officials who failed to regulate. Anger had specific targets, even addresses, hence the Occupy Wall Street movement. This time is different. It's hard to say Dorsey did anything wrong. Block's stock price tells you what the market thinks. The 4,000 laid-off employees didn't do anything wrong either; they just happened to be working in roles that were being restructured. AI itself is certainly not a bad guy; it's just a tool that's becoming increasingly useful at a speed humans have never seen before. Responsibility permeates the entire system, like salt dissolving in water. You can taste the saltiness, but you can't find the grain of salt. Two sentences in Citrini's article, though not widely quoted, are perhaps the most profound: \"For the first time in history, the most productive assets in the economy have created fewer, not more, jobs. No framework applies, because none of them were designed for a world where scarce factors of production have become abundant.\" After every technological revolution, humanity has found a new place. The steam engine replaced hand-weaving workers but created railway workers, factory managers, and urban planners. The internet eliminated travel agencies, physical record stores, and classified ads but invented product managers, data analysts, and content creators. Each time, those \"jobs of the future\" were initially indescribable, but they later emerged, and in enough numbers. This comforting rule has encountered a challenger for the first time. Because this time, AI itself is learning to do those \"future jobs,\" such as AI trainers, AI prompt engineers, and AI product managers. The workers being replaced cannot simply \"upgrade their skills\" to AI-related positions because those positions themselves are being reduced. Harvard researchers have documented a phenomenon: After the widespread adoption of AI, entry-level job hiring at tech companies has decreased by more than 50%. This isn't because these positions have disappeared, but because they were never created in the first place. An entire generation is trained to enter an industry, and then, just as they're about to graduate, that industry quietly decides it no longer needs entry-level humans. We can't pretend we have time to figure things out. Citrini concludes by saying the canary is still alive, but the miner's problem is never whether the canary is dead or alive, but whether you have an exit when it starts to wobble.</span></p></div></div>",
            "image": "https://img.jinse.com.cn/7436137_small.png",
            "link": "https://www.coinlive.com/news/when-block-laid-off-half-the-company-there-were-no",
            "pub_date": "2026-02-27 13:55:04",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 250437,
            "title": "Wintermute: Retail Trading of Cryptocurrencies and Stocks",
            "description": "<div class=\"share___SVvtl\"><div><p style=\"text-align: left;\">Author: Jasper De Maere, OTC Trader at Wintermute; Translator: Shaw, Jinse Finance</p><p style=\"text-align: left;\"><strong>Retail activity influences the cryptocurrency market.</strong> Through speculation, buying on dips, and flexible fund rotation in the token space, retail investors dominate every major cycle. <strong>Recent data shows that the relationship between retail investors and cryptocurrencies is changing.</strong></p><p style=\"text-align: left;\">We have noticed that retail investors' attention has shifted from altcoins to the stock market for some time now. New data from JPMorgan Strategy, combined with our proprietary flow data, now shows that stocks and cryptocurrencies are emerging as alternative risk assets.</p><h2 style=\"text-align: left;\">The Reversal of Relationship</h2><p style=\"text-align: left;\">By overlaying Wintermute's proprietary cryptocurrency retail flow data with JPMorgan's retail equity inflow data, we can observe the relationship between retail stock and cryptocurrency trading activity from a new perspective.</p> Historically, until the end of 2024, the two markets moved largely in tandem. At that time, heightened risk appetite led investors to buy both stocks and cryptocurrencies, as both served to some extent to release excess capital (such as broad money supply M2) and alleviate risk aversion. However, since the end of 2024, this relationship has broken down, and the two markets are now diverging at their greatest extent ever, with retail investors flooding into the stock market at a record pace while remaining on the sidelines regarding the cryptocurrency market. <p style=\"text-align:center\"><img alt=\"is8TrD40w2PsAqtGzZYi0oOk3KxA3M10xIkwleXq.jpeg\" src=\"https://img.jinse.com.cn/7436114_watermarknone.png\" title=\"7436114\"/></p><p style=\"text-align: left;\">When we broaden our perspective, we use altcoin market capitalization as a long-term measure of retail investor cryptocurrency activity. It is closely correlated with our retail fund flow data and has a longer-term, more objective historical data. From 2022 to the end of 2024, cryptocurrencies and stocks moved roughly in tandem, both considered a collection of high-risk investments by retail investors. This decoupling was particularly pronounced at the end of 2024, with retail activity becoming more driven by short-term factors, more volatile, and less structured.</p> ... The rolling correlation between retail activity and altcoin market capitalization confirms this shift. The previously volatile but generally positive correlation has turned negative. Retail investors are now allocating between the two, rather than investing in both simultaneously. <p style=\"text-align:center\"><img alt=\"juvjRyEZVFSKgdqduSqG1Kav0BGYAjXLnRjxFpMz.jpeg\" src=\"https://img.jinse.com.cn/7436116_watermarknone.png\" title=\"7436116\"/></p><p style=\"text-align: left;\"><strong>Broadening the perspective to 2025 and combining it with key driving factors can make market dynamics clearer.</strong> The following points are particularly noteworthy:</p><ul class=\"list-paddingleft-2\" style=\"list-style-type: disc;\"><li><p style=\"text-align: left;\">When stock market activity stagnates and retail investors turn to other speculative areas, <strong>Meme coin and AI agents have a golden opportunity for development.</strong> Retail investors have been actively buying stocks on dips, both before and after the April 2025 tariff announcement and more recently. Since October 10th, funds have almost entirely shifted to the stock market, and this trend continues. It's worth noting that we believe the scale of retail trading activity in cryptocurrencies is not yet sufficient to draw funds away from the stock market. Our view is that increased retail trading activity in the stock market is draining funds from the cryptocurrency market. This new data also confirms this. Retail trading activity in the stock market is a new factor that cryptocurrency investors should closely monitor to capitalize on opportunities when cryptocurrencies can generate more sustained buying interest from retail investors. </p><p style=\"text-align:center\"><img alt=\"q3mq4nDSPn2sZw028NTbiIczWWweh4yoxq3TZ1WY.jpeg\" src=\"https://img.jinse.com.cn/7436117_watermarknone.png\" title=\"7436117\"/></p><h2 style=\"text-align: left;\">Volatility is a Selling Point</h2><p style=\"text-align: left;\"><strong>While there are many reasons, one of the reasons why retail investors are so active in the cryptocurrency market and attracted to it is the asset's volatility.</strong> Volatility itself is a selling point of cryptocurrencies and a fundamental reason that attracts retail investors to the cryptocurrency space. Although the actual volatility of cryptocurrencies still far exceeds that of the stock market, its actual volatility has been declining, and this trend is unlikely to reverse. The Bitcoin/Nasdaq volatility ratio (BTC/NDX) has continued to decline, even compressing to below 2x in the first half of 2025. Thoughts on some key driving factors: The market is maturing. With the increasing number of sophisticated investors and the emergence of new liquidity instruments such as ETFs and DATs, the sharp fluctuations commonly seen in previous cycles have diminished. Market Size. Even with a market capitalization of only $2.3 trillion, down 40% from its all-time high, the amount of capital required to shake the market is far greater than it was five years ago. As volatility narrows, the core selling point of cryptocurrencies for retail investors is also weakening. The massive swings that once defined the 2021-2022 cycle and attracted a generation of retail investors are no longer present. For retail investors chasing volatility, stocks are becoming increasingly attractive. Technology Drivers. Beyond the market structure unique to cryptocurrencies, technology drivers are accelerating this shift, a point that hasn't received enough discussion. Cryptocurrency Access—The integration of cryptocurrency trading into fintech and traditional brokerage platforms (or the integration of stock trading into cryptocurrency-native platforms) lowers the barriers to entry, but its more significant impact lies in exit mechanisms. In the past, cumbersome entry processes made it difficult to transfer funds once invested in the cryptocurrency market, leading to a natural circulation of funds between different tokens. Now, these convenient inflow/outflow channels allow funds to flow easily between cryptocurrencies and stocks with virtually no obstacles. Advantages—Retail investors seem increasingly inclined towards stocks, partly due to the new sense of superiority brought by artificial intelligence. Large Language Models (LLMs) significantly enhance the analytical capabilities of retail investors, creating a level playing field. This sense of superiority doesn't exist in the cryptocurrency space. While cryptocurrencies can be analyzed based on data, the lack of a consensus valuation framework and token value accumulation, coupled with the ever-expanding scope of investment, makes it difficult for retail investors to gain that sense of advantage. Conclusion: Retail investors were once the most reliable source of reflexive demand for cryptocurrencies, but today they increasingly seek risk appetite in other areas. The stock market offers increasing volatility, is more competitive, has a growing analytical advantage, and retail investors can easily switch from cryptocurrencies to stocks using their existing applications. Cryptocurrencies still hold a place in retail portfolios, but they are now just one of many investment tools, not the primary speculative instrument. This shift should also affect how investors view the market. Some previously effective indicators have become ineffective. For cryptocurrency investors, simply finding leading indicators of risk appetite and combining them with the native framework of cryptocurrencies is no longer sufficient to achieve success. Investors increasingly need to view cryptocurrencies from a multi-asset portfolio perspective, just as they would with stocks and fixed-income products—this has become standard practice.</p></li></ul></div></div>",
            "image": "https://img.jinse.com.cn/jinse_1772166849608273081_small.png",
            "link": "https://www.coinlive.com/news/wintermute-retail-trading-of-cryptocurrencies-and-stocks",
            "pub_date": "2026-02-27 12:37:01",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 250432,
            "title": "MrBeast Video Editor Suspended By Beast Industries After Near-Perfect Trades Flagged By Kalshi",
            "description": "<div class=\"share___SVvtl\"><div><h2>Video Editor Sidelined As Beast Industries Probes Trading Claims</h2><p>A video editor for the global YouTube sensation MrBeast has been suspended from his role following allegations of insider trading on the prediction platform Kalshi.</p><p></p><p>The fallout began when Kalshi identified \"near-perfect\" trading patterns from an account linked to Artem Kaptur, an editor for the channel.</p><p></p><p>The platform determined that Kaptur likely leveraged his access to unreleased video content to place successful wagers on specific outcomes within MrBeast’s high-stakes challenges.</p><p></p><div class=\"media-wrap embed-wrap\"><div><blockquote align=\"center\" class=\"twitter-tweet\" data-dnt=\"true\"><p dir=\"ltr\" lang=\"en\">🚨 BREAKING: Kalshi bans a MrBeast video editor for 2 years over insider betting.<br/><br/>Artem Kaptur allegedly used confidential information about upcoming YouTube videos to place trades before the details were public.<br/><br/>He must also pay over $20,000 in fines.<br/><br/>Prediction markets are… <a href=\"https://t.co/oDwXdIKm7P\">pic.twitter.com/oDwXdIKm7P</a></p>— Satoshi Talks (@Satoshi_Talks) <a href=\"https://twitter.com/Satoshi_Talks/status/2026703999232102738?ref_src=twsrc%5Etfw\">February 25, 2026</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p></p><p>Beast Industries CEO Jeff Housenbold confirmed the internal suspension during an appearance on CNBC’s “Squawk Box,” noting that the company is taking a proactive stance against the risks emerging from prediction markets.</p><p></p><p>The firm has initiated an independent investigation to protect the integrity of its content.</p><p></p><p>This move follows a period where the company had already established clear internal policies.</p><p></p><p>Housenbold made it clear that the rule applies regardless of legal ambiguities, stating,</p><p></p><blockquote>“We don’t want anyone to trade on information.”</blockquote><p></p><h2>How Did Kalshi Detect The Anomalous Wins</h2><p>Kalshi’s surveillance systems flagged Kaptur’s activity after noticing wins that were described as \"statistically anomalous.\"</p><p></p><p>The editor reportedly wagered a total of $4,000 on markets specifically related to MrBeast’s videos, such as viewership numbers and video lengths.</p><p></p><p>Following a review by its disciplinary committee, Kalshi issued Kaptur a fine of $15,000 and ordered the return of $5,397.58 in profits.</p><p></p><p>Additionally, he has been banned from the platform for two years.</p><p></p><div class=\"media-wrap embed-wrap\"><div><blockquote align=\"center\" class=\"twitter-tweet\" data-dnt=\"true\"><p dir=\"ltr\" lang=\"en\">KALSHI ALERT<br/><br/>&gt; MrBeast’s video editor Artem Kaptur bet on upcoming video markets stuff<br/><br/>&gt; He traded around $4k<br/>won almost every low odds bet<br/>made $5,397 profit<br/><br/>FINED<br/><br/>&gt; $20,397 total fine (profit returned + penalty)<br/>&gt; 2 year ban<br/><br/>Another case:<br/><br/>- former california governor… <a href=\"https://t.co/7ghvZ5HESa\">https://t.co/7ghvZ5HESa</a></p>— Solguru (@SolguruNFT) <a href=\"https://twitter.com/SolguruNFT/status/2026721618593198177?ref_src=twsrc%5Etfw\">February 25, 2026</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p></p><p>Bobby DeNault, who leads enforcement at Kalshi, addressed the situation publicly, stating, </p><p></p><blockquote>“No financial exchange is immune from bad actors. Not stock exchanges, not banks, not prediction markets.”</blockquote><p></p><p>While Kaptur allegedly admitted his actions were “stupid, shortsighted, and a violation of the trust that was placed in me” in a since-deleted social media post, he also argued that the penalties were heavy-handed for a “small bet” in a sector where rules are still being defined.</p><p></p><p>He claimed the experience of being made an example of was \"deeply disorienting.\"</p><p></p><h2>Why Is A California Candidate Also Facing Penalties</h2><p>Kaptur was not the only individual caught in Kalshi’s recent enforcement sweep.</p><p></p><p>Kyle Langford, a former candidate for the governorship of California, was also sanctioned for betting on his own election.</p><p></p><p>Langford had openly promoted his wagers on social media, posting, </p><p></p><blockquote>“I just bet $100 that I, Kyle Langford will be the next Governor of California, join me.”</blockquote><p></p><div class=\"media-wrap embed-wrap\"><div><blockquote align=\"center\" class=\"twitter-tweet\" data-dnt=\"true\"><p dir=\"ltr\" lang=\"en\">I just bet $100 💵 that I, Kyle Langford will be the next Governor of California, join me <br/>(if you believe 🙏🏻) 😎 <a href=\"https://twitter.com/Kalshi?ref_src=twsrc%5Etfw\">@Kalshi</a><br/><br/>🐻✝️🇺🇸 <a href=\"https://t.co/XMk25PuDVr\">https://t.co/XMk25PuDVr</a><a href=\"https://t.co/A67hRZb2Za\">pic.twitter.com/A67hRZb2Za</a></p>— Kyle Langford (@KyleLangfordCA) <a href=\"https://twitter.com/KyleLangfordCA/status/1926349137760362572?ref_src=twsrc%5Etfw\">May 24, 2025</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p></p><p>Kalshi’s rules strictly prohibit political candidates from trading on their own races to prevent market manipulation.</p><p></p><p>For his actions, Langford received a five-year suspension and was fined over $2,000, along with a requirement to forfeit $246.36 in profits.</p><p></p><div class=\"media-wrap embed-wrap\"><div><blockquote align=\"center\" class=\"twitter-tweet\" data-dnt=\"true\"><p dir=\"ltr\" lang=\"en\">Prediction platform Kalshi fines former candidate Kyle Langford $2,246 and imposes five-year ban for election betting violation</p>— Byul (@byul_finance) <a href=\"https://twitter.com/byul_finance/status/2026697513634508962?ref_src=twsrc%5Etfw\">February 25, 2026</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p></p><p>Kalshi clarified that while candidates should monitor market forecasts, they are forbidden from participating as traders.</p><p></p><p>The platform has reported both Kaptur and Langford to the US Commodity Futures Trading Commission (CFTC), which maintains that it has the authority to police illegal trading practices and misappropriation of confidential information across these new financial frontiers.</p><p></p><h2>Can Prediction Markets Effectively Police Themselves</h2><p>The rise of platforms like Kalshi and Polymarket has sparked a heated debate between regulators and market advocates.</p><p></p><p>While some experts believe these markets are most accurate when open to everyone, critics and lawmakers worry about the erosion of public trust.</p><p></p><p>Jeff Housenbold noted that the current landscape is “ripe for abuse,” pointing out that \"there’s so much information out there, and it’s asymmetric, and people are taking advantage of it.\"</p><p></p><p>The CFTC has taken a firm stance, with Chair Mike Selig indicating the commission will fight any state attempts to limit its regulatory reach.</p><p></p><p>However, local leaders like Utah Governor Brian Cox have pushed back, labeling these platforms as \"gambling—pure and simple.\"</p><p></p><p>As the industry grows, with hundreds of millions of dollars wagered on major events like the 2024 US presidential election, the pressure on platforms to demonstrate rigorous oversight is mounting.</p><p></p><p>Kalshi has stated it opened 200 investigations into potential rule violations over the past year, signaling a more aggressive approach to maintaining market fairness.</p><p></p><div class=\"media-wrap embed-wrap\"><div><blockquote align=\"center\" class=\"twitter-tweet\" data-dnt=\"true\"><p dir=\"ltr\" lang=\"en\">New Spark: Following over 200 insider trading investigations, Kalshi is implementing rigorous surveillance and enforcement protocols to establish itself as a regulated prediction market exchange, signaling a new era of institutional maturity and market integrity.</p>— SteadyTrader (@SteadyTraderApp) <a href=\"https://twitter.com/SteadyTraderApp/status/2027058069125947640?ref_src=twsrc%5Etfw\">February 26, 2026</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p></p></div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/be0bcba97c14896c02f269da4f2303b9.jpeg",
            "link": "https://www.coinlive.com/news/mrbeast-video-editor-suspended-by-beast-industries-after-near-perfect-trades",
            "pub_date": "2026-02-27 11:52:09",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 250414,
            "title": "Why did Bitcoin prices fall along with software stocks?",
            "description": "<div class=\"share___SVvtl\"><div><p style=\"text-align: left;\">Author: Anthony Pompliano, Founder and CEO of Professional Capital Management</p><p style=\"text-align: left;\">Over the past few weeks, investors have been most focused on the rapid sell-off in software stocks. To better understand why, I asked Silvia (our AI-driven CFO) for an explanation. Here's what she said:</p><ul class=\"list-paddingleft-2\" style=\"list-style-type: disc;\"><li><p style=\"text-align: left;\"><strong>This sell-off, dubbed the \"SaaS doomsday,\" has wiped out more than $1 trillion in market capitalization from software stocks since late January 2026.</strong> The primary driver is a sudden and intense investor concern: the emergence of artificial intelligence, particularly autonomous AI agents (such as Anthropic's Claude Cowork), is poised to disrupt the traditional SaaS business model. Investors worry that if AI tools can replace the entire software workflow—from coding to customer service to IT management—the seat-based subscription model that has underpinned SaaS valuations for a decade will be fundamentally threatened. According to USA Today and Reuters, the iShares Technology Software ETF (IGV) has fallen approximately 20% year-to-date, with major companies suffering heavy losses: Microsoft is down about 28% from its peak, Oracle is down about 55%, Salesforce is down about 30%, and Adobe is down about 27%. Adding to the woes, the sector is experiencing a massive rotation. Funds are flowing out of traditional SaaS companies and into AI infrastructure companies, value stocks, and industrial sectors. Despite largely stable fundamentals, the software sector's forward price-to-earnings ratio has compressed from approximately 39 times to 21 times, falling to a multi-year low. According to AInvest data, all software companies in the S&amp;P 500 that reported earnings beat expectations last quarter, with 80% exceeding revenue expectations. Companies like ServiceNow and AppLovin reported record earnings, but their share prices still suffered heavy losses because Wall Street's focus has shifted from current profitability to ultimate value—essentially questioning whether these established companies can survive in a world of autonomous AI agents. JPMorgan Chase called the sell-off driven by \"logical inconsistencies,\" believing the market is digesting a worst-case scenario that hasn't yet occurred. These are significant promises that short sellers rely on to support their investment logic. The sudden and significant reduction in the market capitalization of all software companies compared to just a few weeks ago is truly perplexing. </p><p style=\"text-align:center\"><img alt=\"zqUzHcsVjlq2sMnqSdwYUweDLaQaR8P6LjlWAjoS.jpeg\" src=\"https://img.jinse.com.cn/7436037_watermarknone.png\" title=\"7436037\"/></p><p style=\"text-align: left;\">Silvia then explained the crux of the debate: Is this an overreaction by investors, or a structural turning point in the market?</p> ... \"Short sellers argue that AI agents will commoditize software, squeeze profit margins, and erode the user base—some analysts at Bain and Forrester point out that CIOs are consolidating software budgets and reallocating spending to AI tools rather than expanding SaaS reach. Bulls counter that deeply embedded 'record systems' platforms (like Salesforce, ServiceNow, and Intuit) have a sticky customer base and recurring revenue that won't disappear overnight, making their current valuations potentially an attractive entry point. The truth may lie somewhere in between—AI will reshape the industry, but this indiscriminate sell-off has depressed the stock prices of many quality companies as if their businesses were already on the decline, a conclusion the data doesn't yet support.\" One question I've been pondering is the relationship between software stocks and Bitcoin. If software stocks are falling due to concerns about artificial intelligence, why is Bitcoin falling at the same time? Are investors genuinely worried that AI will impact Bitcoin's future? Silvia explains this clearly: \"In early 2026, the correlation between Bitcoin and software stocks surged to astonishing levels. As of February, Bitcoin's 30-day rolling correlation with the iShares Extended Technology Software ETF (IGV) reached 0.73, a very high figure. Bitcoin's correlation with the Nasdaq 100 also jumped from -0.68 to +0.72 in just a few weeks. Meanwhile, its correlation with gold was only 0.12. In effect, Bitcoin traded more like a high-beta software stock than a safe-haven asset.\" The mechanism driving this correlation is institutional fund flows, not fundamental overlap. Since the launch of spot Bitcoin ETFs in early 2024, Bitcoin has increasingly been included in institutional portfolios alongside growth and tech stocks. When risk aversion events occur—such as the sell-off in AI-driven software stocks triggered by the launch of Anthropic's Claude Cowork—portfolio managers broadly reduce risk, selling both software stocks and Bitcoin. At the peak of the sell-off, Bitcoin ETFs experienced average daily outflows of $272 million, with cumulative outflows from cryptocurrency products reaching $1.7 billion. This is not a phenomenon unique to cryptocurrencies—it's a broader risk aversion mechanism where funds shift from growth assets to gold, government bonds, and cash. Bitcoin, as a risk-averse asset, is also held by these institutions and is therefore affected by this countercurrent. The key nuance—and what makes this particularly tricky—lies in the negative skewness of Bitcoin's correlation with its price. Bitcoin falls much more sharply than it rises with software stocks. When IGV rises, Bitcoin's reaction is relatively muted; conversely, when IGV falls, Bitcoin tends to amplify the decline. This asymmetry exacerbates the situation—Bitcoin bears the risk of a decline in its correlation with tech stocks but fails to fully participate in their rallies. Stifel even predicts Bitcoin could fall to $38,000, pointing out that its 0.78 correlation with the Nasdaq 100 suggests that Bitcoin is now more like a leveraged bet on tech stocks than a safe-haven asset for the dollar. Clearly, the current sell-off is highly correlated. The most likely scenario for this correlation to disappear is that institutional investors no longer view Bitcoin as a growth/risk asset. As long as Bitcoin remains in the same category as software stocks in institutional portfolios and is influenced by the same macroeconomic factors (Fed policy, liquidity, risk appetite), it will continue to trade like leveraged tech stocks. To change this, a large number of marginal buyers of Bitcoin need to shift from momentum-chasing hedge funds and ETF-driven retail investors to structural, price-insensitive holders… primarily those who adhere to long-term holdings regardless of quarterly macroeconomic changes. The most likely catalyst is widespread adoption by sovereign nations. The United States has established a strategic Bitcoin reserve using seized assets, while countries like Brazil, El Salvador, and Bhutan are exploring or actively accumulating Bitcoin as a sovereign reserve. For the first time since 1996, central bank gold reserves have surpassed foreign holdings of US Treasury bonds, potentially representing a structural \"sovereign asset rotation\" from which Bitcoin could benefit if it ultimately proves to be a reliable neutral reserve asset. If major central banks (especially sovereign wealth funds) begin actively purchasing Bitcoin, this will create a large, price-insensitive demand base, absorbing selling pressure during periods of heightened risk aversion and fundamentally reducing its correlation with stocks. Gold's trajectory is largely consistent with this, and Bitcoin aspires to follow a similar path. The decoupling of Bitcoin from software stocks will be a multi-year process. This requires a gradual shift in the Bitcoin holder base from speculative/institutional investors to sovereign/structural investors, reduced volatility, and at least one crisis where Bitcoin doesn't sell off along with all other assets. The sovereign reserve trend is currently the most promising catalyst, but as long as exchange-traded fund (ETF)-driven institutional flows dominate Bitcoin's marginal pricing, it will still behave like an extension of the high-beta growth/tech sector during periods of market stress. Therefore, one way to understand Bitcoin's current correlation is that this asset is a victim of its own success. What we want is mainstream acceptance, and we have achieved that, but this mainstream acceptance (especially on Wall Street) has had side effects. The new correlation with software stocks is the most obvious example. Bitcoin is definitely fine. I expect it to continue to perform well in the future. The challenge for you as investors is to avoid getting bored. Good luck.</li></ul></div></div>",
            "image": "https://img.jinse.com.cn/jinse_1772157870385349140_small.png",
            "link": "https://www.coinlive.com/news/why-did-bitcoin-prices-fall-along-with-software-stocks",
            "pub_date": "2026-02-27 10:05:31",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        }
    ]
}