{
    "data": [
        {
            "id": 250655,
            "title": "From cooperation to a complete break: Why did Anthropic dare to challenge the Pentagon?",
            "description": "<div class=\"share___SVvtl\"><div><p>Deng Tong, Jinse Finance</p><p>On February 27th local time, US President Trump posted on social media: \"I have instructed every federal agency of the US government to immediately cease using Anthropic technology.\" Trump stated that for agencies like the Department of Defense that use Anthropic products at various levels, there will be a six-month transition period to gradually phase them out.\n\n\"Anthropic had better be sensible and cooperate during the transition period, otherwise I will use all presidential powers to force them to comply and pursue significant civil and criminal liability.\"</p><p>Why did Anthropic clash with the Pentagon? Has OpenAI become the Pentagon's new darling? Will AI become a killing tool? How do relevant people interpret this event?</p><h2>I. Why did Anthropic dare to challenge the Pentagon?</h2><p>Because the Pentagon insists that AI can be used for \"all legitimate military purposes,\" including broader automated tasks.</p><p> As the only cutting-edge AI company currently authorized to operate within the U.S. military's classified networks, Anthropic rejected the Pentagon's demand that it abandon restrictions on the use of AI (particularly prohibiting its use in unmanned autonomous weapons and large-scale domestic surveillance). Anthropic has been used by the U.S. government and military since 2024 and was the first advanced AI company to deploy its tools to government agencies engaged in classified work. Claude reportedly played a role in the January operation to arrest Venezuelan President Maduro. Anthropic published a statement from CEO Dario Amodí on its website (full text attached at the end), stating: \"Two uses have never been included in our contracts with the U.S. Department of Defense, and we believe they should not be now: large-scale domestic surveillance and fully autonomous weapons. We cannot agree to their demands against our conscience. The Department of Defense has the right to choose the contractors who best align with its vision.\" Defense Secretary Pete Hegses posted on X, denouncing Anthropic as \"arrogant,\" \"betrayal,\" and \"hypocritical,\" and listing it as a \"national security supply chain risk.\" This week, Anthropic has presented a prime example of arrogance and betrayal, serving as a cautionary tale on how to do business with the U.S. government or the Pentagon. Our position has never wavered, and never will: the U.S. Department of Defense must have unrestricted access to Anthropic's models for all legitimate purposes of defending the Republic. However, @AnthropicAI and its CEO @DarioAmodei have chosen hypocrisy. They are attempting to force the U.S. military into submission under the guise of \"effective altruism\"—a cowardly display of corporate ethics that places Silicon Valley ideology above the lives of the American people. Anthropic's flawed, altruistic \"terms of service\" can never supersede the safety, readiness, and lives of U.S. troops on the battlefield. Their true purpose is clear: to seize veto power over the U.S. military's operational decisions. This is unacceptable. As President Trump stated on Truth Social, only the Commander-in-Chief and the American people should decide the fate of our military, not unelected tech executives. Anthropic's position is fundamentally incompatible with American principles. Therefore, their relationship with the U.S. Armed Forces and the federal government has been permanently altered. In light of the President's directive to the federal government to cease all use of Anthropic technology, I have directed the Department of Defense to designate Anthropic as a national security supply chain risk. Effective immediately, no contractor, supplier, or partner doing business with the U.S. military may engage in any commercial activity with Anthropic. Anthropic will continue to provide services to the Department of Defense for no more than six months to allow for a smooth transition to higher-quality, more patriotic services. America's warriors will never be swayed by the ideology of big tech companies. This decision is final. The article mentions being designated a \"national security supply chain risk.\" What are the consequences? The impact is not simply that \"the government will stop using it.\" This is a measure typically used against hostile foreign powers. First, federal agencies must cease use: all executive branches must stop procuring and deploying its models; existing contracts may be terminated or not renewed; and cloud platforms that embed its models may be required to remove them. Second, any federal contractor cannot use the company's products in their systems, and companies involved in government projects must prove they are \"free of Anthropic components.\" This means that trillion-dollar tech giants like Nvidia, Amazon, and Google will need to sever ties with Anthropic. Other impacts include investor avoidance and financing difficulties. The company stated Friday evening that it \"will challenge any supply chain risk designation through legal means.\" The company stated that being designated a supply chain risk \"is neither in accordance with the law nor would it set a dangerous precedent for any U.S. company negotiating with the government.\" A former U.S. Department of Defense official, who wished to remain anonymous, noted that Anthropic appeared to have the upper hand in the competition. \"It's a great PR opportunity for them, and they're not short of money at all.\" Amodi himself admitted that since the company took a stand with Trump officials on how to deploy artificial intelligence on the battlefield, its valuation and revenue have only increased. If the Department of Defense chooses to part ways, Anthropic will \"ensure a smooth transition to other vendors.\" In reality, Anthropic has gained support from OpenAI due to its anti-government stance: OpenAI's CEO, Sam Altman, expressed support for the competitor. He sent a memo to his employees stating that he and Ammodhi shared the same \"bottom line\" regarding the application of both companies' products: \"We have always believed that artificial intelligence should not be used for mass surveillance or autonomous lethal weapons, and that humans should always be involved in automated decision-making involving high risks. These are our main bottom lines.\" However, Altman subsequently turned to the US government… II. Even the \"well-behaved Altman\" \"betrayed\" Altman later confirmed on X that OpenAI had reached an agreement with the US Department of Defense to use its AI models on a classified cloud network. It is currently unclear how the security-centric measures in the OpenAI agreement differ from those in the Anthropic negotiations. Tonight, we reached an agreement with the US Department of Defense to deploy our models on its classified network. Throughout all interactions, the Department of Defense has demonstrated full respect for security and a desire to collaborate with us for optimal results. The safety and broad benefits of artificial intelligence are at the heart of our mission. Our two most important security principles are: prohibition of mass surveillance within the country and human responsibility for the use of force, including autonomous weapons systems. The Department of Defense endorses these principles and reflects them in its laws and policies, which we have also incorporated into this agreement. We will also build technical safeguards to ensure our models function properly, as the Department of Defense desires. We will deploy a Functional Deployment Environment (FDE) to support model operation, and to ensure model security, we will deploy it only on cloud networks. We have requested that the Department of Defense offer the same terms to all AI companies, and we believe all companies should be willing to accept these terms. We strongly hope that the situation can be de-escalated, avoiding legal and governmental action, and that a reasonable agreement can be reached. We will continue to do everything in our power to serve all humanity. The world is a complex, chaotic, and sometimes dangerous place. </p><p>Under Altman's post, several X users commented:</p><ul class=\"list-paddingleft-2\" style=\"list-style-type: disc;\"><li><p>From non-profit organizations to for-profit companies, and then to the Department of Defense. It all changes so quickly.</p></li><li><p>I can't wait to investigate this deal after I'm elected to Congress in November.</p></li><li><p>So OpenAI went from \"We also have bottom lines\" to \"This is our model on the classified DoW network\" in just 12 hours? Anthropico was threatened/blacklisted for adhering to the same principles, but when Sam negotiated, it won everyone's applause for its profound respect for security. <br/></p></li></ul><p>First pretending to be on the same side as the competitor, then immediately throwing itself into the arms of the government, Altman played a really good hand.</p> Altman's \"defection\" might be traced back to the early connections between the two tech giants. Amodi, a veteran of the tech industry, rose to prominence early in his career at OpenAI. Later, he and several other OpenAI employees left due to disagreements with Altman. In 2021, Anthropic was launched. Its models and tools have been widely used by the federal government, largely thanks to its partnership with leading cloud service provider Amazon Web Services (AWS). Anthropic initially gained a foothold in the Department of Defense and intelligence agencies through this collaboration. Last July, Anthropic, along with xAI, Google, and OpenAI, secured a $200 million defense contract to support the Pentagon's advancement of AI applications. These two startups are now directly competing for users and enterprise clients through their evolving AI chatbots, agents, and other tools. III. Technology as a Bloodstained Sword In the current conflict between tech giants and the US government, Trump expressed his anger in all caps: \"The United States of America will not allow a radical, awakened left-wing company to dictate how our great military fights and wins wars!\" Since 2018, the conflict between tech companies and the Pentagon has been ongoing. At that time, employees of Alphabet's Google protested the Pentagon's use of its artificial intelligence to analyze videos taken by drones. Relations subsequently eased, with companies like Amazon and Microsoft vying for defense business, and several CEOs of major tech companies pledging to cooperate with the Trump administration last year. However, with the increasing prevalence of automated systems in the wars in Ukraine and Gaza, the theoretical \"killer robots\" have raised concerns among human rights and technology activists. Jack Shanahan, who led the Pentagon's algorithmic warfare project \"Project Maven,\" stated that the bolder military actions taken by the US over the past year have exacerbated these concerns. “People may feel more uneasy about the lack of any restrictions, and White House legal approvals could become ‘cover for any actions that could lead to procedural impropriety, civilian casualties, and collateral damage.’” Anthropic’s artificial intelligence technology has already been applied in the intelligence community and armed forces, and it is the first AI company of its kind to process classified information through a supply agreement with cloud service provider Amazon. According to reports from Reuters, the Wall Street Journal, and others, Anthropic’s Claude AI was used by the US military in the raid to capture Maduro in January of this year. Through a collaboration with data analytics company Palantir Technologies, it was integrated into the military’s intelligence and data analysis systems to analyze massive amounts of intelligence data, interpret satellite imagery, support decision-making, and potentially assist in operational deployment planning, but specific details remain classified. <h2><span style=\"font-size: 24px;\">IV. Opinions of Relevant Individuals</span><br/></h2><ul class=\"list-paddingleft-2\" style=\"list-style-type: disc;\"><li><p>On Friday evening, an open letter to the Pentagon and Congress, co-signed by several prominent technology and artificial intelligence leaders, began circulating. The signatories included 11 OpenAI employees, including Boaz Barak and William Feng, as well as Waymark CEO Alexander Persky-Sterm. ...&gt; “We firmly believe that the federal government should not retaliate against a private company for refusing to accept contract changes. This sets a dangerous precedent. Punishing an American company that refuses to accept contract modifications sends a clear signal to all American tech companies: either accept whatever the government demands, or face retaliation. The United States has won the AI ​​race because it is committed to free enterprise and the rule of law; to undermine this commitment to punish one company is short-sighted and contrary to national security interests.” Musk stated on his social media platform X that “Anthropic hates Western civilization.” Altman took a different approach, supporting Anthropic’s security safeguards, opposing the government’s “threatening” approach, and working to facilitate a deal between OpenAI and the Pentagon. Saif Khan, who previously served on President Biden’s White House National Security Council, stated that the Department of Defense’s move “is likely the most stringent domestic AI regulation ever enacted by any government.” \"It's fair to say they consider Anthropic a greater national security threat than any Chinese AI company, while they haven't listed any Chinese AI company as a supply chain risk.\" \"Targeting Anthropic might grab attention, but ultimately everyone loses.\" Dean Bauer, a former senior policy advisor on AI to Trump, posted on X: \"This is practically an attempt to murder a company. I would never recommend investing in American AI to any investor; I would never recommend starting an AI company in the United States.\" Deputy Secretary of Defense Emil Michael tweeted a series of messages: \"Amodi is a fraud and has a God complex. He's obsessed with personally controlling the U.S. military and is willing to jeopardize our national security.\" Massachusetts Democratic Senator Elizabeth Warren urged hearings on the core of this dispute—the issue of AI power. \"Did the Trump administration punish Anthropic because it refused to help with mass surveillance of American communities or to create killer robots? The American people have the right to know what Trump administration officials are planning at the Pentagon.\" Massachusetts Democratic Senator Ed Markey and Maryland Democratic Senator Chris Van Hollen stated that the Pentagon's \"threat to punish an American AI company for refusing to relinquish basic safeguards for the use of its AI models represents a chilling abuse of government power.\" California Democratic Representative George Whitesides expressed concern that Hegsides' \"threat to accelerate security policy changes could push the Department of Defense to conduct broader deployments without adequate safeguards.\" \"The President's directive to halt the use of a leading U.S. artificial intelligence company, coupled with inflammatory rhetoric attacking the company, raises serious concerns about whether national security decisions are driven by prudent analysis or political considerations,\" said Senator Mark Warner, a senior member of the Senate Intelligence Committee and a Democrat from Virginia, in an emailed press release. Appendix: Anthropic CEO Dario Amody's Statement: \"I firmly believe that using artificial intelligence to defend the United States and other democracies, and to defeat our authoritarian adversaries, is a matter of survival. Therefore, Anthropic has proactively deployed our models to the U.S. Department of Defense and intelligence agencies.\" We are the first cutting-edge AI company to deploy models on classified U.S. government networks, the first to deploy models in national laboratories, and the first to provide customized models for national security clients. Claude models are widely used in mission-critical applications by the U.S. Department of Defense and other national security agencies, such as intelligence analysis, modeling and simulation, operational planning, and cyber warfare. Anthropic has also taken steps to defend America's leadership in AI, even when it went against the company's short-term interests. We forwent hundreds of millions of dollars in revenue to prevent companies from using Claude chips; we stopped cyberattacks attempting to misuse Claude chips; and we advocated for strict export controls on chips to ensure democratic advantages. Anthropic understands that military decisions are made by the U.S. Department of Defense, not private companies. We have never objected to any specific military action, nor have we ever attempted to restrict the use of our technology in any temporary way. However, in a few cases, we believe that AI may undermine rather than defend democratic values. Certain applications have also been far beyond what current technology can safely and reliably perform. Two of these uses have never been included in our contracts with the U.S. Department of Defense, and we believe they should not be now: **Massive Domestic Surveillance.** We support the use of artificial intelligence for legitimate foreign intelligence and counterintelligence missions. However, using these systems for massive domestic surveillance is contrary to democratic values. AI-driven mass surveillance poses a serious and unprecedented risk to our fundamental freedoms. Such surveillance is currently legal only because the law has not kept pace with the rapidly evolving capabilities of AI. For example, under current law, the government can purchase detailed information about U.S. citizens' whereabouts, web browsing history, and social relationships from public sources without a warrant. The intelligence community has acknowledged that this practice raises privacy concerns and faces bipartisan opposition in Congress. Powerful AI can integrate this fragmented, individually harmless data to create a complete picture of anyone's life—automatically and on a massive scale. **Fully Autonomous Weapons.** Partially autonomous weapons, such as those currently used in Ukraine, are crucial for defending democracy. Even fully autonomous weapons (those that automatically select and attack targets without human intervention) could be critical to our national defense. However, the reliability of advanced AI systems is currently insufficient to power fully autonomous weapons. We would never intentionally supply products that would jeopardize the safety of American service members and civilians. We have proactively offered to work directly with the Department of Defense on research and development to improve the reliability of these systems, but they have declined this offer. Furthermore, without proper oversight, fully autonomous weapons cannot be expected to make critical judgments daily like our well-trained professional forces. They require robust safeguards for deployment, which currently do not exist. To the best of our knowledge, these two exceptions have not so far prevented our armed forces from accelerating the adoption and use of our models. The Department of Defense has stated that they will only contract with AI companies that agree to “any legitimate use” and remove security measures in the aforementioned circumstances. They threatened to remove us from their systems if we continued to maintain these security measures; they also threatened to designate us as a “supply chain risk”—a label typically used against U.S. adversaries and never before applied to U.S. companies—and invoke the Defense Production Act to force the removal of these security measures. The latter two threats are contradictory: one views us as a security risk, the other as an integral part of national security. However, these threats do not change our position: we cannot compromise our conscience by complying with their demands. The Department of Defense has the right to choose the contractors best suited to its vision. But given the immense value Anthropic's technology brings to our military, we hope they will reconsider. We strongly desire to continue serving the Department of Defense and our warfighters, provided the two safeguards we requested are in place. If the Department of Defense chooses to terminate its partnership with Anthropic, we will work to ensure a smooth transition to another supplier, avoiding any disruption to ongoing military programs, operations, or other critical missions. We will continue to provide our products for as long as necessary, in accordance with the preferential terms we have proposed. We stand ready to continue our efforts to safeguard U.S. national security.</p></li></ul></div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/47ddf6211ee98ba6e31fbf3d1c6eca1a.jpg",
            "link": "https://www.coinlive.com/news/from-cooperation-to-a-complete-break-why-did-anthropic-dare",
            "pub_date": "2026-02-28 16:42:10",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 250653,
            "title": "Discussion on several issues related to stablecoin payments since the Genius Act",
            "description": "<div class=\"share___SVvtl\"><div><h2 style=\"text-align: left;\"><span leaf=\"\">The future of yield-generating stablecoins is uncertain, while payments are booming</span></h2><p style=\"text-align: left;\"><span leaf=\"\">Since the passage of the Genius Act of 2025.7, yield-generating stablecoins have faced widespread resistance from the banking industry, while payment stablecoins have flourished.</span></p><p style=\"text-align: left;\"><span leaf=\"\">Old payments have become the new hot topic, and agents and stablecoins represent the complex relationship between Fintech &amp; Crypto.</span></p><p style=\"text-align: left;\"><strong><span leaf=\"\">Yield-generating is the past, payments are the present, and AI is the future</span></strong><span leaf=\"\">This is a dangerous and easily outdated classification, but it provides us with a historical framework that is easy to understand.</span></p><p style=\"text-align: left;\"><strong><span leaf=\"\"> Meta is embracing stablecoins again, Google has formed the AP2 consortium with over 60 companies, and Stripe sees stablecoins and agents as the future. However, PayPal, which already launched $PYUSD, and Coinbase, which proposed the x402 protocol, both saw their stock prices fall. We urgently need to address two issues: first, who is fueling market sentiment in this new payment war; and second, are agents and stablecoins truly the next big thing? This article focuses on the former. The relationship between AI, blockchain, and stablecoins will be discussed later, and the outlook for yield-generating stablecoins will follow after a clearer bill is enacted. The losers eat dust; Fintech is more anxious than Crypto. Crypto has hope, but no future for individuals. US stocks and bonds are going blockchain, BlackRock and WisdomTree are frequently embracing DeFi, and token economics is inevitably heading towards its end. No one believes in the wealth-creating effect of blockchain anymore. Even if public chains and Vaults are adopted in reality, it doesn't mean that the prices of $ETH and $Aave will rise. This view isn't entirely wrong, but it exaggerates the predicament faced by Crypto, because Fintech has reached a critical juncture. Yes, this counterintuitive judgment can be made after Stripe broke through the $159 billion valuation. Following Peter Thiel's funding flow, selling off Wise stock and holding onto NeoBroker projects like Trade Republic, or looking at Revolut ($75 billion), Europe's most valuable NeoBank project, reveals a changed valuation logic for Fintech. After more than 20 years of effort, Fintech's attempt to build payment channels independent of banks has failed. Only the ability to retain or convert user funds has value. Wise's transfers and Stripe's acquiring have no real future. </span></strong></p><figure><p style=\"text-align:center\"><span leaf=\"\"><img alt=\"yTqYVMnSmEsNKNp9VQO7pqXRNnOTukcAIWY5C5Z3.png\" src=\"https://img.jinse.com.cn/7436497_image3.png\" title=\"7436497\"/></span></p><figcaption><p style=\"text-align: center;\"><span leaf=\"\">Image description: Fintech &amp; Payment value changes</span></p><p style=\"text-align: center;\"><span leaf=\"\">Image source: @zuoyeweb3</span></p></figcaption></figure><p style=\"text-align: left;\"><span leaf=\"\">One ​​reason is that they cannot completely bypass the banking industry to handle funds, and another reason is that blockchain can make it cheaper.</span></p><p style=\"text-align: left;\"><span leaf=\"\">One ​​reason is that they cannot completely bypass the banking industry to handle funds, and another reason is that blockchain can make it cheaper.</span></p> This isn't just a problem for a single company. The entire Fintech sector reached its peak during the pandemic. PayPal, rumored to be selling itself today, was valued at $340 billion in 2021. By 2026, the entire Fintech sector will be scrambling to prove its superiority over stablecoins and agents. Stripe's valuation is 5 times that of Adyen's market capitalization ($35 billion) and about 13 times that of Checkout.com ($12 billion), but Stripe's business volume isn't 5 times that of Adyen. This leverage stems from people's imagination regarding the concepts of stablecoins and agents. The anxiety of Fintech companies is far more severe than that of Crypto, after all, \"public chain + stablecoin\" is a self-contained system, and DeFi is a killer application. The new payment war we are seeing now is nothing more than the fuel inflated valuations of Fintech. Fintech only has an advantage in existing users; the future belongs to the crypto industry. <figure><p style=\"text-align:center\"><span leaf=\"\"><img alt=\"RE5nVa4xKRKxHn1nf3SzeKBe7I8CP0pB1VaYFOMc.png\" src=\"https://img.jinse.com.cn/7436498_image3.png\" title=\"7436498\"/></span></p><figcaption><p style=\"text-align: center;\"><span leaf=\"\">Image description: Forbes Fintech 50 list</span></p><p style=\"text-align: center;\"><span leaf=\"\">Data source: @ForbesCrypto</span></p></figcaption></figure><p style=\"text-align: left;\"><span leaf=\"\">According to Forbes data, payments, as a target in the Fintech sector, takes an average of 8.1 years to make the list, but crypto only takes 6.2 years.</span></p><p style=\"text-align: left;\"><span leaf=\"\">According to Forbes data, payments, as a target in the Fintech sector, takes an average of 8.1 years to make the list, but crypto only takes 6.2 years.</span></p><p style=\"text-align: left;\"><span leaf=\"\"> From a direct business perspective, long-distance runners like Stripe need to give the capital market an explanation, or even a reason for exiting, as the funds tied up need to be allocated to a newer or larger future. Larger: Agents will exponentially increase the number of payments; Stripe founders, the Collison brothers, believe a chain with 1 billion TPS is needed. Newer: Utilizing stablecoins to completely revolutionize the existing payment technology stack represents the biggest technological revolution since the API-first model. To realize this promising future, Fintech not only needs to prove itself superior to Crypto companies, but also faces resistance from the banking industry and internet super platforms. With numerous participants, the situation has become utterly chaotic. Compared to unicorns like Stripe, super platforms like Meta/Google are far larger, with trillions of dollars in market capitalization and billions of users being commonplace. They primarily act as conduits, sharing profits. You could say they see hope in creating stablecoins or payment protocols, or you could say they're leveraging their existing advantages to charge higher tolls. Under the benevolent leadership of Vitalik Buterin, Crypto proactively relinquished its independent hardware layer to the internet, becoming a dependent entity of AWS. However, at least blockchain technology, as a new infrastructure for money transfer, has gained consensus among the banking industry, internet companies, Fintech firms, and regulators. The remaining point of consensus lies in whether to completely replace banks, and how payment stablecoins can encircle B2C businesses from the C2C/B2B dichotomy. Tether and Circle's two-way encirclement: USDT fades into obscurity, entering the third world and surrounding Europe and America; USDC focuses on on-chain development, with compliance merely a protective shield for replacing banks. Blockchain not only bypasses the banking-dominated financial industry, achieving a theoretical minimum for independent existence through the underground economy, but also, in the 10 years of Ethereum's development, has demonstrated overwhelming superiority over TradFi in terms of capital efficiency. Most interestingly, this dominance isn't based on the sheer volume of funds; the combined $236 billion in ETH, $300 billion in stablecoins, and $1.32 trillion in BTC still don't exceed JPMorgan Chase's $2.5 trillion in deposits. The advantage lies in the fact that the banking industry can use alliances to block the continuous attempts of Fintech and PSPs (Payments  service Providers, or third-party payment providers), because you simply cannot bypass the banking industry to handle the electronic flow of US dollars independently. However, blockchain can. Even the most difficult stablecoin companies to penetrate the banking system have loopholes, with Silicon Valley Bank as an example and Lead Bank as an example. Capitalists can sell their nooses; the \"traitors\" in the banking industry cannot be absorbed by itself, and Wall Street has no regulatory power. The value orientation of regulation is very contradictory. On the one hand, after the 2008 financial crisis, the \"too big to fail\" banking industry is not popular; on the other hand, the crypto industry may be even more brutal than Wall Street in terms of financial order. The ancient political wisdom of \"surrounding three sides and leaving one side open\" has been skillfully employed by various bureaucratic systems. A closer look at the regulatory actions following the brilliant legislation reveals that the Fed, OCC, CFTC, and SEC have opened the door wide for payment stablecoins, but at the cost of erasing the foundation for yield-based stablecoins in response to the \"deposit outflow\" crisis in the banking sector, while simultaneously guiding stablecoins into the existing system. </span></p><figure><p id=\"_img_parent_tmp\" style=\"text-align:center\"><span leaf=\"\"><img alt=\"n4vsqRsXYj3IqaGs2i03e3aqsntu48GwcFcbowyT.png\" src=\"https://img.jinse.com.cn/7436499_image3.png\" title=\"7436499\"/></span></p><figcaption><p style=\"text-align: center;\"><span leaf=\"\">Image description: Progress of regulatory implementation</span></p><p style=\"text-align: center;\"><span leaf=\"\">Image source: @zuoyeweb3</span></p></figcaption></figure><p><span leaf=\"\">Since the 1970s, Merrill Lynch invented the CMA (Cash Management Account) and MMF (Money Market Fund).</span></p> Since then, the banking industry has accused it of causing deposit outflows from small and community banks. However, the die is cast; CMA-backed MMFs not only offer flexible access but also higher interest rates than bank deposits. Ultimately, it was only when the banking industry was gradually allowed to engage in diversified operations and offer similar MMF products that the deposit outflow was finally stopped. Ironically, large banks ultimately used their scale advantage to seize deposits from smaller banks. Heretics are more dangerous than heretics. Stablecoin yields are not a problem; the banking industry wants to distribute the yields itself to avoid being eliminated by historical processes. For another example, in 2013, when Alipay and WeChat were booming, the US banking industry once again raised the banner of protecting small banks. Of course, the ultimate victims are American Fintech companies like PayPal, which also sowed the seeds of the false narrative that third-party payments rely on banks to disrupt them. But Crypto is different, really, it's different. Faced with the aggressive moves of the banking industry and regulators, Circle is undoubtedly more American and more compliant, while Tether is a comeback platform from overseas and the underground. However, for a considerable period and in a vast region, $USDC and $USDT are not competitors. Simply put, USDC follows the \"+stablecoin\" logic of DeFi + B2B, while USDT follows the \"stablecoin+\" narrative of CEX + P2P. It sounds strange, but USDC is indeed more widely used in the DeFi field, extensively used for quotation assets, and far surpasses USDT in mainstream scenarios such as DEX/Lending. Furthermore, apart from Coinbase, the vast majority of CEX liquidity is denominated in USDT. In the financial industry, USDC has become the standard stablecoin, and Circle's CCTP stack, built for it, serves as an entry point for institutions to enter the blockchain. However, USDT has shown remarkable resilience; the $80 billion in USDT on Tron supports the global demand for personal transfers. In Argentina and Nigeria, the dollarization of currency is essentially USDT-ization. According to a joint study by Artemis and McKinsey, the $35 trillion in global stablecoin transaction volume is not substantial enough; only about $390 billion (approximately 1%) represents genuine stablecoin payments, accounting for 0.02% of the total global payments (over $2 trillion). B2B payments: $226 billion (the primary use case, accounting for 60%, with a year-on-year growth of 733%), representing only 0.01% of the approximately $1.6 trillion in global B2B payments. Global salaries and cross-border remittances: $90 billion (&lt;1% of the global share). Clearing and settlement: $8 billion (&lt;0.01% of the global share). U-Card: $4.5 billion. This data is clearly more realistic in everyday experience. Perhaps the trend of stablecoin adoption is more important; you'll see Fintech actively connecting with banks, but banks will resist stablecoin yields while simultaneously supporting more stablecoins. If you observe Tether's recent actions, the partnership with Lutnik and the launch of USAT are just a cover; the $200 million investment in Whop is more authentic and can be interpreted as buying channel fees from 18 million users, using remittances from the Third World to encircle the First World. Therefore, you'll see that cross-border remittance companies in Latin America ⇄ the US, South Asia ⇄ the Middle East, and Africa ⇄ Europe more commonly support USDT, while Stripe and Huma default to USDC. The underlying nature of the cryptocurrency world is P2P, and Circle's conscious efforts to network with businesses and banks, particularly in the B2B sector, which is widely reported and even touted as a future trend, misinterpret the direction of payment itself. As mentioned earlier, pure transfer, clearing, and aggregation channels have little value; processing volume is ultimately a fixed number, lacking the foundation for a market-dream-like valuation. Everyone needs a graphics card for gaming; at most, 7 billion 5090 tokens could be sold, clearly less than the potential gains from AI being considered the fourth industrial revolution. \"Payment is not a SaaS or a function, but rather an AI payment infrastructure similar to Cloudflare, where the distribution network cannot be valued by quantity.\" This is the story Crypto wants to tell the world: to make stablecoins something beyond payments, allowing money to remain on-chain end-to-end. People are talking about the demise of SaaS and the aging of channel providers, as if decades of Fintech will change hands overnight. Of course, things won't happen that quickly, especially since USDC's adoption by B2B institutions still needs time, and Tether's unilateral promotion of USDT and its aggressive buying of old channels may not necessarily lead to the future. If we're looking to establish a point of observation for the payment story in Crypto, the only useful one is how to handle the relationship between payments and returns. It's very clear now: For returns, they can only remain in on-chain DeFi, like MetaMask U Card's partnership with Aave to bypass the US market and enter the broader consumer system; for payment scale, they need to obtain a banking license from an OCC to issue compliant, non-yielding stablecoins, entering the vast financial derivatives field of the CFTC and SEC. As for BitGo's Asian institutional-grade USD stablecoin $FYUSD and Circle's Euro stablecoin $EURC, they've both chosen to confine themselves to a small corner of the market. The essence of B2B is a pipeline, the essence of C2C is scale, and the essence of B2C is a plugin. Looking at the history of payment stablecoins, the hope of replacing card organizations as a new channel is provided by public chains/L2, but compared to the advantage of Fintech \"replacing\" banks, it must be a new product with MMF + payment functions, that is, surpassing banks in capital efficiency. Peter Thiel is optimistic about Neobank and Neobroker, while Vitalik is optimistic about ETH-backed yield stablecoins. On this point, Vitalik actually sees it more clearly: if there is no ETH-based yield stablecoin to diversify holding risks, at the very least, one should consider using RWA assets to diversify income sources. In short, lacking payment functionality based on on-chain yields, stablecoins cannot escape the dominance of dollar assets and will ultimately be tamed into the banking industry by OCC. Those willing to sacrifice freedom for security will ultimately gain neither freedom nor security. Here's a second dangerous assessment: existing B2B enterprise use cases based on USDC and cross-border remittance projects incorporating USDT transfers are insufficient to propel payment stablecoins towards global adoption. They only possess temporary significance and will not become major players in the next era. <figure><span leaf=\"\"><img alt=\"H1Cmq5DcbWJZhCHTozd4eWoahKce5qvy5pYBm58K.png\" src=\"https://img.jinse.com.cn/7436500_image3.png\" title=\"7436500\"/></span><figcaption><p><span leaf=\"\">Image description: Payment stablecoin circulation</span></p><p><span leaf=\"\">Image source: @zuoyeweb3</span></p></figcaption></figure><p><span leaf=\"\">The phase mission of using revenue as a customer acquisition method has been terminated. Under the obstruction of the banking industry, not only will off-chain be inevitably affected, but after $USDe and $xUSD, on-chain has also been shut down. It is indeed necessary to study the adoption of payments in the real world. However, it's important to note that if you only study payments and ignore yield characteristics, you'll miss the most valuable 50% of this wave. USDT/USDC, using government bond interest rates, has been recruited, and the banking industry has won the third wave, continuing to wield its power with the cheapest demand assets. Conclusion: Following the footsteps of Fintech, we hope Crypto will forge a different future. Four driving forces constitute the new payment war: Stripe and others are frantically embracing new narratives for their IPOs; Meta/Google sees their bargaining power as channel providers; the banking industry wants to retain channel fees and cheap assets; and Tether is investing heavily in payment companies, hoping to surround Circle. Two new narratives are packaged into future visions: stablecoins are seen as the obvious agent payment tool, but no one has ever asked whether agents actually need them. This issue will be discussed later.</span></p></div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/957aeeaa54f2f3fe6be197bebf0a354b.jpg",
            "link": "https://www.coinlive.com/news/discussion-on-several-issues-related-to-stablecoin-payments-since-the",
            "pub_date": "2026-02-28 16:39:57",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 250635,
            "title": "The Pentagon blacklists Anthropic; nuclear war becomes the focus of contention between the two sides.",
            "description": "<div class=\"share___SVvtl\"><div><p style=\"text-align: left;\"><span style=\"font-size: 16px;\">Author: Ye Huiwen, Wall Street Insights</span></p><p style=\"text-align: left;\">The Trump administration has officially designated artificial intelligence startup Anthropic as a \"national security supply chain risk,\" completely banning its applications in the federal government and military. This unprecedented rupture stems from fundamental disagreements between the two sides on whether AI should be involved in lethal military decisions such as nuclear war.</p><p style=\"text-align: left;\">US Defense Secretary Pete Hegseth announced that **any contractor doing business with the US military must immediately cease commercial activities with Anthropic, and existing services will be phased out within six months. President Trump subsequently publicly pressured the company, stating that if it does not cooperate during the transition period, it will face civil and criminal charges.</p><p style=\"text-align: left;\">This move has caused a major upheaval in Silicon Valley, reshaping the rules of cooperation between tech giants and the US military.</p><p style=\"text-align: left;\">This move has reshaped the rules of cooperation between tech giants and the US military.</p> For Anthropic, valued at $380 billion and having previously secured approximately $200 million in military contracts, this not only represents a direct commercial loss but also sends a strong signal of compliance risks to the entire AI industry, indicating that the government will not allow companies to erect technological barriers in key defense sectors. As Anthropic faces expulsion, its competitors OpenAI and Musk's xAI are rapidly moving to fill the market vacuum. According to the Wall Street Journal, OpenAI CEO Altman has told employees that they are negotiating a new cooperation agreement with the Pentagon, attempting to find a balance between meeting military needs and maintaining the company's security bottom line. The core of the conflict between the Pentagon and Anthropic lies in the right to apply AI systems in extreme military operations. A serious conflict erupted last month between the two sides during discussions of an extreme nuclear war scenario: whether the military could use Anthropic's Claude AI system to assist in intercepting missiles if the United States were attacked by an intercontinental ballistic missile. Pentagon officials accused Anthropic CEO Dario Amodei of attempting to veto the military's operational decisions. Emil Michael, the Under Secretary of Defense for Research and Engineering, publicly criticized Anthropic for prioritizing its own ideology over national security and stressed that large technology companies should never be allowed to determine the outcome of a war. Anthropic strongly refuted the military's accusations, calling their claims about missile interception \"completely false.\" Dario Amodei issued a statement emphasizing that current AI systems lack sufficient reliability to drive autonomous weapons, which would endanger soldiers and civilians. The company adheres to its core principle of refusing to use AI technology for autonomous lethal weapons and domestic mass surveillance. OpenAI and xAI Accelerate Market Vacuum Squeezing Anthropic's exit directly altered the competitive landscape of the AI ​​military market. OpenAI is attempting to offer the military a compromise. Altman told employees that the government was willing to include OpenAI's \"red lines\" in contracts, allowing the company to build its own \"security stack.\" This means that if the AI ​​refuses to execute instructions that violate security principles, the government will not force it to. Meanwhile, Musk's xAI and its chatbot Grok, with fewer restrictions, have become another more attractive option for the Pentagon and have been approved for use in some top-secret operations. However, according to the Wall Street Journal, citing sources familiar with the matter, several federal agencies, including the General Services Administration (GSA), have issued serious warnings about Grok's security and reliability, expressing concerns that its data bias and vulnerability to manipulation could pose systemic risks. The tech industry faces a reassessment of compliance and investment risks. A Bloomberg analysis points out that Trump's decision will prompt tech companies investing billions of dollars in AI research to reassess the best way to contract with the federal government. Anthropic was previously the only AI system capable of operating in the Pentagon's classified cloud environment, and its Claude Gov tool was favored by defense personnel for its ease of use. The ban represents a significant risk for both the government and businesses. Even more worrying for the market is the potential for coercive measures from the government. Pentagon officials have previously hinted that they might use their government authority to force Anthropic to hand over its technology. Industry experts warn that such extreme policy options will have a chilling effect on the entire industry, causing investors and companies to worry that deep cooperation with the Department of Defense could ultimately lead to the loss of control over core technologies.</div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/4a1dc31a6f82b29c0fccf0ca7f1b85b7.jpg",
            "link": "https://www.coinlive.com/news/the-pentagon-blacklists-anthropic-nuclear-war-becomes-the-focus-of",
            "pub_date": "2026-02-28 14:32:54",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 250634,
            "title": "1.3 billion yuan in debt: Bitdeer has a tough battle ahead.",
            "description": "<div class=\"share___SVvtl\"><div><p style=\"text-align: left;\"><span leaf=\"\"><span text=\"\">Author:</span></span><span leaf=\"\"><span text=\"\">Lin Wanwan</span></span></p><p style=\"text-align: left;\"><span leaf=\"\">On February 20, 2026, BitDeer posted its weekly production update on X: 189.8 BTC mined that week, sold. Remaining inventory: 943.1 BTC, sold all at once. </span></p><p style=\"text-align: left;\"><span leaf=\"\">Bitcoin balance: 0. </span></p><p style=\"text-align: left;\"><span leaf=\"\">In fact, Bitcoin mining, from day one, has been a kind of **time arbitrage**. </span></p><p style=\"text-align: left;\"><span leaf=\"\">Using today's electricity and machines to exchange for tomorrow's Bitcoin.</span></p><p style=\"text-align: left;\"><span leaf=\"\"> The garage doesn't require processing, customers, or a brand. The investment is in current costs, betting on future prices. If the judgment is correct, time will make you money. This logic has been running for over a decade. Now, Wu Jihan is changing the target of this logic. The target has shifted from the price of cryptocurrency to the long-term price of computing power demand in the AI ​​climate. The means have changed from exchanging electricity for cryptocurrency to borrowing money to buy land. The object of arbitrage has changed, but the structure of arbitrage is gone. In the same week that he cleared out his Bitcoin holdings, BitDeer also completed the pricing of $325 million in new debt. According to Bitdeer's financial report, as of December 31, 2025, Bitdeer's outstanding principal loans were approximately $1 billion (excluding $500 million in derivative liabilities). Therefore, the total debt is approximately $1.3 billion. The Bitcoin crash is real, the debt is real, the land purchases are real, but the outcome of this tough battle may not be revealed until 2029. Bitdeer was founded in 2018, starting as a mining machine sharing platform. Currently, it is one of the world's largest listed mining companies, with a self-mining hashrate of 63.2 EH/s, ranking first among listed mining companies globally and accounting for approximately 6% of the entire Bitcoin network's hashrate. However, Wu Jihan no longer wants to sell hashrate; he wants to get involved in the power industry. </span></p><p style=\"text-align:center\"><span leaf=\"\"><img alt=\"JvSeGeaJAVSKBs69FU5B6zME5ZGaBewAtaCSL1lw.jpeg\" src=\"https://img.jinse.com.cn/7436474_image3.png\" title=\"7436474\"/></span></p><p style=\"text-align: left;\"><span leaf=\"\">Let's analyze BitDeer's financial report. As of the beginning of 2026, BitDeer's total global power pipeline capacity was 3002 MW, of which 1658 MW were already online and operational, and 1344 MW were under construction or planned. Microsoft and Google's individual hyperscale data centers typically range from 100 to 300 MW in size.</span></p><p style=\"text-align:center\"><span leaf=\"\"><img alt=\"JvSeGeaJAVSKBs69FU5B6zME5ZGaBewAtaCSL1lw.jpeg\" src=\"https://img.jinse.com.cn/7436474_image3.png\" title=\"7436474\"/></span></p><p style=\"text-align: left;\"><span leaf=\"\">If we break down BitDeer's financial report, as of the beginning of 2026, BitDeer's total global power pipeline capacity was 3002 MW, of which 1658 MW were already online and operational, and 1344 MW were under construction or planned.</span></p></div></div>",
            "image": "https://img.jinse.com.cn/jinse_1772257912757544028_small.png",
            "link": "https://www.coinlive.com/news/1-3-billion-yuan-in-debt-bitdeer-has-a-tough-battle",
            "pub_date": "2026-02-28 13:52:37",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 250633,
            "title": "\"The darkest day in American business history\": Trump orders a ban on Anthropic.",
            "description": "<div class=\"share___SVvtl\"><div><p style=\"text-align: left;\"><span leaf=\"\"><span text=\"\">At 5:01 PM Eastern Time on Friday, the deadline was set by the US Secretary of War, Hergé.</span></span><span leaf=\"\"><span text=\"\">. With 15 minutes to go, US President Trump issued a ban order on his own social media account, ordering the US federal government to immediately cease using all technology from the leading US AI company Anthropic. The original text is as follows:</span></span></p><p style=\"text-align: left;\"><em><span leaf=\"\"><span text=\"\">The United States of America will never allow an extreme left-wing, extremely \"awakened\" company to dictate how our great military fights and wins wars! This decision belongs to your Supreme Commander and to the distinguished generals I have appointed to lead our military.</span></span></em></p><p style=\"text-align: left;\"><em><span leaf=\"\"><span text=\"\">The United States of America will never allow an extreme left-wing, extremely \"awakened\" company to dictate how our great military fights and wins wars! This decision belongs to your Supreme Commander and to the distinguished generals I have appointed to lead our military.</span></span></em></p><p style=\"text-align:center\"><img alt=\"xqFFhbKwQPmV0IxRlTlNIeA5zSeIGKHmYG6MJ4BQ.jpeg\" src=\"https://img.jinse.com.cn/7436467_image3.png\" title=\"7436467\"/></p><p style=\"text-align: left;\"><span leaf=\"\"><span text=\"\">Anthropic's long-time rival, OpenAI CEO Altman, expressed the fundamental principles of a leading AI company in an internal memo to employees:</span></span></p><p style=\"text-align: left;\"><em><span leaf=\"\"><span text=\"\">This is no longer just an issue between Anthropic and the U.S. Department of Defense; it's a matter of great importance to the entire industry, and clarifying our position is crucial.</span></span></em></p><p style=\"text-align: left;\"><em><span leaf=\"\"><span text=\"\">This is no longer just an issue between Anthropic and the U.S. Department of Defense; it's a matter of great importance to the entire industry, and clarifying our position is of paramount importance.</span></span></em></p><p style=\"text-align: left;\"><em><span leaf=\"\"><span text=\"\">This is no longer just an issue between Anthropic and the U.S. Department of Defense; it's a matter of great importance to the entire industry, and clarifying our position is crucial.</span></span></em></p><p style=\"text-align: left;\"><em><span leaf=\"\"><span text=\"\"> We have always believed that artificial intelligence should not be used for mass surveillance or autonomous lethal weapons, and that human leadership must be retained in high-risk automated decision-making. These are our core red lines. He also publicly supported Anthropic in a media interview: \"Personally, I believe the U.S. Department of Defense should not use the Defense Production Act to pressure or threaten these companies. Although I have many disagreements with Anthropic, I generally trust the company.\" Anthropic's founding team mainly came from OpenAI's former security alignment department. Besides standing on the industry's fundamental principles, they also faced a common adversary: ​​Musk.</span></span></em></p></div></div>",
            "image": "https://img.jinse.com.cn/jinse_1772254736556856141_small.png",
            "link": "https://www.coinlive.com/news/the-darkest-day-in-american-business-history-trump-orders-a",
            "pub_date": "2026-02-28 12:59:36",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 250632,
            "title": "Chainlink's Institutionalization Moment: From \"Being Dependent\" to \"Profitability\"",
            "description": "<div class=\"share___SVvtl\"><div><p style=\"text-align: left;\">Author: Delphi Digital; Translator: @Jinse Finance xz</p><p style=\"text-align: left;\">In the traditional financial sector, the vast majority of major tokenization pilot projects run on the same infrastructure. UBS, SWIFT, Mastercard, JPMorgan Chase, and Coinbase all use Chainlink. But can such adoption translate into real benefits?</p><h2 style=\"text-align: left;\"><strong>1. Infrastructure</strong></h2><p style=\"text-align: left;\"><strong>Equities Data Streams will expand to 24/7/5 coverage by 2026</strong>. This system aggregates price information from top data providers, verifies it through an oracle network, and provides sub-second updates. On-chain derivatives, prediction markets, and structured products can now reference real US stock prices.</p><p style=\"text-align:center\"><img alt=\"eXwctcJAduOyDbrMD9YI85MpUMEifBXEMA5Cw0tL.png\" src=\"https://img.jinse.com.cn/7436460_watermarknone.png\" title=\"7436460\"/></p><p style=\"text-align: left;\"><strong>Chainlink Runtime Environment is responsible for handling workflow execution.</strong> Developers can orchestrate workflows using modular components such as data feeds without having to manage node infrastructure themselves. This network is designed to ensure execution continues even if individual nodes fail. CRE natively supports the ISO 20022 standard and can be directly embedded into existing Swift infrastructure without additional conversion layers. </p><p style=\"text-align: left;\"><strong>Confidential Compute will enter early access phase in early 2026, utilizing a trusted execution environment to process sensitive data without exposing it.</strong> Data enters in encrypted form, is processed in an isolated environment, and only the result is output. A proof mechanism verifies that the computation runs correctly within a true TEE. This means institutions can use public blockchains without exposing sensitive operations. CCIP connects over 60 blockchains through a layered security model. Independent networks are responsible for execution and monitoring, and can suspend transmissions if anomalies are detected. Coinbase chose it as the sole cross-chain bridge for all Coinbase Wrapped Assets. Over the past year, CCIP's cumulative transaction volume has increased approximately 7 times. </p><h2 style=\"text-align: left;\"><strong>2、</strong><strong>Chainlink's Current Status</strong></h2><p style=\"text-align:center\"><img alt=\"x3Lg1fNMYwUH4Vx86mQC02ulxDZJmYpUeZFQytXQ.png\" src=\"https://img.jinse.com.cn/7436461_watermarknone.png\" title=\"7436461\"/></p><p style=\"text-align: left;\">Chainlink's persistent weakness lies in the fact that everyone relies on it, yet nobody pays much for it. However, since 2025, the team has introduced two mechanisms that could potentially change this situation. </p><p style=\"text-align: left;\"><strong>Through a smart value recovery mechanism in partnership with Aave, MEVs are recovered during liquidation, capturing $16 million in nine months.</strong></p> Chainlink received 35%, approximately $5.6 million. This is significant as a proof of concept, but the mechanism needs to be expanded to other lending protocols for sustainable growth. The Chainlink Reserve converts enterprise payments into LINK purchases on the open market. Since its launch seven months ago, the reserve has accumulated 2.3 million LINK. This is still in its early stages, but enterprise payments are real. 3. Macro Landscape In terms of total locked value, Chainlink holds a 64% share of the oracle market. Protocols like Aave and Lido run their critical infrastructure through Chainlink, and switching vendors would mean contract rewriting, audits, governance voting, and real migration risks. Instead of leaving, Lido migrated its cross-chain infrastructure to CCIP, deepening its partnership with Chainlink. Maintaining a leading position means working on three fronts: launching Confidential Compute before institutions build their own privacy solutions; extending SVR beyond Aave to demonstrate the scalability of its revenue model; and convincing banks that public blockchain solutions are simpler than private ones. Chainlink's value hinges on the massive rollout of institutional tokenization. For those who believe tokenization is imminent, Chainlink is the infrastructure layer.</div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/d90db7a3d3407cc70ee3f0bb322f64f7.jpg",
            "link": "https://www.coinlive.com/news/chainlink-s-institutionalization-moment-from-being-dependent-to-profitability",
            "pub_date": "2026-02-28 12:45:57",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 250631,
            "title": "Three signals indicate that Bitcoin's rebound is still some time away.",
            "description": "<div class=\"share___SVvtl\"><div><p style=\"text-align: left;\">Source: ecoinometrics, Compiled by: Shaw &amp; Jinse Finance</p><p style=\"text-align: left;\">We analyze the three most critical market signals affecting Bitcoin and macro assets every week, providing institutional-grade insights through data-driven charts and analysis.</p><p style=\"text-align: left;\">Today we will introduce:</p><ol class=\"list-paddingleft-2\" style=\"list-style-type: decimal;\"><li><p style=\"text-align: left;\"><strong>Bitcoin's deep pullback needs time to recover</strong></p></li><li><p style=\"text-align: left;\"><strong>Gold ETF inflows have surpassed Bitcoin</strong></p></li><li><p style=\"text-align: left;\"><strong>PCE data has not confirmed a decline in CPI.</strong></p></li></ol><p style=\"text-align: left;\">This week's three charts tell the same story from different perspectives.</p><p style=\"text-align: left;\"> Bitcoin remains in a rare downtrend, with funds flowing towards defensive rather than risky assets, and the inflation indicators closely watched by the Federal Reserve have not confirmed a resurgence of deflation. In other words, the overall economic environment has not seen substantial improvement. Let's take a look. Bitcoin's deep pullback will take time to recover. Severe declines can alter the rhythm of the market. Bitcoin is currently down about 52% from its peak. In the past decade, there have only been five instances of declines exceeding this. Once it reaches this level, prices rarely rebound overnight. The only recent exception was the market crisis triggered by the COVID-19 pandemic, which was a policy-driven shock followed by unconventional liquidity support measures from governments. However, this context does not apply to the current environment. Most deep pullbacks occur slowly. Market conditions are gradually deteriorating, the rebound has failed, and confidence needs to be rebuilt gradually, not overnight. In the current market depth, the key is not to predict the exact bottom, but to observe the overall changes in risk appetite and demand, changes that have historically been accompanied by sustained recovery. These signals often emerge gradually over time, meaning that once market signs improve, there is usually room to adjust investment exposure. For now, historical patterns suggest that we should remain patient, rather than rush into things. Bitcoin is experiencing one of its five most severe declines in nearly a decade. Historically, a rebound from such a deep level requires sustained improvement in macroeconomic and demand conditions, rather than a short-term price bounce. Gold ETF flows have surpassed Bitcoin flows. If we look at the cumulative flows since the launch of spot Bitcoin exchange-traded funds (ETFs) in early 2024, Bitcoin initially dominated, attracting a flood of funds. Even by 2025, when funds began flowing into gold, the growth trends of both had been synchronized. However, this trend has changed. Since November, Bitcoin ETFs have seen net outflows, while gold ETFs have experienced a continuous rise in inflows. Therefore, the cumulative net inflow into gold ETFs during the same period has exceeded that of Bitcoin. It's worth noting that gold is benefiting from the same market environment that is putting pressure on Bitcoin. When investors adopt a more conservative strategy, funds tend to flow into assets seen as stable safe havens. Despite being dubbed \"digital gold,\" Bitcoin has not received the same treatment in portfolios. In fact, Bitcoin trades more like a high-beta growth asset than gold. Fund flow data also confirms this: funds are flowing into defensive assets rather than highly leveraged risky assets. This is not about the narrative; the key is the actual allocation of funds. Since November, ETF fund flows have shown a clear divergence: gold continues to attract safe-haven funds, while Bitcoin faces continuous outflows, clearly indicating a contraction in risk appetite. PCE data does not confirm a decline in CPI. Recent Consumer Price Index (CPI) data shows inflation cooling again. However, the Federal Reserve's target is not the CPI, but the Personal Consumption Expenditures Index (PCE). The PCE data reflects a completely different picture. The PCE year-on-year increase is approximately 2.9%. Core PCE is closer to 3.0%. Core services inflation remains above 3.4%. More importantly, this trend has been upward recently, unlike the decline seen in the CPI. The discrepancy between CPI and PCE data may partly reflect time factors and data bias. The government shutdown at the end of last year interrupted CPI data collection, resulting in missing data and biased estimates. This could temporarily exaggerate changes in either. Due to differences in data sources, weighting, and calculation methods, the PCE has not been affected to the same extent. In other words, the moderate CPI data likely exaggerates progress on inflation. This is noteworthy in terms of monetary policy. If the inflation indicators that the Fed focuses on do not decline significantly, then there is no urgency for interest rate cuts. Without more accommodative policies or improved liquidity conditions, risk appetite remains fragile. Bitcoin's trading style is more like a leveraged growth asset than gold, so it naturally faces difficulties in this environment. The key is to confirm the trend. Currently, PCE data has not confirmed the arrival of a new deflationary cycle. Although CPI has declined recently, the PCE, the inflation indicator preferred by the Federal Reserve, remains close to 3% and shows no further downward trend. This reduces the likelihood of a near-term rate cut and maintains a tight liquidity situation. In summary, this week's data did not show any urgency. Bitcoin is in a rare downtrend, funds are flowing into gold, inflation has not given the Fed room for easing, and market momentum remains severely weak. This background makes it difficult to foster a sustained recovery. Avoid forcing trades before the market landscape changes. Wait for market confirmation signals. Act when the market improves.</p></div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/3484c30199fbe6fb2526cfc393e45a04.jpg",
            "link": "https://www.coinlive.com/news/three-signals-indicate-that-bitcoin-s-rebound-is-still-some-time",
            "pub_date": "2026-02-28 12:19:40",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 250630,
            "title": "On-chain detective ZachXBT exposes another insider trading scandal. What are the implications?",
            "description": "<div class=\"share___SVvtl\"><div><p style=\"text-align: left;\">Source: Galaxy; Compiled by: Jinse Finance</p><p style=\"text-align: left;\">After days of speculation, on-chain detective ZachXBT released a highly anticipated insider trading investigation report on Thursday. The target company is Axiom, a trading platform and one of the most profitable companies in the cryptocurrency space, with revenues of approximately $390 million to date.</p><p style=\"text-align: left;\"><strong>The most famous anonymous detective in the cryptocurrency space released information three days ago, hinting at an investigation, but without revealing the target, which sparked a frenzy of speculation on cryptocurrency Twitter and prediction markets.</strong> Traders placed bets, speculating on which company was the target, with potential targets including Pump.fun, Meteora, World Liberty Financial, Wintertermute, Hyperliquid, Upbit, Jupiter, and others.</p> A dedicated prediction market on Polymarket saw trading volume surge to over $39 million. Around 1 a.m. Thursday, New York time, the probability of Axiom being suspected spiked to approximately 40%, a result confirmed by ZachXBT's revelation, which had been anticipated by insiders. ZachXBT published a detailed post accusing Broox Bauer, a business development employee at the star startup Y Combinator (Winter 2025 cohort), of abusing user privacy data for profit. Traders love the Axiom platform because of its fast execution speed and ability to quickly grab orders. The platform also offers perpetual futures trading. According to ZachXBT, the core of the scheme lies in the fact that Axiom's internal customer support control panel has virtually no controls or monitoring, making it accessible to internal employees. These tools can link wallet addresses to user identities, connected wallets, registration data, and transaction history. A user might trade using 10 different wallets and believe themselves to be anonymous, but Axiom's tools can link these 10 wallets, revealing their holders. This makes this incident different from typical on-chain snooping on transparent blockchains like Solana. Broox allegedly used this wealth of data to compile a Google Sheet containing the wallet addresses of targeted key opinion leaders (KOLs) and used it to preemptively intervene before Memecoin's \"shills\" could promote the token in their Telegram groups. The most shocking evidence is a private phone recording in which Broox claims he can “track any user” and “find out everything related to that user.” In the recording, he describes a strategy of starting with 10 to 20 wallets “so it won’t look suspicious,” and then gradually scaling up. He also boasts about using the same permissions to help a friend quickly earn $200,000. If ZachXBT’s allegations are true, this is not the first time a cryptocurrency industry employee has been arrested for trading with insider information. The U.S. Attorney’s Office for the Southern District of New York (SDNY) has a poor track record in handling such cases. May 2023: Ishan Washi was sentenced for leaking information about new coin listings on Coinbase to an accomplice. August 2023: Nathanial Chastain was sentenced for insider trading because he knew which NFTs would be displayed on OpenSea's homepage. April 2024: Avraham Eseinberg was convicted of manipulating the Mango market. ZachXBT points out that Broox's offices are located in New York City and believes the Axiom case \"is a great opportunity for the U.S. Attorney's Office for the Southern District of New York.\" This office is led by Jay Clayton, who served as chairman of the Securities and Exchange Commission during Trump's first term and is very familiar with the cryptocurrency market. Axiom responded that it was \"shocked and disappointed,\" promising to revoke employees' access to these tools and to continue investigating those suspected of wrongdoing. Meanwhile, Broox has reportedly deleted his LinkedIn account. ZachXBT delayed the release of this news for several days, leading people to believe it would reveal a shocking secret, enough to cause a huge market shock. However, when it was discovered that the whistleblower was merely an Axiom employee trading the relatively small-cap Meme coin, the story felt somewhat anticlimactic. This wasn't because the allegations were minor, but because such misconduct is almost commonplace in the Meme coin ecosystem, and the market began to suspect that a company of systemic importance to the cryptocurrency market might be behind it all. For Zack Pokorny of Polymarket and Galaxy Research, this is another victory. He has written extensively on the value of informational signals in predicting the market. Hours before ZachXBT released its research findings, Axiom YES's stock price surged, suggesting that insiders with inside information were pricing in the future. Bubblemaps subsequently discovered a potential link between Broox's wallet and a top Polymarket trader's wallet, noting that the latter also purchased Axiom YES shares, a common insider tactic. However, it remains unclear whether the two wallets belong to the same person. Observers speculate that the Axiom team may be profiting from the market, calling it \"insider trading using investigations into their own insider activities.\" It's worth noting that Polymarket currently estimates a 31% probability of Axiom issuing a token this year, but this figure is only for reference due to the market's relatively low trading volume. If a token issuance is planned, the reputational impact of this investigation will further complicate matters. More broadly, this story highlights systemic problems within the rapidly growing cryptocurrency trading platform landscape. Axiom developed a product with wallet tracking and analytics capabilities, then allowed employees unsupervised access to data containing vast amounts of user privacy information. The consequences were predictable. As platforms rapidly expand and generate huge revenues, internal controls often lag far behind.</div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/6710452a73ae36b59eeba4f08e81f10d.jpg",
            "link": "https://www.coinlive.com/news/on-chain-detective-zachxbt-exposes-another-insider-trading-scandal-what-are",
            "pub_date": "2026-02-28 12:01:14",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 250628,
            "title": "AI Capital Divergence: OpenAI's Ubiquitous Empire vs. Anthropic's Corporate Fortress",
            "description": "<div class=\"share___SVvtl\"><div><p style=\"text-align: left;\">Author: Tz; Source: X, Tz_202</p><p style=\"text-align: justify;\">2</p><p></p><blockquote><p style=\"text-align: left;\">OpenAI's $110 billion funding round has pushed the capital threshold of the AI ​​industry to the level of sovereign infrastructure. Just half a month ago, Anthropic broke its own record with $30 billion. This article dissects the revenue cross-prediction, the computing power war among cloud giants, the attack and defense of coded intelligent agents, the collapse of venture capital rules, and the entry of Middle Eastern sovereign capital behind this duopoly battle, asking a core question: As the AGI race enters the commercial validation phase, which will be the first to pass the ultimate judgment of an IPO: the \"ubiquitous empire\" or the \"enterprise fortress\"?</p><p> </p></blockquote><h2 style=\"text-align: left;\"></h2><h2 style=\"text-align: left;\">Introduction: 2026, the Silicon Valley Melting Pot and the Arrival of the Duopoly Era</h2><p style=\"text-align: left;\">In just a few weeks in February 2026, the global tech world witnessed a capital collision worthy of being recorded in business history. This not only broke venture capital records but also redefined the valuation boundaries of technology companies in the capital market.</p><p style=\"text-align: left;\">On February 27, 2026, OpenAI released its ambitious strategic blueprint, \"Scaling AI for everyone,\" and simultaneously dropped a bombshell announcement that shook Wall Street: an additional $110 billion in funding, pushing its pre-money valuation to $730 billion.</p><h2 style=\"text-align: left;\"> Just two weeks prior, on February 12th, its strongest competitor, Anthropic, announced the completion of a $30 billion Series G funding round, valuing the company at $380 billion post-money. If we juxtapose these two deals, one fact is undeniable: the capital threshold for maintaining cutting-edge AI research has exceeded the limits of traditional venture capital, and its capital intensity is approaching the macro-era of \"national-level sovereign infrastructure construction.\" However, the underlying industrial currents behind these figures are far more noteworthy than the funding amounts themselves. These two almost simultaneous strategic statements mark the end of the Wild West era of generative AI, once defined by rapid trial and error and unstructured experiments. In its place stands a massive duopoly with extremely rigid hierarchies. The focus of competition has long since shifted from the geeky debate of \"whose model has larger parameters\" to a battle over the underlying architecture of digital civilization. Through the capital battles of February, we see a dramatic divergence between two drastically different paradigms of empire building: OpenAI, leveraging its unparalleled user base and aggressive capital leverage, is attempting to build a ubiquitous \"ubiquitous empire\" spanning both hardware and software; while Anthropic, founded by former OpenAI executives, deliberately avoids the noisy consumer market, building a solid \"corporate fortress\" in the deep waters of the business market through stringent security commitments and efficient capital operations. In this ultimate marathon towards Artificial General Intelligence (AGI), the deciding factor is no longer simply the ability to generate intelligence. From the impending collision of revenue growth curves to the computing power dark web laid by cloud giants in the underlying infrastructure; from the complete collapse of the exclusive dogma of Silicon Valley venture capital to Middle Eastern sovereign wealth using AI as a bargaining chip in geopolitical games, the showdown between OpenAI and Anthropic is reshaping the underlying rules of the global technology industry. 1. The Crossroads of Growth: The Ultimate Reversal of Scale and Self-Generating Capacity In business history, few moments have allowed people to intuitively feel the power of compound annual growth rates as much as the AI ​​market in 2026. While OpenAI currently maintains a dominant position in terms of absolute total revenue, the underlying logic of market leadership is undergoing a dramatic paradigm shift. According to quantitative modeling analysis by the authoritative firm Epoch AI, since both companies surpassed the $1 billion annualized revenue (ARR) threshold, Anthropic has maintained a compound annual growth rate (CAGR) of approximately 10x, while OpenAI, as the industry pioneer, has maintained an CAGR of approximately 3.4x. Extending these two drastically different growth curves forward, the predictive model strongly points to a clear and historically significant \"crossroads.\" If the current trend continues, Anthropic's total annualized revenue is highly likely to completely surpass OpenAI around August 2026, with an estimated annualized revenue of approximately $43 billion upon achieving this. Supporting this turnaround prediction is Anthropic's highly focused \"cash-generating machine.\" In its Series G funding announcement in February 2026, Anthropic disclosed that its annualized revenue growth rate had reached $14 billion. The expansion speed is astonishing—just two months prior, this figure was only $9 billion, and three years ago it was zero. This surge is entirely driven by highly sticky enterprise-level demand: in the past year, the number of customers spending over $100,000 annually on the Claude ecosystem has increased sevenfold, with over 500 leading companies exceeding $1 million in annualized spending. More importantly, Anthropic is painting a highly certain path to financial sustainability for Wall Street. The company predicts its cash burn rate will significantly narrow to one-third of revenue (approximately $4.6 billion) in 2026, further decreasing to 9% in 2027, and has set a hard target of achieving full profitability by 2028. To stabilize morale on the eve of a potential IPO, Anthropic even launched an internal secondary market stock sale program worth $5 billion to $6 billion, allowing employees to cash out at a discounted valuation of $350 billion. This restrained and mature financial operation demonstrates a level of financial sophistication disproportionate to its relatively short history. </h2><p style=\"text-align: left;\"><strong>Table 1: Comparison of Core Financial and Capitalization Indicators</strong></p><p style=\"text-align:center\"><img alt=\"dsGX3FXz6Q8NlgoctCsxtRqFeu5J8LMZQT0TSRkQ.jpeg\" src=\"https://img.jinse.com.cn/7436413_watermarknone.png\" title=\"7436413\"/></p><p style=\"text-align: left;\">When we turn our attention to OpenAI, we see a complex picture of scale and losses coexisting.</p><p style=\"text-align: left;\">Undoubtedly, OpenAI possesses the largest user base of this era. As of the end of 2025, its ARR has exceeded $20 billion, ChatGPT has over 900 million weekly active users, and has accumulated over 50 million consumer subscriptions.</p><p style=\"text-align: left;\"> However, converting massive consumer traffic into highly sticky business value has proven to be an expensive battle. OpenAI's current business model still heavily relies on huge infrastructure expenditures. According to internal documents, the enormous computing costs are expected to lead to a structural operating loss of up to $14 billion for OpenAI in 2026. On the road to break-even, OpenAI has set its sights on 2030, a full two years later than Anthropic's timeline. Faced with a massive annual loss of $14 billion and the distant expectation of 2030, OpenAI has had to use a pre-money valuation of $730 billion and a $110 billion funding plan to fund future expansion. Here, the ultimate divide in AI capital is revealed for the first time on financial statements: on one side is OpenAI's \"miracle-making through sheer force\" and intense thirst for capital, leveraging its scale advantage in the C-end market; on the other side is Anthropic's \"efficient compounding\" driven by pure B-end stickiness and its converging profit statements. In the AI ​​capital arena, growth rate is gravity—it determines who has the ability to pull their competitors into their orbit. 2. The Opposition of Business Landscapes: Horizontal Ubiquitous Ecosystem vs. Vertical Enterprise Fortresses Before declaring who the ultimate winner in the enterprise AI market is, we must first understand the true flow of current IT budgets. The current market structure is less a stable state of duopoly and more a period of fluid observation driven by collective customer anxiety. The data reveals a thought-provoking reality: a staggering 79% of companies paying for Anthropic are also paying for OpenAI. This exorbitant \"double-spending\" phenomenon profoundly demonstrates that global CIOs are still strategically hedging in the face of this technological tsunami; no one dares to prematurely stake their company's digital lifeline on a single vendor. When 79% of customers are paying for two companies simultaneously, there are no winners in this market—only two different kinds of irreplaceability. To break this procurement deadlock, OpenAI's solution is \"ubiquitousness.\" As its manifesto, \"Scaling AI for everyone,\" reveals, OpenAI is building a ubiquitous empire that spans the software and physical worlds, attempting to penetrate every pore. On the enterprise side, OpenAI recognizes its weakness in complex system integration, and thus chooses to leverage the power of traditional business centers. In early 2026, OpenAI announced the formation of the \"OpenAI Frontier Alliance,\" deeply partnering with leading consulting giant McKinsey. Its strategic intent is clear: leveraging McKinsey's vast global political and business network to help companies restructure their internal workflows, directly embedding OpenAI's \"digital employees\" deep within the organizational structures of traditional giants. However, OpenAI's ambitions extend far beyond B2B software. At the consumer level, it is undertaking a radical cross-industry offensive—acquiring io Products, founded by former Apple chief designer Jony Ive, for $6.5 billion, and secretly developing native AI-powered smart hardware. Through this device, which may integrate vision and environmental perception capabilities, OpenAI attempts to bypass the gatekeeper monopoly of Apple and Google in mobile operating systems, positioning itself as the \"first entry point\" for next-generation human-computer interaction. Coupled with its aggressive expansion into vertical sectors such as healthcare (acquiring Torch) and finance (integrating LSEG data), OpenAI aims to become the foundational \"water, electricity, and gas\" of the digital age. Faced with the vast ocean of horizontal expansion by OpenAI, Anthropic chose to dig its own well, building a highly secure \"enterprise fortress.\" This company, founded by security fundamentalists, exhibits an almost obsessive business restraint: it not only completely abandoned the bustling consumer hardware market but even spent heavily on advertising during the Super Bowl, simply to pledge to the public that its model would be \"ad-free forever.\" Anthropic firmly anchors its destiny to a pure SaaS and API-based paid model. Anthropic understands that the most lucrative profits in the enterprise market do not lie in generic chatbots but in deeply penetrating complex, high-value cognitive workflows. This strategy has yielded significant returns—its AI-driven coding tool, Claude Code, alone has achieved an annualized revenue run rate (ARR) exceeding $2.5 billion. This tool runs directly within the developer's local integrated development environment (IDE), becoming an indispensable efficiency multiplier for millions of software engineers through highly autonomous background task management. Coupled with dedicated capability packages for compliant industries (such as healthcare and life sciences) and a data residency control principle promising never to use customer-proprietary data to train models, Anthropic precisely targets the vulnerabilities of Chief Information Security Officers (CISOs) in various countries. In the highly compliant and complex waters disturbed by OpenAI's aggressive approach, Anthropic has quietly built a highly sticky moat. </p><p style=\"text-align: left;\"><strong>Table 2: Comparison of Market Entry (GTM) Strategy Dimensions</strong></p><p style=\"text-align:center\"><img alt=\"QTd7r3ITfNhzCAeeNlNerrKVOTXqD6psgcisF9H4.jpeg\" src=\"https://img.jinse.com.cn/7436415_watermarknone.png\" title=\"7436415\"/></p><h2 style=\"text-align: left;\"></h2><h2 style=\"text-align: left;\">3. The Hidden Battle of Technology: From Ultimate Computing Power Tax Collectors to the Orchestration Rights of Intelligent Agents</h2><p style=\"text-align: left;\">If the commercial landscape at the application layer is the visible positional battle, then deep within the cloud infrastructure, beyond the sight of the public, a hidden battle that will determine the flow of AI profits over the next decade has already begun.</p><p style=\"text-align:center\"><img alt=\"3jJGt4OqLwRdrbTEvcwBnxt91ykG3lJEEG8dyDFN.jpeg\" src=\"https://img.jinse.com.cn/7436418_watermarknone.png\" title=\"7436418\"/></p><p style=\"text-align: left;\">However, OpenAI did not sit idly by while Anthropic dominated the coding race. Just before the February funding storm discussed in this article, OpenAI launched GPT-5.3-Codex on February 5th—its most powerful coding agent model to date. Unlike previous versions that focused solely on code generation, GPT-5.3-Codex is designed as a general-purpose agent performing \"full-spectrum computer work\": it not only writes and reviews code but also drives the entire software engineering process, including testing, debugging, and deployment.</p> ... OpenAI claims that GPT-5.3-Codex participated in its development—early versions were used for debugging and production deployment. Coupled with the concurrently released native macOS Codex desktop application, developers can manage AI agents in parallel across multiple project threads, review differences, and transfer them to the editor with a single click, much like managing an engineering team. Even more significant is the GPT-5.3-Codex-Spark variant released a week later (February 12th). This is OpenAI's first model that doesn't rely on NVIDIA GPUs—it features Cerebras' Wafer Scale Engine 3, achieving ultra-low latency output of over 1000 tokens per second, pushing coding interaction towards a near-instantaneous response experience. This move not only directly challenges Anthropic's coding dominance but also suggests that OpenAI is actively developing a heterogeneous computing ecosystem beyond NVIDIA. Currently, the coding agent field presents a clear \"two-horse race.\" Claude Code, with its million-level token context window and deep reasoning capabilities for complex legacy codebases, plays the role of a \"senior architect\"; while GPT-5.3-Codex, known for its speed and automated pipeline, is more like a \"highly productive engineering team.\" In fact, many enterprise engineering teams have begun to deploy both simultaneously—handling routine coding to Codex and leaving complex architectural decisions to Claude Code. This battle in the coding field may be the closest thing to a zero-sum game between OpenAI and Anthropic. When code becomes the most expensive consumer product of AI, coding agents are the money-printing machines of this era. And on the ultimate paradigm of human-computer interaction—\"how to let AI control computers\"—the philosophical differences between the two have reached their peak. OpenAI offers a highly managed \"Operator\" mechanism. This is a browser-based web agent that emphasizes plug-and-play functionality with \"zero technical barriers\" for consumers, but at the cost of an extremely restricted and closed environment, unable to access local files or underlying software. Conversely, Anthropic adheres to a geeky and deep \"Computer Use\" approach. It allows the Claude model to calculate screen coordinates like a human, directly take over the mouse and keyboard, and natively interact with any legacy desktop operating system or local proprietary database. While this approach currently requires a high level of developer configuration, it perfectly aligns with Anthropic's initial intention to design for complex backend enterprise automation. OpenAI aims for one-click cloud-based management, while Anthropic seeks complete control over the underlying infrastructure. This divergence in approaches is drawing a dividing line for the architectural standards of enterprise AI in the next decade. 4. New Rules of Capital: The Failure of Exclusivity in Venture Capital and the Game of Sovereignty In the traditional dogma of Silicon Valley venture capital (VC), there is a sacred and inviolable bottom line: the principle of exclusivity. Top institutions would never simultaneously invest in direct competitors in two different sectors, as this would not only compromise board confidentiality but also be seen as a betrayal of loyalty to the entrepreneur. However, by 2026, facing AGI, possibly the largest “Total Addressable Market (TAM)” in human history, this orthodox concept completely collapsed. A new term was born on Wall Street – the “Mega-round Exception.” When single-round funding soared to tens of billions of dollars and company valuations approached the trillion-dollar mark, moral purity gave way to the fear of survival. It has been revealed that at least twelve prominent venture capital entities, including Founders Fund co-founded by Peter Thiel and the enigmatic ICONIQ, known for managing the wealth of Silicon Valley tech giants' families, are simultaneously providing substantial funding to OpenAI and Anthropic. For these top-tier investors, the risk of missing out on future opportunities due to \"choosing the wrong target\" far outweighs the so-called conflict of interest. However, absorbing such a massive wave of capital inevitably requires companies to compromise on their fundamental core principles. To overcome institutional hurdles in securing $100 billion in funding, OpenAI completed a complex capital restructuring in October 2025. It explicitly spun off its non-profit entity, the OpenAI Foundation (whose equity value was anchored at approximately $130 billion), while completely reshaping its core business engine into the for-profit OpenAI Group PBC (Public Interest Corporation). This move sent the clearest signal to global capital markets: the laboratory once driven by geek idealism has transformed into a commercial machine that can be precisely priced and traded by Wall Street. However, if Silicon Valley VCs merely broke the rules, the strong entry of Middle Eastern sovereign wealth funds fundamentally rewrote the rules of the game. In Anthropic's $30 billion Series G funding round, MGX, a technology investment vehicle backed by the UAE, was prominently listed as a co-lead investor. Meanwhile, MGX is even deeply involved in negotiations for OpenAI's $110 billion funding round, and Saudi sovereign wealth funds like Humain are also making moves everywhere. The massive influx of sovereign capital reveals the fundamental difference between this AI boom and any previous internet bubble: what they want is not simply financial returns (ROI). For Abu Dhabi or Riyadh, hundreds of billions of dollars are merely a stepping stone. They use capital as leverage to exchange for \"technological sovereignty\" in the great power game. These sovereign wealth funds, through massive injections, are forcing Western AI giants to localize the construction of advanced computing infrastructure (such as Saudi Arabia's planned 500-megawatt data center), using this as hard currency to break through geopolitical blockades and obtain import quotas for tens of thousands of top-tier AI chips (such as the 35,000 advanced chips approved for purchase by the UAE). At this point, cutting-edge AI has completely shed its commercial software guise and risen to the level of a strategic asset in the great power game. In this capital network woven by Wall Street hedge funds, Silicon Valley rebels, and Middle Eastern oil tycoons, no one talks about the simplicity of technology anymore; everyone is vying for the highest position in the coming digital new world. 5. The Endgame: Welcoming the 2026-2027 IPO Frenzy With the exponential leap in model capabilities, the ideological and ethical frameworks guiding the deployment of these superintelligent systems are undergoing unprecedented stress tests. OpenAI and Anthropic have shown irreconcilable differences in how to handle relations with state apparatuses, especially military and defense entities. In February 2026, a high-profile political-business conflict will make this difference fully public. At the time, the U.S. Department of Defense (DoD) demanded full, unrestricted access to Anthropic's Claude model and ordered the removal of all safety guardrails to allow the military to use AI in a wide range of unspecified areas—potentially involving large-scale domestic surveillance or lethal autonomous weapons systems. Faced with the Pentagon's ultimatum—that non-compliance would result in the cancellation of a $200 million contract and potential designation as a \"supply chain risk\" entity with significant financial implications—Anthropic CEO Dario Amodei responded strongly. He publicly stated that the company was \"in good conscience\" resolutely refusing to remove the security measures, thus upholding its \"constitutional AI\" principles based on the Universal Declaration of Human Rights. From Wall Street's perspective, this was not merely a declaration of values, but also a shrewd business positioning. While this rejection directly resulted in a short-term loss of $200 million in government revenue, it significantly solidified Anthropic's brand equity among privacy-conscious European companies, heavily regulated financial institutions, and ESG-focused institutional investors. This further deepened Anthropic's moat as a \"highly secure, resilient alternative.\" In contrast, OpenAI has adopted a drastically different public stance in its pursuit of a \"ubiquitous empire.\" To maintain its vast ecosystem, OpenAI has continuously relaxed restrictions on its collaborations with military contractors, deepened its integration with Microsoft, which has a large defense business, and even advanced the development of hardware devices with facial recognition surveillance capabilities. OpenAI prefers a pragmatic philosophy of \"iterative deployment\"—trial and error in real, complex environments, thus tolerating potential dual-use risks. Behind these drastically different ethical principles and business empires lies a shared countdown to the end. The window of opportunity for the private equity market to burn money without restraint is closing irrevocably. Whether it's Anthropic's $380 billion valuation backed by a clear 2028 profit commitment and massive secondary market employee stock option cashing out, or OpenAI's $730 billion pre-money valuation and the subsequent $35 billion investment from Amazon tied to its IPO trigger clause, both are sending the same clear signal: massive amounts of capital are no longer paying for mere laboratory research; they demand a clear exit strategy. The race towards Artificial General Intelligence (AGI) has moved beyond the parameter race stage and fully entered the commercial validation phase. OpenAI's \"ubiquitous empire\"—attempting to encompass everything from underlying cloud computing power to edge smart hardware, feeding an omnipotent super brain with endless traffic—and Anthropic's \"enterprise fortress\"—abandoning all the glitz and glamour of the consumer market, attempting to become the secure foundation of the global digital economy with restrained security commitments and deep, code-level workflows. These two vastly different systems will ultimately converge in the largest wave of tech IPOs in human history between 2026 and 2027. At that time, what will determine who reigns supreme in the digital age will no longer be the benchmark tests self-directed by individual laboratories, but rather the investors who vote with their hard-earned money in the public market.</div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/d6d3089c2d68509cdbc66995d7ec4c8e.jpg",
            "link": "https://www.coinlive.com/news/ai-capital-divergence-openai-s-ubiquitous-empire-vs-anthropic-s-corporate-fortress",
            "pub_date": "2026-02-28 10:11:32",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 250627,
            "title": "What are the benefits of the three tech giants \"transferring\" 110 billion to OpenAI?",
            "description": "<div class=\"share___SVvtl\"><div><p style=\"text-align: left;\">Author: Su Yang</p><p style=\"text-align: left;\">On February 27th, OpenAI announced the completion of a new $110 billion funding round, valuing the company at $730 billion pre-money.</p><p style=\"text-align: left;\">This is OpenAI's second record-breaking fundraising round, following its $41 billion funding round last year, and is the largest private technology company funding round to date.</p><p style=\"text-align: left;\">This round of funding was led by strategic investors, with Amazon investing $50 billion, and SoftBank and Nvidia each investing $30 billion.</p><p style=\"text-align: left;\"> Following this round of financing, OpenAI's cash reserves have increased to approximately $150 billion. OpenAI stated that the funds will primarily be used to expand its computing infrastructure to meet rapidly growing user demand. Amazon to Invest $50 Billion in Phases As the most generous investor in this round of financing, Amazon's committed $50 billion investment will be implemented in two phases: the first phase of $15 billion has been confirmed, and the remaining $35 billion will be available after OpenAI completes its IPO or achieves AGI. Therefore, Altman quickly stated that he is open to going public at the appropriate time. Regarding AGI, according to the previous contract between OpenAI and Microsoft, AGI refers to \"a highly autonomous system capable of surpassing humans in the most economically valuable work.\" OpenAI's charter includes a special clause: once AGI is achieved, Microsoft will lose access to its technology. But Amazon isn't just providing financial support; the two companies have also signed a comprehensive technology cooperation agreement—Amazon will exchange its own chips and cloud services for OpenAI's models and technology. The core clause of this cooperation is the purchase of computing power. OpenAI will pay AWS an additional $100 billion in computing power over the next eight years, on top of its existing $38 billion contract. A significant portion of this $100 billion will be used on Amazon's self-developed Trainium chips. OpenAI has committed to purchasing approximately 2 gigawatts of Trainium computing power, including the upcoming Trainium 3 and the Trainium 4, launching in 2027. Amazon CEO Andy Garcetti specifically mentioned that Trainium chips offer 30% to 40% better performance than comparable GPUs, and \"now both of our leading AI labs are using them.\" Another company is Anthropic, which has recently been embroiled in a dispute with the US government. OpenAI's other collaboration with Amazon is at the product level; the two companies will jointly develop a \"Stateful Runtime Environment\" to run on Amazon Bedrock. This environment allows developers to maintain context, remember previous work, and collaborate across tools when calling OpenAI models. AWS has also secured exclusive third-party distribution rights for OpenAI's enterprise platform, Frontier. There's also a more direct layer of collaboration: Amazon will use OpenAI models to optimize its consumer applications. The two companies will jointly develop custom models for use by Amazon's internal teams, covering product lines from e-commerce to smart hardware. Nvidia's $30 Billion Investment: Shareholder + Supplier The collaboration between Nvidia and OpenAI was once rumored to have fallen through, especially after Jensen Huang's statement that investing $100 billion in OpenAI was never a promise. However, the investment was ultimately finalized, albeit at a significantly lower amount than the rumored $100 billion, with only $30 billion to be paid in three installments. According to the announcement, the two companies finalized a new computing power partnership: Nvidia will provide OpenAI with 3 gigawatts of dedicated inference computing power and 2 gigawatts of training computing power for the Vera Rubin system—on top of the Hopper and Blackwell systems already running on Microsoft, Oracle Cloud, and CoreWeave. If we convert this to computing power, 1GW corresponds to $50 billion. Nvidia's support for OpenAI is worth far more than the rumored $100 billion. From this perspective, Nvidia is not only a shareholder of OpenAI and its largest chip supplier, but it's also using its own money to help OpenAI buy its own chips. Most of the $30 billion in funding will ultimately return to Nvidia in the form of purchasing computing power. In short, it's still the same \"circular financing\" narrative. SoftBank's $30 billion investment: IPO is more important than anything else. Like Nvidia, SoftBank's $30 billion investment commitment will also be disbursed in three installments. Masayoshi Son's thinking is relatively simple: OpenAI is currently the most likely candidate for an IPO in the AI ​​sector, and SoftBank needs an IPO to boost the performance of its Vision Fund. Sources say this round of financing is seen as a crucial step before OpenAI's IPO, which could begin as early as the end of this year. Compared to the other two investors, SoftBank's other role is that of a matchmaker. According to sources, OpenAI is expected to secure approximately $10 billion in primary equity financing, with commitments finalized within the next month. Investors include sovereign wealth funds and investment firms. It is speculated that these investors may have entered through SoftBank. Microsoft: No Funding This Round, But Position Remains Unchanged. In response to Amazon's entry into the market, Microsoft and OpenAI issued a joint statement today, emphasizing that their partnership remains unaffected. The statement says that Microsoft remains the exclusive cloud provider for OpenAI's stateless API for its models. All API calls to OpenAI models that are stateless (without retaining context) are hosted on Azure. This is currently the most common way to call OpenAI models. Meanwhile, OpenAI's own products (including the newly released Frontier) will continue to be hosted on Azure. Frontier is OpenAI's newly launched enterprise platform, enabling enterprises to deploy their own AI agents. The intellectual property licensing and revenue-sharing arrangements between Microsoft and OpenAI remain unchanged. However, OpenAI has the right to purchase computing power from elsewhere, including large-scale infrastructure projects like Stargate. The “Recurring Financing” Narrative: A Copy-Paste Approach Looking at the investments and returns of the aforementioned investors together, as mentioned earlier, it still follows the “recurring financing” narrative: Amazon invested $50 billion in exchange for OpenAI’s model technology licensing and a $100 billion cloud service order. Nvidia invested $30 billion in exchange for OpenAI’s chip procurement commitment. SoftBank invested $30 billion, betting on an IPO exit opportunity. Microsoft didn’t invest in this round, but retained its API exclusivity; Microsoft will receive a share of every API call OpenAI sells in the future. Following this round of financing, OpenAI has an additional $110 billion in its accounts and holds the computing power resources of three tech giants. The **cost** is that it has pre-locked future technology licensing and cloud service procurement to its shareholders. Moreover, Amazon and SoftBank have made an OpenAI IPO a key condition for fulfilling their investment commitments. Now, OpenAI's shareholder list includes Microsoft, Amazon, Nvidia, and SoftBank—four giants with overlapping and conflicting businesses. Balancing the interests of these shareholders will be a major challenge for Sam Altman. ChatGPT has over 900 million weekly active users. Returning to the business level, OpenAI certainly needs this money right now. OpenAI already had approximately $40 billion in cash on hand, and with this round of financing, its available funds have increased to approximately $150 billion. The company expects to achieve positive free cash flow for the first time by 2030. Until then, most of the funds will be invested in data center operations, chip procurement, and cloud service expenditures. Financial data cited by the Financial Times, based on sources familiar with the matter, is telling: Revenue is projected to be approximately $13 billion in 2025, reaching $30 billion this year, with a target of over $60 billion in 2027 and over $280 billion in 2030. The growth curve is steep, but costs are increasing even faster. Regarding user data: According to official data released by OpenAI, ChatGPT currently has over 900 million weekly active users, over 50 million consumer subscribers, and over 9 million paying business users. Codex, a programming tool launched this year, has seen its weekly active users triple since the beginning of the year, reaching 1.6 million. While this data growth is impressive, competitors are not idle. Google's Gemini is making steady progress in the consumer market, while Anthropic has already taken the lead in the enterprise market. OpenAI executives stated that by the end of this year, half of their revenue will come from enterprise customers, up from the current 40%. This means that in the coming quarters, OpenAI must directly compete with Anthropic to achieve a 10% increase. Another detail worth noting is the change in the equity structure. Following this round of financing, the value of the for-profit business shares held by the OpenAI Foundation, a non-profit organization spun off from OpenAI, will rise to over $180 billion by 2025. Sources familiar with the matter say that if investor demand is strong, the foundation may sell up to $10 billion in stock for charitable expenditures and recruitment. In other words, after this round of 110 billion yuan in financing, there may still be another wave of OpenAI stocks available for purchase in the private equity secondary market.</p></div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/f499e2a6330bdf30b08b6e68ab7fdafe.jpg",
            "link": "https://www.coinlive.com/news/what-are-the-benefits-of-the-three-tech-giants-transferring",
            "pub_date": "2026-02-28 09:38:06",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        }
    ]
}