{
    "data": [
        {
            "id": 212674,
            "title": "WLFI is not a presidential election: it just collects advertising fees",
            "description": "<div class=\"share___SVvtl\"><div><p style=\"text-align: left;\">Author: Observer Lao Wang; Source: C Labs Crypto Observation</p><p style=\"text-align: left;\">In addition to widely recognized applications such as stablecoins, the essence of most cryptocurrencies is actually the monetization of influence. </p><p style=\"text-align: left;\">From some of Trump's operations, his family has a deep understanding of this nature~</p><p style=\"text-align:center\"><img src=\"https://img.jinse.cn/7344486_image3.png\"/></p><p style=\"text-align: left;\">In addition to the $Trump token as an \"electronic souvenir\", the so-called \"Presidential Strict Selection\" WLFI is the long-term cash cow. The daily person in charge of this product is Trump's second son Eric:</p><p style=\"text-align:center\"><img src=\"https://img.jinse.cn/7346662_image3.png\"/></p><p style=\"text-align: left;\">This Eric also played a trick. After sending a tweet last night that he was optimistic about Ethereum in the long term, he liquidated Ethereum:</p><p style=\"text-align:center\"><img src=\"https://img.jinse.cn/7346663_image3.png\"/></p><p style=\"text-align: left;\">So is Eric admitting his loss? </p><p style=\"text-align: left;\">Since the establishment of the \"Presidential Strict Selection\" position, some people have calculated that the floating loss has exceeded 15%. In fact, WLFI has never lost money. </p><p style=\"text-align: left;\">Because these \"strict selections\" are essentially advertising fees. </p><p style=\"text-align: left;\">Because as long as a big investor buys $10 million of $WLFI, then he can buy a token designated by the project party. </p><p style=\"text-align: left;\">And the current agreement of $WLFI cannot be traded, only voting rights, which are not transferable. It can be considered as the Pixiu plate opened by Trump's family. </p><p style=\"text-align:center\"><img src=\"https://img.jinse.cn/7346664_image3.png\"/></p><p style=\"text-align: left;\">As for the purchase amount, the maximum is 40% of the purchase amount of $WLFI. </p><p style=\"text-align: left;\">Therefore, the essence of the Ethereum community's crazy increase in Ethereum positions due to \"Presidential Strict Selection\" some time ago is that Ethereum dealers bought more $WLFI:</p><p style=\"text-align:center\"><img src=\"https://img.jinse.cn/7346665_image3.png\"/></p><p style=\"text-align: left;\">After this wave of clearing Ethereum, the largest position of \"Presidential Strict Selection\" became Sun Yuchen's TRX. </p><p style=\"text-align: left;\">And before that, Justin Sun had announced that he had purchased $75 million of WLFI in two installments:</p><p style=\"text-align:center\"><img src=\"https://img.jinse.cn/7346666_image3.png\"/></p><p style=\"text-align: left;\">These two purchases are likely to have one designated TRX and one designated ETH. </p><p style=\"text-align: left;\">After all, Justin Sun also holds a large amount of Ethereum and needs to ship it. Similar to Eric's operation this time, Sun Ge has already operated it once two months ago~</p><p style=\"text-align:center\"><img src=\"https://img.jinse.cn/7346667_image3.png\"/></p><p style=\"text-align: left;\">So friends in the crypto circle should gradually cultivate their own cognition, and don't trust the big V to bring goods!</p><p style=\"text-align: left;\">Finally, a warm reminder that other tokens such as aave/link are all on the upper-level relationship route. There are many official announcements of cooperation, but basically no one uses the products that have landed.</p><p style=\"text-align: left;\">That's all, everyone should learn from it~</p></div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/6330e2ca1916605c8df88a2f4f10f515.jpg",
            "link": "https://www.coinlive.com/news/wlfi-is-not-a-presidential-election-it-just-collects-advertising",
            "pub_date": "2025-02-04 14:56:28",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 212673,
            "title": "Elon Musk Kicks Off X Spaces for D.O.G.E, Details USAID Termination Plan Backed by Trump: Is the Duo on a Warpath?",
            "description": "<div class=\"share___SVvtl\"><div><h1>Elon Shares D.O.G.E Plan on X Spaces </h1><p>Elon Musk’s 50-minute X Spaces session on Monday was a revealing glimpse into his ambitious plans, presented with clarity and President Donald Trump’s backing. </p><p></p><p>Joined by Republican senators Joni Ernst and Mike Lee, and <a href=\"https://www.coinlive.com/news/elon-musk-and-vivek-ramaswamy-roll-out-daring-d-o-g-e-plan \" target=\"\">former D.O.G.E co-lead Vivek Ramaswamy</a>, Musk outlined his bold strategy to reduce federal spending and overhaul regulations. </p><p></p><p>His primary focus is dismantling the US Agency for International Development (USAID), which he believes is beyond redemption, and consolidating its effective parts under the State Department. </p><div class=\"media-wrap embed-wrap\"><div><blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\">First DOGE 𝕏 Spaces Conversation with <a href=\"https://twitter.com/elonmusk?ref_src=twsrc%5Etfw\">@ElonMusk</a>, <a href=\"https://twitter.com/VivekGRamaswamy?ref_src=twsrc%5Etfw\">@VivekGRamaswamy</a> and <a href=\"https://twitter.com/SenJoniErnst?ref_src=twsrc%5Etfw\">@SenJoniErnst</a><br/><br/>Live Now<a href=\"https://t.co/A2mw1KCs8Q\">https://t.co/A2mw1KCs8Q</a></p>— Department of Government Efficiency (@DOGE) <a href=\"https://twitter.com/DOGE/status/1886284966855647234?ref_src=twsrc%5Etfw\">February 3, 2025</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p>Musk’s vision extends to taking control of government payment systems via <a href=\"https://www.coinlive.com/news/department-of-government-efficiency-flooded-with-relentless-lawsuits-will-solo \" target=\"\">D.O.G.E, the Department of Government Efficiency,</a> which he described as a \"wholesale spring cleaning of regulation.\" </p><p></p><p>With a clear sense of purpose, Musk aims to streamline federal operations and eliminate inefficiencies.</p><p></p><p>Musk noted:</p><blockquote>“It’s not an apple with a worm in it. It’s a ball of worms. You’ve got to basically get rid of the whole thing.”</blockquote><p></p><h1>USAID Termination Plan is Fully Backed by Trump</h1><p>During the X Spaces session, Musk revealed that he had personally discussed the shutdown of USAID with Trump, who confirmed his full support for the plan. </p><p></p><p>The Tesla CEO said:</p><blockquote>“I actually checked with him a few times—‘Are you sure?’ Like, ‘yes,’ so we’re shutting it down.” </blockquote><p>In a statement to reporters on Sunday, Trump expressed his \"full confidence\" in Musk, praising him as \"very smart\" and committed to reducing federal government spending. </p><div class=\"media-wrap embed-wrap\"><div><blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\">President Donald Trump on USAID: “I love the concept, but they turned out to be radical left lunatics. The concept of it is good but it's all about the people.”<br/><br/> <a href=\"https://t.co/E8GeO2Kl32\">pic.twitter.com/E8GeO2Kl32</a></p>— America (@america) <a href=\"https://twitter.com/america/status/1886495823539601818?ref_src=twsrc%5Etfw\">February 3, 2025</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p>Over the weekend, <a href=\"https://www.coinlive.com/news/department-of-government-efficiency-flooded-with-relentless-lawsuits-will-solo \" target=\"\">Musk’s D.O.G.E team</a> took decisive action—firing key officials at USAID, seizing control of Treasury payment systems, and freezing billions of dollars in foreign aid managed by the agency. </p><p></p><p>As a result, USAID’s website went offline globally, prompting the Trump administration to launch a comprehensive review of US foreign aid. </p><div class=\"media-wrap embed-wrap\"><div><blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\">Because USAID is/was a radical-left political psy op <a href=\"https://t.co/Th10uk7dQe\">https://t.co/Th10uk7dQe</a></p>— Elon Musk (@elonmusk) <a href=\"https://twitter.com/elonmusk/status/1886449983483748472?ref_src=twsrc%5Etfw\">February 3, 2025</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p>Musk expressed: </p><blockquote>“If we really need it again, we’ll just build something better.”</blockquote><p><a href=\"https://www.coinlive.com/news/elon-musk-and-vivek-ramaswamy-roll-out-daring-d-o-g-e-plan \" target=\"\">D.O.G.E</a> engineer Gavin Kliger sent an internal email to USAID staff announcing the imminent shutdown of its headquarters, leaving employees stunned. </p><div class=\"media-wrap embed-wrap\"><div><blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\">All <a href=\"https://twitter.com/DOGE?ref_src=twsrc%5Etfw\">@DOGE</a> did was check to see which federal organizations were violating the <a href=\"https://twitter.com/POTUS?ref_src=twsrc%5Etfw\">@POTUS</a> executive orders the most. <br/><br/>Turned out to be USAID, so that became our focus. <a href=\"https://t.co/26FXTFFlLJ\">https://t.co/26FXTFFlLJ</a></p>— Elon Musk (@elonmusk) <a href=\"https://twitter.com/elonmusk/status/1886627783138316442?ref_src=twsrc%5Etfw\">February 4, 2025</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p>Tensions escalated as two top security officials were placed on leave after blocking D.O.G.E personnel from accessing internal systems. </p><p></p><p>Humanitarian efforts in regions like Africa and Ukraine have been hit hardest, with several projects suspended. </p><p></p><p>The executive order that established <a href=\"https://www.coinlive.com/news/elon-musk-and-vivek-ramaswamy-pioneers-d-o-g-e-agency-as-new \" target=\"\">D.O.G.E</a>, signed by Trump on 21 January, has already frozen billions in foreign aid and initiated a re-evaluation of ongoing commitments in sectors such as health, disaster relief, and infrastructure. </p><p></p><p>Musk also endorsed Senator Joni Ernst’s proposal to absorb any remaining functions of USAID into the State Department.</p><p></p><p>He added:</p><blockquote>“It makes sense. There’s no need for it to be a separate agency.”</blockquote><p></p><h1>Musk's D.O.G.E Takes Charge, Cites Fraudulent Payments</h1><p>Treasury Secretary Scott Bessent reportedly granted Musk’s team full access to Treasury payment systems on Friday, a move confirmed by Senator Ron Wyden. </p><div class=\"media-wrap embed-wrap\"><div><blockquote class=\"bluesky-embed\" data-bluesky-cid=\"bafyreiacehfo6nmz6dnmowqifnp53hulrs4kvozdropfdmf5vx4vk5db2u\" data-bluesky-uri=\"at://did:plc:ydtsvzzsl6nlfkmnuooeqcmc/app.bsky.feed.post/3lh5ejpwncc23\"><p lang=\"en\">NEW: Sources tell my office that Treasury Secretary Bessent has granted DOGE *full* access to this system. Social Security and Medicare benefits, grants, payments to government contractors, including those that compete directly with Musk's own companies. All of it.<br/><br/><a href=\"https://bsky.app/profile/did:plc:ydtsvzzsl6nlfkmnuooeqcmc/post/3lh5ejpwncc23?ref_src=embed\">[image or embed]</a></p>— Senator Ron Wyden (<a href=\"https://bsky.app/profile/did:plc:ydtsvzzsl6nlfkmnuooeqcmc?ref_src=embed\">@wyden.senate.gov</a>) <a href=\"https://bsky.app/profile/did:plc:ydtsvzzsl6nlfkmnuooeqcmc/post/3lh5ejpwncc23?ref_src=embed\">February 2, 2025 at 4:37 AM</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://embed.bsky.app/static/embed.js\"></script></div></div><p>Musk argued that this access was vital due to years of Treasury officials approving fraudulent payments. </p><p></p><p>Musk said during the session and later posted on X:</p><blockquote>“The D.O.G.E team discovered that payment approval officers at Treasury were instructed to always approve payments—even to known fraudulent or terrorist groups. They literally never denied a payment in their entire career.”</blockquote><p>David Lebryk, the Treasury’s most senior career official overseeing these systems, resigned last week as Musk’s team took control. </p><p></p><p><a href=\"https://www.coinlive.com/news/elon-musk-s-spacex-faces-setback-as-starship-test-flight-7 \" target=\"\">Musk</a> has been systematically targeting and firing officials responsible for overseeing payments, accusing them of failing in their duties. </p><p></p><p>He highlighted mismanaged payments, such as those from the Department of Health and Human Services to Lutheran Family Services, as prime examples of systemic issues. </p><div class=\"media-wrap embed-wrap\"><div><blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\">Career Treasury officials are breaking the law every hour of every day by approving payments that are fraudulent or do not match the funding laws passed by Congress. <br/><br/>This needs to stop NOW!<br/><br/> <a href=\"https://t.co/Y0RMNebEWq\">https://t.co/Y0RMNebEWq</a></p>— Elon Musk (@elonmusk) <a href=\"https://twitter.com/elonmusk/status/1886134485822922785?ref_src=twsrc%5Etfw\">February 2, 2025</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p>Musk also criticised Treasury’s Do-Not-Pay system, calling it another failed government mechanism in need of urgent reform.</p><p></p><p>Acknowledging the inevitable opposition to these changes, Musk pointed to the courts as a necessary avenue for addressing legal challenges. </p><p></p><p>With six of the nine US Supreme Court justices appointed by Republican presidents, including three by Trump, Musk sees this as a critical opportunity, stating:</p><blockquote>“This is our shot. This is the best hand of cards we’re ever going to have.\"</blockquote><p>Musk’s vision is not limited to Washington—he is also turning his focus to Wall Street. </p><p></p><p>He announced plans to meet with JP Morgan Chase CEO Jamie Dimon to present his cost-cutting agenda to the bond market. </p><p></p><p>Rising Treasury yields, fueled by concerns over inflation and growing deficits, have been a significant worry for investors. </p><p></p><p>Musk believes that his spending cuts offer a solution, with any sign of serious deficit reduction likely to lead to a drop in Treasury yields—a scenario favorable to bond investors. </p><p></p><p>Musk sees this meeting with Dimon as key to securing market confidence in<a href=\"https://www.coinlive.com/news/elon-musk-and-vivek-ramaswamy-pioneers-d-o-g-e-agency-as-new \" target=\"\"> D.O.G.E’s plan. </a></p><p></p><p>Musk explained in the session:</p><blockquote>“We need them to see this as a positive step.”</blockquote><p>While Trump’s support provides a safety net, Musk is bracing for continued backlash. </p><p></p><p>He concluded the session by urging his supporters to rally behind D.O.G.E’s “noble goal: </p><blockquote>“DOGE will win if millions of people support it. I wouldn’t even know how they supported it, but the fact that they did.”</blockquote><p></p><h1>President Trump Refutes D.O.G.E's Authority Over Treasury Funds</h1><p>President Trump refuted claims that Musk has the authority to halt federal Treasury payments independently, despite Musk having full access to the government’s financial systems. </p><p></p><p>In a statement made from the Oval Office earlier today, <a href=\"https://www.coinlive.com/news/trump-s-alleged-800m-windfall-from-trump-coin-sparks-coinbase-director-s \" target=\"\">Trump </a>addressed ongoing rumors suggesting that Musk’s D.O.G.E was blocking critical payments. </p><p></p><p>The President noted:</p><blockquote>“Elon can’t do and won’t do anything without our approval. If something didn’t have my OK, you’d hear about it real fast.”</blockquote><p>He emphasized that Musk does not get to decide anything on his own:</p><blockquote>“Elon’s not making decisions on his own. He’s finding tremendous waste, but I’m the one who decides what happens next.”</blockquote><p></p><p></p><p></p></div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/e167cefbc572fdf13fe2eef03749c4cb.jpeg",
            "link": "https://www.coinlive.com/news/elon-musk-kicks-off-x-spaces-for-d-o-g-e-details-usaid",
            "pub_date": "2025-02-04 14:21:04",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 212672,
            "title": "President Trump Creates A Secret Tripartite Relationship With China And Russia To Resolve U.S's Debt Crisis",
            "description": "<div class=\"share___SVvtl\"><div><p>U.S President Donald Trump has found a new target for its Tariff wars-BRICS.</p><p></p><p>To make the dollar great again, President Trump has announced that he would be imposing a 100% tariff on imports from any country adopting the BRICS currency. If enacted, it would double the cost of imported goods in the U.S., hence disrupting the trade and glocal economics dynamics.</p><p></p><div class=\"media-wrap embed-wrap\"><div><blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\">President Trump has just announced a bold move a 100% tariff on all products from countries that join BRICS or attempt to replace the the U.S. dollar in international trade. <br/><br/>This announcement is set to send shockwaves through global markets.<a href=\"https://t.co/cJcF1VbbO7\">pic.twitter.com/cJcF1VbbO7</a></p>— Laughing Legends (@LaughingLegend0) <a href=\"https://twitter.com/LaughingLegend0/status/1863038328125436031?ref_src=twsrc%5Etfw\">December 1, 2024</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p></p><p>This policy is primarily targeted at China,the world's largest exporter, though all BRICS nations would feel the effects. And President Trump is making his objective very clear: To deter any shift away from the U.S dollar in international trade, reinforcing its position as the global reserve currency. </p><p></p><p>Since his ascent to the \"throne\", Donald Trump has been constantly using his economic power to coerce and threaten many countries to maintain U.S financial dominance while creating room for diplomatic maneuvering. Just last week, Trump imposed a tariff on Canada and Mexico to curb the inflow of fentanyl into the country.  </p><p></p><div class=\"media-wrap embed-wrap\"><div><blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\"><a href=\"https://twitter.com/hashtag/BREAKING?src=hash&amp;ref_src=twsrc%5Etfw\">#BREAKING</a>: Mexico has agreed to work with President Trump, and have managed to avoid tariffs.<br/><br/>I, on the other hand, refuse to work with our ally and neighbor, and am starting a massive trade war instead.<br/><br/>I am the worst thing that has ever happened to Canada, and to Canadians. <a href=\"https://t.co/jvZojFbybT\">pic.twitter.com/jvZojFbybT</a></p>— Justin Trudeau's Ego (@Trudeaus_Ego) <a href=\"https://twitter.com/Trudeaus_Ego/status/1886442237623484809?ref_src=twsrc%5Etfw\">February 3, 2025</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p></p><p>This time, President Trump is turning his crosshair to the BRICS bloc.  </p><p></p><h1>A Secret Tripartite Relation between the U.S, China and Russia</h1><p>Interestingly, there are reports that despite the exterior of hostility and competition between China, Russia and the United States of America, the three countries are actually secretly in cahoots with one another.</p><p></p><p>It is rumoured that the Russian President Vladimir Putin is allegedly open to restoring the dollar's role in exchange for the lifting of sanctions against Russia. </p><p></p><p>Russia's pragmatic approach of cuddling up with the U.S also reflects its view of the U.S being a wounded wild beast that should be accompanied rather than confronted directly. This would also mean that Russia and China would have to temporarily accept the dominance of the dollar while waiting for the natural evolution of the balance of power. </p><p></p><h1>Solving the country's debt crisis</h1><p>This strategy unfolds amid the backdrop of America’s soaring national debt, projected to reach $37 trillion by early 2025. With debt increasing by $1 trillion every few months, maintaining the dollar’s supremacy remains critical for financing the U.S. deficit.</p><p></p><div class=\"media-wrap embed-wrap\"><div><blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\">Hear this, the US national debt is over $33.5 trillion.<br/><br/>Meaning they are adding billions of dollars every few hours. <br/><br/>Fix the money fix the world. <a href=\"https://twitter.com/hashtag/bitcoin?src=hash&amp;ref_src=twsrc%5Etfw\">#bitcoin</a><a href=\"https://t.co/MiYNmJG9CO\">pic.twitter.com/MiYNmJG9CO</a></p>— Isabella⚡️ (@isabellasg3) <a href=\"https://twitter.com/isabellasg3/status/1711386174659367235?ref_src=twsrc%5Etfw\">October 9, 2023</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p></p><p>BRICS nations, acutely aware of this vulnerability, have been accumulating vast gold reserves. China, in particular, is executing a discreet yet aggressive gold acquisition strategy, keeping its actual holdings undisclosed.</p><p></p><p>The BRICS bloc is advancing efforts to develop an alternative to SWIFT, led by China. This new system would enable secure, independent financial transactions beyond U.S. control.</p><p></p><p>A potential BRICS currency could be backed by a basket of strategic assets, including gold, rare earth metals, and other key resources—an approach fundamentally different from the dollar, which relies on global trust in the U.S. economy.</p><p></p><h1>China’s plan to create an alternative financial structure </h1><p>China is also strengthening its financial infrastructure. Its alternative payment system is already operational and widely used by Russia, laying the groundwork for a broader monetary shift. Additionally, blockchain technology could play a pivotal role in facilitating secure, near-instantaneous transactions outside dollar-dominated networks.</p><p></p><p>Trump’s dual-pronged approach—publicly threatening severe economic penalties while engaging in covert diplomatic negotiations—illustrates the complexity of global monetary power struggles.</p><p></p><p>The ultimate outcome will depend on America’s ability to manage its debt crisis while maintaining dollar hegemony. Meanwhile, the BRICS nations may accept short-term dollar reliance while steadily building a foundation for an alternative financial order.</p></div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/0996655ad054e4100ccd3ccc9b139fa6.png",
            "link": "https://www.coinlive.com/news/president-trump-creates-a-secret-tripartite-relationship-with-china-and",
            "pub_date": "2025-02-04 13:41:52",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 212658,
            "title": "OpenAI’s Trademark Filing Suggests AI Headsets, Robots, and More in the Pipeline",
            "description": "<div class=\"share___SVvtl\"><div><h2>OpenAI Explores Consumer Hardware And Robotics In Latest Trademark Filing  </h2><p>OpenAI has <a href=\"https://tsdr.uspto.gov/#caseNumber=99025123&amp;caseSearchType=US_APPLICATION&amp;caseType=DEFAULT&amp;searchType=statusSearch\" target=\"\">filed a trademark application</a> with the U.S. Patent and Trademark Office last Friday, hinting at a wide array of potential product lines. </p><p></p><div class=\"media-wrap image-wrap\"><img src=\"https://image.coinlive.com/cryptotwits-static/0cca667a120ff18e5207b779b483646c.png\"/></div><p></p><p>While companies regularly file for trademarks, this submission stands out due to its ambitious scope, covering AI-powered hardware, robotics, and advanced computing.  </p><p></p><h2>AI-Powered Devices Could Be in Development</h2><p>The filing includes consumer electronics such as headphones, smartwatches, smart jewellery, and augmented and virtual reality headsets.  </p><p></p><p>These products are listed as being designed for \"AI-assisted interaction, simulation, and training,\" suggesting OpenAI is considering a hardware push beyond software-based AI models.  </p><p></p><p>Last year, OpenAI confirmed a collaboration with former Apple designer Jony Ive on an undisclosed hardware project.</p><p></p><div class=\"media-wrap image-wrap\"><img src=\"https://image.coinlive.com/cryptotwits-static/e82fbf1e3a83817a4480b831ba314629.jpg\"/></div><p style=\"text-align:center;\"><em><span style=\"color:#999999\">Jony Ive, a British designer renowned for his minimalist aesthetic, spearheaded Apple's iconic product design for decades, shaping the look and feel of devices like the iMac, iPod, and iPhone.</span></em></p><p></p><p>CEO Sam Altman recently stated in an interview with Korean publication The Elec that OpenAI aims to develop AI-powered consumer devices \"through partnerships with multiple companies.\"  </p><p></p><p>However, he cautioned that even producing a prototype would take \"several years.\"  </p><p></p><h2>OpenAI Signals Interest in Robotics  </h2><p>Another notable aspect of the filing is its mention of humanoid robots, specifically those that are \"user-programmable\" and equipped with communication and learning functions for assistance and entertainment.  </p><p></p><p>OpenAI recently began recruiting for a dedicated robotics team led by Caitlin Kalinowski, who previously worked at Meta’s AR division.</p><p></p><div class=\"media-wrap image-wrap\"><img src=\"https://image.coinlive.com/cryptotwits-static/72350f5ef0cf4169b5d83df72cf4425d.jpg\"/></div><p style=\"text-align:center;\"><em><span style=\"color:#999999\">Caitlin Kalinowski, an American product designer and mechanical engineer, leads robotics and consumer hardware at OpenAI since November 2024, after heading AR glasses hardware at Meta.</span></em></p><p></p><p>Reports indicate the company is exploring humanoid robots featuring AI-driven capabilities that mimic human intelligence in real-world environments.  </p><p></p><h2>Custom AI Chips And Quantum Computing Mentioned  </h2><p>The filing also references custom AI chips and quantum computing services aimed at optimising AI model performance.  </p><p></p><p>OpenAI has been working on AI-specific chips, with reports suggesting it could launch custom semiconductors in collaboration with Broadcom and TSMC by 2026.</p><p></p><div class=\"media-wrap embed-wrap\"><div><blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\">｢ the stargate project ｣<br/><br/>&gt; $500B data center initiative in the U.S.<br/>&gt; starting in Texas<br/>&gt; hundreds of thousands of jobs<br/>&gt; involve OpenAI and partners like Softbank, Microsoft, Arm, Nvidia<br/><br/>- initial $100B is ready<br/>- collab with Broadcom and TSMC for AI hardware by 2026 <a href=\"https://t.co/FTSaNtJaG4\">https://t.co/FTSaNtJaG4</a><a href=\"https://t.co/lxjC1BJDlV\">pic.twitter.com/lxjC1BJDlV</a></p>— Pavel Larionov (@pa1ar) <a href=\"https://twitter.com/pa1ar/status/1881857511084707949?ref_src=twsrc%5Etfw\">January 22, 2025</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p></p><p>While OpenAI has not disclosed concrete plans for quantum computing, its hiring of a former PsiQuantum quantum systems architect last year hints at ongoing exploration.  </p><p></p><p>Quantum computing has the potential to revolutionise AI training by enabling significantly faster calculations, making it a logical area of interest given the high computational costs of training advanced models.  </p><p></p><h2>Trademark Filing May Not Confirm Future Products  </h2><p>Although OpenAI’s application highlights areas the company is considering, trademark filings are often broad and do not necessarily indicate immediate product launches.  </p><p></p><p>Some of these ideas may remain exploratory, while others could take years to materialise.  </p><p></p><p>Beyond its trademark activity, OpenAI recently <a href=\"https://www.coinlive.com/news/softbank-collaborates-with-openai-to-launch-ai-tools-for-corporations\" target=\"\">entered into a joint venture with SoftBank</a> to market enterprise AI solutions in Japan.  </p><p></p><p>SoftBank also plans to invest $3 billion annually to integrate OpenAI’s technology across its businesses.  </p><p></p><div class=\"media-wrap embed-wrap\"><div><blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\">SoftBank CEO Masayoshi Son said he agreed with OpenAI CEO Sam Altman to set up SB OpenAI Japan, a joint venture to offer AI services. SoftBank will pay three billion dollars annually to use OpenAI's technology across its group companies <a href=\"https://t.co/xTU74111Kt\">https://t.co/xTU74111Kt</a><a href=\"https://t.co/fCaOQ5SZxg\">pic.twitter.com/fCaOQ5SZxg</a></p>— Reuters (@Reuters) <a href=\"https://twitter.com/Reuters/status/1886512484057518538?ref_src=twsrc%5Etfw\">February 3, 2025</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p></p><p>In parallel, OpenAI introduced a tool called \"deep research,\" which is designed to perform online research in minutes rather than hours.  </p><p></p><p>Powered by an advanced version of OpenAI’s upcoming o3 model, it can browse the web, analyse data, and synthesise reports, marking a significant step in AI-driven research automation.  </p><p></p><p>Reports have also surfaced that OpenAI is in discussions for a $40 billion funding round led by SoftBank.  </p><p></p><p>A portion of this investment would support the company's commitment to the Stargate AI infrastructure joint venture and cover operating costs as OpenAI continues expanding its AI capabilities.</p></div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/175a72519eeaad1f45493bad4241968e.jpeg",
            "link": "https://www.coinlive.com/news/openai-s-trademark-filing-suggests-ai-headsets-robots-and-more-in",
            "pub_date": "2025-02-04 12:33:31",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 212653,
            "title": "Canadian Hacker Faces Charges Over $65M DeFi Heist in KyberSwap, Indexed Finance Attack",
            "description": "<div class=\"share___SVvtl\"><div><h1>21-Year-Old Canadain Hacker Charged with $65M DeFi Heist</h1><p>Andean Medjedovic, a 21-year-old <a href=\"https://www.coinlive.com/news/bitcoin-targeted-kidnapping-attempt-forces-canadian-forum-moderator-and-his-family \" target=\"\">Canadian</a>, has been charged in connection with a high-profile $65 million heist involving decentralised finance (DeFi) platforms KyberSwap and Indexed Finance. </p><p></p><p><a href=\"https://www.justice.gov/usao-edny/pr/canadian-national-charged-stealing-approximately-65-million-cryptocurrency-two-defi \" target=\"\">The charges, outlined in a Brooklyn federal court</a>, include wire fraud, computer hacking, and attempted extortion. </p><div class=\"media-wrap embed-wrap\"><div><blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\">Canadian National Charged With Stealing Approximately $65 Million in Cryptocurrency From Two DeFi Protocols <a href=\"https://t.co/9WDB5A4b5L\">https://t.co/9WDB5A4b5L</a> (Announced with <a href=\"https://twitter.com/IRSCI_NY?ref_src=twsrc%5Etfw\">@IRSCI_NY</a><a href=\"https://twitter.com/NewYorkFBI?ref_src=twsrc%5Etfw\">@NewYorkFBI</a><a href=\"https://twitter.com/HSINewYork?ref_src=twsrc%5Etfw\">@HSINewYork</a> and <a href=\"https://twitter.com/TheJusticeDept?ref_src=twsrc%5Etfw\">@TheJusticeDept</a>)</p>— US Attorney EDNY (@EDNYnews) <a href=\"https://twitter.com/EDNYnews/status/1886487329394573683?ref_src=twsrc%5Etfw\">February 3, 2025</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p>Authorities have described the case as one of the most sophisticated cybercrimes in recent memory, taking advantage of vulnerabilities in crypto-based financial systems. </p><p></p><p>The announcement was made by John J. Durham, US Attorney for the Eastern District of New York, alongside officials from the Justice Department’s Criminal Division, IRS Criminal Investigation, FBI, and Homeland Security Investigations.</p><p><a href=\"https://t.co/jUYh7cNGKX\">pic.twitter.com/jUYh7cNGKX</a><br/>— US Attorney EDNY (@EDNYnews) <a href=\"https://twitter.com/EDNYnews/status/1886487924591452516?ref_src=twsrc%5Etfw\">February 3, 2025</a><br/> a</p><p></p><h1>Close to $49M Drained in KyberSwap Exploit </h1><p>In November 2023, Medjedovic orchestrated a sophisticated attack on <a href=\"https://www.coinlive.com/news/kyberswap-plans-compensation-amidst-hacker-s-ultimatum \" target=\"\">KyberSwap, a DeFi protocol that facilitates liquidity pools across various blockchains,</a> including Ethereum and Arbitrum. </p><p></p><p>Exploiting a vulnerability in KyberSwap's automated market-making system, Medjedovic manipulated cryptocurrency transactions, artificially driving price fluctuations. </p><p></p><p>Through a series of strategic trades, he siphoned nearly $48.8 million from 77 liquidity pools spanning six blockchains. </p><p></p><p>Medjedovic then allegedly threatened <a href=\"https://www.coinlive.com/news/kyberswap-falls-victim-to-50-million-defi-hack \" target=\"\">KyberSwap</a>'s developers, investors, and decentralised autonomous organisation (DAO), demanding control of the platform in exchange for returning approximately half of the stolen funds. </p><p>To cover his tracks, he employed advanced crypto-laundering methods, utilising bridge protocols to move assets between blockchains and cryptocurrency mixers to obscure the origins of the stolen funds. </p><p></p><p>At one point, he even paid an undercover officer posing as a developer $80,000 to lift restrictions on a frozen $500,000 transaction.</p><div class=\"media-wrap embed-wrap\"><div><blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\">Another great news! The hacker behind the KyberSwap attack, has been charged! You can’t just hack defi and run away from justice! <br/><br/>Thanks everyone who worked tirelessly to make this happen. Huge congrats to <a href=\"https://twitter.com/vutran54?ref_src=twsrc%5Etfw\">@vutran54</a> &amp; Kyber team<a href=\"https://t.co/0HbMvddZER\">https://t.co/0HbMvddZER</a><a href=\"https://t.co/uzWRAJH7zj\">https://t.co/uzWRAJH7zj</a></p>— Loi Luu (@loi_luu) <a href=\"https://twitter.com/loi_luu/status/1886574473169510612?ref_src=twsrc%5Etfw\">February 4, 2025</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p></p><h1>The $16.5M DeFi Heist of Indexed Finance</h1><p>Medjedovic’s involvement in<a href=\"https://www.coinlive.com/news/bitfinex-hacker-breaks-silence-claims-solo-heist-of-120-000-bitcoin \" target=\"\"> cybercrime </a>dates back to October 2021, when he targeted Indexed Finance, a DeFi protocol that manages pools of digital assets. </p><p></p><p>According to court documents, Medjedovic manipulated Indexed Finance’s re-indexing process, which adjusts liquidity pools when new tokens are added. </p><p></p><p>This manipulation distorted price calculations and enabled him to steal $16.5 million from investors. </p><p></p><p>He used borrowed cryptocurrency to artificially inflate values, then seized the assets once the prices were distorted. </p><p></p><p>Following the exploit, Medjedovic is believed to have partnered with an accomplice to <a href=\"https://www.coinlive.com/news/bitfinex-hacker-s-wife-sentenced-to-18-months-for-laundering-role \" target=\"\">launder the stolen funds. </a></p><p></p><p>They opened cryptocurrency exchange accounts using fraudulent identities and employed mixers to hide transaction trails. </p><p></p><p>Authorities later discovered a document titled “moneyMovementSystem,” which outlined his systematic approach to laundering large sums of money.</p><div class=\"media-wrap embed-wrap\"><div><blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\">How it started...How it's going<br/><br/>21 year old Alleged $65 Million CryptoThief Andean (aka Andy) Medjedovic <a href=\"https://t.co/AQFAiUittF\">pic.twitter.com/AQFAiUittF</a></p>— GuruLeaks (@Guruleaks1) <a href=\"https://twitter.com/Guruleaks1/status/1886517159607853161?ref_src=twsrc%5Etfw\">February 3, 2025</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p></p><p></p><p></p><p></p></div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/2f9bb11031f353b313d96d0723dd446d.jpeg",
            "link": "https://www.coinlive.com/news/canadian-hacker-faces-charges-over-65m-defi-heist-in-kyberswap",
            "pub_date": "2025-02-04 11:20:05",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 212657,
            "title": "Market Outlook for February: Cryptocurrency Market Plunge, Is the Bull Market Still There?",
            "description": "<div class=\"share___SVvtl\"><div><p>Author: Xiao Lizi; Source: Blockchain Blue Ocean</p><p line=\"init\" ql-global-para=\"true\" style=\"text-align: left;\">The market has been falling since last weekend, and it started to accelerate in the early morning of Monday. This morning, there was a huge drop, and the leverage of more than 5 times the copycat long positions was almost all liquidated.</p><p line=\"hruO\" ql-global-para=\"true\" style=\"text-align: left;\">I myself did not escape this wave of decline. Although I reduced some positions in the past few days, it was also a large spot position that was hit. I can only say that it is better than various leverage explosions. I am still alive.</p><p line=\"9Mzk\" ql-global-para=\"true\" style=\"text-align: left;\"><strong>Everyone is concerned about one thing, is the bull market over now?</strong></p><p line=\"B7oc\" ql-global-para=\"true\" style=\"text-align: left;\">Now the market is full of panic, and there are reasons for both shorting and bearishness. Those who are optimistic about the future market believe that the leverage has been completely blown up and the car is light, and it can rise happily in the future. Those who are pessimistic believe that except for BTC, which is still in a bull market, other altcoins including Ethereum have long been in a bear market, and a large number of altcoins have continuously hit new lows. </p><h2 style=\"text-align: left;\"><strong>The fuse of today's plunge</strong></h2><p line=\"6b3c\" ql-global-para=\"true\" style=\"text-align: left;\">First of all, we need to analyze the reasons for this big drop in a simple and easy-to-understand way: <strong>The main reason for this big drop is not in the currency circle itself but outside. </strong></p><p line=\"SyeT\" ql-global-para=\"true\" style=\"text-align: left;\">1. The issue of tariffs. This issue is difficult to explain clearly in a short space, and I cannot guarantee that I understand the joints very thoroughly. But roughly speaking, the market expected that Trump would wield the \"tariff stick\" when he came to power, mainly using this attitude to force other countries to give in on some issues, that is, tariffs are just a weapon to scare people. </p><p line=\"9Vbu\" ql-global-para=\"true\" style=\"text-align: left;\">As a result, it was discovered over the weekend that Trump was ready to play for real, and even used IEEPA (a special power that the president can use in an emergency economic state to initiate economic sanctions or modify tariffs without restrictions from Congress), which had a huge impact on the market. <strong>Plus it was the weekend, the U.S. stock market could not price this matter, and the cryptocurrency circle had no reference to the U.S. stock market, so it panicked alone. </strong></p><p line=\"FBiM\" ql-global-para=\"true\" style=\"text-align: left;\">2. Deepseek also had a huge impact on U.S. stock AI, especially the leader Nvidia. Why can Nvidia surpass Apple? Because the market is optimistic about the big narrative of AI, and AI requires a lot of computing power, and Nvidia's chips are in short supply. And Deepseek's ultra-low cost (I don't know if it's true or not) made investors begin to doubt whether so much computing power (chips) is needed, and whether it is necessary for other technology companies to invest huge amounts of money in the field of AI? </p><p line=\"vtLT\" ql-global-para=\"true\" style=\"text-align: left;\">The US stock market has long been riddled with holes, most companies' stock prices are sluggish (similar to altcoins), and the number of corporate bankruptcies has hit a new high since 2008. The stock index is supported by the stock prices of technology giants. If a few giants fall, how can the US stock market not fall? <strong>As long as the Deepseek incident has not been falsified, it is a sword hanging over the US stock market. </strong></p><p line=\"tuEq\" ql-global-para=\"true\" style=\"text-align: left;\">3. Regarding the issue of interest rate cuts, the Federal Reserve announced a few days ago that it would not cut interest rates. Many people began to be pessimistic and believed that it would not be cut once in 25 years or even at all, which also had a certain impact on market expectations. I think this matter has an impact but not much. The previous article in December has already judged that there is a high probability that there will be no interest rate cut this time, and it will wait and see. Moreover, the newly replaced FOMC voting committee is relatively dovish, and the King of Understanding will also put pressure on Powell to cut interest rates. Japan's previous announcement of an interest rate hike also had an impact, but this was secondary to the decline.</p><p line=\"90nT\" style=\"text-align: left;\">In general, this decline was caused by the superposition of multiple factors, especially the sudden impact of tariffs and deepseek.</p><p line=\"ql3p\" ql-global-para=\"true\" style=\"text-align: left;\">Looking at the specific market performance, BTC's rise has set a new high. From the new high on January 20 to today's correction, it is only 16 points. The plunge from Sunday to Monday is actually only 11 points. This correction range is a very normal \"bull market flash crash\" no matter how you look at it. </p><h2 style=\"text-align: left;\"><strong>The bull market of altcoins may have ended</strong></h2><p line=\"owiY\" ql-global-para=\"true\" style=\"text-align: left;\">The key is that altcoins, including Ethereum, have been hit hard. Ethereum has fallen from its recent high of around 3400 on the 1st to 2100, a 38% drop in 2 days. SOL has also adjusted back 40% from its recent record high. This is still a relatively large currency. Many altcoins listed on BN have continued to hit new lows, and have even fallen below the lows before the launch in the second half of last year. Yesterday, there were many altcoins that fell 60%. </p><p line=\"Rvmo\" ql-global-para=\"true\" style=\"text-align: left;\">I placed an order for altcoins in advance last night according to BTC, which was about five or six points, and the altcoin fell twice as much as BTC. As a result, I bought it and suffered a 20% drop. </p><p line=\"oytD\" ql-global-para=\"true\" style=\"text-align: left;\">If I believed before that after BTC stabilized at 100,000, the altcoins would catch up and start the altcoin season (some tracks and some projects rose sharply, and other projects generally rose slightly, rather than the overall rise like the bull market in 2021). Now looking at the market again, I think the bull market of altcoins has ended, or it ended as early as the beginning of 2024, but we were confused by the rise of BTC last year. </p><p line=\"ogyc\" ql-global-para=\"true\" style=\"text-align: left;\">I think the main reason for this phenomenon is that we usually think that the Wall Street institutions will enter the market and pull BTC to the sky, and then the overflow funds and the newly entered retail funds will buy cheaper altcoins, forming the rising order of the previous bull market. But in fact, because the number of Shanzhai projects has increased significantly in this round of bull market, most of them are \"VC coins\" with high FDV and low circulation. The market liquidity has been drained, and these projects have a very poor wealth-creating effect in the secondary market. </p><p line=\"DnPW\" ql-global-para=\"true\" style=\"text-align: left;\">For Shanzhai, listing on platforms like BN has become a channel for project parties and VCs to exit. Project parties sell when they go online, institutions sell when they unlock, and users sell when they receive airdrops. Retail investors in the secondary market have been direct, but found that the depth is bottomless and became the payers of the feast. <strong>When the market began to punish those diamond hands who held coins, and when retail investors also began to stop accepting these coins and began to turn to relatively fairer memes, the market began to self-FUD as a whole. </strong></p><p line=\"PfeF\" ql-global-para=\"true\" style=\"text-align: left;\">The current market perception is that you should not have any faith in Shanzhai, either sell it, or sell it for BTC if you are afraid of missing out. This has caused the exchange rates of almost all currencies against BTC to continue to fall. Even if some currencies are strong in the short term, they will continue to fall in the long run. </p><p line=\"xCo3\" ql-global-para=\"true\" style=\"text-align: left;\"><strong>To reverse this situation of the market's continuous self-FUD of the cottage, there is only one possibility, that is, a large-scale, large-scale, and sustained general rise in the cottage, and the reappearance of the cottage's wealth-making effect</strong>, rather than pulling up like TRUMP and directly sucking the blood of the whole market. I think the current market environment is impossible to achieve, unless the Federal Reserve releases a huge amount of money like in 20 years, and the water is so much that it overflows. </p><p line=\"6Q1z\" ql-global-para=\"true\" style=\"text-align: left;\">But in the current macro environment, it is difficult to see such a large-scale release of money again, especially since the current global economy is really much worse than expected, otherwise there would not be so many conflicts and civil unrest. </p><p line=\"clSf\" ql-global-para=\"true\" style=\"text-align: left;\">What I have said may not be correct, but this is my personal understanding of the current plight of Shanzhai, and the reason why I think the plight of Shanzhai will be difficult to reverse for a long time to come. </p><h2 style=\"text-align: left;\"><strong>Future operation suggestions and short-term judgment</strong></h2><p line=\"Up3x\" ql-global-para=\"true\" style=\"text-align: left;\">My view on the future operation of Shanzhai is: <strong>At this stage</strong><strong>No longer make long-term layout, only participate in the band, no longer hold for a long time; participate in projects with high market attention, and give up unpopular projects; Shanzhai spot should also stop loss and leave, and give up the fantasy of getting back the trapped position for a long time. </strong></p><p line=\"q4L4\" ql-global-para=\"true\" style=\"text-align: left;\">As for BTC, I think that if there is no serious economic or financial crisis in the United States, the next situation may be a long bull and slow bull, and there may be periodic adjustments in the middle, the amplitude will be larger than that of the US stock market, but it will not fall by 70-80% like before. </p><p line=\"KL7G\" ql-global-para=\"true\" style=\"text-align: left;\">It is said in the article that I also paid for my own mistakes in this wave, and the market is always right. In the future, we must insist on realizing the profits of the cottage in time, part of which is allocated to BTC and part of it is allocated to cash, and we should not worry about the short-term cottage selling and missing out. </p><p line=\"jBEW\" ql-global-para=\"true\" style=\"text-align: left;\">Finally, let’s talk about the short-term. I subjectively think that the decline today is almost the same. According to historical experience, after such a sharp plunge, it is usually a short-term bottom. <strong>The next step should be to make a disordered oscillation and then choose a direction. After the oscillation, it will slowly fall down for two or even three times to confirm the bottom. Those who did not buy the bottom in the morning do not need to worry, there will be opportunities. </strong></p><p line=\"eVj4\" ql-global-para=\"true\" style=\"text-align: left;\">For example, whether the bottom has been built this time, because the mines that caused this decline have not been cleared, it depends on the trend of the US stock market in the next few days. If the risks of tariffs and US stocks are lifted, then it may fluctuate upward. If the problem intensifies, it may continue to plummet like 313 after the 312 plunge, which is not impossible. </p><p line=\"q3RM\" ql-global-para=\"true\" style=\"text-align: left;\">Don't guess the bottom, especially the decline caused by the emotional catharsis of the event, and what kind of moths will the president who does not play by the rules like Trump do? This is not something that can be predicted by indicator technology or market analysis. <strong>Follow the market, don't be obsessed with your own predictions, we are here to make money, not to prove that our guesses are right.</strong></p><p line=\"rvIQ\" ql-global-para=\"true\" style=\"text-align: left;\">In the chaotic period after the current plunge, the black swan may come. All we can do is to do a good job of risk control, reduce positions and keep some bullets, stay away from high leverage, and even if we must use leverage, we must set a stop loss.</p><p line=\"TTGw\" ql-global-para=\"true\" style=\"text-align: left;\">If you are alive in the market, you still have a chance, but if you blow up your position, you will really have nothing</p><p style=\"text-align:center\"><strong></strong></p></div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/b3e28c076385cd5a913863d3e3734d25.jpg",
            "link": "https://www.coinlive.com/news/market-outlook-for-february-cryptocurrency-market-plunge-is-the-bull",
            "pub_date": "2025-02-04 11:16:13",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 212656,
            "title": "Kill the cottage",
            "description": "<div class=\"share___SVvtl\"><div><p style=\"text-align: left;\">Author: Liu Jiaolian</p><p style=\"text-align: left;\">This year's Spring Festival did not repeat the bullish market of the 2021 Spring Festival \"breaking 5 on the fifth day\" (Note: breaking 5 means breaking the historical high of 50,000 US dollars). Instead, it fell three times in a row on the fourth, fifth and sixth days of the first lunar month, from 105k all the way to the lowest level close to 90k, with the maximum drop of nearly 15%.</p><p style=\"text-align: left;\">This unexpectedly broke the defense of many people who were looking forward to the so-called Spring Festival market. For example, in the 1.24 Teaching Chain Internal Reference <strong>\"The Spring Festival is Coming\"</strong>, a research institute proposed that \"<em>BTC has achieved positive returns during the Spring Festival in 11 of the past 12 years, and the statistically impressive 83% hit rate proves the gains during this period.</em>\"</p><p style=\"text-align: left;\">Then, as expected and unexpected, this year's Spring Festival obviously fell into the other 17%.</p><p style=\"text-align: left;\">The 2.2 Teaching Chain Internal Reference <strong>\"The 4th Week of 2025\" written by Teaching Chain on the road yesterday, which is <strong>\"The Fed Waits and Sees Changes This Cycle is Familiar\"</strong>, has summarized the macroeconomic situation at the beginning of the Spring Festival in the past week. In fact, seeing that the Federal Reserve is not hesitating to take a confrontational stance with the White House to express its toughness, you should have a vague foreboding and don't have too much expectation for \"continue to play music and continue to dance\". </strong></p><p style=\"text-align: left;\">In fact, if you look at the market, BTC's current pin test of 90,000 dollars was penetrated twice on December 6, 2024 last year and January 13, 2025 this year. </p><p style=\"text-align: left;\">This position is the lower support of a new high level after the violent pull since late November 2024. 90k-110k constitutes a new level of sideways fluctuations. </p><p style=\"text-align: left;\">New heights, new levels, and new normals are significantly higher than the 2021 bull top and the 60,000-70,000 dollars after March 2024. </p><p style=\"text-align: left;\">The shorts have inserted pins three times, either the three times are not enough, and the bulls are killed, opening a new market; or they defeat the bulls, kill this new level, and kill back to the old battle line of 70,000 dollars. </p><p style=\"text-align: left;\">However, BTC has not fallen down the steps, but just stumbled, and it has brought the market to a half-death. The copycat dogs fell to the street one after another, and died in large numbers. </p><p style=\"text-align: left;\">Some of Jiaolian’s copycat positions that had just turned losses into profits have fallen back into the mud again. </p><p style=\"text-align: left;\">Just hold on, what else can you do? </p><p style=\"text-align: left;\">Do you cut your positions and exchange for BTC at this time? It must be too late. </p><p style=\"text-align: left;\">Don’t think about repairing the roof when the house is leaking during a storm. </p><p style=\"text-align: left;\">What did you do when the sun was shining? </p><p style=\"text-align: left;\">When Jiaolian was on the road, he thought of a question, that is, people often say that failure is the mother of success, but why is failure the mother of success? </p><p style=\"text-align: left;\">From an empirical point of view, scientific research shows that in terms of entrepreneurial success rate, people who have succeeded before are obviously more likely to succeed again. </p><p style=\"text-align: left;\">In the secondary market, you will also see many people gambling year after year and day after day, either speculating in contracts or speculating in memes, but they just go from one failure to another. Even if they occasionally make a small profit, they will soon lose it all again. The final outcome is basically that they lose all their underwear completely and can never turn over again. They are forced to quit and disappear from this market completely. </p><p style=\"text-align: left;\">Jiaolian suddenly seems to have figured it out. The key to success from failure lies in oneself. It lies in whether one can learn lessons from failure, reflect and introspect, not beat one's chest and stamp one's feet, not be annoyed and regretful, but calmly transform failure into correction and improvement of one's existing wrong cognition, and have more courage and strength to put the corrected and improved cognition into continued practice for testing. </p><p style=\"text-align: left;\">So there is a good saying: If you fail in your actions, look for the reasons in yourself. </p><p style=\"text-align: left;\">From a psychological point of view, it is difficult for people to listen to the advice of others. From a practical point of view, you should not trust anyone. Many times, you must have a strong opinion and the courage to go forward even if there are thousands of people against you in order to achieve great things. </p><p style=\"text-align: left;\">But this will bring a problem, that is, it is impossible to make cognitive corrections and improve the closed loop. The end of being self-satisfied and self-centered is failure. </p><p style=\"text-align: left;\">The closed loop can only be learned through practice, learning from practice, and learning from failure. </p><p style=\"text-align: left;\">As the proverb goes, you will not turn back until you hit the south wall. In fact, people who know to turn around or take a detour after hitting the south wall only once may already be a dragon among men. </p><p style=\"text-align: left;\">So the saying goes, people can never teach people; things can teach people, and they will learn it once they are taught.</p><p style=\"text-align: left;\">In fact, Jiaolian says that things can never teach people, and most people can never learn. Only when you turn yourself into a person who actively learns, can you learn it once, and turn every failure into a stepping stone to your success.</p></div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/c4da7b2b0171faf466829d3ba167a831.jpg",
            "link": "https://www.coinlive.com/news/kill-the-cottage",
            "pub_date": "2025-02-04 11:18:10",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 212654,
            "title": "Trump orders the creation of a sovereign wealth fund",
            "description": "<div class=\"share___SVvtl\"><div><p style=\"text-align: left;\">Author: Niu Zhanlin; Source: Cailianshe Silicon Valley NEWS</p><p style=\"text-align: left;\">On February 3rd, local time, US President Trump signed an executive order instructing government officials to establish a sovereign wealth fund. It is still unclear how the fund will operate and how it will be financed.</p><p style=\"text-align: left;\">When Trump announced the move at the White House that day, he said that the United States has \"huge potential\" and has appointed Treasury Secretary Scott Bessant and Commerce Secretary nominee Howard Lutnick to lead the preparation of the sovereign wealth fund.</p><p style=\"text-align: left;\">During the campaign, Trump proposed to follow the sovereign wealth fund model of Norway, Saudi Arabia and other countries to convert national resources (such as energy income) into long-term investment capital.</p><p style=\"text-align: left;\"><strong>Bessant pointed out that the sovereign wealth fund will be established within the next 12 months and called it an issue of \"great strategic significance.\" </strong></p><p style=\"text-align: left;\">The text of the executive order signed by Trump has not been made public, and it is unclear where the funds for the fund will come from. Trump has promised to establish \"the world's largest sovereign wealth fund.\"</p><p style=\"text-align: left;\">Last September, Trump first proposed this idea in a speech at the New York Economic Club, which is to inject tariff revenue into a sovereign wealth fund to invest in manufacturing centers, defense and medical research.</p><p style=\"text-align: left;\">Trump said at the time: <strong>\"We will create America's own sovereign wealth fund and benefit all Americans.\" He then mentioned that Wall Street and business leaders can play a role in helping \"provide investment advice.\"</strong></p><p style=\"text-align: left;\">Sovereign wealth funds are usually found in countries with large foreign exchange reserves or commodity income, such as Norway and Saudi Arabia, and invest in various fields from stocks and bonds to infrastructure and technology.</p><p style=\"text-align: left;\">The current world's largest sovereign wealth fund is the Norwegian Government Pension Fund (about $1.8 trillion). If Trump wants to surpass it, he needs at least $1 trillion in initial funds. But the United States lacks stable natural resource income like Norway, and it is almost impossible to achieve it in the short term. </p><p style=\"text-align: left;\">In reality, the United States does not have a sovereign wealth fund at the federal level, but 20 states have similar funds, which are funded by energy or land revenue, such as the Alaska Permanent Fund and the North Dakota Heritage Fund. If Trump's proposal is realized, it will be the first attempt by the United States to establish a national sovereign fund. </p><p style=\"text-align: left;\">It is worth noting that <strong>some people speculate that the sovereign wealth fund is prepared to establish Bitcoin reserves, and some analysts believe that Trump will use these funds to buy Greenland</strong>. </p></div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/c16ebf4b1c88da12f139e342b925470d.jpg",
            "link": "https://www.coinlive.com/news/trump-orders-the-creation-of-a-sovereign-wealth-fund",
            "pub_date": "2025-02-04 11:11:29",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 212655,
            "title": "Trump's tariff stick: the cryptocurrency market plummets",
            "description": "<div class=\"share___SVvtl\"><div><p style=\"text-align:center\"></p><p style=\"text-align: left;\">Author: W3C DAO</p><h2 style=\"text-align: left;\">Tariff Stick</h2><p style=\"text-align: left;\"><strong>Previously, US President Trump signed a tariff order to impose an additional 25% tariff on imports from Canada and Mexico and a 10% tariff on energy resources from Canada. The White House said that if the US tariffs are retaliated, the US may increase the tariffs.</strong></p><p style=\"text-align: left;\">In addition, according to Xinhua News Agency, the White House said on the same day that the United States will impose a 10% tariff on all goods imported from the mainland on the basis of existing tariffs. Trump said this is consistent with the \"protectionist measures\" he supports.</p><p style=\"text-align: left;\">Affected by Trump's tariff policy, Japanese and Korean stock markets fell sharply on Monday. The Nikkei 225 Index closed down 1,052.40 points, or 2.66%, at 38,520.09 points on February 3 (Monday); the South Korean KOSPI Index closed down 64.04 points, or 2.54%, at 2,453.33 points on February 3 (Monday). </p><p style=\"text-align: left;\">According to Coinglass data, in the past 24 hours, the entire network had a liquidation of $2.119 billion, of which $1.78 billion was liquidated for long orders and $270 million was liquidated for short orders. A total of 718,513 people were liquidated worldwide. The largest single liquidation occurred on Binance-ETHBTC, with a value of $25.635 million. </p><p style=\"text-align:center\"><img src=\"https://img.jinse.cn/7346655_image3.png\"/></p><p style=\"text-align: left;\"><strong>According to Jinshi, Goldman Sachs strategists said that the U.S. stock market is likely to fall 5% in the coming months as the latest round of tariffs from the Trump administration affects earnings forecasts. </strong></p><p style=\"text-align: left;\">Goldman Sachs strategist David Kostin wrote in a report: \"These statements shocked many investors, who expected tariffs to be imposed only if trade negotiations failed. Our economists see an uncertain outlook but believe that tariffs on Canada and Mexico are likely to be temporary.\"</p><p style=\"text-align: left;\">Kostin also said that if it continues, the latest tariffs will reduce his earnings forecasts for S&amp;P 500 companies by about 2% to 3%, and this does not take into account the impact of further tightening of the financial environment or changes in consumer and corporate behavior. He also warned that the fair value of the S&amp;P 500 could fall by about 5% in the short term as both earnings and stock valuations take a hit. </p><h2 style=\"text-align: left;\">Various Opinions</h2><p style=\"text-align: left;\">Analysts at brokerage firm Bernstein said in a report to clients: \"If tariffs mean a stronger dollar, higher inflation and a weakening outlook for rate cuts in the short term, then this means a decline in global liquidity for risky assets. Over a longer time frame, as governments take on higher debts and higher deficits, leading to further currency depreciation, Bitcoin has relative value relative to the dollar, which is evident in Bitcoin's long-term compounding history. But in the short term, Bitcoin is correlated with risky assets. Therefore, the sell-off in cryptocurrencies is not surprising.\"</p><p style=\"text-align:center\"><img src=\"https://img.jinse.cn/7330920_image3.png\"/></p><p style=\"text-align: left;\">Bernstein analysts believe that in the long run, the Trump administration believes that cryptocurrencies are of strategic significance to government governance and national finances, and are aimed at controlling inflation by cutting deficits, cost-cutting departments of the Government Efficiency Department led by Elon Musk, and increasing energy production. Although foreign governments may retaliate against tariffs by selling U.S. Treasuries.</p><p style=\"text-align: left;\">But Bernstein expects sovereigns to hoard gold and Bitcoin as economic buffers, the United States will lead the shift to support cryptocurrencies, and more countries may follow suit.</p><p style=\"text-align: left;\"><strong>However, Jeff Park, head of strategy at Bitwise Alpha, said that tariffs may only be a temporary tool, but the long-term conclusion is that Bitcoin will not only go higher, but also faster, because both sides of the trade imbalance equation want Bitcoin, so the final result is the same: higher prices and faster speeds.</strong></p><p style=\"text-align: left;\">Petr Kozyakov, CEO of crypto payment platform Mercuryo, pointed out that after Trump announced the tariffs on Friday, a wave of FUD was set off in the cryptocurrency market, and the prospect of long-term interest rate hikes shook all markets around the world. Although Bitcoin has fallen below the $100,000 mark, the king of cryptocurrencies has once again proved itself to be unique, in stark contrast to altcoins that have fallen across the board. </p><p style=\"text-align:center\"><img src=\"https://img.jinse.cn/7346656_image3.png\"/></p><p style=\"text-align: left;\">Aave founder Stani Kulechov said: \"Tariffs will raise funds and increase domestic production for the United States, and will also allow other countries to raise funds and increase their domestic production, so that every country will participate in the competition for domestic production. This is not a recession, but a reorganization of the entire global economy. For those who see the uncertainty of the stock market crash during the transition, cryptocurrencies will serve as a hedge, and for those who want to reduce the uncertainty of the bond market crash, DeFi income will also serve as a hedge.\"</p><h2 style=\"text-align: left;\">Looking forward</h2><p style=\"text-align: left;\">Looking forward, the global economy will continue to adjust and reorganize under the influence of tariff policies and cryptocurrencies. As governments seek a balance between trade protectionism and digital asset strategies, market uncertainty and volatility may increase. </p><p style=\"text-align: left;\">However, this also provides new opportunities for cryptocurrencies and decentralized finance (DeFi) as a tool to hedge risks in traditional financial markets. In the future, we may see more countries adopt Bitcoin and other crypto assets as economic buffers, driving the global financial system towards a more diversified and innovative direction. </p><ol class=\"list-paddingleft-2\"></ol></div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/10617baf5396fd9aa08ba83cbd720145.jpg",
            "link": "https://www.coinlive.com/news/trump-s-tariff-stick-the-cryptocurrency-market-plummets",
            "pub_date": "2025-02-04 11:14:07",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 212651,
            "title": "Trump’s Alleged $800M Windfall From TRUMP Coin Sparks Coinbase Director’s Concern as Token Sees Small Uptick After Crashing",
            "description": "<div class=\"share___SVvtl\"><div><h1>Trump Made Over $800M from TRUMP, Alleges Coinbase Director</h1><p>Coinbase Director Conor Grogan estimates that President Donald Trump and his team may have profited over $800 million from the launch of the <a href=\"https://www.coinlive.com/news/trump-token-plummets-despite-the-president-s-rally-efforts-is-a \" target=\"\">TRUMP meme coin. </a></p><p></p><p>In a February 3 post on <a href=\"https://www.coinlive.com/news/Tweetocalypse-or-X-citing-Changes-Elon-Musk-Rebrands-Twitter-to \" target=\"\">X (formerly known as Twitter),</a> Grogan detailed that the gains—totaling $802 million—stem from TRUMP-related transfers, liquidity events, and associated fees. </p><div class=\"media-wrap embed-wrap\"><div><blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\">Trump may have made $802m+ since launching his memecoin<br/><br/>-Team has sent $482M+ of USDC, SOL, and TRUMP to exchanges <br/>-$240M of USDC is held in out-of-range liquidity + $50M in-range <br/>-They have made $29.3M+ in USDC fees<br/><br/>Does not include $16B of TRUMP the team still holds <a href=\"https://t.co/mxujlEmxj0\">pic.twitter.com/mxujlEmxj0</a></p>— Conor (@jconorgrogan) <a href=\"https://twitter.com/jconorgrogan/status/1886235661977464936?ref_src=twsrc%5Etfw\">February 3, 2025</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p></p><h1>Trump’s Profits</h1><p>Since the<a href=\"https://www.coinlive.com/news/donald-and-melania-trump-s-meme-coin-go-head-to-head-as-trump \" target=\"\"> TRUMP meme coin</a>'s launch on 18 January, Trump’s team has transferred over $482 million in TRUMP, SOL, and USDC to exchanges like Binance, KuCoin, and OKX. </p><p></p><p>However, Grogan noted that while these tokens were sent to exchanges, it remains unclear if they have been sold.</p><p></p><p>Additionally, Grogan highlighted that the team holds approximately $240 million in USDC within out-of-range liquidity pools—meaning the liquidity is inactive due to price fluctuations—while another $50 million USDC remains in actively tradable pools.</p><div class=\"media-wrap embed-wrap\"><div><blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\">📊 ANALYSIS: <a href=\"https://twitter.com/hashtag/Trump?src=hash&amp;ref_src=twsrc%5Etfw\">#Trump</a> team may have made $802M+ from <a href=\"https://twitter.com/hashtag/memecoin?src=hash&amp;ref_src=twsrc%5Etfw\">#memecoin</a> launch:<br/><br/>• $482M+ in <a href=\"https://twitter.com/search?q=%24USDC&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$USDC</a>, <a href=\"https://twitter.com/search?q=%24SOL&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$SOL</a> &amp; <a href=\"https://twitter.com/search?q=%24TRUMP&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$TRUMP</a> sent to exchanges<br/>• $240M <a href=\"https://twitter.com/search?q=%24USDC&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$USDC</a> in out-of-range liquidity + $50M in-range<br/>• $29.3M+ earned in <a href=\"https://twitter.com/search?q=%24USDC&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$USDC</a> fees<br/><br/>*Not including $16B worth of <a href=\"https://twitter.com/search?q=%24TRUMP&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$TRUMP</a> tokens still held by team… <a href=\"https://t.co/gtw23dtIhE\">pic.twitter.com/gtw23dtIhE</a></p>— DeFlow Intern (@DeFlow_Intern) <a href=\"https://twitter.com/DeFlow_Intern/status/1886243539648131280?ref_src=twsrc%5Etfw\">February 3, 2025</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p>Beyond these holdings, Grogan estimated that Trump’s team has earned $29 million in USDC from liquidity provision fees. </p><p></p><p>He also suggested that total profits could be even higher, as his analysis excludes earnings from other wallets, Meteora liquidity pools, and additional fees. </p><p></p><p>Notably, he did not factor in the $16 billion worth of TRUMP tokens still held by the team.</p><p></p><p>This is not even counting in <a href=\"https://www.coinlive.com/news/donald-and-melania-trump-s-meme-coin-go-head-to-head-as-trump \" target=\"\">Melania’s token launch. </a></p><p></p><h1>TRUMP’s Earnings Beat Bored Ape Otherside Launch</h1><p>The <a href=\"https://www.coinlive.com/news/ethics-watchdogs-eye-trump-s-family-meme-coins-and-world-liberty \" target=\"\">TRUMP meme coin</a> launch reportedly generated more profit than the highly anticipated Bored Ape Otherside launch. </p><p></p><p>According to Grogan, the Otherside event raised $282 million, with an additional $181 million burned in gas fees. </p><p></p><p>If accurate, this positions TRUMP as one of the most lucrative token launches in crypto history.</p><div class=\"media-wrap embed-wrap\"><div><blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\">Caveats: they might not have sold all of the crypto they sent to exchanges, but I'm also being pretty conservative in other areas (eg not counting Trump LP meteora fees or wallets I'm less sure of)</p>— Conor (@jconorgrogan) <a href=\"https://twitter.com/jconorgrogan/status/1886236715762794648?ref_src=twsrc%5Etfw\">February 3, 2025</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p>Grogan has been actively tracking <a href=\"https://www.coinlive.com/news/ivanka-trump-decries-unapproved-meme-coin-ivanka-bearing-her-name \" target=\"\">TRUMP</a>’s developments, previously raising concerns about its token allocation. </p><p></p><p>He noted that the team locked 80% of the supply in a multi-signature wallet while injecting $40 million in single-sided liquidity—a move that has drawn scrutiny.</p><p></p><h1>TRUMP’s Decline Still Leaves Early Investors in the Green</h1><p>Since reaching an all-time high of $75.35 on 19 January 2025, <a href=\"https://www.coinlive.com/news/trump-s-war-on-tariffs-sees-bitcoin-still-bleeding-red-as \" target=\"\">TRUMP has undergone a significant correction. </a></p><p></p><p>At its peak, the token’s market cap surged to $14.77 billion. </p><p></p><p>However, it dropped to 75.95%, trading at $18.34, with its market cap shrinking to $3.77 billion. </p><p></p><p>As of now, <a href=\"https://coinmarketcap.com/currencies/official-trump/ \" target=\"\">TRUMP is priced at $19.63</a>, showing a modest 13.32% uptick in the past 24 hours, though it remains down 31.50% over the past week. </p><p></p><p>Despite this decline, early investors who bought TRUMP at its launch price of $0.1824 are still in substantial profit. </p><p></p><p>While sales remain unverified, the lingering question remains: Did the president capitalise on this windfall, and if so, will he retain the gains or share them with his supporters?</p><p></p><p></p><p></p></div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/c0a3331d89c72c9e3abb94edb3e86ace.jpeg",
            "link": "https://www.coinlive.com/news/trump-s-alleged-800m-windfall-from-trump-coin-sparks-coinbase-director-s",
            "pub_date": "2025-02-04 10:24:18",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        }
    ]
}