{
    "data": [
        {
            "id": 250714,
            "title": "Gold and US assets will be the \"winners\" after the attack on Iran.",
            "description": "<div class=\"share___SVvtl\"><div>What is certain is that the United States and Israel are seeking a complete regime change in Iran. According to the Wall Street Journal, Israel claims that Saturday's joint attack killed Iran's Supreme Leader, Ayatollah Ali Khamenei. Other Iranian leaders remain primary targets. It is too early to draw conclusions, but the intensity of this full-scale offensive suggests that the regional conflict may escalate further before it improves. While energy markets and the global economy will be widely impacted, investors should carefully assess the potential consequences of the conflict before rushing to buy on dips. Financial markets should prioritize risk aversion until the losses can be quantified and reasonably assessed. The US leadership must have realized that Iran's participation in the Geneva talks over its nuclear capabilities over the past two weeks has been merely a delaying tactic. Iranian negotiators have failed to make even the smallest concessions to their US counterparts—namely, the permanent and complete dismantling of uranium enrichment facilities, which could have averted war. The two sides were originally scheduled to continue negotiations at the International Atomic Energy Agency meeting in Vienna next week, but the US clearly felt there was no reason to wait a few more days, only to find out that Iran had no intention of making any substantial concessions. Therefore, the US and Israel seized the last remaining opportunity for a surprise attack after a massive military buildup in the region over the past few weeks, striking Iranian missile and drone launch sites, military command facilities, and targets in the capital. Now, the fog of war has enveloped the region. At first glance, the infrastructure damage appears limited—the US has not destroyed Iran's nuclear capabilities or key oil export terminals in the region—but this appearance may be misleading. In the coming days and possibly weeks, the US attacks and Iranian retaliation are likely to escalate. The Iranian regime faces collapse and has no way out. In fact, it now has ample motivation to attack regional energy infrastructure, thereby triggering a global economic shock. This could weaken American public support for the war and the determination of US leaders to push the war to the end until regime change. This could also fuel global opposition to the US and Israel, which would benefit the Iranian regime should it survive. Even if initial actual damage appears limited, investors should prepare for the inevitable disruption of regional energy supplies. The Iranian leadership has signaled its intention to close the crucial Strait of Hormuz—through which approximately 20% of the world's oil and 15% of its liquefied natural gas are transported. Shipping through the strait is already spontaneously decreasing. If the attack successfully affects ships, oil wells, pipelines, or ports, the disruption will no longer be voluntary or temporary. The direct market impact will be: a decline in global stock markets and a strengthening of global safe-haven assets. Gold will continue its bull market. If an actual disruption to oil supply means a non-speculative rise in oil prices, thus suppressing consumer demand, then US Treasury bonds will particularly benefit. If global economic growth slows due to this turmoil, global stock markets are likely to decline, but US stocks should perform relatively better. Over the past year, we've seen a trend of funds flowing into European, Japanese, and Chinese stock markets. This trend will be difficult to sustain if the profits and profit margins of companies in these energy-import-dependent manufacturing economies suffer unexpected shocks. Other stock markets in the Americas will also benefit relatively, as they can rely on local oil supplies and are far from conflict zones. Investors should only buy global stocks on dips and sell oil on rallies when it is clear that war damage will not affect energy supplies. Until then, they should not do so.</div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/5735f05756e8c349429a9566d3f13edd.jpg",
            "link": "https://www.coinlive.com/news/gold-and-us-assets-will-be-the-winners-after-the",
            "pub_date": "2026-03-01 20:38:48",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 250706,
            "title": "In-depth analysis of how Claude and Palantir killed Khamenei.",
            "description": "<div class=\"share___SVvtl\"><div>Today, a chilling stillness hangs over Shemiran, north of Tehran. For Iran's Supreme Leader Ayatollah Ali Khamenei, this stillness usually signifies security, but on this day, it is a prelude to death. This raid, codenamed \"Operation Epic Fury,\" was not a traditional large-scale bombing, but a \"surgical operation\" woven from low-level code, real-time remote sensing algorithms, and distributed computing power. Following the attack, Trump confirmed Khamenei's death on social media. The significance of this operation lies in the fact that it is the first high-level decapitation strike in human history where artificial intelligence (AI) has completely dominated the \"kill chain.\" In his command post deep underground in Tehran, Khamenei may have thought he had evaded satellites, but he didn't realize he was facing not a single weapon, but a global surveillance and strike network comprised of Palantir, Anduril, and the top-tier large language model (Claude). This network no longer relies on expensive traditional platforms, but on \"software-defined weapons.\" The Wall Street Journal reports that in this war, AI is no longer an auxiliary tool; it has become the true decision-maker, tracker, and executor. <p style=\"text-align:center\"><img src=\"https://img.jinse.com.cn/7436574_image3.png\" type=\"block\"/></p><h2 dir=\"ltr\" style=\"text-align: left;\"><span leaf=\"\" style=\"\">Silicon Valley's \"War Operating System\": Palantir</span></h2><p dir=\"ltr\" style=\"text-align: left;\"><span leaf=\"\">Behind decapitation strikes, Palantir's technology platform plays the role of the \"battlefield brain.\" Founded by Peter Thiel, the company's core mission has always been to break down data silos between intelligence agencies.</span></p><p style=\"text-align:center\"><img src=\"https://img.jinse.com.cn/7436574_image3.png\" type=\"block\"/></p><h2 dir=\"ltr\" style=\"text-align: left;\"><span leaf=\"\">Behind decapitation strikes, Palantir's technology platform plays the role of the \"battlefield brain.\" Founded by Peter Thiel, the company's core mission has always been to break down data silos between intelligence agencies.</span></h2><p style=\"text-align:center\"><img src=\"https://img.jinse.com.cn/7436575_image3.png\" type=\"block\"/></p><h3 dir=\"ltr\" style=\"text-align: left;\"><span leaf=\"\" style=\"\">Breaking Down the Island: Ontology</span></h3><p dir=\"ltr\" style=\"text-align: left;\"><span leaf=\"\">Palantir's most powerful weapons are its Artificial Intelligence Platform (AIP) and its flagship product, Gotham 5. In traditional command systems, intelligence analysts need to manually compare satellite imagery, communications interception records, and open-source social media data. But in Operation Epic Wrath, Palantir's Ontology technology transformed this chaotic data into intuitive, real-world objects. The so-called \"ontology\" maps complex enterprise or battlefield data into easily understood entities, such as \"personnel,\" \"locations,\" or \"launchpads.\" By integrating data from ERP systems, sensors, satellites, and network monitoring into a \"Common Operating Picture\" (COP), commanders are no longer faced with dry reports, but with a real-time digital twin of the battlefield. </span></p><table><tbody><tr class=\"firstRow\"><td><p dir=\"ltr\" style=\"text-align: left;\"><span leaf=\"\">Palantier Core Defense Platform</span></p></td><td><p dir=\"ltr\" style=\"text-align: left;\"><span leaf=\"\">Function Definition</span></p></td><td><p dir=\"ltr\" style=\"text-align: left;\"><span leaf=\"\">Core Technology Support</span></p></td></tr><tr><td><p dir=\"ltr\" style=\"text-align: left;\"><span leaf=\"\">Gotham</span></p></td><td><p dir=\"ltr\" style=\"text-align: left;\"><span leaf=\"\">Core Intelligence Integration Platform, Connecting Distributed Heterogeneous Databases 5</span></p></td><td><p dir=\"ltr\" ltr=\"\" style=\"text-align: Semantic Web, Knowledge Graph, Association Analysis&lt;/span&gt;&lt;/p&gt;&lt;/td&gt;&lt;/tr&gt;&lt;tr&gt;&lt;td&gt;&lt;p dir=\"><span leaf=\"\">AIP for Defense</span></p></td><td><p dir=\"ltr\" style=\"text-align: left;\"><span leaf=\"\">Deploying Large Language Models in Confidential Networks to Automate Command Processing</span></p></td><td><p dir=\"ltr\" style=\"text-align: left;\"><span leaf=\"\">LLM Integration, RLHF, Controlled Logic Agent</span></p></td></tr><tr><td><p dir=\"ltr\" style=\"text-align: left;\"><span leaf=\"\">MetaConstellation</span></p></td><td><p dir=\"ltr\" style=\"text-align: left;\"><span leaf=\"\">Automated scheduling of hundreds of commercial and classified satellites for monitoring 13</span></p></td><td><p dir=\"ltr\" style=\"text-align: left;\"><span leaf=\"\">Edge AI, automatic task decomposition, orbit management</span></p></td></tr><tr><td><p dir=\"ltr\" style=\"text-align: left;\"><span leaf=\"\">TITAN</span></p></td><td><p dir=\"ltr\" style=\"text-align: left;\"><span leaf=\"\">Army tactical intelligent target access node, AI-defined vehicle 3</span></p></td><td><p dir=\"ltr\" style=\"text-align: left;\"><span leaf=\"\">Sensor fusion, multi-domain data synchronization </span></p></td></tr></tbody></table><p style=\"text-align:center\"><img src=\"https://img.jinse.com.cn/7436576_image3.png\" type=\"block\"/></p><h3 dir=\"ltr\" style=\"text-align: left;\"><span leaf=\"\" style=\"\">Forward Deployed Engineers: Programmers on the Battlefield</span></h3><p dir=\"ltr\" style=\"text-align: left;\"><span leaf=\"\">To ensure this complex system operated in Tehran's high-intensity electronic warfare environment, Palantir deployed a special group of soldiers—Forward Deployed Engineers (FDEs). These engineers weren't sitting in air-conditioned offices in Denver or Silicon Valley; instead, they wore tactical vests and were directly embedded in the combat units of the U.S. Central Command (CENTCOM).</span></p><p dir=\"ltr\" style=\"text-align: left;\"><span leaf=\"\">This wartime capability reduced system updates that would normally take months to hours.</span></p><p dir=\"ltr\" style=\"text-align: left;\"><span leaf=\"\"> When Khamenei was killed, it was the FDE that adjusted the satellite scheduling logic of MetaConstellation in the background, ensuring that more than three satellites simultaneously performed cross-verification the moment the target left the bunker. To understand this operation, one must first understand how the US military broke through Iran's impenetrable electromagnetic blockade. Before the operation began, Tehran cut off terrestrial internet and mobile communications throughout the country, attempting to render US sensors \"blind.\" However, according to the Wall Street Journal, the US military this time utilized SpaceX's most secretive asset—Starshield and the MILNET satellite constellation behind it. This is no longer the semi-civilian Starlink terminals used on the Ukrainian battlefield. Starshield consists of approximately 480 dedicated hardened satellites and integrates the highest security encryption protocol at the NSA level. In the operational logs of the U.S. Central Command (CENTCOM), these satellites were figuratively called \"digital oxygen\": when the Iranian Revolutionary Guard attempted to sever frontline communications using the Russian-made Kalinka jamming system, StarShield established a perpetually connected aerial grid in orbit via laser inter-satellite links reaching speeds of up to 200 Gbps. Most formidable was the compact terminal known as UAT-222. Measuring only two feet square, it could be carried by a single special forces soldier. When this small cube was activated in a bunker near the Tehran residence, petabytes of high-resolution images and electromagnetic signals that would normally take hours to transmit were transmitted within seconds, penetrating the jamming smoke and flowing directly into Palantir's analysis engine. </span></p><p style=\"text-align:center\"><img src=\"https://img.jinse.com.cn/7436577_image3.png\" type=\"block\"/></p><p dir=\"ltr\" style=\"text-align: center;\"><span style=\"font-size: 14px;\">Claude: A Game About the Soul of AI</span></p><p dir=\"ltr\" style=\"text-align: left;\"><span leaf=\"\">However, in the process of AI killing Khamenei, a fierce conflict about AI ethics erupted in the United States. The focus of the conflict was Claude, the top-tier large-scale model developed by Anthropic.</span></p><p dir=\"ltr\" style=\"text-align: left;\"><span leaf=\"\">However, in the process of AI killing Khamenei, a fierce conflict about AI ethics broke out in the United States. The focus of the conflict was Claude, the top-tier large-scale model developed by Anthropic.</span></p><p style=\"text-align:center\"><img src=\"https://img.jinse.com.cn/7436577_image3.png\" type=\"block\"/></p><p dir=\"ltr\" style=\"text-align: center;\"><span style=\"font-size: 14px;\"> As the only cutting-edge large-scale model authorized by the Pentagon to operate on a highly classified, physically isolated network, Claude was once the most relied-upon tool for US military intelligence analysts. Its \"Claude Gov\" version excelled at processing massive amounts of intercepted Persian classified documents. Claude's role in operations was not to directly control weapons, but rather to process massive amounts of unstructured warfare data. According to declassified documents, the US military first used Claude on a large scale for \"intelligence synthesis\" in its operation against Venezuelan leader Maduro in early 2026. Claude can rapidly read thousands of hours of intercepted Persian communications, identify cracks in the command chain within the Iranian Revolutionary Guard, and generate dozens of dynamic game-theoretic strike scenario simulations for commanders. Analysts no longer need to write lengthy briefings; they can simply ask, as easily as ordering food: \"If we were to electronically suppress Tehran at this moment, and simultaneously launch an air strike, what would be Khamenei's most likely escape route?\" Claude will then provide an optimized interception probability chart based on its massive military theoretical training and real-time intelligence feed. However, according to an exclusive report by The Wall Street Journal in February 2026, an open hostility erupted between the Trump administration and Anthropic CEO Dario Amodei. Defense Secretary Pete Hegseth ordered Anthropic to remove all of Claude's guardrails so that it could be directly integrated into the fully automated lethal weapon system. Instead, OpenAI and Elon Musk's xAI were put at the heart of the U.S. military's most secretive missions because of its promise of providing computing power \"unbound by political correctness.\" Ironically, in the operation against Khamenei, the Claude model running on the Palantir platform still played a crucial supporting role—although it refused to pull the trigger directly, it cleared the fog of intelligence for the final strike by processing previous covert operations against Venezuelan President Maduro and petabytes of data intercepted in Tehran. \"Where's Dad?\": Algorithms Track Every Person. If Palantir and Claude provided strategic-level intelligence, then the three AI systems developed by the Israel Defense Forces (IDF) reveal the most chilling logic at the tactical level. These three systems are collectively known as the \"mass assassination factory.\" In operations against Tehran, the US military drew upon algorithms honed by the IDF in combat in Gaza. </span></p><ul class=\"list-paddingleft-2\"><li><p dir=\"ltr\" role=\"presentation\" style=\"text-align: left;\"><span leaf=\"\">“The Gospel”: An AI system specifically designed to recommend targets for buildings. It can generate strike lists at a rate of 100 per day, while humans could only generate 50 per year in the past.</span></p></li><li><p dir=\"ltr\" role=\"presentation\" style=\"text-align: left;\"><span leaf=\"\">“Lavender”: Scores millions of people and automatically tags suspected militants by analyzing social networks, movement patterns, and call logs. At its peak, it tagged 37,000 targets.24 The most controversial part lies in the role of humans. According to The Guardian, after these AI systems recommend targets, human commanders often spend only \"20 seconds\" reviewing them. These 20 seconds are merely enough to confirm whether the target is male. Even more brutal is a system called \"Where's Daddy?\". Instead of tracking aircraft like traditional radar, it tracks the connection between targets and their home residences. The system automatically monitors when tagged individuals enter their homes. Commanders believe that attacking these individuals when they are home with their families is easier than attacking military outposts, even though it means that the entire building's civilian population could become \"collateral damage.\" In the process of Khamenei's assassination, this logic was elevated to the level of national leaders. The algorithm no longer searched for Khamenei's luxurious car, but rather for every subtle feature of him. Anduril and Shield AI: Software-Defined Air Superiority To execute the final strike, the US military no longer repeatedly deployed expensive stealth aircraft, but instead used Cooperative Combat Aircraft (CCA) defined by new military industries such as Anduril and Shield AI. A key technological highlight of this operation was the drone swarm's ability to autonomously adjust its formation based on real-time threat perception after entering Tehran's airspace. When Iranian air defense radar locked onto one of the drones, the entire swarm shared this threat through the Lattice software system and automatically dispatched a group of drones for electronic guidance and anti-radiation strikes. This \"software-driven\" warfare makes traditional, hardware-centric defense systems appear cumbersome and outdated when faced with algorithmic iterations. Shield AI is a company focused on developing what it calls \"the world's best AI pilot\"—Hivemind. This software allows unmanned systems to perform complex tasks even when completely without GPS, satellite communications, and human operators. The core technology of Hivemind is EdgeOS, a middleware environment specifically designed for high-performance real-time robotics. Its core features include: </span></p><td></td><td><strong><span leaf=\"\">Technical Components</span></strong></td><td><strong><span leaf=\"\">Functional Description</span></strong></td><td><strong><span leaf=\"\">Tactical Value</span></strong></td><tbody><tr><td><strong><span leaf=\"\">Hivemind Pilot</span></strong></td><td><span leaf=\"\">Core Flight Control Algorithm Library</span></td><td><span leaf=\"\">Enables autonomous tactical evasion and maneuvering in disputed airspace.</span></td></tr><tr><td><strong><span leaf=\"\">EdgeOS</span></strong></td><td><span leaf=\"\">Low-Latency Operating Environment</span></td><td><span leaf=\"\">Reduces inter-node communication latency to milliseconds through static configuration and local computation.</span></td></tr><tr><td><strong><span leaf=\"\">EdgeOS</span></strong></td><td><span leaf=\"\">Low-Latency Operating Environment</span></td><td><span leaf=\"\">Reduces inter-node communication latency to milliseconds through static configuration and local computation.</span></td><td><span leaf=\"\"> Hivemind Commander: A collaborative swarm command system that manages multi-agent synchronization, allowing drone swarms to operate collaboratively like human formations. EOS Language Toolchain: Supports complex data structure integration, ensuring efficient storage and transmission. </span></td></tr></tbody><h3 dir=\"ltr\" style=\"text-align: left;\"><strong><span leaf=\"\">Aerial Brain Swap: The Power of the A-GRA Architecture</span></strong></h3><p dir=\"ltr\" style=\"text-align: left;\"><span leaf=\"\">In February 2026, Anduril demonstrated an experiment that shocked the military: its YFQ-44A drone successfully switched between two completely different AI systems during flight. The first half of the flight was controlled by Shield AI's \"Hivemind\" software, which allowed the drone to autonomously avoid obstacles and form formations like a bird; the second half seamlessly switched to Anduril's \"Lattice\" system to perform the final target lock. </span></p><p dir=\"ltr\" style=\"text-align: left;\"><span leaf=\"\">This \"aerial brain swap\" relies on a modular standard known as the \"Government Reference Autonomous Architecture\" (A-GRA). This means that if the enemy develops electronic jamming against a certain AI, the drone can instantly download and run another algorithm, just like updating an app on a mobile phone. EagleEye Headset: The Soldier's \"Digital Teammate\" In ground operations, US special forces soldiers wear the EagleEye mixed reality headset, jointly developed by Anduriel and Meta (formerly Facebook). This headset is no longer a bulky bulletproof helmet, but a holographic display system integrating all data from the Lattice network. Soldiers can directly see the enemy's skeletal posture, the outline of obscured targets, and even see real-time images transmitted back by aerial drones directly from the headset. Palmer Luckey calls it a “digital teammate for soldiers,” giving everyone on the front lines a God’s-eye view synchronized with the Pentagon. </span></p><p style=\"text-align:center\"><img src=\"https://img.jinse.com.cn/7436581_image3.png\" type=\"block\"/></p><table><tbody><tr class=\"firstRow\"><td><p dir=\"ltr\" style=\"text-align: left;\"><span leaf=\"\">New Military Technology Platform</span></p></td><td><p dir=\"ltr\" style=\"text-align: left;\"><span leaf=\"\">Core Hardware/Products</span></p></td><td><p dir=\"ltr\" style=\"text-align: left;\"><span leaf=\"\">Changing the Way We Fight</span></p></td></tr><tr><td><p dir=\"ltr\" style=\"text-align: left;\"><span leaf=\"\">Anduril</span></p></td><td><p dir=\"ltr\" style=\"text-align: left;\"><span lattice=\"\" software=\"\" yfq-44a=\"\"></span></p></td><td><p dir=\"ltr\" style=\"text-align: left;\"><span leaf=\"\">Software-defined weapon, algorithm updates measured in hours rather than decades</span></p></td></tr><tr><td><p dir=\"ltr\" style=\"text-align: left;\"><span leaf=\"\">Shield AI</span></p></td><td><p dir=\"ltr\" style=\"text-align: left;\"><span leaf=\"\">Hivemind Autonomy</span></p></td><td><p dir=\"ltr\" style=\"text-align: left;\"><span leaf=\"\">Autonomous flight and combat without GPS and satellite connections</span></p></td></tr><tr><td><p dir=\"ltr\" style=\"text-align: left;\"><span leaf=\"\">Meta &amp; Anduril</span></p></td><td><p dir=\"ltr\" style=\"text-align: left;\"><span leaf=\"\">EagleEye / IVAS</span></p></td><td><p dir=\"ltr\" style=\"text-align: left;\"><span leaf=\"\">Decentralizing battlefield situational awareness to individual soldiers and eliminating radio confusion</span></p></td></tr></tbody></table><h2 dir=\"ltr\" style=\"text-align: left;\"><span leaf=\"\" style=\"\">“New Military Industry”: How Venture Capital Reshapes the Armory</span></h2><p dir=\"ltr\" style=\"text-align: left;\"><span leaf=\"\">Behind Khamenei's assassination, there is a hidden check.</span></p><p dir=\"ltr\" style=\"text-align: left;\"><span leaf=\"\">For decades, the arms business has been the domain of traditional giants like Lockheed Martin.</span></p><p dir=\"ltr\" style=\"text-align: left;\"><span leaf=\"\">For decades, the arms business has been the domain of traditional giants like Lockheed Martin.</span></p><p dir=\"ltr\" style=\"text-align: left;\"><span leaf=\"\"> But now, Silicon Valley venture capital, through its \"American Dynamism\" strategy, has officially taken over the battlefield's R&amp;D pace. The \"New Military-Industrial Complex\" on Sand Hill Road: Venture capital firms led by Andreessen Horowitz (a16z) completed a record $15 billion funding round in 2026. Their bets are no longer on food delivery or social media, but on hard tech companies like Anduril, Shield AI, and Saronic. These companies operate on a completely different logic from traditional contractors: Speed: While traditional giants take ten years to develop a radar system, these companies can achieve the same results in just a few months through software simulation. Consumability: They don't aim to build a $100 million F-35, but rather to produce 10,000 autonomous drones worth $10,000 each. Software First: In their eyes, weapons are simply \"code in an aluminum shell.\" This shift in capital has given the United States a very high margin for error in its actions against Iran. Even if some drones are intercepted, the remaining drones can automatically fill in through the distributed Lattice network. </span></p><p style=\"text-align: left;\"><strong></strong></p><table><tbody><tr class=\"firstRow\"><td><p dir=\"ltr\" style=\"text-align: left;\"><span leaf=\"\">Overview of Defense Science and Technology Investment and Financing (2025 Part)</span></p></td><td><p dir=\"ltr\" style=\"text-align: left;\"><span leaf=\"\">Data Indicators</span></p></td><td><p dir=\"ltr\" style=\"text-align: left;\"><span leaf=\"\">Strategic Impact</span></p></td></tr><tr><td><p dir=\"ltr\" style=\"text-align: left;\"><span leaf=\"\">Total Venture Capital Investment</span></p></td><td><p dir=\"ltr\" style=\"text-align: left;\"><span leaf=\"\">US$49.1 billion</span></p></td><td><p capital=\"\" defense=\"\" from=\"\" manufacturing=\"\" shifts=\"\" software-defined=\"\" to=\"\" traditional=\"\"></p></td></tr><tr><td><p dir=\"ltr\" style=\"text-align: left;\"><span leaf=\"\">Defense Startup Valuations (Anduril)</span></p></td><td><p dir=\"ltr\" style=\"text-align: left;\"><span leaf=\"\">$30.5 billion</span></p></td><td><p dir=\"ltr\" style=\"text-align: left;\"><span leaf=\"\">Emerging Giants Have the Financial Power to Challenge Traditional Contractors</span></p></td></tr><tr><td><p dir=\"ltr\" style=\"text-align: left;\"><span leaf=\"\">DoD Spending Growth on Startups</span></p></td><td><p dir=\"ltr\" style=\"text-align: left;\"><span leaf=\"\">2.3</span></p></td><td><p dir=\"ltr\" style=\"text-align: left;\"><span leaf=\"\">2.3</span></p></td></tr><p leaf=\"\">Government procurement processes are beginning to shift towards agile development</p></tbody></table><p></p><p dir=\"ltr\" style=\"text-align: left;\"></p><p leaf=\"\" style=\"\">Three Clocks: Strategic Limitations of AI Warfare</p><p dir=\"ltr\" style=\"text-align: left;\"></p><p leaf=\"\">After Khamenei's death, military strategists began to reflect on the cost of this victory. They proposed the famous \"Three Clocks\" theory to examine conflicts in the AI ​​era.</p><ol class=\"list-paddingleft-2\"><li><p dir=\"ltr\" role=\"presentation\" style=\"text-align: left;\"><span leaf=\"\">Military Clock: AI has greatly shortened the \"sensor-to-shooter\" time.</span></p> ...The Military Clock: AI has greatly shortened the \"sensor-to-shooter\" time.<p dir=\"ltr\" style=\"text-align: left;\"></p><p leaf=\"\">Military Clock: AI has greatly shortened the \"sensor-to-shooter\" time.</p><p dir=\"ltr\" style=\"text-align: left;\"></p><p leaf=\"\">The Three Clocks: Strategic Limitations of AI Warfare</p><p dir=\"ltr\" style=\"text-align: left;\"></p><p leaf=\"\">After Khamenei's death, military strategists began to reflect on the cost of this victory. They proposed the famous \"Three Clocks\" theory to examine conflicts in the AI Decapitation strikes that previously required months of preparation can now be executed within seconds of an algorithm identifying a target. The military clock has been sped up to its limit. The economic clock: While AI weapons are inexpensive, their rapid consumption puts exponential pressure on supply chains. If the conflict drags on, energy premiums, shipping risks, and inflation will backfire on the attacker's economy. The political clock: This is the slowest clock. AI can precisely kill a leader, but it cannot automatically gain the consent of the local population or quell regional anger. The death of Khamenei proved the unparalleled dominance of algorithms in the \"Find, Fix, Finish\" cycle. However, when war becomes as casualty-free and efficient as clicking a screen, the political threshold for humans to wage war is dangerously lowered. The End and Beginning of an Era: Software-Defined Geopolitics This is the true process by which artificial intelligence killed Khamenei: no smoke-filled trench warfare, no fierce aerial combat, only the constantly jumping data bars on the Palantir platform, the intelligence summaries processed by the Claude model, and the red outline drawn on the HUD by the Anduriel Lattice system. Khamenei's downfall marks the full-scale arrival of the era of \"software-defined geopolitics.\" As the Wall Street Journal commentary pointed out: We have entered a battlefield where human commanders don't even have time to feel fear. So who are the winners?</p></li></ol></li></ul></div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/f45fd7b2a58878e9de20b7eb34382d6b.jpg",
            "link": "https://www.coinlive.com/news/in-depth-analysis-of-how-claude-and-palantir-killed-khamenei",
            "pub_date": "2026-03-01 13:47:06",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 250705,
            "title": "Partnering with Republic MSX aims to make SpaceX shareholders accessible to the general public.",
            "description": "<div class=\"share___SVvtl\"><div>Have you ever considered becoming a shareholder before SpaceX lands on the moon or before ByteDance rings its IPO? In traditional financial terms, this opportunity is called \"Pre-IPO\" private equity investment. It typically occurs in the final stretch before unicorns like SpaceX and ByteDance officially go public. At this point, the business model is extremely mature, and the risk is far lower than early-stage venture capital. However, the return on investment after the company goes public is still astonishing—at least doubled, and sometimes several times or even dozens of times higher. However, for a long time, this lucrative opportunity has been exclusively enjoyed by private equity (PE) and venture capital (VC). Ordinary retail investors have been kept outside the highly closed walls, mostly waiting to buy shares in the secondary market after the company goes public. Ultimately, the opportunity of \"Pre-IPO\" has long been out of reach for most people. Now, MSX has decided to cross this high wall through a combination of tokenization and a Wall Street compliance platform. I. The Trillion-Dollar Cake Within the Walls: Visible, But Intangible Data shows that the size of the \"Pre-IPO\" market has far exceeded expectations. The \"2025 Global Unicorn 500 Report\" shows that the total valuation of the 2025 Global Unicorn 500 companies reached 39.14 trillion yuan, a year-on-year increase of 30.71%, far exceeding the GDP of Germany, the world's third-largest economy. The average valuation also rose from 59.883 billion yuan to 78.276 billion yuan, a year-on-year increase of 30.71%. In his article, \"Why Private Equity Wins: Reflecting on a Quarter-Century of Outperformance,\" Dawson Managing Partner Yann Robard also points out that the value created by the private equity market over the past 25 years is about three times that of the stock market during the same period. In other words, the stage that truly generates excess returns often occurs before an IPO. Taking SpaceX, currently the world's number one unicorn, as an example, a unique analysis by MSX reveals that its primary market valuation was only $180 billion in 2024, subsequently climbing steeply. By early 2026, after completing the share swap integration with xAI, its private valuation had reached $1.25 trillion, a six-fold increase in just two years. The price of private equity transfers of SpaceX in the off-market also surged from about $56 per share in October 2021 to about $527 per share in February 2026, almost nine times in four years. It can be said that equity in unlisted unicorn companies has always been a super alpha in global asset allocation, a fact everyone is well aware of. However, in this trillion-dollar sector with rapidly growing valuations, the entry rules are extremely unequal: ● The capital threshold often starts at \"millions\": Entry fees of hundreds of thousands or even millions of dollars directly deter 99.9% of individual investors;\n● The \"opportunity cost\" of liquidity: Once invested, funds are often locked up for 5-10 years, making it difficult to realize profits; ● Extremely Unfair Allocation: For highly sought-after assets like OpenAI, SpaceX, and ByteDance, where buyers line up in droves, quotas are perpetually limited to a small circle of top-tier private equity and venture capital firms. In other words, this is a trillion-dollar market with potentially high returns, yet it has long been open only to institutional investors and ultra-high-net-worth individuals. This is why, in June 2025, when online brokerage giant Robinhood offered European users trading OpenAI and SpaceX \"stock tokens,\" the market paid close attention, viewing it as the first large-scale trial of private equity tokenization by a traditional online brokerage. Because it sent an important signal: using RWA tokenization to dismantle the barriers of the primary market, mapping real equity to on-chain divisible tokens, could redefine limitations on entry barriers, liquidity constraints, and exit efficiency. II. How Will MSX Break Down the Barriers of \"Pre-IPO\" in Partnership with Republic? Today, MSX officially took over the baton of \"investment equality.\" We have entered into a strategic partnership with Republic, a US-compliant asset tokenization platform, and will soon launch a Pre-IPO zone, providing eligible platform users with tokenized private equity from top global unicorns such as SpaceX and ByteDance. The initial allocation exceeds ten million US dollars, covering more than 10 top global unicorns. Details such as the specific list of targets and the amount released will be announced upon the official launch. However, facing this kind of \"Pre-IPO\" equity tokenization, your first reaction might be: Is it safe? Is it legal? Is it just a \"virtual mapping\"? Here, it's necessary to first provide some background information on Republic's project. As a compliant private securities platform operating under the supervision of the U.S. Securities and Exchange Commission (SEC), Republic has long provided global investors with access to private equity financing. It is committed to helping individual and institutional investors participate in private markets and alternative assets that were previously only open to a small number of professional investors. Its private assets are held through regulated third-party custodians (such as licensed institutions like BitGo Trust Company). It's worth noting that Republic is also the core service provider behind Robinhood's launch of unlisted unicorn stock tokens in Europe. <p style=\"text-align: left;\"><span style=\"text-align:center;\"><img alt=\"c631ecdb-e56e-40e6-9983-30b604a1971b\" src=\"https://img.jinse.com.cn/7436548_image3.png\"/></span></p><p style=\"text-align: left;\"><span style=\"text-align:center;\">Source: Republic</span></p><p style=\"text-align: left;\">This means that MSX's Pre-IPO zone is a structural innovation built on a mature compliance framework. You will enjoy services at the same level as the world's top brokerages: all unicorn equity assets are connected through the same compliance channels as Robinhood, the existing shares behind the mapped tokens are real, and they are held in custody by a regulated third party, with a legal and asset support foundation. Ultimately, when tokenization technology meets compliant private equity platforms regulated by the US SEC, the equity of unlisted giants will no longer be the exclusive domain of top venture capitalists. Third, what does this mean for ordinary users? We also firmly believe that the Pre-IPO products launched this time will bring structural changes to ordinary users in three dimensions. First, it \"equalizes\" the entry threshold, bidding farewell to entry tickets that often cost millions of dollars. As mentioned above, the starting price in the traditional private equity market is usually hundreds of thousands or even millions of dollars, while tokenization can fragment the previously unattainable unicorn stocks, allowing eligible ordinary users on the Maitong MSX platform to sit at the same table as top venture capitalists with a very low threshold and equally share the future growth premium of SpaceX or ByteDance in the primary and secondary markets. Secondly, it's about \"source-leveling\" valuation advantages, avoiding the emotional tax of the secondary market. It's well known that the surge on the first day or in the early stages of an IPO is often accompanied by a huge emotional bubble, and ordinary retail investors often enter at high prices. Participating in the pre-IPO stage means capturing the closest possible valuation range. In short, you can finally position yourself at a low valuation stage before the company goes public, instead of becoming a bagholder in the post-IPO frenzy. Finally, it's about \"restructuring\" the liquidity structure, breaking the illusion of N-year lock-up periods. The most troublesome aspect of traditional private equity investment is the 5-10 year exit lock-up period. To address this pain point, Maitong MSX plans to be the first to launch high-quality pre-IPO targets with short-term redemption mechanisms, and will continue to explore more technical paths to improve asset liquidity, potentially completely reconstructing the exit logic of the primary market. In conclusion, the launch of the \"Pre-IPO\" zone marks a significant step forward for MSX's US stock tokenization strategy, expanding from \"secondary market asset trading\" to \"primary market share distribution.\" Amid the global trend of asset tokenization, Pre-IPO tokenization has become a widely discussed key area for the next stage of industry discussion. As one of the earliest trading platforms globally to deeply cultivate US stock tokenization, MSX has consistently focused on one thing: enabling ordinary people to share in the growth dividends of the most scarce high-quality assets of this era, from breaking down barriers to US stock trading to dismantling the walls of private equity. Just as five years ago, ordinary people couldn't imagine instantly buying and selling US stocks through an on-chain wallet; before today, you might have similarly found it difficult to imagine becoming a \"shareholder\" of SpaceX or ByteDance with extremely low barriers to entry. In 2026, we hope to work with everyone to slowly push open that once tightly closed iron gate.</p></div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/6cd190b5159a80275a041965dbc73efa.jpg",
            "link": "https://www.coinlive.com/news/partnering-with-republic-msx-aims-to-make-spacex-shareholders-accessible",
            "pub_date": "2026-03-01 09:23:05",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 250704,
            "title": "a16z: AI costs halved, usage doubles; life milestones delayed for 30-year-olds",
            "description": "<div class=\"share___SVvtl\"><div><p style=\"text-align: left;\">Author: a16z New Media; Translator: Deep Tide TechFlow</p><p style=\"text-align: left;\">This week's a16z chart report covers four topics, each worthy of a separate article: the Jevons effect triggered by declining AI costs, the true scale of tech giants' capital expenditures, Kalshi's prediction market is beating professional forecasting agencies, and the widespread postponement of life milestones for Americans aged 30. The data sources are solid, and the perspective is calm and restrained, making it a high-quality reference for understanding the intersection of current technological and macroeconomic trends.</p><p style=\"text-align:center\"><img alt=\"\" data-href=\"\" src=\"https://img.jinse.com.cn/7436560_watermarknone.png\"/></p><h4 style=\"text-align: left;\">DExit… Is it a real trend or an illusion?</h4> ... Delaware remains the top choice for business registration in the United States, but this position is quietly shifting: According to Ramp data, Delaware's share of new company registrations has been declining since 2023, with a drop of approximately 10% in the third quarter of 2025. History doesn't simply repeat itself, but it often rhymes…maybe. Delaware wasn't always a haven for business registration. About a century ago, Delaware replaced New Jersey—the former \"mother of trusts\"—as the top choice for business registration. New Jersey lost its edge because then-Governor Woodrow Wilson's attempts to curb \"corporate abuses\" significantly worsened the state's business environment. Delaware's corporate law, modeled after pre-Wilson New Jersey law, naturally welcomed departing companies and, together with the Delaware Court of Chancery, spent nearly 100 years building a reputation as a mature and impartial forum for resolving disputes between corporations and investors. However, what took a century to build began to crumble in just a few years. Right or wrong, the Delaware Court of Chancery has adopted a more lenient stance in shareholder litigation in recent years (especially in several high-profile cases, including but not limited to Tesla), and companies have begun to genuinely relocate their places of registration. Goodnight, and best of luck, Delaware. This is at least the mainstream narrative, but other data suggests a more complex picture. First, even the founding myth of Delaware itself is not entirely accurate. It wasn't until the 1980s (about 60 years after Governor Wilson took office) that Delaware truly surpassed New Jersey to become the state with the most registered businesses in the United States: New Jersey's reign lasted much longer than the mainstream narrative suggests. The catalyst for Delaware's eventual overtaking was likely the passage of a series of laws related to director responsibilities, which made it particularly attractive to publicly traded companies, coupled with the self-reinforcing network effect that created its own momentum. Secondly, regardless of what's happening with high-profile publicly traded companies (and the companies in the Ramp data), Delaware as a whole still looks to be performing well, or even better: According to data released by the Harvard Law School Corporate Governance Forum, Delaware's share of the total number of businesses in the U.S. actually increased significantly from the end of 2024 to 2025. In fact, if you're looking for a clear \"DExit\" case, it's probably this one, and it has nothing to do with Tesla, but rather involves a specific company structure: Wyoming LLCs began to grow rapidly around 2015. Why? This is likely related to specific asset protection and privacy provisions in Wyoming LLC law, which the state itself promotes as a \"cowboy cocktail.\" In short, the point here isn't that DExit isn't happening (because at least some data suggests it is—even if it's just a few high-profile companies moving out, it's significant), but the reality is certainly more complex than the mainstream narrative portrays. The reality is that Delaware still enjoys the advantage of being the default option, not to mention all the network effects tied to it, which are difficult to shake. We previously published an earlier version of this chart, but as more data has been added, the results have become increasingly striking. Token costs are decreasing, while token consumption is increasing: Since the beginning of this year, the price of paid tokens has dropped from approximately 90 cents per million tokens to 50 cents, while the number of tokens processed has almost doubled, from approximately 6,000 to 12,000. This is a classic Jevons effect. The cheaper AI becomes, the more AI we use. This is encouraging. Remember when someone said that once newer and better GPUs are released, older GPUs become unwanted? This doesn't seem to be the case: According to Silicon Data, rental prices for NVIDIA H100 and A100 have both increased this year. The market shows no signs of oversupply of computing power; in fact, it seems that even the surface of existing demand hasn't been reached. This comparison isn't a perfect analogy, but if history can provide a reference, it may still take some time before we truly understand what an \"AI-driven\" economy looks like: From Faraday and Henry's initial discussions of electricity to the real explosion of industrial productivity in the first half of the 20th century, approximately 100 years passed. While the technological iteration cycle has indeed accelerated since the 1820s, the variables involved in a platform-level shift remain extremely numerous. Roy Amara famously said, \"We always overestimate what will happen in the next two years and underestimate what will happen in the next ten years.\" Capital expenditure, viewed on a coordinate axis, reveals this set of timeless data: AI capital expenditure is massive. Please see the following comparison: AI capital expenditures in 2026 are projected to be close to the total net new loans issued by U.S. banks in 2025: Capital expenditures are approximately 33% higher than total U.S. corporate income tax revenue and about three times the total tariffs: Capital expenditures are approximately six times the total military budget of any non-U.S. G7 member country: So, yes, capital expenditures are indeed very large. Kalshi enters the field of macro forecasting. Federal Reserve researchers believe their market forecasting is quite good. At least on one metric, Kalshi's forecasts of the federal funds rate have outperformed professional forecasting agencies: For the federal funds rate forecast 150 days later (i.e., after three FOMC meetings), Kalshi's mean absolute error is very close to that of professional forecasting agencies. However, unlike surveys that only provide modal path snapshots every six weeks, Kalshi provides a continuously updated complete probability distribution… We found that Kalshi's median and mode forecasts have a perfect record of accuracy the day before the FOMC meeting, which is a statistically significant improvement compared to federal funds futures forecasts. In other words, while all forecasters start at roughly the same level, Kalshi's \"continuously updated\" predictions optimize over time, ultimately achieving a \"perfect prediction record\" the day before the official interest rate announcement. Furthermore, Kalshi outperforms predictions in the futures market. Kalshi's advantages extend beyond the federal funds rate. As Federal Reserve researchers have pointed out, since there are no other options markets for macroeconomic indicators such as inflation, growth, and unemployment, Kalshi is the only place that can provide a \"high-frequency, continuously updated, and probability-rich benchmark\" to reflect the \"public's\" judgment on the direction of these economic indicators. This sounds quite important. The Delay of Adulthood This is a thought-provoking chart, with (a few) comments: The percentage of people in their 30s who achieve major life milestones has been declining quite steeply since at least the 1980s. Fewer and fewer people in their 30s are: living independently; having been married; living with children; or owning their own home. The only exception is college enrollment—the proportion of 30-year-olds with a bachelor's degree has nearly doubled since 1995. So, is going to college worth it? A milestone? More like a millstone grinding your neck, right? Perhaps it is, perhaps it isn't, but a sense of \"buyer's regret\" seems to be pervasive.</div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/71a11324c22f8470b8a388ef17a511fa.jpg",
            "link": "https://www.coinlive.com/news/a16z-ai-costs-halved-usage-doubles-life-milestones-delayed-for",
            "pub_date": "2026-03-01 12:12:27",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 250703,
            "title": "Stripe's Annual Letter: On the 5-Level Model of \"AI + Payments\"",
            "description": "<div class=\"share___SVvtl\"><div>Hello everyone, I'm Chen Tianyuzhou. Today we're going to analyze a letter—Stripe's 2025 Annual Letter. Why analyze it? Because this letter reveals many aspects of the future we haven't seen before, based on Stripe's $1.9 trillion transaction volume! If you're not in the industry, you might not be familiar with Stripe. Simply put, Stripe is a global payment aggregator, similar to Adyen, Pingpong, and Airwallex. This letter, less than 3,000 words long, is packed with information. It's not just the company's year-end summary, but also a deep analysis and forecast of the impact of payments on the entire globalized economic activity. In 2025, Stripe's total transaction volume reached $1.9 trillion. What does this mean? A year-on-year increase of 34%, accounting for approximately 1.6% of global GDP. In other words, for every 100 dollars of wealth produced on Earth, 1.6 dollars goes through Stripe's channels. This figure reached 1.4 trillion dollars in 2024, a staggering increase of 500 billion US dollars in just one year. After reading this letter, I have only one feeling: The old world we know is collapsing and being reconstructed at an unbelievable speed. In this article, I've tried to break down the key points of Stripe's annual letter in my own words, though some parts have been directly translated to maintain the original flavor. The amount of information is indeed vast, but every point is worth pondering. If you are starting a business or in the payments industry, I suggest you read this several times. Every trend here is impacting your future survival. The letter begins by introducing a very core concept—\"sorting machine.\" They say that the market economy is essentially a giant algorithmic machine. Its role is not to make everyone rich, but rather to ruthlessly filter out profits, capital, and talent, and redistribute them to the most productive companies. Previously, this machine operated slowly, and everyone had enough to eat. But now, AI has added an overclocking engine to this machine. Looking at the data: The top third of the most profitable listed companies in the United States account for two-thirds of the entire stock market's market capitalization. This is the highest proportion since data became available in 1963. The top 10% of companies in the S&amp;P 500 contributed 59% of the profits. And this isn't a valuation bubble; it's a genuine concentration of profits. This differentiation isn't just between large and small companies, but also a life-or-death struggle within the industry. The letter gave several examples: Retail Industry: Offline brick-and-mortar sales have only grown by 5% in the past three years, while e-commerce has grown by 30% during the same period. Airline Industry: The three major US airlines—American Airlines, Delta, and United—have seen their market share and profits increase over the past decade. However, by 2025, Delta and United will have captured almost all of the US airline industry's profits. Other airlines will essentially be lagging behind. Healthcare: Hospitals and insurance companies have seen their profit share shrink significantly since 2019, but the healthcare technology sector is projected to exceed $110 billion in EBITDA by 2029. Money is flowing from traditional players to new players. This is the terrifying aspect of \"healthcare\": Previously it was big fish eat small fish; now it's fast fish eat slow fish, and it's AI-powered fast fish eating slow, clumsy fish. More macro-level data shows that demand for software, computers, and data centers will drive nearly half of the US GDP growth by 2025. And this proportion will soon become the majority. What does this mean? Previously, we said software was eating the world; now, computing power is driving growth. Industries that haven't capitalized on computing power and software are being relentlessly left behind by this machine. AI-Driven Startup Explosion<h2 style=\"text-align: left;\"><span leaf=\"\"><span text=\"\">What has Stripe observed?</span></span></h2><p style=\"text-align: left;\"><span leaf=\"\"><span text=\"\">In 2025, the number of new companies joining Stripe reached a record high, with 57% coming from outside the United States.</span></span></p><p style=\"text-align: left;\"><span leaf=\"\"><span text=\"\">Moreover, these new companies are growing at an absurdly high rate,</span><span text=\"\">50% faster than the batch in 2024</span><span text=\"\">. Even more astonishingly, companies that achieved annual revenue of $10 million within three months doubled their initial investment. However, AI companies consider this normal practice. Why? Because code commits on GitHub increased by 41%. Previously, annual increases were only 10%-12%, but by 2025, this figure has skyrocketed to 41%. The number of iOS app releases increased by 60% year-over-year in December 2025. Previously, developing an app required a team of over ten people working on it for six months. Now, a programmer and a few AI agents can write some code over the weekend, and the product can be launched and generating revenue the following Monday. Stripe itself has also jumped on this bandwagon. They created something called \"claimable sandboxes,\" allowing you to launch your Stripe account directly from AI programming tools like Manus, Replit, and Vercel. Finished your beta version and want to launch it? With a single click, a sandbox becomes a live account instantly, without any configuration changes. Currently, over 100,000 sandboxes have been created this way. And then there's Stripe Atlas—the world's simplest company registration tool—which saw a 41% increase in company registrations last year. Moreover, these new companies are monetizing much faster: in 2025, 20% of Atlas startups received their first payment from a customer within 30 days, compared to only 8% in 2020. Faced with these figures, we are forced to ask: Is 2025 an anomaly, or the beginning of a new normal? Stripe's assessment is: The acceleration in 2025 marks the beginning of a major inflection point in entrepreneurship and creativity driven by the large language model. This \"machine\" is accelerating; if you don't break into the top 10%, what awaits you may not be a slow decline, but rather an instantaneous collapse. Globalization is dead, global localization is new. One particularly interesting point in the letter is that \"globalization has become the default state.\" Previously, Chinese business owners had a relatively fixed approach when venturing overseas: first establish a presence domestically, then send people to Southeast Asia or the US to test the waters, and finally consider expanding into Europe. Coca-Cola took 20 years to bottle its first bottle of soda in Cuba. McDonald's and Starbucks took 27 and 16 years respectively to open their first stores in Canada. After the advent of the internet, free services began to be released globally simultaneously, but there was still a delay in the availability of monetization tools. When Facebook opened to the public in 2006, anyone could register an account, but wanting to run ads? Not so easy. By 2009, the company had already been around for 5 years. Google launched its global search in 1998, but didn't receive its first pound advertising payment in the UK until 2002. This strategy failed. What are AI products like now? OpenAI's ChatGPT, Anthropic's Claude, Replit, Cursor, and Midjourney are all launched simultaneously globally, covering all markets in a second. Every AI product we've heard of is incredibly popular in every country we know of. Stripe's data reveals a very unusual phenomenon: For companies whose main revenue comes from overseas, 30% of their revenue comes neither from their home country nor from the top ten economies like the US, China, Japan, and Germany, but from transparent countries that are rarely seen in the news. What does this mean? It means that demand is dispersed, but the tools are unified. Previously, if you wanted to collect money from the Kenyan people, you had to open a branch office in Kenya and negotiate with local banks to connect to M-Pesa. Now? Stripe goes all in, integrating over 120 payment methods for you—all you need to do is click a button in the backend. For example, Gamma, a California-based AI platform with 70 million users for presentations, saw its Indian revenue surge by 22% that month when it integrated with Stripe and enabled UPI payments in India. This is the benefit of next-generation infrastructure: your product can be in San Francisco, but your money can instantly flow into the pocket of a breakfast stall owner in Mumbai. Ironically, the most geographically limited sector isn't traditional industries, but rather fintech companies themselves: Chime, after 12 years, is still stuck in the US. Want to open a Chime account? Forget about it if you're outside the US. Nubank, founded in 2013, served only Brazil for the first six years, and only added two more countries in the next six. Even Stripe itself, with its Issues product launched seven years ago, only covers 22 countries—faster than most, but still not fast enough. But this is also changing. The new generation of fintech players—Sling Money, DolarApp, Felix, and KAST—are building global financial applications from day one. Stripe also launched its first inherently global product, Financial Accounts, last year, which businesses can use to hold, send, and receive funds. On its first day, it covered more than 100 countries. Why can they do this? Because of stablecoins. Their borderless nature allows fintech to build a complete infrastructure. Born global, this is truly possible for the first time. The crypto winter, the stablecoin summer. 2025 may be a crypto winter, but it will definitely be the summer of stablecoins. For the past decade, stablecoin trading volume has fluctuated with cryptocurrency asset prices. But in 2025, this correlation broke. That year, Bitcoin prices plummeted, dropping 50% from their peak. Logically, shouldn't the crypto world be entering another \"winter is coming\" phase? But strangely, stablecoin payment volume has doubled, reaching $400 billion. And it's estimated that 60% of that is B2B payments. This is the key quote from the letter: \"Crypto Winter, but Stablecoin Summer.\" Previously, people traded cryptocurrencies to get rich, but now they use stablecoins to save money and make quick money. Stripe's acquisition of Bridge, a stablecoin orchestration platform, saw its trading volume increase more than fourfold. The path for entrepreneurs has changed: A Y Combinator founder can use Stablecoin to raise funds. The money can then be deposited into a Stripe financial account to earn interest. When needed, the money can be directly used to pay the salaries of engineers worldwide—engineers who may be anywhere in the world. SaaS platforms can use smart contracts to collect stablecoin subscription fees, eliminating the need for wallet owners to manually sign every transaction. Companies using stablecoin for international expansion now have better payment tools, allowing them to directly embed digital wallets into their core products. With companies like Privy, Ramp, and Deel, businesses can manage both custodial and non-custodial wallets using a single API. Interoperability between stablecoin and fiat currencies is also rapidly improving. In April 2025, Bridge and Visa partnered to launch a card that allows businesses and consumers to spend their Stablecoins just like any other credit card. The card deducts money from the Stablecoin balance and automatically converts it to the local currency; merchants receive the payment indistinguishably from other payment methods, and may even be completely unaware that the user is paying with Stablecoins. Phantom, one of the most popular crypto wallets with 20 million monthly active users, is using Bridge to promote Stablecoin cards to its users. Even Visa has started issuing cards for Stablecoins. This means that the USDT in your wallet can already be used to buy a Coke at the convenience store on the corner. For payments, Stripe built a blockchain. Since it's preparing for the era of large-scale payments using stablecoins, Stripe has spent considerable time researching blockchain technology. Current blockchains are designed for transactions and DeFi; throughput, reliability, cost predictability, and privacy required for payments are not yet key considerations. Bitcoin can only process fewer than 10 transactions per second. In 2025, a surge in Meme coin trading on a major blockchain caused a Bridge user's payment to be delayed by more than 12 hours, and transaction fees for a single transaction skyrocketed by 35 times. These problems are critical, but the future will be even more critical. Because it is anticipated that most internet transactions in the future will be completed by intelligent agents, we need a blockchain capable of supporting more than one million, or even one billion transactions per second. In September 2025, Stripe and Paradigm jointly incubated Tempo, a blockchain specifically designed for payments. Tempo's logic is simple: I won't play those fancy DeFi games; I'll focus solely on payments. Dedicated payment channels: Not competing with Meme Coin. Sub-second final confirmation: As fast as swiping a credit card. Optional Privacy: Protects trade secrets while ensuring compliance. Interoperability with Compliance and Accounting Systems: Don't talk to me about money laundering; I know more about anti-money laundering than you do. These features may not seem significant, but they are crucial for the payment infrastructure that supports real economic activities. Visa, Nubank, and Shopify are already testing Tempo in various scenarios, including global payments, embedded finance, and remittances. Klarna, whose CEO once called himself a cryptocurrency skeptic, has now become the first bank to issue a stablecoin: KlarnaUSD on Tempo's testnet, using Bridge's Open Issuance to accelerate and reduce settlement costs for cross-border payments. Tempo's architecture is particularly well-suited for agent payments and microtransactions. The mainnet is launching soon; we look forward to seeing what new applications ambitious companies will develop with it. Small Business Financing Dilemma</span></span></p><h2 style=\"text-align: left;\"><span leaf=\"\"><span text=\"\">Since 2008, the per capita GDP growth rate of OECD countries has been a paltry 1.0%, while the average growth rate over the previous 46 years was 2.8%.</span></span></h2><p style=\"text-align: left;\"><span leaf=\"\"><span text=\"\">Since 2008, the per capita GDP growth rate of OECD countries has been a meager 1.0%, while the average growth rate over the previous 46 years was 2.8%.</span></span></p><h2 style=\"text-align: left;\"><span leaf=\"\"><span text=\"\"> </span></span></h2><p style=\"text-align:center\"><img src=\"https://img.jinse.com.cn/7436553_image3.png\" type=\"block\"/></p><p style=\"text-align: left;\"><span leaf=\"\"><span text=\"\">Japan's aging population, Brexit, Europe's energy structure......</span></span></p><p style=\"text-align: left;\"><span leaf=\"\"><span text=\"\">However, there is ample evidence that a significant culprit is the sharp decline in global capital availability. </span></span></p><p style=\"text-align: left;\"><span leaf=\"\"><span text=\"\">In most OECD countries, bank capital requirements increased after the financial crisis, and capital availability for small businesses decreased. </span></span></p><p style=\"text-align: left;\"><span leaf=\"\"><span text=\"\">Basel III reforms raised the capital standards for large global banks. In Ireland, bank lending to small businesses declined by more than 66% between 2011 and 2019. In the UK, small business lending has remained weak since contraction in 2012. The US fared slightly better, with non-bank lending institutions providing some access, and per capita GDP growth of 1.7% over the past 15 years. However, the overall trend in the post-Dodd-Frank era remains the same: tightening banking regulations and declining capital availability for small businesses. Since 2010, loans over $1 million have increased by 68%, while loans under $1 million have decreased by 5%. Last year, the approval rate for small business loans in the United States was only 41%, compared to 50% in 2015. Stripe Capital aims to address the global shortage of capital, particularly for small businesses. For businesses using Stripe for payments, their real-time revenue data simplifies loan decisions. Businesses can repay loans with a small percentage of subsequent sales, essentially drawing working capital from their own growth. From 2024 to 2025, funding increased by 45%, and Stripe Capital served over 80,000 companies. Many of these companies received funding through the vertical SaaS platforms they used—GlossGenius for beauty salons, Tekmetric for auto repair shops, Pixieset for photographers, and so on. Over the past two years, Stripe conducted a randomized study to understand the impact of capital: how fast can companies go when we \"lubricate their wheels\"? The result was, much faster. Companies that secured capital funding grew 27 percentage points faster than their peers who didn't receive funding in the following year. The top 10% of companies grew three times faster than their peers. The next tier also grew nearly 100 percentage points faster. For example, Xirsys, a California-based server hosting company, used funding from Stripe Capital to expand its server presence in China, India, and Japan, subsequently doubling its revenue. It's worth noting that even companies with low credit scores experienced 11 to 18 percentage points faster growth after securing funding. Stripe, in its letter, proposed a hypothesis: as AI improves ROI, capital availability may become a more significant variable in future economic outcomes. \"Low-Income Model\" OR \"High-Income Model\" For established companies, the number of clearly identifiable growth levers is pitifully small, and the most enticing ones don't necessarily work. Take advertising, for example. In 2019, Gillette's ad \"The Best Men Can Be\" won a Silver Lion at Cannes. Later that year, Procter &amp; Gamble recorded an $8 billion impairment charge on this business because the award-winning ad failed to drive explosive growth. Recently, an Indian Railways advertisement won the Grand Prix and six Golden Lions at Cannes 2025—a daily lottery with a chance to win 10,000 rupees with a train ticket every day—but it was discontinued after eight weeks because no growth in ticket sales was seen. This is why Stripe, after 15 years, maintains a missionary-like passion for payments. Compared to more uncertain growth paths, optimizing payment settings is almost a guaranteed way to increase revenue, and one of the growth activities with the highest ROI. Microsoft evaluates the performance of each payment service provider monthly. From June to October 2025, Stripe significantly improved Microsoft's authorization rate using a series of methods, including adaptive acceptance, card account updaters, and network tokens. As a result, Microsoft shifted more payment traffic to Stripe. Gatwick Airport's previous payment provider had issues with payment failures, disputes, and customer complaints. After switching to Stripe, the payment success rate increased by 2.5 percentage points. FICO conducted an A/B test, comparing the previous payment provider with Stripe, and then completely switched, resulting in a 1 percentage point increase in the authorization rate. Telehealth's Royce saw a 2% increase in authorization rates and a 3% decrease in dispute rates over the past 12 months using Stripe, resulting in tens of millions of dollars in additional revenue annually. Most businesses are currently living in what Stripe calls the \"low-revenue model\": their payment infrastructure isn't optimized, and they're wasting money on conversion rates, authorization rates, and fraud prevention. What does the \"high-revenue model\" look like? The checkout page should be dynamically adjusted based on each customer. It should be priced in local currency and offer only the most relevant of hundreds of local payment options. Introducing BLIK payment to Polish customers increased checkout conversion rates by an average of 46%; offering Pix to Brazilian customers increased conversion rates by an average of 31%. Behind these achievements lies Stripe's decade-long investment in AI, including their \"payment foundation model\" and a suite of AI-driven services—Stripe Radar, Optimized Checkout Suite, and Authorization Boost—quietly optimizing billions of dollars in transactions daily. But there's still plenty of room for improvement! Last year, Stripe began testing a new authentication method: allowing customers to tap their cards to their phones. This touch verification validates the card's NFC chip, effectively proving that the cardholder possesses the card. DoorDash participated in the testing and found that compared to previous anti-fraud methods, conversion rates were significantly improved, and chargeback rates were reduced. Stripe also built a new model for Radar to address new fraud methods arising from the AI ​​wave—especially those that steal AI inference computing power through abuse of free trials, which are now very common. Here's an excerpt from the original text: CEOs: Flashy ads are fun, but don't overlook the growth opportunities right under your noses. Your heads of payments absolutely deserve more recognition. How about we hold an awards ceremony for them? In the south of France, to recognize payment optimization. Or if you think the weather there is too nice, San Francisco is also an option; April is perfect. The recent hot topic in the AI ​​world is that models can not only think using training data, but also go online, use browsers, write code, and do things on the internet. For Stripe's world, the most relevant concept is: your AI will soon be buying things for you. Like other AI concepts, agent-based commerce has also been overhyped prematurely. Some people make grand promises, claiming that autonomous agents will know your every preference and plan and execute all your shopping. Stripe breaks this promise down into five levels: Level 1: Eliminating Web Forms You research and decide what to buy yourself. But nobody likes filling out web forms. If you could directly send the agent a link, have them fill in payment and shipping information, and then confirm it with you, that would be much simpler. The system doesn't make any decisions; it just types and clicks \"buy\" for you. Level 2: Descriptive Search You no longer need to search for products or specific attributes, but rather describe the scenario. \"I need to prepare back-to-school supplies for a third-grade child in Chicago, including clothes (not too tight or itchy!), pencils, notebooks, and a lunchbox. My son likes K-pop Demon Hunters and tennis. School starts at the end of August.\" The system considers weather, material, size, durability, taste, reviews, and delivery time. Niche and long-tail products become easier to find. Annoying keyword searches will become a thing of the past. Level 3: Long-lasting Memory You no longer need to introduce yourself. \"Find me Bobby's back-to-school outfit options.\" The system already knows your preferences and remembers the requirements deduced from previous conversations and purchases. You still decide what to buy, but the options have been filtered based on your taste and budget. Level 4: Delegation You no longer need to make choices. \"Get back-to-school shopping under $400.\" The system handles the searching, evaluating, and purchasing for you. You trust it to weigh the trade-offs and choose what your son likes, just like you do. You only set the budget. This is essentially what most people think about when they talk about agency-based business. Level 5: Proactive Prediction There aren't even any prompts. The system already knows the school calendar, your son's preferences, and your usual budget. You only receive one notification: Here's the list of school supplies already purchased. This is the most futuristic version: what you need appears just before you need it, without you even having to say a word. This industry is currently on the edge of Level 1 and Level 2. Stripe revisited the mid-1990s, the period when the internet architecture we use today was finalized. Netscape created the graphical browser. HTTP and HTML became the shared application layer. URLs and DNS took off. Back then, nobody knew which protocol or player would win. Every Google had an AltaVista in front of it. Now, proxy commerce is at a similar critical juncture—it has the potential to be a generational game-changer. Like the early internet, the future of proxy commerce depends on universal interoperability. To this end, Stripe did a lot last year: It collaborated with OpenAI on the Agentic Commerce Protocol (ACP), establishing a shared technical language between AI platforms and enterprises. Its open design allows it to be used across payment providers and AI platforms. It also launched Shared Payment Tokens, a new payment primitive that allows agents to initiate payments without exposing credentials. Even businesses that don't use Stripe for payment processing can forward these tokens to their own vaults or other processors as security credentials. The Agentic Commerce Suite has been released, providing businesses with a single tool that allows them to sell across multiple AI interfaces and protocols (including ACP and Google's Universal Commerce Protocol released last month) with a single integration. Checkout, payment, and fraud prevention all function normally at the underlying level. Brands already integrated include Anthropologie, Urban Outfitters, Etsy, Coach, and Kate Spade. Machine payments have also been launched, allowing developers to directly receive payments from agents using stablecoin micropayments—via API calls, MCP usage, and HTTP requests. Autonomous agents themselves are becoming a new customer type for internet companies. In collaboration with OpenAI, we've created the first shopping experiences on ChatGPT. We're also working with Microsoft to bring similar capabilities to Copilot. No one can accurately predict where agent-based business will be by the end of 2026, but it's clearly past the hype phase and entered the construction and real-world testing stage. The pace of change will only accelerate. If all goes well, those small agents won't be trapped in walled gardens, but will be racing along the wide highway of open protocols. The Republic of Licensing and the Cost of Innovation Today's entrepreneurs and innovators possess tools and reach unimaginable to previous generations of industrialists. How wonderful it would be if the combined effects of human ingenuity ultimately translated into increased productivity and improved living standards. Last year, Joel Mokyr won the Nobel Prize in Economics. Mokyr is known for emphasizing the importance of culture relative to traditional economic factors such as capital, labor, and technology. Eighteenth-century industrialists relied on more than just coal or geographical location. They possessed a new culture—a \"reform mentality\"—that viewed the status quo as imperfect and subject to correction. In *The Political Economy of Technological Change*, Mokyr also observes that new technologies have often failed in the past, not because they were not advanced enough, but because technology decisions involve not only suppliers and customers, but also a host of non-market aggregators—regulators, committees, courts—who influence what is adopted. As AI and the internet expand the boundaries of possibility, the synthetic barriers that hinder adoption and adaptation will become increasingly expensive. The economic divergence we are experiencing suggests that growth depends on the application of useful knowledge, not the existence of abstract knowledge itself. AI promises to greatly improve drug discovery… but this potential will only be realized if it makes regulatory processes (including clinical trials) faster and cheaper. European entrepreneurs can use new tools to revive a sluggish economy… but only if they cut back on well-intentioned but ultimately harmful burdens, such as the EU AI Act. Next-generation nuclear energy technology could bring energy abundance… but only if outdated regulatory systems are thoroughly reformed. Autonomous logistics—from long-haul trucks to drones—could drastically reduce the cost of physical goods… provided local regulations don't harden into barriers. Mokyr has written about the importance of “civilian republics” in catalyzing the Industrial Revolution. Today, we live in a “licensing republic”: a filter composed of non-market aggregators. While much regulation is well-intentioned, it is now more important than ever to ensure that it carefully weighs the benefits gained against the potential for being blocked. Fortunately, we can support resilient companies that demonstrate the boundaries of possibility: Mistral AI and Bending Spoons are proving that top European talent can pierce the regulatory freeze. Zipline and Varda are gradually securing licenses for complex new hardware. Spring Health and Maven Clinic are weaving new software layers for modern healthcare. We remain convinced that ideas are crucial to driving economic progress, and that many of the best ideas are undervalued. Stripe Press's book list contains many people, stories, and models that we believe can contribute to the next wave of improvement. The team recently celebrated selling one million books. Works in Progress, our magazine about undervalued, world-changing ideas, has also recently gone into print. The Event Horizon of a Black Hole This letter devotes a large portion to the progress of AI, sometimes making it feel like we're falling behind. The gap between newly released products and last year's most advanced technology is stark. We're reminded of the phenomenon of falling into a supermassive black hole. If you unfortunately experience this, the moment you cross the event horizon doesn't actually feel anything special: the path is locally smooth, although the space of future possibilities has irreversibly changed after crossing that boundary. As we write this letter, we may be standing on the eve of a different, hopefully better, singularity. While many things around us feel similar to previous years in 2026, it's also clear that the next decade will be completely different from the past one. We remain convinced that a vibrant entrepreneurial spirit and a wise culture will help build a more successful future society. We hope Stripe can play a small role. If you are also driving economic growth—whether as an entrepreneur, business leader, or builder of financial infrastructure—we hope to see you at Stripe Sessions in April. As always, there's much to discuss. That machine won't stop; it will only spin faster and faster. Whether you become the selected winner or just redundant data thrown out depends on how you deal with it now. That's all for now, see you next time.</span></span></p></div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/6c6d235f0d6fdd4610c375ea686278d9.jpg",
            "link": "https://www.coinlive.com/news/stripe-s-annual-letter-on-the-5-level-model-of-ai",
            "pub_date": "2026-03-01 11:37:22",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 250701,
            "title": "Iran's cryptocurrency shadow economy reaches $7.78 billion. CZ: All is well.",
            "description": "<div class=\"share___SVvtl\"><div><h2 style=\"text-align: left;\">Headline</h2><p style=\"text-align: left;\"><strong>▌Iran's Crypto \"Shadow Economy\" Reaches $7.78 Billion, with IRGC Accounting for Over Half</strong></p><p style=\"text-align: left;\">Data from blockchain analytics company Chainalysis shows that Iran's crypto ecosystem reached $7.78 billion in 2025, with its growth rate accelerating further compared to the previous year, reaching a size equivalent to the GDP of some small countries.\n\nIran legalized crypto mining in 2019, allowing licensed miners to use subsidized electricity, provided they sell the mined BTC to the central bank. Bitcoin is used for import payments and trade settlements outside the dollar system. In recent years, Iran's share of global Bitcoin hashrate is estimated at 2% to 5%.\n\nThe report points out that the role of the Iranian Islamic Revolutionary Guard Corps (IRGC) in this system has been continuously strengthened. In the fourth quarter of 2025, addresses related to the IRGC accounted for over 50% of the total crypto inflows into Iran; the total inflow for the year exceeded $3 billion, higher than the approximately $2 billion in 2024.</p><p style=\"text-align: left;\"><strong>▌CZ reports: All is well</strong></p><p style=\"text-align: left;\">CZ posted on the X platform, \"All is well. Considering the current situation, it is actually very calm here. UAE citizens and tourists have full confidence in the national leadership and defense system. I saw some smoke in the sky and heard a few loud bangs. Fortunately, the bomb fragments landed in the courtyard of the Fairmont Hotel, not the hotel itself. Hopefully, no one was injured. This world is crazy! I hope everyone is safe and healthy!\"</p><hr/><h2 style=\"text-align: left;\">Market Data</h2><p style=\"text-align: left;\">As of press time, according to CoinGecko data:</p><p style=\"text-align: left;\">BTC price is <strong>$66,191.00</strong>, with a 24-hour change of approximately <span color:=\"\" rgb=\"\" style=\"color: rgb(0, 176, ETH price is $1,947.72, with a 24-hour change of approximately +0.9%; BNB price is $615.26, with a 24-hour change of approximately +0.2%; SOL price is $84.38, with a 24-hour change of approximately +2.8%; DOGE price is $0.09328, with a 24-hour change of approximately... style=\"><strong>–0.3%</strong></span>；<br/>XRP price is <strong>$1.37</strong>, with a 24-hour change of approximately <span style=\"color: rgb(0, 176, 80);\"><strong>+0.7%</strong></span>；<br/>TRX price is <strong>$0.28181</strong>, with a 24-hour change of approximately <span style=\"color: rgb(255, 0, 0);\"><strong>–0.8%</strong></span>；<br/>WLFI price is <strong>$0.1123</strong>, with a 24-hour change of approximately <span style=\"color: rgb(0, 176, 80);\"><strong>+0.7%</strong></span>；<br/>HYPE price is **Approximately $30.60, 24-hour change approximately +11%** **Policy** **▌OpenAI states regarding its agreement with the U.S. Department of Defense: AI systems will not be used to independently command autonomous weapons** **OpenAI states regarding its agreement with the U.S. Department of Defense: AI systems will not be used to independently command autonomous weapons where laws, regulations, or departmental policies require human control.** **Trump on Iran: I can choose a long war or I can end it in two or three days** **According to AXIOS, U.S. President Trump stated in an interview on Saturday that he has prepared multiple \"escape routes\" for the \"epic fire\" operation against Iran.** Trump stated, \"I can intervene and control the whole situation for a long time, or I can end it all in two or three days and say to the Iranians, 'If you're going to restart (the nuclear and missile programs), then we'll see you in a few years.' Either way, it will take them several years to recover.\" Trump listed two main reasons for launching the attack—the first being the failure of this week's negotiations led by his envoys Witkov and Kushner. \"The Iranians always come close to a deal and then back down—it's a recurring pattern. From this, I see that they don't really want a deal.\" The second reason is Iran's actions over the past few decades. Furthermore, according to a senior US official, the US-Israel joint operation is expected to launch a large-scale bombing campaign lasting at least five days. The E3 leaders issued a statement on Iran, stating that France, Germany, and the United Kingdom have consistently urged the Iranian regime to halt its nuclear program, limit its ballistic missile program, cease its destabilizing activities in the region and on our homeland, and end the heinous violence and repression against its own people. We have not participated in these attacks, but we maintain close contact with our international partners, including the United States, Israel, and other partners in the region. We reiterate our commitment to maintaining regional stability and protecting civilian lives. We condemn Iran's attacks on countries in the region in the strongest terms. Iran must cease its indiscriminate military strikes. We call for the resumption of negotiations and urge the Iranian leadership to seek a solution through negotiations. Ultimately, the Iranian people must be allowed to decide their own future. Kuwait Stock Exchange: Trading Suspended from March 1 Due to the escalating situation. The Kuwait Stock Exchange announced that trading will be suspended from March 1 until further notice due to the escalating situation. Blockchain Applications. Vitalik Buterin stated in an article on the X platform that Ethereum has been discussing account abstraction (AA) since early 2016, and now EIP-8141, as a comprehensive proposal, aims to solve all remaining problems related to AA. The core concept of this proposal is \"frame transactions,\" where a transaction contains N calls that can read each other's call data and authorize senders and gas payers.\n\nThis mechanism supports multiple use cases: ordinary account transactions (such as multi-signature, variable key, and quantum-resistant signature schemes) are completed through verification and execution frames; when paying gas fees using non-ETH tokens, it can be achieved through the main payment contract without any intermediaries; regarding privacy protocols, it can be implemented by verifying ZK-SNARKs or adding two-dimensional random numbers through the payment contract. In terms of security, at the on-chain level, transactions are only valid when the verification frame returns ACCEPT with a payment gas flag; at the mempool level, conservative rules will be adopted initially, with gradual expansion later. EIP-8141 is highly complementary to FOCIL; FOCIL ensures rapid transaction inclusion, while AA ensures that complex operations can be executed directly as first-class transactions. The proposal is also discussing EOA compatibility, which is feasible in principle. After more than ten years of research, these technologies are expected to be implemented through a Hegota fork within a year. Spain Urges to Launch Digital Euro by 2028 to Reduce Reliance on US Payment System The Spanish government is calling for the official launch of the digital euro to be brought forward to 2028, a year earlier than the current official target of 2029.\n\nIn a competitiveness strategy document submitted to European Council President António Costa, Spanish Prime Minister Pedro Sánchez stated that Europe needs to establish a \"sovereign payment architecture,\" noting the significant growth in dollar-backed stablecoin financial intermediation activities, which increases the urgency of the project. Cryptocurrency </p><p style=\"text-align: left;\">▌<strong>Suspected Insider Trading: Six Accounts Profit $1 Million from Betting on US Strategy Against Iran on Prediction Platform</strong></p><p style=\"text-align: left;\">According to analytics firm BubblemapsSA, six accounts on the prediction platform Polymarket earned approximately $1 million by betting on a US strike against Iran before February 28. These accounts were all newly opened in February, and they only placed bets on the time when a US strike was likely to occur. Some of these shares were purchased just hours before the first reports of the Tehran explosion, and some were even bought at around one-tenth of a share. This betting pattern has raised suspicions of insider trading. Blockchain analysts point out that similar patterns have appeared in other suspected insider trading cases in prediction markets, such as the case where an insider made huge profits in January by betting on the removal of Venezuelan President Maduro from power.</p><ol class=\"list-paddingleft-2\"></ol><p style=\"text-align: left;\"><strong><strong>▌</strong>Data: A whale invested $4 million in HYPE in the past 24 hours, averaging $27.45 per token.</strong></p><p style=\"text-align: left;\">According to market news, a whale with the address \"0x96d\" invested $4 million USDC in the past 24 hours, purchasing 145,741 HYPE tokens at an average price of $27.45. Currently, the whale's HYPE tokens have generated a floating profit of over $500,000.</p><ol class=\"list-paddingleft-2\"></ol><p style=\"text-align: left;\"> Analysis: Ethereum MVRV Ratio Indicates Price is in Long-Term Bottom Range. Analyst Ali stated that the current Ethereum MVRV (Market Value to Real Value Ratio) has dropped to 0.78. Historically, when the MVRV ratio falls below 0.80, ETH is usually close to a long-term bottom.\n\nHowever, the market is currently in a large distribution phase. Ali suggests that if selling pressure continues, potential support levels are: $1800, $1584, $1238, and $1089. Important Economic Developments: The Israeli military detected a new round of missile launches from Iran. (Golden Encyclopedia) ▌What is the true value of BTC? BTC is often compared to \"digital gold,\" but its core value lies in its \"promise of immutable scarcity.\" First, BTC has monetary properties, but it is not a currency because it lacks a stable unit of account. It is purely \"monetary,\" representing a consensus game among humans regarding \"what can serve as a store of value.\" Gold also has this core value, but its scarcity relies on physical geological constraints, while BTC's scarcity relies on mathematics and game theory—a scarcity at the information level. However, what truly makes BTC unique is not the coin itself, nor the \"digital gold\" narrative, but rather that blockchain is the first permissionless, unclosable value settlement layer in human history. This is a completely new category of infrastructure. No sovereign entity can unilaterally prevent the final settlement of a BTC transaction. This attribute may be underestimated in peacetime, but it will be repriced during periods of geopolitical conflict and escalating capital controls. BTC is a systemic hedge. It doesn't hedge against inflation, nor does it hedge against the US dollar. It hedges against the structural degradation of institutional trust. In other words, BTC's value is not endogenous, but reflexive: the more people believe it has value, the more valuable it becomes, and vice versa. Therefore, BTC is the financialized expression of humanity's distrust of its own institutional capabilities. Its ceiling depends on the depth and breadth of this distrust, and its floor depends on the existence of a superior alternative.</p></div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/226f1f9cac648d5dd986f55a1c24d4f6.jpg",
            "link": "https://www.coinlive.com/news/iran-s-cryptocurrency-shadow-economy-reaches-7-78-billion-cz-all-is",
            "pub_date": "2026-03-01 09:22:00",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 250687,
            "title": "Bit deer live by following water and grass",
            "description": "<div class=\"share___SVvtl\"><div><p style=\"text-align: left;\"><em>Author: Zhou, ChainCatcher</em></p><p style=\"text-align: left;\">Bitdeer's Bitcoin holdings have gone to zero.</p><p style=\"text-align: left;\">As one of the leading mining companies, it held over 2400 BTC at its peak in November last year, then continuously increased its selling pace until it completed its liquidation in mid-February, and now it maintains a pace of selling as much as it mines.</p> ... It's worth noting that the company's financial report shows that in the fourth quarter of 2025, it achieved revenue of US$224.8 million, a year-on-year increase of 226%; net profit reached US$70.5 million; total hashrate reached 71.0 EH/s, a year-on-year increase of 229%, and mining machine efficiency also increased significantly from 30.4 J/TH to 17.9 J/TH. A company with a blazing profit and record-high hashrate has chosen to clear its Bitcoin reserves at this time. To understand this operation, we need to return to a fundamental fact that has long been obscured by the market. 1. Coin hoarding has always been a minority strategy. BitDeer was never a faith-driven coin hoarding institution. In its early years, the company followed the simplest mining company logic—mine, sell, and convert to cash. BTC was not an asset to it, but a product. Until the last two years, when MicroStrategy's coin hoarding model gained immense popularity in the capital market, and the valuation logic of mining companies began to be reshaped, BitDeer followed the industry trend and briefly switched to a coin hoarding narrative. This kind of following the trend is not uncommon in the industry, but very few actually stick to it. Tom Dunleavy, an analyst at blockchain research firm Messari, released data showing that from January to November 2025, 10 major listed mining companies, including Core Scientific, Riot, Marathon, and Hut8, mined a total of approximately 40,700 BTC, while selling approximately 40,300 BTC during the same period, a sales rate of nearly 99%. In other words, these companies have never truly been hoarding coins. This figure reveals the industry's fundamental survival rule: mining companies are essentially energy arbitrageurs; Bitcoin is an intermediary for them to convert cheap electricity into revenue, not a long-term holding on their balance sheets. For some time, the market believed the hoarding story partly because the continuous rise in BTC prices masked this reality—when assets appreciate, selling becomes a matter of posture; but when prices fall below mining costs, selling transforms from a posture into a survival instinct. Therefore, BitDeer's recent liquidation is less a betrayal of faith and more a return to its true nature. It's certainly not a signal of a bearish outlook on Bitcoin; Wu Jihan himself stated on social media that holding zero positions doesn't mean it will always be that way. However, this time, the sale wasn't for operating cash, but for initial funding for a transformation. That brief period of hoarding was merely an interlude in the industry's collective narrative in cooperation with the capital market. 2. Triple Pressure: How Cold is the Winter for Mining Companies? Understanding that hoarding is a minority allows for a clearer view of the current situation of mining companies. And what weighs heavily on this industry is the predicament of three simultaneous tightening measures. First, there's the cost pressure after the halving. The 2024 halving means a reduction in block rewards, directly halving the output per unit for mining companies, while electricity costs, machine depreciation, and maintenance costs remain unchanged. The shutdown price of many mining machines is already close to or even exceeds the current BTC price, meaning that starting up results in losses, while shutting down wastes assets. Dunleavy also points out that miners' continuous selling of newly mined BTC itself constitutes structural downward pressure on prices. The lower the price, the more coins mining companies need to sell; the more coins sold, the harder it is for prices to rebound, thus creating a self-reinforcing vicious cycle. Secondly, there are the stark figures in the financial reports. Looking at the 2025 annual reports of mining companies, almost without exception, they all showed a structure where revenue increased, but so did losses. MARA Holdings' annual revenue increased from $656 million to $907 million, but its net loss reached a staggering $1.31 billion, compared to a profit of $541 million in the same period of the previous year. Hut 8's revenue increased from $162 million to $235 million, but its net loss changed from a profit of $331 million to a loss of $248 million. TeraWulf's full-year revenue increased from $140 million to $169 million, while its fourth-quarter loss per share widened from $0.21 to $1.66. The phenomenon of increased revenue but decreased profit is occurring simultaneously in several leading companies, indicating that this is not a management issue, but rather a structural cyclical contraction within the industry. Fluctuations in the fair value of cryptocurrency assets directly impact the profit and loss statement, making the figures on the books look particularly bad. Meanwhile, companies are still using debt to facilitate transformation: Hut launched a $1 billion ATM financing plan and signed a credit agreement with Coinbase for up to $400 million; Cipher Digital completed three financing rounds totaling $3.73 billion. Finally, the macroeconomic environment has changed. Trump's increase in global tariffs and the continued escalation of geopolitical uncertainty have put pressure on risk assets, with Bitcoin falling below $65,000. Cryptocurrency analysis firm QCP points out that Bitcoin's price is significantly lower than the average mining cost, and prioritizing liquidity over hoarding is no longer a strategic choice but a practical constraint. Bitdeer's liquidation and Cango's sale of small amounts of BTC for operational purposes, combined, outline the industry's trend towards risk-averse strategies. 3. A Gamble of Transformation: Facing Death to Survive Under the pressure of triple tightening, mining companies have only one way out: transformation, using the infrastructure assets accumulated through Bitcoin mining to unlock a new source of revenue. AI and high-performance computing have become the next card the industry collectively bets on. The logic is not difficult to understand. Mining companies hold a large number of cheap electricity contracts and scalable data center land, which are precisely the scarcest resources for AI computing infrastructure. Switching from low-margin mining power to high-margin AI computing power leasing seems like a profitable deal on paper. Bitdeer is aggressively developing its self-developed mining machines (Sealminer), AI cloud services, and high-performance computing businesses; Cipher has changed its brand from Mining to Digital, signaling its platform transformation; and several companies are vying to secure long-term, low-priced electricity contracts to build a structural moat in energy costs. However, the actual progress is far more conservative than the narrative suggests. Take TeraWulf as an example. In the fourth quarter, the company's revenue from HPC was only $9.7 million, accounting for less than 30% of its total revenue of $35.8 million, and a significant drop compared to the third quarter. Customer acquisition, contract signing, and capacity ramp-up for AI businesses all take time, while debt pressure and equity dilution are immediate. The outcome of this transformation gamble depends on whether the new business can truly scale up before the debt matures. Intriguingly, during the same period when BTC fell by nearly 17% in a single month, the stocks of several mining companies bucked the trend and strengthened. For example, TeraWulf rose 31% cumulatively this month, Cipher rose 8%, Hut 8 rose 6%, and Core Scientific remained basically flat. This decoupling reflects a revaluation in the capital market—mining companies have long been one of the sectors with the highest short positions held by hedge funds, and the upward momentum may partly come from short covering. This indicates that the market is beginning to see these companies as potential carriers of AI computing power infrastructure, rather than leverage amplifiers for Bitcoin prices. In the future, their evaluation criteria may no longer be who holds how much BTC, but who has locked in the longest-term low-priced electricity, whose data center assets have the greatest potential for AI transformation, and whose balance sheet can weather the pain of transformation. Conclusion Mining companies have never been the most devout believers in Bitcoin; they are the most rational industry participants. When mining is profitable, they mine; when hoarding coins can support valuations, they choose to hoard coins; when selling coins can provide the funds for transformation, they will sell without hesitation. This is the basic logic of business. The real question worth pursuing is the next one: after the AI/HPC transformation story has been fully priced in by the capital market, what will these companies have left to support the next round of valuations? If the price of Bitcoin has recovered by then, and the transformation business is not yet mature, will those mining companies that are clearing out their positions today start telling the story of hoarding coins again? Cycles come and go, narratives are ever-evolving. But in every current winter, survival is always more important than faith.</div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/165b1f2fea09f1941d5ca77d8d69b80e.jpg",
            "link": "https://www.coinlive.com/news/bit-deer-live-by-following-water-and-grass",
            "pub_date": "2026-02-28 22:12:33",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 250683,
            "title": "Golden Web3.0 Daily Report | OpenAI and the U.S. Department of Defense Sign Cooperation Agreement",
            "description": "<div class=\"share___SVvtl\"><div><h2 style=\"text-align: left;\"><strong>DeFi data</strong></h2><p style=\"text-align: left;\"><strong>1. Total market value of DeFi tokens: $47.536 billion</strong></p><p style=\"text-align:center\"><strong><img alt=\"ezoKsBr3CWIWkfm2wAMapQFZqIpWgrNhsYZyEtTj.png\" src=\"https://img.jinse.com.cn/7436525_watermarknone.png\" title=\"7436525\"/></strong></p><p style=\"text-align:center\"><img alt=\"lKYqmRzVZvTQpcyfBlMTI7sEIf6pM1ifd9F9goj1.png\" src=\"https://img.jinse.com.cn/7436526_watermarknone.png\" title=\"7436526\"/></p><p style=\"text-align: center;\">DeFi Total Market Cap Data Source: coingecko</p><p style=\"text-align: left;\"><strong>2. Trading volume of decentralized exchanges in the past 24 hours: $37.32</strong></p><p style=\"text-align:center\"><strong><img alt=\"vp2whR4ucAifCUKDUUvv3aLfAtFQ0b31razqtZS7.png\" src=\"https://img.jinse.com.cn/7436528_watermarknone.png\" title=\"7436528\"/></strong></p><p style=\"text-align:center\"><strong><img alt=\"anZTM09SP76Ulnq18mDyTKstohTYNAif2UvbhL9K.png\" src=\"https://img.jinse.com.cn/7436527_watermarknone.png\" title=\"7436527\"/></strong></p><p style=\"text-align: center;\">Trading volume of decentralized exchanges in the past 24 hours. Data source: coingecko</p><p style=\"text-align: left;\"><strong>3. Assets locked in DeFi: $910.52 billion</strong><strong>$100 million</strong></p><p style=\"text-align:center\"><img alt=\"1IN8lZ4H5whLEHuky2QHCs0iwTGEvMfqqew0i2Pc.png\" src=\"https://img.jinse.com.cn/7436529_watermarknone.png\" title=\"7436529\"/></p><p style=\"text-align:center\"><img alt=\"Dh87rXLPOFEe0fLnxCLcJdZHcwBTu8q7Mcn5YSYn.png\" src=\"https://img.jinse.com.cn/7436530_watermarknone.png\" title=\"7436530\"/></p><p style=\"text-align: center;\">Top 10 DeFi Projects by Locked Assets and Total Value Locked. Data Source: defillama</p><h2 style=\"text-align: left;\"><strong>NFT Data</strong></h2><p style=\"text-align: left;\"><strong>1. Total Market Value of NFTs: $7.015 billion</strong></p><p style=\"text-align:center\"><strong><img ...=\"\" left=\"\"/><strong>2.24 hours NFT transaction volume 1.49 billion USD</strong><strong></strong></strong></p><p style=\"text-align:center\"><strong><img alt=\"sVOlS44AVTtsynbm9AQWEMyQSLaMakmXCjd7HMfj.png\" src=\"https://img.jinse.com.cn/7436534_watermarknone.png\" title=\"7436534\"/></strong></p><p style=\"text-align:center\"><strong><img alt=\"rXbg5oPckKGLiVANi1qHlEI6HtGylWJM4ykws6Iw.png\" src=\"https://img.jinse.com.cn/7436533_watermarknone.png\" title=\"7436533\"/></strong></p><p left=\"\" style=\"text-align: NFT Total Market Cap, Top 10 Market Cap Projects Data Source: Coinmarketcap&lt;/p&gt;&lt;h2 style=\" text-align:=\"\">Toutiao</p><p style=\"text-align: left;\"><strong>OpenAI and the US Department of Defense Sign Cooperation Agreement</strong></p><p style=\"text-align: left;\">OpenAI founder Sam Altman posted on X that tonight, we reached an agreement with the Department of War to deploy our models in its secure network. Throughout the communication process, the Department of War demonstrated a strong commitment to security and a desire to achieve optimal results through cooperation. AI security and universal benefit are at the core of our mission. Our two most important security principles are: prohibiting mass surveillance within the country and ensuring that the use of force is carried out with human responsibility—this includes autonomous weapons systems. The Department of War endorses these principles and has incorporated them into its laws and policies, which we have also included in this agreement. We will also build technical safeguards to ensure the models function as intended, which is also a requirement of the Department of War. We will deploy FDE (Functional Safety/Deployment Assurance Element) to support model operation and ensure security, and will only deploy it in cloud networks.\n\nWe are requesting the War Department to open the same terms to all AI companies, which we believe is a condition that all institutions should be willing to accept. We have clearly expressed our strong desire for the situation to de-escalate, shifting from legal and administrative action to rational and reasonable negotiation.\n\nWe will, as always, do our utmost to serve all humanity. The world is complex, chaotic, and sometimes even dangerous. </p><h2 style=\"text-align: left;\">Hot Topics</h2><p style=\"text-align: left;\"><strong>1. Polymarket</strong></p><p style=\"text-align: left;\">Samples believe that the prediction market sector still has potential. Polymarket, without a token issuance, has become an important indicator, with structural arbitrage opportunities surrounding whether to issue tokens, price imbalances, and cross-platform hedging. At the same time, it has repeatedly warned of the systemic insider trading and information asymmetry risks in the prediction market and Meme ecosystem, where ordinary users are at a long-term disadvantage.</p> ... 2. OpenAI OpenAI's massive funding round is considered a landmark event in the AI ​​era, demonstrating the deep integration of US capital with computing power and cloud vendors. However, the non-cash component of the funding and the power struggles among investors have raised questions. Discussions have also extended to AI bubbles, political stances, ethical narratives, and the long-term impact of AI tools on developers and production methods. 3. Openmind Openmind's ROBO TGE, airdrops, and multiple listings have become the focus of discussion. While facing short-term selling pressure and losses from IPOs, it is considered an important example in the robotics field. Its long-term value is believed to depend on whether it truly establishes a new robotics sector and becomes a leading project. 4. Block's large-scale layoffs are widely interpreted as a signal of the AI ​​efficiency revolution taking hold, with the market responding positively with rising stock prices. Discussions acknowledge AI's efficiency benefits and organizational flattening, while others argue that the layoffs stem more from management issues, with AI merely serving as a justification. 5. AI is generally seen as an irreversible efficiency tool, but its true value lies in business models, execution, and its integration with cryptography, rather than simply narrative. The sample focuses on the profound impact of AI on employment, education, social structure, market making, and the scarcity logic of Bitcoin, and opposes blindly chasing trends. Action Signals<p style=\"text-align: left;\">1. Katana | Binance Wallet Wealth Management: Share 50 Million KAT</p><p style=\"text-align: left;\">2. GRVT | Partners with Aave to Offer Up to 11% Returns</p><p style=\"text-align: left;\">3. BNB Chain | Launches Stablecoin with 0 Gas Transfers</p><p style=\"text-align: left;\">4. OpenMind | ROBO Listed on Binance Alpha and Multiple Exchanges</p><p style=\"text-align: left;\">5. DecibelTrade | Perpetual DEX Mainnet Launch</p><p style=\"text-align: left;\">Source: BlockEcho.one</p><ol class=\"list-paddingleft-2\"></ol><h2 style=\"text-align: left;\">MEME Hot Topics</h2><p style=\"text-align: left;\"><strong>1. WLFI Releases USD1</strong></p><p> The Trump family's crypto project, WLFI, has released a real-time on-chain proof-of-reserve page for USD1. The official statement indicates that Chainlink CRE continuously pulls reserve data from BitGo, verifies it, and then writes it onto the blockchain. The page shows that the current USD1 collateralization ratio is 100%, with a total supply of 4,711,598,238.81 tokens. </p><ol class=\"list-paddingleft-2\"></ol><p style=\"text-align: left;\"><strong>2. Meme Coin Trump Team Transfers 5 Million Trump Tokens to Binance via BitGo, Equivalent to Approximately $17.3 Million</strong></p><p style=\"text-align: left;\">According to OnchainLens monitoring, in the past 9 hours, BitGo wallet, which previously received tokens from the Meme Coin Trump team, transferred 5 million Trump tokens (approximately $17.3 million) to Binance. The team is likely to continue depositing more tokens.</p><p style=\"text-align: left;\"> </p><ol class=\"list-paddingleft-2\"></ol><ol class=\"list-paddingleft-2\"></ol><ol class=\"list-paddingleft-2\"></ol><ol class=\"list-paddingleft-2\"></ol><ol class=\"list-paddingleft-2\"></ol><ol class=\"list-paddingleft-2\"></ol><h2 style=\"text-align: left;\">DeFi Hot Topics</h2><p style=\"text-align: left;\"><strong>1. Whale “0x172” Borrows $7 Million from Aave to Buy Ethereum During Market Downturn</strong></p><p style=\"text-align: left;\">According to market news, a whale with the address “0x172” borrowed $7 million USDC from Aave and purchased 3,753 ETH at a price of $1,865. This whale currently holds 15,964 ETH, worth approximately $29.68 million.</p><p style=\"text-align: left;\"> </p><ol class=\"list-paddingleft-2\"></ol><p style=\"text-align: left;\"><strong>2. Polygon will provide technical support for the Japanese yen stablecoin JPYC</strong></p><p style=\"text-align: left;\">According to The Crypto Times, Polygon will provide technical support for the Japanese yen stablecoin JPYC, which is being used in real-world applications on the Polygon network:\n\n• Merchant payments, wallet services, bank card top-ups\n\n• Lending markets and curator-managed vaults\n\n• JPYC trading volume surpasses the total of all other chains\n\nPolygon enables fast, low-cost local currency settlement.</p><p> </p><p style=\"text-align: left;\"><strong>3. Uniswap Fee Switch to be Expanded to Eight Chains, Burning UNI to Receive Protocol Rewards</strong></p><p style=\"text-align: left;\">Uniswap token holders began voting this Thursday on a major proposal to activate the protocol fee switch on two protocol versions across eight Layer 2 blockchains, including Base, Arbitrum, and OPMainnet. Once activated, at least one-sixth of the fees collected by liquidity providers on the relevant chains will be transferred to token pools for investors who burn an equivalent amount of UNI tokens, expected to more than double existing returns.\n\nThe fee switch has been available on the Ethereum mainnet v2 and some v3 liquidity pools since last December, generating a cumulative $3.3 million in revenue to date. Since 2026, Base has surpassed Ethereum to become Uniswap's largest fee-generating chain, generating $55 million in fees.\n\nBoosted by the proposal news, UNI has risen 9% over the past seven days, outperforming Bitcoin and Ethereum, which have declined during the same period. The final vote will end on March 4th.</p><p style=\"text-align: left;\"><strong>4. Aave Controversy Continues: Labs Concessions Against Mandatory Migration to v3, $42 Million Funding Proposal Leads in Voting</strong></p><p style=\"text-align: left;\">AaveDAO is voting on a major proposal that would allocate up to $42 million to Aave Labs, including $25 million for continued product development and $17.5 million in milestone bonuses. As of Friday evening, the \"support\" vote held a narrow 52% lead, and voting will end on Saturday.\n\nThe controversy centers on Aave Labs' original plan to curtail the development of v3 and force users to migrate to the yet-to-be-released v4 version. This move sparked strong backlash, with prime contractor Bored Ghosts Developing announcing it would not renew its contract and criticizing the proposal as almost absurd. This week, Aave Labs conceded, promising not to force migration, and v3 will continue to operate.\n\n</p> ... Critics Marc Zeller argued that the requested funds were excessive, representing 31% of the DAO's reserves, and demanded that the proposal be split into multiple separate votes. However, AaveLabs insisted on proceeding with the overall vote. Currently, Aavev3 deposits exceed $26.3 billion, accounting for over 97% of the protocol's total deposits. SoFi, the first nationally chartered crypto bank in the US, now supports Solana online deposits. Disclaimer: Jinse Finance, as a blockchain information platform, provides articles for informational purposes only and does not constitute actual investment advice. Please establish correct investment concepts and be sure to enhance your risk awareness.</div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/2fa0ea7ab11443fe7654bd55408d6474.jpg",
            "link": "https://www.coinlive.com/news/golden-web3-0-daily-report-openai-and-the-u-s-department",
            "pub_date": "2026-02-28 21:41:03",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 250674,
            "title": "The History of Crypto Advertising Sponsorship: A Cycle Experiment with Buying Attention and Legitimacy",
            "description": "<div class=\"share___SVvtl\"><div>In February 2026, when Coinbase's ads flashed again on the giant LED screens of the Super Bowl, accompanied by the Backstreet Boys' classic single and the slogan \"Crypto. For everybody,\" the audience was met with a chorus of sighs and more negative than positive comments—a stark contrast to the frenzied night four years earlier, dubbed the \"Crypto Bowl.\" Back then, the FTX logo was still prominently displayed above the Miami Heat's arena, and crypto companies were waving huge checks, attempting to buy decades of mainstream trust in a matter of days. However, the ensuing collapse, lawsuits, and the farce of the arena's renaming turned this \"attention experiment\" into one of the most expensive jokes in sports history. On the surface, it was a branding business, but in reality, it was more like a stress test: when sponsorship embeds financial narratives into the daily lives of fans and spectators, trust is amplified. Essentially, it was a long-term experiment on \"how high-risk financial products can gain attention and legitimacy through highly trusted public institutions.\" Crypto Company Sponsorship: The Start of the \"Big Spending\" Era<p style=\"text-align: left;\">In 2021, with the emergence of a phenomenal bull market, cryptocurrency companies, rapidly accumulating wealth, began to aggressively penetrate the sports and cultural fields. Cryptocurrency exchanges and blockchain projects started directly attaching their brands to the most expensive and conspicuous public attention portals—top leagues, premier stadiums, and global sports broadcasts.</p><p style=\"text-align: left;\">In March of that year, Miami-Dade County and FTX reached a 19-year stadium naming rights agreement, renaming the Miami Heat's home arena the FTX Arena. This deal, which incorporated a crypto company into a city landmark, marked the first large-scale entry of crypto advertising into mainstream urban public space narratives.</p><p style=\"text-align: left;\"> That same summer, Crypto.com signed a fight kit-level partnership with the UFC, reported by CNBC as a 10-year deal worth approximately $175 million. In traditional sports, this level of sponsorship is among the most core commercial assets. Then, in October, Coinbase signed a multi-year official partnership with the NBA/WNBA, with its brand logo prominently displayed on the base of basketball hoops. In November, the news of Staples Center being renamed Crypto.com Arena further reinforced this expansion beyond its core market. This arena is not only the home of the Los Angeles Lakers, a powerhouse team, but also a super landmark for Los Angeles' performance, music, and entertainment industry. This naming rights directly tied crypto brands to the center stage of sports and popular culture. At the same time, European football also began to rapidly integrate, with Binance becoming the main sponsor of Lazio's jerseys and promoting narratives such as fan tokens and interactive benefits, merging exchange sponsorship with Web3 product conversion into a single business chain. Entering 2022, this curve continued to rise, reaching its peak at the global sporting event level. Crypto.com not only became a global partner of the F1 Sprint series but also secured an official sponsorship of the 2022 Qatar World Cup, marking the first time a crypto company officially entered the almost universally accessible media system of the world's largest single sporting event. This massive marketing offensive by the crypto industry quickly reached a turning point at the end of 2022. FTX's collapse quietly turned naming rights into a liability. In January 2023, a bankruptcy judge officially terminated the naming agreement between Miami-Dade County and FTX, and the venue subsequently entered a process of de-FTXization and re-sponsoring. This event became a negative example in the history of sports and cultural sponsorship. After 2023, the industry as a whole entered a period of contraction and reassessment. Many collaborations shifted from venue naming rights and official sponsorship of top-tier events back to more quantifiable ROI forms such as jersey sleeve patches, training kits, digital content rights, and fan interaction activities. Sponsors also placed greater emphasis on compliance and sustainable exposure. In the football field, the OKX-Manchester City partnership is a more controllable version of this: from the official training kit collaboration in 2022 to the subsequent expansion to a higher-level sleeve patch collaboration, its path resembled a gradual upgrade of traditional sponsorship rather than a one-step gamble. From a macro perspective, the main theme of this phase is no longer the ubiquitous crypto advertising, but rather how sports and cultural institutions reprice their new revenue, reputation, and compliance risks. In the past two years, this narrative has undergone a more subtle shift. Crypto sponsorships haven't disappeared, but they tend to repackage their relationship with the mainstream using stablecoins, compliant products, and brand credibility. For example, the 2025 partnership between Aston Martin F1 and Coinbase was described as the first publicly announced case of paying sponsorship fees in full with stablecoins. Coinbase's appearance at the Super Bowl in 2026, with its closing slogan \"Crypto. For everybody,\" demonstrates its attempt to pull cryptocurrency from its early niche audience back into the mainstream narrative of \"universal participation.\" </p><p style=\"text-align: left;\"></p><figure><p style=\"text-align:center\"><img alt=\"\" src=\"https://img.jinse.com.cn/7436523_image3.png\"/></p><figcaption>2025 F1 Teams and Crypto Sponsors (Source: Reddit)</figcaption></figure><p></p><p style=\"text-align: left;\">This year's F1 season will kick off in March. Last year, the cryptocurrency industry spent $174 million on F1 sponsorship projects alone. This year, cryptocurrency sponsorship has reached a new high: 9 out of 11 teams are sponsored by companies.</p><h3 style=\"text-align: left;\">Exposure, Traffic, and Controversy</h3><p style=\"text-align: left;\">Among the various advertisements and sponsorships of crypto companies, the exposure and conversion effects brought by medium- and long-term cooperation are difficult to estimate, but in one-off investments like the Super Bowl, the early results are very significant.</p><p style=\"text-align: left;\"> In 2022, on Super Bowl Day, Coinbase saw a 309% week-over-week increase in installations, followed by a 286% increase the next day; eToro saw a 132% increase on Super Bowl Day and an 82% increase the next day; and FTX saw a 130% increase on Super Bowl Day and an 81% increase the next day. Coinbase's QR code ads even crashed or experienced access issues due to the surge in user scans. This demonstrates the short-term conversion power of Super Bowl ads, at least in terms of downloads and activations, which is sufficient to create a peak. However, this explosive growth does not automatically translate into long-term retention, asset accumulation, and compliant operation capabilities. In the medium to long term, the hidden costs of sponsorship often materialize during periods of tightened regulation and enforcement. Taking the collaboration between Premier League club Arsenal and Socios's fan token as an example, the UK Advertising Standards Authority (ASA) ruled in 2021 on Arsenal's related promotional content, concluding that the advertisements downplayed high-risk decisions in the context of crypto assets and failed to adequately disclose key risk information such as taxation. Ultimately, the ASA ordered the advertisements to be removed from the list of items subject to complaints, and required the club to adjust its page and risk warning presentation. As the world's most popular sport, football has always been a favored traffic source for crypto companies. Compared to crypto giants willing to invest heavily, the companies entering football leagues and clubs are more complex, generating more controversy and negative impacts. In 2024, a book titled *No Questions Asked: How Football Joined the Crypto Con* was published, describing football's embrace of crypto sponsorship as a collective failure driven by greed and wishful thinking, with little due diligence. The result was treating fans as outlets for high-risk, poorly regulated financial products, while clubs, after defaulting, often failed to apologize, explain, or promise to improve. The core of the conflict in sports and the arts lies in the fact that organizations, under financial pressure, introduce high-risk sponsorships, potentially binding their reputation to the credit of their counterparts. Sports sponsorship research categorizes this damage into operational risk and reputational risk: once a sponsor defaults or a major controversy arises, the sponsorship asset transforms from a \"credit enhancement tool\" into a \"liability.\" Expanding to a sociological perspective, the controversy centers on crypto companies leveraging the emotional communities (sports fans, music lovers, movie buffs) within sports and culture to lower the barrier to entry, packaging highly volatile assets as symbols of identity, interest, and trend, thereby amplifying FOMO and herd mentality. The UK Advertising Standards Authority (ASA), in the Floki Inu London Underground advertising case, explicitly stated that it \"exploited the fear of missing out, trivialized investment risks, and was irresponsible towards inexperienced individuals,\" becoming a typical example of regulatory rhetoric. Collaborations with film festivals, art fairs, and awards also serve a similar function, but this \"cultural legitimization\" is not equivalent to financial suitability; it's more like a transformation of symbolic capital: replacing risk interpretation with cultural authority, and product understanding with brand association. Regulation and enforcement are gradually being improved. Faced with the expansion and controversy surrounding crypto sponsorship in sports and culture, regulatory agencies are gradually improving their rules. In the UK, financial regulators announced in 2023 that they would implement stricter requirements for crypto asset marketing to UK consumers from October 8th, including a cooling-off period for first-time investors, enhanced risk warnings, and an explicit ban on inappropriate incentives such as referral rewards. The American Securities and Investments Authority (ASA) has, through a series of rulings, implemented standards such as \"whether risk presentation is adequate,\" \"whether it exploits inexperience,\" and \"whether it encourages debt-based purchases\" down to specific copywriting and advertising scenarios, and in 2026 expanded its review scope to \"whether crypto is packaged as a solution to real-world financial problems.\" In the US, consumer protection agencies updated their \"Disclosure Obligations of Influencers and Advertisers\" guidelines from an advertising and anti-fraud perspective, and released an updated endorsement guideline in 2023 to address platform-based distribution and influencer marketing; they also revealed the high incidence of crypto fraud through data reports, strengthening public education and platform governance pressure. Futures and derivatives regulators continue to publish digital asset risk education materials to prevent the public from being misled into related fraudulent activities. In the EU, the MiCA framework explicitly requires service providers to communicate with potential holders in a fair, clear, and non-misleading manner in its official summary, along with consumer risk warnings and reminders of authorization/regulatory boundaries. EU regulators have also issued risk warnings for consumers. With the rising influence of financial content on social media, EU securities regulators have also released a fact list for \"finfluencers,\" emphasizing the need for significant disclosure of compensation and vested interests, and prohibiting the use of obscure labeling to downplay advertising. This regulatory framework implies that sponsorship will become more like regular marketing in regulated industries in the future. The effectiveness of these measures is reflected in three points: First, the minimum risk disclosure standards for advertising text are being raised, especially in UK rulings; second, the disclosure obligation for celebrity endorsements is shifting from a \"moral expectation\" to an enforceable rule; and third, cross-border platform distribution is being incorporated into the regulatory narrative (even if an advertisement is produced overseas, it may still be regulated if it is targeted at domestic consumers). However, regulatory gaps remain equally clear. The ambiguous legal nature of many tokens or experiential benefits means that regulators can only address superficial issues such as misleading information and disclosure requirements. Sponsorship contracts, on the other hand, are transactions between companies and clubs, with the core meaning determined by the parties in the contract. Regulators typically cannot directly establish uniform risk control standards for such commercial transactions, such as \"naming rights,\" and can only intervene from the perspectives of advertising compliance and consumer protection.</p></div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/d52356bd3dd6ee986e8229d9e0d210d2.jpg",
            "link": "https://www.coinlive.com/news/the-history-of-crypto-advertising-sponsorship-a-cycle-experiment-with",
            "pub_date": "2026-02-28 19:51:14",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 250669,
            "title": "Can Japan unlock $40 trillion in global on-chain arbitrage trading?",
            "description": "<div class=\"share___SVvtl\"><div><p>While the global stablecoin market is dominated by US dollar assets (USDT, USDC), a heavyweight player in the traditional financial world is attempting to reclaim its voice on the blockchain.</p><p style=\"text-align: left;\"></p><section></section><section>Japan, the economy with the world's third-largest foreign exchange reserve currency (the yen), is launching an ambitious blockchain-based movement with its government and financial giants. The core weapon is the yen stablecoin.</section><section></section><section>This is not just about payments; it's a profound game that could reshape global on-chain capital flows: completely replicating the \"yen carry trade,\" which has dominated the traditional foreign exchange market for decades, onto the blockchain.</section><p></p><h2 style=\"text-align: left;\"></h2><h2 style=\"text-align: left;\"> The Sleeping Giant and Its Web3 Ambitions </h2><p style=\"text-align: left;\"></p><section>Japan is the world's fourth largest economy, with the yen accounting for 5.82% of global foreign exchange reserves, making it the third most systemically important currency after the US dollar and the euro. Its long-standing ultra-low interest rates have made the yen one of the most trusted \"financing currencies\" for global investors: investors borrow low-cost yen, exchange it for higher-yield currencies for investment, and profit from the interest rate differential.</section><section></section><section>However, in the blockchain economy, this core position of the yen is almost invisible. This situation began to change rapidly after Sanae Takaichi became Prime Minister in 2025 and explicitly set \"making Japan a Web3 hub\" as a national strategy.<h2> One of the core policies is to promote the institutionalization of cryptocurrencies and prioritize stablecoins and security tokens (RWAs). SBI's \"National Strategy\" is a key executor of this national strategy. Its founder, Yoshitaka Kitao, a legendary figure who co-founded SoftBank's financial business with Masayoshi Son, is transforming SBI into a provider of on-chain financial infrastructure in Japan. SBI's Strium blockchain, developed in collaboration with the Startale Group, targets the institutional market: becoming the settlement layer for tokenized stocks and RWAs. However, a crucial prerequisite for realizing true on-chain stocks (including dividends and voting rights) is a compliant Japanese yen stablecoin for paying on-chain dividends and settlements. This is the strategic significance of the Japanese yen stablecoin. It's not just about fulfilling domestic payments; it's about facilitating a massive global strategy: on-chain yen arbitrage trading. In the traditional world, this process is time-consuming and limited by business hours. On-chain, however, it can theoretically be completed 24/7, almost instantly: investors collateralize assets to borrow yen stablecoins, exchange them for dollar stablecoins, and then invest in DeFi protocols to earn higher returns. This will bring the massive global institutional demand for yen lending into the decentralized finance system. Startale Group has announced the launch of JPYSC, a yen stablecoin specifically designed for this purpose, in the second quarter of 2026. Its founder, Sota Watanabe, revealed that they have contacted several top US financial institutions, which have expressed strong interest in using on-chain yen for arbitrage and swap transactions. </h2></section><p></p><h2 style=\"text-align: left;\"></h2><h2 style=\"text-align: left;\">Triple Challenges: Liquidity, Regulation, and Retail Investors</h2><p style=\"text-align: left;\">Despite the ambitious blueprint, Japan's path to becoming an on-chain financial center still faces three major obstacles:</p><ul class=\"list-paddingleft-2\"><li><p style=\"text-align: left;\">Liquidity Dilemma: The existing market capitalization of yen stablecoins (such as JPYC) is only about $20 million, which is insufficient to support large-scale arbitrage trading. Sufficient liquidity is needed, requiring joint issuance of tokens by the three major banks (Mitsubishi UFJ, Mizuho, ​​etc.) or the entry of giants like SBI.</p></li><li><p style=\"text-align: left;\">Regulatory Clarity: How stablecoins are measured on bank balance sheets and what capital requirements exist are still under development in the regulatory framework in Japan and globally.</p></li><li><p style=\"text-align: left;\">Regulatory Framework Still Under Development: How stablecoins are measured on bank balance sheets and what capital requirements exist are still being refined in Japan and globally.</p></li> The US SEC recently drastically reduced the capital discount rate for broker-dealers holding stablecoins from 100% to 2%, providing an important reference for the industry. Retail investor absence: A cryptocurrency profits tax as high as 55% severely stifles the vitality of Japan's domestic retail market. Although the government plans to reduce the tax rate to 20% and reclassify cryptocurrencies as financial products, progress is slow. Sota Watanabe bluntly stated: \"The Japanese government is acting very slowly… To catch up, implementing tax breaks in 2027 is necessary.\" A race for financial sovereignty and efficiency. Japan's yen stablecoin strategy is essentially a race for financial sovereignty and efficiency. As the US quietly expands its on-chain footprint through dollar-denominated stablecoins, Europe builds a unified market through MiCA, and the UAE creates a \"compliant settlement layer\" centered on Abu Dhabi, Japan must find its place. Its chosen path heavily relies on its traditional financial advantages: leveraging its massive international yen reserves and mature financial institutions, and using RWA and institutional-grade arbitrage trading as entry points, it attempts to rebuild a parallel capital market on-chain with the yen as a key funding currency. The outcome of this race depends not only on the success of technology or a single stablecoin, but also on the speed of regulatory innovation, the determination of traditional giants, and the ability to awaken the \"dormant\" retail sector within the country. If successful, the global $40 trillion credit and arbitrage market will, for the first time, have a powerful non-dollar cornerstone asset on its on-chain version. Japan's Web3 ambitions rest on this small, yen-pegged digital token.</ul></div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/768c5e1a33f799bd1c85f52b8b569981.jpg",
            "link": "https://www.coinlive.com/news/can-japan-unlock-40-trillion-in-global-on-chain-arbitrage-trading",
            "pub_date": "2026-02-28 19:23:58",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        }
    ]
}