{
    "data": [
        {
            "id": 250628,
            "title": "AI Capital Divergence: OpenAI's Ubiquitous Empire vs. Anthropic's Corporate Fortress",
            "description": "<div class=\"share___SVvtl\"><div><p style=\"text-align: left;\">Author: Tz; Source: X, Tz_202</p><p style=\"text-align: justify;\">2</p><p></p><blockquote><p style=\"text-align: left;\">OpenAI's $110 billion funding round has pushed the capital threshold of the AI ​​industry to the level of sovereign infrastructure. Just half a month ago, Anthropic broke its own record with $30 billion. This article dissects the revenue cross-prediction, the computing power war among cloud giants, the attack and defense of coded intelligent agents, the collapse of venture capital rules, and the entry of Middle Eastern sovereign capital behind this duopoly battle, asking a core question: As the AGI race enters the commercial validation phase, which will be the first to pass the ultimate judgment of an IPO: the \"ubiquitous empire\" or the \"enterprise fortress\"?</p><p> </p></blockquote><h2 style=\"text-align: left;\"></h2><h2 style=\"text-align: left;\">Introduction: 2026, the Silicon Valley Melting Pot and the Arrival of the Duopoly Era</h2><p style=\"text-align: left;\">In just a few weeks in February 2026, the global tech world witnessed a capital collision worthy of being recorded in business history. This not only broke venture capital records but also redefined the valuation boundaries of technology companies in the capital market.</p><p style=\"text-align: left;\">On February 27, 2026, OpenAI released its ambitious strategic blueprint, \"Scaling AI for everyone,\" and simultaneously dropped a bombshell announcement that shook Wall Street: an additional $110 billion in funding, pushing its pre-money valuation to $730 billion.</p><h2 style=\"text-align: left;\"> Just two weeks prior, on February 12th, its strongest competitor, Anthropic, announced the completion of a $30 billion Series G funding round, valuing the company at $380 billion post-money. If we juxtapose these two deals, one fact is undeniable: the capital threshold for maintaining cutting-edge AI research has exceeded the limits of traditional venture capital, and its capital intensity is approaching the macro-era of \"national-level sovereign infrastructure construction.\" However, the underlying industrial currents behind these figures are far more noteworthy than the funding amounts themselves. These two almost simultaneous strategic statements mark the end of the Wild West era of generative AI, once defined by rapid trial and error and unstructured experiments. In its place stands a massive duopoly with extremely rigid hierarchies. The focus of competition has long since shifted from the geeky debate of \"whose model has larger parameters\" to a battle over the underlying architecture of digital civilization. Through the capital battles of February, we see a dramatic divergence between two drastically different paradigms of empire building: OpenAI, leveraging its unparalleled user base and aggressive capital leverage, is attempting to build a ubiquitous \"ubiquitous empire\" spanning both hardware and software; while Anthropic, founded by former OpenAI executives, deliberately avoids the noisy consumer market, building a solid \"corporate fortress\" in the deep waters of the business market through stringent security commitments and efficient capital operations. In this ultimate marathon towards Artificial General Intelligence (AGI), the deciding factor is no longer simply the ability to generate intelligence. From the impending collision of revenue growth curves to the computing power dark web laid by cloud giants in the underlying infrastructure; from the complete collapse of the exclusive dogma of Silicon Valley venture capital to Middle Eastern sovereign wealth using AI as a bargaining chip in geopolitical games, the showdown between OpenAI and Anthropic is reshaping the underlying rules of the global technology industry. 1. The Crossroads of Growth: The Ultimate Reversal of Scale and Self-Generating Capacity In business history, few moments have allowed people to intuitively feel the power of compound annual growth rates as much as the AI ​​market in 2026. While OpenAI currently maintains a dominant position in terms of absolute total revenue, the underlying logic of market leadership is undergoing a dramatic paradigm shift. According to quantitative modeling analysis by the authoritative firm Epoch AI, since both companies surpassed the $1 billion annualized revenue (ARR) threshold, Anthropic has maintained a compound annual growth rate (CAGR) of approximately 10x, while OpenAI, as the industry pioneer, has maintained an CAGR of approximately 3.4x. Extending these two drastically different growth curves forward, the predictive model strongly points to a clear and historically significant \"crossroads.\" If the current trend continues, Anthropic's total annualized revenue is highly likely to completely surpass OpenAI around August 2026, with an estimated annualized revenue of approximately $43 billion upon achieving this. Supporting this turnaround prediction is Anthropic's highly focused \"cash-generating machine.\" In its Series G funding announcement in February 2026, Anthropic disclosed that its annualized revenue growth rate had reached $14 billion. The expansion speed is astonishing—just two months prior, this figure was only $9 billion, and three years ago it was zero. This surge is entirely driven by highly sticky enterprise-level demand: in the past year, the number of customers spending over $100,000 annually on the Claude ecosystem has increased sevenfold, with over 500 leading companies exceeding $1 million in annualized spending. More importantly, Anthropic is painting a highly certain path to financial sustainability for Wall Street. The company predicts its cash burn rate will significantly narrow to one-third of revenue (approximately $4.6 billion) in 2026, further decreasing to 9% in 2027, and has set a hard target of achieving full profitability by 2028. To stabilize morale on the eve of a potential IPO, Anthropic even launched an internal secondary market stock sale program worth $5 billion to $6 billion, allowing employees to cash out at a discounted valuation of $350 billion. This restrained and mature financial operation demonstrates a level of financial sophistication disproportionate to its relatively short history. </h2><p style=\"text-align: left;\"><strong>Table 1: Comparison of Core Financial and Capitalization Indicators</strong></p><p style=\"text-align:center\"><img alt=\"dsGX3FXz6Q8NlgoctCsxtRqFeu5J8LMZQT0TSRkQ.jpeg\" src=\"https://img.jinse.com.cn/7436413_watermarknone.png\" title=\"7436413\"/></p><p style=\"text-align: left;\">When we turn our attention to OpenAI, we see a complex picture of scale and losses coexisting.</p><p style=\"text-align: left;\">Undoubtedly, OpenAI possesses the largest user base of this era. As of the end of 2025, its ARR has exceeded $20 billion, ChatGPT has over 900 million weekly active users, and has accumulated over 50 million consumer subscriptions.</p><p style=\"text-align: left;\"> However, converting massive consumer traffic into highly sticky business value has proven to be an expensive battle. OpenAI's current business model still heavily relies on huge infrastructure expenditures. According to internal documents, the enormous computing costs are expected to lead to a structural operating loss of up to $14 billion for OpenAI in 2026. On the road to break-even, OpenAI has set its sights on 2030, a full two years later than Anthropic's timeline. Faced with a massive annual loss of $14 billion and the distant expectation of 2030, OpenAI has had to use a pre-money valuation of $730 billion and a $110 billion funding plan to fund future expansion. Here, the ultimate divide in AI capital is revealed for the first time on financial statements: on one side is OpenAI's \"miracle-making through sheer force\" and intense thirst for capital, leveraging its scale advantage in the C-end market; on the other side is Anthropic's \"efficient compounding\" driven by pure B-end stickiness and its converging profit statements. In the AI ​​capital arena, growth rate is gravity—it determines who has the ability to pull their competitors into their orbit. 2. The Opposition of Business Landscapes: Horizontal Ubiquitous Ecosystem vs. Vertical Enterprise Fortresses Before declaring who the ultimate winner in the enterprise AI market is, we must first understand the true flow of current IT budgets. The current market structure is less a stable state of duopoly and more a period of fluid observation driven by collective customer anxiety. The data reveals a thought-provoking reality: a staggering 79% of companies paying for Anthropic are also paying for OpenAI. This exorbitant \"double-spending\" phenomenon profoundly demonstrates that global CIOs are still strategically hedging in the face of this technological tsunami; no one dares to prematurely stake their company's digital lifeline on a single vendor. When 79% of customers are paying for two companies simultaneously, there are no winners in this market—only two different kinds of irreplaceability. To break this procurement deadlock, OpenAI's solution is \"ubiquitousness.\" As its manifesto, \"Scaling AI for everyone,\" reveals, OpenAI is building a ubiquitous empire that spans the software and physical worlds, attempting to penetrate every pore. On the enterprise side, OpenAI recognizes its weakness in complex system integration, and thus chooses to leverage the power of traditional business centers. In early 2026, OpenAI announced the formation of the \"OpenAI Frontier Alliance,\" deeply partnering with leading consulting giant McKinsey. Its strategic intent is clear: leveraging McKinsey's vast global political and business network to help companies restructure their internal workflows, directly embedding OpenAI's \"digital employees\" deep within the organizational structures of traditional giants. However, OpenAI's ambitions extend far beyond B2B software. At the consumer level, it is undertaking a radical cross-industry offensive—acquiring io Products, founded by former Apple chief designer Jony Ive, for $6.5 billion, and secretly developing native AI-powered smart hardware. Through this device, which may integrate vision and environmental perception capabilities, OpenAI attempts to bypass the gatekeeper monopoly of Apple and Google in mobile operating systems, positioning itself as the \"first entry point\" for next-generation human-computer interaction. Coupled with its aggressive expansion into vertical sectors such as healthcare (acquiring Torch) and finance (integrating LSEG data), OpenAI aims to become the foundational \"water, electricity, and gas\" of the digital age. Faced with the vast ocean of horizontal expansion by OpenAI, Anthropic chose to dig its own well, building a highly secure \"enterprise fortress.\" This company, founded by security fundamentalists, exhibits an almost obsessive business restraint: it not only completely abandoned the bustling consumer hardware market but even spent heavily on advertising during the Super Bowl, simply to pledge to the public that its model would be \"ad-free forever.\" Anthropic firmly anchors its destiny to a pure SaaS and API-based paid model. Anthropic understands that the most lucrative profits in the enterprise market do not lie in generic chatbots but in deeply penetrating complex, high-value cognitive workflows. This strategy has yielded significant returns—its AI-driven coding tool, Claude Code, alone has achieved an annualized revenue run rate (ARR) exceeding $2.5 billion. This tool runs directly within the developer's local integrated development environment (IDE), becoming an indispensable efficiency multiplier for millions of software engineers through highly autonomous background task management. Coupled with dedicated capability packages for compliant industries (such as healthcare and life sciences) and a data residency control principle promising never to use customer-proprietary data to train models, Anthropic precisely targets the vulnerabilities of Chief Information Security Officers (CISOs) in various countries. In the highly compliant and complex waters disturbed by OpenAI's aggressive approach, Anthropic has quietly built a highly sticky moat. </p><p style=\"text-align: left;\"><strong>Table 2: Comparison of Market Entry (GTM) Strategy Dimensions</strong></p><p style=\"text-align:center\"><img alt=\"QTd7r3ITfNhzCAeeNlNerrKVOTXqD6psgcisF9H4.jpeg\" src=\"https://img.jinse.com.cn/7436415_watermarknone.png\" title=\"7436415\"/></p><h2 style=\"text-align: left;\"></h2><h2 style=\"text-align: left;\">3. The Hidden Battle of Technology: From Ultimate Computing Power Tax Collectors to the Orchestration Rights of Intelligent Agents</h2><p style=\"text-align: left;\">If the commercial landscape at the application layer is the visible positional battle, then deep within the cloud infrastructure, beyond the sight of the public, a hidden battle that will determine the flow of AI profits over the next decade has already begun.</p><p style=\"text-align:center\"><img alt=\"3jJGt4OqLwRdrbTEvcwBnxt91ykG3lJEEG8dyDFN.jpeg\" src=\"https://img.jinse.com.cn/7436418_watermarknone.png\" title=\"7436418\"/></p><p style=\"text-align: left;\">However, OpenAI did not sit idly by while Anthropic dominated the coding race. Just before the February funding storm discussed in this article, OpenAI launched GPT-5.3-Codex on February 5th—its most powerful coding agent model to date. Unlike previous versions that focused solely on code generation, GPT-5.3-Codex is designed as a general-purpose agent performing \"full-spectrum computer work\": it not only writes and reviews code but also drives the entire software engineering process, including testing, debugging, and deployment.</p> ... OpenAI claims that GPT-5.3-Codex participated in its development—early versions were used for debugging and production deployment. Coupled with the concurrently released native macOS Codex desktop application, developers can manage AI agents in parallel across multiple project threads, review differences, and transfer them to the editor with a single click, much like managing an engineering team. Even more significant is the GPT-5.3-Codex-Spark variant released a week later (February 12th). This is OpenAI's first model that doesn't rely on NVIDIA GPUs—it features Cerebras' Wafer Scale Engine 3, achieving ultra-low latency output of over 1000 tokens per second, pushing coding interaction towards a near-instantaneous response experience. This move not only directly challenges Anthropic's coding dominance but also suggests that OpenAI is actively developing a heterogeneous computing ecosystem beyond NVIDIA. Currently, the coding agent field presents a clear \"two-horse race.\" Claude Code, with its million-level token context window and deep reasoning capabilities for complex legacy codebases, plays the role of a \"senior architect\"; while GPT-5.3-Codex, known for its speed and automated pipeline, is more like a \"highly productive engineering team.\" In fact, many enterprise engineering teams have begun to deploy both simultaneously—handling routine coding to Codex and leaving complex architectural decisions to Claude Code. This battle in the coding field may be the closest thing to a zero-sum game between OpenAI and Anthropic. When code becomes the most expensive consumer product of AI, coding agents are the money-printing machines of this era. And on the ultimate paradigm of human-computer interaction—\"how to let AI control computers\"—the philosophical differences between the two have reached their peak. OpenAI offers a highly managed \"Operator\" mechanism. This is a browser-based web agent that emphasizes plug-and-play functionality with \"zero technical barriers\" for consumers, but at the cost of an extremely restricted and closed environment, unable to access local files or underlying software. Conversely, Anthropic adheres to a geeky and deep \"Computer Use\" approach. It allows the Claude model to calculate screen coordinates like a human, directly take over the mouse and keyboard, and natively interact with any legacy desktop operating system or local proprietary database. While this approach currently requires a high level of developer configuration, it perfectly aligns with Anthropic's initial intention to design for complex backend enterprise automation. OpenAI aims for one-click cloud-based management, while Anthropic seeks complete control over the underlying infrastructure. This divergence in approaches is drawing a dividing line for the architectural standards of enterprise AI in the next decade. 4. New Rules of Capital: The Failure of Exclusivity in Venture Capital and the Game of Sovereignty In the traditional dogma of Silicon Valley venture capital (VC), there is a sacred and inviolable bottom line: the principle of exclusivity. Top institutions would never simultaneously invest in direct competitors in two different sectors, as this would not only compromise board confidentiality but also be seen as a betrayal of loyalty to the entrepreneur. However, by 2026, facing AGI, possibly the largest “Total Addressable Market (TAM)” in human history, this orthodox concept completely collapsed. A new term was born on Wall Street – the “Mega-round Exception.” When single-round funding soared to tens of billions of dollars and company valuations approached the trillion-dollar mark, moral purity gave way to the fear of survival. It has been revealed that at least twelve prominent venture capital entities, including Founders Fund co-founded by Peter Thiel and the enigmatic ICONIQ, known for managing the wealth of Silicon Valley tech giants' families, are simultaneously providing substantial funding to OpenAI and Anthropic. For these top-tier investors, the risk of missing out on future opportunities due to \"choosing the wrong target\" far outweighs the so-called conflict of interest. However, absorbing such a massive wave of capital inevitably requires companies to compromise on their fundamental core principles. To overcome institutional hurdles in securing $100 billion in funding, OpenAI completed a complex capital restructuring in October 2025. It explicitly spun off its non-profit entity, the OpenAI Foundation (whose equity value was anchored at approximately $130 billion), while completely reshaping its core business engine into the for-profit OpenAI Group PBC (Public Interest Corporation). This move sent the clearest signal to global capital markets: the laboratory once driven by geek idealism has transformed into a commercial machine that can be precisely priced and traded by Wall Street. However, if Silicon Valley VCs merely broke the rules, the strong entry of Middle Eastern sovereign wealth funds fundamentally rewrote the rules of the game. In Anthropic's $30 billion Series G funding round, MGX, a technology investment vehicle backed by the UAE, was prominently listed as a co-lead investor. Meanwhile, MGX is even deeply involved in negotiations for OpenAI's $110 billion funding round, and Saudi sovereign wealth funds like Humain are also making moves everywhere. The massive influx of sovereign capital reveals the fundamental difference between this AI boom and any previous internet bubble: what they want is not simply financial returns (ROI). For Abu Dhabi or Riyadh, hundreds of billions of dollars are merely a stepping stone. They use capital as leverage to exchange for \"technological sovereignty\" in the great power game. These sovereign wealth funds, through massive injections, are forcing Western AI giants to localize the construction of advanced computing infrastructure (such as Saudi Arabia's planned 500-megawatt data center), using this as hard currency to break through geopolitical blockades and obtain import quotas for tens of thousands of top-tier AI chips (such as the 35,000 advanced chips approved for purchase by the UAE). At this point, cutting-edge AI has completely shed its commercial software guise and risen to the level of a strategic asset in the great power game. In this capital network woven by Wall Street hedge funds, Silicon Valley rebels, and Middle Eastern oil tycoons, no one talks about the simplicity of technology anymore; everyone is vying for the highest position in the coming digital new world. 5. The Endgame: Welcoming the 2026-2027 IPO Frenzy With the exponential leap in model capabilities, the ideological and ethical frameworks guiding the deployment of these superintelligent systems are undergoing unprecedented stress tests. OpenAI and Anthropic have shown irreconcilable differences in how to handle relations with state apparatuses, especially military and defense entities. In February 2026, a high-profile political-business conflict will make this difference fully public. At the time, the U.S. Department of Defense (DoD) demanded full, unrestricted access to Anthropic's Claude model and ordered the removal of all safety guardrails to allow the military to use AI in a wide range of unspecified areas—potentially involving large-scale domestic surveillance or lethal autonomous weapons systems. Faced with the Pentagon's ultimatum—that non-compliance would result in the cancellation of a $200 million contract and potential designation as a \"supply chain risk\" entity with significant financial implications—Anthropic CEO Dario Amodei responded strongly. He publicly stated that the company was \"in good conscience\" resolutely refusing to remove the security measures, thus upholding its \"constitutional AI\" principles based on the Universal Declaration of Human Rights. From Wall Street's perspective, this was not merely a declaration of values, but also a shrewd business positioning. While this rejection directly resulted in a short-term loss of $200 million in government revenue, it significantly solidified Anthropic's brand equity among privacy-conscious European companies, heavily regulated financial institutions, and ESG-focused institutional investors. This further deepened Anthropic's moat as a \"highly secure, resilient alternative.\" In contrast, OpenAI has adopted a drastically different public stance in its pursuit of a \"ubiquitous empire.\" To maintain its vast ecosystem, OpenAI has continuously relaxed restrictions on its collaborations with military contractors, deepened its integration with Microsoft, which has a large defense business, and even advanced the development of hardware devices with facial recognition surveillance capabilities. OpenAI prefers a pragmatic philosophy of \"iterative deployment\"—trial and error in real, complex environments, thus tolerating potential dual-use risks. Behind these drastically different ethical principles and business empires lies a shared countdown to the end. The window of opportunity for the private equity market to burn money without restraint is closing irrevocably. Whether it's Anthropic's $380 billion valuation backed by a clear 2028 profit commitment and massive secondary market employee stock option cashing out, or OpenAI's $730 billion pre-money valuation and the subsequent $35 billion investment from Amazon tied to its IPO trigger clause, both are sending the same clear signal: massive amounts of capital are no longer paying for mere laboratory research; they demand a clear exit strategy. The race towards Artificial General Intelligence (AGI) has moved beyond the parameter race stage and fully entered the commercial validation phase. OpenAI's \"ubiquitous empire\"—attempting to encompass everything from underlying cloud computing power to edge smart hardware, feeding an omnipotent super brain with endless traffic—and Anthropic's \"enterprise fortress\"—abandoning all the glitz and glamour of the consumer market, attempting to become the secure foundation of the global digital economy with restrained security commitments and deep, code-level workflows. These two vastly different systems will ultimately converge in the largest wave of tech IPOs in human history between 2026 and 2027. At that time, what will determine who reigns supreme in the digital age will no longer be the benchmark tests self-directed by individual laboratories, but rather the investors who vote with their hard-earned money in the public market.</div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/d6d3089c2d68509cdbc66995d7ec4c8e.jpg",
            "link": "https://www.coinlive.com/news/ai-capital-divergence-openai-s-ubiquitous-empire-vs-anthropic-s-corporate-fortress",
            "pub_date": "2026-02-28 10:11:32",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 250627,
            "title": "What are the benefits of the three tech giants \"transferring\" 110 billion to OpenAI?",
            "description": "<div class=\"share___SVvtl\"><div><p style=\"text-align: left;\">Author: Su Yang</p><p style=\"text-align: left;\">On February 27th, OpenAI announced the completion of a new $110 billion funding round, valuing the company at $730 billion pre-money.</p><p style=\"text-align: left;\">This is OpenAI's second record-breaking fundraising round, following its $41 billion funding round last year, and is the largest private technology company funding round to date.</p><p style=\"text-align: left;\">This round of funding was led by strategic investors, with Amazon investing $50 billion, and SoftBank and Nvidia each investing $30 billion.</p><p style=\"text-align: left;\"> Following this round of financing, OpenAI's cash reserves have increased to approximately $150 billion. OpenAI stated that the funds will primarily be used to expand its computing infrastructure to meet rapidly growing user demand. Amazon to Invest $50 Billion in Phases As the most generous investor in this round of financing, Amazon's committed $50 billion investment will be implemented in two phases: the first phase of $15 billion has been confirmed, and the remaining $35 billion will be available after OpenAI completes its IPO or achieves AGI. Therefore, Altman quickly stated that he is open to going public at the appropriate time. Regarding AGI, according to the previous contract between OpenAI and Microsoft, AGI refers to \"a highly autonomous system capable of surpassing humans in the most economically valuable work.\" OpenAI's charter includes a special clause: once AGI is achieved, Microsoft will lose access to its technology. But Amazon isn't just providing financial support; the two companies have also signed a comprehensive technology cooperation agreement—Amazon will exchange its own chips and cloud services for OpenAI's models and technology. The core clause of this cooperation is the purchase of computing power. OpenAI will pay AWS an additional $100 billion in computing power over the next eight years, on top of its existing $38 billion contract. A significant portion of this $100 billion will be used on Amazon's self-developed Trainium chips. OpenAI has committed to purchasing approximately 2 gigawatts of Trainium computing power, including the upcoming Trainium 3 and the Trainium 4, launching in 2027. Amazon CEO Andy Garcetti specifically mentioned that Trainium chips offer 30% to 40% better performance than comparable GPUs, and \"now both of our leading AI labs are using them.\" Another company is Anthropic, which has recently been embroiled in a dispute with the US government. OpenAI's other collaboration with Amazon is at the product level; the two companies will jointly develop a \"Stateful Runtime Environment\" to run on Amazon Bedrock. This environment allows developers to maintain context, remember previous work, and collaborate across tools when calling OpenAI models. AWS has also secured exclusive third-party distribution rights for OpenAI's enterprise platform, Frontier. There's also a more direct layer of collaboration: Amazon will use OpenAI models to optimize its consumer applications. The two companies will jointly develop custom models for use by Amazon's internal teams, covering product lines from e-commerce to smart hardware. Nvidia's $30 Billion Investment: Shareholder + Supplier The collaboration between Nvidia and OpenAI was once rumored to have fallen through, especially after Jensen Huang's statement that investing $100 billion in OpenAI was never a promise. However, the investment was ultimately finalized, albeit at a significantly lower amount than the rumored $100 billion, with only $30 billion to be paid in three installments. According to the announcement, the two companies finalized a new computing power partnership: Nvidia will provide OpenAI with 3 gigawatts of dedicated inference computing power and 2 gigawatts of training computing power for the Vera Rubin system—on top of the Hopper and Blackwell systems already running on Microsoft, Oracle Cloud, and CoreWeave. If we convert this to computing power, 1GW corresponds to $50 billion. Nvidia's support for OpenAI is worth far more than the rumored $100 billion. From this perspective, Nvidia is not only a shareholder of OpenAI and its largest chip supplier, but it's also using its own money to help OpenAI buy its own chips. Most of the $30 billion in funding will ultimately return to Nvidia in the form of purchasing computing power. In short, it's still the same \"circular financing\" narrative. SoftBank's $30 billion investment: IPO is more important than anything else. Like Nvidia, SoftBank's $30 billion investment commitment will also be disbursed in three installments. Masayoshi Son's thinking is relatively simple: OpenAI is currently the most likely candidate for an IPO in the AI ​​sector, and SoftBank needs an IPO to boost the performance of its Vision Fund. Sources say this round of financing is seen as a crucial step before OpenAI's IPO, which could begin as early as the end of this year. Compared to the other two investors, SoftBank's other role is that of a matchmaker. According to sources, OpenAI is expected to secure approximately $10 billion in primary equity financing, with commitments finalized within the next month. Investors include sovereign wealth funds and investment firms. It is speculated that these investors may have entered through SoftBank. Microsoft: No Funding This Round, But Position Remains Unchanged. In response to Amazon's entry into the market, Microsoft and OpenAI issued a joint statement today, emphasizing that their partnership remains unaffected. The statement says that Microsoft remains the exclusive cloud provider for OpenAI's stateless API for its models. All API calls to OpenAI models that are stateless (without retaining context) are hosted on Azure. This is currently the most common way to call OpenAI models. Meanwhile, OpenAI's own products (including the newly released Frontier) will continue to be hosted on Azure. Frontier is OpenAI's newly launched enterprise platform, enabling enterprises to deploy their own AI agents. The intellectual property licensing and revenue-sharing arrangements between Microsoft and OpenAI remain unchanged. However, OpenAI has the right to purchase computing power from elsewhere, including large-scale infrastructure projects like Stargate. The “Recurring Financing” Narrative: A Copy-Paste Approach Looking at the investments and returns of the aforementioned investors together, as mentioned earlier, it still follows the “recurring financing” narrative: Amazon invested $50 billion in exchange for OpenAI’s model technology licensing and a $100 billion cloud service order. Nvidia invested $30 billion in exchange for OpenAI’s chip procurement commitment. SoftBank invested $30 billion, betting on an IPO exit opportunity. Microsoft didn’t invest in this round, but retained its API exclusivity; Microsoft will receive a share of every API call OpenAI sells in the future. Following this round of financing, OpenAI has an additional $110 billion in its accounts and holds the computing power resources of three tech giants. The **cost** is that it has pre-locked future technology licensing and cloud service procurement to its shareholders. Moreover, Amazon and SoftBank have made an OpenAI IPO a key condition for fulfilling their investment commitments. Now, OpenAI's shareholder list includes Microsoft, Amazon, Nvidia, and SoftBank—four giants with overlapping and conflicting businesses. Balancing the interests of these shareholders will be a major challenge for Sam Altman. ChatGPT has over 900 million weekly active users. Returning to the business level, OpenAI certainly needs this money right now. OpenAI already had approximately $40 billion in cash on hand, and with this round of financing, its available funds have increased to approximately $150 billion. The company expects to achieve positive free cash flow for the first time by 2030. Until then, most of the funds will be invested in data center operations, chip procurement, and cloud service expenditures. Financial data cited by the Financial Times, based on sources familiar with the matter, is telling: Revenue is projected to be approximately $13 billion in 2025, reaching $30 billion this year, with a target of over $60 billion in 2027 and over $280 billion in 2030. The growth curve is steep, but costs are increasing even faster. Regarding user data: According to official data released by OpenAI, ChatGPT currently has over 900 million weekly active users, over 50 million consumer subscribers, and over 9 million paying business users. Codex, a programming tool launched this year, has seen its weekly active users triple since the beginning of the year, reaching 1.6 million. While this data growth is impressive, competitors are not idle. Google's Gemini is making steady progress in the consumer market, while Anthropic has already taken the lead in the enterprise market. OpenAI executives stated that by the end of this year, half of their revenue will come from enterprise customers, up from the current 40%. This means that in the coming quarters, OpenAI must directly compete with Anthropic to achieve a 10% increase. Another detail worth noting is the change in the equity structure. Following this round of financing, the value of the for-profit business shares held by the OpenAI Foundation, a non-profit organization spun off from OpenAI, will rise to over $180 billion by 2025. Sources familiar with the matter say that if investor demand is strong, the foundation may sell up to $10 billion in stock for charitable expenditures and recruitment. In other words, after this round of 110 billion yuan in financing, there may still be another wave of OpenAI stocks available for purchase in the private equity secondary market.</p></div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/f499e2a6330bdf30b08b6e68ab7fdafe.jpg",
            "link": "https://www.coinlive.com/news/what-are-the-benefits-of-the-three-tech-giants-transferring",
            "pub_date": "2026-02-28 09:38:06",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 250626,
            "title": "External factors affecting Bitcoin",
            "description": "<div class=\"share___SVvtl\"><div><p style=\"text-align: left;\">Author: Matt Crosby, Head of Research and Analysis, Bitcoin Magazine Pro; Translated by: Shaw &amp; Jinse Finance</p><p style=\"text-align: left;\">On-chain metrics and technical analysis alone cannot fully understand Bitcoin's price movements. External macroeconomic factors have a significant impact on Bitcoin's cyclical behavior. To understand Bitcoin, these external factors need to be combined with other key indicators to gain a comprehensive market perspective.</p><h2 style=\"text-align: left;\">Monetary Policy</h2><p style=\"text-align: left;\"><strong>Bitcoin and the S&amp;P 500 index exhibit a very strong positive correlation, meaning they typically move in tandem. When the stock market rises, Bitcoin tends to rise as well; when the stock market falls, Bitcoin typically falls as well. This correlation indicates that understanding the factors influencing the stock market is crucial for Bitcoin analysis.</strong> The Federal Reserve's balance sheet provides key information about monetary conditions. During periods of quantitative tightening, balance sheets shrink, and liquidity constraints suppress speculative desires, typically limiting Bitcoin's upside potential. Conversely, during periods of quantitative easing, balance sheets expand rapidly, and ample liquidity encourages risk-taking, which usually aligns with Bitcoin's bullish performance. Figure 1: Relationship between the Federal Reserve's Balance Sheet and Bitcoin Price. Global M2 Money Supply Global broad money supply (M2) represents the total amount of money circulating globally, including cash equivalents and short-term deposits. While many analysts focus on the absolute value of the M2 supply, **examining the year-on-year growth rate of M2 provides a deeper understanding of Bitcoin price dynamics.** Year-on-year growth reflects the acceleration or deceleration of monetary expansion, rather than the absolute value of a natural upward trend over decades. Figure 2: Analyzing global M2 money supply using year-on-year growth rate to illustrate its correlation with BTC. The year-on-year growth rate of global M2 money supply almost perfectly coincides with Bitcoin's expansion and severe bear market periods. This indicator is crucial because Bitcoin is a global asset, not limited to US investors. Global monetary policy, not just the Federal Reserve's policy, is the main driver of Bitcoin's macroeconomic landscape. Institutional Fund Flows The introduction of Bitcoin Exchange-Traded Funds (ETFs) in recent years has fundamentally changed the dynamics of Bitcoin fund flows, making it easy for institutional investors and high-net-worth individuals to accumulate Bitcoin. **ETF cumulative fund flows can reflect institutional holdings in real time.** Large inflows into ETFs typically coincide with periods of rising Bitcoin prices, as institutions invest significant amounts. Conversely, large outflows from ETFs usually occur before or simultaneously with falling Bitcoin prices, as institutions reduce their holdings. Figure 3: Growth of Bitcoin ETFs. The Relative Strength Index (DXY) measures the relative purchasing power of the US dollar against a basket of other fiat currencies. Examining the year-over-year change in DXY provides deeper insights than the absolute value. Bitcoin is negatively correlated with DXY. A weakening DXY year-over-year suggests a favorable trend for Bitcoin. A weaker dollar makes hard assets like Bitcoin more attractive as dollar holders seek to preserve value. However, **when the DXY (US Dollar Index) strengthens year-over-year, it indicates that Bitcoin will face headwinds.** Figure 4: The inverse relationship between the US Dollar Index and Bitcoin prices. <br/></p><h2 style=\"text-align: left;\">Treasury Companies Accumulate</h2><p style=\"text-align: left;\">Digital asset treasury reserves have rapidly incorporated Bitcoin into their corporate strategies, with the top 20 Bitcoin treasury companies currently holding approximately 1 million Bitcoins. More than 100 publicly listed treasury companies globally are actively adding Bitcoin to their balance sheets. This represents a significant reduction in the supply of Bitcoin, as held Bitcoin typically remains illiquid for extended periods rather than being frequently traded.</p> Figure 5: Bitcoin Treasury Tracker shows the BTC accumulation of the top 10 listed treasury companies. From a purely supply and demand economics perspective, these institutions removing 1 million Bitcoins from the liquid supply is equivalent to building structural support. Any asset that can attract hundreds of billions of dollars in inflows represents genuine confidence and optimistic market sentiment. Conclusion A true understanding of Bitcoin requires combining on-chain metrics, technical analysis, and macroeconomic factors. The maturation of Bitcoin necessitates a complex, multi-faceted analysis.</div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/c186258421d0f2fc4c02192155b66285.jpg",
            "link": "https://www.coinlive.com/news/external-factors-affecting-bitcoin",
            "pub_date": "2026-02-28 09:02:45",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 250625,
            "title": "Has the AI ​​unemployment wave begun, with Blockchain laying off nearly 50% of its staff?",
            "description": "<div class=\"share___SVvtl\"><div>On February 26, 2026, Block, Inc. notified its global employees that more than 4,000 employees had been laid off or entered a consultation period, reducing the company's total global workforce from 2025. The number of employees plummeted from 10,205 at the end of the year to less than 6,000, representing a layoff rate of nearly 40% to 50%. This is one of the largest single institutional layoffs in the technology and fintech sector since 2026, and several mainstream media outlets such as Reuters, CNBC, and Bloomberg have called it a landmark event driving layoffs through AI. <h2 style=\"text-align: left;\"><span mpa-font-=\"\"><span leaf=\"\"><span text=\"\">Layoff Decision Amid Strong Financial Report</span></span></span></h2><p style=\"text-align: left;\"><span mpa-font-=\"\"><span lang=\"EN-US\"><span leaf=\"\">Block</span></span><span leaf=\"\">This is not a troubled company.</span></span></p><span leaf=\"\">Block is not a troubled company.</span><span leaf=\"\"> This company, formerly known as Square, was led by Jack Dorsey and its business covered merchant payments, mobile finance, and installment payments, including Cash App and Afterpay. In the fintech sector, it is not on the verge of recession; on the contrary, it has just delivered a solid growth report. In the fourth quarter of 2025, Block's gross profit reached $2.87 billion, a year-on-year increase of 24%. Cash App's gross profit was $1.83 billion, a year-on-year increase of 33%; Square's gross profit was $993 million, a year-on-year increase of 7%. Adjusted operating income was $588 million, with a profit margin of 20% and earnings per share of $0.65. The full-year figures were also impressive. Gross profit totaled $10.36 billion in 2025, representing a 17% year-over-year increase. Guidance for 2026 has been further revised upwards, with gross profit projected at $12.2 billion and adjusted earnings per share increasing by 54%. Looking only at the financial statements, it's hard to imagine this company laying off employees at this time. Layoffs Lead to Stock Price Surge: Why Did the Market Buy It? In the past, layoffs often meant declining demand or operational pressure, but Block's market reaction was completely the opposite. As news of layoffs and financial reports were released simultaneously, the company's stock price surged by over 23% in after-hours trading, reaching a high of nearly $69, increasing its market capitalization by approximately $70 billion to $80 billion in a single day. The following day, in pre-market trading, the increase remained around 20%. The capital market's judgment is quite direct. In the past, the company's growth relied on personnel expansion. Increased revenue was often accompanied by rising costs, resulting in slow profit margin improvements. Now, investors are beginning to believe that a different model is emerging. If 6,000 employees, combined with intelligent systems, can achieve the output of 10,000 or even more people in the past, then business growth will no longer follow the old path of linear increases in labor and costs. </span><p style=\"text-align:center\"><span mpa-font-=\"\"><span leaf=\"\"><img alt=\"NsVohBibBC52aWXfqFwF24Gu3ZaT7m8HK0RyhwTx.jpeg\" src=\"https://img.jinse.com.cn/7436392_image3.png\" title=\"7436392\"/></span></span></p><h2 style=\"text-align: left;\"><span mpa-font-=\"\"><span leaf=\"\"><span text=\"\">Smart tools reshape company operations</span></span></span></h2><p style=\"text-align: left;\"><span mpa-font-=\"\"><span lang=\"EN-US\"><span leaf=\"\">Dorsey</span></span><span a=\"\" about=\"\" accelerated=\"\" accelerating=\"\" accomplish=\"\" according=\"\" actions=\"\" additional=\"\" adjusted=\"\" adjustments=\"\" adjustments.=\"\" admitted=\"\" advice=\"\" affect=\"\" after=\"\" ai=\"\" all-hands=\"\" allowance.=\"\" almost=\"\" along=\"\" also=\"\" amplified=\"\" an=\"\" analysts=\"\" and=\"\" annually=\"\" anonymous=\"\" another=\"\" anxiety.=\"\" app=\"\" approach.=\"\" approximately=\"\" are=\"\" around=\"\" as=\"\" aspires=\"\" at=\"\" atmosphere=\"\" attempted=\"\" attempts=\"\" attract=\"\" automation=\"\" away=\"\" base=\"\" based=\"\" be=\"\" become=\"\" been=\"\" being=\"\" better=\"\" billion=\"\" block=\"\" bluntly=\"\" bluntly:=\"\" brought=\"\" built=\"\" but=\"\" buying=\"\" by=\"\" can=\"\" capabilities=\"\" capabilities:=\"\" capability=\"\" career=\"\" cash=\"\" centralized=\"\" chain=\"\" changes=\"\" chose=\"\" chronic=\"\" clear.=\"\" clearly=\"\" comes=\"\" commands.=\"\" companies=\"\" company=\"\" compared=\"\" compensation=\"\" competitiveness=\"\" complete=\"\" concentration=\"\" confidence=\"\" consistent=\"\" contexts.=\"\" continue=\"\" continues=\"\" continuous=\"\" contraction=\"\" core=\"\" corporate=\"\" cost=\"\" costs=\"\" could=\"\" couldn=\"\" coupled=\"\" create=\"\" creativity=\"\" culture=\"\" current=\"\" customer=\"\" cuts=\"\" cycle.=\"\" daily=\"\" dashboard=\"\" decision-making=\"\" decisions=\"\" deeper=\"\" demonstrate=\"\" density.=\"\" depletion.=\"\" details=\"\" developed=\"\" development=\"\" did=\"\" different=\"\" difficult=\"\" difficulty=\"\" direction=\"\" disrupted.=\"\" do=\"\" dorsey=\"\" downturn=\"\" during=\"\" each=\"\" earnings=\"\" easily=\"\" efficiency=\"\" efficiency-oriented=\"\" elon=\"\" emails=\"\" embedded=\"\" emerge=\"\" emotional=\"\" emphasized=\"\" employee=\"\" employees=\"\" employees.=\"\" end=\"\" engage=\"\" enough=\"\" enterprise.=\"\" equity=\"\" era=\"\" every=\"\" execution=\"\" exists.=\"\" expansion=\"\" expenses.=\"\" experience=\"\" extended=\"\" face=\"\" faster=\"\" fatigue.=\"\" features=\"\" financial=\"\" flatter=\"\" for=\"\" former=\"\" four=\"\" from=\"\" fulfilled=\"\" generative=\"\" generous=\"\" go=\"\" good=\"\" gradual=\"\" gradually=\"\" gross=\"\" growth=\"\" growth-oriented=\"\" guidance=\"\" had=\"\" hand=\"\" handling=\"\" has=\"\" have=\"\" he=\"\" health=\"\" help=\"\" helps=\"\" high-intensity=\"\" higher-value=\"\" historical=\"\" historically=\"\" house=\"\" however=\"\" human=\"\" human-driven=\"\" humane=\"\" if=\"\" impact=\"\" implemented=\"\" in=\"\" incentive=\"\" incentives.=\"\" inclusive=\"\" incorporated=\"\" increased=\"\" increased.=\"\" indicated=\"\" inevitable.=\"\" influence.=\"\" insecurity.=\"\" insights=\"\" instead=\"\" insurance=\"\" intelligence=\"\" intelligent=\"\" intelligent-driven=\"\" interfaces=\"\" internal=\"\" internally=\"\" interviews=\"\" into=\"\" is=\"\" it=\"\" its=\"\" jack=\"\" job=\"\" jobs=\"\" kept=\"\" key=\"\" knowledge=\"\" labor=\"\" laid-off=\"\" large=\"\" large-scale=\"\" latter=\"\" layoffs=\"\" layoffs.=\"\" leaner=\"\" level=\"\" leverage.=\"\" lies=\"\" likely=\"\" live=\"\" logic=\"\" long=\"\" long-term=\"\" longer=\"\" lowest=\"\" loyalty.=\"\" make=\"\" management=\"\" many=\"\" margin=\"\" massive=\"\" math.=\"\" may=\"\" means=\"\" meant=\"\" meanwhile=\"\" media=\"\" meeting=\"\" memo=\"\" met=\"\" methods=\"\" mindset=\"\" model=\"\" models.=\"\" moneybot=\"\" months=\"\" months.=\"\" morale=\"\" more=\"\" multiple=\"\" musk=\"\" narrative=\"\" naturally=\"\" no=\"\" not=\"\" number=\"\" of=\"\" offered=\"\" often=\"\" on=\"\" one=\"\" one-fifth=\"\" one-off=\"\" one.=\"\" operating=\"\" operational=\"\" optimized=\"\" or=\"\" organizational=\"\" other=\"\" outlets=\"\" over=\"\" pace=\"\" packages=\"\" past=\"\" people=\"\" per=\"\" performance.=\"\" period=\"\" placed=\"\" planning=\"\" point=\"\" positions=\"\" possibility=\"\" possible=\"\" prerequisite=\"\" pressure.=\"\" prices=\"\" pride=\"\" privately=\"\" proactive=\"\" product=\"\" production=\"\" profit=\"\" projecting=\"\" promises=\"\" prototypes=\"\" provide=\"\" psychological=\"\" public=\"\" publicly=\"\" pursuing=\"\" quickly=\"\" raised=\"\" rather=\"\" real=\"\" rebound=\"\" received=\"\" recover=\"\" recruitment.=\"\" redefined=\"\" reducing=\"\" reduction=\"\" relationships=\"\" relatively=\"\" relocating=\"\" remained=\"\" repeated=\"\" repeatedly=\"\" replaceable=\"\" replacing=\"\" required=\"\" requirements.=\"\" research=\"\" resources=\"\" responsibilities=\"\" responsibility=\"\" restructured=\"\" restructuring=\"\" resulted=\"\" rising=\"\" risk=\"\" rolling=\"\" roughly=\"\" rounds=\"\" routine=\"\" run.=\"\" salary=\"\" save=\"\" scale=\"\" section=\"\" secure.=\"\" seen=\"\" send=\"\" sense=\"\" service=\"\" service.=\"\" several=\"\" share=\"\" shift=\"\" short-term=\"\" shorter=\"\" significantly=\"\" six=\"\" size=\"\" small=\"\" small-scale=\"\" smaller=\"\" some=\"\" square=\"\" staff=\"\" stated=\"\" stems=\"\" stock=\"\" strategic=\"\" structural=\"\" structure=\"\" structure.=\"\" such=\"\" summarize=\"\" superior=\"\" support=\"\" supported=\"\" sure=\"\" systems=\"\" tacit=\"\" take=\"\" takes=\"\" talent.=\"\" tangible=\"\" tasks.=\"\" team=\"\" teams=\"\" tech=\"\" technological=\"\" tense=\"\" tested=\"\" than=\"\" that=\"\" the=\"\" their=\"\" them.=\"\" then=\"\" they=\"\" this=\"\" through=\"\" time=\"\" time.=\"\" times=\"\" to=\"\" tool=\"\" tools=\"\" top=\"\" top-down=\"\" traditional=\"\" transfer=\"\" transformation.=\"\" transformations.=\"\" transformed=\"\" transitional=\"\" trouble=\"\" truly=\"\" turnover=\"\" twitter.=\"\" ultimately=\"\" unavoidable.=\"\" uncertainty=\"\" unwilling=\"\" update=\"\" us=\"\" use=\"\" value=\"\" variable=\"\" vesting=\"\" was=\"\" way=\"\" week=\"\" week.=\"\" weekly=\"\" weeks=\"\" weight=\"\" were=\"\" when=\"\" whether=\"\" which=\"\" while=\"\" who=\"\" will=\"\" winner=\"\" with=\"\" within=\"\" work=\"\" would=\"\" year=\"\" years.=\"\"></span></span></p><h2 style=\"text-align: left;\"><span mpa-font-=\"\"><strong><span lang=\"EN-US\"><span leaf=\"\"><span text=\"\">AI</span></span></span></strong><strong><span leaf=\"\"><span text=\"\">Driven by AI or a cyclical correction?</span></span></strong></span></h2><p style=\"text-align: left;\"><span mpa-font-=\"\"><span leaf=\"\">The most controversial aspect of this layoff is that the company unusually attributed the decision directly to </span><span lang=\"EN-US\"><span leaf=\"\">AI</span></span><span leaf=\"\">, rather than to the macro environment or cost pressures.</span></span></p><p style=\"text-align: left;\"><span mpa-font-=\"\"><span leaf=\"\">AI</span></span><span leaf=\"\">, rather than to the macro environment or cost pressures.</span></p><p style=\"text-align: left;\"><span mpa-font-=\"\"><span leaf=\"\">.</span></span> Unlike Meta Platforms or Google, which indirectly adjust their workforce size through slowing hiring, natural attrition, or structural optimization, Block opted to cut nearly half of its employees in one go. While similar signals have emerged in the industry—for example, IBM and SAP have publicly mentioned the efficiency restructuring brought about by AI—the magnitude of these developments is far less aggressive than that of Block. It is becoming increasingly clear which jobs are most easily replaced. Routine data analysis, report generation, basic coding, customer service Q&amp;A, and initial risk screening are all efficiently covered by automated models. What remains relatively irreplaceable are high-level strategic judgment, complex negotiations, ethical decision-making, original creativity, and genuine interpersonal leadership skills. Consulting firm McKinsey &amp; Company predicts that by 2030, AI may automate nearly 45% of global work, while Gartner... The author leans more towards the \"enhancement\" theory, believing that AI will reshape jobs rather than simply eliminate them. The author clearly stands on the more radical side. However, dissenting voices also exist. Some analysts point out that this action also carries the characteristics of \"COVID-19 over-hiring adjustments\": the company's headcount surged from 3,900 in 2019 to 12,500 in 2022, with a significant increase in the proportion of international employees, which had previously begun to shrink slightly. Some employees anonymously reported that \"AI is an excuse, and performance pressure has long existed.\" AI as a Core Variable in Organizational Restructuring Technological revolutions have never merely changed tools, but rather the way organizations are organized. The Industrial Revolution eliminated artisans but gave rise to modern manufacturing; the internet diminished traditional media jobs while simultaneously creating the digital economy. Every leap in efficiency is accompanied by structural growing pains. This round of layoffs may signify that AI is beginning to truly enter the core of enterprise organizations, rather than just being a functional upgrade at the product level. The question is no longer whether AI will change the company, but rather the speed at which that change occurs. On February 26, 2026, what the fintech industry saw was not just a company's layoff announcement, but the nascent form of a new company model. According to a Challenger report, over 55,000 layoffs directly related to AI occurred in 2025. This trend accelerated into 2026. The technology industry is bearing the brunt. Highly digitized sectors such as fintech, software, and e-commerce are more likely to be restructured. Laying off ordinary jobs and hiring AI engineers and model training experts has become the new hiring logic. A \"talent war\" for AI is brewing. A deeper impact lies on the demand side. If automation leads to job losses and decreased consumer spending, business growth may conversely be suppressed. Some social media comments have raised this cyclical question: when companies increase profits through AI, but weaken customer revenue streams, how long can this growth be sustained? The tension between efficiency and employment is becoming a new macroeconomic variable. The divergent reactions of the capital market and public sentiment are evident. Investors and analysts are generally positive. Forbes called it a watershed moment in the AI ​​era, while Seeking Alpha argued that the company's aggressive actions would significantly increase operating leverage. Management emphasized that this was positioned for long-term growth. Public discussion, however, was more complex. Some believe that AI can free humans from repetitive labor, allowing them to focus more on creation and judgment; others worry that if automation outpaces re-employment, it could create a cycle of job contraction and declining demand. A relatively neutral viewpoint points out that technology often creates new jobs, but only if society invests in a sufficiently large-scale reskilling training system. Dorsey's assessment is straightforward: most companies will follow suit within a year. He even feels he's moving too slowly. If this assessment holds true, it means the tech industry will shift from a logic of scale expansion to a logic of intelligent leverage. The size of a company is no longer determined by the number of employees, but by the density of intelligent systems. Over the past year, the capabilities of generative AI and automation tools have seen near-exponential growth. Model update frequency has decreased, costs have fallen, and inference capabilities have improved. Tasks that previously required ten people to complete, such as report analysis, marketing material creation, or customer service triage, may now require only one person and one system. Rising stock prices have reinforced this expectation—the market rewards not only cost reductions, but also new production functions. Meanwhile, public sentiment remained somber. Some comments bluntly stated, \"Profitable companies cut 40% of their workforce,\" while others sarcastically remarked, \"The market treats humanity as a liability.\" Some departing employees described the process as \"decent but burdensome,\" noting that while compensation was acknowledged, the reality of unemployment remained severe. Policy discussions are rapidly approaching a practical level. In Europe, the EU's Artificial Intelligence Act (AI Act) came into effect in 2024, covering high-risk employment-related AI systems such as recruitment, performance evaluation, and task assignment. These systems are expected to be fully implemented around 2026. The EU has also passed the Digital Europe Programme and... The InvestAI plan invests hundreds of billions of euros in retraining, skills subsidies, and the development of a lifelong learning system in an attempt to mitigate the impact of AI transformation on the employment structure. In the United States, the job displacement caused by AI has gradually become a public issue. Businesses and policymakers are increasing their investment in retraining, and technology companies are launching AI skills training programs for workers. At the same time, universal basic income (UBI) has re-entered mainstream discussion, with figures such as Elon Musk and Andrew Yang arguing for the need for new social safety net mechanisms to avoid the structural risk that automation could increase efficiency while weakening consumer spending. The layoffs at Block have transcended personnel adjustments within a single company; they are more like a public signal: AI is no longer just an auxiliary tool, but is becoming a core variable determining organizational structure. The way we measure company size is changing—from expanding headcount to increasing intelligence density. This transformation means higher productivity and profit potential, but it inevitably comes with structural growing pains. Transparent communication and relatively generous compensation can buffer the impact, but they cannot mitigate the sharpness of this era's turning point itself. 2026 may be seen as a turning point—when companies begin to systematically rebuild themselves around AI, the labor market must also be restructured in tandem. The question has changed. It's no longer whether AI will change employment, but how human society can find a new balance between growth and stability amidst the leap in efficiency. </p></div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/8669af5093574a9078731ba33a360818.jpg",
            "link": "https://www.coinlive.com/news/has-the-ai-unemployment-wave-begun-with-blockchain-laying-off",
            "pub_date": "2026-02-28 08:33:00",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 250624,
            "title": "OpenAI receives $110 billion in funding; Vitalik outlines Ethereum scaling plans.",
            "description": "<div class=\"share___SVvtl\"><div><h2 style=\"text-align: left;\">Headline</h2><p style=\"text-align: left;\"><strong>▌OpenAI Announces $110 Billion New Investment at a Valuation of $730 Billion</strong></p><p style=\"text-align: left;\">OpenAI announced that it has secured $110 billion in new investment at a valuation of $730 billion. OpenAI's funding includes $30 billion from SoftBank, $30 billion from Nvidia (NVDA.O), and $50 billion from Amazon. OpenAI and Amazon (AMZN.O) will develop custom models. OpenAI will utilize 2 gigawatts of Trainium chip computing power through Amazon Web Services (AWS) infrastructure. SoftBank's cumulative investment in OpenAI is estimated at $64.6 billion, giving it approximately a 13% stake in OpenAI after the transaction.</p> Ethereum co-founder Vitalik Buterin published an article on the X platform outlining Ethereum's scaling plan, covering short-term Gas optimization and long-term phased deployment of ZK-EVM. In the short term, the Glamsterdam upgrade will introduce a block-level access list for parallel verification, ePBS will allow for a larger proportion of time slots to be used for block verification, and Gas repricing will ensure that operational costs are aligned with actual execution time. A multi-dimensional Gas mechanism will be implemented in phases. First, in Glamsterdam, the cost of \"state creation\" will be separated from the cost of \"execution and calldata,\" with state creation Gas not included in the approximately 16 million transaction Gas cap. At the EVM level, a \"reservoir\" dimension mechanism will be introduced, prioritizing the consumption of dedicated dimension Gas by default, and consuming from the reservoir when insufficient. Later, a multi-dimensional pricing mechanism will be implemented, with different dimensions having different floating Gas prices. Long-term scaling includes two parts: ZK-EVM and blob. Regarding blob, the plan is to continuously iterate PeerDAS, aiming to achieve a data processing capacity of approximately 8MB per second. In the future, Ethereum block data will directly enter the blob. ZK-EVM will be implemented in phases: in 2026, validator clients supporting ZK-EVM will be available, allowing approximately 5% of the network to rely on it; in 2027, this will expand to a larger proportion of a minority of nodes, while simultaneously advancing formal verification; once conditions are ripe, it will transition to a three-out-of-five mandatory proof mechanism, ultimately continuously improving the security and formal verification level of ZK-EVM, and involving VM changes such as RISC-V. As of press time, according to CoinGecko data: BTC price is $65,865.85, a 24-hour change of -2.5%; ETH price is $1,930.04, a 24-hour change of -5.0%; BNB price is $614.11, a 24-hour change of -2.0%. The price of SOL is $81.71, a 24-hour change of -5.0%; the price of DOGE is $0.09324, a 24-hour change of -3.9%; the price of XRP is $1.36, a 24-hour change of -3.4%; and the price of TRX is $0.2829, a 24-hour change of -0.9%. WLFI price is $0.1105, a 24-hour change of -4.4%; HYPE price is $27.28, a 24-hour change of -3.8%. Policy: ▌SEC Chairman Paul Atkins: Missed Crypto Opportunities During Gensler's Tenure, Accelerating the Reshaping of the Regulatory Framework. U.S. Securities and Exchange Commission (SEC) Chairman Paul Atkins stated that the SEC is attempting to regain momentum in crypto regulation and make up for previous \"significant misses.\" At a University of Texas event, he criticized the SEC for failing to adapt to innovation during Gary Gensler's tenure. Atkins pointed out that since the Donald Trump administration took office, the SEC's stance has become more industry-friendly, establishing a crypto task force, dropping several enforcement cases, and launching \"Project Crypto\" to modernize regulatory rules. He emphasized that while the price of individual cryptocurrencies may fluctuate, he is more optimistic about the potential of distributed ledger technology in payment clearing and settlement systems. This week, the SEC approved WisdomTree's digital currency market fund to enable 24/7 trading and instant settlement. Atkins also stated that tokenized bank deposit products will be launched in the future. <p style=\"text-align: left;\"><strong>▌Coinbase Litigation Head: Some US States \"Mislead\" the Public on Prediction Markets</strong></p><p style=\"text-align: left;\">Coinbase's Vice President of Legal Affairs and Head of Global Litigation, Ryan VanGrack, stated that some US state governments have \"misled\" the public on prediction markets, attempting to rewrite the scope of Congress's authorization for derivatives regulation.</p> Previously, after launching a prediction market in partnership with Kalshi, Coinbase had filed lawsuits in Connecticut, Illinois, Michigan, and Nevada. Some state regulators issued stop-loss orders or public warnings, stating that sports event contracts constitute illegal gambling. VanGrack stated that these actions pose a \"real and imminent\" risk to customers, forcing the company to seek clarification on regulatory jurisdiction in federal court. Senator Warren and OCC Chief Discuss WLFI-Related Crypto Bank Application Senator Warren called the application \"the most despicable\" presidential corruption scandal, pointing to investment institutions related to UAE National Security Advisor Sheikh Tahnoonbin Zayed Al Nahyan investing $500 million in WLFI four days before Trump's inauguration, acquiring a 49% stake, of which approximately $187 million went to Trump family entities. Warren urged Gould to reject or suspend the review of the application, stating that approval would make it \"an accomplice to corruption.\" Gould refused to intervene, stating that he would process the application according to standard procedures, and countered that the only political pressure he felt came from Warren. Forty-one House Democrats had previously written to the Treasury Secretary, warning that approving the license could threaten \"the legitimacy of the U.S. banking system and its independence from foreign actors.\" <hr/><h2 style=\"text-align: left;\">Blockchain Applications</h2><p style=\"text-align: left;\"><strong>▌Barclays is evaluating the construction of a blockchain platform to process payments and deposits</strong></p><p style=\"text-align: left;\">Barclays has sent requests for information to some potential technology vendors to evaluate how to build a blockchain platform to process banking services such as payments. Its applications may include stablecoins and tokenized deposits, with the goal of finalizing vendor selection as early as April. The application of stablecoins in the payment field is expanding; Bloomberg Intelligence estimates that annual stablecoin payment transaction volume could exceed $50 trillion by 2030. Meta has also previously tested integrating stablecoin payments into its applications.</p> Several banks have already begun deploying blockchain systems. JPMorgan previously launched JPM Coin, a deposit token for institutional clients, for payments. HSBC plans to expand its tokenized deposit service to corporate clients in the US and UAE in the first half of this year. OpenAI Executive: ChatGPT Daily Active Users Exceed 900 Million, Paid Subscribers Reach 50 Million. OpenAI executive Nick Turley stated that ChatGPT's daily active users have exceeded 900 million, and paid subscribers have reached 50 million. Cryptocurrency ▌JPMorgan Chase: Market to Boost if Crypto Market Structure Bill Passes JPMorgan Chase states that even with current market sentiment remaining weak, the crypto market could see a significant boost in the second half of the year if the US legislature passes a comprehensive crypto market structure bill before mid-year. In a research report, the bank noted, \"If the bill passes, it will reshape the market structure by clarifying regulatory rules, ending 'enforcement instead of regulation,' promoting asset tokenization, and encouraging greater institutional participation.\" ▌Tether's Secondary Market Valuation Could Reach $375 Billion, Largest Shareholder's Wealth Could Surpass Buffett According to Forbes, stablecoin issuer Tether's valuation could reach $375 billion, placing its owners among the world's richest people. Industry sources say Tether's trading price on the secondary market ranges from $350 billion to $375 billion. Based on conversations with cryptocurrency investors and executives, Forbes currently values ​​Tether at approximately $200 billion, still significantly higher than the $50 billion valuation a year ago. At a $200 billion valuation, CFO Giancarlo Devasini, holding approximately 44-45% of the shares, would have a net worth of approximately $89 billion; CEO Paolo Ardoino and former CEO Jean-Louis van der Velde, each holding approximately 19%, would have a combined net worth of approximately $38 billion; and General Counsel Stuart Hoegner, holding approximately 12%, would have a net worth of nearly $25 billion. If we use the lower end of the secondary market valuation of $350 billion, Devasini's stake would be worth over $156 billion, enough to place him among the world's top ten richest people, surpassing Warren Buffett's current net worth of $147.8 billion. Former Mt. Gox CEO Proposes Bitcoin Hard Fork to Recover $5.2 Billion in Stolen Assets Mark Karpelès, former CEO of the defunct exchange Mt. Gox, recently proposed a Bitcoin hard fork to recover approximately 79,956 BTC stolen in the 2011 hack, worth about $5.2 billion at current prices. The proposal targets a wallet address associated with the 2011 Mt. Gox system breach, which received nearly 80,000 Bitcoins after the attack and has remained untouched for over 15 years. Under current Bitcoin rules, these funds can only be transferred if the corresponding private key is held. According to the proposal, the new rules would allow the unspent outputs in an Mt. Gox recovery address to be controlled via signatures, thereby bringing the funds into the existing judicial oversight and compensation process to repay Mt. Gox creditors. Karpelès stated that this proposal is only a starting point for discussion, intending to limit the rule change to a single address and activate it at a specific block height in the future. However, the proposal also acknowledges that this plan requires a coordinated upgrade across the entire network, and if some community members refuse to support it, it could lead to a blockchain split risk. It should be noted that these approximately 80,000 BTC are not currently part of the assets allocated to Mt. Gox creditors, nor are they controlled by the bankruptcy trustee. According to market news, Block, Inc., the payment company owned by Jack Dorsey, just disclosed that it added 340 BTC to its holdings in the fourth quarter of 2025, worth $22 million. Liquid Capital (formerly LD Capital) founder Yi Lihua responded to rumors of a \"Jane Street sell-off\" on social media, stating that he is currently waiting for confirmation of the bottom before buying. He clarified that he is not engaging in conspiracy theories; the trend is downward, and he is currently waiting for confirmation of the bottom before buying. Amundi purchased 3.77 million shares of MSTR, bringing its total holdings to $641 million. According to market news, Amundi, a French asset management company with $2.8 trillion in assets under management, disclosed that it purchased 3.77 million shares of MSTR, bringing its total holdings to 4.79 million shares, worth $641 million. This represents a 373% increase in its MSTR holdings. **▌Bitcoin Mining Company Mara Holdings Increases Holdings by 572 Bitcoins** According to market news, publicly traded Bitcoin mining company Mara Holdings (stock code $MARA) has increased its holdings by 572 Bitcoins, bringing its total holdings to 53,822. **▌US 2-Year Treasury Yield Falls to Lowest Level Since 2022** The yield on the US 2-year Treasury note has fallen to its lowest level since 2022. **▌Trump: Fed Chair Powell Will Soon Leave the Fed** US President Trump stated that Federal Reserve Chair Powell will soon leave the Federal Reserve. <hr/><h2 style=\"text-align: left;\">Golden Encyclopedia</h2><p style=\"text-align: left;\"><strong>▌What is the value of BTC?</strong></p><p style=\"text-align: left;\">BTC is often compared to \"digital gold,\" but its core value is actually the \"promise of immutable scarcity.\" First, BTC has monetary properties, but it is not a currency because it lacks a stable unit of account. It is a pure \"monetary property,\" that is, a consensus game among humans regarding \"what can serve as a store of value.\" Gold also has this core value, but gold's scarcity depends on the physical constraints of geology, while BTC's scarcity depends on mathematics and game theory—it's a scarcity at the information level.</p><p style=\"text-align: left;\">But what makes BTC truly unique is not the coin itself, nor the \"digital gold\" narrative, but rather that blockchain is the first permissionless, unclosable value settlement layer in human history. This is a completely new category of infrastructure. No sovereign entity can unilaterally prevent the final settlement of a BTC transaction.</p><p style=\"text-align: left;\"> This attribute may be underestimated in peacetime, but it will be repriced during periods of geopolitical conflict and escalating capital controls. BTC is a systemic hedge. It doesn't hedge against inflation, nor does it hedge against the US dollar. It hedges against the structural degradation of institutional trust. In other words, BTC's value is not endogenous, but reflexive: the more people believe it has value, the more valuable it becomes, and vice versa. Therefore, BTC is the financialized expression of humanity's distrust of its own institutional capabilities. Its ceiling depends on the depth and breadth of this distrust, and its floor depends on the existence of a superior alternative.</p></div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/d2eac10a3e4efa4bd668e02a58473f99.jpg",
            "link": "https://www.coinlive.com/news/openai-receives-110-billion-in-funding-vitalik-outlines-ethereum-scaling",
            "pub_date": "2026-02-28 07:45:36",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 250560,
            "title": "The stablecoin war has begun, but why is Ethereum actually benefiting?",
            "description": "<div class=\"share___SVvtl\"><div><p style=\"text-align: left;\">Author: Blue Fox Notes</p><p style=\"text-align: left;\">Some people have asked whether Ethereum would collapse if stablecoin issuers like Circle (USDC) and Tether (USDT) built public chains. I wasn't planning on answering this question. However, several friends have privately messaged me asking about it, so I'll briefly discuss it.</p><p style=\"text-align: left;\">The conclusion is that Ethereum will not collapse. Overall, it will benefit.</p><p style=\"text-align: left;\">In the future stablecoin battle, the most important thing is the front-end distribution channels: Meta, MrBeast (Tom Lee's Bitmine has invested $200 million), Robinhood, Aave, Polymarket, Lighter, Uniswap, exchanges, wallets… Stablecoin issuers are not the strongest in the entire chain, and their L public chains do not naturally possess network effects.</p> ... Major players like Meta won't just support Circle's chain, but will support multiple chains; channels like MrBeast, which are expected to be deeply integrated with the Ethereum ecosystem, will prioritize supporting Ethereum; Robinhood is also building its L2 network (Ethereum ecosystem) on Arbitrum, and may become an independent L2 in the future; Polymarket also plans to build an Ethereum L2... The source of network effects lies where users are reached. As long as Ethereum L1/L2 fees are low enough and speeds are fast enough (at the same level), its security and decentralization advantages are unique. Currently, Ethereum L1 is moving towards 10,000 tps, and L2 is moving towards over one million tps, so fees and speed will not be an issue in the future. Issuers building their own chains will not lead to a large-scale migration of traffic; on the contrary, they may eventually gradually become Ethereum L2. Arc, developed by Circle, is an L1 chain that supports USDC as its native gas fee, provides sub-second settlement, and offers institutional-grade privacy/compliance. It is expected to launch later this year. Even so, USDC is still issued on multiple chains, including Ethereum and Solana, with the Ethereum ecosystem still holding the majority share. How it will develop after launch remains uncertain. Tether's USDT also operates on multiple chains. Each stablecoin issuer builds its own L1 chain, creating competitive pressure and making it difficult to run on each other's chains. The Ethereum ecosystem, being inclusive, will remain the most important chain supporting different stablecoins. Multi-chain issuance of stablecoins is common, meaning that even with Arc's launch, it will only supplement existing systems, not replace them. It will have its own institutional trading scenarios, but its ultimate market share will not entirely depend on the stablecoin issuer, but rather on the stablecoin's distribution channels and high-frequency application scenarios. For distribution channels, cost, speed, and security are all important, and Ethereum currently offers the best balance among these three. Distribution channels cannot and will not ignore Ethereum. Currently, Ethereum dominates the stablecoin market share, and its share continues to grow. The total stablecoin market capitalization in February 2026 is estimated at $3100-$3200 (DefiLlama/TRM Labs data), of which: • Ethereum: 52-60% (~$1530-$1650), with a 40% growth in 2025 (from $115B to $153B). It has the largest share, handling more than half of stablecoin activity. • Tron: 25-30% (~$830-$840), dominated by USDT, but growth is slowing (fees have risen to $0.50 per transaction). • Solana: 4.5% (~130), USDC accounts for 77%, benefiting from low fees ($0.01 USD/transaction).\n• Others: BNB Chain grows by 133% (2025), but its share is small; L2 such as Arbitrum/Base accounts for ~100%, totaling over 70% of the Ethereum ecosystem (L1+L2).\n• In addition, by currency, USDT ~1840 (59%), USDC ~750 (24%). USDC is growing rapidly (+6.39% in February 2026), but most of it is on Ethereum. In terms of transaction volume, stablecoin transfers exceeded $10.5T in January 2026 (a record high). Ethereum handled the majority of institutional/DeFi traffic (projected to exceed ~40T for the whole year), far surpassing PayPal (20T) and approaching Visa (15T). These are all due to network effects. Do you think users will naturally migrate simply because a stablecoin chain has emerged? Ethereum still boasts the largest developer ecosystem, the most thriving DeFi ecosystem, and stable operation without downtime. Would institutions really place their trading scenarios on potentially unreliable centralized L1 chains? Ethereum's competitor has always been itself, not any other chain. As long as its fees/speed are no less than any other L1 chain, its security and decentralization advantages will be unparalleled. The future of Ethereum, besides stablecoins, includes asset tokenization, DeFi, and the AI ​​agent economy—all major trends. The L1 chains built by stablecoin issuers are not enough to kill Ethereum. By the way, what's the status of Tether's support for the Plasma chain?</div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/e5590942e1a02823c826fdf8297ec927.jpg",
            "link": "https://www.coinlive.com/news/the-stablecoin-war-has-begun-but-why-is-ethereum-actually",
            "pub_date": "2026-02-27 21:47:27",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 250559,
            "title": "Golden Web3.0 Daily Report | Vitalik Buterin Announces Ethereum's Quantum-Resistant Roadmap",
            "description": "<div class=\"share___SVvtl\"><div><h2 style=\"text-align: left;\"><strong>DeFi Data</strong></h2><p style=\"text-align: left;\"><strong>1. Total Market Cap of DeFi Tokens: $49.393 Billion</strong></p><p style=\"text-align:center\"><strong><img alt=\"HFpjsrMWTlxcW1tJYROp5Hyft1DcPDW58cRCFoxj.png\" src=\"https://img.jinse.com.cn/7436329_watermarknone.png\" title=\"7436329\"/></strong></p><p style=\"text-align:center\"><img ...=\"\" alt=\"wOrMEvGQe0raPHwtxbNeAEiJIfmMJYRmeQEA9mkF.png\" src=\"https://img.jinse.com.cn/7436330_watermarknone.png\" title=\"7436330\"/></p><p style=\"text-align: center;\">DeFi Total Market Cap Data Source: coingecko</p><p style=\"text-align: left;\"><strong>2. Trading volume of decentralized exchanges in the past 24 hours: $46.56</strong></p><p style=\"text-align:center\"><strong><img alt=\"7YSA5rxMNUlQXiDxBWLRQgi7IFf4913vy6kg2sfE.png\" src=\"https://img.jinse.com.cn/7436332_watermarknone.png\" title=\"7436332\"/></strong></p><p style=\"text-align:center\"><strong><img alt=\"zGaUzbZykIphDqB5mwiWvr2f5RdsTfaQ7qMD4c0z.png\" src=\"https://img.jinse.com.cn/7436331_watermarknone.png\" title=\"7436331\"/></strong></p><p style=\"text-align: center;\">Trading volume of decentralized exchanges in the past 24 hours. Data source: coingecko</p><p style=\"text-align: left;\"><strong>3. Assets locked in DeFi: $957.4 billion</strong><strong>$100 million</strong></p><p style=\"text-align:center\"><img alt=\"ZaBJYCtHrBUphXtun5BWhCGsiwGxgn9odzf1glA8.png\" src=\"https://img.jinse.com.cn/7436333_watermarknone.png\" title=\"7436333\"/></p><p style=\"text-align:center\"><img and=\"\" assets=\"\" by=\"\" defi=\"\" defillama=\"\" locked=\"\" projects=\"\" source:=\"\" style=\"text-align: center;\" top=\"\" total=\"\" value=\"\"/>Top 10 DeFi Projects by Locked Assets and Total Value Locked (Data Source: defillama)</p><h2 style=\"text-align: left;\"><strong>NFT Data</strong></h2><p style=\"text-align: left;\"><strong>1. Total Market Cap of NFTs: $7.476 Billion</strong></p><p style=\"text-align:center\"><strong><img src=\"https://img.jinse.com.cn/7436335_watermarknone.png\" title=\"7436335\"/></strong></p> alt=\"aawwUpLj9JW5SR7Z9yDKxFOHshQZ76KnMKnQ3CGP.png\"&gt;<p style=\"text-align:center\"><strong><img alt=\"KXhILvy7YNcszjxFEmlshUqU2um11AWLyMGKg6IZ.png\" src=\"https://img.jinse.com.cn/7436336_watermarknone.png\" title=\"7436336\"/></strong></p><p style=\"text-align: center;\">NFT Total Market Capitalization, Top Ten Projects by Market Capitalization Data Source: Coinmarketcap</p><p style=\"text-align: left;\"><strong>2.24-hour NFT transaction volume: $1.337 billion</strong><strong>USD</strong></p><p style=\"text-align:center\"><strong><img ...9=\"\" a=\"\" about=\"\" abuse=\"\" accompanied=\"\" account=\"\" accused=\"\" action=\"\" address=\"\" ai=\"\" allocation.=\"\" also=\"\" amount=\"\" an=\"\" and=\"\" announces=\"\" anxiety=\"\" are=\"\" argue=\"\" as=\"\" asset=\"\" asymmetry=\"\" at=\"\" attributing=\"\" axiom=\"\" bear=\"\" been=\"\" being=\"\" bitcoin=\"\" bls=\"\" brought=\"\" but=\"\" buterin=\"\" by=\"\" capabilities=\"\" capital=\"\" centralized=\"\" chasing=\"\" circle=\"\" compared=\"\" computing.=\"\" consensus=\"\" control=\"\" cooling=\"\" costs=\"\" crisis=\"\" currently=\"\" data.=\"\" decline=\"\" defi=\"\" deletion=\"\" depending=\"\" deposit=\"\" derivatives=\"\" digital=\"\" direct=\"\" disadvantage=\"\" discussions=\"\" driven=\"\" due=\"\" early=\"\" ecosystem=\"\" efficiency=\"\" eip-8141.=\"\" emotional=\"\" empirical=\"\" employee=\"\" enhancing=\"\" enter=\"\" established=\"\" ethereum=\"\" event=\"\" evidence=\"\" exacerbated=\"\" exceeded=\"\" exists=\"\" expansion=\"\" expectations=\"\" failures=\"\" financial=\"\" focus=\"\" focusing=\"\" for=\"\" forefront=\"\" foundation=\"\" future=\"\" game.=\"\" games.=\"\" gradually=\"\" growing=\"\" had=\"\" hand=\"\" has=\"\" hash-based=\"\" have=\"\" heavy=\"\" her=\"\" high=\"\" highlighted.=\"\" however=\"\" improvements=\"\" in=\"\" increasingly=\"\" individuals=\"\" information=\"\" infrastructure=\"\" insider=\"\" internal=\"\" into=\"\" invitation=\"\" involving=\"\" is=\"\" its=\"\" itself=\"\" jane=\"\" lacks=\"\" large=\"\" largely=\"\" lawsuit=\"\" learn=\"\" level=\"\" lever=\"\" long-term=\"\" manipulation=\"\" market=\"\" market.=\"\" markets=\"\" meanwhile=\"\" mechanisms.=\"\" missing=\"\" more=\"\" narrative.=\"\" nfts=\"\" of=\"\" on=\"\" on-chain=\"\" one=\"\" opportunity=\"\" ordinary=\"\" other=\"\" out=\"\" outburst=\"\" participants=\"\" payment=\"\" polymarkets=\"\" post-quantum=\"\" potential=\"\" power=\"\" prediction=\"\" previously=\"\" price=\"\" prices=\"\" profitability=\"\" propaganda.=\"\" proposed=\"\" public=\"\" putting=\"\" q4=\"\" quantitative=\"\" quantum=\"\" quantum-resistant=\"\" questioned=\"\" rather=\"\" recent=\"\" reducing=\"\" reinforcing=\"\" related=\"\" relations=\"\" reliance=\"\" repeatedly=\"\" report=\"\" research=\"\" revelations=\"\" risk=\"\" risks=\"\" roadmap=\"\" scheme=\"\" settlement=\"\" she=\"\" shifting=\"\" short-term=\"\" signals=\"\" signature=\"\" signatures.=\"\" significant=\"\" simply=\"\" some=\"\" source=\"\" speculation=\"\" stages=\"\" still=\"\" stock=\"\" street=\"\" structural=\"\" success=\"\" suggests=\"\" suppressed=\"\" surrounding=\"\" susceptibility=\"\" suspicion.=\"\" switching=\"\" systematically=\"\" team.=\"\" technical=\"\" terra=\"\" than=\"\" that=\"\" the=\"\" their=\"\" through=\"\" timing=\"\" to=\"\" tools=\"\" towards=\"\" trading=\"\" transform=\"\" triggering=\"\" trust.=\"\" twitter=\"\" usdc=\"\" used=\"\" uses=\"\" validator=\"\" verification=\"\" vitalik=\"\" volatility=\"\" was=\"\" wealth=\"\" where=\"\" whether=\"\" widely=\"\" window=\"\" with=\"\" zachxbt=\"\"/><p style=\"text-align: left;\">1. Huma Finance | Q3 Airdrop Open</p><p style=\"text-align: left;\">2. Bithumb | Listing Ethergas and Airdropping</p><p style=\"text-align: left;\">3. idOS | Token Public Sale CCA Auction Opens</p><p style=\"text-align: left;\">4. GRVT | Mobile App Launched with Aave Integration</p><p style=\"text-align: left;\">5. Abstract Chain | Continuous Voting to Unlock XP</p><p style=\"text-align: left;\">Source: BlockEcho.one</p><ol class=\"list-paddingleft-2\"></ol><h2 style=\"text-align: left;\">MEME Hot Topics</h2><p a=\"\" according=\"\" acquiring=\"\" actors.=\"\" advisor=\"\" al=\"\" an=\"\" and=\"\" application=\"\" approval=\"\" approving=\"\" approximately=\"\" associated=\"\" banking=\"\" before=\"\" came=\"\" corruption=\"\" corruption.=\"\" could=\"\" countered=\"\" days=\"\" democrats=\"\" despicable=\"\" entities.=\"\" family=\"\" felt=\"\" foreign=\"\" forty-one=\"\" four=\"\" from=\"\" gould=\"\" had=\"\" he=\"\" house=\"\" in=\"\" inauguration=\"\" independence=\"\" institutions=\"\" intervene=\"\" invested=\"\" investment=\"\" it=\"\" its=\"\" legitimacy=\"\" license=\"\" make=\"\" million=\"\" most=\"\" nahyan=\"\" national=\"\" of=\"\" only=\"\" or=\"\" out=\"\" pointing=\"\" political=\"\" presidential=\"\" pressure=\"\" previously=\"\" procedures=\"\" process=\"\" refused=\"\" reject=\"\" review=\"\" saying=\"\" scandal=\"\" secretary=\"\" security=\"\" sheikh=\"\" stake=\"\" standard=\"\" stating=\"\" style=\"text-align: Senator Warren and OCC Chief Dispute Over WLFI's Crypto Bank Application Senator Warren called the application the \" suspend=\"\" system=\"\" tahnoonbin=\"\" that=\"\" the=\"\" threaten=\"\" to=\"\" treasury=\"\" trump=\"\" u.s.=\"\" uae=\"\" urged=\"\" warning=\"\" warren=\"\" warren.=\"\" went=\"\" which=\"\" with=\"\" wlfi=\"\" would=\"\" written=\"\" zayed=\"\"></p><p style=\"text-align: left;\"><strong>2. The Meme coin Trump team transferred 5 million Trump tokens (approximately $17.3 million) to Binance via BitGo.</strong></p><p style=\"text-align: left;\">According to OnchainLens monitoring, in the past 9 hours, BitGo wallet, which had previously received tokens from the Meme coin Trump team, transferred 5 million Trump tokens (approximately $17.3 million) to Binance. The team is likely to continue depositing more tokens.</p> ... </strong></p><ol class=\"list-paddingleft-2\"></ol><ol class=\"list-paddingleft-2\"></ol><ol class=\"list-paddingleft-2\"></ol><ol class=\"list-paddingleft-2\"></ol><ol class=\"list-paddingleft-2\"></ol><ol class=\"list-paddingleft-2\"></ol><h2 style=\"text-align: left;\">DeFi Hot Topics</h2><p style=\"text-align: left;\"><strong>1. ZKsync to Shut Down ZKsync Lite on May 4, 2026</strong></p><p style=\"text-align: left;\">According to The Block, ZKsync officially announced that it will officially stop block production of ZKsync Lite on May 4, 2026, permanently freezing the final state of the network. As Ethereum's first zero-knowledge rollup, ZKsync Lite has primarily supported token transfers, atomic swaps, and NFT minting since its launch in June 2020, but does not include smart contract functionality.\n\n\n</p> The official statement indicates that this shutdown will not affect other ZKsync products such as Era or chains built on the ZK Stack framework. Users are advised to withdraw their assets before the deadline for a more convenient experience, but unwithdrawn funds can still be fully claimed after the deadline. <p style=\"text-align: left;\"><strong>2. deBridge cross-chain transactions have reached $3 billion</strong></p><p style=\"text-align: left;\">According to Jinse Finance, official sources indicate that deBridge has processed $3 billion in cross-chain transactions.</p><ol class=\"list-paddingleft-2\"></ol><p style=\"text-align: left;\"><strong>3. Fabric has opened ROBO airdrop applications</strong></p><p style=\"text-align: left;\">According to Jinse Finance, official sources indicate that Fabric has opened ROBO airdrop applications. Eligible users can apply for ROBO tokens before 3:00 AM (UTC) on March 13th.</p><p style=\"text-align: left;\"> Previously, OpenMind's Fabric, a general-purpose open network for robotics, announced the launch of its native token ROBO, which went on public sale on Kaito Capital Launchpad on January 26. The public sale was valued at $400 million, with a fundraising target of $2 million, selling 0.5% of the total token supply, with 100% released during TGE. </p><p style=\"text-align: left;\"><strong>4. Aave's cumulative lending on Mantle surpasses $800 million</strong></p><p style=\"text-align: left;\">According to Jinse Finance, official data shows that Aave's cumulative lending on Mantle has surpassed $800 million.</p><ol class=\"list-paddingleft-2\"></ol><p style=\"text-align: left;\"><strong>5. Solana launches Solana Payments, providing a real-time payment simulator and developer documentation</strong></p><p style=\"text-align: left;\">According to Jinse Finance, citing Cointelegraph, Solana has launched Solana Payments, allowing developers access to a real-time payment simulator, developer documentation, and case studies to begin building on-chain.</p><p style=\"text-align: left;\"> </p><ol class=\"list-paddingleft-2\"></ol><p style=\"text-align: left;\"><strong>Disclaimer: Jinse Finance, as a blockchain information platform, publishes articles for informational purposes only and does not constitute actual investment advice. Please establish sound investment principles and be sure to enhance your risk awareness.</strong></p></div></div>",
            "image": "https://img.jinse.com.cn/jinse_1772195687821198155_small.png",
            "link": "https://www.coinlive.com/news/golden-web3-0-daily-report-vitalik-buterin-announces-ethereum-s-quantum-resistant",
            "pub_date": "2026-02-27 21:47:23",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 250555,
            "title": "Hibernation and Return: Meta Knocks on the Door of Stablecoin Payments Once Again",
            "description": "<div class=\"share___SVvtl\"><div>At the beginning of 2026, a rumor about global social media giant Meta has once again stirred up the already turbulent crypto payment market. According to CoinDesk, citing multiple sources, Meta plans to relaunch its stablecoin strategy in the second half of this year. Unlike the Libra (later renamed Diem) project that shocked the world six years ago, Meta has chosen a more pragmatic and covert path this time: instead of attempting to challenge global monetary sovereignty, it seeks to achieve a closed-loop payment system within its vast ecosystem of 3 billion users by integrating third-party stablecoin technologies. This is not a simple feature update, but a landmark event marking the entry of global Web3 payment infrastructure into a \"compliant integration period.\" This marks the starting point for exploring the magnificent path of RWA development in China. <h1 style=\"text-align: left;\"><span leaf=\"\">I. The Echoes of History: From Libra's \"Utopia\" to a \"Pragmatist\" Turnaround</span></h1><p style=\"text-align: left;\"><span leaf=\"\">Back in 2019, Meta (then known as Facebook) released the Libra white paper, intending to build a global digital currency based on a basket of currencies. This radical attempt to challenge the boundaries of sovereign currencies was quickly met with a global crackdown by regulators. With members withdrawing, hearings being blocked, and Diem ultimately being sold in 2022, Meta's Web3 ambitions seemed to have entered a period of stagnation.</span></p><p style=\"text-align: left;\"><span leaf=\"\">However, technological evolution and regulatory logic have undergone profound changes in the past four years.</span></p><p style=\"text-align: left;\"><span leaf=\"\"> Meta's \"return\" comes against a completely different backdrop: A clearer regulatory framework: With the implementation of the EU's Crypto Asset Market Regulation Act (MiCA) and the advancement of US legislation on stablecoins, compliance is no longer a blind spot. A pioneering example from payment giants: PayPal's PYUSD, launched last year, has validated the feasibility of the \"social/payment giant + compliant stablecoin\" model. A shift in technological paradigm: From \"chain creation\" to \"integration,\" by leveraging existing, mature stablecoin infrastructure (such as Bridge acquired by Stripe), Meta can significantly reduce its regulatory burden. </span></p><h1 style=\"text-align: left;\"><span leaf=\"\">II.</span><span leaf=\"\">In-depth analysis: Stripe, Bridge, and the \"power puzzle\" behind them</span></h1><p style=\"text-align: left;\"><span leaf=\"\">In the details disclosed this time, Stripe's presence is particularly crucial. Stripe's acquisition of stablecoin payment startup Bridge last year is considered one of the most important infrastructure integrations in the industry in recent years. Bridge's core capability lies in enabling enterprises to easily send, receive, and exchange stablecoins through APIs, which is precisely the \"last mile\" that Meta needs to complete its financial landscape.</span></p><p style=\"text-align: left;\"><span leaf=\"\">Even more interesting clues are hidden in the personnel arrangements. Stripe CEO Patrick Collison officially joined the Meta board of directors in April 2025. This overlap in top-level design indicates that the cooperation between Meta and Stripe is by no means an accidental business pilot, but a deep coupling based on strategic complementarity.</span></p><p style=\"text-align: left;\"><span leaf=\"\"> Meta provides traffic entry points and scenarios (Facebook, WhatsApp, Instagram), while Stripe provides compliant clearing and stablecoin gateways. This combination of \"traffic + infrastructure\" will directly disrupt the traditional SWIFT system and the cross-border remittance market. The first half of this year's key words: III. Macro Perspective: \"Financial Equality\" or \"Walled Garden\" for 3 Billion Users? From a macro perspective, Meta's return to the stablecoin arena will have an impact far exceeding the crypto community itself. First, this represents the ultimate evolution from a social network to a value transfer network. In the Web2 era, Meta solved the problem of low-cost information flow; in the Web3 era, if stablecoin payments can be seamlessly embedded into WhatsApp chat windows or Instagram shopping interfaces, 3 billion users worldwide will instantly gain a near-real-time cross-border payment experience without the need for traditional bank accounts. For regions with underdeveloped financial infrastructure, such as Latin America and Southeast Asia, this is not only a payment tool but also a tool for achieving \"financial equality.\" Secondly, this indicates that \"stablecoins as the underlying payment method\" is a foregone conclusion. In the past, stablecoins were mostly seen as a medium for trading cryptocurrencies, but Meta's entry signifies that stablecoins are accelerating their return to their \"payment attributes.\" When mainstream payment companies (Stripe) and mainstream social networks (Meta) complete their integration, stablecoins will truly transform from a hedging tool in the secondary market into a settlement currency at the retail level. IV. Industry Implications and Outlook For blockchain practitioners and policymakers, Meta's actions send a clear signal: Compliance is the only pass: Meta abandoned its ambition to establish its own token issuance rights and instead sought cooperation with compliant third parties, indicating that under the existing regulatory framework, \"professional division of labor and compliant integration\" is the standard approach for major companies entering Web3. The explosion of stablecoins RWA (Real-World Assets): With the involvement of giants like Meta, the demand for stablecoins pegged to underlying US dollar assets will grow exponentially, which will in turn drive further prosperity in the RWA market. In summary, Meta's second attempt lacked the fervor of \"changing the world's monetary system\" and instead demonstrated a more pragmatic approach of \"deeply cultivating existing financial logic.\" In the second half of 2026, when Meta's digital wallet and stablecoin payments officially launch, we may find that the \"Internet of Value,\" once considered a distant vision, is entering households in a pragmatic way after experiencing several bubbles and baptisms.</span></p></div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/49fa7d911a27c8c5b433d99fa0aa9f00.jpg",
            "link": "https://www.coinlive.com/news/hibernation-and-return-meta-knocks-on-the-door-of-stablecoin",
            "pub_date": "2026-02-27 21:36:17",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 250552,
            "title": "Tokenized Private Credit",
            "description": "<div class=\"share___SVvtl\"><div>What is private lending? Private lending refers to debt financing provided by non-bank lending institutions, such as direct loans to medium-sized enterprises, real estate loans, trade finance, consumer loans, and structured credit. These loans are not issued or traded on the public market. Unlike public bonds, these loans are negotiated bilaterally, recorded privately, and typically held by the originating fund until maturity. After 2008, as banks scaled back their operations under new regulatory restrictions (Basel III), the private lending asset class grew rapidly. Investment funds, private equity firms, and specialized financial companies flocked in, filling the lending gap. By 2020, the global private lending market had grown to approximately $2 trillion. By early 2025, the market had reached $3 trillion, and it is projected to reach $5 trillion by 2029 (Morgan Stanley, McKinsey). The traditional private lending market suffers from three core structural problems that make it an ideal target for tokenization. **Insufficient Liquidity:** Once a fund issues a loan, it typically holds it until maturity. There are currently no mature trading platforms for trading shares of private loans. Secondary market trading is customized, slow, and requires extensive due diligence from buyers. **Lack of Transparency:** Fragmented data means investors often lack a clear understanding of leverage ratios, collateral quality, or real-time performance. Reports are typically released quarterly, resulting in significant information asymmetry. Entry Threshold: The minimum investment is $5 million to $10 million, with a multi-year lock-up period and qualified investor requirements, effectively excluding everyone except the largest institutional investors. What is Tokenized Private Credit? Tokenized private credit is the process of converting private loans or debt instruments into blockchain-based digital tokens. These tokens represent claims to loan cash flows, ownership of fund units, or rights to interest and principal payments. In reality, the underlying loan or credit exposure remains off-chain, with the same legal structure and regulatory approach as traditional markets. However, ownership claims or rights to proceeds are represented on-chain in the form of tokens. These tokens can be issued, traded, and settled more efficiently using blockchain infrastructure. The working principle is as follows: Origin: The originating institution constructs private credit products (SME loans, structured credit, trade finance, home equity lines of credit, etc.). Legal Packaging: A legal entity (usually a special purpose entity) is created to hold the loan exposure. Tokenization: Digital tokens representing ownership or cash flow rights of the credit are minted. Subscription: Investors subscribe using fiat currency or stablecoins and receive tokens in return. Performance: The loan continues to be executed off-chain, but payments, investor reports, and ownership records are managed on-chain. <h2 style=\"text-align: left;\">Two Tokenization Models</h2><p style=\"text-align: left;\">This is a key distinction that most articles overlook.</p><p style=\"text-align: left;\">Representative Tokenization: The blockchain serves solely as a transparent record system for off-chain lending. These tokens are non-transferable and non-tradable; the blockchain only provides operational upgrades (immutable ledger, real-time tracking). Figure primarily employs this model.</p><p style=\"text-align:center\"><img src=\"https://img.jinse.com.cn/7436354_image3.png\"/></p><p style=\"text-align: left;\"><em>Figure's Data</em></p><p style=\"text-align: left;\">Distributable Tokenization: Loans are natively issued and held on-chain as transferable tokens. Investors can hold, trade, and combine these tokens within the DeFi ecosystem. Platforms like Maple, Centrifuge, and Tradable are closer to this model.</p> According to research data from HTX_Global, of the approximately $19 billion in active on-chain private lending, only about 12% is held in a transferable, distributable tokenized form. The remainder is \"recorded but immovable.\" This is a crucial nuance in assessing the true state of the market. **Evolution Process** **Phase 0: Prehistory (2017-2019)** **2017: Centrifuge was founded as one of the first DeFi projects to integrate RWA. It initially focused on tokenizing invoices and accounts receivable through its Tinlake protocol (an open asset pool powered by smart contracts).** **2018: Figure was founded by Mike Cagney (former CEO of SoFi). The company focused on integrating blockchain into financial services, first launching Home Equity Credit (HELOC) based on blockchain infrastructure. Figure developed the Provenance Blockchain Foundation (a Layer 1 based on the Cosmos SDK) as its infrastructure.** 2019: Cadence (later renamed Percent) launched its first tokenized private debt product, attempting to reduce back-office costs by standardizing and reusing smart contract templates for structured products. Early challenges followed, such as higher-than-expected on-chain contract mirroring costs and insufficient demand for tokenized debt due to a lack of sufficient crypto-native investors to invest effectively. Phase 1: DeFi Integration and Early Development (2020-2021) 2020 (Centrifuge V1): Centrifuge proved that tokenized private credit could serve as collateral in DeFi, notably its integration with SkyEcosystem. Early 2021: Goldfinch launched, focusing on decentralized lending in emerging markets. This protocol enables cryptocurrency investors to provide loan funds to fintech institutions in developing countries (Indonesia, Mexico, Peru, Kenya). It employs a dual-pool model: retail funds enter a senior pool for stable returns (7-10% annualized), while community-elected junior supporters provide first-loss funding in exchange for higher returns. 2021: Maple launched as an institutional lending platform on Ethereum, using \"pool representatives\" for credit assessment. Initially serving institutional borrowers such as hedge funds, trading firms, and cryptocurrency market makers. TrueFi and Clearpool also entered the market. 2021: Figure began settling Home Equity Credits (HELOCs) on the Provenance Blockchain Foundation, reducing financing cycles from months to days and eliminating intermediaries. Mid-2021 to end of 2022: Active lending in the on-chain private lending market peaked at nearly $1.5 billion. Lending was primarily driven by cryptocurrency exchanges and market makers. Phase 2: Crypto Winter and Reset (2022) 2022: The crypto winter severely impacted on-chain private lending. Maple defaulted on $69.3 million in debt during institutional turmoil (the collapses of FTX/Alameda/3AC). Low-collateralized loans to crypto companies proved disastrous. Goldfinch experienced bad credit through its emerging market offerings. Total on-chain private lending value plummeted from its peak. Lending to crypto-native companies (trading desks, market makers) created a cyclical risk. The market began to shift towards real-world lending as a driver of recovery. Phase 3: Real-world Transformation and Institutional Investor Entry (2023-2024) 2023 (Centrifuge V2): Multi-chain expansion and institutional-grade fund structuring tools. New growth primarily came from real-world lending. 2023: Hamilton Lane tokenized its Senior Credit Opportunities (SCOPE) private credit fund on Ethereum and Polygon through Securitize, lowering the minimum investment from $5 million to $20,000. 2022 (Early): KKR launched its healthcare strategic growth fund on the Avalanche blockchain via Securitize. 2024: Hamilton Lane extended SCOPE to the Solana chain via the Libre platform. Mid-2024: Centrifuge had an outstanding loan balance of $289 million, primarily invested in consumer asset-backed securities (ABS), real estate bridge loans, and trade finance. Over 85% of loans issued through Centrifuge were financed via the Sky Protocol (formerly MakerDAO). 2024 (Centrifuge V3): Interoperability, Standardization, and Composability. Develop ERC-7540, an extension of ERC-4626, for standardizing asynchronous investing and redemption. End of 2024: BlackRock launches BUIDL (a tokenized money market fund), reaching $1.2 billion in assets under management within six months. Early 2024: The private lending tokenization space reaches approximately $8 billion, primarily driven by Figure, Centrifuge, Maple, Goldfinch, Clearpool, and Credix. Phase 4: Institutional Acceleration (2025) January 2025: Apollo launches the tokenized diversified credit fund (ACRED) across six blockchains via Securitize. By November 2025, its assets under management reached $170 million. In February 2025: Figure formed a joint venture with Sixth Street (Sixth Street committed $200 million in equity to Figure Connect for continued private lending liquidity). By mid-2025: Figure had tokenized over $13 billion in loans (primarily home equity lines of credit). It became the number one non-bank home equity line of credit lender in the U.S. It settled over $600 million in loans monthly on Provenance. September 2025: Figure listed on Nasdaq under the ticker symbol FIGR, raising $787.5 million in its IPO, valuing the company at $5.3 billion (later reaching $7.6 billion). October 2025: Total tokenized real-world assets (RWA) reached approximately $33 billion, with private lending accounting for $16-18 billion. As of November 2025: On-chain private lending exceeded $18.91 billion, with cumulative disbursements reaching $33.66 billion (RWA.xyz data). The value increased by 82% from the end of 2024, reaching $17.9 billion as of October 2025 (PwC data). Securitize issued nearly $4 billion in tokenized assets and is a tokenization partner of BlackRock, Apollo, Hamilton Lane, KKR, and VanEck. **Phase 5: Status Quo (Early 2026)** February 2026: Figure Technologies currently leads the market with approximately $15 billion in active loans, representing 75% of the total active loan volume of approximately $20 billion (RWA.xyz data). The total value of tokenized assets on the Provenance platform reached $1.2 billion in TVL. Hamilton Lane and Securitize launched an RWA-backed stablecoin on OKX's X Layer platform. This stablecoin is backed by tokenized exposure from Hamilton Lane's SCOPE fund and employs a dual-token architecture to separate yields from the stablecoin itself. The tokenized private lending market continues to expand into the DeFi composability space: Apollo's ACRED fund is being used in leveraged cycles on platforms like Morpho and Kamino, demonstrating that on-chain assets can be combined in ways that are impossible in traditional finance. Industry expectations for 2026 include major institutions \"transitioning from pilot phases to large-scale, production-ready products,\" and the potential for on-chain lending to receive ratings from traditional rating agencies. How Tokenized Private Lending Works** **Token Standards and Structure** **Loan-Specific Tokens:** Each loan is tokenized into one or more ERC-20 tokens, representing a claim to the cash flow of that asset. For example, real estate lenders issue tokens that entitle holders to mortgage repayments. These tokens typically constitute securities and must be issued under exemptions (Reg D for accredited investors, and Reg A+ for broader but restricted retail investors).** **Loan Pool Model:** Lenders contribute to a public pool of funds, which then distributes loans to borrowers on their behalf. Loans are represented on-chain as debt securities (non-tradable tokens) linked to NFTs, while lenders receive ERC-20 tokens representing their share of the pool. Smart contract enforcement clauses mean that if a borrower fails to repay the loan, the loan defaults, triggering pre-defined remedies. Fund tokenization: The fund structure itself is tokenized (e.g., Hamilton Lane's SCOPE). Investors hold tokens representing fund units, rather than direct claims on individual loans. This is currently the mainstream institutional model. Key Standards: ERC-20: Standard fungible token for loan pool shares and fund tokens. ERC-721 (NFT): For individual loan representations in certain protocols. ERC-4626: Standard for tokenized vaults for yield positions. ERC-7540: An extension of ERC-4626 for asynchronous investing and redemption, a leading DeFi RWA standard developed by Centrifuge. Tiered Structure: Advanced/Junior Tiered Structure (Centrifuge's DROP/TIN model) allows for risk-return differentiation. Lifecycle Management. Smart Contract Processing: Loan Issuance and Interest Accumulation; Token Holder Collection and Distribution; Redemption and Principal Return; Compliance Checks (Whitelist, KYC/AML, Jurisdiction Restrictions); Default Trigger Mechanism and Waterfall Repayment Mechanism; Transparency Issues. This section of the article applies the RWA Transparency Framework, which distinguishes between the actual allocated content and the content merely presented on-chain. What does Figure's dominance really mean? Figure accounts for approximately 75% of tokenized private lending. However, Provenance is a specially constructed chain whose smart contracts require governance approval. As Glider co-founder Brian Huang points out: \"Unless the asset is composable, on-chain assets are no more useful than off-chain assets. Provenance is not composable.\" This means that, in dollar terms, the vast majority of tokenized private lending is essentially an operational upgrade, rather than a distributable, DeFi-composable asset. These loans are not tradable tokens that investors can freely transfer, combine, or use across ecosystems. This is crucial for transparency analysis. The 12% Problem: According to HTX research, only about 12% of on-chain private credit is held in a transferable tokenized form. The rest, while documented, cannot be distributed. While some say tokenized private credit is worth $20 billion, a more accurate figure for truly distributable, composable tokenized credit should be between $2 billion and $3 billion. On-Chain Verifiable Content: Fully verifiable: Token ownership, transfer history, fund share balance, smart contract terms, compliance status (whitelist), and payment and distribution. Partially verifiable: Total outstanding loan value (depending on oracle/report accuracy), collateral ratio (for overcollateralized models). On-chain verifiability includes: borrower creditworthiness, actual loan performance (still relying on off-chain reports), collateral quality of off-chain assets, true default rate, and recovery rate. Underlying credit risk assessment, underwriting, and counterparty evaluation remain entirely off-chain. Blockchain provides transparency at the token layer, but not necessarily at the asset layer.</div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/e023cbf10e4bd3a0ceefdd90c8c992b7.jpg",
            "link": "https://www.coinlive.com/news/tokenized-private-credit",
            "pub_date": "2026-02-27 21:18:21",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 250546,
            "title": "How can one kilowatt-hour of electricity be sold to the other side of the Pacific Ocean?",
            "description": "<div class=\"share___SVvtl\"><div><h1 style=\"text-align: left;\"><span leaf=\"\">How can one kilowatt-hour of electricity be sold to the other side of the Pacific?</span></h1><blockquote style=\"text-align: left;\"><p style=\"text-align: left;\"><span leaf=\"\">It took me two years to figure out one thing—China's cheapest export isn't clothing, solar panels, or electrolytic aluminum, but something most people haven't even realized. It doesn't need containers, it doesn't go through customs, and it can be delivered via undersea fiber optic cables. It's called Token.</span></p></blockquote><h2 style=\"text-align: left;\"><span leaf=\"\">A question I haven't figured out</span></h2><p style=\"text-align: left;\"><span leaf=\"\">In 2023, news about controlled nuclear fusion was everywhere, and the new energy sector was booming. I noticed a rather inconspicuous piece of news at the time: Sam Altman had invested in a small nuclear reactor company called OKLO.</span></p><blockquote style=\"text-align: left;\"><p style=\"text-align: left;\"><span leaf=\"\">In 2023, news about controlled nuclear fusion was everywhere, and the new energy sector was hot. I noticed a rather inconspicuous piece of news at the time: Sam Altman had invested in a small nuclear reactor company called OKLO.</span></p><p style=\"text-align: left;\"><span leaf=\"\"> At that time, ChatGPT had just come out, and everyone was talking about the emergence of intelligence in large models. Few people discussed AI and energy together. I remembered Altman's investment in OKLO, but I didn't understand it. Around the same time, I was discussing a far-fetched question with AI: If electricity could be transported and traded as freely as oil, could China leverage its electricity cost advantage to establish a pricing system similar to the petrodollar? This idea stemmed from a simple observation—China's electricity costs are indeed cheap globally. China has the world's largest installed capacity of wind and solar power, and while coal-fired power is not environmentally friendly, it is stable. If electricity could be directly exported, theoretically, this would be a huge comparative advantage. But the discussion quickly stalled. Two Impossible Paths There are two intuitively feasible paths for electricity export, which we have analyzed one by one. The first is direct grid connection. Laying transnational transmission lines to sell electricity directly to neighboring countries and even further afield. The problem is obvious: the construction cost of ultra-high-voltage transmission lines is staggering, each country along the route is a negotiation node, and geopolitical risks make this path almost impossible to scale up. China to Southeast Asia might still have some possibility, but covering the entire globe like oil pipelines is unrealistic. The second route is battery export. Storing electricity in batteries and shipping it out is like canning food. This route is hampered by the laws of physics—batteries have a ceiling on energy density, and the self-discharge losses, temperature control costs, and logistics weight during long-distance transportation can make it more expensive than generating electricity locally. Not to mention the production cost of the batteries themselves, where the price fluctuations of minerals like lithium and cobalt are far greater than the cost of electricity. We've also discussed indirect routes: exporting electricity through energy-intensive products, such as electrolytic aluminum and industrial silicon. However, the cost structure of these products is too complex; electricity is only one component, with layers of mining, processing, and transportation added on top. Unlike oil, where a barrel of oil is simply a barrel of oil with a clear price. At this point in the discussion, my conclusion is: Before a qualitative leap occurs in energy storage and power transmission technologies, electricity will be difficult to become a commodity that can be directly exported. This conclusion seemed reasonable at the time. </span></p><p style=\"text-align:center\"><img alt=\"cEdTuWfl3UWjMVweY4rn42WG5kfrfcnJD8XWf0H7.png\" src=\"https://img.jinse.com.cn/7436347_image3.png\" title=\"7436347\"/></p><figcaption style=\"text-align: center;\"><span leaf=\"\">Comparison of three paths for electricity export</span></figcaption><h2 style=\"text-align: left;\"><span leaf=\"\">Altman probably figured it out earlier than everyone else</span></h2><p style=\"text-align: left;\"><span leaf=\"\">Then the AI ​​era arrived.</span></p><p style=\"text-align: left;\"><span leaf=\"\">Not at the moment ChatGPT was released—back then, the discussion was still about \"whether AI can replace programmers.\"</span></p><p style=\"text-align: left;\"><span leaf=\"\">Not at the moment ChatGPT was released—back then, the discussion was still about \"whether AI can replace programmers.\"</span></p><p style=\"text-align: left;\"><span leaf=\"\"> It wasn't until 2024-2025, when large-scale models began to be commercially available on a large scale and token pricing became a business, that I suddenly realized something. Tokens are essentially the unit of electricity. This isn't a metaphor. If you open the pricing page of any AI API, the core costs of a token, broken down, are computing power and electricity. Computing power is the depreciation and amortization of GPUs, and electricity is the operating cost of data centers. Other costs—such as manual annotation and the amortization of model training R&amp;D—are actually a small percentage of each token. When a user sends a request to DeepSeek or MiniMax, they are essentially purchasing the electricity consumed in a data center in China at that instant. Looking back at Altman's investment in OKLO, the logic becomes clear. He wasn't making energy diversification investments; he was securing electricity supply for OpenAI's future. He foresaw the endgame early on: in the end, AI companies' competition will lead to convergent model architectures, talent mobility, and the only irreplaceable resource will be electricity. Google's TPU is the other side of the same logic. The GPU arms race is essentially a talent competition—when Nvidia engineers are poached, new chip companies emerge. But electricity isn't a talent issue; it's a resource issue, and it won't shift due to the movement of people. A New Way to Exit Electricity is indeed difficult to export directly. But tokens can. A US user calls DeepSeek's API; data travels from California, through a Pacific undersea fiber optic cable to a data center in China, where the GPU consumes power to complete inference, and the results are then transmitted back. Throughout the entire process, the electricity never leaves China's power grid, but its value is delivered across borders through tokens. There is no transmission line loss, no battery self-discharge, and no geopolitical negotiations. The signal loss from fiber optic transmission is negligible compared to grid transmission. Electricity has finally found its export form—not joules, but tokens. MiniMax and Zhipu can offer competitive token prices in the global market, partly because they are undervalued, due to China's electricity costs. Of course, it's not just electricity; the efficiency of the model architecture (such as MoE) and the optimization capabilities of the engineering team are also important. But if these \"soft\" factors are aligned, electricity cost becomes the hard, unreplicable differentiator. This differs from my previous refutation of the \"electricity export of electrolytic aluminum.\" In the cost structure of electrolytic aluminum, electricity may account for 30%-40%, with the remainder being ore and processing. However, in the cost structure of tokens, electricity plus computing power may account for over 70%, and the computing power itself also depends on electricity. Tokens are, to date, the purest electricity derivative. </span></p><p style=\"text-align:center\"><img alt=\"kMR6aOYxHyLWlmeCDWevcM0IadAIJwRfD1hCKFMZ.png\" src=\"https://img.jinse.com.cn/7436348_image3.png\" title=\"7436348\"/></p><figcaption style=\"text-align: center;\"><span leaf=\"\">Token Purity Comparison: Electrolytic Aluminum vs. Battery vs. Token</span></figcaption><h2 style=\"text-align: left;\"><span leaf=\"\">Opportunities and Risks in the Time Difference</span></h2><p style=\"text-align: left;\"><span leaf=\"\">But the current situation is not an equilibrium state.</span></p><p style=\"text-align: left;\"><span leaf=\"\">AI's demand for electricity is growing far faster than the construction speed of power infrastructure.</span></p><p style=\"text-align: left;\"><span leaf=\"\">The current situation is not an equilibrium state.</span></p><p style=\"text-align: left;\"><span leaf=\"\">AI's demand for electricity is growing much faster than the construction speed of power infrastructure.</span></p> The electricity required to train a cutting-edge large-scale model is increasing annually, while a new power plant typically takes 3-5 years from project initiation to grid connection. This time mismatch is the root cause of the current surge in energy prices. It's not that there isn't enough electricity—China's installed power generation capacity has been increasing year after year. Nor is it that the technology is inadequate—the cost per kilowatt-hour for solar and wind power is already lower than that for coal-fired power. The problem is that the demand for AI is growing too fast, so fast that the existing power allocation system cannot keep up. It's like a highway designed for 100,000 vehicles per day, but suddenly 500,000 vehicles flood in every day; it's not that the road isn't wide enough, it's that there's no time to expand it. This time lag creates short-term opportunities: whoever currently has sufficient electricity supply has a pricing advantage in the AI ​​token market. Regions like China, the Middle East, and Northern Europe, with their low electricity costs or abundant supply, are naturally suited to become the \"world's factory\" for AI inference. However, the other side of the time difference is risk. <p style=\"text-align:center\"><img alt=\"u6AZEfDhUWZXhaM378zupxrU6ct5KwsahP15HvY0.png\" src=\"https://img.jinse.com.cn/7436349_image3.png\" title=\"7436349\"/></p><figcaption style=\"text-align: center;\"><span leaf=\"\">AI Power Supply and Demand Time Mismatch</span></figcaption><p style=\"text-align: left;\"><span leaf=\"\">If, in 3-5 years, the power capacity built for AI comes online in a concentrated manner, while AI inference efficiency improves significantly due to advancements in model compression and quantization technologies (resulting in a continuous decrease in the power consumed per token), then a classic supply and demand reversal will occur—a sudden surplus of power prepared for AI.</span></p><p style=\"text-align: left;\"><span leaf=\"\">This is not just my wishful thinking.</span></p><p style=\"text-align: left;\"><span leaf=\"\">This is not just wishful thinking.</span></p><p style=\"text-align: left;\"><span leaf=\"\">This is not just my ... wishful thinking.</span></p><p style=\"text-align: left;\"><span leaf=\"\">This is not just wishful thinking.</span> Similar cycles have occurred repeatedly throughout history. The entrance to Jevons' paradox is possible, though things may not evolve so linearly. In 1865, British economist Jevons discovered a counterintuitive phenomenon: the increased efficiency of steam engines did not reduce coal consumption; on the contrary, the lower operating costs spurred more coal use, leading to an increase in total consumption. This is Jevons' paradox. Once the cost of AI reasoning decreases, it may well enter the same cycle. When a token is cheap enough, people will start using AI for things that currently seem \"unworthy\": automatically generated personalized educational content, 24/7 private health advisors, AI customer service for every product, and real-time translation accessible to everyone. The expansion of consumption scenarios may once again outpace supply growth, leading to an increase in electricity demand instead of a decrease. This leads us into a larger-scale spiral: electricity capacity expansion → decreased inference costs → explosion of new consumption scenarios → renewed surge in electricity demand → a new round of capacity expansion. In each spiral, the role of tokens as a unit for monetizing electricity is strengthened. </p><p style=\"text-align:center\"><img alt=\"YEdTuskFRE8z1lsyFgwFpQJXMnTwan0hx9e2B2mR.png\" src=\"https://img.jinse.com.cn/7436350_image3.png\" title=\"7436350\"/></p><figcaption style=\"text-align: center;\"><span leaf=\"\">Jevens' Paradox: The Spiral Cycle</span></figcaption><p style=\"text-align: left;\"><span leaf=\"\">I'm not sure how many times this spiral will turn, nor am I sure at which point the inflection point of true oversupply will occur. But one thing I'm increasingly certain of:</span><strong><span leaf=\"\">Understanding the AI ​​economy cannot be achieved by looking only at models and algorithms; we must look at the underlying energy structure.</span></strong></p><p style=\"text-align: left;\"><span leaf=\"\">I'm not sure how many times this spiral will turn, nor am I sure at which point the inflection point of true oversupply will occur.</span></p></blockquote></div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/03887be73eecd8f6606df05d000fb73b.jpg",
            "link": "https://www.coinlive.com/news/how-can-one-kilowatt-hour-of-electricity-be-sold-to-the",
            "pub_date": "2026-02-27 20:45:15",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        }
    ]
}