{
    "data": [
        {
            "id": 212745,
            "title": "Will Trump's Trade War End Bitcoin's Bull Run Early?",
            "description": "<div class=\"share___SVvtl\"><div><p>Author: Marie Poteriaieva, CoinTelegraph; Compiled by Wuzhu, Golden Finance</p><p>On February 3, Bitcoin fell below $92,000, shocking the cryptocurrency market and triggering up to $2.1 billion in liquidations. Initially, investors seemed prepared for the economic difficulties brought about by the tariff war announced by US President Donald Trump. However, concerns soon shifted to whether Bitcoin had peaked and was about to enter a downtrend.</p><p>More worryingly, Bitcoin Archive points out that every past BTC bull run has peaked within 330 days of breaking the previous cycle's all-time high. February 4 was the 328th day.</p><p>However, Bitcoin quickly rebounded after the drop. The announcement on February 3 of suspending tariffs on Mexico and Canada, as well as a speech by President Trump's cryptocurrency czar David Sacks scheduled for February 4, seemed to reassure the market. </p><p>This raises the question of whether the market has rallied too quickly. Macroeconomic and geopolitical challenges remain, presenting Bitcoin traders with the risk of falling into a bull trap. </p><h2>Bitcoin Demand Remains Strong</h2><p>As the tariff war panic has shown, Bitcoin demand remains strong, continuing to absorb pullbacks — even at all-time highs above $90,000. </p><p>Glassnode’s analysis of Bitcoin’s bull run down suggests that demand for BTC could rise, potentially sparking a “second leg up” in the market. Historical data shows that in the past three cycles (2011-2015, 2015-2018, and 2018-2022), corrections averaged about 25%, followed by an acceleration in price performance during the last third of the bull market. The current bull market has not yet experienced such an acceleration. </p><p style=\"text-align: center;\"><span style=\"color: rgb(0, 112, 192);\"><strong><img alt=\"wLD7AJqZE10T4r0au8QGI716Jz4AjHQdrv4YLePP.jpeg\" src=\"https://img.jinse.cn/7346805_watermarknone.png\" title=\"7346805\"/></strong></span><br/></p><p style=\"text-align: center;\"><span style=\"font-size: 14px;\">Bitcoin bull market correction retracement. Source: Glassnode</span></p><p>On the supply side, a key metric to watch is the long/short holder threshold. It tracks the rotation of capital from long-term investors to new buyers, providing a clearer picture of supply dynamics.</p><p><span style=\"color: rgb(0, 112, 192);\"><strong>Bitcoin cycle peaks typically coincide with times when long-term holders take profits and sell their tokens to new buyers.</strong></span>Glassnode data shows that this is not the case currently.</p>Even though long-term holders have transferred over 1 million BTC to new buyers since November, they still hold a significant share of the supply, suggesting they are confident in future price increases.<p><span style=\"color: rgb(0, 112, 192);\"><strong> </strong></span></p><p><img alt=\"pm7ow6dZtkLlbdBWL0WmKKBAiN5lbfwYmwfkhqwF.jpeg\" src=\"https://img.jinse.cn/7346806_watermarknone.png\" title=\"7346806\"/></p><p style=\"text-align: center;\"><span style=\"font-size: 14px;\">Bitcoin long-term and short-term holder threshold. Source: Glassnode</span></p><h2>How high can Bitcoin go in 2025?</h2><p>Other data from Glassnode shows that so far, the 2022-2025 cycle is very similar to the 2015-2018 cycle. However, a complete repetition is unlikely. In 2017, Bitcoin's all-time high increased its price by 113 times, and the next peak brought a 20-fold return. As Bitcoin matures, the growth rate of each cycle declines, requiring increasing capital inflows to maintain new price levels. </p><p><span style=\"color: rgb(0, 112, 192);\"><strong>BTC has risen six times so far from its December 2023 cycle low of $16,000, suggesting an expected multiplier of between 10x and 13x. This implies a peak of between $160,000 and $210,000 — a target range that aligns with many analysts’ forecasts. </strong></span> Matthew Sigel, head of digital asset research at VanEck, expects Bitcoin to reach $180,000, while Bitwise Asset Management and Bernstein expect it to reach $200,000. Tom Lee, a CNBC contributor and managing partner at Fundstrat, predicts a $250,000 price. </p><p><img alt=\"pbvHdRSA8NvHgTZqQ11sJoo5SS3pgj9oiGzxMDiO.jpeg\" src=\"https://img.jinse.cn/7346807_watermarknone.png\" title=\"7346807\"/></p><p style=\"text-align: center;\"><span style=\"font-size: 14px;\">Bitcoin price performance since the cycle low. Source: Glassnode</span></p><h2>When will Bitcoin peak?</h2><p>Technical analyst CryptoCon believes that Bitcoin's relative strength index is quite accurate in determining cycle stages. RSI is a momentum oscillator that measures the speed and magnitude of price changes and helps identify overbought and oversold conditions for an asset.</p><p>By analyzing the RSI approaching the 99% threshold, CryptoCon identified key cycle stages. Their data shows that Bitcoin entered its fourth cycle phase last November, which suggests that the market could top out around September-October 2025. RSI Bollinger Band % Phase. Source: CryptoCon_ /X Another indicator that has historical accuracy in identifying market tops is the Pi Cycle Top. The indicator tracks the 111-day moving average (111DMA) and multiples of the 350-day moving average (350DMA x 2). In previous cycles, Bitcoin’s price peaked when the 111DMA crossed above the 350DMA x 2. </p><p><span style=\"color: rgb(0, 112, 192);\"><strong>According to the Bitcoin Pi Cycle Top Forecast, which extrapolates these moving averages to estimate the next peak, Bitcoin is expected to peak around September 26th. </strong></span></p><p><img alt=\"4XxjawRVGiD4bAfcSAADMc9VoFSQ5cnJfoefh076.jpeg\" src=\"https://img.jinse.cn/7346809_watermarknone.png\" title=\"7346809\"/></p><p style=\"text-align: center;\"><span style=\"font-size: 14px;\">Bitcoin Pi Cycle Top Forecast. Source: Bitbo, PositiveCrypto</span></p><p>While no indicator is perfect, the market's resilience and continued demand suggest that the true top may still be ahead.</p></div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/86d23d7e8c2627435f22bb5971b917d8.jpg",
            "link": "https://www.coinlive.com/news/will-trump-s-trade-war-end-bitcoin-s-bull-run-early",
            "pub_date": "2025-02-05 19:12:48",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 212743,
            "title": "Interpreting the next generation Ethereum Layer2 solution: Based Rollups",
            "description": "<div class=\"share___SVvtl\"><div><p>Source: Denglian Community</p><p>Rollups have developed rapidly. Initially, <span href=\"https://research.2077.xyz/the-practical-guide-to-ethereum-rollups#classic-rollups\">classic rollups</span> provided a short-term solution to Ethereum's scalability challenges. Now, as the technology advances, we are building the next generation of rollups that not only further scale Ethereum, but also retain decentralization, security, and economic sustainability.</p><p>In a four-part series called \"Understanding the Next Generation of L2\", we explore some new types of rollups - Based rollups, Booster rollups, gigagas rollups, native rollups - and aim to introduce these designs to a wide audience. These rollups represent the future of Ethereum scaling, and given @2077Research’s commitment to making Ethereum research and development (R&amp;D) accessible, we thought it was important to educate the community on newer L2 designs. </p><p>Our goal is to quickly introduce these technologies and clarify the concepts involved. In this series, we will break down each rollup type, exploring their design, benefits, tradeoffs, and overall impact on the Ethereum roadmap. Whether you’re an Ethereum enthusiast, developer, or just curious about blockchain scalability, this series is for you. </p><p>The first post looks at Based Rollups — a proposed approach to building rollups that aims to mitigate issues with classic rollups, such as sorter centralization, lifecycle risk, and censorship resistance. We’ll explore how Based Rollups work, the benefits they provide, and the barriers to adoption of Based Rollups. </p><h2><span align-=\"\" background-origin:=\"\" background-position:=\"\" background-repeat:=\"\" background-size:=\"\" height:=\"\" width:=\"\"></span>What is Based rollup?</h2><p>If a rollup uses a sort-based approach to processing transactions, it is called a Based rollup. Sorting refers to how transactions are ordered in a rollup. Based sorting utilizes the validator set of the Layer 1 (L1) chain to sort transactions, rather than relying on a centralized entity (“sorter”) to sort transactions.</p><p>Today, traditional rollups have centralized sorters, which leads to several problems. These problems include censorship of user transactions, risk of single point of failure, and MEV monopoly (centralized sorters can extract MEV (maximum extractable value) from users due to private access to the memory pool).</p><p>Given the problems with centralized sorting, the Ethereum community has been looking for alternatives. Importantly, such alternative ordering designs must meet a key design goal: they must be as efficient and fast as their predecessors. </p><p>Based Ordering and Based Rollups are a positive step in this direction as they provide a new way to order transactions for rollups that inherits Ethereum’s censorship resistance, eliminates single points of failure, and avoids sacrificing speed for decentralization. We describe how Based Rollups work below. </p><h2><span align-=\"\" background-origin:=\"\" background-position:=\"\" background-repeat:=\"\" background-size:=\"\" height:=\"\" width:=\"\"></span>How do Based rollups work? <br/></h2><figure style=\"text-align: center;\"><img src=\"https://img.jinse.cn/7346801_image3.png\"/><figcaption style=\"text-align: center;\"><span style=\"font-size: 14px;\">Description of @Spire_Labs' Based rollup architecture</span></figcaption></figure><p>The main difference between a Based rollup and any other type of rollup is the way transactions are ordered. In a Based rollup, transaction ordering is managed by the underlying L1 blockchain (in this case Ethereum). Specifically, in Based Rollup, “any next L1 proposer is free to include subsequent rollup blocks in the next L1 block, along with L1 finders and builders, without special permissions.” In a rollup-based architecture, a user’s transaction is directed to an L1 builder that has agreed to be the Ethereum and L2-based building blocks. The user indicates their maximum transaction fee, the L2 captures the base fee (set based on L2 network congestion) and forwards the priority fee (paid to incentivize transactions to include tips) to validators, who decide on transaction ordering. This arrangement allows Ethereum to not only secure all fees for its ecosystem, but also collect a portion of L2 tips, as well as fees for transaction settlement. Returning value to L1 makes Based Rollups a symbiotic relationship with Ethereum and dispels the notion that rollups are parasitic on Ethereum. Leveraging L1 proposers to provide L2 with a secure, reliable, and reliable blockchain for Ethereum users is a great way to make money. Another benefit of transaction ordering is that it eliminates intermediary steps in the transaction process. This can potentially lead to lower transaction costs by avoiding the need to verify signatures from centralized or decentralized orderers. </p><p>It is worth mentioning that this cost reduction is not unique to Based Rollups; any rollup that uses shared ordering may see similar benefits. Since proposed blocks on L1 are permissionless, this promotes a competitive environment among block builders, which may further reduce fees for users. </p><figure style=\"text-align: center;\"><img src=\"https://img.jinse.cn/7346802_image3.png\"/><figcaption></figcaption></figure><p style=\"text-align: center;\"><span style=\"font-size: 14px;\">Description of taiko Based rollup architecture</span></p><p>Since Based Rollup submits its proofs directly to Ethereum, its settlement is essentially on Ethereum. This means that anyone on Ethereum can access the verified state of the L2 chain. Based Rollup cannot be verified on its underlying L1 Based Rollups publish the data needed to reconstruct its chain state on Ethereum, making Ethereum its Data Availability (DA) layer. This allows anyone to verify block hashes and retrieve transaction data from blocks. Based Rollups use Ethereum's consensus layer for transaction ordering, eliminating the need for its own consensus mechanism. Transaction execution in a Based Rollup occurs off-chain within its ecosystem, which means that the Based Rollup itself serves as its own execution layer. For example, existing Based Rollups, such as taiko and SpireLabs, although settled on Ethereum, run on the same L1 but maintain their own unique execution layer to execute transactions. </p><h2><span align-=\"\" background-origin:=\"\" background-position:=\"\" background-repeat:=\"\" background-size:=\"\" height:=\"\" width:=\"\"></span>What are the pros and cons of a Based Rollup design? </h2><p>The advantages of Based Rollups include inheriting Ethereum's security and liveness, potentially reducing transaction costs by eliminating additional ordering, enabling atomic composition of L2 transactions interacting with L1 state, simplifying the architecture without the need for separate consensus, ensuring data availability for all data on Ethereum, and providing strong censorship resistance. </p><p>However, like everything in crypto, Based Rollups have their concerns. Based Rollups rely on Ethereum's performance, which may limit scalability due to Ethereum's block space limitations. L2 operations are still associated with gas costs, which can be considerable. There is also the issue of MEV, where L1 validators may affect transaction ordering. The close connection with Ethereum's consensus and data layer may limit customization for specific use cases. </p><h2><span align-=\"\" background-origin:=\"\" background-position:=\"\" background-repeat:=\"\" background-size:=\"\" height:=\"\" width:=\"\"></span>Based Rollups FAQ</h2><p>In this section, we answer some common questions about Based Rollups. Our goal is to dispel specific misunderstandings about Based Rollups and provide clear information about various aspects of the based rollup architecture. </p><h3><span align-=\"\" background-origin:=\"\" background-position:=\"\" background-repeat:=\"\" background-size:=\"\" height:=\"\" width:=\"\"></span>How is MEV managed in based rollups? </h3><p>Most MEV benefits L1 validators because the incentive for L1 finders and block builders is to include rollup blocks in their L1 packages to capture this value, thereby encouraging L1 proposers to include these blocks. Currently, ~80% of Ethereum MEV comes from congestion and 20% from contention. If L2 MEV reflects this, a large portion may stay on L2. </p><h3><span align-=\"\" background-origin:=\"\" background-position:=\"\" background-repeat:=\"\" background-size:=\"\" height:=\"\" width:=\"\"></span>Is using rollup cheaper for users compared to the alternatives? </h3><p>Using L1 proposers as L2 sorters can save an intermediary step, potentially reducing costs by eliminating sorter signature verification. This cost savings applies not only to rollup-based, but also to shared sorting rollups, as permissionless block proposals promote competition, potentially reducing fees. </p><h3><span align-=\"\" background-origin:=\"\" background-position:=\"\" background-repeat:=\"\" background-size:=\"\" height:=\"\" width:=\"\"></span>Are rollup-based speeds limited to Ethereum's block time? </h3><p>Yes, rollup-based transaction confirmation times are tied to L1's block time, which is currently 12 seconds. However, rollup-based transactions can achieve instant pre-confirmation. This can be achieved through a mechanism similar to re-staking, where some L1 validators commit to including rollup-based blocks in their future L1 blocks. This is possible because validators know who will propose each block 32 blocks in advance. </p><h3><span align-=\"\" background-origin:=\"\" background-position:=\"\" background-repeat:=\"\" background-size:=\"\" height:=\"\" width:=\"\"></span>How “live” is rollup-based liveness? </h3><p>Order-based shares Ethereum’s liveness guarantees, fully inheriting its uptime. Even a slight drop in liveness (e.g., from 100% to 99%) can be exploited under adversarial conditions, leading to significant disruption and toxic MEV. </p><h3><span align-=\"\" background-origin:=\"\" background-position:=\"\" background-repeat:=\"\" background-size:=\"\" height:=\"\" width:=\"\"></span>What is the difference between order-based and shared ordering? </h3><p>Order-based can be viewed as a specialized version of shared ordering. Shared ordering, as a transaction ordering system across multiple rollups, aims to achieve economic efficiency, higher throughput, and faster confirmations than L1. It differs from rollup-based rollups in that it uses its own operators for consensus, making it more complex and not entirely dependent on Ethereum’s liveness. </p><h2><span align-=\"\" background-origin:=\"\" background-position:=\"\" background-repeat:=\"\" background-size:=\"\" height:=\"\" width:=\"\"></span>Conclusion</h2><p>In the first post of our “Rollups 2.0” series, we explored rollup-based rollups, which leverage Ethereum’s validators for transaction ordering, providing a path to decentralization, security, and cost efficiency. </p><p>As we continue in this series, we’ll dive deeper into enhanced rollups, native rollups, and hyperscale rollups — examining how these types of rollups address different aspects of Ethereum’s scalability. </p><p></p><p><mp-style-type></mp-style-type></p></div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/3d6c8367c8b3550a3bc467bb8b6054dd.jpg",
            "link": "https://www.coinlive.com/news/interpreting-the-next-generation-ethereum-layer2-solution-based-rollups",
            "pub_date": "2025-02-05 18:44:46",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 212741,
            "title": "India Is Facing Mounting Pressure To Change Its Attitude Towards Crypto, As More And More Country Jumps On The Crypto Bandwagon",
            "description": "<div class=\"share___SVvtl\"><div><p>India, a country that is well known for its hard stance and skepticism towards crypto, is facing pressure to also change its regulatory policy regarding crypto less they lose out. </p><p></p><div class=\"media-wrap embed-wrap\"><div><blockquote class=\"twitter-tweet\" data-media-max-width=\"560\"><p dir=\"ltr\" lang=\"en\">🇮🇳 India is reviewing its crypto policy as global trends shift, says DEA Secretary Ajay Seth.<br/><br/>📌 30% tax on crypto gains &amp; 1% TDS still apply. No changes yet!<a href=\"https://twitter.com/hashtag/cryptomarket?src=hash&amp;ref_src=twsrc%5Etfw\">#cryptomarket</a><a href=\"https://twitter.com/hashtag/India?src=hash&amp;ref_src=twsrc%5Etfw\">#India</a><a href=\"https://twitter.com/hashtag/CryptoTax?src=hash&amp;ref_src=twsrc%5Etfw\">#CryptoTax</a><a href=\"https://t.co/Fyi5XCvxb6\">pic.twitter.com/Fyi5XCvxb6</a></p>— Crypto Crown Sahil Dubey (@ICryptoCrown) <a href=\"https://twitter.com/ICryptoCrown/status/1887032801163174266?ref_src=twsrc%5Etfw\">February 5, 2025</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p></p><p>Speaking to Reuters, India’s Economic Affairs Secretary, Ajay Seth, acknowledged that crypto “doesn’t believe in borders,” suggesting that the country does not want to get left behind in the digital asset revolution.</p><p></p><h1>Striking a Balance Between Regulation and Innovation</h1><p>This potential shift follows India’s stringent tax policies on crypto, including a newly imposed tax of up to 70% on undisclosed crypto gains under the Income Tax Act. </p><p></p><div class=\"media-wrap embed-wrap\"><div><blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\">🚨JUST IN!<br/><br/>Indian government has sent shockwaves through the cryptocurrency market with its harsh new tax policy, which took effect on February 1, 2025.<br/><br/>Hits Crypto Holders With Retroactive 70% Tax Penalty 📉 <a href=\"https://t.co/MkgYqcU15N\">pic.twitter.com/MkgYqcU15N</a></p>— Bullish Times (@BullishTimes_) <a href=\"https://twitter.com/BullishTimes_/status/1886335156643893548?ref_src=twsrc%5Etfw\">February 3, 2025</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p></p><p>Additionally, all digital asset transactions are subject to a 30% capital gains tax, regardless of whether they are long-term investments or short-term trades.</p><p></p><div class=\"media-wrap embed-wrap\"><div><blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\">India must not shy away from crypto regulations! <br/><br/>Higher taxes (1% TDS, 30% tax on gains) have shifted 90% of trade volume offshore, shrinking the domestic market.<br/><br/>India is currently the #1 in grassroots adoption of crypto (Chainalysis Reports). But, if we don’t act now, by… <a href=\"https://t.co/e7tNdVavTj\">pic.twitter.com/e7tNdVavTj</a></p>— Sumit Gupta (CoinDCX) (@smtgpt) <a href=\"https://twitter.com/smtgpt/status/1881219359454204064?ref_src=twsrc%5Etfw\">January 20, 2025</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p></p><p>Legal experts have criticized these measures, warning that they stifle blockchain innovation. Supreme Court advocate Amit Kumar Gupta described the policies as excessively harsh and an attempt to discentivise the development of permissionless blockchain technology.</p><blockquote>\"Their stance is that we are not going to use or allow anyone to use cryptocurrency because this technology is only for money laundering and terror funding-these kind of activities.\"</blockquote><p></p><h1>India’s Focus on CBDCs Over Decentralized Crypto</h1><p>Despite its reservations about decentralized cryptocurrencies, India is actively developing a central bank digital currency (CBDC). Former Reserve Bank of India (RBI) Governor Shaktikanta Das, a strong proponent of CBDCs, described them as “the future of currency” in his December 2024 farewell speech. </p><p></p><p>Under his leadership, the RBI launched a CBDC pilot program and expanded cross-border payment initiatives, positioning CBDCs as a key tool for international transactions.</p><p></p><div class=\"media-wrap embed-wrap\"><div><blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\">India’s first fintech platform to launch a full-scale CBDC wallet is here. Now users can store and transact with the digital rupee (e-rupee) issued by the Reserve Bank of India.<a href=\"https://twitter.com/dishaacharya_?ref_src=twsrc%5Etfw\">@dishaacharya_</a> writes:<a href=\"https://t.co/mK2KsKpDma\">https://t.co/mK2KsKpDma</a><a href=\"https://t.co/sM4F9Qpk2u\">pic.twitter.com/sM4F9Qpk2u</a></p>— The Morning Context (@MorningContext) <a href=\"https://twitter.com/MorningContext/status/1884594847333445645?ref_src=twsrc%5Etfw\">January 29, 2025</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p></p><p>Shortly after his departure, RBI announced plans to expand its cross-border payment platform in November 2024 by seeking additional trading partners.</p><p></p><p>The bank is investigating the use of CBDCs as the primary settlement method for cross-border transactions, likely implementing a wholesale CBDC within its payment platform.</p><p></p><p>As global economies embrace digital assets, India faces a pivotal choice—adapt its regulatory framework to foster crypto innovation or risk falling behind in the rapidly evolving financial landscape.</p></div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/f27dafc0690f7a9443603a280af0ef86.png",
            "link": "https://www.coinlive.com/news/india-is-facing-mounting-pressure-to-change-its-attitude-towards",
            "pub_date": "2025-02-05 18:20:23",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 212739,
            "title": "Trump puts A Stop To Cheap Shein And Temu Hauls. Consumers May Be Paying Up to 10% More Thanks To Trump's Tariffs",
            "description": "<div class=\"share___SVvtl\"><div><p>Americans love Shein, Temu, and AliExpress for two reasons: cheap prices and fast shopping. But Trump Tariff wars might just change that. </p><p></p><p>Trump's tariff orders is going to reverse something called the de minimis exemption, which is a rule that allows international exporters to ship packages worth less than $800 inspection-and duty-free into the United States.</p><p></p><div class=\"media-wrap embed-wrap\"><div><blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\">Trump has rendered USPS workers jobless. China is responsible for 73.5% of global parcel shipment, at over 111 billion parcels annually.<br/>That means most parcels sent in America are directly or indirectly from China, as even Amazon and co, buy 75% of their products from China. <a href=\"https://t.co/LH9mTWhs6f\">https://t.co/LH9mTWhs6f</a><a href=\"https://t.co/vsuSdO8XY9\">pic.twitter.com/vsuSdO8XY9</a></p>— EmperorX (@EmperorXLair) <a href=\"https://twitter.com/EmperorXLair/status/1887010280644698594?ref_src=twsrc%5Etfw\">February 5, 2025</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p></p><p>But the Trump administration is now removing the provision that is making these packages so cheap and easy to access in the first place. </p><p></p><p>Just yesterday, Trump announced that he would be enacting a 10% tariff on Chinese imports on top of the wide array of tariffs that were placed on goods from the country during his first term. </p><p></p><p>Shortly after, the United States Postal Service announced that they would be suspending the acceptance of international parcels from China and Hong Kong until further notice. </p><p></p><p>The USPS did not provide any reason for the suspension, but said in a statement that the flow of letters would not be affected.</p><p></p><h1>Closing the De Minimis Loophole</h1><p>The de minimis tax exemption, which allowed Chinese e-commerce giants like Shein and Temu to ship low-cost goods to U.S consumers have faced increased scrutiny in recent years.</p><p></p><p>For decades, the exemption has allowed buyers to not fill out a tiresome custom paperwork or pay a tariffs on small packages. But for years, the U.S has been trying to tackle this provision, which has proven to be a loophole that has been leveraged on by Chinese companies.</p><p></p><div class=\"media-wrap embed-wrap\"><div><blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\">WINNING: THIS IS HUGE<br/><br/>Temu, SHEIN and all these tacky fast fashion companies that sell mostly crap have long relied on an unfair and unwarranted trade advantage.<br/><br/>They have long been beneficiaries of what is called the \"de minimis loophole.\"<br/><br/>This loophole allows goods to be… <a href=\"https://t.co/v7FX9olehH\">https://t.co/v7FX9olehH</a></p>— Melissa Chen (@MsMelChen) <a href=\"https://twitter.com/MsMelChen/status/1886057890676371882?ref_src=twsrc%5Etfw\">February 2, 2025</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p></p><p>Back in September 2024, the Biden administration announced it was cracking down on what it called abuse of the de minimis exemption, saying that over the past decade shipments increased from 140 million a year to over a billion.</p><p></p><p>The exponential increase had made it ever more challenging to enforce trade laws and also put a strain on American workers and business upholding US consumer protections laws and combatting the fentanyl trade.</p><p></p><h1>China strikes back with a tariff of their own</h1><p>In response, China has announced retaliatory tariffs on certain U.S. imports. Beginning Feb. 10, coal and liquefied natural gas (LNG) will be subject to a 15% tariff, while crude oil, agricultural machinery, and large-engine vehicles will face a 10% levy.</p><p></p><div class=\"media-wrap embed-wrap\"><div><blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\">The world on the brink of a new cold War.... <br/><br/>China strikes Back: New tariffs up to 15% on certain US imports in Retaliation for Trump's 10% levy on Chinese goods.. <a href=\"https://t.co/QJfYobeFKP\">pic.twitter.com/QJfYobeFKP</a></p>— Swati Rathore (@symbolofstar) <a href=\"https://twitter.com/symbolofstar/status/1886694513596346825?ref_src=twsrc%5Etfw\">February 4, 2025</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p></p><p>Additionally, China has launched an antitrust probe into Google's Android operating system and is scrutinising chipmakers Nvidia and Intel. </p><p></p><h1>How would customers be affected </h1><p>The de minimis exemption has been the main reason why Chinese goods are so cheap for US customers. According to the research data, the percentage of de minimis imports made in the U.S makes up more than 80% of the total shipments.</p><p></p><p>During the first Trump administration, consumers bore basically 90-100% of the cost of tariffs. So if that similar dynamic exists, consumers could expect a 10% increase if it comes from China.</p><p></p><p>But experts are saying that customs are not equipped to handle this level of change, and it could cause other delays. </p></div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/b57c033416076f6c8889d09aa91a7d00.png",
            "link": "https://www.coinlive.com/news/trump-puts-a-stop-to-cheap-shein-and-temu-hauls",
            "pub_date": "2025-02-05 17:54:58",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 212738,
            "title": "Google Removes Ban on AI for Weapons and Surveillance in New Policy Update",
            "description": "<div class=\"share___SVvtl\"><div><h2>Google Removes AI Weapons and Surveillance Restrictions  </h2><p>Google has recently updated its principles on artificial intelligence, leaving behind previous promises not to use the technology for military or surveillance purposes.  </p><p></p><p>The company’s revised guidelines now focus on the belief that AI should support national security and foster global growth.  </p><p></p><div class=\"media-wrap embed-wrap\"><div><blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\">Google removed a pledge to not build AI for weapons or surveillance from its website this week. The change was first spotted by Bloomberg.<br/><br/>The company appears to have updated its public AI principles page, erasing a section titled “applications we will not pursue,” which was… <a href=\"https://t.co/hMbPziFbD9\">pic.twitter.com/hMbPziFbD9</a></p>— TechCrunch (@TechCrunch) <a href=\"https://twitter.com/TechCrunch/status/1886886110032203926?ref_src=twsrc%5Etfw\">February 4, 2025</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p></p><p>This revision, which removes earlier commitments made by CEO Sundar Pichai in 2018, comes just weeks after tech leaders, including Pichai, attended the inauguration of US President Donald Trump.</p><p></p><h2>Original AI Pledges Abandoned  </h2><p>In 2018, Google made a bold commitment to refrain from using AI for harmful purposes, such as developing weapons or facilitating surveillance that violated international norms.  </p><p></p><p>However, these promises have now been omitted from the latest set of AI principles.  </p><p></p><p>A Google spokesperson pointed to <a href=\"https://blog.google/technology/ai/responsible-ai-2024-report-ongoing-work/\" target=\"\">a blog post where the updated guidelines were shared</a>, but the former restrictions on weapons and surveillance were notably absent.  </p><p></p><p>The company’s statement now reads: </p><p></p><blockquote>\"We believe democracies should lead in AI development, guided by core values like freedom, equality, and respect for human rights.\"  </blockquote><p></p><h2>AI as a Key Tool for Global Cooperation  </h2><p>The new principles emphasise the importance of collaboration between businesses, governments, and organisations that share similar democratic values.  </p><p></p><p>The revised stance asserts that AI can be a force for good, contributing to the protection of people, supporting global economic development, and advancing national security.  </p><p></p><p>Google's senior leaders, Demis Hassabis of DeepMind and James Manyika, argue that these principles are crucial as AI continues to evolve and integrate into everyday life for billions of people around the world.  </p><p></p><h2>Shifting Geopolitical Landscape and AI Progress  </h2><p>The company's original stance against AI in military applications stemmed from employee concerns over Google’s involvement in a Pentagon project that sought to use AI in weapons systems.  </p><p></p><p>In response to internal protests, Google terminated its contract for the project, Project Maven.</p><p></p><div class=\"media-wrap embed-wrap\"><div><blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\">Google employees led a campaign demanding co terminate contract with Pentagon for Project Maven, a program using machine learning for drone strikes. Google caved-- a big win against US militarism that reflects the new political currents in tech industry. <a href=\"https://t.co/tQeyQKHk8v\">https://t.co/tQeyQKHk8v</a></p>— Josh Levine (@JoshConfluence) <a href=\"https://twitter.com/JoshConfluence/status/1004809747873386502?ref_src=twsrc%5Etfw\">June 7, 2018</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p></p><p>Now, the firm is adapting to an increasingly complex geopolitical landscape, where AI plays a critical role in national security.  </p><p></p><p>Hassabis and Manyika <a href=\"https://blog.google/technology/ai/responsible-ai-2024-report-ongoing-work/\" target=\"\">stated in their blog</a>: </p><p></p><blockquote>\"We believe that companies, governments, and organisations sharing these values should work together to create AI that protects people, promotes global growth, and supports national security.\"  </blockquote><p></p><h2>Google's Big Investment in AI Technology  </h2><p>Despite this change in principles, Google is ramping up its investment in AI.  </p><p></p><p>The company has <a href=\"https://www.coinlive.com/news/google-ceo-forecasts-75-billion-in-spending-for-2025-with\" target=\"\">committed $75 billion to AI projects in 2025</a>, a 29% increase from the previous year.  </p><p></p><p>This investment will go toward strengthening AI infrastructure, research, and developing applications, including the AI-powered search features of Google Gemini.</p><p></p><div class=\"media-wrap embed-wrap\"><div><blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\">Google parent Alphabet said it will spend $75 billion on its AI buildout this year, 29% more than Wall Street expected, and investors signaled disappointment at a missed cloud revenue target and began showing impatience over profitability <a href=\"https://t.co/H9v3QdwVMQ\">https://t.co/H9v3QdwVMQ</a><a href=\"https://t.co/iJ3EMTuloq\">pic.twitter.com/iJ3EMTuloq</a></p>— Reuters (@Reuters) <a href=\"https://twitter.com/Reuters/status/1887022091154940187?ref_src=twsrc%5Etfw\">February 5, 2025</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p></p><p>The company’s financial report revealed a 10% revenue rise, with AI being a central part of its future growth strategy.  </p><p></p><h2>A Company in Transition  </h2><p>This change in AI policy shows how Google's approach is evolving, highlighting the increasing role of AI in business and global affairs.</p><p></p><p>The tech giant has previously been criticised by staff for its involvement in military projects, as well as for adopting a more corporate approach after its rebranding to Alphabet in 2015.  </p><p></p><p>The company’s motto, once \"Don’t be evil,\" was replaced with \"Do the right thing\" after restructuring.</p><p></p><p>Despite pushback from employees, particularly in 2018 when Google pulled out of Project Maven, the company’s new AI strategy suggests a more pragmatic view of the technology’s potential, particularly in the context of global competition for AI leadership.  </p><p></p><p>The absence of the previous weapons and surveillance bans signals a new phase in Google's AI development, which could lead to significant changes in the way the company engages with governments and the military.  </p><p></p></div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/0c71bca5cf912bab4580985dc8579859.jpeg",
            "link": "https://www.coinlive.com/news/google-removes-ban-on-ai-for-weapons-and-surveillance-in",
            "pub_date": "2025-02-05 17:40:58",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 212737,
            "title": "The U.S. stock market survived Nvidia's plunge, but failed to survive the tariff threat",
            "description": "<div class=\"share___SVvtl\"><div><p>Source: Barron's Chinese</p><p>The speed with which the new tariffs are arriving is undermining hopes that Trump is using tariffs merely as a negotiating tool.</p><p>Last week, the U.S. stock market was hit by the DeepSeek chatbot, earnings reports from large technology companies, and the Federal Reserve's interest rate meeting. Just when the stock market seemed to have weathered these storms, the tariff threat came.</p><p>The S&amp;P 500 fell 1% last week, which is not a particularly large drop, but the severe impact on artificial intelligence themes and Nvidia (NVDA) stocks - one of the key drivers of the rise in U.S. stocks - should still attract investors' attention.</p><h2><strong>Last week's U.S. stock market trend</strong></h2><p><img src=\"https://img.jinse.cn/7346791_image3.png\"/></p><p>The stock market crash last Monday (January 27) reflects such an anxiety: if DeepSeek can really be comparable to ChatGPT, then the price of artificial intelligence may be much lower than previously expected. That’s a potential boon for users, but a blow to big tech stocks that have poured billions into their projects, and a blow to the idea that the U.S. is ahead of the rest of the world in AI.</p><p>It’s a big shift, though how much of a difference it will make remains to be seen. “We are still shocked that tech investors think DeepSeek will dramatically change the $2 trillion in AI spending expected over the next three years,” Wedbush analyst Dan Ives wrote in a research note.</p><p>Investor focus then almost immediately turned to earnings from Meta Platforms (META), Tesla (TSLA), Apple (AAPL) and Microsoft (MSFT). They did their best to reassure the market, and the first three succeeded, while the last failed. Overall, though, comments from tech company management gave investors some comfort, and many even saw a positive side.  </p><p>While investors are concerned about Silicon Valley's dominance in artificial intelligence, the S&amp;P 500 was essentially flat as of Thursday's close: the index did not fall again to the lows it hit last Monday, with 333 components rising and 169 falling. \"Stable short-term breadth is a sign of strength in the stock market,\" said Ed Clissold, strategist at Ned Davis Research.</p><p><img src=\"https://img.jinse.cn/7346792_image3.png\"/></p><p>Meanwhile, Tom Essaye, president of Sevens Report, pointed out that economic data also performed well. \"The fourth-quarter GDP data was slightly weak, but not particularly weak, consumer spending remained strong, and the U.S. economy was basically in a 'Goldilocks' state,\" he wrote in his research report. The Federal Reserve, which was on the sidelines, announced that it would keep interest rates unchanged after concluding a two-day meeting, which did not have much impact on the stock market. </p><p>All is not calm in Washington, D.C., however, and a sustained stock market rally is never a sure thing. A pleasant rally turned to a decline on Friday when President Donald Trump reiterated that he would impose 25% tariffs on Mexico and Canada.</p><p>Starting on February 4, the United States will impose 25% tariffs on goods imported from Mexico and Canada, 10% tariffs on energy products imported from Canada, and 10% tariffs on China.</p><p>The speed with which the new tariffs have arrived appears to be undermining hopes that Trump will be able to use tariffs as a negotiating tool to any great extent. The new U.S. tariffs have already triggered threats of retaliation from other countries, and Trump has also threatened to impose tariffs on goods imported from the European Union. </p><p>ING economist Inga Fechner wrote in a research note, \"Almost half of U.S. imports will be subject to higher tariffs, which could disrupt supply chains and severely affect the economies of the U.S., Canada and Mexico. Industries such as automotive and manufacturing that are deeply integrated with U.S. supply chains will face rising costs and supply disruptions.\" </p><p>U.S. trade policy is once again dominating the headlines, and it won't stop there, James Reilly, senior market economist at Capital Economics, wrote in a research note. </p><p>Perhaps it's time for investors to leave the market for now. </p><p><mp-style-type></mp-style-type></p></div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/0cb33cdd5439c0370f68e7eaa0024037.jpg",
            "link": "https://www.coinlive.com/news/the-u-s-stock-market-survived-nvidia-s-plunge-but-failed-to",
            "pub_date": "2025-02-05 17:40:37",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 212736,
            "title": "Predictable trade conflicts and unpredictable Web3 settlements",
            "description": "<div class=\"share___SVvtl\"><div><p></p><p>Source: Zuoye Waiboshan</p><p></p><p><span leaf=\"\">I thought that the map opening was only for small islands, but I didn’t expect that the world-class hegemon would follow this old practice; I thought that the ETH L2 ecosystem was chaotic enough, but I didn’t expect that the world trade system has gradually broken down; I thought that Web3 settlement was just a dream, but I didn’t expect that stablecoins have become a new pillar.</span></p><p><span leaf=\"\">On February 1, 2025, Trump began to \"fulfill his promise\" and began to increase tariffs on Mexico and Canada. In addition to Canadian energy products, goods imported from the two countries will increase by an additional 25%.</span></p><p><span leaf=\"\">Although Trump’s style has always been to exert extreme pressure, the final tariffs may not necessarily come true 100%, but once the bow is drawn, there is no turning back. The core economic idea of ​​Trump 2.0 is to replace \"domestic taxes\" with tariffs, so that the United States can return to the good old days without IRS. </span></p><p><span leaf=\"\">Of course, Americans are not stupid enough to believe Trump's rhetoric and really think that increasing tariffs and stabilizing prices can coexist. In the completely deindustrialized United States, all goods are imported products. It's just that from the American temple to the people, they have entered a quasi-wartime state. In order to win the final victory, temporary pain is necessary. </span></p><h2><span leaf=\"\">Crypto War Economy</span></h2><p><span leaf=\"\">After the start of the tariff war 2.0, the crypto market was the first to bear the brunt. Bitcoin fell to 97,000, and the entire market entered a downward cycle, just as fragile as the previous A-share market. </span></p><p><span leaf=\"\">In theory, the crypto market is a global market. Even if you are not optimistic about the US tariff war against the world, there should be a large amount of funds entering the market for risk aversion, but the premise of all this is that the currency circle is indeed a global market. </span></p><p><span leaf=\"\">Unfortunately, the emergence of DeepSeek has broken the stereotype that the U.S. stock market is the global market. If you have a good memory, you will remember that not long ago, when DeepSeek V3 released a technical report on December 26, 2024, the cryptocurrency industry was the first to accept and recognize its advanced nature, earlier than the general public. </span></p><p></p><figure style=\"text-align: center;\"><span leaf=\"\"><img src=\"https://img.jinse.cn/7346787_image3.png\"/></span></figure><figure style=\"text-align: center;\"><span style=\"font-size: 14px;\">Image Description: Overall trend of AI Agent, Image source: Coingecko</span></figure><p></p><p></p><p><span leaf=\"\">AI Agent is still thriving at this time. The real crisis lies in the successive launches of $TRUMP and DeepSeek R1. From January 17 to January 20, in just three days, the world has experienced two waves of shock. The president will really issue currency, and Chinese AI will temporarily lead the United States. </span></p><p><span leaf=\"\">Or to put it this way, this wave of AI Agent narratives in the cryptocurrency circle is based on two premises:</span></p><ol class=\"list-paddingleft-2\"><li><p><span leaf=\"\">American AI is the only one in the world, and AI Agent is first of all Pax Americana AI Agent. OpenAI needs to maintain its lead in algorithms, and Nvidia chips are irreplaceable in hardware;</span></p></li><li><p><span leaf=\"\">AI Agent has not generated real profits, nor has it attracted real users. The liquidity sucked away by $TRUMP will not flow back without thinking. It is still narrative economics, not a PMF product.</span></p></li></ol><p><span leaf=\"\">The world line converges and returns to the trade war.</span></p><p><span leaf=\"\">In the face of the sharp decline of Nvidia and other Magnificent 7 giants in the US stock market, the AI ​​Agent track and the chaos of the Ethereum Foundation and Binance seem insignificant. </span></p><p><span leaf=\"\">Nvidia's chips, the price of Bitcoin, if these are Plan A and B of the US revitalization plan, then they are currently being questioned. The only solution is to rebuild the confidence of the global capital market in the United States. </span></p><p><span leaf=\"\">Tariffs and trade wars will only be the first move. The core is the rise of US stocks and interest rate cuts. The United States needs to cut interest rates to stabilize the economy, but at the same time, as a global financial country, the stock market cannot have any problems, and can only rise but not fall. Therefore, there is only one option, which is the rise of US stocks. </span></p><p><span leaf=\"\">In normal economic theory, these two are not easy to have at the same time, but the magical $TRUMP can bypass the existing fiscal-monetary system, and tariffs and trade wars will create government financial resources in the short term. There is also Musk's layoffs. The remaining funds can only be gathered in the capital market, unless someone really goes to the United States to open a factory. </span></p><p><span leaf=\"\">In this system, the short-term driving force is that tariffs need to work, so it can be inferred that even if Canada compromises with Trump, Trump's tariffs on the world will only intensify. </span></p><p><span leaf=\"\">In the long run, the fiscal role of cryptocurrency will be inevitable, that is, either the US dollar-Federal Reserve system will get rid of its nominal independence and reach a closer political cooperation with Trump, or the Trump administration will continue to use unconventional means to \"command\" the US dollar. </span></p><p><span leaf=\"\">But there is no doubt that for cryptocurrency itself, the current driving force is no longer blockchain technology or decentralized concepts. After all, Vitalik himself admits that he has ultimate control over the Ethereum Foundation. The real master of the currency circle is already a real political force. The largest CEX must stand in line, the issuer and operator of USDT must stand in line, and even every coin trader must make his own choice. </span></p><p><span leaf=\"\">The wartime state has become a reality in 2025. </span></p><h2><span leaf=\"\">Two Worlds</span></h2><p><span leaf=\"\">Looking at the main theme of 2025, the fragmentation of world trade has become a reality. Regionalization has actually replaced the old globalization centered on the United States and based on the WTO mechanism. The only thing left is that the US dollar is still the global currency.</span></p><p><span leaf=\"\">In fact, Trump has repeatedly warned the BRICS countries not to challenge the status of the US dollar, but everyone understands that if the United States does not participate in global trade, it is very strange to use the currency of a non-trading country, but everyone also understands that no country or organization’s currency can challenge the status of the US dollar.</span></p><p><span leaf=\"\">It is rare in the world to be so entangled. </span></p><p><span leaf=\"\">Blockchain technology has been tried. The mBridge project in which the Bank for International Settlements (BIS) participated is one example. It focuses on settlement between CBDCs. The People's Bank of China, the Central Bank of the United Arab Emirates and other central banks and enterprises in many countries and regions have tried it.</span></p><p><span leaf=\"\">However, BIS cannot bridge the divided world. BIS has withdrawn from the mBridge project. The reason is that too many BRICS countries are involved. BIS may be accused by the West of helping Russia and other countries evade sanctions. BIS can only launch the Agorá project. The participants are South Korea, Japan, the European Union and other countries. It is clear at a glance that the East and the West are clearly divided.</span></p><p><span leaf=\"\">Web3 projects also continue to advance. The concept of PayFi has entered a long-term construction stage. Huma Finance hopes to open up cross-border settlement for enterprises in the post-Ripple era. The means can only be stablecoins, but the power of a project is ultimately limited. B2B has become the most mainstream choice, and ordinary people are ultimately out of reach. </span></p><p><span leaf=\"\">Web3 super individuals are at a loss. In the era of CEX explosion, holding Bitcoin, Ethereum, and even BNB can outperform, but in the PVP era, super individuals need to face the super-fast response of robots, the cannibalistic offensive of the currency issuing group, and the unscrupulous PUA of unscrupulous VCs. The old world is gone after all. </span></p><p><span leaf=\"\">Last year, Web3 settlement based on stablecoins may be the biggest trend in the industry, but it is hard to say now. After the AI ​​Agent was shut down, the entire industry entered a boring and lengthy soap opera mode, and began to complain about trivial matters. VCs said that they suffered from 6 times the return, and CEX said that they suffered from the market value of 100 billion and the transaction volume of 100 trillion for the platform currency. </span></p><h2><span leaf=\"\">Conclusion</span></h2><p><span leaf=\"\">There is no real empathy in this world, and humans cannot empathize with their own kind, but before the epic correction of the US stock market, I hope we still have a chance. </span></p><p><span leaf=\"\">From any angle, this DeepSeek surprise attack is just a preview of the next long and tense war. I hope we can be prepared before that. </span></p><p><mp-style-type></mp-style-type></p></div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/5c13b6b58809d3d7fd7139af17d92b81.jpg",
            "link": "https://www.coinlive.com/news/predictable-trade-conflicts-and-unpredictable-web3-settlements",
            "pub_date": "2025-02-05 17:27:42",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 212735,
            "title": "Tether Integrates AI into Finance with “Tether Data,” an AI-Powered SDK Platform with Self-Custodial Tools",
            "description": "<div class=\"share___SVvtl\"><div><h1>AI SDK Platform Introduced to Enhance Crypto Applications</h1><p><a href=\"https://www.coinlive.com/news/tether-and-its-founders-are-relocating-to-el-salvador-to \" target=\"\">Tether</a> is expanding beyond stablecoins with Tether Data, an AI-driven initiative aimed at integrating artificial intelligence (AI) into financial and communication tools. </p><p></p><p>CEO Paolo Ardoino announced the launch of an open-source AI SDK built on Bare, a JavaScript runtime from Holepunch. </p><div class=\"media-wrap embed-wrap\"><div><blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\">Tether Data, AI model training platform preview.<br/><br/>This PaaS will be available to any company interested in (pre-)training own models.<br/>Bonus, at the core of this platform we're leveraging Holepunch's tech for all data-structures to make training and models highly-resilient and… <a href=\"https://t.co/j9PXtP5B2U\">pic.twitter.com/j9PXtP5B2U</a></p>— Paolo Ardoino 🤖🍐 (@paoloardoino) <a href=\"https://twitter.com/paoloardoino/status/1886439714632110348?ref_src=twsrc%5Etfw\">February 3, 2025</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p>Designed for broad compatibility, the SDK supports various hardware—from low-end mobile devices to high-performance servers and embedded systems—enhancing accessibility for AI-powered financial applications. </p><p></p><p>Unlike centralised cloud-based AI models, <a href=\"https://www.coinlive.com/news/tether-and-its-founders-are-relocating-to-el-salvador-to \" target=\"\">Tether </a>Data prioritises privacy and decentralisation by enabling local device processing, reducing reliance on external data servers and minimising risks related to surveillance and data breaches. </p><p></p><h1>Tether Data to Support Multiple Functionalities</h1><p><a href=\"https://www.coinlive.com/news/tether-s-newly-rolled-out-wdk-toolkit-enables-self-custody-wallets-for-ai \" target=\"\">Tether</a>’s AI SDK will enable a range of functionalities, including AI-powered translation, voice assistants, and Bitcoin wallet assistants, all designed to streamline crypto transactions and improve user accessibility. </p><p></p><p>Built on Holepunch’s Bare JavaScript runtime, the platform supports AI-driven applications tailored for financial interactions. </p><div class=\"media-wrap embed-wrap\"><div><blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\">Tether Data, preview of some of the AI apps we're developing: AI translate, AI voice assistant, AI bitcoin wallet assistant.<br/><br/>Tether will launch soon its own AI SDK platform, open-source, built upon Bare (Holepunch's javascript runtime), working on every hardware, from embedded… <a href=\"https://t.co/W5JFmoVcnh\">pic.twitter.com/W5JFmoVcnh</a></p>— Paolo Ardoino 🤖🍐 (@paoloardoino) <a href=\"https://twitter.com/paoloardoino/status/1886793478459330754?ref_src=twsrc%5Etfw\">February 4, 2025</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p>As AI adoption accelerates, industry leaders are addressing its risks—<a href=\"https://www.coinlive.com/news/meta-rolls-out-frontier-ai-framework-to-constrain-high-risk-ai \" target=\"\">Meta, for instance, has introduced the Frontier AI Framework</a>, classifying AI risks as high or critical and imposing development restrictions based on severity. </p><p></p><p>This growing focus on security and governance highlights the challenges of integrating AI into financial ecosystems.</p><p></p><h1>USDT Sees $1B Increase in Market Cap Following Announcement</h1><p>The announcement sparked a surge in cryptocurrency market activity, with <a href=\"https://coinmarketcap.com/currencies/tether/ \" target=\"\">USDT’s market cap rising by $1 billion</a>—from $139.5 billion to $140.52 billion—reflecting growing investor confidence in AI-driven financial innovations. </p><p></p><p>On-chain data showed a sharp increase in active USDT addresses, climbing from 350,000 to 410,000 within hours, signalling heightened engagement within the Tether ecosystem. </p><p></p><p>By integrating AI into its framework, <a href=\"https://www.coinlive.com/news/tether-s-newly-rolled-out-wdk-toolkit-enables-self-custody-wallets-for-ai \" target=\"\">Tether</a> is further bridging the gap between AI and blockchain technology. </p><p></p><p>The AI SDK’s capabilities hint at future advancements in crypto applications, enhancing market analysis and transaction efficiency.</p><p></p><p></p><p></p></div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/1564c320d8e115d815700e1957dbbeee.jpeg",
            "link": "https://www.coinlive.com/news/tether-integrates-ai-into-finance-with-tether-data-an-ai-powered",
            "pub_date": "2025-02-05 17:15:00",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 212733,
            "title": "a16z: What kind of Bitcoin strategic reserve should the United States implement?",
            "description": "<div class=\"share___SVvtl\"><div><p>Source: <a href=\"https://a16zcrypto.com/posts/article/us-crypto-capital-policy/#section--7\" target=\"_self\">a16z crypto editorial \"Making the United States the Capital of Cryptocurrency: What It Takes to Do\"</a></p><p>Author: <em>Christian Catalini</em>, co-founder of Lightspark and MIT Cryptoeconomics Lab</p><p>Translated by: 0xjs@黄金财经</p><p>The United States benefits from what economists call an \"exorbitant privilege.\" As the issuer of the world's reserve currency, it can borrow in its own currency and support new spending. However, this does not mean that it can simply print money - U.S. Treasuries still have to attract buyers on the open market. Fortunately, U.S. debt is widely regarded as the safest asset in the world, ensuring strong demand, especially in times of crisis when investors scramble for safe assets. </p><p>Who profits from this exorbitant privilege? First are U.S. policymakers, who gain extra flexibility in fiscal and monetary decisions. Second are banks - they are at the center of global financial flows, charging fees and exerting influence. But who are the real winners? American companies and multinationals, who are able to conduct much of their business in their own currency and can issue bonds and borrow more cheaply than foreign competitors. Let’s not forget consumers, who enjoy greater purchasing power, lower borrowing costs, and more affordable mortgages and loans. </p><p>The result? The United States can borrow more cheaply, run larger deficits longer, and withstand economic shocks that would cripple other countries. However, <span style=\"color: rgb(0, 112, 192);\"><strong>this exorbitant privilege is not inevitable—it must be earned. It depends on America’s economic, financial, and geopolitical power. Ultimately, the entire system depends on one key factor: trust. Trust in America’s institutions, governance, and military</strong>. And most importantly, trust that the dollar is ultimately still the safest place for global savings. </span></p><p>All of this has a direct impact on the Trump administration’s proposed Bitcoin reserve plan. <strong>Proponents are not wrong about Bitcoin’s long-term strategic role—they’re just premature</strong>. Today, the real opportunity lies not in simply hoarding Bitcoin; it lies in intentionally shaping Bitcoin’s integration into the global financial system in a way that strengthens, not undermines, America’s economic leadership. This means leveraging USD stablecoins and Bitcoin to ensure that the next era of financial infrastructure is one in which America leads — not reacts. Before we get to that, let’s first analyze the role of reserve currencies and the countries that control them. The Rise and Fall of Reserve Currencies History is clear: reserve currencies belong to the world’s economic and geopolitical leaders — until they no longer do. At their peak, dominant nations dictate the rules of trade, finance, and military power, providing global credibility and trust in their currencies. From the Portuguese real in the 15th century to the U.S. dollar in the 20th century, reserve currency issuers shape the markets and institutions that others emulate. But no currency stays on the throne forever. Overreaching—whether through war, expensive expansion, or unsustainable social promises—ultimately erodes credibility. The Spanish real, once backed by vast Latin American silver reserves, depreciated as Spain’s mounting debt and economic mismanagement undermined its dominance. The Dutch guilder also depreciated as relentless warfare drained the Netherlands’ resources. The French franc dominated in the 18th and early 19th centuries but depreciated under the weight of revolution, the Napoleonic wars, and financial mismanagement. And the pound, once a cornerstone of global finance, collapsed under the weight of postwar debt and the rise of American industrial dominance. </p><p><span style=\"color: rgb(0, 112, 192);\"><strong>The lesson is simple: Economic and military strength can create a reserve currency, but financial stability and institutional leadership are what sustain it. Lose that foundation, and the privilege is gone. </strong></span></p><h2><strong>Is the dollar’s ​​reign coming to an end? </strong></h2><p>The answer to that question depends on where you start counting. The dollar cemented its position as the world’s reserve currency around World War II, with the Bretton Woods Agreement, and even earlier, as the United States became the world’s leading creditor after World War I. In any case, the dollar has been dominant for more than 80 years. That’s a long time by historical standards, but not unprecedented—the British pound dominated for about a century before declining. </p><p>Today, some argue that the Pax Americana is unravelling. China’s rapid advances in artificial intelligence, robotics, electric vehicles, and advanced manufacturing signal a shift in power. Beyond that, China also holds significant control over critical minerals necessary to shape our future. Other warning signs are emerging. Marc Andreessen called DeepSeek’s R1 launch America’s AI Sputnik moment—a reminder that American leadership in emerging technologies is no longer guaranteed. Meanwhile, China’s expanding military presence in the air, at sea, and in cyberspace, along with its growing economic influence, raises a pressing question: Is the dollar’s ​​dominance threatened? </p><p><img alt=\"iwRUgD4ung9QI9C6WpgzPnwA7andPbvn7U3OOIQR.png\" src=\"https://img.jinse.cn/7346773_watermarknone.png\" title=\"7346773\"/></p><p style=\"text-align: center;\">Debt as a percent of GDP. Source: IMF</p><p>The short answer: Not yet. Despite rising debt and false propaganda predicting an imminent collapse, the U.S. is not on the verge of a fiscal crisis. Yes, the debt-to-GDP ratio is high, especially after pandemic spending, but it’s in line with other major economies. More importantly, global trade is still largely based on the dollar. The renminbi is closing the gap with the euro in some international settlements, but it is far from replacing the dollar. The real question is not whether the dollar will collapse. It hasn’t collapsed yet. The real concern is whether the United States can maintain its lead in innovation and economic strength. If trust in U.S. institutions declines or the United States loses its competitive advantage in key industries, cracks in the dollar’s ​​dominance may begin to show. Those who are short the dollar are not just market speculators—they are also geopolitical rivals of the United States. This does not mean that fiscal discipline does not matter. It is extremely important. Reducing spending and making government more efficient, through a Department of Government Efficiency (DOGE) or otherwise, would be a welcome shift. Streamlining outdated bureaucracies, removing barriers to entrepreneurship, and promoting innovation and competition would not only reduce wasteful public spending; it would also strengthen the economy and bolster the dollar’s ​​position. </p><p>Combined with the United States’ continued breakthroughs in artificial intelligence, cryptography, robotics, biotechnology, and defense technology, this approach could reflect how the United States regulates and commercializes the Internet—driving a new wave of economic growth and ensuring that the dollar remains the world’s undisputed reserve currency.</p><h2><strong>Can a Bitcoin Reserve Solidify U.S. Financial Leadership?</strong></h2><p>The idea of ​​a strategic Bitcoin reserve is discussed below. Unlike traditional reserve assets, Bitcoin lacks the historical backing of national institutions and geopolitical power. But that’s exactly the point. It represents a new paradigm: no state sponsor, no single point of failure, fully globalized, and politically neutral. Bitcoin offers an alternative that is not constrained by the traditional financial system.</p><p>While many consider Bitcoin a breakthrough in computer science, its true innovation is much more profound: it redefines how economic activity is coordinated and how value moves across borders. Operating as a decentralized, trustless system (and with a single anonymous creator who has no control), the Bitcoin blockchain can serve as a neutral universal ledger—an independent framework for recording global credits and debits without relying on central banks, financial institutions, political alliances, or other intermediaries. This is not only a technological advancement, but also a tectonic shift in how global financial coordination operates.</p><p>This neutrality makes Bitcoin uniquely resilient to the debt crises and political entanglements that have historically unravelled fiat currencies. Unlike traditional monetary systems, which are closely tied to national policies and geopolitical shifts, Bitcoin is not controlled by any single government. This also makes it possible to serve as a common economic language between countries that would otherwise resist financial integration or reject a unified ledger system altogether. For example, the United States and China are unlikely to trust each other’s payment channels – especially as financial sanctions become an increasingly powerful tool of economic warfare.</p><p>So how will these fragmented systems interact? Bitcoin can serve as a bridge: a global, trust-minimized settlement layer that connects otherwise competing economic sectors. When this reality becomes a reality, it would certainly make sense for the United States to hold a strategic Bitcoin reserve.</p><p>But we are not there yet. For Bitcoin to move beyond an investment asset, critical infrastructure must be developed to ensure scalability, a modern compliance framework, and seamless integration with fiat currencies to achieve mainstream adoption. </p><p><span style=\"color: rgb(0, 112, 192);\"><strong>Bitcoin reserve proponents aren’t wrong about its potential long-term strategic role. They’re just premature. </strong></span>Let’s unpack why. </p><h2><strong>Why do countries keep strategic reserves? </strong></h2><p>The reason countries keep strategic reserves is simple: in a crisis, access is more important than price. Oil is the classic example—while futures markets allow price hedging, no amount of financial engineering can replace having physical reserves on hand when supply chains are disrupted by war, geopolitics, or other disruptions. </p><p>The same logic applies to other necessities—natural gas, grains, medical supplies, and, increasingly, raw materials. As the world transitions to battery-driven technology, governments have begun stockpiling lithium, nickel, cobalt, and manganese to prepare for future shortages. </p><p>And then there’s currency. Countries with large foreign debts (often denominated in dollars) hold dollar reserves to facilitate the rollover of debt and guard against domestic currency crises. But here’s the key difference: No country is currently holding a significant amount of debt in Bitcoin — at least not yet.</p><p>Bitcoin proponents argue that Bitcoin’s long-term price action makes it an obvious reserve asset. If the U.S. buys now and continues to adopt, the investment could multiply in value. However, this approach is more in line with the strategy of a sovereign wealth fund, which focuses on capital returns rather than reserves that are critical to national security. It’s more suited to resource-rich but economically unbalanced countries seeking asymmetric financial windfalls, or to countries with weak central banks hoping Bitcoin can stabilize their balance sheets.</p><p>So where does that leave the U.S.? The U.S. doesn’t need Bitcoin to run its economy just yet, and despite President Trump’s recent announcement of a sovereign wealth fund, cryptocurrency investments may still (rightly) be left primarily to private markets for efficient allocation.<span style=\"color: rgb(0, 112, 192);\">The strongest case for Bitcoin reserves is not economic need, but strategic positioning. </span>Holding a reserve could signal that the U.S. is determined to lead in crypto, establish a clear regulatory framework, and position itself as the global hub for DeFi, just as it has dominated traditional finance for decades. However, at this stage, the costs of such a move could outweigh the benefits.</p><h2><strong>Why a Bitcoin Reserve Could Backfire</strong></h2><p><strong>Beyond the logistical challenges of accumulating and securing a Bitcoin reserve, the bigger issue is one of perception, and the costs could be high. At worst, it could signal a lack of confidence in the U.S. government’s ability to sustain its debt, a strategic misstep</strong>handing victory to geopolitical rivals like Russia and China, both of which have long sought to weaken the dollar.</p><p>Not only has Russia pushed for de-dollarization abroad, its state-backed media has for years pushed a narrative that questions the dollar’s ​​stability and predicts its imminent devaluation. Meanwhile, China has taken a more direct approach by expanding the reach of the yuan and digital payments infrastructure—including through a domestically focused digital yuan—to challenge the U.S.-dominated financial system, especially in cross-border trade and payments. In global finance, perceptions matter. Expectations don’t just reflect reality; they help shape it. </p><p><strong><span style=\"color: rgb(0, 112, 192);\">If the U.S. government began hoarding Bitcoin on a massive scale, markets might interpret it as a hedge against the dollar. That perception alone could trigger investors to sell dollars or reallocate capital, undermining the position the U.S. wants to protect. In global finance, beliefs drive behavior. If enough investors begin to doubt the dollar’s ​​stability, their collective actions will turn that doubt into reality. </span></strong></p><p>U.S. monetary policy relies on the Fed’s ability to manage interest rates and inflation. <strong><span style=\"color: rgb(0, 112, 192);\">Holding Bitcoin reserves could send a conflicting message: If the government has confidence in its own economic tools, why would it store assets that the Fed can’t control? </span></strong></p><p>Could Bitcoin reserves alone trigger a dollar crisis? Very unlikely. But it also might not strengthen the system—and in geopolitics and finance, unforced errors are often the most costly. </p><h2><strong>Lead with Strategy, Not Speculation</strong></h2><p>The best way for the United States to reduce its debt-to-GDP ratio is not through speculation, but through fiscal discipline and economic growth. History shows: reserve currencies do not last forever, and those that do depreciate do so due to economic mismanagement and overextension. To avoid following the footsteps of the Spanish real, the Dutch guilder, the French livre, and the British pound, the United States must focus on sustainable economic strength rather than risky financial bets.</p><p><span style=\"color: rgb(0, 112, 192);\"><strong>The United States has the most to lose if Bitcoin becomes the global reserve currency.</strong></span>The transition from dollar dominance to a Bitcoin-based system will not be smooth.<span style=\"color: rgb(0, 112, 192);\">Some believe that a rising Bitcoin value could help the United States “pay down” its debt, but the reality is much harsher. Such a shift would make it much more difficult for the United States to finance its debt and maintain its economic influence.  </span></p><p>While many believe that Bitcoin cannot possibly become a true medium of exchange and unit of account, history suggests otherwise. Gold and silver are valuable not only because they are scarce, but also because they are divisible, durable, and portable, making them effective money—even without sovereign backing or issuance, as Bitcoin is today. Similarly, China’s early paper currency was not a government-mandated medium of exchange. It evolved from commercial promissory notes and certificates of deposit (representing an already trusted store of value) before becoming widely accepted as a medium of exchange.</p><p>Fiat currencies are often viewed as an exception to this pattern—once declared legal tender by a government, they immediately become a medium of exchange and subsequently a store of value. But this oversimplifies reality. Fiat currencies have power not just because of legal decree, but because of the government’s ability to enforce taxation and debt obligations through that power. Money backed by a state with a strong tax base has inherent demand because businesses and individuals need it to pay their debts. This power to tax allows fiat currencies to retain value even without direct commodity backing. </p><p>But even fiat money systems aren’t built from scratch. Historically, their credibility has been underpinned by commodities that people already trust, most notably gold. Paper money gained acceptance precisely because it was once redeemable for gold or silver. Only after that trust had been reinforced for decades did the transition to pure fiat money become feasible.</p><p>Bitcoin is on a similar trajectory. Today, it’s viewed primarily as a store of value—volatile but increasingly viewed as digital gold. However, as adoption grows and financial infrastructure matures, its role as a medium of exchange may follow. History shows that once an asset is widely recognized as a reliable store of value, the transition to effective money is a natural progression.</p><p>For the United States, this presents a significant challenge. While there are some policy levers, Bitcoin operates largely outside of the traditional controls that countries have over their currencies. If it becomes a global medium of exchange, the United States will face a stark reality—reserve currency status is not easily relinquished or shared. </p><p>This doesn’t mean the U.S. should crack down on or ignore Bitcoin—if anything, it should actively participate in and shape its role in the financial system. But buying and holding Bitcoin simply for appreciation isn’t the answer either. <span style=\"color: rgb(0, 112, 192);\">The real opportunity is larger—but also more challenging: promoting Bitcoin’s integration into the global financial system in a way that strengthens, not undermines, America’s economic leadership</span>. </p><h2><strong>Bitcoin Platforms for the U.S.</strong></h2><p>Bitcoin is the most established cryptocurrency, with an unparalleled record of security and decentralization. That makes it the strongest candidate for mainstream adoption, first as a store of value and eventually as a medium of exchange. </p><p>For many, the appeal of Bitcoin is its decentralization and scarcity—factors that drive its price higher as adoption increases. But that’s a narrow view. While Bitcoin’s value will continue to rise as it becomes more popular, the real long-term opportunity for the U.S. lies not just in holding Bitcoin, but in actively shaping its integration into the global financial system and establishing itself as an international hub for Bitcoin finance. </p><p>Simply buying and holding Bitcoin is a perfectly viable strategy for all countries outside the United States—both accelerating adoption and capturing financial upside. But the United States has more at stake and must do more. It needs to take a different approach—not only to maintain its status as the issuer of the world’s reserve currency, but also to enable massive financial innovation on the dollar’s ​​“platform.” </p><p>The key precedent here is the Internet, which transformed the economy by moving information exchange from proprietary to open networks. Today, as the financial rails shift toward a more open and decentralized infrastructure, the U.S. government faces a similar choice to the incumbent governments that predated the Internet. Just as those companies that embraced the Internet’s open architecture flourished and those that resisted eventually became irrelevant, the United States’ attitude toward this shift will determine whether it can maintain its global financial influence or cede ground to other countries. </p><p><span style=\"color: rgb(0, 112, 192);\"><strong>The first pillar of a more ambitious, future-oriented strategy is to treat Bitcoin as a network, not just an asset. </strong></span>As open, permissionless networks drive new financial infrastructure, incumbents must be willing to give up some control. By doing so, however, the United States can unlock significant new opportunities. History shows that those who adapt to disruptive technologies strengthen their position, while those who resist them ultimately lose. </p><p><strong><span style=\"color: rgb(0, 112, 192);\">The second key pillar of Bitcoin is to accelerate the adoption of U.S. dollar stablecoins. </span></strong>With proper regulation, stablecoins can strengthen the public-private partnerships that have underpinned America’s financial dominance for more than a century. <span style=\"color: rgb(0, 112, 192);\"><strong>Stablecoins, far from undermining the dollar’s ​​hegemony, will strengthen it, expanding the dollar’s ​​influence, enhancing its utility, and ensuring its relevance in the digital economy. Moreover, they offer a more agile and flexible solution than slow-moving, bureaucratic central bank digital currencies or ill-defined unified ledger schemes such as the Bank for International Settlements’ “internet of finance.” </strong></span></p><p>But not every country is willing to adopt a dollar stablecoin or operate entirely within the U.S. regulatory framework. Bitcoin plays a key strategic role here—acting as a bridge between core dollar platforms and non-geopolitically aligned economies. In this context, Bitcoin can act as a neutral network and asset, facilitating the flow of funds while strengthening the U.S.’s central position in global finance, thereby preventing it from ceding ground to alternative currencies such as the renminbi. Even if it becomes a pressure-release valve for countries seeking alternatives to the dollar’s ​​hegemony, Bitcoin’s decentralized, open nature ensures that it is closer to the economic and social values ​​of the United States than to those of authoritarian regimes. </p><p>If the U.S. successfully implements this strategy, it will be at the center of Bitcoin financial activity and have greater influence to shape these flows in line with U.S. interests and principles. </p><p>It’s a subtle but viable strategy that, if implemented effectively, will allow the dollar’s ​​influence to last for decades to come. <strong><span style=\"color: rgb(0, 112, 192);\">Rather than simply hoarding Bitcoin reserves (which could indicate concerns about the stability of the dollar), Bitcoin could be strategically integrated into the financial system, driving the development of the dollar and dollar stablecoins on the network, so that the U.S. government becomes an active manager rather than a passive spectator. </span></strong></p><p>What’s the benefit? A more open financial infrastructure, while the U.S. still controls the “killer app” — the dollar. This approach mirrors what companies like Meta and DeepSeek are doing by open-sourcing AI models to set industry standards while monetizing elsewhere. For the U.S., it means expanding the dollar platform to make it interoperable with Bitcoin, ensuring continued relevance in a future where cryptocurrencies play a central role. </p><p>Of course, like any strategy to oppose disruptive innovation, this one has risks. But the cost of resisting innovation is obsolescence. If any administration can do that, it’s the current one — with its deep expertise in platform wars and its clear understanding that staying ahead is not about controlling entire ecosystems but about shaping how value is captured within them.</p></div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/6e48ebc8daef7161c3164f5bb30c8903.jpg",
            "link": "https://www.coinlive.com/news/a16z-what-kind-of-bitcoin-strategic-reserve-should-the-united",
            "pub_date": "2025-02-05 16:51:17",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 212734,
            "title": "Why is this round of Bitcoin bull market so difficult? Is there still a chance?",
            "description": "<div class=\"share___SVvtl\"><div><p></p><p></p><p>Author: Aylo; Translator: Plain Language Blockchain</p><p>First of all, this cycle is indeed difficult, don't let anyone fool you into saying it is not difficult. <strong>But the reality is that each cycle is more difficult than the previous one. The number of market participants is increasing, the competition is getting more and more fierce, the old players are more savvy, and naturally more people fail in the end.</strong></p><p>If you didn't have a large position in BTC or SOL during the bear market, you probably didn't make any money at all, and you might even have gone crazy. If I didn't use SOL to denominate myself, I would probably have a very hard time.</p><p>Yes, there are some individual big winners in this round, but I bet that if you have a large position in these assets, you will probably give back some or even most of your gains in the end. <strong>After all, most people don't stop after a wave of big profits. They always feel that \"the cycle is not over yet\" and want to try again, but the result is that they give back the money they made. </strong></p><p>“Play stupid games, get stupid prizes” This principle always applies, but for traders and gamblers, this process is sometimes prolonged. </p><p><strong>So why is this cycle so difficult? </strong></p><h2><strong>01 Post-Traumatic Stress Disorder (PTSD)</strong></h2><p>In the past two large-scale altcoin cycles, most currencies experienced a 90-95% plunge. The collapse of Luna and FTX exacerbated the chain reaction in the industry, and the market fell more than expected. A large number of heavyweight players were liquidated, and crypto lending platforms have not yet recovered. </p><p>This \"post-traumatic stress disorder (PTSD)\" has deeply affected crypto native users. In this cycle, the trading pattern of the altcoin market largely reflects a mainstream view that \"all projects are scams.\" <strong>In the past two rounds of crypto market cycles, people generally believe that \"this technology represents the future.\" But in the current cycle, this belief has been greatly weakened or even destroyed, and many people no longer believe in the long-term prospects of the crypto industry. Instead, the view that \"everything is a scam\" has become one of the mainstream perceptions. </strong></p><p>No one dares to hold any assets for a long time because they don't want to experience the pain of their assets being halved or even wiped out again. <strong>This has led to an extreme \"Max Jeet Cycle\" - everyone wants to get ahead and treat others as the savior. </strong></p><p>Social media (crypto tweets on X) has exacerbated this emotional trading, and market participants are looking for the top of the cycle every day, causing market sentiment to fluctuate more violently. <br/><img src=\"https://img.jinse.cn/7346778_image3.png\"/><strong>This psychological impact is not only reflected in trading behavior, it also affects the construction and investment methods of the entire ecosystem. </strong>Today, projects face stricter scrutiny and the trust threshold has been greatly increased. This has a dual impact: on the one hand, it helps to screen out obvious scams; on the other hand, it makes it more difficult for truly valuable projects to gain attention and development opportunities. </p><h2><strong>02 </strong><strong>Innovation</strong></h2><p>Current innovation is more iterative, and the infrastructure is constantly being optimized, but there is no disruptive 0→1 breakthrough like when DeFi was born, and there is also a lack of major progress that makes people shine. <strong>This makes it easier for views such as \"there is no substantial progress in the crypto industry\" to resonate, and it also spawns more narratives such as \"the crypto industry has achieved nothing.\" </strong></p><p>The entire innovation landscape has shifted from revolutionary breakthroughs to incremental improvements. Although this is in line with the natural law of any technological development, this change brings new challenges to the narrative-driven market. </p><p><strong>In addition, we still lack real \"killer applications\" - those breakthrough products that can push the scale of on-chain users to hundreds of millions have not yet appeared. </strong></p><h2><strong>03 </strong><strong>Regulation</strong></h2><p>The previously overbearing SEC has caused great chaos in the industry and seriously hindered development. Especially DeFi, which could have attracted a wider range of users and found a market fit (PMF), was strangled and failed to grow further. In addition, the SEC also forcibly prevented all governance tokens from delivering value to holders, ultimately shaping the market narrative that \"these tokens are worthless\", which to some extent did become a reality.</p><p><strong>The SEC not only forced away a large number of developers (for example, Andre Cronje publicly stated that the SEC's suppression made him completely withdraw from the industry), but also blocked the integration of traditional finance (TradFi) and the crypto industry, ultimately forcing the entire industry to rely on venture capital (VC) financing.</strong>This directly led to an imbalance in the supply and demand structure, a distorted price discovery mechanism, and a market value that was firmly controlled by a few institutions.</p><p>However, the market is now ushering in some positive changes. As more and more projects appear in the form of public sales, the crypto industry is gradually breaking the shackles imposed by the SEC. </p><p style=\"text-align: center;\"><img src=\"https://img.jinse.cn/7346779_image3.png\"/><span style=\"font-size: 14px;\">Cronje’s excerpt on his experience with the SEC</span></p><p>Translation: The letters kept coming, each with a new angle of attack. Initially, they were “investigating” me for financing and SEC violations, which was very confusing - after all, I was neither a US citizen nor a US resident, and I had not sold anything to US citizens or residents. <br/>I spent weeks and even months trying to gather information and answer their questions (many of which were data they requested that I simply did not have). This ordeal took a huge toll on my time, energy, and resources. At this stage, I was almost forced to stop development and R&amp;D completely and focus all my attention on this legal and regulatory battle. </p><h2><strong>04 Financial Nihilism</strong></h2><p>The above factors have jointly promoted the prevalence of \"financial nihilism\" in this cycle. The essence of financial nihilism is to lose faith in the market, but have to play. Since you have seen through everything, then speculate to the end, and make a profit. Even if it is betting on Memecoin, it is better than holding it foolishly. </p><p>The narrative of \"useless governance tokens\", coupled with the high FDV and low circulation supply (low float) pattern caused by the SEC, <strong>has made many crypto-native users completely abandon the fantasy of long-term holding and turn to Memecoin to find more \"fair\" opportunities in it. </strong></p><p>In addition, in real society, young people can only rely on gambling-style investment to achieve class transition. Asset prices are soaring, but wages are far behind the endless depreciation of fiat currencies, making Memecoin, a \"crypto-version lottery\", particularly attractive. <strong>The core value of lottery has never been the odds, but the hope it carries, which is why it has always been so popular. </strong></p><p>Because gambling culture has a natural market fit in the crypto market, and related technologies (such as Solana and Pump.fun) are becoming more and more mature, the number of new tokens issued has ushered in explosive growth. <strong>In essence, there is only one core logic to all this - there are a large number of users in the market who are eager for extreme speculation, and demand determines the market. </strong><br/><img src=\"https://img.jinse.cn/7346780_image3.png\"/>The crypto market has always been said to be \"fighting on the front line\", but in this cycle, this concept has been widely recognized.</p><p>This nihilistic investment mentality is reflected in many aspects:</p><p><strong>· </strong>The rise of the so-and-so speculation culture and its entry into the mainstream</p><p><strong>· </strong>The investment cycle is further shortened</p><p><strong>· </strong> strong&gt;Trading behavior is more inclined to short-term speculation rather than long-term investment</p><p><strong>· </strong>The prevalence of extreme leverage and high-risk operations</p><p><strong>· </strong>An \"indifferent\" attitude towards fundamental analysis</p><h2><strong>05 </strong><strong>The experience of past cycles has become an obstacle</strong></h2><p>The past few cycles have taught investors that as long as they buy some altcoins in the bear market, they will eventually gain transcendence BTC's returns. </p><p><img src=\"https://img.jinse.cn/7346781_image3.png\"/></p><p>Almost no one is a naturally good trader, so in past cycles, the safest strategy for most people was to hold on - even the most depressed altcoins will eventually see a wave of increases. </p><p><strong>But this cycle is entirely a trader's market, which is more favorable to sellers than long-term holders. Traders even got the biggest profit opportunity in this cycle through HYPE airdrops. </strong></p><p>The market narratives in this cycle are generally short-lived and lack sufficiently convincing themes. Market participants are more mature than before and are good at extracting value more efficiently, so the local bubble of altcoins has not been blown to the extreme as in the past. </p><p>Using AI agents (Agent) Take the first round of hype for a narrative for example - this may be the first time the market really feels \"this is the new narrative we've been waiting for\". However, it is still very early and the long-term winners may not have really emerged yet. </p><h2><strong>06 </strong><strong>BTC has welcomed new buyers, while altcoins mostly have not</strong></h2><p>The differentiation between Bitcoin and other crypto assets has never been more obvious. </p><p><strong>BTC has successfully attracted buying from traditional finance (TradFi), gaining a strong and sustained source of passive demand for the first time. Even some central banks have begun to discuss adding BTC to their balance sheets. </strong></p><p>In contrast, altcoins are finding it harder than ever to compete with BTC. <strong>This is not difficult to understand - BTC has a clear growth goal in front of it, which is to challenge the market value of gold, while altcoins do not have a similar grand narrative. </strong></p><p>Altcoins have almost no new buyers. Although some retail investors re-entered the market after BTC hit a record high (but they bought XRP), overall, the inflow of new retail funds is still limited, and the negative reputation problem of the crypto industry still exists. </p><h2><strong>07 </strong><strong>The transformation of ETH's role</strong></h2><p>The decline in BTC's market capitalization share is mainly affected by the growth of ETH's market capitalization. </p><p><strong>In past cycles, the rise of ETH was often seen as a signal for the start of the \"altcoin season\", but this rule of thumb did not work in this cycle. </strong>The fundamental reason is that ETH has been performing poorly and has been dragged down by fundamental factors. </p><p><img src=\"https://img.jinse.cn/7346782_image3.png\"/></p><p>Many traders and investors are confused because ETH is no longer the trigger that drives the market to take more risk. Instead, it has become a sign of the end of many mini alt-szn seasons, which is completely different from the market rhythm in the past.</p><p>Although there are already many narratives and tracks that have been independently launched and operated without ETH, many traders still firmly believe that ETH needs to rise to start a real alt season.</p><p>Of course, there are more reasons for market changes, but these are some of the key points that come to my mind first when I drink coffee and empty my mind.</p><p><strong>So, what to do next? Either work harder or smarter.</strong></p><p><strong>I still believe that in the long run, fundamentals will ultimately decide everything.</strong></p><p> But the premise is that you must really understand the projects you support and how they can actually surpass BTC. There are indeed some potential candidates in the market, but the number is still small. You can look for projects with the following characteristics: · Clear profit model · True market fit (PMF) · Sustainable Token economic model · Fundamentals supported by strong narratives (currently, AI and RWA are two areas that meet this standard) I think that with the changes in the US regulatory environment, those projects with strong fundamentals and PMF can eventually deliver value to the token, and these will be relatively more stable investment options. And those protocols that can generate stable income are now in a good development cycle. This is in sharp contrast to the token model dominated by the \"greater fool theory\" in the past. If your strategy is to \"wait for retail investors to enter the market and then smash the market\", then you may be in trouble. The market has evolved and no longer relies solely on retail investors to drive cycles, and smarter funds tend to plan ahead and rush these obvious strategies. </p><p>Possible strategy directions:</p><p><strong>1) Become a better trader</strong></p><p>Try to build a trading advantage and focus on short-term trading, because there are still many stable short-term opportunities in the current market.</p><p>Onchain trading has a higher return multiple, but it is also more volatile and is not suitable for people with poor stress resistance. </p><p><strong>2) The \"barbell portfolio\" still applies (for most people who don't have a clear trading advantage</strong></p><p>70-80% of funds are allocated to BTC &amp; SOL, leaving a small portion of funds for more speculative investments.</p><p>Regularly rebalance to maintain a reasonable asset allocation.</p><p><strong>3) Evaluate your available time and adjust your strategy</strong></p><p>If you are just an ordinary person with a job and can't be in the market all day, then you can't compete with young traders who sit in the trenches and watch the market for 16 hours a day.</p><p>But passively holding underperforming altcoins and waiting for the market to take its turn will not be an effective strategy.</p><p><strong>4) Explore diversified strategies (combine different fields to increase the winning rate)</strong></p><p>Core portfolio (BTC &amp; SOL) + low-risk arbitrage strategies (such as airdrop mining, although the difficulty has increased now, there are still opportunities). </p><p>Pre-position new ecology and occupy a position in the immature ecology, such as HyperLiquid, Movement, Berachain, etc. </p><p>Deepen a niche field and become an expert in that track. </p><h2><strong>08</strong><strong>The altcoin market still has room for growth, but the competition is more intense</strong></h2><p>I still believe that the altcoin market still has room for growth in 2025, and the overall market environment is still affected by the global liquidity cycle. <strong>But only a few tracks and a few projects can really outperform BTC &amp; SOL significantly. Moreover, the pace of altcoin rotation will be faster, which means that investors need to adjust their positions more sensitively. </strong></p><p>If the market really ushers in crazy monetary easing, we <strong>may</strong> see a similar altcoin bull market in the past, but I think the probability of this happening is lower than the probability of not happening. Even if it does happen, the increase of most altcoins is only the market average, and it will not take off as it did in the past. </p><p>There are still a large number of altcoin projects to be launched this year, and market liquidity will still be diluted and dispersed, which requires special attention. </p><h2><strong>09 </strong><strong>Summary: A little hope</strong></h2><p>I have never seen a person who has studied the crypto market seriously for several years and finally failed to make money. </p><p><img src=\"https://img.jinse.cn/7346783_image3.png\"/>There are still many opportunities in the market, and the growth of this field is still worth looking forward to. In the final analysis, I don’t know anything better than others, but I keep adjusting myself according to the actual situation in this cycle. </p><p>One thing is also clear-we are no longer in the early stage of the bull market. Whether you make money or not, the bull market has lasted for a long time, and this fact will not change. </p><p>\"Control the downside risk, and the rise will follow naturally.\" This sentence is always applicable. </p><p><mp-style-type></mp-style-type></p></div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/d4fa7e7217438c0e61c46553250c3823.jpg",
            "link": "https://www.coinlive.com/news/why-is-this-round-of-bitcoin-bull-market-so-difficult",
            "pub_date": "2025-02-05 16:58:46",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        }
    ]
}