{
    "data": [
        {
            "id": 212682,
            "title": "MicroStrategy Stops Buying Bitcoin After 12 Weeks of Aggressive Acquisitions – What’s Behind the Sudden Shift in Strategy?",
            "description": "<div class=\"share___SVvtl\"><div><h2>MicroStrategy Halts Bitcoin Purchases After 12-Week Streak  </h2><p>MicroStrategy, a major player in the business intelligence sector, has paused its Bitcoin buying strategy after 12 consecutive weeks of acquisitions.</p><p></p><p>The company, which holds 471,107 BTC valued in the billions, has not added to its Bitcoin stash in recent days.</p><p></p><div class=\"media-wrap image-wrap\"><img src=\"https://image.coinlive.com/cryptotwits-static/90294f8f086b48277f67513f10f6b23d.png\"/></div><p style=\"text-align:center;\"><em><span style=\"color:#999999\">Source: <a href=\"https://bitcointreasuries.net/entities/microstrategy\" target=\"\">Bitcoin Treasuries</a></span></em></p><p></p><p>This unexpected halt has raised questions about the company's future plans and the reasons behind the shift in its approach.</p><p></p><h2>Market Volatility Behind The Decision  </h2><p>Michael Saylor, the company’s CEO, confirmed that the firm had not sold shares of its Class A common stock or used proceeds from it to purchase more Bitcoin.  </p><p></p><p>The market volatility, marked by fluctuating Bitcoin prices, has prompted caution within the company.  </p><p></p><p>Recent drops, including a sharp decline from $106,400 to $91,530, have likely made MicroStrategy reassess its approach.</p><p></p><p>As the cryptocurrency market faces unpredictability, the firm may be opting for a more measured strategy to protect its large Bitcoin holdings.  </p><p></p><h2>Regulatory and Tax Concerns Come Into Play  </h2><p>The decision to pause Bitcoin acquisitions also points to potential tax implications.  </p><p></p><p>MicroStrategy may be facing significant tax liabilities due to its substantial unrealised profits from Bitcoin.  </p><p></p><div class=\"media-wrap embed-wrap\"><div><blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\">JUST IN: 🇺🇸 MicroStrategy may have to pay federal income taxes on its unrealised <a href=\"https://twitter.com/hashtag/Bitcoin?src=hash&amp;ref_src=twsrc%5Etfw\">#Bitcoin</a> gains of $18 billion - WSJ <a href=\"https://t.co/BS6ywDYaBE\">pic.twitter.com/BS6ywDYaBE</a></p>— Bitcoin Magazine (@BitcoinMagazine) <a href=\"https://twitter.com/BitcoinMagazine/status/1882782972472131627?ref_src=twsrc%5Etfw\">January 24, 2025</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p></p><p>With Bitcoin’s price swings, the company’s assets could lead to a large tax burden if not managed properly.  </p><p></p><p>This has likely added complexity to the firm’s strategy, as it now has to navigate the delicate balance between holding assets that have appreciated in value and addressing potential tax obligations.  </p><p></p><h2>US Tariffs and Broader Economic Factors  </h2><p>The recent increase in US tariffs on China, Mexico, and Canada has further intensified the economic uncertainty surrounding the move.</p><p></p><div class=\"media-wrap embed-wrap\"><div><blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\">The tariffs that President Trump has announced against 3 of the United States’ biggest trading partners—Canada, China, and Mexico—look poised to shatter the era of a rules-based order with global economic ramifications, writes trade expert <a href=\"https://twitter.com/edwardalden?ref_src=twsrc%5Etfw\">@edwardalden</a>. <a href=\"https://t.co/hJ2zFV8mY4\">https://t.co/hJ2zFV8mY4</a></p>— Council on Foreign Relations (@CFR_org) <a href=\"https://twitter.com/CFR_org/status/1886223591353581708?ref_src=twsrc%5Etfw\">February 3, 2025</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p></p><p>These tariffs have contributed to broader market instability, and MicroStrategy may be adopting a more cautious stance to navigate the shifting economic landscape.  </p><p></p><p>With global markets in flux, the company appears to be carefully weighing the risk of further volatility before deciding whether to resume its aggressive Bitcoin strategy.  </p><p></p><h2>Shift In Funding Strategy for Bitcoin Purchases  </h2><p>MicroStrategy has long used proceeds from issuing new stock to fund its Bitcoin purchases.  </p><p></p><p>However, the recent halt in Bitcoin acquisitions signals a shift in this approach.  </p><p></p><p>Without the same level of stock sales to finance new acquisitions, the company may struggle to maintain its aggressive Bitcoin buying strategy.  </p><p></p><p>The pause in purchases may reflect a reassessment of its funding options, as the firm waits for clearer market signals and better financial stability.  </p><p></p><h2>Strategic Pause, Not Permanent Exit  </h2><p>Despite the halt, MicroStrategy has not signalled a permanent end to its Bitcoin buying strategy.  </p><p></p><p>The company’s commitment to Bitcoin as a long-term asset remains intact, but it seems to be taking a break to reassess the market dynamics and its financial standing.  </p><p></p><p>This pause is likely a temporary adjustment while the company deals with market uncertainty, tax implications, and changing economic conditions.  </p><p></p><p>Investors will be keen to see when and how MicroStrategy returns to its Bitcoin accumulation strategy.  </p></div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/294d685214a1e092ef72cf14f0e337f1.jpeg",
            "link": "https://www.coinlive.com/news/microstrategy-stops-buying-bitcoin-after-12-weeks-of-aggressive-acquisitions",
            "pub_date": "2025-02-04 17:55:11",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 212681,
            "title": "Crypto market rebounds V-shaped: Is the bull market still on the way?",
            "description": "<div class=\"share___SVvtl\"><div><p style=\"text-align: left;\">On February 3, the crypto market experienced a waterfall-like decline. Bitcoin once plunged to $91,000, and Ethereum plunged to below $2,100, reaching its lowest level since November. Other altcoins fell even more severely, with an average drop of more than 15%. Just as investors were panicking, funds flowed back during the North American trading session, and the market rebounded in a V-shaped manner. In the early hours of this morning, Bitcoin once hit $102,500, completely recovering yesterday's losses.</p><p style=\"text-align: left;\">Before and after the Spring Festival holiday, Bitcoin has experienced short-term sharp declines many times. But it is worth noting that despite the large decline, Bitcoin has been quickly repaired every time, showing amazing market resilience. </p><p style=\"text-align:center\"><img src=\"https://lh7-rt.googleusercontent.com/docsz/AD_4nXc9FY5xMDwdsVqY661xUiULiB-WDM2takXPp9iJFf5ZF2qA3_aTV4sEZjfjei2Ux0OYui_XE8no7MmftNymeWoT-9kqaSl1yzazPPlGCLorAzyhVP2o1-DPV2BucILw_T7-kWQsqA?key=LrsLQvQP2GZON5t5x7VEGgWz\"/></p><h2 style=\"text-align: left;\">DeepSeek has hit the market hard</h2><p style=\"text-align: left;\">On the eve of the Lunar New Year, the download volume of the domestic AI large model DeepSeek surpassed ChatGPT and topped the US APP Store, attracting the attention and coverage of the global technology, investment industry and media. Because the model is extremely low-cost, but its effect is comparable to that of AI products of American companies such as OpenAI, it has brought great shock to the global market, shaking the foundation of the AI ​​industry that has always believed that \"great effort can produce miracles\". A stone stirs up a thousand waves, and US technology stocks are immediately hit hard. Nvidia's stock price once fell by nearly 17%. The crypto market was also not immune to the impact. Bitcoin and Ethereum also fell by 6% and 7% respectively, and some altcoins lost double digits. However, after the plunge, the market rebounded quickly, and mainstream currencies such as Bitcoin and Ethereum quickly recovered their losses, showing strong market bullish confidence. Trump's tariff policy caused market panic. During the Spring Festival, the tariff stick promised by Trump during his campaign for the US presidency has gradually been implemented in recent days. On February 2, US President Trump signed an order to impose a 25% tariff on Mexican and Canadian imports and a 10% tariff on China. The trade volume between the United States and these three countries is about 1.6 trillion US dollars. The relevant countries have also vowed to take retaliatory actions. The official start of the tariff war has shocked the global financial market.</p><p style=\"text-align: left;\">The market is worried that a full-scale trade war will disrupt the global supply chain, raise inflation, cause the Federal Reserve to raise interest rates again, and drag down the economy. Cryptocurrencies have fallen like waterfalls. Bitcoin once plunged to $91,000, Ethereum plunged to below $2,100, and many altcoins hit an all-time low.</p><p style=\"text-align: left;\">After the great turmoil in the global financial market, Trump said on Monday that after talking with the leaders of Canada and Mexico, he agreed to postpone the plan to impose a 25% tariff on the two neighboring countries for one month and continue negotiations. Market sentiment eased, and the crypto market rebounded in a V-shaped pattern. Bitcoin once reached $102,500, completely recovering yesterday's losses. </p><h2 style=\"text-align: left;\">Is the bull market still on the way? </h2><p style=\"text-align: left;\">During this period, Bitcoin has experienced sharp declines many times. Although each decline can be quickly repaired, these fluctuations are also constantly shaking investors' confidence, making market sentiment increasingly weak, triggering a debate on whether the bull market is still there. Overall, this round of bull market is still sustainable, mainly based on the following points:</p><p style=\"text-align: left;\">1. Tariff policy may only be a negotiating tool. During Trump's first term, tariff policies changed frequently and capriciously, and tariff threats were more of a bargaining chip than a long-term strategy. After Trump announced the imposition of tariffs on Mexico and Canada, the limited decline in technology stocks was a reaction to this. The market believed that Trump's \"false shot\" was intended to allow the Mexican and Canadian governments to crack down on drugs and illegal immigrants entering the United States. Sure enough, the next day, Trump said on social media that Mexico agreed to send 10,000 soldiers to the border to control illegal immigrants and drugs, and Canada would also take corresponding measures. The suspension of the tariff policy once again supported this view. Now it seems that Trump's wishful thinking is going well, and the negotiations with Mexico and Canada have yielded results. </p><p style=\"text-align: left;\">2. Trump's campaign promises are being fulfilled. Trump's crypto-friendly policies are being promoted and have been partially realized, such as the appointment of cryptocurrency-friendly officials and the issuance of executive orders, and the market's most concerned about the national strategic reserve of Bitcoin has also received further news. On Monday, Trump signed an executive order instructing the Treasury and Commerce Departments to submit a plan for a new U.S. sovereign wealth fund within 90 days and establish the fund within the next 12 months. Although Bitcoin was not explicitly mentioned when it was signed, the fund could become a tool for the government to purchase and hold cryptocurrencies. Cynthia Lummis, who first proposed that the United States establish a strategic reserve of Bitcoin and was appointed by the Trump administration as chairperson of the U.S. Senate Banking Subcommittee on Digital Assets, posted on X and used the Bitcoin symbol, implying that it was related to the Bitcoin strategic reserve. 3. Multiple BTC escape indicators did not appear. In every bull market, Bitcoin has shown obvious indicators of escaping the top. None of the 30 indicators currently recognized by the mainstream market, including the rainbow chart, ahr999 and other core indicators, has hit the target. In addition, the tops of all bull markets in history are not flat, but a needle, which does not give retail investors too much time to think. Now Bitcoin has stayed near $100,000 for more than a month, which is usually a sign that the bull market is still continuing. </p><p style=\"text-align:center\"><img src=\"https://lh7-rt.googleusercontent.com/docsz/AD_4nXdwaulWYVC2_QTCGeR6g2Ytmjcib0RUfI3HXJmCH3Bs35axUNgYlvnHUa4LL7A54KpUErWed4h9_3EZMnTnoRQizaDThSp5qDpcV1CSdq99D_1G6Fub_f8SyiWIMyLAb1kuLyRg-Q?key=LrsLQvQP2GZON5t5x7VEGgWz\"/></p><p style=\"text-align: left;\">On the whole, although the market volatility in early 2025 is intense, there are many signs that the current bull market still has the possibility of continuing to rise. Investors should remain cautiously optimistic and pay attention to policy changes and market indicators to cope with possible fluctuations and opportunities. </p><p style=\"text-align:center\"><img src=\"https://lh7-rt.googleusercontent.com/docsz/AD_4nXdy4ck2tzvCxzU9C2nu2svz3sEBmNCZMU1T5ObcrSbIzRlvOR8OSynOcQE0m RHUBVEWgXUQ0EV0W9kXy55XaOLoxJLLR4ET4yyFVkVPyUsaCzUKnn7iPcgVMQJql4PyMdnbR7_Ayg?key=LrsLQvQP2GZON5t5x7VEGgWz\"/></p><p ant-image=\"\" image_preview___3r7dm=\"\" style=\"text-align: As the official partner of the Argentine national team, 4E provides trading services covering more than 600 assets including cryptocurrencies, commodities, stocks, indexes, etc. It also supports financial products with an annualized rate of return of up to 5.5%. Users can invest at any time with one click by holding USDT. In addition, the 4E platform has a risk protection fund of US$100 million, which adds another layer of protection for the safety of users' funds. With 4E, investors can keep up with market trends, flexibly adjust strategies, and seize every potential opportunity.&lt;/p&gt;&lt;/div&gt;&lt;/div&gt;&lt;/div&gt;&lt;div class=\"><img class=\"ant-image-img\" style=\"display:none\"/></p><div class=\"ant-image-mask\" style=\"display:none\"><div class=\"ant-image-mask-info\"><span aria-label=\"eye\" class=\"anticon anticon-eye\" role=\"img\"><svg aria-hidden=\"true\" data-icon=\"eye\" fill=\"currentColor\" focusable=\"false\" height=\"1em\" viewbox=\"64 64 896 896\" width=\"1em\"><path d=\"M942.2 486.2C847.4 286.5 704.1 186 512 186c-192.2 0-335.4 100.5-430.2 300.3a60.3 60.3 0 000 51.5C176.6 737.5 319.9 838 512 838c192.2 0 335.4-100.5 430.2-300.3 7.7-16.2 7.7-35 0-51.5zM512 766c-161.3 0-279.4-81.8-362.7-254C232.6 339.8 350.7 258 512 258c161.3 0 279.4 81.8 362.7 254C791.5 684.2 673.4 766 512 766zm-4-430c-97.2 0-176 78.8-176 176s78.8 176 176 176 176-78.8 176-176-78.8-176-176-176zm0 288c-61.9 0-112-50.1-112-112s50.1-112 112-112 112 50.1 112 112-50.1 112-112 112z\"></path></svg></span>Preview</div></div></div><div class=\"star___3mQoc\"><div class=\"star_content___UUYe1\"><div class=\"star_wrap___ktGLD circle___35Flz\"><span><span class=\"anticon\" role=\"img\" style=\"font-size:28px;color:#a8a8a8\"><svg aria-hidden=\"true\" class=\"\" fill=\"currentColor\" focusable=\"false\" height=\"1em\" width=\"1em\"><use xlink:href=\"#icon-weidianzan\"></use></svg></span></span></div></div></div><div class=\"subscribe___1hFrM\"><span>Gain a broader understanding of the crypto industry through informative reports, and engage in in-depth discussions with other like-minded authors and readers. You are welcome to join us in our growing Coinlive community:</span><a href=\"https://t.me/CoinliveSG\" rel=\"noreferrer\" target=\"_blank\">https://t.me/CoinliveSG</a></div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/f4e74e10ec6f72d4b4b435f6ffc53ee4.jpg",
            "link": "https://www.coinlive.com/news/crypto-market-rebounds-v-shaped-is-the-bull-market-still-on",
            "pub_date": "2025-02-04 17:39:40",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 212680,
            "title": "Meta Rolls Out Frontier AI Framework to Constrain High-Risk AI Systems and Tackle Cybersecurity Threats",
            "description": "<div class=\"share___SVvtl\"><div><h1>Meta Introduces Framework to Restrict High-Risk AI Systems</h1><p><a href=\"https://www.coinlive.com/news/it-s-survival-of-the-fittest-amidst-meta-staff-facing-uncertainty \" target=\"\">Meta </a>has unveiled its Frontier AI Framework, a new policy aimed at addressing the potential dangers of high-risk artificial intelligence (AI) systems, particularly in cybersecurity and biosecurity. </p><p></p><p><a href=\"https://ai.meta.com/static-resource/meta-frontier-ai-framework/?utm_source=newsroom&amp;utm_medium=web&amp;utm_content=Frontier_AI_Framework_PDF&amp;utm_campaign=Our_Approach_to_Frontier_AI_blog \" target=\"\">The company has categorised AI models into two risk levels</a>: high-risk and critical-risk, each defined by the severity of their potential harm. </p><p></p><p>High-risk AI models, which could facilitate cyber or biological attacks, will remain restricted until adequate safeguards are in place. </p><p></p><p>Meanwhile, critical-risk AI—deemed capable of causing catastrophic consequences—will see development halted indefinitely. </p><div class=\"media-wrap embed-wrap\"><div><blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\">Company: Meta<br/>Date: February 3, 2024<br/>Change: Released a responsible scaling policy, called their Frontier AI Framework<br/>URL: <a href=\"https://t.co/OXoXHYMSrC\">https://t.co/OXoXHYMSrC</a></p>— The Midas Project Watchtower (@SafetyChanges) <a href=\"https://twitter.com/SafetyChanges/status/1886543498318344237?ref_src=twsrc%5Etfw\">February 3, 2025</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p><a href=\"https://www.coinlive.com/news/meta-s-free-speech-claims-ring-hollow-as-it-restricts-competitor \" target=\"\">Meta</a>'s strategy prioritises robust internal controls and security measures to prevent unauthorised access, reflecting the company's commitment to reducing the risks associated with advanced AI technology. </p><p></p><p>These moves come in response to growing concerns over AI's impact on data privacy and security.</p><p></p><h1>Robust AI Security Measures to Mitigate Risks</h1><p>Meta will assess AI system risks through a combination of internal and external research, acknowledging that no single test can comprehensively measure risk. </p><p></p><p>Expert evaluation will play a crucial role in decision-making, with a structured review process guided by senior leadership overseeing final risk classifications. </p><p></p><p>For high-risk AI systems, Meta will implement mitigation measures to ensure safe deployment, preventing misuse while preserving the system's intended function. </p><p></p><p>In the case of critical-risk AI models, development will be paused until effective safety protocols are in place to guarantee controlled and secure release. </p><p></p><p>This approach underscores <a href=\"https://www.coinlive.com/news/meta-to-see-big-changes-as-mark-zuckerberg-vows-to \" target=\"\">Meta</a>'s commitment to balancing innovation with responsibility in AI development. </p><div class=\"media-wrap embed-wrap\"><div><blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\">💥 Meta implements new AI security measures<br/><br/>Meta, an American holding company, has introduced (<a href=\"https://t.co/71SlbJOhsB\">https://t.co/71SlbJOhsB</a>) the Frontier AI Framework to regulate the development of high-risk AI.<br/><br/>✅ The company will classify AI models based on their threat level, restricting or… <a href=\"https://t.co/GV0CT4rIgU\">pic.twitter.com/GV0CT4rIgU</a></p>— Traders Union (@TradersUnion_TU) <a href=\"https://twitter.com/TradersUnion_TU/status/1886652187217887442?ref_src=twsrc%5Etfw\">February 4, 2025</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p></p><h1>Meta Addresses Worries, Commits to Transparent AI Development</h1><p>Meta has championed an open approach to AI development, providing widespread access to its Llama models, which has led to millions of downloads and broad adoption. </p><p></p><p>However, this openness has raised concerns about the potential for misuse, including reports of a US adversary leveraging Llama to create a defense chatbot. </p><p></p><p>In response, <a href=\"https://www.coinlive.com/news/meta-ray-ban-glasses-just-levelled-up-with-live-ai-translation \" target=\"\">Meta</a> is introducing the Frontier AI Framework, which aims to balance these risks while continuing to uphold its commitment to accessible, responsible AI innovation. </p><p></p></div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/4d1c30afbff72cbfffd755d60ed254b0.jpeg",
            "link": "https://www.coinlive.com/news/meta-rolls-out-frontier-ai-framework-to-constrain-high-risk-ai",
            "pub_date": "2025-02-04 17:23:34",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 212679,
            "title": "Nicolas Cage Says AI Is a Threat to Film’s Authenticity: ‘We Can’t Let That Happen’",
            "description": "<div class=\"share___SVvtl\"><div><h2>Nicolas Cage Warns Against AI Infiltrating Film Industry  </h2><p>Actor Nicolas Cage has delivered a passionate warning against the growing influence of artificial intelligence in filmmaking, urging fellow actors and creatives to protect the integrity of their craft.  </p><p></p><p>Speaking at the 52nd annual Saturn Awards, where he won Best Actor for his performance in “Dream Scenario”, Cage voiced concerns about AI’s potential to replace human artistry. </p><p></p><div class=\"media-wrap embed-wrap\"><div><blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\">Nicolas Cage says \"protect yourselves from AI.\"<br/><br/>“There is another world that is also disturbing me, and it’s happening right now around all of us — the new AI world. I am a big believer in not letting robots dream for us. Robots cannot reflect the human condition for us. That is… <a href=\"https://t.co/yIjrTn5OrU\">pic.twitter.com/yIjrTn5OrU</a></p>— Variety (@Variety) <a href=\"https://twitter.com/Variety/status/1886262591376466312?ref_src=twsrc%5Etfw\">February 3, 2025</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p></p><h2>AI Should Not Replace Human Creativity  </h2><p>During his acceptance speech, Cage emphasised that AI should never manipulate an actor’s performance, even by the smallest degree.</p><p></p><p>Cage said,</p><p></p><blockquote>\"It’s a dead end if an actor lets one AI robot manipulate his or her performance. An inch will eventually become a mile, and all integrity, purity, and truth of art will be replaced by financial interests only.\"  </blockquote><p></p><p>Cage strongly believes that art, including film performances, should be an expression of the human condition—something he believes AI cannot replicate.  </p><p></p><p>He warned that allowing AI to take over creative processes would strip art of its emotional depth.  </p><p></p><p>He stated,</p><p></p><blockquote>\"If we let robots do that, it will lack all heart and eventually lose edge and turn to mush. It will be life as robots tell us to know it.\"  </blockquote><p></p><h2>Cage’s Fear of AI's Posthumous Use  </h2><p>This isn’t the first time the 61-year-old actor has raised concerns about AI.  </p><p></p><p>Back in July 2024, during an interview with “The New Yorker”, the actor spoke of his \"terror\" over the possibility of AI manipulating his likeness even after his death.  </p><p></p><p>Cage asked,</p><p></p><blockquote>\"What are you going to do with my body and my face when I’m dead? I don’t want you to do anything with it!\"  </blockquote><p></p><div class=\"media-wrap embed-wrap\"><div><blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\">Nicolas Cage is \"terrified\" of AI and does not want his body or face on screen after he's dead. He was digitally scanned for two new projects.<br/><br/>\"What are you going to do with my body and my face when I’m dead? I don’t want you to do anything with it!”<a href=\"https://t.co/QsrkDJJ6sO\">https://t.co/QsrkDJJ6sO</a></p>— Zack Sharf (@ZSharf) <a href=\"https://twitter.com/ZSharf/status/1810435229795934608?ref_src=twsrc%5Etfw\">July 8, 2024</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p></p><p>His remarks were partly triggered by his own experiences with digital manipulation, including a scanned version of himself used for the “Spider-Noir” TV series.  </p><p></p><p>The actor has expressed unease about the idea of his image being used in future projects without his consent.  </p><p></p><h2>A Divided Hollywood on AI’s Role  </h2><p>Hollywood remains deeply divided on the issue of AI in filmmaking.  </p><p></p><p>While Cage advocates for caution, others, such as Tom Hanks, have expressed a more optimistic view.  </p><p></p><p>On “The Adam Buxton Podcast” in May 2023, Hanks suggested that AI could extend an actor's career, allowing them to appear as their younger selves or even star in films posthumously.  </p><p></p><p>Hanks noted, referring to the use of deepfake technology to \"de-age\" him and co-star Robin Wright for the film “Here,” </p><p></p><blockquote>“I could be hit by a bus tomorrow and that’s it, but my performances can go on and on.”</blockquote><p></p><div class=\"media-wrap embed-wrap\"><div><blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\">Tom Hanks weighs in on the future of AI-generated performances: “I could be hit by a bus tomorrow and that’s it, but my performances can go on and on and on.” <a href=\"https://t.co/CE4ocD2HSi\">https://t.co/CE4ocD2HSi</a><a href=\"https://t.co/c3CQoPDftK\">pic.twitter.com/c3CQoPDftK</a></p>— IndieWire (@IndieWire) <a href=\"https://twitter.com/IndieWire/status/1658902705925136385?ref_src=twsrc%5Etfw\">May 17, 2023</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p></p><p>However, actors like Sean Penn have openly criticised the idea of AI recreating their likenesses.  </p><p></p><p>Penn described it as an \"indecent proposal,\" pointing out the moral implications of allowing studios to use AI in such a way.  </p><p></p><p>Penn remarked in September 2023,</p><p></p><blockquote>\"That they would do that and not be taken to task for it is insulting.\"</blockquote><p></p><div class=\"media-wrap embed-wrap\"><div><blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\">Sean Penn on the studios’ AI demands: “It’s an indecent proposal. That they would do that and not be taken to task for it is insulting. This is a real exposé on morality — a lack of morality.” <a href=\"https://t.co/nnSQ736FQm\">https://t.co/nnSQ736FQm</a><a href=\"https://t.co/TqvB5T30uI\">pic.twitter.com/TqvB5T30uI</a></p>— Variety (@Variety) <a href=\"https://twitter.com/Variety/status/1701986594784186537?ref_src=twsrc%5Etfw\">September 13, 2023</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p></p><h2>AI's Presence in Recent Film Productions  </h2><p>The debate around AI in the film industry has escalated, especially after reports that AI technology was used to alter actors’ performances.  </p><p></p><p>In one case, the editing team for the film “The Brutalist” used AI to refine the pronunciation of actors Adrien Brody and Felicity Jones, making them sound like native Hungarian speakers.  </p><p></p><div class=\"media-wrap embed-wrap\"><div><blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\">Brady Corbert says the AI technology from Respeecher was used in ‘THE BRUTALIST’ for “Hungarian language dialogue editing only, specifically to refine certain vowels and letters for accuracy. No English language was changed.”<br/><br/>“This was a manual process, done by our sound team… <a href=\"https://t.co/eKa61Xe9sz\">pic.twitter.com/eKa61Xe9sz</a></p>— DiscussingFilm (@DiscussingFilm) <a href=\"https://twitter.com/DiscussingFilm/status/1881418060696899896?ref_src=twsrc%5Etfw\">January 20, 2025</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p></p><p>While the film, which won three Golden Globes in 2025, has received critical acclaim, its use of AI has sparked significant controversy.  </p><p></p><p>With the 97th Academy Awards approaching, the use of AI in films continues to be a hot topic, raising questions about the future of creativity in an increasingly digital world.</p><p></p><p>What do you think about AI in film? </p><p></p><p>To what extent should it be used, or should it be avoided altogether?</p></div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/f19924f9036156a7e53c9720e5eb4a92.jpeg",
            "link": "https://www.coinlive.com/news/nicolas-cage-says-ai-is-a-threat-to-film-s-authenticity",
            "pub_date": "2025-02-04 16:49:34",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 212678,
            "title": "Russia Implements A National Mining Equipment Registry and Stricter Oversight On Miners, Reflecting Broader Intention Of Integrating Crypto Into Economy",
            "description": "<div class=\"share___SVvtl\"><div><p>Russia’s Ministry of Energy has announced plans to establish a mandatory registry for crypto mining equipment, requiring all mining operations to register their hardware, according to a report from state-owned news agency TASS.</p><p></p><p>Once implemented, unregistered crypto mining would be prohibited, effectively making it “impossible” to operate outside the system, the report stated.</p><p></p><div class=\"media-wrap embed-wrap\"><div><blockquote class=\"twitter-tweet\" data-media-max-width=\"560\"><p dir=\"ltr\" lang=\"en\"><a href=\"https://twitter.com/hashtag/Russia?src=hash&amp;ref_src=twsrc%5Etfw\">#Russia</a>'s new crypto law, signed by President <a href=\"https://twitter.com/hashtag/Putin?src=hash&amp;ref_src=twsrc%5Etfw\">#Putin</a>, tightens government control over digital assets, including strict regulations on crypto mining. Meanwhile, Russia pushes forward with the digital ruble to counter sanctions and lessen US dollar reliance. <a href=\"https://twitter.com/hashtag/CryptoRegulation?src=hash&amp;ref_src=twsrc%5Etfw\">#CryptoRegulation</a>… <a href=\"https://t.co/SjilnI8Fx5\">pic.twitter.com/SjilnI8Fx5</a></p>— Trust Echo (@Sumo76435074) <a href=\"https://twitter.com/Sumo76435074/status/1852984020058927538?ref_src=twsrc%5Etfw\">November 3, 2024</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p></p><p>The initiative, spearheaded by Deputy Minister of Energy Yevgeny Grabchak, is part of proposed amendments to existing mining regulations to refine existing mining regulations and improve oversight. This move is targeted towards the ongoing concerns about illegal mining, particularly in restricted regions. </p><p></p><p>In November 2024, Russian authorities imposed crypto mining bans in six regions, including certain occupied Ukrainian territories. The restrictions, in effect from December 2024 to March 2031, were reportedly introduced to prevent power shortages in these areas.</p><p></p><div class=\"media-wrap embed-wrap\"><div><blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\">Russia bans crypto mining in 10 regions for 6 years, citing energy concerns. With mining consuming massive power globally, is this the start of stricter regulations worldwide? 🌍⚡<a href=\"https://twitter.com/hashtag/CryptoMining?src=hash&amp;ref_src=twsrc%5Etfw\">#CryptoMining</a><a href=\"https://twitter.com/hashtag/energy?src=hash&amp;ref_src=twsrc%5Etfw\">#energy</a><a href=\"https://twitter.com/hashtag/Sustainability?src=hash&amp;ref_src=twsrc%5Etfw\">#Sustainability</a><a href=\"https://t.co/PWJiOGwn6M\">pic.twitter.com/PWJiOGwn6M</a></p>— Metricoid Technology Solutions (@metricoid_tech) <a href=\"https://twitter.com/metricoid_tech/status/1872227537721733391?ref_src=twsrc%5Etfw\">December 26, 2024</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p></p><p>Despite all these regulations, illicit mining in the country is still rampant, and enforcing the law is also proving to be a very difficult task. Nikolai Shulginov, the Chairman of the State of Duma Committee on Energy also acknowledged that restrictions imposed in several Russian regions have done little to curb the spread of unauthorised mining.</p><p></p><h1>New Crypto Mining Tax Framework</h1><p>On top of the registry, crypto miners in Russia are also expected to report their digital currency earnings to the Russian government. Under Russia's updated regulatory framework, digital assets are not considered as a taxable asset.</p><p></p><p>This regulatory framework was put in place by Russian President Vladimir Putin on November 29, 2024, and took effect at the start of this year. Under the framework, miners with annual crypto earnings of up to 2.4 million rubles ($23,976) are taxed at 13%, while those exceeding this threshold are taxed at 15%, according to the Digital Watch Observatory.</p><p></p><div class=\"media-wrap embed-wrap\"><div><blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\">🚨 BREAKING: 🇷🇺 Russia's Parliament Approves Crypto Tax Bill.<br/><br/>⦿ 15% Tax on Crypto Trading/Mining<br/>⦿ No VAT on Crypto Transactions<br/>⦿ Miners Must Report Activity to Government<br/><br/>The bill now awaits President Putin's signature to become law. <a href=\"https://twitter.com/hashtag/Crypto?src=hash&amp;ref_src=twsrc%5Etfw\">#Crypto</a><a href=\"https://twitter.com/hashtag/Bitcoin?src=hash&amp;ref_src=twsrc%5Etfw\">#Bitcoin</a><a href=\"https://t.co/6Jt2BQWa72\">pic.twitter.com/6Jt2BQWa72</a></p>— Crypto India (@CryptooIndia) <a href=\"https://twitter.com/CryptooIndia/status/1862077562035540263?ref_src=twsrc%5Etfw\">November 28, 2024</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p></p><p>These regulatory measures also reflect the country's broader intention of integrating crypto into the economy. This greater regulatory clarity has encouraged businesses and individuals to invest in bitcoin mining and also use bitcoin and stablecoin for their transactions.</p></div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/eccb7dbca83cdc98cf59f36e18261dee.png",
            "link": "https://www.coinlive.com/news/russia-implements-a-national-mining-equipment-registry-and-stricter-oversight",
            "pub_date": "2025-02-04 16:29:56",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 212677,
            "title": "El Salvador Adds 11 More BTC to Its Strategic Reserve, Undeterred by IMF Deal",
            "description": "<div class=\"share___SVvtl\"><div><h2>El Salvador’s Bitcoin Accumulation Strategy Continues Amid IMF Agreement</h2><p>Despite international pressure, El Salvador has maintained its commitment to Bitcoin as part of its broader economic strategy.  </p><p></p><p>In recent weeks, the country has added 50 BTC to its reserves, continuing to expand its holdings even while adapting its policies to meet the conditions of its $1.4 billion loan agreement with the International Monetary Fund (IMF).  </p><p></p><p>With the latest purchase 11 BTC today, El Salvador's total Bitcoin holdings now stand at 6,067.18 BTC, worth nearly $600 million.</p><p></p><div class=\"media-wrap image-wrap\"><img src=\"https://image.coinlive.com/cryptotwits-static/b389dbd2f13210235c5a6859a0f23c29.jpg\"/></div><p></p><h2>Bitcoin Policy Adjustments to Meet IMF Conditions</h2><p>To comply with the IMF’s requirements, El Salvador has made significant adjustments to its Bitcoin policies.  </p><p></p><p>Notably, Bitcoin acceptance is now optional for businesses, and the government has phased out its state-backed Chivo wallet.</p><p></p><p>Tax payments in BTC have also been removed, reflecting a shift in approach towards the cryptocurrency.</p><p></p><div class=\"media-wrap embed-wrap\"><div><blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\">Adios BTC maximalism in El Salvador. <br/><br/>The IMF and El Salvador just signed a new agreement to unlock $1.4bn that Bukele needs. <br/><br/>BTC will no longer be legal tender in El Salvador. Acceptance by the private sector must be voluntary. Taxes only paid in USD, the Chivo wallet to… <a href=\"https://t.co/5SHVKqoSNr\">pic.twitter.com/5SHVKqoSNr</a></p>— Novacula Occami (@OccamiCrypto) <a href=\"https://twitter.com/OccamiCrypto/status/1869488442012250515?ref_src=twsrc%5Etfw\">December 18, 2024</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p></p><p>Despite these changes, the country remains firm in its long-term Bitcoin acquisition plan, which continues to draw attention from the global crypto community.  </p><p></p><p>Stacy Herbert, director of the National Bitcoin Office, has reiterated the government’s commitment to its Bitcoin strategy.  </p><p></p><p>Earlier this year, she signalled the country’s intention to keep increasing its holdings, even amidst regulatory adjustments, by stating, </p><p></p><blockquote>“El Salvador will continue buying bitcoin (at possibly an accelerated pace AND at a discounted price) for its Strategic Bitcoin Reserve.”</blockquote><p></p><h2>El Salvador’s Bitcoin Ambitions in a Changing Landscape</h2><p>El Salvador’s Bitcoin journey began in September 2021 when it became the first country to adopt Bitcoin as legal tender.  </p><p></p><p>President Nayib Bukele’s vision was ambitious. </p><p></p><p>He aimed to encourage 70% of the unbanked population to use Bitcoin, positioning the country as a major global Bitcoin advocate.  </p><p></p><p>Bukele has further pushed for increased Bitcoin acquisitions, even endorsing the policy of purchasing “one Bitcoin a day” for the country’s reserve in 2024.  </p><p></p><p>The country’s Bitcoin investments have earned praise, including from high-profile figures like Tesla CEO Elon Musk, who described the country’s strategy as impressive.  </p><p></p><p>Bukele has been vocal about the potential missed opportunities for individuals who failed to invest in Bitcoin when prices were lower, blaming opposition leaders for hindering broader adoption/</p><p></p><div class=\"media-wrap embed-wrap\"><div><blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\">🇸🇻El Salvador is Bitcoin Country<br/><br/>Verified ✅👇 <a href=\"https://t.co/EKjgStzjPw\">https://t.co/EKjgStzjPw</a></p>— The Bitcoin Office (@bitcoinofficesv) <a href=\"https://twitter.com/bitcoinofficesv/status/1886181144930013468?ref_src=twsrc%5Etfw\">February 2, 2025</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p></p><h2>IMF Concerns Over Bitcoin Risks</h2><p>The IMF has expressed concerns about the risks associated with El Salvador’s Bitcoin adoption, particularly in relation to financial stability.  </p><p></p><p>Although the risks have not fully materialised, the IMF has emphasised the need for greater transparency and stronger efforts to mitigate potential fiscal and financial stability issues arising from the Bitcoin project.  </p><p></p><p>As part of its agreement with the IMF, El Salvador has reduced its Bitcoin-related transactions and activities, making private-sector Bitcoin adoption voluntary.  </p><p></p><p>These steps are part of the broader effort to secure the financial support necessary to implement economic reforms as the country navigates the complexities of its Bitcoin strategy.  </p><p></p><h2>Tether and Crypto Firms Flock to El Salvador</h2><p>El Salvador’s Bitcoin-friendly policies have attracted significant interest from the cryptocurrency sector.  </p><p></p><p>Stablecoin issuer <a href=\"https://www.coinlive.com/news/tether-and-its-founders-are-relocating-to-el-salvador-to\" target=\"\">Tether recently moved its headquarters to the country</a>, highlighting the crypto-friendly regulatory environment under Bukele’s leadership.  </p><p></p><p>This shift signals confidence in El Salvador's evolving stance on digital assets.  </p><p></p><p>In a similar vein, President Bukele has encouraged other major players in the crypto industry, such as Rumble CEO Chris Pavlovski, to consider relocating their businesses to El Salvador. </p><p></p><div class=\"media-wrap embed-wrap\"><div><blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\">You should move your headquarters here too 🤷🏻‍♂️ <a href=\"https://t.co/4vPPXO1z3G\">https://t.co/4vPPXO1z3G</a></p>— Nayib Bukele (@nayibbukele) <a href=\"https://twitter.com/nayibbukele/status/1878892217185767638?ref_src=twsrc%5Etfw\">January 13, 2025</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p></p><p>These moves reflect the country’s appeal as a growing hub for cryptocurrency-related businesses.  </p><p></p><h2>Poland Overtakes El Salvador in Crypto ATM Expansion</h2><p>While El Salvador remains a leader in Bitcoin adoption, it now faces competition in the field of cryptocurrency infrastructure.  </p><p></p><p>Poland recently surpassed El Salvador in terms of Bitcoin ATM installations.  </p><p></p><p>On 27 January, Poland added 10 new Bitcoin ATMs, bringing its total to 219 active machines, making it the fifth-largest cryptocurrency ATM network globally, just behind the United States, Canada, Australia, and Spain.  </p><p></p><p>El Salvador, once a standout in crypto ATM deployments, has been overtaken in recent months as Poland continues to expand its crypto ATM network.</p><p></p><div class=\"media-wrap embed-wrap\"><div><blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\">🇵🇱 NEW: Poland surpasses El Salvador to become the 5th-largest <a href=\"https://twitter.com/hashtag/Bitcoin?src=hash&amp;ref_src=twsrc%5Etfw\">#Bitcoin</a> ATM hub globally, with 219 active machines after a 4-month installation spree. <a href=\"https://t.co/MNdN8FLfah\">pic.twitter.com/MNdN8FLfah</a></p>— Cointelegraph (@Cointelegraph) <a href=\"https://twitter.com/Cointelegraph/status/1883838865846288591?ref_src=twsrc%5Etfw\">January 27, 2025</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p></p><p>Nevertheless, El Salvador’s regulatory stance continues to attract significant attention from the global crypto community, particularly from industry leaders seeking a stable and supportive environment for digital asset development.</p></div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/ce3b20b1f762930ee601c67d281c6bca.jpeg",
            "link": "https://www.coinlive.com/news/el-salvador-adds-11-more-btc-to-its-strategic-reserve",
            "pub_date": "2025-02-04 15:31:30",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 212676,
            "title": "Crypto Rally Follows Trump’s Delay of Canada and Mexico Tariffs but Negotiations Still Ongoing",
            "description": "<div class=\"share___SVvtl\"><div><h1>Trump Halts Canada &amp; Mexico Tariffs Following Phone Call</h1><p>Crypto markets surged after President Donald Trump temporarily paused proposed <a href=\"https://www.coinlive.com/news/trump-s-war-on-tariffs-sees-bitcoin-still-bleeding-red-as \" target=\"\">tariffs on Canada and Mexico </a>amidst ongoing negotiations. </p><p></p><p>In a 3 February statement on<a href=\"https://www.coinlive.com/news/Tweetocalypse-or-X-citing-Changes-Elon-Musk-Rebrands-Twitter-to \" target=\"\"> X (formerly known as Twitter), </a>Canadian Prime Minister Justin Trudeau confirmed a 30-day suspension following a call with Trump. </p><p></p><p>He pledged to strengthen US-Canada coordination with a $1.3 billion border plan, appoint a Fentanyl czar, classify cartels as terrorist organisations, and deploy helicopters and additional personnel. </p><div class=\"media-wrap embed-wrap\"><div><blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\">I just had a good call with President Trump. Canada is implementing our $1.3 billion border plan — reinforcing the border with new choppers, technology and personnel, enhanced coordination with our American partners, and increased resources to stop the flow of fentanyl. Nearly…</p>— Justin Trudeau (@JustinTrudeau) <a href=\"https://twitter.com/JustinTrudeau/status/1886529228193022429?ref_src=twsrc%5Etfw\">February 3, 2025</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p>Mexico’s tariffs were also paused for a month, with President Claudia Sheinbaum announcing new agreements to reinforce border security. </p><p></p><p>Sheinbaum said:</p><blockquote>“Our teams will begin working today on two fronts: security and trade. They are pausing tariffs for one month from now.”</blockquote><div class=\"media-wrap embed-wrap\"><div><blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"es\">Sostuvimos una buena conversación con el presidente Trump con mucho respeto a nuestra relación y la soberanía; llegamos a una serie de acuerdos:<br/><br/>1.México reforzará la frontera norte con 10 mil elementos de la Guardia Nacional de forma inmediata, para evitar el tráfico de drogas…</p>— Claudia Sheinbaum Pardo (@Claudiashein) <a href=\"https://twitter.com/Claudiashein/status/1886434747238514776?ref_src=twsrc%5Etfw\">February 3, 2025</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p>However, in a Bloomberg TV interview the same day, Trump stated that a final deal with Mexico had not been reached and <a href=\"https://www.coinlive.com/news/trump-s-war-on-tariffs-sees-bitcoin-still-bleeding-red-as \" target=\"\">tariffs</a> could still take effect. </p><p></p><p>On Truth Social, Trump also posted about the phone call between Trudeau and Sheinbaum.</p><div class=\"media-wrap embed-wrap\"><div><iframe allowfullscreen=\"allowfullscreen\" class=\"truthsocial-embed\" src=\"https://truthsocial.com/@realDonaldTrump/113940711907400754/embed\" style=\"max-width: 100%; border: 0\" width=\"600\"></iframe><script async=\"async\" src=\"https://truthsocial.com/embed.js\"></script></div></div><p></p><div class=\"media-wrap embed-wrap\"><div><iframe allowfullscreen=\"allowfullscreen\" class=\"truthsocial-embed\" src=\"https://truthsocial.com/@realDonaldTrump/113942189236610107/embed\" style=\"max-width: 100%; border: 0\" width=\"600\"></iframe><script async=\"async\" src=\"https://truthsocial.com/embed.js\"></script></div></div><p></p><h1>Crypto Market Rebounds, Stops Bleeding Red</h1><p>The crypto market is rallying following major policy announcements by world leaders. </p><p></p><p>Bitcoin has surged past the $100,000 mark, now trading at $99,429.16—up 5.81% in the last 24 hours after hitting a low of $92,000 the previous day, <a href=\"https://coinmarketcap.com/currencies/bitcoin/ \" target=\"\">according to CoinMarketCap. </a></p><p></p><p><a href=\"https://coinmarketcap.com/currencies/ethereum/ \" target=\"\">Ether</a> has also rebounded, climbing 7.88% to $2,728.14 after dipping to $2,451 on 2 February. </p><div class=\"media-wrap embed-wrap\"><div><blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\">The crypto market is recovering after a sharp decline. <a href=\"https://twitter.com/search?q=%24BTC&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$BTC</a> has surged past $101,000, and altcoins like <a href=\"https://twitter.com/search?q=%24ETH&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$ETH</a> and <a href=\"https://twitter.com/search?q=%24SOL&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$SOL</a> have seen gains of 10-20%. <a href=\"https://t.co/0kDcYurFd7\">pic.twitter.com/0kDcYurFd7</a></p>— Alerts Via Web3 (@AlertsViaWeb3) <a href=\"https://twitter.com/AlertsViaWeb3/status/1886656164672467203?ref_src=twsrc%5Etfw\">February 4, 2025</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p>Pav Hundal, lead market analyst at crypto exchange Swyftx, sees the recent developments as a potential catalyst for new all-time highs. </p><p></p><p>He noted that yesterday’s outflows were driven by uncertainty, but the <a href=\"https://www.coinlive.com/news/trump-s-war-on-tariffs-sees-bitcoin-still-bleeding-red-as \" target=\"\">tariff</a> pause has shifted investor sentiment from cautious to optimistic, fuelling a “complete recovery in many digital assets.” </p><p></p><p>He noted:</p><blockquote>“If the shadow of tariffs continues to recede, and it is a big 'if,’ all you’re really left with is good news and economic data that you can at least hedge against.”</blockquote><p>He added:</p><blockquote>“I like Bitcoin’s chances of hitting new all-time highs very quickly in a world where the tariff threat is low, and the US policy environment is so accommodating.”</blockquote><p>Sean Dawson, head of research at Derive.xyz, believes the pause on tariffs and a new executive order to establish a US sovereign wealth fund could further support a rebound.</p><p></p><p>He expressed:</p><blockquote>“Trump’s Executive Order to establish a sovereign wealth fund under the Treasury and Commerce departments could signal bullish sentiment for the digital asset space. This is particularly relevant as Commerce Secretary nominee Howard Lutnick has been a strong advocate for the industry.”</blockquote><p>Meanwhile, Chris Chung, founder of Solana swap platform Titan, dismissed concerns over<a href=\"https://www.coinlive.com/news/president-donald-trump-ruffles-international-feathers-eyes-10-tariffs-on \" target=\"\"> tariffs</a>, arguing the market overreacted since “digital transactions aren’t tariffed.” </p><p></p><p>In the long run, if tariffs persist, he expects they will drive more capital into crypto, given the industry’s deep ties to the US dollar.</p><p></p><p>He pointed out:</p><blockquote>“As people’s home currencies, like the Canadian dollar, plummet against the US dollar, we will see more inflows into both USD-denominated stablecoins and crypto assets like Bitcoin and altcoins. And if the tariffs cause inflation, as many fear they will, then even US investors will seek refuge in cryptocurrency.\"</blockquote><p></p><p></p><p></p><p></p></div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/717638108ea2fd38683f36d80e9600eb.jpeg",
            "link": "https://www.coinlive.com/news/crypto-rally-follows-trump-s-delay-of-canada-and-mexico-tariffs",
            "pub_date": "2025-02-04 15:45:00",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 212675,
            "title": "South Korea’s Bitcoin Kimchi Premium Hits Three-Year High Amid Trump's Tariff Tantrums",
            "description": "<div class=\"share___SVvtl\"><div><p>South Korea’s bitcoin kimchi premium surged to a three year high as BTC prices on local exchanges remained relatively stable despite a broader crypto market downturn.</p><p></p><p>The term \"Kimchi Premium\" comes from the popular Korean dish Kimchi, which is basically a fermented cabbage dish. Premium refers to a situation where a digital currency is priced higher on one exchange compared on others, which is a common occurrence on the South Korean exchanges, which gives birth to the term Kimchi premium.</p><p></p><div class=\"media-wrap embed-wrap\"><div><blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\"><a href=\"https://twitter.com/hashtag/Bitcoin?src=hash&amp;ref_src=twsrc%5Etfw\">#Bitcoin</a> Kimchi Premium is 12% right now—a three-year high. The main reason for BTC drop seems to be the strong DXY. <a href=\"https://t.co/fjFOyUH5Pr\">pic.twitter.com/fjFOyUH5Pr</a></p>— Ki Young Ju (@ki_young_ju) <a href=\"https://twitter.com/ki_young_ju/status/1886270544192192963?ref_src=twsrc%5Etfw\">February 3, 2025</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p></p><p>According to data from CryptoQuant, the kimchi premium reached 9.7% for bitcoin at around 2 a.m. on Monday in South Korea. This marks the highest premium since April 14, 2024, when it exceeded 13%. At the time of writing, it has slightly declined to 8.24%.</p><p></p><h1>The Kimchi Premium phenomenon that only happens in Korea?</h1><p>The kimchi premium, the term referring to the phenomenon where Bitcoin trades at a higher rate on South Korean exchanges compared to the global markets.</p><p></p><p>You might think that investors could benefit from the arbitrage, but it is harder than you think because of South Korea's capital controls, which prevent foreign investors from directly accessing local exchanges. Additionally, South Korean investors who are caught trying to profit from the difference prices from the different exchanges could also face potential regulatory penalties. </p><p></p><div class=\"media-wrap embed-wrap\"><div><blockquote class=\"twitter-tweet\" data-media-max-width=\"560\"><p dir=\"ltr\" lang=\"en\">The \"kimchi premium\" refers to the difference in <a href=\"https://twitter.com/search?q=%24BTC&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$BTC</a> prices on Korean exchanges compared to global exchanges — and bitcoin is currently trading at a 10% premium in South Korea. <br/><br/>Watch \"Chart of the Day\" explain, presented by <a href=\"https://twitter.com/cryptocom?ref_src=twsrc%5Etfw\">@cryptocom</a>: <a href=\"https://t.co/hIDNlSMGvL\">https://t.co/hIDNlSMGvL</a><a href=\"https://t.co/vjn345KPnQ\">pic.twitter.com/vjn345KPnQ</a></p>— CoinDesk (@CoinDesk) <a href=\"https://twitter.com/CoinDesk/status/1765899165576356208?ref_src=twsrc%5Etfw\">March 8, 2024</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p></p><p>“The Kimchi Premium typically rises during bull markets when Korean investors bid higher, but it can also spike during periods of panic selling,” said Presto Research Analyst Min Jung. “This happens when selling pressure on Korean exchanges is lower than in global markets.”</p><p></p><p>The rise in bitcoin prices in Korea also currently facing is also partially a result of the tariffs that President Trump is imposing on Canada, Mexico and China, which is making investors to flock to bitcoin during this time of economic instability. </p><p></p><h1>Where is bitcoin heading to next?</h1><p>Blockchain researchers have also noted that the premium went up not because Korean traders were buying the dip, but because the cryptocurrency was being converted into U.S dollars. This suggests that investors were offloading their holdings in response to broader market pressures rather than accumulating bitcoin. </p><p></p><p>The U.S dollar has strengthened significantly in recent times, adding downward pressure on the price of BTC. As a result, many traders in South Korea have responded by shifting their coins into USD instead of the Korean Won, inadvertently contributing to the growing gap in bitcoin's prices between Korean and international exchanges.</p><p></p><p>According to Coinglass data, the crypto market has witnessed over $2.1 billion in liquidations in the past 24 hours. Experts believe that if the selling pressures of U.S investors continue to pile up, the premium phenomenon would continue to balloon.</p><p></p><p>Despite strict regulatory oversight, South Korea remains one of the most active crypto markets globally, with a strong emphasis on altcoin trading. According to The Block’s data dashboard, Upbit, South Korea’s largest exchange, ranked as the fourth-largest centralized exchange by monthly trading volume, processing over $187 billion in transactions in January.</p></div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/ff52f8ae9893116c86cd55a2d4eaa768.png",
            "link": "https://www.coinlive.com/news/south-korea-s-bitcoin-kimchi-premium-hits-three-year-high-amid-trump-s",
            "pub_date": "2025-02-04 15:14:32",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 212674,
            "title": "WLFI is not a presidential election: it just collects advertising fees",
            "description": "<div class=\"share___SVvtl\"><div><p style=\"text-align: left;\">Author: Observer Lao Wang; Source: C Labs Crypto Observation</p><p style=\"text-align: left;\">In addition to widely recognized applications such as stablecoins, the essence of most cryptocurrencies is actually the monetization of influence. </p><p style=\"text-align: left;\">From some of Trump's operations, his family has a deep understanding of this nature~</p><p style=\"text-align:center\"><img src=\"https://img.jinse.cn/7344486_image3.png\"/></p><p style=\"text-align: left;\">In addition to the $Trump token as an \"electronic souvenir\", the so-called \"Presidential Strict Selection\" WLFI is the long-term cash cow. The daily person in charge of this product is Trump's second son Eric:</p><p style=\"text-align:center\"><img src=\"https://img.jinse.cn/7346662_image3.png\"/></p><p style=\"text-align: left;\">This Eric also played a trick. After sending a tweet last night that he was optimistic about Ethereum in the long term, he liquidated Ethereum:</p><p style=\"text-align:center\"><img src=\"https://img.jinse.cn/7346663_image3.png\"/></p><p style=\"text-align: left;\">So is Eric admitting his loss? </p><p style=\"text-align: left;\">Since the establishment of the \"Presidential Strict Selection\" position, some people have calculated that the floating loss has exceeded 15%. In fact, WLFI has never lost money. </p><p style=\"text-align: left;\">Because these \"strict selections\" are essentially advertising fees. </p><p style=\"text-align: left;\">Because as long as a big investor buys $10 million of $WLFI, then he can buy a token designated by the project party. </p><p style=\"text-align: left;\">And the current agreement of $WLFI cannot be traded, only voting rights, which are not transferable. It can be considered as the Pixiu plate opened by Trump's family. </p><p style=\"text-align:center\"><img src=\"https://img.jinse.cn/7346664_image3.png\"/></p><p style=\"text-align: left;\">As for the purchase amount, the maximum is 40% of the purchase amount of $WLFI. </p><p style=\"text-align: left;\">Therefore, the essence of the Ethereum community's crazy increase in Ethereum positions due to \"Presidential Strict Selection\" some time ago is that Ethereum dealers bought more $WLFI:</p><p style=\"text-align:center\"><img src=\"https://img.jinse.cn/7346665_image3.png\"/></p><p style=\"text-align: left;\">After this wave of clearing Ethereum, the largest position of \"Presidential Strict Selection\" became Sun Yuchen's TRX. </p><p style=\"text-align: left;\">And before that, Justin Sun had announced that he had purchased $75 million of WLFI in two installments:</p><p style=\"text-align:center\"><img src=\"https://img.jinse.cn/7346666_image3.png\"/></p><p style=\"text-align: left;\">These two purchases are likely to have one designated TRX and one designated ETH. </p><p style=\"text-align: left;\">After all, Justin Sun also holds a large amount of Ethereum and needs to ship it. Similar to Eric's operation this time, Sun Ge has already operated it once two months ago~</p><p style=\"text-align:center\"><img src=\"https://img.jinse.cn/7346667_image3.png\"/></p><p style=\"text-align: left;\">So friends in the crypto circle should gradually cultivate their own cognition, and don't trust the big V to bring goods!</p><p style=\"text-align: left;\">Finally, a warm reminder that other tokens such as aave/link are all on the upper-level relationship route. There are many official announcements of cooperation, but basically no one uses the products that have landed.</p><p style=\"text-align: left;\">That's all, everyone should learn from it~</p></div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/6330e2ca1916605c8df88a2f4f10f515.jpg",
            "link": "https://www.coinlive.com/news/wlfi-is-not-a-presidential-election-it-just-collects-advertising",
            "pub_date": "2025-02-04 14:56:28",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 212673,
            "title": "Elon Musk Kicks Off X Spaces for D.O.G.E, Details USAID Termination Plan Backed by Trump: Is the Duo on a Warpath?",
            "description": "<div class=\"share___SVvtl\"><div><h1>Elon Shares D.O.G.E Plan on X Spaces </h1><p>Elon Musk’s 50-minute X Spaces session on Monday was a revealing glimpse into his ambitious plans, presented with clarity and President Donald Trump’s backing. </p><p></p><p>Joined by Republican senators Joni Ernst and Mike Lee, and <a href=\"https://www.coinlive.com/news/elon-musk-and-vivek-ramaswamy-roll-out-daring-d-o-g-e-plan \" target=\"\">former D.O.G.E co-lead Vivek Ramaswamy</a>, Musk outlined his bold strategy to reduce federal spending and overhaul regulations. </p><p></p><p>His primary focus is dismantling the US Agency for International Development (USAID), which he believes is beyond redemption, and consolidating its effective parts under the State Department. </p><div class=\"media-wrap embed-wrap\"><div><blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\">First DOGE 𝕏 Spaces Conversation with <a href=\"https://twitter.com/elonmusk?ref_src=twsrc%5Etfw\">@ElonMusk</a>, <a href=\"https://twitter.com/VivekGRamaswamy?ref_src=twsrc%5Etfw\">@VivekGRamaswamy</a> and <a href=\"https://twitter.com/SenJoniErnst?ref_src=twsrc%5Etfw\">@SenJoniErnst</a><br/><br/>Live Now<a href=\"https://t.co/A2mw1KCs8Q\">https://t.co/A2mw1KCs8Q</a></p>— Department of Government Efficiency (@DOGE) <a href=\"https://twitter.com/DOGE/status/1886284966855647234?ref_src=twsrc%5Etfw\">February 3, 2025</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p>Musk’s vision extends to taking control of government payment systems via <a href=\"https://www.coinlive.com/news/department-of-government-efficiency-flooded-with-relentless-lawsuits-will-solo \" target=\"\">D.O.G.E, the Department of Government Efficiency,</a> which he described as a \"wholesale spring cleaning of regulation.\" </p><p></p><p>With a clear sense of purpose, Musk aims to streamline federal operations and eliminate inefficiencies.</p><p></p><p>Musk noted:</p><blockquote>“It’s not an apple with a worm in it. It’s a ball of worms. You’ve got to basically get rid of the whole thing.”</blockquote><p></p><h1>USAID Termination Plan is Fully Backed by Trump</h1><p>During the X Spaces session, Musk revealed that he had personally discussed the shutdown of USAID with Trump, who confirmed his full support for the plan. </p><p></p><p>The Tesla CEO said:</p><blockquote>“I actually checked with him a few times—‘Are you sure?’ Like, ‘yes,’ so we’re shutting it down.” </blockquote><p>In a statement to reporters on Sunday, Trump expressed his \"full confidence\" in Musk, praising him as \"very smart\" and committed to reducing federal government spending. </p><div class=\"media-wrap embed-wrap\"><div><blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\">President Donald Trump on USAID: “I love the concept, but they turned out to be radical left lunatics. The concept of it is good but it's all about the people.”<br/><br/> <a href=\"https://t.co/E8GeO2Kl32\">pic.twitter.com/E8GeO2Kl32</a></p>— America (@america) <a href=\"https://twitter.com/america/status/1886495823539601818?ref_src=twsrc%5Etfw\">February 3, 2025</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p>Over the weekend, <a href=\"https://www.coinlive.com/news/department-of-government-efficiency-flooded-with-relentless-lawsuits-will-solo \" target=\"\">Musk’s D.O.G.E team</a> took decisive action—firing key officials at USAID, seizing control of Treasury payment systems, and freezing billions of dollars in foreign aid managed by the agency. </p><p></p><p>As a result, USAID’s website went offline globally, prompting the Trump administration to launch a comprehensive review of US foreign aid. </p><div class=\"media-wrap embed-wrap\"><div><blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\">Because USAID is/was a radical-left political psy op <a href=\"https://t.co/Th10uk7dQe\">https://t.co/Th10uk7dQe</a></p>— Elon Musk (@elonmusk) <a href=\"https://twitter.com/elonmusk/status/1886449983483748472?ref_src=twsrc%5Etfw\">February 3, 2025</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p>Musk expressed: </p><blockquote>“If we really need it again, we’ll just build something better.”</blockquote><p><a href=\"https://www.coinlive.com/news/elon-musk-and-vivek-ramaswamy-roll-out-daring-d-o-g-e-plan \" target=\"\">D.O.G.E</a> engineer Gavin Kliger sent an internal email to USAID staff announcing the imminent shutdown of its headquarters, leaving employees stunned. </p><div class=\"media-wrap embed-wrap\"><div><blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\">All <a href=\"https://twitter.com/DOGE?ref_src=twsrc%5Etfw\">@DOGE</a> did was check to see which federal organizations were violating the <a href=\"https://twitter.com/POTUS?ref_src=twsrc%5Etfw\">@POTUS</a> executive orders the most. <br/><br/>Turned out to be USAID, so that became our focus. <a href=\"https://t.co/26FXTFFlLJ\">https://t.co/26FXTFFlLJ</a></p>— Elon Musk (@elonmusk) <a href=\"https://twitter.com/elonmusk/status/1886627783138316442?ref_src=twsrc%5Etfw\">February 4, 2025</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p>Tensions escalated as two top security officials were placed on leave after blocking D.O.G.E personnel from accessing internal systems. </p><p></p><p>Humanitarian efforts in regions like Africa and Ukraine have been hit hardest, with several projects suspended. </p><p></p><p>The executive order that established <a href=\"https://www.coinlive.com/news/elon-musk-and-vivek-ramaswamy-pioneers-d-o-g-e-agency-as-new \" target=\"\">D.O.G.E</a>, signed by Trump on 21 January, has already frozen billions in foreign aid and initiated a re-evaluation of ongoing commitments in sectors such as health, disaster relief, and infrastructure. </p><p></p><p>Musk also endorsed Senator Joni Ernst’s proposal to absorb any remaining functions of USAID into the State Department.</p><p></p><p>He added:</p><blockquote>“It makes sense. There’s no need for it to be a separate agency.”</blockquote><p></p><h1>Musk's D.O.G.E Takes Charge, Cites Fraudulent Payments</h1><p>Treasury Secretary Scott Bessent reportedly granted Musk’s team full access to Treasury payment systems on Friday, a move confirmed by Senator Ron Wyden. </p><div class=\"media-wrap embed-wrap\"><div><blockquote class=\"bluesky-embed\" data-bluesky-cid=\"bafyreiacehfo6nmz6dnmowqifnp53hulrs4kvozdropfdmf5vx4vk5db2u\" data-bluesky-uri=\"at://did:plc:ydtsvzzsl6nlfkmnuooeqcmc/app.bsky.feed.post/3lh5ejpwncc23\"><p lang=\"en\">NEW: Sources tell my office that Treasury Secretary Bessent has granted DOGE *full* access to this system. Social Security and Medicare benefits, grants, payments to government contractors, including those that compete directly with Musk's own companies. All of it.<br/><br/><a href=\"https://bsky.app/profile/did:plc:ydtsvzzsl6nlfkmnuooeqcmc/post/3lh5ejpwncc23?ref_src=embed\">[image or embed]</a></p>— Senator Ron Wyden (<a href=\"https://bsky.app/profile/did:plc:ydtsvzzsl6nlfkmnuooeqcmc?ref_src=embed\">@wyden.senate.gov</a>) <a href=\"https://bsky.app/profile/did:plc:ydtsvzzsl6nlfkmnuooeqcmc/post/3lh5ejpwncc23?ref_src=embed\">February 2, 2025 at 4:37 AM</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://embed.bsky.app/static/embed.js\"></script></div></div><p>Musk argued that this access was vital due to years of Treasury officials approving fraudulent payments. </p><p></p><p>Musk said during the session and later posted on X:</p><blockquote>“The D.O.G.E team discovered that payment approval officers at Treasury were instructed to always approve payments—even to known fraudulent or terrorist groups. They literally never denied a payment in their entire career.”</blockquote><p>David Lebryk, the Treasury’s most senior career official overseeing these systems, resigned last week as Musk’s team took control. </p><p></p><p><a href=\"https://www.coinlive.com/news/elon-musk-s-spacex-faces-setback-as-starship-test-flight-7 \" target=\"\">Musk</a> has been systematically targeting and firing officials responsible for overseeing payments, accusing them of failing in their duties. </p><p></p><p>He highlighted mismanaged payments, such as those from the Department of Health and Human Services to Lutheran Family Services, as prime examples of systemic issues. </p><div class=\"media-wrap embed-wrap\"><div><blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\">Career Treasury officials are breaking the law every hour of every day by approving payments that are fraudulent or do not match the funding laws passed by Congress. <br/><br/>This needs to stop NOW!<br/><br/> <a href=\"https://t.co/Y0RMNebEWq\">https://t.co/Y0RMNebEWq</a></p>— Elon Musk (@elonmusk) <a href=\"https://twitter.com/elonmusk/status/1886134485822922785?ref_src=twsrc%5Etfw\">February 2, 2025</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p>Musk also criticised Treasury’s Do-Not-Pay system, calling it another failed government mechanism in need of urgent reform.</p><p></p><p>Acknowledging the inevitable opposition to these changes, Musk pointed to the courts as a necessary avenue for addressing legal challenges. </p><p></p><p>With six of the nine US Supreme Court justices appointed by Republican presidents, including three by Trump, Musk sees this as a critical opportunity, stating:</p><blockquote>“This is our shot. This is the best hand of cards we’re ever going to have.\"</blockquote><p>Musk’s vision is not limited to Washington—he is also turning his focus to Wall Street. </p><p></p><p>He announced plans to meet with JP Morgan Chase CEO Jamie Dimon to present his cost-cutting agenda to the bond market. </p><p></p><p>Rising Treasury yields, fueled by concerns over inflation and growing deficits, have been a significant worry for investors. </p><p></p><p>Musk believes that his spending cuts offer a solution, with any sign of serious deficit reduction likely to lead to a drop in Treasury yields—a scenario favorable to bond investors. </p><p></p><p>Musk sees this meeting with Dimon as key to securing market confidence in<a href=\"https://www.coinlive.com/news/elon-musk-and-vivek-ramaswamy-pioneers-d-o-g-e-agency-as-new \" target=\"\"> D.O.G.E’s plan. </a></p><p></p><p>Musk explained in the session:</p><blockquote>“We need them to see this as a positive step.”</blockquote><p>While Trump’s support provides a safety net, Musk is bracing for continued backlash. </p><p></p><p>He concluded the session by urging his supporters to rally behind D.O.G.E’s “noble goal: </p><blockquote>“DOGE will win if millions of people support it. I wouldn’t even know how they supported it, but the fact that they did.”</blockquote><p></p><h1>President Trump Refutes D.O.G.E's Authority Over Treasury Funds</h1><p>President Trump refuted claims that Musk has the authority to halt federal Treasury payments independently, despite Musk having full access to the government’s financial systems. </p><p></p><p>In a statement made from the Oval Office earlier today, <a href=\"https://www.coinlive.com/news/trump-s-alleged-800m-windfall-from-trump-coin-sparks-coinbase-director-s \" target=\"\">Trump </a>addressed ongoing rumors suggesting that Musk’s D.O.G.E was blocking critical payments. </p><p></p><p>The President noted:</p><blockquote>“Elon can’t do and won’t do anything without our approval. If something didn’t have my OK, you’d hear about it real fast.”</blockquote><p>He emphasized that Musk does not get to decide anything on his own:</p><blockquote>“Elon’s not making decisions on his own. He’s finding tremendous waste, but I’m the one who decides what happens next.”</blockquote><p></p><p></p><p></p></div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/e167cefbc572fdf13fe2eef03749c4cb.jpeg",
            "link": "https://www.coinlive.com/news/elon-musk-kicks-off-x-spaces-for-d-o-g-e-details-usaid",
            "pub_date": "2025-02-04 14:21:04",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        }
    ]
}