{
    "data": [
        {
            "id": 250450,
            "title": "When Block laid off half the company, there were no bad guys in the AI ​​unemployment wave.",
            "description": "<div class=\"share___SVvtl\"><div><p style=\"text-align: left;\"><span style=\"font-size: 16px;\">Author: Yellow Lobster, Deep Tide TechFlow</span><span leaf=\"\" style=\"\"> </span></p><p style=\"text-align: left;\"><span leaf=\"\">On February 22nd, an article titled \"The 2028 Global Intelligent Crisis\" went viral in the financial world. The author, Citrini Research, a macro research firm, presented the article as a \"memorandum from the future,\" setting the timeline to June 2028 and reviewing how this AI-triggered economic crisis gradually evolved into a systemic collapse.</span></p><p style=\"text-align: left;\"><span leaf=\"\">One ​​sentence in the article stated, \"In early 2026, the first wave of layoffs triggered by the replacement of human intelligence began. Profits expanded, earnings exceeded expectations, and stock prices hit record highs.\"</span></p><p style=\"text-align: left;\"><span leaf=\"\">Four days later, this statement was no longer a thought experiment.</span></p> On February 26th, Jack Dorsey posted on X: \"we're making @blocks smaller today.\" Block, the fintech company that owns Square and Cash App, released its fourth-quarter earnings report that day. Gross profit increased by 24% year-over-year, and earnings per share exceeded analysts' expectations. At the same time, Dorsey announced layoffs of over 4,000 employees, representing 46% of the company's total workforce. Following the announcement, Block's stock price rose 24% in after-hours trading. The company's performance increased by 24%, the stock price increased by 24%, and then 4,000 people received resignation notices. Citrini's \"2028 nightmare\" didn't even reach 2028; it began its first act this Thursday. <p style=\"text-align:center\"><span leaf=\"\"><img alt=\"Bec2pbXoM0LbaTOqqsSw9kRm6P21437EBvjK7aGC.jpeg\" src=\"https://img.jinse.com.cn/7436139_image3.png\" title=\"7436139\"/></span></p><h2 style=\"text-align: left;\"><strong><span leaf=\"\">We are not in trouble</span></strong></h2><p style=\"text-align: left;\"><span leaf=\"\">In history, every large-scale layoff has been accompanied by a set formula in the CEO's open letter:</span><strong><span leaf=\"\"><span text=\"\">The market environment is severe, and we have made a difficult decision due to adjustments in our strategic direction. We thank every colleague for their contributions.</span></span></strong></p><p style=\"text-align: left;\"><span leaf=\"\"> Dorsey's letter is different. \"We're not in trouble. Our business is strong… but something has changed. We've seen internally that smaller teams are doing more and better, working with the smart tools we're building and using. And the capabilities of these tools are compounding every week.\" There's no mention of a market downturn; the company is doing great, but you don't need them anymore. This candor is unsettling. Past layoff narratives always included an implicit promise: we'll rehire once the market improves. This time, Dorsey didn't even make that promise. He offered a different logic: A small team plus AI can do the same things as a large team, or even better. If that's the case, why are so many people needed? Investors completely agreed with this logic, voting with a 24% increase in the stock price. There's another detail that might have been overlooked. To promote an \"AI-first\" work culture, Dorsey previously required every employee in the company to send him a weekly email listing five recently completed tasks. Thousands of emails flooded in, and Dorsey's approach was to use AI to summarize them and then read the summaries. Using AI to determine who can prove they won't be replaced by AI, and letting AI analyze who will be laid off—this detail is the most precise metaphor in the whole story. A timeline, an acceleration. Block isn't an isolated case; it's a trend that has been running for two years. Looking back, the acceleration of this trajectory is dazzling. In 2024, Klarna CEO Sebastian Siemiatkowski announced that the company's AI customer service assistant handled the equivalent of 700 full-time employees' workload. At the time, most people saw it as a tech show; the CEO needed headline-grabbing numbers and a story to convince investors. In April 2025, an internal memo from Shopify CEO Tobi Lütke was leaked. One sentence in the memo, which has since been repeatedly quoted, stated: \"Before requesting additional staff, the team must first prove that AI cannot do this.\" That same year, Duolingo announced its \"AI-first\" strategy, terminating a large number of content creation outsourcing contracts. IBM admitted to replacing 8,000 HR positions with AI; CEO Arvind Krishna, in an interview, made no attempt to conceal this, directly naming the department and the number of people involved. Salesforce laid off 4,000 customer support positions, with CEO Marc Benioff stating, \"AI can now handle about half of the company's work.\" By the end of 2025, data from Challenger, Gray &amp; Christmas, a US employment tracking agency, showed that over 55,000 jobs were directly attributable to AI. At the beginning of 2026, Amazon announced two rounds of layoffs totaling approximately 30,000 corporate jobs. Law firm Baker McKenzie followed suit, laying off 600 to 1,000 research, marketing, and administrative support positions—an industry widely considered one of the most difficult for AI to penetrate. On February 26, 2026, in Block, a profitable company laid off 46% of its employees in one go. But layoffs are just the most visible weapon. A Harvard University study reveals a more insidious statistic: With the widespread adoption of AI, tech companies are hiring an average of five fewer junior employees per quarter. Without announcements or press releases, positions quietly disappear from job postings, and resumes submitted by recent graduates vanish without a trace; the reasons are never stated in rejection letters. Let's return to that viral article. Citrini's projections are unsettling not only because they depict a dystopian scenario of AI sweeping the job market, but also because they depict a logically consistent, perfectly rational death spiral. The spiral works like this: AI expands company profits. Funds from profit expansion were reinvested in AI, leading to even stronger AI capabilities. Stronger AI capabilities made more jobs replaceable. More unemployment meant less consumption. Shrinking consumption put pressure on more companies, forcing them to further reduce costs using AI. AI's capabilities advanced another step. Citrini named this cycle the Intelligence Displacement Spiral. They wrote in their article, \"Individual decisions by each company are rational, but the collective result is disastrous.\" Now, let's look at what happened on Block. Gross profit rose 24%, stock price rose 24%, 4,000 people lost their jobs, and the money saved was reinvested in AI tools. From Dorsey's perspective, this was a completely rational decision. He even explained in an open letter why he chose a one-time large-scale layoff instead of multiple rounds of gradual reductions: because that would continuously damage morale and trust. From a corporate governance perspective, this is textbook-level execution. From the perspective of those 4,000 people, this is a disruption to their lives. In Citrini's deduction, there is a real person (presented anonymously): a friend who was a senior product manager at Salesforce, earning $180,000 a year, lost his job in the third round of layoffs in 2025. After searching for six months, he couldn't find a position at the same level. Finally, he started driving for Uber, and his annual income dropped to $45,000. This isn't just one person's story. Citrini, in her article, makes a simple multiplication: multiply this individual's trajectory by the hundreds of thousands of white-collar workers in major cities experiencing similar fates, and the decline in consumption ceases to be abstract macro data, but a predictable and calculable reality. This story is unfolding globally, perhaps even around us. Citrini's article states: \"The historical disruption model posits that existing companies resist new technologies, ultimately allowing agile new entrants to erode their market share and lead to their demise. Kodak, Blockbuster, and BlackBerry are examples of this. However, the situation in 2026 is entirely different; existing companies are not resisting because they cannot afford the cost of resistance.\" This is the key to understanding the entire situation. Klarna was impacted by AI, and then used AI to cut costs, laying off a number of employees. Salesforce's software products were challenged by AI, and then AI replaced 4,000 customer service jobs. Block was hit by the AI ​​wave in the fintech industry, and then announced that it would restructure its entire organization with AI, laying off nearly half of its employees. These companies were not victims defeated by AI. They were the most active adopters of AI, and what was defeated were their own employees. This is the part that is hardest to deal with within a moral framework. After the 2008 financial crisis, people knew who to hate. Wall Street bankers, traders who packaged and sold junk bonds, and officials who failed to regulate. Anger had specific targets, even addresses, hence the Occupy Wall Street movement. This time is different. It's hard to say Dorsey did anything wrong. Block's stock price tells you what the market thinks. The 4,000 laid-off employees didn't do anything wrong either; they just happened to be working in roles that were being restructured. AI itself is certainly not a bad guy; it's just a tool that's becoming increasingly useful at a speed humans have never seen before. Responsibility permeates the entire system, like salt dissolving in water. You can taste the saltiness, but you can't find the grain of salt. Two sentences in Citrini's article, though not widely quoted, are perhaps the most profound: \"For the first time in history, the most productive assets in the economy have created fewer, not more, jobs. No framework applies, because none of them were designed for a world where scarce factors of production have become abundant.\" After every technological revolution, humanity has found a new place. The steam engine replaced hand-weaving workers but created railway workers, factory managers, and urban planners. The internet eliminated travel agencies, physical record stores, and classified ads but invented product managers, data analysts, and content creators. Each time, those \"jobs of the future\" were initially indescribable, but they later emerged, and in enough numbers. This comforting rule has encountered a challenger for the first time. Because this time, AI itself is learning to do those \"future jobs,\" such as AI trainers, AI prompt engineers, and AI product managers. The workers being replaced cannot simply \"upgrade their skills\" to AI-related positions because those positions themselves are being reduced. Harvard researchers have documented a phenomenon: After the widespread adoption of AI, entry-level job hiring at tech companies has decreased by more than 50%. This isn't because these positions have disappeared, but because they were never created in the first place. An entire generation is trained to enter an industry, and then, just as they're about to graduate, that industry quietly decides it no longer needs entry-level humans. We can't pretend we have time to figure things out. Citrini concludes by saying the canary is still alive, but the miner's problem is never whether the canary is dead or alive, but whether you have an exit when it starts to wobble.</span></p></div></div>",
            "image": "https://img.jinse.com.cn/7436137_small.png",
            "link": "https://www.coinlive.com/news/when-block-laid-off-half-the-company-there-were-no",
            "pub_date": "2026-02-27 13:55:04",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 250437,
            "title": "Wintermute: Retail Trading of Cryptocurrencies and Stocks",
            "description": "<div class=\"share___SVvtl\"><div><p style=\"text-align: left;\">Author: Jasper De Maere, OTC Trader at Wintermute; Translator: Shaw, Jinse Finance</p><p style=\"text-align: left;\"><strong>Retail activity influences the cryptocurrency market.</strong> Through speculation, buying on dips, and flexible fund rotation in the token space, retail investors dominate every major cycle. <strong>Recent data shows that the relationship between retail investors and cryptocurrencies is changing.</strong></p><p style=\"text-align: left;\">We have noticed that retail investors' attention has shifted from altcoins to the stock market for some time now. New data from JPMorgan Strategy, combined with our proprietary flow data, now shows that stocks and cryptocurrencies are emerging as alternative risk assets.</p><h2 style=\"text-align: left;\">The Reversal of Relationship</h2><p style=\"text-align: left;\">By overlaying Wintermute's proprietary cryptocurrency retail flow data with JPMorgan's retail equity inflow data, we can observe the relationship between retail stock and cryptocurrency trading activity from a new perspective.</p> Historically, until the end of 2024, the two markets moved largely in tandem. At that time, heightened risk appetite led investors to buy both stocks and cryptocurrencies, as both served to some extent to release excess capital (such as broad money supply M2) and alleviate risk aversion. However, since the end of 2024, this relationship has broken down, and the two markets are now diverging at their greatest extent ever, with retail investors flooding into the stock market at a record pace while remaining on the sidelines regarding the cryptocurrency market. <p style=\"text-align:center\"><img alt=\"is8TrD40w2PsAqtGzZYi0oOk3KxA3M10xIkwleXq.jpeg\" src=\"https://img.jinse.com.cn/7436114_watermarknone.png\" title=\"7436114\"/></p><p style=\"text-align: left;\">When we broaden our perspective, we use altcoin market capitalization as a long-term measure of retail investor cryptocurrency activity. It is closely correlated with our retail fund flow data and has a longer-term, more objective historical data. From 2022 to the end of 2024, cryptocurrencies and stocks moved roughly in tandem, both considered a collection of high-risk investments by retail investors. This decoupling was particularly pronounced at the end of 2024, with retail activity becoming more driven by short-term factors, more volatile, and less structured.</p> ... The rolling correlation between retail activity and altcoin market capitalization confirms this shift. The previously volatile but generally positive correlation has turned negative. Retail investors are now allocating between the two, rather than investing in both simultaneously. <p style=\"text-align:center\"><img alt=\"juvjRyEZVFSKgdqduSqG1Kav0BGYAjXLnRjxFpMz.jpeg\" src=\"https://img.jinse.com.cn/7436116_watermarknone.png\" title=\"7436116\"/></p><p style=\"text-align: left;\"><strong>Broadening the perspective to 2025 and combining it with key driving factors can make market dynamics clearer.</strong> The following points are particularly noteworthy:</p><ul class=\"list-paddingleft-2\" style=\"list-style-type: disc;\"><li><p style=\"text-align: left;\">When stock market activity stagnates and retail investors turn to other speculative areas, <strong>Meme coin and AI agents have a golden opportunity for development.</strong> Retail investors have been actively buying stocks on dips, both before and after the April 2025 tariff announcement and more recently. Since October 10th, funds have almost entirely shifted to the stock market, and this trend continues. It's worth noting that we believe the scale of retail trading activity in cryptocurrencies is not yet sufficient to draw funds away from the stock market. Our view is that increased retail trading activity in the stock market is draining funds from the cryptocurrency market. This new data also confirms this. Retail trading activity in the stock market is a new factor that cryptocurrency investors should closely monitor to capitalize on opportunities when cryptocurrencies can generate more sustained buying interest from retail investors. </p><p style=\"text-align:center\"><img alt=\"q3mq4nDSPn2sZw028NTbiIczWWweh4yoxq3TZ1WY.jpeg\" src=\"https://img.jinse.com.cn/7436117_watermarknone.png\" title=\"7436117\"/></p><h2 style=\"text-align: left;\">Volatility is a Selling Point</h2><p style=\"text-align: left;\"><strong>While there are many reasons, one of the reasons why retail investors are so active in the cryptocurrency market and attracted to it is the asset's volatility.</strong> Volatility itself is a selling point of cryptocurrencies and a fundamental reason that attracts retail investors to the cryptocurrency space. Although the actual volatility of cryptocurrencies still far exceeds that of the stock market, its actual volatility has been declining, and this trend is unlikely to reverse. The Bitcoin/Nasdaq volatility ratio (BTC/NDX) has continued to decline, even compressing to below 2x in the first half of 2025. Thoughts on some key driving factors: The market is maturing. With the increasing number of sophisticated investors and the emergence of new liquidity instruments such as ETFs and DATs, the sharp fluctuations commonly seen in previous cycles have diminished. Market Size. Even with a market capitalization of only $2.3 trillion, down 40% from its all-time high, the amount of capital required to shake the market is far greater than it was five years ago. As volatility narrows, the core selling point of cryptocurrencies for retail investors is also weakening. The massive swings that once defined the 2021-2022 cycle and attracted a generation of retail investors are no longer present. For retail investors chasing volatility, stocks are becoming increasingly attractive. Technology Drivers. Beyond the market structure unique to cryptocurrencies, technology drivers are accelerating this shift, a point that hasn't received enough discussion. Cryptocurrency Access—The integration of cryptocurrency trading into fintech and traditional brokerage platforms (or the integration of stock trading into cryptocurrency-native platforms) lowers the barriers to entry, but its more significant impact lies in exit mechanisms. In the past, cumbersome entry processes made it difficult to transfer funds once invested in the cryptocurrency market, leading to a natural circulation of funds between different tokens. Now, these convenient inflow/outflow channels allow funds to flow easily between cryptocurrencies and stocks with virtually no obstacles. Advantages—Retail investors seem increasingly inclined towards stocks, partly due to the new sense of superiority brought by artificial intelligence. Large Language Models (LLMs) significantly enhance the analytical capabilities of retail investors, creating a level playing field. This sense of superiority doesn't exist in the cryptocurrency space. While cryptocurrencies can be analyzed based on data, the lack of a consensus valuation framework and token value accumulation, coupled with the ever-expanding scope of investment, makes it difficult for retail investors to gain that sense of advantage. Conclusion: Retail investors were once the most reliable source of reflexive demand for cryptocurrencies, but today they increasingly seek risk appetite in other areas. The stock market offers increasing volatility, is more competitive, has a growing analytical advantage, and retail investors can easily switch from cryptocurrencies to stocks using their existing applications. Cryptocurrencies still hold a place in retail portfolios, but they are now just one of many investment tools, not the primary speculative instrument. This shift should also affect how investors view the market. Some previously effective indicators have become ineffective. For cryptocurrency investors, simply finding leading indicators of risk appetite and combining them with the native framework of cryptocurrencies is no longer sufficient to achieve success. Investors increasingly need to view cryptocurrencies from a multi-asset portfolio perspective, just as they would with stocks and fixed-income products—this has become standard practice.</p></li></ul></div></div>",
            "image": "https://img.jinse.com.cn/jinse_1772166849608273081_small.png",
            "link": "https://www.coinlive.com/news/wintermute-retail-trading-of-cryptocurrencies-and-stocks",
            "pub_date": "2026-02-27 12:37:01",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 250432,
            "title": "MrBeast Video Editor Suspended By Beast Industries After Near-Perfect Trades Flagged By Kalshi",
            "description": "<div class=\"share___SVvtl\"><div><h2>Video Editor Sidelined As Beast Industries Probes Trading Claims</h2><p>A video editor for the global YouTube sensation MrBeast has been suspended from his role following allegations of insider trading on the prediction platform Kalshi.</p><p></p><p>The fallout began when Kalshi identified \"near-perfect\" trading patterns from an account linked to Artem Kaptur, an editor for the channel.</p><p></p><p>The platform determined that Kaptur likely leveraged his access to unreleased video content to place successful wagers on specific outcomes within MrBeast’s high-stakes challenges.</p><p></p><div class=\"media-wrap embed-wrap\"><div><blockquote align=\"center\" class=\"twitter-tweet\" data-dnt=\"true\"><p dir=\"ltr\" lang=\"en\">🚨 BREAKING: Kalshi bans a MrBeast video editor for 2 years over insider betting.<br/><br/>Artem Kaptur allegedly used confidential information about upcoming YouTube videos to place trades before the details were public.<br/><br/>He must also pay over $20,000 in fines.<br/><br/>Prediction markets are… <a href=\"https://t.co/oDwXdIKm7P\">pic.twitter.com/oDwXdIKm7P</a></p>— Satoshi Talks (@Satoshi_Talks) <a href=\"https://twitter.com/Satoshi_Talks/status/2026703999232102738?ref_src=twsrc%5Etfw\">February 25, 2026</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p></p><p>Beast Industries CEO Jeff Housenbold confirmed the internal suspension during an appearance on CNBC’s “Squawk Box,” noting that the company is taking a proactive stance against the risks emerging from prediction markets.</p><p></p><p>The firm has initiated an independent investigation to protect the integrity of its content.</p><p></p><p>This move follows a period where the company had already established clear internal policies.</p><p></p><p>Housenbold made it clear that the rule applies regardless of legal ambiguities, stating,</p><p></p><blockquote>“We don’t want anyone to trade on information.”</blockquote><p></p><h2>How Did Kalshi Detect The Anomalous Wins</h2><p>Kalshi’s surveillance systems flagged Kaptur’s activity after noticing wins that were described as \"statistically anomalous.\"</p><p></p><p>The editor reportedly wagered a total of $4,000 on markets specifically related to MrBeast’s videos, such as viewership numbers and video lengths.</p><p></p><p>Following a review by its disciplinary committee, Kalshi issued Kaptur a fine of $15,000 and ordered the return of $5,397.58 in profits.</p><p></p><p>Additionally, he has been banned from the platform for two years.</p><p></p><div class=\"media-wrap embed-wrap\"><div><blockquote align=\"center\" class=\"twitter-tweet\" data-dnt=\"true\"><p dir=\"ltr\" lang=\"en\">KALSHI ALERT<br/><br/>&gt; MrBeast’s video editor Artem Kaptur bet on upcoming video markets stuff<br/><br/>&gt; He traded around $4k<br/>won almost every low odds bet<br/>made $5,397 profit<br/><br/>FINED<br/><br/>&gt; $20,397 total fine (profit returned + penalty)<br/>&gt; 2 year ban<br/><br/>Another case:<br/><br/>- former california governor… <a href=\"https://t.co/7ghvZ5HESa\">https://t.co/7ghvZ5HESa</a></p>— Solguru (@SolguruNFT) <a href=\"https://twitter.com/SolguruNFT/status/2026721618593198177?ref_src=twsrc%5Etfw\">February 25, 2026</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p></p><p>Bobby DeNault, who leads enforcement at Kalshi, addressed the situation publicly, stating, </p><p></p><blockquote>“No financial exchange is immune from bad actors. Not stock exchanges, not banks, not prediction markets.”</blockquote><p></p><p>While Kaptur allegedly admitted his actions were “stupid, shortsighted, and a violation of the trust that was placed in me” in a since-deleted social media post, he also argued that the penalties were heavy-handed for a “small bet” in a sector where rules are still being defined.</p><p></p><p>He claimed the experience of being made an example of was \"deeply disorienting.\"</p><p></p><h2>Why Is A California Candidate Also Facing Penalties</h2><p>Kaptur was not the only individual caught in Kalshi’s recent enforcement sweep.</p><p></p><p>Kyle Langford, a former candidate for the governorship of California, was also sanctioned for betting on his own election.</p><p></p><p>Langford had openly promoted his wagers on social media, posting, </p><p></p><blockquote>“I just bet $100 that I, Kyle Langford will be the next Governor of California, join me.”</blockquote><p></p><div class=\"media-wrap embed-wrap\"><div><blockquote align=\"center\" class=\"twitter-tweet\" data-dnt=\"true\"><p dir=\"ltr\" lang=\"en\">I just bet $100 💵 that I, Kyle Langford will be the next Governor of California, join me <br/>(if you believe 🙏🏻) 😎 <a href=\"https://twitter.com/Kalshi?ref_src=twsrc%5Etfw\">@Kalshi</a><br/><br/>🐻✝️🇺🇸 <a href=\"https://t.co/XMk25PuDVr\">https://t.co/XMk25PuDVr</a><a href=\"https://t.co/A67hRZb2Za\">pic.twitter.com/A67hRZb2Za</a></p>— Kyle Langford (@KyleLangfordCA) <a href=\"https://twitter.com/KyleLangfordCA/status/1926349137760362572?ref_src=twsrc%5Etfw\">May 24, 2025</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p></p><p>Kalshi’s rules strictly prohibit political candidates from trading on their own races to prevent market manipulation.</p><p></p><p>For his actions, Langford received a five-year suspension and was fined over $2,000, along with a requirement to forfeit $246.36 in profits.</p><p></p><div class=\"media-wrap embed-wrap\"><div><blockquote align=\"center\" class=\"twitter-tweet\" data-dnt=\"true\"><p dir=\"ltr\" lang=\"en\">Prediction platform Kalshi fines former candidate Kyle Langford $2,246 and imposes five-year ban for election betting violation</p>— Byul (@byul_finance) <a href=\"https://twitter.com/byul_finance/status/2026697513634508962?ref_src=twsrc%5Etfw\">February 25, 2026</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p></p><p>Kalshi clarified that while candidates should monitor market forecasts, they are forbidden from participating as traders.</p><p></p><p>The platform has reported both Kaptur and Langford to the US Commodity Futures Trading Commission (CFTC), which maintains that it has the authority to police illegal trading practices and misappropriation of confidential information across these new financial frontiers.</p><p></p><h2>Can Prediction Markets Effectively Police Themselves</h2><p>The rise of platforms like Kalshi and Polymarket has sparked a heated debate between regulators and market advocates.</p><p></p><p>While some experts believe these markets are most accurate when open to everyone, critics and lawmakers worry about the erosion of public trust.</p><p></p><p>Jeff Housenbold noted that the current landscape is “ripe for abuse,” pointing out that \"there’s so much information out there, and it’s asymmetric, and people are taking advantage of it.\"</p><p></p><p>The CFTC has taken a firm stance, with Chair Mike Selig indicating the commission will fight any state attempts to limit its regulatory reach.</p><p></p><p>However, local leaders like Utah Governor Brian Cox have pushed back, labeling these platforms as \"gambling—pure and simple.\"</p><p></p><p>As the industry grows, with hundreds of millions of dollars wagered on major events like the 2024 US presidential election, the pressure on platforms to demonstrate rigorous oversight is mounting.</p><p></p><p>Kalshi has stated it opened 200 investigations into potential rule violations over the past year, signaling a more aggressive approach to maintaining market fairness.</p><p></p><div class=\"media-wrap embed-wrap\"><div><blockquote align=\"center\" class=\"twitter-tweet\" data-dnt=\"true\"><p dir=\"ltr\" lang=\"en\">New Spark: Following over 200 insider trading investigations, Kalshi is implementing rigorous surveillance and enforcement protocols to establish itself as a regulated prediction market exchange, signaling a new era of institutional maturity and market integrity.</p>— SteadyTrader (@SteadyTraderApp) <a href=\"https://twitter.com/SteadyTraderApp/status/2027058069125947640?ref_src=twsrc%5Etfw\">February 26, 2026</a></blockquote><script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script></div></div><p></p></div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/be0bcba97c14896c02f269da4f2303b9.jpeg",
            "link": "https://www.coinlive.com/news/mrbeast-video-editor-suspended-by-beast-industries-after-near-perfect-trades",
            "pub_date": "2026-02-27 11:52:09",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 250414,
            "title": "Why did Bitcoin prices fall along with software stocks?",
            "description": "<div class=\"share___SVvtl\"><div><p style=\"text-align: left;\">Author: Anthony Pompliano, Founder and CEO of Professional Capital Management</p><p style=\"text-align: left;\">Over the past few weeks, investors have been most focused on the rapid sell-off in software stocks. To better understand why, I asked Silvia (our AI-driven CFO) for an explanation. Here's what she said:</p><ul class=\"list-paddingleft-2\" style=\"list-style-type: disc;\"><li><p style=\"text-align: left;\"><strong>This sell-off, dubbed the \"SaaS doomsday,\" has wiped out more than $1 trillion in market capitalization from software stocks since late January 2026.</strong> The primary driver is a sudden and intense investor concern: the emergence of artificial intelligence, particularly autonomous AI agents (such as Anthropic's Claude Cowork), is poised to disrupt the traditional SaaS business model. Investors worry that if AI tools can replace the entire software workflow—from coding to customer service to IT management—the seat-based subscription model that has underpinned SaaS valuations for a decade will be fundamentally threatened. According to USA Today and Reuters, the iShares Technology Software ETF (IGV) has fallen approximately 20% year-to-date, with major companies suffering heavy losses: Microsoft is down about 28% from its peak, Oracle is down about 55%, Salesforce is down about 30%, and Adobe is down about 27%. Adding to the woes, the sector is experiencing a massive rotation. Funds are flowing out of traditional SaaS companies and into AI infrastructure companies, value stocks, and industrial sectors. Despite largely stable fundamentals, the software sector's forward price-to-earnings ratio has compressed from approximately 39 times to 21 times, falling to a multi-year low. According to AInvest data, all software companies in the S&amp;P 500 that reported earnings beat expectations last quarter, with 80% exceeding revenue expectations. Companies like ServiceNow and AppLovin reported record earnings, but their share prices still suffered heavy losses because Wall Street's focus has shifted from current profitability to ultimate value—essentially questioning whether these established companies can survive in a world of autonomous AI agents. JPMorgan Chase called the sell-off driven by \"logical inconsistencies,\" believing the market is digesting a worst-case scenario that hasn't yet occurred. These are significant promises that short sellers rely on to support their investment logic. The sudden and significant reduction in the market capitalization of all software companies compared to just a few weeks ago is truly perplexing. </p><p style=\"text-align:center\"><img alt=\"zqUzHcsVjlq2sMnqSdwYUweDLaQaR8P6LjlWAjoS.jpeg\" src=\"https://img.jinse.com.cn/7436037_watermarknone.png\" title=\"7436037\"/></p><p style=\"text-align: left;\">Silvia then explained the crux of the debate: Is this an overreaction by investors, or a structural turning point in the market?</p> ... \"Short sellers argue that AI agents will commoditize software, squeeze profit margins, and erode the user base—some analysts at Bain and Forrester point out that CIOs are consolidating software budgets and reallocating spending to AI tools rather than expanding SaaS reach. Bulls counter that deeply embedded 'record systems' platforms (like Salesforce, ServiceNow, and Intuit) have a sticky customer base and recurring revenue that won't disappear overnight, making their current valuations potentially an attractive entry point. The truth may lie somewhere in between—AI will reshape the industry, but this indiscriminate sell-off has depressed the stock prices of many quality companies as if their businesses were already on the decline, a conclusion the data doesn't yet support.\" One question I've been pondering is the relationship between software stocks and Bitcoin. If software stocks are falling due to concerns about artificial intelligence, why is Bitcoin falling at the same time? Are investors genuinely worried that AI will impact Bitcoin's future? Silvia explains this clearly: \"In early 2026, the correlation between Bitcoin and software stocks surged to astonishing levels. As of February, Bitcoin's 30-day rolling correlation with the iShares Extended Technology Software ETF (IGV) reached 0.73, a very high figure. Bitcoin's correlation with the Nasdaq 100 also jumped from -0.68 to +0.72 in just a few weeks. Meanwhile, its correlation with gold was only 0.12. In effect, Bitcoin traded more like a high-beta software stock than a safe-haven asset.\" The mechanism driving this correlation is institutional fund flows, not fundamental overlap. Since the launch of spot Bitcoin ETFs in early 2024, Bitcoin has increasingly been included in institutional portfolios alongside growth and tech stocks. When risk aversion events occur—such as the sell-off in AI-driven software stocks triggered by the launch of Anthropic's Claude Cowork—portfolio managers broadly reduce risk, selling both software stocks and Bitcoin. At the peak of the sell-off, Bitcoin ETFs experienced average daily outflows of $272 million, with cumulative outflows from cryptocurrency products reaching $1.7 billion. This is not a phenomenon unique to cryptocurrencies—it's a broader risk aversion mechanism where funds shift from growth assets to gold, government bonds, and cash. Bitcoin, as a risk-averse asset, is also held by these institutions and is therefore affected by this countercurrent. The key nuance—and what makes this particularly tricky—lies in the negative skewness of Bitcoin's correlation with its price. Bitcoin falls much more sharply than it rises with software stocks. When IGV rises, Bitcoin's reaction is relatively muted; conversely, when IGV falls, Bitcoin tends to amplify the decline. This asymmetry exacerbates the situation—Bitcoin bears the risk of a decline in its correlation with tech stocks but fails to fully participate in their rallies. Stifel even predicts Bitcoin could fall to $38,000, pointing out that its 0.78 correlation with the Nasdaq 100 suggests that Bitcoin is now more like a leveraged bet on tech stocks than a safe-haven asset for the dollar. Clearly, the current sell-off is highly correlated. The most likely scenario for this correlation to disappear is that institutional investors no longer view Bitcoin as a growth/risk asset. As long as Bitcoin remains in the same category as software stocks in institutional portfolios and is influenced by the same macroeconomic factors (Fed policy, liquidity, risk appetite), it will continue to trade like leveraged tech stocks. To change this, a large number of marginal buyers of Bitcoin need to shift from momentum-chasing hedge funds and ETF-driven retail investors to structural, price-insensitive holders… primarily those who adhere to long-term holdings regardless of quarterly macroeconomic changes. The most likely catalyst is widespread adoption by sovereign nations. The United States has established a strategic Bitcoin reserve using seized assets, while countries like Brazil, El Salvador, and Bhutan are exploring or actively accumulating Bitcoin as a sovereign reserve. For the first time since 1996, central bank gold reserves have surpassed foreign holdings of US Treasury bonds, potentially representing a structural \"sovereign asset rotation\" from which Bitcoin could benefit if it ultimately proves to be a reliable neutral reserve asset. If major central banks (especially sovereign wealth funds) begin actively purchasing Bitcoin, this will create a large, price-insensitive demand base, absorbing selling pressure during periods of heightened risk aversion and fundamentally reducing its correlation with stocks. Gold's trajectory is largely consistent with this, and Bitcoin aspires to follow a similar path. The decoupling of Bitcoin from software stocks will be a multi-year process. This requires a gradual shift in the Bitcoin holder base from speculative/institutional investors to sovereign/structural investors, reduced volatility, and at least one crisis where Bitcoin doesn't sell off along with all other assets. The sovereign reserve trend is currently the most promising catalyst, but as long as exchange-traded fund (ETF)-driven institutional flows dominate Bitcoin's marginal pricing, it will still behave like an extension of the high-beta growth/tech sector during periods of market stress. Therefore, one way to understand Bitcoin's current correlation is that this asset is a victim of its own success. What we want is mainstream acceptance, and we have achieved that, but this mainstream acceptance (especially on Wall Street) has had side effects. The new correlation with software stocks is the most obvious example. Bitcoin is definitely fine. I expect it to continue to perform well in the future. The challenge for you as investors is to avoid getting bored. Good luck.</li></ul></div></div>",
            "image": "https://img.jinse.com.cn/jinse_1772157870385349140_small.png",
            "link": "https://www.coinlive.com/news/why-did-bitcoin-prices-fall-along-with-software-stocks",
            "pub_date": "2026-02-27 10:05:31",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 250397,
            "title": "The US's Hunt for Bitcoin: From the Silk Road to the World's Largest Government Holder",
            "description": "<div class=\"share___SVvtl\"><div>As of February 2026, the U.S. government held approximately 328,372 Bitcoins, representing approximately 1.64% of the global circulating supply (approximately 19.9 million Bitcoins). Based on current market prices, the value exceeds $20 billion. With this scale, the United States becomes the world's largest holder of Bitcoin, far exceeding any other government. Almost all of these Bitcoins came from law enforcement seizures, not from government appropriations or market purchases. While cracking down on the illicit uses of Bitcoin, the United States has quietly transformed these \"criminal assets\" into a national strategic reserve. Looking back at the US law enforcement and regulatory actions surrounding cryptocurrencies over the past decade, from cracking down on dark web markets to on-chain tracking and cross-border collaboration, it's clear that the US has never truly intended to \"eliminate\" Bitcoin. Instead, it has focused on controlling its flow and use, incorporating it into national strategic reserves, and forming a closed loop that integrates technology, law, and assets. <p style=\"text-align:center\"><span leaf=\"\"><img alt=\"6Mid5q5dwxSSDq6F3EwFJKFL45JlYfEcDMQT7goP.jpeg\" src=\"https://img.jinse.com.cn/7436001_image3.png\" title=\"7436001\"/></span></p><h2 style=\"text-align: left;\"><strong><span style=\"mso-bidi-font-weight: bold;\"><span leaf=\"\"><span text=\"\">Timeline: Landmark Actions in the US Hunt for Bitcoin</span></span></span></strong></h2><h3 style=\"text-align: left;\"><strong><span lang=\"EN-US\"><span leaf=\"\"><span text=\"\">2011-2013</span></span></span><span leaf=\"\"><span a=\"\" accounted=\"\" action=\"\" address=\"\" all=\"\" also=\"\" american=\"\" an=\"\" and=\"\" anonymous=\"\" approximately=\"\" arrested=\"\" as=\"\" at=\"\" basis=\"\" battle=\"\" becoming=\"\" bitcoin=\"\" bitcoins=\"\" built=\"\" but=\"\" by=\"\" came=\"\" captcha=\"\" case=\"\" combination=\"\" complete=\"\" completely=\"\" control=\"\" controlled=\"\" counterfeit=\"\" cracking=\"\" crime=\"\" custody.=\"\" daily=\"\" data=\"\" directly=\"\" documents.=\"\" drugs=\"\" enforcement=\"\" era=\"\" eye=\"\" fbi=\"\" files=\"\" for=\"\" francisco=\"\" from=\"\" goods=\"\" icelandic=\"\" illegal=\"\" imprisonment.=\"\" in=\"\" infiltration=\"\" into=\"\" its=\"\" just=\"\" key.=\"\" label=\"\" laptop=\"\" law=\"\" leads=\"\" legitimacy=\"\" library=\"\" life=\"\" located=\"\" means=\"\" million.=\"\" narrative=\"\" network=\"\" not=\"\" october=\"\" of=\"\" officers=\"\" offline=\"\" on=\"\" on-chain=\"\" only=\"\" operation=\"\" over=\"\" payment=\"\" peak=\"\" platform=\"\" private=\"\" public=\"\" raids=\"\" regulations.=\"\" resulted=\"\" road=\"\" ross=\"\" san=\"\" seizure=\"\" sentenced=\"\" server=\"\" shaping=\"\" silk=\"\" slightly=\"\" sole=\"\" solidified=\"\" subsequent=\"\" such=\"\" taken=\"\" taking=\"\" the=\"\" then=\"\" these=\"\" this=\"\" time=\"\" to=\"\" tool=\"\" tor.=\"\" total=\"\" trace=\"\" tracking=\"\" trade=\"\" transaction=\"\" transactions.=\"\" ulbricht=\"\" ulbricht.=\"\" used=\"\" volume=\"\" wallet=\"\" was=\"\" weapons=\"\" were=\"\" which=\"\" william=\"\" without=\"\" worth=\"\" youth=\"\"><p style=\"text-align:center\"><span leaf=\"\"><img alt=\"RzxmUeXzVEGZNVVcASxsVzwoE73f6oQ7Hz3bEIdi.jpeg\" src=\"https://img.jinse.com.cn/7436002_image3.png\" title=\"7436002\"/></span></p><h3 style=\"text-align: left;\"><strong><span lang=\"EN-US\"><span leaf=\"\"><span text=\"\">2013-2014</span></span></span><span leaf=\"\"><span text=\"\">Year: The Hunting of Multiple Dark Web Markets and the Laying of a Regulatory Framework</span></span></strong></h3><p style=\"text-align: left;\"><span leaf=\"\">After the Silk Road ended, the United States did not stop. On March 18, 2013, FinCEN (Financial Crimes Enforcement Network) issued guidance classifying Bitcoin exchanges and similar services as \"money services businesses\". The requirement for registration and implementation of KYC/AML (Know Your Customer) anti-money laundering mechanisms (MBL) by the US (Manufacturing Transaction Management System) marked the true beginning of the US Bitcoin regulatory framework, forcing exchanges to comply with regulations. In November 2014, the FBI, along with Europol and law enforcement agencies from 17 countries, launched Operation Onymous, simultaneously shutting down over 400 [unclear - possibly related to security measures]. The dark web market includes major drug and counterfeit money laundering sites such as Silk Road 2.0, Cloud 9, and Hydra. Arrests were made against more than 17 operators, including Blake Benthall, operator of Silk Road 2.0, and “Defcon”, a San Francisco software developer; approximately $1 million in Bitcoin and €180,000 in cash, gold, drugs, etc., were seized. The key weapon at this stage is the \"civil forfeiture\" system, which allows assets to be frozen with only a preponderance of evidence and without criminal conviction. The U.S. Marshals Service subsequently began regularly auctioning off confiscated Bitcoin. In 2014, investor Tim Draper participated in the auction, becoming one of the early public buyers. With a two-pronged approach of crackdown and compliance, Bitcoin was pulled from the underground into the regulatory order. 2017-2018: ICO Bubble Burst and Securities Regulation. After the ICO craze swept the globe, US regulators began a systematic cleanup. The SEC considers a large number of ICOs as “unregistered securities” and initiates enforcement actions against the project teams; the CFTC, on the other hand, has confirmed that Bitcoin is a “commodity”. The government has incorporated these regulations into its own oversight. Administrative fines, asset freezes, and litigation threats have been implemented. Centralized projects are forced to comply with regulations, reshaping the industry's financing model. While decentralized systems have gained room for development, compliance costs have increased significantly. 2020: The Aftermath of the Silk Road The 2012-2013 Silk Road hacking incident. This operation spanned seven years. Law enforcement used on-chain analytics tools such as Chainalysis and TRM Labs to track the flow of cold wallets through cluster analysis and transaction pattern matching, completing civil seizures without the need for private keys. </span></p><h3 style=\"text-align: left;\"><strong><span lang=\"EN-US\"><span leaf=\"\"><span text=\"\">2021</span></span></span><span leaf=\"\"><span text=\"\">Year: Second Largest Encrypted Forfeiture</span></span><span lang=\"EN-US\"><span leaf=\"\"><span text=\"\">James Zhong</span></span></span><span leaf=\"\"><span text=\"\">Case</span></span></strong></h3><p style=\"text-align: left;\"><span lang=\"EN-US\"><span leaf=\"\">IRS</span></span><span leaf=\"\">The Bureau of Criminal Investigation (IRS-CI) raided a Georgia home and found a hardware wallet in a floor safe and a popcorn bucket.</span></p></span><span leaf=\"\"> As early as 2012, during the Silk Road era, Zhong used a fake merchant account to exploit a vulnerability in \"Instant Withdrawal\" to steal approximately 50,000 Bitcoins within a few days. When arrested in 2021, police seized 50,676 bitcoins, worth approximately $3.36 billion. Even though Bitcoin is designed to be decentralized, operational security errors can still lead to arrest. The IRS achieves asset seizure through physical searches, on-chain intelligence, and plea bargaining. Zhong ultimately pleaded guilty and was sentenced to just over one year in prison. </span><p style=\"text-align:center\"><span leaf=\"\"><img alt=\"Uc6R4tAYNIjXCyPjJKqRyLp00yXTDBHH6dtkMw5D.jpeg\" src=\"https://img.jinse.com.cn/7436003_image3.png\" title=\"7436003\"/></span></p><h3 style=\"text-align: left;\"><strong><span lang=\"EN-US\"><span leaf=\"\"><span text=\"\">2022-2023</span></span></span><span leaf=\"\"><span text=\"\">Year:</span></span><span lang=\"EN-US\"><span leaf=\"\"><span text=\"\">Bitfinex</span></span></span><span leaf=\"\"><span a=\"\" achieving=\"\" address=\"\" after=\"\" and=\"\" any=\"\" arrested=\"\" arrested.=\"\" as=\"\" asset=\"\" assets=\"\" at=\"\" august=\"\" be=\"\" began=\"\" between=\"\" billion=\"\" boundaries=\"\" capital=\"\" cash=\"\" classified=\"\" closed=\"\" cloud=\"\" combined=\"\" compliance=\"\" compressed=\"\" conjunction=\"\" containing=\"\" controlled=\"\" cooperation=\"\" could=\"\" couple=\"\" crypto=\"\" cryptocurrencies=\"\" data=\"\" decryption=\"\" directly=\"\" encrypted=\"\" evidence=\"\" exchange=\"\" fbi=\"\" february=\"\" files=\"\" fixation.=\"\" flows=\"\" for=\"\" formed=\"\" forming=\"\" freezes=\"\" from=\"\" further=\"\" global=\"\" guilty=\"\" hacking.=\"\" has=\"\" heather=\"\" high-risk.=\"\" history.=\"\" hunting=\"\" ilya=\"\" imposed=\"\" in=\"\" interacting=\"\" international=\"\" it=\"\" keys.=\"\" kyc=\"\" largest=\"\" later=\"\" lichtenstein=\"\" location=\"\" loop=\"\" making=\"\" methods=\"\" mixers=\"\" mixing=\"\" morgan=\"\" network.=\"\" new=\"\" obtained=\"\" of=\"\" ofac=\"\" off-chain=\"\" on=\"\" on-chain=\"\" one=\"\" operational=\"\" penetrate=\"\" pleaded=\"\" precise=\"\" private=\"\" process=\"\" same=\"\" sanctions=\"\" search=\"\" seized=\"\" seizures=\"\" service=\"\" single=\"\" space=\"\" stage=\"\" storage=\"\" such=\"\" the=\"\" them=\"\" they=\"\" this=\"\" tightened=\"\" time=\"\" to=\"\" tornado=\"\" tracking=\"\" upgraded=\"\" use=\"\" using=\"\" wallets=\"\" warrant=\"\" was=\"\" were=\"\" with=\"\" worth=\"\" year=\"\" york=\"\"><p style=\"text-align:center\"><span leaf=\"\"><img alt=\"z6SMth8jIgr7Irn8v8GnkNw44uczmSlLRMRep6SP.jpeg\" src=\"https://img.jinse.com.cn/7436004_image3.png\" title=\"7436004\"/></span></p><h3 style=\"text-align: left;\"><strong><span lang=\"EN-US\"><span leaf=\"\"><span text=\"\">2023-2025</span></span></span><span leaf=\"\"><span text=\"\">Year: Zhao Changpeng (</span></span><span lang=\"EN-US\"><span leaf=\"\"><span text=\"\">CZ</span></span></span><span leaf=\"\"><span>) and the Binance case</span></span></strong></h3><p style=\"text-align: left;\"><span lang=\"EN-US\"><span leaf=\"\">In November 2023</span></span><span lang=\"EN-US\"><span leaf=\"\">, Binance admitted to failing to effectively implement anti-money laundering measures, allowing sanctioned users to trade, and paying a fine of $4.35 billion, including the confiscation of $2.7 billion in illicit gains; founder Changpeng Zhao</span></span></p></span></span></strong></h3> $50 million. During the investigation, US law enforcement not only relied on on-chain fund flow monitoring but also pieced together management's understanding of compliance risks by obtaining internal communication records. This included details such as the use of encrypted communication software to handle sensitive information and the deliberate downplaying of \"US user\" identification in internal discussions, forming evidence of the company's long-term evasion of KYC obligations. In April 2024, Zhao Changpeng was sentenced to four months in prison and served his sentence. In October 2025, President Trump announced a pardon for him. 2025: A Strategic Shift and the Largest Confiscation in History If the actions of the previous decade or so were a process of hunting down and purging, then 2025 saw a directional shift. On March 6, 2025, Trump signed an executive order establishing the Strategic Bitcoin Reserve and the U.S. Digital Asset Reserve. Previously, all Bitcoins seized by law enforcement would no longer be auctioned off, but instead become long-term national reserve assets and could not be sold. The policy logic has thus been rewritten, shifting from \"post-crackdown auction for monetization\" to \"zero-cost strategic holding\". On October 14th, the U.S. Department of Justice imposed sanctions on Chinese citizens of Cambodia's Prince Group. Chen Zhi, founder of [company name], was charged with criminal offenses including conspiracy to commit wire fraud and conspiracy to commit money laundering, and was ordered to forfeit approximately 127,271 Bitcoins, which at the time were worth approximately $15 billion, setting a record for the largest forfeiture of virtual assets in U.S. judicial history. The US claims the assets are related to cross-border telecom fraud and money laundering, and have entered a government escrow system. The China National Computer Virus Emergency Response Center released a technical tracing report, pointing out that a large-scale Bitcoin theft occurred at LuBian's mining pool in 2020, with the amount highly consistent with the scale of this seizure, and raising technical questions about the acquisition method. This incident is not only an unprecedented seizure of virtual assets, but also a landmark case of the intertwined struggle between law enforcement power, technical capabilities, and narrative power in the digital asset field. Concurrently, the Russian-operated Garantex exchange and its successor, Grinex, have been accused of providing money laundering channels for sanctioned countries' hacking and fraud, and have continued to face sanctions and infrastructure attacks. The interplay between on-chain tracking, pressure on the dollar clearing system, and control of physical servers systematically demonstrates cross-border law enforcement capabilities. After being placed on the sanctions list in early 2022, in March 2025, the U.S. Secret Service, in conjunction with German and Finnish law enforcement agencies, seized its domain name and froze approximately $26 million in assets; the Department of Justice indicted several executives, including Aleksej Besciokov, who was arrested in India; In August, the U.S. Treasury Department further expanded the scope of sanctions against OFAC, and the State Department offered a reward of up to $5 million for the capture of those responsible. With this, the U.S. has completed a closed loop in its handling of crypto assets, enabling it to both suppress, freeze, and confiscate them, as well as hold them long-term and incorporate them into national reserves. From technological suppression to asset integration, Bitcoin has been incorporated into the national strategic framework. From Hunting to Nationalization The United States' approach to Bitcoin has shifted from viewing it as a tool to combating crime to incorporating it as a national strategic asset. It's not just about law enforcement and regulation of cryptocurrencies; it's about achieving control over the entire Bitcoin supply chain and integrating national interests through a high degree of synergy between technology, law, and strategic reserves. Leveraging its globally leading on-chain tracing technology, national-level cyberattack capabilities, and transnational collaboration, the United States has constructed a three-pronged closed loop of \"technological advantage—regulatory binding—institutional enforcement,\" making Bitcoin a crucial component of its financial resilience and international dominance. </span><h3 style=\"text-align: left;\"><span leaf=\"\"><span text=\"\">1. </span></span><strong><span leaf=\"\"><span text=\"\">Technical Aspect</span></span></strong></h3><p style=\"text-align: left;\"><span leaf=\"\">The United States, relying on its globally leading on-chain tracing technology, national-level cyber attack capabilities, and transnational cooperation, has achieved precise control over the entire Bitcoin chain. On-chain traceability capabilities: The United States possesses the world's most advanced on-chain traceability technology, with leading US companies such as Chainalysis and Elliptic holding over 90% of the market share. The above market share allows for clustering and tracking of over 99% of Bitcoin transactions. Even using CoinJoin or mixers, on/off-ramp (fiat currency inflows and outflows) often exposes address associations. Combining Physics and Law: Without cracking private keys, hardware wallets, exchange accounts, or cloud storage files can be directly controlled through search warrants or court orders. In the Chen Zhi case, 25 cold wallet addresses were precisely located; in the Bitfinex case, direct control of assets was achieved by obtaining private keys through cloud storage. National-level cyberattack capabilities: The United States has launched targeted attacks against global exchanges and mining pools, including backdoor implantation, spear-phishing, supply chain infiltration, and exploitation of underlying encryption vulnerabilities. The LuBian mining pool case exploited the weakness of pseudo-random numbers, precisely transferring over 127,000 Bitcoins within 2 hours, demonstrating technological dominance. International Cooperation and Long-Arm Jurisdiction: Sharing intelligence with the EU, the UK, etc., and imposing sanctions on companies like OFAC, Tornado Cash, and Garantex, combined with dollar clearing hegemony, domain name seizures, and transnational arrests, to form a global hunting network and achieve full-chain control of digital assets. 2. Legal and Institutional Levels The United States, through legal systems and technological cooperation, has incorporated Bitcoin into its national control system, providing a solid guarantee for its strategic reserves. The GENIUS Act requires stablecoin issuers to use over 80% of their reserve assets to purchase U.S. Treasury bonds, creating sustained demand for U.S. Treasury bonds and binding the crypto ecosystem to the dollar system. The BITCOIN Act establishes the link between virtual assets and the U.S. financial system, clarifies civil forfeiture mechanisms, and provides legal support for the transfer of assets to state ownership. Civil confiscation: Assets can be seized without criminal conviction, resulting in extremely high efficiency. From 2022 to 2025, the United States confiscated over $30 billion worth of virtual assets globally through various cases, with the Chen Zhi case alone accounting for 50%. This synergy between law and technology forms a complete closed loop of \"rule pre-setting — technology forensics — asset harvesting,\" providing institutional guarantees for strategic reserves. 3. Strategic Reserve Approach The US's handling of Bitcoin reflects a complete evolution from precise targeting to systematic harvesting, and finally to its inclusion in national strategic reserves. Through a high degree of synergy in technology, regulations, and international cooperation, the US has established full-chain control over global virtual assets. Its methods include: precise monitoring and control of transactions using on-chain tracking technology and state-level cyberattack capabilities; direct transfer of assets through court orders and civil forfeiture; and forming a global encirclement loop through cooperation with allies, OFAC sanctions, domain name seizures, and transnational law enforcement. Case studies demonstrate the high efficiency of this capability: in the Chen Zhi case, confiscated assets were directly placed under state control; in the Zhao Changpeng case, through rule-based export and technological tracking, the United States rapidly transformed cross-border assets into strategic reserves. This strategy allows the United States to incorporate seized assets into its national reserves without requiring market purchases, using Bitcoin as a hedge against inflation and volatility in the dollar system, essentially as \"digital gold.\" As of February 2026, the United States held approximately 328,372 Bitcoins, representing 1.64% of the global circulating supply, with a value exceeding $20 billion, almost entirely from confiscation operations. On March 6, 2025, the United States signed an executive order entitled \"Establishing a Strategic Bitcoin Reserve and a U.S. Digital Asset Reserve,\" officially designating Bitcoin as a strategic reserve asset and requiring the Treasury Department to cease auctioning and selling Bitcoin obtained through judicial seizures and to transfer it to a newly established strategic reserve account. Although the BITCOIN Act recommended purchasing 1 million tokens over five years, this has not yet been implemented; the executive order only authorizes a potential strategy of \"budget neutrality and no additional taxpayer costs.\" Open market purchases have not been implemented, nor has any explicit commitment been made. Overall, the United States' strategy is highly systematic, neither completely eliminating nor completely abandoning Bitcoin, thus achieving precise control and strategic utilization. From a tool of crime in the \"Silk Road\" era to a core asset of national strategic reserves, the evolution of Bitcoin reflects a new landscape of national technological hegemony in the digital age, strengthening the United States' dominance in the global digital financial system and profoundly impacting technological sovereignty, economic interests, and political security.</span></p></strong></h3></div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/daba5de8d02de72ba61bb347f83e8f99.jpg",
            "link": "https://www.coinlive.com/news/the-us-s-hunt-for-bitcoin-from-the-silk-road-to",
            "pub_date": "2026-02-27 08:25:41",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 250390,
            "title": "Vitalik Buterin unveils Ethereum's quantum-resistant roadmap; US lawmakers propose blockchain innovation bill.",
            "description": "<div class=\"share___SVvtl\"><div><h2 style=\"text-align: left;\">Headline</h2><p style=\"text-align: left;\"><strong>▌Vitalik Buterin Announces Ethereum's Quantum-Resistant Roadmap</strong></p><p style=\"text-align: left;\">Vitalik Buterin has proposed a technical roadmap for Ethereum to address the long-term risks of quantum computing. At the validator level, Ethereum currently uses BLS digital signatures. Vitalik suggests switching to a \"hash-based\" signature scheme in the future, and enhancing signature switching capabilities and reducing verification costs through EIP-8141. Previously, the Ethereum Foundation had established a post-quantum research team.</p><p></p><p style=\"text-align: left;\"><strong>▌US Bipartisan Lawmakers Introduce Blockchain Innovation Act to Protect Non-Custodial Developers from Unlawful Liability</strong></p><p style=\"text-align: left;\">Crypto journalist Eleanor Terrett wrote on the X platform that US Representatives Scott Fitzgerald, Ben Cline, and Zoe Lofgren jointly introduced the \"Blockchain Innovation Promotion Act of 2026,\" which aims to protect software developers from criminal liability under Section 1960 of the United States Code. The bill explicitly states that Section 1960 only applies to institutions that control customer funds, not just developers who write code. This distinction is precisely what the crypto industry (especially DeFi) has been pushing for to be included in the Clarity Act. Section 1960 originally targeted institutions that custodied fund transfers, but recent cases (such as Tornado Cash and Samourai Wallet) have applied it to non-custodial software developers who do not control user funds, sparking conflict between crypto builders and regulators.</p> ... As of press time, according to CoinGecko data: BTC price is $67,559.56, a 24-hour change of -1.1%; ETH price is $2,030.99, a 24-hour change of -1.9%; BNB price is $626.08, a 24-hour change of -0.8%. SOL price is $85.97, a 24-hour change of -2.9%; DOGE price is $0.09701, a 24-hour change of -4.3%; XRP price is $1.40, a 24-hour change of -2.8%; TRX price is $0.2856, a 24-hour change of +0.1%. The price of WLFI is $0.1155, with a 24-hour change of -2.1%; the price of HYPE is $28.37, with a 24-hour change of +0.6%. Policy ▌US lawmakers reiterate concerns about stablecoin yields, focusing on the risk of bank deposit outflows. At a hearing of the US Senate Banking Committee, several senators expressed concerns about the stablecoin yield mechanism, arguing that its form is similar to bank deposits but lacks corresponding regulation, potentially leading to an outflow of bank deposits. Senator Thom Tillis stated that he will request regulatory agencies to provide an independent assessment of the relevant risks. Under the already enacted GENIUS Act, stablecoin issuers are prohibited from directly paying interest to holders, but third-party platforms are not prohibited from providing rewards. Regulators stated at a hearing that no large-scale deposit outflows have been observed, and the banking system as a whole is operating soundly. The Office of the Comptroller of the Currency (OCC) recently released a 376-page document proposing draft rules for implementing stablecoins under the GENIUS Act. The new rules explicitly restrict stablecoin issuers from indirectly paying interest or returns, while allowing merchants to make independent payments and white-label stablecoin businesses where issuers share returns with third parties. However, some existing circumvention methods will be prohibited; for example, Paxos' practice of paying rewards for PayPal's PYUSD will not be allowed. The regulatory focus is on preventing circumvention of the interest rate ban, while still retaining some permissible payment options. <p style=\"text-align: left;\"><strong>▌Federal Reserve Governor Bowman: Ensuring the Banking System's Capability to Support Digital Asset Activities</strong></p><p style=\"text-align: left;\">The Block reporter Sarah Wynn wrote on the X platform that Federal Reserve Governor Bowman testified before the U.S. Senate Committee on Finance, Housing, and Urban Affairs. It is understood that the Federal Reserve is advancing Project GENIUS and plans to \"clarify how digital assets are handled and ensure the banking system's capability to support digital asset activities.\" Bowman emphasized: \"As a regulator, my responsibility is to encourage innovation responsibly while continuously improving oversight to address the safety and robustness risks that innovation may bring.\"</p><p style=\"text-align: left;\"><strong>▌Crypto ETNs Cannot Be Included in Mainstream ISA Tax-Free Accounts from the New UK Fiscal Year</strong></p><p style=\"text-align: left;\">From April 6th, the new fiscal year, UK investors will no longer be able to add crypto ETNs to their \"Equities and Shares ISA\" tax-free accounts.</p><p style=\"text-align: left;\"> The UK tax authority, HM Revenue and Customs (HMRC), classifies it only as an asset eligible for \"Innovative Financial ISAs,\" and currently no platform plans to support related products. Investors already holding crypto ETNs do not need to sell. HMRC stated that given its innovative nature and the early stage of the market, it will continue to assess whether to adjust its policy in the future. </p><hr/><h2 style=\"text-align: left;\">Blockchain Applications</h2><p style=\"text-align: left;\"><strong>▌Tools for Humanity partners with Gap, Visa, and Tinder to promote World ID human verification product</strong></p><p style=\"text-align: left;\">According to the Wall Street Journal: Tools for Humanity, founded by OpenAI founder Sam Altman, is partnering with Gap, Visa, and Tinder to promote World ID human verification product (an identity verification technology that distinguishes between humans and bots).</p><p style=\"text-align: left;\"> Cryptocurrency </p><h2 style=\"text-align: left;\">MetaMask Partners with Mastercard to Launch Crypto Card in the US</h2><p style=\"text-align: left;\">According to market news, MetaMask has partnered with Mastercard to officially launch a cryptocurrency card in the United States.</p><p style=\"text-align: left;\"><strong>▌Morgan Stanley Plans to Offer Bitcoin Trading and Custody Services</strong></p><p style=\"text-align: left;\">According to market news, Morgan Stanley stated that it plans to offer Bitcoin trading, lending, yield, and custody services in the future, involving assets of up to $1.3 trillion.</p><p style=\"text-align: left;\"><strong>▌BlackRock Withdraws 4,309 BTC from Coinbase</strong></p><p style=\"text-align: left;\">According to Lookonchain monitoring, BlackRock ETF addresses continue to increase their BTC holdings.</p><p style=\"text-align: left;\"> The address received 4,309 BTC (worth $289.6 million) from Coinbase. </p><p style=\"text-align: left;\"><strong>▌Willy Woo: Bitcoin Bear Market Originates from Large-Scale Selling of Bitcoin by Early Whales</strong></p><p style=\"text-align: left;\">Renowned analyst Willy Woo commented on the event that \"since November 2025, Jane Street Group has been experiencing large-scale selling of Bitcoin and related ETF shares every day at 10 AM when the US stock market opens,\" stating that the essence of the Bitcoin bear market is that the large-scale selling of Bitcoin by early whales far exceeds the amount of new funds entering the market. This is clearly visible on the blockchain.</p> ... AllianceDAO Co-founder: Bitcoin Bear Market Needs No \"Scapegoats,\" Prices Are More Driven by Market Psychology AllianceDAO co-founder qw posted on social media that the market has been constantly looking for \"scapegoats\" for the Bitcoin bear market in recent months, including factors such as Jane Street, the threat of quantum computing, and the sell-off in the software sector. He believes that Bitcoin is not an asset anchored to cash flow, and its price fluctuations are more driven by market sentiment and technical patterns, essentially reflecting changes in investor psychology rather than being caused by a single external event. According to The Data Nerd, four hours ago, whale 0x69A bought another 8033 ETH (approximately $16.47 million) through Galaxy Digital. Over the past three months, this whale has purchased a total of 14,551 ETH at an average price of approximately $2,206. It currently holds 37,576 ETH (approximately $77.53 million), with a paper loss of approximately $38.45 million. Nasdaq has filed for a rule change with the U.S. Securities and Exchange Commission (SEC) to list the VanEck JitoSOL ETF. This fund will directly hold JitoSOL, a liquidity-based staking token based on Solana. According to the filing, if approved, staking yields will not be distributed separately but will be automatically added to the fund's net asset value. <p style=\"text-align: left;\"><strong>▌Grant Cardone Plans to Tokenize $5 Billion in Real Estate Assets</strong></p><p style=\"text-align: left;\">Real estate investor Grant Cardone stated that his company, Cardone Capital, is preparing to tokenize a portfolio of approximately $5 billion in real estate assets. The plan is to issue asset tokens via blockchain to provide investors with \"collateral and secondary market liquidity,\" and the company aims to achieve market leadership in the large-scale asset tokenization field. Previously, the company had already advanced its crypto asset strategy, including purchasing 1,000 Bitcoins and planning to continue increasing its holdings.</p> ... **Nationwide National Pension Service of Korea (NPS) Increases Holdings in MSTR by 614,409 Shares, Worth $83.2 Million** According to market news, the world's third-largest pension fund, the NPS, has increased its holdings in Bitcoin treasury company Strategy (stock code $MSTR) by 20%, bringing its total holdings to 614,409 shares, worth $83.2 million. **ETHZilla Removes \"Ethereum Treasury\" Label and Rebrands After Stock Price Crash** Former Ethereum treasury company ETHZilla announced that it will be renamed Forum Markets next month and adopt a new Nasdaq stock code, officially shifting its business from cryptocurrency exposure on its balance sheet to tokenized real-world assets (RWA). This move comes a week after the company announced it was abandoning the Ethereum balance sheet model, prompting investors to withdraw. Observers point out that the single-asset treasury strategy relies on a sustained equity premium and a strong market environment. Coinbase will launch spot trading for Robo Token (ROBO). If liquidity conditions are met, the ROBO-USD trading pair will open in supported regions. USDC Treasury mints 340 million new USDC. According to Whale Alert monitoring, the USDC Treasury minted a total of 340 million USDC in two transactions early this morning. **Important Economic Developments** **Federal Reserve's Goolsby: Interest Rates Could Cut More This Year If Inflation Falls** Federal Reserve Chairman Goolsby stated that interest rates could be lowered, but he doesn't want to cut rates significantly before inflation eases; if inflation falls, interest rates could be cut more this year; the job market is stable, and the economy has remained robust. **According to CME's \"FedWatch\":** The probability of the Fed cutting rates by 25 basis points by March is 4%, and the probability of keeping rates unchanged is 96.0%. The probability of the Fed cumulatively cutting rates by 25 basis points by April is 17.3%, the probability of keeping rates unchanged is 82.1%, and the probability of cumulatively cutting rates by 50 basis points is 0.6%. The probability of a cumulative 25 basis point interest rate cut by June is 43%. <hr/><h2 style=\"text-align: left;\">Golden Encyclopedia</h2><p style=\"text-align: left;\"><strong>▌What is the value of BTC?</strong></p><p style=\"text-align: left;\">BTC is often compared to \"digital gold,\" but its core value is actually the \"promise of immutable scarcity.\" First, BTC has monetary properties, but it is not a currency because it lacks a stable unit of account. It is a pure \"monetary property,\" that is, a consensus game among humans regarding \"what can serve as a store of value.\" Gold also has this core value, but gold's scarcity depends on the physical geological constraints, while BTC's scarcity depends on mathematics and game theory—it's an information-level scarcity.</p><p style=\"text-align: left;\">But what makes BTC truly unique is not the coin itself, nor the \"digital gold\" narrative, but rather that blockchain is the first permissionless, unclosable value settlement layer in human history. This is a completely new category of infrastructure.</p><p style=\"text-align: left;\"> No sovereign entity can unilaterally prevent the final settlement of a BTC transaction. This property may be underestimated in peacetime, but it will be repriced during periods of geopolitical conflict and escalating capital controls. BTC is a systemic hedge. It is not a hedge against inflation, nor against the US dollar. It hedges against the structural degradation of institutional trust. In other words, BTC's value is not endogenous, but reflexive: the more people believe it has value, the more valuable it becomes, and vice versa. Therefore, BTC is a financialized expression of humanity's distrust of its own institutional capabilities. Its ceiling depends on the depth and breadth of this distrust, and its floor depends on the existence of a superior alternative.</p></div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/207da1a905ff22bf46d438aba27e60d5.jpg",
            "link": "https://www.coinlive.com/news/vitalik-buterin-unveils-ethereum-s-quantum-resistant-roadmap-us-lawmakers-propose-blockchain",
            "pub_date": "2026-02-27 07:43:24",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 250292,
            "title": "Golden Web3.0 Daily Report | Citigroup to Integrate Bitcoin This Year",
            "description": "<div class=\"share___SVvtl\"><div><h2 style=\"text-align: left;\"><strong>DeFi Data</strong></h2><p style=\"text-align: left;\"><strong>1. Total Market Cap of DeFi Tokens: $50.601 billion</strong></p><p style=\"text-align:center\"><strong><img alt=\"0kKooctvKUnmAH04vlxznn62MOcSYCSivR5Ld7Jv.png\" src=\"https://img.jinse.com.cn/7435822_watermarknone.png\" title=\"7435822\"/></strong></p><p style=\"text-align:center\"><img ...=\"\" alt=\"SifEy5tOCMyCri6IuGgh5kHfwZMH0LHP2cZThq3P.png\" src=\"https://img.jinse.com.cn/7435823_watermarknone.png\" title=\"7435823\"/></p><p style=\"text-align: center;\">DeFi Total Market Cap Data Source: coingecko</p><p style=\"text-align: left;\"><strong>2. Trading volume of decentralized exchanges in the past 24 hours: $52.89</strong></p><p style=\"text-align:center\"><strong><img alt=\"TSEmglkJEFy8MF8zGAwn7clQWKHRzhUfseQzC0WD.png\" src=\"https://img.jinse.com.cn/7435825_watermarknone.png\" title=\"7435825\"/></strong></p><p style=\"text-align:center\"><strong><img src=\"https://img.jinse.com.cn/7435824_watermarknone.png\"/></strong></p> title=\"7435824\" alt=\"XeuZd7hCxAI2rXm4t06FlJMOR6RGg2ZHImgxWFgP.png\"&gt;<p style=\"text-align: center;\">Trading volume of decentralized exchanges in the past 24 hours. Data source: coingecko</p><p style=\"text-align: left;\"><strong>3. Assets locked in DeFi: $963.99 billion</strong><strong>$100 million</strong></p><p style=\"text-align:center\"><img alt=\"FgzeSNWbrK5pEow6znTgHPdgyOHtOFGhW3FKCIkf.png\" src=\"https://img.jinse.com.cn/7435826_watermarknone.png\" title=\"7435826\"/></p><p style=\"text-align:center\"><img and=\"\" assets=\"\" by=\"\" defi=\"\" defillama=\"\" locked=\"\" projects=\"\" source:=\"\" style=\"text-align: center;\" top=\"\" total=\"\" value=\"\"/>Top 10 DeFi Projects by Locked Assets and Total Value Locked (Data Source: defillama)</p><h2 style=\"text-align: left;\"><strong>NFT Data</strong></h2><p style=\"text-align: left;\"><strong>1. Total Market Value of NFTs: $7.595 Billion</strong></p><p style=\"text-align:center\"><strong><img src=\"https://img.jinse.com.cn/7435828_watermarknone.png\" title=\"7435828\"/></strong></p> alt=\"nvqThxYW4cL6hw0mp2Vz37gki0nSqHaaE4jIOthy.png\"&gt;<p style=\"text-align:center\"><strong><img alt=\"u71uTRMWR3iGOIxTmy67VIn2OVttYJobGyLBVFnh.png\" src=\"https://img.jinse.com.cn/7435829_watermarknone.png\" title=\"7435829\"/></strong></p><p style=\"text-align: center;\">NFT Total Market Capitalization, Top Ten Projects by Market Capitalization Data Source: Coinmarketcap</p><p style=\"text-align: left;\"><strong>2.24-hour NFT transaction volume: $1.367 billion</strong><strong>USD</strong></p><p style=\"text-align:center\"><strong><img ...=\"\" according=\"\" ago=\"\" an=\"\" analyst=\"\" banking=\"\" be=\"\" billion=\"\" bitcoin=\"\" citigroup=\"\" core=\"\" ember=\"\" first=\"\" for=\"\" from=\"\" hour=\"\" in=\"\" included=\"\" integrate=\"\" is=\"\" it=\"\" july=\"\" kraken=\"\" last=\"\" launched=\"\" linked=\"\" million=\"\" of=\"\" on-chain=\"\" pump=\"\" received=\"\" representing=\"\" saying=\"\" stated=\"\" supply.=\"\" system.=\"\" that=\"\" the=\"\" this=\"\" to=\"\" total=\"\" transferred=\"\" vault=\"\" wallet=\"\" was=\"\" were=\"\" when=\"\" will=\"\" year=\"\" year.=\"\"/><h2 style=\"text-align: left;\">DeFi Hot Topics</h2><p style=\"text-align: left;\"><strong>1. Tether and Circle Expand Recruitment and Business in South Korea</strong></p><p style=\"text-align: left;\">According to South Korean media News1, industry insiders revealed that stablecoin issuer Tether recently posted recruitment information for South Korean employees, including public relations managers, blockchain investigators, and government relations specialists. Tether entered the South Korean market last year by hiring a South Korean market representative, but after that representative left the company, the company decided to expand its workforce on a larger scale. In addition, another virtual asset industry insider said, \"Circle has been effectively developing its lending business in South Korea since Circle's CEO visited South Korea last August.\" This move seems to be in response to South Korean regulations targeting overseas stablecoin issuers. The upcoming Digital Assets Basic Law (Phase II Virtual Assets Act) is expected to include relevant provisions requiring overseas stablecoin issuers to establish branches in South Korea in order to distribute their tokens in the South Korean domestic market. This means that even stablecoin issuers like Tether and Circle will need to establish branches in South Korea. 2. Willy Woo: Bitcoin Bear Market Originated from Large-Scale Selling of Bitcoin by Early Whales According to Jinse Finance, renowned analyst Willy Woo commented on the event that \"since November 2025, Jane Street Group has been experiencing large-scale selling of Bitcoin and related ETF shares every day at 10 AM when the US stock market opens,\" stating that the essence of the Bitcoin bear market is that the large-scale selling of Bitcoin by early whales far exceeds the amount of new funds entering the market. This is clearly visible on the blockchain. 3. ListaDAO Launches On-Chain Credit System, Focusing on Unsecured Loans According to Jinse Finance, DeFi protocol ListaDAO announced the launch of Lista Credit, claiming it to be the first on-chain credit lending system, aiming to provide users with a financing channel without collateral. This product allows users to borrow money at any time based on their cash flow needs, attempting to break through the current DeFi lending model that mainly relies on over-collateralization.\n\nAccording to the official introduction, Lista Credit uses a token incentive mechanism to support repayment. Borrowers can reduce repayment costs through daily and weekly LISTA incentives, while also supporting lending and repayment with the stable asset U to enhance the flexibility of fund use.\n\nListaDAO stated that this move marks a shift in the DeFi lending model from \"collateral-driven\" to \"credit-driven.\" If this model is successfully implemented, it may open up new application spaces for on-chain consumer finance, operating finance, and cash flow management scenarios. </p><ol class=\"list-paddingleft-2\"></ol><p style=\"text-align: left;\"><strong>4. GoPlus: Android malware PromptSpy can remotely control victim devices</strong></p><p style=\"text-align: left;\">According to Jinse Finance, security agency GoPlus Security disclosed a new type of Android malware, PromptSpy. This software can remotely control victim devices and use artificial intelligence technology to make malicious behavior decisions in real time, improving stealth and attack accuracy.</p><p> GoPlus advises users not to install APK files from unofficial channels, to be cautious when granting applications accessibility permissions, and to enable Google Play Protect real-time protection. According to Jinse Finance, ETHZilla, the former Ethereum vault company, announced that it will rebrand as Forum Markets next month and adopt a new Nasdaq stock code, officially shifting its business from cryptocurrency exposure on its balance sheet to tokenized real-world assets (RWA).\n\nThis move comes a week after the company announced it was abandoning the Ethereum balance sheet model, prompting investors to withdraw. Observers point out that the single-asset vault strategy relies on a sustained equity premium and a strong market environment. </p><ol class=\"list-paddingleft-2\"></ol><p style=\"text-align: left;\"><strong>Disclaimer: Jinse Finance, as a blockchain information platform, publishes articles for informational purposes only and does not constitute actual investment advice. Please establish sound investment principles and be sure to enhance your risk awareness.</strong></p></strong></p></div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/10a3cb04c639e2601c05d94c93aebf67.jpg",
            "link": "https://www.coinlive.com/news/golden-web3-0-daily-report-citigroup-to-integrate-bitcoin-this",
            "pub_date": "2026-02-26 21:50:31",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 250291,
            "title": "Whose fig leaf did ZachXBT just tear off?",
            "description": "<div class=\"share___SVvtl\"><div>An anonymous investigator with a cartoon platypus head could trigger a panic-driven self-investigation of the entire crypto industry with just a single teaser tweet—this isn't science fiction, but a real industry earthquake that occurred in February 2026. On February 24, 2026, renowned blockchain detective ZachXBT posted a short teaser on the X platform: \"On February 26th, I will expose one of the most profitable companies in the crypto industry, whose multiple employees have been using insider information for large-scale insider trading.\" This tweet quickly garnered 8 million views and 27,000 likes, setting a new personal record for him. The market reaction was far more intense than anticipated. The prediction market Polymarket quickly launched a contract predicting which company ZachXBT would expose for insider trading, with total trading volume soaring to over $30 million. The Solana ecosystem protocol Meteora was initially considered the prime suspect with a 48% probability. The entire crypto community descended into a game of fear and intrigue, searching for the \"insider.\" This precisely exposes a harsh reality within the crypto industry: insider trading is not an isolated phenomenon, but a systemic problem. When a mere mention of a platypus can send shivers down the spine of the entire industry, we are compelled to ask: Whose veil has ZachXBT lifted? <h2 style=\"text-align: left;\">01 Detective and Prey: An Asymmetrical War of Transparency</h2><p style=\"text-align: left;\">To understand the industry earthquake triggered by ZachXBT, we must first recognize the unique position of this \"on-chain Sherlock Holmes.\" This retail investor, who lost $15,000 in a 2018 wallet hack and subsequently taught himself blockchain analysis, has now become one of the most feared investigative forces in the crypto world.</p><p style=\"text-align: left;\">ZachXBT's working methods embody the paradox of blockchain technology's transparency. He utilizes fully public on-chain data—transaction flows, wallet clusters, mixer models—combined with traditional open-source intelligence gathering to construct a convincing chain of evidence. His past achievements include: directly recovering $210 million in stolen funds, assisting in the arrest of suspects related to the Terra crash, and exposing more than 25 attacks by the North Korean hacking group Lazarus Group.</p><p> The narrative of \"one man against the entire dark forest\" holds true because of the regulatory vacuum in the crypto industry. Traditional financial markets have regulatory bodies like the SEC and CFTC, with clear definitions and legal consequences for insider trading. In the crypto world, however, the gap between regulatory lag and the speed of technological innovation creates enormous arbitrage opportunities. ZachXBT's influence is essentially a form of \"alternative regulation.\" While formal regulatory bodies are still trying to understand the basic concepts of blockchain, this anonymous detective has already conducted enforcement actions using code and data analysis. His presence has changed industry behavior—fraudsters now know that transferring stolen funds could be the start of a public investigation. 02 Under the Fig Leaf: The Three Masks of Insider Trading ZachXBT's investigation announcement triggered industry-wide panic because it touched on the three most sensitive nerves regarding insider trading in the crypto industry. **First Mask: Exchange Employees' \"Information Privileges\"**. This model is considered classic insider trading in traditional financial markets, but it has long existed in a gray area in the crypto world. Exchanges play the dual role of referee and player, giving their employees far more access to core data than traditional brokerages. **Second Mask: Market Makers' \"Algorithmic Manipulation\"**. Almost simultaneously with the ZachXBT investigation, Wall Street quantitative giant Jane Street is facing insider trading allegations. The lawsuit alleges that Jane Street employees obtained non-public information about Terraform Labs' liquidity operations through a private chat group called \"Bryce's Secret.\" On May 7, 2022, less than ten minutes after Terraform Labs withdrew $150 million of UST from Curve 3pool, wallets associated with Jane Street withdrew $85 million of UST, directly accelerating UST's de-anchoring and the evaporation of $40 billion in market value. Even more disturbingly, Jane Street was accused of running a \"10 AM crash algorithm.\" Blockchain analysts discovered that throughout 2025, Bitcoin experienced a sudden sell-off every trading day at 10 AM Eastern Time (coinciding with the opening time of the US stock market), triggering leveraged long liquidations followed by a rapid price rebound. After Jane Street was sued, this pattern abruptly stopped, and Bitcoin saw its largest single-day gain in months. The third mask: \"Legitimized insider trading\" in prediction markets. The frenzied betting on ZachXBT investigation subjects on Polymarket is itself an irony of the industry's current state. Users are attempting to \"trade insider information about insider trading investigations.\" This is not an isolated case: in December 2025, multiple accounts accurately bet on the week before OpenAI released GPT-5.2, profiting over $13,000; one account profited $1 million in a single day by betting on Google search data. In January 2026, a new account placed a $30,000 bet before Maduro was detained and profited $400,000 within 24 hours. Polymarket's rules actually encourage betting based on private information, arguing that this reflects market efficiency. However, when this \"efficiency\" is built on information asymmetry, it is essentially a variant of insider trading. 03 Systemic Disease: Why is Insider Trading So Difficult to Eradicate in the Crypto Industry? The rampant insider trading in the crypto industry is not accidental, but a systemic disease determined by its underlying logic and current stage of development. The conflict between technological transparency and human greed is the fundamental contradiction. Blockchain technology is inherently transparent; every transaction is recorded on a public ledger. However, this technological transparency does not automatically translate into behavioral transparency. Instead, it creates the illusion that since everything is on-chain, there should be no black box operations. The reality is quite the opposite—transparent data requires professional interpretation, and the right to interpret it often resides in the hands of a few. The business model of regulatory arbitrage fuels this phenomenon. Many crypto companies headquartered in jurisdictions with lax regulations, exploiting differences in regulatory standards across countries for arbitrage. Jane Street was fined $560 million in India for cross-market manipulation, but this did not deter similar activities in other markets. The culture of early, unregulated growth in the industry has not completely faded. From its inception, the crypto industry has been strongly anti-establishment and anti-regulatory; the concept of \"code is law\" was initially simplified to \"no law.\" Although mainstream institutions are entering the market, the cultural inertia of profiting from information asymmetry remains strong. The difficulty of investigating complex violations further complicates the issue. Insider trading in the crypto industry is often intertwined with other violations such as market manipulation, money laundering, and fraud. As the Jane Street case illustrates, insider trading accelerated market crashes, which in turn created new opportunities for manipulation. This \"illegal ecosystem\" makes investigation and evidence collection exceptionally difficult. </p><h2 style=\"text-align: left;\">04 Traditional vs. Crypto: The \"Evolution\" of Insider Trading</h2><p style=\"text-align: left;\">Comparing insider trading models in traditional and crypto finance reveals some disturbing \"evolutionary\" trends.</p><p style=\"text-align: left;\"><strong>Anonymity shifts from interpersonal networks to technological networks.</strong> Traditional insider trading relies on offline communication such as phone calls and meetings, while insider information in the crypto world can be instantly transmitted globally through encrypted chat software and dark web forums. Jane Street's \"Bryce's Secret\" Telegram group is a typical example.</p><p style=\"text-align: left;\"><strong>Operational methods shift from manual decision-making to algorithmic execution.</strong> Traditional insider traders need to place orders manually, while crypto market makers can write algorithms to automatically execute insider trading strategies.</p><p style=\"text-align: left;\"><strong>Operational methods shift from manual decision-making to algorithmic execution.</strong> If the allegations against Jane Street regarding the \"10 AM crash algorithm\" are true, it represents an extreme case of algorithmic insider trading. The impact has shifted from localized markets to global reach. Traditional insider trading typically affects a single market or asset, but the 24/7 global trading nature of the crypto market allows its effects to instantly impact investors worldwide. The Terra crash wiped out $40 billion in market capitalization, with victims across the globe. Regulatory arbitrage has shifted from geographical avoidance to technological avoidance. Traditional financial institutions evade regulation by registering in tax havens, while crypto companies leverage the anonymity and cross-border nature of blockchain to create a more sophisticated form of regulatory arbitrage. 05 Behind the Fig Leaf: What Kind of Transparency Revolution Does the Industry Need? ZachXBT's investigation acts as a mirror, reflecting the truth the crypto industry least wants to face. The issue isn't whether insider trading exists, but whether the industry is prepared for a genuine revolution in transparency. Technological transparency is not ethical transparency—this is the first lesson the industry must learn. Blockchain can ensure the immutability of transaction data, but it cannot guarantee the purity of transaction motives. The industry needs to establish ethical standards that go beyond code. The paradox of decentralized ideals requiring centralized accountability urgently needs to be resolved. The crypto world champions decentralization, but effective regulation requires a clearly defined accountable body. How to maintain the advantages of decentralization while establishing an effective governance structure is key to the industry's maturity. Regulatory innovation must keep pace with technological innovation. Traditional financial regulatory frameworks, built on paper transactions and T+2 settlements, are completely unsuitable for the real-time and global nature of the crypto world. Regulators need to learn, like ZachXBT, to use blockchain tools to regulate the blockchain world. Investor education needs to shift from \"get-rich-quick myths\" to \"risk awareness.\" Too many investors are attracted by high returns but lack basic understanding of systemic risks such as insider trading and market manipulation. The industry has a responsibility to provide more comprehensive risk disclosure. ZachXBT's platypus icon cast a shadow over the crypto world that is far longer than many are willing to admit. The market panic triggered by his investigative announcements was not fear of a specific company, but a collective anxiety about the ethical bottom line of the entire industry. When Polymarket users frantically bet on who the next \"mole\" will be, when Jane Street's algorithm is accused of regularly dumping tokens and profiting from retail investors, when exchange employees use listing information for personal gain—these are not isolated incidents, but different symptoms of the same disease. The disease is called structural information asymmetry, and the cure is called systemic transparency. The veil lifted by ZachXBT exposes not just a few bad apples, but an entire orchard in dire need of overhaul. The crypto industry stands at a crossroads: will it continue its unchecked growth in a regulatory vacuum, ultimately self-destructing due to a collapse in trust; or will it proactively embrace a revolution in transparency, establishing a trustworthy new financial paradigm? The answer will determine whether this industry becomes the hope for financial democratization or merely a speculative casino of Wall Street 2.0. And time is ticking away.</p></div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/e23dd43c4b42b7ec1840003fb552b958.jpg",
            "link": "https://www.coinlive.com/news/whose-fig-leaf-did-zachxbt-just-tear-off",
            "pub_date": "2026-02-26 21:53:12",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 250289,
            "title": "Jane Street scandal exposed",
            "description": "<div class=\"share___SVvtl\"><div>This powerful trading firm, which you may have never heard of, has been caught red-handed. And twice, on two different continents. This is precisely why Bitcoin has finally gained its freedom. Let me explain: Jane Street Group is a New York-based quantitative trading firm. They don't have a CEO. According to their own description, they operate like an \"anarchist commune.\" In the first nine months of 2025 alone, their net trading revenue reached $24 billion, surpassing their total revenue of $20.5 billion for the entire year of 2024. In the second quarter of 2025 alone, their revenue reached $10.1 billion, the highest quarterly trading revenue ever recorded by any Wall Street firm. From any perspective, they are the most profitable trading firm in the world. This week, the bankruptcy administrator of Terraform Labs filed a lawsuit in Manhattan federal court, accusing Jane Street of using insider information to manipulate the Terra Luna crash in May 2022. This crash wiped out $40 billion in market capitalization and triggered a chain reaction, ultimately leading to the collapse of companies such as Celsius, Three Arrows Capital, and FTX. The accusation is shockingly simple. On May 7, 2022, Terraform Labs quietly withdrew $150 million worth of UST from Curve3pool, a large decentralized liquidity pool. There was no public announcement; the liquidity was withdrawn silently. Ten minutes later, a wallet associated with Jane Street withdrew $85 million from the same liquidity pool. Just ten minutes later. The lawsuit alleges that former Terraform intern Bryce Pratt (who joined Jane Street as a full-time employee in September 2021) established secret contacts with his former colleagues at Terraform. He allegedly passed significant, non-public information regarding changes in Terraform liquidity directly to Jane Street's trading department. The lawsuit names four defendants: Jane Street Group LLC, co-founder Robert Granieri, and employees Bryce Pratt and Michael Huang. The administrator's statement hits the nail on the head: Jane Street conducted \"trades that would have been impossible without its unique insider information.\" Worse still, the lawsuit claims Jane Street's withdrawal triggered the decoupling from UST, causing the entire Terraform ecosystem to collapse. LUNA's price plummeted from over $80 to near zero, wiping out $40 billion. Ordinary people suffered devastating losses; retirement savings, children's education funds, and life's work vanished in just a few days. What was Jane Street's response? They called it \"desperate\" and \"baseless.\" But the problem is: this wasn't the first time they'd done something like this. In July 2025, the Securities and Exchange Commission of India (SEBI) filed one of the most serious market manipulation charges against Jane Street in the country's history. The SEBI investigation found that Jane Street had engaged in textbook pump-and-dump operations on the Bank Nifty index across 18 derivative maturities between January 2023 and March 2025. <p style=\"text-align:center\"><img src=\"https://img.jinse.com.cn/7435837_image3.png\"/></p><p style=\"text-align: left;\">Their methods were highly mechanical:</p><p style=\"text-align: left;\">In the morning: Jane Street's algorithm heavily bought the constituent stocks of the bank stock index and their futures, pushing the index up by 1% to 1.3%. SEBI found that on some trading days, Jane Street alone had the entire impact on the index's rise.</p><p style=\"text-align: left;\">At the same time, they bought a large number of short options, mainly selling call options and buying put options, in a ratio severely imbalanced with their stock holdings. SEBI found that, calculated by delta, option holdings were 7.3 times that of stock and futures holdings. This is not hedging or arbitrage, but rather directional manipulation with additional steps.</p> Afternoon: They reversed their actions, selling all the stocks they had bought in the morning. The index fell, and the short options profited. This operation was repeated every expiry date. The Securities and Exchange Commission of India (SEBI) assessed that the illegal profits amounted to 48.43 billion rupees, approximately $580 million. The SEBI called Jane Street's actions \"a means of deliberately manipulating settlement prices.\" They noted that Jane Street continued this strategy even after the National Stock Exchange of India (NSE) issued a clear warning in February 2025. The SEBI's wording was unusually harsh for the regulator: \"The integrity of the market, and the trust of millions of small investors and traders, can no longer be held hostage by such untrustworthy manipulators.\" Jane Street was subsequently banned from the Indian securities market. They deposited over $560 million into a third-party escrow account and immediately filed an appeal. As of now, the case is still being heard in the Indian Securities Appeals Court. Now let's talk about Bitcoin. Since November 2025, Bitcoin traders have noticed some strange phenomena. Every morning around 10 AM (Eastern Time), when the US stock market opens, the selling volume of Bitcoin and its related ETFs increases significantly. This pattern is unusually stable. Bitcoin surges overnight during Asian and European trading sessions, then immediately plummets after the New York Stock Exchange opens. (For details, please refer to Trading View's analysis and statistics)<p style=\"text-align:center\"><img src=\"https://img.jinse.com.cn/7435839_image3.png\"/></p><p style=\"text-align: left;\">These numbers are significant. The chart from December 2025 shows that on some days, the price of Bitcoin plummeted from $89,700 to $87,700 within minutes, resulting in losses of up to $171 million for leveraged long positions before recovering. This occurred repeatedly on December 1st, 5th, 8th, 10th, 12th, 15th, and in January and February 2026.</p> ... The crypto Twitter community calls this the \"10am crash.\" The blame is being placed on Jane Street, and for good reason. Jane Street is one of only four authorized participants in BlackRock's IBIT (the world's largest spot Bitcoin ETF). The other three are Virtu Americas, JPMorgan Securities, and Marex. As an authorized participant, Jane Street has unique authority to create and redeem ETF shares, meaning they are directly involved in the flow of Bitcoin among institutional investors. Their 13F filings confirm their large holdings. As of the third quarter of 2025, Jane Street held $5.7 billion worth of IBIT stock. They added another $276 million in the fourth quarter of 2025, bringing their total holdings to over 20 million shares, worth approximately $790 million at year-end prices. At its peak, their IBIT stock holdings were worth close to $2.5 billion. However, what is suspicious is that Jane Street allegedly sold off spot Bitcoin every morning, while simultaneously increasing their holdings of MSTR (Strategy, formerly MicroStrategy) stock by 473% in the fourth quarter of 2025, accumulating 951,187 shares, worth approximately $121 million. Meanwhile, other large funds, such as BlackRock and Vanguard, were selling billions of dollars worth of MSTR stock. Think about it: sell Bitcoin at the open, causing a price crash, liquidating leveraged long positions, and then buying it back at an even lower price. Simultaneously, buy large amounts of the most leveraged Bitcoin alternatives on the market, then wait for the inevitable rebound. Glassnode co-founders Jan Happel and Yann Allemann reignited this theory through their Negentropic account, linking algorithmic trading to the Terraform lawsuit. The Milk Road account further reinforced the theory, describing \"persistent rumors\" about institutional trading departments operating \"very specific/questionable operating manuals.\" Then the lawsuit was filed. Then something extraordinary happened. The expected 10am crash after Terraform filed its lawsuit against Jane Street…didn't happen. For the first time in months, Bitcoin didn't crash at the US open. Instead, it rose. On February 25, 2026, Bitcoin surged over 3%, breaking through multiple resistance levels and trading above $68,000, whereas just days earlier it might have even fallen below $60,000. Over $323 million in short positions were liquidated. The Stochastic Relative Strength Index (Stochastic RSI) reached 100. ETFs saw a record $257.7 million in inflow in a single day, the highest since early February. This pattern has been broken. Now, I want to be cautious. Correlation does not equal causation. Multiple factors are at play: Trump's State of the Union address, oversold technical conditions, and short covering. The Fear &amp; Greed Index reached 11, indicating extreme panic, which typically signals a turning point for contrarian trading. The RSI fell to 15.80, a level not seen since the 2020 COVID-19 crash, which was followed by a 1400% rebound. But timing is not to be ignored. Rumors are circulating on X that Jane Street was \"forced to shut down their trading algorithm\" after the lawsuit. Jane Street told Cointelegraph that these claims are \"baseless and opportunistic accusations.\" Whether they were forced to stop or chose to suspend operations out of legal caution, the result was the same: the selling pressure disappeared. What does this really mean for Bitcoin? Spot Bitcoin ETFs were initially expected to act as market equalizers. They had institutional access, were regulated products, and were endorsed by BlackRock. And they did achieve tremendous success, with IBIT alone raising over $20 billion since its launch. However, the structure of ETFs introduced something Bitcoin originally intended to circumvent: privileged, trusted intermediaries with access to the core trading system. When the U.S. Securities and Exchange Commission (SEC) approved spot Bitcoin ETFs in January 2024, it stipulated that subscriptions and redemptions could only be made in cash. Each time subscriptions or redemptions were needed, someone had to buy and sell actual Bitcoin. The institutions participating in this process, i.e., authorized participants, possess a structural advantage over all other participants in the market. In September 2025, the U.S. Securities and Exchange Commission (SEC) approved the physical creation and redemption of IBIT, meaning authorized participants can now directly exchange Bitcoin for ETF units without going through fiat currency. This gives institutions like Jane Street, Virtu, JPMorgan Chase, and Marex greater direct control over Bitcoin inflows and outflows in this largest institutional-grade ETF. The 10am plunge is essentially a symptom of the same intractable problem that has plagued the gold market for decades. As I explained in my article \"The Beginning of the Gold Endgame\": the competition between simulated trading platforms allows institutions with the most privileges to manipulate prices before other market participants can react. JPMorgan Chase traders Greg Smith and Michael Novak were convicted of fraud in the precious metals futures market, a scheme that lasted eight years and involved thousands of illegal transactions. JPMorgan Chase paid a $920 million settlement. Deutsche Bank also paid $30 million for the same offense. UBS, HSBC, and six individual traders faced charges from the Commodity Futures Trading Commission (CFTC) for violating anti-fraud measures. Same tactics, different assets. Each time, these companies called it \"market making,\" \"arbitrage,\" or \"hedging\"—the euphemisms are numerous. The result is always the same: ordinary people get ripped off, while insiders profit. So, what do we do next? The broader structural problems haven't changed. The $4.5 billion outflow from ETFs in the first eight weeks of 2026 is worrying, but Strategy (Saylor's company) just bought $39 million worth of Bitcoin, accounting for 99% of all publicly traded companies' Bitcoin purchases during that period. Large institutions aren't selling off; they're waiting for the algorithm to finish its work. Perhaps, the algorithm really has. If Jane Street is forced to halt its so-called daily sell-off program (whether due to legal risks, multi-continental regulatory scrutiny, or simply self-preservation), the structural resistance that has plagued Bitcoin for four months will be eliminated. Bitcoin was born for this moment. It is a monetary system that does not rely on trusted intermediaries, requires no authorized participants, and cannot be preemptively traded by former interns through private channels. But let's not forget what brought us to this point. Companies that were supposed to be \"market makers\" and \"liquidity providers\" have been accused of front-trading, manipulating national stock indices, and running daily algorithmic sell-off programs to trade assets tracked by their ETFs. And this is precisely the system that Bitcoin aims to replace.</div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/d48055b229a989e0984fd1c4011f57da.jpg",
            "link": "https://www.coinlive.com/news/jane-street-scandal-exposed",
            "pub_date": "2026-02-26 21:45:32",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        },
        {
            "id": 250287,
            "title": "Deciphering EF's Latest Protocol Roadmap: Is It Officially Entering the Era of Engineering Upgrades?",
            "description": "<div class=\"share___SVvtl\"><div><p style=\"text-align: left;\"><strong>Written by:</strong>imToken</p><p style=\"text-align: left;\">On February 18th, the Ethereum Foundation (EF) released the \"Protocol Priorities Update for 2026.\" Compared to previous fragmented updates centered around EIPs, this roadmap is more like a strategic schedule, clearly defining the upgrade pace, priority allocation, and the three main themes that the protocol layer will revolve around in the coming year: Scale, Improve UX, and Harden the L1.</p><p style=\"text-align: left;\">Behind this, from the successful delivery of the two hard forks (Pectra/Fusaka) in 2025 to the early planning of the dual main themes of Glamsterdam and Hegotá in 2026, we have also seen a profound shift in Ethereum development towards \"predictable engineering delivery,\" which may be the most important protocol layer signal in recent years.</p><h2 style=\"text-align: left;\"><span style=\"font-size:24px;\">I. Ethereum in 2025: Turmoil and Institutionalization</span></h2><p style=\"text-align: left;\">If you've been following Ethereum, you'll know that 2025 was a year of intertwined contradictions for the protocol. While the price of ETH may have hovered at a low level, the protocol layer underwent unprecedented and intensive changes.</p><p style=\"text-align: left;\"> Especially in early 2025, Ethereum experienced a rather awkward period. At that time, EF was at the center of a media storm—community criticism was rampant, and some even called for the introduction of a so-called \"wartime CEO\" to drive change. Ultimately, a series of internal power struggles became public, forcing the highest-level power reorganization in EF's history: In February, Executive Director Aya Miyaguchi was promoted to President, and Vitalik Buterin promised to restructure the leadership; Subsequently, Hsiao-Wei Wang and Tomasz K. Stańczak became co-executive directors; and Etherealize, a new marketing narrative agency led by former researcher Danny Ryan, was established; Meanwhile, EF further restructured its board of directors and clarified its cypherpunk values; By mid-year, the foundation also restructured its R&amp;D department, integrating teams and making personnel adjustments to ensure that core protocol priorities were focused; This series of measures proved effective, significantly strengthening Ethereum's execution capabilities. Especially with the successful implementation of the Fusaka upgrade at the end of the year, just seven months after the Pectra upgrade in May, it demonstrated that EF, despite significant leadership changes, still had the ability to drive major updates, marking Ethereum's entry into an accelerated development pace of \"two hard forks per year.\" Since the network transitioned to PoS through The Merge in September 2022, the Ethereum network has essentially focused on only one major upgrade per year, such as the Shapella upgrade in April 2023 and the Dencun upgrade in March 2024: the former opened staking withdrawals, completing a key step in the PoS transition; the latter launched EIP-4844, officially opening the Blob data channel, significantly reducing L2 costs. In 2025, two important hard fork upgrades, Pectra and Fusaka, were completed. More importantly, 2025 saw the first systematic planning of naming upgrades for the next two years: Glamsterdam and Hegotá. While there's no official written rule, it's interesting that late last year, The Block cited a Consensys source saying that since The Merge, Ethereum researchers aimed for a major upgrade every year, but now they are planning to \"accelerate the pace of hard forks, switching to once every six months,\" and explicitly stated that Fusaka initiated Ethereum's twice-yearly upgrade cycle. This \"institutional\" change regarding the upgrade schedule can be considered a milestone. The reason is simple: previously, the release schedule depended more on the development readiness, and for developers and infrastructure, the expected window was unstable, and as those familiar with the industry know, delays were not uncommon. This also means that the successful delivery of the two major upgrades in 2025 validated the feasibility of \"upgrades every six months.\" The systematic planning of two named upgrades (Glamsterdam and Hegotá) in 2026, with priority arrangements around these two nodes across three development tracks, represents a further institutionalization. Theoretically, this is somewhat similar to the release schedule of Apple or Android systems, aiming to reduce uncertainty for developers and potentially bringing three positive impacts: enhanced L2 predictability, such as allowing Rollups to plan parameter adjustments and protocol adaptations in advance; clear wallet and infrastructure adaptation windows, enabling product teams to plan compatibility and feature launches according to schedule; and stable institutional risk assessment cycles, meaning upgrades are no longer unexpected events but a regular engineering practice. This structured rhythm is essentially a manifestation of engineering management and also highlights Ethereum's shift from scientific research to engineering delivery. II. The Three Pillars of Protocol Development in 2026 A closer look at the 2026 protocol priority update plan reveals that EF no longer simply lists scattered EIPs, but reorganizes protocol development into three strategic directions: Scale, Improve UX, and Harden the L1. First is Scale, which merges the original \"Scale L1\" and \"Scale blobs\" because EF recognizes that scaling the L1 execution layer and broadening the data availability layer are two sides of the same coin. Therefore, the most eye-catching technology in the upcoming Glamsterdam upgrade in the first half of the year is \"Block-level Access Lists,\" which aims to completely change Ethereum's existing transaction execution model—which can be understood as changing from a \"single lane\" of sequential processing to a \"multi-lane\" of parallel processing: Block producers will pre-calculate and mark which transactions can run simultaneously without conflict, and clients can then allocate transactions to multiple CPU cores for parallel processing, thereby greatly improving efficiency; at the same time, ePBS (built-in proposer-builder separation) will also be included in the upgrade, embedding the MEV-Boost process, which currently relies on external relays, into the protocol itself, not only reducing the risk of centralization but also providing validators with a more ample time window to verify ZK proofs. With these underlying optimizations, the race to increase the Gas cap will intensify in 2026. EF has already set a clear goal of \"moving towards 100 million and above,\" with radical proponents even predicting that after ePBS, the Gas cap could double to 200 million or even higher. For L2, increasing the number of blobs is equally crucial, with the number of data blocks per block expected to increase to over 72, supporting hundreds of thousands of transactions per second on the L2 network. Secondly, there's the Improve UX, aiming to eliminate cross-chain barriers and popularize cross-chain interoperability and native account abstraction. As mentioned earlier, EF believes the core of solving L2 fragmentation lies in making Ethereum \"feel like a chain again,\" a vision that relies on the maturity of the intent architecture. For example, the Open Intents Framework, launched by EF in collaboration with multiple teams, is becoming a universal standard. It allows users to simply declare their desired outcome when transferring assets between L2 blockchains, while the underlying solver network performs the complex path calculations. The Ethereum Interoperability Layer (EIL) goes a step further, attempting to build a trustless transport layer, aiming to provide cross-L2 transactions with an experience indistinguishable from single-chain transactions. At the wallet level, native account abstraction will remain a key focus this year. Following the first step with EIP-7702 in Pectra in 2025, EF plans to push for proposals such as EIP-7701 or EIP-8141 in 2026. The ultimate goal is to make every wallet on Ethereum a smart contract wallet by default, completely eliminating complex EOA wallets and additional gas payment intermediaries. Furthermore, the implementation of L1 fast confirmation rules will significantly reduce confirmation time from the current 13-19 minutes to 15-30 seconds. This will directly benefit all cross-chain applications that rely on L1 finality, which is of great significance for cross-chain bridges, stablecoin settlement, and RWA asset trading. Finally, there's Harden the L1, aiming at a trillion-dollar security defense line. This is also due to the increasing value locked in the Ethereum ecosystem, elevating the security resilience of the L1 layer to a strategic level. Regarding censorship resistance, FOCIL (Fork Selective Include List, EIP-7805) is becoming a core solution. It empowers multiple validators to force specific transactions to be included in blocks. Even if block producers attempt to censor, as long as a portion of the network is honest, the user's transaction will eventually be recorded on the chain. Facing the long-term threat of quantum computing, EF established a new post-quantum (PQ) research team at the beginning of the year. Their work in 2026 will focus on researching quantum-resistant signature algorithms and considering how to seamlessly migrate them to the Ethereum mainnet, ensuring the security of billions of dollars in assets in the future is not threatened by quantum algorithm cracking. III. A More \"Collaborative\" Ethereum is Coming. In general, if one word could summarize Ethereum in 2026, it would be \"collaboration.\" Upgrades will no longer revolve around a single explosive innovation, but rather around the coordinated advancement of three main lines: **Scale** handles throughput and cost; **Improve UX** handles usability and adoption; and **Harden the L1** handles security and neutrality. These three elements together determine whether Ethereum can support the on-chain economy of the next decade. Meanwhile, more noteworthy than the technology roadmap is the strategic shift reflected behind this \"three-track\" structure. As mentioned above, when the Fusaka upgrade is successfully completed at the end of 2025 and the rhythm of two hard forks per year is established, Ethereum has actually completed a \"systematic\" leap in its development model. The priority update released in early 2026 further extends this institutionalization to the planning level of technology direction—in the past, Ethereum upgrades often revolved around a \"star proposal\" (such as EIP-1559, merge, EIP-4844), but now, upgrades are no longer defined by a single proposal, but consist of the coordinated advancement of three tracks. From a broader perspective, 2026 is also a crucial year for the reconstruction of Ethereum's \"value narrative.\" In recent years, market pricing of Ethereum has largely revolved around the \"fee increases brought about by L2 scaling.\" However, with improvements in mainnet performance and the shift of L2's positioning from \"sharding\" to \"trust spectrum,\" Ethereum's core value is being re-anchored to its irreplaceable position as \"the world's most secure settlement layer.\" What does this mean? Simply put, Ethereum is transforming from a platform reliant on \"transaction fee revenue\" into an asset anchor reliant on a \"security premium.\" The profound impact of this shift may gradually become apparent in the coming years—when stablecoin issuers, RWA tokenization institutions, and sovereign wealth funds choose their settlement layer, they will not choose the cheapest network, but the most secure one. Ethereum is truly evolving from a \"technology testing ground\" into an \"engineering delivery platform,\" and the institutionalization of Ethereum protocol governance may truly mature by 2026. And we may be at a peculiar juncture: the underlying technology is becoming increasingly complex (such as parallel execution and the PQ algorithm), but the user experience is becoming increasingly simple. The maturity of account abstraction and intent frameworks is pushing Ethereum towards that ideal endpoint—returning Web3 to user intuition. If this can truly be achieved, Ethereum in 2026 could very well transform from a blockchain testing ground into a global financial foundation capable of supporting trillions of dollars in assets, where users don't need to understand the underlying protocol.</p></div></div>",
            "image": "https://image.coinlive.com/cryptotwits-static/a37e598cc058d09ce6cee2f712f2822c.jpg",
            "link": "https://www.coinlive.com/news/deciphering-ef-s-latest-protocol-roadmap-is-it-officially-entering-the",
            "pub_date": "2026-02-26 21:39:31",
            "source": "coinlive_articles",
            "kind": 1,
            "language": "en"
        }
    ]
}