{
    "data": [
        {
            "id": 1051431,
            "title": "India's Economic Growth Forecast Revised Upward Amid New Framework",
            "description": "India's economy is projected to expand at a faster rate than earlier anticipated for this financial year, following the introduction of a new framework for calculating economic output. Bloomberg posted on X, highlighting the resilience of the world's most populous nation in the face of global trade disruptions. The revised growth outlook underscores India's ability to navigate challenges in the international trade environment, suggesting a robust economic performance despite external pressures.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051431&language=en-US",
            "pub_date": "2026-02-27 10:41:08",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051430,
            "title": "GEOPOLITICS | Oman's Foreign Minister to Meet U.S. Vice President in Washington",
            "description": "Oman's Foreign Minister is scheduled to meet with U.S. Vice President Vance and other American officials in Washington on Friday. According to Jin10, the discussions are expected to focus on strengthening diplomatic ties and addressing regional issues. This meeting underscores the ongoing efforts to enhance cooperation between Oman and the United States, particularly in areas of mutual interest. The visit highlights the importance of diplomatic engagement in fostering international relations and addressing geopolitical challenges.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051430&language=en-US",
            "pub_date": "2026-02-27 10:44:31",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051429,
            "title": "BNB Surpasses 630 USDT with a 0.51% Increase in 24 Hours",
            "description": "On Feb 27, 2026, 02:49 AM(UTC). According to Binance Market Data, BNB has crossed the 630 USDT benchmark and is now trading at 630 USDT, with a narrowed 0.51% increase in 24 hours.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051429&language=en-US",
            "pub_date": "2026-02-27 10:49:07",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051426,
            "title": "USDC and Circle CCTP will be launched on Morph, providing native USD settlement and standardized cross-chain transfers.",
            "description": "USDC and the Circle Cross-Chain Transfer Protocol (CCTP) will be listed on Morph. USDC will be issued on Morph by a regulated entity affiliated with Circle, serving as a USD-denominated settlement asset within the network and providing a more consistent USD settlement basis for payment applications. CCTP will support USDC transfers between supported blockchains via burn-and-mint. This involves burning USDC on the source chain and natively minting it on the target chain, maintaining 1:1 supply consistency and standardized settlement behavior. Applications can choose between Standard Transfer or Fast Transfer modes as needed. Morph states that USDC and CCTP will support USD settlement and cross-chain fund transfers in scenarios such as crypto cards, cross-border remittances, payment gateways, and DeFi and trading, and will advance its payment settlement layer positioning in conjunction with Morph's $150 million Payment Accelerator program.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051426&language=en-US",
            "pub_date": "2026-02-27 10:36:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051422,
            "title": "Hong Kong to Introduce Tax Concessions for Cryptocurrencies and Precious Metals",
            "description": "Hong Kong's Financial Secretary, Paul Chan, has announced plans to implement tax concessions for cryptocurrencies, precious metals, and certain commodities. According to NS3.AI, this initiative aims to attract family offices and investment funds to the region. Currently, Hong Kong hosts over 3,300 single-family offices. An amendment bill to formalize these tax incentives is expected to be introduced in early 2024, with the new tax measures set to take effect from the 2025-26 tax year.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051422&language=en-US",
            "pub_date": "2026-02-27 10:37:47",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051425,
            "title": "A whale used 3x leverage to go long on 1000 BTC, worth $67.39 million.",
            "description": "According to Onchain Lens monitoring, the whale \"pension-usdt.eth\" has opened a new 3x long position in BTC, holding 1,000 BTC worth $67.39 million, and currently has a floating profit of over $500,000.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051425&language=en-US",
            "pub_date": "2026-02-27 10:38:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051421,
            "title": "South Korea's Virtual Asset Committee to Discuss Digital Asset Legislation",
            "description": "South Korea's Financial Services Commission is set to convene the first Virtual Asset Committee meeting of the year on March 4. According to NS3.AI, the meeting will center on the government's proposed digital asset legislation, which includes potential restrictions on major shareholders in cryptocurrency exchanges and a stablecoin issuance framework primarily managed by banks. Input from private sector committee members will be instrumental in shaping the final draft of the legislation.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051421&language=en-US",
            "pub_date": "2026-02-27 10:38:02",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051413,
            "title": "Shenyu: AI will reshape corporate organizational structures, and traditional SOP models will face restructuring.",
            "description": "Shenyu, co-founder and CEO of Cobo, stated on social media that the development of AI agents will have a profound impact on corporate organizational structures. Its disruptive effect is not on individual skills, but rather on the long-standing management system centered on Standard Operating Procedures (SOPs). He pointed out that traditional enterprises regulate human execution processes by continuously adding SOPs, while simply embedding AI with autonomous planning capabilities into existing processes may lead to inefficiency. In the future, enterprises may restructure processes around \"intent and boundaries,\" with humans setting goals and rules, AI autonomously optimizing execution, and humans taking on supervisory and decision-making roles. Shenyu believes that as AI participation increases, departmental barriers and middle-level supervisory functions may weaken, and organizational structures are expected to evolve towards a more efficient and dynamic collaborative model.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051413&language=en-US",
            "pub_date": "2026-02-27 10:31:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051412,
            "title": "Philippine Peso Experiences Strong Start to the Year",
            "description": "The Philippine peso is experiencing its most robust start to the year since 2012, driven by foreign investments in the stock market and a declining US dollar. Bloomberg posted on X, highlighting the positive momentum for the currency. The influx of foreign capital into the Philippine stock market has significantly contributed to the peso's appreciation. Additionally, the weakening of the US dollar has further supported the peso's strength. This combination of factors has positioned the peso for a promising beginning to the year, marking a notable performance in the currency markets.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051412&language=en-US",
            "pub_date": "2026-02-27 10:22:50",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051411,
            "title": "Enterprise Ethereum Alliance Launches Privacy Working Group to Enhance Enterprise Adoption",
            "description": "The Enterprise Ethereum Alliance (EEA) has initiated a Privacy Working Group to advance privacy technologies for the enterprise adoption of Ethereum. According to NS3.AI, the group includes significant contributors such as Consensys, Polygon, and the Ethereum Foundation. Their objective is to map privacy solutions across the Ethereum mainnet and layer two networks. This initiative is designed to facilitate institutional deployment by tackling issues related to confidentiality, compliance, and scalability. The group plans to provide periodic updates on their findings.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051411&language=en-US",
            "pub_date": "2026-02-27 10:27:01",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051410,
            "title": "PRECIOUS METALS | Excessive Leverage in Gold Cleared as Cross-Asset Hot Money Exits",
            "description": "Excessive leverage in the gold market has been cleared, and cross-asset hot money has exited, according to Jin10. The market may shift from a 'pulse-like frenzy' to a 'steady rise,' with the options long-short ratio still favoring the bulls.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051410&language=en-US",
            "pub_date": "2026-02-27 10:27:32",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051409,
            "title": "Indonesia's Fuel Trade Scandal Leads to Prison Sentence in $17 Billion Case",
            "description": "The son of a prominent oil merchant in Indonesia has been sentenced to prison in connection with a massive $17 billion corruption scandal involving the nation's state-owned energy company. Bloomberg posted on X, highlighting the significant legal repercussions stemming from the case, which has drawn widespread attention due to its scale and impact on the country's fuel trade. The scandal has exposed deep-rooted corruption within Indonesia's energy sector, leading to increased scrutiny and calls for reform. The sentencing marks a pivotal moment in the ongoing investigation, as authorities continue to unravel the complex web of illicit activities that have plagued the industry for decades. The case underscores the challenges faced by Indonesia in combating corruption and ensuring transparency within its vital economic sectors.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051409&language=en-US",
            "pub_date": "2026-02-27 10:29:04",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051406,
            "title": "Ethereum Co-Founder Vitalik Buterin Sells Over 19,000 ETH Amid Market Slump",
            "description": "In February 2026, Ethereum co-founder Vitalik Buterin sold approximately 19,326 ETH, surpassing his initially announced amount by about 2,942 ETH. According to Foresight News, this move comes as the cryptocurrency market continues to experience a downturn, with Ethereum facing a six-month consecutive decline, reaching a monthly drop of nearly 30%.\n\nButerin had previously announced his plan to withdraw 16,384 ETH from his personal wallet on January 30, aiming to gradually liquidate the assets. This decision was made in response to the Ethereum Foundation's (EF) shift towards a 'moderate tightening' phase, intending to reduce annual spending from 15% to 5% of the treasury over five years, focusing more on core protocol development.\n\nThe funds from the sale are intended to support open-source projects and public goods, including privacy technologies, secure hardware, verifiable computing, encrypted communication, local-first software, open-source operating systems, biotechnology, and public health tools. These areas are considered crucial yet peripheral under EF's tightened focus, and Buterin emphasized his personal commitment to sharing the responsibility of EF's financial adjustments.\n\nThe entire sale process was transparent, utilizing on-chain tools for tracking. Buterin executed the sales through a single address and protocol, CoW Swap, in small batches to minimize market impact.\n\nDespite the transparency, the actual sale exceeded the initially announced amount. The sales began on February 3, paused for about ten days, and resumed on February 22, with significant acceleration in the last two days. Notably, 4,211.5 ETH were sold on February 5, 2,283 ETH on February 25, and 6,297 ETH on February 26.\n\nButerin has not provided further clarification on the discrepancy between the announced and actual sale amounts. He has previously stated that since 2018, he has not sold ETH for personal wealth accumulation, with proceeds primarily directed towards donations, open-source projects, or charitable causes.\n\nWhile Buterin's transparent approach contrasts with some projects that discreetly offload assets, potentially leading to market crashes or trust issues, his actions might still impact community and investor confidence. With the market already fragile, Buterin's sales could amplify fear, uncertainty, and doubt (FUD), potentially exacerbating the bearish market pressure and affecting Ethereum's rebound and ecosystem stability.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051406&language=en-US",
            "pub_date": "2026-02-27 10:10:08",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051405,
            "title": "JPYC Inc. Secures $11.9 Million to Expand Stablecoin Adoption",
            "description": "JPYC Inc., the issuer of the Japanese yen stablecoin JPYC, has successfully completed a $11.9 million Series B funding round, with Asteria leading the investment. According to NS3.AI, the company plans to utilize the funds to enhance its presence in the financial and Web3 ecosystems and to promote the adoption of stablecoins. JPYC is currently operational on prominent blockchain networks, including Avalanche, Ethereum, and Polygon.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051405&language=en-US",
            "pub_date": "2026-02-27 10:11:21",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051403,
            "title": "STOCKS | Japan's Topix Index Reaches Record High",
            "description": "Japan's Topix Index has surged to a historic peak, marking a significant milestone in the country's stock market. According to Jin10, this achievement reflects growing investor confidence and positive economic indicators in Japan. The rise in the Topix Index is attributed to robust corporate earnings and favorable market conditions, which have bolstered investor sentiment. Analysts suggest that this upward trend may continue if the current economic environment remains stable. The record high of the Topix Index underscores the resilience of Japan's financial markets amid global economic uncertainties.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051403&language=en-US",
            "pub_date": "2026-02-27 10:01:58",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051402,
            "title": "Pentagon Mistakenly Downs U.S. Drone on Texas-Mexico Border",
            "description": "The Pentagon has inadvertently shot down a U.S. Customs and Border Protection drone along the Texas-Mexico border using a high-energy laser. Bloomberg posted on X, citing sources familiar with the incident. The mishap highlights the complexities and potential risks associated with deploying advanced military technology in border security operations. The incident is under investigation to determine the circumstances that led to the accidental engagement. Further details on the operational protocols and safety measures are expected to be reviewed to prevent similar occurrences in the future.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051402&language=en-US",
            "pub_date": "2026-02-27 10:03:08",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051401,
            "title": "Boustead Singapore's Real Estate Trust Launches IPO to Raise $770 Million",
            "description": "Boustead Singapore's real estate investment trust has begun accepting investor orders for an initial public offering (IPO) that could generate up to $770 million. Bloomberg posted on X, highlighting that this IPO is set to be one of the largest in Singapore in recent years. The offering marks a significant move in the city-state's financial market, attracting considerable attention from investors. The trust aims to capitalize on the robust demand for real estate investments, positioning itself as a key player in the sector. This development underscores the growing interest in Singapore's real estate market, reflecting broader economic trends in the region.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051401&language=en-US",
            "pub_date": "2026-02-27 10:05:26",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051400,
            "title": "South Korea to Install 50,000 GPUs in AI Data Center",
            "description": "South Korea's Ministry of Land, Infrastructure and Transport has announced plans to install 50,000 GPUs in a new artificial intelligence data center. According to Jin10, this initiative is part of the country's broader strategy to enhance its AI capabilities and infrastructure. The data center aims to support various AI-driven applications and services, contributing to South Korea's technological advancement. The installation of these GPUs is expected to significantly boost computational power, facilitating more efficient data processing and analysis. This move aligns with South Korea's commitment to becoming a leader in the AI sector, leveraging cutting-edge technology to drive innovation and economic growth.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051400&language=en-US",
            "pub_date": "2026-02-27 10:08:09",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051394,
            "title": "LayerZero Labs co-founder: All remaining STG held by DAO has been destroyed; ZRO exchange contracts are still open.",
            "description": "Bryan Pellegrino, co-founder and CEO of LayerZero Labs, stated on social media that, as previously promised, all remaining STG tokens held by the DAO have been burned. He also noted that the STG-to-ZRO contract remains open to users, and the related renaming and exchange process is ongoing.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051394&language=en-US",
            "pub_date": "2026-02-27 10:00:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051395,
            "title": "Wikipedia co-author: Bitcoin may struggle to become a dominant currency; its price could fall below $10,000 by 2050.",
            "description": "Wikipedia co-founder Jimmy Wales posted on social media that while the view that Bitcoin will \"go to zero\" may not be accurate, its long-term price prospects remain questionable. He pointed out that the Bitcoin network is relatively robust in design and will likely continue to operate unless there are extreme circumstances such as major cryptographic vulnerabilities or 51% attacks. However, he believes that Bitcoin may not achieve dominance as a currency or store of value. Based on this assessment, Wales stated that by 2050, the price of Bitcoin may fall back to below $10,000 in present value, or even lower.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051395&language=en-US",
            "pub_date": "2026-02-27 10:00:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}