{
    "data": [
        {
            "id": 1053558,
            "title": "GEOPOLITICS | Oil Tankers Halt Passage Through Strait of Hormuz",
            "description": "Oil tankers have temporarily ceased passage through the Strait of Hormuz, according to Jin10. The Strait of Hormuz is a critical chokepoint for global oil transportation, and any disruption in this area can have significant implications for the global oil market. The reasons behind the halt in tanker movement were not immediately clear, but such interruptions often raise concerns about potential geopolitical tensions or security issues in the region. The Strait of Hormuz is strategically important as it connects the Persian Gulf with the Gulf of Oman and the Arabian Sea, making it a vital route for oil exports from the Middle East. The situation is being closely monitored by international stakeholders due to its potential impact on oil prices and global energy security.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053558&language=en-US",
            "pub_date": "2026-02-28 21:13:10",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053557,
            "title": "U.S. Women's Hockey Team Considers Conditions for White House Visit",
            "description": "The U.S. women's hockey team is contemplating setting three conditions for a potential visit to the White House, rather than declining an invitation from U.S. President Donald Trump. Bloomberg posted on X, suggesting that the team could use this opportunity to address specific issues or concerns. This approach could allow the team to engage in meaningful dialogue while maintaining their stance on important matters. The conditions have not been specified, but the team's decision reflects a strategic approach to navigating political invitations.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053557&language=en-US",
            "pub_date": "2026-02-28 21:15:18",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053556,
            "title": "GEOPOLITICS | Poland Monitors Complex Situation in Tehran",
            "description": "Poland's Foreign Minister has confirmed the conclusion of discussions with the head of their office in Tehran. According to Jin10, embassy staff are safe, with only a few individuals registered at the Odysseus base, primarily those with dual citizenship. Poland is closely monitoring the dramatic and highly complex situation alongside its allies.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053556&language=en-US",
            "pub_date": "2026-02-28 21:16:20",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053555,
            "title": "GEOPOLITICS | Saudi Crown Prince and UAE President Discuss Iranian Attacks",
            "description": "Saudi Crown Prince Mohammed bin Salman and UAE President Sheikh Mohamed bin Zayed have engaged in discussions regarding Iran's recent attacks on the UAE and several regional countries. According to Jin10, the talks focused on the implications of these actions and potential measures to address the escalating tensions. The dialogue underscores the ongoing geopolitical challenges in the Middle East, as regional leaders seek to navigate complex security dynamics. The discussions reflect a shared concern over stability and security in the region, highlighting the importance of diplomatic engagement in resolving such conflicts.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053555&language=en-US",
            "pub_date": "2026-02-28 21:17:52",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053554,
            "title": "Wall Street Week Highlights Importance of Acknowledging Mistakes",
            "description": "David Westin emphasized the significance of recognizing and owning mistakes during this week's Wall Street Week. Bloomberg posted on X, highlighting Westin's discussion on how acknowledging errors can lead to growth and improvement in the financial sector. The conversation underscored the value of transparency and accountability in business practices, suggesting that admitting faults can foster trust and credibility among stakeholders. This approach is seen as crucial for navigating the complexities of the financial markets and maintaining a resilient economic environment.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053554&language=en-US",
            "pub_date": "2026-02-28 21:03:10",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053553,
            "title": "India's Anticipated Temperature Rise May Increase Power Demand and Health Risks",
            "description": "India is expected to experience above-normal temperatures in the upcoming months, which could lead to increased power demand and significant health risks for its residents. Bloomberg posted on X, highlighting concerns about the potential impact on the country's energy consumption and public health. The forecast suggests that the higher temperatures may strain the power grid as demand for cooling systems rises. Additionally, the heat poses a serious threat to public health, particularly for vulnerable populations. Authorities are urged to prepare for these challenges to mitigate the effects on both infrastructure and citizens.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053553&language=en-US",
            "pub_date": "2026-02-28 21:05:38",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053551,
            "title": "Tanker shipping in the Strait of Hormuz has come to a standstill.",
            "description": "According to real-time data from the international tanker traffic monitoring system, the speed of tankers in the waters surrounding the Strait of Hormuz has generally dropped to zero, indicating that shipping in the region has come to a standstill. Meanwhile, several European governments have issued emergency orders to their tankers flying their national flags, prohibiting them from passing through the Strait of Hormuz to avoid the security risks posed by the escalating situation. (CCTV News)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053551&language=en-US",
            "pub_date": "2026-02-28 21:07:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053552,
            "title": "Concerns Over National Security's Impact on Election Control",
            "description": "The Constitution grants states the authority to manage elections, with Congress holding the power to amend these rules. Bloomberg posted on X, highlighting concerns that using 'national security' as a justification to alter this framework could be both illegal and authoritarian. Legal experts warn against undermining the constitutional design, emphasizing the importance of maintaining the established balance of power between state and federal authorities.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053552&language=en-US",
            "pub_date": "2026-02-28 21:10:15",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053539,
            "title": "Iran's Counter-Attacks Highlight Regional Vulnerabilities",
            "description": "Iran's counter-attacks on Saturday served as a stark reminder of the geographical vulnerabilities faced by Dubai and Abu Dhabi. Bloomberg posted on X, emphasizing how these cities have evolved into global financial hubs, relying heavily on their reputation for safety and stability. The recent events underscore the delicate balance these financial centers must maintain amid regional tensions.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053539&language=en-US",
            "pub_date": "2026-02-28 20:52:56",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053532,
            "title": "China and India Hold Strategic Talks Ahead of BRICS Chairmanship Transition",
            "description": "China has initiated strategic discussions with India as the latter prepares to take over the chairmanship of BRICS in 2026. According to NS3.AI, this move underscores Beijing's emphasis on India's involvement in the group. BRICS, which has expanded to include 11 full members and 10 partner countries, is gaining international prominence. India's presidency in 2026 is set to prioritize resilience, innovation, cooperation, and sustainability to enhance the group's global influence.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053532&language=en-US",
            "pub_date": "2026-02-28 20:45:02",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053531,
            "title": "GEOPOLITICS | UK Prime Minister Engages in Talks with French and German Leaders",
            "description": "UK Prime Minister Keir Starmer is currently holding separate discussions with the leaders of France and Germany as part of a series of calls with allies. According to Jin10, these conversations are aimed at strengthening diplomatic relations and addressing mutual concerns. The talks underscore the importance of collaboration among European nations in navigating current geopolitical challenges. Further details on the outcomes of these discussions have yet to be disclosed.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053531&language=en-US",
            "pub_date": "2026-02-28 20:46:11",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053530,
            "title": "Dune Data Reveals Insights into $304 Billion Stablecoin Market",
            "description": "PANews posted on X (formerly Twitter). Recent data from Dune Analytics has unveiled significant insights into the $304 billion stablecoin market. Key findings highlight a duopoly, with USDT and USDC commanding an 89% market share. Despite over 172 million global wallet addresses, emerging stablecoins like USDS and USD0 see over 90% of their supply concentrated in the top 10 wallets. In January, stablecoin transfers exceeded $10.3 trillion, with USDC's transaction volume nearly five times that of USDT, indicating its role as a highly active trading medium. More than 90% of stablecoins are actively utilized in decentralized exchange liquidity, lending leverage, and centralized exchange channels, rather than remaining idle.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053530&language=en-US",
            "pub_date": "2026-02-28 20:46:26",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053529,
            "title": "Bitcoin Funding Rate Plunges to -6% as BTC Dips to $63K, Short Squeeze Risk Builds",
            "description": "Bitcoin’s perpetual funding rate dropped to -6% after BTC briefly fell to $63,000, signaling extreme bearish positioning and raising the potential for a short squeeze.The sharp move followed geopolitical escalation involving U.S. and Israeli strikes on Iran, which triggered volatility across risk assets.Funding Rate Hits Second-Lowest Level in 3 MonthsAccording to data from CoinGlass, the perpetual contract funding rate fell to -6%, marking the second-lowest level in nearly three months.The last time funding rates reached similar levels was on February 6, when Bitcoin bottomed near $60,000 before staging a rebound.A deeply negative funding rate means:Short sellers are paying longs to maintain positionsBearish positioning is crowdedMarket sentiment is skewed toward downside expectationsHistorically, extreme negative funding has often preceded sharp countertrend rallies as overleveraged shorts unwind.Open Interest Rises as Liquidations Exceed $500MDespite the price drop, coin-denominated open interest increased significantly:Open interest rose from 668,000 BTC to 687,000 BTC in 24 hoursMore than $500 million in crypto positions were liquidatedOver $420 million were long liquidationsThe combination of rising open interest and negative funding suggests new short positions are entering the market aggressively rather than traders closing exposure.This dynamic increases the probability of a short squeeze if Bitcoin reclaims key resistance levels.BTC Attempts to Reclaim $64,000After briefly dipping to $63,000, Bitcoin is now attempting to reclaim the $64,000 level.If price momentum strengthens:Shorts may be forced to coverFunding rates could normalize rapidlyLiquidation cascades may push BTC higherHowever, failure to hold support could embolden bears and trigger further downside.Market Structure Points to Elevated VolatilityKey current conditions:Funding rate: -6%Open interest: RisingLiquidations: $500M+Geopolitical risk: ElevatedThis combination reflects heightened speculative activity and a fragile market structure.With positioning heavily skewed short, Bitcoin’s next move could be amplified — whether through continued downside or a rapid squeeze higher.Traders are closely watching whether BTC can sustain a recovery above $64,000 to determine if the market transitions from panic selling to short-covering momentum.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053529&language=en-US",
            "pub_date": "2026-02-28 20:50:02",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053494,
            "title": "The UAE has decided to evacuate the world's tallest tower, the Burj Khalifa.",
            "description": "According to the Israeli newspaper, the United Arab Emirates has decided to evacuate the Burj Khalifa, the world's tallest tower. (Jinshi)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053494&language=en-US",
            "pub_date": "2026-02-28 20:39:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053497,
            "title": "Cryptocurrency Industry Faces $35.7 Million Loss Due to Exploits in February",
            "description": "According to CertiK's monitoring, the cryptocurrency industry experienced losses amounting to approximately $35.7 million in February due to exploitations. According to Foresight News, around $8.5 million of these losses were attributed to phishing attacks. This marks the lowest monthly loss since March 2025.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053497&language=en-US",
            "pub_date": "2026-02-28 20:39:04",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053496,
            "title": "Gold's Bullish Trend Indicates Market Risk Caution",
            "description": "CyrilXBT posted on X. Gold is experiencing a strong bullish trend, which typically signals a risk-off sentiment in global markets. This trend suggests that investors are seeking safer assets, contributing to the consolidation observed in the cryptocurrency market rather than aggressive expansion.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053496&language=en-US",
            "pub_date": "2026-02-28 20:39:14",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053495,
            "title": "U.S. Airstrikes Expected to Continue for Several Days, Official Says",
            "description": "Crypto Rover posted on X that a U.S. official has indicated airstrikes will persist for several days rather than just hours. This development comes amid ongoing military operations, with the official emphasizing the extended duration of the airstrikes. The decision reflects strategic military planning and aims to achieve specific objectives in the region. Further details on the targets or outcomes of these airstrikes have not been disclosed.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053495&language=en-US",
            "pub_date": "2026-02-28 20:40:11",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053493,
            "title": "GEOPOLITICS | Swedish Prime Minister to Convene National Security Meeting",
            "description": "Swedish Prime Minister has announced plans to convene a meeting of the National Security Council to discuss the implications for the safety of Sweden and its citizens. According to Jin10, this decision comes amid growing concerns over national security issues. The meeting aims to address potential threats and strategize on measures to enhance the security framework within the country. Further details on the agenda and outcomes of the meeting are yet to be disclosed.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053493&language=en-US",
            "pub_date": "2026-02-28 20:22:53",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053481,
            "title": "GEOPOLITICS | Oman Urges U.S. to Avoid Further Involvement in Foreign Conflicts",
            "description": "Oman's Foreign Minister has called on the United States to refrain from deepening its involvement in foreign conflicts, emphasizing that these are not America's wars. According to Jin10, the minister's statement reflects a growing sentiment among some nations that the U.S. should focus on diplomatic solutions rather than military interventions. This appeal comes amid ongoing geopolitical tensions, where various countries are urging restraint and dialogue to resolve international disputes. The minister's remarks highlight the importance of multilateral cooperation and peaceful negotiations in addressing global challenges.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053481&language=en-US",
            "pub_date": "2026-02-28 20:10:22",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053480,
            "title": "Explosion Occurs in Tehran's Narmak District",
            "description": "An explosion took place in Tehran's Narmak District, specifically at Square 72, on February 28, local time. According to Jin10, former Iranian President Mahmoud Ahmadinejad was unharmed and not injured in the attack.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053480&language=en-US",
            "pub_date": "2026-02-28 20:14:42",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}