{
    "data": [
        {
            "id": 1050419,
            "title": "EBay Announces Workforce Reduction Amid Strategic Shift",
            "description": "EBay has announced plans to reduce its workforce by approximately 800 positions, representing 6% of its full-time employees. Bloomberg posted on X, stating that the company aims to align its staffing with its strategic priorities. The decision reflects EBay's ongoing efforts to adapt to changing market conditions and optimize its operations. The layoffs are part of a broader strategy to ensure the company's resources are effectively allocated to support its long-term goals. EBay's move comes as businesses across various sectors reassess their workforce needs in response to evolving economic landscapes.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050419&language=en-US",
            "pub_date": "2026-02-26 21:25:08",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050416,
            "title": "World Gold Council: Significant financial speculation could lead to increased demand for gold.",
            "description": "The World Gold Council stated that significant financial speculation could lead to increased demand for safe-haven assets, particularly gold. Gold will be supported by stronger inflation hedging demand and increased correlation between stocks and bonds. However, overvaluation and persistent macroeconomic risks necessitate caution. (Gold10)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050416&language=en-US",
            "pub_date": "2026-02-26 21:27:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050418,
            "title": "World Gold Council Advises Caution Amid High Valuations and Macro Risks",
            "description": "The World Gold Council has issued a cautionary note regarding the current state of the gold market. According to Jin10, the council highlights concerns over high valuations and persistent macroeconomic risks. These factors necessitate a prudent approach for investors navigating the gold market. The council's warning comes amid ongoing global economic uncertainties, which could impact gold prices and investor sentiment. As the market continues to face volatility, the World Gold Council emphasizes the importance of careful consideration in investment strategies.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050418&language=en-US",
            "pub_date": "2026-02-26 21:28:35",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050415,
            "title": "The number of Americans filing for initial jobless claims for the week ending February 21 was 212,000, compared to an expected 215,000.",
            "description": "U.S. initial jobless claims for the week ending February 21 were 212,000, below the expected 215,000 and the previous week's figure revised from 206,000 to 208,000. Continuing jobless claims for the week ending February 14 were 1,833,000, below the expected 1,858,000 and the previous week's figure revised from 1,869,000 to 1,864,000. The four-week moving average of initial jobless claims for the week ending February 21 was 220,250, with the previous week's figure revised from 219,000 to 219,500. (Jinshi)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050415&language=en-US",
            "pub_date": "2026-02-26 21:30:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050380,
            "title": "Citadel's Influence on Market Stability Examined",
            "description": "A recent analysis suggests that Citadel's actions may have contributed to calming the markets earlier this week. Bespoke Investment Group posted on X, highlighting the potential impact of Citadel's strategic decisions on market dynamics. The report explores how Citadel's involvement might have played a role in stabilizing market conditions amid recent fluctuations. While the exact influence of Citadel's actions remains a topic of discussion, the analysis underscores the significant role major financial entities can have on market trends. The report does not provide specific details on the measures taken by Citadel but emphasizes the broader implications of such interventions in the financial landscape.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050380&language=en-US",
            "pub_date": "2026-02-26 21:18:36",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050379,
            "title": "DMG Blockchain Reports Decline in Revenue and Bitcoin Mining Output",
            "description": "DMG Blockchain has released its unaudited financial results for the first quarter of fiscal year 2026, revealing a revenue of 11.2 million CAD, marking a 2% decrease from the previous quarter and a 4% decline year-over-year. According to Odaily, the company mined 69 Bitcoins during the quarter, down from 72 in the previous quarter and 97 in the same period last year. The company's computing power increased by 10% to 1.76 EH/s. DMG Blockchain's cash, short-term investments, and digital assets totaled 58.6 million CAD, a 10% decrease from the end of the fiscal year. Total assets stood at 122 million CAD, reflecting an 8% decline quarter-over-quarter. The net loss was 2.2 million CAD, or 0.01 CAD per share, an improvement from the net loss of 3.1 million CAD in the same period last year. However, due to changes in the fair value of digital assets, the comprehensive net income shifted from a profit of 12.2 million CAD last year to a loss of 16.5 million CAD.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050379&language=en-US",
            "pub_date": "2026-02-26 21:20:06",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050378,
            "title": "HSBC Adjusts Investment Strategy, Shifts Focus to Emerging Markets and Europe",
            "description": "HSBC strategists have reduced their overweight position in U.S. equities, opting to increase investments in emerging markets and Europe. Bloomberg posted on X that this strategic shift is driven by robust economic momentum in these regions. The decision reflects HSBC's assessment of global economic conditions and potential growth opportunities outside the United States. By reallocating resources, HSBC aims to capitalize on the promising economic prospects in emerging markets and Europe, which are currently experiencing strong economic activity.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050378&language=en-US",
            "pub_date": "2026-02-26 21:20:41",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050377,
            "title": "Bitcoin and Ethereum Options Expiry Amid Market Volatility",
            "description": "Adam@Greeks.live posted on X. On February 27, a significant number of Bitcoin and Ethereum options are set to expire, with 116,000 BTC options and 206,000 ETH options reaching maturity. The Put Call Ratio for Bitcoin stands at 0.76, with a maximum pain point of $75,000 and a nominal value of $7.9 billion. For Ethereum, the Put Call Ratio is 0.77, with a maximum pain point of $2,200 and a nominal value of $980 million.\n\nThe cryptocurrency market remains sluggish, with Bitcoin having briefly dipped below the $60,000 mark earlier in February. Throughout the month, Bitcoin has experienced weak fluctuations above this level. Tomorrow, options accounting for 20% of total open interest, amounting to nearly $9 billion, will expire. Bitcoin's open interest has reached a peak not seen in recent years.\n\nThanks to a recent rebound, the implied volatility for both Bitcoin and Ethereum has increased, with BTC's main term IV at 47% and ETH's at 65%. This has somewhat alleviated the downward price trend, although market confidence remains low.\n\nIn terms of trading, large-scale call options have dominated, especially following yesterday's rebound, with significant medium to long-term call transactions. Key options data indicates a comprehensive rebound in Skew, suggesting the emergence of market bottom-fishing forces.\n\nDespite these developments, the market remains bearish. The cryptocurrency sector lacks new capital inflows and notable hotspots, with pessimistic sentiments prevalent on social media. It appears the market bottom has yet to be reached.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050377&language=en-US",
            "pub_date": "2026-02-26 21:20:55",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050370,
            "title": "Bitcoin Mining Firm Linked to Trump Family Reports $59 Million Loss in Q4",
            "description": "American Bitcoin, a mining company associated with the Trump family, has announced a $59 million loss for the fourth quarter. According to NS3.AI, this financial setback is attributed to declining bitcoin prices. The company currently holds over 6,000 BTC, with approximately one-third obtained through mining operations and the remainder acquired via market purchases and strategic agreements. This loss highlights the broader difficulties encountered by bitcoin miners during times of price decline.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050370&language=en-US",
            "pub_date": "2026-02-26 21:08:56",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050369,
            "title": "STOCKS | S&P 500 Futures Remain Stable Amid Nvidia Earnings",
            "description": "S&P 500 Index futures showed minimal movement as of 7:46 a.m. in New York, following Nvidia's earnings report. Bloomberg posted on X that the company's financial results did not generate renewed excitement about artificial intelligence among investors. Nvidia's performance was closely watched, given its significant role in the AI sector, but the anticipated enthusiasm did not materialize, leaving the market largely unchanged. Investors continue to monitor developments in the tech industry, particularly those related to AI, as they assess potential impacts on stock market trends.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050369&language=en-US",
            "pub_date": "2026-02-26 21:09:18",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050365,
            "title": "A trader closed a short position in DASH four hours ago, making a profit of approximately $4 million.",
            "description": "According to The Data Nerd, a trader closed out their short DASH position four hours ago. While the trader made approximately $4 million in unrealized profits on the DASH trade, their total realized loss reached a staggering $33.6 million.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050365&language=en-US",
            "pub_date": "2026-02-26 21:10:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050368,
            "title": "Saudi Aramco Begins Production at Major Shale Gas Field",
            "description": "Saudi Aramco has commenced production from the largest single shale gas field outside North America, which began operations late last year. Bloomberg posted on X, highlighting the company's strategy to diversify energy sources to address increasing domestic electricity needs and to allocate more crude oil for export purposes. This move is part of Saudi Aramco's broader efforts to enhance its energy portfolio and optimize resource allocation.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050368&language=en-US",
            "pub_date": "2026-02-26 21:10:51",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050363,
            "title": "Privacy gaming platform FOOM CASH suffered a $2.26 million loss after being attacked on Base and Ethereum.",
            "description": "According to GoPlus monitoring, the privacy gaming platform FOOM CASH was attacked on Base and Ethereum, resulting in a loss of 24,283,773,519,600 FOOM tokens (approximately $2.26 million). The vulnerability in this attack stemmed from a misconfigured verification key. Attackers exploited this vulnerability to forge zkSNARK proofs and then extracted a massive amount of FOOM tokens from the compromised contract.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050363&language=en-US",
            "pub_date": "2026-02-26 20:53:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050362,
            "title": "Analysis: This week, implied volatility for Bitcoin and Ethereum increased, easing the downward price trend, but market confidence remains weak.",
            "description": "Greeks.live, in an analysis published on the X platform, pointed out that 116,000 BTC options are expiring, with a put-call ratio of 0.76, a maximum price threshold of $75,000, and a notional value of $7.9 billion. 206,000 ETH options are expiring, with a put-call ratio of 0.77, a maximum price threshold of $2,200, and a notional value of $980 million. The crypto market remains sluggish; Bitcoin briefly fell below the $60,000 mark in early February, and the price fluctuated weakly above $60,000 throughout the month. Tomorrow, options representing 20% ​​of total open interest, totaling nearly $9 billion, will expire, marking a peak in Bitcoin's open interest in recent years. Benefiting from the rebound in the past two days, the implied volatility of Bitcoin and Ethereum has increased this week, with BTC's primary term IV at 47% and ETH's primary term IV at 65%, indicating some easing of the price decline, but market confidence remains weak. In terms of trading volume, call options dominated, with a large number of medium- to long-term call options traded after yesterday's rebound. Looking at major options data, Skew also rebounded across the board, indicating bargain-hunting activity in the market. The market remains in a bear market; currently, there is neither new capital entering the cryptocurrency space nor any clear hot topics, and pessimistic sentiments permeate social media, suggesting the bottom may not yet have been reached.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050362&language=en-US",
            "pub_date": "2026-02-26 20:56:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050364,
            "title": "Ecuador Increases Import Tariffs on Colombian Goods",
            "description": "Ecuador has announced an increase in tariffs on imports from Colombia, raising the rate to 50% from the previous 30%. Bloomberg posted on X, highlighting that this change will take effect on March 1. The decision is part of Ecuador's broader strategy to protect its domestic industries and manage trade imbalances. This move may impact trade relations between the two countries, as businesses on both sides adjust to the new tariff structure. The Ecuadorian government has not specified how long the increased tariffs will remain in place.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050364&language=en-US",
            "pub_date": "2026-02-26 20:58:52",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050356,
            "title": "US Dollar's Share in Global Reserves Hits Lowest Level Since 1995",
            "description": "The International Monetary Fund (IMF) has revealed that the US dollar now constitutes just over 56.32% of global foreign exchange reserves, marking its lowest share since 1995. According to NS3.AI, central banks around the world are diversifying their reserves by increasing their holdings of gold, commodities, and local currencies, thereby reducing their dependence on the dollar. This persistent decline in the dominance of the USD poses significant economic risks for the United States, including the potential for recession and inflationary pressures.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050356&language=en-US",
            "pub_date": "2026-02-26 20:48:48",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050355,
            "title": "Institutional Adoption of Digital Assets Shows Varied Patterns",
            "description": "Institutional adoption of digital assets is experiencing significant variation, influenced by internal mandates, regulatory clarity, and operational readiness. According to NS3.AI, Samar Sen from Talos highlights that trust in digital assets is established through regulatory compliance, strong internal controls, and peer adoption, rather than mere visibility. Institutions are categorized into early movers, fast followers, and late adopters, each demonstrating different risk appetites and levels of conviction towards blockchain technology.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050355&language=en-US",
            "pub_date": "2026-02-26 20:48:55",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050354,
            "title": "Artificial Intelligence Predicted to Reshape Job Market, Not Cause Mass Unemployment",
            "description": "A recent report by Morgan Stanley suggests that artificial intelligence (AI) will not lead to widespread permanent unemployment but will instead transform the employment landscape by creating new job opportunities. According to BlockBeats, the report draws on 150 years of technological change history, noting that advancements from electrification to the internet have altered the labor market without replacing human labor entirely. The report anticipates the emergence of roles such as Chief AI Officer and AI governance specialists, along with hybrid positions across various industries.\n\nHowever, some economists caution that AI's automation of cognitive tasks could devalue human expertise, potentially decoupling corporate profit growth from employment growth. Currently, 30% of companies adopting AI report measurable financial or productivity gains, a significant increase from 16% a year ago.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050354&language=en-US",
            "pub_date": "2026-02-26 20:50:08",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050353,
            "title": "DMG Blockchain released its Q1 financial report: mining output was 69 Bitcoins, and several performance indicators declined.",
            "description": "Bitcoin mining company DMG Blockchain released its unaudited financial results for the first quarter of fiscal year 2026, disclosing revenue of CAD 11.2 million, a 2% decrease quarter-over-quarter and a 4% decrease year-over-year. A total of 69 Bitcoins were mined in the quarter, lower than the 72 in the previous quarter and the 97 in the same period last year. Hashrate rose to 1.76 EH/s, a 10% increase quarter-over-quarter. The company held a total of CAD 58.6 million in cash, short-term investments, and digital assets, a 10% decrease from the end of the fiscal year. Total assets were CAD 122 million, an 8% decrease quarter-over-quarter. Net loss was CAD 2.2 million (loss per share of CAD 0.01), narrowing from a net loss of CAD 3.1 million in the same period last year. However, due to changes in the fair value of digital assets, consolidated net profit turned from a profit of CAD 12.2 million in the same period last year to a loss of CAD 16.5 million. (Globenewswire)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050353&language=en-US",
            "pub_date": "2026-02-26 20:43:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050352,
            "title": "Bloomberg analysts: Bitcoin ETFs see large inflows, but signs of a dead cat bounce remain.",
            "description": "Eric Balchunas, a senior ETF analyst at Bloomberg, wrote on the X platform that Bitcoin ETFs attracted approximately $500 million in inflows yesterday, the largest single-day increase in recent times. Over the past two days, cumulative inflows have reached approximately $750 million. At a time of strong market pessimism, he described this inflow as \"like hitting a home run in a low point of the game,\" providing a boost to the market. Year-to-date, Bitcoin ETFs have still seen net outflows of less than $2 billion, but it remains unclear whether this marks the beginning of a genuine rebound or a short-lived \"dead cat bounce.\"",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050352&language=en-US",
            "pub_date": "2026-02-26 20:47:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}