{
    "data": [
        {
            "id": 734391,
            "title": "Analyst: POL's key support level may be at $0.28",
            "description": "Odaily Planet Daily News Analyst Ali Martinez wrote on the X platform: \"Some people will understand, others will say it's contradictory. But the key support for POL may be $0.28.\"",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734391&language=en-US",
            "pub_date": "2025-02-05 20:02:33",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734394,
            "title": "Analyst Highlights Key Support Level For POL",
            "description": "According to Odaily, analyst Ali Martinez shared insights on the X platform, stating that while opinions may vary, the crucial support level for POL is identified at $0.28.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734394&language=en-US",
            "pub_date": "2025-02-05 20:03:33",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734390,
            "title": "Gate.io Innovation Zone Deposit and Listing Activity Launched $MAGT (MarsAgent)",
            "description": "Odaily Planet Daily News According to official news, the Gate.io Innovation Zone recharge and listing activity has launched the Meme project $MAGT (MarsAgent) at 19:00 (UTC+8) on February 5. Users can help $MAGT to be listed on the Gate.io Innovation Zone by recharging tokens. The prize pool size is 10,000 USDT.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734390&language=en-US",
            "pub_date": "2025-02-05 20:04:35",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734389,
            "title": "Avalanche network daily active addresses exceed 250,000",
            "description": "Odaily Planet Daily News According to IntoTheBlock data, the daily active addresses of the Avalanche (AVAX) network have exceeded 250,000, the highest level of on-chain activity since May 2023.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734389&language=en-US",
            "pub_date": "2025-02-05 20:05:05",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734383,
            "title": "South Korean elders need Bitcoin, Ether ETFs, finance industry chief says",
            "description": "The finance industry association chief vows to list a crypto ETF in 2025 on the domestic exchange to satisfy the growing demand for digital assets among older investors.\nsource: https://cointelegraph.com/news/south-korea-needs-bitcoin-and-ether-etfs-finance-industry-says?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734383&language=en-US",
            "pub_date": "2025-02-05 19:48:34",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734382,
            "title": "Riot Platforms: Mining output of 527 BTC in January, Bitcoin holdings reached 18,221",
            "description": "Odaily Planet Daily News: Riot Platforms, a Nasdaq-listed mining company, published a post on the X platform saying that it produced 527 BTC in January. Despite the rising difficulty of the network, the output continued to increase for the second consecutive month, and the current Bitcoin holdings reached 18,221.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734382&language=en-US",
            "pub_date": "2025-02-05 19:48:54",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734381,
            "title": "The increase in BTC mining difficulty has led to a decline in production of most mining companies in January, with Hut 8's monthly decline reaching 27%",
            "description": "Odaily Planet Daily News Due to the continued increase in the difficulty of network mining, the output of most Bitcoin mining companies in January has declined. The output of miners including Hut 8, Mara and Bitrfarms in January has decreased compared with the last month of 2024. Compared with December 2024, Hut 8's monthly Bitcoin output fell by 27%, Mara's and Bitfarms' monthly Bitcoin output fell by 12.5% ​​and 4.7% respectively, but Riot Platforms' Bitcoin mining output rose by 2.1% against the trend. (Cointelegraph)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734381&language=en-US",
            "pub_date": "2025-02-05 19:52:21",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734380,
            "title": "Ondo Finance plans to launch RWA tokenization platform Ondo GM",
            "description": "Odaily Planet Daily News RWA Protocol OndoFinance announced that it plans to launch Ondo Global Markets (Ondo GM), an RWA tokenization platform focusing on stocks, bonds and ETFs, to allow investors to access the US securities market through blockchain. The platform enables issuers to create tokens similar to stablecoins with freer transfers, returning power to stakeholders, allowing them to make their own decisions and compete on a fair playing field, while solving challenges such as high fees, limited availability and transfer friction.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734380&language=en-US",
            "pub_date": "2025-02-05 19:55:54",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734372,
            "title": "Goldman Sachs and Wells Fargo expect Fed to cut rates twice this year",
            "description": "Odaily Planet Daily News: The market generally expects Trump's tariff policy to push up inflation and increase the difficulty of the Federal Reserve to continue to control inflation. Goldman Sachs and Wells Fargo expect the Federal Reserve to cut interest rates twice this year, while Morgan Stanley joins Barclays and Macquarie Bank in predicting that the Federal Reserve will only cut interest rates by 25 basis points once this year, citing the uncertainty brought about by US President Trump's tariff policy. The Federal Reserve also maintained its benchmark overnight interest rate in the range of 4.25%-4.50% at its January policy meeting. Fed Chairman Powell said that further reducing borrowing costs now depends on whether the Federal Reserve can make further progress in reducing stubbornly high inflation. (Jinshi)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734372&language=en-US",
            "pub_date": "2025-02-05 19:39:59",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734371,
            "title": "856 BTC transferred from Ceffu to Binance, worth nearly $84 million",
            "description": "Odaily Planet Daily News: According to Whale Alert monitoring, at around 19:38 Beijing time today, 856 BTC were transferred from Ceffu to Binance, worth US$83,935,921.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734371&language=en-US",
            "pub_date": "2025-02-05 19:41:07",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}