{
    "data": [
        {
            "id": 1052181,
            "title": "Founders Fund, Pantera, and Franklin Templeton join Sentient's \"Arena\" to stress test enterprise-grade AI agents.",
            "description": "Sentient, an open-source AI lab, has officially launched Arena, a real-time, production-grade environment for global AI developers to stress-test and competitively iterate the inference capabilities of enterprise-grade AI agents. Initial participants include Founders Fund, Pantera, Franklin Templeton (with over $1.5 trillion in assets under management), alphaXiv, Fireworks, OpenHands, and OpenRouter. Arena simulates real-world scenarios in enterprise workflows, including incomplete information, verbose context, ambiguous instructions, and conflicting sources, and records complete inference paths to help engineering teams pinpoint failures. The first challenge focuses on document reasoning, requiring AI agents to reason and compute on complex, unstructured data. Julian Love, Managing Partner of Franklin Templeton Digital Assets, stated that structured environments like Arena will help the industry distinguish between \"potential ideas\" and \"truly production-ready capabilities.\" Himanshu Tyagi, co-founder of Sentient, said that enterprises need to validate the stability and repeatability of agent inference in production environments. Arena will launch globally, with plans to hold in-person events in San Francisco starting in March 2026.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052181&language=en-US",
            "pub_date": "2026-02-27 21:03:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052165,
            "title": "Germany's February Harmonized CPI Annual Rate Falls to 2%",
            "description": "Germany's harmonized consumer price index (CPI) for February showed an annual rate of 2%, according to preliminary data. According to Jin10, this figure is slightly below the expected 2.10% and the previous value of 2.10%. The data indicates a slight decrease in inflationary pressures within the German economy for the month of February. This development may influence the European Central Bank's monetary policy decisions as they monitor inflation trends across the Eurozone.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052165&language=en-US",
            "pub_date": "2026-02-27 21:01:55",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052164,
            "title": "UniCredit Plans Executive Bonus Increase Following Record Profits",
            "description": "UniCredit is preparing to raise bonuses for its senior executives by approximately 15% after achieving record profits. Bloomberg posted on X, highlighting the bank's decision to reward its top management following a successful financial performance. The Italian banking group has seen significant growth, prompting this move to enhance executive compensation. This decision aligns with UniCredit's strategy to retain and motivate its leadership team amid a competitive banking sector. The bonus increase reflects the company's commitment to recognizing the contributions of its executives in driving profitability and growth.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052164&language=en-US",
            "pub_date": "2026-02-27 21:02:26",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052163,
            "title": "STOCKS | S&P 500 Futures Decline, Indicating Monthly Loss",
            "description": "S&P 500 Index futures have decreased by 0.5% as of 7:39 a.m. in New York, suggesting a monthly downturn. Bloomberg posted on X, highlighting the potential for a negative close for the month. This decline reflects ongoing market volatility and investor concerns over economic conditions.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052163&language=en-US",
            "pub_date": "2026-02-27 21:03:34",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052162,
            "title": "Katharine Braddick Appointed as Deputy Governor of Bank of England",
            "description": "Katharine Braddick has been appointed as the next Deputy Governor of the Bank of England, responsible for prudential regulation. According to Jin10, she will also serve as the Chief Executive Officer of the Prudential Regulation Authority. This appointment marks a significant step in the Bank of England's leadership, as Braddick brings extensive experience in financial regulation and policy. Her role will involve overseeing the stability and integrity of the UK's financial system, ensuring that banks and financial institutions operate safely and soundly. This move is part of the government's ongoing efforts to strengthen financial oversight and maintain economic stability.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052162&language=en-US",
            "pub_date": "2026-02-27 21:04:01",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052150,
            "title": "World Liberty Financial: The New Era of Governance between Staking and Stablecoin",
            "description": "World Liberty Financial proposes new governance based on staking with a 180-day lock, USD1 premiums and a Node/Super Node structure to attract institutional capital.\nsource: https://en.spaziocrypto.com/dao/world-liberty-financial-the-new-era-of-governance-between-staking-and-stablecoin/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052150&language=en-US",
            "pub_date": "2026-02-27 20:48:25",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052149,
            "title": "GEOPOLITICS | UK Issues Travel Warning for Pakistan Amid Border Tensions",
            "description": "The United Kingdom has issued a travel warning for its citizens planning to visit Pakistan due to escalating tensions at the Afghanistan-Pakistan border. According to Jin10, the ongoing conflict in the region has raised concerns about the safety of travelers. The UK government advises caution and urges its citizens to stay informed about the situation. This development highlights the increasing geopolitical instability in the area, prompting international attention and precautionary measures.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052149&language=en-US",
            "pub_date": "2026-02-27 20:49:24",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052161,
            "title": "Binance: Bitway (BTW) tokens will begin circulating on March 2nd at 16:00.",
            "description": "According to an official announcement from Binance, the Bitway BTW token will begin circulating on March 2, 2026 at 16:00.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052161&language=en-US",
            "pub_date": "2026-02-27 20:53:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052160,
            "title": "Jack Dorsey's Blocks company has added 340 BTC, worth $22 million.",
            "description": "The Bitcoin Historian posted on the X platform that Blocks, the company owned by billionaire Jack Dorsey, announced that it added 340 BTC, worth $22 million, in the fourth quarter and added the Bitcoin proceeds to its vault.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052160&language=en-US",
            "pub_date": "2026-02-27 20:59:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052138,
            "title": "Department of Energy Issues Historic Loan to Manage Utility Costs",
            "description": "The Department of Energy has announced its largest loan to date, aimed at stabilizing utility bills in a region known for its concentration of data centers. Bloomberg posted on X, highlighting the significance of this financial move, which impacts a crucial swing state. This initiative is part of broader efforts to manage energy costs and support infrastructure in areas with high data center activity. The loan underscores the government's commitment to addressing energy challenges in key regions.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052138&language=en-US",
            "pub_date": "2026-02-27 20:40:36",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052137,
            "title": "Bitcoin News: U.S. Spot Bitcoin ETFs Add $1.1B in 3 Days, Eye Biggest Weekly Inflow in 6 Weeks",
            "description": "U.S. spot Bitcoin ETFs have attracted $1.1 billion in net inflows over three consecutive trading days, putting funds on track for their strongest weekly performance in six weeks as Bitcoin consolidates near $66,000.The rebound marks a sharp reversal after five straight weeks of net outflows and signals renewed U.S. institutional demand.$1.1 Billion Inflows Snap Multi-Week Outflow StreakAccording to data from SoSoValue, U.S.-listed spot Bitcoin ETFs recorded $1.1 billion in net inflows across three trading sessions.After accounting for Monday’s outflows, the funds remain approximately $815 million net positive for the week, positioning them for their largest weekly gain since mid-January, when ETFs added $1.4 billion.This reversal follows five consecutive weeks of withdrawals totaling $3.8 billion.BlackRock’s IBIT Leads the SurgeThe majority of inflows flowed into BlackRock’s iShares Bitcoin Trust (IBIT), which attracted roughly $652 million over the three-day stretch — accounting for more than half of total flows.Meanwhile, Grayscale’s GBTC recorded its largest single-day inflow since converting from a trust to an ETF structure, despite maintaining the highest fee among the group.Other funds, including Bitwise’s BITB and Ark 21Shares’ ARKB, also contributed to the rebound, though some products saw minor outflows.Coinbase Premium Turns Positive After 40 DaysThe ETF inflows coincided with a rebound in the Coinbase Premium Index, which flipped positive after 40 consecutive days in negative territory.The index measures the price difference between Bitcoin on Coinbase — widely used by U.S. institutions — and global exchanges. A positive premium is typically interpreted as renewed U.S. buying pressure.On-chain data from Checkonchain shows total Bitcoin holdings across U.S. spot ETFs have climbed to 1.29 million BTC, leaving assets under management less than 10% below their October peak — even though Bitcoin’s spot price remains about 45% below its all-time high.CME Open Interest Declines, Suggesting Outright BuyingWhile ETF inflows surged, CME Bitcoin futures open interest continued to decline, falling to 107,780 BTC, according to Glassnode.This detail is notable because CME is commonly used for basis trades — a strategy where institutions hold spot BTC while shorting futures. Falling open interest suggests that recent ETF inflows may represent outright long exposure, rather than hedged arbitrage positioning.In other words, investors appear to be buying spot Bitcoin exposure directly, rather than executing neutral yield strategies.“Buy the Dip” Behavior EmergesETF analyst Nate Geraci described the move as evidence that investors are “buying the dip.” Since Bitcoin’s record high in October, spot ETFs have experienced roughly $6.5 billion in cumulative outflows, a relatively modest figure compared to the $55 billion in total inflows since January 2024.Despite Bitcoin’s roughly 50% drawdown from peak levels, ETF investors appear less reactive than expected, reinforcing the view that institutional participation remains structurally supportive.Altcoin ETFs Also Turn PositiveThe improved sentiment extended beyond Bitcoin:Spot Ether ETFs added approximately $173 million over three sessionsSolana funds logged about $35 million in inflowsXRP ETFs recorded roughly $7 million in net additionsThe broader shift suggests that risk appetite may be stabilizing across digital asset investment products.Outlook: First Weekly Inflow in 6 Weeks?If momentum continues through Friday’s session, U.S. spot Bitcoin ETFs could record their first positive weekly flow in six weeks, marking a meaningful shift in sentiment after February’s heavy selling.With:$1.1 billion in three-day inflowsCoinbase Premium turning positiveCME open interest decliningETF BTC holdings nearing prior highsmarket participants are increasingly viewing ETF flows as a leading indicator of institutional positioning.Whether this marks the start of a sustained recovery or a tactical rebound remains to be seen — but for now, U.S. demand is clearly back in the market.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052137&language=en-US",
            "pub_date": "2026-02-27 20:42:31",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052136,
            "title": "El Niño's Impact on Future Climate Patterns",
            "description": "El Niño's influence on global climate patterns is becoming increasingly significant, highlighting the need for attention to its potential future impacts. Bloomberg posted on X, emphasizing the importance of understanding El Niño's role in shaping weather conditions worldwide. As climate change continues to affect global weather systems, the patterns associated with El Niño could have far-reaching consequences. Experts suggest that monitoring and analyzing these patterns is crucial for preparing for future climate-related challenges. The phenomenon, characterized by periodic warming of ocean surface temperatures in the central and eastern Pacific, has been linked to various weather disruptions, including droughts and floods. Understanding El Niño's effects is essential for developing strategies to mitigate its impact on agriculture, water resources, and overall economic stability. As the world grapples with the realities of climate change, the insights gained from studying El Niño could prove invaluable in shaping future environmental policies and responses.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052136&language=en-US",
            "pub_date": "2026-02-27 20:45:34",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052129,
            "title": "Pantera, Franklin Templeton join Sentient Arena to test AI agents",
            "description": "Sentient launched Arena, a production-style platform to test AI agents on enterprise tasks, with Pantera and Franklin Templeton joining the initial cohort.\nsource: https://cointelegraph.com/news/sentient-arena-tests-ai-agents-pantera-franklin-templeton?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052129&language=en-US",
            "pub_date": "2026-02-27 20:27:18",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052135,
            "title": "ZKsync will officially discontinue ZKsync Lite on May 4th, and the project will be integrated into the Era ecosystem.",
            "description": "ZKsync has announced that it will officially deprecate ZKsync Lite on May 4th, at which time block production will cease and the network's final state will be permanently frozen. ZKsync Lite was launched in June 2020 under the name ZKsync 1.0 and was considered Ethereum's first zero-knowledge proof rollup, but it did not support smart contract functionality. Matter Labs ceased development of Lite in March 2023 after launching zkEVM ZKsync Era, which supports arbitrary smart contracts. The team stated that this deprecation will not affect Era or other chains built on the ZK Stack framework. A read-only API will be retained for at least one year after the shutdown to support data access. Users are advised to withdraw their assets before May 4th; any unwithdrawn funds can still be claimed afterward. According to L2BEAT data, approximately $33.9 million in assets remain on ZKsync Lite via canonical bridging, including approximately $24.9 million in stablecoins, approximately $8.4 million in ETH and derivatives, approximately $313,000 in BTC and derivatives, and approximately $231,000 in other assets.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052135&language=en-US",
            "pub_date": "2026-02-27 20:37:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052128,
            "title": "AI Platform Arena Launches to Simulate Corporate Workflows",
            "description": "Sentient, an open-source AI reasoning lab, has introduced Arena, a platform designed to simulate corporate workflows for developers to test AI agent approaches. According to NS3.AI, the initiative has attracted early-stage investments from Founders Fund, Pantera, and Franklin Templeton. Arena's initial focus will be on document-based reasoning, and it is scheduled to host its first global event in San Francisco on March 14.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052128&language=en-US",
            "pub_date": "2026-02-27 20:28:55",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052127,
            "title": "India and Canada Strengthen Ties Based on Shared Democratic Values",
            "description": "India's Ministry of External Affairs spokesperson emphasized the robust partnership between India and Canada, highlighting its foundation on shared democratic values and expanding cooperation across various sectors. According to Jin10, the spokesperson noted the importance of close cultural exchanges and collaboration in numerous fields, underscoring the mutual benefits of this bilateral relationship. The statement reflects ongoing efforts to enhance diplomatic and economic ties between the two nations.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052127&language=en-US",
            "pub_date": "2026-02-27 20:35:15",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052123,
            "title": "Saudi Arabia's International Reserves Reach Highest Level Since 2022",
            "description": "Saudi Arabia's international reserves have climbed to their highest point since 2022, driven by a surge in oil revenues and heightened foreign-debt issuance. Bloomberg posted on X, highlighting the significant impact of these factors on the country's financial standing. The increase in reserves reflects Saudi Arabia's strategic financial maneuvers amid fluctuating global economic conditions. The rise in oil revenues has been a crucial factor, as the nation capitalizes on its vast energy resources. Additionally, the issuance of foreign debt has contributed to bolstering the reserves, showcasing the kingdom's proactive approach to managing its economic portfolio. This development underscores Saudi Arabia's efforts to strengthen its financial position and navigate the complexities of the international market.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052123&language=en-US",
            "pub_date": "2026-02-27 20:22:24",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052122,
            "title": "U.S. SPY ETF Ranks Low in Global Performance Metrics",
            "description": "The U.S. SPY ETF has been ranked 38th out of 46 country ETFs in terms of year-to-date performance. Bespoke Investment Group posted on X that the SPY ETF also holds the 36th position in performance since its inception. This ranking highlights the ETF's relatively low standing compared to other global ETFs, reflecting broader market trends and economic factors influencing its performance.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052122&language=en-US",
            "pub_date": "2026-02-27 20:22:26",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052121,
            "title": "Tether's Secondary Market Valuation Surpasses Expectations",
            "description": "Tether's secondary market trading valuation is estimated to be between $350 billion and $375 billion, which is notably higher than previous assessments. According to NS3.AI, this substantial valuation suggests that CFO Giancarlo Devasini's stake could be valued at over $156 billion, potentially surpassing the net worth of renowned investor Warren Buffett. Tether's reserves are primarily composed of U.S. Treasury bonds, gold, and Bitcoin. The company is also expanding its operations with initiatives such as the USAT stablecoin, which is issued through Anchorage Digital Bank.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052121&language=en-US",
            "pub_date": "2026-02-27 20:24:03",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052120,
            "title": "Dogecoin's Potential Short-Term Rally Amid Momentum Signals",
            "description": "Dogecoin, following a five-month decline, is showing signs of a potential short-term rally. According to NS3.AI, this is driven by momentum signals and its strong correlation with Bitcoin. Swissblock's proprietary Impulse index suggests that a significant surge could trigger this final rally, with Elliott Wave theory indicating that DOGE is entering a critical 'Wave 5' phase. Despite these bullish technical patterns, DOGE's recovery may still rely on influential news or figures to spark significant market interest.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052120&language=en-US",
            "pub_date": "2026-02-27 20:24:12",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}