{
    "data": [
        {
            "id": 733267,
            "title": "WEEX WE-Launch launches VTRU, HOGSCOIN, GOHOME, and SC20",
            "description": "Odaily Planet Daily News WEEX Weike Exchange announced that it has launched WE-Launch projects VTRU (Vitruveo), HOGSCOIN (CryptoHog), GOHOME (GOHOME), and SC20 (Shine Chain). Users who invest in WXT can get 56,000 VTRU, 5,500,000 HOGSCOIN, 10,000 USDT and 25,000 SC20 tokens at the same time. The invested WXT does not need to be locked or pledged, and can be traded and withdrawn at any time.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733267&language=en-US",
            "pub_date": "2025-02-04 14:39:59",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733254,
            "title": "Dogecoin Price Final Capitulation Over? 9000% Gains Could be on the Card If..",
            "description": "Dogecoin price action history showed a repeated pattern of “final capitulation” events, hinting at a potential turning point, local bottom, before aggressive rallies. Notably, in mid-2023 and again in early 2025, DOGE experienced sharp declines, dropping to lows around $0.085 and $0.20, respectively. These capitulations were followed by swift recoveries, with price spikes reaching $0.57...\nsource: https://www.thecoinrepublic.com/2025/02/04/dogecoin-price-final-capitulation-over-why-9000-gains-could-be-on-the-cards/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733254&language=en-US",
            "pub_date": "2025-02-04 14:28:07",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733252,
            "title": "Analyst Miles Deutscher: The current market reaction to the news shows that it is more bearish at this stage",
            "description": "Crypto analyst Miles Deutscher wrote on X that there is now a typical sign that the market is currently leaning towards bearishness (lights-off mode). The market's reaction to news can tell investors everything about sentiment. In a bull market trend, the market shrugs off bad news, but rises as soon as good news comes. In a bear market trend, the opposite is true. The market shrugs off good news and falls as soon as bad news comes. It is important to observe early signs of a trend shift, and the market's reaction to news is an easy way to do this.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733252&language=en-US",
            "pub_date": "2025-02-04 14:27:12",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733250,
            "title": "Tokenized RWA markets return to ATH levels as tokens lead crypto recovery",
            "description": "Onchain value for the real-world asset sector has increased 94% since the same time last year, adding nearly $4 billion in three months.\nsource: https://cointelegraph.com/news/rwa-value-locked-returns-to-ath-tokens-lead-market-recovery?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733250&language=en-US",
            "pub_date": "2025-02-04 14:15:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733244,
            "title": "Coinbase CLO to Address ‘Operation Chokepoint 2.0’ in Congressional Hearing",
            "description": "Coinbase CLO Paul Grewal will testify before Congress on regulators allegedly pressuring banks to cut off crypto.\nsource: https://decrypt.co/304275/coinbase-clo-to-address-operation-chokepoint-2-0-in-congressional-hearing",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733244&language=en-US",
            "pub_date": "2025-02-04 14:06:09",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733233,
            "title": "The second address on the ARC list spent another $1.495 million to increase its position in the past 9 hours, with a cumulative floating loss of $1.02 million",
            "description": "According to the monitoring of @ai_9684xtpa, an on-chain data analyst, the second address on the ARC list spent another $1.495 million to increase its ARC position in the past 9 hours. It currently holds 17.2 million ARC and has a cumulative floating loss of $1.02 million. It is reported that the address started to build a position on December 26 last year, buying tokens in three batches, with an average cost of $0.3153 (current price $0.2417); in addition, the address also holds $5.75 million worth of ai16z, and the latest round of position building has caused a floating loss of $4.15 million.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733233&language=en-US",
            "pub_date": "2025-02-04 13:53:43",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733237,
            "title": "Union Groups Sue US Treasury Over Data Access Concerns",
            "description": "According to Cointelegraph, union groups have filed a lawsuit against the U.S. Treasury, alleging violations of federal laws by granting Elon Musk’s Department of Government Efficiency (DOGE) access to sensitive financial and personal information. The American Federation of Labor and Congress of Industrial Organizations (AFL-CIO), the largest union group in the United States, initiated legal action against the Treasury and Secretary Scott Bessent in a Washington, DC, federal court on February 3. The lawsuit aims to halt what the union describes as an “unlawful ongoing, systematic, and continuous disclosure of personal and financial information” to Musk and DOGE.\n\nThe AFL-CIO expressed concerns over the extensive intrusion into individuals’ privacy, stating that those required to share information with the federal government should not be compelled to share it with Musk or his DOGE. This legal challenge is the latest in response to U.S. President Donald Trump’s initiative to reduce federal spending, which involved appointing Musk to lead the effort through DOGE, a name reminiscent of Dogecoin, a cryptocurrency Musk has previously mentioned.\n\nThe lawsuit references a February 1 post by U.S. Senator Ron Wyden on Bluesky, indicating that sources informed his office about Bessent granting DOGE full access to the Treasury’s payments system. Wyden had earlier sought clarification from Bessent regarding DOGE’s access to the system. The payments system in question contains personal data such as names, Social Security numbers, birth dates, birthplaces, home addresses, telephone numbers, email addresses, and bank account information of millions of individuals.\n\nThe issue has prompted top Democrats, including Senate leader Chuck Schumer and Senator Elizabeth Warren, to hold a press conference on February 3, voicing concerns over Musk and DOGE’s access to Treasury systems. Schumer announced plans to introduce legislation aimed at preventing unlawful interference in the Treasury Department’s payments systems. He emphasized that DOGE is not a legitimate government agency and lacks the authority to make spending decisions or disregard federal law. Warren warned that the system is now vulnerable to Musk, who could potentially exploit the information for personal use. The Treasury and the U.S. DOGE Service (USDS), the parent agency of DOGE, have not yet responded to requests for comment.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733237&language=en-US",
            "pub_date": "2025-02-04 14:03:37",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733236,
            "title": "Market Sentiment Shows Bearish Signs, Analyst Suggests",
            "description": "According to BlockBeats, on February 4, cryptocurrency analyst Miles Deutscher shared insights on social media indicating a typical sign of bearish market sentiment. Deutscher explained that the market's reaction to news can reveal investor sentiment. During a bull market, the market tends to ignore bad news and rise on good news. Conversely, in a bear market, the market dismisses good news and declines on bad news. Observing early signs of trend shifts is crucial, and monitoring the market's response to news is a straightforward method to achieve this.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733236&language=en-US",
            "pub_date": "2025-02-04 14:03:46",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733235,
            "title": "Blockchain Analyst Reports Significant Arc Token Purchase",
            "description": "According to Odaily, blockchain data analyst @ai_9684xtpa has reported that a prominent address has spent $1.495 million to increase its holdings of arc tokens over the past nine hours. The address now holds 17.2 million arc tokens, with an accumulated unrealized loss of $1.02 million. The address began acquiring tokens on December 26 of last year, purchasing in three batches at an average cost of $0.3153 per token, while the current price stands at $0.2417. Additionally, the address holds ai16z tokens valued at $5.75 million, with the latest acquisition round resulting in an unrealized loss of $4.15 million.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733235&language=en-US",
            "pub_date": "2025-02-04 14:03:54",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733232,
            "title": "Ethereum's Buterin Says Pectra Will Double L2 Capacity",
            "description": "Buterin has also proposed making the blog target staker-voted\nsource: https://u.today/ethereums-buterin-says-pectra-will-double-l2-capacity",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733232&language=en-US",
            "pub_date": "2025-02-04 13:45:58",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}