{
    "data": [
        {
            "id": 1054050,
            "title": "Bitcoin’s Perpetual Markets Are Quietly Resetting And That May Be Exactly What the Market Needs",
            "description": "On-chain and derivatives data is showing a steady compression in Bitcoin’s perpetual market directional premium, a signal that speculative long exposure is unwinding gradually rather than through the kind of violent liquidation cascade that typically marks a panic bottom, with analysts framing the current sideways price action as a constructive leverage detox rather than structural deterioration. What the Data Is Showing Perpetual market directional premium measures the degree to which traders are paying a premium to hold leveraged long positions. When that premium is elevated, it indicates crowded long positioning and a market that is leaning heavily in one direction. When it compresses, the long bias is fading, funding rates are normalizing, and open interest is cooling as speculative capital exits its positions\nsource: https://www.ethnews.com/bitcoins-perpetual-markets-are-quietly-resetting-and-that-may-be-exactly-what-the-market-needs/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054050&language=en-US",
            "pub_date": "2026-03-01 08:16:39",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054048,
            "title": "A whale spent $4 million to buy 145,700 HYPE tokens, and made a profit of over $500,000.",
            "description": "According to Onchain Lens monitoring, in the past 24 hours, a whale, 0x96d, spent $4 million USDC to buy 145,741 HYPE tokens at a price of $27.45, and currently has a floating profit of over $500,000.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054048&language=en-US",
            "pub_date": "2026-03-01 08:21:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054049,
            "title": "The United States has no intention of releasing oil from its strategic reserves.",
            "description": "The United States is not considering releasing oil from its strategic petroleum reserves, indicating that Washington believes oil price increases following an Iranian attack will be limited. A U.S. Department of Energy official stated that there has been no discussion whatsoever regarding strategic petroleum reserves. The media report states that the U.S. currently holds approximately 415 million barrels of oil in its strategic reserves for unforeseen circumstances. The market widely expects a new round of Middle East conflict to disrupt energy supplies, and oil prices to rise after the New York market opens. Meanwhile, Iranian media reports that the Strait of Hormuz, a crucial oil shipping route, is effectively closed. (Jinshi)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054049&language=en-US",
            "pub_date": "2026-03-01 08:21:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054047,
            "title": "The daughter and grandson of Iran's Supreme Leader Ayatollah Khamenei were killed in a US-Israeli airstrike.",
            "description": "Iran's Supreme Leader Ayatollah Khamenei's daughter and grandson were killed in US-Israeli airstrikes. (Jinshi)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054047&language=en-US",
            "pub_date": "2026-03-01 08:23:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054039,
            "title": "Iran says Pezeshkian survived amid US-Israel strikes",
            "description": "Masoud Pezeshkian assassination attempt, Israel Iran strikes 2026, international reaction Russia E3 UN: Tehran and family say he survived; UN/E3 reaction noted\nsource: https://coincu.com/news/iran-says-pezeshkian-survived-amid-us-israel-strikes/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054039&language=en-US",
            "pub_date": "2026-03-01 08:00:59",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054038,
            "title": "PRECIOUS METALS | Thailand to Enforce New Gold Trading Regulations to Curb Speculation",
            "description": "Thailand is set to introduce stringent regulations on retail gold trading starting March 1. Bloomberg posted on X, the move aims to reduce speculative activities that have contributed to the strengthening of the baht, impacting the country's competitive edge. The new rules are part of broader efforts to stabilize the currency and enhance economic stability. Authorities hope that by curbing speculative trading, they can mitigate the adverse effects on the nation's economy and improve its global competitiveness.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054038&language=en-US",
            "pub_date": "2026-03-01 08:11:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054037,
            "title": "China's Political Meeting to Address Tech and Economic Strategies",
            "description": "China is set to begin its most significant annual political meeting next week. Bloomberg posted on X, highlighting that investors are keen to understand Beijing's plans for advancing its technology goals while also revitalizing a delicate consumer economy. The meeting is expected to provide insights into the government's strategies for balancing technological development with economic growth.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054037&language=en-US",
            "pub_date": "2026-03-01 08:15:03",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054030,
            "title": "Hyperliquid Strategies remains $356M in gains as losses drag down DAT firms",
            "description": "Amid the flood of negative sentiments hitting the crypto markets from every side and affecting different sectors, Hyperliquid Strategies continues to stay afloat, beating other companies like Bitmine and Strategy in terms of profitability. According to data from analytics firm Artemis, Hyperliquid Strategies has emerged as the leading digital asset treasury firm in terms of […]\nsource: https://www.cryptopolitan.com/hyperliquid-strategies-gain-losses-dat-firms/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054030&language=en-US",
            "pub_date": "2026-03-01 07:51:21",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054029,
            "title": "Iran's Retaliatory Strikes Test Missile Defense Stocks",
            "description": "The capacity of the United States, Israel, and Gulf Arab states to withstand potential retaliatory strikes from Iran hinges on their missile interceptor reserves. Bloomberg posted on X, highlighting concerns that these stocks are likely depleted. The situation underscores the strategic importance of maintaining adequate defense resources in the face of escalating tensions in the region. As geopolitical dynamics evolve, the ability to replenish and manage these critical defense assets remains a priority for these nations.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054029&language=en-US",
            "pub_date": "2026-03-01 08:00:30",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054028,
            "title": "South Korea's February Export Growth Exceeds Expectations",
            "description": "South Korea's export growth in February surpassed market expectations, with a year-on-year increase of 29%. According to Jin10, this figure exceeded the anticipated 24% growth rate. The previous month's export growth rate was revised slightly from 33.90% to 33.80%. This robust performance highlights the resilience of South Korea's export sector amid global economic uncertainties.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054028&language=en-US",
            "pub_date": "2026-03-01 08:02:08",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054026,
            "title": "Telegram Wallet Offers Up to 18% Yield on USDT, Here’s What Changed",
            "description": "Telegram’s TON Wallet has introduced on-chain yield vaults that allow users to earn returns on Bitcoin, Ethereum, and Tether directly within the wallet. The feature expands the wallet’s role from asset storage and transfers into yield generation using decentralized finance infrastructure. com\nsource: https://techgaged.com/telegram-wallet-offers-up-to-18-yield-on-usdt-heres-what-changed/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054026&language=en-US",
            "pub_date": "2026-03-01 07:40:23",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054025,
            "title": "Grayscale Research Calls the Current Drawdown a Mid-Cycle Transition, Not a Crypto Winter",
            "description": "Grayscale Managing Director of Research Zach Pandl has rejected the crypto winter narrative following Bitcoin’s 45% drawdown, characterizing the recent price action as a macroeconomic de-risking process driven by global monetary conditions rather than any fundamental failure of digital assets, and maintaining a bullish outlook targeting new all-time highs in late 2026.\nsource: https://www.ethnews.com/grayscale-research-calls-the-current-drawdown-a-mid-cycle-transition-not-a-crypto-winter/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054025&language=en-US",
            "pub_date": "2026-03-01 07:45:24",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054024,
            "title": "U.S. Energy Department Rules Out Strategic Oil Reserve Release",
            "description": "The U.S. Energy Department has stated that it is not considering releasing oil from the Strategic Petroleum Reserve. According to Jin10, this decision comes amid ongoing discussions about energy supply and market stability. The announcement aims to address concerns over potential disruptions in the oil market. The Strategic Petroleum Reserve is a critical tool for managing energy resources and ensuring national security. The department's stance reflects a cautious approach to maintaining reserve levels while monitoring global energy dynamics.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054024&language=en-US",
            "pub_date": "2026-03-01 07:50:26",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054018,
            "title": "Iran denies Khamenei death as claims remain unverified",
            "description": "Israeli officials and Trump claim Ayatollah Ali Khamenei death; Iranian outlets deny it. Status unverified; analysts cite succession rules and regional risk.\nsource: https://coincu.com/news/iran-denies-khamenei-death-as-claims-remain-unverified/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054018&language=en-US",
            "pub_date": "2026-03-01 07:26:40",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054017,
            "title": "BULLISH: BITCOIN ETF INVESTORS SHOW \"DIAMOND HANDS\" AND \"ABSURD STRENGTH\"\n\nHighlighting the $6-6.5 billion that has flowed out of $BTC ETFs since October price highs, two top ETF analysts have highlighted the incredible staying power of investors...\n\n\"ETF investors have largely",
            "description": "null\nsource: https://x.com/BSCNews/status/2027888545684193354",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054017&language=en-US",
            "pub_date": "2026-03-01 07:28:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054016,
            "title": "Israeli Military Identifies Seven Iranian Officials Allegedly Killed",
            "description": "The Israeli military announced on social media platform X at approximately 5 a.m. UTC+8 on Sunday that it has identified seven high-ranking Iranian military and political figures it claims have been killed. According to Ming Pao, the list includes Defense Minister Aziz Nasirzadeh, head of the Supreme Leader's Military Office Mohammad Shirazi, Secretary of the Defense Council Ali Shamkhani, Commander of the Revolutionary Guards Mohammad Pakpour, former head of the Defense Innovation and Research Organization (SPND) Reza Mozaffari-Nia, and Revolutionary Guards Intelligence Chief Saleh Asadi.\n\nAli Shamkhani, noted as a close confidant of Supreme Leader Ayatollah Ali Khamenei, was considered a potential candidate to assume power in the event of Khamenei's assassination. The announcement has not been independently verified, and the circumstances surrounding the alleged deaths remain unclear.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054016&language=en-US",
            "pub_date": "2026-03-01 07:36:42",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054008,
            "title": "Here’s why Stellar’s (XLM) price action may be at the risk of a 28% drop",
            "description": "XLM's price action is in a tricky spot right now.\nsource: https://ambcrypto.com/heres-why-stellars-xlm-price-action-may-be-at-the-risk-of-a-28-drop/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054008&language=en-US",
            "pub_date": "2026-03-01 07:00:14",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054007,
            "title": "HUGE: For the first time in history, the construction of Data Centers has surpassed the construction of General Offices.",
            "description": "null\nsource: https://x.com/cointelegraph/status/2027881692258546030",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054007&language=en-US",
            "pub_date": "2026-03-01 07:00:46",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054006,
            "title": "War and Peace of Crypto: US–Iran Escalation, Hormuz Risk, and the Future of Bitcoin in Wartime Economies",
            "description": "The US–Iran escalation and Hormuz Strait risk could trigger an oil shock and global macro stress. This analysis explores implications for Bitcoin and crypto. <p>The post War and Peace of Crypto: US–Iran Escalation, Hormuz Risk, and the Future of Bitcoin in Wartime Economies first appeared on Crypto News And Market Updates | BTCUSA. </p>\nsource: https://btcusa.com/war-and-peace-of-crypto-us-iran-escalation-hormuz-risk-and-the-future-of-bitcoin-in-wartime-economies/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054006&language=en-US",
            "pub_date": "2026-03-01 07:06:06",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054005,
            "title": "Israel's Strategic Influence in the Middle East: A Comprehensive Overview",
            "description": "The Long View, institutional investor, posted on X, highlighting Israel's significant impact on regional dynamics in the Middle East. The analysis underscores Israel's strategic actions across various neighboring territories, emphasizing its ability to decisively influence outcomes.\n\nIn Lebanon, Israel's technological advancements, such as 'magic beepers,' have played a crucial role in its defense strategy. Meanwhile, in Syria, the presence of a 'rebel' army has been a focal point in the ongoing conflict, with Israel's involvement shaping the military landscape.\n\nGaza has faced severe challenges, with the region often described as a rubble or graveyard due to continuous conflicts. Israel's military operations have significantly affected the area's stability and infrastructure.\n\nYemen has experienced precision strikes, showcasing Israel's capability to execute targeted military actions. These operations have contributed to the broader geopolitical shifts in the region.\n\nIran has been subjected to activist campaigns and the establishment of new boards, reflecting Israel's strategic efforts to counter Iranian influence. This approach is part of a broader initiative to address the Shia arc, which has seen significant changes.\n\nOverall, the analysis suggests that Israel's strategic maneuvers have effectively altered the balance of power in the Middle East, with implications for regional stability and future developments.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054005&language=en-US",
            "pub_date": "2026-03-01 07:09:33",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}