{
    "data": [
        {
            "id": 734160,
            "title": "OpenZK and Rocket Pool Collaborate to Integrate rETH into the OpenZK Ecosystem",
            "description": "Odaily Planet Daily News According to official news, L2 project OpenZK announced a partnership with Rocket Pool to integrate rETH into the OpenZK ecosystem.\nIt is reported that OpenZK is an L2 solution that combines ZK rollup technology with ETH staking and re-staking, which can achieve lower Gas and faster transaction speeds.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734160&language=en-US",
            "pub_date": "2025-02-05 15:41:13",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734155,
            "title": "A trader bought more than 100 million SSE and now has a floating profit of 2.28 million US dollars",
            "description": "Odaily Planet Daily News According to Onchain Lens monitoring, a trader purchased 108,614,413 SSE tokens on the pump.fun platform at 9.35 SOL (about $1,854). The trader has not sold any tokens yet, and the floating profit has reached $2.28 million.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734155&language=en-US",
            "pub_date": "2025-02-05 15:28:09",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734154,
            "title": "WazirX creditors to vote on whether to approve restructuring plan extended to 5 years",
            "description": "Odaily Planet Daily News WazirX creditors will decide in the coming weeks whether to start receiving compensation in cryptocurrency as early as April 2025, or face a long recovery process that could extend to 2030.\nThe vote follows a ruling by the Singapore High Court that allows the troubled Indian exchange to seek a restructuring plan rather than face liquidation, depending on whether three-quarters of creditors approve the recovery plan.\nIf the threshold is met, WazirX will launch a phased compensation plan, including launching a DEX, issuing recovery tokens, and implementing regular buybacks to compensate affected users.\nIf the vote fails, the platform will be forced to liquidate, a process that the company noted could take years and reduce creditors' returns. Although WazirX claims that creditors can recover up to 80% of their balances through its new DEX and recovery token model, its proposed recovery plan has sparked controversy.\nMany users remain skeptical, and some critics believe that the five-year delay is a strategic means to force creditors to accept a new platform rather than a real recovery move.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734154&language=en-US",
            "pub_date": "2025-02-05 15:29:30",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734153,
            "title": "Bitget will launch the Launchpool project Analog (ANLOG), lock BTC and ETH to earn 23,333,431 ANLOG",
            "description": "Odaily Planet Daily News Bitget is about to launch the Launchpool project Analog (ANLOG), with a total prize pool of 23,333,431 ANLOGs. The lock-up period is from 19:00 on February 6 to 19:00 on February 11 (UTC+8).\nTwo lock-up pools are open in this round of Launchpool, details are as follows:\nBTC lock-up pool\nOrdinary user pledge limit: 0.3 BTC \nVIP user pledge limit: 1 BTC \nTotal prize pool: 11,666,715 ANLOGs\nETH lock-up pool\nOrdinary user pledge limit: 10 ETH \nVIP user pledge limit: 15 ETH \nTotal prize pool: 11,666,716 ANLOGs",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734153&language=en-US",
            "pub_date": "2025-02-05 15:30:11",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734159,
            "title": "Google Plans $75 Billion Investment In AI Development By 2025",
            "description": "According to PANews, Google CEO Sundar Pichai announced that the company plans to invest approximately $75 billion in capital expenditures by 2025 to advance artificial intelligence (AI) products. This statement was made during the fourth-quarter earnings report of Google's parent company, Alphabet, for 2024. Pichai highlighted that the projected investment represents a 43% increase from the company's $32.3 billion capital expenditure in 2023. He emphasized that this investment aims to accelerate AI innovation and strengthen Google's core business.\n\nWhile the exact portion of the investment dedicated specifically to AI remains unclear, it is anticipated that a significant amount will be allocated to expanding Google's AI infrastructure. Other major tech companies are also increasing their spending on AI-related projects. For instance, Meta has announced plans to invest $65 billion to enhance its AI infrastructure.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734159&language=en-US",
            "pub_date": "2025-02-05 15:34:18",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734145,
            "title": "Polymarket predicts which Trump nominees will be confirmed, with a market volume of $16.7 million",
            "description": "Odaily Planet Daily News Polymarket data shows that the market called \"Which of Trump's nominations will be confirmed?\" has a trading volume of 16.7 million US dollars. So far, the Senate's nomination of Scott Bessent, a hedge fund manager who supports cryptocurrencies, as Treasury Secretary has been confirmed.\nPolymarket users also bet on several other confirmations. However, no nominees in the cryptocurrency field, such as Paul Atkins, chairman of the US SEC, appeared on the list.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734145&language=en-US",
            "pub_date": "2025-02-05 15:24:07",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734137,
            "title": "X Money may support QR code payment",
            "description": "Odaily Planet Daily News: Independent App developer Nima Owji published a post revealing that X Money, the payment function of the X platform, may support QR codes.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734137&language=en-US",
            "pub_date": "2025-02-05 15:06:38",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734136,
            "title": "Analysis: Bitcoin miners' revenue increased 41% to $3.7 billion last quarter, but there may be fluctuations in the future",
            "description": "Odaily Planet Daily News H.C. Wainwright analysts said that as Bitcoin breaks through $100,000 for the first time in the fourth quarter of 2024, the profits earned by miners will increase significantly.\nSpot Bitcoin ETFs attracted $16.7 billion in inflows during the quarter, almost four times the $4.3 billion in the third quarter, pushing the average BTC price to $83,432 during the quarter, up 36.7% from the previous quarter.\nAnalysts expect these trends to drive strong revenue growth and improved profit margins in mining companies' upcoming earnings reports. The mining industry expanded significantly, with listed miners increasing their operations by 46 EH/s, bringing total deployed capacity to 235.8 EH/s. The global network hash rate averaged 738 EH/s in the fourth quarter, up 17.3% from the third quarter. As of the beginning of the first quarter of 2025, the hash rate continues to climb, reaching 833 EH/s on February 2.\nRising BTC prices and increased mining activity pushed total BTC production up 16.4% month-on-month to 11,366 BTC, while transaction fees surged 59.4% to 1,553 BTC. This pushed total miner revenue up 41% to $3.7 billion. The total market capitalization of listed mining companies increased by 21% to US$28 billion, with AI-related mining companies outperforming their peers.\nLooking ahead, Q1 2025 is off to a strong start, with average BTC prices approaching $100,000 and ETF inflows reaching $5.7 billion. However, analysts warned that markets could be volatile due to ongoing trade tensions between the United States and Canada, Mexico and China. Despite short-term uncertainty, they see any weak nodes in BTC or mining as buying opportunities. (crypto.news)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734136&language=en-US",
            "pub_date": "2025-02-05 15:14:27",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734133,
            "title": "Ethereum’s daily spot trading volume hits a record high of $38 billion",
            "description": "Odaily Planet Daily News FalconX Research Director David Lawant wrote on X that on February 3rd, local time, Ethereum's daily spot trading volume reached a record high of $38 billion, while Bitcoin's daily trading volume reached $49 billion, the third highest record in history. The surge in trading activity coincided with the volatility of Ethereum prices, with ETH falling to an intraday low of $2,152 before rebounding to $2,919. On the same day, Trump's second son Eric Trump said on X that now is a great time to add ETH (In my opinion, it's a great time to add ETH.).",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734133&language=en-US",
            "pub_date": "2025-02-05 15:01:56",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734132,
            "title": "Deribit BTC block options buy year-end $125,000 call options, totaling 600 BTC",
            "description": "Odaily Planet Daily News: Lin Chen, head of Asia-Pacific business at Deribit, wrote on X that today’s largest BTC option was: a user paid a premium of $9.856 million and purchased a $125,000 call option at the end of the year, for a total of 600 BTC.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734132&language=en-US",
            "pub_date": "2025-02-05 15:03:28",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}