{
    "data": [
        {
            "id": 734557,
            "title": "CoinDesk 20 Index Sees Modest Gains Amid Mixed Asset Performance",
            "description": "According to CoinDesk, the CoinDesk 20 Index experienced a slight increase in its latest market update, reflecting a 0.2% rise to 3310.92 points as of 4 p.m. ET on Tuesday. This performance highlights the mixed results among the assets within the index, with fourteen out of twenty assets showing positive movement.\n\nAmong the top performers, AAVE led the gains with a notable increase of 6.9%, followed by Litecoin (LTC), which rose by 3.7%. These assets contributed significantly to the overall upward trend of the index. However, not all assets shared in the positive momentum. XRP and SUI both experienced declines, each falling by 1.2%, marking them as the laggards in this trading session.\n\nThe CoinDesk 20 Index is a comprehensive benchmark that tracks the performance of twenty leading digital assets. It is traded across various platforms and regions worldwide, providing a broad perspective on the cryptocurrency market's movements. This index serves as a key indicator for investors and analysts monitoring the digital asset space, offering insights into the market's current trends and dynamics.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734557&language=en-US",
            "pub_date": "2025-02-05 22:43:49",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734556,
            "title": "Bitcoin Rebounds Above 99000 USDT",
            "description": "According to Odaily, Bitcoin has experienced a rebound, surpassing the 99000 USDT mark. Currently, it is trading at 99025.3 USDT. The 24-hour decline has narrowed to 1.07%.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734556&language=en-US",
            "pub_date": "2025-02-05 22:44:03",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734554,
            "title": "In the past 4 hours, the entire network has blown up more than 25 million US dollars, mainly short orders",
            "description": "Odaily Planet Daily reported that Coinglass data showed that in the past 4 hours, the entire network had a liquidation of 25.7215 million US dollars, of which long positions were liquidated for 7.2489 million US dollars and short positions were liquidated for 18.4727 million US dollars.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734554&language=en-US",
            "pub_date": "2025-02-05 22:45:59",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734553,
            "title": "The Sandbox team’s associated address deposited 5 million $SAND to Binance one hour ago",
            "description": "Odaily Planet Daily News According to ai_9684xtpa monitoring, the address associated with The Sandbox team recharged 5 million $SAND to Binance an hour ago, worth $2.06 million. The source of funds for this address is the address 0x010...fCc90, which received 15 million tokens (about $10.52 million) transferred from the Sandbox multi-signature address a month ago and distributed them to multiple addresses. $SAND has fallen 41% in the past month.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734553&language=en-US",
            "pub_date": "2025-02-05 22:46:32",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734540,
            "title": "Galaxy announces new fund, Galaxy Absolute Return Fund",
            "description": "Odaily Planet Daily News: Digital asset management company Galaxy announced the launch of a new fund, Galaxy Absolute Return Fund, on the X platform. The fund will actively manage investment exposure to the digital asset ecosystem and disruptive technologies, providing stock-like volatility without directly holding crypto tokens.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734540&language=en-US",
            "pub_date": "2025-02-05 22:30:02",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734539,
            "title": "The three major U.S. stock indexes fell at the opening, and MicroStrategy fell 0.43%",
            "description": "Odaily Planet Daily News: The three major U.S. stock indexes fell at the opening, with the Dow Jones Industrial Average down 16 points, the S&P 500 down 0.21%, and the Nasdaq down 0.64%. MicroStrategy fell 0.43%, and Coinbase rose 1%.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734539&language=en-US",
            "pub_date": "2025-02-05 22:36:11",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734538,
            "title": "Gravity G staking ecosystem will be launched on B3 ($B3)",
            "description": "Odaily Planet Daily News Gravity Ecosystem is about to launch the 10th G token pledge airdrop project B3 ($B3), and the total airdrop token rewards that G token pledge users can receive are 20,000,000 $B3.\nGravity will calculate the amount of airdrop rewards that users can receive based on their pledged holdings at the time of the snapshot. The official has not yet announced the detailed information on the collection rules and the specific airdrop time. Users can pay attention to subsequent updates to get the latest developments. It is reported that the Gravity G pledge ecosystem will no longer disclose the airdrop snapshot time in advance to ensure fairness.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734538&language=en-US",
            "pub_date": "2025-02-05 22:38:29",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734528,
            "title": "OpenAI: Deep Research has been launched to all professional users in the UK and other countries",
            "description": "Odaily Planet Daily News According to OpenAI’s announcement on the X platform, the Deep Research feature is now fully open to ChatGPT Pro users in all supported regions, including the UK, EU, Norway, Iceland, Liechtenstein, and Switzerland. Previously, the feature was gradually pushed to some users, and this expansion means that Pro users can access this enhanced feature worldwide.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734528&language=en-US",
            "pub_date": "2025-02-05 22:23:10",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734531,
            "title": "NYSE Seeks Approval to Convert Grayscale LTC Trust to Spot Litecoin ETF",
            "description": "According to Odaily, the New York Stock Exchange (NYSE) has submitted an application to regulatory authorities to convert the Grayscale Litecoin Trust into a spot Litecoin Exchange-Traded Fund (ETF).",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734531&language=en-US",
            "pub_date": "2025-02-05 22:23:41",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734530,
            "title": "Federal Reserve's Barkin Discusses Cybersecurity and Economic Outlook",
            "description": "According to Odaily, Federal Reserve official Thomas Barkin highlighted during a recent fireside chat that the Federal Reserve frequently faces cyberattacks. He also expressed optimism about the economic outlook, predicting that inflation will continue to decline and affirming that the fundamental economic conditions in the United States remain robust.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734530&language=en-US",
            "pub_date": "2025-02-05 22:23:44",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}