{
    "data": [
        {
            "id": 1053149,
            "title": "Japanese Firm Plans Bitcoin Acquisition Amid Inflation Concerns",
            "description": "Japanese company Daitou Limex, listed under the securities code 3205, has announced its board's decision to purchase Bitcoin (BTC) with an upper limit of 1 billion yen. According to Odaily, this move is part of the company's asset allocation strategy outlined in its mid-term business plan for the fiscal period ending March 2029. The firm aims to incorporate BTC into its asset portfolio to address inflation and yen depreciation risks, achieve asset diversification, and mitigate risks. The company believes that Bitcoin's limited supply and low correlation with traditional assets make it a suitable choice for these objectives.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053149&language=en-US",
            "pub_date": "2026-02-28 12:28:01",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053148,
            "title": "China's Capital Markets Experience Rebound Driven by Equity and Bond Growth",
            "description": "China's capital markets saw a significant rebound last year, driven by a notable increase in equity refinancing and bond issuance. Bloomberg posted on X, highlighting data from the National Bureau of Statistics that underscored this growth. The surge in these financial activities contributed to the overall recovery of the markets, reflecting a positive trend in the country's economic landscape. This development marks a pivotal moment for China's financial sector, as it continues to navigate the complexities of the global economy.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053148&language=en-US",
            "pub_date": "2026-02-28 12:28:13",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053147,
            "title": "GEOPOLITICS | French President Macron Plans April Visit to Japan",
            "description": "French President Emmanuel Macron is scheduled to visit Japan in April, according to Jin10. This visit aims to strengthen diplomatic ties and discuss various bilateral and global issues. The trip underscores the importance of Franco-Japanese relations in the current geopolitical landscape. Further details on the agenda and specific dates are yet to be disclosed.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053147&language=en-US",
            "pub_date": "2026-02-28 12:32:56",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053146,
            "title": "Bitcoin Falls to $65,000 Amid Strong Producer-Price Data and Nvidia Stock Decline",
            "description": "Bitcoin's price dropped to $65,000 over the weekend, reversing gains made earlier in the week. According to NS3.AI, the decline was influenced by robust producer-price data and a decrease in Nvidia's stock following its earnings report. Other significant cryptocurrencies, including Solana, XRP, and Dogecoin, experienced a similar downturn, each falling approximately 6%.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053146&language=en-US",
            "pub_date": "2026-02-28 12:34:14",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053114,
            "title": "Critical Bug in XRP Ledger's Batch Amendment Prevented from Mainnet Deployment",
            "description": "An AI-driven tool has identified a significant vulnerability in the XRP Ledger's Batch amendment, which impacted signature validation. According to NS3.AI, the flaw was discovered during the voting process, allowing for timely intervention. Validators were quickly advised to reject the amendment to safeguard wallets from potential exploits.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053114&language=en-US",
            "pub_date": "2026-02-28 12:17:24",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053113,
            "title": "YZi Labs Alleges Undisclosed 10X Ownership in CEA Industries, Demands Immediate SEC Disclosure",
            "description": "YZi Labs posted a new article on X, demanding immediate SEC disclosures, alleging that undisclosed warrant exercises may have pushed 10X Capital’s ownership above 5%, raising concerns about transparency, potential reporting violations, and the existence of an undisclosed insider “group.” YZi Labs cited company filings suggesting that 10X Capital Asset Management LLC and affiliates beneficially own more than 5% of CEA Industries Inc. shares, and criticizes the lack of a required Schedule 13D filing by 10X and board member Hans Thomas.The firm argues that 10X’s silence following public calls for clarification raises concerns that mandatory SEC reporting requirements may have been deliberately avoided, limiting shareholder transparency.Company filings show that 2,376,236 warrants were exercised during the relevant period, closely matching the number of shares underlying warrants held by 10X-affiliated entities.YZi Labs confirms it did not exercise its warrants, reinforcing the inference that the exercised warrants were attributable to 10X-related entities.Based on 44,062,938 shares outstanding as of December 12, 2025, the exercised warrants alone would represent approximately 5.39% ownership, suggesting 10X may have exceeded the SEC reporting threshold.YZi Labs contends that overlapping affiliations and aligned ownership among 10X-linked entities and company insiders warrant scrutiny as possible concerted action requiring disclosure under Section 13(d)(3).",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053113&language=en-US",
            "pub_date": "2026-02-28 12:18:39",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053111,
            "title": "Japanese listed company Daido Rimet has decided to purchase up to 1 billion yen worth of Bitcoin.",
            "description": "Japanese listed company Daido Limtec (stock code: 3205) announced that its board of directors has approved a resolution to purchase Bitcoin (BTC) with a maximum purchase amount of 1 billion yen. The announcement stated that this move is based on the company's asset allocation plan in its mid-term business plan ending March 2029, and intends to incorporate a portion of its funds into its asset portfolio in the form of BTC. The company stated that this move aims to address inflation and yen depreciation risks, achieve asset diversification and risk mitigation, and believes that BTC has characteristics such as a limited total supply and low correlation with traditional assets.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053111&language=en-US",
            "pub_date": "2026-02-28 12:22:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053112,
            "title": "GEOPOLITICS | U.S. Deputy Secretary of State Backs Pakistan's Stance on Afghan Conflict",
            "description": "U.S. Deputy Secretary of State has expressed support for Pakistan's position regarding the ongoing conflict in Afghanistan. According to Jin10, this endorsement comes amid heightened tensions and complex geopolitical dynamics in the region. The U.S. official's statement highlights the importance of Pakistan's role in seeking a resolution to the Afghan conflict, emphasizing collaboration and diplomatic efforts. This development underscores the strategic significance of Pakistan in regional stability and the broader implications for international relations.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053112&language=en-US",
            "pub_date": "2026-02-28 12:23:55",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053107,
            "title": "BSC chain's Meme coin, Freedom of Money, briefly surpassed $7 million, increasing more than 82 times in 24 hours.",
            "description": "According to GMGN data, the market capitalization of Meme coin Freedom of Money, part of the BSC ecosystem, briefly exceeded $7 million, currently trading at $6.5 million, representing a 24-hour increase of over 82 times. Odaily reminds users that Meme coin prices are highly volatile, and investors should be aware of the risks. Previous news: CZ: My personal memoir, \"Freedom of Money,\" is about to be published.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053107&language=en-US",
            "pub_date": "2026-02-28 12:06:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053110,
            "title": "U.S. Federal Judge Blocks ICE Arrests Without Cause in Oregon",
            "description": "A federal judge in Oregon has issued a ruling prohibiting the U.S. Immigration and Customs Enforcement (ICE) from conducting arrests without reasonable cause in the state. According to Jin10, the judge stated that ICE's actions were in violation of clear and undisputed laws. This decision marks a significant legal development in the ongoing debate over immigration enforcement practices in the United States.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053110&language=en-US",
            "pub_date": "2026-02-28 12:07:47",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053109,
            "title": "China's Solar Power Generation Surpasses Wind Energy for the First Time",
            "description": "China's solar power generation exceeded wind energy for the first time last year, marking a significant shift in the country's energy landscape. Bloomberg posted on X, highlighting the impact of affordable solar panels on China's grid and climate strategy. The surge in solar power reflects the nation's commitment to renewable energy and its efforts to reduce carbon emissions. As solar technology becomes more cost-effective, China is poised to continue expanding its solar capacity, further transforming its energy infrastructure and contributing to global climate goals.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053109&language=en-US",
            "pub_date": "2026-02-28 12:09:14",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053108,
            "title": "Charoen Pokphand Group to Divest 10% Stake in True Corp",
            "description": "Thai business conglomerate Charoen Pokphand Group is set to sell a 10% stake in its telecommunications affiliate, True Corp. Bloomberg posted on X, revealing that the majority of these shares will be acquired by UBS Group AG. This move is part of Charoen Pokphand Group's strategic efforts to streamline its operations and focus on core business areas. True Corp, a significant player in Thailand's telecommunications sector, is expected to benefit from this transaction by enhancing its financial flexibility and operational capabilities. The sale aligns with broader trends in the industry, where companies are increasingly looking to optimize their portfolios and strengthen partnerships with global financial institutions. The transaction is anticipated to have implications for both the Thai telecommunications market and the international investment landscape.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053108&language=en-US",
            "pub_date": "2026-02-28 12:11:48",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053102,
            "title": "YZi Labs questioned 10X Capital's failure to disclose its over 5% stake in CEA Industries and requested that it submit SEC filings to explain.",
            "description": "YZi Labs issued a statement saying that its latest filings show that 10X Capital Asset Management LLC and its affiliates may have held more than 5% of the company's issued common stock by the end of 2025, but have not yet filed the Schedule 13D disclosure required by the U.S. Securities and Exchange Commission (SEC). YZi Labs noted that, according to publicly disclosed warrant exercise data, approximately 2.376 million warrants have been exercised, corresponding to approximately 5.39% of the company's issued shares. YZi Labs stated that it itself has not exercised the relevant warrants, therefore it speculates that these shares mainly come from 10X's affiliated entities. The statement also stated that 10X and its director Hans Thomas have not publicly disclosed their shareholding percentages, nor have they filed the required shareholding disclosure documents. YZi Labs urges the relevant parties to clarify their shareholding situation as soon as possible and disclose whether there is a \"related shareholding group\" that needs to be disclosed under Section 13(d)(3) of the Securities Exchange Act.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053102&language=en-US",
            "pub_date": "2026-02-28 11:58:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053105,
            "title": "Anthropic CEO Predicts Emergence of AI Nation Within Three Years",
            "description": "Anthropic CEO Dario Amodei has expressed confidence in the rapid development of artificial intelligence, suggesting that a nation composed of numerous intelligent entities could emerge within the next three years. According to Bitalk News, Amodei believes there is a 95% chance that within a decade, data centers will give rise to a 'nation of geniuses' powered by superintelligent systems. However, his intuition indicates that this could happen as soon as one to three years from now.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053105&language=en-US",
            "pub_date": "2026-02-28 12:00:25",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053101,
            "title": "BitMart US announces its official launch in the US market after obtaining regulatory approval in New York: covering the entire US, offering zero transaction fees across the platform, and fully implementing compliant operations.",
            "description": "BitMart US, a digital asset trading platform specifically designed for the US market, announced today that it has officially obtained regulatory approval from New York State, completing its nationwide operations across the United States. Currently, BitMart US has obtained compliance licenses in all 50 states and territories, becoming one of the cryptocurrency exchanges authorized to provide services throughout the US. BitMart US offers users a zero-fee trading experience across the entire platform, with no fees for transactions, fiat currency deposits, and withdrawals. This means users can retain more profit at every step from buying crypto assets to exchanging them back to USD. Daniel Huang, Chief Operating Officer of BitMart US, stated, “In expanding into the US market, we have always adhered to a steady and pragmatic approach, rather than rushing for quick results. Trust, transparency, and compliance credibility are at the core of our long-term development vision. BitMart US has been completely rebuilt from the ground up, solely to serve users across the US with compliance standards, a zero-fee experience, and product quality that meet the expectations of US users.” BitMart US is designed for two different but complementary user groups: US individual retail users and international institutional clients seeking compliant entry channels that meet US regulatory standards. The platform aims to serve everyday users with a simple and easy-to-use interface, while meeting the stringent needs of professional market participants with institutional-grade security, liquidity depth, and compliance infrastructure. BitMart US has strategically planned to launch more products and services throughout 2026, continuously enriching its product portfolio for retail and institutional users. Specific information on these new products will be released in the coming months.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053101&language=en-US",
            "pub_date": "2026-02-28 12:02:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053104,
            "title": "Launch of Pre-IPO Section Enables Investment in Tokenized Equity",
            "description": "Maitong MSX has announced a strategic partnership with Republic to introduce a Pre-IPO section, allowing eligible investors to participate in tokenized equity of unlisted companies. According to NS3.AI, this initiative will initially offer over $10 million in subscription quotas, featuring shares from more than ten prominent unicorns, including SpaceX and ByteDance. Republic will offer compliance support and custody through regulated third-party services, leveraging its previous experience with tokenized stock initiatives for major companies.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053104&language=en-US",
            "pub_date": "2026-02-28 12:02:04",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053098,
            "title": "CZ Shares Title of Personal Memoir, Editing in Progress",
            "description": "Binance founder and former CEO, Changpeng Zhao (CZ) posted on X. He shared that The New York Times has reported on his upcoming personal memoir titled \"Freedom of Money\", but the media coverage was based solely on an early draft and was unauthorized. CZ also revealed that the new book is still in the editing process, with each round of revisions typically taking 2 to 3 weeks, and the title is also subject to change.  ﻿",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053098&language=en-US",
            "pub_date": "2026-02-28 11:46:29",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053097,
            "title": "GEOPOLITICS | Cuban Embassy Reveals Details of Armed Infiltration Attempt from Florida",
            "description": "On February 28, the Cuban Embassy in the United States released new details regarding an attempted armed infiltration by American speedboats with alleged terrorist intentions. According to Jin10, the statement clarified that the operation involved two boats departing from Florida, not just one as previously thought. One of the boats experienced technical difficulties, prompting the crew to transfer to the other vessel, ultimately arriving at their destination aboard a single boat. Cuban authorities seized 134 magazines and a total of 12,846 rounds of ammunition of various calibers.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053097&language=en-US",
            "pub_date": "2026-02-28 11:47:48",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053096,
            "title": "Tether Freezes Billions in USDT Linked to Illicit Activities",
            "description": "Tether has taken significant action by freezing approximately $4.2 billion worth of USDT associated with illicit activities. According to NS3.AI, this includes $3.5 billion that has been frozen since 2023. Recently, Tether collaborated with the U.S. Department of Justice to freeze nearly $61 million connected to 'pig-butchering' scams. Despite these measures, the circulating supply of USDT remains above $180 billion. Tether continues to have the capability to freeze tokens remotely when requested by law enforcement.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053096&language=en-US",
            "pub_date": "2026-02-28 11:49:15",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053095,
            "title": "Bitcoin Trading Patterns Show Unique 'U-Shaped' Structure",
            "description": "Crypto KOL Murphy posted on X that recent data from URPD indicates a significant shift in Bitcoin trading patterns. Over the past week, 1.71 million BTC changed hands in the $63,000 to $68,000 range, up from 1.53 million BTC, suggesting that bulls have acquired 180,000 BTC in this period. This activity contrasts with the accumulation of 1.89 million BTC in the $87,000 to $92,000 range, creating a unique 'U-shaped' structure with a gap in the $71,000 to $80,000 range. This gap indicates that during the last price surge in October 2024, Bitcoin quickly surpassed this range without significant trading, and similarly, it dropped rapidly during the recent decline.\n\nThe $63,000 to $68,000 range is becoming increasingly robust, indicating that some investors see value in Bitcoin at these prices, potentially providing support. As long-term holders reduce their selling, there is potential to challenge the aforementioned gap again.\n\nBelow $63,000, the only significant accumulation is at $16,000, where 391,000 BTC remain untouched since the last bear market bottom. It is unlikely that Bitcoin will return to $16,000 in this cycle. If the $63,000 to $68,000 range is breached, predicting the next support level is challenging. It will depend on where bulls establish a new defense, potentially forming a 'W-shaped' structure with the current accumulation zone, which would be a remarkable phenomenon.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053095&language=en-US",
            "pub_date": "2026-02-28 11:53:58",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}