{
    "data": [
        {
            "id": 1053165,
            "title": "Beast Industries CEO Jeff Housenbold Expresses Strong Support for Ethereum as a Blockchain Pillar",
            "description": "Jeff Housenbold, President and CEO of Beast Industries, has expressed strong support for Ethereum, highlighting its role as a core pillar of stablecoins and blockchain technology. According to Bitalk News, Housenbold emphasized the significance of the DeFi movement, noting its contribution to broader accessibility, financial democratization, and reduced capital costs for consumers. He also pointed out the secure and reliable global transfer of funds enabled by these technologies.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053165&language=en-US",
            "pub_date": "2026-02-28 13:08:50",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053164,
            "title": "BlackRock and Goldman Sachs Compete to Fund Phoenix Group's Pension Risk Expansion",
            "description": "BlackRock and Goldman Sachs are entering the competition to provide funding for Phoenix Group's pension risk transfer business expansion. According to Jin10, this move comes as U.S. investors increasingly engage with the UK retirement plan market. The involvement of these major asset management firms highlights the growing interest in pension risk transfer strategies, which aim to manage and mitigate the financial risks associated with pension liabilities. Phoenix Group's expansion in this area reflects broader trends in the financial industry, where companies seek innovative solutions to address the challenges posed by pension obligations. The participation of BlackRock and Goldman Sachs underscores the significance of this market segment and its potential for growth.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053164&language=en-US",
            "pub_date": "2026-02-28 13:09:18",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053163,
            "title": "Cryptocurrency Startups See Decline in February Venture Capital Funding",
            "description": "In February, cryptocurrency startups secured approximately $883 million in venture capital, marking a 13% decrease compared to over $1 billion in the same period last year. According to Odaily, DWF Labs Managing Partner Andrei Grachev noted that investors are now prioritizing revenue, user base, and the survival capabilities of projects during bear markets, leading to more cautious investment strategies. Grachev highlighted that by 2026, venture capital will focus on stablecoins, payment infrastructure, AI agents, and compliance and fund management tools for institutions. Significant funding rounds in February included Flying Tulip raising $206 million through token sales, digital goods platform Whop receiving a $200 million strategic investment from Tether, and U.S. digital asset bank Anchorage Digital obtaining a $100 million strategic equity investment from Tether.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053163&language=en-US",
            "pub_date": "2026-02-28 13:11:21",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053162,
            "title": "Japan Plans to Develop Rare Earth Mines in Africa",
            "description": "Japan's government is reportedly planning to develop rare earth mines in certain regions of Africa. According to Jin10, this initiative aims to secure a stable supply of critical minerals essential for various industries, including technology and manufacturing. The move comes amid growing global demand for rare earth elements, which are vital for producing electronics, renewable energy technologies, and other high-tech applications. Japan's strategy reflects its efforts to diversify sources and reduce dependency on existing suppliers, ensuring long-term resource security. This development could potentially impact global rare earth markets and influence geopolitical dynamics in the region.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053162&language=en-US",
            "pub_date": "2026-02-28 13:12:12",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053160,
            "title": "Mt. Gox's former CEO floats hard fork to recover 80K hacked Bitcoin",
            "description": "Mark Karpelès said it has been 12 years since the start of Mt. Gox’s bankruptcy proceedings and “this is probably the last sore point on this whole case. ”\nsource: https://cointelegraph.com/news/mt-gox-former-ceo-proposes-hard-fork-recover-lost-bitcoin?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053160&language=en-US",
            "pub_date": "2026-02-28 12:59:48",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053159,
            "title": "AI Bot Accidentally Sends $250K in Memecoins to Random User",
            "description": "An AI crypto bot accidentally sent $250K in memecoins to a social media user, underscoring risks in automated trading and AI-driven finance.\nsource: https://catenaa.com/markets/cryptocurrencies/ai-bot-accidentally-sends-250k-in-memecoins-to-random-user/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053159&language=en-US",
            "pub_date": "2026-02-28 13:00:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053158,
            "title": "Japan Plans to Limit Battery Packs on Flights to Prevent Fires",
            "description": "Japan is reportedly planning to restrict the number of battery packs passengers can bring on flights to prevent fires. According to Jin10, the proposed regulations would limit each passenger to a maximum of two battery packs with a capacity of 160 watt-hours or less, including camera batteries. There will be no limit on battery packs with a capacity of 100 watt-hours or less. Additionally, passengers will be prohibited from charging battery packs using onboard power outlets during flights.\n\nThe Ministry of Land, Infrastructure, Transport and Tourism intends to amend the regulations by mid-April and will seek public opinion by the end of March. A similar regulation may be approved by the International Civil Aviation Organization, a United Nations agency, as early as next month.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053158&language=en-US",
            "pub_date": "2026-02-28 12:57:12",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053156,
            "title": "Arkham analyst corrected: Trump Media Technology Group did not sell 2,000 BTC; they were transferred as collateral.",
            "description": "Arkham analyst Emmett Gallic has corrected his previous statement regarding Trump Media Technology Group's sale of 2,000 BTC. He stated that the tweet has been deleted, clarifying that the company did not sell Bitcoin, but rather provided 2,000 BTC as collateral to a counterparty. Gallic explained that since the Bitcoin was no longer under the company's control, it was removed from the balance sheet. Under the arrangement, the counterparty could decide whether to re-pledge or otherwise dispose of the collateral, including selling it.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053156&language=en-US",
            "pub_date": "2026-02-28 12:58:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053155,
            "title": "Crypto startups raised $883 million in February, a 13% decrease year-over-year.",
            "description": "Crypto startups raised approximately $883 million in venture capital in February, a decrease of about 13% compared to the over $1 billion raised in the same period last year. Andrei Grachev, Managing Partner of DWF Labs, stated that investors are currently more focused on revenue, user scale, and a project's ability to survive in a bear market, leading to a more cautious investment strategy. He pointed out that in 2026, venture capital will focus on stablecoins and payment infrastructure, AI agents, and compliance and treasury management tools for institutions. Major funding rounds in February included: Flying Tulip raising $206 million through a token sale; digital goods platform Whop receiving a $200 million strategic investment from Tether; and US digital asset bank Anchorage Digital receiving a $100 million strategic equity investment from Tether. (DL News)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053155&language=en-US",
            "pub_date": "2026-02-28 13:01:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053157,
            "title": "Arkham Analyst Clarifies Trump Media's Bitcoin Transaction",
            "description": "Arkham analyst Emmett Gallic has corrected his previous statement regarding Trump Media & Technology Group's handling of 2,000 BTC. According to ChainCatcher, Gallic clarified that the company did not sell the Bitcoin but instead delivered it as collateral to a counterparty.\n\nGallic explained that since the Bitcoin is no longer under the company's control, it has been removed from the balance sheet. The arrangement allows the counterparty to decide whether to repledge or otherwise dispose of the collateral, including selling it.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053157&language=en-US",
            "pub_date": "2026-02-28 13:03:54",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053149,
            "title": "Japanese Firm Plans Bitcoin Acquisition Amid Inflation Concerns",
            "description": "Japanese company Daitou Limex, listed under the securities code 3205, has announced its board's decision to purchase Bitcoin (BTC) with an upper limit of 1 billion yen. According to Odaily, this move is part of the company's asset allocation strategy outlined in its mid-term business plan for the fiscal period ending March 2029. The firm aims to incorporate BTC into its asset portfolio to address inflation and yen depreciation risks, achieve asset diversification, and mitigate risks. The company believes that Bitcoin's limited supply and low correlation with traditional assets make it a suitable choice for these objectives.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053149&language=en-US",
            "pub_date": "2026-02-28 12:28:01",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053148,
            "title": "China's Capital Markets Experience Rebound Driven by Equity and Bond Growth",
            "description": "China's capital markets saw a significant rebound last year, driven by a notable increase in equity refinancing and bond issuance. Bloomberg posted on X, highlighting data from the National Bureau of Statistics that underscored this growth. The surge in these financial activities contributed to the overall recovery of the markets, reflecting a positive trend in the country's economic landscape. This development marks a pivotal moment for China's financial sector, as it continues to navigate the complexities of the global economy.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053148&language=en-US",
            "pub_date": "2026-02-28 12:28:13",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053147,
            "title": "GEOPOLITICS | French President Macron Plans April Visit to Japan",
            "description": "French President Emmanuel Macron is scheduled to visit Japan in April, according to Jin10. This visit aims to strengthen diplomatic ties and discuss various bilateral and global issues. The trip underscores the importance of Franco-Japanese relations in the current geopolitical landscape. Further details on the agenda and specific dates are yet to be disclosed.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053147&language=en-US",
            "pub_date": "2026-02-28 12:32:56",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053146,
            "title": "Bitcoin Falls to $65,000 Amid Strong Producer-Price Data and Nvidia Stock Decline",
            "description": "Bitcoin's price dropped to $65,000 over the weekend, reversing gains made earlier in the week. According to NS3.AI, the decline was influenced by robust producer-price data and a decrease in Nvidia's stock following its earnings report. Other significant cryptocurrencies, including Solana, XRP, and Dogecoin, experienced a similar downturn, each falling approximately 6%.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053146&language=en-US",
            "pub_date": "2026-02-28 12:34:14",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053114,
            "title": "Critical Bug in XRP Ledger's Batch Amendment Prevented from Mainnet Deployment",
            "description": "An AI-driven tool has identified a significant vulnerability in the XRP Ledger's Batch amendment, which impacted signature validation. According to NS3.AI, the flaw was discovered during the voting process, allowing for timely intervention. Validators were quickly advised to reject the amendment to safeguard wallets from potential exploits.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053114&language=en-US",
            "pub_date": "2026-02-28 12:17:24",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053113,
            "title": "YZi Labs Alleges Undisclosed 10X Ownership in CEA Industries, Demands Immediate SEC Disclosure",
            "description": "YZi Labs posted a new article on X, demanding immediate SEC disclosures, alleging that undisclosed warrant exercises may have pushed 10X Capital’s ownership above 5%, raising concerns about transparency, potential reporting violations, and the existence of an undisclosed insider “group.” YZi Labs cited company filings suggesting that 10X Capital Asset Management LLC and affiliates beneficially own more than 5% of CEA Industries Inc. shares, and criticizes the lack of a required Schedule 13D filing by 10X and board member Hans Thomas.The firm argues that 10X’s silence following public calls for clarification raises concerns that mandatory SEC reporting requirements may have been deliberately avoided, limiting shareholder transparency.Company filings show that 2,376,236 warrants were exercised during the relevant period, closely matching the number of shares underlying warrants held by 10X-affiliated entities.YZi Labs confirms it did not exercise its warrants, reinforcing the inference that the exercised warrants were attributable to 10X-related entities.Based on 44,062,938 shares outstanding as of December 12, 2025, the exercised warrants alone would represent approximately 5.39% ownership, suggesting 10X may have exceeded the SEC reporting threshold.YZi Labs contends that overlapping affiliations and aligned ownership among 10X-linked entities and company insiders warrant scrutiny as possible concerted action requiring disclosure under Section 13(d)(3).",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053113&language=en-US",
            "pub_date": "2026-02-28 12:18:39",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053111,
            "title": "Japanese listed company Daido Rimet has decided to purchase up to 1 billion yen worth of Bitcoin.",
            "description": "Japanese listed company Daido Limtec (stock code: 3205) announced that its board of directors has approved a resolution to purchase Bitcoin (BTC) with a maximum purchase amount of 1 billion yen. The announcement stated that this move is based on the company's asset allocation plan in its mid-term business plan ending March 2029, and intends to incorporate a portion of its funds into its asset portfolio in the form of BTC. The company stated that this move aims to address inflation and yen depreciation risks, achieve asset diversification and risk mitigation, and believes that BTC has characteristics such as a limited total supply and low correlation with traditional assets.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053111&language=en-US",
            "pub_date": "2026-02-28 12:22:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053112,
            "title": "GEOPOLITICS | U.S. Deputy Secretary of State Backs Pakistan's Stance on Afghan Conflict",
            "description": "U.S. Deputy Secretary of State has expressed support for Pakistan's position regarding the ongoing conflict in Afghanistan. According to Jin10, this endorsement comes amid heightened tensions and complex geopolitical dynamics in the region. The U.S. official's statement highlights the importance of Pakistan's role in seeking a resolution to the Afghan conflict, emphasizing collaboration and diplomatic efforts. This development underscores the strategic significance of Pakistan in regional stability and the broader implications for international relations.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053112&language=en-US",
            "pub_date": "2026-02-28 12:23:55",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053107,
            "title": "BSC chain's Meme coin, Freedom of Money, briefly surpassed $7 million, increasing more than 82 times in 24 hours.",
            "description": "According to GMGN data, the market capitalization of Meme coin Freedom of Money, part of the BSC ecosystem, briefly exceeded $7 million, currently trading at $6.5 million, representing a 24-hour increase of over 82 times. Odaily reminds users that Meme coin prices are highly volatile, and investors should be aware of the risks. Previous news: CZ: My personal memoir, \"Freedom of Money,\" is about to be published.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053107&language=en-US",
            "pub_date": "2026-02-28 12:06:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053110,
            "title": "U.S. Federal Judge Blocks ICE Arrests Without Cause in Oregon",
            "description": "A federal judge in Oregon has issued a ruling prohibiting the U.S. Immigration and Customs Enforcement (ICE) from conducting arrests without reasonable cause in the state. According to Jin10, the judge stated that ICE's actions were in violation of clear and undisputed laws. This decision marks a significant legal development in the ongoing debate over immigration enforcement practices in the United States.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053110&language=en-US",
            "pub_date": "2026-02-28 12:07:47",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}