{
    "data": [
        {
            "id": 733477,
            "title": "DMG Blockchain Reports January Bitcoin Mining Output",
            "description": "According to PANews, DMG Blockchain has released its operational report for January 2025. The report reveals that the company mined 31 Bitcoins during the month, bringing its total Bitcoin holdings to 431.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733477&language=en-US",
            "pub_date": "2025-02-04 20:24:01",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733476,
            "title": "THORChain approves conversion of $200M debt into equity tokens",
            "description": "THORChain node operators have approved a restructuring plan allowing it to convert its $200M debt into equity tokens. The move is aimed at stabilizing THORChain’s operations by addressing its liabilities. THORChain (RUNE) price rose 13.7% after the news but remains down 72.7% over the past month. THORChain node operators have approved a restructuring plan proposal […]\nThe post THORChain...\nsource: https://coinjournal.net/news/thorchain-approves-conversion-of-200m-debt-into-equity-tokens/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733476&language=en-US",
            "pub_date": "2025-02-04 20:10:21",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733475,
            "title": "Ethereum Price to Hit $18K by September 2025, Analyst Predicts",
            "description": "Ethereum (ETH) price continues to capture market attention, with a bold price forecast of $18,000 by September 2025. Market analyst @best_analysts has outlined this projection based on Ethereum’s ascending price channel. In fact, consistent institutional interest and the broader crypto market trends have added to the projections. Despite recent volatility, Ethereum has remained within a...\nsource: https://www.thecoinrepublic.com/2025/02/04/ethereum-price-to-hit-18k-by-september-2025-analyst-predicts/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733475&language=en-US",
            "pub_date": "2025-02-04 20:11:08",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733474,
            "title": "Can XRP hit $6 amid the market’s current recovery wave?",
            "description": "XRP is staging a comeback after a sharp selloff, despite ongoing market uncertainty. The cryptocurrency has struggled following a broader … Continue reading\nThe post Can XRP hit $6 amid the market’s current recovery wave? appeared first on Finbold.\nsource: https://finbold.com/can-xrp-hit-6-amid-the-markets-current-recovery-wave/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733474&language=en-US",
            "pub_date": "2025-02-04 20:11:19",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733473,
            "title": "Bitcoin (BTC) Rejection at $100,000 Triggers $527 Million in Crypto Liquidations",
            "description": "Crypto liquidations jumped to $527 million as bears swoop into Bitcoin market\nsource: https://u.today/bitcoin-btc-rejection-at-100000-triggers-527-million-in-crypto-liquidations",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733473&language=en-US",
            "pub_date": "2025-02-04 20:12:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733472,
            "title": "Pro-Crypto Regulation Expected In The U.S. By November, Says Scaramucci",
            "description": "According to CoinDesk, Anthony Scaramucci, who briefly served as U.S. President Donald Trump's communications director in 2017, anticipates the drafting of pro-crypto regulations in the United States by November. Scaramucci, the founder of SkyBridge Capital, shared his prediction during the Digital Assets Forum in London and elaborated on his views in an interview with the Financial Times. He explained that members of Congress, who face re-election every two years, may seek to avoid opposition from the crypto industry by advocating for positive crypto regulations. With campaign preparations needing to start by March 2026, Scaramucci believes that pro-crypto legislation will likely be part of the legislative flurry before the congressional Christmas recess, suggesting a November timeline for its introduction.During his presidential campaign, Trump had promised to be a pro-crypto leader and subsequently issued an executive order to establish policies supporting digital assets in the U.S. Despite his natural inclination to support any administration that advances such policies, Scaramucci has been a vocal critic of Trump, describing him as \"insane\" and \"unwell\" in the interview. Scaramucci also commented on Trump's official memecoin, TRUMP, labeling it as detrimental to the industry. The coin experienced a significant price spike to nearly $73 following its launch on January 18 but has since plummeted by over 76%. Scaramucci expressed concerns that TRUMP could damage the industry's reputation by making it appear fraudulent. However, he acknowledged that the memecoin demonstrated the capabilities of the Solana blockchain, as the substantial trading activity served as a stress test for potential tokenization of bonds or stocks. He noted that while he does not favor memecoins, they can be beneficial in testing blockchain systems.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733472&language=en-US",
            "pub_date": "2025-02-04 20:07:32",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733461,
            "title": "Galaxy Digital Expands Staking Services Through BitGo Partnership",
            "description": "According to CoinDesk, Galaxy Digital, led by Mike Novogratz, is extending its blockchain staking services to BitGo Trust, a regulated custody specialist, despite ongoing legal disputes between the two companies. This collaboration allows Galaxy's staking and validator services, which manage over $4 billion in staked crypto assets, to be accessible to BitGo's institutional clients. This enables investors to earn staking rewards while using their assets as collateral for loans and trading on Galaxy's platform.\n\nIn early 2023, Galaxy withdrew from a deal to acquire BitGo, prompting BitGo to file a $100 million lawsuit, accusing Galaxy of breaching their May 2021 merger agreement. Despite this legal conflict, both firms issued a joint statement expressing their commitment to strategic collaboration and the potential to drive digital asset adoption, viewing the legal proceedings as a separate issue.\n\nStaking, which involves locking up crypto tokens to support blockchain operations in exchange for rewards, is a crucial aspect of the cryptocurrency ecosystem. Under U.S. President Donald Trump's pro-crypto administration, there are indications that staking will gain further prominence in the United States. Galaxy has been enhancing its non-custodial staking infrastructure, acquiring blockchain node operator CryptoManufaktur (CMF) in July of the previous year. Being included in BitGo's list of staking providers signifies full integration with secure custodial services, offering a comprehensive solution, according to Zane Glauber, head of Galaxy's Blockchain Infrastructure team.\n\nGlauber highlighted that Galaxy's unique offering lies in the enhanced products available to customers with assets in a custodial relationship. With appropriate documentation, these assets can be used as collateral within Galaxy's trading environment, allowing them to be utilized for borrowing cash or engaging in derivative strategies while also earning staking rewards.\n\nThe emergence of a crypto-friendly U.S. government raises the prospect of staking being incorporated into exchange-traded funds (ETFs) for proof-of-stake tokens like Ethereum's ether (ETH). Glauber noted that if staking is included in ETF products, fund managers must carefully consider liquidity risk. Staking involves locking assets for a set period, and in Ethereum, un-bonding queues can vary based on supply, demand, and on-chain dynamics. Financial products can help mitigate these issues by providing liquidity through access to collateral product suites.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733461&language=en-US",
            "pub_date": "2025-02-04 20:06:32",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733456,
            "title": "Coinbase accused of neglecting security, costing users up to $300M annually",
            "description": "Crypto investigators ZachXBT and tanuki42 claim Coinbase neglected security lapses that cost users more than $300 million annually.\nsource: https://cointelegraph.com/news/coinbase-accused-ignoring-security-scams?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733456&language=en-US",
            "pub_date": "2025-02-04 19:48:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733455,
            "title": "Crypto Market Rebounds Strongly Despite Tariff Wars",
            "description": "TL;DR The crypto market has shown remarkable resilience, rebounding strongly despite the ongoing tariff wars between the United States and China, with major cryptocurrencies regaining lost ground. The initial announcement of tariffs by President Trump led to significant declines and a record $2.29 billion in liquidations. Despite the initial shock, Bitcoin briefly reclaimed the $100,000 ......\nsource: https://crypto-economy.com/crypto-market-rebounds-strongly-despite-tariff-wars/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733455&language=en-US",
            "pub_date": "2025-02-04 19:51:47",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733454,
            "title": "Trump’s Crypto Czar David Sacks to Hold Key Press Conference – What to Watch\nDavid Sacks, the newly appointed AI & #Crypto Czar under President Trump, is set to hold a press conference today at 2:30 PM ET. The crypto market is on high alert, anticipating potential policy…",
            "description": "null\nsource: https://x.com/Bitcoinsensus/status/1886744987406110727",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733454&language=en-US",
            "pub_date": "2025-02-04 19:53:53",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}