{
    "data": [
        {
            "id": 733814,
            "title": "Crypto Markets Structure, Stablecoin Bills Will Pass Within Trump's First 100 Days: Senator Scott",
            "description": "A stablecoin bill proposed Tuesday will likely come first, lawmakers announced at a press conference from White House AI and Crypto Czar David Sacks.\nsource: https://decrypt.co/304397/crypto-markets-structure-stablecoin-bills-trump-100-days",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733814&language=en-US",
            "pub_date": "2025-02-05 04:55:17",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733812,
            "title": "Bitcoin Price Makes a Short-lived Move Above $100K, What to Expect Next?",
            "description": "Bitcoin (BTC) price has recovered to $100,000 after briefly falling below $92,000, marking a strong rebound amid market uncertainty. The recovery follows a period of heightened volatility that saw major cryptocurrencies experience steep declines before buyers stepped in. Market Recovery and Key Support Levels Bitcoin’s price action shows that $98,991 is acting as a short-term […]\nThe post...\nsource: https://www.thecoinrepublic.com/2025/02/04/bitcoin-price-makes-a-short-lived-move-above-100k-what-to-expect-next/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733812&language=en-US",
            "pub_date": "2025-02-05 04:58:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733811,
            "title": "President Trump’s Son Issues Epic Ethereum Endorsement, Declares Now Is The Perfect Time To Buy ETH",
            "description": "The Donald Trump-linked DeFi protocol World Liberty Financial and President Trump’s second son, Eric Trump, continue to be bullish on Ether.\nsource: https://zycrypto.com/president-trumps-son-issues-epic-ethereum-endorsement-declares-now-is-the-perfect-time-to-buy-eth/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733811&language=en-US",
            "pub_date": "2025-02-05 04:59:14",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733818,
            "title": "ETH falls below 2700 USDT",
            "description": "OKX market data shows that ETH fell below 2700 USDT and is now at 2697.02 USDT, with a 24-hour drop of 0.62%. (This newsletter is generated by AI)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733818&language=en-US",
            "pub_date": "2025-02-05 05:02:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733810,
            "title": "Bitcoin Block Size Could Reach 4 MB With Widespread Inscriptions",
            "description": "According to Cointelegraph, the Bitcoin network's average block size could potentially increase to 4 megabytes (MB) per block with the widespread adoption of inscriptions. This projection comes from a report by Mempool Research dated February 4. Currently, Bitcoin's average block size is slightly above 1.5 MB. Inscriptions, a method for efficiently encoding arbitrary data within a block, could significantly boost this size if widely adopted.\n\nThe block size is a crucial factor in the scalability of the Bitcoin network. In comparison, the Solana blockchain can theoretically accommodate up to 128 MB per block, as noted by the Solana Foundation. Following Bitcoin's Taproot upgrade in 2021, some blocks have already stored up to 2.4 MB of data. The report suggests that each Bitcoin block could potentially hold as much as 4 MB.\n\nThe report outlines various growth scenarios for the Bitcoin blockchain, ranging from a return to pre-inscription dynamics, which would result in slower growth, to widespread inscription adoption, potentially driving growth to 4 MB per block. Under these scenarios, the blockchain could reach 1 terabyte as early as late 2026, though a timeframe between mid-2027 and 2029 seems more likely.\n\nBitcoin originated as a simple peer-to-peer payment protocol, but the Taproot upgrade has enabled the network to support more complex activities, such as creating and trading different types of tokens and minting non-fungible tokens (NFTs). This has revitalized Bitcoin's ecosystem, leading to the emergence of native decentralized exchanges and layer-2 scaling solutions.\n\nBitcoin-native decentralized finance (DeFi) is anticipated to be a major theme in 2025, as institutional adoption of Bitcoin accelerates and its DeFi ecosystem matures. However, Bitcoin faces competition from other networks that offer more block space, allowing for more complex transactions and potentially lower costs for users. In September, Celestia, a layer-1 network specializing in data availability, revealed a technical roadmap aiming to scale block size to 1 gigabyte.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733810&language=en-US",
            "pub_date": "2025-02-05 04:53:40",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733808,
            "title": "Bitcoin block size could grow to 4 MB with inscriptions: Research",
            "description": "Block sizes have increased steadily since Bitcoin's Taproot upgrade, but they have more room to grow, according to Mempool Research.\nsource: https://cointelegraph.com/news/bitcoin-block-size-4-mb-inscriptions-research?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733808&language=en-US",
            "pub_date": "2025-02-05 04:45:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733807,
            "title": "Crypto Czar Criticizes SEC’s Harsh Approach Amid Ongoing Ripple Lawsuit, Calls for Clearer Rules",
            "description": "The post Crypto Czar Criticizes SEC’s Harsh Approach Amid Ongoing Ripple Lawsuit, Calls for Clearer Rules appeared first on Coinpedia Fintech News\nThe ongoing legal battle between Ripple Labs and the U.S. Securities and Exchange Commission (SEC) has now spanned over four years, drawing sharp criticism from Ripple’s CEO, Brad Garlinghouse, and other crypto industry leaders. As the case...\nsource: https://coinpedia.org/news/crypto-czar-criticizes-secs-harsh-approach-amid-ongoing-ripple-lawsuit-calls-for-clearer-rules/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733807&language=en-US",
            "pub_date": "2025-02-05 04:46:29",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733803,
            "title": "Musk changes X account profile to \"White House Technical Support Staff\"",
            "description": "Musk changed his X account profile to \"White House Tech Support.\"",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733803&language=en-US",
            "pub_date": "2025-02-05 04:42:51",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733802,
            "title": "Acting SEC Chairman Appoints Former Coin Center Director to Cryptocurrency Working Group",
            "description": "Landon Zinda has resigned from his position as policy director at cryptocurrency advocacy group Coin Center to join the U.S. Securities and Exchange Commission’s (SEC) cryptocurrency task force. In a notice on Feb. 4, Acting SEC Chairman Mark Uyeda said Zinda has joined the commission as his legal counsel and senior advisor to the cryptocurrency task force. The former Coin Center director will join the task force, led by Commissioner Hester Peirce, working alongside Chief of Staff Richard Gabbert and Chief Policy Advisor Taylor Asher.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733802&language=en-US",
            "pub_date": "2025-02-05 04:43:27",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733801,
            "title": "Market News: Meta Platforms is merging the teams behind Facebook and Messenger into a single unit",
            "description": "According to The Information: Meta Platforms (META.O) is merging the teams behind Facebook and Messenger into a single unit. (Jinshi)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733801&language=en-US",
            "pub_date": "2025-02-05 04:43:52",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}