{
    "data": [
        {
            "id": 1050482,
            "title": "Bloomberg and Kaiko Collaborate to Enhance On-Chain Data Access",
            "description": "Bloomberg and Kaiko have announced a partnership to develop an on-chain data access solution that incorporates Bloomberg Data License data into blockchain platforms. According to NS3.AI, this initiative addresses challenges such as inconsistent data sources, timing discrepancies, and fragmented data pipelines, which have led to operational difficulties and higher reconciliation costs. By providing direct access to Bloomberg's data on-chain, the solution aims to offer a dependable single source of truth, enhancing automation and minimizing ambiguity in tokenized market workflows.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050482&language=en-US",
            "pub_date": "2026-02-26 21:59:04",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050481,
            "title": "China Removes Upper Limit on RMB Account Financing Ratios",
            "description": "The People's Bank of China has announced the removal of the upper limit regulation on RMB account financing ratios. According to NS3.AI, domestic banks that have outstanding RMB cross-border interbank financing exceeding the set limits are required to halt new financing activities until their balances return to normal levels. This policy adjustment is intended to streamline cross-border RMB business operations and enhance the associated regulatory framework.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050481&language=en-US",
            "pub_date": "2026-02-26 21:59:23",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050476,
            "title": "Binance has submitted a MiCA license application to Greece, advancing its compliance expansion within the EU.",
            "description": "Binance co-CEO Richard Teng revealed that the exchange submitted an application to Greek regulators last month to obtain an operating license under the EU's Crypto Asset Market Regulation (MiCA). MiCA requires crypto companies to obtain a license by July 2026 to operate within the EU. Teng stated that MiCA licenses are standardized across Europe, thus requiring consideration of multiple factors such as labor force, talent pool, and security; Greece is considered a suitable base for expansion within the EU. The crypto market has experienced significant volatility over the past year, with Bitcoin falling approximately 50% from its October high of $126,000. Teng noted that retail investor sentiment has weakened, but institutional participation remains stable, with \"smart money, institutional funds, and long-term capital continuing to flow in.\" (Finance Feeds)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050476&language=en-US",
            "pub_date": "2026-02-26 22:00:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050480,
            "title": "GEOPOLITICS | Russian Foreign Ministry Criticizes EU's Proposed Oil Import Ban",
            "description": "The Russian Foreign Ministry has strongly criticized the European Union's proposal to permanently ban the import of Russian oil, calling it 'utterly absurd.' According to Jin10, the ministry's statement reflects ongoing tensions between Russia and the EU over energy policies and geopolitical issues. The proposed ban is part of broader EU efforts to reduce dependency on Russian energy sources amid geopolitical conflicts. The Russian government views this move as an escalation of economic measures that could further strain relations between Moscow and Brussels. The EU's proposal is still under discussion, and its potential impact on the global energy market remains uncertain.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050480&language=en-US",
            "pub_date": "2026-02-26 22:01:20",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050461,
            "title": "Analysis: U.S. initial jobless claims rose slightly during the Presidents' Day holiday week but were lower than expected.",
            "description": "The number of Americans filing for unemployment benefits last week rose less than expected, suggesting that layoffs remain at a low level. Initial jobless claims in the U.S. rose by 4,000 to 212,000 in the week ending February 21, compared with a median forecast of 215,000. The survey period included the Presidents' Day holiday. Continuing jobless claims fell to 1.83 million. Claims data can fluctuate before and after holidays. However, the current relatively low number of initial jobless claims is consistent with other recent data indicating a stabilizing labor market. The February jobs report, to be released on March 6, will help policymakers assess whether the strong job growth and decline in the unemployment rate in January were merely temporary changes or signs of continued improvement. (Jinshi)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050461&language=en-US",
            "pub_date": "2026-02-26 21:44:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050466,
            "title": "Bayer's Potential Shift Hinges on Roundup Litigation Resolution",
            "description": "Bayer's ability to reassess its conglomerate structure is contingent upon resolving the ongoing Roundup weedkiller litigation. Bloomberg posted on X, highlighting that a settlement could pave the way for the company to explore strategic changes. The litigation has been a significant factor in Bayer's current operational focus, and its resolution could open new avenues for the company's future direction.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050466&language=en-US",
            "pub_date": "2026-02-26 21:45:29",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050465,
            "title": "GEOPOLITICS | EU Reduces Russian Diplomatic Staff to 40",
            "description": "The European Union has informed Russia of its decision to reduce the number of Russian diplomatic staff in EU institutions to 40, according to Jin10. This move comes amid ongoing geopolitical tensions between Russia and the EU. The reduction in staff is part of a broader strategy by the EU to address diplomatic relations with Russia. The decision reflects the EU's stance on recent developments and its approach to managing diplomatic engagements with Moscow. The Russian Foreign Ministry has acknowledged the notification from Brussels, indicating a significant shift in diplomatic dynamics between the two entities.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050465&language=en-US",
            "pub_date": "2026-02-26 21:48:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050464,
            "title": "Warner Bros. Faces Decline in Fourth-Quarter Sales and Earnings",
            "description": "Warner Bros. has reported a decline in its fourth-quarter sales and earnings, highlighting the challenges the media giant is facing amid ongoing takeover bids. Bloomberg posted on X, noting that the company's financial performance has been impacted by various market pressures.\n\nThe media conglomerate is currently evaluating competing offers from potential buyers, which adds another layer of complexity to its strategic decisions. The decrease in sales and earnings underscores the difficulties Warner Bros. is encountering in maintaining its market position.\n\nAs the company navigates these challenges, it remains focused on assessing the best path forward to enhance shareholder value and sustain its competitive edge in the industry.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050464&language=en-US",
            "pub_date": "2026-02-26 21:50:23",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050437,
            "title": "PRECIOUS METALS | Investor Confidence Wavers as U.S. Stock Valuations Near Dot-Com Bubble Levels",
            "description": "The World Gold Council has highlighted concerns regarding U.S. stock market valuations, which are approaching levels reminiscent of the dot-com bubble era. According to Jin10, the Council warns that repeated failures to meet profit targets could undermine investor confidence. This scenario may lead to a reduction in leveraged operations, potentially amplifying stock price declines and increasing demand for safe-haven assets like gold. Historically, gold has performed well during periods of systemic risk, offering positive returns and mitigating losses across investment portfolios.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050437&language=en-US",
            "pub_date": "2026-02-26 21:41:30",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050436,
            "title": "Axiom Faces Allegations of Misconduct Following Rapid Growth",
            "description": "Axiom, a cryptocurrency trading platform established by Mist and Cal in 2024, has come under scrutiny following allegations of misconduct. The platform, which gained significant traction after participating in Y-Combinator's Winter 2025 batch, has reportedly generated over $390 million in revenue. Blockchain sleuth ZachXBT posted on X about being retained to investigate these allegations after receiving reports concerning the company's operations.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050436&language=en-US",
            "pub_date": "2026-02-26 21:41:45",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050435,
            "title": "Axiom Employee Allegedly Tracks User Data, Raises Privacy Concerns",
            "description": "Blockchain sleuth ZachXBT posted on X about a concerning revelation involving Broox, a senior business development employee at Axiom based in New York. In a recorded clip, Broox allegedly claims the ability to track any Axiom user through reference codes, wallets, or user IDs, asserting he can uncover extensive information about individuals. He reportedly described an initial examination of 10-20 wallets, gradually increasing the number to avoid suspicion.\n\nIn another segment of the same recording, Broox is heard setting guidelines for requesting data lookups from him, promising to provide a comprehensive list of wallets. The recording appears to be a private call among group members discussing strategic approaches.\n\nThese revelations have sparked concerns over privacy and data security within the Axiom platform, raising questions about the ethical implications of such tracking capabilities.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050435&language=en-US",
            "pub_date": "2026-02-26 21:41:55",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050434,
            "title": "Trader Marcell Allegedly Exploits Followers for Exit Liquidity",
            "description": "Blockchain sleuth ZachXBT posted on X about allegations against Marcell, a trader known for his controversial practices. Marcell reportedly purchased significant amounts of meme coin tokens from private wallets before promoting them to his followers on X and Telegram. This strategy, known as bundling, involves using followers as exit liquidity, allowing Marcell to profit from the subsequent price increase. Such traders are often targeted due to the rarity of address reuse and the private nature of their wallets, making insider information highly valuable.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050434&language=en-US",
            "pub_date": "2026-02-26 21:42:08",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050419,
            "title": "EBay Announces Workforce Reduction Amid Strategic Shift",
            "description": "EBay has announced plans to reduce its workforce by approximately 800 positions, representing 6% of its full-time employees. Bloomberg posted on X, stating that the company aims to align its staffing with its strategic priorities. The decision reflects EBay's ongoing efforts to adapt to changing market conditions and optimize its operations. The layoffs are part of a broader strategy to ensure the company's resources are effectively allocated to support its long-term goals. EBay's move comes as businesses across various sectors reassess their workforce needs in response to evolving economic landscapes.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050419&language=en-US",
            "pub_date": "2026-02-26 21:25:08",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050416,
            "title": "World Gold Council: Significant financial speculation could lead to increased demand for gold.",
            "description": "The World Gold Council stated that significant financial speculation could lead to increased demand for safe-haven assets, particularly gold. Gold will be supported by stronger inflation hedging demand and increased correlation between stocks and bonds. However, overvaluation and persistent macroeconomic risks necessitate caution. (Gold10)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050416&language=en-US",
            "pub_date": "2026-02-26 21:27:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050418,
            "title": "World Gold Council Advises Caution Amid High Valuations and Macro Risks",
            "description": "The World Gold Council has issued a cautionary note regarding the current state of the gold market. According to Jin10, the council highlights concerns over high valuations and persistent macroeconomic risks. These factors necessitate a prudent approach for investors navigating the gold market. The council's warning comes amid ongoing global economic uncertainties, which could impact gold prices and investor sentiment. As the market continues to face volatility, the World Gold Council emphasizes the importance of careful consideration in investment strategies.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050418&language=en-US",
            "pub_date": "2026-02-26 21:28:35",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050415,
            "title": "The number of Americans filing for initial jobless claims for the week ending February 21 was 212,000, compared to an expected 215,000.",
            "description": "U.S. initial jobless claims for the week ending February 21 were 212,000, below the expected 215,000 and the previous week's figure revised from 206,000 to 208,000. Continuing jobless claims for the week ending February 14 were 1,833,000, below the expected 1,858,000 and the previous week's figure revised from 1,869,000 to 1,864,000. The four-week moving average of initial jobless claims for the week ending February 21 was 220,250, with the previous week's figure revised from 219,000 to 219,500. (Jinshi)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050415&language=en-US",
            "pub_date": "2026-02-26 21:30:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050380,
            "title": "Citadel's Influence on Market Stability Examined",
            "description": "A recent analysis suggests that Citadel's actions may have contributed to calming the markets earlier this week. Bespoke Investment Group posted on X, highlighting the potential impact of Citadel's strategic decisions on market dynamics. The report explores how Citadel's involvement might have played a role in stabilizing market conditions amid recent fluctuations. While the exact influence of Citadel's actions remains a topic of discussion, the analysis underscores the significant role major financial entities can have on market trends. The report does not provide specific details on the measures taken by Citadel but emphasizes the broader implications of such interventions in the financial landscape.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050380&language=en-US",
            "pub_date": "2026-02-26 21:18:36",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050379,
            "title": "DMG Blockchain Reports Decline in Revenue and Bitcoin Mining Output",
            "description": "DMG Blockchain has released its unaudited financial results for the first quarter of fiscal year 2026, revealing a revenue of 11.2 million CAD, marking a 2% decrease from the previous quarter and a 4% decline year-over-year. According to Odaily, the company mined 69 Bitcoins during the quarter, down from 72 in the previous quarter and 97 in the same period last year. The company's computing power increased by 10% to 1.76 EH/s. DMG Blockchain's cash, short-term investments, and digital assets totaled 58.6 million CAD, a 10% decrease from the end of the fiscal year. Total assets stood at 122 million CAD, reflecting an 8% decline quarter-over-quarter. The net loss was 2.2 million CAD, or 0.01 CAD per share, an improvement from the net loss of 3.1 million CAD in the same period last year. However, due to changes in the fair value of digital assets, the comprehensive net income shifted from a profit of 12.2 million CAD last year to a loss of 16.5 million CAD.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050379&language=en-US",
            "pub_date": "2026-02-26 21:20:06",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050378,
            "title": "HSBC Adjusts Investment Strategy, Shifts Focus to Emerging Markets and Europe",
            "description": "HSBC strategists have reduced their overweight position in U.S. equities, opting to increase investments in emerging markets and Europe. Bloomberg posted on X that this strategic shift is driven by robust economic momentum in these regions. The decision reflects HSBC's assessment of global economic conditions and potential growth opportunities outside the United States. By reallocating resources, HSBC aims to capitalize on the promising economic prospects in emerging markets and Europe, which are currently experiencing strong economic activity.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050378&language=en-US",
            "pub_date": "2026-02-26 21:20:41",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050377,
            "title": "Bitcoin and Ethereum Options Expiry Amid Market Volatility",
            "description": "Adam@Greeks.live posted on X. On February 27, a significant number of Bitcoin and Ethereum options are set to expire, with 116,000 BTC options and 206,000 ETH options reaching maturity. The Put Call Ratio for Bitcoin stands at 0.76, with a maximum pain point of $75,000 and a nominal value of $7.9 billion. For Ethereum, the Put Call Ratio is 0.77, with a maximum pain point of $2,200 and a nominal value of $980 million.\n\nThe cryptocurrency market remains sluggish, with Bitcoin having briefly dipped below the $60,000 mark earlier in February. Throughout the month, Bitcoin has experienced weak fluctuations above this level. Tomorrow, options accounting for 20% of total open interest, amounting to nearly $9 billion, will expire. Bitcoin's open interest has reached a peak not seen in recent years.\n\nThanks to a recent rebound, the implied volatility for both Bitcoin and Ethereum has increased, with BTC's main term IV at 47% and ETH's at 65%. This has somewhat alleviated the downward price trend, although market confidence remains low.\n\nIn terms of trading, large-scale call options have dominated, especially following yesterday's rebound, with significant medium to long-term call transactions. Key options data indicates a comprehensive rebound in Skew, suggesting the emergence of market bottom-fishing forces.\n\nDespite these developments, the market remains bearish. The cryptocurrency sector lacks new capital inflows and notable hotspots, with pessimistic sentiments prevalent on social media. It appears the market bottom has yet to be reached.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050377&language=en-US",
            "pub_date": "2026-02-26 21:20:55",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}