{
    "data": [
        {
            "id": 734431,
            "title": "Algorand Foundation calls on Musk’s Government Efficiency Unit DOGE to adopt its blockchain for government operations",
            "description": "Odaily Planet Daily News Algorand Foundation called on Musk's Government Efficiency Department to adopt DOGE on its blockchain for government operations. The foundation emphasized that Algorand's technology can improve transparency, especially in tracking federal spending. In addition, the Algorand blockchain is built with quantum-resistant security, making it ideal for protecting sensitive government data and preventing tampering. Algorand is a continuous blockchain launched in 2019. Although its native token is a top 50 cryptocurrency by market capitalization, the network has been slow to adopt.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734431&language=en-US",
            "pub_date": "2025-02-05 20:39:51",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734432,
            "title": "Crypto Wallet Users Warned Of Security Risks On Adult Websites",
            "description": "According to ShibDaily, users of Phantom and Trust Wallet have been exposed to a security vulnerability that results in unauthorized fund withdrawals when accessing adult websites through their wallet browsers. This exploit takes advantage of weaknesses in the browser functionality of these wallets. When users visit certain adult websites, malicious scripts are triggered, allowing cybercriminals to gain control over the wallet. Once access is obtained, digital assets are quickly transferred to the attacker's account, with no possibility of recovering the stolen funds.\n\nIn a recent post on X, crypto advocate Dom Lucre highlighted the increasing security threat affecting crypto wallet browsers. He advised users to refrain from accessing adult content sites through their wallets, warning that such actions could lead to significant financial losses. Lucre emphasized that visiting these sites could result in funds being stolen almost instantly.\n\nWallet browsers are integrated web browsers within cryptocurrency wallets that enable users to interact directly with decentralized applications (dApps), conduct transactions, and access web-based services without leaving the wallet interface. These browsers are designed to support activities such as decentralized finance (DeFi) trading, interacting with NFTs, or exploring blockchain-related websites. Popular wallets like Phantom and Trust Wallet include built-in browsers to enhance user experience within the decentralized ecosystem.\n\nFollowing the reports, some users on X expressed confusion over whether it was indeed possible to access adult content sites through wallet browsers. While these browsers are primarily intended for managing digital assets and accessing dApps, it is technically possible for users to access general websites, including adult content, through the wallet's browser feature. However, these wallet browsers lack the same level of security as mainstream browsers such as Chrome. Visiting high-risk sites, such as those hosting adult content, can expose users to hidden malware and phishing threats.\n\nAs the situation develops, experts recommend that crypto wallet providers work toward improving security measures to prevent such exploits. It is crucial for users to stay informed about potential vulnerabilities and exercise caution, especially when interacting with decentralized applications or online platforms that may expose them to risks. Prioritizing security is essential to safeguarding crypto investments from emerging threats.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734432&language=en-US",
            "pub_date": "2025-02-05 20:42:02",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734430,
            "title": "Core Scientific: 256 BTC mined in January",
            "description": "Odaily Planet Daily News: Nasdaq-listed Bitcoin mining company Core Scientific released its production and operations update report for January 2025, which disclosed that mining output in January was 256 BTC, a decrease from the previous month's mining output of 291 BTC.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734430&language=en-US",
            "pub_date": "2025-02-05 20:42:48",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734429,
            "title": "US Senate to hold hearing on de-banking",
            "description": "Odaily Planet Daily News Fox Business reporter Eleanor Terrett posted on the X platform: The U.S. Senate Banking, Housing and Urban Affairs Committee will hold a hearing at 10:00 AM EST on February 5 (23:00 Beijing time on February 5) on the theme of \"Investigating the real impact of debanking on the United States.\" \nWitnesses include: \n• Nathan McCauley, co-founder and CEO of Anchorage Digital \n• Stephen Gannon, partner of Davis Wright Tremaine LLP \n• Mike Ring, president and CEO of Old Glory Bank \n• Aaron Klein, senior fellow in economic studies at the Brookings Institution \nThis hearing will explore the impact of bank account closures and financial service restrictions on businesses and individuals, and study relevant policy responses.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734429&language=en-US",
            "pub_date": "2025-02-05 20:46:24",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734416,
            "title": "XRP Ledger network outage sparks debate over consensus trade-offs",
            "description": "Odaily Planet Daily News Late Tuesday, XRP Ledger was suspended for more than an hour, sparking a heated debate between critics and supporters of the network. Ripple CTO David Schwartz confirmed that XRPL has resumed operation and user funds have not been lost, but the cause of the problem is still under investigation. Some believe that the network outage of more than 1 hour represents a failure of consensus, exposing the network to a critical coordinated attack vector, and criticized the obvious degree of centralization among a relatively small number of trusted validators. In response, Daniel Keller, CTO of blockchain infrastructure company Eminence, said the suspension was \"as planned\" to ensure the integrity of the ledger. \"Every solution has trade-offs. Suspending until a solution is found is one of them.\" \nThe XRP Ledger's network has a total of more than 200 validators. But the number of validators on the unique node list (UNL) trusted by each node is much smaller, and these validators participate in the consensus process. The unique node list (UNL) recommended by the XRPL Foundation contains at least 35 validators. By comparison, although not directly comparable, there are over 1 million active validators on Ethereum, while Bitcoin’s network has at least 65,000 nodes and thousands of miners worldwide. (TheBlock)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734416&language=en-US",
            "pub_date": "2025-02-05 20:29:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734415,
            "title": "Paxos receives regulatory approval to acquire Finnish e-money firm Membrane Finance",
            "description": "Odaily Planet Daily News: Paxos announced that it has obtained regulatory approval to complete the acquisition of Finnish electronic money institution Membrane Finance. The specific acquisition amount has not been disclosed. After the acquisition is completed, Paxos will become a fully licensed EMI (electronic money institution) in Finland and the European Union. This acquisition enables Paxos to expand its regulated platform to provide services to European customers in a safe and compliant manner. (crowdfundinsider)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734415&language=en-US",
            "pub_date": "2025-02-05 20:33:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734418,
            "title": "Paxos Secures Regulatory Approval For Membrane Finance Acquisition",
            "description": "According to Odaily, Paxos has announced that it has received regulatory approval to complete the acquisition of Finnish electronic money institution Membrane Finance. While the specific financial details of the acquisition have not been disclosed, this move will enable Paxos to become a fully licensed Electronic Money Institution (EMI) in Finland and the European Union.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734418&language=en-US",
            "pub_date": "2025-02-05 20:33:40",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734417,
            "title": "Riot Platforms Reports Increased Bitcoin Production in January",
            "description": "According to Odaily, Nasdaq-listed mining company Riot Platforms announced on the X platform that it produced 527 BTC in January. Despite the rising network difficulty, the company's production has increased for the second consecutive month. Riot Platforms currently holds 18,221 BTC.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734417&language=en-US",
            "pub_date": "2025-02-05 20:34:21",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734411,
            "title": "Royco Skyrockets to $3B TVL Ahead of Berachain Launch",
            "description": "Royco Protocol has surged to $3 billion in TVL, becoming one of DeFi’s fastest-growing platforms ahead of Berachain’s highly anticipated launch.\nThe post Royco Skyrockets to $3B TVL Ahead of Berachain Launch  appeared first on NFTgators .\nsource: https://www.nftgators.com/royco-skyrockets-to-3b-tvl-ahead-of-berachain-launch/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734411&language=en-US",
            "pub_date": "2025-02-05 20:18:23",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734409,
            "title": "Binance HODLer Airdrops Berachain (BERA)",
            "description": "Odaily Planet Daily News According to the official announcement, Binance will launch Berachain (BERA) at 13:00 (UTC) on February 6, 2025, and open BERA/BTC, BERA/USDT, BERA/USDC, BERA/BNB, BERA/FDUSD and BERA/TRY trading pairs. In addition, Binance will provide BERA airdrop rewards to users who subscribe BNB to SimpleEarn products between 00:00 (UTC) on January 22, 2025 and 23:59 (UTC) on January 26, 2025. The airdrop information is expected to be announced within 12 hours, and the new tokens will be distributed to users' spot wallets at least 1 hour before trading begins. (This newsletter is generated with the assistance of AI)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734409&language=en-US",
            "pub_date": "2025-02-05 20:20:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}