{
    "data": [
        {
            "id": 734034,
            "title": "Stripe Completes $1.1 Billion Acquisition of Bridge and Adds Its Team",
            "description": "Odaily Planet Daily News Payment company Stripe officially completed the acquisition of stablecoin infrastructure company Bridge on Tuesday, spending $1.1 billion. This is Stripe's largest acquisition to date, marking its major layout in the field of stablecoins. \nBridge's team of about 60 people held a formal induction meeting in San Francisco. New employees received training on Stripe culture, including a crash course on how to write like a Stripe employee and an introduction to Collison's business. These are all part of Stripe's standard fintech training camp, which is held every two weeks for new employees. \nBridge focuses on helping companies accept stablecoin payments while reducing the complexity of direct exposure to digital assets, and its customers include Coinbase and SpaceX. For now, Bridge will continue to run its existing products, while the team is working together to determine the best integration method and explore new products that can be built on Bridge technology. (CNBC)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734034&language=en-US",
            "pub_date": "2025-02-05 12:53:42",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734033,
            "title": "Crypto News Today (05th Feb 2025): Bitcoin Drops to $98k Amid SEC’s New Task Force | XRP Plummets by 7%",
            "description": "The post Crypto News Today (05th Feb 2025): Bitcoin Drops to $98k Amid SEC’s New Task Force | XRP Plummets by 7% appeared first on Coinpedia Fintech News\nThe cryptocurrency market has witnessed a sharp decline today, with the global market cap falling by 2.84% to $3.22 trillion. Trading volume also took a significant hit, dropping by 24.46% to $193.73 billion. The Fear & Greed Index...\nsource: https://coinpedia.org/news/crypto-news-today-05th-feb-2025-bitcoin-drops-to-98k-amid-secs-new-task-force-xrp-plummets-by-7/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734033&language=en-US",
            "pub_date": "2025-02-05 12:34:17",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734031,
            "title": "Li Lin: The “$30 million funding hole” is essentially a loss of position caused by extreme market conditions when the exchange was operating margin trading business.",
            "description": "Odaily Planet Daily News In response to Sun Yuchen's statement that \"Li Lin had a $30 million hole when he sold Huobi\", Li Lin made the following response: \n1. Different understandings of the calculation method of assets during the delivery process\nDuring the HTX delivery process in October 2022, the two parties had major differences in the calculation method of user assets. The specific situation is as follows:\n1. At the time of delivery, our financial team independently eliminated negative asset users in accordance with industry practice and calculated the total assets of users accordingly.\n2. If negative asset users are not eliminated, the calculated total assets of users will be lower than the actual total assets, resulting in insufficient tokens reserved at the time of delivery, affecting user redemption.\n3. All accounts of the delivery process are fully archived and have been fully delivered to Sun Yuchen's team for independent audit and verification.\nSimply put, at the time of delivery, we have taken into account the situation of users' negative assets and reserved sufficient reserves. Mr. Sun Yuchen and I have had many communications on this matter, and Mr. Sun Yuchen has also clearly stated that he hopes to further check the accounts and clarify the facts. Therefore, this is not the so-called \"concealment of transfer\" or \"fund hole\", but because the delivery has been completed for two years, the core personnel and financial data have changed greatly, resulting in misunderstandings between the two parties on the calculation method of financial data at the time of delivery.\n2. About the so-called \"fund hole\"\n1. The \"US$30 million fund hole\" mentioned by Mr. Sun Yuchen is essentially a position-breaking caused by extreme market conditions when the exchange operates margin trading (leverage) business.\n2. The usual practice in the industry is that the exchange will seek compensation from users as soon as possible. After a period of time when it is unable to recover, it will be recognized as an operating loss in finance, and the loss of position-breaking will be covered by business income.\n3. This type of situation is relatively common in the industry and falls within the normal financial processing range, rather than a \"fund gap\" or \"concealment of assets.\"\nHuobi has already used the company's income to do this part of the financial processing when the delivery was made. The assets delivered to the seller completely covered the user's assets, and there was no so-called \"fund hole\".\n3. The delivery contract is subject to Hong Kong law and supports third-party legal arbitration\n1. The asset delivery contract was signed and executed in Hong Kong and is subject to Hong Kong law.\n2. If there is a dispute over the delivery result, we fully support fair rulings through the Hong Kong court or a third-party arbitration institution, and safeguard the legitimate rights and interests of all parties through legal means, rather than unilaterally using social media for unilateral trials.\n4. Understand but oppose irresponsible remarks\n1. Mr. Sun Yuchen, relying on his own strong media influence, unilaterally made remarks against me on a public platform when the facts were not clear and there were serious differences between the two parties.\n2. This behavior seriously affects my business reputation, and may also mislead the market and investors and disrupt the normal operation of the industry.\n3. I ask Mr. Sun Yuchen to immediately stop such behavior, return to the legal framework, and resolve commercial disputes through reasonable and legal channels.\nAccording to previous news, Sun Yuchen posted on X: People familiar with the situation know that Li Lin concealed the due diligence materials at the time (when selling Huobi) and created a $30 million hole internally. In the end, I discovered his manipulation. After being exposed, he cheated and refused to give me a penny. I lent it to the company to fill it.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734031&language=en-US",
            "pub_date": "2025-02-05 12:39:37",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734030,
            "title": "KIP will launch a new generation of AI agents Superior Agents, $KIP rose by more than 40% in a short period of time",
            "description": "Odaily Planet Daily News Julian Peh, co-founder and CEO of decentralized AI underlying protocol KIP, announced through the X platform that KIP launched Superior Agents, a decentralized financial AI agent with the ability to quickly self-learn, think and evolve, and create. Julian also demonstrated the cutting-edge technology of Superior Agents through a video: it can not only conduct market research, strategy formulation, transaction execution and marketing, but also has the ability to self-evaluate and continuously learn and improve.\nIt is understood that Superior Agents is not only a single product, but a complete open framework on which anyone can develop and create customized AI agents using code-free tools. This marks the deep integration of AI and decentralized finance, opening up a new class of financial assets that can operate autonomously and realize value-added.\nInfluenced by the release of Superior Agents, $KIP rose by more than 40% in Gate.io in a short period of time.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734030&language=en-US",
            "pub_date": "2025-02-05 12:42:56",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734028,
            "title": "OpenAI negotiates funding from SoftBank and reaches partnership with Kakao to strategically enter the Asian market",
            "description": "Odaily Planet Daily News South Korean company Kakao Corp. has established a strategic partnership with OpenAI. The cooperation aims to integrate OpenAI's models into Kakao's platforms, including KakaoTalk and the upcoming AI assistant Kanana, while jointly developing AI-driven products for the Korean market.\nAt a joint press conference in Seoul, Kakao CEO Jeong Shin-ah and OpenAI CEO Sam Altman detailed the goals of the cooperation, emphasizing the accessibility and innovation of artificial intelligence.\nThe two companies will use OpenAI's latest AI models to enhance Kakao's services. Kakao will adopt ChatGPT Enterprise as part of its transformation into an \"AI native company.\"\nThe cooperation with Kakao also took place a day before Japan's SoftBank announced the establishment of a joint venture called SB OpenAI Japan. The 50-50 cooperation aims to promote AI services and plans to deploy an AI system called \"Cristal Intelligence\" in SoftBank's subsidiaries, including Arm Holdings and PayPay. The program has a startup budget of US$3 billion per year.\nIn addition, according to recent reports, SoftBank is in talks to invest $10 billion to $25 billion in OpenAI, which could make it the artificial intelligence company's largest backer.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734028&language=en-US",
            "pub_date": "2025-02-05 12:23:55",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734027,
            "title": "New US bill makes downloading DeepSeek a crime, with up to 20 years in prison and a $1 million fine",
            "description": "Odaily Planet Daily News: The U.S. Congress recently proposed the \"2025 U.S. Artificial Intelligence Capability Decoupling from China Act\", which prohibits Americans from assisting China in promoting AI and prohibits Americans from downloading or using DeepSeek. Otherwise, it will be classified as a crime and may be sentenced to up to 20 years in prison and a fine of $1 million.\nThe bill states that if American individuals or companies cooperate with Chinese colleges, universities or laboratories on AI, they may be breaking the law. Illegal companies may be fined up to $100 million. In addition, non-U.S. citizens involved in technology transfer may face deportation.\nThe bill was proposed by Republican Senator Josh Hawley, who served as the Attorney General of Missouri and participated in investigations into suspected election interference by large technology companies, including investigations of Google and Facebook.\nThe United States has previously banned government officials and others from using the DeepSeek application, including major administrative agencies such as the Department of Defense and Congress. (Gronhui)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734027&language=en-US",
            "pub_date": "2025-02-05 12:27:45",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734029,
            "title": "Kakao Corp. Partners With OpenAI To Enhance AI Integration",
            "description": "According to Odaily, South Korean company Kakao Corp. has entered a strategic partnership with OpenAI to integrate OpenAI's models into Kakao's platforms, including KakaoTalk and the upcoming AI assistant, Kanana. The collaboration aims to develop AI-driven products tailored for the South Korean market. During a joint press conference in Seoul, Kakao CEO Jeong Shin-ah and OpenAI CEO Sam Altman outlined the partnership's objectives, emphasizing accessibility and innovation in artificial intelligence. The companies plan to leverage OpenAI's latest AI models to enhance Kakao's services, with Kakao adopting ChatGPT Enterprise as part of its transition to an \"AI-native company.\"\n\nThis partnership coincides with Japan's SoftBank announcing the formation of a joint venture named SB OpenAI Japan, a day prior. This 50-50 collaboration aims to promote AI services and plans to deploy an AI system called \"Cristal Intelligence\" across SoftBank subsidiaries, including Arm Holdings and PayPay, with an initial budget of $3 billion annually.\n\nAdditionally, recent reports indicate that SoftBank is in discussions to invest between $10 billion and $25 billion in OpenAI, potentially making it the largest supporter of the AI company.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734029&language=en-US",
            "pub_date": "2025-02-05 12:33:40",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734025,
            "title": "Bitdeer Bitcoin Mining Expands With New Canada Facility",
            "description": "Bitdeer Bitcoin Mining, led by Jihan Wu, acquired 19 acres in Alberta for $21.7M, securing a 101 MW permit to build a $90M power plant and a 99 MW mining data center.\nsource: https://coincu.com/305450-bitdeer-bitcoin-mining-expands-with-new-canada",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734025&language=en-US",
            "pub_date": "2025-02-05 12:10:07",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734023,
            "title": "Report: Cryptocurrency sector lost $10.25 million due to phishing scams in January, with Ethereum accounting for over 80% of the funds",
            "description": "Odaily Planet Daily News Blockchain security company Scam Sniffer reported that the number of victims of cryptocurrency phishing scams reached 9,220 in January, with a total of $10.25 million stolen, down 56% from December last year (loss of $23.58 million). However, the report pointed out that criminals have been constantly improving and implementing more sophisticated attack methods.\nAmong them, Ethereum users were the most affected by phishing scams, accounting for more than 80% of the stolen funds, with losses exceeding $8.6 million, while BNB Chain and Arbitrum users lost $710,000 and $572,000 respectively, and Polygon and Optimism users lost about $191,000 and $82,000 respectively.\nThe company pointed out that malware-driven attacks dominated. The Uniswap Permit2 vulnerability alone stole $1 million, while direct transfers caused victims to lose $549,000, and another $471,000 was stolen due to transaction simulation scams.\nAnother growing threat involves scams on Telegram, which have surged by more than 2,000% since November 2024.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734023&language=en-US",
            "pub_date": "2025-02-05 12:15:10",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734026,
            "title": "Cryptocurrency Phishing Scams Lead To Significant Losses In January",
            "description": "According to Odaily, blockchain security firm Scam Sniffer reported that in January, 9,220 victims fell prey to cryptocurrency phishing scams, resulting in a total loss of $10.25 million. This marks a 56% decrease compared to December's $23.58 million losses. Despite the decline, the report highlights that cybercriminals are continuously refining and deploying more sophisticated attack methods. Ethereum users were the most affected, accounting for over 80% of the stolen funds, with losses exceeding $8.6 million. Users of BNB Chain and Arbitrum lost $710,000 and $572,000, respectively, while Polygon and Optimism users faced losses of approximately $191,000 and $82,000. The company noted that malware-driven attacks were predominant. The Uniswap Permit2 vulnerability alone resulted in $1 million being stolen, while direct transfers caused victims to lose $549,000, and transaction simulation scams accounted for $471,000 in losses. Another growing threat involves scams on Telegram, which have surged by over 2,000% since November 2024.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734026&language=en-US",
            "pub_date": "2025-02-05 12:23:38",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}