{
    "data": [
        {
            "id": 733299,
            "title": "BNB Drops Below 570 USDT with a 0.93% Decrease in 24 Hours",
            "description": "On Feb 04, 2025, 07:48 AM(UTC). According to Binance Market Data, BNB has dropped below 570 USDT and is now trading at 569.849976 USDT, with a narrowed 0.93% decrease in 24 hours.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733299&language=en-US",
            "pub_date": "2025-02-04 15:48:37",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733298,
            "title": "Pixion Games Secures $12.4 Million Funding For Fableborne Launch",
            "description": "According to Odaily, Pixion Games, the studio behind the Web3 action role-playing game Fableborne, has successfully raised $12.4 million in its latest funding round. The round was led by Delphi Ventures, with participation from Animoca Brands, Yield Guild Games (YGG), and Sky Mavis, the creators of Axie Infinity. This funding is intended to support the launch of the POWER token later this year. Fableborne is a free-to-play Web3 action RPG built on the Ronin blockchain and is currently in its first season of development.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733298&language=en-US",
            "pub_date": "2025-02-04 15:52:16",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733297,
            "title": "Eric Trump Advocates For Increased ETH Holdings",
            "description": "According to Foresight News, Eric Trump, the younger son of U.S. President Donald Trump, recently stated on social media that \"now is the best time to increase ETH holdings.\"",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733297&language=en-US",
            "pub_date": "2025-02-04 15:53:51",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733294,
            "title": "Tron and Movement Labs Deny Involvement in WLFI Token Swap",
            "description": "According to Odaily, Tron has clarified that it did not participate in the token swap agreement proposed by the WLFI crypto project, which is associated with U.S. President Donald Trump's initiatives. A Tron spokesperson informed CoinDesk that the company was not involved in any such token exchange. Similarly, Rushi Manche, co-founder of Movement Labs, stated earlier to CoinDesk that no tokens were sent to anyone, including WLFI. Manche emphasized that there were no transactions or backdoor deals, describing the situation as purely market-driven purchases.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733294&language=en-US",
            "pub_date": "2025-02-04 15:40:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733289,
            "title": "ZachXBT claims Coinbase users lost over $65 million to social engineering scams in last two months",
            "description": "The blockchain sleuth claimed that Coinbase failed to prevent social engineering attacks on exchange users.\nsource: https://www.theblock.co/post/338686/coinbase-users-lost-65-million-social-engineering-attacks-zachxbt?utm_source=rss&utm_medium=rss",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733289&language=en-US",
            "pub_date": "2025-02-04 15:18:58",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733292,
            "title": "Real-World Asset Tokenization Markets Reach New Heights",
            "description": "According to Cointelegraph, the real-world asset (RWA) tokenization markets have reached an all-time high in terms of value tokenized onchain, with a total value locked (TVL) of $17.1 billion. This milestone, achieved in early February, marks a significant recovery for the sector, which has seen a 94% increase in TVL compared to the same period last year, as reported by industry analytics platform RWA.xyz. The surge in RWA tokenization markets coincides with a broader recovery in the crypto market, driven by news that U.S. President Donald Trump has temporarily halted tariffs targeting Canada and Mexico. Over the past 24 hours, the total crypto market capitalization has risen by approximately 7%, with RWA-related digital assets experiencing even greater gains. Notably, Chainlink (LINK), a blockchain oracle provider for real-world assets, saw its native token increase by 22%, reaching over $21. Similarly, Mantra (OM), a layer-1 blockchain focused on RWA, saw its token rise by 23% to $6, while Ondo Finance (ONDO), a DeFi platform, surged nearly 27% to $1.40. The RWA tokenization market's TVL began to rise sharply in early November, aligning with a broader crypto market surge. Since then, it has increased by approximately 26%, or $4 billion. Private credit accounts for nearly 70% of the onchain value, followed by U.S. Treasury debts at 21%, according to RWZ.xyz. Wall Street is also taking notice of the RWA tokenization market, which is projected to reach $30 trillion. Haqq Network co-founder Andrey Kuznetsov highlighted the transformative impact of asset tokenization on financial markets, noting that major financial institutions are preparing to lead this change. Eli Cohen, general counsel of the RWA tokenization platform Centrifuge, anticipates that the Trump administration will publicly renounce restrictive policies, further boosting RWA market growth in 2025.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733292&language=en-US",
            "pub_date": "2025-02-04 15:31:28",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733288,
            "title": "A whale failed to sell ai16z and ZEREBRO at the best time and missed out on more than $40 million in profits",
            "description": "Lookonchain monitoring shows that a whale did not sell ai16z and ZEREBRO at the best time and missed out on more than $40 million in profits. On January 2, the whale made $40.8 million in unrealized profits on ai16z and ZEREBRO, but he did not sell for profit. On January 9, he sold ZEREBRO and lost about $1 million. 10 hours ago, he sold 21.34 million ai16z ($9.18 million) and lost about $1 million again.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733288&language=en-US",
            "pub_date": "2025-02-04 15:15:14",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733280,
            "title": "Binance will remove multiple spot trading pairs including QI/BTC",
            "description": "According to the official announcement, Binance will remove and stop trading of the following spot trading pairs at 03:00 (UTC) on February 6, 2025: QI/BTC, TLM/BTC, VITE/BTC. In addition, Binance will terminate the spot trading robot service for the above spot trading pairs at the same time. Users can still trade these tokens on other trading pairs on Binance. (This newsletter is generated by AI)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733280&language=en-US",
            "pub_date": "2025-02-04 15:01:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733279,
            "title": "Upbit launches NFT New Year Challenge",
            "description": "According to the official announcement, Upbit will hold the NFT New Year Challenge event from February 3 to February 17, 2025. During the event, participants can enjoy transaction fee rebates by placing orders for Ethereum and Polygon-based NFTs, and can receive a maximum reward of 0.5ETH. Newly supported NFT collections include Azuki, BEANZOfficial, etc. The event bonus will be issued in the form of ETH, and 22% tax will be deducted for the part exceeding 50,000 won. (This newsletter is generated by AI)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733279&language=en-US",
            "pub_date": "2025-02-04 15:04:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733274,
            "title": "LBank will provide a subsidy of tens of millions of dollars to users who suffer trading losses between 00:00 on February 2 and 24:00 on February 3",
            "description": "Odaily Planet Daily News LBank announced the launch of a 10 million dollar subsidy campaign, which will provide contract bonus subsidies to users who suffer trading losses between 00:00 on February 2, 2025 and 24:00 on February 3. During this period, users who have accumulated contract trading losses reaching the minimum threshold of 100 USDT can receive contract bonus subsidies, up to 400 USDT.\nIt is reported that the LBank contract bonus is valid for 7 days, and users can use the bonus for contract trading, deduct transaction fees and make up for losses. If profits are generated during use, the profit part can be withdrawn normally.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733274&language=en-US",
            "pub_date": "2025-02-04 14:54:05",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}