{
    "data": [
        {
            "id": 1051271,
            "title": "OpenAI's Policy Update on Reporting Banned Users to Authorities",
            "description": "OpenAI informed Canadian lawmakers about its updated policy regarding banned users. Bloomberg posted on X that the company stated it would have reported a banned ChatGPT user, who later became the main suspect in a significant mass shooting in Canada, to the police under these new guidelines. This policy change reflects OpenAI's commitment to enhancing safety and security measures in response to potential threats. The company aims to collaborate with law enforcement to prevent future incidents by identifying and reporting suspicious activities linked to its platform.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051271&language=en-US",
            "pub_date": "2026-02-27 07:28:53",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051270,
            "title": "Tokyo Core CPI Exceeds Expectations in February",
            "description": "Tokyo's core Consumer Price Index (CPI) for February rose by 1.8% year-on-year, surpassing the anticipated 1.7% and slightly below the previous value of 2.0%. According to Jin10, this increase indicates a persistent inflationary trend in Japan's capital, reflecting broader economic pressures. The data suggests that consumer prices continue to rise, albeit at a slower pace compared to the previous month. Analysts are closely monitoring these figures as they may influence future monetary policy decisions by the Bank of Japan. The CPI is a crucial indicator of inflation, impacting both consumer spending and economic growth.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051270&language=en-US",
            "pub_date": "2026-02-27 07:30:22",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051269,
            "title": "Moomoo to Expand Single-Stock Options for Japanese Equities",
            "description": "Moomoo, a digital brokerage, is set to broaden its offerings in single-stock options for Japanese equities. Bloomberg posted on X that this move aims to tap into the increasing interest from retail investors in Japan. The expansion reflects a strategic effort to cater to the growing demand in the Japanese market.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051269&language=en-US",
            "pub_date": "2026-02-27 07:31:25",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051255,
            "title": "Venezuela's Oil Sales Expected to Reach 40 Million Barrels by February End",
            "description": "U.S. Energy Secretary Wright has announced that Venezuela's crude oil is currently priced at approximately $50 per barrel. According to Jin10, the country is projected to sell 40 million barrels by the end of February. This development comes amid ongoing discussions about global oil prices and market dynamics. The sale of Venezuelan oil at this price point could have implications for international energy markets, influencing both supply and demand factors. Observers are closely monitoring how these sales will impact broader economic trends and geopolitical relations.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051255&language=en-US",
            "pub_date": "2026-02-27 07:20:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051254,
            "title": "U.S. Climate Forecasting Service to Integrate into Federal Departments",
            "description": "The U.S. climate forecasting service is set to be integrated into other federal departments as part of a reorganization plan. Bloomberg posted on X, revealing that the announcement was made to staff on Thursday. This move aims to streamline operations and enhance the efficiency of climate-related services within the government. The reorganization reflects a broader strategy to consolidate resources and improve the delivery of climate forecasts and related services. Further details on how the integration will be implemented have not been disclosed.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051254&language=en-US",
            "pub_date": "2026-02-27 07:23:22",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051245,
            "title": "STABLE: Identifying factors for 2200% volume surge, H&S breakout & more…",
            "description": "STABLE breakout gains strength as leveraged flows rise against negative funding pressure.\nsource: https://ambcrypto.com/stable-identifying-factors-for-2200-volume-surge-hs-breakout-more/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051245&language=en-US",
            "pub_date": "2026-02-27 07:00:25",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051244,
            "title": "'Private Bitcoin' to Launch on Starknet With Zcash-Like Features",
            "description": "Starknet revealed a Bitcoin-based asset aimed at enabling people to better maintain their privacy on the Ethereum layer-2 scaling network.\nsource: https://decrypt.co/359344/private-bitcoin-debuts-starknet-zcash-like-features",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051244&language=en-US",
            "pub_date": "2026-02-27 07:01:12",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051250,
            "title": "Natural Resources Fundraising Struggles Amid Gold and Silver Volatility",
            "description": "Despite experiencing significant volatility in gold and silver prices, fundraising efforts for natural resources strategies have not rebounded to the levels seen in the 2010s. FactSet posted on X, highlighting the disparity between public and private capital flows in this sector. The ongoing fluctuations in precious metal prices have not translated into increased investment activity, indicating a cautious approach from investors. This trend underscores the challenges faced by the natural resources sector in attracting capital amid market uncertainties.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051250&language=en-US",
            "pub_date": "2026-02-27 07:10:25",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051249,
            "title": "Tequila Sales Decline Impacting Jose Cuervo Maker Becle",
            "description": "Becle, the company behind Jose Cuervo, is experiencing financial challenges as North American consumers reduce their tequila consumption. Bloomberg posted on X that the decline in demand has led to a significant impact on Becle's revenue. The company has been facing difficulties in maintaining its sales figures due to changing consumer preferences in the region. This shift in consumption patterns has prompted Becle to reassess its market strategies to adapt to the evolving landscape. Despite these challenges, the company remains committed to finding solutions to stabilize its financial performance.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051249&language=en-US",
            "pub_date": "2026-02-27 07:15:20",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051222,
            "title": "Grayscale: As AI impacts tech stocks, blockchain may become a long-term beneficiary.",
            "description": "As artificial intelligence (AI) triggers volatility in tech stocks and drags down the software sector, digital asset management firm Grayscale argues that blockchain and AI are not competitors but rather long-term complementary, with blockchain poised to become a crucial infrastructure for the AI ​​economy. Zach Pandl, Grayscale's head of research, points out that while recent crypto asset price movements are highly correlated with the decline in software stocks, this synchronized correction masks a more constructive long-term relationship between the two technologies. Year-to-date, the S&P 500 Software Index has fallen by approximately 20%, with software and services companies losing about $1 trillion in market capitalization, putting pressure on crypto market valuations. Pandl believes that future AI agents equipped with digital wallets will be more likely to transact through blockchain rather than the traditional banking system. Blockchain's 24/7 operation, global accessibility, rapid settlement, and transparent verifiability make it an ideal infrastructure for AI agents to automate payments and transactions. The growth in small-value, high-frequency stablecoin transactions could be a significant indicator of this trend. Furthermore, Grayscale believes blockchain may help mitigate some of the risks associated with AI, such as the difficulty in verifying data sources, the proliferation of deepfake content, and the concentration of technological control. Public blockchains can provide verifiable records and a more decentralized infrastructure, thus creating a certain balance. However, the report also points out that AI technology may also bring new challenges to encrypted networks, including more efficient on-chain monitoring that could weaken privacy protections, and AI tools that may discover new security vulnerabilities in smart contracts. Overall, Grayscale believes that the rapid development of AI will bring new application scenarios to blockchain, rather than replacing the crypto industry.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051222&language=en-US",
            "pub_date": "2026-02-27 06:53:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051220,
            "title": "Indeed Job Posting Trends Highlight Economic Shifts",
            "description": "Indeed job posting trends are reflecting significant shifts in the economy. Bespoke Investment Group posted on X, highlighting these changes and their implications for the job market. The analysis suggests that the current trends in job postings could be indicative of broader economic movements.\n\nThe data from Indeed shows variations in job postings across different sectors, which may signal changes in demand for certain skills and professions. This information is crucial for understanding how the labor market is evolving and what it might mean for future employment opportunities.\n\nAs the economy continues to adjust, these job posting trends provide valuable insights into which industries are expanding and which may be contracting. This can help job seekers and employers alike to better navigate the changing economic landscape.\n\nOverall, the trends in Indeed job postings offer a snapshot of the current state of the economy and highlight areas of potential growth and decline.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051220&language=en-US",
            "pub_date": "2026-02-27 06:50:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051219,
            "title": "Sam Bankman-Fried Backs U.S. CLARITY Act Amid Bipartisan Criticism",
            "description": "Sam Bankman-Fried (SBF), the imprisoned founder of FTX, has expressed support for the U.S. CLARITY Act, which seeks to provide clearer regulatory guidelines for the cryptocurrency industry. According to NS3.AI, the act aims to delineate the regulatory responsibilities between the Securities and Exchange Commission (SEC) and the Commodity Futures Trading Commission (CFTC). However, it faces significant legislative challenges. SBF's endorsement has drawn criticism from both sides of the political aisle, with some interpreting his comments as an attempt to influence political outcomes and possibly secure a pardon.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051219&language=en-US",
            "pub_date": "2026-02-27 06:52:28",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051218,
            "title": "Magic Eden to Close Bitcoin and EVM Marketplaces, Focuses on Solana",
            "description": "Magic Eden, a marketplace originally built on the Solana blockchain, is set to shut down its Bitcoin and EVM-based marketplaces next week. According to NS3.AI, the platform will also cease support for its multi-chain wallet shortly thereafter. This decision signifies a strategic shift to concentrate solely on the Solana ecosystem.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051218&language=en-US",
            "pub_date": "2026-02-27 06:56:42",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051217,
            "title": "Paramount Skydance Secures Warner Bros. Acquisition",
            "description": "Netflix has withdrawn from the competition to acquire Warner Bros., Bloomberg posted on X, paving the way for Paramount Skydance to finalize its $111 billion purchase. This move marks a significant development in the media industry, as Paramount Skydance emerges as the successful bidder for the entertainment giant. The acquisition is expected to have substantial implications for the competitive landscape among major media companies.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051217&language=en-US",
            "pub_date": "2026-02-27 06:57:23",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051215,
            "title": "Benchmark is optimistic about Strategy's shift to the STRC funding model and has given it a price target of $705.",
            "description": "Benchmark analysts recently reiterated their \"buy\" rating on Strategy (formerly MicroStrategy) and gave it a price target of $705, representing an upside of approximately 430% from the current share price of around $130. Analysts believe the company's strategic shift to STRC preferred stock financing is poised to become a core driver of Bitcoin reserve growth. At the Strategy World 2026 conference, Executive Chairman Michael Saylor stated that the company will shift its strategy from encouraging companies to include Bitcoin on their balance sheets to focusing on promoting STRC perpetual preferred stock as the primary financing tool for future Bitcoin purchases. Benchmark analysts point out that STRC will become Strategy's \"main engine\" for accumulating Bitcoin and is expected to accelerate the growth rate of the company's Bitcoin holdings per share. STRC's price briefly fell to around $90 earlier this month but has since recovered to near its par value of $100. This preferred stock product offers an annualized yield of approximately 11%, pays dividends monthly, and has priority over common stockholders in dividend payouts.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051215&language=en-US",
            "pub_date": "2026-02-27 06:43:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051214,
            "title": "MARA's expansion into AI data center business sent its stock price up 17% in after-hours trading.",
            "description": "Bitcoin mining company MARA Holdings announced a partnership with investment firm Starwood Capital Group to build large-scale data centers for AI and cloud computing customers on top of its existing mining farms in the United States. Following the announcement, the company's stock price rose approximately 17% in after-hours trading. Under the agreement, the two companies will convert some of their existing Bitcoin mining facilities into AI data centers, with Starwood Digital Ventures, a Starwood subsidiary, responsible for design, construction, and customer acquisition. The initial phase of the project is expected to provide approximately 1 gigawatt (GW) of computing power, with plans to expand to over 2.5 GW in the future, and the projects will be jointly funded and operated by both parties. This partnership marks a significant transformation for MARA's business. Due to the large-scale power access capabilities of mining farms, this type of infrastructure becomes increasingly valuable against the backdrop of rapidly growing demand for AI computing power. In recent years, under pressure from declining block rewards due to Bitcoin halvings, rising electricity costs, and intensified competition, many mining companies have begun to shift towards AI computing power infrastructure. However, MARA stated that Bitcoin will remain a core component of the company's long-term strategy. The company's management emphasized that despite short-term price uncertainties, their long-term confidence in the Bitcoin asset class remains unchanged. Financial reports show that the company's revenue in the fourth quarter was $202.3 million, a year-on-year decrease of about 6%, mainly due to a decrease of about 14% in the average mining price of Bitcoin.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051214&language=en-US",
            "pub_date": "2026-02-27 06:47:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051213,
            "title": "Circle's Stock Surges Amid Strong Quarterly Performance",
            "description": "Circle's stock price recently climbed above $90, reaching a new high since last year, before settling around $87. According to ChainCatcher, this surge followed the company's fourth-quarter results, which exceeded market expectations, leading to a cumulative increase of about 30% in the stock price post-earnings announcement. Bernstein analysts have maintained an 'outperform' rating for Circle, setting a target price of $190, citing the company's performance as distinctly different from the broader crypto market.\n\nThe report highlights Circle's expansion in infrastructure, which is generating new revenue streams with higher profit margins, beyond just stablecoin reserve income. Analysts noted that Circle's transaction-related income continues to grow, including blockchain rewards earned as a super validator on the Canton network. Additionally, the proportion of USDC directly hosted on Circle's platform has risen to 17% of the total supply, up from 14% in the previous quarter. The company anticipates that USDC circulation will maintain an annual growth rate of about 40% and projects that revenue from non-reserve sources will reach approximately $170 million by 2026, up from about $110 million in 2025.\n\nBernstein is also optimistic about Circle's expansion into new product areas, such as the Arc platform, Circle Payments Network, and 'automated payment' capabilities for AI agents. Meanwhile, Mizuho analysts pointed out that as stablecoins find new applications in prediction markets and other scenarios, such as the Polymarket platform, Circle's revenue structure is expected to diversify further. Overall, the market's focus is gradually shifting towards whether Circle can establish a more balanced revenue structure amid the expansion of the stablecoin ecosystem.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051213&language=en-US",
            "pub_date": "2026-02-27 06:43:34",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051212,
            "title": "Cryptocurrency Markets Could Benefit from U.S. Legislative Approval",
            "description": "Cryptocurrency markets might experience significant growth in the latter half of the year if U.S. lawmakers pass comprehensive market-structure legislation by midyear, according to JPMorgan. Bloomberg posted on X, highlighting that despite prevailing negative sentiment, the potential legislative approval could provide a boost to the crypto sector. The anticipated legislation aims to address various aspects of market structure, potentially offering a more stable and regulated environment for digital assets. This development comes amid ongoing discussions and debates among U.S. policymakers regarding the future of cryptocurrency regulation. The outcome of these legislative efforts could play a crucial role in shaping the trajectory of the crypto markets in the coming months.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051212&language=en-US",
            "pub_date": "2026-02-27 06:47:27",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051210,
            "title": "Circle's stock price hit $90 as analysts are optimistic about the diversified growth of its stablecoin business.",
            "description": "Shares of stablecoin issuer Circle rose to above $90, a new high since November last year, before falling back to around $87. This followed the company's fourth-quarter results, which exceeded market expectations, driving the stock price up by approximately 30% after the earnings release. Bernstein analysts maintained their \"outperform\" rating on Circle and gave it a $190 price target, believing that the company's performance shows a growth trend that is \"clearly different from the crypto market.\" The report points out that Circle's expansion in the infrastructure sector is generating new revenue streams with higher profit margins, rather than relying solely on stablecoin reserve returns. Analysts stated that Circle's transaction-related revenue continues to grow, including blockchain rewards earned as a supervalidator on the Canton network. Meanwhile, the proportion of USDC directly custodied on the Circle platform has risen to 17% of the total supply, up from 14% in the previous quarter. The company anticipates that USDC circulation will continue to grow at an annual rate of approximately 40%, and expects revenue from other businesses besides reserve income to reach approximately $170 million in 2026, up from approximately $110 million in 2025. Bernstein is also optimistic about Circle's expansion into new product areas, including the Arc platform, Circle Payments Network, and \"automated payment\" capabilities for AI agents. Meanwhile, Mizuho analysts point out that as stablecoins are increasingly used in new scenarios such as prediction markets and the Polymarket platform, Circle's revenue structure is expected to become more diversified. Overall, market attention is gradually shifting towards whether Circle can establish a more balanced revenue stream structure during the expansion of the stablecoin ecosystem.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051210&language=en-US",
            "pub_date": "2026-02-27 06:37:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051209,
            "title": "US lawmakers are re-examining the issue of stablecoin yields and are concerned about the risk of bank deposit outflows.",
            "description": "US lawmakers have recently reignited discussions about stablecoin yield mechanisms, with some concerned that the yields offered by stablecoins could lead to an outflow of bank deposits and blur the lines between crypto products and traditional bank deposits. At a Senate Banking Committee hearing, Senator Angela Alsobrooks stated that while she supports financial innovation, stablecoin yield mechanisms could create products similar to bank deposits, lacking corresponding regulatory and protective measures, potentially triggering future deposit outflows. The issue of stablecoin yields has been a core topic in crypto market legislative negotiations. The GENIUS Stablecoin Act, passed in 2025, prohibits stablecoin issuers from directly paying interest to holders, but does not prohibit third-party platforms like Coinbase from offering rewards to users for holding stablecoins. Bankers believe that allowing stablecoins to offer yields would weaken the deposit base of the traditional banking system. A previous study by the Independent Community Bankers Association estimated that if stablecoin yield mechanisms were fully implemented, bank deposits could decrease by approximately $1.3 trillion, leading to a decrease of approximately $850 billion in community bank lending. The crypto industry counters that restricting stablecoin yields would stifle innovation. Some industry insiders say there is currently no evidence to suggest a significant link between the adoption of stablecoins and the outflow of bank deposits. Senator Thom Tillis stated that he will request regulators to conduct an independent assessment of the potential deposit outflow risks posed by stablecoins. Meanwhile, the White House has recently organized several meetings between banks and crypto companies, hoping to reach a solution to the stablecoin yield issue by the end of this month.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051209&language=en-US",
            "pub_date": "2026-02-27 06:39:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}