{
    "data": [
        {
            "id": 1051743,
            "title": "India's Trade Minister Responds to U.S. Tariffs on Solar Exports",
            "description": "India's Trade Minister has addressed the recent imposition of a 126% tariff by the United States on Indian solar exports. According to Jin10, the minister clarified that anti-dumping duties or safeguard measures are typically not related to trade agreements. This statement comes amid ongoing discussions about trade relations between the two countries, highlighting the complexities involved in international trade policies.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051743&language=en-US",
            "pub_date": "2026-02-27 16:08:44",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051742,
            "title": "Cryptocurrency Market Awaits White House Deadline on CLARITY Act",
            "description": "Santiment has highlighted a shift in focus towards the White House's internal deadline of March 1, which is linked to negotiations on the significant CLARITY Act. According to Foresight News, this legislation is crucial for the cryptocurrency sector as it aims to establish clearer regulatory guidelines, thereby reducing uncertainty for investors, exchanges, and blockchain companies. Over the past month, there has been an increase in transactions exceeding $100,000 on Bitcoin, Ethereum, USDT, and XRP networks, often indicating a potential market reversal. Regardless of the market's direction, a significant rise in whale trading activity is anticipated in early March.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051742&language=en-US",
            "pub_date": "2026-02-27 16:09:49",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051741,
            "title": "Binance Futures to Launch ROBOUSDT Perpetual Contract with 20x Leverage",
            "description": "According to the announcement from Binance, the platform is set to expand its trading options on Binance Futures by introducing the ROBOUSDT Perpetual Contract, scheduled for launch on 2026-02-27 at 08:45 (UTC). This new contract will offer up to 20x leverage, providing traders with enhanced opportunities to engage with the Fabric Protocol (ROBO). The Fabric Foundation aims to create a secure, open, and globally beneficial future for AI and robotics, with the settlement asset for this contract being USDT.\n\nThe ROBOUSDT Perpetual Contract will feature a tick size of 0.00001 and a minimum trade amount of 1 ROBO, with a minimum notional value set at 5 USDT. The funding rate is capped at +2.00% / -2.00%, and the funding fee will be settled every four hours. Trading will be available 24/7, and the Multi-Assets Mode will be supported, allowing users to trade across multiple margin assets. For instance, users can utilize BTC as margin when trading this contract.\n\nBinance notes that the ROBOUSDT Perpetual Contract will be available for Futures Copy Trading within 24 hours of its launch. The platform may adjust the contract specifications based on market risk conditions, including funding fees, tick size, maximum leverage, and margin requirements. The Multi-Assets Mode enables trading across various margin assets, subject to applicable haircuts. It is important to note that futures and spot token listings are not correlated, and a token listed on Binance Futures does not guarantee a spot listing. The contract is subject to Binance's Terms of Use and Futures Service Agreement.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051741&language=en-US",
            "pub_date": "2026-02-27 16:11:52",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051740,
            "title": "White House Deadline for Clarity Act Sparks Interest Amid Market Activity",
            "description": "Santiment posted on X. Following Jane Street's recent market influence, focus has shifted to the White House's internal deadline on March 1 concerning the Clarity Act negotiations. This legislation is crucial for the cryptocurrency sector as it seeks to establish clearer regulatory guidelines, thereby reducing uncertainty for investors, exchanges, and blockchain companies.\n\nIn the past month, there have been significant transfers exceeding $100,000 on the Bitcoin, Ethereum, Tether, and XRP Ledger networks. Notably, spikes in large-scale transactions often indicate potential market reversals. A surge in such 'whale' activity is anticipated at the beginning of March, irrespective of the legislative outcomes.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051740&language=en-US",
            "pub_date": "2026-02-27 16:12:41",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051731,
            "title": "DualPath lifts throughput as RDMA eases KV-cache I/O",
            "description": "Data shows DualPath inference, KV cache bottleneck, RDMA ease cache I/O via a second storage-to-decode path and prefill, lifting throughput, TTFT and latency.\nsource: https://coincu.com/news/dualpath-lifts-throughput-as-rdma-eases-kv-cache-i-o/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051731&language=en-US",
            "pub_date": "2026-02-27 15:52:20",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051729,
            "title": "Oil Exports from Abu Dhabi Expected to Increase in April",
            "description": "Abu Dhabi is preparing to export more of its flagship Murban crude in April, signaling strong oil supplies from regional countries. Bloomberg posted on X, highlighting the anticipated rise in exports. This development comes amid ongoing assessments of global oil supply and demand dynamics. The increase in Murban crude exports reflects the region's capacity to meet international energy needs, contributing to the broader market stability. Observers are closely monitoring these trends as they may influence global oil prices and economic forecasts.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051729&language=en-US",
            "pub_date": "2026-02-27 15:58:34",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051728,
            "title": "STOCKS | Elliott Urges London Stock Exchange Group to Enhance Value Beyond Share Buyback",
            "description": "Elliott Investment Management has expressed that the London Stock Exchange Group (LSEG) has further potential to increase its value, despite having completed a £3 billion share buyback. Bloomberg posted on X, highlighting Elliott's belief that LSEG can implement additional strategies to bolster its market position and shareholder returns. The investment firm, known for its activist approach, suggests that LSEG explore new avenues for growth and efficiency. Elliott's comments come as the stock exchange group continues to navigate the evolving financial landscape, aiming to maximize its assets and operations. The call for enhanced value creation reflects broader investor expectations for strategic development in the financial sector.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051728&language=en-US",
            "pub_date": "2026-02-27 16:02:31",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051724,
            "title": "SpaceX Dragon Capsule Successfully Lands After 33rd Commercial Resupply Mission",
            "description": "SpaceX has confirmed the successful landing of its Dragon spacecraft, marking the completion of its 33rd commercial resupply mission to the International Space Station (ISS). According to Jin10, the mission involved transporting essential supplies to the ISS, further solidifying SpaceX's role in supporting space exploration and logistics. The Dragon capsule's return signifies another milestone in SpaceX's ongoing collaboration with NASA and its commitment to advancing space technology.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051724&language=en-US",
            "pub_date": "2026-02-27 15:47:21",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051723,
            "title": "France's January PPI Declines by 2.3%",
            "description": "France's Producer Price Index (PPI) for January showed a year-on-year decline of 2.3%. According to Jin10, the previous value was revised from -2.00% to -1.9%. This data reflects ongoing economic challenges in the region.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051723&language=en-US",
            "pub_date": "2026-02-27 15:47:33",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051722,
            "title": "Singapore Records Lowest Birth Rate in History",
            "description": "Singapore has reported its lowest birth rate on record, with approximately 27,500 resident newborns last year. According to Ming Pao, Minister in the Prime Minister's Office, Indranee Rajah, highlighted that many couples are under immense pressure to become 'perfect parents.' She emphasized that alleviating this anxiety requires a shift in mindset, fostering a more positive and proactive approach to marriage and parenting.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051722&language=en-US",
            "pub_date": "2026-02-27 15:49:06",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051721,
            "title": "STOCKS | Mixed Performance in Shanghai and Shenzhen Stock Markets",
            "description": "The Shanghai and Shenzhen stock markets closed with mixed results. According to RTHK, shares in non-ferrous metals, rare earth permanent magnets, computing power leasing, and gold-related sectors saw gains. In contrast, semiconductor equipment, fiberglass, and lithium battery stocks experienced declines.\n\nThe Shanghai Composite Index closed at 4,162 points, marking an increase of 16 points or 0.39%. Meanwhile, the Shenzhen Component Index ended at 14,495 points, down by 8 points or 0.06%. The ChiNext Index fell by 34 points, closing at 3,310 points, a decrease of 1.04%.\n\nOver the four-day trading week, the Shanghai Composite Index rose by approximately 2%, the Shenzhen Component Index increased by nearly 3%, and the ChiNext Index gained over 1%.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051721&language=en-US",
            "pub_date": "2026-02-27 15:51:47",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051709,
            "title": "Dubai Aerospace Enterprise Pursues Expansion Through Acquisitions",
            "description": "Dubai Aerospace Enterprise (DAE) is actively seeking acquisition opportunities to expand its fleet and replace older aircraft. Bloomberg posted on X, highlighting the company's strategic focus on growth in the aviation leasing sector. DAE's efforts are part of a broader strategy to enhance its market position and adapt to evolving industry demands. The company aims to capitalize on emerging opportunities in the aviation market, ensuring a modern and efficient fleet to meet customer needs.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051709&language=en-US",
            "pub_date": "2026-02-27 15:35:15",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051708,
            "title": "AI Concerns in India's Services Sector Overstated, Says Former RBI Governor",
            "description": "Former Reserve Bank of India Governor Raghuram Rajan has downplayed fears of artificial intelligence posing a significant threat to India's services sector. Bloomberg posted on X, highlighting Rajan's perspective that the concerns surrounding AI's impact are overstated. Rajan emphasized that while AI will bring changes, it is unlikely to lead to a doomsday scenario for the industry. He pointed out that the sector has historically adapted to technological advancements and will continue to do so. Rajan's comments come amid growing discussions about AI's potential to disrupt various industries globally. He reassured that India's services sector, known for its adaptability and resilience, will navigate the challenges posed by AI effectively.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051708&language=en-US",
            "pub_date": "2026-02-27 15:41:41",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051707,
            "title": "ITC Ruling Favors Ying Shi Innovation in Patent Dispute with GoPro",
            "description": "Ying Shi Innovation announced on February 27 that the U.S. International Trade Commission (ITC) has delivered its final ruling regarding a patent dispute with GoPro. According to Jin10, the ITC determined that three of GoPro's asserted invention patents (Nos. 10,015,413, 10,958,840, and 10,529,052) do not infringe on the accused products and that the patent claims are invalid or partially invalid. Additionally, one of GoPro's invention patents (No. 10,574,894) was found not to be infringed upon, and another patent (No. 11,336,832) was deemed invalid.\n\nThe company noted that only a portion of its products exported to the U.S. fell under the protection of one of GoPro's design patents (No. D789,435). However, Ying Shi Innovation's new design scheme has been recognized by the ITC as not infringing on this patent. The previous generation of products, which fell under GoPro's design patent protection, is no longer exported to the U.S., and current products have been replaced with the new design.\n\nThe 337 investigation involving the company has concluded, and the investigation did not have a substantial impact on the company's production or operations. Ying Shi Innovation will continue to import and sell its existing products in the U.S. without restrictions.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051707&language=en-US",
            "pub_date": "2026-02-27 15:42:06",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051706,
            "title": "IAG Reports Strong First Quarter Bookings",
            "description": "International Airlines Group (IAG), the parent company of British Airways, has announced robust booking figures for the first quarter. Bloomberg posted on X, highlighting the airline group's optimistic outlook for the upcoming months. This positive trend in bookings suggests a potential recovery in the travel sector, which has been significantly impacted by recent global events. IAG's report indicates a growing confidence among travelers, contributing to the airline industry's gradual rebound.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051706&language=en-US",
            "pub_date": "2026-02-27 15:42:33",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051694,
            "title": "Analysts: Net holdings of long-term Bitcoin holders continue to grow.",
            "description": "According to on-chain analyst Murphy, as of February 26th, LTH net holdings continued to show a net increase; specific details are as follows (from February 13th to February 26th): 1. A total of 14,127 LTH BTC were traded; 2. Simultaneously, 19,798 STH BTC were converted to long-term holdings. The positive and negative figures offset each other, indicating that both long-term and short-term holdings saw reduced turnover, with speculative funds exiting and long-term funds reluctant to sell. While this reduced liquidity, it also weakened selling pressure.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051694&language=en-US",
            "pub_date": "2026-02-27 15:34:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051692,
            "title": "Long-Term Bitcoin Holdings Show Net Growth Amid Market Uncertainty",
            "description": "Crypto KOL Murphy posted on X about recent data trends in Bitcoin holdings, highlighting that as of February 26, there has been a net increase in long-term holdings (LTH). Between February 13 and February 26, 14,127 BTC held by long-term holders were spent, while 19,798 BTC from short-term holders were converted to long-term holdings. This net positive change indicates a reduction in turnover for both long-term and short-term holdings, suggesting that speculative funds are exiting while long-term holders are reluctant to sell. Although this reduces liquidity, it also eases selling pressure.\n\nMurphy emphasized the importance of monitoring these trends, drawing from experiences on January 14. Given the current pessimistic and sensitive market sentiment, any increase in selling pressure could severely test the limited short-term demand. Even if the impact is not immediate, it could indirectly lead to an early end to any market rebound. Therefore, Murphy plans to keep a close watch on these developments daily, among other indicators.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051692&language=en-US",
            "pub_date": "2026-02-27 15:28:22",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051691,
            "title": "Ethereum ETF Positions Reduced by Institutions in Late 2025",
            "description": "On February 27, Bloomberg analyst James Seyffart shared insights on the X platform regarding institutional trading activities. According to BlockBeats, Seyffart noted that in the fourth quarter of 2025, many institutions filing 13F reports with the U.S. Securities and Exchange Commission sold off their Ethereum ETF positions. This trend was particularly evident among hedge funds, which reduced their holdings amid a significant drop in basis at the beginning of October that persisted at low levels.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051691&language=en-US",
            "pub_date": "2026-02-27 15:28:34",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051690,
            "title": "Australia's Crypto Industry Faces Growth Amid Banking and Regulatory Challenges",
            "description": "Australia's cryptocurrency sector is experiencing growth with an increase in users and the launch of new ETFs. According to NS3.AI, this expansion is accompanied by ongoing challenges, including banking restrictions and regulatory uncertainty. At the XRP Australia 2026 event, industry leaders emphasized the persistent de-banking issues affecting exchanges and expressed concerns about potential overregulation of wallet developers due to payment service reforms. The legislative progress on crypto regulations has decelerated following a change in government, adding to the industry's apprehensions.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051690&language=en-US",
            "pub_date": "2026-02-27 15:29:05",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051689,
            "title": "Thailand's Central Bank Takes Action to Mitigate Baht Volatility",
            "description": "Thailand's central bank has implemented measures to address the fluctuations in the baht, according to Jin10. The bank's actions aim to stabilize the currency amidst ongoing market volatility. These measures are part of a broader strategy to ensure economic stability and maintain investor confidence in the country's financial system. The central bank continues to monitor the situation closely to adapt its approach as necessary.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051689&language=en-US",
            "pub_date": "2026-02-27 15:31:24",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}