{
    "data": [
        {
            "id": 734188,
            "title": "Bitwise Chief Compliance Officer: SEC appears to be waiting for “high-level instructions” on how to handle litigation, including Ripple case",
            "description": "Odaily Planet Daily News Bitwise Chief Compliance Officer Katherine Dowling said that January marked the end of SAB 121, ushered in Trump's cryptocurrency executive order, and witnessed the formation of a new SEC working group. Coupled with the surge in cryptocurrency ETF applications, now is a good time to communicate with insiders. \nShe pointed out that now, the signal of increased cooperation between the SEC and CFTC is one of the biggest changes compared to the Gensler era. According to Bitwise's conversations with the SEC, the cryptocurrency working group seems to be \"very sincere.\" The current SEC Chairman nominee Paul Atkins has not yet been determined, and Mark Uyeda serves as acting chairman. That said, Dowling called the SEC \"in purgatory\" and the agency seemed to be waiting for \"high-level instructions\" on how to handle litigation, including the case against Ripple. \nDowling said: \"These don't go away overnight, and they shouldn't go away, but when you have new leadership, there are new eyes. In this particular case, are we focusing on the right things? Is there a settlement position that allows both parties to achieve the results they want?\" \nShe pointed out that some assets are still \"trapped like dolphins in a fishing net.\" She was referring to assets that are clearly classified as securities, including SOL and XRP. The SEC must make some \"concessions\" in this regard in order to move forward with these ETF proposals. She hinted that the DOGE ETF may have a clearer path because the SEC has not yet labeled DOGE a security. \nIn addition, in addition to the uncertainty of litigation/securities, there is also the question of whether the SEC will require the existence of \"a regulated market of considerable size\" (historically futures traded through CME). (Blockworks)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734188&language=en-US",
            "pub_date": "2025-02-05 16:17:22",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734187,
            "title": "22 U.S. states have introduced Bitcoin and digital asset bills",
            "description": "Odaily Planet Daily News Cointelegraph published an article on the X platform stating that to date, a total of 22 states in the United States have introduced Bitcoin and digital asset bills.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734187&language=en-US",
            "pub_date": "2025-02-05 16:19:42",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734186,
            "title": "Opinion: Whether the tariff crisis subsides quickly or not is always beneficial to risk assets such as Bitcoin",
            "description": "Odaily Planet Daily News Noelle Acheson, author of the \"Crypto Is Macro Now\" newsletter, said that if the tariff panic subsides soon, it will be a good thing for risky assets including Bitcoin. But if not, safe-haven assets such as Bitcoin can benefit from investors seeking to hedge against the depreciation of their own currencies and prepare for the development of the new economy. \nEven so, Bitcoin's success depends largely on the strength of the US dollar. She pointed out: \"A decline in the US dollar against other currencies will be beneficial to global liquidity and may reawaken risk appetite, benefiting Bitcoin and stocks.\"",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734186&language=en-US",
            "pub_date": "2025-02-05 16:22:17",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734197,
            "title": "Bitwise Compliance Officer Discusses SEC Developments Amid Cryptocurrency Changes",
            "description": "According to Odaily, Bitwise's Chief Compliance Officer, Katherine Dowling, highlighted significant developments in the cryptocurrency sector as January marked the end of SAB 121 and the introduction of U.S. President Donald Trump's cryptocurrency executive order. This period also saw the formation of a new SEC task force and a surge in cryptocurrency ETF applications, making it an opportune time for insider discussions.\n\nDowling noted that one of the most notable changes compared to the Gensler era is the increased cooperation between the SEC and CFTC. Conversations between Bitwise and the SEC suggest that the cryptocurrency task force is \"very sincere.\" Currently, Paul Atkins is the nominee for SEC Chair, while Mark Uyeda serves as the acting chair. Despite this, Dowling described the SEC as being in a \"purgatory state,\" seemingly awaiting \"top-level guidance\" on handling lawsuits, including the case against Ripple.\n\nDowling questioned whether the focus is on the right issues and if there is a settlement position that could satisfy both parties involved. She pointed out that some assets, such as SOL and XRP, are \"trapped like dolphins in a fishing net,\" being classified as securities. The SEC needs to make some \"concessions\" to advance these ETF proposals. She hinted that a DOGE ETF might have a clearer path since the SEC has not classified DOGE as a security.\n\nAdditionally, beyond the uncertainty of lawsuits and securities, there is the question of whether the SEC will require a \"reasonably sized regulated market,\" historically achieved through CME-traded futures.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734197&language=en-US",
            "pub_date": "2025-02-05 16:23:47",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734178,
            "title": "Billionaire Chamath Palihapitiya Proposes Using Government Bitcoin Holdings for Future US Sovereign Wealth Fund",
            "description": "Billionaire venture capitalist Chamath Palihapitiya says the US government can get its federal sovereign wealth fund up and running by leveraging its Bitcoin (BTC) holdings. On Monday, President Donald Trump signed an executive order for the Treasury and Commerce Departments to create a fund designed to provide long-term financial stability, economic growth and protection against […]\nThe post...\nsource: https://dailyhodl.com/2025/02/05/billionaire-chamath-palihapitiya-proposes-using-government-bitcoin-holdings-for-future-us-sovereign-wealth-fund/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734178&language=en-US",
            "pub_date": "2025-02-05 16:04:15",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734177,
            "title": "A user lost $709,000 in ENRON trading and made $10.1 million in TRUMP",
            "description": "Odaily Planet Daily News According to Lookonchain monitoring, a user spent $1.82 million to buy ENRON today, and then liquidated it at $1.11 million, losing $709,000 in 30 minutes. Previously, the user had made $10.1 million on TRUMP and $3.4 million on MELANIA.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734177&language=en-US",
            "pub_date": "2025-02-05 16:08:03",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734176,
            "title": "LayerZero makes its first strategic investment in Plume Network, betting on the RWA track",
            "description": "Odaily Planet Daily News According to official news, LayerZero announced the completion of the first round of strategic investment in Plume Network through the lzCatalyst plan. As the first full-stack L1 RWA chain and an ecosystem built specifically for real-world asset finance (RWAfi), Plume Network's Series A financing was jointly led by LayerZero, Lightspeed Faction and Animoca Ventures, aiming to accelerate its core mission of promoting real-world assets on the chain.\nAs the first full-stack L1 RWA chain, Plume Network provides a composable EVM-compatible environment and supports the tokenization and management of diverse real-world assets. Plume is using LayerZero technology to build full-chain interoperable applications. Its yield agreement SkyLink integrates LayerZero's lzRead to achieve seamless and secure distribution of RWA yields across multi-chain ecosystems. By creating a mirrored YieldToken, investors can access and manage institutional-level yields on any blockchain without permission.\nThis investment demonstrates LayerZero’s support for Plume Network’s innovative interoperability solutions and accelerates LayerZero’s real-world asset tokenization process.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734176&language=en-US",
            "pub_date": "2025-02-05 16:09:34",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734185,
            "title": "22 U.S. States Introduce Bitcoin And Digital Asset Legislation",
            "description": "According to PANews, a report by Cointelegraph reveals that 22 states in the United States have introduced legislation concerning Bitcoin and digital assets. This development marks a significant step in the regulation and adoption of cryptocurrencies across the country. The introduction of these bills reflects a growing interest and recognition of digital currencies within the legislative framework of various states.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734185&language=en-US",
            "pub_date": "2025-02-05 16:13:48",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734170,
            "title": "Helium Mobile launches free 5G mobile plans and opens waiting list",
            "description": "Odaily Planet Daily News Helium Mobile announced its first free mobile phone package for 5G network. The new \"Zero Plan\" provides users with 3GB of data, 300 text messages and 100 minutes of talk time every month, completely free, and the waiting list is now open.\nFor users who need more traffic, there are other packages to choose from. The Air Plan costs $15 per month and provides 10GB of data traffic and unlimited call time and text messages. The highest-end Infinity Plan costs $30 per month and provides unlimited data traffic, text messages and call time. (Decrypt)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734170&language=en-US",
            "pub_date": "2025-02-05 16:01:03",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734169,
            "title": "Megabit will launch ARC/USDT contract trading",
            "description": "Odaily Planet Daily News According to official news, Megabit will officially launch ARC/USDT contract trading at 18:00 (SGT) on February 5.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734169&language=en-US",
            "pub_date": "2025-02-05 16:03:02",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}