{
    "data": [
        {
            "id": 733961,
            "title": "AscendEX will list Bubi (BUBI) and WIENER (WIENER)",
            "description": "Odaily Planet Daily News AscendEX (formerly BitMax) will launch Bubi (BUBI) at 14:00 on February 5, open BUBI/USDT trading pair, and now open for recharge.\nIn addition, WIENER (WIENER) will be launched at 16:00 on February 5, open WIENER/USDT trading pair, and now open for recharge.\nThe Meme Research Institute team under the AscendEX platform selects high-quality Memes for online listing based on on-chain data and project background, and the platform's Memecoin initial launch rate is as high as 80%.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733961&language=en-US",
            "pub_date": "2025-02-05 10:18:51",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733960,
            "title": "Celestia founder: Supports proposal to reduce TIA inflation rate by 33%",
            "description": "Odaily Planet Daily News Celestia (TIA) community launched a new proposal to reduce TIA's inflation rate by 33%.\nIn response to the proposal, Celestia founder Mustafa Al-Bassam said: \"I support this proposal. When we first decided on the inflation rate, we referred to Solana's inflation plan to keep it relatively simple because we didn't want to follow the Cosmos standard inflation plan (i.e. a permanent 10% inflation rate). Recently, the community consensus is that this number is still too high, and now Solana is also proposing to reduce the inflation rate, so it's time for Celestia to adjust. I think a 33% reduction is the right balance, which can effectively adjust the inflation curve without overly endangering the security of the crypto economy.\"",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733960&language=en-US",
            "pub_date": "2025-02-05 10:20:03",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733966,
            "title": "Celestia Community Proposes 33% Inflation Rate Reduction",
            "description": "According to Odaily, the Celestia (TIA) community has introduced a new proposal to reduce the inflation rate of TIA by 33%. Mustafa Al-Bassam, the founder of Celestia, expressed his support for the proposal. He explained that the initial decision on the inflation rate was influenced by Solana's inflation plan to maintain simplicity, avoiding the Cosmos standard of a permanent 10% inflation rate. Al-Bassam noted that recent community consensus indicates the current rate is still too high. With Solana also considering a reduction in its inflation rate, he believes it is an appropriate time for Celestia to make adjustments. He stated that a 33% reduction strikes the right balance, effectively adjusting the inflation curve without significantly compromising crypto-economic security.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733966&language=en-US",
            "pub_date": "2025-02-05 10:23:34",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733965,
            "title": "Crypto Analyst Reports Portfolio Losses And Gains Amid Market Fluctuations",
            "description": "According to Odaily, crypto analyst Ali Martinez shared on the X platform that his portfolio experienced a 10.02% loss in BTC, ETH, and ADA during a market downturn. However, he managed to offset these losses by shorting DOGE, TON, and WIF before the market decline, achieving approximately 72.3% in gains.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733965&language=en-US",
            "pub_date": "2025-02-05 10:23:47",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733959,
            "title": "QuadrigaCX Filed For Creditor Protection In 2019",
            "description": "According to Foresight News, on this day in 2019, QuadrigaCX filed for creditor protection. At that time, the total value of user assets that could not be redeemed amounted to $215 million.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733959&language=en-US",
            "pub_date": "2025-02-05 10:04:02",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733958,
            "title": "Tether Develops AI Applications Focusing On Privacy And Self-Custody",
            "description": "According to Foresight News, Tether's CEO Paolo Ardoino has previewed a series of AI applications under development by Tether Data. These applications include AI translation, AI voice assistants, and an AI Bitcoin wallet assistant. Tether plans to launch an open-source AI SDK platform based on Holepunch's JavaScript runtime, Bare. This platform will be suitable for embedded devices, various mobile phones, laptops, and server clusters. Tether Data's AI applications will focus on local operation, emphasizing privacy protection and supporting self-custody of data and funds.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733958&language=en-US",
            "pub_date": "2025-02-05 10:04:09",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733956,
            "title": "The whale who increased his holdings of AAVE by more than 100,000 coins once made a profit of $5.94 million by betting on Trump's victory, and made a profit of $8.44 million on LINK",
            "description": "Odaily Planet Daily News According to Lookonchain monitoring, a smart whale who spent 10,090 stETH (US$27.5 million) to increase his holdings of 102,259 AAVE in the past 5 hours once made a profit of US$5.94 million by betting on Trump to win the election and US$8.44 million by trading LINK.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733956&language=en-US",
            "pub_date": "2025-02-05 10:05:04",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733955,
            "title": "Bank of America: Reiterates Nvidia's \"buy\" rating, stock price has a chance to hit new highs",
            "description": "Odaily Planet Daily News Bank of America said that Nvidia (NVDA.O) should be able to cope with adverse factors such as the global trade war, and its stock price has the opportunity to hit a record high. Bank of America analyst Vivek Arya said that although the DeepSeek large language model has caused the market to question whether it is necessary for the technology industry to invest heavily in artificial intelligence development, Nvidia still occupies a favorable position. He pointed out that Meta and Microsoft recently announced their results without withdrawing capital expenditure plans, indicating that Nvidia's sales will continue to grow strongly. Bank of America reiterated its \"buy\" rating on Nvidia and gave it a target price of $190. (Jinshi)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733955&language=en-US",
            "pub_date": "2025-02-05 10:07:01",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733949,
            "title": "Bullish, backed by Peter Thiel, plans to IPO this year and is in talks with Jefferies Group about a potential listing",
            "description": "Odaily Planet Daily News: People familiar with the matter revealed that Bullish Global, an operator of crypto asset exchanges, is considering an IPO as early as this year, and its backers include billionaire Peter Thiel. The company is working with Jefferies Financial Group Inc. on a potential listing.\nPeople familiar with the matter added that deliberations are still ongoing, IPO details may change, and more banks may join the lineup.\nBullish's website shows that the company is led by CEO Tom Farley, has more than 275 employees, and has offices in the United States, Hong Kong, Singapore, Gibraltar and the Cayman Islands. The company acquired the media CoinDesk from Digital Currency Group in 2023 for an undisclosed amount.\nAccording to an earlier statement, Bullish is a subsidiary of blockchain software company Block.one, and its backers include Thiel, Alan Howard, Louis Bacon and Richard Li. Block.one co-founder and CEO Brendan Blumer, who also serves as Bullish's chairman, founded the company in 2021 and funded it with about $10 billion in digital assets and cash. (Bloomberg)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733949&language=en-US",
            "pub_date": "2025-02-05 10:00:40",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733954,
            "title": "Private Stablecoin Transactions Set To Revolutionize The Market",
            "description": "According to Odaily, Placeholder partner Chris Burniske recently stated on X that private stablecoin transactions are poised to unlock a new level in the financial landscape. He described these transactions as 'private, low-cost, and legal,' emphasizing that these qualities are essential for effective private stablecoin trading.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733954&language=en-US",
            "pub_date": "2025-02-05 10:03:33",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}