{
    "data": [
        {
            "id": 1054467,
            "title": "TruStage pilots USD stablecoin TSDA for U.S. credit unions",
            "description": "TruStage has launched a pilot for its USD-backed stablecoin TSDA with U. S. credit unions and plans to run the program through the first half of 2026. The issuer says the token will be fully cash-reserved and free to join.\nsource: https://coinpaprika.com/news/trustage-pilots-usd-stablecoin-tsda-us-credit-unions",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054467&language=en-US",
            "pub_date": "2026-03-01 19:11:13",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054466,
            "title": "BTC Worth Billions to be Dumped? Bitcoin Braces for Mega Supply Shock After U.S. Strikes on Iran",
            "description": "The Iran war could be one of the biggest Bitcoin (BTC) supply events in recent memory, one analyst argues.\nsource: https://zycrypto.com/btc-worth-billions-to-be-dumped-bitcoin-braces-for-mega-supply-shock-after-u-s-strikes-on-iran/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054466&language=en-US",
            "pub_date": "2026-03-01 19:18:53",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054465,
            "title": "Avantis confirms second-quarter airdrops will take place on March 5th.",
            "description": "Avantis, a leading decentralized derivatives exchange in the Base ecosystem, officially announced that the second quarter airdrop will take place on March 5th. A total of 40 million tokens will be distributed to trading users and LPs this quarter. The full airdrop eligibility criteria and claiming mechanism will be announced in the next few days.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054465&language=en-US",
            "pub_date": "2026-03-01 19:22:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054464,
            "title": "GEOPOLITICS | Increased Threats to Jewish Community in Germany Following U.S. and Israeli Actions Against Iran",
            "description": "Germany's Commissioner for Anti-Semitism, Felix Klein, has expressed concerns over the heightened risks to the Jewish community in Germany. According to Jin10, Klein's warning comes in the wake of recent military actions by the United States and Israel against Iran. He emphasized that these developments could lead to increased threats to the safety of Jewish individuals within Germany. Klein's statement underscores the potential geopolitical repercussions of international conflicts on domestic security, particularly for minority communities.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054464&language=en-US",
            "pub_date": "2026-03-01 19:24:09",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054460,
            "title": "GEOPOLITICS | EU Commission President Emphasizes Iranian People's Role in Future",
            "description": "The European Union Commission President, Ursula von der Leyen, has stressed the importance of ensuring that the future of Iran is shaped and controlled by its own people. According to Jin10, von der Leyen highlighted the potential instability in the region, warning that the current situation could lead to a spiral of violence. Her remarks underscore the EU's stance on supporting the autonomy and self-determination of the Iranian populace amid ongoing geopolitical tensions.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054460&language=en-US",
            "pub_date": "2026-03-01 19:08:42",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054462,
            "title": "Asia Crypto News: Iran $7.78B, Russia Seizes, KRW Stablecoins",
            "description": "Iran’s crypto market hits $7. 78B, Russia allows crypto confiscation, and South Korea urges banks to lead KRW stablecoin issuance.\nsource: https://coincu.com/crypto/asia-crypto-news-iran-7-78b-russia/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054462&language=en-US",
            "pub_date": "2026-03-01 19:10:08",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054459,
            "title": "UK Maritime Trade Operations Confirms Crew Safety After Incident",
            "description": "The UK Maritime Trade Operations (UKMTO) has confirmed that the crew of the affected vessel has been evacuated and is safe. According to Jin10, the incident involved a ship in a maritime area under UKMTO's monitoring. Details about the nature of the incident or the vessel involved have not been disclosed. The UKMTO continues to monitor the situation closely to ensure maritime safety in the region. Further updates will be provided as more information becomes available.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054459&language=en-US",
            "pub_date": "2026-03-01 19:10:36",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054458,
            "title": "Incident Reported Near Oman Coast",
            "description": "An incident has been reported two nautical miles north of Kumzar, Oman, according to the UK Maritime Trade Operations. Details about the nature of the event remain unclear at this time.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054458&language=en-US",
            "pub_date": "2026-03-01 19:10:40",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054432,
            "title": "Sui Group Holdings Reports 2025 Financial Performance",
            "description": "Sui Group Holdings, a Nasdaq-listed company, has released its full-year operational performance report for 2025. According to Odaily, the report reveals a net loss of $221.8 million in the fourth quarter of the previous year. As of February 23, the company's holdings of SUI tokens increased to 108,368,594, with nearly all of these tokens staked, generating an average daily yield of approximately 5,000 SUI. Additionally, the company disclosed the completion of a repurchase of 7,801,042 common shares under a previously approved $50 million stock buyback plan, representing 8.80% of the issued common shares.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054432&language=en-US",
            "pub_date": "2026-03-01 19:02:17",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054431,
            "title": "Hong Kong's Financial Secretary Highlights AI and Blockchain in Financial Innovation",
            "description": "Hong Kong's Financial Secretary, Paul Chan, has emphasized the pivotal role of artificial intelligence and blockchain in driving financial innovation. According to ChainCatcher, Chan noted that the current era is a critical juncture for technological advancement, with AI emerging as a core technology capable of influencing numerous industries. He highlighted that innovation within financial services is further enhancing the real economy by expanding capacity and overcoming challenges. Technologies such as AI and blockchain are continuously empowering financial services, creating more efficient and convenient transaction systems, and opening new avenues for trade, financing, and risk management activities for various enterprises.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054431&language=en-US",
            "pub_date": "2026-03-01 19:03:39",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054430,
            "title": "Hong Kong's Financial Secretary Highlights AI and Financial Innovation",
            "description": "Hong Kong's Financial Secretary, Paul Chan, has emphasized the pivotal role of technological innovation in his latest essay, 'AI+' and 'Finance+' Mutual Promotion. According to PANews, Chan highlighted that artificial intelligence is not only a core technology of the future but also a powerful force capable of transforming various industries. He noted that innovation within financial services is further enhancing the real economy by expanding and overcoming challenges. Technologies such as AI and blockchain are continuously empowering financial services, creating more efficient and convenient trading systems, and opening new channels for trade, financing, and risk management activities for different enterprises.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054430&language=en-US",
            "pub_date": "2026-03-01 19:03:43",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054429,
            "title": "Bitcoin Price Predictions for 2026 Show Mixed Outlook",
            "description": "On March 1, predictions on Polymarket indicated a 62% probability that Bitcoin would fall to $50,000 this year. According to BlockBeats, the likelihood of Bitcoin rising to $80,000 within the year is currently at 72%, while the chance of it reaching $90,000 stands at 47%.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054429&language=en-US",
            "pub_date": "2026-03-01 19:04:52",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054427,
            "title": "BREAKING: MASSIVE EXPLOSION ROCKS CENTRAL TEHRAN\n\nA huge blast shook Iran’s capital Sunday, sending smoke over the skyline, according to NPR. \n\nIsraeli military said it was striking central Tehran.\n\nThe explosion appeared to hit a district housing police HQ and state TV.\n\nThe",
            "description": "null\nsource: https://x.com/BSCNews/status/2028057716179325253",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054427&language=en-US",
            "pub_date": "2026-03-01 18:40:13",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054426,
            "title": "BREAKING: IRAN MISSILES FIRED TOWARD UK BASES IN CYPRUS\n\nUK Defence Secretary John Healey confirmed two Iranian missiles were launched in the direction of Cyprus, according to The @Independent.\n\nBritain maintains sovereign military bases on the island.\nHealey said the missiles",
            "description": "null\nsource: https://x.com/BSCNews/status/2028059320848650468",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054426&language=en-US",
            "pub_date": "2026-03-01 18:46:36",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054425,
            "title": "GEOPOLITICS | UK Foreign Office Issues Travel Advisory for Middle Eastern Countries",
            "description": "The UK Foreign Office has issued a travel advisory against all non-essential travel to Bahrain, Kuwait, Qatar, and the United Arab Emirates. According to Jin10, this advisory comes amid rising geopolitical tensions in the region. The Foreign Office urges travelers to remain vigilant and consider the necessity of their trips to these countries. This move reflects growing concerns over regional stability and potential risks to travelers. The advisory is part of broader efforts by the UK government to ensure the safety of its citizens abroad.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054425&language=en-US",
            "pub_date": "2026-03-01 18:49:52",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054423,
            "title": "GEOPOLITICS | EU Seeks De-escalation Measures Amid Iranian Military Actions",
            "description": "The European Union's High Representative for Foreign Affairs and Security Policy, Kallas, is actively engaging with partners to address the impact of Iranian military actions on regional countries. According to Jin10, Kallas is focused on identifying practical measures to de-escalate tensions in affected areas. The EU's diplomatic efforts aim to stabilize the situation and prevent further escalation. Kallas's outreach underscores the EU's commitment to maintaining regional security and fostering cooperation among affected nations.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054423&language=en-US",
            "pub_date": "2026-03-01 18:42:45",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054416,
            "title": "PeckShield: Crypto hacker losses fell to $26.5 million in February, a sharp drop of 98.2% year-over-year.",
            "description": "A report released by PeckShield on its X platform shows that in February 2026, the crypto industry experienced 15 hacking incidents, resulting in a total loss of $26.5 million. This represents a 98.2% year-over-year decrease compared to February 2025 (which saw a loss of $1.5 billion, including $1.4 billion from Bybit), and a 69.2% month-over-month decrease compared to January 2026 (which saw a loss of $86.01 million).",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054416&language=en-US",
            "pub_date": "2026-03-01 18:29:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054418,
            "title": "Virginia Data Centers' Power Grid Disruption Raises Concerns",
            "description": "Early last year, a group of data centers in Virginia unexpectedly disconnected from the power grid, raising concerns about the stability of the already fragile system. Wall Street Journal (Markets) posted on X, highlighting the potential risks associated with such disruptions. The incident underscores the critical role data centers play in maintaining grid stability and the need for robust infrastructure to support them. As data centers continue to expand, ensuring their reliable integration into the power grid becomes increasingly important to prevent future disruptions.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054418&language=en-US",
            "pub_date": "2026-03-01 18:33:02",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054417,
            "title": "GEOPOLITICS | Tehran Airstrike Not Targeting Iranian Broadcasting Complex",
            "description": "An Iranian media outlet reported that the airstrike on Tehran on Sunday did not target the Iranian Broadcasting Complex. According to Jin10, the information was sourced from the public relations department of the Islamic Republic of Iran Broadcasting. The clarification comes amid heightened tensions in the region, with various entities closely monitoring the situation.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054417&language=en-US",
            "pub_date": "2026-03-01 18:33:06",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054415,
            "title": "Paul Chan: Blockchain, AI and other technologies empower financial services and create a more efficient transaction system.",
            "description": "Hong Kong Financial Secretary Paul Chan published a personal essay titled \"AI+ and Finance+ Promote Each Other,\" in which he pointed out that we are currently at a critical juncture in technological innovation. Artificial intelligence is not only a core technology of the future, but also a huge force that can influence thousands of industries. Innovation in financial services itself is further helping to expand the real economy and overcome pain points. Technological innovations such as AI and blockchain are constantly empowering financial services, creating a more efficient and convenient transaction system, and opening up new channels for various enterprises' trade, financing, and risk management activities.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054415&language=en-US",
            "pub_date": "2026-03-01 18:34:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}