{
    "data": [
        {
            "id": 1054247,
            "title": "Trump: If Iran launches an attack, the United States will retaliate with unprecedented force.",
            "description": "US President Trump stated that Iran had just announced a \"fierce and unprecedented attack\" that day, and warned Iran \"had better not do it.\" Trump said that if Iran takes such action, the US will strike with unprecedented force. (Jinshi)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054247&language=en-US",
            "pub_date": "2026-03-01 13:24:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054245,
            "title": "GEOPOLITICS | Iranian Speaker Warns Trump and Netanyahu of Crossing Red Lines",
            "description": "Iranian Parliament Speaker Mohammad Bagher Ghalibaf has issued a stern warning to U.S. President Donald Trump and Israeli Prime Minister Benjamin Netanyahu, stating that they have crossed red lines and will face consequences. According to Jin10, Ghalibaf's remarks were broadcast on Iranian state television, emphasizing the seriousness of the situation. The speaker's comments reflect heightened tensions between Iran and the United States, as well as Israel, amid ongoing geopolitical conflicts. The statement underscores Iran's position on defending its national interests and responding to perceived threats from foreign leaders.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054245&language=en-US",
            "pub_date": "2026-03-01 13:28:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054246,
            "title": "Planet Midday News",
            "description": "1. Bitcoin's February 2026 return was -14.94%, marking the third lowest monthly return since 2013; 2. Kalshi CEO: Opposes profiting from individual deaths and will refund fees related to the \"Khamenei's resignation\" market; 3. Musk: X platform adds timeline theme selection function; 4. Trump: Resolving the Iran issue through diplomatic means is still feasible and \"much easier now\"; 5. Iranian Revolutionary Guard claims missile hit Israeli General Staff headquarters; 6. US media: Pressure from Saudi Arabia and Israel prompted Trump to order attacks on Iran; 7. US and Israel launched attacks during the Khamenei meeting, Iranian Revolutionary Guard says it will retaliate; 8. BTCS executive: Crypto Treasury companies may see a consolidation wave in 2026; 9. Michael Saylor: STRC's deferred dividend yield increased to 11.50% in March 2026; 10. Sam Altman responds to US War Department's choice of OpenAI over Anthropic: Possibly due to disagreements over operational control; 11. Iranian media: Iran's Supreme Leader Khamenei has been assassinated.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054246&language=en-US",
            "pub_date": "2026-03-01 13:30:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054243,
            "title": "US media releases satellite images before and after the attack on Khamenei's residence.",
            "description": "According to CBS News, a set of satellite images shows before-and-after photos of the attacks on the Tehran residence of Iran's late Supreme Leader Ayatollah Khamenei by the United States and Israel on February 28. The situation continues to escalate. Iran's Islamic Revolutionary Guard Corps claims to have launched a large-scale missile and drone attack on Israel and US military bases in the region. Initial reports indicate that Jerusalem was affected, with explosions and smoke heard in Haifa, Israel. Furthermore, Doha, the capital of Qatar, was again attacked by missiles, prompting Qatar's air defense system to activate interceptions. The US Al Udeid Air Base in Qatar, located approximately 35 kilometers southwest of Doha, is one of the key US military bases in the Gulf region.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054243&language=en-US",
            "pub_date": "2026-03-01 13:16:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054242,
            "title": "GEOPOLITICS | Israeli Defense Minister Katz: 'Justice Served' as Iran's 'Axis of Evil' Faces Major Blow",
            "description": "Israeli Defense Minister Katz announced that justice has been served with a significant blow dealt to Iran's 'Axis of Evil.' According to Jin10, Katz emphasized the impact of recent actions against Iran, highlighting the strategic importance of these developments in the ongoing geopolitical landscape. The statement reflects Israel's stance on regional security and its commitment to countering perceived threats from Iran. Katz's remarks underscore the broader implications for Middle Eastern stability and international relations.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054242&language=en-US",
            "pub_date": "2026-03-01 13:18:10",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054241,
            "title": "GEOPOLITICS | Iraqi Security Forces Attempt to Prevent Protesters from Approaching U.S. Embassy",
            "description": "Iraqi security forces are actively working to prevent demonstrators from nearing the U.S. Embassy, according to Jin10. The situation arises amidst ongoing tensions and protests in the region, highlighting the challenges faced by authorities in maintaining order and security. The embassy has been a focal point for demonstrations, reflecting broader geopolitical issues and public sentiment. Security measures have been intensified to ensure the safety of diplomatic personnel and facilities. The developments underscore the volatile nature of the geopolitical landscape in Iraq.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054241&language=en-US",
            "pub_date": "2026-03-01 13:18:38",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054233,
            "title": "Bitcoin recovers to $68K following death of Iranian Supreme Leader",
            "description": "Donald Trump described Ayatollah Khamenei as “one of the most evil people in history,” on Truth Social.\nsource: https://cointelegraph.com/news/bitcoin-recovers-to-68k-following-reported-death-of-iranian-supreme-leader?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054233&language=en-US",
            "pub_date": "2026-03-01 12:58:31",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054231,
            "title": "Five Crypto Exchanges Aid Russia in Evading Sanctions",
            "description": "Five Russia-linked crypto exchanges continue high-volume transactions with sanctioned entities, highlighting gaps in enforcement after Garantex’s 2025 shutdown.\nsource: https://catenaa.com/markets/cryptocurrencies/five-crypto-exchanges-aid-russia-in-evading-sanctions/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054231&language=en-US",
            "pub_date": "2026-03-01 13:00:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054227,
            "title": "Elon Musk Introduces Customizable Timeline Themes",
            "description": "Elon Musk announced on March 1 that users can now select topics of interest for their timelines. According to BlockBeats, this feature allows users to switch to different themes if they are tired of 'politically charged content.' Users can make these selections by clicking on the 'For You' page.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054227&language=en-US",
            "pub_date": "2026-03-01 13:03:38",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054226,
            "title": "Musk: X Platform Adds Timeline Theme Selection Feature",
            "description": "Musk stated on social media that the X platform has added a timeline theme selection feature, allowing users to switch between different content themes based on their interests. He noted that users who are tired of political content can choose other themes. Users can adjust these settings by clicking on the \"For You\" page.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054226&language=en-US",
            "pub_date": "2026-03-01 12:59:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054225,
            "title": "Explosion in Maharashtra, India Results in Multiple Fatalities",
            "description": "An explosion occurred in Maharashtra, India, on March 1, resulting in at least 15 fatalities. According to Jin10, local police reported that the blast took place at an energy company site, with over a dozen individuals sustaining injuries. Further details have not yet been disclosed.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054225&language=en-US",
            "pub_date": "2026-03-01 12:45:32",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054219,
            "title": "Hong Kong Prepares for Financial Uncertainty Amid Global Tensions",
            "description": "Hong Kong's Financial Secretary, Paul Chan, has stated that while direct trade and investment between Hong Kong and Iran are limited, the ongoing conflict has introduced significant global uncertainty. According to RTHK, Chan mentioned in a television program that financial markets are expected to experience considerable volatility, with rapid shifts in capital flows. He noted that local funds might seek safe havens in Hong Kong, prompting the Special Administrative Region government to prepare and carefully manage financial risks, with contingency plans already in place.\n\nThe conflict may also temporarily impact gold prices, oil prices, and international trade transportation costs, with authorities continuously assessing these risks. Additionally, the budget proposal includes a plan to allocate a total of HKD 150 billion from the Exchange Fund over two years to support the Northern Metropolis and other infrastructure projects. Chan highlighted that the Northern Metropolis covers a large area, accounting for one-third of Hong Kong's land, and includes residential units and commercial land, requiring substantial infrastructure investment. The Exchange Fund generates annual profits, allowing for a shift from financial investment to future-oriented investments.\n\nChan anticipates that returns from the Northern Metropolis will become evident in approximately four to five years, emphasizing that financial returns should not be the sole focus. The Northern Metropolis is expected to foster future economic growth and serve as a vital residential area for citizens. He stressed that resources should not be concentrated solely on the Northern Metropolis, but also allocated to finance and trade sectors.\n\nRegarding support measures, commonly referred to as \"sweeteners,\" Chan stated that three factors must be considered: necessity, the prevailing economic and social conditions, and public finances.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054219&language=en-US",
            "pub_date": "2026-03-01 12:33:50",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054218,
            "title": "Ethereum Spot ETFs Recorded Weekly Net Inflows of $80.46 Million, with Grayscale's ETHE Leading with $40.4688 Million in Net Inflows",
            "description": "According to data from SoSoValue, Ethereum spot ETFs recorded net inflows of $80.46 million during this week's trading sessions (from February 23 to February 27, Eastern Time).The Ethereum spot ETF with the highest net inflows this week was the Grayscale Ethereum Trust (ETHE), with weekly net inflows of $40.4688 million, according to Odaily. To date, ETHE has recorded cumulative historical net outflows of $5.15 billion. Following closely was the Fidelity ETF (FETH), with weekly net inflows of $39.4843 million. FETH's cumulative historical net inflows now stand at $2.5 billion.The Ethereum spot ETF with the highest net outflows this week was the BlackRock ETF (ETHA), with weekly net outflows of $41.7752 million. ETHA's cumulative historical net inflows currently amount to $11.83 billion.As of the time of writing, the total net asset value of Ethereum spot ETFs is $10.96 billion. The ETF net asset ratio (the proportion of ETF market capitalization relative to Ethereum's total market cap) has reached 4.72%, with cumulative historical net inflows totaling $11.6 billion.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054218&language=en-US",
            "pub_date": "2026-03-01 12:35:29",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054217,
            "title": "Bitcoin Spot ETFs Record Weekly Net Inflows of $787 Million, BlackRock's IBIT Leads with $503 Million Inflows",
            "description": "According to SoSoValue data, Bitcoin spot ETFs recorded net inflows of $787 million during this week's trading sessions (February 23 to February 27, Eastern Time).BlackRock's ETF IBIT saw the highest net inflows among Bitcoin spot ETFs this week, with weekly net inflows reaching $503 million, according to Odaily. IBIT's cumulative historical net inflows now stand at $61.81 billion. Grayscale's Bitcoin Trust GBTC followed with weekly net inflows of $89.4264 million. GBTC's cumulative historical net outflows currently total $25.87 billion.As of the time of writing, the total net asset value of Bitcoin spot ETFs is $83.4 billion, with an ETF net asset ratio (market cap as a percentage of Bitcoin's total market cap) reaching 6.36%. The cumulative historical net inflows have reached $54.8 billion.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054217&language=en-US",
            "pub_date": "2026-03-01 12:36:22",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054216,
            "title": "The Iranian Revolutionary Guard claimed that a missile struck the Israeli General Staff headquarters.",
            "description": "Iran's Islamic Revolutionary Guard Corps stated that its missile struck the Israeli General Staff headquarters. (Xinhua)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054216&language=en-US",
            "pub_date": "2026-03-01 12:38:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054210,
            "title": "BREAKING: STRIKE ON GIRLS’ SCHOOL IN IRAN, US INVESTIGATING \n\nIran’s UN ambassador claims 100+ children were killed in a strike on the Shajare Tayyiba girls’ elementary school in Minab. \n\nIranian state media now reports 118 dead. \n\nU.S. CENTCOM says it is “looking into” the",
            "description": "null\nsource: https://x.com/BSCNews/status/2027962306752102791",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054210&language=en-US",
            "pub_date": "2026-03-01 12:21:06",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054208,
            "title": "XRP Spot ETFs See Significant Inflows This Week",
            "description": "XRP spot ETFs experienced a notable net inflow of $9.55 million during the trading week from February 23 to February 27, according to SoSoValue data. According to PANews, the Bitwise ETF XRP led the inflows with $5.8079 million, bringing its total historical net inflow to $370 million. The Franklin ETF XRPZ followed with a weekly net inflow of $3.001 million, reaching a historical total of $333 million.As of the latest update, the total net asset value of XRP spot ETFs stands at $983 million, with an ETF net asset ratio of 1.19% compared to XRP's total market capitalization. The cumulative historical net inflow has reached $1.24 billion.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054208&language=en-US",
            "pub_date": "2026-03-01 12:21:55",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054207,
            "title": "Cryptocurrency Market Rebounds Amid Geopolitical Tensions",
            "description": "On March 1, the cryptocurrency market experienced a significant rebound during early Asian trading hours following reports of Iranian Supreme Leader Khamenei's death in a U.S.-Israeli military operation. According to BlockBeats, Bitcoin surged by 2.21% to reach $68,196 before settling around $67,300, after a previous day's decline of 3.8%. Ethereum also saw a rise of 4.58%, surpassing the $2,000 mark.Data indicates that after losing approximately $128 billion in market value the previous day, the crypto market recovered about $32 billion by Sunday morning. Analysts suggest that due to the 24/7 trading nature of cryptocurrencies, Bitcoin acted as a 'liquidity pressure valve' during the weekend's geopolitical conflict escalation, absorbing selling pressure that might have otherwise spread to stock, bond, and commodity markets.Despite the rebound, uncertainty remains as Iran has retaliated against multiple locations, including Israel, Qatar, UAE, and Bahrain, and has threatened further strikes on U.S.-related bases. Some traders believe that true price discovery may occur once U.S. stock markets and Bitcoin ETFs resume trading on Monday.The derivatives market also experienced significant volatility. Analysis shows that Bitcoin derivatives saw a surge in sell-off volume of approximately $1.8 billion in a single hour last Saturday, indicating a rise in short-term risk aversion. Meanwhile, tokenized commodity contracts linked to oil, gold, and silver on decentralized trading platform Hyperliquid also saw price increases.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054207&language=en-US",
            "pub_date": "2026-03-01 12:22:13",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054209,
            "title": "The Israeli military claims to have completed a new round of airstrikes against Iran, targeting approximately 30 targets.",
            "description": "The Israel Defense Forces (IDF) have completed a new round of airstrikes against Iranian ballistic missile launchers and air defense systems. The IDF stated that on the night of the 28th, dozens of fighter jets struck approximately 30 targets, including air defense systems, missile launchers, and other military installations. (Jinshi)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054209&language=en-US",
            "pub_date": "2026-03-01 12:26:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054201,
            "title": "Iran launched a new round of missiles at Israel; the Israeli military claims its defense system has been activated.",
            "description": "Iran launched a new wave of missiles at Israel. The Israel Defense Forces subsequently confirmed that they had detected missiles launched from Iran and heading towards Israeli territory, and that their defense systems were intercepting the threat. Israel stated that its frontline command had issued preventative instructions to residents in the affected areas, requiring them to move into protected areas and stand by upon receiving an alert. Earlier reports indicated that Iran had attacked a US military base in northern Iraq, with witnesses reporting thick smoke rising from the base. The situation continues to develop. (Tehran Times)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054201&language=en-US",
            "pub_date": "2026-03-01 12:18:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}