{
    "data": [
        {
            "id": 1053312,
            "title": "Credit One Settles for Over $10 Million in Debt Collection Harassment Case",
            "description": "Credit One, a U.S. bank managing nearly $2 billion in assets, has agreed to a settlement exceeding $10 million to resolve allegations of customer harassment through excessive debt collection calls. According to NS3.AI, the settlement follows a civil lawsuit filed by multiple district attorneys in California, accusing the bank of permitting its agents to contact customers up to 10 times a day, thereby breaching state consumer protection laws. The agreement includes $9 million in penalties and $1.2 million allocated for investigative costs. Despite the settlement, Credit One denies any wrongdoing.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053312&language=en-US",
            "pub_date": "2026-02-28 16:19:44",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053313,
            "title": "ZachXBT Axiom Exposé Sparked 411% Polymarket Returns as an Insider Bet at 13.8% Odds",
            "description": "Key Insights: On February 26, ZachXBT published findings exposing a sophisticated insider-trading operation by Axiom employees. The blockchain investigator detailed how employees allegedly exploited internal tools to track private wallet activity and profit from privileged information. ZachXBT was retained to investigate allegations of misconduct at Axiom following reports that employees had accessed sensitive user data. […] The post ZachXBT Axiom Exposé Sparked 411% Polymarket Returns as an Insider Bet at 13\nsource: https://www.thecoinrepublic.com/2026/02/28/zachxbt-axiom-expose-sparked-411-polymarket-returns-as-an-insider-bet-at-13-8-odds/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053313&language=en-US",
            "pub_date": "2026-02-28 16:20:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053311,
            "title": "GEOPOLITICS | Reports Emerge on Death of Iranian Army Chief Amir Hatami",
            "description": "Reports have surfaced regarding the death of Iranian Army Chief Amir Hatami. According to Jin10, the news has sparked significant attention and concern within geopolitical circles. The implications of this development are yet to be fully understood, but it is expected to have an impact on regional stability and military dynamics. Further details are awaited as the situation unfolds.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053311&language=en-US",
            "pub_date": "2026-02-28 16:23:45",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053300,
            "title": "SBI to launch Japan’s first trust bank yen stablecoin in Q2 2026",
            "description": "SBI Holdings plans to launch the JPYSC yen stablecoin as Japan’s first trust bank-issued token in Q2 2026. The coin will be issued by SBI Shinsei Trust Bank under domestic rules.\nsource: https://coinpaprika.com/news/sbi-launch-japans-first-trust-bank-yen-stablecoin-q2-2026",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053300&language=en-US",
            "pub_date": "2026-02-28 16:10:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053297,
            "title": "BitMart's \"BM Discover\" section launches Freedom of Money",
            "description": "BitMart's \"BM Discover\" section launched Freedom of Money (FOM) on February 28th at 16:00 (UTC+8), and the FOM/USDT trading pair was opened at this launch.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053297&language=en-US",
            "pub_date": "2026-02-28 16:12:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053299,
            "title": "GEOPOLITICS | Iranian Port City Bushehr Attacked Amid Uncertainty Over Nuclear Plant Damage",
            "description": "Iran's state media has reported an attack on the port city of Bushehr. According to Jin10, it remains unclear whether the Bushehr nuclear power plant has sustained any damage. The situation is developing, and further details are awaited to assess the impact of the attack on the region's infrastructure and security.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053299&language=en-US",
            "pub_date": "2026-02-28 16:12:10",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053296,
            "title": "Iran has launched its first batch of ballistic missiles at Israel, reportedly a total of 30 missiles.",
            "description": "Market news: Iran has launched its first batch of ballistic missiles at Israel, reportedly a total of 30 missiles. Israeli mobile phone users received alerts that missile launches had been detected. The Israeli military stated that its defense systems are operational to intercept the threat. (Jinshi)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053296&language=en-US",
            "pub_date": "2026-02-28 16:14:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053288,
            "title": "On Polymarket, the probability of the \"whether the US will strike Iran\" event has risen to 100%, and the process has begun.",
            "description": "The probability of a US strike on Iran has risen to 100% on the Polymarket forecasting market and is now in the settlement process.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053288&language=en-US",
            "pub_date": "2026-02-28 15:58:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053291,
            "title": "Morgan Stanley Applies for National Trust Charter to Hold Clients’ Crypto",
            "description": "Morgan Stanley applied for a national trust charter to custody crypto and provide trading and staking services.\nsource: https://cryptonews.com/news/morgan-stanley-applies-for-national-trust-charter-to-hold-clients-crypto/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053291&language=en-US",
            "pub_date": "2026-02-28 15:59:37",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053290,
            "title": "OpenAI, Paradigm Launch AI Tool to Test Smart Contract Security",
            "description": "OpenAI and Paradigm unveiled EVMbench, an AI benchmarking tool to detect and patch smart contract vulnerabilities, aiming to prevent costly DeFi exploits.\nsource: https://catenaa.com/industries/technology/openai-paradigm-launch-ai-tool-to-test-smart-contract-security/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053290&language=en-US",
            "pub_date": "2026-02-28 16:00:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053289,
            "title": "Iranian News Agency Website Briefly Disrupted by Cyber Attack",
            "description": "On February 28, the Iranian Islamic Republic News Agency reported that its website experienced a brief outage due to a hacker attack. According to Jin10, the issue was resolved quickly, and the website has returned to normal operation.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053289&language=en-US",
            "pub_date": "2026-02-28 16:02:49",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053282,
            "title": "Zack Polanski Leads Party to Major Electoral Victory",
            "description": "Zack Polanski, who transitioned from being an influencer to a political leader in the UK, has achieved a significant milestone. Bloomberg posted on X, highlighting that his party secured its first major electoral victory since he assumed leadership in September. This win marks a pivotal moment in Polanski's political career, showcasing his influence and leadership capabilities.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053282&language=en-US",
            "pub_date": "2026-02-28 15:47:34",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053279,
            "title": "BitMart LaunchPrime: The new project Opinion (OPN) is now live.",
            "description": "According to official news, BitMart has officially launched a new LaunchPrime project – Opinion (OPN). This is a limited-time subscription event with a total supply of 12,552 OPN tokens. The maximum investment per user is 500 USDT. Users can participate in this subscription after completing registration. The event will be divided into three stages: registration, investment, and distribution, with tokens ultimately allocated according to the individual's investment proportion. BitMart has been actively promoting the development of the LaunchPrime platform, striving for comprehensive upgrades in project selection, risk control, and user experience.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053279&language=en-US",
            "pub_date": "2026-02-28 15:51:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053281,
            "title": "UK Prime Minister Faces Strategic Shift Amid Parliamentary Challenges",
            "description": "The strategy that led Keir Starmer to Downing Street has reached a critical juncture this week. Bloomberg posted on X, highlighting the uncertainty surrounding what will replace it and whether members of Parliament will allow the UK prime minister the time needed to implement a new approach. As Starmer navigates this pivotal moment, the focus remains on how he will adapt to the evolving political landscape and maintain support within Parliament.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053281&language=en-US",
            "pub_date": "2026-02-28 15:53:01",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053280,
            "title": "Increased Air Defense Activity Observed Over Tehran Amid Rising Tensions",
            "description": "Crypto Jargon posted on X. Iranian fighter jets have been observed flying above Tehran, indicating heightened air defense activity. This development comes as tensions in the region continue to escalate, prompting increased military readiness.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053280&language=en-US",
            "pub_date": "2026-02-28 15:53:26",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053266,
            "title": "U.S. President Trump Addresses Measures to Protect Troops in Region",
            "description": "U.S. President Donald Trump announced that the United States has implemented all possible measures to minimize risks to American military personnel stationed in the region. According to Jin10, these actions are part of ongoing efforts to ensure the safety and security of U.S. forces abroad. The statement underscores the administration's commitment to safeguarding its troops amid evolving geopolitical challenges.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053266&language=en-US",
            "pub_date": "2026-02-28 15:39:06",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053265,
            "title": "Iranian President Reported Safe Following Incident",
            "description": "Iranian President has been reported safe following an unspecified incident, according to Jin10. The report, sourced from Iran's Mehr News Agency, did not provide further details about the nature of the incident or any potential threats involved. The assurance of the president's safety comes amid heightened tensions in the region, although no specific connection to recent geopolitical events was mentioned. Further updates are awaited to clarify the situation and any implications it might have on regional stability.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053265&language=en-US",
            "pub_date": "2026-02-28 15:41:52",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053264,
            "title": "Russian Officials Question Continuation of US-Led Peace Talks with Ukraine",
            "description": "Russian officials are expressing doubts about the value of continuing US-led peace negotiations with Ukraine. Bloomberg posted on X, citing sources familiar with the discussions, that these officials believe further talks may be futile unless Kyiv agrees to cede territory as part of a potential agreement. The ongoing negotiations have yet to yield significant progress, and the stance of the Russian officials highlights the challenges in reaching a resolution. The situation remains tense as both sides grapple with the terms of a possible peace deal.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053264&language=en-US",
            "pub_date": "2026-02-28 15:43:10",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053263,
            "title": "Russia is considering suspending peace talks unless Ukraine relinquishes some territory.",
            "description": "Russia is considering suspending peace talks unless Ukraine relinquishes some territory. (Jinshi)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053263&language=en-US",
            "pub_date": "2026-02-28 15:46:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053255,
            "title": "Israeli sources say all senior Iranian government officials were targets of the attack.",
            "description": "Israeli sources say all senior Iranian government officials were targeted in the attack. (CCTV News)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053255&language=en-US",
            "pub_date": "2026-02-28 15:32:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}