{
    "data": [
        {
            "id": 733166,
            "title": "US spot Bitcoin ETF had a net outflow of $234.54 million yesterday",
            "description": "According to TraderT monitoring data, the US spot Bitcoin ETF had a net outflow of US$234.54 million yesterday.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733166&language=en-US",
            "pub_date": "2025-02-04 11:31:03",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733165,
            "title": "US spot Ethereum ETF had a net inflow of $83.54 million yesterday",
            "description": "According to TraderT monitoring data, the US spot Ethereum ETF had a net inflow of US$83.54 million yesterday.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733165&language=en-US",
            "pub_date": "2025-02-04 11:32:07",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733164,
            "title": "Coinbase Developer Platform AI Hackathon Announces Winners, DeFAI Project Mamoriko Wins First Prize",
            "description": "The Coinbase Developer Platform (CDP) AI Hackathon announced the winners, and the DeFAI project Mamoriko won the first prize. It is reported that the project is an AI agent that can find the best returns for USDC on Base and safely optimize the returns of users. The second prize was won by TweetBounty, an AI-driven social media marketing protocol. The Best Infrastructure Award was won by BitMind, a decentralized reputation system that ensures trust, promotes transparency and accountability by verifying AI claims in real time.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733164&language=en-US",
            "pub_date": "2025-02-04 11:32:34",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733167,
            "title": "Bitcoin Depot Expands Bitcoin Holdings With $5 Million Purchase",
            "description": "According to BlockBeats, on February 4, U.S. Bitcoin ATM operator Bitcoin Depot (NASDAQ: BTM) announced an additional purchase of $5 million worth of Bitcoin as part of its financial strategy, initially revealed in June of last year. With the acquisition of 51 BTC yesterday, the company now holds a total of 71.5 Bitcoins.\n\nBitcoin Depot is the leading Bitcoin ATM operator in North America, with approximately 8,400 self-service terminals.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733167&language=en-US",
            "pub_date": "2025-02-04 11:33:49",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733163,
            "title": "US-listed Bitcoin Depot buys additional $5 million in Bitcoin",
            "description": "US Bitcoin ATM operator Bitcoin Depot (NASDAQ: BTM) announced that it has purchased an additional $5 million in Bitcoin as part of its financial strategy, which was first announced in June last year. With the purchase of 51 BTC yesterday, the company now holds 71.5 Bitcoins. (Globenewswire)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733163&language=en-US",
            "pub_date": "2025-02-04 11:24:41",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733162,
            "title": "Blockchain game studio Midnight Society closes due to financial difficulties",
            "description": "Midnight Society, the production studio behind the blockchain game Deadrop, has confirmed its closure after facing financial difficulties and internal turmoil. Just a few days before the announcement of the closure of the company, employees received a two-day notice of the company's closure. Previously, co-founder Dr. Disrespect left in mid-2024 due to allegations of misconduct. Although the studio initially expressed confidence in continuing to develop and release Deadrop in 2025, insufficient funds and layoffs ultimately led to its closure. (NFT Plazas)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733162&language=en-US",
            "pub_date": "2025-02-04 11:12:05",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733159,
            "title": "Midnight Society Closes Amid Financial Struggles And Internal Turmoil",
            "description": "According to PANews, the game development studio Midnight Society, known for its work on the blockchain game 'Deadrop,' has confirmed its closure following financial difficulties and internal unrest. Employees were informed of the company's shutdown just two days before the official announcement. The closure comes after co-founder Dr. Disrespect departed in mid-2024 due to allegations of misconduct. Despite initial assurances from the studio about continuing development and releasing 'Deadrop' in 2025, insufficient funding and staff layoffs ultimately led to its closure.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733159&language=en-US",
            "pub_date": "2025-02-04 11:03:46",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733158,
            "title": "XeggeX Faces Security Breach Amid Operational Disruptions",
            "description": "According to PANews, cryptocurrency exchange XeggeX announced on the X platform that its CEO's account was hacked, resulting in the loss of access to their Telegram account and community group. The exchange emphasized that securing their wallet and ensuring the safety of funds was a priority. They have disconnected their database from the network, which has caused login issues, and are conducting a thorough review. More detailed information will be provided once available.\n\nTwo hours prior to XeggeX's announcement, crypto media outlet BlockTempo suggested that XeggeX might be facing a crisis, as several users reported being unable to log into the platform. Additionally, all tokens were reportedly delisted from the official website, raising market concerns. The market experienced a significant downturn yesterday, potentially leading to a surge in withdrawal requests and a liquidity crisis. If the platform fails to resume normal operations, it could indicate a potential exit scam.\n\nAs of now, PANews reports that the XeggeX website displays a message stating \"We will be back soon,\" and has not yet returned to normal operations.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733158&language=en-US",
            "pub_date": "2025-02-04 11:03:53",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733155,
            "title": "Crypto News: Xeggex CEO’s Account Hacked, Funds Go Missing",
            "description": "The post Crypto News: Xeggex CEO’s Account Hacked, Funds Go Missing appeared first on Coinpedia Fintech News\nXeggex, a popular cryptocurrency exchange, has been experiencing issues after users reported sudden loss of logins and disappearing asset balances. Many are concerned that the exchange may have been “rugpulled.” Xeggex officials have explained that the CEO’s account was hacked, which...\nsource: https://coinpedia.org/news/crypto-news-xeggex-ceos-account-hacked-funds-go-missing/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733155&language=en-US",
            "pub_date": "2025-02-04 10:56:47",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733153,
            "title": "Yesterday, BlackRock’s Ethereum ETF transaction volume reached US$700 million, setting a new record high",
            "description": "Trader T monitoring shows that the trading volume of BlackRock Ethereum ETF ETHA reached $700 million yesterday, a record high. However, the net inflow/outflow of the ETF yesterday was 0. On the other hand, the trading volume of BlackRock Bitcoin ETF yesterday reached $4.2 billion. Similarly, the net inflow/outflow of the ETF yesterday was 0.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733153&language=en-US",
            "pub_date": "2025-02-04 10:52:05",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}