{
    "data": [
        {
            "id": 1051193,
            "title": "GEOPOLITICS | Poilievre Discusses US-Canada Trade Relations",
            "description": "Pierre Poilievre delivered a comprehensive speech on Thursday, focusing on the dynamics of US-Canada relations and addressing trade tensions between the two nations. Bloomberg posted on X, highlighting Poilievre's detailed approach to navigating these economic challenges. His address emphasized the importance of strategic policies to manage and improve trade interactions with the United States, aiming to foster a more stable and beneficial relationship. Poilievre's insights come at a time when trade relations are crucial for both countries, underscoring the need for thoughtful and effective policy measures.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051193&language=en-US",
            "pub_date": "2026-02-27 06:19:19",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051195,
            "title": "US media: The Trump administration is stepping up its strategy to retain tariff revenues.",
            "description": "According to Politico, officials from multiple departments of the Trump administration are working on legal strategies to retain billions of dollars in tariff revenue after the Supreme Court ruled that the tariffs were \"illegally collected.\" Several people familiar with the internal discussions said that initial plans include using policy measures to discourage companies from applying for refunds, preventing the government from actually paying refunds, or otherwise retaining at least some of the tariff revenue. One proposal is to claim that tariffs collected over the past year are legitimate revenue under a new tariff framework that the government is preparing to implement under different legal jurisdictions. Another option would allow companies to receive priority processing in the expectedly long refund queue, provided they agree to waive a portion of their refunds from the government.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051195&language=en-US",
            "pub_date": "2026-02-27 06:24:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051192,
            "title": "OpenAI to Collaborate with Canadian Authorities for Enhanced Law Enforcement Standards",
            "description": "OpenAI has announced plans to establish a direct communication channel with Canadian law enforcement agencies. According to Jin10, the company is committed to working closely with the Canadian government and experts to further strengthen its law enforcement referral standards. This initiative aims to enhance cooperation and ensure effective enforcement measures in the region. OpenAI's collaboration reflects its ongoing efforts to align with regulatory frameworks and support public safety initiatives.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051192&language=en-US",
            "pub_date": "2026-02-27 06:24:14",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051186,
            "title": "The probability of the Federal Reserve keeping interest rates unchanged in March is 96%.",
            "description": "According to CME's \"FedWatch\": the probability of the Federal Reserve cutting interest rates by 25 basis points by March is 4%, and the probability of keeping rates unchanged is 96.0%. The probability of the Fed cutting rates by a cumulative 25 basis points by April is 17.3%, the probability of keeping rates unchanged is 82.1%, and the probability of a cumulative 50 basis point cut is 0.6%. The probability of a cumulative 25 basis point cut by June is 43%.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051186&language=en-US",
            "pub_date": "2026-02-27 06:20:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051185,
            "title": "Marathon Digital Holdings Expands into AI Data Centers with Starwood Partnership",
            "description": "Marathon Digital Holdings, a prominent Bitcoin mining company, has announced a partnership with investment firm Starwood to repurpose and expand certain facilities for AI data center usage. According to NS3.AI, this strategic move marks Marathon's diversification into AI infrastructure, complementing its primary focus on cryptocurrency mining. Following the announcement, Marathon's stock price surged by 17%, indicating positive investor sentiment towards the company's expansion efforts.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051185&language=en-US",
            "pub_date": "2026-02-27 06:07:30",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051184,
            "title": "Kratos Aims to Raise $1 Billion Amid Increased Defense Spending",
            "description": "Kratos Defense & Security Solutions is planning to raise $1 billion through a share sale. Bloomberg posted on X that this move comes as government expenditure on defense is on the rise. The company aims to capitalize on the increased demand for defense solutions, driven by heightened global security concerns. Kratos, known for its advanced technology and defense capabilities, is positioning itself to meet the growing needs of the defense sector. The funds raised will likely support the company's expansion and development of new technologies to enhance its offerings in the defense market.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051184&language=en-US",
            "pub_date": "2026-02-27 06:11:29",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051173,
            "title": "Reid Hoffman's Ethereum Holdings Revealed",
            "description": "Reid Hoffman, co-founder of LinkedIn, has been identified as owning Ethereum valued at approximately $6.1 million. According to NS3.AI, this information was disclosed through data reported by Arkham and shared by U.Today. Hoffman's substantial investment in Ethereum underscores a significant endorsement of the cryptocurrency by a leading figure in the tech industry.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051173&language=en-US",
            "pub_date": "2026-02-27 06:04:33",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051172,
            "title": "Finland Investigates Property Purchases Near Sensitive Sites",
            "description": "The Finnish government is conducting an investigation into numerous properties acquired near critical infrastructure and sensitive locations. Bloomberg posted on X, highlighting concerns about potential Russian infiltration. Authorities are scrutinizing these transactions to determine if they pose any security risks. The investigation reflects growing apprehensions about foreign influence and the safeguarding of national security. The Finnish government aims to ensure that strategic sites remain protected from any external threats.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051172&language=en-US",
            "pub_date": "2026-02-27 06:05:47",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051171,
            "title": "India Urged to Capitalize on Silicon Valley's Data Boom",
            "description": "India is being encouraged to take advantage of the burgeoning data opportunities presented by Silicon Valley's tech industry. Bloomberg posted on X, highlighting the potential benefits for India in harnessing this digital transformation. As global tech companies continue to expand their data-driven operations, India has the chance to position itself as a key player in this sector. By leveraging its technological capabilities and vast talent pool, India could significantly enhance its economic growth and innovation landscape. The focus is on creating a robust framework that supports data utilization while ensuring privacy and security. This strategic move could propel India into a leading role in the global digital economy, fostering new partnerships and driving technological advancements.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051171&language=en-US",
            "pub_date": "2026-02-27 06:05:54",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051170,
            "title": "Grayscale's Latest Crypto Holdings Update",
            "description": "Grayscale has released its latest update on cryptocurrency holdings, detailing the assets under management across various digital currencies. Grayscale posted on X, highlighting the inclusion of major cryptocurrencies such as Bitcoin (BTC), Ethereum (ETH), Solana (SOL), and XRP among others.\n\nThe update includes a comprehensive list of assets, featuring Binance Coin (BNB), Litecoin (LTC), Zcash (ZEC), Chainlink (LINK), and Sui (SUI). Other notable mentions are Stellar (XLM), Internet Protocol (IP), Tao (TAO), Dogecoin (DOGE), Avalanche (AVAX), Zen (ZEN), SXT, WAL, DEEP, PYTH, Filecoin (FIL), Livepeer (LPT), Aave (AAVE), Near Protocol (NEAR), Stacks (STX), Decentraland (MANA), Bitcoin Cash (BCH), Ethereum Classic (ETC), Basic Attention Token (BAT), and Stellar (XLM).\n\nGrayscale's update reflects the company's ongoing commitment to providing investors with diversified exposure to the cryptocurrency market. The detailed list of holdings underscores the breadth of Grayscale's investment strategy, catering to a wide range of digital assets.\n\nThis announcement comes amid a period of heightened interest in digital currencies, as investors continue to seek opportunities in the evolving crypto landscape. Grayscale's transparency in reporting its holdings is seen as a positive move for the industry, offering insights into the company's asset management approach.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051170&language=en-US",
            "pub_date": "2026-02-27 06:06:51",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051166,
            "title": "Duolingo's Subscriber Growth Strategy Impacts Earnings",
            "description": "Duolingo shares experienced a significant drop of up to 22% in post-market trading following the company's announcement regarding its strategy to increase subscribers. Bloomberg posted on X that this approach is expected to result in slower earnings growth and reduced profit margins in the near term. The language-learning platform's focus on expanding its user base is seen as a move that could impact its financial performance temporarily.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051166&language=en-US",
            "pub_date": "2026-02-27 05:50:28",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051165,
            "title": "Coupang Faces Unexpected Loss Amid Data Breach Challenges",
            "description": "Coupang has announced an unforeseen loss for the fourth quarter, highlighting the difficulties the company is experiencing after a significant data breach in South Korea, its primary market. Bloomberg posted on X, detailing the financial strain on the e-commerce giant as it navigates the repercussions of the security incident. The breach has raised concerns about customer trust and data security, impacting Coupang's operations and financial performance. The company is working to address these issues while maintaining its market position in South Korea.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051165&language=en-US",
            "pub_date": "2026-02-27 05:54:44",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051164,
            "title": "Flutter's Fourth-Quarter Results Miss Wall Street Estimates",
            "description": "Flutter, the parent company of the FanDuel gambling platform in the United States, announced its fourth-quarter financial results, which did not meet Wall Street expectations. Bloomberg posted on X that the company's performance was impacted by a slowdown in new customer registrations and a moderation in wagering growth. Despite these challenges, Flutter continues to navigate the competitive landscape of the gambling industry, seeking strategies to enhance its market position and drive future growth.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051164&language=en-US",
            "pub_date": "2026-02-27 05:55:18",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051152,
            "title": "️CONFLICT: IRAN REJECTS COMPROMISE WITH U.S. AS TALKS IN GENEVA AT A STALEMATE\n\nPer the @WSJ Iran has declined the dismantling of the Fordow Fuel Enrichment Plant, shutting down Natanz Nuclear Facility, touching Isfahan Nuclear Technology Center and the handing over enriched",
            "description": "null\nsource: https://x.com/BSCNews/status/2027137849577857221",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051152&language=en-US",
            "pub_date": "2026-02-27 05:45:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051149,
            "title": "Nasdaq Files for VanEck's JitoSOL ETF Listing with SEC",
            "description": "Nasdaq has submitted a filing to the U.S. Securities and Exchange Commission (SEC) to list VanEck's JitoSOL ETF, which features a liquid staking token based on Solana. According to NS3.AI, if the proposal is approved, the staking rewards will be integrated directly into the fund's Net Asset Value (NAV) instead of being distributed separately to investors. This initiative represents a novel method of handling staking rewards within an ETF framework.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051149&language=en-US",
            "pub_date": "2026-02-27 05:39:22",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051148,
            "title": "STOCKS | European Stock Indices Rise for Second Consecutive Day",
            "description": "European stock indices have experienced gains for the second day in a row. According to RTHK, the UK's FTSE 100 Index closed at 10,846 points, marking an increase of 40 points or 0.37%. Meanwhile, France's CAC Index ended at 8,620 points, up by 61 points or 0.72%. Germany's DAX Index also saw an increase, closing at 25,289 points, which is a rise of 113 points or 0.45%.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051148&language=en-US",
            "pub_date": "2026-02-27 05:43:26",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051147,
            "title": "Elon Musk's Potential to Become World's First Trillionaire Examined",
            "description": "Elon Musk is on track to potentially become the world's first trillionaire, a milestone that could significantly impact global markets and politics. Bloomberg posted on X, highlighting the parallels between Musk's financial trajectory and that of historical figures like John D. Rockefeller. Rockefeller's immense wealth reshaped industries and influenced political landscapes, suggesting that Musk's growing fortune could have similar effects.\n\nMusk's ventures, including Tesla and SpaceX, have contributed to his rapid accumulation of wealth, positioning him as a leading figure in the tech and automotive sectors. His innovative approach and ambitious projects continue to drive investor interest and market dynamics.\n\nThe prospect of Musk reaching trillionaire status raises questions about the broader implications for economic structures and governance. As his influence expands, stakeholders are closely monitoring how his wealth might alter existing power balances and economic policies.\n\nWhile Musk's financial ascent is remarkable, it also underscores the evolving nature of wealth creation in the modern era, where technology and innovation play pivotal roles. Observers are keen to see how Musk's potential trillionaire status will shape future market trends and political discourse.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051147&language=en-US",
            "pub_date": "2026-02-27 05:45:05",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051146,
            "title": "Hong Kong and Blockchain's Role in China's Yuan Ambitions",
            "description": "China is strategically positioning Hong Kong and blockchain technology to advance its goal of establishing the yuan as a global reserve currency. Bloomberg posted on X, highlighting the significance of these elements in China's broader economic strategy.\n\nHong Kong's financial infrastructure and its status as a global financial hub are seen as pivotal in facilitating international transactions in yuan. The city’s robust legal framework and financial expertise provide a conducive environment for promoting the yuan in global markets.\n\nBlockchain technology is also being leveraged to enhance the efficiency and transparency of cross-border transactions. By integrating blockchain, China aims to streamline processes and reduce costs, thereby making the yuan more attractive for international trade and finance.\n\nThese efforts are part of China's broader strategy to reduce reliance on the U.S. dollar and increase the yuan's influence in global financial markets. As China continues to expand its economic reach, the roles of Hong Kong and blockchain technology are expected to become increasingly significant in achieving these ambitions.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051146&language=en-US",
            "pub_date": "2026-02-27 05:45:36",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051139,
            "title": "Hyundai Motor Advances in Humanoid Robot Development",
            "description": "Hyundai Motor has positioned itself as a leader in the development of humanoid robots, amidst global attention on Elon Musk's Optimus robot and the AI competition between the U.S. and China. Bloomberg posted on X, highlighting Hyundai's advancements in robotics technology, which have gained significant recognition in the industry. The company's focus on innovation and technological progress has enabled it to make substantial strides in the field of humanoid robots, setting it apart from other major players in the market. Hyundai's commitment to robotics is part of its broader strategy to enhance its technological capabilities and expand its influence in the global robotics sector.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051139&language=en-US",
            "pub_date": "2026-02-27 05:28:34",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051138,
            "title": "MARA Collaborates with Starwood to Enhance Bitcoin Mining Sites for AI and Cloud Services",
            "description": "MARA has announced a partnership with Barry Sternlicht’s Starwood to transform some of its existing Bitcoin mining sites into infrastructure capable of supporting artificial intelligence applications and various cloud services. Bloomberg posted on X, highlighting the strategic move aimed at diversifying MARA's operations beyond cryptocurrency mining.\n\nThe collaboration seeks to leverage the existing facilities to accommodate the growing demand for AI and cloud computing capabilities. This initiative reflects a broader trend in the industry where companies are exploring ways to integrate advanced technologies into their operations.\n\nBy repurposing these sites, MARA and Starwood aim to create a more versatile infrastructure that can cater to the evolving needs of the tech sector. This development is expected to enhance the operational efficiency and expand the service offerings of both companies.\n\nThe partnership underscores the increasing convergence between cryptocurrency mining and other technological domains, as firms look to capitalize on the synergies between these sectors. As the demand for AI and cloud services continues to rise, such collaborations are likely to become more prevalent in the industry.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051138&language=en-US",
            "pub_date": "2026-02-27 05:30:53",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}