{
    "data": [
        {
            "id": 733993,
            "title": "Report: Bitcoin has achieved a market value of $850 billion, becoming a global macro asset that many countries and institutions are paying attention to",
            "description": "Odaily Planet Daily News According to a recent report by Glassnode, Bitcoin has absorbed about $450 billion in additional capital since November 2022, bringing the total realized market value to $850 billion, making it a global macro asset that countries and institutions are paying attention to.\nIt said that the growth of Bitcoin's realized market value was driven by its increasingly important role on the global stage, which attracted institutions and sovereign entities. The report emphasizes that the participation of nation-states in Bitcoin is a key factor, including Bhutan's participation in large-scale mining operations, El Salvador's establishment of Bitcoin as legal tender, and the United States' consideration of its potential as a strategic reserve asset.\nIn addition, Bitcoin also acts as a decentralized payment network. Over the past year, the Bitcoin network has processed an average of $8.7 billion in adjusted economic transactions per day, with a total transaction volume of $3.2 trillion.\nThe report also pointed out that new demand is now exploding, rather than a continuous inflow as in previous cycles. Compared with the peak in 2021, the participation of small retail investors has declined, while large entities have increased their holdings.\nDespite the favorable market conditions, Google search interest in Bitcoin has not yet reached the level of 2021. The investor base is changing, with retail participants showing more strategic accumulation behavior. \nThe launch of the US spot Bitcoin ETF has enabled institutional investors to gain investment opportunities, with net inflows exceeding $40 billion within one year of launch and combined AUM exceeding $120 billion.\nThe Bitcoin investor base has shown resilience during market corrections. Actual losses in the current cycle are lower than in previous cycles, with the only major event being the yen carry liquidation on August 5, 2024. The report also highlights that unlike past cycles, Bitcoin's declines are more controlled and actual volatility is lower. \nOverall, the price action in this cycle is characterized by a series of rallies followed by a period of consolidation, with a more stable market structure as more mature participants trade Bitcoin and other cryptocurrencies.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733993&language=en-US",
            "pub_date": "2025-02-05 11:23:01",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733989,
            "title": "A suspected insider address made a profit of $3.94 million by trading ENRON in 12 minutes",
            "description": "Odaily Planet Daily News: The suspected insider address 3VR8r...wZz4j made a profit of $3.94 million by trading ENRON in 12 minutes.\nThe address spent 1.2 million USDC to buy 10.75 million ENRON in the first minute of listing, with a cost of $0.1487, and then liquidated the position in batches at an average price of $0.5151 near the peak of the currency price, with a return rate of 246.4%.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733989&language=en-US",
            "pub_date": "2025-02-05 11:18:42",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733983,
            "title": "Robinhood's Super Bowl betting product was suspended by CFTC one day after it launched",
            "description": "Odaily Planet Daily News Robinhood Markets has suspended its Super Bowl betting service after the U.S. CFTC asked to remove its customers' access to the event contracts.\nJust a day ago, Robinhood launched the product in cooperation with prediction market Kalishi, allowing users to bet on the outcome of the NFL Super Bowl championship game between the Philadelphia Eagles and the Kansas City Chiefs on February 9. Robinhood said in an announcement on February 4 that it would suspend the launch of the professional football championship betting market and continue to work with the CFTC to understand its concerns.\nThe company said it had launched the product to about 1% of its customers, some of whom had already traded. Robinhood said: \"We are disappointed with this result, especially considering that we have been in regular communication with the CFTC about our intentions and plans to offer this product.\"",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733983&language=en-US",
            "pub_date": "2025-02-05 11:03:38",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733982,
            "title": "A whale spent $7.94 million in SOL to buy 81 WBTC in the past hour",
            "description": "Odaily Planet Daily News According to Onchain Lens monitoring, in the past hour, a whale spent 38,488 SOL (worth $7.94 million) and bought 81 WBTC at an average price of $98,062. \nPreviously, the whale made a profit of $4.04 million on AI16Z.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733982&language=en-US",
            "pub_date": "2025-02-05 11:05:24",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733981,
            "title": "Kaiko: BTC and ETH short-term funding rates are low, and investors are trying to find a clear direction",
            "description": "Odaily Planet Daily News Crypto research company Kaiko pointed out in its latest report that cryptocurrencies are in a tricky situation. Bitcoin and Ethereum short-term funding rates (usually used as an indicator of market sentiment) are low, indicating that investors are struggling to find a clear direction. At the same time, the end-of-month option expiration shows a balance, which means that traders are betting that volatility will be short-lived, and the wave of liquidations in the derivatives market has also exacerbated volatility. The open interest of Bitcoin and Ethereum on mainstream CEXs fell by 4% and 12% respectively last weekend.\nSince December last year, South Korea's cryptocurrency trading volume has fallen sharply, and altcoins led by XRP and DOGE continued to face strong selling pressure throughout January. Taking Upbit as an example, large DOGE orders dominate the high price range, which may indicate that large traders or whales are leading the sell-off and may be taking profits. XRP is the most actively traded asset on Upbit in January, with a cumulative trading volume of approximately US$790 million, more than twice that of DOGE.\nIn addition, most Meme tokens have lagged behind the broader market, but the frenzy is far from over, and major U.S. exchanges such as Coinbase are currently considering switching from an \"allow list\" to a \"block list\" strategy to more effectively manage the influx of Meme coins. But for Trump, investors never know what will happen. Kaiko analyst Adam McCarthy said: \"He (Trump) is like a toddler who is testing his limits.\"",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733981&language=en-US",
            "pub_date": "2025-02-05 11:06:31",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733988,
            "title": "U.S. Stock Markets Rise Amid Strong Corporate Earnings",
            "description": "According to BlockBeats, on February 5, the three major U.S. stock indices closed higher on Tuesday, continuing the recovery trend from Monday's V-shaped reversal. Strong corporate earnings have bolstered investor optimism. By the close, the Dow Jones Industrial Average rose 0.3%, the S&P 500 increased by 0.72%, and the Nasdaq Composite gained 1.35%. Major tech stocks saw significant gains, with Apple, Tesla, and Google each rising over 2%.\n\nIn contrast, the cryptocurrency market experienced a downturn. Bitcoin, which had been striving to maintain the $100,000 mark, faced a significant pullback, dropping to around $96,000 this morning. This decline was attributed to the lack of specific details on U.S. Bitcoin reserves in David Sacks' speech and escalating U.S.-China trade tensions, which increased market uncertainty. The downturn in Bitcoin led to a broader decline in altcoins. Ethereum fell 3.2% over the past 24 hours, currently priced at $2,718, while SOL decreased by 4.5% to $205. Bitcoin's market dominance has risen from a December low of 53% to 61%, reaching a four-year high, indicating a shift of funds from altcoins to Bitcoin.\n\nInvestors are currently focused on the upcoming U.S. non-farm payroll data due on Friday, along with speeches from several Federal Reserve officials and the latest developments in the U.S.-China trade war. This week also marks a busy earnings season for U.S. stocks. Industry statistics reveal that out of 211 S&P 500 companies that have reported fourth-quarter earnings, 76.8% have exceeded analysts' expectations, further boosting investor confidence.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733988&language=en-US",
            "pub_date": "2025-02-05 11:13:50",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733979,
            "title": "BTC rebounded and broke through 98,000 USDT, and the 24-hour decline narrowed to 2.87%",
            "description": "OKX market shows that BTC rebounded and broke through 98,000 USDT, and is now at 98,033.3 USDT, with the 24-hour decline narrowed to 2.87%. (This newsletter is generated by AI)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733979&language=en-US",
            "pub_date": "2025-02-05 10:54:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733978,
            "title": "Binance will launch spot grid and spot DCA trading pairs such as LTC/USDC",
            "description": "According to the official announcement, Binance will enable spot grid and spot DCA services for the following trading pairs at 08:00 (UTC) on February 6, 2025: LTC/USDC, S/USDC, TRUMP/USDC. Users need to complete account verification before they can participate in the transaction. Currently, users living in Canada, Cuba, Crimea, Iran, the Netherlands, North Korea, Syria, the United States and its territories (American Samoa, Guam, Puerto Rico, Northern Mariana Islands, U.S. Virgin Islands) and non-government controlled areas of Ukraine will not be able to trade the above spot trading pairs. (This newsletter is generated by AI)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733978&language=en-US",
            "pub_date": "2025-02-05 11:01:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733977,
            "title": "Coinbase Chief Legal Officer Urges SEC to Immediately Submit Documents Related to ETH 2.0 Investigation",
            "description": "Odaily Planet Daily News Coinbase Chief Legal Officer Paul Grewal posted on X: \"Today, Coinbase filed a status report in our separate SEC FOIA lawsuit. In short: the former SEC leadership only looked for documents that were not disclosed to the public in the ETH 2.0 investigation, but they made a lot of trouble in supervision through subpoenas and lawsuits. We seek the U.S. SEC to conduct a full investigation immediately and provide the required documents.\"",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733977&language=en-US",
            "pub_date": "2025-02-05 10:45:23",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733976,
            "title": "A certain address spent $2 million USDC to buy 3.1 million Fartcoin",
            "description": "Odaily Planet Daily News: On-chain data shows that a certain address spent 2 million US dollars in USDC and bought 3.1 million Fartcoins at an average price of 0.67 US dollars.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733976&language=en-US",
            "pub_date": "2025-02-05 10:48:45",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}