{
    "data": [
        {
            "id": 734226,
            "title": "SSE market value exceeds 40 million US dollars",
            "description": "Odaily Planet Daily News GMGN data shows that the market value of SSE has exceeded 40 million US dollars and is now reported at 44.56 million US dollars.\nOdaily reminds users that the price of Meme coins fluctuates greatly, so investors are advised to participate with caution.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734226&language=en-US",
            "pub_date": "2025-02-05 16:59:26",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734225,
            "title": "Binance Futures adjusts leverage and margin tiers for multiple U-margin perpetual contracts",
            "description": "According to the official announcement, Binance Futures has updated the leverage and margin tiers of XRPUSDC, ACTUSDT, 1000SATSUSDT, NEARUSDT, SEIUSDT, NOTUSDT, APEUSDT, CFXUSDT, PEOPLEUSDT, DOGSUSDT, TURBOUSDT, THETAUSDT, MEWUSDT and RUNEUSDT U-margin perpetual contracts at 08:30 (UTC) on February 5, 2025. Please note that users' current positions will not be affected. (This newsletter is generated by AI)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734225&language=en-US",
            "pub_date": "2025-02-05 17:01:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734233,
            "title": "Ark Invest Highlights Key Technologies Driving Economic Growth",
            "description": "According to BlockBeats, ARK Invest released its latest report, 'Big Ideas 2025,' on February 5, highlighting five major technological platforms, including public blockchains and artificial intelligence, that are expected to drive global economic growth and industry transformation.\n\nThe report emphasizes that AI agents will revolutionize human-computer interaction and accelerate software development. It predicts that the AI-driven software market could reach trillions of dollars by 2030.\n\nBitcoin, as a digital asset, continues to gain value and market acceptance. ARK forecasts that Bitcoin's price could range between $300,000 and $1.5 million by 2030, with a neutral expectation of $710,000.\n\nStablecoins have surpassed traditional payment processors in transaction value, becoming a significant component of the digital asset sector. The market size of stablecoins is projected to grow from the current $203 billion to $1.4 trillion by 2030.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734233&language=en-US",
            "pub_date": "2025-02-05 17:03:59",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734224,
            "title": "Analysis: MicroStrategy's suspension of BTC holdings may be due to its strategic changes or restrictions such as the lock-up period",
            "description": "Odaily Planet Daily News MicroStrategy temporarily stopped buying Bitcoin after buying it for 12 consecutive weeks. Some analysts believe that the company may be brewing a strategic change, while others believe that this is a temporary move and the company intends to start accumulating Bitcoin again.\nAnalysis points out that Bitcoin is very important to MicroStrategy, but factors such as managing cash flow, stock performance, and efforts to raise funds may affect its buying mentality in the short term. Over time, market volatility, investor concerns, and regulatory uncertainty may all change, causing the company to be more cautious about important decisions in the near future.\nWhen management decides to stop acquisitions altogether, the increased tax burden may become a real burden. The company may face a huge tax bill for unrealized Bitcoin gains, which may exceed $19 billion. Financial planning must be carried out to cope with tax obligations, allowing the company to continue to adhere to the Bitcoin strategy.\nSince its recent inclusion in the Nasdaq 100 Index, MicroStrategy has been subject to various rules and regulations, such as lock-up periods, which sometimes prevent insider trading from occurring, which may be another reason why Bitcoin sales have been suppressed.\nHowever, there is little sign that MicroStrategy is abandoning its Bitcoin-centric strategy. The company's history suggests that any interruption in its buying spree is likely to be strategic rather than a sign of declining confidence in Bitcoin. The current period may be a period of recalibration, allowing MicroStrategy to optimize its resources before resuming Bitcoin accumulation. (Bitcoinist)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734224&language=en-US",
            "pub_date": "2025-02-05 17:05:18",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734217,
            "title": "AI Crypto Market Crash as US-China Trade War Escalates",
            "description": "The post AI Crypto Market Crash as US-China Trade War Escalates appeared first on Coinpedia Fintech News\nOn Feb 4th, China retaliated aggressively against the US’ move to impose a 10% tariff on Chinese goods, imposing a 15% counter-tariff on selected US goods. The development affected the cryptocurrency sector, especially the AI crypto segment, severely. Today, the situation has touched a new...\nsource: https://coinpedia.org/news/ai-crypto-market-crash-as-us-china-trade-war-escalates/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734217&language=en-US",
            "pub_date": "2025-02-05 16:46:51",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734215,
            "title": "Hut 8 produced 65 BTC in January and currently holds 10,208 BTC",
            "description": "Odaily Planet Daily News Nasdaq-listed Bitcoin mining company Hut 8 released an operational update report for January 2025, producing 65 BTC that month, a decrease of about 27% from the previous month. The current holdings have increased to 10,208, and the managed computing power has reached 9.4 EH/s.\nIn addition, Vega's data center is scheduled to be powered on in the second quarter of 2025 to prepare for signing a hosting agreement with Bitmain for about 15 EH/s.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734215&language=en-US",
            "pub_date": "2025-02-05 16:52:16",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734223,
            "title": "Hut 8 Reports Decrease In Bitcoin Production For January 2025",
            "description": "According to Odaily, Nasdaq-listed Bitcoin mining company Hut 8 has released its operational update for January 2025. The company produced 65 BTC during the month, marking a decrease of approximately 27% compared to the previous month. Currently, Hut 8's Bitcoin holdings have increased to 10,208 BTC, and its managed computing power has reached 9.4 EH/s. Additionally, the Vega data center is scheduled to be powered on in the second quarter of 2025, in preparation for a hosting agreement with Bitmain for approximately 15 EH/s.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734223&language=en-US",
            "pub_date": "2025-02-05 16:53:34",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734222,
            "title": "Stronghold Digital Agrees To Pay Over $1.4 Million In Penalties For Energy Market Violations",
            "description": "According to Odaily, Stronghold Digital Mining has agreed to pay more than $1.4 million in penalties and refunds following an investigation by U.S. federal agencies. The investigation revealed that the company violated energy market regulations while prioritizing its Bitcoin mining operations. Stronghold Digital, along with its subsidiary Scrubgrass Reclamation Company, operates the 85-megawatt Scrubgrass power plant in northwest Pennsylvania. This plant has been functioning as a capacity resource for the PJM Interconnection energy market from 2018 to 2022.\n\nThe settlement agreement, released by the Federal Energy Regulatory Commission (FERC) on January 30, outlines Stronghold's contractual obligation to supply available power to the PJM grid to ensure grid reliability. However, the FERC enforcement office found that between June 2021 and May 2022, Stronghold failed to meet this obligation, diverting power to its Bitcoin mining operations instead.\n\nFERC's investigation revealed that Scrubgrass underreported its available power capacity in the market, accounting for 67% of day-ahead and 69% of real-time power. Instead of supplying this power to PJM, it was redirected to Bitcoin mining, comprising 57% of day-ahead and 59% of real-time power.\n\nAdditionally, the settlement order noted that Stronghold purchased power from PJM at wholesale prices 24% of the time, with some of this power being misclassified as \"station power\" rather than being used for essential plant operations.\n\nAs part of the settlement, Stronghold and Scrubgrass will repay $678,635 in improper earnings to PJM and pay a civil penalty of $741,365 to the U.S. Treasury. The company is also required to submit compliance reports for at least two years and provide market rules training for its employees.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734222&language=en-US",
            "pub_date": "2025-02-05 16:53:51",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734208,
            "title": "AscendEX will launch Solana Social Explorer (SSE)",
            "description": "Odaily Planet Daily News AscendEX (formerly BitMax) will launch Solana Social Explorer (SSE) at 17:30 on February 5, and open SSE/USDT trading pairs, and recharge is now open.\nAscendEX (formerly BitMax) is the first and most comprehensive trading platform for Memecoin on the entire network. The Meme Research Institute team under the platform selects high-quality Memes for listing based on on-chain data and project background. The platform's Memecoin first launch rate is as high as 80%.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734208&language=en-US",
            "pub_date": "2025-02-05 16:38:39",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734207,
            "title": "Mining company Stronghold fined $1.4 million for violating electricity market rules to mine Bitcoin",
            "description": "Odaily Planet Daily News After a federal investigation found that mining company Stronghold Digital violated energy market rules while prioritizing its bitcoin mining business, the company agreed to pay more than $1.4 million in fines and refunds.\nStronghold Digital and its subsidiary Scrubgrass Reclamation Company operated the 85-megawatt Scrubgrass Power Plant in northwestern Pennsylvania as a capacity resource in the PJM Interconnection energy market from 2018 to 2022.\nAccording to the settlement agreement issued by the Federal Energy Regulatory Commission (FERC) on January 30, Stronghold has a contractual obligation to provide its available power to the PJM grid to help ensure grid reliability.\nHowever, the FERC Enforcement Office determined that Stronghold failed to fulfill this obligation between June 2021 and May 2022, and instead diverted electricity to its bitcoin mining business.\nAccording to FERC’s investigation, Scrubgrass underreported the available power capacity it offered in the market by 67% of day-ahead power and 69% of real-time power. It diverted power to bitcoin mining instead of providing it to PJM by 57% of day-ahead power and 59% of real-time power.\nIn addition, FERC noted in the settlement order that Stronghold purchased power from PJM at wholesale prices 24% of the time, and some of that power was misclassified as “station power” rather than used for necessary power plant operations.\nAs part of the settlement, Stronghold and Scrubgrass will reimburse PJM for $678,635 in improper revenue and pay a $741,365 civil penalty to the U.S. Treasury. The company must also file compliance reports for at least two years and provide employee training on market rules.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734207&language=en-US",
            "pub_date": "2025-02-05 16:43:41",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}