{
    "data": [
        {
            "id": 734334,
            "title": "Robinhood Suspends its Super Bowl Betting Product After Request from CFTC",
            "description": "Robinhood Derivatives suspended its Super Bowl betting product just one day after launch following a request from the CFTC.\n<p>The post Robinhood Suspends its Super Bowl Betting Product After Request from CFTC first appeared on Ecoinimist.</p>\nsource: https://ecoinimist.com/2025/02/05/robinhood-suspends-super-bowl-betting/?utm_source=rss&utm_medium=rss&utm_campaign=robinhood-suspends-super-bowl-betting",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734334&language=en-US",
            "pub_date": "2025-02-05 18:57:06",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734333,
            "title": "Justin Sun: Li Lin evaded verification of Huobi’s $30 million fund",
            "description": "Odaily Planet Daily News: Sun Yuchen responded to Huobi’s content on the X platform, saying: “Li Lin’s position has always been, I know that 30 million has not been returned to you, I need to verify, but when you go to him to verify, he disappears. Then he talks about rationality, law, communication, and we have also sued in Hong Kong.”",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734333&language=en-US",
            "pub_date": "2025-02-05 18:59:01",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734332,
            "title": "DWF Labs received 20 million KAPPA tokens for market making 5 days ago",
            "description": "Odaily Planet Daily News: According to Lookonchain monitoring, the DWF Labs address received 20 million KAPPA tokens for market making 5 days ago, equivalent to approximately US$630,000.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734332&language=en-US",
            "pub_date": "2025-02-05 19:02:10",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734337,
            "title": "Figure AI Ends Partnership With OpenAI After Breakthrough",
            "description": "According to PANews, Brett Adcock, founder and CEO of Figure AI, announced that the company has decided to terminate its partnership with OpenAI. The decision comes after achieving a significant breakthrough in fully end-to-end humanoid robot AI, developed independently by the internal team.\n\nFigure AI stated that OpenAI's focus does not align with embedded artificial intelligence, prompting the company to concentrate on its own research and development. Analysts suggest that OpenAI might be developing its own hardware. While Adcock did not disclose specific details, he promised to unveil unprecedented humanoid robot technology within the next 30 days.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734337&language=en-US",
            "pub_date": "2025-02-05 19:03:43",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734331,
            "title": "Korea to Advance Crypto ETFs and Token Securities, Chairman Pledges Support",
            "description": "In a recent announcement during a New Year's conference held in Yeouido, Seoul, Yoo Seok-Seo, the chairman of the Korea Financial Investment Association, expressed strong support for the institutionalization of token securities and the approval of cryptocurrency ETFs in South Korea. This move aims to align Korea's financial product offerings with global markets like the United States, Hong Kong, and Canada, where Bitcoin and Ethereum spot ETFs are already being traded.Highlighting the importance of keeping pace with global financial innovations, Yoo emphasized the need for South Korea to introduce and develop Bitcoin or Ethereum ETFs as mainstream financial products. He stated that he will continue to advocate for the necessary regulatory approvals from financial authorities to ensure South Korea remains competitive in the evolving digital asset space.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734331&language=en-US",
            "pub_date": "2025-02-05 18:50:17",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734330,
            "title": "DeFi Resilience Amid Tariff Crisis: Protocols Like Aave Outperform Traditional Finance",
            "description": "During the recent market downturn triggered by President Trump's new tariff policies, the crypto industry faced a significant sell-off, erasing billions in value. However, some decentralized finance (DeFi) protocols have not only weathered the storm but also showcased a robust performance compared to traditional financial (TradFi) systems. Amid the market volatility, Ethereum (ETH) and Solana (SOL) saw declines of at least 35% and 25%, respectively, yet key DeFi protocols stood firm against the pressures.Marc Zeller, founder of the Aave Chan Initiative (ACI), emphasized the resilience of the Aave platform during the crisis, stating, \"Aave's goal is to remain healthy and minimize the pain.\" This sentiment was echoed by long-time Ethereum commentator Evan Van Ness who noted that, aside from some minor frontend outages, DeFi platforms have generally outperformed TradFi during this period.According to data from Block Analitica, Aave processed approximately $210 million in liquidations during the downturn. This compares to $263 million liquidated on Aave V2 from December 2020 to December 2022. Chaos Labs, a risk service provider, reported that this was the largest liquidation day on record, with over 80% of these liquidations occurring on the Aave Ethereum platform.One significant aspect of Aave's system is its approach to liquidations. \"Most importantly, compared to other venues, Aave does not force the closure of all user positions when liquidations occur. Only up to half can be used for liquidation, mitigating user losses,\" Zeller explained. This mechanism played a critical role in preserving user equity during the market's rapid movements.The efforts of DeFi developers to create secure and stable platforms have proven their worth, with protocols like Aave leading by example. The integration of Chainlink's smart value recovery solution is a forthcoming enhancement aimed at making liquidations more efficient and potentially more profitable for the protocol.Overall, the robust performance of DeFi protocols during the tariff-induced crisis highlights their potential as resilient alternatives to traditional financial systems, especially in times of significant economic stress.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734330&language=en-US",
            "pub_date": "2025-02-05 18:53:10",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734329,
            "title": "Polymarket Bets on Trump Nominee Confirmations, $16.7M in Trades",
            "description": "Polymarket, a popular prediction market platform, has garnered a trading volume of $16.7 million on bets related to the confirmation of President Trump's nominees. According to a report by Odaily, a specific market focusing on \"Which of Trump's nominations will be confirmed?\" has attracted considerable attention and investment.Among the notable confirmations is hedge fund manager Scott Bessent, known for his supportive stance on cryptocurrencies, who has been confirmed as Treasury Secretary. This confirmation has sparked interest among Polymarket users, who are actively betting on the outcomes of several other nominations.Despite the high stakes and interest in the finance sector, notably absent from the list are nominees directly from the cryptocurrency field, such as Paul Atkins, who is tipped to be the chairman of the U.S. Securities and Exchange Commission (SEC). The absence of cryptocurrency-specific nominees in these bets highlights the ongoing separation between traditional financial appointments and the emerging crypto sector in governmental roles.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734329&language=en-US",
            "pub_date": "2025-02-05 18:54:42",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734328,
            "title": "Bitcoin Miners' Revenue Surges 41% to $3.7 Billion Amid BTC Price Boom",
            "description": "Bitcoin miners witnessed a remarkable revenue increase of 41% to $3.7 billion in the last quarter of 2024, as reported by H.C. Wainwright. This growth was largely fueled by Bitcoin's price surge, breaking the $100,000 mark for the first time. The quarter also saw substantial inflows into the spot BTC ETF, totaling $16.7 billion—almost four times the $4.3 billion recorded in the third quarter. Consequently, the average Bitcoin price escalated to $83,432, marking a 36.7% increase from the previous quarter.The mining sector's expansion was notable, with listed miners enhancing their operational capacity by 46 EH/s, raising the total to 235.8 EH/s. The global network hashrate also rose by 17.3% from the third quarter, averaging 738 EH/s, and further climbed to 833 EH/s by early February 2025.The quarter saw a 16.4% increase in Bitcoin production, totaling 11,366 BTC. Transaction fees also surged by 59.4%, reaching 1,553 BTC, contributing to the overall rise in miner revenue. The total market capitalization of listed mining companies grew by 21% to $28 billion, with AI-related miners particularly outperforming.Despite the positive trends, the analyst warned of potential future market fluctuations driven by ongoing trade tensions between major economies like the US, Canada, Mexico, and China. However, any resulting dips in Bitcoin or mining stocks are seen as potential buying opportunities, reflecting a strong start to the first quarter of 2025 with continued high BTC prices and ETF inflows totaling $5.7 billion.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734328&language=en-US",
            "pub_date": "2025-02-05 18:56:24",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734323,
            "title": "Gate.io Launchpool will list ANLOG: Stake GT, USDT, BTC, and ANLOG to get ANLOG airdrops",
            "description": "Odaily Planet Daily News According to the official announcement, Gate.io will open Analog (ANLOG) spot trading at 19:00 (UTC+8) on February 10, 2025. At the same time, Gate.io Launchpool will start the first phase of ANLOG mining at 19:00 (UTC+8) on February 5, 2025, for a period of 5 days. Users who pledge GT and USDT can share more than 21 million ANLOG airdrop rewards every hour. Participating in mining can obtain tokens before the token is launched and grab the first-time bonus. Among them, the USDT novice pool is estimated to be 169.87% annualized, and the minimum pledge is 0.1 USDT. In addition, the second phase of mining will be launched simultaneously with spot trading, supporting users to pledge ANLOG and BTC to earn airdrops, with an estimated annualized return of up to 1216.67%.\nParticipate now and stake USDT and GT to share the ANLOG token airdrop in advance.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734323&language=en-US",
            "pub_date": "2025-02-05 18:38:49",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734322,
            "title": "Bullish Global Considers U.S. IPO in 2025",
            "description": "According to Foresight News, Bullish Global, a cryptocurrency exchange operator, is contemplating an initial public offering (IPO) in the United States this year. The company is reportedly collaborating with Jefferies Financial on the potential listing. Bullish Global is a subsidiary of the blockchain software firm Block.One, which acquired CoinDesk in 2023.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734322&language=en-US",
            "pub_date": "2025-02-05 18:33:32",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}