{
    "data": [
        {
            "id": 733567,
            "title": "Coinbase Urges Regulators to Let Banks Enter the Crypto Market",
            "description": "TL;DR Coinbase asks U.S. regulators to remove barriers that limit banks from offering crypto services, such as custody and trade execution. It requests the withdrawal of an OCC letter that hinders banks from entering the digital asset market and seeks confirmation of the legality of partnerships with third parties. Regulatory changes under the new administration ... \nsource: https://crypto-economy.com/coinbase-urges-regulators-to-let-banks-enter-the-crypto-market/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733567&language=en-US",
            "pub_date": "2025-02-04 22:21:17",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733573,
            "title": "Messari BNB Chain Q4 Report: Market Cap Soars to $101.09B, DeFi TVL Hits $5.35B Amidst 114% Annual Growth",
            "description": "According to Messari Report: In the fourth quarter of 2024, BNB Chain demonstrated significant growth and resilience, underpinned by impressive market cap increases, strategic DeFi expansions, and pivotal technical enhancements. This period marked a transformative phase for the blockchain, solidifying its position as one of the top Layer 1 (L1) blockchains by revenue and innovation.Market Cap and Revenue InsightsBNB's market cap saw a notable rise to $101.09 billion in Q4 2024, marking a 22% increase from the previous quarter and a substantial 114% increase year-over-year (YoY) from $47.31 billion at the beginning of the year. This growth trajectory was bolstered by a crypto market upsurge influenced by the election of U.S. President Donald Trump. BNB's yearly revenue reached a record $234.0 million, driven by increased network activity and adoption across its platforms.DeFi and DEX PerformanceThe Total Value Locked (TVL) in DeFi on BNB Chain grew by 53% YoY to $5.35 billion, with a 10% quarter-over-quarter (QoQ) increase in Q4. The DEX volume also saw a surge, with a 269% YoY increase, where the daily volume in Q4 alone escalated by 122% QoQ, reaching $1.29 billion. PancakeSwap remained a dominant player, contributing significantly to this volume, along with emerging platforms like Uniswap which added to the ecosystem's vibrancy.Technical and Network Developments2024 was a year marked by crucial technical advancements for BNB Chain. The sunset of the BNB Beacon Chain and the adoption of the Builder API Specification were pivotal. These developments aimed to enhance network efficiency, security, and the miner extractable value (MEV) dynamics. By the year's end, 96% of blocks utilized the Builder API, highlighting the widespread adoption of these technical improvements.Adoption of New Technologies and Expansion of Use CasesThe year also saw the integration of new technologies and expansion into various use cases such as decentralized storage through BNB Greenfield and high-performance solutions via opBNB. These components are designed to handle specific needs within the BNB ecosystem, from high transaction throughput to efficient data storage and accessibility, making the blockchain more versatile and user-friendly.Future Projections and DevelopmentsAs BNB Chain moves into 2025, it continues to focus on scaling its infrastructure and enhancing its blockchain capabilities to support more sophisticated applications and meet growing user demand. The ongoing developments in blockchain technology and strategic partnerships are expected to drive further growth and innovation across its network.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733573&language=en-US",
            "pub_date": "2025-02-04 22:29:20",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733571,
            "title": "BTC breaks through 100,000 USDT, up 4.12% in 24 hours",
            "description": "OKX market shows that BTC has broken through 100,000 USDT and is now at 100,016 USDT, with a 24-hour increase of 4.12%. (This newsletter is generated with the assistance of AI)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733571&language=en-US",
            "pub_date": "2025-02-04 22:33:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733572,
            "title": "Bitcoin(BTC) Surpasses 100,000 USDT with a 4.07% Increase in 24 Hours",
            "description": "On Feb 04, 2025, 14:34 PM(UTC). According to Binance Market Data, Bitcoin has crossed the 100,000 USDT benchmark and is now trading at 100,112.320313 USDT, with a narrowed 4.07% increase in 24 hours.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733572&language=en-US",
            "pub_date": "2025-02-04 22:34:35",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733561,
            "title": "Berachain mainnet will be launched on February 6",
            "description": "According to official news, the Berachain mainnet will be launched on February 6, 2025.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733561&language=en-US",
            "pub_date": "2025-02-04 22:10:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733563,
            "title": "BNB Drops Below 580 USDT with a Narrowed 2.30% Increase in 24 Hours",
            "description": "On Feb 04, 2025, 14:12 PM(UTC). According to Binance Market Data, BNB has dropped below 580 USDT and is now trading at 578.52002 USDT, with a narrowed narrowed 2.30% increase in 24 hours.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733563&language=en-US",
            "pub_date": "2025-02-04 22:12:37",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733562,
            "title": "CME Reports Significant Growth In Crypto Contracts Volume",
            "description": "According to CoinDesk, the Chicago Mercantile Exchange Group (CME) has reported a substantial increase in the average daily volume (ADV) of its cryptocurrency contracts for the first month of 2025. The ADV reached 198,000, with a notional value amounting to $13.6 billion. This marks a significant year-over-year growth of 180% in cryptocurrency ADV. Notably, the micro bitcoin (BTC) futures experienced a 255% increase, while micro ether (ETH) futures contracts saw a 223% rise.\n\nThe CME's bitcoin and ether futures contracts have a notional value of 5 BTC and 50 ETH, respectively. However, their micro contracts, representing just 0.1 of each cryptocurrency, offer traders the advantage of more precise trading and risk management due to their smaller size. In addition to these full-sized and micro contracts for the leading cryptocurrencies by market capitalization, the CME provides traders with options on these contracts. These options allow for more complex strategies to fine-tune risk exposure, granting traders the right, but not the obligation, to buy or sell cryptocurrency futures at a predetermined price on or before a specific date.\n\nIn January, the futures exchange recorded a total ADV of 25.7 million contracts. Furthermore, the CME Group recently announced plans to introduce options on Bitcoin Friday Futures (BFF) starting February 24, pending regulatory approval. This move is part of CME's ongoing efforts to expand its offerings and cater to the evolving needs of traders in the cryptocurrency market.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733562&language=en-US",
            "pub_date": "2025-02-04 22:13:40",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733555,
            "title": "Trump's Sovereign Wealth Fund: A Big Deal for Crypto?",
            "description": "Trump’s executive order could open doors for US investments in crypto, though details on funding and operations remain unclear.\nsource: https://dailycoin.com/trumps-sovereign-wealth-fund-a-big-deal-for-crypto/?utm_source=cryptopanic&utm_medium=rss",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733555&language=en-US",
            "pub_date": "2025-02-04 22:05:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733554,
            "title": "Kraken Now Licensed to Offer Crypto Derivatives Across the EU",
            "description": "TL;DR Kraken has obtained a MiFID license in the European Union, allowing it to offer cryptocurrency derivative products in 27 countries within the region. The license was acquired after purchasing a Cyprus-based investment firm, previously approved by the CySEC, facilitating its expansion.  Kraken aims to increase its presence in Europe with products such as cryptocurrency ... \nsource: https://crypto-economy.com/kraken-now-licensed-to-offer-crypto-derivatives-across-the-eu/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733554&language=en-US",
            "pub_date": "2025-02-04 22:05:22",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733553,
            "title": "Bitcoin(BTC) Drops Below 99,000 USDT with a Narrowed 4.45% Increase in 24 Hours",
            "description": "On Feb 04, 2025, 13:59 PM(UTC). According to Binance Market Data, Bitcoin has dropped below 99,000 USDT and is now trading at 98,997.070313 USDT, with a narrowed narrowed 4.45% increase in 24 hours.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733553&language=en-US",
            "pub_date": "2025-02-04 21:59:36",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}