{
    "data": [
        {
            "id": 733912,
            "title": "XRP Ledger Experiences Brief Outage, Resumes Operations",
            "description": "According to PANews, XRP Ledger experienced a rare network disruption, halting block production for about an hour before spontaneously resuming operations. The incident occurred when network activity froze at ledger height 93,927,173, prompting validators to investigate immediately. The network returned to normal without any reported loss of assets or transactions.\n\nDavid Schwartz, XRPL's Chief Technology Officer, commented on the situation via the X platform, stating, \"It appears the consensus mechanism was still operational, but results were not published, leading to network separation. As far as I know, few Unique Node List (UNL) operators made any changes, so the network likely recovered spontaneously.\" The UNL, mentioned by Schwartz, is a crucial component of the XRPL consensus mechanism, serving as a directory of trusted validators to ensure network integrity and transaction finality.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733912&language=en-US",
            "pub_date": "2025-02-05 08:43:34",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733910,
            "title": "Crypto Czar David Sacks: Will issue a statement at an appropriate time to authorize the crypto industry to participate in a series of congressional initiatives",
            "description": "Odaily Planet Daily News Crypto Czar David Sacks said at a press conference in Washington on Tuesday about potential Bitcoin reserves: \"This is one of the first issues we will consider as a working group within the government. We are still waiting for some cabinet members in the working group to be confirmed, so it is still in a very early stage. But this is one of the first issues we will consider.\" When asked how the cryptocurrency industry will participate in the White House's efforts, Sacks said: \"We will issue a statement at some point to authorize some form of contact with the industry.\" Republican lawmakers attended the press conference with Sacks to announce that Congress is forming a bicameral working group to develop cryptocurrency regulations. He met with Republican lawmakers, including Senate Banking Committee Chairman Tim Scott, Senate Agriculture Committee Chairman John Boozman, and House Financial Services Committee Chairman French Hill and House Agriculture Committee Chairman Glenn Thompson. (Bloomberg) Earlier, Crypto Czar David Sacks said that he was studying the feasibility of Bitcoin reserves and could not give any answer to \"whether sovereign wealth funds hold cryptocurrencies.\"",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733910&language=en-US",
            "pub_date": "2025-02-05 08:46:50",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733909,
            "title": "Federal Reserve's Jefferson Advocates Caution Amid Economic Strength",
            "description": "According to Odaily, Federal Reserve Governor Jefferson has stated that there is no immediate need to further cut interest rates, citing the robust economy as a reason for a cautious approach. He anticipates that inflation will continue to decline, although this process may be gradual. In the medium term, interest rates are expected to decrease. The Federal Reserve is currently navigating uncertainties related to government policies, with expectations that economic growth and labor market conditions will remain strong.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733909&language=en-US",
            "pub_date": "2025-02-05 08:33:33",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733903,
            "title": "Yesterday, ARKB had a net inflow of US$56.1 million and GBTC had a net inflow of US$19.5 million",
            "description": "Odaily Planet Daily News According to Farside Investors data, ARKB had a net inflow of US$56.1 million, BITB had a net inflow of US$16.1 million, and GBTC had a net inflow of US$19.5 million yesterday.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733903&language=en-US",
            "pub_date": "2025-02-05 08:34:59",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733902,
            "title": "US Senator Hagerty Introduces \"GENIUS\" Stablecoin Bill",
            "description": "Odaily Planet Daily News U.S. Senator Bill Hagerty has introduced a bill to establish a regulatory framework for stablecoins and bring tokens such as USDT and USDC under the Federal Reserve's rules.\nThe Tennessee Republican said in a statement on February 4 that this stablecoin bill will create \"a safe and growth-friendly regulatory framework to unleash innovation\" and advance President Trump's promise to make the United States the \"capital of the cryptocurrency world.\"\nHagerty's \"Guiding and Establishing the United States Stablecoin National Innovation (GENIUS) Act\" has the support of Senators Tim Scott, Kirsten Gillibrand and Cynthia Lummis.\nHagerty added on X that he looks forward to working with Rep. French Hill and the House Financial Services Committee \"to send it to the president and sign it into law.\"",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733902&language=en-US",
            "pub_date": "2025-02-05 08:38:43",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733901,
            "title": "Spot gold once reached $2,848.25, setting a new record high",
            "description": "Odaily Planet Daily News Spot gold rose by more than $5 in the short term, reaching $2,848.25 at one point, setting a new record high. (Jinshi)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733901&language=en-US",
            "pub_date": "2025-02-05 08:41:17",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733898,
            "title": "MicroStrategy sells preferred shares at 20% discount, pushing investor yield to 10%",
            "description": "MicroStrategy sold preferred stock units last week, a debt-like security with an 8% coupon. The shares were sold at $80 per share, 20% below the market price, effectively pushing the buyer's yield to 10%, a major concession to complete the deal.\nJames Dinsmore, a portfolio manager at Gabelli Funds Inc. who focuses on convertible securities, said: \"I can't remember the last time I saw something so low, and obviously there was some resistance to the initial pricing.\"\nNevertheless, the investor-friendly terms of the deal allowed the company to raise $563 million, more than double its initial target, as co-founder and chairman Michael Saylor is exploring a variety of capital structures to support his Bitcoin buying strategy. This demand shows the market's interest in this asset class, and the company said that although it is more expensive than the ultra-low interest convertible bonds and par stocks previously issued, it can use it to raise up to $2 billion this quarter.\nMicroStrategy did not respond to a request for comment.\n\"A 10% yield is not cheap capital, but I think it's appropriate given the company's profile,\" said David Clott, portfolio manager at Wellesley Asset Management. \"And they won't dilute existing investors like they did with the previous convertible bond issuance. This is a good result for them because they open up a new financing market.\" The plan is part of the company's broader plan to raise $42 billion over three years through a combination of stocks and fixed-income securities, and it is expected to turn to the latter this quarter. This is partly because the company raised nearly $17 billion through its stock sale plan, while it raised much less through convertible bonds. The company currently owns about $47 billion in Bitcoin, accounting for more than 2% of its total. (Bloomberg) Earlier, MicroStrategy announced that it would issue 7,300,000 shares of 8.00% Series A perpetual exercise preferred stock (\"perpetual exercise preferred stock\") on January 30, 2025, with a public offering price of $80.00 per share. The issuance and sale of the perpetually exercisable preferred stock is scheduled to close on February 5, 2025, subject to customary closing conditions.\nMicroStrategy estimates that the net proceeds from the offering, after deducting underwriting discounts and commissions and MicroStrategy's estimated offering expenses, will be approximately $563.4 million. MicroStrategy intends to use the net proceeds from the offering for general corporate purposes, including the acquisition of Bitcoin, and for working capital.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733898&language=en-US",
            "pub_date": "2025-02-05 08:29:56",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733897,
            "title": "Today's Fear and Greed Index dropped to 54, and the level changed from Greedy to Neutral",
            "description": "Odaily Planet Daily News Today's Fear and Greed Index dropped sharply to 54 (yesterday's was 72), and the level changed from greed to neutral.\nNote: The threshold of the Fear Index is 0-100, including indicators: volatility (25%) + market trading volume (25%) + social media heat (15%) + market research (15%) + Bitcoin's proportion in the entire market (10%) + Google hot word analysis (10%).",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733897&language=en-US",
            "pub_date": "2025-02-05 08:11:56",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733896,
            "title": "CFTC reorganizes its enforcement division to refocus on fraud and stop enforcement",
            "description": "Odaily Planet Daily News Caroline Pham, the new acting chairwoman of the U.S. CFTC, said on Tuesday that the regulator has reorganized its enforcement division to \"refocus\" on fraud and \"stop regulating through enforcement.\" \nUnder the leadership of former chairman Rostin Behnam, the CFTC Enforcement Division had several working groups, one of which focused on insider trading, another on cybersecurity and emerging technologies, and a third aimed at combating environmental fraud. The new reorganization reduces the number of working groups to just two. \nThe newly established Complex Fraud Working Group is responsible for handling enforcement work on complex fraud and manipulation across all asset classes, from preliminary investigations to litigation. Deputy Director of Enforcement Paul Hayeck will serve as the acting head of the Complex Fraud Working Group. The Retail Fraud and General Enforcement Working Group will handle retail fraud and general enforcement work, led by Charles Marvine, deputy director of the agency's enforcement division. \n“This streamlined structure will be less regulatory and more efficient in enforcement,” Pham said in a press statement. “These much-needed changes will maximize the CFTC’s resources and take more action to go after fraudsters and other bad actors, rather than punishing good citizens.”\n\nAccording to the CFTC’s announcement, the new structure will “more effectively use the CFTC’s resources to prevent fraud, manipulation, and abuse and ensure market integrity,” as well as “strengthen governance and oversight of enforcement matters to prevent overreach and enhance consistency, fairness, and due process.” (CoinDesk)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733896&language=en-US",
            "pub_date": "2025-02-05 08:16:13",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733895,
            "title": "Marvel's Alleged AI Flub? Fans Spot Odd Hands in New Fantastic Four Poster",
            "description": "Marvel Studios faces backlash online after fans allegedly spot AI-generated hands in the new Fantastic Four poster.\nsource: https://decrypt.co/304440/marvels-alleged-ai-flub-fans-spot-odd-hands-in-new-fantastic-four-poster",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733895&language=en-US",
            "pub_date": "2025-02-05 07:57:30",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}