{
    "data": [
        {
            "id": 733924,
            "title": "U.S. Expected To Pass Cryptocurrency Legislation By November 2025",
            "description": "According to Odaily, Anthony Scaramucci, the founder of SkyBridge Capital, anticipates that the United States will enact cryptocurrency-supportive legislation by November 2025. He suggests that lawmakers often push for favorable regulations before the Christmas recess.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733924&language=en-US",
            "pub_date": "2025-02-05 08:53:40",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733923,
            "title": "Potential Bitcoin Reserves Discussed by Government Task Force",
            "description": "According to Odaily, David Sacks, known as the 'Crypto Czar,' addressed the possibility of Bitcoin reserves during a press conference in Washington on Tuesday. He stated that considering Bitcoin reserves is a primary issue for the government task force he is part of. However, the task force is still in its early stages, awaiting confirmation of some cabinet members. Sacks emphasized that this topic remains a priority.\n\nWhen questioned about the involvement of the cryptocurrency industry in the White House's initiatives, Sacks mentioned that a statement would be released in the future to authorize some form of engagement with the industry.\n\nRepublican lawmakers joined Sacks at the press conference to announce the formation of a bipartisan congressional task force aimed at developing cryptocurrency regulatory frameworks. Sacks met with several Republican legislators, including Senate Banking Committee Chairman Tim Scott, Senate Agriculture Committee Chairman John Boozman, House Financial Services Committee Chairman French Hill, and House Agriculture Committee Chairman Glenn Thompson.\n\nPreviously, Sacks had indicated that the feasibility of Bitcoin reserves was under study, but he could not comment on whether sovereign wealth funds should hold cryptocurrencies.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733923&language=en-US",
            "pub_date": "2025-02-05 08:53:47",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733914,
            "title": "A user sent 20,000 SOL to the PAIN pre-sale wallet yesterday, worth $4.28 million",
            "description": "Odaily Planet Daily News According to Onchain Lens monitoring, a whale sent 20,000 SOL worth $4.28 million directly from its Binance wallet to the PAIN pre-sale wallet yesterday. \nEarlier news, according to SolanaFloor, the Solana chain Meme project PAIN raised 187,774 SOL (US$39.2 million) in a 48-hour pre-sale, making it one of the Meme projects with the largest pre-sale funds.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733914&language=en-US",
            "pub_date": "2025-02-05 08:58:17",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733913,
            "title": "Bahamian FTX creditors seeking up to $50,000 will receive repayments starting February 18",
            "description": "Odaily Planet Daily News According to a statement on Tuesday, during the repayment process in the Bahamas, FTX Digital Markets creditors with claims of up to $50,000 (i.e., Convenience Class creditors) will begin receiving repayments on February 18.\nBased on the value of the claims on November 11, 2022, creditors will receive an annual interest rate of 9%, which is the first time that funds have been repaid to creditors after the company's restructuring and creditor repayment proposals in many years.\nIn November 2024, FTX estate estimated that repayments for creditors with claims of less than $50,000 will begin in March 2025, with an estimated compensation of approximately 118%.\nFTX Digital Market's liquidator PricewaterhouseCoopers has said that non-Convenience Class creditors are expected to receive repayments in the second fiscal quarter of this year, and digital asset custodian BitGo will process these repayments for individuals, institutions and other creditors and send repayments in US dollars. (The Block)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733913&language=en-US",
            "pub_date": "2025-02-05 09:00:48",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733912,
            "title": "XRP Ledger Experiences Brief Outage, Resumes Operations",
            "description": "According to PANews, XRP Ledger experienced a rare network disruption, halting block production for about an hour before spontaneously resuming operations. The incident occurred when network activity froze at ledger height 93,927,173, prompting validators to investigate immediately. The network returned to normal without any reported loss of assets or transactions.\n\nDavid Schwartz, XRPL's Chief Technology Officer, commented on the situation via the X platform, stating, \"It appears the consensus mechanism was still operational, but results were not published, leading to network separation. As far as I know, few Unique Node List (UNL) operators made any changes, so the network likely recovered spontaneously.\" The UNL, mentioned by Schwartz, is a crucial component of the XRPL consensus mechanism, serving as a directory of trusted validators to ensure network integrity and transaction finality.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733912&language=en-US",
            "pub_date": "2025-02-05 08:43:34",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733910,
            "title": "Crypto Czar David Sacks: Will issue a statement at an appropriate time to authorize the crypto industry to participate in a series of congressional initiatives",
            "description": "Odaily Planet Daily News Crypto Czar David Sacks said at a press conference in Washington on Tuesday about potential Bitcoin reserves: \"This is one of the first issues we will consider as a working group within the government. We are still waiting for some cabinet members in the working group to be confirmed, so it is still in a very early stage. But this is one of the first issues we will consider.\" When asked how the cryptocurrency industry will participate in the White House's efforts, Sacks said: \"We will issue a statement at some point to authorize some form of contact with the industry.\" Republican lawmakers attended the press conference with Sacks to announce that Congress is forming a bicameral working group to develop cryptocurrency regulations. He met with Republican lawmakers, including Senate Banking Committee Chairman Tim Scott, Senate Agriculture Committee Chairman John Boozman, and House Financial Services Committee Chairman French Hill and House Agriculture Committee Chairman Glenn Thompson. (Bloomberg) Earlier, Crypto Czar David Sacks said that he was studying the feasibility of Bitcoin reserves and could not give any answer to \"whether sovereign wealth funds hold cryptocurrencies.\"",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733910&language=en-US",
            "pub_date": "2025-02-05 08:46:50",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733909,
            "title": "Federal Reserve's Jefferson Advocates Caution Amid Economic Strength",
            "description": "According to Odaily, Federal Reserve Governor Jefferson has stated that there is no immediate need to further cut interest rates, citing the robust economy as a reason for a cautious approach. He anticipates that inflation will continue to decline, although this process may be gradual. In the medium term, interest rates are expected to decrease. The Federal Reserve is currently navigating uncertainties related to government policies, with expectations that economic growth and labor market conditions will remain strong.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733909&language=en-US",
            "pub_date": "2025-02-05 08:33:33",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733903,
            "title": "Yesterday, ARKB had a net inflow of US$56.1 million and GBTC had a net inflow of US$19.5 million",
            "description": "Odaily Planet Daily News According to Farside Investors data, ARKB had a net inflow of US$56.1 million, BITB had a net inflow of US$16.1 million, and GBTC had a net inflow of US$19.5 million yesterday.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733903&language=en-US",
            "pub_date": "2025-02-05 08:34:59",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733902,
            "title": "US Senator Hagerty Introduces \"GENIUS\" Stablecoin Bill",
            "description": "Odaily Planet Daily News U.S. Senator Bill Hagerty has introduced a bill to establish a regulatory framework for stablecoins and bring tokens such as USDT and USDC under the Federal Reserve's rules.\nThe Tennessee Republican said in a statement on February 4 that this stablecoin bill will create \"a safe and growth-friendly regulatory framework to unleash innovation\" and advance President Trump's promise to make the United States the \"capital of the cryptocurrency world.\"\nHagerty's \"Guiding and Establishing the United States Stablecoin National Innovation (GENIUS) Act\" has the support of Senators Tim Scott, Kirsten Gillibrand and Cynthia Lummis.\nHagerty added on X that he looks forward to working with Rep. French Hill and the House Financial Services Committee \"to send it to the president and sign it into law.\"",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733902&language=en-US",
            "pub_date": "2025-02-05 08:38:43",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733901,
            "title": "Spot gold once reached $2,848.25, setting a new record high",
            "description": "Odaily Planet Daily News Spot gold rose by more than $5 in the short term, reaching $2,848.25 at one point, setting a new record high. (Jinshi)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733901&language=en-US",
            "pub_date": "2025-02-05 08:41:17",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}