{
    "data": [
        {
            "id": 1052216,
            "title": "OpenAI Secures $30 Billion Funding from SoftBank",
            "description": "OpenAI has successfully raised $30 billion in funding, with significant contributions from SoftBank. According to Jin10, this substantial investment underscores the growing interest and confidence in AI technologies and their potential impact on various industries. The funding is expected to accelerate OpenAI's research and development efforts, enabling the company to expand its capabilities and explore new applications for artificial intelligence. This move highlights the increasing collaboration between tech companies and financial institutions, aiming to drive innovation and technological advancement in the AI sector.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052216&language=en-US",
            "pub_date": "2026-02-27 21:35:05",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052215,
            "title": "Lululemon Founder Criticizes Board's Response to Proposed Changes",
            "description": "Chip Wilson, the founder of Lululemon Athletica, has intensified his efforts to implement changes within the yogawear company. Bloomberg posted on X that Wilson expressed dissatisfaction with the current board's reaction to his proposals, describing them as 'weak and insufficient' in a letter addressed to shareholders. Wilson's campaign aims to influence the company's direction and governance, highlighting his concerns over the board's handling of strategic decisions. The founder's letter underscores his commitment to driving improvements and ensuring the brand's continued success in the competitive market.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052215&language=en-US",
            "pub_date": "2026-02-27 21:35:22",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052214,
            "title": "Microsoft's New Funding Unlikely to Affect OpenAI Partnership",
            "description": "Microsoft has announced that its latest round of funding will not alter its existing relationship with OpenAI. According to Jin10, the tech giant emphasized that the new financial developments are independent of its collaboration with the AI research organization. Microsoft has been a significant partner of OpenAI, providing resources and support to advance artificial intelligence technologies. The company reassured stakeholders that the partnership remains strong and focused on mutual goals in AI innovation. This statement comes amid growing interest in AI advancements and strategic partnerships within the tech industry.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052214&language=en-US",
            "pub_date": "2026-02-27 21:36:05",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052213,
            "title": "OpenAI Expands Long-Term Agreement with NVIDIA",
            "description": "OpenAI has announced an expansion of its long-term agreement with NVIDIA, a leading technology company known for its advancements in graphics processing units and artificial intelligence. According to Jin10, this collaboration aims to enhance the capabilities of AI technologies by leveraging NVIDIA's cutting-edge hardware and software solutions. The partnership is expected to drive innovation in AI applications, benefiting various industries by improving computational efficiency and performance. This move underscores the growing importance of strategic alliances in the tech sector to accelerate the development and deployment of AI-driven solutions.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052213&language=en-US",
            "pub_date": "2026-02-27 21:36:20",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052212,
            "title": "An address has increased its holdings of XAUT by 2,000 tokens, worth $10.4 million, through NEAR Intents over the past four days.",
            "description": "According to Lookonchain monitoring, an address (0x83C0...Dc1) transferred 5263 ETH (worth $10.4 million) across chains via NEAR Intents in the past 4 days and exchanged them for 2000 XAUT.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052212&language=en-US",
            "pub_date": "2026-02-27 21:25:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052211,
            "title": "OpenAI and Amazon announced a strategic partnership, with Amazon investing $50 billion in OpenAI.",
            "description": "According to an official announcement from OpenAI, OpenAI and Amazon have announced a multi-year strategic partnership. Amazon will invest $50 billion in OpenAI, with an initial investment of $15 billion and the remaining $35 billion to be completed in the coming months upon fulfillment of certain conditions. The two companies will jointly develop a stateful runtime environment driven by OpenAI models, which will be made available to AWS customers through Amazon Bedrock and is expected to go live in the coming months. AWS will become the exclusive third-party cloud distribution provider for the OpenAI Frontier platform, which allows enterprises to build, deploy, and manage AI agent teams. Regarding infrastructure, the two companies will extend their existing $38 billion multi-year agreement by $100 billion over an eight-year period. OpenAI has committed to using approximately 2 gigawatts of Trainium computing power through AWS infrastructure, covering Trainium3 and the next-generation Trainium4 chip, which is expected to begin shipping in 2027. In addition, OpenAI and Amazon will collaborate to develop custom models for Amazon developers to use in consumer-facing applications, complementing Amazon's existing Nova series of models.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052211&language=en-US",
            "pub_date": "2026-02-27 21:31:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052210,
            "title": "The US PPI rose 0.5% month-on-month in January, below the expected 0.30%; the PPI rose 2.9% year-on-year in January, below the expected 2.60%.",
            "description": "The US January PPI rose 0.5% month-on-month, below the expected 0.30%, and the previous month's figure was revised from 0.50% to 0.4%. The US January January PPI rose 2.9% year-on-year, below the expected 2.60%, and the previous month's figure was 3.00%. (Jinshi)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052210&language=en-US",
            "pub_date": "2026-02-27 21:32:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052206,
            "title": "Argentina's Copper Ambitions Face Legislative and Environmental Challenges",
            "description": "Argentina's president and major global mining companies are eyeing substantial copper reserves, but they face obstacles in the form of icy terrain and stringent regulations. Bloomberg posted on X, highlighting the challenges posed by environmental concerns and legislative hurdles that could impede access to these valuable resources. The potential for copper extraction in Argentina is significant, yet the path to tapping into these riches is fraught with difficulties. The icy rock formations present physical barriers, while the legislative environment demands careful navigation to ensure compliance with environmental standards. As Argentina seeks to capitalize on its copper potential, the balance between economic interests and environmental preservation remains a critical consideration.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052206&language=en-US",
            "pub_date": "2026-02-27 21:20:56",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052205,
            "title": "PRECIOUS METALS | Gold Futures Rise 1% to $5,246.20 per Ounce",
            "description": "Gold futures in New York have seen an increase of 1% during the day, currently priced at $5,246.20 per ounce. According to Jin10, this rise reflects ongoing market dynamics and investor sentiment towards precious metals. The movement in gold prices is closely watched by traders and analysts, as it can indicate broader economic trends and potential shifts in investment strategies.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052205&language=en-US",
            "pub_date": "2026-02-27 21:22:41",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052204,
            "title": "Mutuum Finance Surpasses $150 Million TVL with New Borrowing Features",
            "description": "Mutuum Finance, a decentralized lending and borrowing protocol operating on the Sepolia testnet, has achieved a significant milestone by surpassing $150 million in total value locked (TVL). According to NS3.AI, the platform has introduced innovative Safe-Mode Borrow Presets, allowing users to select predefined risk levels when borrowing, thereby optimizing for either safety or capital efficiency. The project has successfully raised over $20.6 million and is focused on further development as it progresses towards mainnet deployment.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052204&language=en-US",
            "pub_date": "2026-02-27 21:24:37",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052203,
            "title": "Bank of England's Chief Economist Highlights Economic Growth Without Improved Living Standards",
            "description": "The Bank of England's Chief Economist, Huw Pill, has noted that while the UK economy is experiencing growth, this has not translated into improved living standards. According to Jin10, Pill emphasized that despite positive economic indicators, the benefits have not been felt by the general population in terms of enhanced quality of life. This observation comes amid ongoing discussions about the broader implications of economic policies and their impact on everyday citizens. The focus remains on how to ensure that economic growth leads to tangible improvements in living conditions.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052203&language=en-US",
            "pub_date": "2026-02-27 21:26:11",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052183,
            "title": "Hyperliquid Whale Positions Reach $2.891 Billion, Coinglass Data Shows",
            "description": "Hyperliquid platform's whale positions currently total $2.891 billion, according to ChainCatcher. Coinglass data reveals that long positions account for $1.43 billion, representing 49.48% of the total, while short positions amount to $1.46 billion, making up 50.52%. The long positions have incurred a loss of $157 million, whereas the short positions have gained $240 million.\n\nNotably, a whale address, 0xa5b0..41, has taken a 15x leveraged long position on ETH at a price of $1,991.53, resulting in an unrealized loss of $2.3264 million.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052183&language=en-US",
            "pub_date": "2026-02-27 21:13:49",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052202,
            "title": "World Liberty Finance-linked addresses deposited 11.4 million WLFI tokens, worth $1.31 million, into OKX.",
            "description": "According to Onchain Lens monitoring, the World Liberty Finance associated address (0x11ea...4a4e) deposited 11.4 million WLFI tokens, worth $1.31 million, into OKX.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052202&language=en-US",
            "pub_date": "2026-02-27 21:14:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052182,
            "title": "Bank of England Economist Warns Against Complacency Amid Inflation Drop",
            "description": "The Bank of England's Chief Economist, Huw Pill, cautions against complacency due to a temporary decline in overall inflation rates. According to Jin10, Pill emphasizes that the reduction in inflation should not lead to a false sense of security, as it may be driven by one-off factors. He suggests that underlying inflation pressures remain a concern and require careful monitoring. Pill's comments come amid ongoing discussions about the economic outlook and monetary policy adjustments. The Bank of England continues to assess the situation to ensure stability and address potential risks in the financial system.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052182&language=en-US",
            "pub_date": "2026-02-27 21:15:58",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052201,
            "title": "Bitcoin options traders bet $90,000 on a rebound, analysts point to early signs of a market bottom forming.",
            "description": "Data from on-chain derivatives platform Derive shows that Bitcoin options traders are building positions for a rebound to $90,000, early signs that the market may be attempting to bottom out. Sean Dawson, Head of Research at Derive, points out that Bitcoin volatility has fallen back to the 50% range, a level historically associated with consolidation rather than panic selling. The 25-delta skew indicator has rebounded from around -15% in late February to around -7%, suggesting traders are shifting from aggressive defensiveness to a more balanced outlook. Bitcoin options expiring on March 27th currently hold the largest open interest, with significant accumulation of call options at strike prices of $80,000 and $90,000, indicating bulls are positioning for a recovery towards the $85,000 to $95,000 range over the next month. However, there is still significant open interest in put options at strike prices of $60,000 and $55,000. Bitcoin is currently priced at around $84,000, down 3.2% in the past 24 hours. US spot Bitcoin ETFs, which had seen net outflows for four consecutive months, have recorded net inflows exceeding $1 billion in the past three days, including a $254.4 million net inflow on Thursday. BlackRock's IBIT and Bitwise's BITB contributed $275.8 million and $69 million respectively. Binance Research points out that hedging in the options market has reached its most extreme level since the FTX crash, and recent price movements in the crypto market are highly correlated with high-beta tech stocks. Bybit's Chief Market Analyst, Han Tan, stated that the psychological level of $70,000 has continued to suppress bullish sentiment this month, and Bitcoin may record its fifth consecutive month of decline. However, fundamentals remain supportive, and once the macroeconomic environment becomes clearer, fund flows may reverse.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052201&language=en-US",
            "pub_date": "2026-02-27 21:18:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052181,
            "title": "Founders Fund, Pantera, and Franklin Templeton join Sentient's \"Arena\" to stress test enterprise-grade AI agents.",
            "description": "Sentient, an open-source AI lab, has officially launched Arena, a real-time, production-grade environment for global AI developers to stress-test and competitively iterate the inference capabilities of enterprise-grade AI agents. Initial participants include Founders Fund, Pantera, Franklin Templeton (with over $1.5 trillion in assets under management), alphaXiv, Fireworks, OpenHands, and OpenRouter. Arena simulates real-world scenarios in enterprise workflows, including incomplete information, verbose context, ambiguous instructions, and conflicting sources, and records complete inference paths to help engineering teams pinpoint failures. The first challenge focuses on document reasoning, requiring AI agents to reason and compute on complex, unstructured data. Julian Love, Managing Partner of Franklin Templeton Digital Assets, stated that structured environments like Arena will help the industry distinguish between \"potential ideas\" and \"truly production-ready capabilities.\" Himanshu Tyagi, co-founder of Sentient, said that enterprises need to validate the stability and repeatability of agent inference in production environments. Arena will launch globally, with plans to hold in-person events in San Francisco starting in March 2026.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052181&language=en-US",
            "pub_date": "2026-02-27 21:03:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052165,
            "title": "Germany's February Harmonized CPI Annual Rate Falls to 2%",
            "description": "Germany's harmonized consumer price index (CPI) for February showed an annual rate of 2%, according to preliminary data. According to Jin10, this figure is slightly below the expected 2.10% and the previous value of 2.10%. The data indicates a slight decrease in inflationary pressures within the German economy for the month of February. This development may influence the European Central Bank's monetary policy decisions as they monitor inflation trends across the Eurozone.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052165&language=en-US",
            "pub_date": "2026-02-27 21:01:55",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052164,
            "title": "UniCredit Plans Executive Bonus Increase Following Record Profits",
            "description": "UniCredit is preparing to raise bonuses for its senior executives by approximately 15% after achieving record profits. Bloomberg posted on X, highlighting the bank's decision to reward its top management following a successful financial performance. The Italian banking group has seen significant growth, prompting this move to enhance executive compensation. This decision aligns with UniCredit's strategy to retain and motivate its leadership team amid a competitive banking sector. The bonus increase reflects the company's commitment to recognizing the contributions of its executives in driving profitability and growth.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052164&language=en-US",
            "pub_date": "2026-02-27 21:02:26",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052163,
            "title": "STOCKS | S&P 500 Futures Decline, Indicating Monthly Loss",
            "description": "S&P 500 Index futures have decreased by 0.5% as of 7:39 a.m. in New York, suggesting a monthly downturn. Bloomberg posted on X, highlighting the potential for a negative close for the month. This decline reflects ongoing market volatility and investor concerns over economic conditions.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052163&language=en-US",
            "pub_date": "2026-02-27 21:03:34",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052162,
            "title": "Katharine Braddick Appointed as Deputy Governor of Bank of England",
            "description": "Katharine Braddick has been appointed as the next Deputy Governor of the Bank of England, responsible for prudential regulation. According to Jin10, she will also serve as the Chief Executive Officer of the Prudential Regulation Authority. This appointment marks a significant step in the Bank of England's leadership, as Braddick brings extensive experience in financial regulation and policy. Her role will involve overseeing the stability and integrity of the UK's financial system, ensuring that banks and financial institutions operate safely and soundly. This move is part of the government's ongoing efforts to strengthen financial oversight and maintain economic stability.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052162&language=en-US",
            "pub_date": "2026-02-27 21:04:01",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}