{
    "data": [
        {
            "id": 1051567,
            "title": "Mizuho to Implement AI for Workforce Optimization in Japan",
            "description": "Mizuho Financial Group is set to replace approximately 5,000 administrative positions in Japan with artificial intelligence over the next decade. Bloomberg posted on X, highlighting the bank's strategy to enhance productivity as it navigates the evolving financial landscape. As Japan's third-largest lender, Mizuho aims to streamline operations and improve efficiency through technological advancements. This move reflects a broader trend in the banking sector, where institutions are increasingly adopting AI to optimize processes and reduce costs. The transition is part of Mizuho's long-term plan to adapt to changing market demands and maintain competitiveness in the industry.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051567&language=en-US",
            "pub_date": "2026-02-27 13:25:24",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051566,
            "title": "Germany and France Consider New Defense Agreement",
            "description": "Germany and France are exploring a potential new agreement involving Paris sharing its nuclear deterrent capabilities in exchange for Berlin's commitment to joint defense financing. Bloomberg posted on X, highlighting the proposal as a strategic move to enhance European defense collaboration. This initiative aims to strengthen the military partnership between the two nations, addressing evolving security challenges in the region.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051566&language=en-US",
            "pub_date": "2026-02-27 13:25:40",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051565,
            "title": "Labour's Traditional Politics Unlikely to Revive Britain's Government",
            "description": "The Labour Party's potential return to its traditional political strategies may not be sufficient to rejuvenate Britain's government. Bloomberg posted on X, highlighting the challenges faced by the party as it navigates the current political landscape. The Labour Party, historically known for its focus on social welfare and workers' rights, is contemplating a shift back to its roots in an attempt to regain public support.\n\nHowever, the political environment in Britain has evolved significantly, with new issues and voter priorities emerging. The party's traditional approach may not resonate with the modern electorate, which is increasingly concerned with issues such as climate change, digital transformation, and economic inequality.\n\nLabour's leadership is under pressure to adapt its policies to address these contemporary challenges while maintaining its core values. The party's ability to balance these demands will be crucial in determining its future success and influence in British politics.\n\nAs the political landscape continues to shift, Labour's strategy will need to evolve to remain relevant and effective in addressing the needs of the British public.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051565&language=en-US",
            "pub_date": "2026-02-27 13:30:47",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051563,
            "title": "UniSat: Will continue to deepen its involvement in the Bitcoin mainnet ecosystem and advance the development of Ordinals, Runes, and BRC-20 infrastructure.",
            "description": "UniSat stated on social media that it is aware of recent changes in the Bitcoin ecosystem, but the team will continue to focus on the development of the Bitcoin mainnet and increase investment in Ordinals, Runes, and BRC-20 infrastructure. Specific measures include: implementing a 90-day zero-service-fee policy on the UniSat Marketplace starting March 1, 2026; expanding the scope of UniHexa early access invitations and improving on-chain exchange capabilities for BRC-20 and Runes; initiating technical discussions on a BRC-20 single-step transfer scheme; and upgrading the UniSat API to support the MCP architecture for commercial-grade on-chain data services. Furthermore, UniSat plans to purchase at least 500,000 FB tokens in phases to participate in the Fractal standard index service, which will launch in the second quarter, with the first phase of deployment expected to be completed within 15 days.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051563&language=en-US",
            "pub_date": "2026-02-27 13:23:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051562,
            "title": "Bitcoin spot ETFs saw a total net inflow of $254 million yesterday, marking the third consecutive day of net inflows.",
            "description": "According to SoSoValue data, Bitcoin spot ETFs saw a total net inflow of $254 million yesterday (February 26th, Eastern Time). The BlackRock ETF (IBIT) saw the largest single-day net inflow of $276 million, bringing its historical total net inflow to $61.839 billion. The Bitwise ETF (BITB) followed with a net inflow of $69.0102 million, bringing its historical total net inflow to $2.173 billion. Conversely, the Fidelity ETF (FBTC) saw the largest single-day net outflow of $51.4874 million, bringing its historical total net inflow to $10.996 billion. As of press time, the total net asset value of Bitcoin spot ETFs is $85.937 billion, with an ETF net asset ratio (market capitalization as a percentage of Bitcoin's total market capitalization) of 6.38%, and a historical cumulative net inflow of $54.828 billion.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051562&language=en-US",
            "pub_date": "2026-02-27 13:25:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051561,
            "title": "Ethereum spot ETF saw a total net inflow of $6.5742 million yesterday, marking the third consecutive day of net inflows.",
            "description": "According to SoSoValue data, Ethereum spot ETFs saw a total net inflow of $6.5742 million yesterday (February 26th, Eastern Time). The Ethereum spot ETF with the largest single-day net inflow was BlackRock ETF ETHA, with a net inflow of $15.3368 million, bringing its historical total net inflow to $11.876 billion. This was followed by 21Shares ETF TETH, with a net inflow of $7.6081 million, bringing its historical total net inflow to $24.6985 million. The Ethereum spot ETF with the largest single-day net outflow was Fidelity ETF FETH, with a net outflow of $19.2216 million, bringing its historical total net inflow to $2.505 billion. As of press time, the total net asset value of the Ethereum spot ETF is $11.599 billion, the ETF net asset ratio (market capitalization as a percentage of Ethereum's total market capitalization) is 4.75%, and the historical cumulative net inflow has reached $11.648 billion.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051561&language=en-US",
            "pub_date": "2026-02-27 13:26:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051560,
            "title": "Jeff Bezos's $30 Billion AI Lab Seeks Major Industrial Deals",
            "description": "Jeff Bezos has invested $30 billion in an artificial intelligence laboratory that is now seeking substantial deals in the industrial sector. According to Jin10, the lab aims to leverage AI technology to transform various industries by securing partnerships and collaborations worth billions. The initiative reflects Bezos's commitment to advancing AI applications and fostering innovation across different fields. The lab's focus on industrial deals highlights the growing importance of AI in driving efficiency and productivity in traditional sectors. This move is expected to have significant implications for the future of industrial operations and AI integration.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051560&language=en-US",
            "pub_date": "2026-02-27 13:12:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051559,
            "title": "Binance Surpasses $70B In Commodities Trading Volume",
            "description": "Binance has now recorded over $70 billion in trading volume after launching its silver and gold futures. Mere weeks after the launch of the precious metals derivatives trading, the achievement of surpassing $70 billion in trading volume shows that demand for 24/7 on-chain access to gold and silver exposure remains strong.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051559&language=en-US",
            "pub_date": "2026-02-27 13:17:44",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051552,
            "title": "Circle Stock Surges 50% in Two Days – But It's a Short Squeeze, Not a Turnaround",
            "description": "Hedge funds' bearish bets backfire as CRCL whipsaws higher on earnings beat\nsource: https://www.blockhead.co/2026/02/27/circle-stock-surges-50-in-two-days-but-its-a-short-squeeze-not-a-turnaround/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051552&language=en-US",
            "pub_date": "2026-02-27 13:00:57",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051551,
            "title": "Cardano Faces Investor Frustration After 90% Drop – Here Is What Could Happen",
            "description": "\"Cardano is currently experiencing significant investor frustration following a dramatic 90% drop in its value. This steep decline has led many stakeholders to express their concerns and dissatisfaction regarding the cryptocurrency's performance. In light of this challenging situation, we will explore potential outcomes and scenarios that could unfold for Cardano in the coming months, including possibilities for recovery, continued volatility, and the impact of market trends on its future.\"\nsource: https://blocknews.com/cardano-faces-investor-frustration-after-90-drop-here-is-what-could-happen/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051551&language=en-US",
            "pub_date": "2026-02-27 13:04:49",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051539,
            "title": "Stripe Weighs Potential Acquisition of PayPal",
            "description": "Stripe is reportedly exploring a potential acquisition of PayPal as both fintech firms expand into crypto and stablecoin markets.\nsource: https://catenaa.com/markets/cryptocurrencies/stripe-weighs-potential-acquisition-of-paypal/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051539&language=en-US",
            "pub_date": "2026-02-27 13:00:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051550,
            "title": "Hong Kong's Proposal to Withdraw HK$150 Billion Raises Concerns",
            "description": "Hong Kong's government has proposed withdrawing HK$150 billion ($19 billion) from a fund designed to support the currency's peg to the US dollar. Bloomberg posted on X, highlighting that this move has surprised some officials and sparked concerns about the precedent it might establish. The proposal aims to reallocate these funds for other uses, but it has raised questions about the potential impact on the stability of the currency peg. Critics argue that such a withdrawal could undermine confidence in the financial system and set a risky precedent for future financial management decisions. The proposal is still under discussion, and its implications are being closely monitored by financial experts and policymakers.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051550&language=en-US",
            "pub_date": "2026-02-27 13:01:31",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051549,
            "title": "South Korea Approves Google's Map Data Export Application",
            "description": "South Korea has granted approval for Google's application to export map data. According to Jin10, this decision marks a significant development in the tech industry, potentially impacting various sectors reliant on accurate geographical data. The approval allows Google to enhance its mapping services, which could lead to improved navigation and location-based services for users globally. This move is expected to bolster Google's capabilities in providing comprehensive mapping solutions, aligning with its strategic goals to expand its technological offerings.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051549&language=en-US",
            "pub_date": "2026-02-27 13:03:34",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051537,
            "title": "GEOPOLITICS | Analysis of China-US Trade Data Reveals Exaggerated Decoupling Concerns",
            "description": "A significant discrepancy in trade data between China and the United States has puzzled analysts. Bloomberg posted on X, revealing that upon closer examination, the gap suggests that discussions about economic decoupling between the two nations may be overstated. The analysis indicates that while there are tensions and challenges in the bilateral trade relationship, the extent of separation is not as severe as some narratives suggest. This insight comes amid ongoing debates about the future of China-US economic ties and the potential impacts on global markets. The findings underscore the complexity of international trade dynamics and the importance of accurate data interpretation in understanding geopolitical relationships.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051537&language=en-US",
            "pub_date": "2026-02-27 12:57:04",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051536,
            "title": "Block Reduces Operations Amid Stablecoin Settlement Threats",
            "description": "Block is scaling back its operations to levels last seen in 2019, according to CEO Jack Dorsey, who cites AI-driven productivity improvements as a key factor. However, the primary reason seems to be the looming threat of stablecoin settlement, which could significantly cut into the transaction fees that fintech payment processors rely on. According to NS3.AI, this shift indicates a potential transformation in the payments infrastructure, carrying substantial implications for the fintech industry.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051536&language=en-US",
            "pub_date": "2026-02-27 12:59:12",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051535,
            "title": "Green Party Secures Manchester Seat in UK House of Commons",
            "description": "The Green Party has emerged victorious in a special election for a Manchester seat in the House of Commons. Bloomberg posted on X, highlighting the potential challenge this poses to UK Prime Minister Keir Starmer’s Labour Party from the left. This win underscores the growing influence of the Green Party and signals a shift in voter sentiment that could impact future political dynamics in the UK.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051535&language=en-US",
            "pub_date": "2026-02-27 12:59:27",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051534,
            "title": "CZ Responds to Block Layoffs: Embrace AI or Risk Layoffs",
            "description": "Binance founder CZ posted on X, responding to recent news of layoffs at Jack Dorsey's Block. CZ posted that in today's reality, workers should learn to maximize the use of AI, or risk being laid off. CZ was replying to a post by Jack Dorsey, who stated that Block would be reducing its workforce by nearly half.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051534&language=en-US",
            "pub_date": "2026-02-27 13:00:49",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051532,
            "title": "GEOPOLITICS | Iranian Foreign Minister Urges Dialogue Between Afghanistan and Pakistan",
            "description": "Iranian Foreign Minister has called on Afghanistan and Pakistan to resolve their differences through dialogue. According to Jin10, the minister emphasized the importance of diplomatic engagement to address regional tensions. The call for dialogue comes amid ongoing disputes between the two neighboring countries, highlighting the need for peaceful resolution and cooperation. Iran's involvement underscores its interest in promoting stability in the region, as both Afghanistan and Pakistan play crucial roles in regional geopolitics. The minister's appeal reflects Iran's broader diplomatic strategy to foster peace and collaboration among neighboring nations.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051532&language=en-US",
            "pub_date": "2026-02-27 12:41:23",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051531,
            "title": "India's Stock Wealth Gap Raises Concerns Among Investors",
            "description": "Billionaire investor Raamdeo Agrawal has expressed concerns over the widening stock wealth gap in India. Bloomberg posted on X that Agrawal highlighted the growing disparity in stock ownership, which he believes is detrimental to the broader economy. He emphasized the need for more inclusive participation in the stock market to ensure equitable growth and prosperity. Agrawal's remarks come amid ongoing discussions about economic inequality and its impact on India's financial landscape. The investor's comments have sparked a debate on how to address these disparities and promote a more balanced distribution of wealth through stock market participation.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051531&language=en-US",
            "pub_date": "2026-02-27 12:42:48",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051530,
            "title": "Japan's SBI Holdings and Startale Group Announce Launch of Yen-Backed Stablecoin",
            "description": "Japan's SBI Holdings and Startale Group have announced the introduction of a yen-backed stablecoin, JPYSC, aimed at institutional and cross-border applications. According to BlockBeats, the stablecoin is backed by a trust bank and represents Japan's first stablecoin of its kind. SBI Shinsei Trust Bank will oversee its issuance and management in compliance with Japanese digital asset regulations.\n\nSBI VC Trade, a crypto exchange under the SBI Group, will serve as the primary distribution partner, while Startale will lead the technical development. The announcement highlights that JPYSC is designed to enable interoperability with traditional infrastructure and various blockchain networks. The stablecoin is expected to launch in the second quarter of this year, pending regulatory approval.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051530&language=en-US",
            "pub_date": "2026-02-27 12:43:38",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}