{
    "data": [
        {
            "id": 733512,
            "title": "Coinbase Urges U.S. Regulators to Clarify Rules for Crypto Banking Services: Bloomberg",
            "description": "The post Coinbase Urges U.S. Regulators to Clarify Rules for Crypto Banking Services: Bloomberg appeared first on Coinpedia Fintech News\nIn a latest development, Coinbase is reportedly lobbying U.S. banking regulators for more explicit guidelines that would permit banks to provide cryptocurrency custody and trading services. The exchange hopes to drive policy changes that would reduce current...\nsource: https://coinpedia.org/news/coinbase-urges-u-s-regulators-to-clarify-rules-for-crypto-banking-services-bloomberg/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733512&language=en-US",
            "pub_date": "2025-02-04 20:45:23",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733511,
            "title": "Ethereum Whale Dormant for Six Years Deposits $228,600,000 in ETH to Bitfinex Just Before Crash: Lookonchain",
            "description": "Blockchain tracking firm Lookonchain says one savvy trader moved a massive amount of Ethereum (ETH) to a crypto exchange right before the severe market correction. According to Lookonchain, an anonymous trader suddenly woke up after six years to move 77,736 ETH valued at $228.6 million at the time to crypto exchange Bitfinex ahead of Ethereum’s […]\nThe post Ethereum Whale Dormant for Six Years...\nsource: https://dailyhodl.com/2025/02/04/ethereum-whale-dormant-for-six-years-deposits-228600000-in-eth-to-bitfinex-just-before-crash-lookonchain/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733511&language=en-US",
            "pub_date": "2025-02-04 20:45:49",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733510,
            "title": "MicroStrategy’s Bitcoin Veteran Michael Saylor Turns 60",
            "description": "Corporate Bitcoin titan Saylor celebrates his 60th birthday today\nsource: https://u.today/microstrategys-bitcoin-veteran-michael-saylor-turns-60",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733510&language=en-US",
            "pub_date": "2025-02-04 20:48:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733509,
            "title": "5 Promising Meme Coins to Buy as Trump Pauses Canada & Mexico Tariffs",
            "description": "Ethereum and Solana have bounced back into full recovery mode after Donald Trump agreed to temporarily suspend tariffs on Canada and Mexico, signaling bullish times for meme coins.  Since yesterday, $ETH has spiked from $2.5K to $2.7K, and $SOL has rebounded from $183 to $209. Why? Because when global trade tensions ease, traders often feel more confident to invest in riskier assets, like...\nsource: https://www.newsbtc.com/news/5-promising-meme-coins-to-buy/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733509&language=en-US",
            "pub_date": "2025-02-04 20:51:33",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733504,
            "title": "Musk: Some Reddit users threatening DOGE employees is illegal, don't mess with DOGE",
            "description": "Odaily Planet Daily News Elon Musk, head of the U.S. Government Efficiency Department (DOGE), today retweeted a post by X user \"Reddit Lies\". The post exposed that several anonymous Reddit users threatened DOGE department employees, and some of the content even called for extreme actions against them, and hinted at finding their addresses for targeted actions. Musk retweeted the post and said: \"They (the relevant Reddit users) have violated the law.\" Soon after, Musk issued a statement from Edward R. Martin Jr., the U.S. Attorney for the District of Columbia. The statement stated that the judicial department had conducted a preliminary review of the relevant evidence and found that individuals and groups had clearly threatened DOGE employees. At present, the department is working closely with the FBI and other law enforcement agencies, and has initiated prosecutorial procedures. Musk commented on the article: \"Don't mess with DOGE.\"",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733504&language=en-US",
            "pub_date": "2025-02-04 20:42:17",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733505,
            "title": "UK Faces Trade Dilemma Amid Global Tensions",
            "description": "According to BlockBeats, on February 4, economists from Pantheon Macroeconomics reported that the United Kingdom might have to choose sides between the United States and Europe in ongoing trade conflicts, even if it avoids direct tariffs from the U.S. The UK's economy is significantly exposed to global trade disruptions, with imports and exports comprising 64% of its GDP. In light of potential fiscal stimulus responses from other countries, the UK may need to take U.S. President Donald Trump's other threats more seriously, including tax cuts and immigration policies that could drive inflation. These actions by Trump are expected to have a hawkish impact on UK policy.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733505&language=en-US",
            "pub_date": "2025-02-04 20:44:22",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733493,
            "title": "ETH breaks through 2800 USDT, up 6.97% in 24 hours",
            "description": "OKX market shows that ETH has broken through 2800 USDT and is now at 2800.49 USDT, with a 24-hour increase of 6.97%. (This newsletter is generated by AI)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733493&language=en-US",
            "pub_date": "2025-02-04 20:32:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733497,
            "title": "Ethereum(ETH) Surpasses 2,800 USDT with a 7.12% Increase in 24 Hours",
            "description": "On Feb 04, 2025, 12:33 PM(UTC). According to Binance Market Data, Ethereum has crossed the 2,800 USDT benchmark and is now trading at 2,803.01001 USDT, with a narrowed 7.12% increase in 24 hours.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733497&language=en-US",
            "pub_date": "2025-02-04 20:33:37",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733496,
            "title": "India Reconsiders Crypto Policy Amid Global Shifts",
            "description": "According to ShibDaily, India is reevaluating its cryptocurrency policy in response to changing global perspectives, particularly following U.S. President Donald Trump's executive order on digital assets. This order has initiated regulatory discussions in various countries. India is currently reviewing a discussion paper on crypto regulation, which was initially scheduled for release in September 2024 but was postponed due to other priorities. The existing regulations in India focus on anti-money laundering and electronic fund transfers, lacking specific policies for cryptocurrencies.\n\nAjay Seth, the Economic Affairs Secretary, highlighted the cross-border nature of digital assets, stressing that India cannot make unilateral decisions. He noted that several jurisdictions have altered their stance on cryptocurrency usage and acceptance, prompting India to revisit the discussion paper. A panel led by the Department of Economic Affairs Secretary plans to release a consultation paper on crypto regulations by March 2025. This paper aims to collect feedback from stakeholders to develop a regulatory framework for virtual digital assets (VDAs).\n\nDespite these developments, India is tightening its crypto tax regulations. Crypto traders in the country may face significant fines for undeclared earnings due to recent changes in tax laws. In the Union Budget 2025, Finance Minister Nirmala Sitharaman announced that digital assets would be included under Section 158B of the Income Tax Act, which deals with undisclosed income. This amendment subjects unreported crypto profits to block assessments, similar to traditional assets like money, jewelry, and precious metals. The new tax regulations, effective retroactively from February 1, 2025, also classify crypto as a Virtual Digital Asset (VDA), requiring disclosure in line with Section 285BAA of the Income Tax Act.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733496&language=en-US",
            "pub_date": "2025-02-04 20:36:08",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733495,
            "title": "Russia Proposes Using Surplus Electricity For Crypto Mining",
            "description": "According to ShibDaily, Russia's Deputy Prime Minister Yuri Trutnev has proposed utilizing surplus electricity in the Far East for cryptocurrency mining. During a meeting focused on energy development in the Far Eastern Federal District, Trutnev suggested that transforming the region into a crypto mining hub could address the issue of excess electricity. He argued that maintaining energy reserves is expensive, and using the surplus for crypto mining could help offset these costs. This approach would also ensure a more productive use of the surplus energy.\n\nTrutnev highlighted the importance of proactive capacity planning to support the growing number of investment projects in the Far East. To prevent these projects from being underutilized, he proposed using the region's surplus energy for cryptocurrency mining rather than letting it go to waste. This strategy aims to address both energy management and regional development goals. Trutnev stated, \"The task is very simple: we need to provide all investment projects – both those already being implemented and those that will be created in the Far East – with electricity on time and at the most affordable prices.\"\n\nHe instructed the Ministry for the Development of the Russian Far East, the Far Eastern Development Committee, and local authorities to gather and submit data to the Russian government and the Ministry of Energy. This data should outline electricity requirements and identify the necessary infrastructure for new power generation facilities to meet the region's growing demand.\n\nRussia's interest in cryptocurrency has been gaining momentum, with increased discussions and initiatives aimed at integrating digital assets into the economy. Recently, Rosseti, Russia's leading energy provider, began exploring the potential for crypto mining by utilizing surplus electricity from low-demand power plants. The company is considering establishing mining centers across the country to harness this unused energy, offering discounted electricity tariffs to attract cryptocurrency miners to low-demand regions. Additionally, Rosseti is implementing a power management system to monitor and regulate energy consumption, ensuring efficient usage while tapping into surplus electricity for mining operations.\n\nFurthermore, Russia has been taking steps to tighten control over cryptocurrency mining. President Vladimir Putin signed a law transferring the responsibility of overseeing mining operations to the Federal Tax Service (FTS). The law also imposed stricter regulations on mining locations to address concerns about power shortages caused by mining activities. These measures aim to regulate and monitor the industry more effectively while mitigating the impact on the country's energy infrastructure.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733495&language=en-US",
            "pub_date": "2025-02-04 20:36:29",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}