{
    "data": [
        {
            "id": 733493,
            "title": "ETH breaks through 2800 USDT, up 6.97% in 24 hours",
            "description": "OKX market shows that ETH has broken through 2800 USDT and is now at 2800.49 USDT, with a 24-hour increase of 6.97%. (This newsletter is generated by AI)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733493&language=en-US",
            "pub_date": "2025-02-04 20:32:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733497,
            "title": "Ethereum(ETH) Surpasses 2,800 USDT with a 7.12% Increase in 24 Hours",
            "description": "On Feb 04, 2025, 12:33 PM(UTC). According to Binance Market Data, Ethereum has crossed the 2,800 USDT benchmark and is now trading at 2,803.01001 USDT, with a narrowed 7.12% increase in 24 hours.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733497&language=en-US",
            "pub_date": "2025-02-04 20:33:37",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733496,
            "title": "India Reconsiders Crypto Policy Amid Global Shifts",
            "description": "According to ShibDaily, India is reevaluating its cryptocurrency policy in response to changing global perspectives, particularly following U.S. President Donald Trump's executive order on digital assets. This order has initiated regulatory discussions in various countries. India is currently reviewing a discussion paper on crypto regulation, which was initially scheduled for release in September 2024 but was postponed due to other priorities. The existing regulations in India focus on anti-money laundering and electronic fund transfers, lacking specific policies for cryptocurrencies.\n\nAjay Seth, the Economic Affairs Secretary, highlighted the cross-border nature of digital assets, stressing that India cannot make unilateral decisions. He noted that several jurisdictions have altered their stance on cryptocurrency usage and acceptance, prompting India to revisit the discussion paper. A panel led by the Department of Economic Affairs Secretary plans to release a consultation paper on crypto regulations by March 2025. This paper aims to collect feedback from stakeholders to develop a regulatory framework for virtual digital assets (VDAs).\n\nDespite these developments, India is tightening its crypto tax regulations. Crypto traders in the country may face significant fines for undeclared earnings due to recent changes in tax laws. In the Union Budget 2025, Finance Minister Nirmala Sitharaman announced that digital assets would be included under Section 158B of the Income Tax Act, which deals with undisclosed income. This amendment subjects unreported crypto profits to block assessments, similar to traditional assets like money, jewelry, and precious metals. The new tax regulations, effective retroactively from February 1, 2025, also classify crypto as a Virtual Digital Asset (VDA), requiring disclosure in line with Section 285BAA of the Income Tax Act.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733496&language=en-US",
            "pub_date": "2025-02-04 20:36:08",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733495,
            "title": "Russia Proposes Using Surplus Electricity For Crypto Mining",
            "description": "According to ShibDaily, Russia's Deputy Prime Minister Yuri Trutnev has proposed utilizing surplus electricity in the Far East for cryptocurrency mining. During a meeting focused on energy development in the Far Eastern Federal District, Trutnev suggested that transforming the region into a crypto mining hub could address the issue of excess electricity. He argued that maintaining energy reserves is expensive, and using the surplus for crypto mining could help offset these costs. This approach would also ensure a more productive use of the surplus energy.\n\nTrutnev highlighted the importance of proactive capacity planning to support the growing number of investment projects in the Far East. To prevent these projects from being underutilized, he proposed using the region's surplus energy for cryptocurrency mining rather than letting it go to waste. This strategy aims to address both energy management and regional development goals. Trutnev stated, \"The task is very simple: we need to provide all investment projects – both those already being implemented and those that will be created in the Far East – with electricity on time and at the most affordable prices.\"\n\nHe instructed the Ministry for the Development of the Russian Far East, the Far Eastern Development Committee, and local authorities to gather and submit data to the Russian government and the Ministry of Energy. This data should outline electricity requirements and identify the necessary infrastructure for new power generation facilities to meet the region's growing demand.\n\nRussia's interest in cryptocurrency has been gaining momentum, with increased discussions and initiatives aimed at integrating digital assets into the economy. Recently, Rosseti, Russia's leading energy provider, began exploring the potential for crypto mining by utilizing surplus electricity from low-demand power plants. The company is considering establishing mining centers across the country to harness this unused energy, offering discounted electricity tariffs to attract cryptocurrency miners to low-demand regions. Additionally, Rosseti is implementing a power management system to monitor and regulate energy consumption, ensuring efficient usage while tapping into surplus electricity for mining operations.\n\nFurthermore, Russia has been taking steps to tighten control over cryptocurrency mining. President Vladimir Putin signed a law transferring the responsibility of overseeing mining operations to the Federal Tax Service (FTS). The law also imposed stricter regulations on mining locations to address concerns about power shortages caused by mining activities. These measures aim to regulate and monitor the industry more effectively while mitigating the impact on the country's energy infrastructure.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733495&language=en-US",
            "pub_date": "2025-02-04 20:36:29",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733477,
            "title": "DMG Blockchain Reports January Bitcoin Mining Output",
            "description": "According to PANews, DMG Blockchain has released its operational report for January 2025. The report reveals that the company mined 31 Bitcoins during the month, bringing its total Bitcoin holdings to 431.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733477&language=en-US",
            "pub_date": "2025-02-04 20:24:01",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733476,
            "title": "THORChain approves conversion of $200M debt into equity tokens",
            "description": "THORChain node operators have approved a restructuring plan allowing it to convert its $200M debt into equity tokens. The move is aimed at stabilizing THORChain’s operations by addressing its liabilities. THORChain (RUNE) price rose 13.7% after the news but remains down 72.7% over the past month. THORChain node operators have approved a restructuring plan proposal […]\nThe post THORChain...\nsource: https://coinjournal.net/news/thorchain-approves-conversion-of-200m-debt-into-equity-tokens/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733476&language=en-US",
            "pub_date": "2025-02-04 20:10:21",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733475,
            "title": "Ethereum Price to Hit $18K by September 2025, Analyst Predicts",
            "description": "Ethereum (ETH) price continues to capture market attention, with a bold price forecast of $18,000 by September 2025. Market analyst @best_analysts has outlined this projection based on Ethereum’s ascending price channel. In fact, consistent institutional interest and the broader crypto market trends have added to the projections. Despite recent volatility, Ethereum has remained within a...\nsource: https://www.thecoinrepublic.com/2025/02/04/ethereum-price-to-hit-18k-by-september-2025-analyst-predicts/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733475&language=en-US",
            "pub_date": "2025-02-04 20:11:08",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733474,
            "title": "Can XRP hit $6 amid the market’s current recovery wave?",
            "description": "XRP is staging a comeback after a sharp selloff, despite ongoing market uncertainty. The cryptocurrency has struggled following a broader … Continue reading\nThe post Can XRP hit $6 amid the market’s current recovery wave? appeared first on Finbold.\nsource: https://finbold.com/can-xrp-hit-6-amid-the-markets-current-recovery-wave/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733474&language=en-US",
            "pub_date": "2025-02-04 20:11:19",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733473,
            "title": "Bitcoin (BTC) Rejection at $100,000 Triggers $527 Million in Crypto Liquidations",
            "description": "Crypto liquidations jumped to $527 million as bears swoop into Bitcoin market\nsource: https://u.today/bitcoin-btc-rejection-at-100000-triggers-527-million-in-crypto-liquidations",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733473&language=en-US",
            "pub_date": "2025-02-04 20:12:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733472,
            "title": "Pro-Crypto Regulation Expected In The U.S. By November, Says Scaramucci",
            "description": "According to CoinDesk, Anthony Scaramucci, who briefly served as U.S. President Donald Trump's communications director in 2017, anticipates the drafting of pro-crypto regulations in the United States by November. Scaramucci, the founder of SkyBridge Capital, shared his prediction during the Digital Assets Forum in London and elaborated on his views in an interview with the Financial Times. He explained that members of Congress, who face re-election every two years, may seek to avoid opposition from the crypto industry by advocating for positive crypto regulations. With campaign preparations needing to start by March 2026, Scaramucci believes that pro-crypto legislation will likely be part of the legislative flurry before the congressional Christmas recess, suggesting a November timeline for its introduction.During his presidential campaign, Trump had promised to be a pro-crypto leader and subsequently issued an executive order to establish policies supporting digital assets in the U.S. Despite his natural inclination to support any administration that advances such policies, Scaramucci has been a vocal critic of Trump, describing him as \"insane\" and \"unwell\" in the interview. Scaramucci also commented on Trump's official memecoin, TRUMP, labeling it as detrimental to the industry. The coin experienced a significant price spike to nearly $73 following its launch on January 18 but has since plummeted by over 76%. Scaramucci expressed concerns that TRUMP could damage the industry's reputation by making it appear fraudulent. However, he acknowledged that the memecoin demonstrated the capabilities of the Solana blockchain, as the substantial trading activity served as a stress test for potential tokenization of bonds or stocks. He noted that while he does not favor memecoins, they can be beneficial in testing blockchain systems.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733472&language=en-US",
            "pub_date": "2025-02-04 20:07:32",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}