{
    "data": [
        {
            "id": 1053973,
            "title": "An Iranian Foreign Ministry spokesman said Iran's Supreme Leader and President are \"safe and sound.\"",
            "description": "Iranian Foreign Ministry spokesman Baghae said on the evening of February 28 that Iran's Supreme Leader Khamenei and President Pezechzian were both \"safe and sound.\" Baghae made this statement in separate interviews with ABC and Sky News.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053973&language=en-US",
            "pub_date": "2026-03-01 06:02:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053969,
            "title": "Cardano Faces Selling Pressure Amid Tightening Range",
            "description": "Cardano's price is currently consolidating within a narrowing range, experiencing ongoing selling pressure. According to NS3.AI, this is evident in the Money Flow Index and futures market data. Long-term holders are playing a crucial role by retaining older coins, which is helping ADA maintain the 13.6% Fibonacci retracement support around $0.256. If this support level fails, Cardano could see further declines toward $0.239. Conversely, a successful defense might lead to a rebound, testing resistance near $0.295.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053969&language=en-US",
            "pub_date": "2026-03-01 06:02:07",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053972,
            "title": "A huge explosion was heard in Tel Aviv, Israel.",
            "description": "A massive explosion was heard in Tel Aviv, Israel, on the 28th local time. It is reported that a missile crashed in Tel Aviv.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053972&language=en-US",
            "pub_date": "2026-03-01 06:03:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053971,
            "title": "The Iranian Islamic Revolutionary Guard Corps issued a statement saying that there were numerous US military casualties in Kuwait.",
            "description": "At 1:00 AM local time on March 1st, the Iranian Islamic Revolutionary Guard Corps (IRGC) issued Announcement No. 4. The announcement stated that in the fifth wave of \"True Commitment 4,\" a US warship transporting ammunition in Jebel Ali, UAE, was attacked by four drones, losing power and exploding. Additionally, a US naval base in Kuwait was attacked by four ballistic missiles and twelve drones, destroying all infrastructure and causing numerous US casualties. Furthermore, an MST-class combat support ship transporting fuel in the Indian Ocean was attacked by Iranian missiles. The IRGC's public relations department also announced that the Prince Sultan Air Base in Saudi Arabia was targeted by Iranian missiles and drones. The IRGC also announced that the Khalil military base in Iraq was attacked by missiles. The IRGC stated that US special forces and commandos are stationed at this base.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053971&language=en-US",
            "pub_date": "2026-03-01 06:04:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053966,
            "title": "BREAKING: US President Donald Trump Confirms Death of Iran’s Supreme Leader Khamenei",
            "description": "According to breaking news, US President Donald Trump has confirmed the death of Iranian religious leader Ali Khamenei. Trump made the following statement: “Khamenei is dead, now is Iran’s greatest chance to reclaim its country. ” Continue Reading: BREAKING: US President Donald Trump Confirms Death of Iran’s Supreme Leader Khamenei\nsource: https://en.bitcoinsistemi.com/breaking-us-president-donald-trump-confirms-death-of-iran-s-supreme-leader-khamenei/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053966&language=en-US",
            "pub_date": "2026-03-01 05:41:05",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053961,
            "title": "GEOPOLITICS | U.S. President Trump Comments on Iranian Forces' Alleged War Fatigue",
            "description": "U.S. President Donald Trump has stated that he has heard reports suggesting that many members of Iran's Islamic Revolutionary Guard Corps, military, and other security and police forces are reportedly weary of conflict and are seeking exemptions from the United States. According to Jin10, these remarks come amid ongoing tensions between the U.S. and Iran, highlighting the complex geopolitical dynamics in the region. The situation remains fluid as both nations navigate their diplomatic and military strategies.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053961&language=en-US",
            "pub_date": "2026-03-01 05:39:51",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053960,
            "title": "Military Strikes on Iran Lead to Significant Trading on Polymarket",
            "description": "Military actions by the United States and Israel against Iran over the weekend have led to a surge in trading activity on Polymarket, a prediction market platform. Bloomberg posted on X that contracts related to the timing of these strikes saw a trading volume of $529 million. This development highlights the intersection of geopolitical events and financial markets, as traders sought to capitalize on the unfolding situation.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053960&language=en-US",
            "pub_date": "2026-03-01 05:45:31",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053950,
            "title": "GEOPOLITICS | Iran's Revolutionary Guard Announces New Wave of Attacks",
            "description": "Iran's Revolutionary Guard has declared plans to initiate a new series of attacks aimed at 'expanding and deepening the war.' According to Jin10, this announcement signals a potential escalation in regional tensions. The move comes amid ongoing geopolitical conflicts, raising concerns about the stability in the Middle East. The Revolutionary Guard's statement did not specify the targets or the timeline for these attacks, leaving the international community on high alert. Observers are closely monitoring the situation for further developments.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053950&language=en-US",
            "pub_date": "2026-03-01 05:28:17",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053949,
            "title": "European Union Utilizes Minipigs to Strengthen Biotech Sector",
            "description": "Minipigs are becoming increasingly significant in the European Union's efforts to bolster its biotech industry. Bloomberg posted on X, highlighting their ease of breeding and cost-effectiveness as major advantages. These animals are being integrated into research and development processes, contributing to the EU's goal of enhancing resilience in the biotech sector. The use of minipigs is seen as a strategic move to advance scientific research and innovation within the region.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053949&language=en-US",
            "pub_date": "2026-03-01 05:30:29",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053948,
            "title": "UN Secretary-General Regrets Missed Diplomatic Opportunities on Iran Issue",
            "description": "The United Nations Secretary-General has expressed deep regret over the missed diplomatic opportunities concerning the Iran issue. According to ChainCatcher, the Secretary-General also addressed recent reports, clarifying that there is no confirmation regarding the death of Iran's Supreme Leader Ayatollah Ali Khamenei.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053948&language=en-US",
            "pub_date": "2026-03-01 05:33:36",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053947,
            "title": "President Trump's Approach to Iran Raises Concerns Over Trust",
            "description": "U.S. President Donald Trump's recent actions towards Iran have sparked debate over the level of trust he expects from the American public and the international community. New York Times posted on X, highlighting the editorial board's perspective that President Trump is demanding blind trust without having earned it. The board argues that such an approach could have significant implications for U.S. foreign policy and global relations. The editorial suggests that transparency and accountability are crucial in maintaining trust and credibility on the world stage. As tensions with Iran continue, the need for clear communication and justified actions becomes increasingly important.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053947&language=en-US",
            "pub_date": "2026-03-01 05:35:30",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053946,
            "title": "GEOPOLITICS | Iranian Drone Attack Prompts Evacuation at Dubai International Airport",
            "description": "An Iranian drone attack has reportedly targeted Dubai International Airport, leading to evacuation efforts. According to Jin10, the incident has raised concerns about regional security and the potential impact on international travel. Authorities are currently managing the situation, ensuring the safety of passengers and staff. The geopolitical tensions in the region continue to escalate, affecting various sectors, including aviation and tourism.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053946&language=en-US",
            "pub_date": "2026-03-01 05:18:48",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053945,
            "title": "U.S. Payroll Growth Expected to Moderate in February",
            "description": "U.S. payroll growth is anticipated to have slowed in February following a robust hiring surge in the previous month. Bloomberg posted on X, indicating that the labor market is likely returning to a more sustainable pace. This adjustment comes after the strongest month of hiring in a year, suggesting a stabilization in employment trends. The moderation in job growth reflects a potential balance in the labor market, aligning with broader economic conditions.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053945&language=en-US",
            "pub_date": "2026-03-01 05:19:24",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053944,
            "title": "Polymarket Data Shows Surge in Probability of Khamenei Stepping Down",
            "description": "The probability of Iranian Supreme Leader Ayatollah Ali Khamenei stepping down by March 31 has sharply increased, according to Polymarket data. According to ChainCatcher, the likelihood of this event occurring has surged to 93%, marking an 85 percentage point rise. The total market trading volume has reached $30.43 million.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053944&language=en-US",
            "pub_date": "2026-03-01 05:23:40",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053943,
            "title": "Gulf Nations to Convene Following Iranian Attack",
            "description": "Gulf countries are set to hold a meeting tomorrow in response to a recent attack by Iran. According to Jin10, the gathering aims to address the implications of the incident and discuss potential measures to ensure regional stability. The attack has heightened tensions in the area, prompting leaders to seek collaborative solutions. The meeting underscores the urgency of addressing security concerns and fostering diplomatic dialogue among the affected nations.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053943&language=en-US",
            "pub_date": "2026-03-01 05:24:09",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053936,
            "title": "Oil holds as Khamenei death reports, 'Epic Fury' cited",
            "description": "Officials detail conflicting reports on Ayatollah Ali Khamenei death as CENTCOM shares 'Operation Epic Fury' footage; analysis outlines Iran’s succession rules.\nsource: https://coincu.com/news/oil-holds-as-khamenei-death-reports-epic-fury-cited/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053936&language=en-US",
            "pub_date": "2026-03-01 05:03:13",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053935,
            "title": "Bitcoin's Future Price Influenced by AI's Economic Impact",
            "description": "Bitcoin's future price trajectory is increasingly influenced by artificial intelligence's impact on economic growth, employment, interest rates, and central bank liquidity, according to NS3.AI. NYDIG Research highlights that AI-related job disruptions may affect real interest rates and liquidity conditions, indirectly fueling demand for Bitcoin. This represents a shift from Bitcoin's traditional reliance on technological factors to broader macroeconomic influences associated with AI development.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053935&language=en-US",
            "pub_date": "2026-03-01 05:07:15",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053932,
            "title": "SpaceX Plans for Potential Record-Breaking IPO in June",
            "description": "SpaceX, led by Elon Musk, is reportedly preparing to file for an initial public offering (IPO) with the U.S. Securities and Exchange Commission in March, aiming for a June listing. According to Ming Pao, the company is targeting a valuation exceeding $1.75 trillion, potentially surpassing the record set by Saudi Aramco's $1.7 trillion valuation during its 2019 IPO. The anticipated fundraising amount could reach $50 billion, which would also exceed Saudi Aramco's previous record of $25.6 billion.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053932&language=en-US",
            "pub_date": "2026-03-01 05:00:29",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053931,
            "title": "Market Financial Solutions Bankruptcy Raises Concerns in Private Credit Sector",
            "description": "Market Financial Solutions (MFS), a UK mortgage company, entered bankruptcy proceedings last Wednesday. According to Ming Pao, creditors allege that MFS used the same asset as collateral for multiple loans, potentially creating a collateral shortfall of £930 million. This situation has heightened concerns about the private credit sector. Last Friday, shares of several asset management companies involved in private credit fell. Apollo Global Management, which has a £400 million exposure to MFS, saw its stock drop by 8.57%. Additionally, investment bank Jefferies reportedly has a £100 million exposure, resulting in a 9.31% decline in its stock price.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053931&language=en-US",
            "pub_date": "2026-03-01 05:00:39",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053930,
            "title": "Bill Clinton Denies Knowledge of Epstein's Crimes at Hearing",
            "description": "Former U.S. President Bill Clinton appeared before the House Oversight Committee last Friday, February 27, to address allegations related to the late Jeffrey Epstein. According to Ming Pao, Clinton stated he was unaware of Epstein's criminal activities. He shared his opening remarks on social media platform X, countering speculation about his presence in photos with women mentioned in Department of Justice documents. Clinton asserted, \"I saw nothing and did nothing wrong,\" and claimed that had he known about Epstein's crimes, he would have avoided traveling on Epstein's plane and reported him, citing his zero tolerance for such crimes due to his upbringing in a domestic violence environment.\n\nClinton's wife, former Secretary of State Hillary Clinton, attended the same hearing a day earlier, where she denied any association with Epstein. The hearing was briefly disrupted when a Republican leaked photos from the session, causing confusion.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053930&language=en-US",
            "pub_date": "2026-03-01 05:02:06",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}