{
    "data": [
        {
            "id": 1053829,
            "title": "GEOPOLITICS | Tensions Rise in Gulf Amid Iran-US-Israel Conflict",
            "description": "An unidentified projectile was seen streaking across the sky over Dubai Marina on February 28, as tensions in the Gulf region escalate due to the ongoing conflict involving Iran, the United States, and Israel. Bloomberg posted on X, highlighting the intensifying situation across the Gulf. The incident underscores the growing instability in the region, with geopolitical dynamics becoming increasingly complex. Observers are closely monitoring developments as the conflict continues to unfold, raising concerns about potential impacts on regional security and international relations.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053829&language=en-US",
            "pub_date": "2026-03-01 02:25:38",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053828,
            "title": "GEOPOLITICS | Ukraine Expresses Solidarity Against Iran's Actions",
            "description": "Ukraine's Foreign Minister has declared the country's solidarity with Bahrain, Iraq, Jordan, Kuwait, Qatar, Saudi Arabia, and the United Arab Emirates in opposition to Iran's aggressive actions. According to Jin10, this statement underscores Ukraine's stance against what it perceives as reckless attacks by Iran. The move highlights the geopolitical tensions in the region and Ukraine's alignment with these Middle Eastern nations in response to Iran's activities.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053828&language=en-US",
            "pub_date": "2026-03-01 02:31:54",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053822,
            "title": "GEOPOLITICS | Reports Suggest Possible Elimination of Iran's Supreme Leader Khamenei",
            "description": "A security source has indicated that there are increasing signs suggesting the elimination of Iran's Supreme Leader Ayatollah Ali Khamenei in an initial strike. According to Jin10, further confirmation is required to verify these claims. The situation remains tense as geopolitical implications could arise from such a development. Observers are closely monitoring the situation for any official statements or additional evidence that may emerge.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053822&language=en-US",
            "pub_date": "2026-03-01 02:20:11",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053814,
            "title": "Six Trillion In the Dark: Has Canton Redrawn Crypto’s Map?",
            "description": "The “flippening” of finance may have already taken place out of sight of most investors - on Canton, a closed, bank-grade infra.\nsource: https://dailycoin.com/six-trillion-in-the-dark-has-canton-network-redrawn-cryptos-map/?utm_source=cryptopanic&utm_medium=rss",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053814&language=en-US",
            "pub_date": "2026-03-01 02:04:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053813,
            "title": "Stablecoin Market Shifts Focus to User Experience and Distribution",
            "description": "The stablecoin market is undergoing a transformation as the industry matures, moving away from profit strategies centered on arbitrage and trading. According to NS3.AI, the competitive advantage for stablecoins now lies in fostering strong user relationships and expanding distribution networks. This perspective was shared by the creator of Meta's discontinued Diem project, emphasizing a new focus on improving user experience and payment integration.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053813&language=en-US",
            "pub_date": "2026-03-01 02:07:07",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053812,
            "title": "UK Prime Minister Engages in Phone Call with Qatar Emir",
            "description": "UK Prime Minister Keir Starmer held a phone conversation with the Emir of Qatar this afternoon. According to Jin10, the discussion focused on strengthening bilateral relations and exploring opportunities for collaboration between the two nations. The leaders emphasized the importance of mutual cooperation in various sectors, aiming to enhance economic and diplomatic ties. This engagement reflects the ongoing efforts to foster international partnerships and address shared challenges.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053812&language=en-US",
            "pub_date": "2026-03-01 02:08:51",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053811,
            "title": "UK Prime Minister Expresses Concern Over Attacks on Qatar and Regional Partners",
            "description": "UK Prime Minister Keir Starmer has expressed deep concern regarding the recent attacks targeting Qatar and other regional partners. According to Jin10, the Prime Minister emphasized the importance of maintaining stability and security in the region. The UK government is closely monitoring the situation and is in communication with its allies to address the ongoing challenges. The Prime Minister reiterated the UK's commitment to supporting its partners in ensuring peace and security.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053811&language=en-US",
            "pub_date": "2026-03-01 02:09:10",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053805,
            "title": "Iran internet drops to 4% amid US-Israeli strikes",
            "description": "Network data shows connectivity fell to 4% amid U. S. -Israeli strikes. The Iran internet blackout raises rights concerns as Amnesty and HRW urge accountability.\nsource: https://coincu.com/news/iran-internet-drops-to-4-amid-us-israeli-strikes/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053805&language=en-US",
            "pub_date": "2026-03-01 01:54:49",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053803,
            "title": "GEOPOLITICS | Jordan's Foreign Minister Accuses Iran of Unprovoked Attack",
            "description": "Jordan's Foreign Minister has accused Iran of launching an unprovoked attack on Jordan. According to Jin10, the minister stated that Iran's actions were unjustified and have raised tensions in the region. The accusation comes amid ongoing geopolitical conflicts involving Iran and several Middle Eastern countries. The minister emphasized the need for diplomatic solutions to address the escalating situation. This development adds to the complexity of regional dynamics, with potential implications for international relations and security.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053803&language=en-US",
            "pub_date": "2026-03-01 01:56:31",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053802,
            "title": "GEOPOLITICS | Reports Emerge of Family Tragedy Involving Iran's Supreme Leader",
            "description": "Reports have surfaced indicating a tragic incident involving the family of Iran's Supreme Leader, Ayatollah Ali Khamenei. According to Jin10, a member of the Tehran City Council has stated that Khamenei's son-in-law and daughter-in-law were killed in an attack. The details surrounding the incident remain unclear, and there has been no official confirmation from Iranian authorities. This development comes amid heightened tensions in the region, raising concerns about potential repercussions. Observers are closely monitoring the situation for further updates.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053802&language=en-US",
            "pub_date": "2026-03-01 02:00:18",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053801,
            "title": "Iran Vows Retribution for Attack on Children",
            "description": "Iranian Foreign Minister Araghchi has declared that Iran will undoubtedly punish those responsible for the killing of their children. According to Jin10, this statement underscores Iran's commitment to seeking justice for the victims. The foreign minister's remarks highlight the gravity of the situation and Iran's determination to hold the perpetrators accountable. This development comes amid heightened tensions in the region, with Iran emphasizing its resolve to protect its citizens and respond to acts of aggression.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053801&language=en-US",
            "pub_date": "2026-03-01 02:03:02",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053799,
            "title": "Tether Freezes $4.2B in USDT, Here’s Why",
            "description": "Tether froze approximately $4. 2 billion in USDT tied to criminal investigations, according to reporting from Reuters. Since 2023, the company has blocked about $3. 5B of that total, showing a sharp increase in enforcement activity over the past two years\nsource: https://techgaged.com/tether-freezes-4-2b-in-usdt-heres-why/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053799&language=en-US",
            "pub_date": "2026-03-01 01:44:53",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053798,
            "title": "UK Labour Minister Josh Simmons Resigns",
            "description": "Josh Simmons, a prominent figure within the UK Labour Party, has announced his resignation from his ministerial position. According to Jin10, Simmons' departure comes amid ongoing political shifts within the party. His resignation is expected to impact the party's dynamics and future strategies. The Labour Party is currently navigating through a period of internal restructuring, and Simmons' exit adds another layer of complexity to the situation. Observers are closely monitoring how this development will influence the party's approach to upcoming political challenges.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053798&language=en-US",
            "pub_date": "2026-03-01 01:45:14",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053797,
            "title": "GEOPOLITICS | Macau Raises Travel Alert for Iran Amid Security Concerns",
            "description": "Macau's tourism authority has elevated its travel warning for Iran to the highest level due to security concerns. According to RTHK, residents of Macau are advised to avoid traveling to Iran and those currently in the country should enhance their safety measures and leave as soon as possible. The tourism authority has not yet received any inquiries or requests for assistance related to this situation. Macau residents in need of support can contact the 24-hour tourism hotline at +853 2833 3000 or the Ministry of Foreign Affairs' global consular protection and service hotline at +86 10 12308.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053797&language=en-US",
            "pub_date": "2026-03-01 01:51:30",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053795,
            "title": "GEOPOLITICS | Israeli Military Orders Evacuation of Iranian Industrial Park",
            "description": "The Israeli military has issued an evacuation order for an industrial park in Isfahan, Iran. According to Jin10, this development comes amid heightened tensions in the region. The specifics of the evacuation order and its implications for regional stability remain unclear. Observers are closely monitoring the situation for further updates.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053795&language=en-US",
            "pub_date": "2026-03-01 01:40:23",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053794,
            "title": "GEOPOLITICS | Greece's Souda Naval Base Heightens Security Amid Emergency Alert",
            "description": "Greece's Souda Naval Base has reportedly intensified security measures, restricting access to essential personnel only. According to Jin10, this move is part of an emergency alert protocol, with air defense systems now in place to ensure heightened protection.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053794&language=en-US",
            "pub_date": "2026-03-01 01:40:27",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053790,
            "title": "GEOPOLITICS | Israel Monitors 10th Round of Iranian Missiles",
            "description": "On February 28, local time, the Israeli military reported monitoring the 10th round of missiles launched by Iran towards Israel. According to Jin10, this development marks a continuation of heightened tensions between the two nations. The Israeli military's announcement underscores ongoing regional instability and the potential for further escalation. The situation remains closely watched by international observers.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053790&language=en-US",
            "pub_date": "2026-03-01 01:27:56",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053789,
            "title": "Elon Musk's Potential to Become World's First Trillionaire Examined",
            "description": "Elon Musk is on track to potentially become the world's first trillionaire, a milestone that could significantly impact global markets and politics. Bloomberg posted on X, highlighting how historical figures like John D. Rockefeller have demonstrated the transformative power of wealth at such a scale. Musk's ventures, including Tesla and SpaceX, continue to drive his financial ascent, raising questions about the broader implications of his growing influence. As Musk's wealth increases, the effects on economic structures and political dynamics are expected to be profound, echoing the shifts seen during Rockefeller's era.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053789&language=en-US",
            "pub_date": "2026-03-01 01:30:27",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053788,
            "title": "Bangladesh Ensures Safety of Diplomats and Students in Iran",
            "description": "Bangladesh's Ministry of Foreign Affairs has announced measures to ensure the safety and security of its diplomatic missions, diplomats, other staff, and Bangladeshi students in Iran. According to Jin10, the ministry emphasized its commitment to protecting its nationals amid the current geopolitical climate. The announcement comes as part of Bangladesh's broader efforts to safeguard its citizens abroad.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053788&language=en-US",
            "pub_date": "2026-03-01 01:31:38",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053787,
            "title": "FBI Heightens Alert Nationwide Following Iran Attack",
            "description": "The Federal Bureau of Investigation (FBI) has placed its counterterrorism and counterintelligence teams on high alert across the United States. According to Jin10, this heightened state of readiness comes in response to a recent attack by Iran. The FBI's increased vigilance aims to address potential threats and ensure national security in the wake of the incident. The agency is closely monitoring the situation and coordinating with other law enforcement agencies to mitigate any risks. This development underscores the ongoing geopolitical tensions and the need for heightened security measures.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053787&language=en-US",
            "pub_date": "2026-03-01 01:32:09",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}