{
    "data": [
        {
            "id": 734199,
            "title": "Coinstash co-founder: Investors are still panicking about the tariff war and seeking safe havens, and the subsequent volatility is expected to be greater",
            "description": "Odaily Planet Daily News: Mena Theodorou, co-founder of cryptocurrency exchange Coinstash, said that although Trump has suspended the tariff war, investors are still panicking and seeking safe havens, and subsequent volatility is expected to be greater. He pointed out that \"tariffs of this scale are generally seen as unfavorable for risky assets such as Bitcoin and other cryptocurrencies.\" Gold rose to a record high today, while the US dollar index rose to a new high this year. However, Theodorou believes that Trump has also brought light at the end of the tunnel, including a potential Bitcoin strategic reserve plan. (DL News)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734199&language=en-US",
            "pub_date": "2025-02-05 16:30:37",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734205,
            "title": "Scaramucci Comments On Market Volatility And Cryptocurrency Potential",
            "description": "According to Odaily, Anthony Scaramucci, founder of SkyBridge Capital, commented on the tariff disputes, stating that U.S. President Donald Trump's unpredictable actions could lead to short-term market volatility. However, he believes that Bitcoin and cryptocurrencies will emerge as long-term winners, emphasizing the need to endure the full impact of Trump's policies. SkyBridge Capital holds $1.4 billion in digital assets, representing 57% of its total assets under management, while over 60% of Scaramucci's personal wealth is in Bitcoin. Scaramucci further noted that if institutions fully adopt cryptocurrencies, banks could custody them, retain them on their balance sheets, and leverage their capital to become major investors in cryptocurrencies, particularly Bitcoin. He described this potential development as a profoundly impactful and powerful move.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734205&language=en-US",
            "pub_date": "2025-02-05 16:33:51",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734204,
            "title": "Stablecoins Show Remarkable Growth Despite Market Challenges",
            "description": "According to Foresight News, ARK Invest's 'Big Ideas 2025' report highlights that stablecoins are among the fastest-growing sectors in the digital asset space. Despite enduring a two-year bear market and a market capitalization drop of over 70%, stablecoins continue to demonstrate robust growth. In 2024, stablecoin transactions reached $15.6 trillion, surpassing Visa and Mastercard's transaction volumes by approximately 119% and 200%, respectively. However, the monthly transaction count for stablecoins was 110 million, which is only 0.41% and 0.72% of Visa and Mastercard's transaction volumes. This indicates that the average transaction value for stablecoins is significantly higher than that of Visa and Mastercard.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734204&language=en-US",
            "pub_date": "2025-02-05 16:34:22",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734198,
            "title": "Bitwise Legal Director: The SEC is currently in a training period, and the approval of new crypto ETFs still requires instructions from the new leadership",
            "description": "Odaily Planet Daily News: Katherine Dowling, legal director of Bitwise and former US prosecutor, said that the SEC is currently in a \"tempering period\" and needs to wait for the new chairman Paul Atkins to confirm his inauguration. Dowling pointed out that the cooperation between the SEC and the CFTC is strengthening, and the newly established cryptocurrency working group has a positive attitude. However, the SEC still needs guidance from the new leadership on the issue of the securities attributes of assets such as XRP and Solana. She expects that the Bitcoin Ethereum combination ETF will be approved quickly, while other crypto asset ETFs will take longer to approve. (blockworks)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734198&language=en-US",
            "pub_date": "2025-02-05 16:35:17",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734188,
            "title": "Bitwise Chief Compliance Officer: SEC appears to be waiting for “high-level instructions” on how to handle litigation, including Ripple case",
            "description": "Odaily Planet Daily News Bitwise Chief Compliance Officer Katherine Dowling said that January marked the end of SAB 121, ushered in Trump's cryptocurrency executive order, and witnessed the formation of a new SEC working group. Coupled with the surge in cryptocurrency ETF applications, now is a good time to communicate with insiders. \nShe pointed out that now, the signal of increased cooperation between the SEC and CFTC is one of the biggest changes compared to the Gensler era. According to Bitwise's conversations with the SEC, the cryptocurrency working group seems to be \"very sincere.\" The current SEC Chairman nominee Paul Atkins has not yet been determined, and Mark Uyeda serves as acting chairman. That said, Dowling called the SEC \"in purgatory\" and the agency seemed to be waiting for \"high-level instructions\" on how to handle litigation, including the case against Ripple. \nDowling said: \"These don't go away overnight, and they shouldn't go away, but when you have new leadership, there are new eyes. In this particular case, are we focusing on the right things? Is there a settlement position that allows both parties to achieve the results they want?\" \nShe pointed out that some assets are still \"trapped like dolphins in a fishing net.\" She was referring to assets that are clearly classified as securities, including SOL and XRP. The SEC must make some \"concessions\" in this regard in order to move forward with these ETF proposals. She hinted that the DOGE ETF may have a clearer path because the SEC has not yet labeled DOGE a security. \nIn addition, in addition to the uncertainty of litigation/securities, there is also the question of whether the SEC will require the existence of \"a regulated market of considerable size\" (historically futures traded through CME). (Blockworks)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734188&language=en-US",
            "pub_date": "2025-02-05 16:17:22",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734187,
            "title": "22 U.S. states have introduced Bitcoin and digital asset bills",
            "description": "Odaily Planet Daily News Cointelegraph published an article on the X platform stating that to date, a total of 22 states in the United States have introduced Bitcoin and digital asset bills.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734187&language=en-US",
            "pub_date": "2025-02-05 16:19:42",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734186,
            "title": "Opinion: Whether the tariff crisis subsides quickly or not is always beneficial to risk assets such as Bitcoin",
            "description": "Odaily Planet Daily News Noelle Acheson, author of the \"Crypto Is Macro Now\" newsletter, said that if the tariff panic subsides soon, it will be a good thing for risky assets including Bitcoin. But if not, safe-haven assets such as Bitcoin can benefit from investors seeking to hedge against the depreciation of their own currencies and prepare for the development of the new economy. \nEven so, Bitcoin's success depends largely on the strength of the US dollar. She pointed out: \"A decline in the US dollar against other currencies will be beneficial to global liquidity and may reawaken risk appetite, benefiting Bitcoin and stocks.\"",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734186&language=en-US",
            "pub_date": "2025-02-05 16:22:17",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734197,
            "title": "Bitwise Compliance Officer Discusses SEC Developments Amid Cryptocurrency Changes",
            "description": "According to Odaily, Bitwise's Chief Compliance Officer, Katherine Dowling, highlighted significant developments in the cryptocurrency sector as January marked the end of SAB 121 and the introduction of U.S. President Donald Trump's cryptocurrency executive order. This period also saw the formation of a new SEC task force and a surge in cryptocurrency ETF applications, making it an opportune time for insider discussions.\n\nDowling noted that one of the most notable changes compared to the Gensler era is the increased cooperation between the SEC and CFTC. Conversations between Bitwise and the SEC suggest that the cryptocurrency task force is \"very sincere.\" Currently, Paul Atkins is the nominee for SEC Chair, while Mark Uyeda serves as the acting chair. Despite this, Dowling described the SEC as being in a \"purgatory state,\" seemingly awaiting \"top-level guidance\" on handling lawsuits, including the case against Ripple.\n\nDowling questioned whether the focus is on the right issues and if there is a settlement position that could satisfy both parties involved. She pointed out that some assets, such as SOL and XRP, are \"trapped like dolphins in a fishing net,\" being classified as securities. The SEC needs to make some \"concessions\" to advance these ETF proposals. She hinted that a DOGE ETF might have a clearer path since the SEC has not classified DOGE as a security.\n\nAdditionally, beyond the uncertainty of lawsuits and securities, there is the question of whether the SEC will require a \"reasonably sized regulated market,\" historically achieved through CME-traded futures.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734197&language=en-US",
            "pub_date": "2025-02-05 16:23:47",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734178,
            "title": "Billionaire Chamath Palihapitiya Proposes Using Government Bitcoin Holdings for Future US Sovereign Wealth Fund",
            "description": "Billionaire venture capitalist Chamath Palihapitiya says the US government can get its federal sovereign wealth fund up and running by leveraging its Bitcoin (BTC) holdings. On Monday, President Donald Trump signed an executive order for the Treasury and Commerce Departments to create a fund designed to provide long-term financial stability, economic growth and protection against […]\nThe post...\nsource: https://dailyhodl.com/2025/02/05/billionaire-chamath-palihapitiya-proposes-using-government-bitcoin-holdings-for-future-us-sovereign-wealth-fund/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734178&language=en-US",
            "pub_date": "2025-02-05 16:04:15",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734177,
            "title": "A user lost $709,000 in ENRON trading and made $10.1 million in TRUMP",
            "description": "Odaily Planet Daily News According to Lookonchain monitoring, a user spent $1.82 million to buy ENRON today, and then liquidated it at $1.11 million, losing $709,000 in 30 minutes. Previously, the user had made $10.1 million on TRUMP and $3.4 million on MELANIA.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734177&language=en-US",
            "pub_date": "2025-02-05 16:08:03",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}