{
    "data": [
        {
            "id": 1050520,
            "title": "Decibel, a full-chain transaction engine, has officially launched with a pre-deposited fund of $58 million.",
            "description": "Decibel, a full-chain trading engine incubated by Aptos Labs, has officially launched, allowing users to trade on-chain perpetual contracts based on Aptos' high-performance underlying infrastructure. The mainnet version features a full-chain limit order book that verifies all transactions, a transparent on-chain risk engine, a DLP liquidity pool co-developed with Gauntlet, and the X-Chain account system supporting funding from Aptos, Ethereum, Solana, and CEXs. It uses Bridge's native USD stablecoin usDCBL as the default collateral asset and is equipped with institutional-grade tools and an open Builder Codes developer layer. During the previous testnet phase, over 700,000 unique accounts and 132,000 daily active accounts were generated, with an average of over 1 million transactions per day, and $58 million in pre-deposited funds, approximately 50% of which came from Solana and Ethereum ecosystem users. In the future, Decibel plans to expand from the crypto perpetual market to the spot market, a unified account system, and multi-collateral structures, and explore on-chain deployments for real-world assets, stock indices, and foreign exchange markets, aiming to bring more institutional-grade trading traffic to the Aptos ecosystem.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050520&language=en-US",
            "pub_date": "2026-02-26 22:14:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050521,
            "title": "OpenAI Reports Issues with ChatGPT Usage",
            "description": "OpenAI has announced that there are currently some issues being experienced with the use of ChatGPT. According to Jin10, the company has acknowledged these problems and is working towards resolving them. Users have reported various difficulties, although specific details about the nature of these issues have not been disclosed. OpenAI is actively investigating the situation to ensure a smooth user experience. Further updates are expected as the company addresses these concerns.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050521&language=en-US",
            "pub_date": "2026-02-26 22:15:51",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050519,
            "title": "USDC and CCTP will be listed on Morph, providing cross-chain USD settlement and payment applications.",
            "description": "According to official news, USDC and the Circle Cross-Chain Transfer Protocol (CCTP) will be listed on Morph. USDC will be issued on Morph by a regulated entity affiliated with Circle, serving as a USD-denominated settlement asset within the network and providing a more consistent USD settlement basis for payment applications. CCTP will support USDC transfers between supported blockchains via burn-and-mint. It involves burning USDC on the source chain and natively minting it on the target chain, maintaining 1:1 supply consistency and standardized settlement behavior. Applications can choose between Standard Transfer or Fast Transfer modes as needed. Morph stated that USDC and CCTP will support USD settlement and cross-chain fund transfers in scenarios such as encrypted cards, cross-border remittances, payment gateways, and DeFi and trading, and will advance its payment settlement layer positioning together with Morph's $150 million Payment Accelerator program.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050519&language=en-US",
            "pub_date": "2026-02-26 22:16:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050518,
            "title": "An alleged insider placed $59,800 in bets three hours before ZachXBT announced allegations of insider trading involving Axiom employees, netting a profit of nearly $110,000.",
            "description": "According to Lookonchain's monitoring, three hours before ZachXBT announced that an Axiom employee was suspected of insider trading, a suspected insider placed bets of $59,800 through two newly created wallets, making a profit of nearly $109,000.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050518&language=en-US",
            "pub_date": "2026-02-26 22:17:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050499,
            "title": "Court Awards Record Legal Costs to MyForexFunds",
            "description": "A court has granted record legal costs to MyForexFunds, a simulated trading company, following a prolonged asset freeze lasting over two years. Bloomberg posted on X, highlighting the court's dissatisfaction with the conduct of the Canadian regulator responsible for investigating the platform. The decision marks a significant development in the ongoing legal proceedings surrounding the firm.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050499&language=en-US",
            "pub_date": "2026-02-26 22:09:38",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050498,
            "title": "ZachXBT Investigates Employee Misconduct Allegations At Axiom",
            "description": "Crypto sleuth ZachXBT posted on X, revealing that the platform he has been investigating is Axiom. In his X thread,  ZachXBT discloses that multiple employees of the cryptocurrency exchange Axiom Exchange are suspected of abusing their access to internal tools to track users' private wallet activities and engage in insider trading. ZachXBT stated that they were commissioned to independently investigate allegations of misconduct at Axiom. The investigation outlines that certain employees allegedly abused the lack of access controls for internal tools to lookup sensitive user details to insider trade by tracking private wallet activity since early 2025. In a clip attached in ZachXBT's X thread, a person can be heard stating he can track any Axiom user via referral code, wallet, or UID. The person is also heard describing researching 10-20 wallets initially and slowly increasing over time \"so it does not look that suspicious\".ZachXBT stated that he contacted the Axiom team earlier today for their input. He hopes that Axiom's co-founders will further investigate this incident and consider taking legal action against the employees involved.The Axiom team replied on X, with the following statement: \"We are shocked and disappointed to hear that someone on our team abused internal customer support tools to look up user wallets. We have removed access to these tools and will continue to investigate and hold the offending parties responsible. This does not represent us as a team, we have always tried to put the user first. We’ll share updates on our twitter as we learn more.\"",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050498&language=en-US",
            "pub_date": "2026-02-26 22:11:29",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050497,
            "title": "UK Households Face Rising Energy Debt Amid Falling Wholesale Prices",
            "description": "UK households are increasingly burdened by energy debt, even as wholesale prices have decreased from the peaks seen during the 2022 crisis. Bloomberg posted on X, highlighting the ongoing impact of the energy shock on consumers. Despite the retreat in wholesale prices, many households continue to struggle with the financial aftermath, indicating that the effects of the crisis are far from over. The situation underscores the challenges faced by consumers in managing energy costs, as the debt accumulation persists despite a more favorable pricing environment. This trend raises concerns about the long-term financial stability of households and the broader economic implications.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050497&language=en-US",
            "pub_date": "2026-02-26 22:11:48",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050496,
            "title": "Billionaire Resnicks Donate $100 Million to UCLA Health",
            "description": "Lynda and Stewart Resnick, the billionaire co-owners of the agricultural conglomerate the Wonderful Company, have pledged a $100 million donation to UCLA Health. Bloomberg posted on X, highlighting the significance of this contribution to the healthcare sector. The donation is intended to support medical research and patient care initiatives at UCLA Health, enhancing its capacity to deliver advanced healthcare services. This substantial gift underscores the Resnicks' ongoing commitment to philanthropy and their focus on improving health outcomes through strategic investments in medical institutions.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050496&language=en-US",
            "pub_date": "2026-02-26 22:12:29",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050482,
            "title": "Bloomberg and Kaiko Collaborate to Enhance On-Chain Data Access",
            "description": "Bloomberg and Kaiko have announced a partnership to develop an on-chain data access solution that incorporates Bloomberg Data License data into blockchain platforms. According to NS3.AI, this initiative addresses challenges such as inconsistent data sources, timing discrepancies, and fragmented data pipelines, which have led to operational difficulties and higher reconciliation costs. By providing direct access to Bloomberg's data on-chain, the solution aims to offer a dependable single source of truth, enhancing automation and minimizing ambiguity in tokenized market workflows.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050482&language=en-US",
            "pub_date": "2026-02-26 21:59:04",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050481,
            "title": "China Removes Upper Limit on RMB Account Financing Ratios",
            "description": "The People's Bank of China has announced the removal of the upper limit regulation on RMB account financing ratios. According to NS3.AI, domestic banks that have outstanding RMB cross-border interbank financing exceeding the set limits are required to halt new financing activities until their balances return to normal levels. This policy adjustment is intended to streamline cross-border RMB business operations and enhance the associated regulatory framework.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050481&language=en-US",
            "pub_date": "2026-02-26 21:59:23",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050476,
            "title": "Binance has submitted a MiCA license application to Greece, advancing its compliance expansion within the EU.",
            "description": "Binance co-CEO Richard Teng revealed that the exchange submitted an application to Greek regulators last month to obtain an operating license under the EU's Crypto Asset Market Regulation (MiCA). MiCA requires crypto companies to obtain a license by July 2026 to operate within the EU. Teng stated that MiCA licenses are standardized across Europe, thus requiring consideration of multiple factors such as labor force, talent pool, and security; Greece is considered a suitable base for expansion within the EU. The crypto market has experienced significant volatility over the past year, with Bitcoin falling approximately 50% from its October high of $126,000. Teng noted that retail investor sentiment has weakened, but institutional participation remains stable, with \"smart money, institutional funds, and long-term capital continuing to flow in.\" (Finance Feeds)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050476&language=en-US",
            "pub_date": "2026-02-26 22:00:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050480,
            "title": "GEOPOLITICS | Russian Foreign Ministry Criticizes EU's Proposed Oil Import Ban",
            "description": "The Russian Foreign Ministry has strongly criticized the European Union's proposal to permanently ban the import of Russian oil, calling it 'utterly absurd.' According to Jin10, the ministry's statement reflects ongoing tensions between Russia and the EU over energy policies and geopolitical issues. The proposed ban is part of broader EU efforts to reduce dependency on Russian energy sources amid geopolitical conflicts. The Russian government views this move as an escalation of economic measures that could further strain relations between Moscow and Brussels. The EU's proposal is still under discussion, and its potential impact on the global energy market remains uncertain.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050480&language=en-US",
            "pub_date": "2026-02-26 22:01:20",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050461,
            "title": "Analysis: U.S. initial jobless claims rose slightly during the Presidents' Day holiday week but were lower than expected.",
            "description": "The number of Americans filing for unemployment benefits last week rose less than expected, suggesting that layoffs remain at a low level. Initial jobless claims in the U.S. rose by 4,000 to 212,000 in the week ending February 21, compared with a median forecast of 215,000. The survey period included the Presidents' Day holiday. Continuing jobless claims fell to 1.83 million. Claims data can fluctuate before and after holidays. However, the current relatively low number of initial jobless claims is consistent with other recent data indicating a stabilizing labor market. The February jobs report, to be released on March 6, will help policymakers assess whether the strong job growth and decline in the unemployment rate in January were merely temporary changes or signs of continued improvement. (Jinshi)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050461&language=en-US",
            "pub_date": "2026-02-26 21:44:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050466,
            "title": "Bayer's Potential Shift Hinges on Roundup Litigation Resolution",
            "description": "Bayer's ability to reassess its conglomerate structure is contingent upon resolving the ongoing Roundup weedkiller litigation. Bloomberg posted on X, highlighting that a settlement could pave the way for the company to explore strategic changes. The litigation has been a significant factor in Bayer's current operational focus, and its resolution could open new avenues for the company's future direction.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050466&language=en-US",
            "pub_date": "2026-02-26 21:45:29",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050465,
            "title": "GEOPOLITICS | EU Reduces Russian Diplomatic Staff to 40",
            "description": "The European Union has informed Russia of its decision to reduce the number of Russian diplomatic staff in EU institutions to 40, according to Jin10. This move comes amid ongoing geopolitical tensions between Russia and the EU. The reduction in staff is part of a broader strategy by the EU to address diplomatic relations with Russia. The decision reflects the EU's stance on recent developments and its approach to managing diplomatic engagements with Moscow. The Russian Foreign Ministry has acknowledged the notification from Brussels, indicating a significant shift in diplomatic dynamics between the two entities.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050465&language=en-US",
            "pub_date": "2026-02-26 21:48:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050464,
            "title": "Warner Bros. Faces Decline in Fourth-Quarter Sales and Earnings",
            "description": "Warner Bros. has reported a decline in its fourth-quarter sales and earnings, highlighting the challenges the media giant is facing amid ongoing takeover bids. Bloomberg posted on X, noting that the company's financial performance has been impacted by various market pressures.\n\nThe media conglomerate is currently evaluating competing offers from potential buyers, which adds another layer of complexity to its strategic decisions. The decrease in sales and earnings underscores the difficulties Warner Bros. is encountering in maintaining its market position.\n\nAs the company navigates these challenges, it remains focused on assessing the best path forward to enhance shareholder value and sustain its competitive edge in the industry.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050464&language=en-US",
            "pub_date": "2026-02-26 21:50:23",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050437,
            "title": "PRECIOUS METALS | Investor Confidence Wavers as U.S. Stock Valuations Near Dot-Com Bubble Levels",
            "description": "The World Gold Council has highlighted concerns regarding U.S. stock market valuations, which are approaching levels reminiscent of the dot-com bubble era. According to Jin10, the Council warns that repeated failures to meet profit targets could undermine investor confidence. This scenario may lead to a reduction in leveraged operations, potentially amplifying stock price declines and increasing demand for safe-haven assets like gold. Historically, gold has performed well during periods of systemic risk, offering positive returns and mitigating losses across investment portfolios.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050437&language=en-US",
            "pub_date": "2026-02-26 21:41:30",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050436,
            "title": "Axiom Faces Allegations of Misconduct Following Rapid Growth",
            "description": "Axiom, a cryptocurrency trading platform established by Mist and Cal in 2024, has come under scrutiny following allegations of misconduct. The platform, which gained significant traction after participating in Y-Combinator's Winter 2025 batch, has reportedly generated over $390 million in revenue. Blockchain sleuth ZachXBT posted on X about being retained to investigate these allegations after receiving reports concerning the company's operations.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050436&language=en-US",
            "pub_date": "2026-02-26 21:41:45",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050435,
            "title": "Axiom Employee Allegedly Tracks User Data, Raises Privacy Concerns",
            "description": "Blockchain sleuth ZachXBT posted on X about a concerning revelation involving Broox, a senior business development employee at Axiom based in New York. In a recorded clip, Broox allegedly claims the ability to track any Axiom user through reference codes, wallets, or user IDs, asserting he can uncover extensive information about individuals. He reportedly described an initial examination of 10-20 wallets, gradually increasing the number to avoid suspicion.\n\nIn another segment of the same recording, Broox is heard setting guidelines for requesting data lookups from him, promising to provide a comprehensive list of wallets. The recording appears to be a private call among group members discussing strategic approaches.\n\nThese revelations have sparked concerns over privacy and data security within the Axiom platform, raising questions about the ethical implications of such tracking capabilities.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050435&language=en-US",
            "pub_date": "2026-02-26 21:41:55",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050434,
            "title": "Trader Marcell Allegedly Exploits Followers for Exit Liquidity",
            "description": "Blockchain sleuth ZachXBT posted on X about allegations against Marcell, a trader known for his controversial practices. Marcell reportedly purchased significant amounts of meme coin tokens from private wallets before promoting them to his followers on X and Telegram. This strategy, known as bundling, involves using followers as exit liquidity, allowing Marcell to profit from the subsequent price increase. Such traders are often targeted due to the rarity of address reuse and the private nature of their wallets, making insider information highly valuable.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050434&language=en-US",
            "pub_date": "2026-02-26 21:42:08",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}