{
    "data": [
        {
            "id": 1051343,
            "title": "U.S. Government Advises Against Contempt Ruling for Argentina in YPF Case",
            "description": "The U.S. government has requested that a federal judge refrain from holding Argentina in contempt over accusations of not providing officials’ texts and emails. Bloomberg posted on X that this request is related to a case involving former shareholders of YPF, who are attempting to enforce an $18 billion judgment against Argentina. The legal dispute centers on Argentina's nationalization of YPF, an oil company, which has led to significant financial claims by the former shareholders. The U.S. government's involvement highlights the international implications of the case, as it seeks to balance diplomatic relations with legal obligations. The outcome of this request could impact the enforcement of the judgment and the broader legal proceedings.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051343&language=en-US",
            "pub_date": "2026-02-27 08:57:15",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051348,
            "title": "Morgan Stanley plans to expand its Bitcoin custody and trading services, and explore yield and lending businesses.",
            "description": "Morgan Stanley's newly appointed head of digital asset strategy, Amy Oldenburg, stated that the company plans to offer Bitcoin custody and trading services to its clients. Morgan Stanley currently manages nearly $9 trillion in client assets. At the Enterprise Bitcoin Conference in Las Vegas, Oldenburg also mentioned that Bitcoin-related yield and lending services are under discussion and exploration, stating that these business directions are part of the company's digital asset strategic roadmap, although it is still in its early stages. (Decrypt)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051348&language=en-US",
            "pub_date": "2026-02-27 08:59:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051346,
            "title": "US stocks closed mixed in the crypto sector, with DFDV falling more than 12.11%.",
            "description": "According to data from msx.com, at the close of trading on the US stock market, the Dow Jones Industrial Average rose 0.03%, the S&P 500 fell 0.54%, and the Nasdaq Composite fell 1.18%. The crypto sector was mixed, with DFDV falling over 12.11%, UPXI falling over 7.92%, BTCS falling over 6.78%, ALTS falling over 5.96%, and CRCL falling over 4.9%. msx.com is a decentralized RWA trading platform that has listed hundreds of RWA tokens, covering US stock and ETF tokens such as AAPL, AMZN, GOOGL, META, MSFT, NFLX, and NVDA.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051346&language=en-US",
            "pub_date": "2026-02-27 09:00:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051347,
            "title": "Gold fell back to $5175.42, with the BVIX at 53.12.",
            "description": "According to the latest data from Gate, gold prices fell to $5,175.42 per ounce, a daily decrease of 0.17%. Silver prices fell to $88.390 per ounce, a daily increase of 1.61%. The BVIX (BTC Volatility Index) is currently quoted at 53.12, a daily decrease of 2.51%. The EVIX (ETH Volatility Index) is currently quoted at 69.97, a daily increase of 1.69%. In the foreign exchange market, the USD/CNH exchange rate rose 0.09% to 6.84903. The USD/JPY exchange rate fell 0.22% to 155.758. In commodities, WTI crude oil fell 0.07% to $65.32 per barrel. Brent crude oil rose 0.04% to $71.42 per barrel. Gate allows users to trade traditional financial market products directly within the platform, providing a one-stop solution for various asset classes including precious metals, forex, global equity CFDs, major indices, and commodities, achieving deep integration between crypto assets and traditional financial assets. Gate TradFi functionality is fully integrated into the Gate App and Web platform, allowing users to conveniently participate in global asset price trading without switching platforms, unlocking more strategies and opportunities beyond the crypto market, and continuously enhancing their diversified asset allocation experience.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051347&language=en-US",
            "pub_date": "2026-02-27 09:00:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051337,
            "title": "POAP founder deposits $4.11 million worth of ETH into Binance",
            "description": "According to Onchain Lens, POAP founder Patricio Worthalter (@worthalter) deposited 2,000 ETH worth $4.11 million into Binance 9 hours ago.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051337&language=en-US",
            "pub_date": "2026-02-27 08:50:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051333,
            "title": "Anthropic Won’t Lift AI Safeguards Amid Ongoing Pentagon Dispute: CEO",
            "description": "Anthropic CEO’s said the company will not comply with Defense Department demands as the Pentagon weighs whether to label the company a “supply chain risk. ”\nsource: https://decrypt.co/359358/anthropic-wont-lift-ai-safeguards-pentagon-dispute",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051333&language=en-US",
            "pub_date": "2026-02-27 08:33:58",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051336,
            "title": "Expert Insights: Early Bitcoin Holders Drive Recent Pullback",
            "description": "Ari Paul from BlockTower Capital has highlighted the role of market makers in influencing intraday volatility, which often results in short-lived price movements. According to NS3.AI, the recent decline in Bitcoin's value is primarily attributed to substantial selling by early Bitcoin holders. This selling pressure has not been met with sufficient buying interest, leading to the pullback. Paul advises investors to enhance their analytical approaches instead of attributing price changes to manipulation, emphasizing that upward price movements are typically more common in asset markets.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051336&language=en-US",
            "pub_date": "2026-02-27 08:42:14",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051332,
            "title": "US lawmakers have introduced the \"Blockchain Innovation Promotion Act of 2026,\" which aims to clarify the scope of Section 1960.",
            "description": "According to the DeFi Education Fund, U.S. Representatives Scott Fitzgerald, Ben Cline, and Zoe Lofgren have jointly introduced the \"Blockchain Innovation Promotion Act of 2026,\" which aims to clarify the scope of application of Title 18, Section 1960 of the United States Code regarding \"permissionless money transfer businesses.\" The bill seeks to clarify that Section 1960 only applies to entities that control customer assets and transfer funds on behalf of customers, and should not extend to blockchain software developers who do not control user funds. The proposal states that this move aligns with the original intent of Congress and the long-standing regulatory interpretations of the U.S. Treasury Department's Financial Crimes Enforcement Network (FinCEN), aiming to reduce the risk of developers facing undue criminal charges.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051332&language=en-US",
            "pub_date": "2026-02-27 08:33:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051324,
            "title": "Sources familiar with the matter: PayPal has not entered into negotiations with Stripe regarding a sale.",
            "description": "According to Semafor, citing sources familiar with the matter, PayPal is not currently in talks with Stripe or any other company regarding a sale. The report states that PayPal has been working with investment banks for months to prepare for potential activist shareholder actions or unpopular takeover offers. These preparations began after a significant drop in the company's stock price, with management concerned that a lower valuation could put the company under external pressure. Sources also indicated that this collaboration began during the tenure of former CEO Alex Chriss.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051324&language=en-US",
            "pub_date": "2026-02-27 08:27:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051323,
            "title": "An OTC whale holding over $572 million in assets sent 23,500 ETH to FalconX.",
            "description": "According to Onchain Lens monitoring, OTC trading whale \"0xfb7\" sent 23,500 ETH ($47.47 million) to FalconX for sale and to repay loans. Currently, this whale holds: - 4,000 cbBTC ($269 million) - 120,380 stETH ($243.27 million) - 29,727 WETH ($60.16 million) and borrowed $97.26 million USDT from Aave.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051323&language=en-US",
            "pub_date": "2026-02-27 08:30:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051322,
            "title": "American Bitcoin Corp., backed by the Trump family, reported a $59 million loss in the fourth quarter, and its stock price has fallen by about 90% from its peak.",
            "description": "American Bitcoin Corp., a mining company backed by the Trump family, reported a net loss of $59 million in the fourth quarter. The company, which went public on Nasdaq during the crypto boom, has seen its stock price fall by about 90% since its September high, significantly shrinking its market capitalization, as the industry has experienced a major correction since 2022. Following the earnings release, the company's stock price fell again by nearly 3%, to just over $1 per share. (Bloomberg)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051322&language=en-US",
            "pub_date": "2026-02-27 08:31:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051331,
            "title": "Peter Schiff Speculates on Trump's Bitcoin Omission in State of the Union",
            "description": "Bitcoin critic Peter Schiff has expressed his belief that U.S. President Donald Trump deliberately excluded Bitcoin from his State of the Union address. According to NS3.AI, Schiff speculates that this omission might indicate Trump's effort to distance himself from a possible cryptocurrency market collapse. Alternatively, Schiff suggests that Trump could be maneuvering to secure additional funding from major investors before potentially influencing Bitcoin's price.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051331&language=en-US",
            "pub_date": "2026-02-27 08:33:11",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051321,
            "title": "UK Consumer Confidence Falls Amid Economic Concerns",
            "description": "UK consumer confidence has decreased for the first time in three months, influenced by rising unemployment and strained household budgets. Bloomberg posted on X that these factors are casting a shadow over the country's economic outlook. The decline in confidence reflects growing concerns among consumers about their financial stability and the broader economic environment. This shift comes as households face increasing financial pressures, impacting their spending and saving behaviors. The economic landscape remains uncertain, with these challenges contributing to a more cautious consumer sentiment.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051321&language=en-US",
            "pub_date": "2026-02-27 08:23:17",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051320,
            "title": "Federal Reserve Challenges Subpoenas in Powell Investigation",
            "description": "The Federal Reserve is reportedly initiating a legal challenge against subpoenas issued in a criminal investigation involving Jerome Powell, according to BlockBeats. The Wall Street Journal, citing informed sources, reported on February 27 that U.S. prosecutors, led by Jeanine Pirro, a close ally of U.S. President Donald Trump, are investigating Powell for allegedly making false statements to Congress regarding a Federal Reserve building renovation project last summer.\n\nPowell has publicly responded to the investigation, stating in a video message on January 11 that the probe is a guise for Trump's ongoing pressure on the Federal Reserve to lower interest rates and undermine the central bank's independence.\n\nIn a confidential legal process, the Federal Reserve is seeking a judge's intervention to quash the subpoenas, aiming to reduce or eliminate its obligation to respond. The specific legal arguments remain undisclosed. It is not uncommon for subpoena recipients in high-profile investigations to challenge the scope of prosecutors' demands or claim legal privilege over certain information.\n\nThe legal battle is unfolding quietly due to confidentiality rules applicable to grand jury criminal investigations, keeping the proceedings out of the public eye.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051320&language=en-US",
            "pub_date": "2026-02-27 08:23:35",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051319,
            "title": "Meta's AI Systems Overwhelm Law Enforcement with Low-Quality Reports",
            "description": "Meta's artificial intelligence systems are inundating law enforcement agencies with a surge of low-quality child abuse reports, according to NS3.AI. This influx is overwhelming investigators and hindering progress in addressing genuine cases. The sharp rise in automated tips comes after expanded legal reporting requirements, but the quality of these reports has been compromised, resulting in numerous false positives.\n\nLaw enforcement officers have expressed concerns that the replacement of human moderators with AI has exacerbated the problem, diminishing the efficiency of investigations and affecting morale. The reliance on AI-generated reports has led to a significant increase in workload, with many reports requiring additional verification due to inaccuracies.\n\nThe situation highlights the challenges faced by law enforcement in adapting to technological advancements while maintaining the effectiveness of their operations. As the volume of reports continues to grow, there is a pressing need for improved systems that can accurately filter and prioritize genuine cases, ensuring that resources are allocated effectively to protect vulnerable individuals.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051319&language=en-US",
            "pub_date": "2026-02-27 08:24:04",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051318,
            "title": "Rachel Reeves to Provide Update on UK Economy",
            "description": "Rachel Reeves is set to deliver an update on the UK economy next week. Bloomberg posted on X that this update aims to address ongoing speculation surrounding recent fiscal events. Reeves' approach is expected to be low-key, focusing on providing clarity and stability in the economic outlook. This comes amid a backdrop of twice-yearly fiscal events that have often been surrounded by speculation and uncertainty. The update is anticipated to offer insights into the current state of the economy and future expectations.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051318&language=en-US",
            "pub_date": "2026-02-27 08:26:23",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051316,
            "title": "BlockTower Capital founder: Market makers primarily influence intraday fluctuations; the main reason for the BTC pullback is selling by early holders.",
            "description": "Ari Paul, founder of BlockTower Capital, stated that market makers may indeed engage in short-term trading in weak market conditions, such as slightly manipulating MSFT or BTC by about 2% to trigger stop-loss orders. However, such behavior is typically intraday speculation, with prices often returning to normal within seconds or minutes, having limited impact on the long-term trend of highly liquid assets like Bitcoin ETFs. He pointed out that the main reason for this round of BTC decline was the selling of tens of thousands of BTC by early holders, coupled with insufficient market buying. Ari Paul believes that while long-term large-scale manipulation is not entirely impossible, it is less likely and carries higher risk. In most cases, market deviations from expectations should not be simply attributed to \"manipulation,\" and investors should optimize their analytical frameworks. Furthermore, compared to \"downward manipulation,\" \"upward manipulation\" is more common across many asset classes.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051316&language=en-US",
            "pub_date": "2026-02-27 08:14:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051315,
            "title": "ASML's Next-Generation EUV Lithography Machine Ready for Mass Production",
            "description": "ASML, the Dutch manufacturer of lithography equipment, has announced that its new generation of extreme ultraviolet (EUV) lithography machines is ready for mass production. According to Jin10, the company's Chief Technology Officer, Marco Peters, stated that the machine has processed approximately 500,000 silicon wafers with minimal downtime and meets production standards for pattern precision. The unit price of the new equipment is around $400 million, double that of the initial EUV model.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051315&language=en-US",
            "pub_date": "2026-02-27 08:10:12",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051314,
            "title": "Billionaire David Martinez's Attempt to Acquire Altos Hornos de Mexico Fails",
            "description": "Billionaire David Martinez's bid to purchase the struggling steelmaker Altos Hornos de Mexico was unsuccessful, as a judge declared the auction deserted on Thursday. Bloomberg posted on X, highlighting the challenges faced by the company in attracting buyers amid its financial difficulties. The auction was intended to find a new owner for the steelmaker, which has been grappling with economic issues. Despite Martinez's interest, the lack of other bidders led to the auction being declared void. The steelmaker's future remains uncertain as it continues to seek solutions to its ongoing financial troubles.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051314&language=en-US",
            "pub_date": "2026-02-27 08:10:33",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051313,
            "title": "GEOPOLITICS | Pakistan Defense Minister Criticizes Taliban's Alignment with India",
            "description": "Pakistan's Defense Minister has expressed concerns over the Taliban's growing alignment with India, despite Pakistan's extensive diplomatic efforts. According to Jin10, the minister highlighted the challenges faced by Pakistan in navigating regional dynamics, emphasizing the Taliban's role as an agent for India. This development adds complexity to the geopolitical landscape, impacting Pakistan's foreign policy strategies and regional stability.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051313&language=en-US",
            "pub_date": "2026-02-27 08:12:10",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}