{
    "data": [
        {
            "id": 734625,
            "title": "Rho Labs Completes $4 Million Seed Round, Led by CoinFund",
            "description": "Odaily Planet Daily News: Rho Labs, founded by former Copper Chief Product Officer Alex Ryvkin, announced the completion of a US$4 million seed round of financing, led by CoinFund, with participation from Auros, Flow Traders and Speedinvest. The company had completed a US$2.2 million Pre-Seed round of financing in 2023, led by Speedinvest, with participation from Keyrock, Re7 Capital, Daedalus Collective and Copper CEO Dmitry Tokarev.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734625&language=en-US",
            "pub_date": "2025-02-05 23:52:56",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734624,
            "title": "Messari Releases Solana Ecosystem 2024 Q4 Report: DeFi TVL Reaches $8.6 Billion",
            "description": "Odaily Planet Daily News Messari released Solana's 2024 Q4 report, which disclosed: \nSolana ecosystem DeFi TVL reached 8.6 billion US dollars (+64%), surpassing Tron to become the second largest public chain, with on-chain application revenue of 840 million US dollars (+213%); \nSolana ecosystem's average daily DEX trading volume is 3.3 billion US dollars (+150%), and Jupiter accounts for 38% of the market share, mainly due to Memecoin and AI token transactions; \nSolana ecosystem stablecoin market value is 5.1 billion US dollars (+36%), USDC accounts for 75%, and USDT increases to 912 million US dollars. \nIn addition, Visa expands SolanaUSDC settlement, and Grayscale submits SolanaETF application. Overall, Solana ecosystem growth is strong and institutional adoption is accelerating.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734624&language=en-US",
            "pub_date": "2025-02-05 23:58:44",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734618,
            "title": "Pudgy Penguins CEO: $PENGU application has officially ended",
            "description": "Odaily Planet Daily News: Luca Netz, CEO of the NFT project \"Fat Penguin\" Pudgy Penguins, announced on the X platform that the $PENGU application has officially ended.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734618&language=en-US",
            "pub_date": "2025-02-05 23:48:11",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734611,
            "title": "U.S. Senate Committee Approves Nomination Of Commerce Secretary",
            "description": "According to PANews, the U.S. Senate Committee has voted to approve the nomination of Howard Lutnick as the Secretary of Commerce. The committee's decision was reached with 16 votes in favor and 12 against. This approval marks a significant step in the confirmation process for Lutnick, who was nominated by U.S. President Donald Trump. The nomination will now proceed to the full Senate for further consideration.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734611&language=en-US",
            "pub_date": "2025-02-05 23:33:45",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734610,
            "title": "Fed's Barkin Highlights Conditions for Potential Rate Hikes",
            "description": "According to Odaily, Federal Reserve official Thomas Barkin stated that any decision to raise interest rates would depend on evidence of an overheating economy. He remains confident that inflation will gradually return to the Federal Reserve's 2% target. Barkin also noted that the U.S. labor market might shift towards either increased hiring or layoffs, indicating that it has stabilized.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734610&language=en-US",
            "pub_date": "2025-02-05 23:33:54",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734609,
            "title": "Moonbeam Foundation Launches DataHaven, a High-Performance Storage Chain for AI Applications",
            "description": "Odaily Planet Daily News: The Moonbeam Foundation recently officially announced its strategic plan to expand into the Ethereum ecosystem. The first step will be to cooperate with EigenLayer to introduce high-performance decentralized storage capabilities to the Ethereum ecosystem, especially focusing on meeting the storage needs of AI applications.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734609&language=en-US",
            "pub_date": "2025-02-05 23:38:03",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734598,
            "title": "Several US unions apply for a temporary injunction to ask the Treasury Department to stop providing personal and financial data to DOGE",
            "description": "Odaily Planet Daily News: Several American unions have applied to the court for a temporary injunction, requiring the Treasury Department to stop providing citizens' personal and financial data to Musk's Office of Government Efficiency (DOGE) and to recover the leaked information. The lawsuit stated that Scott Bessent, head of the Treasury Department, allowed DOGE to access the federal payment system, which contains confidential data of taxpayers, government employees and companies, which is suspected of being illegal. The union believes that this data sharing violates the privacy of members and asks the court to intervene and suspend related operations before the case is decided.\nThe Treasury Department responded that DOGE only has \"read-only\" permissions and the data is encrypted and will not affect the government payment process. But the union warned that if emergency measures are not taken, members' privacy may face irreversible infringement. (Bloomberg)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734598&language=en-US",
            "pub_date": "2025-02-05 23:20:36",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734597,
            "title": "Fed's Barkin: Justification for rate hikes must rely on evidence of overheating economy",
            "description": "Odaily Planet Daily News: Fed's Barkin said that the reason for raising interest rates must rely on evidence of economic overheating. He still believes that inflation will fall back to the Fed's 2% target, and the job market may move towards more hiring or layoffs. The U.S. labor market has stabilized. (Jinshi)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734597&language=en-US",
            "pub_date": "2025-02-05 23:23:36",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734596,
            "title": "U.S. Senate committee approves Howard Lutnick's nomination for U.S. Commerce Secretary",
            "description": "Odaily Planet Daily News The U.S. Senate Committee voted 16 in favor and 12 against to approve the nomination of Howard Lutnick, the nominee for U.S. Secretary of Commerce. (Jinshi) It is reported that Howard Lutnick is a public supporter of Bitcoin and the CEO of New York brokerage Cantor Fitzgerald, which earns fees by managing billions of dollars worth of U.S. Treasury bonds for Tether, a company that issues stablecoins. He said at the Bitcoin 2024 conference in July this year: \"Do I own Bitcoin? Of course I do. Does Cantor Fitzgerald own Bitcoin? A lot.\"",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734596&language=en-US",
            "pub_date": "2025-02-05 23:25:16",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734589,
            "title": "$BERA is available on Aevo Pre-Launch Market",
            "description": "Odaily Planet Daily News: According to official news, Aevo announced the launch of $BERA on its Pre-Launch market.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734589&language=en-US",
            "pub_date": "2025-02-05 23:12:36",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}