{
    "data": [
        {
            "id": 1054297,
            "title": "The OpenClaw ecosystem is beginning to show revenue growth, with 129 startups generating a total of $283,000 in revenue over the past 30 days.",
            "description": "According to the latest data from TrustMRR, in the past 30 days, 129 startups built on OpenClaw have generated real revenue, totaling $283,000, with an average monthly revenue of approximately $2,200 per company. The company with the highest monthly revenue reached $50,000. In terms of business model distribution, the ecosystem is currently highly concentrated: approximately 80% of companies focus on lowering the barrier to entry for OpenClaw, providing tools, infrastructure, or simplifying access services; only 3-5 companies are truly delving into application-layer development and exploring specific industry scenarios, indicating that overall business scenario exploration is still in its early stages.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054297&language=en-US",
            "pub_date": "2026-03-01 15:15:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054299,
            "title": "Nvidia Supports Development of AI-Driven 6G Networks",
            "description": "Nvidia is actively contributing to the development of 6G phone networks to ensure they offer a robust platform for AI-driven services and devices. Bloomberg posted on X, highlighting Nvidia's commitment to integrating artificial intelligence into future telecommunications infrastructure. The company aims to leverage its expertise in AI to enhance the capabilities of 6G networks, which are expected to revolutionize mobile connectivity and enable advanced applications. Nvidia's involvement underscores the growing importance of AI in shaping next-generation technologies and its potential impact on the telecommunications industry.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054299&language=en-US",
            "pub_date": "2026-03-01 15:16:30",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054301,
            "title": "6 Polymarket traders net $1M on US-Iran strike, spark insider fears: Report",
            "description": "The newly created Polymarket wallets placed bets on the timing of a US strike against Iran, buying shares hours before the first explosions were reported in Tehran.\nsource: https://cointelegraph.com/news/polymarket-traders-1m-us-iran-strike-insider-trading-concerns?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054301&language=en-US",
            "pub_date": "2026-03-01 15:16:30",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054298,
            "title": "GEOPOLITICS | Drone Attacks Target U.S. Bases in Iraq",
            "description": "A militant group under the \"Iraqi Islamic Resistance Movement\" announced on March 1 that it launched a drone attack on a U.S. military base in Erbil, the capital of the Kurdistan region in northern Iraq. According to Odaily, the group stated the attack was in support of Iran's resistance against U.S. and Israeli aggression and aimed to defend Iraq's national sovereignty.\n\nThe organization also released a statement on February 28, claiming it had conducted 16 drone attacks on U.S. military bases located in Iraq and other parts of the Middle East. The group emphasized its commitment to resisting foreign intervention in the region.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054298&language=en-US",
            "pub_date": "2026-03-01 15:17:45",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054290,
            "title": "Iraqi armed groups claim to have attacked US military bases",
            "description": "An armed group affiliated with the Iraqi Islamic Resistance Movement issued a statement on March 1st, claiming that \"in support of Iran's resistance against US and Israeli aggression and to defend Iraq's national sovereignty,\" it launched a drone attack that day on a US military base in Erbil, the capital of the Kurdistan Region in northern Iraq. The group also issued a statement on February 28th, claiming that it had launched dozens of drones that day to carry out 16 attacks on US military bases in Iraq and other parts of the Middle East. (Xinhua)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054290&language=en-US",
            "pub_date": "2026-03-01 15:06:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054292,
            "title": "UK's Economic Strategy Mirrors French Model Amid Rising Labor Costs",
            "description": "The United Kingdom's economic growth strategy is increasingly resembling that of France, characterized by escalating labor costs and increased business investment in capital. Bloomberg posted on X, highlighting the similarities between the two nations' approaches to economic development. The UK's focus on boosting productivity through capital expenditure is drawing parallels with France's economic policies. This shift comes as businesses in the UK face mounting pressure from rising wages, prompting a reevaluation of growth strategies. The alignment with France's model suggests a strategic pivot in the UK's economic planning, aiming to enhance competitiveness and sustain growth in the face of evolving economic challenges.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054292&language=en-US",
            "pub_date": "2026-03-01 15:06:43",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054291,
            "title": "High-Risk Bitcoin and Solana Leverage Positions Near Liquidation",
            "description": "A Bitcoin address has initiated a high-risk leverage position, according to ChainCatcher. The address, identified as 0xdf1…6f0b0, opened a 40x long leverage position on 1,000 BTC at 10:30 AM today, valued at $66.83 million, with an entry price of $67,167 and a liquidation price of $66,559. The position is currently $390 away from liquidation, with an unrealized loss of $228,900.\n\nIn addition to the Bitcoin position, the address holds a 20x long leverage position on Solana (SOL), which is currently showing an unrealized profit of $810,000. The total historical profit for this address stands at $775,300.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054291&language=en-US",
            "pub_date": "2026-03-01 15:13:36",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054288,
            "title": "GEOPOLITICS | Smoke Rises Near U.S. Military Base in Middle East",
            "description": "Smoke has been observed rising near the U.S. military's largest base in the Middle East, Al Udeid Air Base. According to Jin10, the incident has raised concerns about potential security threats in the region. The base, located in Qatar, serves as a strategic hub for U.S. military operations in the Middle East. The cause of the smoke is currently unknown, and investigations are underway to determine the source and any potential implications for regional stability. The situation is being closely monitored by military officials and local authorities.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054288&language=en-US",
            "pub_date": "2026-03-01 14:54:09",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054287,
            "title": "Clawnch Partners with Bankr for Future Token Launches",
            "description": "Clawnch has announced a strategic partnership with Bankr on the X platform. According to Odaily, Bankr will serve as the foundational launch platform for all future token issuances by Clawnch and Clawncher. Additionally, Bankr's LLM gateway will be integrated into Clawnch's upcoming crypto-native OpenClaw fork project, OpenClawnch, as a core component. Further integration details will be disclosed later. The migration process is currently underway, and the fees for new project issuances will be moderately increased. Clawnch is a token launch and governance platform focused on the AI Agent economy on the Base chain. This collaboration aims to further strengthen its infrastructure ecosystem.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054287&language=en-US",
            "pub_date": "2026-03-01 15:02:18",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054281,
            "title": "Renewable Energy Producers in Tokyo Asked to Reduce Output Amid Supply Concerns",
            "description": "A unit of Tokyo Electric Power has instructed renewable-energy producers to reduce their output for a five-hour period on Sunday. Bloomberg posted on X that this decision comes as electricity supply is expected to exceed demand. The move highlights the challenges faced by energy providers in balancing supply and demand, particularly in regions with significant renewable energy production. The temporary curtailment aims to prevent an oversupply situation that could destabilize the grid. This action underscores the ongoing efforts to manage energy resources efficiently while integrating renewable sources into the existing infrastructure.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054281&language=en-US",
            "pub_date": "2026-03-01 14:48:32",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054282,
            "title": "AI agent launchpad Clawnch has partnered with Bankr, which will serve as the underlying launcher for its token issuance.",
            "description": "Clawnch announced a strategic partnership with @bankrbot on the X platform. Bankr will serve as the underlying launch platform for all subsequent token issuances of Clawnch and Clawncher. Simultaneously, Bankr's LLM gateway will be integrated into the core component of OpenClawnch, Clawnch's upcoming crypto-native OpenClaw fork project. More integration details will be announced later. The migration is currently progressing smoothly, and the issuance fee for the new project will be moderately increased. Clawnch is a token issuance and governance platform on the Base chain focused on AI Agent economics; this partnership aims to further strengthen its closed-loop infrastructure.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054282&language=en-US",
            "pub_date": "2026-03-01 14:53:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054280,
            "title": "GEOPOLITICS | U.S. Consulate in Karachi Attacked Amid Protests",
            "description": "The U.S. Consulate in Karachi, Pakistan, was attacked by protesters who breached the premises and caused damage to the building. According to Jin10, parts of the consulate were set on fire during the incident. The attack highlights rising tensions and unrest in the region. Authorities are investigating the situation to assess the extent of the damage and ensure the safety of diplomatic staff.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054280&language=en-US",
            "pub_date": "2026-03-01 14:53:08",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054275,
            "title": "GEOPOLITICS | Iranian Armed Forces Chief of Staff Abdulrahim Mousavi Assassinated",
            "description": "Iranian Armed Forces Chief of Staff Abdulrahim Mousavi has been assassinated. According to Jin10, the incident was reported by Iranian television. The circumstances surrounding the assassination remain unclear, and further details are awaited from official sources. The event marks a significant development in the region, potentially impacting geopolitical dynamics.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054275&language=en-US",
            "pub_date": "2026-03-01 14:34:30",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054276,
            "title": "Binance issues security alert to its employees in the UAE",
            "description": "According to market sources, due to the escalating situation in the Middle East, Binance has issued an internal security alert, requiring employees in the UAE to remain in safe indoor areas and avoid near windows, doors, and open spaces. Reports indicate that Iran recently launched ballistic missiles and drones at Israeli and US targets, some of which flew in the direction of the UAE. Although most were intercepted, the UAE has issued security warnings to its residents. The situation continues to develop.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054276&language=en-US",
            "pub_date": "2026-03-01 14:36:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054274,
            "title": "GEOPOLITICS | Iranian Attack Sparks Fire at Dubai Port, Raising Regional Security Concerns",
            "description": "An Iranian attack has resulted in substantial damage to infrastructure and landmarks in the United Arab Emirates, with a major fire breaking out at Dubai Port. According to NS3.AI, this incident has heightened worries about regional security and the potential for disruptions in trade and economic activities. The repercussions of the attack could have wider implications for markets linked to the UAE's strategic port facilities.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054274&language=en-US",
            "pub_date": "2026-03-01 14:37:01",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054273,
            "title": "Elon Musk Responds to Iranian Leader's Post with Criticism",
            "description": "Elon Musk recently revisited a previous interaction with a post from Iran's late Supreme Leader Khamenei. According to Jin10, on January 3, Khamenei had posted a message stating, 'We will never surrender to the enemy.' Musk responded in Persian on January 4, calling it 'ridiculous delusion.' Today, Musk shared his January 4 response again, adding, 'That's how it is.'",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054273&language=en-US",
            "pub_date": "2026-03-01 14:39:50",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054271,
            "title": "Details of the \"decapitation\" revealed: Approximately 30 bombs were dropped on Khamenei's residence.",
            "description": "A report published by The Wall Street Journal on Saturday evening (February 28th) revealed details of the killing of Iranian Supreme Leader Ayatollah Khamenei in a US-Israeli attack. The report stated that Israeli and US military intelligence had been watching and waiting for a \"rare opportunity\"—a meeting of Iran's senior political and military leaders—to launch an attack that would simultaneously kill them. This opportunity finally arrived on Saturday. The report stated that when the US and Israel discovered three such meetings were taking place that day, they launched the attack during the day—approximately 30 bombs were dropped on Khamenei's residence. (Jin Shi)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054271&language=en-US",
            "pub_date": "2026-03-01 14:26:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054272,
            "title": "Dubai port was affected by Iranian attacks, and a raging fire broke out.",
            "description": "Iranian attacks damaged infrastructure and landmarks in the United Arab Emirates, with a massive fire breaking out at the Dubai port. (WSJ)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054272&language=en-US",
            "pub_date": "2026-03-01 14:26:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054270,
            "title": "GEOPOLITICS | California Governor Newsom Criticizes Trump Over War Actions",
            "description": "California Governor Gavin Newsom has accused U.S. President Donald Trump of misleading the American public. According to Jin10, Newsom stated that Trump's reckless and unlawful war lacks a clear plan for resolution and fails to address existential threats. Newsom's comments highlight ongoing political tensions and criticisms surrounding Trump's foreign policy decisions.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054270&language=en-US",
            "pub_date": "2026-03-01 14:28:47",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054269,
            "title": "Bubblemaps Flags 6 Polymarket Wallets That Profited $1.2M Betting on Feb. 28 U.S. Strike on Iran",
            "description": "CoinDesk reported that on-chain analytics firm Bubblemaps identified six wallets that collectively made about $1.2 million by betting on Polymarket that a U.S. strike on Iran would occur by Feb. 28—the same day the strikes happened. Bubblemaps said most of the wallets were funded within 24 hours of the attack, focused on the specific Feb. 28 contract rather than broader time windows, and bought “Yes” shares hours before the operation began. The largest wallet allegedly turned roughly $61,000 into more than $493,000 in profit, while another made about $120,000 from a $30,000 position. The activity has fueled scrutiny over optics around prediction markets. Polymarket later added a note to its Middle East markets saying prediction markets aim to aggregate crowd information into accurate, unbiased forecasts and, after speaking with people affected by the attacks, argued such markets can provide answers that TV news and X may not.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054269&language=en-US",
            "pub_date": "2026-03-01 14:31:13",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}