{
    "data": [
        {
            "id": 734567,
            "title": "1,239,940,928,235 SHIBs transferred out from Kraken, worth over $20 million",
            "description": "Odaily Planet Daily reported that according to Whale Alert monitoring, 1,239,940,928,235 SHIBs were transferred out from Kraken, worth US$20,136,020.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734567&language=en-US",
            "pub_date": "2025-02-05 22:53:35",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734566,
            "title": "1,155,431 #TRUMP transferred out of Kraken, worth over $23 million",
            "description": "Odaily Planet Daily News According to Whale Alert monitoring, 1,155,431 #TRUMP were transferred out of the cryptocurrency exchange Kraken, worth US$23,166,972.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734566&language=en-US",
            "pub_date": "2025-02-05 22:55:25",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734565,
            "title": "A whale withdrew 326,000 $UNI from Binance 5 minutes ago, worth $3.05 million",
            "description": "Odaily Planet Daily News: According to monitoring by on-chain analyst Yu Jin, a whale withdrew 326,000 $UNI from Binance 5 minutes ago, worth 3.05 million US dollars. He has accumulated a total of 1.183 million UNI (about 11.31 million US dollars) in the past two days, with an average price of 9.55 US dollars.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734565&language=en-US",
            "pub_date": "2025-02-05 22:56:43",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734564,
            "title": "PlanB: S2F model shows Bitcoin entering a FOMO phase of sharp rise",
            "description": "Odaily Planet Daily News: Crypto analyst PlanB said that nearly a year after the halving, the red dot of Bitcoin on the S2F model turned orange (and then yellow), which means that the market has entered the second stage of the bull market, the FOMO stage of a sharp rise.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734564&language=en-US",
            "pub_date": "2025-02-05 22:59:29",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734557,
            "title": "CoinDesk 20 Index Sees Modest Gains Amid Mixed Asset Performance",
            "description": "According to CoinDesk, the CoinDesk 20 Index experienced a slight increase in its latest market update, reflecting a 0.2% rise to 3310.92 points as of 4 p.m. ET on Tuesday. This performance highlights the mixed results among the assets within the index, with fourteen out of twenty assets showing positive movement.\n\nAmong the top performers, AAVE led the gains with a notable increase of 6.9%, followed by Litecoin (LTC), which rose by 3.7%. These assets contributed significantly to the overall upward trend of the index. However, not all assets shared in the positive momentum. XRP and SUI both experienced declines, each falling by 1.2%, marking them as the laggards in this trading session.\n\nThe CoinDesk 20 Index is a comprehensive benchmark that tracks the performance of twenty leading digital assets. It is traded across various platforms and regions worldwide, providing a broad perspective on the cryptocurrency market's movements. This index serves as a key indicator for investors and analysts monitoring the digital asset space, offering insights into the market's current trends and dynamics.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734557&language=en-US",
            "pub_date": "2025-02-05 22:43:49",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734556,
            "title": "Bitcoin Rebounds Above 99000 USDT",
            "description": "According to Odaily, Bitcoin has experienced a rebound, surpassing the 99000 USDT mark. Currently, it is trading at 99025.3 USDT. The 24-hour decline has narrowed to 1.07%.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734556&language=en-US",
            "pub_date": "2025-02-05 22:44:03",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734554,
            "title": "In the past 4 hours, the entire network has blown up more than 25 million US dollars, mainly short orders",
            "description": "Odaily Planet Daily reported that Coinglass data showed that in the past 4 hours, the entire network had a liquidation of 25.7215 million US dollars, of which long positions were liquidated for 7.2489 million US dollars and short positions were liquidated for 18.4727 million US dollars.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734554&language=en-US",
            "pub_date": "2025-02-05 22:45:59",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734553,
            "title": "The Sandbox team’s associated address deposited 5 million $SAND to Binance one hour ago",
            "description": "Odaily Planet Daily News According to ai_9684xtpa monitoring, the address associated with The Sandbox team recharged 5 million $SAND to Binance an hour ago, worth $2.06 million. The source of funds for this address is the address 0x010...fCc90, which received 15 million tokens (about $10.52 million) transferred from the Sandbox multi-signature address a month ago and distributed them to multiple addresses. $SAND has fallen 41% in the past month.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734553&language=en-US",
            "pub_date": "2025-02-05 22:46:32",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734540,
            "title": "Galaxy announces new fund, Galaxy Absolute Return Fund",
            "description": "Odaily Planet Daily News: Digital asset management company Galaxy announced the launch of a new fund, Galaxy Absolute Return Fund, on the X platform. The fund will actively manage investment exposure to the digital asset ecosystem and disruptive technologies, providing stock-like volatility without directly holding crypto tokens.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734540&language=en-US",
            "pub_date": "2025-02-05 22:30:02",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734539,
            "title": "The three major U.S. stock indexes fell at the opening, and MicroStrategy fell 0.43%",
            "description": "Odaily Planet Daily News: The three major U.S. stock indexes fell at the opening, with the Dow Jones Industrial Average down 16 points, the S&P 500 down 0.21%, and the Nasdaq down 0.64%. MicroStrategy fell 0.43%, and Coinbase rose 1%.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734539&language=en-US",
            "pub_date": "2025-02-05 22:36:11",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}