{
    "data": [
        {
            "id": 733316,
            "title": "Ethereum increases gas limit for the first time since proof-of-stake migration",
            "description": "Ethereum increased the network’s gas limit above 30 million, with over 50% of validators indicating the change.\nsource: https://www.theblock.co/post/338698/ethereum-increases-gas-limit-for-the-first-time-since-proof-of-stake-migration?utm_source=rss&utm_medium=rss",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733316&language=en-US",
            "pub_date": "2025-02-04 16:09:07",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733329,
            "title": "Ethereum raises gas limit for first time since switching to proof-of-stake",
            "description": "Odaily Planet Daily News Ethereum has reached the consensus required to increase the network's Gas limit, with 50% of validators supporting the change to help improve the network's scalability. The Gas limit is a key parameter that determines the network's transaction capacity. Previously, the Gas limit was capped at 30 million, and now it has exceeded 31 million. The Gas limit adjustment requires approval from more than half of the validators to take effect, and this adjustment was completed yesterday. Once more than 50% of validators express support, the block Gas limit will be automatically adjusted without a hard fork. This is the first time Ethereum has implemented such a change under the Proof of Stake (PoS) consensus mechanism. The last adjustment occurred in 2021, when the Gas limit doubled from 15 million units to 30 million units. According to gaslimit.pics, the average Gas limit over the past 24 hours was 31.5 million units, and it is expected to be adjusted to a maximum of 36 million units. Although the Dencun upgrade and proto-dank sharding technology have recently improved scalability, increasing the gas limit is still necessary as the demand and complexity of Ethereum decentralized applications increase. (The Block)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733329&language=en-US",
            "pub_date": "2025-02-04 16:18:48",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733315,
            "title": "Megabit will launch VVV/USDT contract trading",
            "description": "Odaily Planet Daily News According to official news, Megabit will officially launch VVV/USDT contract trading at 18:00 (SGT) on February 4.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733315&language=en-US",
            "pub_date": "2025-02-04 16:04:46",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733314,
            "title": "BitMEX has launched S spot trading",
            "description": "Odaily Planet Daily News According to the official announcement, BitMEX has launched S spot trading, and deposits, trading and exchange of S are now open.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733314&language=en-US",
            "pub_date": "2025-02-04 16:08:17",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733302,
            "title": "The suspected Movement team address deposited 1,824 ETH into Binance 30 minutes ago",
            "description": "The Data Nerd's monitoring shows that the suspected Movement team address deposited 1,824 ETH (about 4.97 million US dollars) into Binance 30 minutes ago. These ETH were removed from the liquidity pool last week.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733302&language=en-US",
            "pub_date": "2025-02-04 16:00:23",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733301,
            "title": "Dovey: I was not aware of Binance's launch of Hooked Protocol in advance. Primitive's unlocking cycle is the same as other VCs",
            "description": "In response to questions about Hooked Protocol's investment share and token unlocking, Dovey Wan, founding partner of Primitive Ventures, responded in the community Space today that Primitive Ventures' valuation when investing in Hooked Protocol was $30 million, and the token unlocking cycle is the same as other VCs, starting at the end of 2023.\nDovey added that due to the sensitive relationship with Jason, the founder of Hooked Protocol (the two were once lovers), he deliberately did not participate too much in the project, and even after Binance officially announced the launch of Hooked Protocol, he was surprised \"why the product was launched so early.\"",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733301&language=en-US",
            "pub_date": "2025-02-04 16:02:08",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733299,
            "title": "BNB Drops Below 570 USDT with a 0.93% Decrease in 24 Hours",
            "description": "On Feb 04, 2025, 07:48 AM(UTC). According to Binance Market Data, BNB has dropped below 570 USDT and is now trading at 569.849976 USDT, with a narrowed 0.93% decrease in 24 hours.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733299&language=en-US",
            "pub_date": "2025-02-04 15:48:37",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733298,
            "title": "Pixion Games Secures $12.4 Million Funding For Fableborne Launch",
            "description": "According to Odaily, Pixion Games, the studio behind the Web3 action role-playing game Fableborne, has successfully raised $12.4 million in its latest funding round. The round was led by Delphi Ventures, with participation from Animoca Brands, Yield Guild Games (YGG), and Sky Mavis, the creators of Axie Infinity. This funding is intended to support the launch of the POWER token later this year. Fableborne is a free-to-play Web3 action RPG built on the Ronin blockchain and is currently in its first season of development.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733298&language=en-US",
            "pub_date": "2025-02-04 15:52:16",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733297,
            "title": "Eric Trump Advocates For Increased ETH Holdings",
            "description": "According to Foresight News, Eric Trump, the younger son of U.S. President Donald Trump, recently stated on social media that \"now is the best time to increase ETH holdings.\"",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733297&language=en-US",
            "pub_date": "2025-02-04 15:53:51",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733294,
            "title": "Tron and Movement Labs Deny Involvement in WLFI Token Swap",
            "description": "According to Odaily, Tron has clarified that it did not participate in the token swap agreement proposed by the WLFI crypto project, which is associated with U.S. President Donald Trump's initiatives. A Tron spokesperson informed CoinDesk that the company was not involved in any such token exchange. Similarly, Rushi Manche, co-founder of Movement Labs, stated earlier to CoinDesk that no tokens were sent to anyone, including WLFI. Manche emphasized that there were no transactions or backdoor deals, describing the situation as purely market-driven purchases.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733294&language=en-US",
            "pub_date": "2025-02-04 15:40:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}