{
    "data": [
        {
            "id": 1054316,
            "title": "US Judge Lets Binance Unregistered Token Class Action Proceed",
            "description": "A US judge rejected Binance’s attempt to force arbitration, allowing a class action over alleged unregistered token sales to proceed in court.\nsource: https://cryptonews.com/news/us-judge-lets-binance-unregistered-token-class-action-proceed/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054316&language=en-US",
            "pub_date": "2026-03-01 15:47:26",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054315,
            "title": "Elon Musk's Social Media Exchange Highlights Geopolitical Tensions",
            "description": "Elon Musk recently revisited a past social media exchange with Iran's late Supreme Leader Khamenei, reigniting discussions on geopolitical tensions. According to NS3.AI, the original interaction featured Khamenei asserting resistance against adversaries, to which Musk responded by calling it a 'ridiculous fantasy.' While this exchange underscores ongoing geopolitical issues, it does not directly influence the cryptocurrency market.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054315&language=en-US",
            "pub_date": "2026-03-01 15:49:07",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054314,
            "title": "Saudi Stock Market Index Narrows Decline to 1.6% on March 1",
            "description": "On March 1, the Saudi Arabian stock market index (TASI) saw its decline narrow to 1.6%. According to BlockBeats, shares of banks such as Saudi National Bank and Riyad Bank experienced a downturn, while Saudi Aramco's stock rose by more than 2%.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054314&language=en-US",
            "pub_date": "2026-03-01 15:52:27",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054313,
            "title": "UPDATE: BTC leverage is heavily skewed with ~$8B in shorts and less than $200M in longs.",
            "description": "null\nsource: https://x.com/cointelegraph/status/2028009956180435077",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054313&language=en-US",
            "pub_date": "2026-03-01 15:30:26",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054312,
            "title": "List of Altcoins with the Highest Number of Active Users Revealed",
            "description": "Following recent developments in the cryptocurrency market, which altcoins appear to have a more robust user base? Continue Reading: List of Altcoins with the Highest Number of Active Users Revealed\nsource: https://en.bitcoinsistemi.com/list-of-altcoins-with-the-highest-number-of-active-users-revealed/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054312&language=en-US",
            "pub_date": "2026-03-01 15:38:10",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054310,
            "title": "Indonesia to Implement New Palm Oil Export Tax Rate from March 1",
            "description": "Indonesia is set to introduce a new export tax rate for palm oil, effective March 1. According to Jin10, this regulatory change aims to adjust the financial framework surrounding the country's significant palm oil industry. The new tax rate is part of Indonesia's broader strategy to manage its agricultural exports and maintain economic stability. The palm oil sector is a crucial component of Indonesia's economy, and the updated tax policy reflects the government's efforts to optimize revenue from this vital industry. The implementation of the new tax rate is expected to impact both domestic producers and international buyers, influencing market dynamics and trade flows.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054310&language=en-US",
            "pub_date": "2026-03-01 15:43:56",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054306,
            "title": "Qatari LNG exports pause as Hormuz risks lift war premiums",
            "description": "UKMTO updates show vessels pausing or deviating after radio warnings; impacts span Strait of Hormuz, Qatari LNG exports, war-risk insurance. Premiums rising.\nsource: https://coincu.com/news/qatari-lng-exports-pause-as-hormuz-risks-lift-war-premiums/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054306&language=en-US",
            "pub_date": "2026-03-01 15:26:54",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054305,
            "title": "U.S. Spot Crypto ETFs Posted $932 Million in Net Inflows During Week 9: BlackRock Led With $503 Million",
            "description": "U. S. spot cryptocurrency ETFs recorded approximately $932 million in net inflows during the trading week of February 23 to 27, 2026, with BlackRock’s IBIT accounting for $503 million of the Bitcoin category total and the week representing the first green weekly bar in the SoSoValue flow chart after five consecutive weeks of net outflows. The […] The post U\nsource: https://www.ethnews.com/u-s-spot-crypto-etfs-posted-932-million-in-net-inflows-during-week-9-blackrock-led-with-503-million/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054305&language=en-US",
            "pub_date": "2026-03-01 15:28:15",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054304,
            "title": "GEOPOLITICS | Pakistani Police Use Tear Gas on Protesters Outside U.S. Consulate in Karachi",
            "description": "Pakistani police deployed tear gas to disperse protesters gathered outside the U.S. Consulate in Karachi. According to Jin10, the demonstration was part of a larger protest movement in the region. The situation escalated as tensions rose between the protesters and law enforcement. The protestors were reportedly voicing their grievances over various political issues. The use of tear gas was aimed at controlling the crowd and preventing any potential security threats to the consulate. The incident highlights ongoing unrest in the area, reflecting broader geopolitical tensions.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054304&language=en-US",
            "pub_date": "2026-03-01 15:26:14",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054302,
            "title": "Musk retweeted an old post responding to Khamenei's comments.",
            "description": "Musk retweeted an old post he made on January 4th on social media, commenting, \"That's how it is.\" Previously, on January 3rd, the late Iranian Supreme Leader Khamenei posted, \"We will never yield to our enemies,\" to which Musk replied in Persian, \"Absurd fantasy.\"",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054302&language=en-US",
            "pub_date": "2026-03-01 15:29:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054303,
            "title": "OpenClaw-Based Startups Generate Significant Revenue",
            "description": "According to TrustMRR's latest data, over the past 30 days, 129 startups built on OpenClaw have generated a total revenue of $283,000, with an average monthly income of approximately $2,200 per company. The highest monthly revenue recorded by a single company reached $50,000.\n\nAccording to Odaily, the current ecosystem shows a high concentration in business models. Around 80% of these companies focus on lowering the usage threshold of OpenClaw by providing tools, infrastructure, or simplified access services. Only 3 to 5 companies are deeply engaged in application layer development, exploring specific industry scenarios, indicating that the overall exploration of commercial scenarios is still in its early stages.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054303&language=en-US",
            "pub_date": "2026-03-01 15:31:06",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054297,
            "title": "The OpenClaw ecosystem is beginning to show revenue growth, with 129 startups generating a total of $283,000 in revenue over the past 30 days.",
            "description": "According to the latest data from TrustMRR, in the past 30 days, 129 startups built on OpenClaw have generated real revenue, totaling $283,000, with an average monthly revenue of approximately $2,200 per company. The company with the highest monthly revenue reached $50,000. In terms of business model distribution, the ecosystem is currently highly concentrated: approximately 80% of companies focus on lowering the barrier to entry for OpenClaw, providing tools, infrastructure, or simplifying access services; only 3-5 companies are truly delving into application-layer development and exploring specific industry scenarios, indicating that overall business scenario exploration is still in its early stages.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054297&language=en-US",
            "pub_date": "2026-03-01 15:15:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054299,
            "title": "Nvidia Supports Development of AI-Driven 6G Networks",
            "description": "Nvidia is actively contributing to the development of 6G phone networks to ensure they offer a robust platform for AI-driven services and devices. Bloomberg posted on X, highlighting Nvidia's commitment to integrating artificial intelligence into future telecommunications infrastructure. The company aims to leverage its expertise in AI to enhance the capabilities of 6G networks, which are expected to revolutionize mobile connectivity and enable advanced applications. Nvidia's involvement underscores the growing importance of AI in shaping next-generation technologies and its potential impact on the telecommunications industry.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054299&language=en-US",
            "pub_date": "2026-03-01 15:16:30",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054301,
            "title": "6 Polymarket traders net $1M on US-Iran strike, spark insider fears: Report",
            "description": "The newly created Polymarket wallets placed bets on the timing of a US strike against Iran, buying shares hours before the first explosions were reported in Tehran.\nsource: https://cointelegraph.com/news/polymarket-traders-1m-us-iran-strike-insider-trading-concerns?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054301&language=en-US",
            "pub_date": "2026-03-01 15:16:30",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054298,
            "title": "GEOPOLITICS | Drone Attacks Target U.S. Bases in Iraq",
            "description": "A militant group under the \"Iraqi Islamic Resistance Movement\" announced on March 1 that it launched a drone attack on a U.S. military base in Erbil, the capital of the Kurdistan region in northern Iraq. According to Odaily, the group stated the attack was in support of Iran's resistance against U.S. and Israeli aggression and aimed to defend Iraq's national sovereignty.\n\nThe organization also released a statement on February 28, claiming it had conducted 16 drone attacks on U.S. military bases located in Iraq and other parts of the Middle East. The group emphasized its commitment to resisting foreign intervention in the region.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054298&language=en-US",
            "pub_date": "2026-03-01 15:17:45",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054290,
            "title": "Iraqi armed groups claim to have attacked US military bases",
            "description": "An armed group affiliated with the Iraqi Islamic Resistance Movement issued a statement on March 1st, claiming that \"in support of Iran's resistance against US and Israeli aggression and to defend Iraq's national sovereignty,\" it launched a drone attack that day on a US military base in Erbil, the capital of the Kurdistan Region in northern Iraq. The group also issued a statement on February 28th, claiming that it had launched dozens of drones that day to carry out 16 attacks on US military bases in Iraq and other parts of the Middle East. (Xinhua)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054290&language=en-US",
            "pub_date": "2026-03-01 15:06:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054292,
            "title": "UK's Economic Strategy Mirrors French Model Amid Rising Labor Costs",
            "description": "The United Kingdom's economic growth strategy is increasingly resembling that of France, characterized by escalating labor costs and increased business investment in capital. Bloomberg posted on X, highlighting the similarities between the two nations' approaches to economic development. The UK's focus on boosting productivity through capital expenditure is drawing parallels with France's economic policies. This shift comes as businesses in the UK face mounting pressure from rising wages, prompting a reevaluation of growth strategies. The alignment with France's model suggests a strategic pivot in the UK's economic planning, aiming to enhance competitiveness and sustain growth in the face of evolving economic challenges.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054292&language=en-US",
            "pub_date": "2026-03-01 15:06:43",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054291,
            "title": "High-Risk Bitcoin and Solana Leverage Positions Near Liquidation",
            "description": "A Bitcoin address has initiated a high-risk leverage position, according to ChainCatcher. The address, identified as 0xdf1…6f0b0, opened a 40x long leverage position on 1,000 BTC at 10:30 AM today, valued at $66.83 million, with an entry price of $67,167 and a liquidation price of $66,559. The position is currently $390 away from liquidation, with an unrealized loss of $228,900.\n\nIn addition to the Bitcoin position, the address holds a 20x long leverage position on Solana (SOL), which is currently showing an unrealized profit of $810,000. The total historical profit for this address stands at $775,300.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054291&language=en-US",
            "pub_date": "2026-03-01 15:13:36",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054288,
            "title": "GEOPOLITICS | Smoke Rises Near U.S. Military Base in Middle East",
            "description": "Smoke has been observed rising near the U.S. military's largest base in the Middle East, Al Udeid Air Base. According to Jin10, the incident has raised concerns about potential security threats in the region. The base, located in Qatar, serves as a strategic hub for U.S. military operations in the Middle East. The cause of the smoke is currently unknown, and investigations are underway to determine the source and any potential implications for regional stability. The situation is being closely monitored by military officials and local authorities.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054288&language=en-US",
            "pub_date": "2026-03-01 14:54:09",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054287,
            "title": "Clawnch Partners with Bankr for Future Token Launches",
            "description": "Clawnch has announced a strategic partnership with Bankr on the X platform. According to Odaily, Bankr will serve as the foundational launch platform for all future token issuances by Clawnch and Clawncher. Additionally, Bankr's LLM gateway will be integrated into Clawnch's upcoming crypto-native OpenClaw fork project, OpenClawnch, as a core component. Further integration details will be disclosed later. The migration process is currently underway, and the fees for new project issuances will be moderately increased. Clawnch is a token launch and governance platform focused on the AI Agent economy on the Base chain. This collaboration aims to further strengthen its infrastructure ecosystem.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054287&language=en-US",
            "pub_date": "2026-03-01 15:02:18",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}