{
    "data": [
        {
            "id": 1054288,
            "title": "GEOPOLITICS | Smoke Rises Near U.S. Military Base in Middle East",
            "description": "Smoke has been observed rising near the U.S. military's largest base in the Middle East, Al Udeid Air Base. According to Jin10, the incident has raised concerns about potential security threats in the region. The base, located in Qatar, serves as a strategic hub for U.S. military operations in the Middle East. The cause of the smoke is currently unknown, and investigations are underway to determine the source and any potential implications for regional stability. The situation is being closely monitored by military officials and local authorities.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054288&language=en-US",
            "pub_date": "2026-03-01 14:54:09",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054287,
            "title": "Clawnch Partners with Bankr for Future Token Launches",
            "description": "Clawnch has announced a strategic partnership with Bankr on the X platform. According to Odaily, Bankr will serve as the foundational launch platform for all future token issuances by Clawnch and Clawncher. Additionally, Bankr's LLM gateway will be integrated into Clawnch's upcoming crypto-native OpenClaw fork project, OpenClawnch, as a core component. Further integration details will be disclosed later. The migration process is currently underway, and the fees for new project issuances will be moderately increased. Clawnch is a token launch and governance platform focused on the AI Agent economy on the Base chain. This collaboration aims to further strengthen its infrastructure ecosystem.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054287&language=en-US",
            "pub_date": "2026-03-01 15:02:18",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054281,
            "title": "Renewable Energy Producers in Tokyo Asked to Reduce Output Amid Supply Concerns",
            "description": "A unit of Tokyo Electric Power has instructed renewable-energy producers to reduce their output for a five-hour period on Sunday. Bloomberg posted on X that this decision comes as electricity supply is expected to exceed demand. The move highlights the challenges faced by energy providers in balancing supply and demand, particularly in regions with significant renewable energy production. The temporary curtailment aims to prevent an oversupply situation that could destabilize the grid. This action underscores the ongoing efforts to manage energy resources efficiently while integrating renewable sources into the existing infrastructure.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054281&language=en-US",
            "pub_date": "2026-03-01 14:48:32",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054282,
            "title": "AI agent launchpad Clawnch has partnered with Bankr, which will serve as the underlying launcher for its token issuance.",
            "description": "Clawnch announced a strategic partnership with @bankrbot on the X platform. Bankr will serve as the underlying launch platform for all subsequent token issuances of Clawnch and Clawncher. Simultaneously, Bankr's LLM gateway will be integrated into the core component of OpenClawnch, Clawnch's upcoming crypto-native OpenClaw fork project. More integration details will be announced later. The migration is currently progressing smoothly, and the issuance fee for the new project will be moderately increased. Clawnch is a token issuance and governance platform on the Base chain focused on AI Agent economics; this partnership aims to further strengthen its closed-loop infrastructure.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054282&language=en-US",
            "pub_date": "2026-03-01 14:53:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054280,
            "title": "GEOPOLITICS | U.S. Consulate in Karachi Attacked Amid Protests",
            "description": "The U.S. Consulate in Karachi, Pakistan, was attacked by protesters who breached the premises and caused damage to the building. According to Jin10, parts of the consulate were set on fire during the incident. The attack highlights rising tensions and unrest in the region. Authorities are investigating the situation to assess the extent of the damage and ensure the safety of diplomatic staff.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054280&language=en-US",
            "pub_date": "2026-03-01 14:53:08",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054275,
            "title": "GEOPOLITICS | Iranian Armed Forces Chief of Staff Abdulrahim Mousavi Assassinated",
            "description": "Iranian Armed Forces Chief of Staff Abdulrahim Mousavi has been assassinated. According to Jin10, the incident was reported by Iranian television. The circumstances surrounding the assassination remain unclear, and further details are awaited from official sources. The event marks a significant development in the region, potentially impacting geopolitical dynamics.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054275&language=en-US",
            "pub_date": "2026-03-01 14:34:30",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054276,
            "title": "Binance issues security alert to its employees in the UAE",
            "description": "According to market sources, due to the escalating situation in the Middle East, Binance has issued an internal security alert, requiring employees in the UAE to remain in safe indoor areas and avoid near windows, doors, and open spaces. Reports indicate that Iran recently launched ballistic missiles and drones at Israeli and US targets, some of which flew in the direction of the UAE. Although most were intercepted, the UAE has issued security warnings to its residents. The situation continues to develop.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054276&language=en-US",
            "pub_date": "2026-03-01 14:36:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054274,
            "title": "GEOPOLITICS | Iranian Attack Sparks Fire at Dubai Port, Raising Regional Security Concerns",
            "description": "An Iranian attack has resulted in substantial damage to infrastructure and landmarks in the United Arab Emirates, with a major fire breaking out at Dubai Port. According to NS3.AI, this incident has heightened worries about regional security and the potential for disruptions in trade and economic activities. The repercussions of the attack could have wider implications for markets linked to the UAE's strategic port facilities.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054274&language=en-US",
            "pub_date": "2026-03-01 14:37:01",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054273,
            "title": "Elon Musk Responds to Iranian Leader's Post with Criticism",
            "description": "Elon Musk recently revisited a previous interaction with a post from Iran's late Supreme Leader Khamenei. According to Jin10, on January 3, Khamenei had posted a message stating, 'We will never surrender to the enemy.' Musk responded in Persian on January 4, calling it 'ridiculous delusion.' Today, Musk shared his January 4 response again, adding, 'That's how it is.'",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054273&language=en-US",
            "pub_date": "2026-03-01 14:39:50",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054271,
            "title": "Details of the \"decapitation\" revealed: Approximately 30 bombs were dropped on Khamenei's residence.",
            "description": "A report published by The Wall Street Journal on Saturday evening (February 28th) revealed details of the killing of Iranian Supreme Leader Ayatollah Khamenei in a US-Israeli attack. The report stated that Israeli and US military intelligence had been watching and waiting for a \"rare opportunity\"—a meeting of Iran's senior political and military leaders—to launch an attack that would simultaneously kill them. This opportunity finally arrived on Saturday. The report stated that when the US and Israel discovered three such meetings were taking place that day, they launched the attack during the day—approximately 30 bombs were dropped on Khamenei's residence. (Jin Shi)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054271&language=en-US",
            "pub_date": "2026-03-01 14:26:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054272,
            "title": "Dubai port was affected by Iranian attacks, and a raging fire broke out.",
            "description": "Iranian attacks damaged infrastructure and landmarks in the United Arab Emirates, with a massive fire breaking out at the Dubai port. (WSJ)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054272&language=en-US",
            "pub_date": "2026-03-01 14:26:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054270,
            "title": "GEOPOLITICS | California Governor Newsom Criticizes Trump Over War Actions",
            "description": "California Governor Gavin Newsom has accused U.S. President Donald Trump of misleading the American public. According to Jin10, Newsom stated that Trump's reckless and unlawful war lacks a clear plan for resolution and fails to address existential threats. Newsom's comments highlight ongoing political tensions and criticisms surrounding Trump's foreign policy decisions.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054270&language=en-US",
            "pub_date": "2026-03-01 14:28:47",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054269,
            "title": "Bubblemaps Flags 6 Polymarket Wallets That Profited $1.2M Betting on Feb. 28 U.S. Strike on Iran",
            "description": "CoinDesk reported that on-chain analytics firm Bubblemaps identified six wallets that collectively made about $1.2 million by betting on Polymarket that a U.S. strike on Iran would occur by Feb. 28—the same day the strikes happened. Bubblemaps said most of the wallets were funded within 24 hours of the attack, focused on the specific Feb. 28 contract rather than broader time windows, and bought “Yes” shares hours before the operation began. The largest wallet allegedly turned roughly $61,000 into more than $493,000 in profit, while another made about $120,000 from a $30,000 position. The activity has fueled scrutiny over optics around prediction markets. Polymarket later added a note to its Middle East markets saying prediction markets aim to aggregate crowd information into accurate, unbiased forecasts and, after speaking with people affected by the attacks, argued such markets can provide answers that TV news and X may not.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054269&language=en-US",
            "pub_date": "2026-03-01 14:31:13",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054267,
            "title": "Bitmine and Strategy Are Sitting on a Combined $15.9 Billion in Unrealized Losses",
            "description": "Artemis data published on February 28, 2026 shows that the two largest Digital Asset Treasury brands, Bitmine and Strategy, are carrying a combined $15. 9 billion in unrealized losses on their token positions calculated against average cost basis. What the Artemis Chart Shows The Unrealized P&L DATs visualization from Artemis tracks the unrealized gain or loss […] The post Bitmine and Strategy Are Sitting on a Combined $15\nsource: https://www.ethnews.com/bitmine-and-strategy-are-sitting-on-a-combined-15-9-billion-in-unrealized-losses/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054267&language=en-US",
            "pub_date": "2026-03-01 14:11:30",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054266,
            "title": "During the trading week of Feb. 23–27 (ET), spot Bitcoin ETFs recorded net inflows of $787 million, led by BlackRock’s IBIT with $503 million in net inflows. Spot Ethereum ETFs saw $80.46 million in net inflows, while spot SOL ETFs attracted $44.44 million and spot XRP ETFs",
            "description": "null\nsource: https://x.com/wublockchain/status/2027990480127201428",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054266&language=en-US",
            "pub_date": "2026-03-01 14:13:03",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054262,
            "title": "Bitcoin(BTC) Drops Below 67,000 USDT with a Narrowed 2.12% Increase in 24 Hours",
            "description": "On Mar 01, 2026, 06:11 AM(UTC). According to Binance Market Data, Bitcoin has dropped below 67,000 USDT and is now trading at 66,943.117188 USDT, with a narrowed narrowed 2.12% increase in 24 hours.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054262&language=en-US",
            "pub_date": "2026-03-01 14:11:07",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054261,
            "title": "Elon Musk Expresses Distrust in OpenAI",
            "description": "Elon Musk, the CEO of Tesla and SpaceX, has publicly stated his lack of trust in OpenAI. According to Jin10, Musk's comments reflect ongoing concerns about the transparency and control of artificial intelligence development. OpenAI, known for its advanced AI models, has been at the forefront of AI research, raising questions about the ethical implications and potential risks associated with AI technologies. Musk's skepticism highlights the broader debate within the tech industry regarding the responsible development and deployment of AI systems.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054261&language=en-US",
            "pub_date": "2026-03-01 14:12:43",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054257,
            "title": "Macau's Gaming Revenue Surges in February Amid Lunar New Year Boost",
            "description": "Macau's gaming revenue experienced a notable increase of 4.5% in February, surpassing expectations. Bloomberg posted on X, highlighting that the world's largest gambling hub benefited significantly from the influx of tourists during the Lunar New Year celebrations. This period traditionally sees a rise in visitor numbers, contributing to the economic uplift in the region. The growth in gaming revenue underscores the importance of tourism to Macau's economy, particularly during festive seasons. The positive performance in February marks a promising start for the year, as the city continues to recover from previous economic challenges.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054257&language=en-US",
            "pub_date": "2026-03-01 14:00:58",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054256,
            "title": "PRECIOUS METALS | Global Tensions Impact Gold Prices Amid Middle East Conflict",
            "description": "On February 28, local time, a military strike by the U.S. and Israel on Iran heightened global risk aversion, according to PANews. Analysts predict a significant rise in the prices of gold and other precious metals. However, following an increase on February 28, gold prices experienced a sharp decline on March 1.\n\nEconomist Pan Helin, a member of the Ministry of Industry and Information Technology's Information and Communication Economics Expert Committee, noted that the death of Iran's Supreme Leader Ayatollah Khamenei has altered short-term market expectations, suggesting a potential stabilization of the Iranian situation. If Iran can smoothly transition its leadership post-Khamenei, the capital markets might see a complete reversal in expectations, leading to a decrease in gold and oil prices and a rise in U.S. stocks, particularly industrial stocks. Nonetheless, the uncertainty of war and Khamenei's death could further destabilize the situation in Iran.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054256&language=en-US",
            "pub_date": "2026-03-01 14:01:24",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054255,
            "title": "Elon Musk Highlights Record Usage on X Platform",
            "description": "On March 1, Elon Musk announced that the X platform experienced its highest usage ever. According to BlockBeats, Musk referenced a tweet from X product manager Nikita Bier, who noted that the day marked the highest traffic in the platform's history.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054255&language=en-US",
            "pub_date": "2026-03-01 14:01:48",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}