{
    "data": [
        {
            "id": 1052064,
            "title": "A New York judge rejected Binance's request to transfer claims from U.S. crypto investors to arbitration.",
            "description": "U.S. District Judge Andrew Carter Jr. of the Southern District of New York ruled that Binance cannot force a group of U.S. customers to arbitrate claims for losses incurred from purchases of crypto tokens on its global platform prior to February 20, 2019. The class-action lawsuit will continue to be heard in open court. The judge held that Binance's 2019 arbitration clause does not apply to these claims because Binance failed to provide adequate notice to users when unilaterally amending the 2017 version of its Terms of Service, and the 2017 version did not contain any arbitration or class-action exemption clauses. The judge noted that Binance relied solely on general terms changes and the posting of the updated 2019 terms on its website, and there is no evidence that the exchange provided any personal notices or formal announcements to users. The judge also ruled that the 2019 arbitration clause cannot be retroactively applied to claims prior to its effective date. The case, Williams v. Binance, was filed by five U.S. investors from California, Nevada, and Texas, accusing Binance and its founder CZ of illegally selling unregistered securities and operating as an unregistered broker-dealer. Binance responded that all claims arising on or after February 20, 2019, have been voluntarily withdrawn by the plaintiff, and Binance will actively defend against the remaining claims. (Cointelegraph)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052064&language=en-US",
            "pub_date": "2026-02-27 19:48:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052044,
            "title": "Finland's Economy Recovers from Recession by End of 2025",
            "description": "Finland's economy has shown signs of recovery, emerging from a recession by the end of 2025. Bloomberg posted on X, highlighting the country's economic turnaround after a challenging period. The Finnish economy had been struggling with various economic pressures, but recent data indicates a positive shift. Analysts are cautiously optimistic about the future, noting that while the recovery is promising, sustained growth will require careful economic management. The government is expected to implement measures to support this recovery and ensure long-term stability. The focus will be on boosting key sectors and addressing underlying economic issues to maintain momentum.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052044&language=en-US",
            "pub_date": "2026-02-27 19:42:11",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052043,
            "title": "Tom Lee Predicts Potential Bottom for Crypto and Equities Amid Negative Sentiment",
            "description": "Tom Lee from Fundstrat has indicated that both the cryptocurrency market and equities might be approaching a significant bottom, despite the prevailing negative sentiment. According to NS3.AI, Lee observes that market bottoms often form during periods dominated by negative news, which is currently the case. This viewpoint is further highlighted by the fact that MicroStrategy (MSTR) has become the most shorted stock, signaling strong bearish sentiment towards crypto-linked equities.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052043&language=en-US",
            "pub_date": "2026-02-27 19:42:48",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052042,
            "title": "India Plans to Reduce Coal Imports by 30% by 2026",
            "description": "India is reportedly planning to cut coal imports for its power plants by at least 30% by 2026. According to Jin10, this move is part of the country's broader strategy to enhance energy security and reduce reliance on foreign coal. The decision aligns with India's efforts to transition towards more sustainable energy sources and reduce carbon emissions. The reduction in coal imports is expected to impact global coal markets, potentially leading to shifts in supply and demand dynamics. India's focus on domestic coal production and renewable energy development is seen as a significant step towards achieving its environmental goals.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052042&language=en-US",
            "pub_date": "2026-02-27 19:44:32",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052041,
            "title": "GEOPOLITICS | Singapore Plans $19.7 Billion Defense Budget for 2026",
            "description": "Singapore is set to allocate $19.7 billion for defense spending in 2026, marking a 6.4% rise compared to the previous year. Bloomberg posted on X, highlighting the country's strategic focus on enhancing its military capabilities amid regional security challenges. This budget increase reflects Singapore's commitment to maintaining a robust defense posture in a rapidly evolving geopolitical landscape. The decision underscores the importance of national security in the face of potential threats and the need for advanced defense systems. Singapore's defense strategy continues to prioritize technological advancements and modernization to ensure readiness and resilience.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052041&language=en-US",
            "pub_date": "2026-02-27 19:44:42",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052016,
            "title": "Moore Threads Reports Significant Revenue Growth for 2025",
            "description": "Moore Threads has announced its financial results for 2025, revealing a substantial increase in revenue. According to Odaily, the company achieved an operating income of 1,505.5251 million yuan, marking a 243.37% rise compared to the previous year. Despite this growth, the net profit attributable to the parent company was a loss of 1,024.3113 million yuan, which represents a 36.70% reduction in losses from the prior year.\n\nAt the end of the reporting period, Moore Threads' total assets amounted to 15,307.823 million yuan, reflecting a 116.14% increase from the beginning of the period. The owner's equity attributable to the parent company reached 11,435.4793 million yuan, showing a growth of 154.69% from the start of the reporting period.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052016&language=en-US",
            "pub_date": "2026-02-27 19:34:52",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052015,
            "title": "Germany Expects U.S. Tariffs on EU Products to Remain Within 2025 Agreement",
            "description": "Germany's government spokesperson has indicated that the country anticipates future U.S. tariffs on European Union products will not exceed the limits set by the tariff agreement reached in 2025. According to Jin10, this expectation reflects ongoing diplomatic efforts to maintain stable trade relations between the United States and the European Union. The spokesperson emphasized the importance of adhering to international agreements to ensure economic stability and foster positive bilateral relations. This statement comes amid broader discussions on trade policies and their impact on global markets.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052015&language=en-US",
            "pub_date": "2026-02-27 19:34:58",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052014,
            "title": "Cryptocurrency Trader Resumes High-Leverage ETH Long Positions",
            "description": "A cryptocurrency trader known as 'Machi' Huang Licheng has initiated a new round of high-leverage Ethereum (ETH) long positions. According to PANews, after a previous liquidation, the trader deposited approximately $250,000 to establish an ETH long position. Over three days, the position was expanded to $13.5 million through continuous rolling of positions. Currently, the trader holds a 25x leveraged ETH long position with an average price of $1,945, showing an unrealized profit of about $430,000, with a liquidation price around $1,938.\n\nRecent trading activity from this address shows a pattern of building positions with hundreds of thousands of dollars and increasing the scale and average price through rolling positions. However, these attempts often end in liquidation due to high average prices and market pullbacks. After liquidation, the trader typically deposits more funds to restart the process, possibly aiming for a significant rebound or the start of a bull market. Since October last year, the address has attempted long positions on various cryptocurrencies 162 times, including 18 attempts on ETH, with a total net deposit of approximately $15.68 million to Hyperliquid. Almost every deposit has resulted in a loss.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052014&language=en-US",
            "pub_date": "2026-02-27 19:35:22",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052013,
            "title": "Art Collections Show Similar Patterns Across Different Owners",
            "description": "Art collections around the world are displaying striking similarities, with many featuring subtle, abstract, and occasionally spiritual pieces. Bloomberg posted on X, highlighting the trend where individual collections often mirror each other in style and composition. This phenomenon raises questions about the influences shaping collectors' choices and the broader art market dynamics. As collectors seek unique pieces, the prevalence of similar themes suggests a shared aesthetic preference or influence from popular trends. The art world continues to evolve, yet these recurring patterns in collections indicate a convergence in taste among art enthusiasts.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052013&language=en-US",
            "pub_date": "2026-02-27 19:35:23",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052001,
            "title": "Coinbase will launch Robo Token (ROBO) perpetual futures trading.",
            "description": "According to a Coinbase Markets announcement, perpetual futures trading for Robo Token (ROBO) will launch on February 27th. Subject to liquidity requirements, the ROBO-PERP market will open in supported regions. Retail traders can trade perpetual futures through Coinbase Advanced in selected jurisdictions, while institutional clients can access it directly through Coinbase International Exchange.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052001&language=en-US",
            "pub_date": "2026-02-27 19:20:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052005,
            "title": "U.S. Navy Addresses Reports of Toilet Issues on USS Ford Aircraft Carrier",
            "description": "The U.S. Navy has issued a statement on its official website addressing media reports about alleged toilet issues on the USS Ford aircraft carrier. According to Jin10, the statement clarified that the systems aboard the USS Ford are functioning normally and meet the expected standards for a Ford-class carrier accommodating over 4,000 personnel. During its current deployment, the vacuum waste system on the USS Ford has reportedly handled over six million flushes.\n\nHowever, Captain Skarosi of the USS Ford acknowledged that there have been instances of toilet blockages. He assured that engineering personnel have responded swiftly, minimizing the impact and duration of these issues. Recent media reports have claimed that nearly 90% of the approximately 650 toilets on the carrier are out of service, with only a few operational. It was reported that over 4,600 sailors have had to queue for toilet access, sometimes waiting over 45 minutes.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052005&language=en-US",
            "pub_date": "2026-02-27 19:21:41",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052004,
            "title": "Experts Criticize Tax Authorities for Lacking Basic Management Knowledge of Crypto Assets",
            "description": "Experts have criticized a recent incident involving tax authorities, highlighting a significant lack of basic management knowledge regarding crypto assets. According to ChainCatcher, the event has been likened to 'opening a wallet and inviting others to take money.' This criticism underscores the need for improved understanding and handling of digital currencies by regulatory bodies.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052004&language=en-US",
            "pub_date": "2026-02-27 19:23:49",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052003,
            "title": "Forward Industries Faces Significant Losses Amid Solana Price Decline",
            "description": "Forward Industries, the largest institutional holder of Solana (SOL), is experiencing nearly $1 billion in unrealized losses due to a significant drop in SOL's price. According to NS3.AI, the cryptocurrency's value has decreased by approximately 62% from the company's average purchase price. This decline has adversely affected Forward Industries' balance sheet and stock price. Despite these challenges, the company remains committed to its long-term strategy, aspiring to become the 'Berkshire Hathaway of the Solana ecosystem.'\n\nThe situation highlights broader issues within the digital asset treasury model, as other similar firms are also reporting paper losses. These challenges come amid ongoing efforts to develop the ecosystem, including initiatives like the launch of Solana Payments.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052003&language=en-US",
            "pub_date": "2026-02-27 19:24:30",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051987,
            "title": "South Fund Management Warns Investors of Premium Risk in Oil Fund",
            "description": "South Fund Management Co., Ltd. has issued a notice regarding significant price fluctuations in its Southern Oil Securities Investment Fund A shares. According to Jin10, the fund's secondary market trading price has experienced considerable volatility. On February 25, 2026, the net asset value of the fund shares was 1.2477 yuan, while the closing price on February 27, 2026, was 1.439 yuan, significantly higher than the net asset value. Investors are advised to be cautious of the premium risk in secondary market trading prices. Blind investments in fund shares with high premium rates could lead to substantial losses.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051987&language=en-US",
            "pub_date": "2026-02-27 19:08:58",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051983,
            "title": "Bitget has launched USD-margined ROBO perpetual contracts with leverage ranging from 1x to 20x.",
            "description": "According to the official announcement, Bitget has launched USDT-margined ROBO perpetual contracts with leverage ranging from 1x to 20x. Contract trading on BOT will be available simultaneously.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051983&language=en-US",
            "pub_date": "2026-02-27 19:09:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051986,
            "title": "EU Commission President to Meet Dutch Prime Minister on Tuesday",
            "description": "The European Commission President Ursula von der Leyen is scheduled to meet with the Dutch Prime Minister on Tuesday. According to Jin10, this meeting is part of ongoing discussions between EU leaders. The agenda is expected to cover various topics of mutual interest and cooperation within the European Union. Further details on the specific issues to be addressed during the meeting have not been disclosed.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051986&language=en-US",
            "pub_date": "2026-02-27 19:11:54",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051985,
            "title": "European Approval Granted for Moderna's Combination Flu and Covid Vaccine",
            "description": "European regulators have given the green light to Moderna's innovative flu and Covid-19 combination vaccine. Bloomberg posted on X, highlighting this development as a significant win for Moderna, which has encountered substantial opposition to its new vaccines in the United States. The approval marks a pivotal moment for the company as it seeks to expand its market presence amid challenges in the U.S. vaccine landscape. Moderna's efforts to introduce novel immunizations have faced hurdles, but the European endorsement could bolster its position in the global vaccine market.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051985&language=en-US",
            "pub_date": "2026-02-27 19:12:52",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051975,
            "title": "Beast Industries Expands into DeFi with Ethereum Focus and Major Investment",
            "description": "Jeff Housenbold, CEO of Beast Industries, emphasizes Ethereum's significant contribution to the stablecoin ecosystem and the expansion of decentralized finance (DeFi). According to NS3.AI, Beast Industries, recognized for the MrBeast brand, is diversifying into financial products after acquiring fintech company Step. The company aims to improve financial literacy through gamification. Additionally, Beast Industries has secured a $200 million investment from Bitmine, indicating robust institutional support for its cryptocurrency initiatives.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051975&language=en-US",
            "pub_date": "2026-02-27 18:57:23",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051974,
            "title": "Marathon Digital and Block Experience Gains Amid Mixed Q4 Earnings",
            "description": "Marathon Digital Holdings (MARA) and Block reported double-digit gains in pre-market trading after releasing mixed fourth-quarter earnings results. According to NS3.AI, the financial outcomes reveal a contrast between companies that are benefiting from the expansion of artificial intelligence and those experiencing margin pressure. Meanwhile, CoreWeave, a cloud computing firm, saw a significant decline during the same session.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051974&language=en-US",
            "pub_date": "2026-02-27 18:57:26",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051973,
            "title": "Poll Reveals Majority of Americans Doubt Economic Prosperity Claims",
            "description": "A recent poll indicates that 68% of Americans do not believe U.S. President Donald Trump's assertions that the American economy is thriving. According to Jin10, the survey also reveals that 82% of respondents perceive significant inflation in the country. These findings highlight a disconnect between public perception and official economic statements.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051973&language=en-US",
            "pub_date": "2026-02-27 19:04:02",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}