{
    "data": [
        {
            "id": 1053060,
            "title": "Argentina's Labor Reform Passes Senate, Paving Way for Market Reentry",
            "description": "Argentine President Javier Milei's labor reform has successfully passed through the Senate, marking a significant achievement for the libertarian leader's agenda. Bloomberg posted on X that this legislative victory is expected to facilitate Argentina's reintegration into global markets. The reform aims to overhaul the country's labor laws, which Milei argues are essential for economic revitalization and attracting foreign investment. This development is seen as a crucial step in addressing Argentina's economic challenges and enhancing its competitiveness on the international stage. The passage of the reform reflects Milei's commitment to implementing policies that align with his libertarian principles, focusing on reducing government intervention and promoting free-market dynamics. As Argentina seeks to stabilize its economy, the successful enactment of this reform is anticipated to play a vital role in its efforts to engage more effectively with global economic systems.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053060&language=en-US",
            "pub_date": "2026-02-28 10:24:58",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053059,
            "title": "Digital Asset Regulation Bill Stalled Amid Stablecoin Yield Disputes",
            "description": "The CLARITY Act, designed to provide clear regulations for digital assets, is currently facing delays due to disagreements over stablecoin yield restrictions. According to NS3.AI, banks are advocating for stricter limits, expressing concerns that yield-bearing stablecoins could function similarly to unregulated deposits. In contrast, cryptocurrency companies argue that such restrictions could stifle innovation within the industry. Despite efforts by the White House to mediate a resolution before March, the bill remains stalled in a Senate committee without any agreement reached.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053059&language=en-US",
            "pub_date": "2026-02-28 10:28:23",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053058,
            "title": "Bitcoin Buying Interest Surges Globally, Approaching 2021 Peak Levels",
            "description": "Recent data indicates a significant increase in global search interest for 'How to buy Bitcoin,' nearing the peak levels observed in 2021. According to PANews, this trend highlights a renewed interest in Bitcoin acquisition among individuals worldwide. The surge in search activity suggests growing curiosity and potential investment interest in the cryptocurrency market.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053058&language=en-US",
            "pub_date": "2026-02-28 10:33:50",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053056,
            "title": "According to Artemis data, Hyperliquid Strategies ($ PURR) is currently the only Digital Asset Treasury (DAT) in profit, with unrealized gains of $356 million, while other related products remain in unrealized losses. Among them, Bitmine has the largest unrealized loss, exceeding",
            "description": "null\nsource: https://x.com/wublockchain/status/2027567443347182032",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053056&language=en-US",
            "pub_date": "2026-02-28 10:12:03",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053045,
            "title": "OpenAI has fired an employee who profited by using confidential company information on Polymarket.",
            "description": "Wired reporter Kate Knibbs reported on X that OpenAI has fired an employee suspected of profiting from the company's confidential information on prediction market platforms such as Polymarket. OpenAI's Applied Business CEO, Fidji Simo, disclosed the dismissal to employees in an internal memo earlier this year, but did not reveal the employee's name or specific details of the transaction.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053045&language=en-US",
            "pub_date": "2026-02-28 10:07:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053048,
            "title": "TRON Ecosystem Launches AI Infrastructure Bank of AI",
            "description": "TRON's AI infrastructure, AINFT, has introduced a new foundational AI Agent system called Bank of AI. According to ChainCatcher, this system has deeply integrated five core toolkits: x402 (payment standard), 8004 (on-chain identity protocol), MCP Server (AI model and blockchain service standard interface), Skills (AI Agent function module library), and OpenClaw extension plugin (for seamless integration of on-chain functions). These components create a complete loop from development and identity authentication to automated payments.\n\nBy enabling code-based integration of on-chain payments and trusted identities, Bank of AI significantly lowers the development threshold for AI Agents. This advancement accelerates the formation of a Web 4.0 symbiotic economic network driven by AI.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053048&language=en-US",
            "pub_date": "2026-02-28 10:13:38",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053047,
            "title": "TRON's BTT Token Surpasses $1.55 Million in JustLend DAO Supply",
            "description": "The total supply of TRON's BTT token in the decentralized lending protocol JustLend DAO has officially exceeded $1.55 million. According to ChainCatcher, this milestone highlights the market's strong recognition of BTT's value and indicates a steady increase in the asset's liquidity and demand within the lending market.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053047&language=en-US",
            "pub_date": "2026-02-28 10:13:44",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053046,
            "title": "Hong Kong Approves First Real Estate Tokenization Project",
            "description": "Hong Kong's Securities and Futures Commission has recently approved two real-world asset (RWA) tokenization products by Derlin Holdings Group Limited. According to ChainCatcher, this marks the first regulatory approval for a real estate RWA project in Hong Kong.\n\nThe project involves the tokenization of a limited partnership fund and a private equity project fund for the Derlin Building in Central, Hong Kong. Derlin Securities will distribute the RWA tokens, while Derlin Digital Family Office collaborates with tokenization solutions provider Asseto for the issuance of fund equity tokens.\n\nThis development is seen as a significant milestone in digital financial innovation in Hong Kong. It is expected to enhance asset liquidity and trading efficiency, providing a regulatory framework for the integration of traditional commercial real estate with digital finance. Additionally, it strengthens Hong Kong's competitive position as a global center for RWAs.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053046&language=en-US",
            "pub_date": "2026-02-28 10:13:48",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053042,
            "title": "The US XRP spot ETF saw a total net inflow of $2.2052 million in a single day.",
            "description": "According to SoSoValue data, the XRP spot ETF saw a total net inflow of $2.2052 million yesterday (February 27th, Eastern Time). Only the Franklin XRP ETF (XRPZ) saw net inflows yesterday, with a single-day net inflow of $2.2052 million, bringing its total historical net inflow to $333 million. As of press time, the XRP spot ETF's total net asset value is $983 million, with an XRP net asset ratio of 1.19%, and a historical cumulative net inflow of $1.24 billion.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053042&language=en-US",
            "pub_date": "2026-02-28 09:56:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053043,
            "title": "US Senate Postpones CLARITY Act Amid Crypto Regulation Disputes",
            "description": "The U.S. Senate has postponed the CLARITY Act, a proposed bill aimed at regulating the cryptocurrency market, due to ongoing disagreements between banking institutions and the crypto industry. According to NS3.AI, the primary contention revolves around whether stablecoin holders should be allowed to earn interest, with banks advocating for stringent restrictions while crypto companies resist such measures. Further disputes include regulations on exchange incentives, the responsibilities of DeFi developers, and the extent of regulatory authority.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053043&language=en-US",
            "pub_date": "2026-02-28 10:03:09",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053039,
            "title": "OpenAI Reports Significant Growth in ChatGPT User Base",
            "description": "OpenAI has announced a substantial increase in the daily active users of its ChatGPT platform, which has now surpassed 900 million. According to PANews, the number of paid subscribers has reached 50 million. This growth highlights the expanding popularity and adoption of ChatGPT among users worldwide.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053039&language=en-US",
            "pub_date": "2026-02-28 09:43:58",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053038,
            "title": "GEOPOLITICS | Southeast Asia Faces Dilemma After U.S. Supreme Court Tariff Ruling",
            "description": "U.S. President Donald Trump's recent Supreme Court defeat regarding tariffs has presented a challenging decision for Southeast Asian leaders. Bloomberg posted on X, highlighting the dilemma these leaders face: whether to renegotiate existing trade agreements or to step back from current negotiations. The ruling has significant implications for international trade dynamics, particularly affecting the economic strategies of Southeast Asian nations. As these countries weigh their options, the decision could impact regional trade relations and economic policies.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053038&language=en-US",
            "pub_date": "2026-02-28 09:44:11",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053037,
            "title": "NASDAQ Files to List VanEck $JITOSOL Staking ETF",
            "description": "Scott Melker, host of The Wolf Of All Streets Podcast, posted on X about NASDAQ's recent filing to list VanEck's $JITOSOL Staking ETF. This move marks a significant development in the crypto investment landscape, offering investors new opportunities in staking ETFs. The filing indicates growing interest and acceptance of crypto-related financial products in traditional markets.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053037&language=en-US",
            "pub_date": "2026-02-28 09:44:46",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053036,
            "title": "Anthropic to Contest Supply Chain Risk Designation in Court",
            "description": "Anthropic has announced its intention to legally challenge any designation of supply chain risk. Bloomberg posted on X that the company has not received any direct communication from the Department of War or the White House regarding the status of negotiations. Anthropic remains firm in its stance to contest any such designation in court.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053036&language=en-US",
            "pub_date": "2026-02-28 09:47:34",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053029,
            "title": "U.S. President Trump Orders Federal Agencies to Cease Using Anthropic Technology",
            "description": "U.S. President Donald Trump has directed all federal agencies to immediately halt the use of Anthropic's technology. According to BlockBeats, Trump announced on Truth Social that the government neither needs nor wants Anthropic's products and will cease business with the company. Agencies currently utilizing Anthropic's technology, such as the Department of Defense, will have a six-month phase-out period. Trump emphasized that Anthropic must cooperate during this transition, warning that failure to do so could result in significant civil and criminal consequences, with the full power of the presidency being used to enforce compliance.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053029&language=en-US",
            "pub_date": "2026-02-28 09:39:16",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053028,
            "title": "Institutional Entity Accumulates HYPE Tokens Through Galaxy Digital",
            "description": "An unidentified institutional entity has been actively purchasing HYPE tokens through Galaxy Digital's over-the-counter (OTC) desk. According to NS3.AI, this accumulation has been ongoing for 18 days, resulting in a total holding of 540,337 HYPE tokens, valued at approximately $14.86 million. This consistent buying activity suggests a significant institutional interest in HYPE.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053028&language=en-US",
            "pub_date": "2026-02-28 09:41:43",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053027,
            "title": "Stablecoin Negotiations Face Uncertainty Amid Industry Defense",
            "description": "Cryptocurrency journalist Eleanor Terrett reports that several figures in the crypto industry have publicly defended Patrick Witt and the White House's stance following anonymous claims of pessimism regarding stablecoin yield negotiations. According to ChainCatcher, a banking industry insider directly familiar with the negotiations stated that representatives from ABABankers, ICBA, and the Bank Policy Institute, who attended a White House meeting last week, were confused by the anonymous claims and disagreed with the perspective. They have communicated their concerns to the White House.\n\nThe insider also noted that both parties are still in ongoing discussions about the bill's text, and the March 1 deadline is not a definitive cutoff date.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053027&language=en-US",
            "pub_date": "2026-02-28 09:42:21",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053024,
            "title": "Anthropic Challenges Legal Precedent in Government Negotiations",
            "description": "Anthropic has expressed concerns over a recent legal determination, arguing that it lacks a solid legal foundation. According to Jin10, the company believes that this decision could set a dangerous precedent for any U.S. company engaged in negotiations with the government. Anthropic's stance highlights the potential implications for future corporate-government interactions.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053024&language=en-US",
            "pub_date": "2026-02-28 09:23:51",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053022,
            "title": "Planet Morning News",
            "description": "1. Tether's secondary market valuation reached a peak of $375 billion, potentially making its largest shareholder richer than Warren Buffett; 2. SEC Chairman: The US missed the window of opportunity for crypto regulation and is accelerating the modernization of its rules; 3. White House AI and Crypto Director: The crypto industry has made concessions on stablecoin yields, and banks should respond; 4. Trump calls on the Supreme Court to review or re-examine his tariff policy case; 5. Morgan Stanley applies for a banking license to expand its digital asset custody and staking business; 6. Vitalik Buterin outlines Ethereum's scaling plan, covering short-term gas optimization and long-term phased deployment of ZK-EVM; 7. Minnesota proposes a bill to completely ban cryptocurrency ATMs; 8. Jack Dorsey's Blocks company adds 340 BTC, worth $22 million; 9. Paradigm plans to raise up to $1.5 billion to establish a new fund, investing in cutting-edge fields such as AI and robotics; 10. JPYC, the issuer of the Japanese yen stablecoin, completes a deal... 11. OpenAI and Amazon announce strategic partnership; Amazon will invest $50 billion in OpenAI. 12. The Korean National Tax Service suffered a $4.8 million theft after leaking a mnemonic phrase in a press release.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053022&language=en-US",
            "pub_date": "2026-02-28 09:30:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053023,
            "title": "U.S. Health Secretary Appoints New Members to Vaccine Committee",
            "description": "U.S. Health Secretary Robert F. Kennedy Jr. has appointed two new members to a key vaccine committee tasked with shaping the country's immunization policy. Bloomberg posted on X, highlighting the significance of these appointments in influencing national health strategies. The committee plays a crucial role in advising on vaccine-related matters, impacting public health decisions across the United States. The new members are expected to bring fresh perspectives to the committee's ongoing efforts to enhance immunization practices and policies.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053023&language=en-US",
            "pub_date": "2026-02-28 09:30:44",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}