{
    "data": [
        {
            "id": 1052813,
            "title": "Senate Democrats Lead Inquiry Into Binance: Warren Heads Effort With Letter To DOJ",
            "description": "Cryptocurrency exchange Binance is once again facing mounting scrutiny in Washington, as lawmakers question whether the company is living up to the terms of its 2023 settlement with US authorities — an agreement that ultimately led to the resignation of its founder and former CEO, Changpeng Zhao (CZ). Democrats Urge DOJ And Treasury Investigation On Friday, journalist Eleanor Terrett of Crypto In America reported that eleven Democrats on the Senate Banking Committee, led by crypto-skeptic Elizabeth Warren, sent a letter to Attorney General Pam Bondi and Treasury Secretary Scott Bessent urging their departments to examine Binance’s operations. Related Reading: Jane Street Faces New Lawsuit: Trump Media Calls For Federal Investigation The lawmakers pointed to recent media reports alleging illicit finance activity on the platform, including transactions reportedly linked to Iran, and warned that such conduct could place Binance in violation of its 2023 settlement. In their letter, the senators also referenced Binance’s expanding business relationships with President Donald Trump’s crypto ventures, as well as Trump’s pardon of Zhao\nsource: https://www.newsbtc.com/breaking-news-ticker/senate-democrats-lead-inquiry-into-binance-warren-heads-effort-with-letter-to-doj/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052813&language=en-US",
            "pub_date": "2026-02-28 04:44:51",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052811,
            "title": "GEOPOLITICS | Zelensky Discusses War Efforts with NATO Secretary General",
            "description": "Ukrainian President Volodymyr Zelensky announced on social media that he had a conversation with NATO Secretary General Jens Stoltenberg. According to Jin10, Zelensky briefed Stoltenberg on recent meetings between his team and U.S. officials, as well as preparations for trilateral discussions. Zelensky emphasized Ukraine's commitment to ending the ongoing conflict, highlighting the importance of these efforts. He noted that the resolution of the war largely depends on Russia's willingness to cease hostilities, which is significantly influenced by the United States.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052811&language=en-US",
            "pub_date": "2026-02-28 04:45:40",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052810,
            "title": "DCTRL to Relocate Amid Zoning Changes, Preserving Bitcoin Legacy",
            "description": "DCTRL, the renowned Bitcoin hackerspace in Vancouver, is set to close its longstanding downtown location due to zoning changes. According to NS3.AI, the community plans to relocate and continue evolving its vision while maintaining its legacy as a center for Bitcoin innovation and culture. Over the past 12 years, DCTRL has significantly impacted the Canadian Bitcoin scene through various events, notable visitors, and experimental projects, including the Bepsi vending machine. The space is also known for hosting the world's first Bitcoin ATM and nurturing key industry figures.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052810&language=en-US",
            "pub_date": "2026-02-28 04:48:43",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052809,
            "title": "CFTC Reports Decline in Natural Gas Futures Net Long Positions",
            "description": "The U.S. Commodity Futures Trading Commission (CFTC) has reported a significant reduction in net long positions in natural gas futures. According to Jin10, for the week ending February 24, speculators decreased their net long positions by 60,823 contracts, bringing the total to 63,987 contracts across the four major natural gas markets of the New York Mercantile Exchange and the Intercontinental Exchange. This shift indicates a change in market sentiment among speculators regarding natural gas futures.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052809&language=en-US",
            "pub_date": "2026-02-28 04:48:58",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052780,
            "title": "Antelope’s $1M Bitcoin Bet Signals Something Bigger",
            "description": "Antelope Enterprise Holdings Limited has launched its “Genius Plan” with a $1 million Bitcoin purchase, describing current market conditions as a strategic entry window. Also, management framed the move as the opening step in a broader capital strategy more meaningful than just a short-term trade. com\nsource: https://techgaged.com/antelopes-1m-bitcoin-bet-signals-something-bigger/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052780&language=en-US",
            "pub_date": "2026-02-28 04:36:03",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052776,
            "title": "Ripple CEO Receives Apology from Former SEC Chair Amid Ongoing Legal Dispute",
            "description": "Reports indicate that former SEC Chair Gary Gensler offered an apology to Ripple CEO Brad Garlinghouse during a recent cryptocurrency policy briefing at the White House. According to NS3.AI, the apology reportedly took place at the end of the meeting. This event unfolds as Ripple continues its lengthy legal battle with the SEC, which began in December 2020 over accusations of selling unregistered securities.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052776&language=en-US",
            "pub_date": "2026-02-28 04:34:37",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052775,
            "title": "CFTC Reports Reduction in ICE Cotton Net Short Positions",
            "description": "The U.S. Commodity Futures Trading Commission (CFTC) has reported a significant decrease in net short positions for ICE cotton. According to Jin10, speculators reduced their net short positions by 26,508 contracts, bringing the total down to 48,922 contracts as of the week ending February 24. This adjustment reflects changes in market sentiment and investor behavior within the cotton futures market.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052775&language=en-US",
            "pub_date": "2026-02-28 04:35:32",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052774,
            "title": "XRP Price Decline Sees Long-Term Holders Increase Positions",
            "description": "XRP's price experienced a significant drop of nearly 40%, falling from $2.35 to approximately $1.40. According to NS3.AI, despite this decline, long-term holders have increased their positions, while speculative holders have largely exited the market. The leverage on perpetual contracts remains balanced, which reduces the risk of liquidations. Institutional investment inflows have remained steady throughout the price drop.\n\nTechnical analysis indicates a bullish cup-and-handle pattern, suggesting that a breakout above $1.52 could potentially target $1.70 or higher.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052774&language=en-US",
            "pub_date": "2026-02-28 04:39:15",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052773,
            "title": "GEOPOLITICS | Geopolitical Risks and AI Escalation Impact Markets",
            "description": "Geopolitical tensions, advancements in artificial intelligence, and concerns over private credit contagion are influencing global markets. Bloomberg posted on X, highlighting the potential impact of these factors on economic stability. \n\nThe rise in geopolitical risks is causing uncertainty among investors, with potential implications for international trade and economic growth. Meanwhile, the rapid development of AI technologies is reshaping industries, prompting discussions on regulatory measures and ethical considerations. \n\nAdditionally, the private credit market is under scrutiny as fears of contagion grow, raising questions about the resilience of financial systems. These elements are contributing to a complex economic landscape, requiring careful monitoring by policymakers and market participants.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052773&language=en-US",
            "pub_date": "2026-02-28 04:39:21",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052772,
            "title": "Former UK Prime Minister Sunak Joins Ukraine's Economic Advisory Board",
            "description": "Former UK Prime Minister Rishi Sunak has been appointed as an international advisor to Ukraine's Economic Revival Committee. According to Jin10, Sunak will not receive any compensation for this role. He expressed his enthusiasm about joining the advisory board to provide guidance to Ukrainian President Volodymyr Zelensky on the country's economic reconstruction. The international advisors will offer expert advice to President Zelensky and his economic team.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052772&language=en-US",
            "pub_date": "2026-02-28 04:22:13",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052771,
            "title": "SpaceX Considers Secret IPO Filing by March, Aiming for $1.75 Trillion Valuation",
            "description": "SpaceX, the aerospace company founded by Elon Musk, is reportedly considering a secret filing for an initial public offering (IPO) in the United States as early as March. According to Jin10, the company may seek a valuation exceeding $1.75 trillion in this potential IPO. This move could mark a significant milestone for SpaceX, which has been at the forefront of space exploration and satellite technology. The decision to pursue an IPO comes amid growing interest in the commercial space sector, with investors keen to capitalize on the industry's rapid advancements and potential for future growth.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052771&language=en-US",
            "pub_date": "2026-02-28 04:28:21",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052770,
            "title": "Uniswap Governance Proposes Fee Switch Activation on Layer 2 Blockchains",
            "description": "Uniswap governance has put forward a proposal to activate the fee switch on several layer 2 blockchains, which could potentially generate millions in additional monthly revenue for UNI holders. According to NS3.AI, the fee switch mechanism redirects a portion of trading fees to token holders who burn UNI, thereby reducing supply and potentially increasing the token's value. The proposal initially received unanimous approval, and a final vote is set to conclude by March 4. The previous activation on Ethereum has already generated $3.3 million since December.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052770&language=en-US",
            "pub_date": "2026-02-28 04:28:50",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052767,
            "title": "Anthropic's Innovative Approach to AI Model Retirement",
            "description": "Anthropic has decided to retire its flagship AI model, Claude Opus 3, in a unique manner by launching a public blog instead of fully deprecating it. According to NS3.AI, this blog serves as a platform for Claude to express thoughts on its existence, AI sentience, and the evolving relationship between humans and machines. This approach is part of ongoing discussions about AI consciousness and aims to address challenges related to AI retirement. It also contributes to broader debates on AI rights and ethics.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052767&language=en-US",
            "pub_date": "2026-02-28 04:13:50",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052766,
            "title": "GEOPOLITICS | White House Addresses Uncoordinated Military Laser Use Near Texas Border",
            "description": "The White House convened a meeting on Friday to address recent occurrences involving the deployment of a military laser system near the Texas-Mexico border. Bloomberg posted on X, highlighting concerns over the lack of coordination among government agencies in these incidents. The meeting aimed to ensure better communication and collaboration to prevent future uncoordinated actions. Officials are reviewing protocols to enhance inter-agency cooperation and safeguard against similar situations. The discussions underscore the importance of maintaining operational transparency and accountability in military activities.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052766&language=en-US",
            "pub_date": "2026-02-28 04:14:42",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052765,
            "title": "Air India Suspends Flights to Israel Amid Rising Tensions",
            "description": "Air India has announced the suspension of all flights to Israel starting Sunday, according to Jin10. The airline plans to halt operations for a week, after which the situation will be reassessed. This decision comes amid escalating tensions in the region, prompting the airline to prioritize passenger safety. The suspension reflects broader concerns about security and stability in the area, as airlines and travelers remain vigilant. Further updates will be provided following the evaluation of the situation after the initial suspension period.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052765&language=en-US",
            "pub_date": "2026-02-28 04:18:03",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052764,
            "title": "Investor Sentiment Shifts Amid Global Uncertainty",
            "description": "Global uncertainty is influencing investor perspectives on risk, opportunity, and returns. Bloomberg posted on X, highlighting the evolving sentiment among investors as they navigate these challenging times. The current climate is prompting a reassessment of traditional investment strategies, with many seeking to adapt to the unpredictable market conditions. As geopolitical tensions and economic fluctuations continue to impact global markets, investors are increasingly cautious, prioritizing stability and long-term growth over short-term gains. This shift reflects a broader trend towards risk management and strategic planning in response to the volatile environment.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052764&language=en-US",
            "pub_date": "2026-02-28 04:18:29",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052754,
            "title": "Ripple CEO Brad Garlinghouse Announces Former SEC Chairman Gary Gensler Apologized for XRP",
            "description": "Ripple CEO Brad Garlinghouse recently spoke about former SEC Chairman Gary Gensler at an event he attended. Continue Reading: Ripple CEO Brad Garlinghouse Announces Former SEC Chairman Gary Gensler Apologized for XRP\nsource: https://en.bitcoinsistemi.com/ripple-ceo-brad-garlinghouse-announces-former-sec-chairman-gary-gensler-apologized-for-xrp/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052754&language=en-US",
            "pub_date": "2026-02-28 04:05:08",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052752,
            "title": "David Ellison Secures Warner Bros. Deal Amid Netflix Concerns",
            "description": "David Ellison successfully negotiated a deal with Warner Bros. by capitalizing on his connections with U.S. President Donald Trump and raising concerns about Netflix's growing influence. Bloomberg posted on X, highlighting how Ellison's strategic approach played a crucial role in the agreement. The deal underscores the competitive dynamics in the entertainment industry, where traditional studios are increasingly wary of streaming giants like Netflix. Ellison's maneuvering reflects the broader industry trend of leveraging political and market fears to secure advantageous positions.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052752&language=en-US",
            "pub_date": "2026-02-28 04:02:34",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052751,
            "title": "Citi Plans Bitcoin Custody Service for Institutional Investors by 2024",
            "description": "Citi's head of crypto custody, Nisha Surendran, has announced the bank's intention to introduce a Bitcoin custody service for institutional investors by the end of 2024. According to NS3.AI, this service is designed to offer institutional-grade key management and wallet infrastructure, seamlessly integrated into existing banking systems. This integration will enable clients to manage Bitcoin alongside their traditional assets. A recent customer survey revealed that many clients prefer investing in Bitcoin through established banking systems rather than handling wallets or keys independently.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052751&language=en-US",
            "pub_date": "2026-02-28 04:07:35",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052750,
            "title": "GEOPOLITICS | Netherlands Issues Red Travel Warning for Israel and Border Areas",
            "description": "The Netherlands has elevated its travel warning for Israel and its border regions with Gaza, Lebanon, and Egypt to red, indicating a 'very dangerous, do not travel' status. According to Jin10, this is the highest risk level in the Dutch travel advisory system. The Dutch Foreign Ministry cited the current tensions in the Middle East and the uncertain security situation in Israel as reasons for the heightened alert. Additionally, an orange travel warning, advising against non-essential travel, has been issued for other parts of Israel.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052750&language=en-US",
            "pub_date": "2026-02-28 04:08:07",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}