{
    "data": [
        {
            "id": 733973,
            "title": "A user made a profit of $4.4 million on ENRON in less than half an hour",
            "description": "Odaily Planet Daily News: According to Lookonchain monitoring, just one second after Enron released the contract address, a user spent US$900,000 to purchase 11.66 million ENRONs, and then cashed out US$5.3 million, making a profit of US$4.4 million in less than 30 minutes.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733973&language=en-US",
            "pub_date": "2025-02-05 10:34:21",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733972,
            "title": "Berachain Ecosystem Meme Coin Project Henlo Completes $3 Million Seed Round Financing, with Framework Ventures and Others Participating",
            "description": "Odaily Planet Daily News According to official news, Berachain Ecological Community-driven Meme Coin Project Henlo announced the completion of a $3 million seed round of financing, with Framework Ventures, SNZ Capital, Rubik VC, Baboon VC, Paramount Capital, Primitive Ventures, Asylum Ventures and others participating. \nAccording to reports, Henlo is currently conducting an event where more than 70 communities from Ethereum, Solana and Bitcoin can earn Henlo points by holding NFTs, Meme coins and DeFi tokens of these networks. There is also a treasure hunt event with a prize of $50,000 hidden in the ecosystem.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733972&language=en-US",
            "pub_date": "2025-02-05 10:39:18",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733969,
            "title": "Yesterday, BlackRock IBIT had a net inflow of $250.31 million and a trading volume of $2.6 billion",
            "description": "Odaily Planet Daily News According to Trader T monitoring, BlackRock IBIT had a net inflow of US$250.31 million (2,524 BTC) yesterday, with a trading volume of US$2.6 billion.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733969&language=en-US",
            "pub_date": "2025-02-05 10:24:38",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733968,
            "title": "Sol Strategies, the “Solana version of micro-strategy”, increased its holdings by more than 40,000 SOL in late January, bringing its total holdings to nearly 190,000 SOL",
            "description": "Odaily Planet Daily News Between January 19 and January 31, Sol Strategies, the \"Solana version of microstrategy\", spent approximately $9.93 million to increase its holdings by 40,300 SOLs at an average price of $246.53, including fees and expenses. The company also completed a second convertible bond private placement of $2.5 million, with total proceeds paid by 6,564.47 SOLs.\nAs of January 31, Sol Strategies and its subsidiaries held a total of 189,968 SOLs at an average price of $179, worth nearly $40 million.\nThe company also announced that Chief Investment Officer Moe Adham will resign on January 30 due to his family's relocation to Tokyo. Adham joined the Sol board of directors in 2018.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733968&language=en-US",
            "pub_date": "2025-02-05 10:27:22",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733967,
            "title": "Yesterday, BlackRock ETHA had a net inflow of US$284.92 million, setting a record for the highest single-day net inflow of ETH",
            "description": "Odaily Planet Daily News According to Trader T monitoring, BlackRock ETHA had a net inflow of US$284.92 million (100,535 ETH) yesterday, setting a record for the highest single-day net inflow of ETH, with a trading volume of US$250 million.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733967&language=en-US",
            "pub_date": "2025-02-05 10:31:03",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733971,
            "title": "BlackRock Records Highest Single-Day ETH Inflow",
            "description": "According to Odaily, monitoring by Trader T revealed that BlackRock experienced a net inflow of $284.92 million in ETH, equivalent to 100,535 ETH, marking the highest single-day inflow record for ETH. The trading volume reached $250 million.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733971&language=en-US",
            "pub_date": "2025-02-05 10:33:41",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733961,
            "title": "AscendEX will list Bubi (BUBI) and WIENER (WIENER)",
            "description": "Odaily Planet Daily News AscendEX (formerly BitMax) will launch Bubi (BUBI) at 14:00 on February 5, open BUBI/USDT trading pair, and now open for recharge.\nIn addition, WIENER (WIENER) will be launched at 16:00 on February 5, open WIENER/USDT trading pair, and now open for recharge.\nThe Meme Research Institute team under the AscendEX platform selects high-quality Memes for online listing based on on-chain data and project background, and the platform's Memecoin initial launch rate is as high as 80%.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733961&language=en-US",
            "pub_date": "2025-02-05 10:18:51",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733960,
            "title": "Celestia founder: Supports proposal to reduce TIA inflation rate by 33%",
            "description": "Odaily Planet Daily News Celestia (TIA) community launched a new proposal to reduce TIA's inflation rate by 33%.\nIn response to the proposal, Celestia founder Mustafa Al-Bassam said: \"I support this proposal. When we first decided on the inflation rate, we referred to Solana's inflation plan to keep it relatively simple because we didn't want to follow the Cosmos standard inflation plan (i.e. a permanent 10% inflation rate). Recently, the community consensus is that this number is still too high, and now Solana is also proposing to reduce the inflation rate, so it's time for Celestia to adjust. I think a 33% reduction is the right balance, which can effectively adjust the inflation curve without overly endangering the security of the crypto economy.\"",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733960&language=en-US",
            "pub_date": "2025-02-05 10:20:03",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733966,
            "title": "Celestia Community Proposes 33% Inflation Rate Reduction",
            "description": "According to Odaily, the Celestia (TIA) community has introduced a new proposal to reduce the inflation rate of TIA by 33%. Mustafa Al-Bassam, the founder of Celestia, expressed his support for the proposal. He explained that the initial decision on the inflation rate was influenced by Solana's inflation plan to maintain simplicity, avoiding the Cosmos standard of a permanent 10% inflation rate. Al-Bassam noted that recent community consensus indicates the current rate is still too high. With Solana also considering a reduction in its inflation rate, he believes it is an appropriate time for Celestia to make adjustments. He stated that a 33% reduction strikes the right balance, effectively adjusting the inflation curve without significantly compromising crypto-economic security.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733966&language=en-US",
            "pub_date": "2025-02-05 10:23:34",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733965,
            "title": "Crypto Analyst Reports Portfolio Losses And Gains Amid Market Fluctuations",
            "description": "According to Odaily, crypto analyst Ali Martinez shared on the X platform that his portfolio experienced a 10.02% loss in BTC, ETH, and ADA during a market downturn. However, he managed to offset these losses by shorting DOGE, TON, and WIF before the market decline, achieving approximately 72.3% in gains.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733965&language=en-US",
            "pub_date": "2025-02-05 10:23:47",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}