{
    "data": [
        {
            "id": 733546,
            "title": "Semler Scientific, a US-listed company, increased its holdings of 871 BTC for $88.5 million",
            "description": "Semler Scientific, a US-listed company, announced today that it has spent $88.5 million to increase its holdings of 871 BTC. Since July 1, 2024, Semler Scientific's BTC yield has been 152%, and it now holds 3,192 BTC. Xiao An previously reported that Semler Scientific plans to issue convertible senior notes with a total principal amount of $85 million and a maturity date of 2030 to qualified institutional buyers through a private placement. Semler Scientific intends to use part of the net proceeds from the issuance to pay for the cost of the capped subscription transaction, and the remaining net proceeds for general corporate purposes, including the purchase of Bitcoin.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733546&language=en-US",
            "pub_date": "2025-02-04 21:52:01",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733547,
            "title": "Semler Scientific Increases Bitcoin Holdings With $88.5 Million Investment",
            "description": "According to Odaily, U.S.-listed company Semler Scientific has announced an $88.5 million investment to acquire an additional 871 Bitcoins. Since July 1, 2024, the company's Bitcoin returns have reached 152%, and it now holds a total of 3,192 Bitcoins. Previously, it was reported that Semler Scientific planned to issue $85 million in convertible senior notes due in 2030 through a private placement to qualified institutional buyers. The company intends to use part of the net proceeds from this issuance to cover the costs of capped call transactions, with the remaining funds allocated for general corporate purposes, including Bitcoin purchases.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733547&language=en-US",
            "pub_date": "2025-02-04 21:54:38",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733541,
            "title": "Messari releases BNBChain 2024Q4 report: BNB market value increased by 114%, and the stablecoin market value remained third at US$6.84 billion",
            "description": "Odaily Planet Daily News Messari today released BNBChain's 2024 fourth quarter report, which covers ecological expansion and the growth of various indicators. Among them, BNB's market value reached US$101.09 billion at the end of Q4, a year-on-year increase of 114% compared with the beginning of the year.\nBNBChain's DeFi ecosystem grew by 53% annually, 10% in the fourth quarter, and TVL was US$5.35 billion, among which ListaDao performed well, with TVL increasing by 174%. BNBChain's DEX daily average trading volume in the fourth quarter increased by 122% quarter-on-quarter to US$1.29 billion. The average daily trading volume of DEX increased by 269% throughout the year.\nThe stablecoin market has also grown steadily, and BNBChain remains the world's third largest stablecoin ecosystem (second only to Ethereum and TRON), with a total stablecoin market value of US$6.84 billion in the fourth quarter. In addition, in the BTCFi field, the number of holders increased by 5% month-on-month, breaking through 1 million users, among which Solv and Lorenzo performed relatively well.\nIn terms of technology, 96% of blocks at the end of the year used BuilderAPI, improving block speed and MEV transparency. The number of active validators increased from 40 to 45, promoting further decentralization of BNBChain.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733541&language=en-US",
            "pub_date": "2025-02-04 21:39:59",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733540,
            "title": "Coinbase sends letter to US regulators, asking for a report on the status of crypto industry banking services",
            "description": "Coinbase is urging U.S. regulators to confirm that banks can freely provide services to cryptocurrency businesses. Today, Coinbase sent letters to the Office of the Comptroller of the Currency (OCC), the Federal Reserve Board, and the Federal Deposit Insurance Corporation (FDIC), asking them to provide clarity reports on the status of banking services to the crypto industry. U.S. banks' services to the crypto industry have always been a controversial issue. Under current federal law, banks are already authorized to provide crypto services and work with third-party service providers such as Coinbase. Although banks like BNY Mellon have been providing crypto custody services, some reports indicate that the Federal Deposit Insurance Corporation (FDIC) has approached several U.S. banks, asking them to suspend crypto-related activities. In June 2024, Coinbase filed a lawsuit against the U.S. Securities and Exchange Commission and the FDIC, accusing the agencies of \"jointly trying to isolate crypto asset companies from basic banking services.\" With U.S. President Donald Trump taking office on January 20, the crypto community is now waiting for positive changes in the U.S. crypto ecosystem. Coinbase has been deepening its ties with the Trump administration and is also the largest custodian of the U.S. spot Bitcoin ETF. “For regulators, it needs to be clear that banks can work with third-party providers to offer crypto trading services to their customers,” said Faryar Shirzad, chief policy officer at Coinbase.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733540&language=en-US",
            "pub_date": "2025-02-04 21:42:20",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733542,
            "title": "BNBChain's Q4 2024 Report Highlights Significant Growth",
            "description": "According to PANews, Messari has released its fourth-quarter report for BNBChain in 2024, detailing significant growth in its ecosystem and various metrics. By the end of Q4, BNB's market capitalization reached $101.09 billion, marking a 114% increase compared to the beginning of the year.The DeFi ecosystem on BNBChain saw an annual growth of 53%, with a 10% increase in the fourth quarter, reaching a total value locked (TVL) of $5.35 billion. ListaDao was a standout performer, with its TVL growing by 174%. The daily average trading volume on BNBChain's decentralized exchanges (DEX) increased by 122% in the fourth quarter, reaching $1.29 billion, and saw an annual growth of 269%.The stablecoin market also experienced steady growth, with BNBChain maintaining its position as the third-largest stablecoin ecosystem globally, following Ethereum and Tron. The total market value of stablecoins on BNBChain reached $6.84 billion in the fourth quarter. In the BTCFi sector, the number of holders grew by 5% quarter-over-quarter, surpassing one million users, with Solv and Lorenzo being notable contributors.On the technical front, 96% of blocks utilized BuilderAPI by the end of the year, enhancing block speed and MEV transparency. The number of active validators increased from 40 to 45, further decentralizing BNBChain.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733542&language=en-US",
            "pub_date": "2025-02-04 21:45:23",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733538,
            "title": "Bitcoin (BTC) treasuries surpass 3M coins as corporate buyers accumulate during the latest dip",
            "description": "Bitcoin (BTC) draws in buying from corporate holders, with eight companies adding to their balances. For now, the buying does not offset the slower acquisition schedule of MicroStrategy.\nsource: https://www.cryptopolitan.com/bitcoin-treasuries-corporate-buyers-grow/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733538&language=en-US",
            "pub_date": "2025-02-04 21:24:04",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733537,
            "title": "Semler Scientific Purchases 871 Bitcoins; Achieves Impressive BTC Yield",
            "description": "The post Semler Scientific Purchases 871 Bitcoins; Achieves Impressive BTC Yield appeared first on Coinpedia Fintech News\nIn a significant update, Semler Scientific has announced updates regarding its bitcoin activity and holdings, and BTC Yield, a key performance indicator.  The press release noted that from January 11 to February 3, 2025, Semler Scientific bought 871 bitcoins for $88.5...\nsource: https://coinpedia.org/news/semler-scientific-purchases-871-bitcoins-achieves-impressive-btc-yield/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733537&language=en-US",
            "pub_date": "2025-02-04 21:25:06",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733536,
            "title": "Treasury Faces Lawsuit Over Elon Musk’s Alleged Access to Private Financial Data",
            "description": "A major labor union has taken legal action against the U.S. Treasury, claiming it unlawfully granted Elon Musk’s Department of Government Efficiency (DOGE) access to vast amounts of personal and financial data.\nThe post Treasury Faces Lawsuit Over Elon Musk’s Alleged Access to Private Financial Data appeared first on Cryptodnes.\nsource: https://cryptodnes.bg/en/treasury-faces-lawsuit-over-elon-musks-alleged-access-to-private-financial-data/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733536&language=en-US",
            "pub_date": "2025-02-04 21:30:19",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733535,
            "title": "Bitcoin risks correction below $90K on US-China trade war concerns",
            "description": "Trade war concerns and traditional market volatility threaten a short-term BTC correction below $90,000, analysts told Cointelegraph.\nsource: https://cointelegraph.com/news/bitcoin-correction-90k-china-tariffs-trade-war-concerns?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733535&language=en-US",
            "pub_date": "2025-02-04 21:33:36",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733523,
            "title": "Gold price near all-time high amid increased bitcoin and equity volatility",
            "description": "Gold is trading above $2,820, nearing Monday's all-time high, while volatility in bitcoin and U.S. equities continues to rise.\nsource: https://www.theblock.co/post/338533/gold-price-high-bitcoin-equity-volatility?utm_source=rss&utm_medium=rss",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733523&language=en-US",
            "pub_date": "2025-02-04 21:16:17",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}