{
    "data": [
        {
            "id": 733226,
            "title": "BNB Drops Below 580 USDT with a Narrowed 4.56% Increase in 24 Hours",
            "description": "On Feb 04, 2025, 05:26 AM(UTC). According to Binance Market Data, BNB has dropped below 580 USDT and is now trading at 579.969971 USDT, with a narrowed narrowed 4.56% increase in 24 hours.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733226&language=en-US",
            "pub_date": "2025-02-04 13:26:36",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733225,
            "title": "Tron, Movement deny \"token swap\" transaction with WLFI project",
            "description": "Regarding the Trump crypto project WLFI's invitation to blockchain projects to participate in the \"token swap\" transaction, a Tron spokesperson told CoinDesk that it did not participate in the token exchange agreement. Movement Labs co-founder Rushi Manche also told CoinDesk earlier that no tokens were sent to anyone, including WLFI - \"There was no transaction, no backdoor transaction. This was purely a market purchase.\" (CoinDesk)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733225&language=en-US",
            "pub_date": "2025-02-04 13:28:41",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733221,
            "title": "BTC fell below 99,000 USDT, and the 24-hour increase narrowed to 6.22%",
            "description": "OKX market shows that BTC fell below 99,000 USDT and is now at 98,940.8 USDT, with the 24-hour increase narrowed to 6.22%. (This newsletter is generated by AI)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733221&language=en-US",
            "pub_date": "2025-02-04 13:16:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733223,
            "title": "Ethereum(ETH) Drops Below 2,700 USDT with a Narrowed 8.63% Increase in 24 Hours",
            "description": "On Feb 04, 2025, 05:17 AM(UTC). According to Binance Market Data, Ethereum has dropped below 2,700 USDT and is now trading at 2,693.030029 USDT, with a narrowed narrowed 8.63% increase in 24 hours.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733223&language=en-US",
            "pub_date": "2025-02-04 13:17:36",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733224,
            "title": "Bitcoin(BTC) Drops Below 99,000 USDT with a Narrowed 6.14% Increase in 24 Hours",
            "description": "On Feb 04, 2025, 05:17 AM(UTC). According to Binance Market Data, Bitcoin has dropped below 99,000 USDT and is now trading at 98,877.257813 USDT, with a narrowed narrowed 6.14% increase in 24 hours.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733224&language=en-US",
            "pub_date": "2025-02-04 13:17:36",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733222,
            "title": "China Imposes Tariffs On U.S. Imports Starting February 2025",
            "description": "According to PANews, China's State Council Tariff Commission has announced new tariffs on certain imports from the United States, effective February 10, 2025. With approval from the State Council, the tariffs will include a 15% duty on coal and liquefied natural gas. Additionally, a 10% tariff will be applied to crude oil, agricultural machinery, large-engine vehicles, and pickup trucks.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733222&language=en-US",
            "pub_date": "2025-02-04 13:23:46",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733217,
            "title": "Cardano (ADA) at a Crossroads: Could Bears Take Control Again?",
            "description": "Cardano price started a fresh decline below the $0.9250 zone. ADA is now correcting losses and struggling to clear the $0.80 resistance. ADA price started a fresh decline from the $0.9250 zone. The price is trading below $0.850 and the 100-hourly simple moving average. There is a key bearish trend line forming with resistance at $0.8050 on the hourly chart of the ADA/USD pair (data source from...\nsource: https://www.newsbtc.com/analysis/ada/cardano-ada-at-a-crossroads-0-80/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733217&language=en-US",
            "pub_date": "2025-02-04 13:08:16",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733214,
            "title": "The historical cumulative net inflow of Bitcoin spot ETF has reached 40.263 billion US dollars, and the net outflow was the first after the net inflow in the past 4 days",
            "description": "Odaily Planet Daily News According to SoSoValue data, yesterday (February 3, Eastern Time), the total net outflow of Bitcoin spot ETFs was US$235 million.\nYesterday, Grayscale ETF GBTC had a single-day net inflow of US$8.0191 million, and the current historical net outflow of GBTC is US$21.883 billion.\nGrayscale Bitcoin Mini Trust ETF BTC had a single-day net outflow of US$0.00, and the current historical total net inflow of Grayscale Bitcoin Mini Trust BTC is US$1.232 billion.\nAs of press time, the total net asset value of Bitcoin spot ETF is US$119.14 billion, the ETF net asset ratio (market value to the total market value of Bitcoin) is 5.95%, and the historical cumulative net inflow has reached US$40.263 billion.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733214&language=en-US",
            "pub_date": "2025-02-04 13:03:10",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733216,
            "title": "BNB Drops Below 590 USDT with a Narrowed 8.22% Increase in 24 Hours",
            "description": "On Feb 04, 2025, 05:06 AM(UTC). According to Binance Market Data, BNB has dropped below 590 USDT and is now trading at 589.799988 USDT, with a narrowed narrowed 8.22% increase in 24 hours.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733216&language=en-US",
            "pub_date": "2025-02-04 13:06:36",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733209,
            "title": "The Ethereum spot ETF has accumulated a total net inflow of US$2.842 billion, and the ETF net asset ratio has reached 3.06%.",
            "description": "Odaily Planet Daily News According to SoSoValue data, yesterday (February 3, Eastern Time), the total net inflow of Ethereum spot ETFs was 83.5404 million US dollars.\nYesterday, Grayscale Ethereum Trust ETF ETHE had a single-day net inflow of 15.8517 million US dollars, and the current historical net outflow of ETHE is 3.918 billion US dollars.\nGrayscale Ethereum Mini Trust ETF ETH had a single-day net inflow of 12.7543 million US dollars, and the current historical total net inflow of Grayscale Ethereum Mini Trust ETH is 607 million US dollars.\nThe Ethereum spot ETF with the largest single-day net inflow yesterday was Fidelity ETF FETH, with a single-day net inflow of 49.7493 million US dollars, and the current historical total net inflow of FETH reached 1.462 billion US dollars.\nThe second is Grayscale ETF ETHE, with a single-day net inflow of US$15.8517 million. Currently, ETHE has a total net outflow of US$3.918 billion.\nAs of press time, the total net asset value of Ethereum spot ETF is US$9.979 billion, and the ETF net asset ratio (market value to Ethereum's total market value) is 3.06%, and the historical cumulative net inflow has reached US$2.842 billion.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733209&language=en-US",
            "pub_date": "2025-02-04 12:54:10",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}