{
    "data": [
        {
            "id": 1050268,
            "title": "The head of Hong Kong cryptocurrency exchange AAX, suspected of embezzling over HK$600 million, was arrested and charged with three counts of theft and one count of fraud.",
            "description": "Hong Kong cryptocurrency exchange AAX ceased operations in mid-November 2022 citing system maintenance and updates, leaving over 300 customers unable to recover nearly HK$100 million in assets. Hong Kong law enforcement investigations revealed that the platform's shutdown was allegedly caused through false information and illegal means. The person in charge fled Hong Kong with cryptocurrency wallets and private keys, but was later arrested upon returning. Hong Kong police stated today that a thorough investigation revealed losses totaling approximately HK$81 million to 191 victims. The AAX person in charge withdrew approximately HK$633 million worth of cryptocurrency after the platform's closure and has been charged with three counts of theft and one count of fraud. (Hong Kong 01)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050268&language=en-US",
            "pub_date": "2026-02-26 20:02:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050241,
            "title": "Krispy Kreme Anticipates Reduced Leverage Amid Turnaround Efforts",
            "description": "Krispy Kreme is forecasting a further reduction in its leverage by the end of this year as it continues to implement its turnaround strategy. Bloomberg posted on X, highlighting the company's efforts to strengthen its financial position following the conclusion of its U.S. partnership with McDonald's. The doughnut chain is focusing on enhancing its operational efficiency and expanding its market presence to achieve its financial goals. This strategic shift comes as Krispy Kreme aims to optimize its business model and improve profitability in the competitive food industry.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050241&language=en-US",
            "pub_date": "2026-02-26 19:54:58",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050240,
            "title": "Bitcoin Spot ETFs Record $507M Net Inflows as All Funds Turn Positive",
            "description": "Bitcoin spot exchange-traded funds (ETFs) recorded $507 million in total net inflows on February 25 (U.S. Eastern Time), with none of the twelve listed ETFs posting net outflows, according to data from SoSoValue.Leading the inflows was BlackRock’s iShares Bitcoin Trust IBIT, which attracted $297 million in a single day. With the latest additions, IBIT’s historical cumulative net inflows have climbed to $61.563 billion, maintaining its position as the dominant vehicle for institutional Bitcoin exposure.The second-largest inflow was recorded by Grayscale’s Bitcoin Trust ETF GBTC, which saw $102 million in net inflows on the day. Despite the positive session, GBTC’s historical cumulative net outflows remain sizeable at $25.874 billion, reflecting the longer-term capital rotation away from the legacy product.As of the time of writing, the total net asset value (NAV) of Bitcoin spot ETFs stands at $87.604 billion. The ETF net asset ratio, measured as a percentage of Bitcoin’s total market capitalization, has reached 6.34%, while historical cumulative net inflows across all Bitcoin spot ETFs now total $54.573 billion.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050240&language=en-US",
            "pub_date": "2026-02-26 19:56:04",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050239,
            "title": "Bitcoin News: Indiana Bitcoin Rights Bill Advances to Governor After Bicameral Approval",
            "description": "Indiana lawmakers have advanced a wide-ranging digital asset bill that expands cryptocurrency investment access for public retirement plans while strengthening individual rights to use and hold crypto. The legislation now awaits final approval from Mike Braun, Indiana’s governor.House Bill 1042, formally titled “Regulation and Investment of Cryptocurrency,” received bicameral approval on Wednesday after the Indiana House concurred with amendments passed by the Senate. The bill was introduced by state Representative Kyle Pierce.Crypto Access for Public Retirement and Savings PlansHB 1042 requires several state-administered retirement and savings plans to offer participants a self-directed brokerage account that includes at least one cryptocurrency investment option.Plans covered under the bill include:The legislators’ defined contribution planThe Hoosier START college savings programDesignated plans under the Public Employees’ Retirement FundDesignated plans under the Teachers’ Retirement FundThe measure is designed to broaden investment choice while allowing participants to decide their own risk exposure, rather than mandating direct crypto allocation by the state.Legal Protections for Individual Crypto UseBeyond investment access, HB 1042 includes explicit protections for individual digital asset activity. The bill prevents most public agencies—excluding the Department of Financial Institutions—from enforcing rules that restrict the lawful use of cryptocurrencies.Under the bill:Individuals cannot be barred from accepting crypto as payment for legal goods and servicesResidents retain the right to hold digital assets in self-custodied or hardware walletsThe state is prohibited from imposing special or discriminatory taxes on crypto transactions that do not apply to other financial activitiesEffective Date and National ContextIf signed into law, HB 1042 will take effect on July 1, 2026.The legislation reflects a broader national shift toward integrating Bitcoin and digital assets into traditional financial frameworks while preserving user autonomy. At the federal level, Donald Trump signed an executive order in August allowing 401(k) retirement plans to include cryptocurrency investments, signaling growing acceptance of digital assets within regulated retirement systems.With final approval now resting on the governor’s desk, Indiana is positioned to become one of the more crypto-forward U.S. states in both retirement policy and individual digital asset rights, according to The Block.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050239&language=en-US",
            "pub_date": "2026-02-26 19:58:12",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050238,
            "title": "U.S. Commerce Secretary Faces Senate Inquiry Over Conflict of Interest Concerns",
            "description": "U.S. Commerce Secretary Gina Raimondo is under scrutiny as she faces questions from senators regarding potential conflicts of interest. According to Jin10, the inquiry focuses on her financial holdings and their possible influence on her policy decisions. The Senate's examination aims to ensure transparency and integrity within the Commerce Department. This development highlights ongoing concerns about the intersection of personal financial interests and public service roles in the U.S. government.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050238&language=en-US",
            "pub_date": "2026-02-26 20:00:24",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050237,
            "title": "Analysis: BTC may challenge $80,000; a pullback to the 200-week moving average could become new resistance.",
            "description": "Market data shows that Bitcoin's price has risen above its 200-week exponential moving average (EMA) at $68,338. Rekt Capital analysis points out that Bitcoin is currently being suppressed by this trendline, and the latest rebound may evolve into a \"retest of the EMA after a break below, confirming new resistance.\" The market is focusing on the liquidity-intensive area above $72,000, anticipating a potential \"liquidity sweep.\" If the bulls successfully recover the key moving average and confirm it with a weekly close, $80,000 could become the next target price. AlphaBTC analysis states, \"The Bitcoin liquidity hunt has only just begun, and unless a catalyst for a decline emerges, the price highs are expected to be broken in the coming weeks.\" (Cointelegraph)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050237&language=en-US",
            "pub_date": "2026-02-26 19:53:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050229,
            "title": "Power Protocol Secures $3 Million to Expand Game Token Economy",
            "description": "Power Protocol, a blockchain infrastructure for gaming, has announced the successful completion of a $3 million funding round. According to ChainCatcher, the investment was led by Bitkraft, Delphi Digital, Spartan VC, and Mechanism Capital. The newly acquired funds will be utilized to enhance the platform's ability to support a diverse range of game token economic models, moving beyond the development of single tokens tied to individual games.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050229&language=en-US",
            "pub_date": "2026-02-26 19:43:36",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050228,
            "title": "Swedish Intelligence Agency Urges Vigilance Amid General Security Concerns",
            "description": "The Swedish National Defence Radio Establishment has called for increased vigilance, emphasizing that the alert is not due to any specific threat. According to Jin10, the agency highlighted the importance of maintaining heightened awareness in light of general security concerns. This advisory comes as part of ongoing efforts to ensure national safety and preparedness. The agency reassured the public that there is no immediate danger but stressed the need for continued caution.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050228&language=en-US",
            "pub_date": "2026-02-26 19:45:47",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050227,
            "title": "Tether and Circle Expand Operations in South Korea Amid Regulatory Changes",
            "description": "Tether and Circle are increasing their presence in South Korea by hiring new staff, following recent personnel shifts. According to NS3.AI, Circle has been enhancing its business activities in the region since the CEO's visit last year. These strategic moves appear to be in anticipation of the forthcoming South Korean Digital Asset Basic Act, which could mandate local branches for foreign stablecoin issuers distributing tokens in the market.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050227&language=en-US",
            "pub_date": "2026-02-26 19:50:01",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050226,
            "title": "Debate on AI's Role in Skill Development",
            "description": "The Long View, institutional investor, posted on X. A discussion has emerged regarding the integration of artificial intelligence in skill development. The debate centers around whether skills learned with AI tools should be tested without them. Critics argue that relying solely on AI for learning may not adequately prepare individuals for real-world scenarios where traditional methods are required. Proponents, however, believe that AI enhances efficiency and modernizes skill acquisition, making it essential for contemporary education and training.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050226&language=en-US",
            "pub_date": "2026-02-26 19:51:01",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050217,
            "title": "Syngenta Plans Major IPO in Hong Kong",
            "description": "Syngenta is gearing up for its second attempt at going public, targeting Hong Kong for the listing. Bloomberg posted on X, the company is contemplating raising up to $10 billion, potentially making it one of the largest initial public offerings in Hong Kong's history. This move comes as Syngenta seeks to capitalize on favorable market conditions and expand its global presence. The agricultural giant's decision to pursue an IPO in Hong Kong underscores the city's significance as a financial hub and its appeal to international companies looking to access Asian markets.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050217&language=en-US",
            "pub_date": "2026-02-26 19:36:38",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050216,
            "title": "Equinix and CPPIB Close to Acquiring atNorth Holding",
            "description": "Equinix Inc. and the Canada Pension Plan Investment Board (CPPIB) are reportedly on the verge of finalizing a deal to acquire atNorth Holding, a prominent data center operator in the Nordic region. Bloomberg posted on X that the acquisition is expected to enhance Equinix's presence in the Nordic data center market, which is known for its advanced infrastructure and renewable energy resources.\n\nThe potential acquisition underscores the growing interest in data center investments, driven by increasing demand for cloud services and digital infrastructure. atNorth Holding operates several facilities across the Nordic countries, providing services to a range of clients in the region.\n\nThe deal, if completed, would mark a significant expansion for Equinix, which is already a major player in the global data center industry. CPPIB's involvement highlights the appeal of data centers as a stable investment opportunity, given the sector's resilience and growth potential.\n\nFurther details about the terms of the acquisition have not been disclosed, and representatives from Equinix and CPPIB have yet to comment on the matter. The transaction is anticipated to be finalized in the coming weeks, pending regulatory approvals and other customary closing conditions.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050216&language=en-US",
            "pub_date": "2026-02-26 19:37:23",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050215,
            "title": "Bank of America Raises Nvidia Target Price to $300",
            "description": "Bank of America has increased its target price for Nvidia (NVDA.O) from $275.00 to $300.00. According to Jin10, this adjustment reflects the bank's positive outlook on Nvidia's market performance and potential growth. Nvidia, a leading player in the tech industry, has been experiencing significant developments, prompting analysts to reassess its valuation. The revised target price suggests confidence in Nvidia's ability to capitalize on emerging opportunities and maintain its competitive edge in the sector.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050215&language=en-US",
            "pub_date": "2026-02-26 19:39:33",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050212,
            "title": "10x Research: Circle surged due to short squeeze; subsequent market trading logic will likely return to fundamentals.",
            "description": "10x Research, in an analysis published on the X platform, pointed out that the core driver of Circle's stock price surge yesterday was not the earnings report itself, but rather the market positioning structure. This structure is more likely to trigger a high-probability short-covering rally, rather than a simple fundamental revaluation. It is reported that some hedge funds established large short positions before the earnings release; however, as Circle's stock price surged in a single day, triggering a sharp short squeeze, the hedge funds suffered losses of approximately $500 million in a single day. 10x Research added that this round of sharp fluctuations not only affected Circle but also impacted Coinbase and Bitcoin. Although Circle is a clearly bullish stock, the overall price movement was mainly driven by the imbalance in the overall positioning structure of the crypto market. A new market catalyst may be emerging soon, potentially reshaping the market narrative, after which market trading logic may return to fundamentals.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050212&language=en-US",
            "pub_date": "2026-02-26 19:33:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050211,
            "title": "Power Protocol, a gaming blockchain infrastructure provider, has raised $3 million in funding, with participation from Delphi Digital and others.",
            "description": "Power Protocol, a gaming blockchain infrastructure provider, announced the completion of a $3 million funding round, with participation from Bitkraft, Delphi Digital, Spartan VC, and Mechanism Capital, among others. The new funding will support its expansion into a token economy model across multiple game genres, rather than simply building a single token tied to a single game. (Pocketgamer)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050211&language=en-US",
            "pub_date": "2026-02-26 19:35:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050210,
            "title": "The International Finance Corporation (IFC), a member of the World Bank, will invest $40 million in Zetrix AI, a digital infrastructure company.",
            "description": "The World Bank Group announced that, through its International Finance Corporation (IFC), it will invest US$40 million (approximately RM155.6 million) in digital infrastructure company Zetrix AI. The new funds will support the development and promotion of new blockchain-based deep information capture (DPI) applications and artificial intelligence (AI) products, thereby improving digital inclusion, service access, and economic efficiency in Malaysia and the wider ASEAN region. The investment will also explore cross-border practical applications of blockchain and AI in areas such as digital identity, customs clearance processes, large language models, and stablecoins. (PRNewswire)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050210&language=en-US",
            "pub_date": "2026-02-26 19:36:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050209,
            "title": "Strategy World 2026 Conference: The Era of Traditional Enterprise Software is Coming to an End",
            "description": "At Strategy World 2026 in Las Vegas, Strategy, a global Bitcoin treasury company, announced several significant advancements under the theme \"Freedom by Design,\" proposing a future-oriented \"Agentic Enterprise\" architecture and asserting the impending end of the traditional enterprise software era. In his keynote address, Strategy President and CEO Phong Le pointed out that traditional enterprise software, business intelligence (BI), and data warehousing models are insufficient to meet the real-time intelligence demands of modern enterprises, emphasizing that a new paradigm centered on artificial intelligence and enterprise sovereignty will replace existing technologies. The company also disclosed at the conference that it is developing a new feature called \"AI-Generated Ontologies,\" which can automatically construct the internal relationship structure of an enterprise, generating real-time updated digital twin models that can be used for AI reasoning and decision-making. This capability is expected to help enterprises automatically map complex business logic into machine-understandable semantic networks. In addition, Strategy Executive Chairman Michael Saylor defined Bitcoin as “Digital Capital”—the ultimate reserve asset for the 21st century—and presented the company’s “Fortress Balance Sheet” of approximately $45 billion as of February 24, 2026, laying the financial foundation for technological and product innovation over the next 30 years.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050209&language=en-US",
            "pub_date": "2026-02-26 19:39:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050200,
            "title": "Indian Regulators Intensify Scrutiny on Equity Options Market",
            "description": "Indian regulators are intensifying their scrutiny of the country's extensive equity options market amid concerns that small investors are incurring significant losses to advanced trading firms. Bloomberg posted on X, highlighting the regulatory efforts aimed at curbing market abuses. The crackdown is part of a broader initiative to protect retail investors and ensure market integrity. Authorities are focusing on identifying and addressing manipulative practices that may disadvantage less experienced participants. The effectiveness of these measures remains under evaluation as regulators continue to monitor the market closely.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050200&language=en-US",
            "pub_date": "2026-02-26 19:22:11",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050199,
            "title": "Argentex Faces Potential Shortfall on £35 Million Loan from IFX",
            "description": "Argentex is anticipated to experience a shortfall on its £35 million loan from IFX. Bloomberg posted on X, highlighting concerns over the financial implications for both parties involved. The situation underscores the challenges faced by companies in managing large-scale financial transactions and the potential risks associated with such loans. As the financial landscape continues to evolve, stakeholders are closely monitoring developments to assess the impact on future business operations.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050199&language=en-US",
            "pub_date": "2026-02-26 19:22:59",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050198,
            "title": "Bitcoin's MVRV Z-Score Indicates Strong Bearish Trend",
            "description": "On February 26, cryptocurrency market analyst Axel shared a report on social media highlighting data from CryptoQuant. According to BlockBeats, the report reveals that Bitcoin's MVRV Z-Score is currently at -2.28, surpassing the bear market lows of 2018 (-1.6) and 2022 (-1.4), indicating a 'strong bear' zone.The MVRV Z-Score measures the deviation of market value from realized value, with negative values suggesting that market prices are below the on-chain 'fair value.' Axel attributes this anomaly to the scale of realized market value in the ETF era, where significant institutional capital inflows have raised the cost basis, making the Z-Score more sensitive to price adjustments. A rise in the Z-Score above -1.5, coupled with prices maintaining above $65,000, would be the first technical confirmation signal of exiting the pressure zone.However, the NUPL indicator, which gauges market sentiment, currently stands at 0.197, remaining in the 'hope' zone and far from the capitulation areas seen in historical cycle bottoms. During true capitulation phases, such as December 2018, March 2020, and November 2022, the NUPL would dip into negative territory, indicating net losses for most holders. The current level of 0.197 is in the middle of the historical range, still distant from the true pain zone. The data suggests that while market sentiment is weakening, it has not yet reached panic levels. Most participants are still in a position of paper profits (NUPL > 0), although confidence has noticeably shaken.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050198&language=en-US",
            "pub_date": "2026-02-26 19:23:39",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}