{
    "data": [
        {
            "id": 733949,
            "title": "Bullish, backed by Peter Thiel, plans to IPO this year and is in talks with Jefferies Group about a potential listing",
            "description": "Odaily Planet Daily News: People familiar with the matter revealed that Bullish Global, an operator of crypto asset exchanges, is considering an IPO as early as this year, and its backers include billionaire Peter Thiel. The company is working with Jefferies Financial Group Inc. on a potential listing.\nPeople familiar with the matter added that deliberations are still ongoing, IPO details may change, and more banks may join the lineup.\nBullish's website shows that the company is led by CEO Tom Farley, has more than 275 employees, and has offices in the United States, Hong Kong, Singapore, Gibraltar and the Cayman Islands. The company acquired the media CoinDesk from Digital Currency Group in 2023 for an undisclosed amount.\nAccording to an earlier statement, Bullish is a subsidiary of blockchain software company Block.one, and its backers include Thiel, Alan Howard, Louis Bacon and Richard Li. Block.one co-founder and CEO Brendan Blumer, who also serves as Bullish's chairman, founded the company in 2021 and funded it with about $10 billion in digital assets and cash. (Bloomberg)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733949&language=en-US",
            "pub_date": "2025-02-05 10:00:40",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733954,
            "title": "Private Stablecoin Transactions Set To Revolutionize The Market",
            "description": "According to Odaily, Placeholder partner Chris Burniske recently stated on X that private stablecoin transactions are poised to unlock a new level in the financial landscape. He described these transactions as 'private, low-cost, and legal,' emphasizing that these qualities are essential for effective private stablecoin trading.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733954&language=en-US",
            "pub_date": "2025-02-05 10:03:33",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733953,
            "title": "Cryptocurrency Market Sees Mixed Performance With Notable Gains And Losses",
            "description": "According to PANews, the cryptocurrency market experienced varied movements on February 5. Leading the gains were several tokens, with WIF priced at $0.818, marking a 2.38% increase. PEOPLE followed, trading at $0.0199 with a 1.58% rise, while ORDI reached $12.72, up by 1.42%. EOS was reported at $0.612, showing a 1.21% gain, and CFX at $0.111, with a 0.99% increase.\n\nConversely, some tokens faced significant declines. RAY was priced at $6.0387, experiencing a 6.84% drop. LDO followed with a 5.35% decrease, trading at $1.690. MKR saw a 5.03% decline, priced at $907, while JUP fell by 4.86% to $0.948. SOL also experienced a downturn, trading at $205.51, down by 4.71%.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733953&language=en-US",
            "pub_date": "2025-02-05 10:03:40",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733952,
            "title": "Solana's On-Chain GDP Surges in Q4 2024",
            "description": "According to PANews, data from Messari reveals that Solana's on-chain GDP, or total application revenue, experienced a significant increase of 213% in the fourth quarter of 2024, reaching $840 million. Among the contributors, Pump Fun generated $235 million, marking a 242% rise from the previous quarter. Photon reported $140 million in revenue, a 278% increase. Raydium's earnings reached $74 million, up by 268%, while BullX earned $73 million, reflecting a 260% growth. Trojan also saw a substantial rise, with $63 million in revenue, a 187% increase from the prior quarter.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733952&language=en-US",
            "pub_date": "2025-02-05 10:03:47",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733948,
            "title": "White House Unveils Cryptocurrency Legislation Plans",
            "description": "According to PANews, the White House's head of artificial intelligence and cryptocurrency, David Sacks, held the first cryptocurrency-themed press conference on Tuesday. During the event, he outlined legislative priorities and revealed significant regulatory initiatives by the Trump administration for the emerging industry. These initiatives include a market structure bill and a comprehensive stablecoin bill.\n\nKey leaders from the Senate and House attended the event. Senate Banking Committee Chairman Tim Scott announced his intention to push these crucial cryptocurrency bills through the Senate within the first 100 days of U.S. President Donald Trump's term, which is less than three months away. Scott mentioned that the stablecoin bill, known as the GENIUS Act, introduced by Senator Bill Hagerty on Tuesday, might be the first to advance.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733948&language=en-US",
            "pub_date": "2025-02-05 09:43:55",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733944,
            "title": "Kaspersky: Beware of cryptocurrency-stealing malware in Android and iOS app-making kits",
            "description": "Odaily Planet Daily News Cybersecurity company Kaspersky Labs said that malware development kits used to make applications on Google Play Store and Apple App Store are scanning users' pictures for crypto wallet recovery phrases to steal funds from them.\nKaspersky analysts Sergey Puzan and Dmitry Kalinin said in a report on February 4 that once the malware named SparkCat infects a device, it searches for images using specific keywords in different languages ​​through an optical character recognition (OCR) stealer. \"The intruder steals the recovery phrases of the crypto wallets, which are enough to fully control the victim's wallet and further steal funds,\" the analysts wrote. \"It should be noted that the flexibility of the malware allows it to steal not only secret phrases, but also other personal data in the gallery, such as message content or passwords that may be retained on screenshots.\"\nIn addition, on Android applications, the malware uses a Java component called Spark (disguised as an analysis module) and an encrypted configuration file stored on GitLab (providing commands and operation updates).\nAnalysts recommend not storing sensitive information in screenshots or the phone's photo gallery, but using a password manager, while also deleting any suspicious or infected apps.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733944&language=en-US",
            "pub_date": "2025-02-05 09:48:43",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733947,
            "title": "Malware Targets Cryptocurrency Wallets Through Image Scanning",
            "description": "According to BlockBeats, on February 5, Kaspersky Labs reported that a malicious software development kit used for creating applications on the Google Play Store and Apple App Store is scanning user images to locate cryptocurrency wallet seed phrases, aiming to steal funds.\n\nKaspersky analysts Sergey Puzan and Dmitry Kalinin revealed in a report dated February 4 that once the malware, named SparkCat, infects a device, it employs an optical character recognition (OCR) stealer to search images for specific keywords in various languages.\n\nThe analysts noted, \"Intruders steal the seed phrases of cryptocurrency wallets, which are sufficient to gain full control over the victim's wallet, allowing further theft of funds.\"\n\nThey also highlighted the malware's flexibility, stating that it can not only steal seed phrases but also extract other personal data from photo albums, such as message content or passwords that might be stored in screenshots.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733947&language=en-US",
            "pub_date": "2025-02-05 09:53:34",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733942,
            "title": "CFTC Restructures Enforcement Division To Combat Fraud",
            "description": "According to BlockBeats, the U.S. Commodity Futures Trading Commission (CFTC) has reorganized its enforcement division to enhance its focus on combating fraud. Acting Chair Caroline Pham stated that the agency aims to shift away from regulating through enforcement actions.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733942&language=en-US",
            "pub_date": "2025-02-05 09:34:10",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733938,
            "title": "Hester Peirce: Cryptocurrency Working Group proposes to recommend SEC action to provide temporary forward-looking and retroactive relief for token issuance",
            "description": "Odaily Planet Daily News: U.S. SEC Commissioner Hester Peirce said: \"The Cryptocurrency Working Group is considering recommending that the SEC take action to provide temporary forward-looking and retroactive relief for token issuance, in which the issuing entity or other entity willing to assume responsibility provides certain specific information and keeps it updated, and agrees not to question the SEC's jurisdiction in cases alleging fraud related to the purchase and sale of assets.\" She also said: \"We will work with the federal government, state securities regulators, and international counterparts. We invite builders, enthusiasts, and skeptics to explore with us what the final rules should be and what temporary measures may help promote innovation during this period.\" (The Block) Earlier news, the U.S. SEC launched a new cryptocurrency working group website. According to the webpage, the cryptocurrency working group aims to clarify the application of federal securities laws in the crypto asset market and propose practical policy measures to promote innovation and protect investors. The crypto working group works with committee staff and the public to help develop new approaches to crypto asset regulation. The Crypto Working Group will help draw clear regulatory lines that appropriately distinguish between securities and non-securities, develop a tailored disclosure framework, provide a practical registration path for crypto assets and market intermediaries, ensure that investors have the information they need to make investment decisions, and ensure that enforcement resources are deployed wisely.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733938&language=en-US",
            "pub_date": "2025-02-05 09:37:06",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733937,
            "title": "The ENS cold wallet address transferred 72,000 ENS to Binance 10 hours ago, worth $2.04 million",
            "description": "Odaily Planet Daily News: According to monitoring by on-chain analyst Yu Jin, the ENS cold wallet address transferred 72,000 ENS (US$2.04 million) to FalconX (a digital asset broker) 10 hours ago, and then immediately transferred it from FalconX to Binance.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733937&language=en-US",
            "pub_date": "2025-02-05 09:40:31",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}