{
    "data": [
        {
            "id": 733836,
            "title": "Republicans announce formation of bicameral crypto working group",
            "description": "The working group involving four congressional committees will be separate from one studying a Bitcoin reserve under Donald Trump’s executive orders.\nsource: https://cointelegraph.com/news/republican-lawmakers-crypto-working-group?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733836&language=en-US",
            "pub_date": "2025-02-05 05:29:15",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733835,
            "title": "BTC falls below 97,000 USDT",
            "description": "OKX market data shows that BTC fell below 97,000 USDT and is now at 96,993.7 USDT, a 24-hour drop of 4.33%. (This newsletter is generated with the assistance of AI)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733835&language=en-US",
            "pub_date": "2025-02-05 05:32:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733833,
            "title": "SEC’s crypto task force to focus on securities classifications, among other priorities",
            "description": "The SEC's newly created crypto task force will take on a long list of priorities as the agency takes on a different direction.\nsource: https://www.theblock.co/post/338904/secs-crypto-task-force-to-focus-on-securities-classifications-among-other-priorities?utm_source=rss&utm_medium=rss",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733833&language=en-US",
            "pub_date": "2025-02-05 05:10:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733832,
            "title": "Bitcoin could be part of US sovereign wealth fund plan, says Trump’s crypto czar",
            "description": "Trump's sovereign wealth fund executive order could potentially include bitcoin among its strategic assets, an analyst said.\nsource: https://www.theblock.co/post/338761/bitcoin-could-be-part-of-us-sovereign-wealth-fund-plan-says-trumps-crypto-czar?utm_source=rss&utm_medium=rss",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733832&language=en-US",
            "pub_date": "2025-02-05 05:13:19",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733831,
            "title": "Sol Strategies boosts Solana holdings with latest 190,000 SOL purchase",
            "description": "As of Jan. 31, Sol Strategies and its subsidiaries held an aggregate of 189,968 SOL, valued at nearly $41 million.\nsource: https://www.theblock.co/post/338879/sol-strategies-boosts-solana-holdings-with-latest-190000-sol-purchase?utm_source=rss&utm_medium=rss",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733831&language=en-US",
            "pub_date": "2025-02-05 05:15:25",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733830,
            "title": "Ethereum Game 'What Is This Sorcery' Is Raising Funds via Kickstarter—Here's Why",
            "description": "Trading card game What Is This Sorcery is raising funds via Kickstarter to produce physical cards—but it’s more than just a fundraiser.\nsource: https://decrypt.co/304382/ethereum-game-what-sorcery-kickstarter-skale",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733830&language=en-US",
            "pub_date": "2025-02-05 05:16:39",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733823,
            "title": "Pundit Predicts XRP’s Meteoric Moonshot Will Make Bitcoin’s Post-ETF Rally ‘Look Like Child’s Play’",
            "description": "XRP staged an impressive 50% surge in January, outperforming the broader crypto market following bullish regulatory developments for Ripple.\nsource: https://zycrypto.com/pundit-predicts-xrps-meteoric-moonshot-will-make-bitcoins-post-etf-rally-look-like-childs-play/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733823&language=en-US",
            "pub_date": "2025-02-05 05:04:10",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733820,
            "title": "Bitcoin(BTC) Drops Below 98,000 USDT with a 3.62% Decrease in 24 Hours",
            "description": "On Feb 04, 2025, 21:02 PM(UTC). According to Binance Market Data, Bitcoin has dropped below 98,000 USDT and is now trading at 97,675.226563 USDT, with a narrowed 3.62% decrease in 24 hours.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733820&language=en-US",
            "pub_date": "2025-02-05 05:02:37",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733821,
            "title": "Ethereum(ETH) Drops Below 2,700 USDT with a 0.87% Decrease in 24 Hours",
            "description": "On Feb 04, 2025, 21:02 PM(UTC). According to Binance Market Data, Ethereum has dropped below 2,700 USDT and is now trading at 2,692.080078 USDT, with a narrowed 0.87% decrease in 24 hours.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733821&language=en-US",
            "pub_date": "2025-02-05 05:02:37",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733819,
            "title": "SEC Announces New Executive Staff For Crypto Task Force",
            "description": "According to CoinDesk, the U.S. Securities and Exchange Commission (SEC) has announced the appointment of new executive staff members, including three individuals for its recently established Crypto Task Force. This announcement was made by the SEC's Acting Chairman Mark Uyeda on Tuesday.\n\nThe task force includes two appointees from within the SEC. Richard Gabbert, who previously served as counsel to Commissioner Hester Pierce, will take on the role of chief of staff and senior advisor to Uyeda. Taylor Asher, formerly a senior policy advisor to Uyeda, will serve as the chief policy advisor for the task force. Additionally, Landon Zinda, who will be counsel to Uyeda and a senior advisor for the task force, joins from outside the SEC. Zinda previously held the position of policy director at Coin Center, a crypto think tank, and has experience working with crypto-friendly legislators, including Sen. Pat Toomey and Rep. Tom Emmer.\n\nThe SEC's Crypto Task Force was formed last month, shortly after the resignation of former Chairman Gary Gensler. The task force aims to develop a comprehensive regulatory framework for crypto assets, collaborating with Congress, the crypto industry, and the Commodity Futures Trading Commission (CFTC). This initiative marks a shift in the SEC's approach to crypto regulation, moving away from the previous strategy of regulation by enforcement, which was prevalent during Gensler's tenure.\n\nThe SEC acknowledged in a press statement that its past reliance on enforcement actions has led to confusion and a challenging environment for innovation. The agency emphasized the need for clarity on registration requirements and practical solutions for compliance, aiming to create a more transparent and supportive regulatory landscape for the crypto industry.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733819&language=en-US",
            "pub_date": "2025-02-05 05:03:39",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}