{
    "data": [
        {
            "id": 1051087,
            "title": "North Korea Signals Willingness for Improved U.S. Relations",
            "description": "North Korea's state media reported on Thursday that the ninth congress of the Workers' Party of Korea concluded in Pyongyang on Wednesday. According to Ming Pao, North Korean leader Kim Jong-un stated that the country is open to fostering amicable relations with the United States if the U.S. retracts its hostile policies towards North Korea. \n\nOn the same evening, a parade was held in Pyongyang to commemorate the congress, with Kim Jong-un attending alongside his daughter. Both were seen wearing matching black leather jackets, sparking renewed speculation about his daughter's potential role as a successor.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051087&language=en-US",
            "pub_date": "2026-02-27 05:03:34",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051086,
            "title": "Kazakhstan's Upcoming Constitutional Referendum Sparks Debate",
            "description": "Kazakhstan's President Kassym-Jomart Tokayev has signed a decree to hold a nationwide constitutional referendum on October 15, focusing on parliamentary reforms. According to Ming Pao, the proposed changes have stirred controversy, with Tokayev suggesting the abolition of the Senate and the establishment of a unicameral parliament. The draft of the new constitution, prepared behind closed doors by the Justice Minister and presidential party representatives, includes the introduction of a vice-presidential position and a supreme advisory council. Human Rights Watch has raised concerns that these changes may enhance presidential control over appointments and legislation.\n\nExperts suggest that Tokayev, who has declared no intention to seek re-election, is preparing for a power transition in 2029, aiming to provide his successor with a more favorable political environment than he experienced. Additionally, a Kazakhstani journalist was fined by authorities for attempting to conduct a public opinion poll on the referendum.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051086&language=en-US",
            "pub_date": "2026-02-27 05:04:07",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051085,
            "title": "STOCKS | Dell Shares Surge 8% in After-Hours Trading",
            "description": "Dell Technologies Inc. (DELL.N) experienced a notable increase in its stock price, rising by 8% during after-hours trading. According to Jin10, this surge reflects positive investor sentiment and market reaction to recent developments within the company. The increase in Dell's stock price highlights the company's ongoing efforts to strengthen its market position and enhance shareholder value. Investors are closely monitoring Dell's performance as it navigates the competitive landscape of the technology sector.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051085&language=en-US",
            "pub_date": "2026-02-27 05:06:23",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051084,
            "title": "Cardone Capital Explores Blockchain Tokenization for Real Estate Holdings",
            "description": "Cardone Capital, led by Grant Cardone, is exploring the use of blockchain tokens to represent its $5 billion real estate portfolio. According to NS3.AI, this initiative highlights the increasing trend of tokenization within the real estate sector. The strategy seeks to utilize blockchain technology to improve liquidity and accessibility for investors.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051084&language=en-US",
            "pub_date": "2026-02-27 05:06:34",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051082,
            "title": "On-Chain Data Shows: Whales Are Holding Out in Three Altcoins, Refusing to Sell Despite Significant Losses",
            "description": "Cryptocurrency onchain data shows that some whales are still holding on despite significant losses in three different altcoins. Continue Reading: On-Chain Data Shows: Whales Are Holding Out in Three Altcoins, Refusing to Sell Despite Significant Losses\nsource: https://en.bitcoinsistemi.com/on-chain-data-shows-whales-are-holding-out-in-three-altcoins-refusing-to-sell-despite-significant-lo/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051082&language=en-US",
            "pub_date": "2026-02-27 04:47:08",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051079,
            "title": "U.S. Manufacturing Jobs Decline Under Trump Administration",
            "description": "U.S. Senate Minority Leader Chuck Schumer has stated that during U.S. President Donald Trump's tenure, the manufacturing sector has seen a reduction of 100,000 jobs. According to Jin10, this decline in manufacturing employment comes amid broader economic challenges faced by the industry. The statement highlights ongoing concerns about the health of the manufacturing sector, which has been a focal point of economic policy discussions. Schumer's remarks underscore the need for strategic measures to address job losses and revitalize the manufacturing industry.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051079&language=en-US",
            "pub_date": "2026-02-27 04:47:39",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051080,
            "title": "Render (RNDR) Research: AI Compute Narrative, Adoption Signals, Risks and Outlook",
            "description": "Render (RNDR) research covering AI compute narrative, adoption signals, token utility, risks, and forward outlook in the crypto AI sector. <p>The post Render (RNDR) Research: AI Compute Narrative, Adoption Signals, Risks and Outlook first appeared on Crypto News And Market Updates | BTCUSA. </p>\nsource: https://btcusa.com/render-rndr-research-ai-compute-narrative-adoption-signals-risks-and-outlook/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051080&language=en-US",
            "pub_date": "2026-02-27 04:55:39",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051074,
            "title": "Russian Oil Tanker Diverts from Cuba Amid Fuel Shortages",
            "description": "A tanker suspected of transporting Russian oil to Cuba has changed its course, potentially exacerbating the fuel shortages on the Caribbean island. Bloomberg posted on X, highlighting the impact this diversion could have on Cuba's already strained energy supply. The island nation has been grappling with fuel scarcity, and the absence of this shipment may intensify the situation. The reasons behind the tanker's diversion remain unclear, but the development adds to the challenges faced by Cuba in securing adequate energy resources.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051074&language=en-US",
            "pub_date": "2026-02-27 04:37:03",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051073,
            "title": "TV Azteca Pursues Bankruptcy Protection Amid Debt Recovery Efforts",
            "description": "Mexican billionaire Ricardo Salinas Pliego's broadcaster, TV Azteca, is set to seek bankruptcy protection in Mexico. Bloomberg posted on X, highlighting the move as a new development for bondholders aiming to recover approximately $500 million in debt. This decision marks a significant step in the ongoing financial challenges faced by the company, as it navigates complex negotiations with creditors. The broadcaster's pursuit of bankruptcy protection underscores the broader economic pressures impacting media companies in the region. Bondholders are now focused on strategies to reclaim their investments, while TV Azteca works to stabilize its financial situation. The outcome of these proceedings will be closely watched by industry analysts and stakeholders.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051073&language=en-US",
            "pub_date": "2026-02-27 04:39:23",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051072,
            "title": "Super Bowl 58 in Las Vegas Sets Record for Ticket Prices",
            "description": "Super Bowl 58, held in Las Vegas, has become notable for its record-breaking ticket prices. Bloomberg posted on X, highlighting how the combination of venue, star power, and athletes contributed to the elevated costs. The event's location in Las Vegas, known for its luxury offerings, played a significant role in driving up ticket prices. The presence of high-profile celebrities and athletes further added to the allure, making it a premium experience for attendees. As the Super Bowl continues to evolve, the integration of luxury elements is expected to influence future pricing trends.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051072&language=en-US",
            "pub_date": "2026-02-27 04:40:34",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051064,
            "title": "Most Focused Real-World Asset (RWA) Themed Altcoins Among Crypto Developers Revealed",
            "description": "Which RWA-themed altcoins are attracting the most attention from developers in the cryptocurrency market? Here are the facts. Continue Reading: Most Focused Real-World Asset (RWA) Themed Altcoins Among Crypto Developers Revealed\nsource: https://en.bitcoinsistemi.com/most-focused-real-world-asset-rwa-themed-altcoins-among-crypto-developers-revealed/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051064&language=en-US",
            "pub_date": "2026-02-27 04:32:10",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051062,
            "title": "Venezuela's Gasoline Retailers Declare National Emergency Over Profit Margins",
            "description": "Venezuela's gasoline retailers have announced a national emergency due to six years of minimal profit margins. Bloomberg posted on X, highlighting the challenges faced by the country's new interim leader regarding politically sensitive fuel prices. The declaration underscores the ongoing economic difficulties in Venezuela, where gasoline pricing has been a contentious issue amid broader financial instability. Retailers are seeking solutions to improve their profitability, which has been severely impacted by government policies and market conditions. The situation presents a significant challenge for the interim leadership as they navigate the complexities of the nation's economic landscape.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051062&language=en-US",
            "pub_date": "2026-02-27 04:31:15",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051061,
            "title": "Mexico and U.S. Sign Intelligence Sharing Memorandum",
            "description": "Mexico's Ministry of Finance has signed a memorandum of understanding with the U.S. Internal Revenue Service's Criminal Investigation Division to enhance intelligence sharing. According to Jin10, this agreement aims to strengthen cooperation between the two countries in combating financial crimes and improving tax compliance. The memorandum is expected to facilitate the exchange of information and resources, thereby bolstering efforts to address cross-border financial issues effectively.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051061&language=en-US",
            "pub_date": "2026-02-27 04:31:40",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051060,
            "title": "Labor Department Targets Dominant Companies for Scrutiny",
            "description": "The U.S. Department of Labor is set to focus on major companies that hold significant influence over labor markets. Bloomberg posted on X, revealing a memo from Solicitor of Labor Jonathan Berry outlining this initiative. The plan aims to examine the practices of these powerful entities to ensure compliance with labor laws and regulations. This move is part of a broader effort to address potential imbalances and unfair practices in the labor market. The scrutiny will likely involve a detailed review of how these companies operate and their impact on workers and competition.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051060&language=en-US",
            "pub_date": "2026-02-27 04:35:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051054,
            "title": "On-chain Investigator Accuses Axiom Exchange Staff of Insider Wallet Abuse",
            "description": "On-chain investigator ZachXBT has released a detailed report alleging that multiple employees at Axiom Exchangeabused internal access to monitor users’ private wallet activity and profit from insider information. The allegations have triggered industry-wide scrutiny and immediate response from the exchange.\nsource: https://www.ethnews.com/on-chain-investigator-accuses-axiom-exchange-staff-of-insider-wallet-abuse/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051054&language=en-US",
            "pub_date": "2026-02-27 04:18:21",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051053,
            "title": "US lawmakers revisit stablecoin yields amid deposit flight concerns",
            "description": "Some senators warned that stablecoin yields could blur the line between crypto products and traditional bank deposits.\nsource: https://www.theblock.co/post/391512/us-lawmakers-revisit-stablecoin-yields-deposit-flight-concerns?utm_source=rss&utm_medium=rss",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051053&language=en-US",
            "pub_date": "2026-02-27 04:18:28",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051052,
            "title": "Coinbase Head of Litigation @RVanGrack says crypto legislation efforts are still moving forward despite recent setbacks.\n\n“What’s most important is that no one has left the table.”",
            "description": "null\nsource: https://x.com/coindesk/status/2027117752788431201",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051052&language=en-US",
            "pub_date": "2026-02-27 04:25:08",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051048,
            "title": "Bitcoin bear market may end if bulls reclaim $74.5K: Here’s why",
            "description": "Bitcoin trades below most holders’ cost basis, but a rally above $74,500 could change everything. Can the bulls pull it off?\nsource: https://cointelegraph.com/news/bitcoin-bear-market-may-end-if-bulls-reclaim-dollar74-5k-here-s-why?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051048&language=en-US",
            "pub_date": "2026-02-27 04:12:10",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051051,
            "title": "Key Insights from the Podcast Business Summit",
            "description": "The recent podcast business summit highlighted several significant trends and insights shaping the industry. Bloomberg posted on X, emphasizing the importance of understanding audience engagement and monetization strategies.\n\nIndustry leaders discussed the growing influence of podcasts in media consumption, noting that audience preferences are shifting towards more personalized and niche content. This trend is driving creators to focus on building strong community connections and leveraging data analytics to tailor content.\n\nMonetization remains a critical challenge, with experts suggesting diverse revenue streams such as subscriptions, advertising, and live events. The summit also underscored the potential of emerging markets, where podcast listenership is rapidly increasing.\n\nTechnological advancements were another focal point, with discussions on how innovations in AI and machine learning can enhance content creation and distribution. The role of platforms in supporting creators through better tools and resources was also highlighted.\n\nOverall, the summit provided valuable insights into the evolving landscape of the podcast industry, emphasizing the need for adaptability and innovation to succeed in this dynamic market.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051051&language=en-US",
            "pub_date": "2026-02-27 04:25:26",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051047,
            "title": "NVIDIA's Earnings Performance Since ChatGPT's Release",
            "description": "NVIDIA $NVDA has achieved ten earnings triple plays out of 13 quarters since the release of ChatGPT in November 2022. Bespoke Investment Group posted on X. Despite this strong performance, the stock has experienced intraday declines on each of its last seven earnings reaction days.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051047&language=en-US",
            "pub_date": "2026-02-27 04:11:25",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}