{
    "data": [
        {
            "id": 1051957,
            "title": "Moore Threads: 2025 losses narrowed by 36.70% year-on-year.",
            "description": "Moore Threads announced that in 2025, the company achieved operating revenue of RMB 1,505,525,100, a year-on-year increase of 243.37%; net profit attributable to owners of the parent company was RMB -1,024,311,300, a 36.70% reduction in losses compared to the same period last year. At the end of the reporting period, the company's total assets were RMB 15,307,823,000, an increase of 116.14% compared to the beginning of the reporting period; equity attributable to owners of the parent company was RMB 11,435,479,300, an increase of 154.69% compared to the beginning of the reporting period. (Jinshi)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051957&language=en-US",
            "pub_date": "2026-02-27 18:44:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051943,
            "title": "GEOPOLITICS | Germany Reaffirms Coordinated EU Action in U.S. Tariff Dispute",
            "description": "Germany has reiterated its commitment to a unified European response in the ongoing tariff dispute with the United States. According to Jin10, a German government spokesperson emphasized the importance of collaboration among European nations to address the challenges posed by U.S. trade policies. This stance highlights the EU's strategy to present a consolidated front in negotiations and potential retaliatory measures. The dispute has been a point of contention, affecting transatlantic trade relations and economic strategies within the EU.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051943&language=en-US",
            "pub_date": "2026-02-27 18:41:01",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051942,
            "title": "Minnesota Bill Proposes Ban on Cryptocurrency ATMs Statewide",
            "description": "A bill introduced by Minnesota Democratic-Farmer-Labor Party representative Erin Koegel aims to prohibit the placement and operation of cryptocurrency ATMs across the state. According to ChainCatcher, the proposal follows reports from local law enforcement about multiple scams targeting elderly individuals, some of whom have faced severe financial difficulties as a result. The Minnesota Department of Commerce has expressed strong support for the bill and plans to introduce broader consumer protection proposals in the coming days.\n\nCurrently, Minnesota hosts approximately 350 cryptocurrency ATMs operated by 8 to 10 companies. Last year, the state received 70 complaints related to these machines, with reported losses totaling $540,000. The proposed legislation seeks to repeal the existing regulatory framework established in 2024, which includes disclosure requirements and transaction limits.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051942&language=en-US",
            "pub_date": "2026-02-27 18:43:52",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051941,
            "title": "India's Manufacturing Sector Drives Economic Resilience",
            "description": "India's manufacturing sector has emerged as a key driver of economic resilience over the past three fiscal years, according to the Indian Statistics Department. The department's analysis, which accounts for base adjustments, highlights the sector's significant contribution to the country's economic stability. According to Jin10, this development underscores the importance of manufacturing in bolstering India's economic framework. The report suggests that the sector's growth has been instrumental in maintaining economic momentum despite various challenges. This trend reflects a broader shift towards strengthening industrial capabilities as a means of sustaining economic health.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051941&language=en-US",
            "pub_date": "2026-02-27 18:44:16",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051940,
            "title": "Brazil ETF Faces Significant Premium Risk in Secondary Market",
            "description": "On February 27, Hua Xia Fund Management Co., Ltd. issued a notice regarding its Brazil Ibovespa Exchange-Traded Fund (ETF), highlighting a significant premium in the secondary market trading price compared to the fund's reference net value. According to Jin10, this discrepancy poses a risk to investors, who may face substantial losses if they invest blindly. The company advises investors to be cautious of the premium risk associated with secondary market transactions.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051940&language=en-US",
            "pub_date": "2026-02-27 18:44:24",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051919,
            "title": "Big Banks Unlikely to Increase Mortgage Offers to First-Time Home Buyers",
            "description": "Big banks are not expected to significantly increase mortgage offerings to first-time home buyers facing financial challenges. Wall Street Journal (Markets) posted on X, highlighting that despite some improvements in the housing market, large financial institutions remain cautious. \n\nThe reluctance stems from ongoing economic uncertainties and regulatory pressures that make banks wary of expanding their mortgage portfolios. Additionally, the current interest rate environment and potential risks associated with lending to financially unstable buyers contribute to this cautious approach.\n\nWhile there is a demand for more accessible mortgage options, banks are prioritizing risk management over aggressive lending strategies. This cautious stance is likely to persist until there is greater economic stability and clarity in regulatory policies.\n\nFirst-time home buyers may need to explore alternative financing options or wait for more favorable conditions as big banks maintain their conservative lending practices.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051919&language=en-US",
            "pub_date": "2026-02-27 18:30:53",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051918,
            "title": "Binance Wallet Integrates New dApps Including Torch Finance and Rezerve",
            "description": "Binance Wallet announced on X the integration of several new decentralized applications (dApps) into its platform. The newly added dApps include Torch Finance, Rezerve, Maiga, Ember, Planck, Balance, Bean Exchange, Coral Finance, BigPump, and TBook. This expansion aims to enhance the user experience by providing a broader range of financial tools and services.\n\nThe integration of these dApps is part of Binance Wallet's ongoing efforts to offer diverse options for its users. Torch Finance and Rezerve are among the notable additions, providing users with innovative financial solutions. Other dApps like Maiga and Ember are expected to offer unique functionalities that cater to different user needs. By incorporating these applications, Binance Wallet seeks to provide a more comprehensive ecosystem for its users, allowing them to explore various financial opportunities within the platform.\n\nThis development reflects Binance Wallet's commitment to expanding its offerings and improving accessibility for its users. The inclusion of dApps such as Planck, Balance, and Bean Exchange further diversifies the platform's capabilities, enabling users to engage with a wide array of financial services. As Binance Wallet continues to grow, the addition of these dApps signifies a step forward in enhancing the platform's utility and user engagement.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051918&language=en-US",
            "pub_date": "2026-02-27 18:31:27",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051917,
            "title": "China to Remove Tariffs on Canadian Agricultural Products",
            "description": "China announced it will eliminate tariffs on Canadian rapeseed meal and lobsters, aiming to alleviate disruptions in agricultural trade. Bloomberg posted on X, highlighting this development following Prime Minister Mark Carney's visit in January. This move is expected to improve trade relations between the two countries and benefit Canadian exporters.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051917&language=en-US",
            "pub_date": "2026-02-27 18:31:51",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051916,
            "title": "MARA Holdings Reports Significant Financial Losses in 2025",
            "description": "MARA Holdings has reported a net loss of $1.31 billion for the full year of 2025, following a net profit of $541 million in 2024. According to ChainCatcher, the company's revenue increased from $656.4 million to $907.1 million during this period.\n\nIn the fourth quarter, MARA experienced a net loss of $1.71 billion, with a diluted loss per share of $4.52, compared to a net profit of $528.3 million and a diluted earnings per share of $1.24 in the same quarter the previous year.\n\nIn terms of production, MARA mined a total of 8,799 bitcoins in 2025, with 2,011 bitcoins mined in the fourth quarter alone. By the end of 2025, the company held 53,822 bitcoins.\n\nThe company attributed the fourth-quarter net income impact to a $1.5 billion negative change in the fair value of digital assets and digital asset receivables. Over the past six months, MARA's stock has declined by 46%.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051916&language=en-US",
            "pub_date": "2026-02-27 18:32:27",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051904,
            "title": "ThomasLloyd Climate Solutions to Merge with Blank-Check Company for U.S. Market Entry",
            "description": "ThomasLloyd Climate Solutions has announced a merger with a blank-check company, facilitating its entry into the U.S. market for powering data centers. Bloomberg posted on X, highlighting the strategic move aimed at expanding ThomasLloyd's operations and influence in the renewable energy sector. The merger is expected to enhance the company's capabilities in providing sustainable energy solutions to data centers across the United States. This development marks a significant step for ThomasLloyd in its mission to promote climate-friendly energy practices globally. The agreement underscores the growing importance of sustainable energy in the tech industry, particularly in the operation of data centers, which are known for their substantial energy consumption. By entering the U.S. market, ThomasLloyd aims to leverage its expertise in climate solutions to meet the increasing demand for green energy in data center operations.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051904&language=en-US",
            "pub_date": "2026-02-27 18:17:16",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051903,
            "title": "Germany to Reduce Support for Rooftop Solar in Favor of Larger Solar Parks",
            "description": "Germany's economy ministry is set to reduce its support for rooftop solar installations, shifting its focus towards larger solar parks. Bloomberg posted on X that this strategic move aims to enhance the country's renewable energy infrastructure by prioritizing larger-scale solar projects. The decision reflects a broader effort to optimize energy production and efficiency as Germany continues to transition towards sustainable energy sources. This policy adjustment is part of the government's ongoing commitment to meet its renewable energy targets and reduce carbon emissions.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051903&language=en-US",
            "pub_date": "2026-02-27 18:20:43",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051902,
            "title": "Bharat Biotech's Vaccine Portfolio Includes Covid-19 and Hepatitis B",
            "description": "Bharat Biotech, a prominent biotechnology company, offers a range of vaccines, including those for Covid-19 and hepatitis B. Bloomberg posted on X, highlighting the company's significant contributions to public health through its vaccine development efforts. Bharat Biotech has been at the forefront of vaccine innovation, particularly during the Covid-19 pandemic, providing critical solutions to combat the virus. The company's hepatitis B vaccine also plays a vital role in preventing the spread of this infectious disease. Bharat Biotech continues to focus on research and development to enhance its vaccine offerings and address global health challenges.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051902&language=en-US",
            "pub_date": "2026-02-27 18:22:49",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051900,
            "title": "MARA Q4 2025 Financial Report: Net loss of $1.7 billion, announces partnership with Starwood to develop AI business.",
            "description": "MARA released its Q4 2025 financial results, reporting a 6% year-over-year decrease in revenue to $202.3 million and a net loss of $1.7 billion, primarily due to the decline in Bitcoin prices. The company also announced a strategic partnership with Starwood Digital Ventures to develop AI and high-performance computing infrastructure. As of the end of 2025, MARA held 53,822 Bitcoins (worth approximately $4.7 billion), and its energy hashrate increased by 25% year-over-year to 66.4 EH/s. The company stated it will continue its transformation from a pure Bitcoin mining business into an energy and digital infrastructure company and plans to expand its operations globally.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051900&language=en-US",
            "pub_date": "2026-02-27 18:20:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051884,
            "title": "Bitcoin(BTC) Drops Below 67,000 USDT with a 2.42% Decrease in 24 Hours",
            "description": "On Feb 27, 2026, 10:12 AM(UTC). According to Binance Market Data, Bitcoin has dropped below 67,000 USDT and is now trading at 66,954.59375 USDT, with a narrowed 2.42% decrease in 24 hours.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051884&language=en-US",
            "pub_date": "2026-02-27 18:12:08",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051885,
            "title": "BNB Drops Below 620 USDT with a 1.49% Decrease in 24 Hours",
            "description": "On Feb 27, 2026, 10:12 AM(UTC). According to Binance Market Data, BNB has dropped below 620 USDT and is now trading at 619.840027 USDT, with a narrowed 1.49% decrease in 24 hours.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051885&language=en-US",
            "pub_date": "2026-02-27 18:12:08",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051883,
            "title": "Britain's Flood Insurance Strategy Shifts Towards Capital Markets",
            "description": "Britain's flood insurance program is set to increasingly depend on capital markets to manage flood-related losses. Bloomberg posted on X, highlighting the country's strategic move to bolster its financial resilience against natural disasters. This shift aims to enhance the capacity to handle potential claims arising from severe flooding events, ensuring a robust financial framework. The initiative reflects a broader trend of integrating capital market solutions into traditional insurance models, providing a diversified approach to risk management. As climate change continues to pose significant challenges, this strategy underscores the importance of innovative financial mechanisms in safeguarding against environmental risks.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051883&language=en-US",
            "pub_date": "2026-02-27 18:13:15",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051882,
            "title": "Nvidia's Strong Quarter Highlights AI Infrastructure Spending",
            "description": "Nvidia has reported an impressive quarter, achieving $68.1 billion in revenue, driven by significant growth in its Data Center segment. According to NS3.AI, this performance underscores the ongoing narrative of increased spending on AI infrastructure. Bitcoin's price is currently mirroring the sentiment in the tech sector, functioning as a leveraged proxy for risk appetite linked to AI-related optimism or concerns. Upcoming reports on AI regulation and safety, especially from Anthropic, have the potential to introduce volatility, affecting both technology stocks and Bitcoin in various ways.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051882&language=en-US",
            "pub_date": "2026-02-27 18:13:20",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051854,
            "title": "Poland Emerges as Top Beneficiary of EU's SAFE Funding",
            "description": "Poland has become the largest recipient of the European Union's SAFE funding, aimed at supporting economic recovery across member states. Bloomberg posted on X, highlighting Poland's significant allocation from the fund, which is designed to bolster economies in the wake of recent challenges. The funding is part of the EU's broader strategy to ensure stability and growth within the region, providing financial assistance to countries most in need. Poland's allocation underscores its critical role in the EU's economic landscape, as the country continues to navigate the complexities of the current economic environment. This development is expected to have a positive impact on Poland's economic recovery efforts, contributing to the overall resilience of the EU's economy.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051854&language=en-US",
            "pub_date": "2026-02-27 17:58:51",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051853,
            "title": "Michael Pollan Explores Consciousness in New Book",
            "description": "Michael Pollan's latest book delves into the enigmatic realm of consciousness, offering readers an engaging exploration of what it means to be a bat, a plant, or even oneself. Bloomberg posted on X, highlighting the book's unique approach to unraveling the mysteries of consciousness. Pollan's work transforms this complex subject into an unexpectedly joyful journey, inviting readers to ponder the nature of awareness and existence. Through his insightful narrative, Pollan encourages a deeper understanding of consciousness, making it accessible and intriguing for a broad audience.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051853&language=en-US",
            "pub_date": "2026-02-27 18:00:47",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051852,
            "title": "Japan Reports Zero Forex Intervention in Early 2023",
            "description": "Japan's Ministry of Finance has announced that the country's foreign exchange intervention amount was zero yen from January 29 to February 25, 2023. According to Jin10, this period saw no active measures taken by Japan to influence its currency's value in the forex market. The report highlights Japan's current stance on foreign exchange activities, indicating a lack of intervention during this timeframe. This announcement comes amid ongoing global economic fluctuations and currency market dynamics.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051852&language=en-US",
            "pub_date": "2026-02-27 18:01:20",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}