{
    "data": [
        {
            "id": 734456,
            "title": "CFTC wants more information on Crypto.com, Kalshi Super Bowl contracts",
            "description": "The CFTC is questioning whether Crypto.com and Kalshi meet derivatives regulations In December, Crypto.com’s CEO said its derivatives trading platform was the “first regulated platform in the US” Robinhood launched its Super Bowl event contracts on Monday Crypto.com and prediction marketplace Kalshi have been asked to provide more information to the US Commodity Futures Trading […]\nThe post...\nsource: https://coinjournal.net/news/cftc-wants-more-information-on-crypto-com-kalshi-super-bowl-contracts/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734456&language=en-US",
            "pub_date": "2025-02-05 20:57:23",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734454,
            "title": "Michael Saylor tweets 'Grand Strategy Day' with Bitcoin symbol",
            "description": "Odaily Planet Daily News: Michael Saylor posted a tweet with the Bitcoin symbol \"Grand Strategy Day (₿ig Strategy Day)\".",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734454&language=en-US",
            "pub_date": "2025-02-05 21:02:38",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734455,
            "title": "Richmond Fed President Signals Potential Rate Cuts In 2025",
            "description": "According to BlockBeats, on February 5, Richmond Federal Reserve President Barkin stated in an interview that the Federal Reserve is still inclined to cut interest rates this year. He noted that there are currently no signs of the economy overheating.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734455&language=en-US",
            "pub_date": "2025-02-05 21:04:24",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734453,
            "title": "Before the ADP announcement, the probability of the Fed keeping interest rates unchanged in March was 83.5%.",
            "description": "Odaily Planet Daily News According to CME's \"Fed Watch\", the probability of the Fed keeping interest rates unchanged in March is 83.5%, and the probability of a 25 basis point rate cut is 16.5%. The probability of maintaining the current interest rate unchanged by May is 59.1%, the probability of a cumulative 25 basis point rate cut is 36.1%, and the probability of a cumulative 50 basis point rate cut is 4.8%.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734453&language=en-US",
            "pub_date": "2025-02-05 21:07:37",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734442,
            "title": "U.S. Senate Committee to Examine Impact of Debanking",
            "description": "According to PANews, the U.S. Senate Committee on Banking, Housing, and Urban Affairs is set to hold a hearing on February 5 at 10:00 AM EST (February 5 at 23:00 UTC+8) to investigate the real impact of debanking in the United States. \n\nThe hearing will feature testimonies from several key witnesses, including Nathan McCauley, Co-Founder and CEO of Anchorage Digital; Stephen Gannon, Partner at Davis Wright Tremaine LLP; Mike Ring, President and CEO of Old Glory Bank; and Aaron Klein, Senior Fellow in Economic Studies at the Brookings Institution.\n\nThe session aims to explore the effects of bank account closures and financial service restrictions on businesses and individuals, as well as to examine potential policy responses. The hearing will take place at the Dirksen Senate Office Building, Room 538, and will be available for live streaming online.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734442&language=en-US",
            "pub_date": "2025-02-05 20:53:57",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734441,
            "title": "Former Malaysian Prime Minister's Social Media Account Compromised",
            "description": "According to Odaily, the social media account of former Malaysian Prime Minister Mahathir Mohamad on platform X was hacked. The breach led to the dissemination of false information regarding tokens. The creator of the associated contract address has been linked to a group with a history of malicious activities.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734441&language=en-US",
            "pub_date": "2025-02-05 20:54:07",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734439,
            "title": "CryptoQuant: Whale Coin Hoarding Address Flows Into More Than 30,000 BTC Today",
            "description": "Odaily Planet Daily News CryptoQuant released data on the X platform, saying that it monitored that the address group classified as \"whale hoarding related\" has inflowed more than 30,000 BTC today. CryptoQuant founder Ki Young Ju explained that the large amount of Bitcoin flowing into addresses related to whale hoarding can be interpreted as the act of storing Bitcoin in a custodial wallet after OTC transactions.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734439&language=en-US",
            "pub_date": "2025-02-05 20:55:15",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734438,
            "title": "Matador increased his holdings by 3.46 bitcoins, and his current bitcoin holdings reached 68.14",
            "description": "Odaily Planet Daily News: Matador Technologies, a technology company headquartered in Toronto, Canada, announced that it has purchased 3.46 bitcoins for a total purchase price of 500,000 Canadian dollars, and its current holdings have reached 68.14 BTC.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734438&language=en-US",
            "pub_date": "2025-02-05 20:56:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734431,
            "title": "Algorand Foundation calls on Musk’s Government Efficiency Unit DOGE to adopt its blockchain for government operations",
            "description": "Odaily Planet Daily News Algorand Foundation called on Musk's Government Efficiency Department to adopt DOGE on its blockchain for government operations. The foundation emphasized that Algorand's technology can improve transparency, especially in tracking federal spending. In addition, the Algorand blockchain is built with quantum-resistant security, making it ideal for protecting sensitive government data and preventing tampering. Algorand is a continuous blockchain launched in 2019. Although its native token is a top 50 cryptocurrency by market capitalization, the network has been slow to adopt.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734431&language=en-US",
            "pub_date": "2025-02-05 20:39:51",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734432,
            "title": "Crypto Wallet Users Warned Of Security Risks On Adult Websites",
            "description": "According to ShibDaily, users of Phantom and Trust Wallet have been exposed to a security vulnerability that results in unauthorized fund withdrawals when accessing adult websites through their wallet browsers. This exploit takes advantage of weaknesses in the browser functionality of these wallets. When users visit certain adult websites, malicious scripts are triggered, allowing cybercriminals to gain control over the wallet. Once access is obtained, digital assets are quickly transferred to the attacker's account, with no possibility of recovering the stolen funds.\n\nIn a recent post on X, crypto advocate Dom Lucre highlighted the increasing security threat affecting crypto wallet browsers. He advised users to refrain from accessing adult content sites through their wallets, warning that such actions could lead to significant financial losses. Lucre emphasized that visiting these sites could result in funds being stolen almost instantly.\n\nWallet browsers are integrated web browsers within cryptocurrency wallets that enable users to interact directly with decentralized applications (dApps), conduct transactions, and access web-based services without leaving the wallet interface. These browsers are designed to support activities such as decentralized finance (DeFi) trading, interacting with NFTs, or exploring blockchain-related websites. Popular wallets like Phantom and Trust Wallet include built-in browsers to enhance user experience within the decentralized ecosystem.\n\nFollowing the reports, some users on X expressed confusion over whether it was indeed possible to access adult content sites through wallet browsers. While these browsers are primarily intended for managing digital assets and accessing dApps, it is technically possible for users to access general websites, including adult content, through the wallet's browser feature. However, these wallet browsers lack the same level of security as mainstream browsers such as Chrome. Visiting high-risk sites, such as those hosting adult content, can expose users to hidden malware and phishing threats.\n\nAs the situation develops, experts recommend that crypto wallet providers work toward improving security measures to prevent such exploits. It is crucial for users to stay informed about potential vulnerabilities and exercise caution, especially when interacting with decentralized applications or online platforms that may expose them to risks. Prioritizing security is essential to safeguarding crypto investments from emerging threats.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734432&language=en-US",
            "pub_date": "2025-02-05 20:42:02",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}