{
    "data": [
        {
            "id": 1050793,
            "title": "UK Lifts Ban on Crypto ETNs for Retail Investors",
            "description": "The United Kingdom has removed the restriction on retail investors accessing cryptocurrency Exchange-Traded Notes (ETNs). According to NS3.AI, this policy change allows crypto ETNs to be included in Individual Savings Accounts (ISAs), potentially increasing their adoption among retail investors. UK investors have until April to incorporate these crypto ETNs into their ISAs.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050793&language=en-US",
            "pub_date": "2026-02-27 00:38:07",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050790,
            "title": "BlackRock withdrew 4,309 BTC from Coinbase in the past hour, worth nearly $290 million.",
            "description": "According to Onchain Lens monitoring, BlackRock withdrew 4,309 BTC from Coinbase in the past hour, worth nearly $290 million, and there may be further withdrawals in the future.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050790&language=en-US",
            "pub_date": "2026-02-27 00:40:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050792,
            "title": "Global Deal-Making Influences Highlighted at Qatar Economic Forum",
            "description": "The Qatar Economic Forum has sparked discussions on the primary forces driving global deal-making today. Bloomberg posted on X, highlighting a poll conducted during the event to gauge opinions on the most significant influences in the current economic landscape. The forum serves as a platform for leaders and experts to exchange insights on economic trends and strategies. Participants are keen to understand the evolving dynamics that shape international business transactions and investments. The event underscores the importance of collaboration and innovation in navigating the complexities of the global market.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050792&language=en-US",
            "pub_date": "2026-02-27 00:40:56",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050791,
            "title": "Vanguard Settles Energy Market Manipulation Lawsuit for $29.5 Million",
            "description": "Vanguard has agreed to pay $29.5 million to resolve a lawsuit filed by twelve states, including Texas, which accused the asset management firm of colluding to manipulate the energy market and decrease coal production. Bloomberg posted on X that the settlement addresses allegations that Vanguard engaged in practices that negatively impacted coal output. The lawsuit claimed that these actions were part of a broader strategy to influence energy market dynamics. The resolution of this case marks a significant development in the ongoing scrutiny of asset managers' roles in energy market operations. Vanguard's settlement is seen as a step towards addressing concerns over market manipulation and its effects on coal production.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050791&language=en-US",
            "pub_date": "2026-02-27 00:41:31",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050781,
            "title": "Spelling Error Sparks Online Debate",
            "description": "Blockchain sleuth ZachXBT posted on X about a humorous exchange regarding the spelling of 'Brooks' as 'Broox.' The conversation, involving users @dannydope and @WheresBroox, highlighted the playful nature of online interactions, with one user jokingly suggesting that the misspelling could be considered more criminal than other offenses. The lighthearted banter reflects the casual and informal communication style often found on social media platforms.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050781&language=en-US",
            "pub_date": "2026-02-27 00:24:12",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050780,
            "title": "GEOPOLITICS | Trump Administration Seeks to Retain $133 Billion in Tariffs Despite Court Ruling",
            "description": "The Trump administration is exploring methods to maintain $133 billion in tariffs, even after a Supreme Court ruling declared the collections illegal. According to NS3.AI, potential strategies involve redesigning the tariff system and minimizing refunds to companies. These actions are likely to face judicial scrutiny. The refund process could extend over several years, affecting federal finances and eliciting opposition from businesses and the Democratic Party.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050780&language=en-US",
            "pub_date": "2026-02-27 00:27:18",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050779,
            "title": "Arif Joshi Joins Bramshill Investments to Launch Emerging Markets Hedge Fund",
            "description": "Arif Joshi, previously the co-head of emerging-market debt at Lazard Asset Management, is set to join Bramshill Investments. Bloomberg posted on X that Joshi will assist in launching a hedge fund targeting opportunities in developing markets. This move highlights Bramshill's strategic expansion into emerging markets, leveraging Joshi's expertise in the sector.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050779&language=en-US",
            "pub_date": "2026-02-27 00:32:39",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050773,
            "title": "Cryptocurrency Market Sees Notable Gains and Losses",
            "description": "According to ChainCatcher, data from Coinmarketcap reveals the performance of the top 100 cryptocurrencies by market capitalization. Leading the gains, PIPPIN (PIPPIN) rose by 22.06%, currently priced at $0.877. Decred (DCR) increased by 9.74%, with a current price of $31.37. JUST (JST) saw a 7.43% rise, now at $0.04727. Polkadot (DOT) gained 6.38%, priced at $1.62, and Canton (CC) rose by 5.63%, with a current price of $0.1706.\n\nOn the other hand, Cosmos (ATOM) experienced the largest decline, dropping 11.04% to $1.87. Pepe (PEPE) fell by 6.85%, now priced at $0.000053897. Aave (AAVE) decreased by 6.02%, with a current price of $114.11. Kite (KITE) saw a 5.63% drop, priced at $0.2567, and Bitcoin Cash (BCH) fell by 5.56%, currently at $489.93.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050773&language=en-US",
            "pub_date": "2026-02-27 00:13:58",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050772,
            "title": "GEOPOLITICS | EU Delegation Meets Syrian Foreign Minister to Discuss Relations",
            "description": "Syrian Foreign Minister Assad Hassan Al-Shibani met with a European Union diplomatic delegation in Damascus to discuss the future of bilateral relations. According to Jin10, the meeting focused on the prospects for developing ties between Syria and the EU. The delegation confirmed that the EU will continue to support the Syrian government's efforts and anticipates upgrading the diplomatic status of its mission in Damascus soon.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050772&language=en-US",
            "pub_date": "2026-02-27 00:17:23",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050771,
            "title": "Uruguay Approves EU-South America Trade Agreement",
            "description": "Uruguay has become the first country to approve the trade agreement between the European Union and South America. According to Jin10, this development marks a significant step in strengthening economic ties between the two regions. The agreement aims to enhance trade and investment opportunities, fostering economic growth and cooperation. Uruguay's approval sets a precedent for other South American countries to follow suit, potentially leading to broader regional integration and collaboration with the EU.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050771&language=en-US",
            "pub_date": "2026-02-27 00:17:28",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050770,
            "title": "Bitcoin Experiences 30% Drop on Decentralized Exchange Lighter",
            "description": "Bitcoin experienced a sudden 30% drop on the decentralized perpetual exchange Lighter due to a large single sell order. According to NS3.AI, this sharp decline was specific to Lighter and did not affect Bitcoin prices on other platforms. The incident underscores the potential risks linked to liquidity and order book vulnerabilities on decentralized exchanges.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050770&language=en-US",
            "pub_date": "2026-02-27 00:22:08",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050753,
            "title": "Cryptocurrency Gains Traction in 401(k) Retirement Plans Amid Regulatory Changes",
            "description": "Cryptocurrency is becoming more prevalent in 401(k) retirement plans due to evolving regulatory guidance from the Department of Labor. According to NS3.AI, recent presidential mandates have also promoted the inclusion of digital assets in long-term retirement strategies. As a result, major institutional investors are increasingly committing to crypto within these retirement frameworks.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050753&language=en-US",
            "pub_date": "2026-02-27 00:10:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050752,
            "title": "State Farm Announces Largest Dividend in Company History",
            "description": "State Farm has announced that it will issue its largest dividend in the company's 103-year history, with payments averaging $100 per vehicle. Bloomberg posted on X, highlighting the significance of this financial move by the insurance giant. The company stated that this decision reflects its commitment to returning value to its policyholders. This dividend distribution marks a notable milestone for State Farm, underscoring its financial stability and customer-focused approach.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050752&language=en-US",
            "pub_date": "2026-02-27 00:11:28",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050750,
            "title": "Benchmark maintains a buy rating on Hut 8 with a target price of $85.",
            "description": "Benchmark reiterated its buy rating on Hut 8 and set a price target of $85, noting that management will focus on execution and delivery in 2026 to advance its AI data center strategy. This statement directly quotes CEO Asher Genoot's remarks during the company's Q4 earnings call. Speaking about the flagship River Bend campus in Louisiana, Genoot stated that \"2026 will be 1000% focused on execution and delivery,\" adding that construction is \"on schedule.\" Analyst Mark Palmer noted in a report on Wednesday that while Q4 results were impacted by book losses on Bitcoin, more importantly, Hut 8 is steadily transitioning into a power-first digital infrastructure platform with a clearer long-term contract cash flow path. Hut 8 reported a net loss of $301.8 million in Q4, primarily due to $401.9 million in unrealized digital asset losses. Revenue nearly tripled year-over-year to $88.5 million, with significant improvement in computing revenue. Palmer continues to argue that the 15-year, 245-megawatt River Bend IT lease with Fluidstack, financially backed by Google, is central to his investment argument. The approximately $7 billion base lease helps Hut 8's valuation align with infrastructure multiples. Benchmark's $85 price target is based on what Palmer calls a \"piece-for-piece\" valuation model, which includes the River Bend lease, a probability-weighted valuation of up to 1,000 megawatts under the first-purchase option, the market value of Hut 8's 60% stake in American Bitcoin, and its Bitcoin holdings. As of Thursday morning, Hut 8 shares were trading slightly below $55, down about 1.5% on the day. The stock remains below its recent high of around $66, but has risen over 300% in the past year, even as Bitcoin has fallen about 27% over the same period. (The Block)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050750&language=en-US",
            "pub_date": "2026-02-27 00:12:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050751,
            "title": "Resolv and Centrifuge Launch $100 Million Tokenized Credit Strategy on Aave",
            "description": "Resolv and Centrifuge have introduced a $100 million tokenized credit strategy on the Aave platform. According to ChainCatcher, Tim Shekikhachev, co-founder of Resolv Labs, explained that the current supply chain process involves funds flowing from Resolv USR through Centrifuge's tokenization infrastructure, ultimately reaching Aave Horizon's leverage layer.\n\nThe Resolv protocol maintains a total locked value of $162 million in USR stablecoins and is utilizing Centrifuge's tokenization technology to integrate JAAA into its system. Centrifuge currently holds a total locked value of $1.35 billion.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050751&language=en-US",
            "pub_date": "2026-02-27 00:13:49",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050718,
            "title": "India and Israel to Enhance Defense Cooperation and Trade Talks",
            "description": "Indian Prime Minister Narendra Modi concluded a two-day visit to Israel on Thursday, focusing on strengthening defense collaboration and advancing a bilateral free trade agreement. According to Ming Pao, Modi emphasized that India and Israel are committed to joint research and development, production, and technology transfer in the defense sector. He also reiterated the countries' shared stance against terrorism, advocating for global zero tolerance. This visit, aimed at deepening strategic ties and fostering cooperation across various sectors, marks Modi's second trip to Israel since taking office in 2014\nsource: https://www.binance.com/en/square/post/295855123477713?utm_source=BinanceNewsRSS",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050718&language=en-US",
            "pub_date": "2026-02-26 23:57:34",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050712,
            "title": "Tesla Reaches Settlement with German Union",
            "description": "Tesla has reached an out-of-court settlement with a German union, according to Jin10. This agreement resolves ongoing disputes between the electric vehicle manufacturer and the labor organization in Germany. The settlement details have not been disclosed, but it marks a significant step in addressing labor relations for Tesla in the region. This development comes amid Tesla's continued expansion in Europe, where labor relations have been a focal point for the company. The resolution is expected to facilitate smoother operations for Tesla's manufacturing activities in Germany.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050712&language=en-US",
            "pub_date": "2026-02-26 23:57:26",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050711,
            "title": "India and Israel to Enhance Defense Cooperation and Trade Talks",
            "description": "Indian Prime Minister Narendra Modi concluded a two-day visit to Israel on Thursday, focusing on strengthening defense collaboration and advancing a bilateral free trade agreement. According to Ming Pao, Modi emphasized that India and Israel are committed to joint research and development, production, and technology transfer in the defense sector. He also reiterated the countries' shared stance against terrorism, advocating for global zero tolerance. This visit, aimed at deepening strategic ties and fostering cooperation across various sectors, marks Modi's second trip to Israel since taking office in 2014.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050711&language=en-US",
            "pub_date": "2026-02-26 23:57:34",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050710,
            "title": "Colombia's Dollar Bonds Decline Amid Presidential Race Developments",
            "description": "Colombia's dollar bonds experienced a decline on Thursday, with the peso leading losses among emerging markets. Bloomberg posted on X that this downturn followed the release of a new poll indicating leftist Senator Iván Cepeda holds a significant lead in the presidential race. The financial markets reacted to the potential shift in political leadership, reflecting investor concerns over future economic policies. The peso's performance highlighted the broader impact on emerging-market currencies.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050710&language=en-US",
            "pub_date": "2026-02-27 00:01:07",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050709,
            "title": "Barclays and Atlas Involved in UK Mortgage-Finance Loan Scandal",
            "description": "Barclays and Atlas are among the Wall Street firms implicated in arranging over £2 billion ($2.7 billion) in loans to a UK mortgage-finance company now facing allegations of financial misconduct. Bloomberg posted on X, highlighting the involvement of these financial institutions in the unfolding scandal. The UK company, which has been a significant player in the mortgage-finance sector, is under scrutiny as investigations into its financial practices continue. The situation has raised concerns about the oversight and due diligence conducted by the involved firms. As the investigation progresses, the implications for the financial sector and the parties involved remain uncertain.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050709&language=en-US",
            "pub_date": "2026-02-27 00:02:37",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}