{
    "data": [
        {
            "id": 1053394,
            "title": "Italy's Meloni Aims for Economic Growth and AI Reality Check",
            "description": "Italian Prime Minister Giorgia Meloni has successfully stabilized the country's political landscape and is now focusing on fostering economic growth and addressing global challenges related to artificial intelligence. Bloomberg posted on X, highlighting Meloni's strategic shift towards economic development as she enters the second phase of her leadership.\n\nMeloni's administration has been credited with bringing stability to Italy, a nation that has faced significant political turbulence in recent years. Her government is now prioritizing initiatives to stimulate economic growth, aiming to enhance Italy's position on the global stage.\n\nIn addition to economic reforms, Meloni is advocating for a comprehensive international dialogue on the implications of artificial intelligence. She emphasizes the need for a global reality check on AI, urging countries to collaborate on establishing ethical guidelines and regulatory frameworks to manage the technology's rapid advancement.\n\nMeloni's dual focus on economic growth and AI regulation reflects her broader vision for Italy's future, balancing domestic priorities with international responsibilities. Her leadership continues to shape Italy's trajectory in both the European and global contexts.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053394&language=en-US",
            "pub_date": "2026-02-28 17:33:18",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053391,
            "title": "U.S. officials expect the Iranian attacks to last for days, and possibly even weeks.",
            "description": "According to the New York Times, U.S. officials expect the Iranian attacks to last for days, and possibly even weeks. (Jinshi)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053391&language=en-US",
            "pub_date": "2026-02-28 17:35:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053390,
            "title": "Explosions were heard in Riyadh, the capital of Saudi Arabia, and loud noises were heard in Dubai.",
            "description": "According to market sources, an explosion was heard in Riyadh, the capital of Saudi Arabia, and a loud bang was heard in Dubai.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053390&language=en-US",
            "pub_date": "2026-02-28 17:37:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053393,
            "title": "Flight from Warsaw to Dubai Returns Due to Airspace Closure",
            "description": "A spokesperson for Polish Airlines announced that flight LO121, traveling from Warsaw to Dubai, is returning to Warsaw due to further airspace closures in the region. According to Jin10, the decision was made to ensure passenger safety amid the ongoing situation. The airline is coordinating with relevant authorities to manage the disruption and provide updates to affected passengers.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053393&language=en-US",
            "pub_date": "2026-02-28 17:38:01",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053382,
            "title": "Heightened Alert at U.S. Naval Base in Bahrain Amid Siren Reports",
            "description": "Crypto Jargon posted on X. Sirens have reportedly been heard at the U.S. Naval Base in Bahrain, leading to increased alert levels for U.S. military assets in the region. The situation has prompted heightened security measures, although specific details regarding the cause of the sirens have not been disclosed. The U.S. military is closely monitoring the situation to ensure the safety and security of its personnel and assets. Further updates are expected as more information becomes available.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053382&language=en-US",
            "pub_date": "2026-02-28 17:23:47",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053379,
            "title": "Iranian Foreign Ministry: We will use all our capabilities and resources to resist aggression",
            "description": "The Iranian Foreign Ministry issued a statement regarding the military aggression against Iran by Israel and the United States: \"Dear Iranian people, compatriots, our sacred and precious homeland, Iran, has once again been subjected to military aggression by the United States and Israel. This morning, on the eve of Nowruz and the tenth day of Ramadan, the United States and Israel blatantly violated Iran's territorial integrity and national sovereignty, attacking defensive targets and demilitarized facilities in various cities of our country. This renewed military aggression by the United States and Israel occurred while Iran and the United States were in the midst of diplomatic negotiations. Although we are convinced of the United States and Israel's intention to carry out this renewed military aggression, in order to demonstrate our position to the international community and all countries of the world, we have once again engaged in negotiations to prove the justice of the Iranian people and expose the illegitimacy of any pretext for aggression. Today, the Iranian people are proud of everything they have done to prevent war. Now is the time to defend our homeland and resist the enemy's military aggression. While preparing for negotiations, we are also ready to defend ourselves at any time. The Iranian armed forces will respond to the aggressors with overwhelming force. The Iranian armed forces will utilize all capabilities and resources to resist this heinous aggression and eliminate the enemy's threat.\" (Jin Shi)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053379&language=en-US",
            "pub_date": "2026-02-28 17:24:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053381,
            "title": "Escalation in Middle East: New Missile Strikes Reported in Israel and Tehran",
            "description": "Crypto Rover posted on X. Reports have emerged of a second wave of missile attacks targeting Israel, alongside new strikes in Tehran, signaling a significant escalation in regional tensions. The developments suggest a full-blown conflict, raising concerns about the potential for further violence and instability in the Middle East. Observers are closely monitoring the situation as it unfolds, with implications for international relations and security.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053381&language=en-US",
            "pub_date": "2026-02-28 17:24:01",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053380,
            "title": "Iranian Missiles Reportedly Strike Near Haifa, Israel",
            "description": "Crypto Jargon posted on X. Reports have emerged indicating that at least two Iranian missiles have struck areas near Haifa in northern Israel. As the situation continues to unfold, details regarding the extent of damage and any casualties remain uncertain.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053380&language=en-US",
            "pub_date": "2026-02-28 17:24:13",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053367,
            "title": "US military base in Bahrain attacked, Qatar shoots down Iranian missile, and explosions are heard in the UAE.",
            "description": "US military base in Bahrain attacked. Bahrain urges citizens to evacuate to \"safe locations.\" AFP: Explosions heard in Manama, Bahrain's capital. Qatari official: Qatar shot down Iranian missile. Explosions heard in the UAE. (Jinshi)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053367&language=en-US",
            "pub_date": "2026-02-28 17:12:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053369,
            "title": "Global M2 Reaches New Highs While Bitcoin Remains Stable",
            "description": "Crypto Rover posted on X that the global M2 money supply is experiencing a significant surge, reaching new all-time highs. Despite this increase, Bitcoin's value has not mirrored this upward trend. The disparity between the rising global money supply and Bitcoin's stable performance is drawing attention from financial analysts and cryptocurrency enthusiasts alike. The global M2, which includes cash, checking deposits, and easily convertible near money, is often seen as an indicator of economic health and liquidity. However, Bitcoin, a decentralized digital currency, has not shown a corresponding increase in value, prompting discussions about its role and behavior in the current economic climate. Observers are keenly watching how these dynamics will unfold in the coming months.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053369&language=en-US",
            "pub_date": "2026-02-28 17:13:15",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053368,
            "title": "Explosion Reported in Bahrain's Manama",
            "description": "An explosion has been reported in Manama, Bahrain. According to Foresight News, witnesses observed thick smoke rising from the direction of a U.S. Navy base in Bahrain.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053368&language=en-US",
            "pub_date": "2026-02-28 17:13:41",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053366,
            "title": "BNB has fallen below $600, currently trading at $592.27, down 5.98% in the last 24 hours.",
            "description": "According to market data, BNB has fallen below $600 and is currently trading at $592.27, down 5.98% in the last 24 hours.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053366&language=en-US",
            "pub_date": "2026-02-28 17:15:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053364,
            "title": "ProShares stablecoin-focused ETF posts $17B debut",
            "description": "ProShares’ stablecoin-aligned ETF logged $17B in day-one trading, setting a new ETF record amid growing stablecoin adoption.\nsource: https://catenaa.com/markets/cryptocurrencies/proshares-stablecoin-focused-etf-posts-17b-debut/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053364&language=en-US",
            "pub_date": "2026-02-28 17:00:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053362,
            "title": "Trump remarks weigh on Iran sovereignty debate after strikes",
            "description": "Trump urges Iranians to take over institutions, Iran regime change, international law non-intervention; analysts cite UN letters and sovereignty framing.\nsource: https://coincu.com/news/trump-remarks-weigh-on-iran-sovereignty-debate-after-strikes/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053362&language=en-US",
            "pub_date": "2026-02-28 17:00:23",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053361,
            "title": "Whale Acquires Ethereum Amid Market Decline",
            "description": "On February 28, a significant transaction was observed. According to BlockBeats, the whale identified as 0x172 borrowed $7 million USDC from Aave during a market downturn to purchase 3,753 ETH at an average price of $1,865. The whale currently holds 15,964 ETH, valued at $29.68 million.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053361&language=en-US",
            "pub_date": "2026-02-28 17:04:01",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053360,
            "title": "GEOPOLITICS | Qatar Downs Iranian Missile",
            "description": "Qatar has reportedly intercepted and shot down an Iranian missile, according to Jin10. This development adds to the growing tensions in the region, highlighting the fragile geopolitical landscape. The incident underscores the ongoing security challenges faced by countries in the Middle East. Further details on the circumstances surrounding the missile launch and interception remain limited at this time. The situation continues to evolve as regional powers monitor the implications of this event.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053360&language=en-US",
            "pub_date": "2026-02-28 17:04:24",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053349,
            "title": "Israel Keeps Land Borders with Jordan and Egypt Open Amid Tensions",
            "description": "Israel's Airport Authority has announced that the country's land border crossings with Jordan and Egypt remain open despite ongoing regional tensions. According to Jin10, this decision comes as part of efforts to maintain stability and facilitate movement between neighboring countries. The open borders are crucial for trade and travel, ensuring that economic activities continue without disruption. The situation is being closely monitored to ensure safety and security at these crossings.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053349&language=en-US",
            "pub_date": "2026-02-28 16:52:50",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053348,
            "title": "Kenya's Central Bank Governor Kamau Thugge Claims Role Is Manageable",
            "description": "Kamau Thugge, the governor of Kenya's central bank, has expressed confidence in the ease of his role. Bloomberg posted on X, highlighting that investors might find this assertion surprising given the complexities involved in managing a nation's monetary policy. Thugge's statement comes amid various economic challenges facing the country, including inflation and currency fluctuations. His leadership is crucial as Kenya navigates these financial hurdles, aiming to stabilize the economy and maintain investor confidence.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053348&language=en-US",
            "pub_date": "2026-02-28 16:53:19",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053347,
            "title": "Bitcoin Faces Increased Unrealized Losses Amid Market Pressure",
            "description": "Bitcoin's unrealized loss percentage has surpassed 39%, indicating that a significant number of buyers are currently experiencing losses. According to BlockBeats, CryptoQuant analyst @AxelAdlerJr noted this development following Bitcoin's recent decline. The market is under increasing pressure but has not yet reached a full capitulation stage, suggesting there is still room for maneuver before a complete collapse.\n\nHistorical data shows that this indicator exceeded 40% during the bear market bottoms of 2018 and 2022. The current level suggests that weak positions are gradually being eliminated, potentially signaling an approach to a cycle low point.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053347&language=en-US",
            "pub_date": "2026-02-28 16:54:08",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053346,
            "title": "GEOPOLITICS | Poland's President Highlights Strategic Communication Amid Military Actions",
            "description": "Poland's President, Andrzej Duda, emphasized the importance of maintaining open communication channels with allies and alliances to stay informed about military actions taken by Israel and the United States. According to Jin10, Duda noted that these communication efforts have been crucial in ensuring timely updates on strategic developments. The president's remarks underscore Poland's commitment to international cooperation and security amidst evolving geopolitical dynamics.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053346&language=en-US",
            "pub_date": "2026-02-28 16:54:33",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}