{
    "data": [
        {
            "id": 1054262,
            "title": "Bitcoin(BTC) Drops Below 67,000 USDT with a Narrowed 2.12% Increase in 24 Hours",
            "description": "On Mar 01, 2026, 06:11 AM(UTC). According to Binance Market Data, Bitcoin has dropped below 67,000 USDT and is now trading at 66,943.117188 USDT, with a narrowed narrowed 2.12% increase in 24 hours.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054262&language=en-US",
            "pub_date": "2026-03-01 14:11:07",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054261,
            "title": "Elon Musk Expresses Distrust in OpenAI",
            "description": "Elon Musk, the CEO of Tesla and SpaceX, has publicly stated his lack of trust in OpenAI. According to Jin10, Musk's comments reflect ongoing concerns about the transparency and control of artificial intelligence development. OpenAI, known for its advanced AI models, has been at the forefront of AI research, raising questions about the ethical implications and potential risks associated with AI technologies. Musk's skepticism highlights the broader debate within the tech industry regarding the responsible development and deployment of AI systems.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054261&language=en-US",
            "pub_date": "2026-03-01 14:12:43",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054257,
            "title": "Macau's Gaming Revenue Surges in February Amid Lunar New Year Boost",
            "description": "Macau's gaming revenue experienced a notable increase of 4.5% in February, surpassing expectations. Bloomberg posted on X, highlighting that the world's largest gambling hub benefited significantly from the influx of tourists during the Lunar New Year celebrations. This period traditionally sees a rise in visitor numbers, contributing to the economic uplift in the region. The growth in gaming revenue underscores the importance of tourism to Macau's economy, particularly during festive seasons. The positive performance in February marks a promising start for the year, as the city continues to recover from previous economic challenges.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054257&language=en-US",
            "pub_date": "2026-03-01 14:00:58",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054256,
            "title": "PRECIOUS METALS | Global Tensions Impact Gold Prices Amid Middle East Conflict",
            "description": "On February 28, local time, a military strike by the U.S. and Israel on Iran heightened global risk aversion, according to PANews. Analysts predict a significant rise in the prices of gold and other precious metals. However, following an increase on February 28, gold prices experienced a sharp decline on March 1.\n\nEconomist Pan Helin, a member of the Ministry of Industry and Information Technology's Information and Communication Economics Expert Committee, noted that the death of Iran's Supreme Leader Ayatollah Khamenei has altered short-term market expectations, suggesting a potential stabilization of the Iranian situation. If Iran can smoothly transition its leadership post-Khamenei, the capital markets might see a complete reversal in expectations, leading to a decrease in gold and oil prices and a rise in U.S. stocks, particularly industrial stocks. Nonetheless, the uncertainty of war and Khamenei's death could further destabilize the situation in Iran.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054256&language=en-US",
            "pub_date": "2026-03-01 14:01:24",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054255,
            "title": "Elon Musk Highlights Record Usage on X Platform",
            "description": "On March 1, Elon Musk announced that the X platform experienced its highest usage ever. According to BlockBeats, Musk referenced a tweet from X product manager Nikita Bier, who noted that the day marked the highest traffic in the platform's history.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054255&language=en-US",
            "pub_date": "2026-03-01 14:01:48",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054254,
            "title": "GEOPOLITICS | Global Markets Brace for Uncertainty Amid U.S.-Iran Tensions",
            "description": "Next week, global markets are expected to navigate through heightened uncertainty and risk aversion due to the evolving geopolitical tensions between the United States and Iran. According to BlockBeats, aside from geopolitical developments, several key macroeconomic events are scheduled. On Monday at 22:45 UTC+8, the final reading of the U.S. February S&P Global Manufacturing PMI will be released, followed by the U.S. February ISM Manufacturing PMI at 23:00 UTC+8. On Wednesday at 21:15 UTC+8, the U.S. February ADP employment figures will be announced. Thursday will see the release of the Federal Reserve's Beige Book at 03:00 UTC+8, the U.S. February Challenger job cuts at 20:30 UTC+8, and the initial jobless claims for the week ending February 28, along with the U.S. January import price index at 21:30 UTC+8. On Friday at 21:30 UTC+8, the U.S. February unemployment rate, seasonally adjusted non-farm payrolls, and the U.S. January retail sales monthly rate will be reported.\n\nIn the U.S. stock market, recent data indicates that the Nasdaq Composite Index has failed to reach new highs for four consecutive months. Both the S&P 500 Index and the Nasdaq Index have experienced their worst monthly performance since March of last year. This trend reflects growing investor skepticism about the ability of AI technology to translate into tangible profits, as Wall Street navigates a turbulent period led by tech stocks.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054254&language=en-US",
            "pub_date": "2026-03-01 14:02:12",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054250,
            "title": "GEOPOLITICS | Polymarket Launches Contracts Amid U.S.-Iran Tensions",
            "description": "On March 1, following a U.S. airstrike on Iran, decentralized prediction platform Polymarket introduced over ten contracts related to the U.S.-Iran conflict. According to BlockBeats, the total amount wagered on these contracts has exceeded $600 million.\n\nOne notable contract, \"Will Khamenei lose his position as Supreme Leader by March 31?\" settled at 100% following confirmation of his death, with a single market transaction volume reaching $45 million. Another contract, \"Will the U.S. strike Iran by a certain date?\" launched in December last year, has accumulated a transaction volume of $529 million, making it one of the largest markets in the platform's history.\n\nAdditionally, the contract \"Will the Iranian regime collapse by June 30?\" currently shows a probability of 54%, while the contract \"Will the U.S. deploy troops to Iran by March 7?\" has a probability of approximately 28%.\n\nBlockchain analysis firm Bubblemaps highlighted that six wallets made precise bets on \"The U.S. will strike Iran on February 28,\" profiting around $1.2 million, raising concerns about potential insider trading.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054250&language=en-US",
            "pub_date": "2026-03-01 13:43:42",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054249,
            "title": "GEOPOLITICS | Iran to Establish Interim Leadership Council",
            "description": "Iran is set to establish an interim leadership council on March 1, according to Jin10. This announcement was made by Ali Larijani, an advisor to Iran's Supreme Leader. The formation of this council marks a significant development in the country's political landscape. Further details on the council's composition and objectives are yet to be disclosed.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054249&language=en-US",
            "pub_date": "2026-03-01 13:48:04",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054248,
            "title": "Satellite Images show damage at Khamenei site after strikes",
            "description": "before-and-after satellite images, Ayatollah Khamenei residence, U. S. and Israeli strikes - Airbus data via ABC Verify confirms damage; some claims unverified.\nsource: https://coincu.com/news/satellite-images-show-damage-at-khamenei-site-after-strikes/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054248&language=en-US",
            "pub_date": "2026-03-01 13:30:51",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054247,
            "title": "Trump: If Iran launches an attack, the United States will retaliate with unprecedented force.",
            "description": "US President Trump stated that Iran had just announced a \"fierce and unprecedented attack\" that day, and warned Iran \"had better not do it.\" Trump said that if Iran takes such action, the US will strike with unprecedented force. (Jinshi)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054247&language=en-US",
            "pub_date": "2026-03-01 13:24:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054245,
            "title": "GEOPOLITICS | Iranian Speaker Warns Trump and Netanyahu of Crossing Red Lines",
            "description": "Iranian Parliament Speaker Mohammad Bagher Ghalibaf has issued a stern warning to U.S. President Donald Trump and Israeli Prime Minister Benjamin Netanyahu, stating that they have crossed red lines and will face consequences. According to Jin10, Ghalibaf's remarks were broadcast on Iranian state television, emphasizing the seriousness of the situation. The speaker's comments reflect heightened tensions between Iran and the United States, as well as Israel, amid ongoing geopolitical conflicts. The statement underscores Iran's position on defending its national interests and responding to perceived threats from foreign leaders.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054245&language=en-US",
            "pub_date": "2026-03-01 13:28:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054246,
            "title": "Planet Midday News",
            "description": "1. Bitcoin's February 2026 return was -14.94%, marking the third lowest monthly return since 2013; 2. Kalshi CEO: Opposes profiting from individual deaths and will refund fees related to the \"Khamenei's resignation\" market; 3. Musk: X platform adds timeline theme selection function; 4. Trump: Resolving the Iran issue through diplomatic means is still feasible and \"much easier now\"; 5. Iranian Revolutionary Guard claims missile hit Israeli General Staff headquarters; 6. US media: Pressure from Saudi Arabia and Israel prompted Trump to order attacks on Iran; 7. US and Israel launched attacks during the Khamenei meeting, Iranian Revolutionary Guard says it will retaliate; 8. BTCS executive: Crypto Treasury companies may see a consolidation wave in 2026; 9. Michael Saylor: STRC's deferred dividend yield increased to 11.50% in March 2026; 10. Sam Altman responds to US War Department's choice of OpenAI over Anthropic: Possibly due to disagreements over operational control; 11. Iranian media: Iran's Supreme Leader Khamenei has been assassinated.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054246&language=en-US",
            "pub_date": "2026-03-01 13:30:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054243,
            "title": "US media releases satellite images before and after the attack on Khamenei's residence.",
            "description": "According to CBS News, a set of satellite images shows before-and-after photos of the attacks on the Tehran residence of Iran's late Supreme Leader Ayatollah Khamenei by the United States and Israel on February 28. The situation continues to escalate. Iran's Islamic Revolutionary Guard Corps claims to have launched a large-scale missile and drone attack on Israel and US military bases in the region. Initial reports indicate that Jerusalem was affected, with explosions and smoke heard in Haifa, Israel. Furthermore, Doha, the capital of Qatar, was again attacked by missiles, prompting Qatar's air defense system to activate interceptions. The US Al Udeid Air Base in Qatar, located approximately 35 kilometers southwest of Doha, is one of the key US military bases in the Gulf region.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054243&language=en-US",
            "pub_date": "2026-03-01 13:16:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054242,
            "title": "GEOPOLITICS | Israeli Defense Minister Katz: 'Justice Served' as Iran's 'Axis of Evil' Faces Major Blow",
            "description": "Israeli Defense Minister Katz announced that justice has been served with a significant blow dealt to Iran's 'Axis of Evil.' According to Jin10, Katz emphasized the impact of recent actions against Iran, highlighting the strategic importance of these developments in the ongoing geopolitical landscape. The statement reflects Israel's stance on regional security and its commitment to countering perceived threats from Iran. Katz's remarks underscore the broader implications for Middle Eastern stability and international relations.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054242&language=en-US",
            "pub_date": "2026-03-01 13:18:10",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054241,
            "title": "GEOPOLITICS | Iraqi Security Forces Attempt to Prevent Protesters from Approaching U.S. Embassy",
            "description": "Iraqi security forces are actively working to prevent demonstrators from nearing the U.S. Embassy, according to Jin10. The situation arises amidst ongoing tensions and protests in the region, highlighting the challenges faced by authorities in maintaining order and security. The embassy has been a focal point for demonstrations, reflecting broader geopolitical issues and public sentiment. Security measures have been intensified to ensure the safety of diplomatic personnel and facilities. The developments underscore the volatile nature of the geopolitical landscape in Iraq.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054241&language=en-US",
            "pub_date": "2026-03-01 13:18:38",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054233,
            "title": "Bitcoin recovers to $68K following death of Iranian Supreme Leader",
            "description": "Donald Trump described Ayatollah Khamenei as “one of the most evil people in history,” on Truth Social.\nsource: https://cointelegraph.com/news/bitcoin-recovers-to-68k-following-reported-death-of-iranian-supreme-leader?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054233&language=en-US",
            "pub_date": "2026-03-01 12:58:31",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054231,
            "title": "Five Crypto Exchanges Aid Russia in Evading Sanctions",
            "description": "Five Russia-linked crypto exchanges continue high-volume transactions with sanctioned entities, highlighting gaps in enforcement after Garantex’s 2025 shutdown.\nsource: https://catenaa.com/markets/cryptocurrencies/five-crypto-exchanges-aid-russia-in-evading-sanctions/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054231&language=en-US",
            "pub_date": "2026-03-01 13:00:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054227,
            "title": "Elon Musk Introduces Customizable Timeline Themes",
            "description": "Elon Musk announced on March 1 that users can now select topics of interest for their timelines. According to BlockBeats, this feature allows users to switch to different themes if they are tired of 'politically charged content.' Users can make these selections by clicking on the 'For You' page.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054227&language=en-US",
            "pub_date": "2026-03-01 13:03:38",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054226,
            "title": "Musk: X Platform Adds Timeline Theme Selection Feature",
            "description": "Musk stated on social media that the X platform has added a timeline theme selection feature, allowing users to switch between different content themes based on their interests. He noted that users who are tired of political content can choose other themes. Users can adjust these settings by clicking on the \"For You\" page.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054226&language=en-US",
            "pub_date": "2026-03-01 12:59:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054225,
            "title": "Explosion in Maharashtra, India Results in Multiple Fatalities",
            "description": "An explosion occurred in Maharashtra, India, on March 1, resulting in at least 15 fatalities. According to Jin10, local police reported that the blast took place at an energy company site, with over a dozen individuals sustaining injuries. Further details have not yet been disclosed.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054225&language=en-US",
            "pub_date": "2026-03-01 12:45:32",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}