{
    "data": [
        {
            "id": 1051537,
            "title": "GEOPOLITICS | Analysis of China-US Trade Data Reveals Exaggerated Decoupling Concerns",
            "description": "A significant discrepancy in trade data between China and the United States has puzzled analysts. Bloomberg posted on X, revealing that upon closer examination, the gap suggests that discussions about economic decoupling between the two nations may be overstated. The analysis indicates that while there are tensions and challenges in the bilateral trade relationship, the extent of separation is not as severe as some narratives suggest. This insight comes amid ongoing debates about the future of China-US economic ties and the potential impacts on global markets. The findings underscore the complexity of international trade dynamics and the importance of accurate data interpretation in understanding geopolitical relationships.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051537&language=en-US",
            "pub_date": "2026-02-27 12:57:04",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051536,
            "title": "Block Reduces Operations Amid Stablecoin Settlement Threats",
            "description": "Block is scaling back its operations to levels last seen in 2019, according to CEO Jack Dorsey, who cites AI-driven productivity improvements as a key factor. However, the primary reason seems to be the looming threat of stablecoin settlement, which could significantly cut into the transaction fees that fintech payment processors rely on. According to NS3.AI, this shift indicates a potential transformation in the payments infrastructure, carrying substantial implications for the fintech industry.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051536&language=en-US",
            "pub_date": "2026-02-27 12:59:12",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051535,
            "title": "Green Party Secures Manchester Seat in UK House of Commons",
            "description": "The Green Party has emerged victorious in a special election for a Manchester seat in the House of Commons. Bloomberg posted on X, highlighting the potential challenge this poses to UK Prime Minister Keir Starmer’s Labour Party from the left. This win underscores the growing influence of the Green Party and signals a shift in voter sentiment that could impact future political dynamics in the UK.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051535&language=en-US",
            "pub_date": "2026-02-27 12:59:27",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051534,
            "title": "CZ Responds to Block Layoffs: Embrace AI or Risk Layoffs",
            "description": "Binance founder CZ posted on X, responding to recent news of layoffs at Jack Dorsey's Block. CZ posted that in today's reality, workers should learn to maximize the use of AI, or risk being laid off. CZ was replying to a post by Jack Dorsey, who stated that Block would be reducing its workforce by nearly half.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051534&language=en-US",
            "pub_date": "2026-02-27 13:00:49",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051532,
            "title": "GEOPOLITICS | Iranian Foreign Minister Urges Dialogue Between Afghanistan and Pakistan",
            "description": "Iranian Foreign Minister has called on Afghanistan and Pakistan to resolve their differences through dialogue. According to Jin10, the minister emphasized the importance of diplomatic engagement to address regional tensions. The call for dialogue comes amid ongoing disputes between the two neighboring countries, highlighting the need for peaceful resolution and cooperation. Iran's involvement underscores its interest in promoting stability in the region, as both Afghanistan and Pakistan play crucial roles in regional geopolitics. The minister's appeal reflects Iran's broader diplomatic strategy to foster peace and collaboration among neighboring nations.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051532&language=en-US",
            "pub_date": "2026-02-27 12:41:23",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051531,
            "title": "India's Stock Wealth Gap Raises Concerns Among Investors",
            "description": "Billionaire investor Raamdeo Agrawal has expressed concerns over the widening stock wealth gap in India. Bloomberg posted on X that Agrawal highlighted the growing disparity in stock ownership, which he believes is detrimental to the broader economy. He emphasized the need for more inclusive participation in the stock market to ensure equitable growth and prosperity. Agrawal's remarks come amid ongoing discussions about economic inequality and its impact on India's financial landscape. The investor's comments have sparked a debate on how to address these disparities and promote a more balanced distribution of wealth through stock market participation.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051531&language=en-US",
            "pub_date": "2026-02-27 12:42:48",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051530,
            "title": "Japan's SBI Holdings and Startale Group Announce Launch of Yen-Backed Stablecoin",
            "description": "Japan's SBI Holdings and Startale Group have announced the introduction of a yen-backed stablecoin, JPYSC, aimed at institutional and cross-border applications. According to BlockBeats, the stablecoin is backed by a trust bank and represents Japan's first stablecoin of its kind. SBI Shinsei Trust Bank will oversee its issuance and management in compliance with Japanese digital asset regulations.\n\nSBI VC Trade, a crypto exchange under the SBI Group, will serve as the primary distribution partner, while Startale will lead the technical development. The announcement highlights that JPYSC is designed to enable interoperability with traditional infrastructure and various blockchain networks. The stablecoin is expected to launch in the second quarter of this year, pending regulatory approval.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051530&language=en-US",
            "pub_date": "2026-02-27 12:43:38",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051521,
            "title": "Could Shiba Inu Make a Come Back This Year: Expert Shares Possible Targets",
            "description": "Analysis highlights possible targets, as Shiba Inu could be making a comeback this year after an extended period of price underperformance. After spending years sliding lower, Shiba Inu is showing early signs that its prolonged sideways trend may be easing. Visit Website\nsource: https://thecryptobasic.com/2026/02/27/could-shiba-inu-make-a-come-back-this-year-expert-shares-possible-targets/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051521&language=en-US",
            "pub_date": "2026-02-27 12:37:07",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051520,
            "title": "The ETF Store President: 50% drawdowns are not uncommon for Bitcoin; ETF investors are still buying the dip.",
            "description": "Nate Geraci, president of The ETF Store, stated that a 50% drawdown is not uncommon for long-term Bitcoin investors, and it may not be the last. He pointed out that despite the significant market decline, spot Bitcoin ETF investors have not shown obvious signs of panic, and fund flow data shows that their attitude remains stable. Geraci believes that recent fund movements indicate that some ETF investors prefer to buy on dips during pullbacks.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051520&language=en-US",
            "pub_date": "2026-02-27 12:38:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051519,
            "title": "SBI Holdings and Startale launched the Japanese yen stablecoin JPYSC, with plans to launch it in the second quarter.",
            "description": "Japanese financial group SBI Holdings and Startale Group announced the launch of JPYSC, a yen-denominated stablecoin, targeting institutional and cross-border payment scenarios. The stablecoin is issued and managed by SBI Shinsei Trust Bank, complies with Japan's digital asset regulatory framework, and SBI's trading platform, SBI VC Trade, will serve as the primary distribution channel, while Startale will handle technology development. Both parties stated that the trust bank support model will help improve governance and compliance, promote the application of the yen in the digital financial system, and provide a compliant alternative to the current market dominated by dollar-denominated stablecoins. The project is expected to launch in the second quarter of this year after obtaining regulatory approval. In recent years, Japan has continuously promoted the development of its stablecoin system. The 2022 revision of the Payment Services Law defined fiat-pegged stablecoins as \"electronic payment instruments\"; last October, Japan approved JPYC's issuance of the yen-denominated stablecoin. The three major banks, MUFG, SMBC, and Mizuho, ​​have also launched pilot programs for stablecoins and tokenized deposits. (The Block)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051519&language=en-US",
            "pub_date": "2026-02-27 12:41:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051514,
            "title": "$6B in Shorts Push Strategy to Most Shorted U.S. Mega-Cap Amid Bitcoin Dip",
            "description": "Strategy has become the most heavily shorted large-cap stock in the U. S. , reflecting growing doubts about its Bitcoin focus. The surge in bearish positioning follows a steep pullback in the Bitcoin price since its October 2025 record high, prompting investors to reassess the sustainability of the company’s aggressive Bitcoin accumulation strategy. Visit Website\nsource: https://thecryptobasic.com/2026/02/27/6b-in-shorts-push-strategy-to-most-shorted-u-s-mega-cap-amid-bitcoin-dip/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051514&language=en-US",
            "pub_date": "2026-02-27 12:27:43",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051513,
            "title": "Crypto analyst says Bitcoin selling pressure is nearly exhausted",
            "description": "Bitcoin has been given some reprieve to trade sideways for a few weeks, but it won't likely emerge from the woods until the fourth quarter, says crypto analyst Willy Woo.\nsource: https://cointelegraph.com/news/bearish-bitcoin-selloff-by-investors-is-exhausted-analysts?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051513&language=en-US",
            "pub_date": "2026-02-27 12:28:54",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051518,
            "title": "Focus AI Acquires Major Stake in South Korea's Busan Digital Asset Exchange",
            "description": "Focus AI has completed the acquisition of a 40.61% stake in Busan Digital Asset Exchange (Bdan), making it the largest shareholder. According to NS3.AI, this strategic move strengthens Focus AI's position in digital asset infrastructure, encompassing real-world asset tokenization, security token offerings, and stablecoin payment services. Bdan is noted as South Korea's pioneering exchange dedicated to real-world asset tokenization, with ITcen Global also holding a significant stake.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051518&language=en-US",
            "pub_date": "2026-02-27 12:32:42",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051512,
            "title": "Russia's Recruitment Tactics in Africa Raise Concerns",
            "description": "Russia is reportedly misleading Africans to enlist them for its conflict in Ukraine, raising questions about its role as a genuine ally to the continent. Bloomberg posted on X, highlighting the deceptive strategies employed by Russia to recruit African individuals for its military efforts. This development has sparked concerns about the nature of Russia's relationship with African nations, suggesting a more opportunistic rather than supportive partnership. The situation underscores the complexities of international alliances and the potential implications for African countries involved.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051512&language=en-US",
            "pub_date": "2026-02-27 12:20:39",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051508,
            "title": "CZ's commentary on Block's layoffs: Either fully embrace AI or face being replaced.",
            "description": "CZ, commenting on social media about Block's planned large-scale layoffs and increased investment in its AI strategy, stated that companies that do not actively embrace artificial intelligence may ultimately face the risk of being replaced by technology. Previous reports indicated that Block would lay off approximately 40% of its workforce, and Jack Dorsey was pushing forward with an AI-first strategy.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051508&language=en-US",
            "pub_date": "2026-02-27 12:24:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051511,
            "title": "Cathie Wood Highlights Bitcoin's Role as Inflation and Deflation Hedge",
            "description": "Cathie Wood has emphasized that Bitcoin serves as a hedge against both inflation and deflation, outperforming gold in recent times. According to Bitalk News, Wood noted that while both Bitcoin and gold are tools for combating inflation and deflation, Bitcoin is digital. From the perspective of incremental demand, gold's demand is already established, whereas Bitcoin is relatively new, with minimal institutional involvement. Additionally, younger generations prefer holding Bitcoin over gold, contributing to its recent superior performance.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051511&language=en-US",
            "pub_date": "2026-02-27 12:30:16",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051507,
            "title": "Hong Kong Government Plans New Measures to Support SMEs and Expand Markets",
            "description": "The Secretary for Commerce and Economic Development, Edward Yau, announced at a press conference on budget-related measures that the government is committed to optimizing various initiatives to support small and medium enterprises (SMEs) in innovation, enhancing competitiveness, and seizing opportunities to explore new markets. According to RTHK, the government is preparing to inject HKD 200 million into the BUD Special Fund, with execution details expected to be launched in the second quarter of this year.\n\nYau stated that with the advancement of high-level two-way openness, mainland enterprises are more actively exploring overseas markets. Promotional activities will be held in Hong Kong and various provinces and cities in mainland China, and a cross-sector professional service platform will be established. This platform will include legal, accounting, financial, testing, certification, and marketing services from Hong Kong professionals to support mainland enterprises going abroad. The government also plans to organize overseas inspection tours to help mainland enterprises understand foreign markets.\n\nHe further mentioned that Hong Kong will strengthen its role as a key node in the Belt and Road Initiative, collaborating with the industry to deepen engagement in ASEAN and Middle Eastern markets, while exploring the potential of Central Asia, South Asia, and North Africa markets. The government has completed investment agreement negotiations with Qatar, Bangladesh, and Peru and is exploring new investment agreements with Saudi Arabia and Egypt.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051507&language=en-US",
            "pub_date": "2026-02-27 12:12:54",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051506,
            "title": "Dollar Faces Decline Amid Tariff News, China Stocks Expected to Outperform",
            "description": "The dollar is anticipated to be significantly impacted by the recent wave of tariff announcements, according to the latest Markets Pulse survey. Bloomberg posted on X that the survey results suggest a potential decline for the dollar, while Chinese stocks are expected to see gains. This development comes as market participants assess the implications of ongoing trade tensions and their effects on global financial markets. The survey highlights a shift in investor sentiment, with a growing preference for Chinese equities amid the current economic climate. The findings underscore the challenges facing the dollar as trade policies continue to evolve.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051506&language=en-US",
            "pub_date": "2026-02-27 12:15:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051505,
            "title": "Bitcoin(BTC) Surpasses 68,000 USDT with a Narrowed 0.82% Decrease in 24 Hours",
            "description": "On Feb 27, 2026, 04:16 AM(UTC). According to Binance Market Data, Bitcoin has crossed the 68,000 USDT benchmark and is now trading at 68,009.398438 USDT, with a narrowed narrowed 0.82% decrease in 24 hours.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051505&language=en-US",
            "pub_date": "2026-02-27 12:16:08",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051504,
            "title": "Dongchedi Considers Hong Kong IPO This Year",
            "description": "Dongchedi, also known as DCar, is reportedly planning an initial public offering (IPO) in Hong Kong, potentially as early as this year. Bloomberg posted on X, citing sources familiar with the matter, that the automotive information and trading platform is exploring this financial move. The company, which provides a range of services in the automotive sector, is evaluating the timing and details of the IPO. Further specifics about the offering, including the size and valuation, have not been disclosed. Dongchedi's decision to go public in Hong Kong aligns with a trend of companies seeking to tap into the region's capital markets. The move could provide the company with additional resources to expand its operations and enhance its market presence.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051504&language=en-US",
            "pub_date": "2026-02-27 12:17:01",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}