{
    "data": [
        {
            "id": 1051839,
            "title": "US fintech startup Dots raises $8.9 million in Series A funding, with Y Combinator participating.",
            "description": "US fintech startup Dots has raised $8.9 million in Series A funding, led by DCM with participation from Y Combinator, bringing its total funding to over $14.8 million. Dots is building a payments layer for modern platforms, processing over $150 million in payments monthly and having transferred over $1.5 billion to over 1 million gig workers, creators, and contractors worldwide. The company reported revenue growth of over 400% last year and aims to achieve profitability by 2025. Dots has launched several new features, including a self-service payment system with tax filing capabilities, support for cryptocurrency payments in USDC, USDT, Bitcoin, and Ethereum, fraud prevention tools, global invoice processing, and a new $19/month pricing tier called Dots Core. The company currently serves clients such as Appen, Sofar Sounds, and Cluely, aiming to streamline cross-border payment processes for businesses and individuals. (Tech in Asia)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051839&language=en-US",
            "pub_date": "2026-02-27 17:33:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051837,
            "title": "China's Central Bank Introduces New Rules for Cross-Border Yuan Funding",
            "description": "China's central bank has unveiled new regulations aimed at enhancing cross-border yuan funding between domestic and international financial institutions. Bloomberg posted on X, highlighting the significance of these rules in promoting the yuan's global use and facilitating smoother financial transactions. The initiative is part of China's broader strategy to internationalize its currency and strengthen its position in global markets. The new rules are expected to streamline processes and reduce barriers for financial institutions engaging in cross-border activities, thereby fostering increased economic collaboration.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051837&language=en-US",
            "pub_date": "2026-02-27 17:25:10",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051836,
            "title": "Binance Market Update (2026-02-27)",
            "description": "The global cryptocurrency market cap now stands at $2.35T, up by 4.08% over the last day, according to CoinMarketCap data.\n\nBitcoin (BTC) has been trading between $66,500 and $68,723 over the past 24 hours. As of 09:30 AM (UTC) today, BTC is trading at $68,026, down by -0.21%.\n\nMost major cryptocurrencies by market cap are trading mixed. Market outperformers include SAHARA, 币安人生, and NEWT, up by 39%, 19%, and 19%, respectively.\n\nTop stories of the day:\n\nCZ: Beware of Risks in Wallet Software Upgrades\n\nBinance Surpasses $70B In Commodities Trading Volume\n\nCZ Responds to Block Layoffs: Embrace AI or Risk Layoffs\n\nCrypto Market News: Aave Crosses $1 Trillion in Lending Volume as Institutional DeFi Adoption Accelerates\n\nXRP Price News: Is a 20% March Rally Taking Shape After Months of Losses?\n\nBitcoin News Today: Bitcoin ETFs Attract $507M as BTC Reclaims $68K, Signaling Potential Trend Shift\n\nBitcoin News Today: Bitcoin Price Eyes $80K as Traders Point to Liquidation Clusters and ETF Inflows\n\nBitcoin News: Indiana Bitcoin Rights Bill Advances to Governor After Bicameral Approval\n\nU.S. Pre-Market Crypto Stocks Mixed as ABTC Jumps 7%, MSTR Edges Lower\n\nAllianceDAO Co-Founder: Bitcoin Bear Market Has No “Scapegoat,” Price Driven by Psychology\n\nMarket movers:\n\nETH: $2038.05 (-1.30%)\n\nBNB: $628.64 (-0.02%)\n\nXRP: $1.4221 (-1.39%)\n\nSOL: $87.43 (-0.56%)\n\nTRX: $0.2852 (-0.38%)\n\nDOGE: $0.09809 (-1.78%)\n\nWLFI: $0.1156 (-1.45%)\n\nADA: $0.2924 (-0.65%)\n\nU: $1 (+0.02%)\n\nBCH: $484.5 (-3.18%)\n\nTop gainers on Binance:\n\nSAHARA/USDT (+39%)\n\n币安人生/USDT (+19%)\n\nNEWT/USDT (+19%)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051836&language=en-US",
            "pub_date": "2026-02-27 17:30:05",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051827,
            "title": "What Ripple’s XRPL Funding Overhaul Means for XRP Price",
            "description": "Ripple has outlined a major shift in how the XRP Ledger ecosystem will be funded starting in 2026. In a new update, the company said more than $550 million has already been deployed into XRPL initiatives, but future support will lean more heavily on distributed and community-driven funding. com\nsource: https://techgaged.com/what-ripples-xrpl-funding-overhaul-means-for-xrp-price/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051827&language=en-US",
            "pub_date": "2026-02-27 17:14:50",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051826,
            "title": "UK Signs Key Mineral Cooperation Agreement with Kazakhstan",
            "description": "The UK has signed a significant mineral cooperation agreement with Kazakhstan, according to Jin10. This move is part of the UK's ongoing efforts to diversify its sources of critical mineral resources. The agreement was signed by UK Foreign Secretary Yvette Cooper on Thursday. Previously, the UK government highlighted in its Critical Minerals Strategy released last year that 22 out of the 36 minerals produced by Kazakhstan are deemed essential for the UK.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051826&language=en-US",
            "pub_date": "2026-02-27 17:18:07",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051825,
            "title": "Shiba Inu's Potential Price Surge with Token Burn",
            "description": "Shiba Inu (SHIB) witnessed a significant rally in 2021 following Ethereum co-founder Vitalik Buterin's decision to burn 90% of the tokens he received, leading to a substantial reduction in supply and a subsequent price increase. According to NS3.AI, if Shiba Inu were to replicate this token burn today, reducing the supply by 410 trillion tokens, SHIB's price could potentially rise by approximately 223.5%, assuming the market cap remains at $3.5 billion. However, SHIB's lead developer cautions that token burns alone are not sufficient for substantial price growth without broader adoption.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051825&language=en-US",
            "pub_date": "2026-02-27 17:18:14",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051824,
            "title": "Ukraine Seeks to Boost Production of Patriot Missiles Amid Russian Threats",
            "description": "The Ukrainian military is aiming to expedite the manufacturing of anti-ballistic missiles for its Patriot air-defense systems. Bloomberg posted on X, highlighting the urgency of enhancing defense capabilities in response to ongoing Russian aggression. The move comes as Ukraine seeks to bolster its defenses against missile attacks, which have intensified in recent months. The Patriot systems, known for their effectiveness in intercepting incoming threats, are crucial to Ukraine's strategy to safeguard its territory. Ukrainian officials emphasize the importance of increasing production to ensure a robust defense posture. The focus on missile production underscores the broader efforts to strengthen military capabilities amid the geopolitical tensions with Russia.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051824&language=en-US",
            "pub_date": "2026-02-27 17:20:47",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051823,
            "title": "An address suspected to belong to Monetalis transferred 325,000 UNI tokens to Wintertermute.",
            "description": "According to The Data Nerd, 17 hours ago, a whale wallet suspected to be associated with Monetalis transferred 325,000 UNI tokens, worth $1.24 million, to Wintermute. This wallet currently holds 3.27 million UNI tokens, worth $12.75 million; 31,337 ETH, worth $63.81 million; and 98,900 AAVE tokens, worth $11.86 million.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051823&language=en-US",
            "pub_date": "2026-02-27 17:10:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051813,
            "title": "New World Reports Loss Amid Hong Kong Property Slump",
            "description": "New World Development Co. has reported a loss for the first half of the year, reflecting the ongoing challenges in Hong Kong's property market. Bloomberg posted on X, highlighting the impact of the property downturn on the developer's financial performance. The company, which has been grappling with a sluggish real estate sector, continues to face difficulties as market conditions remain unfavorable. The downturn in Hong Kong's property market has been a significant factor affecting New World's financial results, as the developer navigates through a challenging economic landscape.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051813&language=en-US",
            "pub_date": "2026-02-27 17:11:09",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051812,
            "title": "GEOPOLITICS | Sweden Intercepts Suspected Russian Drone Near French Aircraft Carrier",
            "description": "Swedish authorities have intercepted a drone suspected to be of Russian origin as it approached the French aircraft carrier Charles de Gaulle, docked at Malmö port. According to Jin10, the incident raises concerns over regional security and the potential for increased geopolitical tensions. The interception underscores the vigilance required in monitoring airspace near critical military assets. The presence of the French carrier in Swedish waters is part of ongoing naval operations, and the incident highlights the complexities of international military engagements in the region.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051812&language=en-US",
            "pub_date": "2026-02-27 17:11:34",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051811,
            "title": "Hong Kong's January Export and Import Values Surge",
            "description": "Hong Kong's Census and Statistics Department reported a 33.8% year-on-year increase in the total value of goods exported in January, marking the 23rd consecutive month of growth. Imports rose by 38.1% year-on-year, continuing a 13-month upward trend, with both exports and imports expanding by nearly 8 percentage points month-on-month. According to RTHK, January recorded a visible trade deficit of HKD 14.1 billion.\n\nThe government noted that due to the varying dates of the Lunar New Year holiday, it is more appropriate to analyze trade figures for January and February combined. Data showed a 37.3% increase in the value of exports to Asia last month. Exports to Malaysia surged by 81.1%, while those to mainland China rose by 40.6%. Exports to Singapore, Thailand, and Vietnam increased by over 30%, and exports to Switzerland more than doubled.\n\nImports from Vietnam and India more than doubled, while those from mainland China and Singapore rose by over 40%. A government spokesperson stated that the significant increase in the value of goods exported last month was evident across most markets and major commodity categories, reflecting a robust underlying growth momentum. Looking ahead, Hong Kong's merchandise trade performance is expected to benefit from the continued moderate expansion of the global economy and strong demand for AI-related electronic products. The government will remain vigilant regarding changes in trade policies in the external environment.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051811&language=en-US",
            "pub_date": "2026-02-27 17:12:15",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051800,
            "title": "Denmark's Prime Minister Advocates Wealth Tax to Address Inequality",
            "description": "Danish Prime Minister Mette Frederiksen has proposed the introduction of a wealth tax to tackle inequality in the country. Bloomberg posted on X, highlighting Frederiksen's belief that such a tax would help create a more balanced society. The Prime Minister emphasized the importance of addressing economic disparities to ensure a fairer distribution of resources. Frederiksen's proposal comes amid ongoing discussions about economic reforms and social equity in Denmark.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051800&language=en-US",
            "pub_date": "2026-02-27 17:01:23",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051799,
            "title": "Launch of Prediction Market Platform TBD Raises $3 Million in Funding",
            "description": "TBD, a newly launched prediction market platform, has successfully raised $3 million in funding. According to NS3.AI, the platform aims to introduce innovative features within the prediction market space, drawing significant interest from investors. This development is expected to influence decentralized finance applications, highlighting the growing interest in prediction markets.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051799&language=en-US",
            "pub_date": "2026-02-27 17:01:42",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051798,
            "title": "Enforcement Directorate Seizes Anil Ambani's $410 Million Home",
            "description": "The Enforcement Directorate has escalated its investigation into Anil Ambani by seizing his $410 million residence located in an upscale neighborhood. Bloomberg posted on X, highlighting the ongoing scrutiny faced by Ambani amid financial allegations. The seizure marks a significant development in the case, as authorities continue to probe into Ambani's financial dealings. The Enforcement Directorate's actions are part of a broader effort to address alleged financial irregularities associated with Ambani. The investigation has drawn considerable attention, given Ambani's prominent status in the business world. Further developments are anticipated as the case progresses.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051798&language=en-US",
            "pub_date": "2026-02-27 17:02:19",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051797,
            "title": "Businesses Rush to Secure Tariff Refunds",
            "description": "Businesses are actively seeking to obtain their tariff refund checks as trade tensions continue to impact global markets. Bloomberg posted on X, highlighting the urgency among companies to recover funds amid ongoing economic uncertainties. The refunds are part of efforts to mitigate the financial strain caused by tariffs imposed during trade disputes. Companies are navigating complex procedures to ensure they receive the refunds, which are seen as crucial for maintaining financial stability. The situation underscores the broader challenges faced by businesses in adapting to fluctuating trade policies and economic conditions.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051797&language=en-US",
            "pub_date": "2026-02-27 17:02:35",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051785,
            "title": "Bitcoin ETFs Pull $254M as BlackRock Leads: Ethereum Sees Modest Inflows, XRP Extends Gains",
            "description": "Key Takeaways: Bitcoin ETFs saw $254. 4M in net inflows on Feb. 26. Ethereum ETFs recorded $6. 6M in net inflows.\nsource: https://coindoo.com/bitcoin-etfs-pull-254m-as-blackrock-leads-ethereum-sees-modest-inflows-xrp-extends-gains/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051785&language=en-US",
            "pub_date": "2026-02-27 16:45:18",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051784,
            "title": "🇺🇸 LATEST: OCC says regulators should manage, not eliminate, risk and tailor rules to keep the federal banking system relevant and healthy.",
            "description": "null\nsource: https://x.com/cointelegraph/status/2027304110370812016",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051784&language=en-US",
            "pub_date": "2026-02-27 16:45:40",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051783,
            "title": "Cape Town Mayor Announces Candidacy for Democratic Alliance Leadership",
            "description": "Cape Town Mayor Geordin Hill-Lewis has announced his intention to run for the leadership of the Democratic Alliance, South Africa's second-largest political party. Bloomberg posted on X, detailing Hill-Lewis's decision to enter the race, which comes as the party seeks to strengthen its position ahead of upcoming elections. Hill-Lewis, who has served as mayor since November 2021, aims to bring fresh perspectives and strategies to the party's leadership. His candidacy is expected to influence the party's direction and policies as it prepares for future political challenges. The Democratic Alliance has been a significant force in South African politics, and Hill-Lewis's leadership bid marks a pivotal moment for the party.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051783&language=en-US",
            "pub_date": "2026-02-27 16:46:45",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051782,
            "title": "STOCKS | European Shares Set for Longest Monthly Winning Streak Since 2013",
            "description": "European shares began the last trading session of February poised to achieve their longest monthly winning streak since 2013. Bloomberg posted on X, highlighting the positive momentum in the market as investors remain optimistic about economic recovery prospects. The rally has been driven by strong corporate earnings and supportive monetary policies across the region. Analysts suggest that the sustained growth reflects confidence in the European economy's resilience amid global uncertainties. As February concludes, market participants are closely monitoring economic indicators and geopolitical developments that could influence future performance.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051782&language=en-US",
            "pub_date": "2026-02-27 16:48:47",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051778,
            "title": "Malaysia to Consider Royal Commission for Anti-Graft Agency Investigation",
            "description": "Malaysia is set to determine if a Royal Commission of Inquiry will be formed to probe allegations of misconduct within the nation's anti-corruption agency. Bloomberg posted on X, highlighting the government's deliberation on this significant matter. The decision comes amid growing concerns over the integrity and operations of the agency tasked with combating corruption. Authorities are weighing the potential impact of such an inquiry on public trust and the agency's future effectiveness. The move reflects Malaysia's ongoing efforts to address corruption and ensure transparency in its institutions. Further details on the timeline and scope of the inquiry are yet to be disclosed.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051778&language=en-US",
            "pub_date": "2026-02-27 16:37:11",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}