{
    "data": [
        {
            "id": 1051692,
            "title": "Long-Term Bitcoin Holdings Show Net Growth Amid Market Uncertainty",
            "description": "Crypto KOL Murphy posted on X about recent data trends in Bitcoin holdings, highlighting that as of February 26, there has been a net increase in long-term holdings (LTH). Between February 13 and February 26, 14,127 BTC held by long-term holders were spent, while 19,798 BTC from short-term holders were converted to long-term holdings. This net positive change indicates a reduction in turnover for both long-term and short-term holdings, suggesting that speculative funds are exiting while long-term holders are reluctant to sell. Although this reduces liquidity, it also eases selling pressure.\n\nMurphy emphasized the importance of monitoring these trends, drawing from experiences on January 14. Given the current pessimistic and sensitive market sentiment, any increase in selling pressure could severely test the limited short-term demand. Even if the impact is not immediate, it could indirectly lead to an early end to any market rebound. Therefore, Murphy plans to keep a close watch on these developments daily, among other indicators.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051692&language=en-US",
            "pub_date": "2026-02-27 15:28:22",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051691,
            "title": "Ethereum ETF Positions Reduced by Institutions in Late 2025",
            "description": "On February 27, Bloomberg analyst James Seyffart shared insights on the X platform regarding institutional trading activities. According to BlockBeats, Seyffart noted that in the fourth quarter of 2025, many institutions filing 13F reports with the U.S. Securities and Exchange Commission sold off their Ethereum ETF positions. This trend was particularly evident among hedge funds, which reduced their holdings amid a significant drop in basis at the beginning of October that persisted at low levels.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051691&language=en-US",
            "pub_date": "2026-02-27 15:28:34",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051690,
            "title": "Australia's Crypto Industry Faces Growth Amid Banking and Regulatory Challenges",
            "description": "Australia's cryptocurrency sector is experiencing growth with an increase in users and the launch of new ETFs. According to NS3.AI, this expansion is accompanied by ongoing challenges, including banking restrictions and regulatory uncertainty. At the XRP Australia 2026 event, industry leaders emphasized the persistent de-banking issues affecting exchanges and expressed concerns about potential overregulation of wallet developers due to payment service reforms. The legislative progress on crypto regulations has decelerated following a change in government, adding to the industry's apprehensions.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051690&language=en-US",
            "pub_date": "2026-02-27 15:29:05",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051689,
            "title": "Thailand's Central Bank Takes Action to Mitigate Baht Volatility",
            "description": "Thailand's central bank has implemented measures to address the fluctuations in the baht, according to Jin10. The bank's actions aim to stabilize the currency amidst ongoing market volatility. These measures are part of a broader strategy to ensure economic stability and maintain investor confidence in the country's financial system. The central bank continues to monitor the situation closely to adapt its approach as necessary.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051689&language=en-US",
            "pub_date": "2026-02-27 15:31:24",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051686,
            "title": "STOCKS | European Stocks Attract Investors with Record Buybacks",
            "description": "European stocks are gaining attention from investors due to record buybacks, providing a compelling reason to consider them over U.S. stocks. Bloomberg posted on X, highlighting the increasing trend of buybacks in Europe, which is drawing interest from market participants. This development comes as investors seek new opportunities amid fluctuating global markets. The surge in buybacks is seen as a positive signal for European equities, potentially boosting their appeal compared to their American counterparts. As the buyback trend continues, it may influence investment strategies and portfolio allocations, offering a fresh perspective on the European market landscape.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051686&language=en-US",
            "pub_date": "2026-02-27 15:18:54",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051685,
            "title": "Citi Upgrades CK Asset Holdings to Buy Amid Positive Outlook on UK Asset Sales",
            "description": "Citi Research has upgraded CK Asset Holdings (01113.HK) from neutral to buy, citing a positive outlook on the company's sale of minority stakes in UK railway projects and UK Power Networks (UKPN). According to Jin10, Citi views these transactions as a demonstration of CK Asset's ability to profit from investments and suggests a potential shift in capital reallocation priorities.\n\nCiti also noted a 5% price increase in the latest price list for the Blue Coast project, reflecting improved market conditions. The delayed launch of the Victoria Blossom project appears to align with these favorable conditions, potentially indicating an upward margin potential for development projects after CK Asset's HKD 2.3 billion provision for Wong Chuk Hang and Kai Tak projects.\n\nPotential catalysts for CK Asset include reinvestment in Hong Kong development properties, which Citi deems timely, and enhanced shareholder returns through dividends or share buybacks, possibly funded by the sale of UKPN shares. Consequently, Citi has raised the target price for CK Asset from HKD 39 to HKD 54.55.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051685&language=en-US",
            "pub_date": "2026-02-27 15:20:19",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051684,
            "title": "Engie CEO Catherine MacGregor Makes Bold $14.2 Billion Investment",
            "description": "Engie CEO Catherine MacGregor is embarking on a significant $14.2 billion investment after four years of cautious deal-making. Bloomberg posted on X, highlighting this strategic move as a pivotal moment for the company. This investment marks a shift in Engie's approach, aiming to strengthen its position in the energy sector.\n\nMacGregor's decision comes as Engie seeks to expand its influence and capabilities in the market. The company has been known for its conservative strategy in recent years, but this bold move indicates a new direction under MacGregor's leadership.\n\nThe investment is expected to enhance Engie's portfolio and drive growth, aligning with the company's long-term objectives. As the energy landscape evolves, Engie's strategic investment positions it to capitalize on emerging opportunities and challenges.\n\nThis development reflects a broader trend in the industry, where companies are increasingly making substantial investments to secure their future in a rapidly changing market. Engie's decision underscores the importance of adaptability and foresight in navigating the complexities of the energy sector.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051684&language=en-US",
            "pub_date": "2026-02-27 15:21:07",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051681,
            "title": "Analysts predict that BTC may bottom out at $45,000 and end its bear market in Q4, with a bull market rebound expected in Q1/Q2 of 2027.",
            "description": "Willy Woo posted on the X platform that investor selling pressure has weakened, and prices have stabilized briefly. Prices could consolidate sideways for about a month, possibly even rebounding to the mid-$70 range before a pullback. This is because the overall market is strongly bearish, with both spot and futures liquidity deteriorating. He hasn't seen BTC rise when liquidity is consistently bearish. If we were to speculate, Q4 might be the end of the bearish trend, with a possible rebound in bullish momentum in the first or second quarter of 2027. Around $45,000 could be a typical bear market bottom. BTC has been in a long-term global macro bull market from 2009 to 2026. If the global macro environment deteriorates, $30,000 could become a support level for a pullback, and $16,000 might be the ultimate floor for maintaining the BTC bull market trend.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051681&language=en-US",
            "pub_date": "2026-02-27 15:10:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051680,
            "title": "Feng Bo strongly supports Haseeb: He is the backbone of Dragonfly and the \"most dazzling star\" among the investors I know.",
            "description": "Feng Bo, founder of Dragonfly Capital, posted on X, stating, \"I rarely speak out on X, but this time I want to clarify some facts. When I first founded Dragonfly, it was a fund of funds. Through this business, I met many very talented venture capitalists, and among them, Haseeb Qureshi was undoubtedly the brightest star. Therefore, I invited him to join me in building our venture capital business. I have been in VC for many years, and in my 30-year VC career, Haseeb has built one of the best partner teams I have ever worked with; he is the backbone of the team. Building our venture capital business with Haseeb has been an extremely valuable journey, and I look forward to continuing this journey together for many years to come.\" Previously, it was reported that Dragonfly Managing Partner Haseeb Qureshi and former co-founder Alexander Pack (now co-founder of Hack VC) recently had a public debate on social media, with each side holding differing views on early history and investment leadership.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051680&language=en-US",
            "pub_date": "2026-02-27 15:11:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051676,
            "title": "STOCKS | South Korean Stock Market Ends Six-Day Rally",
            "description": "South Korea's stock market concluded its six-day upward trend, with the Seoul Composite Index closing at 6,244 points, marking a decline of 63 points or 1%. According to RTHK, the weekly performance of South Korean stocks showed a 7.5% increase, continuing a three-week streak of gains.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051676&language=en-US",
            "pub_date": "2026-02-27 15:07:20",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051675,
            "title": "STOCKS | Japan's Nikkei Index Reaches New Closing High",
            "description": "Japan's stock market experienced an initial decline before rising to a new closing high. According to RTHK, the Nikkei 225 index closed at 58,850 points, marking an increase of 96 points or nearly 0.2%, extending its gains for the fourth consecutive day. Over the week, the index accumulated a rise of approximately 3.6%.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051675&language=en-US",
            "pub_date": "2026-02-27 15:07:24",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051674,
            "title": "Circle Integrates USDC with Canza Finance for Enhanced Cross-Border Transactions",
            "description": "Circle announced on X that Canza Finance has integrated USDC into its cross-border transaction and structured asset models. According to PANews, this integration aims to enhance the usability of stablecoins in emerging markets, particularly in areas where efficient, programmable financial tools are crucial. Canza Finance is focused on promoting open financial access in emerging markets, covering asset tokenization, cross-chain transfers, and trade finance in its business use cases. As a member of the Circle Alliance, Canza supports the broader use of digital dollar infrastructure globally.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051674&language=en-US",
            "pub_date": "2026-02-27 15:08:39",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051673,
            "title": "Security Breach: South Korean Tax Agency's Error Leads to $4.8 Million Token Theft",
            "description": "A South Korean tax agency inadvertently revealed a mnemonic phrase in a press release, resulting in the theft of 4 million PRTG tokens, valued at approximately $4.8 million. According to NS3.AI, the incident was confirmed by a university professor and took place within 10 hours of the leak. This breach underscores the significant risks associated with the public handling of sensitive cryptocurrency credentials.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051673&language=en-US",
            "pub_date": "2026-02-27 15:08:48",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051666,
            "title": "Cardone Capital is looking to enter the tokenized real estate sector and is seeking the best Layer 2 partners.",
            "description": "Billionaire Grant Cardone says Cardone Capital is preparing to tokenize its real estate holdings and is inquiring about which Layer 2 platform would be the best partner. (Cointelegraph) Previously, it was reported that billionaire Grant Cardone plans to launch the world's largest publicly traded real estate Bitcoin company in 2026.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051666&language=en-US",
            "pub_date": "2026-02-27 15:03:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051663,
            "title": "STOCKS | Surge in Global Investment Drives Unusual Activity in South Korean Chipmaker ETFs",
            "description": "A surge in global investment targeting South Korean chipmakers is causing unusual movements and trading volumes in exchange-traded funds (ETFs). Bloomberg posted on X that this influx of capital is primarily directed at high-performing shares within the sector, leading to significant shifts in the market dynamics.\n\nThe increased interest in South Korean chipmakers is attributed to their strong performance and potential for growth, attracting investors worldwide. This trend is reflected in the abnormal trading patterns observed in ETFs associated with these companies.\n\nMarket analysts suggest that the heightened activity could be a result of investors seeking to capitalize on the technological advancements and competitive edge of South Korean chipmakers. The sector's promising outlook has made it a focal point for global investors looking to diversify their portfolios.\n\nAs the demand for semiconductor technology continues to rise, South Korean chipmakers are positioned to benefit from this trend, further driving investor interest. The ongoing developments in the industry are expected to sustain the momentum, influencing ETF movements and volumes in the foreseeable future.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051663&language=en-US",
            "pub_date": "2026-02-27 14:57:01",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051662,
            "title": "UBS Appoints Agustin Carstens and Luca Maestri to Board",
            "description": "UBS has announced the appointment of Agustin Carstens, the former head of the Bank for International Settlements, and Luca Maestri, vice president at Apple, to its board. Bloomberg posted on X, highlighting the strategic move by UBS to strengthen its leadership team. Carstens brings extensive experience in international finance, while Maestri's expertise in technology and financial management is expected to be a valuable asset to the board. This decision reflects UBS's commitment to enhancing its governance and strategic direction.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051662&language=en-US",
            "pub_date": "2026-02-27 14:58:30",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051661,
            "title": "Institutional Investors Seek Downside Protection Amid Bitcoin Price Concerns",
            "description": "Institutional investors, including Bitcoin ETF holders and treasury firms, are increasingly acquiring downside protection to guard against potential declines in Bitcoin prices below $60,000. According to NS3.AI, this trend indicates apprehension about a possible significant market correction. The strategy reflects a cautious stance by market participants with long-term investment strategies, aiming to hedge against market volatility.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051661&language=en-US",
            "pub_date": "2026-02-27 14:58:54",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051660,
            "title": "Germany's Import Price Index Surpasses Expectations in January",
            "description": "Germany's import price index for January showed a monthly increase of 1.1%, exceeding the anticipated 0.60% and improving from the previous value of -0.10%. According to Jin10, this rise in import prices indicates potential inflationary pressures within the German economy. The unexpected increase may influence economic forecasts and monetary policy decisions in the coming months. Analysts are closely monitoring these developments to assess their impact on the broader European market.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051660&language=en-US",
            "pub_date": "2026-02-27 15:01:39",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051655,
            "title": "GEOPOLITICS | Iranian Foreign Minister Asserts Military Action Ineffective on Nuclear Issue",
            "description": "Iranian Foreign Minister Araghchi stated that military action is not a viable solution to Iran's nuclear issue. According to Jin10, he emphasized that previous attempts to resolve the matter through military means have failed. Despite increased pressure, no progress has been made.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051655&language=en-US",
            "pub_date": "2026-02-27 14:50:17",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051654,
            "title": "Iranian Foreign Minister Highlights Progress in Third Round of Talks",
            "description": "Iranian Foreign Minister Araghchi stated that the third round of talks was more in-depth and lasted longer than previous discussions. According to Jin10, both parties explored key elements that could form the basis of an agreement. This development marks a significant step forward in the ongoing negotiations. The discussions aim to address critical issues and pave the way for a potential resolution.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051654&language=en-US",
            "pub_date": "2026-02-27 14:51:20",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}