{
    "data": [
        {
            "id": 734104,
            "title": "ETH supply exceeds Ethereum pre-merger level",
            "description": "Odaily Planet Daily News According to Ultrasound data, the current supply of ETH has exceeded the level before the Ethereum PoS merger. Data shows that the current ETH supply is 120,521,291, an increase from 120,521,140.92 at the time of the merger on September 15, 2022. Since Ethereum completed the transition to the Proof of Stake (PoS) mechanism, 1,947,607.01 ETH has been destroyed, and 1,947,757.18 ETH have been newly issued, with a net supply increase of 150.17 ETH.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734104&language=en-US",
            "pub_date": "2025-02-05 14:26:36",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734103,
            "title": "Gavin Wood: Polkadot’s Satoshi coefficient reaches 149, and its degree of decentralization far exceeds Ethereum and Solana",
            "description": "Odaily Planet Daily News: Ethereum co-founder and Polkadot founder Gavin Wood said in an interview with Forbes recently that blockchains that ignore decentralization and resilience should not be considered Web3. Measuring the resilience of a blockchain usually comes down to assessing its degree of decentralization, and Wood identified several questions to assess this metric: Who makes protocol decisions? Does governance have a clear or low entry barrier? And the Nakamoto coefficient, which measures how many parties are needed to destroy the network. Finally, Wood drew attention to more \"diffuse concepts,\" such as whether a single entity can define a narrative and \"fundamentally transcend the ecosystem and stifle other narratives.\" He is satisfied with Polkadot's decentralization. According to Nakaflow data, Polkadot's current Nakamoto coefficient is 149, which means that at least 149 independent validators are required to unite to destroy the network. In comparison, some other major blockchains have much lower scores, such as Solana's score of 19 and Ethereum's score of only 2. However, for Polkadot, the high barrier to entry is still a problem. In addition, Wood also proposed the following five basic criteria for judging the potential of blockchain: \n1. Resilience: The cornerstone of Web3, resilience combines cryptography, decentralization and game theory to protect blockchain from attacks and ensure its long-term stability; \n2. Performance: Not only scalability, performance also measures the efficiency of a network in processing and completing tasks; \n3. Generality: The ability of blockchain to support multiple applications and programmability; \n4. Accessibility: The ease with which users, developers, applications and robots interact with the network; \n5. Coherence: The ability of a system to maintain fast and consistent communication in its network.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734103&language=en-US",
            "pub_date": "2025-02-05 14:30:35",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734102,
            "title": "Matrixport: There is a clear technical divergence between Bitcoin price and RSI, indicating that its momentum is weakening",
            "description": "Odaily Planet Daily News Matrixport released today's chart saying that there is a clear technical divergence between the price of Bitcoin and the relative strength index (RSI). Although the price of Bitcoin has remained above $100,000, the RSI has been in a consolidation state, indicating that the momentum of the underlying trend is weakening.\nLooking back at the correction and consolidation phases before 2024, strong buying opportunities have historically only occurred when the RSI fell to about 40%. At present, although the RSI is close to that level (48%), it has not yet reached it, so it may be too early to enter a new long position. A more strategic approach is to remain patient and wait for the best entry point.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734102&language=en-US",
            "pub_date": "2025-02-05 14:34:05",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734101,
            "title": "El Salvador Expands Bitcoin Holdings Amid Market Dip",
            "description": "According to Cointelegraph, El Salvador has increased its Bitcoin reserves by purchasing 12 Bitcoin during a recent market downturn. On February 4, the country acquired 11 Bitcoin for just over $1.1 million, averaging $101,816 per Bitcoin. An additional Bitcoin was later bought for $99,114, as reported by the government's Bitcoin Office tracker. This acquisition brings El Salvador's total Bitcoin holdings to 6,068 BTC, valued at over $554 million.\n\nThe Bitcoin Office announced in a February 4 post on X that El Salvador had accumulated 21 BTC over the week, with a total of 60 BTC purchased in the past 30 days. The post highlighted the growth of the world's first Strategic Bitcoin Reserve, emphasizing El Salvador's continued success in expanding its cryptocurrency assets.\n\nBitcoin experienced a 24-hour low of approximately $96,000 but has since recovered to around $98,000, though it remains below its intraday high of over $100,700, according to CoinGecko data. The recent Bitcoin purchases follow a $1.4 billion financing agreement between El Salvador's President Nayib Bukele and the International Monetary Fund (IMF) last month. As part of the agreement, the government agreed to reduce some of its Bitcoin-related activities.\n\nChanges implemented by El Salvador include making Bitcoin acceptance voluntary for the private sector and reducing government involvement in the Chivo crypto wallet. On January 29, Reuters reported that El Salvador's Congress quickly approved legislation to amend its Bitcoin laws to align with the IMF deal, which President Bukele had submitted shortly before.\n\nDespite the IMF agreement, El Salvador's government continues to invest in Bitcoin. The day after the deal was made, the country purchased $1 million worth of Bitcoin. National Bitcoin Office Director Stacy Herbert stated in late December that the country's Bitcoin strategy remains unchanged. A spokesperson from the Bitcoin Office also confirmed to Cointelegraph that El Salvador plans to continue buying Bitcoin, with intentions to \"intensify in 2025.\"",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734101&language=en-US",
            "pub_date": "2025-02-05 14:23:36",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734097,
            "title": "Chairman of the U.S. Senate Banking Committee: Two crypto bills may be passed by the Senate within 100 days of Trump taking office",
            "description": "Odaily Planet Daily News On Tuesday, David Sacks, the White House AI and cryptocurrency director, held his first cryptocurrency-focused press conference on Tuesday, outlining legislative priorities and revealing the Trump administration's first major move to regulate the emerging industry: a market structure bill and a comprehensive stablecoin bill.\nAt the event attended by key leaders of the Senate and the House of Representatives, Senate Banking Committee Chairman Tim Scott said he intends to get the two key cryptocurrency bills passed in the Senate before the end of President Trump's 100th day in office, a deadline of less than three months from today.\nScott added that a stablecoin bill introduced by Senator Bill Hagery on Tuesday may be the first to be passed. (Decrypt)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734097&language=en-US",
            "pub_date": "2025-02-05 14:15:19",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734096,
            "title": "Institution: DeepSeek's impact on the AI ​​chip market this year is limited, and the global semiconductor market is expected to grow by 13.4% annually in 2025",
            "description": "Odaily Planet Daily News: DeepSeek impacts the AI ​​supply chain. DIGITIMES Research said that DeepSeek will not impact the AI ​​chip market demand in 2025. In 2025, the global semiconductor industry revenue will continue the trend of 2024, and is expected to increase by 13.4% year-on-year to a peak of US$714 billion. (Jinshi)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734096&language=en-US",
            "pub_date": "2025-02-05 14:15:50",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734095,
            "title": "Shiba Inu Partners with UAE Ministry of Energy to Implement Blockchain in Government Operations",
            "description": "According to a report from Watcher.guru, Shiba Inu (SHIB) has announced a partnership with the United Arab Emirates Ministry of Energy and Infrastructure (MOEI) to integrate its blockchain-based operating system, ShibOS, into government activities. This partnership represents the first instance of a government globally implementing blockchain technology at the federal level. The Shiba Inu team expressed enthusiasm about this pioneering venture, emphasizing the potential of ShibOS to revolutionize public sector operations by introducing enhanced transparency, security, and efficiency.UAE's Blockchain Strategy and Economic ImpactThe UAE has outlined a comprehensive blockchain strategy that aims to transition 50% of government transactions onto blockchain platforms. This strategic shift is expected to save more than $3 billion annually in transaction and document processing fees. Sharif Al Olama, the UAE's Deputy Minister of Energy and Petroleum Affairs, highlighted the significance of this collaboration, stating, \"We are pleased to deepen our commitment to cutting-edge digital services. This collaboration marks a critical step in our journey to redefine government services.\"",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734095&language=en-US",
            "pub_date": "2025-02-05 14:11:34",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734094,
            "title": "Surge in Bitcoin Spot ETFs with $341 Million Net Inflows",
            "description": "According to SoSoValue data reported by ChainCatcher, different Bitcoin ETFs showed varied performance:Grayscale’s GBTC: Achieved a daily net inflow of $19.5412 million, though it historically registered a net outflow totaling $21.864 million.Grayscale’s Mini-Trust ETF BTC: Recorded no net outflow on the same day, with a positive historical net inflow of $1.232 million.BlackRock’s IBIT: Led the inflows with $249 million for the day, elevating its historical total net inflow to an impressive $40.729 million.ARK Invest and 21Shares’ ARKB: Followed with a significant inflow of $56.1234 million, pushing its total historical net inflow to $2.952 million.Growing Market Presence and ValuationThe net asset value of Bitcoin spot ETFs has reached a noteworthy $116.044 million. The ETF net asset ratio, which compares the market value to the total Bitcoin market value, has climbed to 5.93%. This ratio reflects the increasing relevance and scale of Bitcoin spot ETFs within the broader cryptocurrency market.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734094&language=en-US",
            "pub_date": "2025-02-05 14:15:17",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734091,
            "title": "Travel platform Trivago has partnered with blockchain company Travala to enable cryptocurrency bookings",
            "description": "Odaily Planet Daily News Travel platform Trivago has partnered with blockchain-based company Travala to allow users to book accommodation with cryptocurrencies. The partnership adds Travala's inventory of more than 2.2 million properties in 230 countries to the Trivago platform. Trivago users can pay with more than 100 cryptocurrencies, including Bitcoin and Ethereum. Travala members will be directed to Trivago to complete their reservations and use its AVA smart program, which offers discounts and rewards. (TechinAsia)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734091&language=en-US",
            "pub_date": "2025-02-05 14:08:21",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734077,
            "title": "FTT rose above 2 USDT, with a 24-hour increase of 14.36%",
            "description": "Odaily Planet Daily News: Bitget market data shows that FTT has risen above 2 USDT and is currently trading at 2.06 USDT, with a 24-hour increase of 14.36%.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734077&language=en-US",
            "pub_date": "2025-02-05 14:01:08",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}