{
    "data": [
        {
            "id": 733867,
            "title": "SEC Reduces Cryptocurrency Enforcement Team Amid Regulatory Changes",
            "description": "According to PANews, the U.S. Securities and Exchange Commission (SEC) is downsizing a special unit dedicated to cryptocurrency enforcement, which previously comprised over 50 lawyers and staff. This move is among the initial steps taken by U.S. President Donald Trump and his administration to lessen regulation on cryptocurrencies and other digital assets. One of Trump's early executive orders aims to promote cryptocurrency development and reduce excessive regulation on digital assets.\n\nSources indicate that some lawyers from the cryptocurrency unit are being reassigned to other departments within the SEC. A senior lawyer from the unit has been transferred out of the enforcement division, with some insiders describing the move as an unfair demotion.\n\nCurrent SEC Acting Chairman Mark T. Uyeda has made several appointments while adjusting other senior positions within the SEC, which employs over 1,000 lawyers. One of Uyeda's initial actions was to establish a group to review the SEC's approach to digital assets. This task force is led by SEC Commissioner Hester Peirce, a vocal supporter of cryptocurrencies.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733867&language=en-US",
            "pub_date": "2025-02-05 07:03:35",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733854,
            "title": "Trump’s crypto moves could upend the public payment network",
            "description": "Custodia Bank CEO Caitlin Long says Trump's crypto moves could lead to an upending of the public payment network.\nsource: https://www.theblock.co/post/338903/trumps-crypto-moves-could-upend-the-public-payment-network?utm_source=rss&utm_medium=rss",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733854&language=en-US",
            "pub_date": "2025-02-05 06:42:46",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733853,
            "title": "Peter Thiel-backed Bullish Global considers IPO: report",
            "description": "Back in 2021, Block.one unveiled the subsidiary Bullish Global and said it had raised nearly $10 billion in funding.\nsource: https://www.theblock.co/post/338929/peter-thiel-backed-bullish-global-considers-ipo-report?utm_source=rss&utm_medium=rss",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733853&language=en-US",
            "pub_date": "2025-02-05 06:43:43",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733851,
            "title": "The Bitcoin Strategic Reserve will be declared official U.S. government policy in 80 days. \n\nNegligent of any investment or financial institution that does not front run the official announcement.",
            "description": "null\nsource: https://x.com/BTC_Archive/status/1886908956334850099",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733851&language=en-US",
            "pub_date": "2025-02-05 06:45:26",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733850,
            "title": "US SEC: Taking steps to scale back its enforcement efforts in the cryptocurrency space",
            "description": "Odaily Planet Daily News New York Times: The U.S. Securities and Exchange Commission (SEC) has taken steps to reduce its enforcement efforts in the cryptocurrency field. (Jinshi)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733850&language=en-US",
            "pub_date": "2025-02-05 06:59:30",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733849,
            "title": "NOW: 🇺🇸 Trump’s Crypto Tsar David Sacks says “It's possible that the sovereign wealth fund could decide that they want to make Bitcoin or digital assets part of its portfolio” - CNBC",
            "description": "null\nsource: https://x.com/BTC_Archive/status/1886900818919428311",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733849&language=en-US",
            "pub_date": "2025-02-05 06:13:06",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733848,
            "title": "SEC launches new cryptocurrency working group website",
            "description": "Odaily Planet Daily News: The U.S. Securities and Exchange Commission (SEC) has launched a new cryptocurrency working group website. According to the webpage, the cryptocurrency working group aims to clarify the application of federal securities laws in the crypto asset market and propose practical policy measures to promote innovation and protect investors. The Crypto Working Group works with Commission staff and the public to help develop new approaches to crypto asset regulation. The Crypto Working Group will help draw clear regulatory boundaries, appropriately distinguish between securities and non-securities, develop a tailored disclosure framework, provide a practical registration path for crypto assets and market intermediaries, ensure that investors have the information they need to make investment decisions, and ensure that law enforcement resources are wisely deployed. (Jinshi)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733848&language=en-US",
            "pub_date": "2025-02-05 06:36:40",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733846,
            "title": "Trump's SEC Crypto Task Force Reveals Plan to Get Out of Regulatory 'Mess'",
            "description": "The SEC's new crypto task force lead has unveiled a list of priorities, all while taking aim at the \"mess\" created by the previous approach.\nsource: https://decrypt.co/304395/trump-sec-crypto-task-force-priorities-mess",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733846&language=en-US",
            "pub_date": "2025-02-05 06:09:08",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733845,
            "title": "Bank Employee Allegedly Drains $2,300,000 From Bank Accounts in Massive Fraud Scheme: Report",
            "description": "A former bank employee is facing a slew of charges after being accused of lifting millions of dollars from the lender. Fedrick Jeffries is facing seven counts of identity theft, five counts of computer forgery, and one count of theft by taking for allegedly stealing $2.3 million from Fifth Third Bank in Atlanta, Georgia, FOX5 […]\nThe post Bank Employee Allegedly Drains $2,300,000 From Bank...\nsource: https://dailyhodl.com/2025/02/04/bank-employee-allegedly-drains-2300000-from-bank-accounts-in-massive-fraud-scheme-report/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733845&language=en-US",
            "pub_date": "2025-02-05 05:59:57",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733840,
            "title": "BNB Drops Below 560 USDT with a 7.76% Decrease in 24 Hours",
            "description": "On Feb 04, 2025, 21:43 PM(UTC). According to Binance Market Data, BNB has dropped below 560 USDT and is now trading at 559.690002 USDT, with a narrowed 7.76% decrease in 24 hours.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733840&language=en-US",
            "pub_date": "2025-02-05 05:43:35",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}