{
    "data": [
        {
            "id": 733461,
            "title": "Galaxy Digital Expands Staking Services Through BitGo Partnership",
            "description": "According to CoinDesk, Galaxy Digital, led by Mike Novogratz, is extending its blockchain staking services to BitGo Trust, a regulated custody specialist, despite ongoing legal disputes between the two companies. This collaboration allows Galaxy's staking and validator services, which manage over $4 billion in staked crypto assets, to be accessible to BitGo's institutional clients. This enables investors to earn staking rewards while using their assets as collateral for loans and trading on Galaxy's platform.\n\nIn early 2023, Galaxy withdrew from a deal to acquire BitGo, prompting BitGo to file a $100 million lawsuit, accusing Galaxy of breaching their May 2021 merger agreement. Despite this legal conflict, both firms issued a joint statement expressing their commitment to strategic collaboration and the potential to drive digital asset adoption, viewing the legal proceedings as a separate issue.\n\nStaking, which involves locking up crypto tokens to support blockchain operations in exchange for rewards, is a crucial aspect of the cryptocurrency ecosystem. Under U.S. President Donald Trump's pro-crypto administration, there are indications that staking will gain further prominence in the United States. Galaxy has been enhancing its non-custodial staking infrastructure, acquiring blockchain node operator CryptoManufaktur (CMF) in July of the previous year. Being included in BitGo's list of staking providers signifies full integration with secure custodial services, offering a comprehensive solution, according to Zane Glauber, head of Galaxy's Blockchain Infrastructure team.\n\nGlauber highlighted that Galaxy's unique offering lies in the enhanced products available to customers with assets in a custodial relationship. With appropriate documentation, these assets can be used as collateral within Galaxy's trading environment, allowing them to be utilized for borrowing cash or engaging in derivative strategies while also earning staking rewards.\n\nThe emergence of a crypto-friendly U.S. government raises the prospect of staking being incorporated into exchange-traded funds (ETFs) for proof-of-stake tokens like Ethereum's ether (ETH). Glauber noted that if staking is included in ETF products, fund managers must carefully consider liquidity risk. Staking involves locking assets for a set period, and in Ethereum, un-bonding queues can vary based on supply, demand, and on-chain dynamics. Financial products can help mitigate these issues by providing liquidity through access to collateral product suites.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733461&language=en-US",
            "pub_date": "2025-02-04 20:06:32",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733456,
            "title": "Coinbase accused of neglecting security, costing users up to $300M annually",
            "description": "Crypto investigators ZachXBT and tanuki42 claim Coinbase neglected security lapses that cost users more than $300 million annually.\nsource: https://cointelegraph.com/news/coinbase-accused-ignoring-security-scams?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733456&language=en-US",
            "pub_date": "2025-02-04 19:48:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733455,
            "title": "Crypto Market Rebounds Strongly Despite Tariff Wars",
            "description": "TL;DR The crypto market has shown remarkable resilience, rebounding strongly despite the ongoing tariff wars between the United States and China, with major cryptocurrencies regaining lost ground. The initial announcement of tariffs by President Trump led to significant declines and a record $2.29 billion in liquidations. Despite the initial shock, Bitcoin briefly reclaimed the $100,000 ......\nsource: https://crypto-economy.com/crypto-market-rebounds-strongly-despite-tariff-wars/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733455&language=en-US",
            "pub_date": "2025-02-04 19:51:47",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733454,
            "title": "Trump’s Crypto Czar David Sacks to Hold Key Press Conference – What to Watch\nDavid Sacks, the newly appointed AI & #Crypto Czar under President Trump, is set to hold a press conference today at 2:30 PM ET. The crypto market is on high alert, anticipating potential policy…",
            "description": "null\nsource: https://x.com/Bitcoinsensus/status/1886744987406110727",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733454&language=en-US",
            "pub_date": "2025-02-04 19:53:53",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733460,
            "title": "BTC fell below 99,000 USDT, and the 24-hour increase narrowed to 4.07%",
            "description": "OKX market shows that BTC fell below 99,000 USDT and is now at 98,993.6 USDT, with the 24-hour increase narrowed to 4.07%. (This newsletter is generated by AI)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733460&language=en-US",
            "pub_date": "2025-02-04 19:58:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733452,
            "title": "China Tariffs Fuel Bitcoin Drop – When Will Crypto Market Bounce Back?",
            "description": "The post China Tariffs Fuel Bitcoin Drop – When Will Crypto Market Bounce Back? appeared first on Coinpedia Fintech News\nThe US-China trade tension has escalated to a new peak, when Beijing has strongly retaliated against Washington’s decision to impose a 10% tariff on Chinese goods with counter-tariffs on US imports. Notably, even though Bitcoin earlier benefited from US President Donald...\nsource: https://coinpedia.org/news/china-tariffs-fuel-bitcoin-drop-when-will-crypto-market-bounce-back/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733452&language=en-US",
            "pub_date": "2025-02-04 19:37:29",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733451,
            "title": "US Sovereign Wealth Fund dashes hopes of Strategic Bitcoin Reserve",
            "description": "Hopes of a US Strategic Bitcoin Reserve took another knock after Donald Trump’s executive order about a non-bitcoin US Sovereign Wealth Fund.\nThe post US Sovereign Wealth Fund dashes hopes of Strategic Bitcoin Reserve appeared first on Protos.\nsource: https://protos.com/us-sovereign-wealth-fund-dashes-hopes-of-strategic-bitcoin-reserve/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733451&language=en-US",
            "pub_date": "2025-02-04 19:42:37",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733453,
            "title": "A whale bought 6.688 million MELANIA at an average price of $1.5",
            "description": "According to the monitoring of on-chain analyst Yu Jin, a whale withdrew 10.007 million USDC from Binance 2 hours ago and bought 6.688 million MELANIA on the chain at an average price of $1.5. This address has become the second largest currency holding address besides the project party/liquidity/trading platform address.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733453&language=en-US",
            "pub_date": "2025-02-04 19:45:28",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733447,
            "title": "Ethereum Traders Buy the Dip as Solana Stablecoins Soar. Will $BEST Go Bullish?",
            "description": "Ethereum saw some huge selling in the early trading hours of Monday as it dipped below the $2.1K mark – a 25% dip from its opening price that day. This fall was a result of whale wallets liquidating their positions in $ETH. For instance, two dormant wallets sent $149M and $201M worth of $ETH to Bitfinex. These wallets were last active in 2019 when a withdrawal of 77,736 $ETH was made. Aave...\nsource: https://www.newsbtc.com/news/ethereum-traders-buy-the-dip-as-solana-stablecoins-soar-will-best-go-bullish/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733447&language=en-US",
            "pub_date": "2025-02-04 19:25:01",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733446,
            "title": "Spotify’s Stock Gains on Strong Q4 Earnings, First Full Year of Profitablity",
            "description": "Spotify reported robust fourth-quarter earnings in 2024, marking a milestone with its first full year of profitability.\nThe post Spotify’s Stock Gains on Strong Q4 Earnings, First Full Year of Profitablity appeared first on Tokenist.\nsource: https://tokenist.com/spotifys-stock-gains-on-strong-q4-earnings-first-full-year-of-profitablity/?utm_source=rss&utm_medium=rss&utm_campaign=spotifys-stock-gains-on-strong-q4-earnings-first-full-year-of-profitablity",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733446&language=en-US",
            "pub_date": "2025-02-04 19:28:53",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}