{
    "data": [
        {
            "id": 734676,
            "title": "FDIC releases 790 pages of crypto-related letters in regulatory pivot",
            "description": "“The FDIC also looks forward to engaging with the President’s Working Group on Digital Asset Markets,” acting chairman Travis Hill wrote.\nsource: https://cointelegraph.com/news/fdic-releases-790-pages-crypto-letters-regulatory?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734676&language=en-US",
            "pub_date": "2025-02-06 01:00:27",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734675,
            "title": "US Debt Crisis and Interest Rates Threaten Bitcoin’s 2025 Rally",
            "description": "The cryptocurrency landscape, particularly Bitcoin, is facing significant volatility in 2025, driven by the looming maturation of a staggering $9.2 trillion in US government debt.\nThe post US Debt Crisis and Interest Rates Threaten Bitcoin’s 2025 Rally appeared first on Cryptodnes.\nsource: https://cryptodnes.bg/en/us-debt-crisis-and-interest-rates-threaten-bitcoins-2025-rally/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734675&language=en-US",
            "pub_date": "2025-02-06 01:00:37",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734674,
            "title": "$BTC Volatility has been relatively low the past couple of weeks.\n\nEspecially looking at the start of 2024 when price first visited the ~$70K price region.\n\nSince then, we've seen volatility slowly dwindle down as price has been creeping higher this cycle.",
            "description": "null\nsource: https://x.com/DaanCrypto/status/1887184663036227853",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734674&language=en-US",
            "pub_date": "2025-02-06 01:01:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734673,
            "title": "Bitcoin analyst predicts BTC will hit this price as bullish pattern unfolds",
            "description": "Bitcoin (BTC) and altcoins have been caught in sharp market swings following a steep crash earlier this week, driven by … Continue reading\nThe post Bitcoin analyst predicts BTC will hit this price as bullish pattern unfolds appeared first on Finbold.\nsource: https://finbold.com/bitcoin-analyst-predicts-btc-will-hit-this-price-as-bullish-pattern-unfolds/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734673&language=en-US",
            "pub_date": "2025-02-06 01:02:24",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734667,
            "title": "XION Mainnet Event Promethean Saga Official Version Launched",
            "description": "Odaily Planet Daily News XION announced the mainnet event Promethean Saga and will launch a week-long \"Believers Assemble\" recommendation to win points competition. It is reported that Promethean Saga is a chain event lasting several months, which will feature daily exploration, leaderboards and competitions between the community and developers, and explore XION's technological breakthroughs and ecosystem expansion. In addition, XION also plans to turn the application of the Believathon entrepreneurial competition to the mainnet in the coming weeks and months. XION's previously launched Promethean Saga early access version also broke the 150,000 mark in DAU recently.\nXION is a wallet-free L1 blockchain designed for consumer popularization through chain abstraction technology. By implementing account abstraction, signature abstraction, fee abstraction, interoperability and other functions at the protocol layer, XION enables developers to create a secure, intuitive and seamless user experience. Previously, the project has raised more than US$36 million from investment institutions such as Multicoin, Animoca, Circle, Hashkey, Arrington Capital, and Spartan.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734667&language=en-US",
            "pub_date": "2025-02-06 00:51:06",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734666,
            "title": "On February 5, the US Bitcoin ETF had a net inflow of 2,549 BTC, and the Ethereum TEF had a net inflow of 122,556 ETH",
            "description": "Odaily Planet Daily News According to Lookonchain monitoring, on February 5, ten US Bitcoin ETFs had a net inflow of 2,549 BTC (US$248.57 million), of which BlackRock had an inflow of 2,524 BTC (US$246.16 million). BlackRock currently holds 585,398 BTC, equivalent to approximately US$57.09 billion;\nNine Ethereum TEFs had a net inflow of 122,556 ETH (US$336.54 million), of which BlackRock had an inflow of 100,535 ETH (US$276.07 million). BlackRock currently holds 1,352,934 ETH, equivalent to approximately US$3.71 billion.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734666&language=en-US",
            "pub_date": "2025-02-06 00:57:33",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734665,
            "title": "Coinbase to List Ether.fi (ETHFI)",
            "description": "Odaily Planet Daily News According to Coinbase Assets’ announcement on the X platform, Coinbase will add support for Ether.fi (ETHFI) on the Ethereum network (ERC-20 token). If liquidity conditions are met, trading will begin on or after 9 a.m. (Pacific Time) on February 6, 2025. Once the supply of the asset is sufficient, the ETHFI-USD trading pair will be launched in stages. Support for ETHFI may be limited in some supported jurisdictions.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734665&language=en-US",
            "pub_date": "2025-02-06 00:58:34",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734664,
            "title": "BlackRock May Launch Bitcoin ETF In Europe",
            "description": "According to Odaily, Bloomberg analyst James Seyffart shared on the X platform that his colleague Emily Nicolle from Bloomberg News revealed that BlackRock might introduce a Bitcoin ETF in Europe. It is speculated that they will follow the same strategy used in Canada.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734664&language=en-US",
            "pub_date": "2025-02-06 00:43:42",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734663,
            "title": "ZachXBT: Entrepreneur Mohammad Dewji MO’s X account was compromised",
            "description": "Odaily Planet Daily News According to Lookonchain’s previous monitoring, Tanzanian businessman and entrepreneur Mohammed Dewji MO (@moodewji) posted on the X platform that he launched the TANZANIA token and sold it to investors for a profit of $1.48 million, and then deleted all related tweets. However, \"chain detective\" ZachXBT said that Mohammad Dewji MO's X account had been stolen, so he posted tweets about related tokens.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734663&language=en-US",
            "pub_date": "2025-02-06 00:45:57",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734662,
            "title": "Berachain Airdrop Checker is now live",
            "description": "Odaily Planet Daily News According to official news, the Berachain airdrop checker is now online, and tokens can be collected using EVM wallets (including Metamask, OKX Wallet, etc.) on February 6, 2025.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734662&language=en-US",
            "pub_date": "2025-02-06 00:48:36",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}