{
    "data": [
        {
            "id": 1053042,
            "title": "The US XRP spot ETF saw a total net inflow of $2.2052 million in a single day.",
            "description": "According to SoSoValue data, the XRP spot ETF saw a total net inflow of $2.2052 million yesterday (February 27th, Eastern Time). Only the Franklin XRP ETF (XRPZ) saw net inflows yesterday, with a single-day net inflow of $2.2052 million, bringing its total historical net inflow to $333 million. As of press time, the XRP spot ETF's total net asset value is $983 million, with an XRP net asset ratio of 1.19%, and a historical cumulative net inflow of $1.24 billion.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053042&language=en-US",
            "pub_date": "2026-02-28 09:56:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053043,
            "title": "US Senate Postpones CLARITY Act Amid Crypto Regulation Disputes",
            "description": "The U.S. Senate has postponed the CLARITY Act, a proposed bill aimed at regulating the cryptocurrency market, due to ongoing disagreements between banking institutions and the crypto industry. According to NS3.AI, the primary contention revolves around whether stablecoin holders should be allowed to earn interest, with banks advocating for stringent restrictions while crypto companies resist such measures. Further disputes include regulations on exchange incentives, the responsibilities of DeFi developers, and the extent of regulatory authority.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053043&language=en-US",
            "pub_date": "2026-02-28 10:03:09",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053039,
            "title": "OpenAI Reports Significant Growth in ChatGPT User Base",
            "description": "OpenAI has announced a substantial increase in the daily active users of its ChatGPT platform, which has now surpassed 900 million. According to PANews, the number of paid subscribers has reached 50 million. This growth highlights the expanding popularity and adoption of ChatGPT among users worldwide.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053039&language=en-US",
            "pub_date": "2026-02-28 09:43:58",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053038,
            "title": "GEOPOLITICS | Southeast Asia Faces Dilemma After U.S. Supreme Court Tariff Ruling",
            "description": "U.S. President Donald Trump's recent Supreme Court defeat regarding tariffs has presented a challenging decision for Southeast Asian leaders. Bloomberg posted on X, highlighting the dilemma these leaders face: whether to renegotiate existing trade agreements or to step back from current negotiations. The ruling has significant implications for international trade dynamics, particularly affecting the economic strategies of Southeast Asian nations. As these countries weigh their options, the decision could impact regional trade relations and economic policies.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053038&language=en-US",
            "pub_date": "2026-02-28 09:44:11",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053037,
            "title": "NASDAQ Files to List VanEck $JITOSOL Staking ETF",
            "description": "Scott Melker, host of The Wolf Of All Streets Podcast, posted on X about NASDAQ's recent filing to list VanEck's $JITOSOL Staking ETF. This move marks a significant development in the crypto investment landscape, offering investors new opportunities in staking ETFs. The filing indicates growing interest and acceptance of crypto-related financial products in traditional markets.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053037&language=en-US",
            "pub_date": "2026-02-28 09:44:46",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053036,
            "title": "Anthropic to Contest Supply Chain Risk Designation in Court",
            "description": "Anthropic has announced its intention to legally challenge any designation of supply chain risk. Bloomberg posted on X that the company has not received any direct communication from the Department of War or the White House regarding the status of negotiations. Anthropic remains firm in its stance to contest any such designation in court.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053036&language=en-US",
            "pub_date": "2026-02-28 09:47:34",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053029,
            "title": "U.S. President Trump Orders Federal Agencies to Cease Using Anthropic Technology",
            "description": "U.S. President Donald Trump has directed all federal agencies to immediately halt the use of Anthropic's technology. According to BlockBeats, Trump announced on Truth Social that the government neither needs nor wants Anthropic's products and will cease business with the company. Agencies currently utilizing Anthropic's technology, such as the Department of Defense, will have a six-month phase-out period. Trump emphasized that Anthropic must cooperate during this transition, warning that failure to do so could result in significant civil and criminal consequences, with the full power of the presidency being used to enforce compliance.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053029&language=en-US",
            "pub_date": "2026-02-28 09:39:16",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053028,
            "title": "Institutional Entity Accumulates HYPE Tokens Through Galaxy Digital",
            "description": "An unidentified institutional entity has been actively purchasing HYPE tokens through Galaxy Digital's over-the-counter (OTC) desk. According to NS3.AI, this accumulation has been ongoing for 18 days, resulting in a total holding of 540,337 HYPE tokens, valued at approximately $14.86 million. This consistent buying activity suggests a significant institutional interest in HYPE.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053028&language=en-US",
            "pub_date": "2026-02-28 09:41:43",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053027,
            "title": "Stablecoin Negotiations Face Uncertainty Amid Industry Defense",
            "description": "Cryptocurrency journalist Eleanor Terrett reports that several figures in the crypto industry have publicly defended Patrick Witt and the White House's stance following anonymous claims of pessimism regarding stablecoin yield negotiations. According to ChainCatcher, a banking industry insider directly familiar with the negotiations stated that representatives from ABABankers, ICBA, and the Bank Policy Institute, who attended a White House meeting last week, were confused by the anonymous claims and disagreed with the perspective. They have communicated their concerns to the White House.\n\nThe insider also noted that both parties are still in ongoing discussions about the bill's text, and the March 1 deadline is not a definitive cutoff date.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053027&language=en-US",
            "pub_date": "2026-02-28 09:42:21",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053024,
            "title": "Anthropic Challenges Legal Precedent in Government Negotiations",
            "description": "Anthropic has expressed concerns over a recent legal determination, arguing that it lacks a solid legal foundation. According to Jin10, the company believes that this decision could set a dangerous precedent for any U.S. company engaged in negotiations with the government. Anthropic's stance highlights the potential implications for future corporate-government interactions.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053024&language=en-US",
            "pub_date": "2026-02-28 09:23:51",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053022,
            "title": "Planet Morning News",
            "description": "1. Tether's secondary market valuation reached a peak of $375 billion, potentially making its largest shareholder richer than Warren Buffett; 2. SEC Chairman: The US missed the window of opportunity for crypto regulation and is accelerating the modernization of its rules; 3. White House AI and Crypto Director: The crypto industry has made concessions on stablecoin yields, and banks should respond; 4. Trump calls on the Supreme Court to review or re-examine his tariff policy case; 5. Morgan Stanley applies for a banking license to expand its digital asset custody and staking business; 6. Vitalik Buterin outlines Ethereum's scaling plan, covering short-term gas optimization and long-term phased deployment of ZK-EVM; 7. Minnesota proposes a bill to completely ban cryptocurrency ATMs; 8. Jack Dorsey's Blocks company adds 340 BTC, worth $22 million; 9. Paradigm plans to raise up to $1.5 billion to establish a new fund, investing in cutting-edge fields such as AI and robotics; 10. JPYC, the issuer of the Japanese yen stablecoin, completes a deal... 11. OpenAI and Amazon announce strategic partnership; Amazon will invest $50 billion in OpenAI. 12. The Korean National Tax Service suffered a $4.8 million theft after leaking a mnemonic phrase in a press release.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053022&language=en-US",
            "pub_date": "2026-02-28 09:30:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053023,
            "title": "U.S. Health Secretary Appoints New Members to Vaccine Committee",
            "description": "U.S. Health Secretary Robert F. Kennedy Jr. has appointed two new members to a key vaccine committee tasked with shaping the country's immunization policy. Bloomberg posted on X, highlighting the significance of these appointments in influencing national health strategies. The committee plays a crucial role in advising on vaccine-related matters, impacting public health decisions across the United States. The new members are expected to bring fresh perspectives to the committee's ongoing efforts to enhance immunization practices and policies.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053023&language=en-US",
            "pub_date": "2026-02-28 09:30:44",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053020,
            "title": "White House Pushes for Crypto and Banking Sector Compromise",
            "description": "David Sacks, the White House AI and Crypto Affairs Director, has disclosed efforts to mediate between banks and the cryptocurrency industry. According to NS3.AI, Patrick Witt is leading initiatives to establish market structure legislation. Sacks highlighted that the crypto sector has made significant concessions concerning stablecoin yield regulations, urging the banking industry to respond constructively to these changes.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053020&language=en-US",
            "pub_date": "2026-02-28 09:18:18",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053019,
            "title": "U.S. Stock Market and Cryptocurrency Sector Experience Declines",
            "description": "The U.S. stock market ended the trading session with losses across major indices, including the Dow Jones, S&P 500, and Nasdaq. According to NS3.AI, the cryptocurrency sector also faced declines, with significant drops in tokens such as UPXI, BNC, ETHZ, BMNR, and ABTC. Meanwhile, Msx.com, a decentralized RWA trading platform, continues to list a variety of tokenized U.S. stocks and ETFs.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053019&language=en-US",
            "pub_date": "2026-02-28 09:18:33",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053018,
            "title": "Launch: DeepSeek to Release Multimodal Language Model V4 Next Week",
            "description": "DeepSeek is set to unveil its latest large language model, V4, next week. According to Jin10, this new model is described as 'multimodal,' featuring capabilities for generating images, videos, and text. The release marks a significant advancement in the field of artificial intelligence, offering enhanced functionalities for diverse applications. The model's ability to process and produce various forms of media is expected to broaden its usability across different sectors. This development highlights the ongoing innovation in AI technology, as companies continue to push the boundaries of what these models can achieve.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053018&language=en-US",
            "pub_date": "2026-02-28 09:21:16",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053017,
            "title": "Anthropic Attempts Agreement with U.S. Department of Defense",
            "description": "Anthropic, a company focused on AI safety, has made a good-faith effort to reach an agreement with the U.S. Department of Defense. According to Jin10, the company aims to collaborate on projects that align with its mission of ensuring AI technologies are developed and used responsibly. This move reflects Anthropic's commitment to working with government entities to address potential risks associated with artificial intelligence. The discussions are part of a broader initiative to integrate AI advancements into national defense strategies while maintaining ethical standards. Anthropic's approach highlights the importance of cooperation between tech companies and government agencies in navigating the complexities of AI deployment.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053017&language=en-US",
            "pub_date": "2026-02-28 09:22:27",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053003,
            "title": "White House AI and Crypto Director: The crypto industry has made concessions on stablecoin yields; banks should respond.",
            "description": "David Sacks, the White House's director for AI and crypto affairs, stated on social media that Patrick Witt is pushing for compromise between the banking and crypto industries and actively working to enact market structure legislation. Sacks noted that the crypto industry has made significant concessions on stablecoin yields and called for a corresponding response from banks.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053003&language=en-US",
            "pub_date": "2026-02-28 09:05:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053002,
            "title": "JPYC, the issuer of the Japanese yen stablecoin, has completed a Series B funding round of approximately $12 million, led by Asteria.",
            "description": "JPYC, the issuer of the Japanese yen stablecoin, announced the completion of its Series B funding round, raising approximately 1.78 billion yen (about US$12 million). The round was led by Japanese IT solutions provider Asteria, with participation primarily from Japanese companies and funds, and BitFlyer Holdings also investing. JPYC is scheduled to officially launch in October 2025 under Japan's regulatory framework for money transfers, positioning itself as an onshore yen stablecoin. The company has partnered with Densan Systems, which has a payment network covering approximately 65,000 convenience stores in Japan, to explore applications for domestic payments, cross-border remittances, and travel payments within convenience store settings. Furthermore, JPYC is also involved in Circle's StableFX stablecoin foreign exchange quotation system for cross-border settlements. (Ledger Insights)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053002&language=en-US",
            "pub_date": "2026-02-28 09:06:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053006,
            "title": "Donald Trump Hosts High-Value Fundraising Dinner at Mar-a-Lago",
            "description": "U.S. President Donald Trump is hosting a fundraising dinner at his Mar-a-Lago estate, with tickets priced at $1 million per attendee. New York Times posted on X, highlighting the event as part of Trump's efforts to bolster his super PAC. The dinner is expected to attract high-profile donors and supporters, reflecting the ongoing financial strategies employed by Trump's political team. The event underscores the significant financial backing Trump continues to receive from his base, as he navigates the political landscape.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053006&language=en-US",
            "pub_date": "2026-02-28 09:06:13",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053001,
            "title": "SoFi, the first crypto-chartered bank in the US, launches Solana online deposit functionality.",
            "description": "SoFi, the first crypto-licensed bank in the United States, has announced support for Solana network deposits. Users can now deposit Solana network assets directly through its banking app.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053001&language=en-US",
            "pub_date": "2026-02-28 09:08:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}