{
    "data": [
        {
            "id": 733433,
            "title": "Laton Ventures Secures $50 Million For Global Investment In Gaming Startups",
            "description": "According to Odaily, Turkish venture capital firm Laton Ventures has successfully raised $50 million to invest globally in seed and pre-seed stage gaming and application startups. The firm has clarified that the funds will not be allocated to Web3 or cryptocurrency-related business models. Last April, Laton Ventures launched a $35 million global gaming venture fund, emphasizing the significance of artificial intelligence and Web3 technologies in gaming.\n\nLaton Ventures' investment portfolio includes mobile gaming studios and innovative social gaming platforms. The fund's investors comprise over 40 prominent entrepreneurs and senior executives from the gaming and technology sectors across more than 10 countries, including founders or former executives from companies like Peak, Gram, Loop, and Huuuge. Additionally, major corporations such as Supercell, the developer of 'Clash of Clans,' and Tibas Ventures, the venture capital arm of Turkey's largest private bank İş Bankası, along with several institutional investors and family offices, have supported the fund.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733433&language=en-US",
            "pub_date": "2025-02-04 19:17:31",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733432,
            "title": "Cipher Mining Reports January Bitcoin Production And Sales",
            "description": "According to BlockBeats, on February 4, Nasdaq-listed Bitcoin mining company Cipher Mining released its unaudited operational report for January 2025. The report revealed that the company produced 219 BTC in January and sold 471 BTC. Currently, Cipher Mining's total Bitcoin holdings have reached 1,091 BTC, which includes approximately 325 BTC used as collateral.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733432&language=en-US",
            "pub_date": "2025-02-04 19:23:37",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733430,
            "title": "THORChain Converts Debt Into Equity Amid Liquidity Challenges",
            "description": "According to Cointelegraph, decentralized liquidity protocol THORChain has taken significant steps to address its liquidity issues by converting its defaulted debt into equity. On January 23, THORChain halted its lending and savers programs for Bitcoin (BTC) and Ether (ETH) to avert an insolvency crisis and restructure its debt. The platform paused ThorFi redemptions for 90 days, allowing the community to devise a stabilization plan.\n\nFollowing this suspension, the THORChain community proposed various restructuring plans to ensure the network's continued operation while compensating affected users. On February 2, the platform's node operators approved a proposal to convert its defaulted debt into tokens representing equity in the platform. This plan involves minting 200 million 'TCY' tokens and distributing them to affected users, with each token representing $1 of the platform's debt. The new token will receive 10% of the network's revenue indefinitely, providing users with the opportunity to claim one TCY per dollar owed. Maya Protocol's Aaluxx Myth, the pseudonymous author of the proposal, explained that TCY holders would receive 10% of fees in perpetuity, paid out in RUNE every 24 hours, similar to $MAYA, offering uncapped upside potential for new liquidity to bail out users. Risk-averse users can sell the RUNE to any asset of their choosing daily.\n\nAdditionally, the THORChain treasury plans to create a liquidity pool, allowing tokenholders to sell their claims at their discretion. The platform stated that this plan enables creditors to exit on their own terms as market demand for THORChain's revenue materializes in the token's price. While the protocol has established its plan, it is still finalizing the timeline and specifics.\n\nDespite the restructuring plan's intentions to repay investors, some community members have expressed concerns. One community member commented on X that the plan is complex and would require additional investment and trust in THORChain, which has a history of mismanaging money and trust. The user noted that new capital entering is 'permanently taxed' under the plan. Furthermore, the issuance of a new token granting holders 10% of the platform's revenue has raised questions about whether it qualifies as an unregistered security, potentially leading to legal action against THORChain. Another community member expressed skepticism about the tokens receiving revenue indefinitely, suggesting it might only last until the platform changes its policy. Cointelegraph reached out to THORChain for comment but had not received a response by the time of publication.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733430&language=en-US",
            "pub_date": "2025-02-04 19:13:37",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733425,
            "title": "XRP Shows Bullish Signs Amid Global Economic Concerns",
            "description": "According to CoinDesk, the outlook for alternative cryptocurrencies remains uncertain compared to bitcoin, as the possibility of a renewed trade war between the United States and its major trading partners looms, potentially destabilizing the global economy. Despite this, some cryptocurrencies are showing promising signs of growth.\n\nOne such example is the XRP/BTC ratio, which is indicating a potential bullish trend. For the first time since 2017, the ratio is approaching a move above the upper Bollinger band on the monthly chart. This development suggests a possible significant bull run for XRP. Bollinger bands are volatility indicators that are set two standard deviations above and below a 20-period simple moving average of an asset's price. A break above the upper band typically signals a bullish market imbalance, with prices often maintaining upward momentum for several days.\n\nTraders who analyze price patterns often enter long positions when prices surpass the upper band, interpreting it as a sign of bullish market conditions. Breakouts that occur after extended periods of consolidation between the bands are generally considered more reliable. Notably, the XRP/BTC ratio experienced a nearly 200% surge following a Bollinger band breakout in April 2017, which resolved a period of low volatility trading with a bullish outcome. Observers are now watching to see if history will repeat itself in the current market climate.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733425&language=en-US",
            "pub_date": "2025-02-04 19:03:35",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733424,
            "title": "Howard Lutnick Faces Scrutiny Over Tether Investments During Senate Hearing",
            "description": "According to CoinDesk, Howard Lutnick, chairman of Cantor Fitzgerald and U.S. President Donald Trump's nominee for U.S. Commerce Secretary, recently faced intense questioning from Senate Democrats regarding Cantor Fitzgerald's involvement with Tether, the issuer of the world's largest stablecoin, USDT. Lutnick appeared before the Senate Committee on Commerce, Science, and Transportation on January 29, following his testimony at the Senate Banking Committee.\n\nCantor Fitzgerald acts as Tether's primary custodian for U.S. Treasuries, managing a substantial portion of its reserves and holding convertible debt issued by Tether's parent company. The reserves backing USDT have long been a concern within the crypto industry. In 2023, Lutnick attempted to alleviate these concerns by associating Cantor's reputation with Tether, asserting that as its custodian, he was confident in Tether's financial backing. However, during the hearing, Lutnick appeared to temper his previous statements.\n\nLutnick stated, \"Cantor Fitzgerald is not conducting continuous diligence on Tether’s financial statements, but I believe my statements were accurate when made,\" retracting his earlier assertion that \"Tether has every penny, and it can produce liquidity on a moment’s notice.\" On Polymarket, bettors currently assign a 10% probability of Tether becoming insolvent in 2025 and a 14% chance of it de-pegging during the year, indicating potential issues at the issuer. A contract regarding insolvency for 2024 averaged around 4% in the last quarter of the year.\n\nLutnick also confirmed that \"Cantor Fitzgerald made a convertible debt investment in the holding company that owns the Tether stablecoin business in April 2024,\" clarifying that this does not imply an ownership stake in the stablecoin issuer. \"Cantor Fitzgerald’s debt investment in Tether does not constitute an equity interest,\" he stated, dismissing concerns about deeper ties between the brokerage firm and Tether.\n\nCritics of Tether often call for an audit of the company's financial records due to USDT's significant role in the broader crypto ecosystem. While Lutnick acknowledged the necessity of such audits for U.S. dollar stablecoin issuers, he refrained from demanding one for Tether. When questioned about advocating for an independent audit within three months, he responded, \"Upon my confirmation as Secretary of Commerce, I will faithfully execute my duties consistent with applicable government ethics laws and regulations.\"\n\nAddressing concerns about his influence on crypto regulation, Lutnick denied allegations of pledging to \"defuse threats\" against Tether. \"I have never suggested to anyone that I would do anything improper with respect to Tether,\" he stated, cautioning that \"the U.S. Congress should be careful not to undermine dollar hegemony on blockchain through legislation.\"",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733424&language=en-US",
            "pub_date": "2025-02-04 19:03:46",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733423,
            "title": "Laton Ventures completes $50 million fundraising, focusing on game and application investment",
            "description": "Odaily Planet Daily News Turkish venture capital fund Laton Ventures announced the completion of $50 million in fundraising, which will be invested globally in seed and pre-seed stage game and application startups. After completing the latest round of fundraising, the fund made it clear that the relevant funds will not be used for Web3 or cryptocurrency-related business models. It is reported that in April last year, Laton Ventures launched a $35 million global game venture capital fund, focusing on the importance of artificial intelligence and Web3 technology in games. Laton Ventures' investment portfolio covers mobile game studios and innovative social game platforms. Its investors include more than 40 well-known game and technology industry entrepreneurs and senior executives from more than 10 countries, such as founders or former executives of Peak, Gram, Loop and Huuuge. In addition, large companies such as Supercell (developer of \"Clash of Clans\"), Tibas Ventures (the venture capital department of İş Bankası, Turkey's largest private bank), and a number of institutional investors and family offices also support the fund.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733423&language=en-US",
            "pub_date": "2025-02-04 19:02:26",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733417,
            "title": "Ethereum Is Trash, Convinced Peter Brandt, But There's a Catch",
            "description": "Veteran trader Peter Brandt trashes Ethereum and gives two scenarios for Bitcoin\nsource: https://u.today/ethereum-is-trash-convinced-peter-brandt-but-theres-a-catch",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733417&language=en-US",
            "pub_date": "2025-02-04 18:34:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733416,
            "title": "Sol Strategies Bought $10M Worth of Solana Token – SOL Price Soars 7%",
            "description": "The post Sol Strategies Bought $10M Worth of Solana Token – SOL Price Soars 7% appeared first on Coinpedia Fintech News\nCanadian publicly traded company Sol Strategies announced the purchase of an additional 40,300 SOL tokens. This latest purchase, valued at approximately CAD 14.3 million ($9.9 million), comes at an average price of CAD 355.77 ($246.53) per SOL. In the meantime, Solana native...\nsource: https://coinpedia.org/news/sol-strategies-bought-10m-worth-of-solana-token-sol-price-soars-7/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733416&language=en-US",
            "pub_date": "2025-02-04 18:36:22",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733415,
            "title": "Telegram’s TON exclusivity ‘not a limitation but a necessity’ — Steve Yun",
            "description": "Steve Yun, founder of the TON-focused $100 million fund, TVM Ventures, is bullish on TON despite the Toncoin market cap dropping by 64% since April 2024.\nsource: https://cointelegraph.com/news/telegram-ton-exclusive-web3-blockchain?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733415&language=en-US",
            "pub_date": "2025-02-04 18:39:01",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733414,
            "title": "Trump topples crypto markets with tariff gambit",
            "description": "A summarizing review of what has been happening at the crypto markets of the past week. A weekly report in cooperation with Kaiko.\nsource: https://cryptovalleyjournal.com/markets/market-review/trump-topples-crypto-markets-with-tariff-gambit/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733414&language=en-US",
            "pub_date": "2025-02-04 18:42:04",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}