{
    "data": [
        {
            "id": 734070,
            "title": "Thailand SEC Plans DLT-Based Debt Trading System",
            "description": "According to Odaily, the Thailand Securities and Exchange Commission (SEC) is preparing to implement a Distributed Ledger Technology (DLT)-based debt instrument trading system. The initiative aims to encourage securities companies to engage in digital token trading. SEC Deputy Secretary-General Jomkwan Kongsakul stated that the regulatory body has approved four digital token projects and is evaluating two more, focusing on green tokens and investment-driven plans.\n\nKongsakul explained that purchasing bonds from the primary market currently takes 7-14 days before they can be traded in the secondary market. Investors face challenges such as limited access to certain products and high costs with low liquidity for some bonds. Issuers also deal with extensive manual paperwork, leading to delays and errors. Utilizing DLT is expected to enhance efficiency, streamline processes, and address obstacles in the capital markets.\n\nThe SEC aims to fully digitize the bond trading system in both primary and secondary markets, covering settlement, trading, investor registration, and return payments. Kongsakul assured that competition will remain open, allowing companies with their own DLT infrastructure to establish independent chains, provided they ensure interoperability within unified standards. Other companies can access the SEC's public chain at an affordable cost. Looking ahead, multiple trading chains may emerge, all interconnected through shared ledgers, with completion anticipated soon.\n\nExisting financial products will be retained but converted into digital equivalents to facilitate smooth transactions on the DLT network. This approach promotes fractional trading at lower costs and enhances liquidity by introducing more participants, enabling real-time trading and reducing settlement issues.\n\nAdditionally, the SEC is developing the SEC Open API data platform to provide comprehensive data on all listed companies, aiding investors in better analysis and more informed investment decisions.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734070&language=en-US",
            "pub_date": "2025-02-05 13:43:55",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734068,
            "title": "Bitcoin ETFs See Explosive Growth as Institutional Investors Pour In",
            "description": "The post Bitcoin ETFs See Explosive Growth as Institutional Investors Pour In appeared first on Coinpedia Fintech News\nBitcoin’s climb past $100,000 was short-lived as U.S.-China trade tensions resurfaced, triggering market uncertainty. While prices briefly rebounded after President Donald Trump announced a 30-day delay on new tariffs, some analysts warn that Bitcoin could still face a...\nsource: https://coinpedia.org/news/bitcoin-etfs-see-explosive-growth-as-institutional-investors-pour-in/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734068&language=en-US",
            "pub_date": "2025-02-05 13:33:53",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734067,
            "title": "Encrypted collaboration terminal project Herd completes $1.8 million Pre-Seed round of financing, led by Semantic Ventures",
            "description": "Odaily Planet Daily News According to official news, the encrypted collaborative terminal project Herd announced the completion of a $1.8 million Pre-Seed round of financing, led by Semantic Ventures, with participation from Archetype and Hardi Meybaum. \nHerd is building a collaborative terminal (coterminal) for contracts, allowing users to work with agents to combine existing on-chain contracts into off-chain and on-chain outputs.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734067&language=en-US",
            "pub_date": "2025-02-05 13:39:01",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734066,
            "title": "Cryptocurrency phishing scams caused losses of $10.25 million in January, mostly to Ethereum network users",
            "description": "Odaily Planet Daily News Blockchain security company Scam Sniffer reported that cryptocurrency phishing scams stole $10.25 million from 9,220 victims in January, a 56% drop from the $23.58 million loss in December. However, the report pointed out that criminals are constantly evolving and adopting more sophisticated attack methods. According to Scam Sniffer data, Ethereum network users are the most affected by phishing scams, accounting for more than 80% of the stolen funds. Losses on Ethereum exceeded $8.6 million, while BNB Chain and Arbitrum users lost $710,000 and $572,000, respectively. Polygon and Optimism also lost approximately $191,000 and $82,000, respectively. (Cryptoslate)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734066&language=en-US",
            "pub_date": "2025-02-05 13:41:19",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734057,
            "title": "Google boss expects to spend $75B on AI this year",
            "description": "Google CEO Sundar Pichai says his firm will spend about $75 billion on capital expenditures in 2025 — most of which is expected to head into AI projects.\nsource: https://cointelegraph.com/news/google-expects-spend-75-billion-ai-2025?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734057&language=en-US",
            "pub_date": "2025-02-05 13:24:20",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734056,
            "title": "Polymarket predicts that the probability of \"the United States establishing a national Bitcoin reserve in 2025\" has risen to 47%",
            "description": "Odaily Planet Daily News Polymarket predicts that the probability of \"the United States establishing a national Bitcoin reserve in 2025\" has risen to 47%. The cumulative bet amount for this prediction is currently $687,000, and the deadline is December 31, 2025.\nThe judgment criteria are that the US government holds any amount of Bitcoin in its reserves, excluding Bitcoin confiscated by the US government. The main source of judgment will be official information from the US government or the Federal Reserve, and will also refer to credible reports with consensus recognition.\nEarlier today, David Sacks, director of AI and cryptocurrency at the White House, said at a press conference in Washington on Tuesday about potential Bitcoin reserves: \"This is one of the top issues we will consider as a working group within the government. We are still waiting for some cabinet members in the working group to be confirmed, so it is still in a very early stage. But this is one of the top issues we have to consider.\"",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734056&language=en-US",
            "pub_date": "2025-02-05 13:24:39",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734055,
            "title": "Planet Lunch News",
            "description": "1. Yesterday, the US Bitcoin spot ETF had a net inflow of US$342.08 million;\n2. Yesterday, the US Ethereum spot ETF had a net inflow of US$316.53 million;\n3. Hester Peirce: The Cryptocurrency Working Group intends to recommend that the SEC take action to provide temporary forward-looking and retroactive relief for token issuance;\n4. Bullish, supported by Peter Thiel, plans to IPO this year and is negotiating with Jefferies Group for potential listing;\n5. Coinbase Chief Legal Officer urges the SEC to immediately submit documents related to the ETH 2.0 investigation;\n6. Berachain Ecosystem Meme Coin Project Henlo Completes US$3 Million Seed Round of Financing, with Framework Ventures and others participating;\n7. Report: Bitcoin has achieved a market value of US$850 billion and has become a global macro asset that many countries and institutions are paying attention to;\n8. MicroStrategy is recruiting a new director of capital markets to be responsible for equity, convertible debt and preferred stock issuance;\n9. David Sacks: Crypto regulation is expected to be completed in the next six months;\n10. Stripe completed the $1.1 billion acquisition of Bridge and absorbed its team;\n11. Arkham updated Satoshi Nakamoto's holding address, and the current holding value is about $107.46 billion.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734055&language=en-US",
            "pub_date": "2025-02-05 13:30:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734054,
            "title": "Thailand SEC adopts DLT to reform digital token and bond trading",
            "description": "Odaily Planet Daily News The Securities and Exchange Commission (SEC) of Thailand is preparing to deploy a DLT-based debt instrument trading system, with the main goal of encouraging securities companies to engage in digital token trading.\nAccording to Jomkwan Kongsakul, deputy secretary-general of the SEC, the regulator has approved four digital token projects and is evaluating two more projects, focusing on green tokens and investment-driven programs.\nKongsakul explained that it takes 7-14 days to buy bonds from the primary market before they can be traded in the secondary market. Investors also face challenges such as limited access to certain products and the high cost and poor liquidity of some bonds.\nAt the same time, issuers need to deal with a lot of manual paperwork, which is prone to delays and errors. Therefore, the use of DLT is expected to ensure efficiency and simplify processes while addressing obstacles in the capital market.\nThe regulator aims to fully digitize the bond trading system in the primary and secondary markets, including settlement, trading, investor registration and return payment. Kongsakul promised that competition will remain open because companies with their own DLT infrastructure can build independent chains as long as they ensure interoperability within unified standards. Other companies can access the SEC’s public chain at an affordable cost. Going forward, multiple trading chains are likely to emerge, with all DLT-based systems interconnected through a shared ledger, which is expected to be completed soon.\nExisting financial products will remain but will be converted to digital counterparts to facilitate smooth trading on the DLT network. This approach facilitates fragmented trading at a lower cost and improves liquidity by bringing in more participants, while enabling real-time trading and reducing settlement issues.\nIn addition, the regulator is developing the SEC Open API data platform to provide comprehensive data on all listed companies, helping investors conduct better analysis and make more informed investment decisions. (Bangkok Post)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734054&language=en-US",
            "pub_date": "2025-02-05 13:30:28",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734049,
            "title": "Bitdeer Expands Bitcoin Mining with $21M Power Plant Acquisition",
            "description": "The post Bitdeer Expands Bitcoin Mining with $21M Power Plant Acquisition appeared first on Coinpedia Fintech News\nJihan Wu’s Bitcoin mining firm, Bitdeer, has acquired 19 acres near Fox Creek, Alberta, for $21.7 million, securing a 101 MW site permit. The company plans to build a natural gas power plant and a 99 MW Bitcoin mining data center. The power plant’s construction will require an...\nsource: https://coinpedia.org/crypto-live-news/bitdeer-expands-bitcoin-mining-with-21m-power-plant-acquisition/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734049&language=en-US",
            "pub_date": "2025-02-05 13:13:54",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734048,
            "title": "Canadian blockchain company Neptune buys 20 BTC and 1 million DOGE",
            "description": "Odaily Planet Daily News Canadian blockchain company Neptune Digital Assets Corp. announced that it has increased its holdings by 20 BTC at an average price of $99,833, totaling approximately $2 million. The acquisition was carried out from January 26 to February 3, 2025, increasing Neptune's total Bitcoin holdings to 376 BTC.\nIn addition to expanding its Bitcoin reserves, Neptune also purchased 1,000,000 DOGE through strategic derivatives on December 27, 2024 at an average price of $0.37, further diversifying its cryptocurrency portfolio.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734048&language=en-US",
            "pub_date": "2025-02-05 13:14:41",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}