{
    "data": [
        {
            "id": 734514,
            "title": "Blocksquare launches EU-compliant real estate tokenization framework",
            "description": "The EU’s MiCA regulation was a foundational element of the new real estate tokenization platform, laying the legal groundwork for the initiative, according to Blocksquare.\nsource: https://cointelegraph.com/news/blocksquare-first-eu-compliant-real-estate-tokenization-framework?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734514&language=en-US",
            "pub_date": "2025-02-05 22:00:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734510,
            "title": "Token trading infrastructure Reservoir completes $14 million Series A financing, led by USV",
            "description": "Odaily Planet Daily News Token trading infrastructure Reservoir has completed a $14 million Series A financing, led by USV, with participation from Coinbase Ventures, Variant, Archetype, 1kx, etc. As part of the transaction, Union Square Ventures partner Nick Grossman will join the Reservoir board of directors. \nAs of now, Reservoir's total financing has reached $26 million. The startup previously raised $10 million in a seed round led by Archetype at the end of 2022, and $2 million in a pre-seed round led by Variant in 2021. (TheBlock)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734510&language=en-US",
            "pub_date": "2025-02-05 22:01:12",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734509,
            "title": "0G Foundation launches an $88.88 million ecosystem fund",
            "description": "Odaily Planet Daily News: The 0G Foundation announced the launch of an $88.88 million ecosystem fund to accelerate the creation of AI-driven decentralized finance (DeFi) applications and DeFAI agent projects. It is reported that the fund has received strategic support from Web3 investment companies, including Hack VC, Delphi Ventures, Bankless Ventures and OKX Ventures. It is reported that projects applying for the fund need to focus on \"practical solutions\" to problems related to climate change, labor automation, health care, supply chain, privacy, government efficiency, security and education. Currently, it is specifically looking for scalable and technically feasible projects to provide tangible benefits to the broader 0G ecosystem. (Cointelegraph)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734509&language=en-US",
            "pub_date": "2025-02-05 22:03:38",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734511,
            "title": "U.S. Senate Leader Praises FDIC's Crypto Oversight Efforts",
            "description": "According to Odaily, Cynthia Lummis, the chair of the U.S. Senate Banking Subcommittee on Digital Assets, expressed her satisfaction on the X platform regarding the swift and effective release of crypto oversight documents by the Federal Deposit Insurance Corporation (FDIC). She extended her gratitude to Chairman Hill and U.S. President Donald Trump for their commitment to transparency, stating that efforts are underway to end Chokepoint 2.0. Previously, the FDIC had issued documents related to the supervision of crypto-related activities and announced an active reassessment of its oversight methods concerning these activities.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734511&language=en-US",
            "pub_date": "2025-02-05 22:04:28",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734505,
            "title": "FDIC Reevaluates Oversight Of Crypto Activities",
            "description": "According to Odaily, the U.S. Federal Deposit Insurance Corporation (FDIC) has released a document concerning the oversight of crypto-related activities. FDIC Acting Chairman Travis Hill stated that institutions previously interested in engaging in crypto or blockchain activities faced significant resistance. This included repeated requests for additional information, prolonged periods of silence, and directives from regulators to pause or cease expansion of all crypto or blockchain activities. These actions conveyed to banks that proceeding would be extremely challenging, if not impossible, leading most banks to abandon their efforts. Looking ahead, the FDIC is actively reassessing its approach to supervising crypto-related activities and anticipates collaborating with the Digital Asset Market Working Group, established by an executive order on January 23, 2025.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734505&language=en-US",
            "pub_date": "2025-02-05 21:53:39",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734504,
            "title": "Cynthia Lummis: FDIC's public release of cryptographic supervision documents will drive the end of Chokepoint 2.0",
            "description": "Odaily Planet Daily News Cynthia Lummis, the proposer of the Bitcoin Strategic Reserve Act and chair of the U.S. Senate Banking Digital Assets Subcommittee, posted on the X platform: \"I am glad that the FDIC can quickly and effectively release these cryptographic supervision documents. Thank you Chairman Hill and the Trump administration for their commitment to transparency. We are ending Chokepoint 2.0.\" \nPrevious news, the U.S. Federal Deposit Insurance Corporation (FDIC) released documents involving the supervision of crypto-related activities and stated that it is actively re-evaluating the supervision methods for crypto-related activities.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734504&language=en-US",
            "pub_date": "2025-02-05 21:57:29",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734499,
            "title": "Chainalysis Crypto Crime Report: Ransomware Payments to Drop 35% in 2024",
            "description": "Odaily Planet Daily News According to the 2025 Crypto Crime Report released by Chainalysis, ransomware payments fell 35% to $813 million in 2024, down 35% from $1.25 billion the previous year. The report shows that the amount of ransom in the first half of the year once exceeded the same period in 2023, with the Dark Angels organization's single ransom reaching $75 million. However, ransomware payments fell sharply in the second half of the year, causing the total amount for the whole year to fall back. (The Block)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734499&language=en-US",
            "pub_date": "2025-02-05 21:38:49",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734498,
            "title": "Standard Chartered: Bitcoin price could rise to $500,000 before Trump leaves office",
            "description": "Odaily Planet Daily News Standard Chartered Bank predicts that the price of Bitcoin (BTC) will soar to $500,000 before Donald Trump leaves office as US President. The bank believes that this price increase will be due to a more friendly regulatory environment and wider access to assets. Standard Chartered Bank believes that the price of Bitcoin will reach $200,000 in 2025, and steadily grow to $300,000 in 2026, $400,000 in 2027, and then $500,000 in 2028. In addition, Standard Chartered Bank also believes that the price of BTC will reach a stable level next year. (Decrypt)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734498&language=en-US",
            "pub_date": "2025-02-05 21:39:19",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734497,
            "title": "FDIC Releases Documents Related to Regulation of Cryptocurrency Activities",
            "description": "Odaily Planet Daily News: According to market news, the U.S. Federal Deposit Insurance Corporation (FDIC) released documents related to the regulation of cryptocurrency activities.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734497&language=en-US",
            "pub_date": "2025-02-05 21:47:15",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734496,
            "title": "Analyst: Bitcoin is below the average price achieved in 2025, and if it falls below this level, it will bring greater downward price pressure",
            "description": "Odaily Planet Daily News Coindesk analyst James Van Straten said that Bitcoin is currently below the average realized price of $100,356 in 2025, hovering around $98,000. Historically, this indicator has been a strong support level for Bitcoin. James Van Straten added that a break below this support level does not necessarily mean a bear market or continued decline, because historically, Bitcoin can usually quickly recover to this price level. However, there are currently more than 2.6 million BTC in a loss, and the longer the price remains below the average withdrawal level in 2025, the greater the possibility of further decline. (Coindesk)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734496&language=en-US",
            "pub_date": "2025-02-05 21:47:47",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}