{
    "data": [
        {
            "id": 1051220,
            "title": "Indeed Job Posting Trends Highlight Economic Shifts",
            "description": "Indeed job posting trends are reflecting significant shifts in the economy. Bespoke Investment Group posted on X, highlighting these changes and their implications for the job market. The analysis suggests that the current trends in job postings could be indicative of broader economic movements.\n\nThe data from Indeed shows variations in job postings across different sectors, which may signal changes in demand for certain skills and professions. This information is crucial for understanding how the labor market is evolving and what it might mean for future employment opportunities.\n\nAs the economy continues to adjust, these job posting trends provide valuable insights into which industries are expanding and which may be contracting. This can help job seekers and employers alike to better navigate the changing economic landscape.\n\nOverall, the trends in Indeed job postings offer a snapshot of the current state of the economy and highlight areas of potential growth and decline.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051220&language=en-US",
            "pub_date": "2026-02-27 06:50:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051219,
            "title": "Sam Bankman-Fried Backs U.S. CLARITY Act Amid Bipartisan Criticism",
            "description": "Sam Bankman-Fried (SBF), the imprisoned founder of FTX, has expressed support for the U.S. CLARITY Act, which seeks to provide clearer regulatory guidelines for the cryptocurrency industry. According to NS3.AI, the act aims to delineate the regulatory responsibilities between the Securities and Exchange Commission (SEC) and the Commodity Futures Trading Commission (CFTC). However, it faces significant legislative challenges. SBF's endorsement has drawn criticism from both sides of the political aisle, with some interpreting his comments as an attempt to influence political outcomes and possibly secure a pardon.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051219&language=en-US",
            "pub_date": "2026-02-27 06:52:28",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051218,
            "title": "Magic Eden to Close Bitcoin and EVM Marketplaces, Focuses on Solana",
            "description": "Magic Eden, a marketplace originally built on the Solana blockchain, is set to shut down its Bitcoin and EVM-based marketplaces next week. According to NS3.AI, the platform will also cease support for its multi-chain wallet shortly thereafter. This decision signifies a strategic shift to concentrate solely on the Solana ecosystem.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051218&language=en-US",
            "pub_date": "2026-02-27 06:56:42",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051217,
            "title": "Paramount Skydance Secures Warner Bros. Acquisition",
            "description": "Netflix has withdrawn from the competition to acquire Warner Bros., Bloomberg posted on X, paving the way for Paramount Skydance to finalize its $111 billion purchase. This move marks a significant development in the media industry, as Paramount Skydance emerges as the successful bidder for the entertainment giant. The acquisition is expected to have substantial implications for the competitive landscape among major media companies.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051217&language=en-US",
            "pub_date": "2026-02-27 06:57:23",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051215,
            "title": "Benchmark is optimistic about Strategy's shift to the STRC funding model and has given it a price target of $705.",
            "description": "Benchmark analysts recently reiterated their \"buy\" rating on Strategy (formerly MicroStrategy) and gave it a price target of $705, representing an upside of approximately 430% from the current share price of around $130. Analysts believe the company's strategic shift to STRC preferred stock financing is poised to become a core driver of Bitcoin reserve growth. At the Strategy World 2026 conference, Executive Chairman Michael Saylor stated that the company will shift its strategy from encouraging companies to include Bitcoin on their balance sheets to focusing on promoting STRC perpetual preferred stock as the primary financing tool for future Bitcoin purchases. Benchmark analysts point out that STRC will become Strategy's \"main engine\" for accumulating Bitcoin and is expected to accelerate the growth rate of the company's Bitcoin holdings per share. STRC's price briefly fell to around $90 earlier this month but has since recovered to near its par value of $100. This preferred stock product offers an annualized yield of approximately 11%, pays dividends monthly, and has priority over common stockholders in dividend payouts.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051215&language=en-US",
            "pub_date": "2026-02-27 06:43:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051214,
            "title": "MARA's expansion into AI data center business sent its stock price up 17% in after-hours trading.",
            "description": "Bitcoin mining company MARA Holdings announced a partnership with investment firm Starwood Capital Group to build large-scale data centers for AI and cloud computing customers on top of its existing mining farms in the United States. Following the announcement, the company's stock price rose approximately 17% in after-hours trading. Under the agreement, the two companies will convert some of their existing Bitcoin mining facilities into AI data centers, with Starwood Digital Ventures, a Starwood subsidiary, responsible for design, construction, and customer acquisition. The initial phase of the project is expected to provide approximately 1 gigawatt (GW) of computing power, with plans to expand to over 2.5 GW in the future, and the projects will be jointly funded and operated by both parties. This partnership marks a significant transformation for MARA's business. Due to the large-scale power access capabilities of mining farms, this type of infrastructure becomes increasingly valuable against the backdrop of rapidly growing demand for AI computing power. In recent years, under pressure from declining block rewards due to Bitcoin halvings, rising electricity costs, and intensified competition, many mining companies have begun to shift towards AI computing power infrastructure. However, MARA stated that Bitcoin will remain a core component of the company's long-term strategy. The company's management emphasized that despite short-term price uncertainties, their long-term confidence in the Bitcoin asset class remains unchanged. Financial reports show that the company's revenue in the fourth quarter was $202.3 million, a year-on-year decrease of about 6%, mainly due to a decrease of about 14% in the average mining price of Bitcoin.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051214&language=en-US",
            "pub_date": "2026-02-27 06:47:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051213,
            "title": "Circle's Stock Surges Amid Strong Quarterly Performance",
            "description": "Circle's stock price recently climbed above $90, reaching a new high since last year, before settling around $87. According to ChainCatcher, this surge followed the company's fourth-quarter results, which exceeded market expectations, leading to a cumulative increase of about 30% in the stock price post-earnings announcement. Bernstein analysts have maintained an 'outperform' rating for Circle, setting a target price of $190, citing the company's performance as distinctly different from the broader crypto market.\n\nThe report highlights Circle's expansion in infrastructure, which is generating new revenue streams with higher profit margins, beyond just stablecoin reserve income. Analysts noted that Circle's transaction-related income continues to grow, including blockchain rewards earned as a super validator on the Canton network. Additionally, the proportion of USDC directly hosted on Circle's platform has risen to 17% of the total supply, up from 14% in the previous quarter. The company anticipates that USDC circulation will maintain an annual growth rate of about 40% and projects that revenue from non-reserve sources will reach approximately $170 million by 2026, up from about $110 million in 2025.\n\nBernstein is also optimistic about Circle's expansion into new product areas, such as the Arc platform, Circle Payments Network, and 'automated payment' capabilities for AI agents. Meanwhile, Mizuho analysts pointed out that as stablecoins find new applications in prediction markets and other scenarios, such as the Polymarket platform, Circle's revenue structure is expected to diversify further. Overall, the market's focus is gradually shifting towards whether Circle can establish a more balanced revenue structure amid the expansion of the stablecoin ecosystem.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051213&language=en-US",
            "pub_date": "2026-02-27 06:43:34",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051212,
            "title": "Cryptocurrency Markets Could Benefit from U.S. Legislative Approval",
            "description": "Cryptocurrency markets might experience significant growth in the latter half of the year if U.S. lawmakers pass comprehensive market-structure legislation by midyear, according to JPMorgan. Bloomberg posted on X, highlighting that despite prevailing negative sentiment, the potential legislative approval could provide a boost to the crypto sector. The anticipated legislation aims to address various aspects of market structure, potentially offering a more stable and regulated environment for digital assets. This development comes amid ongoing discussions and debates among U.S. policymakers regarding the future of cryptocurrency regulation. The outcome of these legislative efforts could play a crucial role in shaping the trajectory of the crypto markets in the coming months.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051212&language=en-US",
            "pub_date": "2026-02-27 06:47:27",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051210,
            "title": "Circle's stock price hit $90 as analysts are optimistic about the diversified growth of its stablecoin business.",
            "description": "Shares of stablecoin issuer Circle rose to above $90, a new high since November last year, before falling back to around $87. This followed the company's fourth-quarter results, which exceeded market expectations, driving the stock price up by approximately 30% after the earnings release. Bernstein analysts maintained their \"outperform\" rating on Circle and gave it a $190 price target, believing that the company's performance shows a growth trend that is \"clearly different from the crypto market.\" The report points out that Circle's expansion in the infrastructure sector is generating new revenue streams with higher profit margins, rather than relying solely on stablecoin reserve returns. Analysts stated that Circle's transaction-related revenue continues to grow, including blockchain rewards earned as a supervalidator on the Canton network. Meanwhile, the proportion of USDC directly custodied on the Circle platform has risen to 17% of the total supply, up from 14% in the previous quarter. The company anticipates that USDC circulation will continue to grow at an annual rate of approximately 40%, and expects revenue from other businesses besides reserve income to reach approximately $170 million in 2026, up from approximately $110 million in 2025. Bernstein is also optimistic about Circle's expansion into new product areas, including the Arc platform, Circle Payments Network, and \"automated payment\" capabilities for AI agents. Meanwhile, Mizuho analysts point out that as stablecoins are increasingly used in new scenarios such as prediction markets and the Polymarket platform, Circle's revenue structure is expected to become more diversified. Overall, market attention is gradually shifting towards whether Circle can establish a more balanced revenue stream structure during the expansion of the stablecoin ecosystem.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051210&language=en-US",
            "pub_date": "2026-02-27 06:37:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051209,
            "title": "US lawmakers are re-examining the issue of stablecoin yields and are concerned about the risk of bank deposit outflows.",
            "description": "US lawmakers have recently reignited discussions about stablecoin yield mechanisms, with some concerned that the yields offered by stablecoins could lead to an outflow of bank deposits and blur the lines between crypto products and traditional bank deposits. At a Senate Banking Committee hearing, Senator Angela Alsobrooks stated that while she supports financial innovation, stablecoin yield mechanisms could create products similar to bank deposits, lacking corresponding regulatory and protective measures, potentially triggering future deposit outflows. The issue of stablecoin yields has been a core topic in crypto market legislative negotiations. The GENIUS Stablecoin Act, passed in 2025, prohibits stablecoin issuers from directly paying interest to holders, but does not prohibit third-party platforms like Coinbase from offering rewards to users for holding stablecoins. Bankers believe that allowing stablecoins to offer yields would weaken the deposit base of the traditional banking system. A previous study by the Independent Community Bankers Association estimated that if stablecoin yield mechanisms were fully implemented, bank deposits could decrease by approximately $1.3 trillion, leading to a decrease of approximately $850 billion in community bank lending. The crypto industry counters that restricting stablecoin yields would stifle innovation. Some industry insiders say there is currently no evidence to suggest a significant link between the adoption of stablecoins and the outflow of bank deposits. Senator Thom Tillis stated that he will request regulators to conduct an independent assessment of the potential deposit outflow risks posed by stablecoins. Meanwhile, the White House has recently organized several meetings between banks and crypto companies, hoping to reach a solution to the stablecoin yield issue by the end of this month.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051209&language=en-US",
            "pub_date": "2026-02-27 06:39:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051207,
            "title": "James Comer: Hillary Clinton Responds to House Oversight Committee",
            "description": "U.S. House Oversight Committee Chairman James Comer announced that Hillary Clinton has responded to their inquiries. According to Jin10, Comer stated that efforts will be made to release the video and records of Clinton's responses as soon as possible. This development comes amid ongoing investigations and scrutiny by the committee.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051207&language=en-US",
            "pub_date": "2026-02-27 06:35:22",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051206,
            "title": "Baker Hughes Rig Count Scheduled for Tomorrow Afternoon",
            "description": "The Baker Hughes Rig Count is set to be released tomorrow at 1:00 PM. Bespoke Investment Group posted on X, highlighting the light event calendar for the day. The Rig Count is a key indicator in the oil and gas industry, providing insights into the number of active drilling rigs. This data is closely watched by industry analysts and investors for trends in energy production and exploration activities. The release of the Rig Count can influence market dynamics and investment decisions in the energy sector.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051206&language=en-US",
            "pub_date": "2026-02-27 06:35:56",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051205,
            "title": "GEOPOLITICS | Maduro Seeks Dismissal of U.S. Criminal Charges Over Due Process Concerns",
            "description": "Venezuelan President Nicolás Maduro is reportedly planning to file a motion to dismiss U.S. criminal charges against him, citing violations of due process during his arrest. According to Jin10, the motion argues that the procedures followed in apprehending Maduro were not in accordance with legal standards, potentially undermining the legitimacy of the charges. This development comes amid ongoing geopolitical tensions between Venezuela and the United States, with Maduro's administration frequently challenging U.S. actions and policies. The motion, if successful, could have significant implications for diplomatic relations and the legal proceedings against Maduro.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051205&language=en-US",
            "pub_date": "2026-02-27 06:36:15",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051204,
            "title": "CoreWeave Faces Larger Losses Amid Infrastructure Spending Concerns",
            "description": "CoreWeave, a company specializing in AI data centers, has reported a loss greater than expected, raising concerns about its spending on infrastructure. Bloomberg posted on X, highlighting the financial challenges faced by the company as it invests heavily in expanding its data center capabilities. The unexpected financial results have prompted analysts to question the sustainability of CoreWeave's current investment strategy. The company's focus on infrastructure development has been a key part of its growth plan, but the recent losses suggest that this approach may need reevaluation. As CoreWeave continues to navigate the complexities of the AI data center market, stakeholders are closely monitoring its financial performance and strategic decisions.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051204&language=en-US",
            "pub_date": "2026-02-27 06:37:13",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051193,
            "title": "GEOPOLITICS | Poilievre Discusses US-Canada Trade Relations",
            "description": "Pierre Poilievre delivered a comprehensive speech on Thursday, focusing on the dynamics of US-Canada relations and addressing trade tensions between the two nations. Bloomberg posted on X, highlighting Poilievre's detailed approach to navigating these economic challenges. His address emphasized the importance of strategic policies to manage and improve trade interactions with the United States, aiming to foster a more stable and beneficial relationship. Poilievre's insights come at a time when trade relations are crucial for both countries, underscoring the need for thoughtful and effective policy measures.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051193&language=en-US",
            "pub_date": "2026-02-27 06:19:19",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051195,
            "title": "US media: The Trump administration is stepping up its strategy to retain tariff revenues.",
            "description": "According to Politico, officials from multiple departments of the Trump administration are working on legal strategies to retain billions of dollars in tariff revenue after the Supreme Court ruled that the tariffs were \"illegally collected.\" Several people familiar with the internal discussions said that initial plans include using policy measures to discourage companies from applying for refunds, preventing the government from actually paying refunds, or otherwise retaining at least some of the tariff revenue. One proposal is to claim that tariffs collected over the past year are legitimate revenue under a new tariff framework that the government is preparing to implement under different legal jurisdictions. Another option would allow companies to receive priority processing in the expectedly long refund queue, provided they agree to waive a portion of their refunds from the government.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051195&language=en-US",
            "pub_date": "2026-02-27 06:24:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051192,
            "title": "OpenAI to Collaborate with Canadian Authorities for Enhanced Law Enforcement Standards",
            "description": "OpenAI has announced plans to establish a direct communication channel with Canadian law enforcement agencies. According to Jin10, the company is committed to working closely with the Canadian government and experts to further strengthen its law enforcement referral standards. This initiative aims to enhance cooperation and ensure effective enforcement measures in the region. OpenAI's collaboration reflects its ongoing efforts to align with regulatory frameworks and support public safety initiatives.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051192&language=en-US",
            "pub_date": "2026-02-27 06:24:14",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051186,
            "title": "The probability of the Federal Reserve keeping interest rates unchanged in March is 96%.",
            "description": "According to CME's \"FedWatch\": the probability of the Federal Reserve cutting interest rates by 25 basis points by March is 4%, and the probability of keeping rates unchanged is 96.0%. The probability of the Fed cutting rates by a cumulative 25 basis points by April is 17.3%, the probability of keeping rates unchanged is 82.1%, and the probability of a cumulative 50 basis point cut is 0.6%. The probability of a cumulative 25 basis point cut by June is 43%.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051186&language=en-US",
            "pub_date": "2026-02-27 06:20:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051185,
            "title": "Marathon Digital Holdings Expands into AI Data Centers with Starwood Partnership",
            "description": "Marathon Digital Holdings, a prominent Bitcoin mining company, has announced a partnership with investment firm Starwood to repurpose and expand certain facilities for AI data center usage. According to NS3.AI, this strategic move marks Marathon's diversification into AI infrastructure, complementing its primary focus on cryptocurrency mining. Following the announcement, Marathon's stock price surged by 17%, indicating positive investor sentiment towards the company's expansion efforts.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051185&language=en-US",
            "pub_date": "2026-02-27 06:07:30",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051184,
            "title": "Kratos Aims to Raise $1 Billion Amid Increased Defense Spending",
            "description": "Kratos Defense & Security Solutions is planning to raise $1 billion through a share sale. Bloomberg posted on X that this move comes as government expenditure on defense is on the rise. The company aims to capitalize on the increased demand for defense solutions, driven by heightened global security concerns. Kratos, known for its advanced technology and defense capabilities, is positioning itself to meet the growing needs of the defense sector. The funds raised will likely support the company's expansion and development of new technologies to enhance its offerings in the defense market.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051184&language=en-US",
            "pub_date": "2026-02-27 06:11:29",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}