{
    "data": [
        {
            "id": 734013,
            "title": "Ark Invest Predicts Bitcoin Price Targets For 2030",
            "description": "According to Odaily, Ark Invest's latest report outlines potential price targets for Bitcoin by 2030. In a bearish scenario, Bitcoin could reach $300,000. Under a base case scenario, the price is projected to be $710,000. In a bullish scenario, Bitcoin might achieve a value of $1,500,000.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734013&language=en-US",
            "pub_date": "2025-02-05 11:53:34",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734012,
            "title": "Bitcoin Spot ETF Sees Significant Inflow",
            "description": "According to Odaily, recent data monitored by Trader T indicates that the U.S. Bitcoin spot ETF experienced a net inflow of $342.08 million yesterday.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734012&language=en-US",
            "pub_date": "2025-02-05 11:53:41",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734011,
            "title": "MicroStrategy Seeks New Capital Markets Director",
            "description": "According to Odaily, MicroStrategy is actively recruiting for a new Capital Markets Director. This role will oversee various financial and capital market activities, including equity, convertible debt, and preferred stock issuances. The position requires close collaboration with senior leadership and cross-functional teams to execute financing strategies, optimize the balance sheet, and ensure compliance with company policies. Ideal candidates should possess experience in capital markets, structured finance, investment banking, private equity, or public equity investments, along with a strong interest and understanding of Bitcoin.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734011&language=en-US",
            "pub_date": "2025-02-05 11:53:49",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734010,
            "title": "UBS Completes Proof Of Concept For Key4 Gold On ZKsync Validium",
            "description": "According to Odaily, UBS has successfully completed a proof of concept (PoC) by simulating the provision of its Key4 Gold product on ZKsync Validium in a test environment. This initiative aims to explore solutions related to scalability, cost, privacy, interoperability with Ethereum, and the ease of trading assets. ZKsync Validium, a Layer 2 blockchain solution, is designed to scale Ethereum while maintaining data privacy. It was chosen for this PoC deployment to effectively develop the network and enhance interoperability in a testing setting. UBS Key4 Gold offers Swiss retail and wealth clients the direct right to purchase physical gold, facilitating fractional gold investments.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734010&language=en-US",
            "pub_date": "2025-02-05 11:54:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734002,
            "title": "Tether AI SDK Platform Enables Secure AI and Self-Custody",
            "description": "Tether CEO Paolo Ardoino announced the development of AI applications, including translation, voice assistants, and Bitcoin wallet assistants, alongside plans to launch an open-source Tether AI SDK platform.\nsource: https://coincu.com/305440-tether-ai-sdk-platform-enables-secure-ai",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734002&language=en-US",
            "pub_date": "2025-02-05 11:28:30",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734001,
            "title": "Bitcoin Struggles To Hold $100,000 As China Strikes Back With US Import Tariffs – More Downside For BTC?",
            "description": "Bitcoin (BTC) enjoyed a brief sigh of relief yesterday as the US delayed its proposed 25% trade tariffs on Mexico and Canada by a month. However, the US proceeded with its 10% tariffs on China, prompting retaliatory measures from Beijing. The escalation has pushed BTC back below the critical $100,000 price level. Bitcoin Suffers Amid Trade Wars After a volatile 24 hours filled with uncertainty...\nsource: https://www.newsbtc.com/bitcoin-news/bitcoin-struggles-to-hold-100000-as-china-strikes-back-with-us-import-tariffs-more-downside-for-btc/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734001&language=en-US",
            "pub_date": "2025-02-05 11:30:16",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734000,
            "title": "Enron: The latest lock-up period for the team and investors is 6 months, followed by a 12-month linear lock-up period",
            "description": "Odaily Planet Daily News Enron posted on X: \"When we say maximum transparency, we mean it. Unfortunately, snipers came in early - but fortunately, they are gone now. It's time to start building. \nIn response to the feedback about the 7-day lock-up period, we heard your call. The latest lock-up period for the team and investors is 6 months, followed by a 12-month linear lock-up period. This represents our long-term commitment.\" \nEarlier today, the X account @Enron issued the Meme coin ENRON this morning. The token has fallen nearly 75% from its high point after issuance. \nAccording to the owner of the account, it spent $275 to buy the Enron IP and domain name and re-registered Enron, so this is not the original Enron company. Users are advised to be careful of risks.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734000&language=en-US",
            "pub_date": "2025-02-05 11:36:07",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733999,
            "title": "A whale address transferred 500,000 $RAY from Binance 2 hours ago, worth about 3.07 million US dollars",
            "description": "Odaily Planet Daily News According to Arkham monitoring data, a whale address transferred 500,000 $RAY from the cryptocurrency exchange Binance 2 hours ago, worth about 3.07 million US dollars, and then the whale transferred these tokens to another address.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733999&language=en-US",
            "pub_date": "2025-02-05 11:37:03",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733993,
            "title": "Report: Bitcoin has achieved a market value of $850 billion, becoming a global macro asset that many countries and institutions are paying attention to",
            "description": "Odaily Planet Daily News According to a recent report by Glassnode, Bitcoin has absorbed about $450 billion in additional capital since November 2022, bringing the total realized market value to $850 billion, making it a global macro asset that countries and institutions are paying attention to.\nIt said that the growth of Bitcoin's realized market value was driven by its increasingly important role on the global stage, which attracted institutions and sovereign entities. The report emphasizes that the participation of nation-states in Bitcoin is a key factor, including Bhutan's participation in large-scale mining operations, El Salvador's establishment of Bitcoin as legal tender, and the United States' consideration of its potential as a strategic reserve asset.\nIn addition, Bitcoin also acts as a decentralized payment network. Over the past year, the Bitcoin network has processed an average of $8.7 billion in adjusted economic transactions per day, with a total transaction volume of $3.2 trillion.\nThe report also pointed out that new demand is now exploding, rather than a continuous inflow as in previous cycles. Compared with the peak in 2021, the participation of small retail investors has declined, while large entities have increased their holdings.\nDespite the favorable market conditions, Google search interest in Bitcoin has not yet reached the level of 2021. The investor base is changing, with retail participants showing more strategic accumulation behavior. \nThe launch of the US spot Bitcoin ETF has enabled institutional investors to gain investment opportunities, with net inflows exceeding $40 billion within one year of launch and combined AUM exceeding $120 billion.\nThe Bitcoin investor base has shown resilience during market corrections. Actual losses in the current cycle are lower than in previous cycles, with the only major event being the yen carry liquidation on August 5, 2024. The report also highlights that unlike past cycles, Bitcoin's declines are more controlled and actual volatility is lower. \nOverall, the price action in this cycle is characterized by a series of rallies followed by a period of consolidation, with a more stable market structure as more mature participants trade Bitcoin and other cryptocurrencies.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733993&language=en-US",
            "pub_date": "2025-02-05 11:23:01",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733989,
            "title": "A suspected insider address made a profit of $3.94 million by trading ENRON in 12 minutes",
            "description": "Odaily Planet Daily News: The suspected insider address 3VR8r...wZz4j made a profit of $3.94 million by trading ENRON in 12 minutes.\nThe address spent 1.2 million USDC to buy 10.75 million ENRON in the first minute of listing, with a cost of $0.1487, and then liquidated the position in batches at an average price of $0.5151 near the peak of the currency price, with a return rate of 246.4%.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733989&language=en-US",
            "pub_date": "2025-02-05 11:18:42",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}