{
    "data": [
        {
            "id": 1051594,
            "title": "London Faces Office Space Shortage Amid Economic Concerns",
            "description": "London is experiencing a shortage of office space, indicating a bustling city environment but raising concerns about future economic growth. Bloomberg posted on X, highlighting the implications of this trend for the city's economic prospects. The lack of available office space suggests a thriving business environment, yet it also poses challenges for sustained economic expansion. As demand continues to outpace supply, the situation underscores the need for strategic planning to accommodate future growth.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051594&language=en-US",
            "pub_date": "2026-02-27 13:45:36",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051593,
            "title": "Fairfax Leads Bid for Majority Stake in IDBI Bank",
            "description": "Fairfax Financial Holdings is currently the leading contender to acquire a majority stake in IDBI Bank. Bloomberg posted on X, highlighting that this potential acquisition could mark the largest foreign investment in India's banking sector. The move underscores Fairfax's strategic interest in expanding its presence in the Indian financial market. The acquisition, if successful, would signify a significant shift in the ownership structure of IDBI Bank, potentially influencing the broader banking landscape in India.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051593&language=en-US",
            "pub_date": "2026-02-27 13:49:48",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051585,
            "title": "Exclusive: Nintendo plans an unwinding of strategic shareholdings that would see companies including MUFG Bank and the Bank of Kyoto selling shares of the ‘Super Mario’ maker. More here -",
            "description": "null\nsource: https://x.com/reutersbiz/status/2027257488639246634",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051585&language=en-US",
            "pub_date": "2026-02-27 13:40:24",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051584,
            "title": "Binance Wallet will launch the Sentio (ST) Booster and Pre-TGE events today.",
            "description": "According to the official announcement, Binance Wallet will launch the Sentio (ST) Booster event on February 27th, with a total of 25 million ST tokens (2.5% of the total supply) airdropped in phases. The threshold for Phase 1 is 66 Alpha points, with a deduction of 5 points for participation, and the tokens may be locked. In the Pre-TGE event, each user can contribute a maximum of 3 BNB; ST will not be available for trading until the project unlocks its tokens.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051584&language=en-US",
            "pub_date": "2026-02-27 13:41:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051579,
            "title": "GEOPOLITICS | Europe's Longest-Serving Prime Minister Faces Political Challenge",
            "description": "Europe's longest-serving prime minister is currently facing a significant political challenge. Bloomberg posted on X, highlighting the intense political battle that has emerged as the prime minister seeks to maintain his position amidst growing opposition. The political landscape in Europe is witnessing heightened tensions as various factions vie for influence and power.\n\nThe prime minister, who has held office for an extended period, is now confronted with a formidable opposition that threatens his leadership. This political struggle is drawing attention from across the continent, as observers watch closely to see how the situation unfolds.\n\nThe outcome of this political contest could have far-reaching implications for the region, potentially affecting policies and alliances. As the prime minister navigates this challenging period, the focus remains on how he will address the concerns of his opponents and secure his position.\n\nThis political scenario underscores the dynamic nature of European politics, where leadership can be contested and challenged, leading to shifts in governance and policy direction. The prime minister's ability to manage this situation will be crucial in determining the future political landscape in Europe.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051579&language=en-US",
            "pub_date": "2026-02-27 13:38:47",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051578,
            "title": "Japan's January Housing Starts Show Slight Decline, Beating Expectations",
            "description": "Japan's housing market experienced a minor contraction in January, with new housing starts decreasing by 0.4% year-on-year. According to Jin10, this figure surpassed market expectations, which had anticipated a 1.6% decline. The previous month's data showed a 1.3% decrease, indicating a slight improvement in the rate of decline. The housing sector's performance is closely monitored as it reflects broader economic trends and consumer confidence in Japan.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051578&language=en-US",
            "pub_date": "2026-02-27 13:38:54",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051577,
            "title": "World Liberty Financial Proposes Governance Shift Tied to Staking",
            "description": "World Liberty Financial has announced a proposed change in its governance structure, linking stablecoin voting power directly to the amount staked. According to NS3.AI, this initiative is designed to redirect arbitrage opportunities from institutional market makers to large token holders. The supply of their USD1 stablecoin has surpassed $4.7 billion, indicating significant market adoption.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051577&language=en-US",
            "pub_date": "2026-02-27 13:39:17",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051576,
            "title": "European Union Utilizes Minipigs to Strengthen Biotech Sector",
            "description": "Minipigs are becoming integral to the European Union's efforts to bolster its biotech industry. Bloomberg posted on X, highlighting their ease of breeding and cost-effectiveness as significant advantages. These animals are increasingly used in research and development, contributing to the EU's goal of enhancing resilience in the biotech sector. The focus on minipigs reflects a broader strategy to innovate and advance scientific capabilities within the region.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051576&language=en-US",
            "pub_date": "2026-02-27 13:40:28",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051567,
            "title": "Mizuho to Implement AI for Workforce Optimization in Japan",
            "description": "Mizuho Financial Group is set to replace approximately 5,000 administrative positions in Japan with artificial intelligence over the next decade. Bloomberg posted on X, highlighting the bank's strategy to enhance productivity as it navigates the evolving financial landscape. As Japan's third-largest lender, Mizuho aims to streamline operations and improve efficiency through technological advancements. This move reflects a broader trend in the banking sector, where institutions are increasingly adopting AI to optimize processes and reduce costs. The transition is part of Mizuho's long-term plan to adapt to changing market demands and maintain competitiveness in the industry.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051567&language=en-US",
            "pub_date": "2026-02-27 13:25:24",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051566,
            "title": "Germany and France Consider New Defense Agreement",
            "description": "Germany and France are exploring a potential new agreement involving Paris sharing its nuclear deterrent capabilities in exchange for Berlin's commitment to joint defense financing. Bloomberg posted on X, highlighting the proposal as a strategic move to enhance European defense collaboration. This initiative aims to strengthen the military partnership between the two nations, addressing evolving security challenges in the region.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051566&language=en-US",
            "pub_date": "2026-02-27 13:25:40",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051565,
            "title": "Labour's Traditional Politics Unlikely to Revive Britain's Government",
            "description": "The Labour Party's potential return to its traditional political strategies may not be sufficient to rejuvenate Britain's government. Bloomberg posted on X, highlighting the challenges faced by the party as it navigates the current political landscape. The Labour Party, historically known for its focus on social welfare and workers' rights, is contemplating a shift back to its roots in an attempt to regain public support.\n\nHowever, the political environment in Britain has evolved significantly, with new issues and voter priorities emerging. The party's traditional approach may not resonate with the modern electorate, which is increasingly concerned with issues such as climate change, digital transformation, and economic inequality.\n\nLabour's leadership is under pressure to adapt its policies to address these contemporary challenges while maintaining its core values. The party's ability to balance these demands will be crucial in determining its future success and influence in British politics.\n\nAs the political landscape continues to shift, Labour's strategy will need to evolve to remain relevant and effective in addressing the needs of the British public.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051565&language=en-US",
            "pub_date": "2026-02-27 13:30:47",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051563,
            "title": "UniSat: Will continue to deepen its involvement in the Bitcoin mainnet ecosystem and advance the development of Ordinals, Runes, and BRC-20 infrastructure.",
            "description": "UniSat stated on social media that it is aware of recent changes in the Bitcoin ecosystem, but the team will continue to focus on the development of the Bitcoin mainnet and increase investment in Ordinals, Runes, and BRC-20 infrastructure. Specific measures include: implementing a 90-day zero-service-fee policy on the UniSat Marketplace starting March 1, 2026; expanding the scope of UniHexa early access invitations and improving on-chain exchange capabilities for BRC-20 and Runes; initiating technical discussions on a BRC-20 single-step transfer scheme; and upgrading the UniSat API to support the MCP architecture for commercial-grade on-chain data services. Furthermore, UniSat plans to purchase at least 500,000 FB tokens in phases to participate in the Fractal standard index service, which will launch in the second quarter, with the first phase of deployment expected to be completed within 15 days.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051563&language=en-US",
            "pub_date": "2026-02-27 13:23:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051562,
            "title": "Bitcoin spot ETFs saw a total net inflow of $254 million yesterday, marking the third consecutive day of net inflows.",
            "description": "According to SoSoValue data, Bitcoin spot ETFs saw a total net inflow of $254 million yesterday (February 26th, Eastern Time). The BlackRock ETF (IBIT) saw the largest single-day net inflow of $276 million, bringing its historical total net inflow to $61.839 billion. The Bitwise ETF (BITB) followed with a net inflow of $69.0102 million, bringing its historical total net inflow to $2.173 billion. Conversely, the Fidelity ETF (FBTC) saw the largest single-day net outflow of $51.4874 million, bringing its historical total net inflow to $10.996 billion. As of press time, the total net asset value of Bitcoin spot ETFs is $85.937 billion, with an ETF net asset ratio (market capitalization as a percentage of Bitcoin's total market capitalization) of 6.38%, and a historical cumulative net inflow of $54.828 billion.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051562&language=en-US",
            "pub_date": "2026-02-27 13:25:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051561,
            "title": "Ethereum spot ETF saw a total net inflow of $6.5742 million yesterday, marking the third consecutive day of net inflows.",
            "description": "According to SoSoValue data, Ethereum spot ETFs saw a total net inflow of $6.5742 million yesterday (February 26th, Eastern Time). The Ethereum spot ETF with the largest single-day net inflow was BlackRock ETF ETHA, with a net inflow of $15.3368 million, bringing its historical total net inflow to $11.876 billion. This was followed by 21Shares ETF TETH, with a net inflow of $7.6081 million, bringing its historical total net inflow to $24.6985 million. The Ethereum spot ETF with the largest single-day net outflow was Fidelity ETF FETH, with a net outflow of $19.2216 million, bringing its historical total net inflow to $2.505 billion. As of press time, the total net asset value of the Ethereum spot ETF is $11.599 billion, the ETF net asset ratio (market capitalization as a percentage of Ethereum's total market capitalization) is 4.75%, and the historical cumulative net inflow has reached $11.648 billion.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051561&language=en-US",
            "pub_date": "2026-02-27 13:26:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051560,
            "title": "Jeff Bezos's $30 Billion AI Lab Seeks Major Industrial Deals",
            "description": "Jeff Bezos has invested $30 billion in an artificial intelligence laboratory that is now seeking substantial deals in the industrial sector. According to Jin10, the lab aims to leverage AI technology to transform various industries by securing partnerships and collaborations worth billions. The initiative reflects Bezos's commitment to advancing AI applications and fostering innovation across different fields. The lab's focus on industrial deals highlights the growing importance of AI in driving efficiency and productivity in traditional sectors. This move is expected to have significant implications for the future of industrial operations and AI integration.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051560&language=en-US",
            "pub_date": "2026-02-27 13:12:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051559,
            "title": "Binance Surpasses $70B In Commodities Trading Volume",
            "description": "Binance has now recorded over $70 billion in trading volume after launching its silver and gold futures. Mere weeks after the launch of the precious metals derivatives trading, the achievement of surpassing $70 billion in trading volume shows that demand for 24/7 on-chain access to gold and silver exposure remains strong.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051559&language=en-US",
            "pub_date": "2026-02-27 13:17:44",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051552,
            "title": "Circle Stock Surges 50% in Two Days – But It's a Short Squeeze, Not a Turnaround",
            "description": "Hedge funds' bearish bets backfire as CRCL whipsaws higher on earnings beat\nsource: https://www.blockhead.co/2026/02/27/circle-stock-surges-50-in-two-days-but-its-a-short-squeeze-not-a-turnaround/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051552&language=en-US",
            "pub_date": "2026-02-27 13:00:57",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051551,
            "title": "Cardano Faces Investor Frustration After 90% Drop – Here Is What Could Happen",
            "description": "\"Cardano is currently experiencing significant investor frustration following a dramatic 90% drop in its value. This steep decline has led many stakeholders to express their concerns and dissatisfaction regarding the cryptocurrency's performance. In light of this challenging situation, we will explore potential outcomes and scenarios that could unfold for Cardano in the coming months, including possibilities for recovery, continued volatility, and the impact of market trends on its future.\"\nsource: https://blocknews.com/cardano-faces-investor-frustration-after-90-drop-here-is-what-could-happen/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051551&language=en-US",
            "pub_date": "2026-02-27 13:04:49",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051539,
            "title": "Stripe Weighs Potential Acquisition of PayPal",
            "description": "Stripe is reportedly exploring a potential acquisition of PayPal as both fintech firms expand into crypto and stablecoin markets.\nsource: https://catenaa.com/markets/cryptocurrencies/stripe-weighs-potential-acquisition-of-paypal/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051539&language=en-US",
            "pub_date": "2026-02-27 13:00:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051550,
            "title": "Hong Kong's Proposal to Withdraw HK$150 Billion Raises Concerns",
            "description": "Hong Kong's government has proposed withdrawing HK$150 billion ($19 billion) from a fund designed to support the currency's peg to the US dollar. Bloomberg posted on X, highlighting that this move has surprised some officials and sparked concerns about the precedent it might establish. The proposal aims to reallocate these funds for other uses, but it has raised questions about the potential impact on the stability of the currency peg. Critics argue that such a withdrawal could undermine confidence in the financial system and set a risky precedent for future financial management decisions. The proposal is still under discussion, and its implications are being closely monitored by financial experts and policymakers.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051550&language=en-US",
            "pub_date": "2026-02-27 13:01:31",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}