{
    "data": [
        {
            "id": 1051007,
            "title": "CPPIB Executive Sam Dorri Appointed as Chief of Staff to CEO John Graham",
            "description": "Sam Dorri, the managing director of financing and balance sheet management at the Canada Pension Plan Investment Board (CPPIB), has been appointed to serve as chief of staff to CEO John Graham. Bloomberg posted on X, highlighting this strategic move within the organization. Dorri's new role is expected to leverage his extensive experience in financial management to support the CEO in executing CPPIB's strategic initiatives. This appointment underscores CPPIB's commitment to strengthening its leadership team as it navigates the complexities of global investment management.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051007&language=en-US",
            "pub_date": "2026-02-27 03:27:33",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051006,
            "title": "US Public Pension Unaffected by AI's Impact on Private Credit Market",
            "description": "The largest public pension fund in the United States remains unfazed by the potential disruptions in the private credit market caused by advancements in artificial intelligence. Bloomberg posted on X, highlighting that the fund is maintaining its investment strategy despite concerns about AI's impact on software sectors. The pension fund's confidence stems from its diversified portfolio and long-term investment outlook, which it believes will mitigate any short-term market fluctuations. This approach underscores the fund's commitment to stability and resilience in the face of technological advancements that may affect specific industries.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051006&language=en-US",
            "pub_date": "2026-02-27 03:32:49",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051005,
            "title": "Former Executive Admits to Financial Misconduct Before Company's Collapse",
            "description": "A former executive of First Brands has confessed to a judge about engaging in fraudulent activities that contributed to the downfall of the auto-parts supplier. Bloomberg posted on X that the executive admitted to falsifying financial statements, inflating invoices, and double-pledging collateral to secure billions in funding. These actions were part of a scheme that ultimately led to the company's collapse. The revelations highlight significant misconduct within the organization, raising questions about oversight and governance practices.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051005&language=en-US",
            "pub_date": "2026-02-27 03:34:52",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050993,
            "title": "This Deal Pushes USDT Beyond Exchanges",
            "description": "Tether has invested $200 million in Whop, assigning the company a $1. 6 billion valuation. The transaction forms part of Tether’s broader strategy to expand stablecoin utility beyond trading venues and into digital commerce platforms. Whop operates a global online marketplace that facilitates the sale of digital products, software access, memberships, and community subscriptions\nsource: https://techgaged.com/this-deal-pushes-usdt-beyond-exchanges/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050993&language=en-US",
            "pub_date": "2026-02-27 03:22:39",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050992,
            "title": "Starknet Launches strkBTC for Private Bitcoin DeFi",
            "description": "The Ethereum Layer 2 network Starknet has announced the launch of strkBTC, a new Bitcoin-based asset designed to bring confidential transactions and shielded balances into the DeFi ecosystem. The initiative is part of Starknet’s broader BTCFi strategy, aimed at attracting Bitcoin liquidity into scalable Layer 2 infrastructure while preserving user privacy.\nsource: https://www.ethnews.com/starknet-launches-strkbtc-for-private-bitcoin-defi/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050992&language=en-US",
            "pub_date": "2026-02-27 03:22:55",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050990,
            "title": "Hyperliquid Founder Discusses Shift in Finance Protocols",
            "description": "Jeff Yan, founder of Hyperliquid, has highlighted a significant shift in the nature of finance protocols, moving from competition to ecosystem collaboration. According to NS3.AI, Yan emphasized that while liquidity fragmentation and competition among protocols are natural occurrences, they ultimately contribute to strengthening the overall system. He also pointed out Hyperliquid's dedication to fairness and the absence of insider privileges as crucial elements in its growth strategy.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050990&language=en-US",
            "pub_date": "2026-02-27 03:18:42",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050989,
            "title": "Uber Air Taxis Set to Launch on App This Year",
            "description": "Uber has announced the upcoming launch of its all-electric air taxis, developed in collaboration with Joby Aviation. Bespoke Investment Group posted on X. These air taxis are expected to be available on the Uber app within the year, marking a significant step forward in urban transportation. The initiative aims to provide a new mode of travel that is both efficient and environmentally friendly. This development is part of Uber's broader strategy to expand its transportation services beyond traditional ride-sharing.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050989&language=en-US",
            "pub_date": "2026-02-27 03:19:59",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050988,
            "title": "Fluid to Transfer IP Ownership to Nonprofit Foundation for Regulatory Compliance",
            "description": "Fluid's developers have announced plans to transfer the ownership of their intellectual property to a nonprofit foundation. According to NS3.AI, this decision is aimed at ensuring compliance with regulatory standards while maintaining decentralization. The foundation will be governed by holders of Fluid's DAO tokens, addressing anti-money laundering (AML), know-your-customer (KYC), and banking requirements in preparation for partnerships with traditional financial institutions. This proposal stands in contrast to the ongoing governance conflicts at Aave, showcasing Fluid's proactive approach to decentralized governance and intellectual property control.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050988&language=en-US",
            "pub_date": "2026-02-27 03:24:14",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050987,
            "title": "Ripple Invests in t54 Labs to Enhance AI Payment Infrastructure on XRPL",
            "description": "Ripple has made a strategic investment in t54 Labs, aiming to develop trust infrastructure for autonomous AI agents to facilitate compliant machine-to-machine payments on the XRP Ledger (XRPL). According to NS3.AI, the initiative focuses on identity verification, real-time risk controls, and the integration of the RLUSD stablecoin to support regulated settlements in AI-driven commerce. The expansion of XRPL in this area is contingent on the adoption of programmable payment systems like x402 and the use of stablecoins, which could lead to millions of daily transactions and a substantial increase in liquidity demand.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050987&language=en-US",
            "pub_date": "2026-02-27 03:24:19",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050965,
            "title": "IP Strategy Launches 1M Share Buyback",
            "description": "IP Strategy authorized a buyback of up to 1 million shares, highlighting confidence in its $IP token holdings and growth from third-party validator yield.\nsource: https://catenaa.com/markets/cryptocurrencies/ip-strategy-launches-1m-share-buyback/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050965&language=en-US",
            "pub_date": "2026-02-27 03:00:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050963,
            "title": "5 Monthly Red Candles: How XRP Is About To Create A Historical Losing Streak",
            "description": "XRP’s higher-timeframe structure is approaching a rare technical milestone on the monthly chart. The cryptocurrency is still on an extended pullback from its 2025 highs above $3 and is now trading around $1. 38. If the current price action trajectory holds into month-end, XRP could close February with the fifth straight red monthly candle\nsource: https://www.newsbtc.com/analysis/xrp/5-monthly-red-candles-xrp/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050963&language=en-US",
            "pub_date": "2026-02-27 03:00:58",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050962,
            "title": "The Daily: ZachXBT probe alleges insider trading at Axiom, Vitalik’s February ETH sales hit $35M, OCC issues GENIUS Act proposal, and more",
            "description": "The following article is adapted from The Block’s newsletter, The Daily, which comes out on weekday afternoons.\nsource: https://www.theblock.co/post/391507/the-daily-zachxbt-probe-alleges-insider-trading-at-axiom-vitaliks-february-eth-sales-hit-35m-occ-issues-genius-act-proposal-and-more?utm_source=rss&utm_medium=rss",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050962&language=en-US",
            "pub_date": "2026-02-27 03:04:02",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050972,
            "title": "Crypto Social Networks Undergo Major Changes Amid Market Maturation",
            "description": "Recent developments at decentralized social platforms Farcaster and Lens have ignited discussions about the future of crypto social networks. According to NS3.AI, experts interpret these changes as a necessary market correction rather than a failure in the sector. The evolving landscape suggests a shift in ownership and strategies, indicating broader maturation and consolidation within the crypto social media industry.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050972&language=en-US",
            "pub_date": "2026-02-27 03:06:53",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050961,
            "title": "Elliott Considers IPO for Barnes & Noble and Waterstones",
            "description": "Elliott Management, the owner of Barnes & Noble and Waterstones, is exploring an initial public offering (IPO) for the book retailers. Bloomberg posted on X, citing sources familiar with the situation, that the investment firm has invited investment banks to propose roles for the potential IPO. The move indicates Elliott's interest in taking the book retail chains public, although further details about the timeline or valuation have not been disclosed. The decision to pursue an IPO comes as the retail sector continues to adapt to changing consumer behaviors and market conditions.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050961&language=en-US",
            "pub_date": "2026-02-27 02:58:30",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050960,
            "title": "OpenAI's Sam Altman Partners with Gap, Visa, and Tinder to Promote World ID",
            "description": "OpenAI founder Sam Altman's company, Tools for Humanity, has announced a collaboration with Gap, Visa, and Tinder to promote its World ID product. According to Jin10, World ID is a human verification technology designed to distinguish between humans and robots. This partnership aims to enhance the adoption and integration of World ID across various platforms, potentially improving security and user experience in digital interactions. The collaboration highlights the growing interest in advanced identity verification solutions in the tech industry.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050960&language=en-US",
            "pub_date": "2026-02-27 02:58:40",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050958,
            "title": "GEOPOLITICS | Russian Envoy Declines Comment on U.S. Talks in Geneva",
            "description": "A Russian presidential envoy has chosen not to comment on discussions with the United States held in Geneva, according to Jin10. The refusal to provide details on the talks underscores the ongoing complexities in diplomatic relations between the two nations. The meeting, which was anticipated to address various geopolitical issues, remains shrouded in secrecy, leaving analysts and observers speculating about its implications for future interactions between Russia and the U.S.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050958&language=en-US",
            "pub_date": "2026-02-27 02:46:11",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050957,
            "title": "Woman Arrested in Italy After Boarding Flight Without Ticket",
            "description": "A woman with a prior conviction for stowing away on an international flight has been detained in Italy after boarding a plane at Newark Liberty International Airport without a ticket, according to a source familiar with the situation. Bloomberg posted on X, highlighting the incident's international implications. The woman, whose identity has not been disclosed, managed to bypass security measures at the airport, raising concerns about aviation security protocols. Authorities are investigating how she was able to board the flight without proper documentation. This incident underscores the ongoing challenges in ensuring passenger safety and security in air travel.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050957&language=en-US",
            "pub_date": "2026-02-27 02:46:40",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050956,
            "title": "AI Adoption in Corporate Treasury Departments Faces Challenges",
            "description": "A recent survey by Crisil Coalition Greenwich reveals that treasury departments in global companies are encountering difficulties in integrating AI tools. Bloomberg posted on X, highlighting the slow pace at which this technology is being incorporated into essential corporate finance functions. The survey underscores the challenges faced by these departments in leveraging AI to enhance efficiency and decision-making processes.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050956&language=en-US",
            "pub_date": "2026-02-27 02:51:07",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050955,
            "title": "U.S. Hockey Players Address Olympic Win and Trump Association",
            "description": "U.S. hockey players returning to their NHL teams have been met with inquiries regarding the politicization of their Olympic victory and their connection to U.S. President Donald Trump. New York Times posted on X, highlighting the players' responses to these questions. The athletes expressed mixed feelings about the political implications of their win, with some emphasizing the importance of focusing on their sport rather than political affiliations. Others acknowledged the significance of their achievement and the attention it garnered from political figures, including President Trump. The players' comments reflect the broader conversation about the intersection of sports and politics in the United States. As they continue their professional careers, the athletes aim to balance their roles as sports figures and public personalities amid ongoing discussions about their Olympic success and its political ramifications.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050955&language=en-US",
            "pub_date": "2026-02-27 02:55:33",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050952,
            "title": "Toncoin (TON) price heavily oversold as Telegram introduces Vaults in TON Wallet",
            "description": "The TON Wallet Vaults will let users earn yield on BTC, ETH, and USDT. Toncoin (TON) is deeply oversold, trading near $1. 29 with bearish momentum. The key levels to watch are the support around $1\nsource: https://coinjournal.net/news/toncoin-ton-price-heavily-oversold-as-telegram-introduces-vaults-in-ton-wallet/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050952&language=en-US",
            "pub_date": "2026-02-27 02:32:55",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}