{
    "data": [
        {
            "id": 1052965,
            "title": "MoonPay launches the PYUSDx framework, supporting the issuance of branded stablecoins based on PayPal PYUSD.",
            "description": "MoonPay has launched the PYUSDx framework, allowing developers to issue branded, application-specific stablecoins with PayPal USD (PYUSD) as the reserve asset. This solution combines M0's stablecoin infrastructure protocol with MoonPay's issuance and distribution capabilities, separating reserve management from token issuance to accelerate the stablecoin launch process. Under this architecture, PYUSD, issued by Paxos Trust, serves as the underlying reserve asset, while the branded stablecoin is issued by MoonPay Digital Assets. The latter recently obtained a New York State trust license, enabling it to act as a stablecoin issuer. Developers can launch custom stablecoins without having to build their own underlying technology and operational systems. With this product's launch, the market is also focused on whether it complies with the regulatory framework of the US GENIUS Act and the future applicability of the tokens in different jurisdictions.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052965&language=en-US",
            "pub_date": "2026-02-28 08:06:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052964,
            "title": "SEC Chairman: The U.S. missed the window of opportunity for crypto regulation and is now accelerating the modernization of its rules.",
            "description": "U.S. Securities and Exchange Commission (SEC) Chairman Paul Atkins stated that the SEC is reviving its pace of cryptocurrency regulation to address previous policy shortcomings. Speaking at an event at the University of Texas, he pointed out that regulators have historically failed to keep pace with industry innovation. Atkins noted that since the Donald Trump administration took office, the SEC has adopted a more open stance, establishing a cryptocurrency task force, withdrawing several enforcement cases, and launching \"Project Crypto\" to drive updates to the regulatory framework. He emphasized that the focus is more on the future applications of distributed ledger technology in payment, clearing, and settlement systems than on short-term price fluctuations. Furthermore, the SEC this week approved WisdomTree's digital currency market fund to offer 24/7 trading and instant settlement. Atkins also revealed plans to explore tokenized bank deposit products in the future. (The Block)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052964&language=en-US",
            "pub_date": "2026-02-28 08:08:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052963,
            "title": "Trump posted a message calling on the Supreme Court to reconsider or reopen his tariff policy case.",
            "description": "US President Trump posted on social media that the recent Supreme Court ruling on tariffs could send tens of billions of dollars back to countries and companies that have been \"exploiting\" the US for years, and that, according to the ruling, they might actually continue to do so, even to a higher level. I believe the Supreme Court didn't consider this! It's truly disappointing, to say the least, that those countries and companies that have taken advantage of us for decades and obtained billions of dollars they shouldn't have are now entitled to an unprecedented \"ill-gotten gain.\" Is it possible for this case to be retried or reopened? (Jinshi)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052963&language=en-US",
            "pub_date": "2026-02-28 08:10:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052966,
            "title": "Pentagon Agrees to OpenAI's Secure Deployment Rules in Confidential Settings",
            "description": "The Pentagon has reportedly agreed to the rules set by OpenAI for the secure deployment of its technology in confidential environments, according to Jin10. However, no contracts have been signed yet, indicating ongoing discussions between the two parties. This development highlights the increasing interest in integrating advanced AI technologies within government operations while ensuring security and confidentiality. The collaboration could potentially enhance the capabilities of defense systems, although formal agreements are still pending.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052966&language=en-US",
            "pub_date": "2026-02-28 08:10:05",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052959,
            "title": "Hawthorne Race Course Files for Bankruptcy Amid Financial Struggles",
            "description": "Hawthorne Race Course has filed for Chapter 11 bankruptcy protection in Chicago, following ongoing financial difficulties. Bloomberg posted on X that the filing comes after several months of complaints from horse owners about bounced checks and unpaid purse money. The racecourse has been facing financial challenges, leading to this decision to seek bankruptcy protection. The filing aims to restructure the racecourse's debts and address the financial issues that have affected its operations. The situation has raised concerns among stakeholders about the future of the racecourse and its ability to meet financial obligations.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052959&language=en-US",
            "pub_date": "2026-02-28 07:55:36",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052957,
            "title": "Vitalik Buterin Mapped Out Where Ethereum Is Heading – Short Term and Long Term",
            "description": "Ethereum’s scaling roadmap got a detailed public airing this week, straight from Vitalik Buterin himself. The thread covers two distinct timeframes, and the gap between them is wider than most people probably realize. The Near Term: Glamsterdam Does the Heavy Lifting The next meaningful upgrade, Glamsterdam, carries more technical weight than its name suggests\nsource: https://www.ethnews.com/vitalik-buterin-mapped-out-where-ethereum-is-heading-short-term-and-long-term/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052957&language=en-US",
            "pub_date": "2026-02-28 07:42:09",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052956,
            "title": "Solana Co-Founder Claims Greater Decentralization Than Ethereum",
            "description": "Solana co-founder Anatoly Yakovenko has stated that Solana's network offers a higher level of decentralization compared to Ethereum. According to NS3.AI, Yakovenko bases this claim on the original decentralization concept introduced by Satoshi Nakamoto. He highlights that Solana enables anyone to verify the ledger using a node without the need for high-end hardware. Additionally, Yakovenko emphasizes that Solana's architecture prevents the network from stealing user funds, setting it apart from systems that rely on multi-signature security councils.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052956&language=en-US",
            "pub_date": "2026-02-28 07:48:11",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052955,
            "title": "Aave DAO Considers Prioritizing v4 Amid Concerns Over v3",
            "description": "Aave DAO delegates are currently voting on a proposal to prioritize the development of Aave v4 over the existing v3 protocol. According to NS3.AI, this decision has sparked concerns among some delegates regarding the potential risks of sidelining the established v3 protocol. In response to backlash, Aave Labs has decided to relax its initial aggressive timeline for transitioning users to v4, ensuring that migration will not be mandatory.\n\nThe proposal also includes a funding request for Aave Labs, which involves significant payments from the DAO. Some delegates have expressed concerns that these payments may be excessive. The ongoing discussions highlight the challenges faced by the DAO in balancing innovation with stability and financial prudence.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052955&language=en-US",
            "pub_date": "2026-02-28 07:48:17",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052954,
            "title": "South Korean authorities lose almost $5M in seized crypto in mnemonic phrase leak",
            "description": "South Korea’s National Tax Service (NTS) has reportedly lost nearly $4. 8 million worth of seized cryptocurrency after it accidentally published an unredacted wallet recovery phrase in a press release, the third major crypto custody failure by Korean authorities in as many months and the most embarrassing yet. On February 26, the NTS issued a press […]\nsource: https://www.cryptopolitan.com/south-korea-lose-seized-crypto-phrase-leak/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052954&language=en-US",
            "pub_date": "2026-02-28 07:31:34",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052947,
            "title": "$13 XRP Target In View As Heavy XRP Capitulation Mirrors 2022 Bottom That Preceded Rocket Rally",
            "description": "XRP endured a choppy week, trading sideways on Friday after a turbulent stretch across the broader cryptocurrency market.\nsource: https://zycrypto.com/13-xrp-target-in-view-as-heavy-xrp-capitulation-mirrors-2022-bottom-that-preceded-rocket-rally/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052947&language=en-US",
            "pub_date": "2026-02-28 07:19:01",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052946,
            "title": "SEC Chairman Criticizes Biden Administration's Crypto Policy as Missed Opportunity",
            "description": "SEC Chairman Paul Atkins has expressed criticism towards the Biden administration's approach to cryptocurrency policy, describing it as a missed opportunity. According to NS3.AI, Atkins highlighted the previous SEC's rigid stance under Gary Gensler, which he believes hindered progress in the crypto industry. He has pledged that the SEC will adopt a more proactive approach, aiming to lead the industry by approving innovations such as tokenized deposits. Despite the volatility in cryptocurrency prices, Atkins remains optimistic about the broader potential of distributed ledger technology.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052946&language=en-US",
            "pub_date": "2026-02-28 07:25:32",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052945,
            "title": "Bitcoin Network Hard Fork Proposed to Recover Lost Mt. Gox Funds",
            "description": "Mark Karpeles, the former CEO of Mt. Gox, has suggested implementing a hard fork in the Bitcoin network to retrieve approximately 80,000 BTC lost during a hack in 2011. According to NS3.AI, these coins have remained untouched for 15 years, and the proposal is likely to ignite debate due to concerns over Bitcoin's immutability and the risk of chain splits. This initiative is intended as a one-time exception and is separate from the ongoing distribution process to Mt. Gox creditors, which involves around 200,000 BTC.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052945&language=en-US",
            "pub_date": "2026-02-28 07:25:39",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052944,
            "title": "Warner Bros. Discovery Inc. Sold to Paramount Skydance Corp.",
            "description": "CNN anchor Jake Tapper reported on Thursday night about the sale of Warner Bros. Discovery Inc. to Paramount Skydance Corp. Bloomberg posted on X, highlighting the unexpected nature of the announcement. The acquisition marks a significant shift in the media landscape, as Paramount Skydance Corp. expands its portfolio with this strategic purchase. Details regarding the terms of the deal and its implications for both companies are yet to be disclosed. The transaction is expected to influence the competitive dynamics within the entertainment industry.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052944&language=en-US",
            "pub_date": "2026-02-28 07:27:38",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052943,
            "title": "JUST IN: Circle's $USDCx is now LIVE for supplying on Liqwid, #Cardano $ADA's largest lending protocol. Users can deposit USDCx liquidity ahead of market activation. Borrowing and using USDCx as collateral will be enabled after Liqwid's proposal concludes on February 28th.",
            "description": "null\nsource: https://x.com/angrycryptoshow/status/2027522719596851376",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052943&language=en-US",
            "pub_date": "2026-02-28 07:14:20",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052934,
            "title": "JUST IN: #Cardano $ADA Founder Charles Hoskinson says \"we're working hard on LayerZero. That's a super hard integration.\" LayerZero is expected to launch on Cardano between May and June.",
            "description": "null\nsource: https://x.com/angrycryptoshow/status/2027520293305004463",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052934&language=en-US",
            "pub_date": "2026-02-28 07:04:42",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052935,
            "title": "Credit: @ESCOweb3",
            "description": "null\nsource: https://x.com/angrycryptoshow/status/2027520295528247742",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052935&language=en-US",
            "pub_date": "2026-02-28 07:04:42",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052933,
            "title": "Bitcoin Drops to $65,000 as Retail Panic Grows, But There Is A Catch",
            "description": "Bitcoin (BTC) traded sideways on Friday following a volatile week that left the market on edge.\nsource: https://zycrypto.com/bitcoin-drops-to-65000-as-retail-panic-grows-but-there-is-a-catch/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052933&language=en-US",
            "pub_date": "2026-02-28 07:07:28",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052932,
            "title": "Ares Management CEO to Discuss Credit Cycle and Private Markets",
            "description": "Bloomberg posted on X that next week, Ares Management CEO Michael Arougheti will address topics including the current state of the credit cycle and the future of private markets. The discussion aims to provide insights into financial trends and strategies. Arougheti's perspective is anticipated to shed light on how these factors may influence investment decisions and market dynamics.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052932&language=en-US",
            "pub_date": "2026-02-28 07:09:47",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052929,
            "title": "Surgeon Drains $145,000,000 From US Government and Blue Cross in Massive Fraud Scheme: DOJ",
            "description": "An orthopedic surgeon in Texas orchestrated a massive fraud scheme that drained more than $100 million from the healthcare system, according to the U. S. Department of Justice. The DOJ says 61-year-old Michael Taba accepted bribes and kickbacks from pharmacy owners to prescribe medication that was unnecessary\nsource: https://dailyhodl.com/2026/02/27/surgeon-drains-145000000-from-us-government-and-blue-cross-in-massive-fraud-scheme-doj/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052929&language=en-US",
            "pub_date": "2026-02-28 06:55:35",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052928,
            "title": "AI Boom May Impact Leveraged Loans in US Collateralized Loan Obligations",
            "description": "The rise of artificial intelligence could significantly affect leveraged loans packaged into US collateralized loan obligations, with potential disruptions ranging from $40 billion to $150 billion, according to JPMorgan. Bloomberg posted on X, highlighting the financial implications of AI advancements on these complex financial instruments. As AI continues to evolve, its impact on various sectors, including finance, is becoming increasingly evident. JPMorgan's analysis suggests that the AI boom could lead to substantial shifts in the leveraged loan market, affecting the stability and performance of collateralized loan obligations. This development underscores the need for financial institutions to adapt to technological changes and reassess their strategies in response to AI-driven transformations.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052928&language=en-US",
            "pub_date": "2026-02-28 06:58:48",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}