{
    "data": [
        {
            "id": 734647,
            "title": "An entrepreneur launched a Meme token and dumped the market to make a profit of $1.48 million. He has now deleted the promotional tweet",
            "description": "Odaily Planet Daily News According to Lookonchain monitoring, Tanzanian businessman and entrepreneur Mohammed Dewji MO (@moodewji) launched the TANZANIA token and sold it to investors for a profit of $1.48 million. He distributed 90 SOL (about $18,000) to 20 wallets, and then purchased 793 million TANZANIA (79.5% of the total supply). After completing the position, he announced the contract address, and then sold all 793 million TANZANIA in exchange for 7,373 SOL (about $1.5 million), and finally made a profit of 7,283 SOL (about $1.48 million). At present, he has deleted all related tweets.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734647&language=en-US",
            "pub_date": "2025-02-06 00:25:23",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734640,
            "title": "SOL falls below 200 USDT",
            "description": "OKX market data shows that SOL fell below 200 USDT and is now at 199.84 USDT, a 24-hour drop of 7.55%. (This newsletter is generated by AI)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734640&language=en-US",
            "pub_date": "2025-02-06 00:11:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734639,
            "title": "ZetaChain announces support for Solana, combining native BTC liquidity with Solana ecosystem applications",
            "description": "Odaily Planet Daily News ZetaChain announced support for Solana, becoming the first public L1 to support native dApps across Bitcoin, Ethereum, Base, and Solana. Developers can now build universal apps and interact seamlessly with native SOL, SPL tokens, and assets on other major blockchains without bridging or encapsulation, and users can interact with these universal apps without switching their preferred network. ZetaChain has a strong momentum in the field of chain abstraction. On its first anniversary this week, its number of independent wallets has exceeded 4 million and its transaction volume has reached 165 million.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734639&language=en-US",
            "pub_date": "2025-02-06 00:18:41",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734635,
            "title": "Cryptocurrency Market Falls into Fear Zone: Here's Why That's Big News",
            "description": "Cryptocurrency market drops into fear, and you'd love to know what happened last time\nsource: https://u.today/cryptocurrency-market-falls-into-fear-zone-heres-why-thats-big-news",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734635&language=en-US",
            "pub_date": "2025-02-06 00:00:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734634,
            "title": "Coinbase Users Lose Millions Annually – Here is How",
            "description": "An on-chain investigator, operating under the pseudonym ZachXBT, has revealed alarming details about the scale of social engineering scams affecting Coinbase users.\nThe post Coinbase Users Lose Millions Annually – Here is How appeared first on Cryptodnes.\nsource: https://cryptodnes.bg/en/coinbase-users-lose-millions-annually-here-is-how/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734634&language=en-US",
            "pub_date": "2025-02-06 00:00:19",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734633,
            "title": "EA’s $1B Buyback Plan Boosts Investor Confidence Amid 6.4% Revenue Drop",
            "description": "Electronic Arts reported a slight earnings miss for Q3 FY2025 but boosted investor confidence with a $1 billion stock repurchase plan.\nThe post EA’s $1B Buyback Plan Boosts Investor Confidence Amid 6.4% Revenue Drop appeared first on Tokenist.\nsource: https://tokenist.com/eas-1b-buyback-plan-boosts-investor-confidence-amid-6-4-revenue-drop/?utm_source=rss&utm_medium=rss&utm_campaign=eas-1b-buyback-plan-boosts-investor-confidence-amid-6-4-revenue-drop",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734633&language=en-US",
            "pub_date": "2025-02-06 00:00:27",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734632,
            "title": "Union Square Ventures Leads $14M Series A for Token Trading Infrastructure Reservoir",
            "description": "The company plans to use the fresh capital to expand beyond NFTs and enable token trading on apps across multiple blockchains.\nThe post Union Square Ventures Leads $14M Series A for Token Trading Infrastructure Reservoir appeared first on NFTgators .\nsource: https://www.nftgators.com/union-square-ventures-leads-14m-series-a-for-token-trading-infrastructure-reservoir/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734632&language=en-US",
            "pub_date": "2025-02-06 00:00:38",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734625,
            "title": "Rho Labs Completes $4 Million Seed Round, Led by CoinFund",
            "description": "Odaily Planet Daily News: Rho Labs, founded by former Copper Chief Product Officer Alex Ryvkin, announced the completion of a US$4 million seed round of financing, led by CoinFund, with participation from Auros, Flow Traders and Speedinvest. The company had completed a US$2.2 million Pre-Seed round of financing in 2023, led by Speedinvest, with participation from Keyrock, Re7 Capital, Daedalus Collective and Copper CEO Dmitry Tokarev.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734625&language=en-US",
            "pub_date": "2025-02-05 23:52:56",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734624,
            "title": "Messari Releases Solana Ecosystem 2024 Q4 Report: DeFi TVL Reaches $8.6 Billion",
            "description": "Odaily Planet Daily News Messari released Solana's 2024 Q4 report, which disclosed: \nSolana ecosystem DeFi TVL reached 8.6 billion US dollars (+64%), surpassing Tron to become the second largest public chain, with on-chain application revenue of 840 million US dollars (+213%); \nSolana ecosystem's average daily DEX trading volume is 3.3 billion US dollars (+150%), and Jupiter accounts for 38% of the market share, mainly due to Memecoin and AI token transactions; \nSolana ecosystem stablecoin market value is 5.1 billion US dollars (+36%), USDC accounts for 75%, and USDT increases to 912 million US dollars. \nIn addition, Visa expands SolanaUSDC settlement, and Grayscale submits SolanaETF application. Overall, Solana ecosystem growth is strong and institutional adoption is accelerating.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734624&language=en-US",
            "pub_date": "2025-02-05 23:58:44",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734618,
            "title": "Pudgy Penguins CEO: $PENGU application has officially ended",
            "description": "Odaily Planet Daily News: Luca Netz, CEO of the NFT project \"Fat Penguin\" Pudgy Penguins, announced on the X platform that the $PENGU application has officially ended.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734618&language=en-US",
            "pub_date": "2025-02-05 23:48:11",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}