{
    "data": [
        {
            "id": 1051387,
            "title": "0G Labs Launches AI Accelerator with $20 Million Funding",
            "description": "0G Labs has announced the launch of the '0G Apollo Accelerator,' aimed at providing up to $20 million in funding to support the development and expansion of revenue-generating AI applications based on decentralized infrastructure. According to Odaily, this accelerator is established in collaboration with the Blockchain Builders Fund (BBF), which is part of Stanford University's blockchain ecosystem, including the Stanford Blockchain Accelerator, BASS, and MS&E 447 projects. The initiative also receives support from Google Cloud, offering each selected team $200,000 in cloud resources.\n\nAdditionally, Privy, a wallet infrastructure platform acquired by Stripe, will provide production-grade wallet solutions to the selected teams. This support is intended to equip projects with enterprise-level computing and infrastructure capabilities from the early stages.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051387&language=en-US",
            "pub_date": "2026-02-27 09:44:38",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051386,
            "title": "U.S. Wages Struggle to Keep Up with Inflation Amid Rising Living Costs",
            "description": "The Kobeissi Letter posted on X, highlighting the challenges faced by American households as wages struggle to keep pace with inflation. Since 2020, average weekly earnings adjusted for inflation have increased by only 3.7%, indicating that inflation has eroded most of the income gains for Americans. This situation is compounded by significant increases in living costs across the United States.\n\nUtility gas service prices have surged by 56%, electricity prices have risen by 41%, and home insurance costs have climbed by 14% since 2020. Additionally, the prices of used cars and trucks have increased by 30%, while motor vehicle insurance has seen a 56% rise. In contrast, nominal wages have grown by 31.0% during the same period.\n\nThe disparity between wage growth and the rising costs of essential goods and services underscores the affordability issues faced by many American households. As living expenses continue to rise, the challenge of maintaining financial stability becomes increasingly difficult for the average American.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051386&language=en-US",
            "pub_date": "2026-02-27 09:44:44",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051385,
            "title": "Google and OpenAI Employees Advocate for Military AI Restrictions",
            "description": "Employees from Google and OpenAI are actively advocating for limitations on the use of artificial intelligence in military applications. According to Jin10, this initiative reflects growing concerns among tech workers about the ethical implications and potential risks associated with AI technologies in warfare. The employees are urging their companies to establish clear policies that prevent the development and deployment of AI systems for military purposes. This movement highlights the ongoing debate within the tech industry regarding the responsible use of AI and its impact on global security. The call for restrictions comes amid increasing interest from governments and defense organizations in leveraging AI for strategic advantages. As discussions continue, the tech community is emphasizing the need for transparency and ethical guidelines to ensure AI technologies are used responsibly.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051385&language=en-US",
            "pub_date": "2026-02-27 09:45:14",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051384,
            "title": "Equinor Reduces Singapore Power Operations",
            "description": "Norwegian energy company Equinor has scaled back its power trading operations in Singapore. Bloomberg posted on X, highlighting that this move is part of a broader strategy to streamline its global trading activities. The decision comes amid a challenging market environment and is aimed at optimizing the company's resources and focus.\n\nEquinor's decision to reduce its presence in Singapore reflects a strategic shift in its approach to trading operations. The company has been evaluating its global trading footprint to enhance efficiency and profitability. This adjustment is expected to allow Equinor to concentrate on core markets and leverage its strengths more effectively.\n\nThe energy sector has been facing significant volatility, prompting companies like Equinor to reassess their strategies. By scaling back in Singapore, Equinor aims to better align its operations with current market conditions and future growth opportunities. The company continues to explore ways to enhance its trading capabilities while maintaining a strong presence in key regions.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051384&language=en-US",
            "pub_date": "2026-02-27 09:45:19",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051381,
            "title": "0G Labs, in partnership with the Stanford blockchain team, launched a $20 million Apollo AI Accelerator.",
            "description": "Decentralized AI infrastructure protocol 0G Labs announced the launch of the \"0G Apollo Accelerator,\" offering up to $20 million in funding to incubate and scale revenue-generating AI applications based on decentralized infrastructure. The accelerator is a partnership with Blockchain Builders Fund (BBF), part of the Stanford University blockchain ecosystem, which includes projects such as the Stanford Blockchain Accelerator, BASS, and MS&E 447. The project also receives support from Google Cloud, with each selected team receiving $200,000 in cloud resources. Furthermore, wallet infrastructure platform Privy (acquired by Stripe) will provide selected teams with production-grade wallet solutions, aiming to help projects acquire enterprise-grade computing and infrastructure capabilities from an early stage.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051381&language=en-US",
            "pub_date": "2026-02-27 09:41:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051379,
            "title": "Bitplanet Increases Bitcoin Holdings to 300 Amid Strategic Framework",
            "description": "South Korean publicly traded company Bitplanet has increased its Bitcoin holdings to 300, adding 35 this week. According to ChainCatcher, the company emphasizes that this is not merely an accumulation strategy but part of a unique framework where artificial intelligence converts energy into operational cash flow, with Bitcoin serving as a store of energy value over time.\n\nBitplanet highlights that its Bitcoin accumulation is supported by cash flow rather than speculative actions. In the context of global debt expansion and ongoing monetary flexibility, the company believes that scarce energy-related assets are becoming increasingly important.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051379&language=en-US",
            "pub_date": "2026-02-27 09:33:54",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051378,
            "title": "Bitcoin Whale Wallets Increase Amid Market Downturn",
            "description": "The number of Bitcoin wallets holding 100 or more BTC has approached 20,000, indicating potential bullish momentum. According to NS3.AI, on-chain analysis reveals that an increase in whale numbers often occurs during market downturns, suggesting accumulation phases. Despite this rise, the total supply held by these whales has not seen a significant increase, contributing to the persistent price pressures.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051378&language=en-US",
            "pub_date": "2026-02-27 09:36:53",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051370,
            "title": "The US XRP spot ETF saw a total net inflow of $1.2163 million in a single day.",
            "description": "According to SoSoValue data, yesterday (February 26th, Eastern Time), XRP spot ETFs saw a total net inflow of $1.2163 million. The XRP spot ETF with the largest net inflow yesterday was the Canary XRP ETF (XRPC), with a net inflow of $745,700, bringing its historical total net inflow to $414 million. The second largest was the Bitwise XRP ETF (XRP), with a net inflow of $470,600, bringing its historical total net inflow to $370 million. As of press time, the total net asset value of XRP spot ETFs was $1.016 billion, with an XRP net asset ratio of 1.19%, and a historical cumulative net inflow of $1.238 billion.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051370&language=en-US",
            "pub_date": "2026-02-27 09:28:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051369,
            "title": "Planet Morning News",
            "description": "1. ZachXBT accuses Axiom employees of insider trading; 2. Michael Saylor: Bitcoin is the ultimate reserve asset of the 21st century; 3. Axiom: Will pursue legal action against those involved; access to related tools has been removed; 4. Axiom's promotional partner Devin apologizes: Admits to risking his reputation, but did not have access to the information exposed by ZachXBT; 5. Circle's stock price hits $90; Analysts are optimistic about the diversified growth of its stablecoin business; 6. Starting from the new fiscal year, the UK will ban the inclusion of crypto ETNs in mainstream ISA tax-free accounts; 7. The probability of the \"US confirming the existence of aliens by 2027\" event on Polymarket rises to 18%; 8. US Senator responds to SBF's request for clemency: If the CLARITY Act applies, the sentence could far exceed 25 years; 9. A suspected insider bet $59,800 in the three hours before ZachXBT announced Axiom employees' alleged insider trading, making a profit of nearly $110,000; 10. Nasdaq listing. Solana DeFi Development, a financial treasury firm, makes a strategic investment in stablecoin protocol Apyx; 11. The Ethereum Foundation releases a \"strawmap\" roadmap, aiming to achieve second-level transactions and significantly increase throughput; 12. Lighter responds to a failed whale long ARC attack: LLP risk control mechanism is operating as expected, with a loss cap of 75,000 USDC; 13. Jane Street issues a fraud warning on its official website: it does not provide services to individual investors and does not solicit business through social media; 14. American Bitcoin's financial report: Bitcoin reserves surpass 6,000, with full-year revenue exceeding $180 million in 2025; 15. Bernstein: Circle has transformed into a fintech infrastructure, giving it an \"outperform\" rating; 16. Huma Finance: HUMA token Q3 airdrop is now open for applications; 17. Goliath Ventures CEO arrested in connection with a $328 million crypto Ponzi scheme; 18. DMG Blockchain releases Q1 financial report: mining output 69 19. FOOM CASH, a privacy gaming platform, suffered a $2.26 million loss after being attacked on both Ethereum and Bitcoin. 20. Bitfinex Securities updated its account structure, eliminating separate securities sub-accounts to simplify the structure. 21. Crypto trading platform STS Digital completed a $30 million funding round, led by CMT Digital.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051369&language=en-US",
            "pub_date": "2026-02-27 09:30:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051368,
            "title": "On Polymarket, the probability that \"FDV's market capitalization will exceed $100 million one day after the market opens\" has risen to 60%.",
            "description": "According to data from Polymarket, the probability that \"Based's FDV market capitalization will exceed $100 million one day after its opening\" has risen to 60%. Previously, Based announced the completion of an $11.5 million Series A funding round, led by Pantera Capital.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051368&language=en-US",
            "pub_date": "2026-02-27 09:33:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051365,
            "title": "GEOPOLITICS | U.S., Russia, and Ukraine Prepare for Upcoming Talks",
            "description": "The United States has engaged in meetings with representatives from Russia and Ukraine to prepare for a trilateral discussion scheduled for early next month. According to RTHK, Ukrainian President Volodymyr Zelensky stated that the next round of talks between the U.S., Russia, and Ukraine might take place in Abu Dhabi, the capital of the United Arab Emirates, in early March. All parties have reportedly made thorough preparations for the negotiations. Zelensky emphasized the need to identify outcomes that would ensure genuine security guarantees and mentioned the organization of a leadership-level meeting.\n\nThe U.S. news website Axios reported that U.S. President Donald Trump and Zelensky had a 30-minute phone conversation on Wednesday. During the call, Zelensky expressed his hope for the Russia-Ukraine conflict to end within the year, while Trump indicated his desire for the war to conclude within a month.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051365&language=en-US",
            "pub_date": "2026-02-27 09:24:11",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051364,
            "title": "China Eases Yuan's Rise by Adjusting Derivatives Market",
            "description": "China has intensified its measures to moderate the yuan's appreciation by eliminating the extra fee for wagering against the currency in the derivatives market. Bloomberg posted on X, highlighting this strategic move as part of China's broader efforts to manage its currency's value amid global economic fluctuations. This adjustment aims to provide more flexibility in the foreign exchange market, reflecting China's ongoing commitment to stabilizing its financial environment. The decision comes as the yuan has experienced significant upward pressure, prompting authorities to intervene and ensure balanced market conditions.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051364&language=en-US",
            "pub_date": "2026-02-27 09:25:15",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051363,
            "title": "Alberta's Budget Deficit Expected to Double Amid Population Growth and Lower Oil Prices",
            "description": "Alberta, Canada's leading oil-producing province, anticipates its budget deficit will more than double in the upcoming fiscal year. Bloomberg posted on X, highlighting that this financial strain is attributed to declining crude oil prices coupled with a significant increase in population. The province's public finances are under pressure as these factors converge, challenging Alberta's economic stability. The projected deficit underscores the impact of fluctuating oil markets on regions heavily reliant on energy revenues. Alberta's government is now tasked with addressing these fiscal challenges while managing the demands of a growing population.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051363&language=en-US",
            "pub_date": "2026-02-27 09:25:20",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051362,
            "title": "Generate Biomedicines Secures $400 Million in IPO",
            "description": "Generate Biomedicines has successfully raised $400 million through its initial public offering, with shares priced at the midpoint of the marketed range. Bloomberg posted on X, highlighting the company's strategic move in the biotechnology sector. The funds raised are expected to support the company's ongoing research and development efforts, as well as its expansion plans. Generate Biomedicines aims to leverage this capital to advance its innovative approaches in the field of biomedicine.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051362&language=en-US",
            "pub_date": "2026-02-27 09:26:28",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051360,
            "title": "Analyst Highlights Challenges in Tracking Crypto Transactions",
            "description": "Analyst @ai_9684xtpa posted on X that tracking cryptocurrency transactions can be challenging due to frequent wallet changes by users. This practice makes it difficult to trace activities on the blockchain, although backend systems can monitor transactions through invitation relationships. The analyst emphasized the significance of insider information in understanding these complex dynamics.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051360&language=en-US",
            "pub_date": "2026-02-27 09:16:53",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051359,
            "title": "Asian Currencies Decline as Risk-Off Sentiment Prevails",
            "description": "Asian currencies experienced a decline as investors adopted a risk-off sentiment. Wall Street Journal (Markets) posted on X, highlighting the trend across the region's currency markets. The shift in investor sentiment comes amid concerns over global economic uncertainties and geopolitical tensions, prompting a move away from riskier assets.\n\nThe weakening of Asian currencies reflects broader market apprehensions, with investors seeking safer havens such as the U.S. dollar. This trend is influenced by various factors, including fluctuating commodity prices and potential changes in monetary policies by major central banks.\n\nMarket analysts suggest that the current sentiment may persist as long as uncertainties remain in the global economic landscape. The focus is on upcoming economic indicators and policy decisions that could further impact currency valuations.\n\nOverall, the decline in Asian currencies underscores the cautious approach adopted by investors in response to prevailing market conditions.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051359&language=en-US",
            "pub_date": "2026-02-27 09:17:01",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051358,
            "title": "Anthropic CEO Rejects Pentagon's AI Demand, Risking Contract Fallout",
            "description": "Anthropic's CEO has declined the Pentagon's request for unrestricted military use of its AI technology, potentially jeopardizing existing contracts and risking a supply chain risk designation. According to NS3.AI, the disagreement arises from Anthropic's safeguards against the use of its AI for autonomous weapons targeting and mass surveillance. This situation could set a precedent affecting how governments might pressure cryptocurrency firms to compromise on privacy and security features.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051358&language=en-US",
            "pub_date": "2026-02-27 09:17:58",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051353,
            "title": "WSJ: TFH partners with Gap, Visa, and Tinder to promote World ID human verification product",
            "description": "Tools for Humanity (TFH), the development team behind Worldcoin, is collaborating with Gap, Visa, and Tinder to promote the application of its \"World ID\" biometric authentication product. Reports indicate that some Gap stores in San Francisco have already deployed \"Orb\" devices to collect facial and iris information from users to generate World IDs. Simultaneously, TFH plans to launch a Visa-linked payment card, allowing World ID holders to use digital assets for purchases. Dating app Tinder is also testing the identity system in Japan to verify users' identities and age information. TFH states that the Orb device converts facial and iris images into anonymous digital identifiers and stores them on the user's device; the company itself does not retain the original biometric data. Its business model aims to generate revenue by charging applications for verification services. (Wall Street Journal)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051353&language=en-US",
            "pub_date": "2026-02-27 09:08:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051352,
            "title": "GEOPOLITICS | FAA Closes Texas Airspace Amid Reports of Anti-Drone Laser Weapon Use",
            "description": "The U.S. Federal Aviation Administration (FAA) has closed the airspace over Fort Hancock, Texas, following reports of anti-drone laser weapon usage in the area. According to Jin10, this decision comes amid growing concerns over the deployment of advanced military technology in domestic airspace. The closure aims to ensure the safety of both civilian and military aircraft operating in the region. The FAA has not provided a timeline for when the airspace might reopen, as investigations into the reports are ongoing. This development highlights the increasing focus on counter-drone measures and their implications for airspace management.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051352&language=en-US",
            "pub_date": "2026-02-27 09:00:08",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051351,
            "title": "Bitcoin(BTC) Drops Below 67,000 USDT with a 2.13% Decrease in 24 Hours",
            "description": "On Feb 27, 2026, 01:07 AM(UTC). According to Binance Market Data, Bitcoin has dropped below 67,000 USDT and is now trading at 66,994.453125 USDT, with a narrowed 2.13% decrease in 24 hours.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051351&language=en-US",
            "pub_date": "2026-02-27 09:07:07",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}