{
    "data": [
        {
            "id": 1054330,
            "title": "On-chain NFT transactions related to Bitcoin have shrunk dramatically, with February sales falling below $25 million, marking the lowest level since March 2023.",
            "description": "According to CryptoSlam data, Bitcoin on-chain NFT sales plummeted to approximately $24,448,223 in February 2026, marking the lowest monthly sales figure since March 2023. On-chain Bitcoin NFT transactions decreased to approximately 50,854, with 10,048 unique buyer addresses and 10,510 unique seller addresses. Conversely, Ethereum on-chain NFT sales rebounded in February, exceeding $200 million, reaching a new monthly sales high since November 2025. On-chain NFT transactions reached 152,632, with 21,729 unique buyer addresses and 21,487 unique seller addresses.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054330&language=en-US",
            "pub_date": "2026-03-01 16:06:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054329,
            "title": "Data: Polymarket platform generates $600 million in contracts related to the US-Iran conflict.",
            "description": "Following the US-Israel airstrikes against Iran, the decentralized prediction market platform Polymarket quickly launched over ten event contracts related to the situation in Iran, covering topics such as the ceasefire period, the successor to the Supreme Leader, and whether US troops would enter Iran. Since the attacks, the market has attracted approximately $600 million in trading volume. Among them, the contract for the event \"Will Khamenei lose his position as Iran's Supreme Leader before March 31?\" was 100% settled after Iranian state television confirmed his death, with a trading volume of $45 million. The biggest winner, the account \"Curseaaaaaaa,\" profited approximately $757,000 through a \"Yes\" position, and four other traders profited over six figures. Furthermore, the largest single event contract is the contract for the event \"When will the US launch airstrikes against Iran?\", which has accumulated a trading volume of $529 million since its launch on December 22 last year, with a single-day trading volume of $89.6 million on February 28. Subsequent market activity showed that traders were generally betting on a phased resolution to the conflict within weeks: the probability of a ceasefire between the US and Iran was only 4% before March 2nd, 15% before March 6th, but rose to 61% before March 31st, and reached 78% before April 30th. (CoinDesk)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054329&language=en-US",
            "pub_date": "2026-03-01 16:10:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054331,
            "title": "Ukraine Negotiator Claims Russian Agreement on U.S. Security Assurances",
            "description": "Ukraine's presidential office chief and negotiation team member, Budanov, stated in a conversation with reporters that Russia has agreed to the security assurance terms provided by the United States to Ukraine. According to Jin10, Budanov mentioned that during previous negotiations, Russia explicitly supported the U.S. security assurances for Ukraine. He also noted that all parties are currently seeking 'compromise' regarding territorial issues. However, Russia has not yet confirmed this information.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054331&language=en-US",
            "pub_date": "2026-03-01 16:11:11",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054323,
            "title": "AurumX ecosystem infrastructure manadia completes $7 million seed funding round",
            "description": "Manadia, a Web3 verifiable data and AI collaboration infrastructure, has officially announced the completion of a $7 million seed round of financing. Investors include OKX Ventures, Pillar VC, One Way Ventures, Quasar Holding Co., and Sandeep Nailwal, co-founder of Polygon, also participated in this round. Incubated by AurumX-backed AUR Labs in collaboration with leading global institutions, the project focuses on the underlying infrastructure for low-trust-dependent data settlement and AI collaboration. It provides core capabilities such as the VERITAS verifiable oracle, AI Agent collaboration, privacy-preserving settlement, and compliant payments, offering secure and reliable value exchange and cross-system collaboration support for the financial, digital asset, and AI ecosystems. Manadia stated that it will continue to promote technology implementation and ecosystem expansion, striving to make every digital collaboration safer, more verifiable, and more efficient, becoming a key underlying support for the entire financial and AI ecosystem.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054323&language=en-US",
            "pub_date": "2026-03-01 15:57:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054322,
            "title": "The whale \"pension-usdt.eth\" closed its long Bitcoin position, making a profit of $466,000.",
            "description": "According to Onchain Lens monitoring, the whale \"pension-usdt.eth\" closed its long Bitcoin positions, making a profit of $466,000.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054322&language=en-US",
            "pub_date": "2026-03-01 16:00:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054325,
            "title": "Global PMI Surveys and U.S. Payrolls Set to Influence Markets",
            "description": "Global markets are poised for a significant week as investors focus on key economic indicators. S&P Global PMI posted on X, highlighting the importance of these surveys in assessing economic health. The upcoming U.S. payrolls report is also expected to provide crucial insights into the labor market, influencing market sentiment and potential policy decisions.\n\nThe PMI surveys will offer a snapshot of manufacturing and service sector performance across various regions, providing valuable data on economic activity and growth prospects. Analysts will closely monitor these figures to gauge the strength of the global economy and identify potential trends.\n\nMeanwhile, the U.S. payrolls report will be a focal point for investors, as it reflects employment changes and wage growth. This data is critical for understanding the labor market's recovery and its impact on consumer spending and inflation.\n\nMarket participants will analyze these reports to adjust their strategies and anticipate any shifts in monetary policy. The outcomes of these economic indicators could have significant implications for financial markets worldwide.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054325&language=en-US",
            "pub_date": "2026-03-01 16:00:23",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054324,
            "title": "Cryptocurrency Traders Seek Market Bottom Amid Modest Recovery",
            "description": "Cryptocurrency traders are closely monitoring the market for signs of a bottom following a slight recovery on Sunday. Bloomberg posted on X that this uptick came after Iran confirmed the death of its supreme leader, Ayatollah Ali Khamenei. The news has prompted traders to assess the potential impact on the cryptocurrency market, as geopolitical events often influence investor sentiment and market dynamics. The recent developments have added a layer of uncertainty, leading market participants to remain vigilant in their analysis of price movements.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054324&language=en-US",
            "pub_date": "2026-03-01 16:03:29",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054316,
            "title": "US Judge Lets Binance Unregistered Token Class Action Proceed",
            "description": "A US judge rejected Binance’s attempt to force arbitration, allowing a class action over alleged unregistered token sales to proceed in court.\nsource: https://cryptonews.com/news/us-judge-lets-binance-unregistered-token-class-action-proceed/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054316&language=en-US",
            "pub_date": "2026-03-01 15:47:26",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054315,
            "title": "Elon Musk's Social Media Exchange Highlights Geopolitical Tensions",
            "description": "Elon Musk recently revisited a past social media exchange with Iran's late Supreme Leader Khamenei, reigniting discussions on geopolitical tensions. According to NS3.AI, the original interaction featured Khamenei asserting resistance against adversaries, to which Musk responded by calling it a 'ridiculous fantasy.' While this exchange underscores ongoing geopolitical issues, it does not directly influence the cryptocurrency market.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054315&language=en-US",
            "pub_date": "2026-03-01 15:49:07",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054314,
            "title": "Saudi Stock Market Index Narrows Decline to 1.6% on March 1",
            "description": "On March 1, the Saudi Arabian stock market index (TASI) saw its decline narrow to 1.6%. According to BlockBeats, shares of banks such as Saudi National Bank and Riyad Bank experienced a downturn, while Saudi Aramco's stock rose by more than 2%.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054314&language=en-US",
            "pub_date": "2026-03-01 15:52:27",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054313,
            "title": "UPDATE: BTC leverage is heavily skewed with ~$8B in shorts and less than $200M in longs.",
            "description": "null\nsource: https://x.com/cointelegraph/status/2028009956180435077",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054313&language=en-US",
            "pub_date": "2026-03-01 15:30:26",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054312,
            "title": "List of Altcoins with the Highest Number of Active Users Revealed",
            "description": "Following recent developments in the cryptocurrency market, which altcoins appear to have a more robust user base? Continue Reading: List of Altcoins with the Highest Number of Active Users Revealed\nsource: https://en.bitcoinsistemi.com/list-of-altcoins-with-the-highest-number-of-active-users-revealed/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054312&language=en-US",
            "pub_date": "2026-03-01 15:38:10",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054310,
            "title": "Indonesia to Implement New Palm Oil Export Tax Rate from March 1",
            "description": "Indonesia is set to introduce a new export tax rate for palm oil, effective March 1. According to Jin10, this regulatory change aims to adjust the financial framework surrounding the country's significant palm oil industry. The new tax rate is part of Indonesia's broader strategy to manage its agricultural exports and maintain economic stability. The palm oil sector is a crucial component of Indonesia's economy, and the updated tax policy reflects the government's efforts to optimize revenue from this vital industry. The implementation of the new tax rate is expected to impact both domestic producers and international buyers, influencing market dynamics and trade flows.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054310&language=en-US",
            "pub_date": "2026-03-01 15:43:56",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054306,
            "title": "Qatari LNG exports pause as Hormuz risks lift war premiums",
            "description": "UKMTO updates show vessels pausing or deviating after radio warnings; impacts span Strait of Hormuz, Qatari LNG exports, war-risk insurance. Premiums rising.\nsource: https://coincu.com/news/qatari-lng-exports-pause-as-hormuz-risks-lift-war-premiums/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054306&language=en-US",
            "pub_date": "2026-03-01 15:26:54",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054305,
            "title": "U.S. Spot Crypto ETFs Posted $932 Million in Net Inflows During Week 9: BlackRock Led With $503 Million",
            "description": "U. S. spot cryptocurrency ETFs recorded approximately $932 million in net inflows during the trading week of February 23 to 27, 2026, with BlackRock’s IBIT accounting for $503 million of the Bitcoin category total and the week representing the first green weekly bar in the SoSoValue flow chart after five consecutive weeks of net outflows. The […] The post U\nsource: https://www.ethnews.com/u-s-spot-crypto-etfs-posted-932-million-in-net-inflows-during-week-9-blackrock-led-with-503-million/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054305&language=en-US",
            "pub_date": "2026-03-01 15:28:15",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054304,
            "title": "GEOPOLITICS | Pakistani Police Use Tear Gas on Protesters Outside U.S. Consulate in Karachi",
            "description": "Pakistani police deployed tear gas to disperse protesters gathered outside the U.S. Consulate in Karachi. According to Jin10, the demonstration was part of a larger protest movement in the region. The situation escalated as tensions rose between the protesters and law enforcement. The protestors were reportedly voicing their grievances over various political issues. The use of tear gas was aimed at controlling the crowd and preventing any potential security threats to the consulate. The incident highlights ongoing unrest in the area, reflecting broader geopolitical tensions.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054304&language=en-US",
            "pub_date": "2026-03-01 15:26:14",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054302,
            "title": "Musk retweeted an old post responding to Khamenei's comments.",
            "description": "Musk retweeted an old post he made on January 4th on social media, commenting, \"That's how it is.\" Previously, on January 3rd, the late Iranian Supreme Leader Khamenei posted, \"We will never yield to our enemies,\" to which Musk replied in Persian, \"Absurd fantasy.\"",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054302&language=en-US",
            "pub_date": "2026-03-01 15:29:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054303,
            "title": "OpenClaw-Based Startups Generate Significant Revenue",
            "description": "According to TrustMRR's latest data, over the past 30 days, 129 startups built on OpenClaw have generated a total revenue of $283,000, with an average monthly income of approximately $2,200 per company. The highest monthly revenue recorded by a single company reached $50,000.\n\nAccording to Odaily, the current ecosystem shows a high concentration in business models. Around 80% of these companies focus on lowering the usage threshold of OpenClaw by providing tools, infrastructure, or simplified access services. Only 3 to 5 companies are deeply engaged in application layer development, exploring specific industry scenarios, indicating that the overall exploration of commercial scenarios is still in its early stages.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054303&language=en-US",
            "pub_date": "2026-03-01 15:31:06",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054297,
            "title": "The OpenClaw ecosystem is beginning to show revenue growth, with 129 startups generating a total of $283,000 in revenue over the past 30 days.",
            "description": "According to the latest data from TrustMRR, in the past 30 days, 129 startups built on OpenClaw have generated real revenue, totaling $283,000, with an average monthly revenue of approximately $2,200 per company. The company with the highest monthly revenue reached $50,000. In terms of business model distribution, the ecosystem is currently highly concentrated: approximately 80% of companies focus on lowering the barrier to entry for OpenClaw, providing tools, infrastructure, or simplifying access services; only 3-5 companies are truly delving into application-layer development and exploring specific industry scenarios, indicating that overall business scenario exploration is still in its early stages.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054297&language=en-US",
            "pub_date": "2026-03-01 15:15:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054299,
            "title": "Nvidia Supports Development of AI-Driven 6G Networks",
            "description": "Nvidia is actively contributing to the development of 6G phone networks to ensure they offer a robust platform for AI-driven services and devices. Bloomberg posted on X, highlighting Nvidia's commitment to integrating artificial intelligence into future telecommunications infrastructure. The company aims to leverage its expertise in AI to enhance the capabilities of 6G networks, which are expected to revolutionize mobile connectivity and enable advanced applications. Nvidia's involvement underscores the growing importance of AI in shaping next-generation technologies and its potential impact on the telecommunications industry.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054299&language=en-US",
            "pub_date": "2026-03-01 15:16:30",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}