{
    "data": [
        {
            "id": 734411,
            "title": "Royco Skyrockets to $3B TVL Ahead of Berachain Launch",
            "description": "Royco Protocol has surged to $3 billion in TVL, becoming one of DeFi’s fastest-growing platforms ahead of Berachain’s highly anticipated launch.\nThe post Royco Skyrockets to $3B TVL Ahead of Berachain Launch  appeared first on NFTgators .\nsource: https://www.nftgators.com/royco-skyrockets-to-3b-tvl-ahead-of-berachain-launch/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734411&language=en-US",
            "pub_date": "2025-02-05 20:18:23",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734409,
            "title": "Binance HODLer Airdrops Berachain (BERA)",
            "description": "Odaily Planet Daily News According to the official announcement, Binance will launch Berachain (BERA) at 13:00 (UTC) on February 6, 2025, and open BERA/BTC, BERA/USDT, BERA/USDC, BERA/BNB, BERA/FDUSD and BERA/TRY trading pairs. In addition, Binance will provide BERA airdrop rewards to users who subscribe BNB to SimpleEarn products between 00:00 (UTC) on January 22, 2025 and 23:59 (UTC) on January 26, 2025. The airdrop information is expected to be announced within 12 hours, and the new tokens will be distributed to users' spot wallets at least 1 hour before trading begins. (This newsletter is generated with the assistance of AI)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734409&language=en-US",
            "pub_date": "2025-02-05 20:20:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734410,
            "title": "Binance Launches Berachain (BERA) on HODLer Airdrops – Earn Tokens Retroactively",
            "description": "Binance announced the introduction of the latest addition to its HODLer Airdrops program, Berachain (BERA). This initiative rewards users who participated in Simple Earn subscriptions with BNB from January 22 to January 26, 2025. The airdrops distribution is scheduled to be accessible within the next 12 hours, and the new BERA tokens will be deposited into users' Spot Wallets at least one hour before trading opens.Binance has set the listing date for BERA on February 6, 2025, at 13:00 UTC, with trading pairs including BTC, USDT, USDC, BNB, FDUSD, and TRY. A seed tag will be applied to BERA to mark its inception phase.Details of BERA HODLer Airdrops:Token Name: Berachain (BERA)Genesis Total Token Supply: 500,000,000 BERAMax Token Supply: Non-capped, with a 10% annual inflation rate based on emission typeHODLer Airdrops Token Rewards: 10,000,000 BERA, representing 2% of the Genesis Total Token SupplyCirculating Supply upon Listing: 107,480,000 BERA, accounting for 21.50% of the Genesis Total SupplyAdditional Marketing Allocation: 5,000,000 BERA will be allocated to marketing campaigns starting 12 months post-listingBinance's HODLer Airdrops is a novel program designed to reward BNB holders by providing token airdrops based on historical snapshots of their BNB balances. This system allows users to earn tokens passively without requiring continuous interaction, simply by subscribing their BNB to Simple Earn products.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734410&language=en-US",
            "pub_date": "2025-02-05 20:23:09",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734408,
            "title": "The total supply of Berachain (BERA) genesis tokens is 500 million",
            "description": "Odaily Planet Daily News Binance HODLer Airdrop Launches Berachain (BERA) Announcement Disclosure Information shows that the total supply of Berachain (BERA) Genesis Tokens is 500 million, and the maximum supply of tokens is unlimited (depending on the issuance type, the annual inflation rate is 10%). In addition, 5,000,000 BERA will be allocated to marketing activities in batches 12 months after the spot listing. The circulating supply before Binance listing: 107,480,000 BERA (accounting for 21.50% of the total supply of Genesis tokens).",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734408&language=en-US",
            "pub_date": "2025-02-05 20:24:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734404,
            "title": "U.S. Congressional Research Agency Raises Policy Issues Such as Allowing Cryptocurrency Companies to Directly Access the Federal Reserve's Main Account",
            "description": "Odaily Planet Daily News The U.S. Congressional Research Service (CRS) released a report on the Federal Reserve's policy issues, which involved the topics of cryptocurrency and digital currency and outlined some policy issues that Congress may want to consider, including: whether cryptocurrency companies and other non-traditional companies with federal or state banking licenses should be granted direct access to the Federal Reserve's discount window and master account. It is reported that the Federal Reserve previously refused to provide a master account in a legal dispute with Custodia Bank. The U.S. Congressional Research Service is a government organization responsible for outlining issues that the U.S. Congress may want to consider. In addition, the relevant report also involves some other crypto issues, including banks' participation in cryptocurrency business, stablecoins and central bank digital currencies (CBDC). (ledgerinsights)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734404&language=en-US",
            "pub_date": "2025-02-05 20:08:06",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734405,
            "title": "U.S. Congress Research Service Explores Federal Reserve Policy on Cryptocurrency",
            "description": "According to Odaily, the U.S. Congressional Research Service (CRS) has released a report addressing Federal Reserve policy issues, focusing on cryptocurrency and digital currency topics. The report outlines several policy considerations that Congress may wish to explore. Among these is whether cryptocurrency companies and other non-traditional firms with federal or state banking licenses should be granted direct access to the Federal Reserve's discount window and main accounts. Previously, the Federal Reserve denied main account access in a legal dispute with Custodia Bank. The CRS, a government organization, is responsible for outlining topics that the U.S. Congress may consider. The report also covers other cryptocurrency-related issues, including bank involvement in cryptocurrency activities, stablecoins, and central bank digital currencies (CBDCs).",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734405&language=en-US",
            "pub_date": "2025-02-05 20:13:34",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734403,
            "title": "Analyst: Bitcoin's current consolidation cycle may last until the end of February, and then it may rise to $120,000",
            "description": "Odaily Planet Daily News Independent analyst Arjantit said that Bitcoin's current consolidation cycle may last until the end of February, mainly for the following reasons:\nThe price of Bitcoin is consolidating after a 15-week rise (+105%);\nAs long as BTC/USD remains above $90,000, the daily trend structure will remain strong;\nHowever, falling below $90,000 may be a \"buying opportunity\";\nThe consolidation cycle may end at the end of February, after which BTC will rebound to $120,000. (Cointelegraph)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734403&language=en-US",
            "pub_date": "2025-02-05 20:16:24",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734391,
            "title": "Analyst: POL's key support level may be at $0.28",
            "description": "Odaily Planet Daily News Analyst Ali Martinez wrote on the X platform: \"Some people will understand, others will say it's contradictory. But the key support for POL may be $0.28.\"",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734391&language=en-US",
            "pub_date": "2025-02-05 20:02:33",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734394,
            "title": "Analyst Highlights Key Support Level For POL",
            "description": "According to Odaily, analyst Ali Martinez shared insights on the X platform, stating that while opinions may vary, the crucial support level for POL is identified at $0.28.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734394&language=en-US",
            "pub_date": "2025-02-05 20:03:33",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734390,
            "title": "Gate.io Innovation Zone Deposit and Listing Activity Launched $MAGT (MarsAgent)",
            "description": "Odaily Planet Daily News According to official news, the Gate.io Innovation Zone recharge and listing activity has launched the Meme project $MAGT (MarsAgent) at 19:00 (UTC+8) on February 5. Users can help $MAGT to be listed on the Gate.io Innovation Zone by recharging tokens. The prize pool size is 10,000 USDT.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734390&language=en-US",
            "pub_date": "2025-02-05 20:04:35",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}