{
    "data": [
        {
            "id": 1053609,
            "title": "GEOPOLITICS | U.S. Embassy Urges Citizens to Depart Lebanon Amid Rising Tensions",
            "description": "The U.S. Embassy in Lebanon has issued a statement urging American citizens to leave the country due to escalating tensions. According to Jin10, the advisory comes amid growing concerns over regional instability and potential threats to safety. The embassy emphasized the importance of prioritizing personal security and advised citizens to make arrangements to depart Lebanon at the earliest opportunity. This development reflects heightened geopolitical concerns in the region, prompting the U.S. government to take precautionary measures to ensure the safety of its nationals.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053609&language=en-US",
            "pub_date": "2026-02-28 21:55:51",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053608,
            "title": "Norwegian Oil and Gas Operator DNO Halts Production in Iraqi Kurdistan Following Iranian Strikes",
            "description": "Norwegian oil and gas operator DNO has suspended its oil production in the Iraqi Kurdistan region as a precautionary measure following Iranian military strikes. According to Jin10, the decision to halt operations was made to ensure the safety of personnel and infrastructure in the area. The Iranian attacks have raised concerns about the stability and security of energy production in the region, prompting DNO to take this protective step. The situation underscores the ongoing geopolitical tensions affecting the oil industry in the Middle East.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053608&language=en-US",
            "pub_date": "2026-02-28 21:55:56",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053607,
            "title": "U.S. House Minority Leader Criticizes Trump's Military Actions Against Iran",
            "description": "U.S. House Minority Leader Hakeem Jeffries has criticized President Donald Trump for not seeking congressional authorization before launching military strikes against Iran. According to Jin10, Jeffries expressed concern that the President's decision to bypass diplomatic efforts and initiate large-scale military actions has put U.S. military forces at risk of Iranian retaliation. Jeffries emphasized the importance of congressional oversight in matters of military engagement and highlighted the potential consequences of unilateral decisions in escalating international tensions.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053607&language=en-US",
            "pub_date": "2026-02-28 21:58:24",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053606,
            "title": "U.S. House Minority Leader Expresses Concerns Over Middle East Stability",
            "description": "U.S. House Minority Leader Hakeem Jeffries has expressed concerns about the approach to ensuring security and stability in the Middle East. According to Jin10, Jeffries highlighted that, similar to the lessons learned from the unsuccessful wars in Iraq and Afghanistan, achieving stability in the region requires more than just military force. He emphasized the need for a comprehensive strategy that goes beyond military intervention to address the complex challenges in the Middle East.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053606&language=en-US",
            "pub_date": "2026-02-28 22:00:06",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053589,
            "title": "Iranian Leaders Reported in Good Health Amid Security Concerns",
            "description": "Iran's Supreme Leader Ayatollah Ali Khamenei and President Ebrahim Raisi are reportedly in good health and secure, according to Jin10. This update comes amid ongoing regional tensions and international scrutiny of Iran's political landscape. The health and safety of these leaders are crucial as Iran navigates complex geopolitical challenges. The report aims to reassure both domestic and international audiences about the stability of Iran's leadership.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053589&language=en-US",
            "pub_date": "2026-02-28 21:42:22",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053588,
            "title": "Iran to Unveil Advanced Weaponry Amid Military Strategy Shift",
            "description": "Iran's Revolutionary Guard commander has revealed that recent missile launches utilized older stockpiles. According to NS3.AI, the commander announced plans to introduce and deploy new, advanced weapons featuring superior technology. This development suggests a notable escalation in Iran's military capabilities and strategic approach.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053588&language=en-US",
            "pub_date": "2026-02-28 21:43:02",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053591,
            "title": "Eleven U.S. senators have called on federal agencies to investigate Binance's compliance with sanctions.",
            "description": "Eleven U.S. senators have sent a letter to Treasury Secretary Scott Bessent and Attorney General Pamela Bondi, requesting a full review of Binance's compliance with U.S. sanctions and anti-money laundering requirements, and an assessment of its implementation of the 2023 settlement agreement. The letter cites reports that approximately $1.7 billion in digital assets flowed through Binance to entities linked to Iranian terrorism, including organizations affiliated with Houthis and the Islamic Revolutionary Guard Corps. Investigators also found access to over 1,500 accounts by Iranian users, and potential activities related to circumventing Russian sanctions. The letter further notes that some Binance compliance personnel who discovered suspicious transactions were subsequently dismissed, and law enforcement agencies stated that Binance's cooperation in providing customer information has declined. Senators Chris Van Hollen, Ruben Gallego, and nine other senators co-signed the letter, expressing concerns about Binance's payment cards and stablecoin-related projects in the former Soviet Union region, arguing that these products could be used to circumvent sanctions. The senators requested that relevant agencies report on the progress of the review by March 13. In addition, Senator Richard Blumenthal launched a congressional investigation into Binance on Tuesday, requesting relevant documents and internal records from Binance CEO Richard Teng. Binance denies the allegations, stating that it has identified and reported suspicious activity to authorities and does not allow Iranian users to use its platform. (Cointelegraph)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053591&language=en-US",
            "pub_date": "2026-02-28 21:47:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053590,
            "title": "Iran's defense minister and commander of the Islamic Revolutionary Guard Corps were killed in an Israeli attack.",
            "description": "Three sources familiar with the matter said that Iranian Defense Minister Amir Nasirzadeh and Islamic Revolutionary Guard Corps Commander Mohammad Pakpour were killed in an Israeli attack. (Jinshi)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053590&language=en-US",
            "pub_date": "2026-02-28 21:49:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053580,
            "title": "GEOPOLITICS | France, Germany, and UK Urge Iran to Halt Nuclear Program",
            "description": "France, Germany, and the United Kingdom have jointly called on Iran to cease its nuclear program. According to Jin10, the governments of these three nations have consistently pressured the Iranian regime to abandon its nuclear ambitions. The diplomatic efforts reflect ongoing concerns about regional stability and the potential implications of Iran's nuclear activities. The call for action underscores the importance of international cooperation in addressing nuclear proliferation issues.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053580&language=en-US",
            "pub_date": "2026-02-28 21:35:47",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053579,
            "title": "China's Strategic Approach Amid Iran Tensions",
            "description": "China has yet to officially respond to the recent tensions involving Iran. According to NS3.AI, state-affiliated media in China have attributed the situation to efforts by the U.S. and Israel to instigate regime change in Iran, implying that diplomatic discussions might be superficial. China is advocating for restraint and is focused on maintaining stability in the Strait of Hormuz to safeguard its energy interests.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053579&language=en-US",
            "pub_date": "2026-02-28 21:37:25",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053578,
            "title": "GEOPOLITICS | Russian Embassy Advises Citizens to Exit via Armenia or Azerbaijan",
            "description": "The Russian Embassy in Iran has issued a recommendation for its citizens to leave the country through Armenia or Azerbaijan. According to Jin10, this advisory comes amid rising geopolitical tensions in the region. The embassy's guidance aims to ensure the safety of Russian nationals as they navigate the current situation. The recommendation highlights the importance of choosing secure and stable routes for departure. This move reflects broader concerns about regional stability and the safety of foreign nationals in Iran.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053578&language=en-US",
            "pub_date": "2026-02-28 21:38:35",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053577,
            "title": "GEOPOLITICS | European Governments Distance Themselves from Recent Strike on Iran",
            "description": "Germany, France, and the United Kingdom have announced that they did not participate in the recent strike on Iran. According to Jin10, the governments of these countries emphasized their ongoing communication with international partners, including the United States, Israel, and regional allies. This statement comes amid heightened geopolitical tensions in the region. The European nations are maintaining close contact with their partners to monitor the situation and ensure stability.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053577&language=en-US",
            "pub_date": "2026-02-28 21:38:43",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053569,
            "title": "Iran claims the missile launches are merely a way to clear its inventory, and that it will soon deploy a series of \"mysterious weapons never before seen.\"",
            "description": "A senior commander of Iran's Revolutionary Guard, Jabari, issued a stern warning to US President Trump. He publicly stated that the missiles used in today's retaliatory action were merely \"old stock in a warehouse,\" implying that Iran's true strategic trump card has not yet been played. Jabari further revealed that Iran is about to showcase and deploy a series of \"mysterious weapons never before seen\" on the battlefield. He emphasized that the power and technological level of these advanced weapons will far exceed outside imagination, designed to deliver a devastating blow to aggressors. (CCTV International News)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053569&language=en-US",
            "pub_date": "2026-02-28 21:28:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053568,
            "title": "GEOPOLITICS | Trump Calls for Uprising in Iran Following US-Israel Strikes",
            "description": "U.S. President Donald Trump has called for an uprising in Iran, emphasizing the urgency of the situation. Bloomberg posted on X, highlighting Trump's appeal for action following a series of strikes launched by the United States and Israel against the regime in Tehran. Trump urged the Iranian people not to let this moment pass, signaling a significant geopolitical development in the region.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053568&language=en-US",
            "pub_date": "2026-02-28 21:29:18",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053558,
            "title": "GEOPOLITICS | Oil Tankers Halt Passage Through Strait of Hormuz",
            "description": "Oil tankers have temporarily ceased passage through the Strait of Hormuz, according to Jin10. The Strait of Hormuz is a critical chokepoint for global oil transportation, and any disruption in this area can have significant implications for the global oil market. The reasons behind the halt in tanker movement were not immediately clear, but such interruptions often raise concerns about potential geopolitical tensions or security issues in the region. The Strait of Hormuz is strategically important as it connects the Persian Gulf with the Gulf of Oman and the Arabian Sea, making it a vital route for oil exports from the Middle East. The situation is being closely monitored by international stakeholders due to its potential impact on oil prices and global energy security.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053558&language=en-US",
            "pub_date": "2026-02-28 21:13:10",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053557,
            "title": "U.S. Women's Hockey Team Considers Conditions for White House Visit",
            "description": "The U.S. women's hockey team is contemplating setting three conditions for a potential visit to the White House, rather than declining an invitation from U.S. President Donald Trump. Bloomberg posted on X, suggesting that the team could use this opportunity to address specific issues or concerns. This approach could allow the team to engage in meaningful dialogue while maintaining their stance on important matters. The conditions have not been specified, but the team's decision reflects a strategic approach to navigating political invitations.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053557&language=en-US",
            "pub_date": "2026-02-28 21:15:18",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053556,
            "title": "GEOPOLITICS | Poland Monitors Complex Situation in Tehran",
            "description": "Poland's Foreign Minister has confirmed the conclusion of discussions with the head of their office in Tehran. According to Jin10, embassy staff are safe, with only a few individuals registered at the Odysseus base, primarily those with dual citizenship. Poland is closely monitoring the dramatic and highly complex situation alongside its allies.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053556&language=en-US",
            "pub_date": "2026-02-28 21:16:20",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053555,
            "title": "GEOPOLITICS | Saudi Crown Prince and UAE President Discuss Iranian Attacks",
            "description": "Saudi Crown Prince Mohammed bin Salman and UAE President Sheikh Mohamed bin Zayed have engaged in discussions regarding Iran's recent attacks on the UAE and several regional countries. According to Jin10, the talks focused on the implications of these actions and potential measures to address the escalating tensions. The dialogue underscores the ongoing geopolitical challenges in the Middle East, as regional leaders seek to navigate complex security dynamics. The discussions reflect a shared concern over stability and security in the region, highlighting the importance of diplomatic engagement in resolving such conflicts.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053555&language=en-US",
            "pub_date": "2026-02-28 21:17:52",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053554,
            "title": "Wall Street Week Highlights Importance of Acknowledging Mistakes",
            "description": "David Westin emphasized the significance of recognizing and owning mistakes during this week's Wall Street Week. Bloomberg posted on X, highlighting Westin's discussion on how acknowledging errors can lead to growth and improvement in the financial sector. The conversation underscored the value of transparency and accountability in business practices, suggesting that admitting faults can foster trust and credibility among stakeholders. This approach is seen as crucial for navigating the complexities of the financial markets and maintaining a resilient economic environment.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053554&language=en-US",
            "pub_date": "2026-02-28 21:03:10",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053553,
            "title": "India's Anticipated Temperature Rise May Increase Power Demand and Health Risks",
            "description": "India is expected to experience above-normal temperatures in the upcoming months, which could lead to increased power demand and significant health risks for its residents. Bloomberg posted on X, highlighting concerns about the potential impact on the country's energy consumption and public health. The forecast suggests that the higher temperatures may strain the power grid as demand for cooling systems rises. Additionally, the heat poses a serious threat to public health, particularly for vulnerable populations. Authorities are urged to prepare for these challenges to mitigate the effects on both infrastructure and citizens.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053553&language=en-US",
            "pub_date": "2026-02-28 21:05:38",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}