{
    "data": [
        {
            "id": 1053092,
            "title": "U.S. Seized $580 Million From Crypto Scam Networks In Three Months",
            "description": "U. S. Attorney for the District of Columbia Jeanine Ferris Pirro announced this week that the newly formed strike force, operational since November 2025, has frozen and seized over $580 million in cryptocurrency assets tied to transnational fraud networks. The targets are the same organized crime operations that have quietly extracted billions from American victims for […] The post U\nsource: https://www.ethnews.com/u-s-seized-580-million-from-crypto-scam-networks-in-three-months/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053092&language=en-US",
            "pub_date": "2026-02-28 11:36:49",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053090,
            "title": "Maitong MSX plans to launch a Pre-IPO section, initially partnering with Republic to offer over ten million US dollars in unicorn IPO subscription quotas.",
            "description": "Decentralized RWA trading platform MSX has entered into a strategic partnership with Republic, a US-compliant private equity and asset tokenization platform, to launch a Pre-IPO section. This section will open access to assets from unlisted companies for eligible users, exploring the tokenization path for unlisted company equity assets. The initial allocation exceeds ten million US dollars, covering more than 10 top global unicorns, including SpaceX and ByteDance. Details regarding the specific list of targets and the amount released will be announced upon the official launch. Republic supports investors in participating in growth-stage company financing and alternative asset investments, holding related assets through regulated third-party custody institutions (such as BitGo Trust Company). Previously, Republic supported Robinhood's tokenized equity services for OpenAI and SpaceX launched in Europe.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053090&language=en-US",
            "pub_date": "2026-02-28 11:39:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053091,
            "title": "Uniswap Community Initiates Final Vote on Protocol Fee Switch Across Multiple Chains",
            "description": "Uniswap's community has launched a final vote on enabling protocol fee switches across eight chains, including Base, Arbitrum, OP Mainnet, World Chain, X Layer, Celo, Soneium, and Zora. According to Odaily, the proposal aims to redirect at least one-sixth of transaction fees from liquidity provider income into a 'token jar,' distributing equivalent UNI to holders through a burning mechanism. Since the fee-sharing began on Ethereum's mainnet v2 and some v3 pools late last year, approximately $3.3 million in revenue has been generated. The current plan also intends to cover the remaining v3 pools on Ethereum. The two related final votes are set to conclude on March 4.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053091&language=en-US",
            "pub_date": "2026-02-28 11:40:20",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053089,
            "title": "CZ: My personal memoir, *Freedom of Money*, is coming soon.",
            "description": "CZ stated on social media that The New York Times had reported on her upcoming memoir, *Freedom of Money*, but the report was based on an early draft and was published without authorization. CZ's lawyer, Teresa Goody Guillén, stated that the content cited in the report was neither in the final manuscript nor a statement by CZ herself. She expressed her hope that readers would enjoy the full version after the book's official publication. CZ also revealed that the book is still being edited, with each revision typically taking two to three weeks, and the official release date will be announced later.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053089&language=en-US",
            "pub_date": "2026-02-28 11:41:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053088,
            "title": "Tech Employees Support Anthropic's Ethical Stance on AI Military Use",
            "description": "Over 300 Google employees and more than 60 OpenAI staff have signed an open letter backing Anthropic in its ethical stance against military applications of its AI technology. According to Jin10, the letter urges tech leaders to respect Anthropic's ethical limitations concerning the use of AI in military contexts. This move highlights ongoing debates within the tech industry regarding the ethical implications of AI deployment in defense sectors.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053088&language=en-US",
            "pub_date": "2026-02-28 11:32:16",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053087,
            "title": "Latin America's Crypto User Growth Expected to Triple U.S. Rate by 2025",
            "description": "According to ChainCatcher, a report from Argentine crypto exchange Lemon reveals that Latin America's monthly active crypto users are projected to grow at three times the rate of the United States by 2025. The region's annual digital asset reception is expected to exceed $730 billion, marking a growth of over 60% and accounting for 10% of the global total.\n\nThe report highlights significant regional disparities. Brazil leads in capital scale with a reception exceeding $318 billion, driven by institutional trading and integration with local payment systems, showing an annual growth of nearly 250%. Argentina boasts the highest per capita monthly active user ratio, with a penetration rate reaching 12% of the total population, accounting for over a quarter of the region's activity.\n\nIn high-inflation economies like Argentina and Venezuela, users tend to use crypto assets as a store of value, with USDT widely adopted in everyday transactions in Venezuela. Meanwhile, more stable markets such as Peru and Colombia focus on financial returns. Stablecoins are identified as the key factor driving regional adoption, with continued rapid growth anticipated through 2025.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053087&language=en-US",
            "pub_date": "2026-02-28 11:33:37",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053083,
            "title": "Amundi Significantly Increases Stake in Strategy",
            "description": "Crypto Jargon posted on X. Amundi has significantly increased its stake in Strategy, boosting its holdings by 373%. The investment firm now holds a total of 4.79 million shares, valued at approximately $641 million. This move reflects the growing trend of indirect exposure to Bitcoin, as more traditional financial institutions seek to capitalize on the cryptocurrency market's potential.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053083&language=en-US",
            "pub_date": "2026-02-28 11:19:40",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053082,
            "title": "Crypto Traders Influenced by Headlines and Algorithms",
            "description": "Santiment posted on X that most cryptocurrency traders tend to react primarily to headlines and the information presented by their timeline algorithms. This behavior highlights the significant influence of media and algorithm-driven content on trading decisions in the crypto market. The post suggests that traders often rely on these sources to guide their investment strategies, which can lead to reactive rather than proactive decision-making. Understanding this trend is crucial for market participants aiming to navigate the volatile crypto landscape effectively.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053082&language=en-US",
            "pub_date": "2026-02-28 11:19:59",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053081,
            "title": "Nvidia will launch a dedicated AI inference chip, with OpenAI potentially becoming one of its major customers.",
            "description": "NVIDIA is about to launch a dedicated processing chip for artificial intelligence inference scenarios, designed to improve AI query processing speed and enhance model responsiveness. Reports indicate that OpenAI is expected to be one of the major customers for this new processor. The chip focuses on optimizing the inference performance of AI models in real-world applications and is expected to be officially released at the NVIDIA GTC developer conference in San Jose next month. (Wall Street Journal)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053081&language=en-US",
            "pub_date": "2026-02-28 11:21:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053080,
            "title": "Uniswap has initiated a final vote on the multi-chain fee switch, proposing to allocate a portion of the fees to UNI holders.",
            "description": "The Uniswap community has launched a final vote on enabling protocol fee switching on eight chains: Base, Arbitrum, OP Mainnet, World Chain, X Layer, Celo, Soneium, and Zora. The proposal suggests allocating at least one-sixth of transaction fees from liquidity providers' revenue to a \"token jar,\" which will then be distributed to token holders by burning an equivalent amount of UNI. Previously, Ethereum mainnet v2 and some v3 pools have generated approximately $3.3 million in revenue since fee sharing began at the end of last year. This proposal also plans to cover the remaining Ethereum v3 pools. The two final votes will conclude on March 4th. (DL News)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053080&language=en-US",
            "pub_date": "2026-02-28 11:22:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053078,
            "title": "Nvidia Prepares to Launch Dedicated AI Chip, OpenAI Set to Be Major Customer",
            "description": "Nvidia is reportedly gearing up to introduce a specialized chip aimed at transforming the competitive landscape in AI computing. According to Jin10, OpenAI is expected to become one of the largest customers for Nvidia's new processor. This development marks a significant move in the tech industry, as Nvidia seeks to strengthen its position in the rapidly evolving AI sector.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053078&language=en-US",
            "pub_date": "2026-02-28 11:06:18",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053077,
            "title": "Nvidia CEO Jensen Huang: AI Revolutionizing Industries with New Software Development Approach",
            "description": "Nvidia CEO Jensen Huang has emphasized the transformative impact of artificial intelligence on software development. According to Bitalk News, Huang stated that AI has recently reached its third major turning point, with AI agents now capable of reasoning, accepting tasks, and completing computational work. The demand for AI has surged to unprecedented levels. Huang highlighted that AI fundamentally represents a new method of software development, influencing every company and transforming every industry, driven collectively by nations worldwide. This marks a new industrial revolution.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053077&language=en-US",
            "pub_date": "2026-02-28 11:06:51",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053076,
            "title": "Anthropic will sue the U.S. Department of Defense.",
            "description": "Anthropic has vowed to challenge the U.S. Department of Defense's decision to blacklist it in court, after the latter claimed the company refused to lift all restrictions on the military's use of its Claude model. The company also said it was \"deeply saddened\" by the escalating dispute. This cutting-edge artificial intelligence company is doing what few other companies have done since Trump returned to the White House: directly and openly challenging the Trump administration. Trump and Defense Secretary Hergesse threatened earlier Friday to cut off Anthropic from numerous customers through a \"supply chain risk\" designation, a practice historically reserved for \"foreign adversaries.\" Anthropic stated, \"No matter how the 'Department of War' intimidates or punishes us, it will not change our position on mass surveillance or fully automated weapons.\" \"We will challenge any supply chain risk designation through legal means.\" (Jinshi)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053076&language=en-US",
            "pub_date": "2026-02-28 11:11:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053075,
            "title": "Sam Altman: OpenAI will collaborate with the U.S. War Department to deploy models on classified networks.",
            "description": "OpenAI co-founder Sam Altman stated on X that the company has reached an agreement with the U.S. Department of War to deploy OpenAI models in its classified network environment. Under the terms of the agreement, the models cannot be used for large-scale domestic surveillance, and the agreement emphasizes that any application involving the use of force (including potential autonomous weapon systems) must adhere to the principle of \"human responsibility.\" OpenAI stated that it will build technical security measures for this deployment, ensuring the models run only on a cloud network, and will send field deployment engineers (FDEs) to participate in ensuring model security. OpenAI also stated that it has called on relevant departments to offer similar terms to other artificial intelligence companies to reduce legal and regulatory disputes through agreements.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053075&language=en-US",
            "pub_date": "2026-02-28 11:13:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053072,
            "title": "Anthropic PBC's Strong Start in Global AI Competition",
            "description": "Anthropic PBC has begun the year with significant momentum, marked by increasing sales and the launch of several viral products. Bloomberg posted on X, highlighting the company's successful large funding round, which has positioned it favorably in the competitive global AI landscape. The startup's achievements have provided it with a substantial edge in the ongoing race to advance artificial intelligence technologies.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053072&language=en-US",
            "pub_date": "2026-02-28 10:57:04",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053071,
            "title": "OpenAI Founder Urges Resolution to Avoid Legal and Government Actions",
            "description": "OpenAI founder Sam Altman expressed a strong desire for tensions to ease and for a reasonable agreement to be reached, avoiding legal and government interventions. According to Jin10, Altman emphasized the importance of finding a peaceful resolution to ongoing issues, highlighting the potential negative impact of escalating conflicts. His comments reflect a broader sentiment within the tech industry, where leaders are increasingly advocating for dialogue and cooperation over litigation and regulatory measures. Altman's statement underscores the need for constructive engagement to address challenges and foster innovation.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053071&language=en-US",
            "pub_date": "2026-02-28 10:59:32",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053070,
            "title": "OpenAI to Deploy Engineers for Model Safety",
            "description": "OpenAI founder Sam Altman announced that the company will deploy frontline engineers to assist with their models. According to Jin10, this move aims to ensure the safety of the models by conducting deployments exclusively on cloud networks.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053070&language=en-US",
            "pub_date": "2026-02-28 11:02:44",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053069,
            "title": "Aave DAO Votes on $42 Million Proposal Amid Controversy",
            "description": "Aave DAO is currently voting on a significant proposal to allocate up to $42 million to Aave Labs, with $25 million earmarked for ongoing product development and $17.5 million for milestone bonuses. According to ChainCatcher, as of Friday evening, the proposal had a narrow lead with 52% support, and the voting is set to conclude on Saturday.\n\nThe proposal has sparked debate due to Aave Labs' initial plan to limit the development of version 3 (v3) and force users to migrate to the yet-to-be-launched version 4 (v4). This plan faced strong opposition, leading the main contractor, Bored Ghosts Developing, to announce it would not renew its contract, criticizing the proposal as nearly absurd. In response, Aave Labs has made concessions, promising not to enforce the migration and to continue supporting v3.\n\nCritics, represented by Marc Zeller, argue that the requested funds are excessive, accounting for 31% of the DAO's reserves, and have called for the proposal to be split into multiple separate votes. However, Aave Labs is pushing for a single comprehensive vote. Currently, Aave v3 holds deposits exceeding $26.3 billion, representing over 97% of the protocol's total deposits.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053069&language=en-US",
            "pub_date": "2026-02-28 11:03:50",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053065,
            "title": "JUST IN: BITCOIN MINING GIANT REPORTS $1.7 BILLION LOSS\n\nMARA, one of the world's largest Bitcoin miners, reported a Q4 loss of some $1.7 billion.\n\nThe loss was driven by a collapse in $BTC's price during the period.\n\nAt the end of the year, it still held a staggering 53,822",
            "description": "null\nsource: https://x.com/BSCNews/status/2027570952595538010",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053065&language=en-US",
            "pub_date": "2026-02-28 10:26:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053064,
            "title": "Many newly created wallets are buying $EDEL!\n\nWallet 0x2942 was created 2 days ago and spent 50.75 $ETH($103K) to buy 6.7M $EDEL.\n\nWallet 0x7a06 was created 7 hours ago and spent 30.72 $ETH($59K) to buy 3.17M $EDEL.\n\nWallet 0xd365 was created 21 hours ago, received 100K $USDC to",
            "description": "null\nsource: https://x.com/lookonchain/status/2027573102344081602",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053064&language=en-US",
            "pub_date": "2026-02-28 10:34:32",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}