{
    "data": [
        {
            "id": 1054572,
            "title": "PRECIOUS METALS | Gold Demand Expected to Rise Amid Geopolitical Tensions",
            "description": "Gold demand is anticipated to increase as markets open on Monday, according to Tim Waterer, Chief Market Analyst at KCM Trade. According to Jin10, Waterer suggests that ongoing conflicts, potential involvement of other countries, and inflation concerns are likely to position gold as a preferred safe-haven asset. As a result, equities and other risk assets may face sell-offs, with investors seeking optimal places to allocate their funds, placing gold at the top of their list.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054572&language=en-US",
            "pub_date": "2026-03-01 22:13:59",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054569,
            "title": "Analysts: Gold will once again become the preferred safe-haven asset.",
            "description": "Tim Waterer, chief market analyst at KCM Trade, said demand for gold is likely to be higher than usual when markets open on Monday. Given risks such as the potential duration of the conflict, which other countries might be drawn in, and inflation concerns, gold is expected to regain its role as the preferred safe-haven asset. Stocks and other risky assets may be sold off, and investors will seek optimal places to hold their money, with gold likely to be at the top of that list. (Jinshi)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054569&language=en-US",
            "pub_date": "2026-03-01 22:15:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054571,
            "title": "Emerging Markets ETF Outperforms U.S. Markets Over the Past Year",
            "description": "The emerging markets ETF, $EEM, has significantly outperformed U.S. markets over the past year and year-to-date. Bespoke Investment Group posted on X. Despite this strong performance, $EEM has only recently surpassed its pre-Global Financial Crisis (GFC) high from 2007. In contrast, the S&P 500's $SPY price has increased by more than 350% from its pre-GFC high.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054571&language=en-US",
            "pub_date": "2026-03-01 22:16:12",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054570,
            "title": "Bitcoin(BTC) Drops Below 67,000 USDT with a Narrowed 3.23% Increase in 24 Hours",
            "description": "On Mar 01, 2026, 14:17 PM(UTC). According to Binance Market Data, Bitcoin has dropped below 67,000 USDT and is now trading at 66,995.5 USDT, with a narrowed narrowed 3.23% increase in 24 hours.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054570&language=en-US",
            "pub_date": "2026-03-01 22:17:07",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054563,
            "title": "GEOPOLITICS | Former Iranian President Mahmoud Ahmadinejad Reportedly Killed in Attack",
            "description": "Former Iranian President Mahmoud Ahmadinejad has reportedly been killed in an attack, according to international media reports cited by Xinhua News Agency on March 1. According to Ming Pao, Israeli media outlet Ynet also confirmed the news, referencing reports from Iranian television.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054563&language=en-US",
            "pub_date": "2026-03-01 22:01:49",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054562,
            "title": "Stock Market Insights Shared on Social Media",
            "description": "Bespoke Investment Group posted on X, offering insights into the current stock market trends. The group regularly shares analysis and updates, providing valuable information for investors and market enthusiasts. Their recent post highlighted key factors influencing market movements, emphasizing the importance of staying informed in a rapidly changing economic environment. Bespoke's analysis is known for its depth and accuracy, making it a reliable source for those seeking to understand market dynamics. Investors are encouraged to consider these insights when making financial decisions.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054562&language=en-US",
            "pub_date": "2026-03-01 22:03:27",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054561,
            "title": "Iranian Missile Strike on Israeli Residential Building Results in Nine Fatalities",
            "description": "At least nine individuals have lost their lives following an Iranian missile strike on a residential building in Israel. CNN Breaking News posted on X, highlighting this as the deadliest attack since Tehran initiated retaliatory strikes. The incident marks a significant escalation in tensions between the two nations, with the international community closely monitoring the situation. Further details on the aftermath and responses from both countries are expected as the story develops.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054561&language=en-US",
            "pub_date": "2026-03-01 22:03:59",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054565,
            "title": "Iranian Foreign Minister: A new Supreme Leader could be elected within a day or two.",
            "description": "Iran's foreign minister announced that a new supreme leader could be elected within a day or two, and regime change is impossible. Iran has no intention of closing the Strait of Hormuz at this stage, nor does it plan to interfere with navigation there. (Jin Shi)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054565&language=en-US",
            "pub_date": "2026-03-01 22:06:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054556,
            "title": "Ethereum(ETH) Surpasses 2,000 USDT with a 6.04% Increase in 24 Hours",
            "description": "On Mar 01, 2026, 13:53 PM(UTC). According to Binance Market Data, Ethereum has crossed the 2,000 USDT benchmark and is now trading at 2,009.839966 USDT, with a narrowed 6.04% increase in 24 hours.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054556&language=en-US",
            "pub_date": "2026-03-01 21:53:07",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054558,
            "title": "Iran launches four missiles at US aircraft carrier",
            "description": "On the afternoon of March 1st local time, the Public Relations Department of the Iranian Islamic Revolutionary Guard Corps issued Announcement No. 7. The announcement stated that the USS Abraham Lincoln aircraft carrier was attacked by four Iranian ballistic missiles. (Jin Shi)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054558&language=en-US",
            "pub_date": "2026-03-01 21:56:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054557,
            "title": "A wallet created seven months ago withdrew 384 PAXG tokens from Binance, worth $2.07 million.",
            "description": "According to Onchain Lens, a wallet that was created seven months ago withdrew 384 PAXG from Binance, worth $2.07 million.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054557&language=en-US",
            "pub_date": "2026-03-01 21:57:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054551,
            "title": "Maersk Reroutes Ships Amid Middle East Tensions",
            "description": "Shipping giant Maersk announced on Sunday plans to reroute its Middle East-India to Mediterranean and Middle East-India to U.S. East Coast shipping routes due to escalating tensions in the Middle East. According to Jin10, the company stated that its vessels will now navigate around the Cape of Good Hope. Maersk also mentioned the suspension of future Suez Canal crossings through the Bab el-Mandeb Strait, while continuing to accept cargo bookings destined for the Middle East.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054551&language=en-US",
            "pub_date": "2026-03-01 21:40:27",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054550,
            "title": "GEOPOLITICS | U.S. Embassy in Jerusalem Lacks Capacity for Evacuation Assistance",
            "description": "The U.S. Embassy in Jerusalem has announced that it currently does not have the capability to facilitate evacuation or directly assist American citizens in leaving the region. According to Jin10, the embassy's statement highlights the limitations in providing direct support for U.S. nationals amid ongoing geopolitical tensions. The embassy advises citizens to remain informed about the situation and follow any guidance provided by local authorities.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054550&language=en-US",
            "pub_date": "2026-03-01 21:43:54",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054549,
            "title": "SpaceX's Bitcoin Holdings Decline Amid IPO Plans",
            "description": "SpaceX currently holds about 8,285 BTC, valued at approximately $545 million, a decrease from $780 million three months ago. According to NS3.AI, the company has not sold any of its Bitcoin holdings despite the decline in value. SpaceX is planning a $50 billion IPO, which could potentially value the company at $1.75 trillion. This move would necessitate the disclosure of its Bitcoin holdings and any associated paper gains or losses. Unlike Tesla, SpaceX's strategy involves holding Bitcoin for the long term rather than engaging in active trading, even amidst significant valuation changes.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054549&language=en-US",
            "pub_date": "2026-03-01 21:45:26",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054548,
            "title": "Guinea and U.S. Sign $143 Million Agreement to Enhance Health Systems",
            "description": "Guinea has entered into a $143 million memorandum of understanding with the United States aimed at strengthening its health systems. Bloomberg posted on X, highlighting the announcement made by Guinea's Finance Minister Mariama Ciré Sylla. This agreement is part of ongoing efforts to improve healthcare infrastructure and services in the West African nation. The collaboration is expected to address critical health challenges and enhance the overall capacity of Guinea's health sector.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054548&language=en-US",
            "pub_date": "2026-03-01 21:47:14",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054546,
            "title": "BNP Paribas pilots Ethereum tokenized fund issuance",
            "description": "BNP Paribas tests tokenized money market fund shares on Ethereum, advancing regulated blockchain integration in traditional finance.\nsource: https://catenaa.com/markets/cryptocurrencies/bnp-paribas-pilots-ethereum-tokenized-fund-issuance/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054546&language=en-US",
            "pub_date": "2026-03-01 21:30:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054545,
            "title": "Sydney Home Prices Remain Unchanged Amid Growth in Other Major Cities",
            "description": "Sydney's housing market experienced stagnation in February, contrasting with the continued growth observed in other major cities. Bloomberg posted on X, highlighting the disparity in real estate trends across the country. While cities like Melbourne and Brisbane saw significant increases in home prices, Sydney's market remained flat, raising questions about the factors influencing these regional differences. Analysts suggest that local economic conditions and buyer sentiment may be contributing to the varied performance in the housing sector. Despite the overall national trend of rising property values, Sydney's market appears to be an exception, prompting further scrutiny from industry experts.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054545&language=en-US",
            "pub_date": "2026-03-01 21:28:49",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054538,
            "title": "Incident Reported Near UAE's Mina Saqr Port",
            "description": "An incident has been reported near the Mina Saqr Port in the United Arab Emirates, according to the UK Maritime Trade Operations. The location of the event is approximately 17 nautical miles northwest of the port. Further details about the nature of the incident have not been disclosed at this time.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054538&language=en-US",
            "pub_date": "2026-03-01 21:22:58",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054537,
            "title": "Minneapolis' Response to Federal Deportation Campaign Offers Global Insights",
            "description": "Minneapolis has demonstrated a noteworthy approach in dealing with the federal government's intensified deportation efforts. Bloomberg posted on X, highlighting how the city's strategies could serve as valuable lessons for other regions facing similar challenges. The city's response emphasizes community support and advocacy, aiming to protect affected individuals and families. This approach has garnered attention for its potential to influence broader policy discussions and inspire other communities to adopt similar measures. Minneapolis' actions underscore the importance of local initiatives in addressing national issues, offering a model for effective community engagement and resilience.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054537&language=en-US",
            "pub_date": "2026-03-01 21:25:19",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054536,
            "title": "Financial Firms Activate Contingency Plans Amid UAE Attacks",
            "description": "Major financial institutions, including JPMorgan and Citigroup, are implementing contingency measures for their Gulf operations as the United Arab Emirates faces attacks. Bloomberg posted on X, highlighting the strategic adjustments being made by these firms to ensure the safety and continuity of their operations in the region. Hedge funds are also reportedly taking similar precautions.\n\nThe UAE, a significant financial hub in the Middle East, has been experiencing increased security threats, prompting these companies to reassess their operational strategies. The measures being adopted include relocating staff, enhancing security protocols, and revising business continuity plans.\n\nThese developments underscore the growing geopolitical tensions in the region and their potential impact on global financial markets. The actions taken by these financial firms reflect their commitment to safeguarding their employees and maintaining business operations amidst the escalating situation.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054536&language=en-US",
            "pub_date": "2026-03-01 21:26:56",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}