{
    "data": [
        {
            "id": 733876,
            "title": "Meet the US Congressman Who's Now Repping Ethereum on His X Profile",
            "description": "Rep. William Timmons said that he created a self-custodial Ethereum wallet to gain familiarity with technology enabling financial sovereignty.\nsource: https://decrypt.co/304425/meet-us-congressman-repping-ethereum-x-profile",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733876&language=en-US",
            "pub_date": "2025-02-05 07:25:28",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733875,
            "title": "#Bitcoin Drops After #Crypto Czar Press Conference\n🟠 BTC fell to $97,690 (-3.79%) after David Sacks’ speech lacked specifics on a U.S. Bitcoin Reserve.\n🟠 Market uncertainty rises as U.S.-China trade tensions escalate.\n🟠 $BTC intraday: High $101,752 | Low $96,026.",
            "description": "null\nsource: https://x.com/Bitcoinsensus/status/1886920355219956149",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733875&language=en-US",
            "pub_date": "2025-02-05 07:30:44",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733874,
            "title": "Short the market on WEEX for up to $20k as a welcome bonus and 50% off all fees using our referral link  in the thumbnail below ⬇️⬇️",
            "description": "null\nsource: https://x.com/Bitcoinsensus/status/1886920358562795617",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733874&language=en-US",
            "pub_date": "2025-02-05 07:30:45",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733879,
            "title": "Circle Issues 250 Million USDC on Solana Blockchain",
            "description": "According to BlockBeats, on February 5, blockchain data revealed that Circle has issued an additional 250 million USDC on the Solana blockchain two hours ago.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733879&language=en-US",
            "pub_date": "2025-02-05 07:33:33",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733871,
            "title": "WazirX creditors to decide on recovery plan or risk lengthy liquidation",
            "description": "WazirX creditors will decide in the coming weeks whether to begin receiving compensation for their lost crypto as early as April 2025 or face a prolonged recovery process that could extend to 2030. The vote follows a Singapore High Court ruling allowing the embattled Indian exchange to pursue a restructuring plan rather than face liquidation. The […]\nThe post WazirX creditors to decide on...\nsource: https://cryptoslate.com/wazirx-creditors-to-decide-on-recovery-plan-or-risk-lengthy-liquidation/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733871&language=en-US",
            "pub_date": "2025-02-05 07:15:46",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733870,
            "title": "Tether and Circle minted a total of $1.25 billion in stablecoins in the past 6 hours",
            "description": "Odaily Planet Daily News According to Onchain Lens monitoring, in the past 6 hours: \n- Tether minted $1 billion USDT on the Tron network, and a total of $2 billion USDT has been minted so far in 2025; \n- Circle minted $250 million USDC on Solana, and a total of $6.5 billion USDC has been minted on Solana so far in 2025.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733870&language=en-US",
            "pub_date": "2025-02-05 07:21:08",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733872,
            "title": "Tether And Circle Increase Stablecoin Supply In 2025",
            "description": "According to Odaily, recent data from Onchain Lens reveals significant stablecoin activity over the past six hours. Tether has minted $1 billion USDT on the Tron network, contributing to a total of $2 billion USDT minted so far in 2025. Meanwhile, Circle has minted $250 million USDC on the Solana network, bringing its total USDC issuance on Solana to $6.5 billion this year.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733872&language=en-US",
            "pub_date": "2025-02-05 07:23:34",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733868,
            "title": "Analyst Flags Massive Bitcoin Price Crash to $74,000, Cites Onchain Metrics",
            "description": "A crypto analyst hinted at a potential price decline if bearish factors remain in the market. As bulls lose steam, Bitcoin traders have faced consistent sell pressure.\nsource: https://zycrypto.com/analyst-flags-massive-bitcoin-price-crash-to-74000-cites-onchain-metrics/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733868&language=en-US",
            "pub_date": "2025-02-05 07:07:59",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733867,
            "title": "SEC Reduces Cryptocurrency Enforcement Team Amid Regulatory Changes",
            "description": "According to PANews, the U.S. Securities and Exchange Commission (SEC) is downsizing a special unit dedicated to cryptocurrency enforcement, which previously comprised over 50 lawyers and staff. This move is among the initial steps taken by U.S. President Donald Trump and his administration to lessen regulation on cryptocurrencies and other digital assets. One of Trump's early executive orders aims to promote cryptocurrency development and reduce excessive regulation on digital assets.\n\nSources indicate that some lawyers from the cryptocurrency unit are being reassigned to other departments within the SEC. A senior lawyer from the unit has been transferred out of the enforcement division, with some insiders describing the move as an unfair demotion.\n\nCurrent SEC Acting Chairman Mark T. Uyeda has made several appointments while adjusting other senior positions within the SEC, which employs over 1,000 lawyers. One of Uyeda's initial actions was to establish a group to review the SEC's approach to digital assets. This task force is led by SEC Commissioner Hester Peirce, a vocal supporter of cryptocurrencies.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733867&language=en-US",
            "pub_date": "2025-02-05 07:03:35",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733854,
            "title": "Trump’s crypto moves could upend the public payment network",
            "description": "Custodia Bank CEO Caitlin Long says Trump's crypto moves could lead to an upending of the public payment network.\nsource: https://www.theblock.co/post/338903/trumps-crypto-moves-could-upend-the-public-payment-network?utm_source=rss&utm_medium=rss",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733854&language=en-US",
            "pub_date": "2025-02-05 06:42:46",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}