{
    "data": [
        {
            "id": 1053182,
            "title": "Zhou Hongyi: The US government fabricated a large number of victims and evidence in the Chen Zhi case, with the fundamental purpose of \"legally\" seizing $15 billion in assets.",
            "description": "Zhou Hongyi, founder of 360 Group, stated on his personal social media that the Bitcoin migration in the Chen Zhi case of Prince Group occurred in 2020, during Trump's first term. After Biden took office in 2021, the United States discovered that the origin of these cryptocurrencies was unclear, but did not immediately take action to openly seize them. Instead, it kept the assets in a technologically controllable dormant state for a long time until Trump took office again in 2025. Only then did the US government take the opportunity to publicly announce the seizure of these assets. However, what is strange is that, according to the legal documents of the US government's lawsuit against Chen Zhi, no US citizens were victims of telecommunications fraud before the theft of these digital assets. This is like shooting an arrow before finding a target. To be more specific, the United States has formed a perfect closed loop of \"attack, harvest, and evidence collection\". Ironically, after the U.S. Department of Justice released the indictment on October 8, 2025, several so-called victim compensation groups emerged in the United States. However, in-depth analysis revealed that these claimants were victims of telecom fraud from May 2020 to August 2022, and the time and flow of assets did not match up with this batch of Bitcoins. In other words, this batch of Bitcoins was stolen by hackers as early as December 2020, and has absolutely nothing to do with these so-called victims in the United States. The so-called victims are merely a backdrop to provide witnesses for the \"legal confiscation.\" The entire indictment itself is riddled with loopholes and is a typical piecemeal compilation. For example, the \"cell phone wall\" image in the indictment is actually a criminal tool used by online troll groups exposed by CCTV's 315 Gala in March 2023. The stools in the image are common and frequently used in China. This kind of low-level error of misattribution not only exposes the sloppy evidence collection process, but also reveals the true intention of using the fight against crime as a pretext to cover up the nature of asset plunder. Therefore, the most terrifying thing about state-sponsored attacks is not a single breakthrough, but long-term infiltration and control. Once the rules and law enforcement conditions are met, the entire operation can be carried out in one go. You may think they are fighting crime, but in reality, they are often turning other people's assets into their own \"strategic reserves.\"",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053182&language=en-US",
            "pub_date": "2026-02-28 14:00:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053177,
            "title": "U.S. President Trump Praises Belarusian Leader",
            "description": "U.S. President Donald Trump expressed positive sentiments about Belarus, stating that the relationship between the two countries is very good. According to Jin10, Trump mentioned his admiration for the Belarusian leader, highlighting his respect for him.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053177&language=en-US",
            "pub_date": "2026-02-28 13:47:08",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053174,
            "title": "Bitdeer sold 166 BTC this week.",
            "description": "According to official data, Nasdaq-listed Bitcoin mining company Bitdeer sold 166 BTC this week, with a net inflow of 0 BTC.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053174&language=en-US",
            "pub_date": "2026-02-28 13:50:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053176,
            "title": "Ethereum Spot ETF Experiences Significant Outflow",
            "description": "According to Odaily, data from SoSoValue indicates that on February 27 (Eastern Time), Ethereum spot ETFs saw a total net outflow of $42.9992 million. The largest single-day net outflow was recorded by Blackrock's ETF ETHA, which experienced a net outflow of $42.9992 million. Despite this, ETHA's historical total net inflow has reached $11.833 billion.\n\nAs of the time of reporting, the total net asset value of Ethereum spot ETFs stands at $10.956 billion, with the ETF net asset ratio (market value compared to Ethereum's total market value) at 4.72%. The historical cumulative net inflow has reached $11.605 billion.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053176&language=en-US",
            "pub_date": "2026-02-28 13:51:48",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053175,
            "title": "U.S. and China Compete in AI Investment",
            "description": "Stacy Muur posted on X about the ongoing competition between the United States and China in the field of artificial intelligence investment. In the United States, AI companies are reportedly raising hundreds of billions of dollars, showcasing a significant financial commitment to advancing technology. Meanwhile, China is also heavily investing billions of dollars in AI development, indicating a strong focus on enhancing its technological capabilities. This rivalry highlights the global race to lead in AI innovation and development.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053175&language=en-US",
            "pub_date": "2026-02-28 13:52:11",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053172,
            "title": "Ethereum spot ETFs saw a total net outflow of $42.9992 million yesterday, with BlackRock's ETHA experiencing the largest net outflow of $42.9992 million.",
            "description": "According to SoSoValue data, Ethereum spot ETFs saw a total net outflow of $42.9992 million yesterday (February 27th, Eastern Time). The Ethereum spot ETF with the largest single-day net outflow was the BlackRock ETF ETHA, with a net outflow of $42.9992 million. Currently, ETHA's historical total net inflow has reached $11.833 billion. As of press time, the total net asset value of Ethereum spot ETFs is $10.956 billion, with an ETF net asset value ratio (market capitalization as a percentage of Ethereum's total market capitalization) of 4.72%, and a historical cumulative net inflow of $11.605 billion.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053172&language=en-US",
            "pub_date": "2026-02-28 13:40:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053173,
            "title": "Bitcoin spot ETFs saw a total net outflow of $27.55 million yesterday, with only BlackRock IBIT experiencing a net outflow.",
            "description": "According to SoSoValue data, Bitcoin spot ETFs saw a total net outflow of $27.5503 million yesterday (February 27th, Eastern Time). The Bitcoin spot ETF with the largest single-day net inflow was Invesco and Galaxy Digital's BTCO ETF, with a net inflow of $3.2658 million. BTCO's historical total net inflow has reached $230 million. This was followed by Franklin Bitcoin ETF EZBC, with a net inflow of $1.8953 million, bringing EZBC's historical total net inflow to $346 million. The Bitcoin spot ETF with the largest single-day net outflow was BlackRock's IBIT ETF, with a net outflow of $32.7114 million. IBIT's historical total net inflow has reached $61.806 billion. As of press time, the total net asset value of Bitcoin spot ETFs is $83.402 billion, with an ETF net asset ratio (market capitalization as a percentage of Bitcoin's total market capitalization) of 6.36%, and a cumulative net inflow of $54.8 billion.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053173&language=en-US",
            "pub_date": "2026-02-28 13:40:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053170,
            "title": "US Pentagon designates Anthropic a supply chain risk to national security – What’s really going on?",
            "description": "Anthropic is now tagged as a Supply-Chain Risk to National Security by the Department of War, according to U. S. Defense Secretary Pete Hegseth, who posted a long statement on X targeting the AI company. Pete said his department is permanently breaking up with Anthropic, adhering to President Donald Trump’s public demanda that all federal government […]\nsource: https://www.cryptopolitan.com/us-pentagon-anthropic-national-security/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053170&language=en-US",
            "pub_date": "2026-02-28 13:20:46",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053171,
            "title": "Planet Midday News",
            "description": "1. CZ: Personal memoir \"Freedom of Money\" is about to be published; 2. CZ responds to questions about the Chinese title of his new book: tentatively titled \"Binance Life,\" subject to change; 3. YZi Labs questions 10X Capital's failure to disclose its over 5% stake in CEA Industries, demanding SEC filings; 4. Coinbase Chief Policy Officer: The company is involved in stablecoin yield negotiations, stating that the GENIUS Act and public interest are at the core; 5. OpenAI has fired an employee who profited from using company confidential information on Polymarket; 6. Japanese listed company Daido Rimet has decided to purchase up to 1 billion yen worth of Bitcoin; 7. Arkham analyst corrects: Trump Media Technology Group did not sell 2,000 BTC, but transferred them as collateral; 8. Crypto startups raised $883 million in February, a 13% year-on-year decrease; 9. Anthropic will sue the U.S. Department of Defense; 10. Sam Altman: OpenAI 11. Uniswap initiated a final vote on the multi-chain fee switch, proposing to allocate a portion of the fees to UNI holders. (The text also mentions a collaboration with the U.S. War Department to deploy models on classified networks.)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053171&language=en-US",
            "pub_date": "2026-02-28 13:30:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053169,
            "title": "Japanese Researchers Develop Melon with On-Demand Ripening to Boost Exports",
            "description": "Japanese researchers from the National Agriculture and Food Research Organization and the University of Tsukuba have developed a new type of melon that can ripen on demand. According to Jin10, this innovation aims to address the issue of the relatively short shelf life of melons, thereby enhancing their export potential. The development is expected to significantly benefit the agricultural export sector by providing a more flexible and reliable product for international markets.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053169&language=en-US",
            "pub_date": "2026-02-28 13:21:34",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053165,
            "title": "Beast Industries CEO Jeff Housenbold Expresses Strong Support for Ethereum as a Blockchain Pillar",
            "description": "Jeff Housenbold, President and CEO of Beast Industries, has expressed strong support for Ethereum, highlighting its role as a core pillar of stablecoins and blockchain technology. According to Bitalk News, Housenbold emphasized the significance of the DeFi movement, noting its contribution to broader accessibility, financial democratization, and reduced capital costs for consumers. He also pointed out the secure and reliable global transfer of funds enabled by these technologies.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053165&language=en-US",
            "pub_date": "2026-02-28 13:08:50",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053164,
            "title": "BlackRock and Goldman Sachs Compete to Fund Phoenix Group's Pension Risk Expansion",
            "description": "BlackRock and Goldman Sachs are entering the competition to provide funding for Phoenix Group's pension risk transfer business expansion. According to Jin10, this move comes as U.S. investors increasingly engage with the UK retirement plan market. The involvement of these major asset management firms highlights the growing interest in pension risk transfer strategies, which aim to manage and mitigate the financial risks associated with pension liabilities. Phoenix Group's expansion in this area reflects broader trends in the financial industry, where companies seek innovative solutions to address the challenges posed by pension obligations. The participation of BlackRock and Goldman Sachs underscores the significance of this market segment and its potential for growth.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053164&language=en-US",
            "pub_date": "2026-02-28 13:09:18",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053163,
            "title": "Cryptocurrency Startups See Decline in February Venture Capital Funding",
            "description": "In February, cryptocurrency startups secured approximately $883 million in venture capital, marking a 13% decrease compared to over $1 billion in the same period last year. According to Odaily, DWF Labs Managing Partner Andrei Grachev noted that investors are now prioritizing revenue, user base, and the survival capabilities of projects during bear markets, leading to more cautious investment strategies. Grachev highlighted that by 2026, venture capital will focus on stablecoins, payment infrastructure, AI agents, and compliance and fund management tools for institutions. Significant funding rounds in February included Flying Tulip raising $206 million through token sales, digital goods platform Whop receiving a $200 million strategic investment from Tether, and U.S. digital asset bank Anchorage Digital obtaining a $100 million strategic equity investment from Tether.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053163&language=en-US",
            "pub_date": "2026-02-28 13:11:21",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053162,
            "title": "Japan Plans to Develop Rare Earth Mines in Africa",
            "description": "Japan's government is reportedly planning to develop rare earth mines in certain regions of Africa. According to Jin10, this initiative aims to secure a stable supply of critical minerals essential for various industries, including technology and manufacturing. The move comes amid growing global demand for rare earth elements, which are vital for producing electronics, renewable energy technologies, and other high-tech applications. Japan's strategy reflects its efforts to diversify sources and reduce dependency on existing suppliers, ensuring long-term resource security. This development could potentially impact global rare earth markets and influence geopolitical dynamics in the region.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053162&language=en-US",
            "pub_date": "2026-02-28 13:12:12",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053160,
            "title": "Mt. Gox's former CEO floats hard fork to recover 80K hacked Bitcoin",
            "description": "Mark Karpelès said it has been 12 years since the start of Mt. Gox’s bankruptcy proceedings and “this is probably the last sore point on this whole case. ”\nsource: https://cointelegraph.com/news/mt-gox-former-ceo-proposes-hard-fork-recover-lost-bitcoin?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053160&language=en-US",
            "pub_date": "2026-02-28 12:59:48",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053159,
            "title": "AI Bot Accidentally Sends $250K in Memecoins to Random User",
            "description": "An AI crypto bot accidentally sent $250K in memecoins to a social media user, underscoring risks in automated trading and AI-driven finance.\nsource: https://catenaa.com/markets/cryptocurrencies/ai-bot-accidentally-sends-250k-in-memecoins-to-random-user/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053159&language=en-US",
            "pub_date": "2026-02-28 13:00:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053158,
            "title": "Japan Plans to Limit Battery Packs on Flights to Prevent Fires",
            "description": "Japan is reportedly planning to restrict the number of battery packs passengers can bring on flights to prevent fires. According to Jin10, the proposed regulations would limit each passenger to a maximum of two battery packs with a capacity of 160 watt-hours or less, including camera batteries. There will be no limit on battery packs with a capacity of 100 watt-hours or less. Additionally, passengers will be prohibited from charging battery packs using onboard power outlets during flights.\n\nThe Ministry of Land, Infrastructure, Transport and Tourism intends to amend the regulations by mid-April and will seek public opinion by the end of March. A similar regulation may be approved by the International Civil Aviation Organization, a United Nations agency, as early as next month.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053158&language=en-US",
            "pub_date": "2026-02-28 12:57:12",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053156,
            "title": "Arkham analyst corrected: Trump Media Technology Group did not sell 2,000 BTC; they were transferred as collateral.",
            "description": "Arkham analyst Emmett Gallic has corrected his previous statement regarding Trump Media Technology Group's sale of 2,000 BTC. He stated that the tweet has been deleted, clarifying that the company did not sell Bitcoin, but rather provided 2,000 BTC as collateral to a counterparty. Gallic explained that since the Bitcoin was no longer under the company's control, it was removed from the balance sheet. Under the arrangement, the counterparty could decide whether to re-pledge or otherwise dispose of the collateral, including selling it.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053156&language=en-US",
            "pub_date": "2026-02-28 12:58:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053155,
            "title": "Crypto startups raised $883 million in February, a 13% decrease year-over-year.",
            "description": "Crypto startups raised approximately $883 million in venture capital in February, a decrease of about 13% compared to the over $1 billion raised in the same period last year. Andrei Grachev, Managing Partner of DWF Labs, stated that investors are currently more focused on revenue, user scale, and a project's ability to survive in a bear market, leading to a more cautious investment strategy. He pointed out that in 2026, venture capital will focus on stablecoins and payment infrastructure, AI agents, and compliance and treasury management tools for institutions. Major funding rounds in February included: Flying Tulip raising $206 million through a token sale; digital goods platform Whop receiving a $200 million strategic investment from Tether; and US digital asset bank Anchorage Digital receiving a $100 million strategic equity investment from Tether. (DL News)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053155&language=en-US",
            "pub_date": "2026-02-28 13:01:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053157,
            "title": "Arkham Analyst Clarifies Trump Media's Bitcoin Transaction",
            "description": "Arkham analyst Emmett Gallic has corrected his previous statement regarding Trump Media & Technology Group's handling of 2,000 BTC. According to ChainCatcher, Gallic clarified that the company did not sell the Bitcoin but instead delivered it as collateral to a counterparty.\n\nGallic explained that since the Bitcoin is no longer under the company's control, it has been removed from the balance sheet. The arrangement allows the counterparty to decide whether to repledge or otherwise dispose of the collateral, including selling it.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053157&language=en-US",
            "pub_date": "2026-02-28 13:03:54",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}