{
    "data": [
        {
            "id": 1053717,
            "title": "Berkshire Hathaway's New CEO Greg Abel Reflects on Leadership Transition",
            "description": "Greg Abel, the newly appointed CEO of Berkshire Hathaway, shared his thoughts in his first annual letter, acknowledging the challenges of succeeding Warren Buffett. Bespoke Investment Group posted on X. Abel emphasized the significant legacy left by Buffett, describing him as a 'very hard act to follow.' Abel's letter marks a pivotal moment for the company as it transitions under new leadership, highlighting the importance of maintaining the values and principles established by Buffett. Abel's leadership will be closely watched as he navigates the future of Berkshire Hathaway, aiming to uphold the company's reputation and success.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053717&language=en-US",
            "pub_date": "2026-02-28 23:32:44",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053716,
            "title": "Hyundai Motor Leads in Humanoid Robotics Amid Global AI Competition",
            "description": "Hyundai Motor has positioned itself as a frontrunner in the development of humanoid robots, capturing attention amidst the global focus on Elon Musk's Optimus robot and the intense AI competition between the United States and China. Bloomberg posted on X, highlighting Hyundai's advancements in robotics technology, which have set it apart in the industry. As the world watches the unfolding AI race, Hyundai's progress in humanoid robotics signifies a significant milestone in technological innovation.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053716&language=en-US",
            "pub_date": "2026-02-28 23:33:34",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053715,
            "title": "U.S. House Democrats to Hold Online Caucus Meeting",
            "description": "U.S. House Democrats are set to convene an online caucus meeting tomorrow. According to Jin10, this virtual gathering aims to address key legislative priorities and strategize on upcoming political challenges. The meeting underscores the ongoing efforts by the Democratic Party to maintain cohesion and focus on their agenda amid a dynamic political landscape. Further details on the topics to be discussed have not been disclosed.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053715&language=en-US",
            "pub_date": "2026-02-28 23:34:42",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053714,
            "title": "GEOPOLITICS | India Calls for Dialogue to Address West Asia Crisis",
            "description": "India has issued a statement regarding the ongoing crisis in West Asia, emphasizing the need for dialogue and diplomatic efforts to ease tensions and address underlying issues. According to Jin10, the statement underscores the importance of respecting the sovereignty and territorial integrity of all nations involved. The call for peaceful resolution comes amid escalating geopolitical challenges in the region.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053714&language=en-US",
            "pub_date": "2026-02-28 23:36:22",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053712,
            "title": "Kalshi Contracts Reflect High Interest in Alien Existence Confirmation by 2027",
            "description": "Over $9 million has been traded on Kalshi contracts concerning the potential confirmation of alien existence by the United States. Bespoke Investment Group posted on X that these contracts currently indicate a 22.1% probability of such confirmation occurring before 2027. The significant trading volume highlights the growing interest and speculation surrounding extraterrestrial life and its acknowledgment by official entities. This development comes amid ongoing discussions and debates about the possibility of alien life and its implications for science and society.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053712&language=en-US",
            "pub_date": "2026-02-28 23:23:48",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053711,
            "title": "El Niño Weather Phenomenon Begins in Peru, Expected to Last Until November",
            "description": "Peru has officially announced the onset of the El Niño weather phenomenon, which is anticipated to persist until November. Bloomberg posted on X, indicating that the event is currently exhibiting weak intensity but may escalate to moderate levels by July. The development of El Niño is closely monitored due to its potential impact on agriculture, fisheries, and the broader economy. Authorities are preparing for possible changes in weather patterns that could affect various sectors. The situation remains under observation as experts assess the implications of this climatic event.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053711&language=en-US",
            "pub_date": "2026-02-28 23:25:06",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053709,
            "title": "Bloomberg: Bitcoin trades 24/7, becoming the most liquid asset for expressing macroeconomic views when other markets are closed.",
            "description": "Escalating tensions between the US, Israel, and Iran prompted traders to turn to crypto exchanges for 24/7 hedging. Oil-linked perpetual contracts on Hyperliquid rose approximately 6.2% to $70.6 per barrel, while gold and silver perpetual contracts climbed over 5% and 8% respectively, reaching $5,464 and $97.5 per ounce. Silver perpetual contracts saw over $400 million in trading volume over the past 24 hours, while gold contracts saw nearly $140 million. US stock index contracts on the platform fell 1% to 2%. The Iranian conflict triggered a safe-haven sell-off in the crypto market, with Bitcoin initially falling 3.8% to $63,038 before stabilizing around $64,000; ETH initially fell 4.5% to $1,836. According to CoinGecko data, the total market capitalization of digital assets has evaporated by approximately $128 billion since the conflict began. Jake Ostrovskis, head of OTC trading at Wintermute, stated that Bitcoin's 24/7 trading makes it the most liquid asset for traders to express macroeconomic views when other markets are closed, and more asset classes are moving towards 24/7 trading. Charlie Ambrose, co-founder of Felix, said this was another weekend of 24/7 price discovery through perpetual contracts on Hyperliquid, potentially driving a macroeconomic shift in how global markets operate.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053709&language=en-US",
            "pub_date": "2026-02-28 23:30:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053710,
            "title": "GEOPOLITICS | EU Officials Report Iranian Revolutionary Guard's Warning to Ships in Strait of Hormuz",
            "description": "EU officials involved in the 'ASPIDES' operation have reported that ships received a very high frequency radio communication from the Iranian Revolutionary Guard. According to Jin10, the message stated that 'no ships are allowed to pass through the Strait of Hormuz.' This development highlights ongoing geopolitical tensions in the region, potentially impacting global shipping routes and international relations.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053710&language=en-US",
            "pub_date": "2026-02-28 23:30:16",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053697,
            "title": "Incident Reported in Dubai: Loud Noise and Flames Over Palm Island",
            "description": "A loud noise accompanied by thick smoke and visible flames was reported in the Palm Island community in Dubai. According to NS3.AI, witnesses in the area confirmed the occurrence, but the cause of the incident remains unidentified. Authorities have yet to release any official statements regarding the event.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053697&language=en-US",
            "pub_date": "2026-02-28 23:12:48",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053696,
            "title": "Private Equity Stocks Face Significant Declines",
            "description": "Private equity stocks are experiencing substantial declines, with most companies facing drawdowns of 40% or more. Bespoke Investment Group posted on X that all private equity stocks, except Carlyle Group, are affected by this downturn. The financial sector is witnessing a challenging period as these stocks continue to struggle, reflecting broader market volatility and investor concerns. Carlyle Group remains the exception, avoiding the severe drawdowns impacting its peers. The situation underscores the current pressures within the private equity market, highlighting the need for strategic adjustments and resilience in navigating these financial challenges.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053696&language=en-US",
            "pub_date": "2026-02-28 23:15:01",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053695,
            "title": "BNB Drops Below 600 USDT with a 2.32% Decrease in 24 Hours",
            "description": "On Feb 28, 2026, 15:15 PM(UTC). According to Binance Market Data, BNB has dropped below 600 USDT and is now trading at 598.969971 USDT, with a narrowed 2.32% decrease in 24 hours.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053695&language=en-US",
            "pub_date": "2026-02-28 23:15:11",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053694,
            "title": "Iran Closes Airspace Due to Security Concerns",
            "description": "On February 28, the Iranian Civil Aviation Organization announced the immediate closure of Iranian airspace to all flights due to security concerns. According to Jin10, this closure will remain in effect until further notice. Authorities have strongly advised travelers not to go to the airport to comply with the current special control measures. In response to the impact of flight cancellations, the announcement clearly mandates that all ticket agencies and airlines must fully refund affected passengers.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053694&language=en-US",
            "pub_date": "2026-02-28 23:17:49",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053686,
            "title": "Web3 Infrastructure: Decentralized Internet Growth",
            "description": "Web3 infrastructure enables decentralized apps, DeFi, NFTs & secure blockchain networks, reshaping digital trust & global markets.\nsource: https://catenaa.com/industries/technology/web3-infrastructure-decentralized-internet-growth/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053686&language=en-US",
            "pub_date": "2026-02-28 23:00:38",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053685,
            "title": "Sustainable Sourcing Challenges for Tinned Fish Amid Rising Ocean Temperatures",
            "description": "The popularity of tinned fish is increasing, yet the challenge of sourcing it sustainably is becoming more difficult due to rising ocean temperatures. Bloomberg posted on X, highlighting the impact of climate change on marine ecosystems, which is affecting the availability of certain fish species. As demand for tinned fish grows, producers are facing pressure to find sustainable sources while navigating environmental changes. The rising temperatures are altering fish habitats and migration patterns, complicating efforts to maintain sustainable fishing practices. This situation underscores the need for innovative solutions to ensure the long-term viability of tinned fish production.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053685&language=en-US",
            "pub_date": "2026-02-28 23:03:54",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053684,
            "title": "Iranian Foreign Minister Confirms Health of Officials Amid Airstrike Reports",
            "description": "Iranian Foreign Minister Araghchi stated on February 28 that nearly all officials are alive and well, with the possibility of one or two military commanders having been lost. According to BlockBeats, this statement follows unofficial Israeli reports claiming the deaths of Iranian Islamic Revolutionary Guard Corps Commander Pakpour and Iranian Defense Minister Nahilzadeh in an airstrike. Israel believes its attack resulted in the deaths of several high-ranking Iranian officials.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053684&language=en-US",
            "pub_date": "2026-02-28 23:03:58",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053683,
            "title": "GEOPOLITICS | Democrats Seek Congressional Vote to Limit Trump's Authority on Iran Strikes",
            "description": "Democrats are advocating for a congressional vote on a resolution aimed at limiting U.S. President Donald Trump's ability to initiate military strikes in Iran. Bloomberg posted on X, highlighting the party's efforts to assert legislative power in foreign policy matters. The resolution seeks to reinforce Congress's role in authorizing military actions, reflecting concerns over executive overreach in decisions that could lead to conflict. This move comes amid heightened tensions between the U.S. and Iran, with lawmakers emphasizing the need for checks and balances in military engagements. The initiative underscores the ongoing debate over the separation of powers and the appropriate scope of presidential authority in matters of national security.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053683&language=en-US",
            "pub_date": "2026-02-28 23:08:40",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053678,
            "title": "Israel Temporarily Shuts Down Gas Fields Following Joint Operation with U.S.",
            "description": "Israel has temporarily closed certain natural gas fields following a military operation against Iran conducted in collaboration with the United States. Bloomberg posted on X, highlighting the strategic move as part of a broader security measure. The decision to halt operations at these gas fields underscores the heightened tensions in the region and the potential impact on energy markets. The joint operation reflects ongoing geopolitical dynamics and the complex relationship between the involved nations. The temporary shutdown is expected to have implications for both local and international energy supplies, as stakeholders monitor the situation closely.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053678&language=en-US",
            "pub_date": "2026-02-28 22:52:56",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053676,
            "title": "Iranian media: Iran's Supreme Leader Khamenei will deliver a speech",
            "description": "According to Iranian media: Following the attacks on Iran by the United States and Israel, Iran's Supreme Leader Ayatollah Khamenei will deliver a speech within minutes. (Jinshi)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053676&language=en-US",
            "pub_date": "2026-02-28 22:54:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053675,
            "title": "A loud explosion was heard in Dubai, and thick smoke and flames appeared over the Palm Jumeirah community.",
            "description": "According to Reuters witnesses, a loud bang was heard in Dubai. Witnesses reported seeing thick smoke and flames over the Palm Jumeirah neighborhood. (Jinshi)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053675&language=en-US",
            "pub_date": "2026-02-28 22:59:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053677,
            "title": "U.S. Officials Briefed Trump on High-Risk, High-Reward Iran Strike",
            "description": "U.S. President Donald Trump was informed by American officials that the planned strike on Iran carried significant risks and potential rewards. According to Jin10, the briefing highlighted the complexities and potential outcomes of the military action. The decision to proceed with the strike was weighed against the backdrop of escalating tensions in the region. The officials emphasized the strategic importance of the operation, considering both the immediate and long-term implications for U.S. interests. This development comes amid ongoing geopolitical challenges and the administration's efforts to address security concerns in the Middle East.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053677&language=en-US",
            "pub_date": "2026-02-28 22:59:26",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}