{
    "data": [
        {
            "id": 1053494,
            "title": "The UAE has decided to evacuate the world's tallest tower, the Burj Khalifa.",
            "description": "According to the Israeli newspaper, the United Arab Emirates has decided to evacuate the Burj Khalifa, the world's tallest tower. (Jinshi)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053494&language=en-US",
            "pub_date": "2026-02-28 20:39:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053497,
            "title": "Cryptocurrency Industry Faces $35.7 Million Loss Due to Exploits in February",
            "description": "According to CertiK's monitoring, the cryptocurrency industry experienced losses amounting to approximately $35.7 million in February due to exploitations. According to Foresight News, around $8.5 million of these losses were attributed to phishing attacks. This marks the lowest monthly loss since March 2025.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053497&language=en-US",
            "pub_date": "2026-02-28 20:39:04",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053496,
            "title": "Gold's Bullish Trend Indicates Market Risk Caution",
            "description": "CyrilXBT posted on X. Gold is experiencing a strong bullish trend, which typically signals a risk-off sentiment in global markets. This trend suggests that investors are seeking safer assets, contributing to the consolidation observed in the cryptocurrency market rather than aggressive expansion.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053496&language=en-US",
            "pub_date": "2026-02-28 20:39:14",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053495,
            "title": "U.S. Airstrikes Expected to Continue for Several Days, Official Says",
            "description": "Crypto Rover posted on X that a U.S. official has indicated airstrikes will persist for several days rather than just hours. This development comes amid ongoing military operations, with the official emphasizing the extended duration of the airstrikes. The decision reflects strategic military planning and aims to achieve specific objectives in the region. Further details on the targets or outcomes of these airstrikes have not been disclosed.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053495&language=en-US",
            "pub_date": "2026-02-28 20:40:11",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053493,
            "title": "GEOPOLITICS | Swedish Prime Minister to Convene National Security Meeting",
            "description": "Swedish Prime Minister has announced plans to convene a meeting of the National Security Council to discuss the implications for the safety of Sweden and its citizens. According to Jin10, this decision comes amid growing concerns over national security issues. The meeting aims to address potential threats and strategize on measures to enhance the security framework within the country. Further details on the agenda and outcomes of the meeting are yet to be disclosed.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053493&language=en-US",
            "pub_date": "2026-02-28 20:22:53",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053481,
            "title": "GEOPOLITICS | Oman Urges U.S. to Avoid Further Involvement in Foreign Conflicts",
            "description": "Oman's Foreign Minister has called on the United States to refrain from deepening its involvement in foreign conflicts, emphasizing that these are not America's wars. According to Jin10, the minister's statement reflects a growing sentiment among some nations that the U.S. should focus on diplomatic solutions rather than military interventions. This appeal comes amid ongoing geopolitical tensions, where various countries are urging restraint and dialogue to resolve international disputes. The minister's remarks highlight the importance of multilateral cooperation and peaceful negotiations in addressing global challenges.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053481&language=en-US",
            "pub_date": "2026-02-28 20:10:22",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053480,
            "title": "Explosion Occurs in Tehran's Narmak District",
            "description": "An explosion took place in Tehran's Narmak District, specifically at Square 72, on February 28, local time. According to Jin10, former Iranian President Mahmoud Ahmadinejad was unharmed and not injured in the attack.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053480&language=en-US",
            "pub_date": "2026-02-28 20:14:42",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053479,
            "title": "USDD 2.0 Supply Mining Phase XV Officially Begins",
            "description": "According to official news, JustLend DAO has officially launched Phase XV of its USDD 2.0 supply mining program. This phase began on February 28, 2026 at 20:00 (Singapore time) and will last until March 28. Users can participate by depositing $USDD into the platform. The annualized yield for this supply mining is approximately 5%, and rewards will be distributed weekly in USDD.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053479&language=en-US",
            "pub_date": "2026-02-28 20:16:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053471,
            "title": "GEOPOLITICS | French President Macron Calls for Halt to Escalating Tensions",
            "description": "French President Emmanuel Macron has emphasized the need to halt the escalating tensions that pose a threat to all parties involved. According to Jin10, Macron highlighted the urgency of addressing the current situation to prevent further destabilization. The French leader's remarks come amid growing concerns over geopolitical conflicts that could have widespread implications. Macron's call for de-escalation underscores the importance of diplomatic efforts to resolve ongoing disputes and maintain global stability.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053471&language=en-US",
            "pub_date": "2026-02-28 20:01:30",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053470,
            "title": "Ethereum Foundation Begins Staking Treasury ETH Amid Network Upgrades",
            "description": "The Ethereum Foundation has started staking its treasury ETH, demonstrating confidence in upcoming network upgrades. According to NS3.AI, the USD1 stablecoin is experiencing coordinated attacks that are affecting its stability. In other developments, Uniswap has introduced an AI agent named 'Skills' to improve user experience, while TRUMP is set to deploy 5% of its token supply. Additionally, zkSync plans to phase out its Lite version, x402's trading volume has reached a two-month high, and UniSat has announced a fee-free policy along with a Facebook buyback initiative.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053470&language=en-US",
            "pub_date": "2026-02-28 20:03:58",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053469,
            "title": "GEOPOLITICS | France Calls for Emergency UN Security Council Meeting",
            "description": "French President Emmanuel Macron has urged the United Nations Security Council to convene an emergency meeting. According to Jin10, this call comes amid rising geopolitical tensions that require immediate international attention. The French government is seeking to address pressing global issues through diplomatic channels, emphasizing the importance of collective action in maintaining international peace and security. Macron's appeal highlights France's commitment to playing a proactive role in global governance and crisis management.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053469&language=en-US",
            "pub_date": "2026-02-28 20:04:06",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053468,
            "title": "CertiK: Total losses from security incidents in February amounted to approximately $35.7 million, the lowest since March 2025.",
            "description": "According to CertiK monitoring, total losses from all security incidents in February amounted to approximately $35.7 million, of which about $8.5 million was attributed to phishing attacks. This figure represents the lowest monthly loss since March 2025.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053468&language=en-US",
            "pub_date": "2026-02-28 20:08:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053462,
            "title": "Markets: U.S. spot Bitcoin ETFs are on track for their biggest week in 6, pulling in $1.1B in net inflows over three straight days with BlackRock's $IBIT accounting for more than half, per @SoSoValue.",
            "description": "null\nsource: https://x.com/coindesk/status/2027709042638889399",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053462&language=en-US",
            "pub_date": "2026-02-28 19:34:43",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053461,
            "title": "GEOPOLITICS | Spain Opposes Unilateral Military Actions by the U.S. and Israel",
            "description": "Spanish Prime Minister Pedro Sánchez has expressed opposition to unilateral military actions by the United States and Israel. According to Jin10, Sánchez emphasized the importance of multilateral approaches and international cooperation in addressing global conflicts. His statement reflects Spain's stance on promoting diplomatic solutions over military interventions. The Spanish government continues to advocate for peaceful resolutions and dialogue in international relations.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053461&language=en-US",
            "pub_date": "2026-02-28 19:45:39",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053460,
            "title": "GEOPOLITICS | Casualties Rise in Iranian School Following Israeli Military Action",
            "description": "The death toll in an Iranian school attacked during an Israeli military operation has increased to 40, with 48 others injured, according to Iranian media reports on February 28. According to Jin10, the incident has heightened tensions in the region, drawing international attention to the ongoing conflict. The attack has sparked widespread condemnation and calls for restraint from various global leaders. The situation remains tense as both nations navigate the aftermath of the incident.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053460&language=en-US",
            "pub_date": "2026-02-28 19:46:15",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053459,
            "title": "115 million USDT were transferred from Aave to HTX exchange.",
            "description": "According to Whale Alert, 115 million USDT ($115,049,162 USD) were transferred from Aave to the HTX exchange.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053459&language=en-US",
            "pub_date": "2026-02-28 19:48:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053454,
            "title": "Planet Evening News",
            "description": "1. Opinion: Bitcoin funding rates drop to -6%, potential short squeeze conditions formed; 2. A whale has been holding $12.4 million worth of digital gold since October 2025, currently with a floating profit of $3.521 million; 3. Founder of DeFiance Capital: Cryptocurrencies have become the preferred short-selling hedging tool during weekend risk aversion events; 4. US President Trump is expected to deliver another national address on Saturday morning local time; 5. Iran has launched ballistic missiles at all Gulf states except Oman; 6. A wallet created only 3 days ago bought bullish shares of \"US strikes Iran\" on Polymarket, currently with a profit of $493,500; 7. US officials expect the Iranian attacks to last for days, and possibly even weeks; 8. US military base in Bahrain attacked, Qatar shot down Iranian missiles, and explosions were heard in the UAE; 9. Trump stated that he would take over the Iranian government after the operation ended; 10. Israel stated that the operation against Iran has achieved its objectives.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053454&language=en-US",
            "pub_date": "2026-02-28 19:28:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053455,
            "title": "GEOPOLITICS | U.S.-Israeli Airstrike Kills Senior IRGC Commander, Escalates Tensions",
            "description": "A U.S.-Israeli airstrike has reportedly resulted in the death of a senior commander of the Iranian Revolutionary Guard Corps (IRGC) along with several political officials. According to NS3.AI, the strike also targeted Iran's Supreme Leader and President, though the consequences of these actions remain unclear. In retaliation, the IRGC has initiated attacks on U.S. military bases located in various Gulf countries, further heightening regional tensions.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053455&language=en-US",
            "pub_date": "2026-02-28 19:28:47",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053452,
            "title": "Trump to Address Nation Saturday Morning Following Gulf Escalation: Report",
            "description": "U.S. President Donald Trump is expected to deliver a national address on Saturday morning local time, according to a report by Axios.The announcement follows escalating tensions in the Gulf region after reports of attacks on a U.S. military base in Bahrain, missile interceptions in Qatar, and explosions in the United Arab Emirates.Details regarding the exact timing and subject of the address have not yet been officially released. However, the speech is widely expected to focus on recent developments involving Iran and U.S. military assets in the region.Markets are likely to monitor the speech closely for signals on:Potential U.S. military responseDiplomatic measuresRegional security postureImpact on global oil supply routesThis will be Trump’s second address in recent days amid rapidly evolving geopolitical conditions.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053452&language=en-US",
            "pub_date": "2026-02-28 19:11:12",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053451,
            "title": "Opinion: Bitcoin funding rates drop to -6%, potential short squeeze conditions emerge.",
            "description": "Bitcoin briefly fell to $63,000 after the US and Israel launched attacks on Iran, with perpetual contract funding rates dropping to -6%, the second lowest level in nearly three months. The last time funding rates reached this level was on February 6th, when Bitcoin bottomed out around $60,000. CoinGlass data shows that in the past 24 hours, coin-margined open interest rose from 668,000 BTC to 687,000 BTC, with over $500 million in cryptocurrency positions liquidated, including over $420 million in long positions. Deep negative funding rates typically indicate dense short positions, with traders willing to pay a premium to maintain bearish bets. The rise in BTC-denominated open interest coupled with negative funding rates suggests increased market participation and more traders betting on the downside. Bitcoin is currently attempting to recover to $64,000.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053451&language=en-US",
            "pub_date": "2026-02-28 19:15:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}