{
    "data": [
        {
            "id": 1052580,
            "title": "Vitalik Buterin Warns Ethereum Faces Quantum Threat",
            "description": "Key Insights: Ethereum co-founder Vitalik Buterin published a quantum resistance roadmap on Feb. 26, outlining fixes for four vulnerable components of the network. He said consensus signatures, data availability, externally owned accounts, and zero-knowledge proofs faced long-term quantum risk. The proposal set a phased plan to harden Ethereum before large-scale quantum machines emerge\nsource: https://www.thecoinrepublic.com/2026/02/27/vitalik-buterin-warns-ethereum-faces-quantum-threat/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052580&language=en-US",
            "pub_date": "2026-02-28 01:30:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052578,
            "title": "Morgan Stanley Seeks National Trust Bank Charter for Digital Asset Expansion",
            "description": "Morgan Stanley has submitted an application for a national trust bank charter to facilitate the operations of its digital asset subsidiary in the United States. According to NS3.AI, this application suggests that the financial giant plans to issue stablecoins and tokenized assets as part of its strategy. This initiative represents a significant step by a major financial institution towards offering regulated digital asset services.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052578&language=en-US",
            "pub_date": "2026-02-28 01:33:09",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052577,
            "title": "First Brands Attracts Interest from Four Potential Buyers for Automotive Parts Factories",
            "description": "First Brands is reportedly in discussions with four potential buyers interested in acquiring its factories that manufacture parts for automakers, including Ford. Bloomberg posted on X, highlighting the interest in these facilities, which are integral to the automotive supply chain. The potential sale comes as First Brands evaluates strategic options to optimize its operations and focus on core business areas. The company has not disclosed the identities of the interested parties or the financial details of the potential transactions. This development underscores the ongoing consolidation and strategic realignment within the automotive industry as companies seek to enhance efficiency and competitiveness.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052577&language=en-US",
            "pub_date": "2026-02-28 01:34:59",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052563,
            "title": "SEC Finalizes Rules Under the Holding Foreign Companies Accountable Act",
            "description": "The U.S. Securities and Exchange Commission (SEC) has announced the finalization of rules under the Holding Foreign Companies Accountable Act. According to Jin10, this development marks a significant step in ensuring compliance and transparency for foreign companies listed on U.S. exchanges. The rules aim to address concerns about the auditing practices of foreign firms, particularly those based in China, by requiring them to adhere to U.S. auditing standards. This move is expected to impact numerous companies and could lead to delistings if compliance is not met. The SEC's decision underscores the ongoing efforts to protect investors and maintain the integrity of U.S. financial markets.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052563&language=en-US",
            "pub_date": "2026-02-28 01:22:34",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052562,
            "title": "GEOPOLITICS | Foreign Embassies in Israel Prepare for Potential Iranian Attack",
            "description": "Foreign embassies stationed in Israel have reportedly developed contingency plans in response to potential Iranian attacks, according to Jin10. Diplomats have disclosed these preparations amid rising geopolitical tensions in the region. The Wall Street Journal reports that embassies are taking precautionary measures to ensure the safety of their personnel and operations. This development highlights the ongoing concerns over Iran's influence and actions in the Middle East, prompting diplomatic missions to enhance their security protocols.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052562&language=en-US",
            "pub_date": "2026-02-28 01:24:54",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052561,
            "title": "GEOPOLITICS | U.S. Homeland Security Staff Allegedly Involved in Spyware Installation",
            "description": "U.S. Homeland Security Secretary Kristi Noem disclosed on Thursday that certain staff members from the Department of Homeland Security are suspected of installing spyware on her phone and computer, as well as on devices belonging to other politically appointed officials. According to Jin10, this revelation raises significant concerns about internal security and privacy within the department. The implications of such actions could affect trust and operational integrity, prompting further investigation into the matter. The incident underscores the need for stringent cybersecurity measures and oversight within government agencies to prevent unauthorized surveillance and protect sensitive information.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052561&language=en-US",
            "pub_date": "2026-02-28 01:28:02",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052560,
            "title": "UK Prime Minister Faces Pressure After Green Party's By-Election Win",
            "description": "Hannah Spencer's recent victory in the Denton and Gorton by-election has significant implications beyond securing an additional parliamentary seat for the Green Party. Bloomberg posted on X, highlighting the increased internal pressure this win places on UK Prime Minister Keir Starmer. The outcome signals a shift in voter sentiment and poses challenges for the current government, as it navigates the evolving political landscape.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052560&language=en-US",
            "pub_date": "2026-02-28 01:28:58",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052548,
            "title": "Rent Any Car Worldwide With SHIB: 1,700+ Brands Unleashed",
            "description": "Shiba Inu to the wheel: hiring a car service has never been this easy with 1,700 options across the globe.\nsource: https://dailycoin.com/rent-any-car-worldwide-with-shib-1700-brands-unleashed/?utm_source=cryptopanic&utm_medium=rss",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052548&language=en-US",
            "pub_date": "2026-02-28 01:14:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052545,
            "title": "Pentagon Worker Highlights Claude's User-Friendly Code Base",
            "description": "A Pentagon employee has noted that Claude's code base is more manageable compared to others, allowing for swift updates. Bloomberg posted on X, emphasizing the ease of making real-time changes with Claude's system. This insight reflects the ongoing efforts to streamline operations within the Pentagon, focusing on efficiency and adaptability in technological applications.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052545&language=en-US",
            "pub_date": "2026-02-28 01:10:58",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052544,
            "title": "BNB Drops Below 610 USDT with a 1.32% Decrease in 24 Hours",
            "description": "On Feb 27, 2026, 17:13 PM(UTC). According to Binance Market Data, BNB has dropped below 610 USDT and is now trading at 609.799988 USDT, with a narrowed 1.32% decrease in 24 hours.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052544&language=en-US",
            "pub_date": "2026-02-28 01:13:07",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052543,
            "title": "Hasbro Seeks Refund of Tariffs Paid Under IEEPA",
            "description": "Hasbro Inc. has filed a lawsuit in the United States seeking a refund of all tariffs paid under the International Emergency Economic Powers Act (IEEPA). According to Jin10, the toy company is challenging the tariffs imposed on its products, arguing that they were unjustly levied. The lawsuit highlights ongoing disputes over trade policies and their impact on businesses. Hasbro's legal action underscores the broader tensions between companies and government regulations concerning international trade. The outcome of this case could have significant implications for other businesses affected by similar tariffs.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052543&language=en-US",
            "pub_date": "2026-02-28 01:14:53",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052542,
            "title": "Tram Accident in Milan Results in Fatality and Injuries",
            "description": "A tram derailed and collided with a building in Milan's city center on Friday, resulting in one fatality and approximately twenty injuries. According to Ming Pao, the incident was confirmed by Milan police to the Agence France-Presse. The accident occurred on Friday, causing significant disruption and prompting emergency response efforts.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052542&language=en-US",
            "pub_date": "2026-02-28 01:16:22",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052532,
            "title": "Institutions Put $265 Million Into Crypto ETFs on Thursday – The Details Are More Interesting Than the Total",
            "description": "Thursday’s U. S. spot crypto ETF flow data came in positive across the board, $265. 14 million in total inflows on February 26th\nsource: https://www.ethnews.com/institutions-put-265-million-into-crypto-etfs-on-thursday-the-details-are-more-interesting-than-the-total/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052532&language=en-US",
            "pub_date": "2026-02-28 01:02:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052531,
            "title": "U.S. Attorney’s Office Announces Seizure of $580 Million in Cryptocurrency – One of the Largest Operations to Date",
            "description": "U. S. officials have reported seizing a large amount of assets allegedly obtained through a China-based cryptocurrency scam. Continue Reading: U. S. Attorney’s Office Announces Seizure of $580 Million in Cryptocurrency – One of the Largest Operations to Date\nsource: https://en.bitcoinsistemi.com/u-s-attorney-s-office-announces-seizure-of-580-million-in-cryptocurrency-one-of-the-largest-operatio/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052531&language=en-US",
            "pub_date": "2026-02-28 01:02:08",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052529,
            "title": "Block’s Dorsey admits to Covid bloat, incorrect company structure in layoffs",
            "description": "Block has let go of 40% of its workforce, leaving just under 6,000 employees. Jack Dorsey, the company’s cofounder and CEO, has cited the use of intelligence tools in the company’s operations as a reason for the massive layoffs. Despite Jack Dorsey stating that the layoffs are to streamline operations, he has been accused of […]\nsource: https://www.cryptopolitan.com/block-dorsey-admits-covid-bloat-in-layoffs/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052529&language=en-US",
            "pub_date": "2026-02-28 01:02:23",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052528,
            "title": "U.S. November Crude Oil Production Revised Upward",
            "description": "The U.S. Energy Information Administration (EIA) has revised its November crude oil production figures, increasing the output by 6,000 barrels per day to a total of 13.788 million barrels per day. According to Jin10, this adjustment reflects ongoing changes in the energy sector as production levels continue to fluctuate. The revision highlights the dynamic nature of the oil market and its impact on global energy supplies.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052528&language=en-US",
            "pub_date": "2026-02-28 00:58:54",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052527,
            "title": "U.S. House Speaker Johnson Criticizes Democrats Over Immigration Policies",
            "description": "U.S. House Speaker Mike Johnson has accused the Democratic Party of endangering American lives and livelihoods for the third time in less than 100 days due to their stance on illegal immigration. According to Jin10, Johnson urged Democrats to cease these actions and focus on fulfilling their responsibilities effectively.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052527&language=en-US",
            "pub_date": "2026-02-28 01:00:23",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052526,
            "title": "GEOPOLITICS | Indian Prime Minister Modi Aims for Developed Nation Status by 2047",
            "description": "Indian Prime Minister Narendra Modi has declared that the goal of transforming India into a developed nation by 2047 is not merely a political slogan but a determined effort to rectify historical errors made by the Congress Party. According to Jin10, Modi emphasized that this ambition reflects a commitment to progress and development, aiming to elevate India's global standing. The Prime Minister's statement underscores a strategic vision for India's future, focusing on economic growth and national advancement. Modi's remarks highlight the government's resolve to address past shortcomings and propel India towards a prosperous future.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052526&language=en-US",
            "pub_date": "2026-02-28 01:05:45",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052517,
            "title": "Keir Starmer Faces Challenges from Left-Wing Factions in His Party",
            "description": "Keir Starmer, leader of the UK's Labour Party, is encountering difficulties in managing the left-wing elements within his party. Bloomberg posted on X, highlighting the ongoing struggle Starmer faces as he attempts to balance differing ideologies. Despite efforts to unify the party, Starmer's leadership is being tested by the persistent influence of left-wing members. This internal dynamic poses challenges for Starmer as he seeks to maintain cohesion and steer the party towards its goals. The situation underscores the complexities of leading a party with diverse viewpoints and the impact of ideological divisions on political strategy.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052517&language=en-US",
            "pub_date": "2026-02-28 00:55:24",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052516,
            "title": "AI Concerns and Private Credit Shake-Up Impact Bank Stocks",
            "description": "Anxiety surrounding the threats posed by artificial intelligence is intensifying, leading to a significant downturn in the stock prices of banks and asset management companies. According to Jin10, the KBW Bank Index fell by 4.7% on Friday, reaching its lowest level since December last year, and is on track to record its worst monthly performance since March. Throughout this month, banks, payment service providers, and asset management firms have faced substantial challenges, primarily due to issues in the private credit sector and the emergence of new AI applications.\n\nBlock's decision to lay off nearly half of its workforce on Thursday night has heightened concerns about AI's potential to disrupt various economic sectors. Additionally, credit spreads have begun to widen, exacerbated by the collapse of MFS, a UK mortgage lender backed by Wall Street, which has fueled fears of rising default risks in the opaque private loan market.\n\nAnalyst Herman Chan commented, \"Banks are entering a more volatile period, with many unknowns regarding the pace of AI applications and disruptions. The rise in government bond prices combined with widening credit spreads indicates a market in a risk-averse state.\"",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052516&language=en-US",
            "pub_date": "2026-02-28 00:57:08",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}