{
    "data": [
        {
            "id": 734372,
            "title": "Goldman Sachs and Wells Fargo expect Fed to cut rates twice this year",
            "description": "Odaily Planet Daily News: The market generally expects Trump's tariff policy to push up inflation and increase the difficulty of the Federal Reserve to continue to control inflation. Goldman Sachs and Wells Fargo expect the Federal Reserve to cut interest rates twice this year, while Morgan Stanley joins Barclays and Macquarie Bank in predicting that the Federal Reserve will only cut interest rates by 25 basis points once this year, citing the uncertainty brought about by US President Trump's tariff policy. The Federal Reserve also maintained its benchmark overnight interest rate in the range of 4.25%-4.50% at its January policy meeting. Fed Chairman Powell said that further reducing borrowing costs now depends on whether the Federal Reserve can make further progress in reducing stubbornly high inflation. (Jinshi)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734372&language=en-US",
            "pub_date": "2025-02-05 19:39:59",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734371,
            "title": "856 BTC transferred from Ceffu to Binance, worth nearly $84 million",
            "description": "Odaily Planet Daily News: According to Whale Alert monitoring, at around 19:38 Beijing time today, 856 BTC were transferred from Ceffu to Binance, worth US$83,935,921.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734371&language=en-US",
            "pub_date": "2025-02-05 19:41:07",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734370,
            "title": "Opinion: Ethereum's increase in gas limit is good for the network",
            "description": "Odaily Planet Daily News OKX Ventures published an article on the X platform stating that the network has increased the gas limit for the first time since the Ethereum merger in 2022. This change will enable the Ethereum network to accommodate more transactions, ease congestion, and help stabilize transaction fees. This change enhances Ethereum's ability to handle complex smart contracts and high-demand dApps, and improves the transaction speed and scalability of DeFi and other on-chain innovations.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734370&language=en-US",
            "pub_date": "2025-02-05 19:45:29",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734369,
            "title": "Bitcoin's Negative Funding Rate Suggests Potential Bullish Reversal",
            "description": "According to Odaily, CryptoQuant's data reveals that Bitcoin's funding rate has turned negative seven times within the past year. Historically, the previous six instances of negative funding rates have indicated a strong bullish trend for Bitcoin. This metric reflects the cost of holding leveraged positions in perpetual futures contracts, suggesting that traders have become excessively bearish, which often signals a local bottom and a potential for significant rebound.\n\nIf historical patterns repeat, the market may soon shift towards a bullish trend. Currently, traders are closely monitoring liquidity levels below $98,000, with $100,000 considered a strong support level to reignite price discovery. A breakthrough at this level could trigger increased buying pressure. To fully restore bullish momentum and alter market sentiment, Bitcoin needs to reclaim the $103,600 mark.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734369&language=en-US",
            "pub_date": "2025-02-05 19:33:37",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734368,
            "title": "MoneyGram Appoints New Chief Technology Officer",
            "description": "According to Odaily, MoneyGram, a leader in cross-border payments, has appointed Luke Tuttle as its Chief Technology Officer. Tuttle will oversee product development and technology, including engineering, platform operations, information security, and emerging technologies like blockchain. He will report directly to MoneyGram's Chairman and CEO, Anthony Soohoo. Tuttle has previously worked with companies such as Klarna, Experian, and eBay. Recently, MoneyGram announced plans to launch a non-custodial wallet to facilitate transfers between fiat currencies and the USDC stablecoin.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734368&language=en-US",
            "pub_date": "2025-02-05 19:33:51",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734358,
            "title": "Ceffu wallet deposits over $100 million in ETH to Binance via an intermediary address",
            "description": "Odaily Planet Daily News According to Whale Alert monitoring, 36,200 ETH (about 102 million US dollars) were transferred from the Ceffu wallet to an unknown wallet. Subsequently, the unknown wallet address transferred 36,909 ETH (about 104 million US dollars) to the Binance exchange. Currently, the unknown wallet address still holds about 9,130 ​​ETH, and the Ceffu wallet holds about 347,000 ETH (worth about 970 million US dollars).",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734358&language=en-US",
            "pub_date": "2025-02-05 19:35:33",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734357,
            "title": "Usual: A small number of eligible users may not receive rewards, the problem will be resolved in the next distribution",
            "description": "Odaily Planet Daily News: Usual, the decentralized RWA stablecoin issuer, posted on the X platform that this week's USD0 rewards worth $900,000 have been deposited into the staker wallet. It should be noted that a small number of eligible users may not have received rewards, while other users may have received double rewards. This problem will be resolved in the next distribution.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734357&language=en-US",
            "pub_date": "2025-02-05 19:37:15",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734347,
            "title": "Story White Paper: Creating a Programmable Knowledge and Creative Market through a Peer-to-Peer Intellectual Property Network",
            "description": "Odaily Planet Daily News On February 5, Layer1 IP blockchain Story officially released its white paper. Story is committed to building a programmable knowledge and creative market, allowing all intellectual property assets to be registered on a universal ledger with customizable parameters. These assets are equipped with composable interfaces that can be called by any software application or artificial intelligence model to realize the use and monetization of intellectual property on the Internet.\nStory's native token IP will coordinate all value flows throughout the entire peer-to-peer intellectual property system.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734347&language=en-US",
            "pub_date": "2025-02-05 19:21:14",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734353,
            "title": "Avalanche Network Activity Surges to New Highs",
            "description": "According to BlockBeats, data from IntoTheBlock reveals that the Avalanche (AVAX) network experienced a significant increase in activity at the end of January. The number of daily active addresses has now surpassed 250,000, marking the highest level since May 2023.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734353&language=en-US",
            "pub_date": "2025-02-05 19:24:02",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734351,
            "title": "Avalanche Network Activity Surges to New Heights",
            "description": "According to Foresight News, data from IntoTheBlock reveals a significant increase in activity on the Avalanche (AVAX) network. As of late January, the number of daily active addresses has surpassed 250,000, approaching the peak levels observed in May 2023.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734351&language=en-US",
            "pub_date": "2025-02-05 19:24:08",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}