{
    "data": [
        {
            "id": 1052832,
            "title": "Travel Industry Experiences $8 Billion Surge Due to Popular Filming Locations",
            "description": "The travel industry is witnessing a significant $8 billion increase, driven by destinations featured in popular films and TV shows. Bloomberg posted on X, highlighting how these locations are attracting tourists eager to experience the settings of their favorite productions. However, some smaller towns are expressing concerns over the influx of visitors, preferring to maintain their quiet charm rather than becoming bustling tourist hotspots. This trend underscores the powerful influence of media on travel choices, as fans seek to immerse themselves in the environments seen on screen.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052832&language=en-US",
            "pub_date": "2026-02-28 05:05:54",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052831,
            "title": "Trump Predicts Rapid Decline in Mortgage Rates",
            "description": "Jim Bianco, president of Bianco Research posted on X, highlights Trump's statements on mortgage rates as forward-looking predictions. Trump advises homebuyers to wait for a 'very low' rate, suggesting a future decline in mortgage rates or bond yields. This advice is seen as a signal for contrarians looking for market trend reversals. Bloomberg headlines emphasize Trump's confidence in the rapid decrease of mortgage rates, urging prospective buyers to delay purchases to save money.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052831&language=en-US",
            "pub_date": "2026-02-28 05:06:05",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052830,
            "title": "Nasdaq 100 Ends Month with Slight Decline Despite Late Rally",
            "description": "The Nasdaq 100 experienced a modest rally in the final hour of trading, closing the day, week, and month with a slight decline. Bespoke Investment Group posted on X that the index finished approximately 0.3% lower. Despite the late surge, the Nasdaq 100 could not overcome earlier losses, reflecting ongoing market volatility. Investors continue to navigate economic uncertainties, impacting tech stocks and broader market sentiment.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052830&language=en-US",
            "pub_date": "2026-02-28 05:07:11",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052829,
            "title": "Delta Air Lines Expands Fleet with New Airbus Order",
            "description": "Delta Air Lines has confirmed an order for 34 Airbus jets, marking its third aircraft acquisition in under six weeks. Bloomberg posted on X, highlighting Delta's strategic move to strengthen its position in the U.S. aviation sector. This latest order underscores the airline's commitment to expanding its fleet and enhancing its operational capabilities. Delta's recent acquisitions reflect its ambition to maintain a competitive edge in the industry.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052829&language=en-US",
            "pub_date": "2026-02-28 05:09:24",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052821,
            "title": "Blackstone to Launch Publicly Traded Acquisition Company Targeting Data Centers",
            "description": "Blackstone is set to introduce a publicly traded acquisition company focused on acquiring data centers. Bloomberg posted on X, highlighting that this move provides an opportunity for individual investors to participate in the growing artificial intelligence sector. The initiative aims to capitalize on the increasing demand for data infrastructure driven by advancements in AI technology. By targeting data centers, Blackstone seeks to leverage the expanding market potential and offer investors a stake in this burgeoning industry.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052821&language=en-US",
            "pub_date": "2026-02-28 04:52:43",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052820,
            "title": "PayPal Cybersecurity Incident Exposes Customer Data for Six Months",
            "description": "PayPal has revealed a cybersecurity breach that compromised sensitive customer information for about six months due to a technical error in its loan application system. According to NS3.AI, the exposed data may include personal identifiers such as names, email addresses, Social Security numbers, and dates of birth. In response, the company is taking measures to protect affected users by resetting passwords, issuing refunds for unauthorized transactions, and offering two years of free credit monitoring and identity restoration services.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052820&language=en-US",
            "pub_date": "2026-02-28 04:54:12",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052819,
            "title": "DBS Group Executive Joins Bloomberg Investment Event",
            "description": "Bloomberg posted on X that Shee Tse Koon, the Executive and Group Head of Consumer Banking & Wealth Management at DBS Group, has joined the Bloomberg Investment event. The event aims to bring together industry leaders to discuss key financial trends and strategies. Shee Tse Koon's participation highlights the importance of collaboration and insight-sharing in the banking sector. The event is expected to cover various topics relevant to consumer banking and wealth management, providing a platform for exchanging ideas and exploring future opportunities in the financial industry.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052819&language=en-US",
            "pub_date": "2026-02-28 04:54:22",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052818,
            "title": "WHO Director-General Addresses Covid-19 Challenges and Vaccine Skepticism",
            "description": "The World Health Organization's director-general has provided insights into the ongoing battle against Covid-19, addressing concerns about vaccine skepticism and highlighting current global health challenges. Bloomberg posted on X, emphasizing the importance of continued vigilance and cooperation in combating the pandemic.\n\nThe director-general underscored the necessity of vaccines in controlling the spread of the virus and countered misinformation surrounding their efficacy. He expressed concern over the persistence of vaccine skepticism, which poses a significant hurdle in achieving widespread immunization.\n\nIn addition to vaccine-related issues, the director-general shared his worries about other pressing health threats that demand immediate attention. He called for a unified global response to tackle these challenges effectively, stressing the importance of international collaboration and resource sharing.\n\nThe WHO remains committed to supporting countries in their efforts to manage the pandemic and other health crises, advocating for equitable access to vaccines and healthcare resources worldwide.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052818&language=en-US",
            "pub_date": "2026-02-28 04:54:28",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052813,
            "title": "Senate Democrats Lead Inquiry Into Binance: Warren Heads Effort With Letter To DOJ",
            "description": "Cryptocurrency exchange Binance is once again facing mounting scrutiny in Washington, as lawmakers question whether the company is living up to the terms of its 2023 settlement with US authorities — an agreement that ultimately led to the resignation of its founder and former CEO, Changpeng Zhao (CZ). Democrats Urge DOJ And Treasury Investigation On Friday, journalist Eleanor Terrett of Crypto In America reported that eleven Democrats on the Senate Banking Committee, led by crypto-skeptic Elizabeth Warren, sent a letter to Attorney General Pam Bondi and Treasury Secretary Scott Bessent urging their departments to examine Binance’s operations. Related Reading: Jane Street Faces New Lawsuit: Trump Media Calls For Federal Investigation The lawmakers pointed to recent media reports alleging illicit finance activity on the platform, including transactions reportedly linked to Iran, and warned that such conduct could place Binance in violation of its 2023 settlement. In their letter, the senators also referenced Binance’s expanding business relationships with President Donald Trump’s crypto ventures, as well as Trump’s pardon of Zhao\nsource: https://www.newsbtc.com/breaking-news-ticker/senate-democrats-lead-inquiry-into-binance-warren-heads-effort-with-letter-to-doj/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052813&language=en-US",
            "pub_date": "2026-02-28 04:44:51",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052811,
            "title": "GEOPOLITICS | Zelensky Discusses War Efforts with NATO Secretary General",
            "description": "Ukrainian President Volodymyr Zelensky announced on social media that he had a conversation with NATO Secretary General Jens Stoltenberg. According to Jin10, Zelensky briefed Stoltenberg on recent meetings between his team and U.S. officials, as well as preparations for trilateral discussions. Zelensky emphasized Ukraine's commitment to ending the ongoing conflict, highlighting the importance of these efforts. He noted that the resolution of the war largely depends on Russia's willingness to cease hostilities, which is significantly influenced by the United States.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052811&language=en-US",
            "pub_date": "2026-02-28 04:45:40",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052810,
            "title": "DCTRL to Relocate Amid Zoning Changes, Preserving Bitcoin Legacy",
            "description": "DCTRL, the renowned Bitcoin hackerspace in Vancouver, is set to close its longstanding downtown location due to zoning changes. According to NS3.AI, the community plans to relocate and continue evolving its vision while maintaining its legacy as a center for Bitcoin innovation and culture. Over the past 12 years, DCTRL has significantly impacted the Canadian Bitcoin scene through various events, notable visitors, and experimental projects, including the Bepsi vending machine. The space is also known for hosting the world's first Bitcoin ATM and nurturing key industry figures.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052810&language=en-US",
            "pub_date": "2026-02-28 04:48:43",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052809,
            "title": "CFTC Reports Decline in Natural Gas Futures Net Long Positions",
            "description": "The U.S. Commodity Futures Trading Commission (CFTC) has reported a significant reduction in net long positions in natural gas futures. According to Jin10, for the week ending February 24, speculators decreased their net long positions by 60,823 contracts, bringing the total to 63,987 contracts across the four major natural gas markets of the New York Mercantile Exchange and the Intercontinental Exchange. This shift indicates a change in market sentiment among speculators regarding natural gas futures.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052809&language=en-US",
            "pub_date": "2026-02-28 04:48:58",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052780,
            "title": "Antelope’s $1M Bitcoin Bet Signals Something Bigger",
            "description": "Antelope Enterprise Holdings Limited has launched its “Genius Plan” with a $1 million Bitcoin purchase, describing current market conditions as a strategic entry window. Also, management framed the move as the opening step in a broader capital strategy more meaningful than just a short-term trade. com\nsource: https://techgaged.com/antelopes-1m-bitcoin-bet-signals-something-bigger/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052780&language=en-US",
            "pub_date": "2026-02-28 04:36:03",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052776,
            "title": "Ripple CEO Receives Apology from Former SEC Chair Amid Ongoing Legal Dispute",
            "description": "Reports indicate that former SEC Chair Gary Gensler offered an apology to Ripple CEO Brad Garlinghouse during a recent cryptocurrency policy briefing at the White House. According to NS3.AI, the apology reportedly took place at the end of the meeting. This event unfolds as Ripple continues its lengthy legal battle with the SEC, which began in December 2020 over accusations of selling unregistered securities.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052776&language=en-US",
            "pub_date": "2026-02-28 04:34:37",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052775,
            "title": "CFTC Reports Reduction in ICE Cotton Net Short Positions",
            "description": "The U.S. Commodity Futures Trading Commission (CFTC) has reported a significant decrease in net short positions for ICE cotton. According to Jin10, speculators reduced their net short positions by 26,508 contracts, bringing the total down to 48,922 contracts as of the week ending February 24. This adjustment reflects changes in market sentiment and investor behavior within the cotton futures market.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052775&language=en-US",
            "pub_date": "2026-02-28 04:35:32",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052774,
            "title": "XRP Price Decline Sees Long-Term Holders Increase Positions",
            "description": "XRP's price experienced a significant drop of nearly 40%, falling from $2.35 to approximately $1.40. According to NS3.AI, despite this decline, long-term holders have increased their positions, while speculative holders have largely exited the market. The leverage on perpetual contracts remains balanced, which reduces the risk of liquidations. Institutional investment inflows have remained steady throughout the price drop.\n\nTechnical analysis indicates a bullish cup-and-handle pattern, suggesting that a breakout above $1.52 could potentially target $1.70 or higher.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052774&language=en-US",
            "pub_date": "2026-02-28 04:39:15",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052773,
            "title": "GEOPOLITICS | Geopolitical Risks and AI Escalation Impact Markets",
            "description": "Geopolitical tensions, advancements in artificial intelligence, and concerns over private credit contagion are influencing global markets. Bloomberg posted on X, highlighting the potential impact of these factors on economic stability. \n\nThe rise in geopolitical risks is causing uncertainty among investors, with potential implications for international trade and economic growth. Meanwhile, the rapid development of AI technologies is reshaping industries, prompting discussions on regulatory measures and ethical considerations. \n\nAdditionally, the private credit market is under scrutiny as fears of contagion grow, raising questions about the resilience of financial systems. These elements are contributing to a complex economic landscape, requiring careful monitoring by policymakers and market participants.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052773&language=en-US",
            "pub_date": "2026-02-28 04:39:21",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052772,
            "title": "Former UK Prime Minister Sunak Joins Ukraine's Economic Advisory Board",
            "description": "Former UK Prime Minister Rishi Sunak has been appointed as an international advisor to Ukraine's Economic Revival Committee. According to Jin10, Sunak will not receive any compensation for this role. He expressed his enthusiasm about joining the advisory board to provide guidance to Ukrainian President Volodymyr Zelensky on the country's economic reconstruction. The international advisors will offer expert advice to President Zelensky and his economic team.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052772&language=en-US",
            "pub_date": "2026-02-28 04:22:13",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052771,
            "title": "SpaceX Considers Secret IPO Filing by March, Aiming for $1.75 Trillion Valuation",
            "description": "SpaceX, the aerospace company founded by Elon Musk, is reportedly considering a secret filing for an initial public offering (IPO) in the United States as early as March. According to Jin10, the company may seek a valuation exceeding $1.75 trillion in this potential IPO. This move could mark a significant milestone for SpaceX, which has been at the forefront of space exploration and satellite technology. The decision to pursue an IPO comes amid growing interest in the commercial space sector, with investors keen to capitalize on the industry's rapid advancements and potential for future growth.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052771&language=en-US",
            "pub_date": "2026-02-28 04:28:21",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052770,
            "title": "Uniswap Governance Proposes Fee Switch Activation on Layer 2 Blockchains",
            "description": "Uniswap governance has put forward a proposal to activate the fee switch on several layer 2 blockchains, which could potentially generate millions in additional monthly revenue for UNI holders. According to NS3.AI, the fee switch mechanism redirects a portion of trading fees to token holders who burn UNI, thereby reducing supply and potentially increasing the token's value. The proposal initially received unanimous approval, and a final vote is set to conclude by March 4. The previous activation on Ethereum has already generated $3.3 million since December.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052770&language=en-US",
            "pub_date": "2026-02-28 04:28:50",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}