{
    "data": [
        {
            "id": 1052918,
            "title": "Coinbase's legal chief criticized state regulators for misleading predictions about market regulation issues.",
            "description": "Ryan VanGrack, Coinbase's Vice President of Legal Affairs and Head of Global Litigation, stated that some U.S. state governments are \"misleading the public\" and misinterpreting federal law in their restrictions on prediction market businesses, attempting to expand state-level regulatory power. Following its recent partnership with prediction market platform Kalshi to launch related products, Coinbase has filed lawsuits in Connecticut, Illinois, Michigan, and Nevada. Regulatory agencies in these states previously issued stop-loss orders or warnings, deeming contracts related to sports events illegal betting. VanGrack stated that these actions pose a \"real and imminent threat\" to users, prompting Coinbase to seek a federal court ruling. VanGrack pointed out that the U.S. Commodity Exchange Act explicitly grants the Commodity Futures Trading Commission (CFTC) exclusive jurisdiction over the derivatives market, and prediction market products, including event contracts, should fall under federal regulation. He believes that the states' attempts to exclude sports event contracts from the definition of derivatives lack legal basis. VanGrack denied claims by some state governments that the market would lack regulation without state-level intervention, emphasizing that the CFTC has long overseen the multi-trillion-dollar derivatives market and has already issued enforcement warnings regarding insider trading in event contracts. Coinbase also pointed out that exchange-based prediction markets are fundamentally different from traditional sports betting. In CFTC-regulated exchanges like Kalshi, prices are determined by market participants, while traditional betting institutions have operators setting odds and directly betting against each other. VanGrack stated that states can still play a role in consumer protection and anti-fraud, but placing the national derivatives market under a \"hodgepodge of 50 different regulatory agencies\" would damage market stability and investor confidence.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052918&language=en-US",
            "pub_date": "2026-02-28 06:42:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052917,
            "title": "Trump orders: All federal government agencies to immediately stop using Anthropic",
            "description": "US President Trump: I have instructed every federal agency of the US government to immediately cease using Anthropic technology. We don't need it, we don't want it, and we will no longer do business with them! For agencies like the Department of War that use Anthropic products, there will be a six-month phase-out period. Anthropic had better behave itself and provide assistance during this phase-out period, or I will use all of my presidential power to force them to comply and they will face significant civil and criminal consequences.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052917&language=en-US",
            "pub_date": "2026-02-28 06:43:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052916,
            "title": "Trump: Dissatisfied with negotiations with Iran",
            "description": "US President Trump: We are not satisfied with our negotiations with Iran. We demand that Iran not enrich uranium. Iran has not found the right answer. I am not worried about the impact of an attack on Iran on oil prices.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052916&language=en-US",
            "pub_date": "2026-02-28 06:45:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052909,
            "title": "Ethereum(ETH) Drops Below 1,900 USDT with a 6.69% Decrease in 24 Hours",
            "description": "On Feb 27, 2026, 22:35 PM(UTC). According to Binance Market Data, Ethereum has dropped below 1,900 USDT and is now trading at 1,894.800049 USDT, with a narrowed 6.69% decrease in 24 hours.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052909&language=en-US",
            "pub_date": "2026-02-28 06:35:11",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052906,
            "title": "Analysts: Block's shift to an AI strategy may benefit Square's business the most.",
            "description": "Following strong earnings and the company's push forward with its AI transformation strategy, fintech company Block.com is expected to see its merchant payments business, Square, be a major beneficiary of this strategic shift. The earnings report showed that Block.com achieved operating profit of $485 million in the fourth quarter, with adjusted operating profit reaching $588 million. Net income attributable to common shareholders was $116 million, and adjusted EBITDA was $930 million. The company also raised its 2026 gross profit guidance to $12.2 billion, representing a year-over-year increase of approximately 18%. Block.com CEO Jack Dorsey recently announced that the company will lay off more than 40% of its workforce, reducing its total number of employees from over 10,000 to less than 6,000, in order to promote a leaner, AI-centric operating model. Analysts believe that Block.com is one of the first fintech companies to fundamentally reassess its workforce structure and productivity. In addition, the company recently increased its holdings by 103 Bitcoins, bringing its total holdings to approximately 8,883 BTC, worth about $577 million, making it the fourteenth largest enterprise in the world in terms of Bitcoin holdings. Dorsey stated that the company rapidly expanded its workforce during the pandemic, while simultaneously establishing separate systems for Square and Cash App, resulting in redundant personnel. Block is currently pushing for organizational consolidation and plans to increase gross profit per employee to over $2 million, approximately four times the pre-pandemic level. Analysts believe that with AI driving efficiency improvements, Square's business is poised to be the first to achieve scaled revenue growth.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052906&language=en-US",
            "pub_date": "2026-02-28 06:36:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052905,
            "title": "The former Mt. Gox CEO proposed a Bitcoin hard fork to recover $5.2 billion in stolen assets.",
            "description": "Mark Karpelès, former CEO of the defunct exchange Mt. Gox, recently proposed a Bitcoin hard fork to recover approximately 79,956 BTC stolen in the 2011 hack, worth about $5.2 billion at current prices. The proposal targets a wallet address associated with the 2011 Mt. Gox system breach, which received nearly 80,000 Bitcoins after the attack and remained untouched for over 15 years. Under current Bitcoin rules, these funds can only be transferred if the corresponding private key is held. The proposal would allow the unspent outputs of a recovered Mt. Gox address to be controlled via a signature, thus bringing the funds into the existing judicial oversight and compensation process to repay Mt. Gox creditors. Karpelès stated that this proposal is merely a starting point for discussion, intending to limit the rule change to a single address and activate it at a future block height. However, the proposal also acknowledges that this plan requires a coordinated upgrade across the entire network, and if some community members refuse to support it, it could lead to a risk of a blockchain split. It's important to note that these approximately 80,000 BTC are not currently part of the assets allocated to Mt. Gox creditors, nor are they controlled by the bankruptcy trustee.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052905&language=en-US",
            "pub_date": "2026-02-28 06:37:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052904,
            "title": "Morgan Stanley applies for a banking license to expand its digital asset custody and pledging business.",
            "description": "Morgan Stanley has reportedly applied for a new national trust bank license to conduct digital asset custody business and plans to offer staking and trading services to investment clients, demonstrating its continued strategic focus on the crypto space. The application was submitted to the Office of the Comptroller of the Currency (OCC) by Morgan Stanley Digital Trust on February 18. If approved, the license will allow Morgan Stanley to conduct digital asset custody and related services as a banking institution. This move marks a further shift in Morgan Stanley's attitude towards the crypto asset sector. In recent years, the bank has gradually moved from a relatively cautious stance to a more active participation in the digital asset market, consistent with the overall trend of traditional financial institutions. Previously, Morgan Stanley appointed senior executive Amy Oldenburg to lead its digital asset business strategy and applied to launch spot Bitcoin and Solana ETF products, while also planning to launch its own digital wallet this year. Morgan Stanley's license application comes at a time when several crypto-native institutions are seeking compliant banking status. Several companies have recently received conditional approvals, indicating that the integration of traditional finance and the crypto industry is accelerating.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052904&language=en-US",
            "pub_date": "2026-02-28 06:38:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052878,
            "title": "🇺🇸 BIG: U.S. M2 money supply has reached a new all-time high of $22.45 trillion.",
            "description": "null\nsource: https://x.com/cointelegraph/status/2027504118932124047",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052878&language=en-US",
            "pub_date": "2026-02-28 06:00:25",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052877,
            "title": "Are Institutions Killing Bitcoin And Ethereum? Here’s How They’ve Fared Since Companies Got Involved",
            "description": "Institutional capital has transformed the cryptocurrency market dynamics, changing who participates and how digital assets are traded. The arrival of spot exchange-traded funds, corporate treasury allocations, and access through major brokerage platforms has pulled Bitcoin and Ethereum deeper into traditional finance. Vanguard, for instance, reversed its long-held anti-crypto stance just a few months ago, allowing trading in funds that hold Bitcoin, Ethereum, XRP, and Solana. However, talking about bad timing, these cryptocurrencies have struggled in the months following that policy change\nsource: https://www.newsbtc.com/news/institutions-killing-bitcoin-eth/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052877&language=en-US",
            "pub_date": "2026-02-28 06:00:40",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052874,
            "title": "Morgan Stanley Moves to Build Its Own Crypto Bank",
            "description": "Morgan Stanley has filed an application with the Office of the Comptroller of the Currency to establish a national trust bank charter, marking the firm’s most significant structural commitment to digital assets to date, and signaling a deliberate shift away from third-party infrastructure toward fully in-house crypto custody and trading.\nsource: https://www.ethnews.com/morgan-stanley-moves-to-build-its-own-crypto-bank/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052874&language=en-US",
            "pub_date": "2026-02-28 05:56:18",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052872,
            "title": "U.S. President Donald Trump Remains Neutral in Key State Race",
            "description": "U.S. President Donald Trump has not yet endorsed a candidate in the state's most contentious race. Bloomberg posted on X, highlighting the president's decision to remain neutral in this significant political contest. The race has garnered considerable attention due to its potential impact on the political landscape. Observers are closely monitoring the situation, as Trump's endorsement could sway the outcome. Despite the anticipation, the president has opted to withhold his support, leaving candidates and voters in suspense. The decision reflects a strategic approach, as Trump weighs the implications of his involvement in the race.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052872&language=en-US",
            "pub_date": "2026-02-28 05:55:32",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052871,
            "title": "AI's Impact on Wall Street's Investment Strategies",
            "description": "The recent week saw artificial intelligence dramatically alter Wall Street's investment strategies, not due to an earnings miss or a Federal Reserve surprise, but rather through a thought experiment shared on Substack. Bloomberg posted on X, highlighting the significant shift AI has brought to financial markets.\n\nThe discussion centered around AI's potential to reshape traditional investment approaches, prompting analysts and investors to reconsider their strategies. This development underscores the growing influence of technology in financial decision-making, as AI tools become increasingly integrated into market analysis.\n\nExperts suggest that AI's ability to process vast amounts of data quickly and accurately could lead to more informed investment choices, potentially enhancing returns and reducing risks. As AI continues to evolve, its role in finance is expected to expand, challenging conventional methods and offering new opportunities for growth.\n\nThe conversation around AI's impact on Wall Street reflects broader trends in the financial sector, where technological advancements are driving innovation and change. Investors and analysts are closely monitoring these developments, recognizing the need to adapt to an increasingly digital landscape.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052871&language=en-US",
            "pub_date": "2026-02-28 05:56:46",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052870,
            "title": "Live Nation's Antitrust Lawsuit Heads to Trial Amid Failed Settlement Attempts",
            "description": "Live Nation's attempts to resolve a federal antitrust lawsuit have been rejected by government attorneys, keeping the case on course for trial next week. Bloomberg posted on X, highlighting the ongoing legal battle that seeks to dismantle the company. The lawsuit, which has drawn significant attention, aims to address concerns over Live Nation's market practices and its impact on competition. Despite multiple settlement proposals, the government remains firm in pursuing the case, underscoring the seriousness of the antitrust allegations. As the trial approaches, the outcome could have substantial implications for the entertainment industry and antitrust enforcement.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052870&language=en-US",
            "pub_date": "2026-02-28 06:00:44",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052869,
            "title": "Paradigm Seeks to Raise $1.5 Billion for New Fund",
            "description": "Cryptocurrency investment firm Paradigm is reportedly aiming to secure up to $1.5 billion for its upcoming fund. According to BWEnews, the firm is looking to expand its investment portfolio in the digital asset sector. This move comes as the cryptocurrency market continues to evolve, attracting significant interest from institutional investors. Paradigm's fundraising efforts highlight the growing confidence in the potential of digital currencies and blockchain technology. The firm has previously been involved in several high-profile investments within the industry, and this new fund is expected to further bolster its position in the market.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052869&language=en-US",
            "pub_date": "2026-02-28 06:00:49",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052862,
            "title": "U.S. Treasury Department Considers Enhanced Oversight of 351 Conversions",
            "description": "The U.S. Treasury Department is exploring measures to intensify the examination of 351 conversions. Bloomberg posted on X, indicating that one of the proposals under consideration involves labeling these conversions to ensure greater transparency and oversight. The initiative aims to address concerns related to the financial implications and regulatory compliance associated with these transactions. The department's move reflects a broader effort to enhance financial scrutiny and safeguard economic stability. Further details on the proposal and its potential impact on the market are yet to be disclosed.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052862&language=en-US",
            "pub_date": "2026-02-28 05:43:08",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052858,
            "title": "3 Solana data points highlight resilience, but is SOL undervalued?",
            "description": "SOL is down 72% from its all-time high, but several data points paint a compelling investment scenario. Is SOL trading at a deep discount?\nsource: https://cointelegraph.com/news/3-solana-data-points-highlight-resilience-but-is-sol-undervalued?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052858&language=en-US",
            "pub_date": "2026-02-28 05:30:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052859,
            "title": "Spain’s Financial Regulator CNMV Publishes MiCA Warning on Bitcoin Hyper ($HYPER) and Related Offshore Entities",
            "description": "Spain’s financial regulator, the Comisión Nacional del Mercado de Valores (CNMV), issued a public warning about Bitcoin Hyper ($HYPER), a crypto presale project marketing itself as a Bitcoin Layer-2 solution. On 19 January 2026, the CNMV published a notice saying that the project and related entitie\nsource: https://theholycoins.com/news/spain-s-financial-regulator-cnmv-publishes-mica-warning-on-bitcoin-hyper-usdhyper-and-related",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052859&language=en-US",
            "pub_date": "2026-02-28 05:30:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052857,
            "title": "Experts Advise Enhanced Security Measures for Crypto Investors Amid Rising Threats",
            "description": "Crypto investors are facing growing security threats, including physical wrench attacks and advanced phishing schemes. According to NS3.AI, experts Jameson Lopp and Beau suggest adopting a 'zero crypto at home' strategy to safeguard assets. This approach involves utilizing multi-signature wallets, hardware wallets, and distributed key management to prevent losses due to physical coercion.\n\nThe experts stress the importance of digital hygiene practices, such as wallet segregation and the use of hardware security keys, to enhance security. Additionally, they recommend implementing physical security measures to further mitigate risks. Despite these threats, Lopp and Beau advocate for continued self-custody and sovereignty in managing crypto assets.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052857&language=en-US",
            "pub_date": "2026-02-28 05:33:55",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052853,
            "title": "SpaceX $1.75T IPO Could Shake Markets – Here Is What Investors Expect",
            "description": "The highly anticipated initial public offering (IPO) of SpaceX, which is projected to reach a staggering valuation of $1.75 trillion, has the potential to significantly disrupt financial markets around the world. This monumental event could alter investor sentiment and trading dynamics, prompting a wave of speculation and interest among market participants. In light of this development, investors are keen to understand the possible implications and trends that may emerge as a result of one of the largest IPOs in history. Here is an in-depth analysis of what investors expect to unfold in the markets following the launch of SpaceX's IPO.\nsource: https://blocknews.com/spacex-1-75t-ipo-could-shake-markets-here-is-what-investors-expect/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052853&language=en-US",
            "pub_date": "2026-02-28 05:24:14",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052852,
            "title": "Crypto Lost $17 Billion to Fraud in 2025 and the Scams Are Getting Smarter",
            "description": "The Chainalysis 2026 Crypto Crime Report, released in January, puts a precise figure on the scale of cryptocurrency fraud throughout 2025. Scams and fraud collectively drained $17 billion from victims globally over the course of the year. For context, that figure surpasses the GDP of several small nations\nsource: https://www.ethnews.com/crypto-lost-17-billion-to-fraud-in-2025-and-the-scams-are-getting-smarter/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052852&language=en-US",
            "pub_date": "2026-02-28 05:24:19",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}