{
    "data": [
        {
            "id": 733942,
            "title": "CFTC Restructures Enforcement Division To Combat Fraud",
            "description": "According to BlockBeats, the U.S. Commodity Futures Trading Commission (CFTC) has reorganized its enforcement division to enhance its focus on combating fraud. Acting Chair Caroline Pham stated that the agency aims to shift away from regulating through enforcement actions.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733942&language=en-US",
            "pub_date": "2025-02-05 09:34:10",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733938,
            "title": "Hester Peirce: Cryptocurrency Working Group proposes to recommend SEC action to provide temporary forward-looking and retroactive relief for token issuance",
            "description": "Odaily Planet Daily News: U.S. SEC Commissioner Hester Peirce said: \"The Cryptocurrency Working Group is considering recommending that the SEC take action to provide temporary forward-looking and retroactive relief for token issuance, in which the issuing entity or other entity willing to assume responsibility provides certain specific information and keeps it updated, and agrees not to question the SEC's jurisdiction in cases alleging fraud related to the purchase and sale of assets.\" She also said: \"We will work with the federal government, state securities regulators, and international counterparts. We invite builders, enthusiasts, and skeptics to explore with us what the final rules should be and what temporary measures may help promote innovation during this period.\" (The Block) Earlier news, the U.S. SEC launched a new cryptocurrency working group website. According to the webpage, the cryptocurrency working group aims to clarify the application of federal securities laws in the crypto asset market and propose practical policy measures to promote innovation and protect investors. The crypto working group works with committee staff and the public to help develop new approaches to crypto asset regulation. The Crypto Working Group will help draw clear regulatory lines that appropriately distinguish between securities and non-securities, develop a tailored disclosure framework, provide a practical registration path for crypto assets and market intermediaries, ensure that investors have the information they need to make investment decisions, and ensure that enforcement resources are deployed wisely.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733938&language=en-US",
            "pub_date": "2025-02-05 09:37:06",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733937,
            "title": "The ENS cold wallet address transferred 72,000 ENS to Binance 10 hours ago, worth $2.04 million",
            "description": "Odaily Planet Daily News: According to monitoring by on-chain analyst Yu Jin, the ENS cold wallet address transferred 72,000 ENS (US$2.04 million) to FalconX (a digital asset broker) 10 hours ago, and then immediately transferred it from FalconX to Binance.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733937&language=en-US",
            "pub_date": "2025-02-05 09:40:31",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733941,
            "title": "Crypto Industry Seeks Constructive Dialogue With Regulators",
            "description": "According to Odaily, Nate Geraci, President of The ETF Store, expressed on X that the cryptocurrency industry desires meaningful discussions with regulators rather than being presumed as criminals or fraudsters. He welcomed the shift in regulatory approach, emphasizing the importance of balancing innovation with regulation. Geraci noted that it is crucial not to equate innovation with criminal activity and fraud.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733941&language=en-US",
            "pub_date": "2025-02-05 09:43:44",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733935,
            "title": "MicroStrategy Sells Preferred Stock Units At Discounted Rate",
            "description": "According to PANews, MicroStrategy recently sold preferred stock units, a debt-like security, with an 8% coupon rate. These stocks were offered at $80 per share, which is 20% below the market price, effectively raising the buyer's yield to 10%. This significant concession was made to complete the transaction.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733935&language=en-US",
            "pub_date": "2025-02-05 09:24:12",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733933,
            "title": "The U.S. Treasury Department clarified that the Department of Government Efficiency only has \"read-only\" access to the payment system and has not suspended or refused payments",
            "description": "Odaily Planet Daily News The U.S. Treasury Department said that Musk's Department of Government Efficiency (DOGE) personnel assigned to the agency had \"read-only\" access to its sensitive $5 trillion payment system, and that no payments had been suspended or rejected as part of the ongoing review.\nTreasury officials provided this information in a letter to lawmakers, which is the first time to substantively detail the role of the Department of Government Efficiency staff assigned to the agency in the operations of the Bureau of Fiscal Services.\nAn unnamed official said in the letter late Tuesday: \"The ongoing review of the Treasury system will not result in the suspension or rejection of any payment instructions submitted to the Treasury by other federal agencies of the government. In particular, the review of the Bureau of Fiscal Services has not resulted in the delay or change of payments for obligations such as Social Security and Medicare.\"\nThe letter marks the first time that the Treasury Department has publicly acknowledged and explained the position held by Tom Krause, CEO of Cloud Software Group, who has ties to DOGE. In recent weeks, Krause has been described as a central staff member with ties to DOGE, pushing efforts to ensure access to payment systems, and ultimately obtaining access granted by Treasury Secretary Scott Bessent.\nThe letter states that Krause is now a Treasury employee with \"read-only access to the Fiscal Service Payment System's coded data to continue this operational efficiency assessment.\" (CNN)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733933&language=en-US",
            "pub_date": "2025-02-05 09:24:48",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733932,
            "title": "Coinbase CEO calls for creating a \"Y Combinator\" for politics",
            "description": "Odaily Planet Daily News Coinbase CEO Brian Armstrong wrote in X: \"Who is building Y Combinator for politicians? We need a supply chain of techno-optimist candidates who want to develop their skills to win elections on both sides of the aisle.\"",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733932&language=en-US",
            "pub_date": "2025-02-05 09:29:02",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733931,
            "title": "Planet Morning News",
            "description": "1. Coinbase sent a letter to US regulators, requesting a report on the clarity of banking services in the crypto industry;\n2. Berachain mainnet will be launched on February 6;\n3. Ionic suffered a loss of $8.6 million from the attack, and its predecessor Midas protocol was attacked twice;\n4. AI Agent app store Olas received $13.8 million in financing, led by 1kx;\n5. DePIN game infrastructure Beamable completed a $13.5 million Series A financing, led by Bitkraft Ventures;\n6. Taproot Wizards completed a $30 million financing, led by Standard Crypto;\n7. Justin Sun: Li Lin concealed due diligence materials when selling Huobi, and there was a $30 million hole inside;\n8. Grayscale formally submitted the LTC ETF 19b-4 application;\n9. David Sacks: Will promote regulation to ensure that innovation in the crypto field occurs in the United States;\n10. Chairman of the U.S. House Financial Services Committee: Both houses of Congress will set up a cryptocurrency working group;\n11. The SEC launched a new cryptocurrency task force website to \"provide clarity on crypto regulations\";\n12. Crypto Tsar David Sacks: The feasibility of Bitcoin reserves is being studied;\n13. Federal Reserve Jefferson: There is no need to rush to further cut interest rates, and a strong economy makes it appropriate to respond cautiously;\n14. Crypto.com will submit an application for Cronos ETF and issue a new stablecoin;\n15. Semler Scientific, a U.S. listed company, increased its holdings of 871 BTC for $88.5 million;\n16. Solana's on-chain Meme project PAIN pre-sale raised 187,774 SOLs;\n17. Musk: Some Reddit users' threats to DOGE employees are illegal, don't mess with DOGE.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733931&language=en-US",
            "pub_date": "2025-02-05 09:30:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733930,
            "title": "A whale bought $27.5 million of AAVE in the past 4 hours and currently holds 230,000 AAVE",
            "description": "Odaily Planet Daily News According to the monitoring of on-chain analyst Yu Jin, a whale used 10,090 stETH to purchase 102,000 AAVE (US$27.5 million) in the past 4 hours.\nHe now holds up to 230,000 AAVE (US$61.98 million), with an average cost price of US$223.4, making him the second largest AAVE holding address after the project party/protocol contract/CEX.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733930&language=en-US",
            "pub_date": "2025-02-05 09:16:04",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733926,
            "title": "Google's parent company expects AI capital expenditures to reach $75 billion this year, up 43% from 2024",
            "description": "Odaily Planet Daily News: The DeepSeek impact has not slowed down the expansion of AI capital expenditures by technology companies. Google's parent company Alphabet said it expects capital expenditures to reach $75 billion this year, a 43% increase from 2024.\nThis puts Google very close to Microsoft, which has said it will spend $80 billion on artificial intelligence data centers in the fiscal year ending in June. Meta Platforms plans to spend up to $65 billion on capital expenditures, just behind. Meanwhile, Amazon expects capital expenditures of $75 billion in 2024. (The Information)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733926&language=en-US",
            "pub_date": "2025-02-05 09:04:17",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}