{
    "data": [
        {
            "id": 733898,
            "title": "MicroStrategy sells preferred shares at 20% discount, pushing investor yield to 10%",
            "description": "MicroStrategy sold preferred stock units last week, a debt-like security with an 8% coupon. The shares were sold at $80 per share, 20% below the market price, effectively pushing the buyer's yield to 10%, a major concession to complete the deal.\nJames Dinsmore, a portfolio manager at Gabelli Funds Inc. who focuses on convertible securities, said: \"I can't remember the last time I saw something so low, and obviously there was some resistance to the initial pricing.\"\nNevertheless, the investor-friendly terms of the deal allowed the company to raise $563 million, more than double its initial target, as co-founder and chairman Michael Saylor is exploring a variety of capital structures to support his Bitcoin buying strategy. This demand shows the market's interest in this asset class, and the company said that although it is more expensive than the ultra-low interest convertible bonds and par stocks previously issued, it can use it to raise up to $2 billion this quarter.\nMicroStrategy did not respond to a request for comment.\n\"A 10% yield is not cheap capital, but I think it's appropriate given the company's profile,\" said David Clott, portfolio manager at Wellesley Asset Management. \"And they won't dilute existing investors like they did with the previous convertible bond issuance. This is a good result for them because they open up a new financing market.\" The plan is part of the company's broader plan to raise $42 billion over three years through a combination of stocks and fixed-income securities, and it is expected to turn to the latter this quarter. This is partly because the company raised nearly $17 billion through its stock sale plan, while it raised much less through convertible bonds. The company currently owns about $47 billion in Bitcoin, accounting for more than 2% of its total. (Bloomberg) Earlier, MicroStrategy announced that it would issue 7,300,000 shares of 8.00% Series A perpetual exercise preferred stock (\"perpetual exercise preferred stock\") on January 30, 2025, with a public offering price of $80.00 per share. The issuance and sale of the perpetually exercisable preferred stock is scheduled to close on February 5, 2025, subject to customary closing conditions.\nMicroStrategy estimates that the net proceeds from the offering, after deducting underwriting discounts and commissions and MicroStrategy's estimated offering expenses, will be approximately $563.4 million. MicroStrategy intends to use the net proceeds from the offering for general corporate purposes, including the acquisition of Bitcoin, and for working capital.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733898&language=en-US",
            "pub_date": "2025-02-05 08:29:56",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733897,
            "title": "Today's Fear and Greed Index dropped to 54, and the level changed from Greedy to Neutral",
            "description": "Odaily Planet Daily News Today's Fear and Greed Index dropped sharply to 54 (yesterday's was 72), and the level changed from greed to neutral.\nNote: The threshold of the Fear Index is 0-100, including indicators: volatility (25%) + market trading volume (25%) + social media heat (15%) + market research (15%) + Bitcoin's proportion in the entire market (10%) + Google hot word analysis (10%).",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733897&language=en-US",
            "pub_date": "2025-02-05 08:11:56",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733896,
            "title": "CFTC reorganizes its enforcement division to refocus on fraud and stop enforcement",
            "description": "Odaily Planet Daily News Caroline Pham, the new acting chairwoman of the U.S. CFTC, said on Tuesday that the regulator has reorganized its enforcement division to \"refocus\" on fraud and \"stop regulating through enforcement.\" \nUnder the leadership of former chairman Rostin Behnam, the CFTC Enforcement Division had several working groups, one of which focused on insider trading, another on cybersecurity and emerging technologies, and a third aimed at combating environmental fraud. The new reorganization reduces the number of working groups to just two. \nThe newly established Complex Fraud Working Group is responsible for handling enforcement work on complex fraud and manipulation across all asset classes, from preliminary investigations to litigation. Deputy Director of Enforcement Paul Hayeck will serve as the acting head of the Complex Fraud Working Group. The Retail Fraud and General Enforcement Working Group will handle retail fraud and general enforcement work, led by Charles Marvine, deputy director of the agency's enforcement division. \n“This streamlined structure will be less regulatory and more efficient in enforcement,” Pham said in a press statement. “These much-needed changes will maximize the CFTC’s resources and take more action to go after fraudsters and other bad actors, rather than punishing good citizens.”\n\nAccording to the CFTC’s announcement, the new structure will “more effectively use the CFTC’s resources to prevent fraud, manipulation, and abuse and ensure market integrity,” as well as “strengthen governance and oversight of enforcement matters to prevent overreach and enhance consistency, fairness, and due process.” (CoinDesk)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733896&language=en-US",
            "pub_date": "2025-02-05 08:16:13",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733895,
            "title": "Marvel's Alleged AI Flub? Fans Spot Odd Hands in New Fantastic Four Poster",
            "description": "Marvel Studios faces backlash online after fans allegedly spot AI-generated hands in the new Fantastic Four poster.\nsource: https://decrypt.co/304440/marvels-alleged-ai-flub-fans-spot-odd-hands-in-new-fantastic-four-poster",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733895&language=en-US",
            "pub_date": "2025-02-05 07:57:30",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733894,
            "title": "WLFI wallets saw a net inflow of approximately $340 million in ETH before transferring a large amount of assets to Coinbase Prime",
            "description": "Odaily Planet Daily News Since the launch of World Liberty (WLFI) in October last year, market observers have questioned the Trump family's possible conflicts of interest, as the Trump administration has absolute influence on regulation. Normally, the promise of investment returns hinted at by Eric Trump, the second son of Trump, for the first time, may attract the scrutiny of regulators such as the U.S. SEC, which usually believes that this indicates that an asset is a security that it should regulate.\nRyne Miller, partner at Lowenstein Sandler LLP and former general counsel of the U.S. division of bankrupt cryptocurrency exchange FTX, said: \"We are still exploring new models for the future intersection of cryptocurrency and securities law. What remains unchanged is that regulators will expect transparency and disclosure and will continue to be very active when fraud or other similar misconduct is suspected. What we do hope to change is that good-faith statements and actions about cryptocurrency projects will not immediately escalate into the risk of SEC enforcement investigations, which is a welcome change.\" According to blockchain data analysis company Nansen, World Liberty's digital wallets had a net inflow of about 21,177 ETH on Monday, worth about $55 million, a figure that includes both purchases and conversions of ETH derivatives into cryptocurrencies. Nansen also estimated that World Liberty's digital wallets received a total of about $340 million worth of ETH net inflows between January 18 and February 1 before the funds were sent to Coinbase Prime's wallets. WLFI said: \"We are making daily transfers of crypto assets in accordance with regular financial management to pay fees and expenses and to meet liquidity needs. To be clear, we are not selling tokens - we are just reallocating assets for daily business purposes.\" (Bloomberg) \nPrevious news, Trump's second son Eric Trump said on X that now is a great time to increase ETH holdings (In my opinion, it's a great time to add ETH.).",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733894&language=en-US",
            "pub_date": "2025-02-05 08:08:30",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733885,
            "title": "Luke Pettit appointed as head of US Treasury’s banking policy, involving digital asset firms",
            "description": "Odaily Planet Daily News The Trump administration has appointed Luke Pettit, an assistant to Republican Senator Bill Hagerty, to a senior position in the U.S. Treasury Department. According to a notice on Congress.gov, Pettit has been nominated as Assistant Secretary of Financial Institutions. Pettit will be in charge of the Treasury Department's department office, which plays an important role in formulating policies to regulate banks, fintech companies (including digital asset companies), non-bank mortgage institutions and many other financial companies. The position requires Senate approval.\nPettit has served as a senior policy adviser to Hagerty, a Republican from Tennessee, for the past three years. According to his LinkedIn profile, before that, he was an economist on the Senate Banking Committee and served at Bridgewater Fund, the Monetary Affairs Department of the Federal Reserve Bank of Washington, and the Federal Reserve Bank of San Francisco.\nHe will replace Graham Steele, who held the position during the Biden administration. Steele left the Treasury Department in January 2024.\nEthan Fallang, a former Rumble Inc. board member and protégé of Vice President JD Vance, has also been appointed to a senior position in the Treasury Department's Office of Financial Institutions. Fallang was a top candidate for the position of deputy assistant secretary for capital markets, according to people familiar with the matter, but it is unclear whether he has accepted the position. (Bloomberg)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733885&language=en-US",
            "pub_date": "2025-02-05 07:54:07",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733882,
            "title": "President Trump’s Crypto Czar Hosts U.S.’s First Press Conference On Bitcoin And Digital Assets",
            "description": "David Sacks and several pro-crypto politicians discuss the future of the Bitcoin and crypto industry in the United States at the first-ever U.S. press conference on digital assets.\nsource: https://bitcoinmagazine.com/politics/president-trumps-crypto-czar-hosts-first-press-conference-on-bitcoin-and-digital-assets",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733882&language=en-US",
            "pub_date": "2025-02-05 07:39:46",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733881,
            "title": "SEC is scaling back its crypto enforcement unit: Report",
            "description": "The SEC’s 50-person crypto unit is getting a shakeup with some staff reassigned to other areas, The New York Times reports.\nsource: https://cointelegraph.com/news/sec-scale-back-crypto-enforcement-unit-nyt?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733881&language=en-US",
            "pub_date": "2025-02-05 07:40:17",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733880,
            "title": "Ohio Senator Proposes Building Bitcoin Reserve and Accepting It as Payment",
            "description": "Odaily Planet Daily News: Ohio Senator Sandra O'Brien introduced a bill proposing to establish a Bitcoin reserve and require state entities to accept Bitcoin as a payment method.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733880&language=en-US",
            "pub_date": "2025-02-05 07:43:13",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733884,
            "title": "Ohio Senator Proposes Bill for Bitcoin Reserves and Payments",
            "description": "According to Odaily, Ohio State Senator Sandra O'Brien has introduced a bill proposing the establishment of a Bitcoin reserve and mandating state entities to accept Bitcoin as a form of payment. This legislative move aims to integrate cryptocurrency into the state's financial system, reflecting a growing interest in digital currencies.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733884&language=en-US",
            "pub_date": "2025-02-05 07:43:33",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}