{
    "data": [
        {
            "id": 1051823,
            "title": "An address suspected to belong to Monetalis transferred 325,000 UNI tokens to Wintertermute.",
            "description": "According to The Data Nerd, 17 hours ago, a whale wallet suspected to be associated with Monetalis transferred 325,000 UNI tokens, worth $1.24 million, to Wintermute. This wallet currently holds 3.27 million UNI tokens, worth $12.75 million; 31,337 ETH, worth $63.81 million; and 98,900 AAVE tokens, worth $11.86 million.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051823&language=en-US",
            "pub_date": "2026-02-27 17:10:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051813,
            "title": "New World Reports Loss Amid Hong Kong Property Slump",
            "description": "New World Development Co. has reported a loss for the first half of the year, reflecting the ongoing challenges in Hong Kong's property market. Bloomberg posted on X, highlighting the impact of the property downturn on the developer's financial performance. The company, which has been grappling with a sluggish real estate sector, continues to face difficulties as market conditions remain unfavorable. The downturn in Hong Kong's property market has been a significant factor affecting New World's financial results, as the developer navigates through a challenging economic landscape.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051813&language=en-US",
            "pub_date": "2026-02-27 17:11:09",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051812,
            "title": "GEOPOLITICS | Sweden Intercepts Suspected Russian Drone Near French Aircraft Carrier",
            "description": "Swedish authorities have intercepted a drone suspected to be of Russian origin as it approached the French aircraft carrier Charles de Gaulle, docked at Malmö port. According to Jin10, the incident raises concerns over regional security and the potential for increased geopolitical tensions. The interception underscores the vigilance required in monitoring airspace near critical military assets. The presence of the French carrier in Swedish waters is part of ongoing naval operations, and the incident highlights the complexities of international military engagements in the region.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051812&language=en-US",
            "pub_date": "2026-02-27 17:11:34",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051811,
            "title": "Hong Kong's January Export and Import Values Surge",
            "description": "Hong Kong's Census and Statistics Department reported a 33.8% year-on-year increase in the total value of goods exported in January, marking the 23rd consecutive month of growth. Imports rose by 38.1% year-on-year, continuing a 13-month upward trend, with both exports and imports expanding by nearly 8 percentage points month-on-month. According to RTHK, January recorded a visible trade deficit of HKD 14.1 billion.\n\nThe government noted that due to the varying dates of the Lunar New Year holiday, it is more appropriate to analyze trade figures for January and February combined. Data showed a 37.3% increase in the value of exports to Asia last month. Exports to Malaysia surged by 81.1%, while those to mainland China rose by 40.6%. Exports to Singapore, Thailand, and Vietnam increased by over 30%, and exports to Switzerland more than doubled.\n\nImports from Vietnam and India more than doubled, while those from mainland China and Singapore rose by over 40%. A government spokesperson stated that the significant increase in the value of goods exported last month was evident across most markets and major commodity categories, reflecting a robust underlying growth momentum. Looking ahead, Hong Kong's merchandise trade performance is expected to benefit from the continued moderate expansion of the global economy and strong demand for AI-related electronic products. The government will remain vigilant regarding changes in trade policies in the external environment.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051811&language=en-US",
            "pub_date": "2026-02-27 17:12:15",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051800,
            "title": "Denmark's Prime Minister Advocates Wealth Tax to Address Inequality",
            "description": "Danish Prime Minister Mette Frederiksen has proposed the introduction of a wealth tax to tackle inequality in the country. Bloomberg posted on X, highlighting Frederiksen's belief that such a tax would help create a more balanced society. The Prime Minister emphasized the importance of addressing economic disparities to ensure a fairer distribution of resources. Frederiksen's proposal comes amid ongoing discussions about economic reforms and social equity in Denmark.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051800&language=en-US",
            "pub_date": "2026-02-27 17:01:23",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051799,
            "title": "Launch of Prediction Market Platform TBD Raises $3 Million in Funding",
            "description": "TBD, a newly launched prediction market platform, has successfully raised $3 million in funding. According to NS3.AI, the platform aims to introduce innovative features within the prediction market space, drawing significant interest from investors. This development is expected to influence decentralized finance applications, highlighting the growing interest in prediction markets.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051799&language=en-US",
            "pub_date": "2026-02-27 17:01:42",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051798,
            "title": "Enforcement Directorate Seizes Anil Ambani's $410 Million Home",
            "description": "The Enforcement Directorate has escalated its investigation into Anil Ambani by seizing his $410 million residence located in an upscale neighborhood. Bloomberg posted on X, highlighting the ongoing scrutiny faced by Ambani amid financial allegations. The seizure marks a significant development in the case, as authorities continue to probe into Ambani's financial dealings. The Enforcement Directorate's actions are part of a broader effort to address alleged financial irregularities associated with Ambani. The investigation has drawn considerable attention, given Ambani's prominent status in the business world. Further developments are anticipated as the case progresses.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051798&language=en-US",
            "pub_date": "2026-02-27 17:02:19",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051797,
            "title": "Businesses Rush to Secure Tariff Refunds",
            "description": "Businesses are actively seeking to obtain their tariff refund checks as trade tensions continue to impact global markets. Bloomberg posted on X, highlighting the urgency among companies to recover funds amid ongoing economic uncertainties. The refunds are part of efforts to mitigate the financial strain caused by tariffs imposed during trade disputes. Companies are navigating complex procedures to ensure they receive the refunds, which are seen as crucial for maintaining financial stability. The situation underscores the broader challenges faced by businesses in adapting to fluctuating trade policies and economic conditions.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051797&language=en-US",
            "pub_date": "2026-02-27 17:02:35",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051785,
            "title": "Bitcoin ETFs Pull $254M as BlackRock Leads: Ethereum Sees Modest Inflows, XRP Extends Gains",
            "description": "Key Takeaways: Bitcoin ETFs saw $254. 4M in net inflows on Feb. 26. Ethereum ETFs recorded $6. 6M in net inflows.\nsource: https://coindoo.com/bitcoin-etfs-pull-254m-as-blackrock-leads-ethereum-sees-modest-inflows-xrp-extends-gains/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051785&language=en-US",
            "pub_date": "2026-02-27 16:45:18",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051784,
            "title": "🇺🇸 LATEST: OCC says regulators should manage, not eliminate, risk and tailor rules to keep the federal banking system relevant and healthy.",
            "description": "null\nsource: https://x.com/cointelegraph/status/2027304110370812016",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051784&language=en-US",
            "pub_date": "2026-02-27 16:45:40",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051783,
            "title": "Cape Town Mayor Announces Candidacy for Democratic Alliance Leadership",
            "description": "Cape Town Mayor Geordin Hill-Lewis has announced his intention to run for the leadership of the Democratic Alliance, South Africa's second-largest political party. Bloomberg posted on X, detailing Hill-Lewis's decision to enter the race, which comes as the party seeks to strengthen its position ahead of upcoming elections. Hill-Lewis, who has served as mayor since November 2021, aims to bring fresh perspectives and strategies to the party's leadership. His candidacy is expected to influence the party's direction and policies as it prepares for future political challenges. The Democratic Alliance has been a significant force in South African politics, and Hill-Lewis's leadership bid marks a pivotal moment for the party.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051783&language=en-US",
            "pub_date": "2026-02-27 16:46:45",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051782,
            "title": "STOCKS | European Shares Set for Longest Monthly Winning Streak Since 2013",
            "description": "European shares began the last trading session of February poised to achieve their longest monthly winning streak since 2013. Bloomberg posted on X, highlighting the positive momentum in the market as investors remain optimistic about economic recovery prospects. The rally has been driven by strong corporate earnings and supportive monetary policies across the region. Analysts suggest that the sustained growth reflects confidence in the European economy's resilience amid global uncertainties. As February concludes, market participants are closely monitoring economic indicators and geopolitical developments that could influence future performance.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051782&language=en-US",
            "pub_date": "2026-02-27 16:48:47",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051778,
            "title": "Malaysia to Consider Royal Commission for Anti-Graft Agency Investigation",
            "description": "Malaysia is set to determine if a Royal Commission of Inquiry will be formed to probe allegations of misconduct within the nation's anti-corruption agency. Bloomberg posted on X, highlighting the government's deliberation on this significant matter. The decision comes amid growing concerns over the integrity and operations of the agency tasked with combating corruption. Authorities are weighing the potential impact of such an inquiry on public trust and the agency's future effectiveness. The move reflects Malaysia's ongoing efforts to address corruption and ensure transparency in its institutions. Further details on the timeline and scope of the inquiry are yet to be disclosed.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051778&language=en-US",
            "pub_date": "2026-02-27 16:37:11",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051777,
            "title": "Jack Dorsey Addresses Overstaffing Issues During Pandemic",
            "description": "Jack Dorsey, former Twitter founder, responded on the X platform to community concerns about Block's layoffs being attributed to over-hiring and mismanagement during the COVID-19 pandemic. According to Odaily, Dorsey acknowledged that the company mistakenly established two separate structures, Square and Cash App, leading to excessive hiring. This issue was corrected by mid-2024. However, he noted that this did not address the complexities in lending, banking, and BNPL services. The current goal is to achieve over $2 million in gross profit per employee, quadrupling pre-pandemic efficiency, which was around $500,000 from 2019 to 2024. Dorsey emphasized that the company operates more efficiently than most.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051777&language=en-US",
            "pub_date": "2026-02-27 16:41:04",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051768,
            "title": "ROBO draws scrutiny as Binance perp rumor vs KuCoin futures",
            "description": "Fact-check: ROBOUSDT perpetual contract, Binance announcement, KuCoin futures — data shows Binance perp unconfirmed while KuCoin lists USDT‑margined futures.\nsource: https://coincu.com/news/robo-draws-scrutiny-as-binance-perp-rumor-vs-kucoin-futures/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051768&language=en-US",
            "pub_date": "2026-02-27 16:23:38",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051776,
            "title": "ROBO continues to rise, breaking through 0.03 USDT.",
            "description": "Market data shows that ROBO has continued to rise and broken through 0.03 USDT, currently trading at 0.0377 USDT, a short-term increase of over 80%.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051776&language=en-US",
            "pub_date": "2026-02-27 16:30:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051775,
            "title": "Jack Dorsey reiterates his stance on laying off nearly 4,000 employees due to AI: he admits to over-hiring and sets a future goal of achieving a profit-to-employment ratio of $2 million.",
            "description": "In response to the community's claim that \"Block's layoffs were primarily due to over-hiring and mismanagement during the COVID-19 pandemic,\" former Twitter founder Jack Dorsey posted on the X platform, stating, \"Yes, we over-hired during the pandemic because we mistakenly created two separate company structures (Square and Cash App), but this issue was corrected by mid-2024. However, this doesn't cover the full complexity of our lending, banking, and BNPL operations. Our current goal is over $2 million in gross profit per person, reaching four times the efficiency we had before the pandemic, which has remained around $500,000 from 2019 to 2024. In fact, we run a more efficient company than most.\"",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051775&language=en-US",
            "pub_date": "2026-02-27 16:31:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051767,
            "title": "Rightmove CEO Confident in AI Adaptation for Property Portals",
            "description": "Rightmove's CEO expressed confidence in the company's ability to adapt and thrive amid the rise of artificial intelligence in the property sector. Bloomberg posted on X, highlighting the CEO's belief that Rightmove and similar property portals will continue to be relevant despite technological advancements.\n\nThe CEO emphasized that while AI is transforming various industries, the human element remains crucial in real estate transactions. He noted that AI can enhance the user experience by providing more personalized property recommendations and streamlining processes, but it cannot replace the expertise and personal touch of real estate professionals.\n\nRightmove, a leading property portal, is focusing on integrating AI technologies to improve its platform and offer better services to users. The company aims to leverage AI to analyze data more effectively and provide insights that can assist both buyers and sellers in making informed decisions.\n\nThe CEO's comments come at a time when many industries are grappling with the implications of AI and automation. However, he remains optimistic about the future, stating that the combination of technology and human expertise will lead to a more efficient and effective property market.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051767&language=en-US",
            "pub_date": "2026-02-27 16:32:50",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051757,
            "title": "Switzerland's Pharmaceutical Sector Spurs Economic Recovery",
            "description": "Switzerland's economy is witnessing a recovery, primarily driven by its pharmaceutical industry. Bloomberg posted on X that the sector's growth has helped counterbalance the negative impact of significant U.S. tariffs on the country's export-dependent economy. The pharmaceutical industry, a crucial component of Switzerland's economic framework, has shown resilience and adaptability in the face of these challenges. This recovery highlights the sector's pivotal role in stabilizing the nation's economic landscape amid external pressures.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051757&language=en-US",
            "pub_date": "2026-02-27 16:15:34",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051756,
            "title": "GEOPOLITICS | Hungarian PM Orban Indicates Willingness to Address EU Funding Dispute",
            "description": "Hungarian Prime Minister Viktor Orban has suggested a potential willingness to resolve ongoing disagreements with European Union partners concerning financial support for Ukraine. Bloomberg posted on X, highlighting Orban's comments as a significant development in the EU's efforts to maintain unity in its approach to the Ukraine conflict.\n\nOrban's remarks come amid tensions within the EU over the allocation of funds to support Ukraine, which has been a contentious issue among member states. The Hungarian leader's openness to dialogue may pave the way for negotiations aimed at overcoming the impasse.\n\nThe EU has been striving to present a united front in its response to the situation in Ukraine, with financial aid being a crucial component of its strategy. Orban's position could influence the bloc's ability to effectively coordinate its support efforts.\n\nThis development is part of broader geopolitical dynamics as the EU navigates its relationship with Ukraine and addresses internal divisions over foreign policy priorities. The outcome of these discussions could have significant implications for the EU's role in the region and its ability to manage external challenges.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051756&language=en-US",
            "pub_date": "2026-02-27 16:16:31",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}