{
    "data": [
        {
            "id": 1053078,
            "title": "Nvidia Prepares to Launch Dedicated AI Chip, OpenAI Set to Be Major Customer",
            "description": "Nvidia is reportedly gearing up to introduce a specialized chip aimed at transforming the competitive landscape in AI computing. According to Jin10, OpenAI is expected to become one of the largest customers for Nvidia's new processor. This development marks a significant move in the tech industry, as Nvidia seeks to strengthen its position in the rapidly evolving AI sector.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053078&language=en-US",
            "pub_date": "2026-02-28 11:06:18",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053077,
            "title": "Nvidia CEO Jensen Huang: AI Revolutionizing Industries with New Software Development Approach",
            "description": "Nvidia CEO Jensen Huang has emphasized the transformative impact of artificial intelligence on software development. According to Bitalk News, Huang stated that AI has recently reached its third major turning point, with AI agents now capable of reasoning, accepting tasks, and completing computational work. The demand for AI has surged to unprecedented levels. Huang highlighted that AI fundamentally represents a new method of software development, influencing every company and transforming every industry, driven collectively by nations worldwide. This marks a new industrial revolution.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053077&language=en-US",
            "pub_date": "2026-02-28 11:06:51",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053076,
            "title": "Anthropic will sue the U.S. Department of Defense.",
            "description": "Anthropic has vowed to challenge the U.S. Department of Defense's decision to blacklist it in court, after the latter claimed the company refused to lift all restrictions on the military's use of its Claude model. The company also said it was \"deeply saddened\" by the escalating dispute. This cutting-edge artificial intelligence company is doing what few other companies have done since Trump returned to the White House: directly and openly challenging the Trump administration. Trump and Defense Secretary Hergesse threatened earlier Friday to cut off Anthropic from numerous customers through a \"supply chain risk\" designation, a practice historically reserved for \"foreign adversaries.\" Anthropic stated, \"No matter how the 'Department of War' intimidates or punishes us, it will not change our position on mass surveillance or fully automated weapons.\" \"We will challenge any supply chain risk designation through legal means.\" (Jinshi)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053076&language=en-US",
            "pub_date": "2026-02-28 11:11:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053075,
            "title": "Sam Altman: OpenAI will collaborate with the U.S. War Department to deploy models on classified networks.",
            "description": "OpenAI co-founder Sam Altman stated on X that the company has reached an agreement with the U.S. Department of War to deploy OpenAI models in its classified network environment. Under the terms of the agreement, the models cannot be used for large-scale domestic surveillance, and the agreement emphasizes that any application involving the use of force (including potential autonomous weapon systems) must adhere to the principle of \"human responsibility.\" OpenAI stated that it will build technical security measures for this deployment, ensuring the models run only on a cloud network, and will send field deployment engineers (FDEs) to participate in ensuring model security. OpenAI also stated that it has called on relevant departments to offer similar terms to other artificial intelligence companies to reduce legal and regulatory disputes through agreements.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053075&language=en-US",
            "pub_date": "2026-02-28 11:13:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053072,
            "title": "Anthropic PBC's Strong Start in Global AI Competition",
            "description": "Anthropic PBC has begun the year with significant momentum, marked by increasing sales and the launch of several viral products. Bloomberg posted on X, highlighting the company's successful large funding round, which has positioned it favorably in the competitive global AI landscape. The startup's achievements have provided it with a substantial edge in the ongoing race to advance artificial intelligence technologies.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053072&language=en-US",
            "pub_date": "2026-02-28 10:57:04",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053071,
            "title": "OpenAI Founder Urges Resolution to Avoid Legal and Government Actions",
            "description": "OpenAI founder Sam Altman expressed a strong desire for tensions to ease and for a reasonable agreement to be reached, avoiding legal and government interventions. According to Jin10, Altman emphasized the importance of finding a peaceful resolution to ongoing issues, highlighting the potential negative impact of escalating conflicts. His comments reflect a broader sentiment within the tech industry, where leaders are increasingly advocating for dialogue and cooperation over litigation and regulatory measures. Altman's statement underscores the need for constructive engagement to address challenges and foster innovation.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053071&language=en-US",
            "pub_date": "2026-02-28 10:59:32",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053070,
            "title": "OpenAI to Deploy Engineers for Model Safety",
            "description": "OpenAI founder Sam Altman announced that the company will deploy frontline engineers to assist with their models. According to Jin10, this move aims to ensure the safety of the models by conducting deployments exclusively on cloud networks.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053070&language=en-US",
            "pub_date": "2026-02-28 11:02:44",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053069,
            "title": "Aave DAO Votes on $42 Million Proposal Amid Controversy",
            "description": "Aave DAO is currently voting on a significant proposal to allocate up to $42 million to Aave Labs, with $25 million earmarked for ongoing product development and $17.5 million for milestone bonuses. According to ChainCatcher, as of Friday evening, the proposal had a narrow lead with 52% support, and the voting is set to conclude on Saturday.\n\nThe proposal has sparked debate due to Aave Labs' initial plan to limit the development of version 3 (v3) and force users to migrate to the yet-to-be-launched version 4 (v4). This plan faced strong opposition, leading the main contractor, Bored Ghosts Developing, to announce it would not renew its contract, criticizing the proposal as nearly absurd. In response, Aave Labs has made concessions, promising not to enforce the migration and to continue supporting v3.\n\nCritics, represented by Marc Zeller, argue that the requested funds are excessive, accounting for 31% of the DAO's reserves, and have called for the proposal to be split into multiple separate votes. However, Aave Labs is pushing for a single comprehensive vote. Currently, Aave v3 holds deposits exceeding $26.3 billion, representing over 97% of the protocol's total deposits.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053069&language=en-US",
            "pub_date": "2026-02-28 11:03:50",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053065,
            "title": "JUST IN: BITCOIN MINING GIANT REPORTS $1.7 BILLION LOSS\n\nMARA, one of the world's largest Bitcoin miners, reported a Q4 loss of some $1.7 billion.\n\nThe loss was driven by a collapse in $BTC's price during the period.\n\nAt the end of the year, it still held a staggering 53,822",
            "description": "null\nsource: https://x.com/BSCNews/status/2027570952595538010",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053065&language=en-US",
            "pub_date": "2026-02-28 10:26:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053064,
            "title": "Many newly created wallets are buying $EDEL!\n\nWallet 0x2942 was created 2 days ago and spent 50.75 $ETH($103K) to buy 6.7M $EDEL.\n\nWallet 0x7a06 was created 7 hours ago and spent 30.72 $ETH($59K) to buy 3.17M $EDEL.\n\nWallet 0xd365 was created 21 hours ago, received 100K $USDC to",
            "description": "null\nsource: https://x.com/lookonchain/status/2027573102344081602",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053064&language=en-US",
            "pub_date": "2026-02-28 10:34:32",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053060,
            "title": "Argentina's Labor Reform Passes Senate, Paving Way for Market Reentry",
            "description": "Argentine President Javier Milei's labor reform has successfully passed through the Senate, marking a significant achievement for the libertarian leader's agenda. Bloomberg posted on X that this legislative victory is expected to facilitate Argentina's reintegration into global markets. The reform aims to overhaul the country's labor laws, which Milei argues are essential for economic revitalization and attracting foreign investment. This development is seen as a crucial step in addressing Argentina's economic challenges and enhancing its competitiveness on the international stage. The passage of the reform reflects Milei's commitment to implementing policies that align with his libertarian principles, focusing on reducing government intervention and promoting free-market dynamics. As Argentina seeks to stabilize its economy, the successful enactment of this reform is anticipated to play a vital role in its efforts to engage more effectively with global economic systems.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053060&language=en-US",
            "pub_date": "2026-02-28 10:24:58",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053059,
            "title": "Digital Asset Regulation Bill Stalled Amid Stablecoin Yield Disputes",
            "description": "The CLARITY Act, designed to provide clear regulations for digital assets, is currently facing delays due to disagreements over stablecoin yield restrictions. According to NS3.AI, banks are advocating for stricter limits, expressing concerns that yield-bearing stablecoins could function similarly to unregulated deposits. In contrast, cryptocurrency companies argue that such restrictions could stifle innovation within the industry. Despite efforts by the White House to mediate a resolution before March, the bill remains stalled in a Senate committee without any agreement reached.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053059&language=en-US",
            "pub_date": "2026-02-28 10:28:23",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053058,
            "title": "Bitcoin Buying Interest Surges Globally, Approaching 2021 Peak Levels",
            "description": "Recent data indicates a significant increase in global search interest for 'How to buy Bitcoin,' nearing the peak levels observed in 2021. According to PANews, this trend highlights a renewed interest in Bitcoin acquisition among individuals worldwide. The surge in search activity suggests growing curiosity and potential investment interest in the cryptocurrency market.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053058&language=en-US",
            "pub_date": "2026-02-28 10:33:50",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053056,
            "title": "According to Artemis data, Hyperliquid Strategies ($ PURR) is currently the only Digital Asset Treasury (DAT) in profit, with unrealized gains of $356 million, while other related products remain in unrealized losses. Among them, Bitmine has the largest unrealized loss, exceeding",
            "description": "null\nsource: https://x.com/wublockchain/status/2027567443347182032",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053056&language=en-US",
            "pub_date": "2026-02-28 10:12:03",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053045,
            "title": "OpenAI has fired an employee who profited by using confidential company information on Polymarket.",
            "description": "Wired reporter Kate Knibbs reported on X that OpenAI has fired an employee suspected of profiting from the company's confidential information on prediction market platforms such as Polymarket. OpenAI's Applied Business CEO, Fidji Simo, disclosed the dismissal to employees in an internal memo earlier this year, but did not reveal the employee's name or specific details of the transaction.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053045&language=en-US",
            "pub_date": "2026-02-28 10:07:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053048,
            "title": "TRON Ecosystem Launches AI Infrastructure Bank of AI",
            "description": "TRON's AI infrastructure, AINFT, has introduced a new foundational AI Agent system called Bank of AI. According to ChainCatcher, this system has deeply integrated five core toolkits: x402 (payment standard), 8004 (on-chain identity protocol), MCP Server (AI model and blockchain service standard interface), Skills (AI Agent function module library), and OpenClaw extension plugin (for seamless integration of on-chain functions). These components create a complete loop from development and identity authentication to automated payments.\n\nBy enabling code-based integration of on-chain payments and trusted identities, Bank of AI significantly lowers the development threshold for AI Agents. This advancement accelerates the formation of a Web 4.0 symbiotic economic network driven by AI.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053048&language=en-US",
            "pub_date": "2026-02-28 10:13:38",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053047,
            "title": "TRON's BTT Token Surpasses $1.55 Million in JustLend DAO Supply",
            "description": "The total supply of TRON's BTT token in the decentralized lending protocol JustLend DAO has officially exceeded $1.55 million. According to ChainCatcher, this milestone highlights the market's strong recognition of BTT's value and indicates a steady increase in the asset's liquidity and demand within the lending market.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053047&language=en-US",
            "pub_date": "2026-02-28 10:13:44",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053046,
            "title": "Hong Kong Approves First Real Estate Tokenization Project",
            "description": "Hong Kong's Securities and Futures Commission has recently approved two real-world asset (RWA) tokenization products by Derlin Holdings Group Limited. According to ChainCatcher, this marks the first regulatory approval for a real estate RWA project in Hong Kong.\n\nThe project involves the tokenization of a limited partnership fund and a private equity project fund for the Derlin Building in Central, Hong Kong. Derlin Securities will distribute the RWA tokens, while Derlin Digital Family Office collaborates with tokenization solutions provider Asseto for the issuance of fund equity tokens.\n\nThis development is seen as a significant milestone in digital financial innovation in Hong Kong. It is expected to enhance asset liquidity and trading efficiency, providing a regulatory framework for the integration of traditional commercial real estate with digital finance. Additionally, it strengthens Hong Kong's competitive position as a global center for RWAs.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053046&language=en-US",
            "pub_date": "2026-02-28 10:13:48",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053042,
            "title": "The US XRP spot ETF saw a total net inflow of $2.2052 million in a single day.",
            "description": "According to SoSoValue data, the XRP spot ETF saw a total net inflow of $2.2052 million yesterday (February 27th, Eastern Time). Only the Franklin XRP ETF (XRPZ) saw net inflows yesterday, with a single-day net inflow of $2.2052 million, bringing its total historical net inflow to $333 million. As of press time, the XRP spot ETF's total net asset value is $983 million, with an XRP net asset ratio of 1.19%, and a historical cumulative net inflow of $1.24 billion.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053042&language=en-US",
            "pub_date": "2026-02-28 09:56:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053043,
            "title": "US Senate Postpones CLARITY Act Amid Crypto Regulation Disputes",
            "description": "The U.S. Senate has postponed the CLARITY Act, a proposed bill aimed at regulating the cryptocurrency market, due to ongoing disagreements between banking institutions and the crypto industry. According to NS3.AI, the primary contention revolves around whether stablecoin holders should be allowed to earn interest, with banks advocating for stringent restrictions while crypto companies resist such measures. Further disputes include regulations on exchange incentives, the responsibilities of DeFi developers, and the extent of regulatory authority.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053043&language=en-US",
            "pub_date": "2026-02-28 10:03:09",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}