{
    "data": [
        {
            "id": 1053242,
            "title": "Everything You Need to Know About Ethereum’s Next Big Upgrade",
            "description": "Key Takeaways Glamsterdam brings faster block processing and smarter fee pricing – no hardware upgrades needed.\nsource: https://coindoo.com/everything-you-need-to-know-about-ethereums-next-big-upgrade/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053242&language=en-US",
            "pub_date": "2026-02-28 15:00:24",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053240,
            "title": "Israel is preparing for the first phase of a four-day joint strike.",
            "description": "An Israeli government official stated that Israel is preparing for a four-day, intensive, and powerful coordinated strike in the first phase. (CCTV)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053240&language=en-US",
            "pub_date": "2026-02-28 15:10:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053241,
            "title": "GEOPOLITICS | U.S. Military Conducts Airstrikes in the Middle East",
            "description": "On February 28, a U.S. official reported that American fighter jets and aircraft carriers stationed at various bases across the Middle East are conducting numerous airstrike missions. According to Jin10, these operations highlight the ongoing military activities in the region. The official did not provide specific details about the targets or the outcomes of these missions. This development underscores the continued presence and strategic interests of the United States in the Middle East.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053241&language=en-US",
            "pub_date": "2026-02-28 15:16:11",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053232,
            "title": "BREAKING: Bitcoin’s Price Plunges Below $64K as Israel Attacks Iran",
            "description": "Israel also announced a state of emergency as it expects a quick retaliation by Iran.\nsource: https://cryptopotato.com/breaking-bitcoins-price-plunges-below-64k-as-israel-attacks-iran/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053232&language=en-US",
            "pub_date": "2026-02-28 14:54:15",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053231,
            "title": "Explosions Reported in Multiple Iranian Cities",
            "description": "Explosions have been reported in several Iranian cities, including Isfahan, Qom, Karaj, and Kermanshah. According to Jin10, these incidents were covered by Iranian media outlet Fars News. The cause and impact of these explosions remain unclear, and further details are awaited to understand the situation better.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053231&language=en-US",
            "pub_date": "2026-02-28 15:04:47",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053227,
            "title": "Trump Media and Technology Group Reports 2025 Financial Performance",
            "description": "Trump Media and Technology Group released its financial performance report for 2025 on February 27. According to PANews, the report reveals that the group's financial assets amounted to $2.5 billion, with an operating income of $3.7 million.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053227&language=en-US",
            "pub_date": "2026-02-28 14:51:25",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053226,
            "title": "Bitdeer Reports Zero Net Increase in BTC Holdings",
            "description": "Bitdeer has released its BTC Weekly Update, revealing that as of February 27, 2026, the company's net BTC holdings stand at zero. According to PANews, the company produced 166 BTC and sold an equivalent amount, resulting in no net increase in its BTC holdings.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053226&language=en-US",
            "pub_date": "2026-02-28 14:51:29",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053225,
            "title": "GEOPOLITICS | Mobile Communication Disruptions Reported in Tehran",
            "description": "Mobile communication lines in parts of eastern and western Tehran have reportedly been cut, according to Iranian media. According to Jin10, some areas are also experiencing weakened internet connectivity. The disruptions come amid ongoing tensions and unrest in the region, raising concerns about the impact on communication infrastructure. Authorities have not yet provided an official explanation for the outages.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053225&language=en-US",
            "pub_date": "2026-02-28 14:55:55",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053224,
            "title": "Israel expects Iran to refrain from responding at least until tonight.",
            "description": "Israel expects Iran to refrain from responding, at least until tonight. (Jinshi)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053224&language=en-US",
            "pub_date": "2026-02-28 14:51:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053223,
            "title": "Israeli defense official: Action against Iraq was coordinated with the United States and planning has been ongoing for months.",
            "description": "Israeli defense officials stated that Israel's actions in Iran were coordinated with the United States. The operation had been planned for months, and the specific launch date was determined weeks ago. (Jinshi)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053223&language=en-US",
            "pub_date": "2026-02-28 14:54:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053210,
            "title": "GEOPOLITICS | Iranian President Survives Assassination Attempt, Reports Israel",
            "description": "Israeli preliminary reports indicate that Iranian President Ebrahim Raisi has survived an assassination attempt. According to Jin10, the incident has heightened tensions in the region, with potential implications for geopolitical stability. Details surrounding the attempt remain scarce, and both Israeli and Iranian officials have yet to provide further information. The situation is being closely monitored by international observers, given its potential impact on regional dynamics and global diplomatic relations.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053210&language=en-US",
            "pub_date": "2026-02-28 14:42:23",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053209,
            "title": "GEOPOLITICS | U.S. Embassy in Qatar Advises Shelter-in-Place for All Personnel",
            "description": "The U.S. Embassy in Qatar has issued a directive for all personnel to implement shelter-in-place measures. According to Jin10, the embassy has also recommended that all U.S. citizens in the region follow the same precautions until further notice. This advisory comes amid heightened concerns over regional security and aims to ensure the safety of American citizens and staff in Qatar. The embassy has not provided additional details on the specific threats or the duration of the advisory. U.S. citizens are urged to remain vigilant and stay informed through official channels for any updates.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053209&language=en-US",
            "pub_date": "2026-02-28 14:45:10",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053205,
            "title": "Iranian President Pezechzian survives assassination attempt.",
            "description": "An initial Israeli report states that an assassination attempt on Iranian President Peskhziyan has thwarted. (Jinshi)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053205&language=en-US",
            "pub_date": "2026-02-28 14:42:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053204,
            "title": "Israel claims its actions against Iran have achieved their objectives.",
            "description": "Israel has stated that its actions against Iran have achieved all their intended objectives. (Jinshi)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053204&language=en-US",
            "pub_date": "2026-02-28 14:43:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053203,
            "title": "In the past hour, $175 million in positions were liquidated across the entire network, with long positions accounting for $165 million.",
            "description": "According to CoinGlass data, $175 million in positions were liquidated across the network in the past hour, including $165 million in long positions and $10.6641 million in short positions.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053203&language=en-US",
            "pub_date": "2026-02-28 14:45:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053198,
            "title": "Crypto News: MetaMask Launches 3% Cashback Card Amid Crypto’s Shift Into Banking",
            "description": "Key Insights: On February 26, crypto news broke when MetaMask announced the general availability of its MetaMask Card across the United States, including New York, for the first time. The card, powered by Mastercard’s network and issued by Cross River Bank, offered up to 3% cashback paid in mUSD, MetaMask’s native stablecoin.\nsource: https://www.thecoinrepublic.com/2026/02/28/crypto-news-metamask-launches-3-cashback-card-amid-cryptos-shift-into-banking/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053198&language=en-US",
            "pub_date": "2026-02-28 14:22:21",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053196,
            "title": "Citi Signals Next Phase of Crypto Adoption With Institutional Bitcoin Custody Plan",
            "description": "Citigroup plans to launch an institutional BTC custody service in 2026, integrating digital assets into its traditional banking infrastructure. <p>The post Citi Signals Next Phase of Crypto Adoption With Institutional Bitcoin Custody Plan first appeared on Ecoinimist. </p>\nsource: https://ecoinimist.com/2026/02/28/citi-signals-crypto-adoption/?utm_source=rss&utm_medium=rss&utm_campaign=citi-signals-crypto-adoption",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053196&language=en-US",
            "pub_date": "2026-02-28 14:26:46",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053195,
            "title": "Earthquake Strikes Papua New Guinea's New Britain Region",
            "description": "A 5.66 magnitude earthquake has occurred in the New Britain region of Papua New Guinea, according to the German Research Centre for Geosciences. The seismic event highlights the region's vulnerability to geological disturbances. Further details on the impact and any potential damage are yet to be reported.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053195&language=en-US",
            "pub_date": "2026-02-28 14:32:52",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053194,
            "title": "BNB Drops Below 600 USDT with a 4.63% Decrease in 24 Hours",
            "description": "On Feb 28, 2026, 06:33 AM(UTC). According to Binance Market Data, BNB has dropped below 600 USDT and is now trading at 599.52002 USDT, with a narrowed 4.63% decrease in 24 hours.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053194&language=en-US",
            "pub_date": "2026-02-28 14:33:07",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053190,
            "title": "Bitcoin(BTC) Drops Below 65,000 USDT with a 4.16% Decrease in 24 Hours",
            "description": "On Feb 28, 2026, 06:18 AM(UTC). According to Binance Market Data, Bitcoin has dropped below 65,000 USDT and is now trading at 64,883.640625 USDT, with a narrowed 4.16% decrease in 24 hours.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053190&language=en-US",
            "pub_date": "2026-02-28 14:18:08",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}