{
    "data": [
        {
            "id": 734208,
            "title": "AscendEX will launch Solana Social Explorer (SSE)",
            "description": "Odaily Planet Daily News AscendEX (formerly BitMax) will launch Solana Social Explorer (SSE) at 17:30 on February 5, and open SSE/USDT trading pairs, and recharge is now open.\nAscendEX (formerly BitMax) is the first and most comprehensive trading platform for Memecoin on the entire network. The Meme Research Institute team under the platform selects high-quality Memes for listing based on on-chain data and project background. The platform's Memecoin first launch rate is as high as 80%.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734208&language=en-US",
            "pub_date": "2025-02-05 16:38:39",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734207,
            "title": "Mining company Stronghold fined $1.4 million for violating electricity market rules to mine Bitcoin",
            "description": "Odaily Planet Daily News After a federal investigation found that mining company Stronghold Digital violated energy market rules while prioritizing its bitcoin mining business, the company agreed to pay more than $1.4 million in fines and refunds.\nStronghold Digital and its subsidiary Scrubgrass Reclamation Company operated the 85-megawatt Scrubgrass Power Plant in northwestern Pennsylvania as a capacity resource in the PJM Interconnection energy market from 2018 to 2022.\nAccording to the settlement agreement issued by the Federal Energy Regulatory Commission (FERC) on January 30, Stronghold has a contractual obligation to provide its available power to the PJM grid to help ensure grid reliability.\nHowever, the FERC Enforcement Office determined that Stronghold failed to fulfill this obligation between June 2021 and May 2022, and instead diverted electricity to its bitcoin mining business.\nAccording to FERC’s investigation, Scrubgrass underreported the available power capacity it offered in the market by 67% of day-ahead power and 69% of real-time power. It diverted power to bitcoin mining instead of providing it to PJM by 57% of day-ahead power and 59% of real-time power.\nIn addition, FERC noted in the settlement order that Stronghold purchased power from PJM at wholesale prices 24% of the time, and some of that power was misclassified as “station power” rather than used for necessary power plant operations.\nAs part of the settlement, Stronghold and Scrubgrass will reimburse PJM for $678,635 in improper revenue and pay a $741,365 civil penalty to the U.S. Treasury. The company must also file compliance reports for at least two years and provide employee training on market rules.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734207&language=en-US",
            "pub_date": "2025-02-05 16:43:41",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734206,
            "title": "ETH supply rises to pre-merger levels, Dencun upgrade may be the cause of inflation",
            "description": "Odaily Planet Daily News According to ultrasound.money data, the supply of Ethereum is currently 120,521,523 ETH, which is about 383 more than the supply on the day of the merge upgrade. Jaehyun Ha, an analyst at Presto Research, said that the network's Dencun upgrade last year was the cause of the expansion of Ethereum's supply.\nJaehyun Ha said, \"With the launch of the Dencun upgrade, Ethereum added support for blob transactions, which is designed to handle large data loads (especially L2) more efficiently. These transactions use a separate fee unit called 'blob gas', which is different from the standard Gas fee applicable to regular transactions. As a large amount of transaction activity shifted to blob transactions, this change resulted in a decrease in the proportion of destroyed fees. Reducing fees means that even if overall network activity remains high or grows, the balancing effect that previously limited the net supply of ETH is now less obvious.\" (The Block)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734206&language=en-US",
            "pub_date": "2025-02-05 16:46:06",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734199,
            "title": "Coinstash co-founder: Investors are still panicking about the tariff war and seeking safe havens, and the subsequent volatility is expected to be greater",
            "description": "Odaily Planet Daily News: Mena Theodorou, co-founder of cryptocurrency exchange Coinstash, said that although Trump has suspended the tariff war, investors are still panicking and seeking safe havens, and subsequent volatility is expected to be greater. He pointed out that \"tariffs of this scale are generally seen as unfavorable for risky assets such as Bitcoin and other cryptocurrencies.\" Gold rose to a record high today, while the US dollar index rose to a new high this year. However, Theodorou believes that Trump has also brought light at the end of the tunnel, including a potential Bitcoin strategic reserve plan. (DL News)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734199&language=en-US",
            "pub_date": "2025-02-05 16:30:37",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734205,
            "title": "Scaramucci Comments On Market Volatility And Cryptocurrency Potential",
            "description": "According to Odaily, Anthony Scaramucci, founder of SkyBridge Capital, commented on the tariff disputes, stating that U.S. President Donald Trump's unpredictable actions could lead to short-term market volatility. However, he believes that Bitcoin and cryptocurrencies will emerge as long-term winners, emphasizing the need to endure the full impact of Trump's policies. SkyBridge Capital holds $1.4 billion in digital assets, representing 57% of its total assets under management, while over 60% of Scaramucci's personal wealth is in Bitcoin. Scaramucci further noted that if institutions fully adopt cryptocurrencies, banks could custody them, retain them on their balance sheets, and leverage their capital to become major investors in cryptocurrencies, particularly Bitcoin. He described this potential development as a profoundly impactful and powerful move.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734205&language=en-US",
            "pub_date": "2025-02-05 16:33:51",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734204,
            "title": "Stablecoins Show Remarkable Growth Despite Market Challenges",
            "description": "According to Foresight News, ARK Invest's 'Big Ideas 2025' report highlights that stablecoins are among the fastest-growing sectors in the digital asset space. Despite enduring a two-year bear market and a market capitalization drop of over 70%, stablecoins continue to demonstrate robust growth. In 2024, stablecoin transactions reached $15.6 trillion, surpassing Visa and Mastercard's transaction volumes by approximately 119% and 200%, respectively. However, the monthly transaction count for stablecoins was 110 million, which is only 0.41% and 0.72% of Visa and Mastercard's transaction volumes. This indicates that the average transaction value for stablecoins is significantly higher than that of Visa and Mastercard.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734204&language=en-US",
            "pub_date": "2025-02-05 16:34:22",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734198,
            "title": "Bitwise Legal Director: The SEC is currently in a training period, and the approval of new crypto ETFs still requires instructions from the new leadership",
            "description": "Odaily Planet Daily News: Katherine Dowling, legal director of Bitwise and former US prosecutor, said that the SEC is currently in a \"tempering period\" and needs to wait for the new chairman Paul Atkins to confirm his inauguration. Dowling pointed out that the cooperation between the SEC and the CFTC is strengthening, and the newly established cryptocurrency working group has a positive attitude. However, the SEC still needs guidance from the new leadership on the issue of the securities attributes of assets such as XRP and Solana. She expects that the Bitcoin Ethereum combination ETF will be approved quickly, while other crypto asset ETFs will take longer to approve. (blockworks)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734198&language=en-US",
            "pub_date": "2025-02-05 16:35:17",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734188,
            "title": "Bitwise Chief Compliance Officer: SEC appears to be waiting for “high-level instructions” on how to handle litigation, including Ripple case",
            "description": "Odaily Planet Daily News Bitwise Chief Compliance Officer Katherine Dowling said that January marked the end of SAB 121, ushered in Trump's cryptocurrency executive order, and witnessed the formation of a new SEC working group. Coupled with the surge in cryptocurrency ETF applications, now is a good time to communicate with insiders. \nShe pointed out that now, the signal of increased cooperation between the SEC and CFTC is one of the biggest changes compared to the Gensler era. According to Bitwise's conversations with the SEC, the cryptocurrency working group seems to be \"very sincere.\" The current SEC Chairman nominee Paul Atkins has not yet been determined, and Mark Uyeda serves as acting chairman. That said, Dowling called the SEC \"in purgatory\" and the agency seemed to be waiting for \"high-level instructions\" on how to handle litigation, including the case against Ripple. \nDowling said: \"These don't go away overnight, and they shouldn't go away, but when you have new leadership, there are new eyes. In this particular case, are we focusing on the right things? Is there a settlement position that allows both parties to achieve the results they want?\" \nShe pointed out that some assets are still \"trapped like dolphins in a fishing net.\" She was referring to assets that are clearly classified as securities, including SOL and XRP. The SEC must make some \"concessions\" in this regard in order to move forward with these ETF proposals. She hinted that the DOGE ETF may have a clearer path because the SEC has not yet labeled DOGE a security. \nIn addition, in addition to the uncertainty of litigation/securities, there is also the question of whether the SEC will require the existence of \"a regulated market of considerable size\" (historically futures traded through CME). (Blockworks)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734188&language=en-US",
            "pub_date": "2025-02-05 16:17:22",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734187,
            "title": "22 U.S. states have introduced Bitcoin and digital asset bills",
            "description": "Odaily Planet Daily News Cointelegraph published an article on the X platform stating that to date, a total of 22 states in the United States have introduced Bitcoin and digital asset bills.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734187&language=en-US",
            "pub_date": "2025-02-05 16:19:42",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734186,
            "title": "Opinion: Whether the tariff crisis subsides quickly or not is always beneficial to risk assets such as Bitcoin",
            "description": "Odaily Planet Daily News Noelle Acheson, author of the \"Crypto Is Macro Now\" newsletter, said that if the tariff panic subsides soon, it will be a good thing for risky assets including Bitcoin. But if not, safe-haven assets such as Bitcoin can benefit from investors seeking to hedge against the depreciation of their own currencies and prepare for the development of the new economy. \nEven so, Bitcoin's success depends largely on the strength of the US dollar. She pointed out: \"A decline in the US dollar against other currencies will be beneficial to global liquidity and may reawaken risk appetite, benefiting Bitcoin and stocks.\"",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734186&language=en-US",
            "pub_date": "2025-02-05 16:22:17",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}