{
    "data": [
        {
            "id": 1053925,
            "title": "Bitcoin(BTC) Surpasses 67,000 USDT with a 2.21% Increase in 24 Hours",
            "description": "On Feb 28, 2026, 20:48 PM(UTC). According to Binance Market Data, Bitcoin has crossed the 67,000 USDT benchmark and is now trading at 67,059.710938 USDT, with a narrowed 2.21% increase in 24 hours.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053925&language=en-US",
            "pub_date": "2026-03-01 04:48:08",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053924,
            "title": "Egypt Aims to Expedite LNG Imports Amid Regional Tensions",
            "description": "Egypt is looking to accelerate the import of certain liquefied natural gas (LNG) shipments following the closure of some energy fields by Israel. Bloomberg posted on X, citing sources familiar with the situation, that the closures occurred after Israel conducted strikes on Iran. This move by Egypt highlights the impact of regional geopolitical tensions on energy supply and trade.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053924&language=en-US",
            "pub_date": "2026-03-01 04:52:51",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053923,
            "title": "U.S. President Trump Engages in Talks with Leaders of the UK, Kuwait, and Turkey",
            "description": "U.S. President Donald Trump has recently held discussions with leaders from the United Kingdom, Kuwait, and Turkey. According to Jin10, these conversations are part of ongoing diplomatic efforts to address various international issues. The discussions focused on strengthening bilateral relations and exploring potential areas of cooperation. The White House has not disclosed specific details about the topics covered in these talks. However, such engagements are seen as crucial in maintaining and enhancing diplomatic ties between the United States and these nations.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053923&language=en-US",
            "pub_date": "2026-03-01 04:54:44",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053922,
            "title": "GEOPOLITICS | Qatar Recalls Iranian Ambassador Amid Territorial Attack Condemnation",
            "description": "Qatar's Ministry of Foreign Affairs has announced the recall of its ambassador to Iran following an attack on its territory. According to Jin10, the decision reflects Qatar's strong condemnation of the incident, which has heightened tensions between the two nations. The recall underscores Qatar's demand for accountability and its commitment to safeguarding its sovereignty. This diplomatic move is part of a broader regional response to escalating geopolitical challenges. The situation remains fluid, with potential implications for regional stability and international relations.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053922&language=en-US",
            "pub_date": "2026-03-01 04:54:48",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053920,
            "title": "BREAKING: 🇮🇷 Iran’s Supreme Leader Ayatollah Ali Khamenei confirmed dead after Israeli strike",
            "description": "null\nsource: https://x.com/CryptoKingKeyur/status/2027843497974468808",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053920&language=en-US",
            "pub_date": "2026-03-01 04:29:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053919,
            "title": "Bitcoin bottom fractal calls for 130% rally, but is the model valid in 2026?",
            "description": "A rare Bitcoin bottom signal from 2023 has flashed again, but the 2026 macroeconomic backdrop calls its validity into question. Can BTC price defy the odds?\nsource: https://cointelegraph.com/news/bitcoin-bottom-fractal-calls-for-130percent-rally-but-is-the-model-valid-in-2026?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053919&language=en-US",
            "pub_date": "2026-03-01 04:29:19",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053918,
            "title": "Apollo Nets $250Mn In Paper Profits From xAI Support",
            "description": "Apollo Global Management has netted roughly $250 million in paper gains so far from a bet it made in recent months to support xAI.\nsource: https://catenaa.com/industries/financials/apollo-nets-250mn-in-paper-profits-from-xai-support/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053918&language=en-US",
            "pub_date": "2026-03-01 04:30:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053915,
            "title": "BREAKING: 🇮🇷 Iranian Supreme Leader Ali Khamenei confirmed dead \n\n#WorldWar3 #Peace #Iran #Tehran #IranRevoIution2026 #Israeli",
            "description": "null\nsource: https://x.com/CryptoKingKeyur/status/2027841803937100056",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053915&language=en-US",
            "pub_date": "2026-03-01 04:22:16",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053914,
            "title": "Iran's Supreme Leader Khamenei Firmly Directs Battlefield",
            "description": "Iran's Supreme Leader Ayatollah Ali Khamenei is reportedly taking a decisive role in directing military operations, according to Iranian news agencies Tasnim and Mehr. According to Jin10, these reports highlight Khamenei's active involvement in strategic military decisions. The Iranian leader's actions come amid heightened tensions in the region, underscoring his influence over the country's defense strategies. This development is seen as a significant move in Iran's military posture, reflecting Khamenei's commitment to maintaining control over national security matters.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053914&language=en-US",
            "pub_date": "2026-03-01 04:28:08",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053910,
            "title": "BREAKING: IRANIAN SUPREME LEADER AYATOLLAH ALI KHAMENEI IS REPORTED DEAD.\n\nMultiple reports confirm the 86-year-old Supreme Leader was killed in today’s U.S.-Israeli strikes on Tehran. Khamenei had led the Islamic Republic for 35 years.",
            "description": "null\nsource: https://x.com/BSCNews/status/2027838381611208807",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053910&language=en-US",
            "pub_date": "2026-03-01 04:08:40",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053907,
            "title": "Fox News: The US believes Iranian Supreme Leader Khamenei is dead.",
            "description": "According to Fox News: U.S. officials have confirmed that the U.S. believes Iranian Supreme Leader Ayatollah Khamenei and five to ten other senior Iranian leaders were killed in the first wave of Israeli attacks on a residence. (Jinshi)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053907&language=en-US",
            "pub_date": "2026-03-01 04:25:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053899,
            "title": "Hyperliquid defies altcoin weakness: What’s driving HYPE’s demand?",
            "description": "HYPE shows resilience, supported by rising TVL, strong fees, and growing whale accumulation.\nsource: https://ambcrypto.com/hyperliquid-defies-altcoin-weakness-whats-driving-hypes-demand/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053899&language=en-US",
            "pub_date": "2026-03-01 04:00:26",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053898,
            "title": "Bitcoin Derivatives Market Hits High Bear Sentiment as $1.8 Billion in Sell Volume Hits in One Hour",
            "description": "Bitcoin’s derivatives market pressure index has dropped to its High Bear Sentiment threshold on the CryptoQuant chart, coinciding with $1. 8 billion in aggressive sell volume hitting derivatives markets within a single hour as U. S. -Iran tensions escalated and panic selling accelerated through the final sessions of February\nsource: https://www.ethnews.com/bitcoin-derivatives-market-hits-high-bear-sentiment-as-1-8-billion-in-sell-volume-hits-in-one-hour/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053898&language=en-US",
            "pub_date": "2026-03-01 04:03:44",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053897,
            "title": "GEOPOLITICS | UAE's Jebel Ali Port Reportedly Attacked",
            "description": "Iranian state media has released a video claiming that the Jebel Ali Port in the United Arab Emirates has been attacked. According to Jin10, the report did not provide further details on the nature or extent of the alleged attack. The Jebel Ali Port is one of the largest and busiest ports in the Middle East, playing a crucial role in regional trade and logistics. The implications of such an incident could be significant, affecting trade routes and regional stability. Further information and official confirmations are awaited to assess the situation accurately.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053897&language=en-US",
            "pub_date": "2026-03-01 04:09:28",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053894,
            "title": "CLAIM: Iran’s Religious Leader Ali Khamenei Reportedly Killed",
            "description": "According to breaking news, it is alleged that Iranian religious leader Ali Khamenei has been killed. Here's what you need to know. Continue Reading: CLAIM: Iran’s Religious Leader Ali Khamenei Reportedly Killed\nsource: https://en.bitcoinsistemi.com/claim-iran-s-religious-leader-ali-khamenei-reportedly-killed/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053894&language=en-US",
            "pub_date": "2026-03-01 03:52:07",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053892,
            "title": "Iran's Islamic Revolutionary Guard Corps announced the closure of the Strait of Hormuz, but Britain says it remains open.",
            "description": "Iran's Islamic Revolutionary Guard Corps announced the closure of the Strait of Hormuz, but the UK's Maritime Trade Operations Office has informed us that the strait remains open, though caution is advised when navigating it. As of now, no official statement has been issued by Iran regarding this matter.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053892&language=en-US",
            "pub_date": "2026-03-01 03:55:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053891,
            "title": "On Polymarket, the probability that \"Khamenei will step down before March 31\" has risen to 97%.",
            "description": "According to data from Polymarket, the probability of Khamenei stepping down before March 31 has risen to 97%.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053891&language=en-US",
            "pub_date": "2026-03-01 04:01:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053889,
            "title": "What Would Happen If Iran Closed the Strait of Hormuz? The Data Shows Only One Thing",
            "description": "Reports indicate that Iran has begun closing the Strait of Hormuz. So what could the effects be? Here are the facts. Continue Reading: What Would Happen If Iran Closed the Strait of Hormuz? The Data Shows Only One Thing\nsource: https://en.bitcoinsistemi.com/what-would-happen-if-iran-closed-the-strait-of-hormuz-the-data-shows-only-one-thing/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053889&language=en-US",
            "pub_date": "2026-03-01 03:37:11",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053887,
            "title": "AI Is the Missing Link for Crypto Mass Adoption, Says Tether Co-Founder",
            "description": "Key Takeaways AI could be the user-friendly layer crypto has been missing, acting like a “web browser” for blockchain.\nsource: https://coindoo.com/ai-is-the-missing-link-for-crypto-mass-adoption-says-tether-co-founder/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053887&language=en-US",
            "pub_date": "2026-03-01 03:40:32",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053886,
            "title": "Europe’s Largest Asset Manager Just Increased Its Strategy Stake by 373%",
            "description": "Amundi, Europe’s largest asset manager with over 2. 3 trillion euros in assets under management, expanded its position in Strategy by 373% quarter-over-quarter according to Q4 2025 regulatory filings disclosed in late February 2026, bringing its total stake to approximately 4. 79 million shares valued at $641 million\nsource: https://www.ethnews.com/europes-largest-asset-manager-just-increased-its-strategy-stake-by-373/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053886&language=en-US",
            "pub_date": "2026-03-01 03:41:03",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}