{
    "data": [
        {
            "id": 1054545,
            "title": "Sydney Home Prices Remain Unchanged Amid Growth in Other Major Cities",
            "description": "Sydney's housing market experienced stagnation in February, contrasting with the continued growth observed in other major cities. Bloomberg posted on X, highlighting the disparity in real estate trends across the country. While cities like Melbourne and Brisbane saw significant increases in home prices, Sydney's market remained flat, raising questions about the factors influencing these regional differences. Analysts suggest that local economic conditions and buyer sentiment may be contributing to the varied performance in the housing sector. Despite the overall national trend of rising property values, Sydney's market appears to be an exception, prompting further scrutiny from industry experts.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054545&language=en-US",
            "pub_date": "2026-03-01 21:28:49",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054538,
            "title": "Incident Reported Near UAE's Mina Saqr Port",
            "description": "An incident has been reported near the Mina Saqr Port in the United Arab Emirates, according to the UK Maritime Trade Operations. The location of the event is approximately 17 nautical miles northwest of the port. Further details about the nature of the incident have not been disclosed at this time.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054538&language=en-US",
            "pub_date": "2026-03-01 21:22:58",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054537,
            "title": "Minneapolis' Response to Federal Deportation Campaign Offers Global Insights",
            "description": "Minneapolis has demonstrated a noteworthy approach in dealing with the federal government's intensified deportation efforts. Bloomberg posted on X, highlighting how the city's strategies could serve as valuable lessons for other regions facing similar challenges. The city's response emphasizes community support and advocacy, aiming to protect affected individuals and families. This approach has garnered attention for its potential to influence broader policy discussions and inspire other communities to adopt similar measures. Minneapolis' actions underscore the importance of local initiatives in addressing national issues, offering a model for effective community engagement and resilience.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054537&language=en-US",
            "pub_date": "2026-03-01 21:25:19",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054536,
            "title": "Financial Firms Activate Contingency Plans Amid UAE Attacks",
            "description": "Major financial institutions, including JPMorgan and Citigroup, are implementing contingency measures for their Gulf operations as the United Arab Emirates faces attacks. Bloomberg posted on X, highlighting the strategic adjustments being made by these firms to ensure the safety and continuity of their operations in the region. Hedge funds are also reportedly taking similar precautions.\n\nThe UAE, a significant financial hub in the Middle East, has been experiencing increased security threats, prompting these companies to reassess their operational strategies. The measures being adopted include relocating staff, enhancing security protocols, and revising business continuity plans.\n\nThese developments underscore the growing geopolitical tensions in the region and their potential impact on global financial markets. The actions taken by these financial firms reflect their commitment to safeguarding their employees and maintaining business operations amidst the escalating situation.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054536&language=en-US",
            "pub_date": "2026-03-01 21:26:56",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054535,
            "title": "Ahead of SpaceX's IPO, the market value of its Bitcoin holdings fell to approximately $545 million, potentially putting pressure on it to disclose its profit and loss figures.",
            "description": "According to on-chain data platform Arkham Intelligence, SpaceX currently holds approximately 8,285 bitcoins in its Coinbase Prime escrow account, worth about $545 million at the latest price, a decrease of about $235 million from its valuation of about $780 million three months ago. The company has not reduced its holdings during this period. SpaceX is planning to file a confidential IPO application with the U.S. Securities and Exchange Commission (SEC) as early as March, aiming for a June listing with a valuation potentially exceeding $1.75 trillion and a maximum fundraising scale of $50 billion. If successful, this would break the record of $29 billion set by Saudi Aramco in 2019. Data shows that the company's bitcoin holdings have remained relatively stable at around 8,300 bitcoins since the beginning of 2026, but the book value has fluctuated significantly due to the BTC price correction. At the end of 2021, SpaceX's BTC holdings peaked at nearly $2 billion, before declining during the 2022 bear market, fluctuating between $400 million and $800 million over the past two years. Market analysts point out that once SpaceX submits its S-1 filing, it will be required to disclose its relevant cryptocurrency exposure, and future financial reports may reflect the book profit and loss risks caused by Bitcoin price fluctuations. Tesla has previously attracted market attention multiple times due to similar book fluctuations. However, on-chain data does not show any active trading by SpaceX. Compared to Tesla's past buying and selling activities, SpaceX seems to prefer a long-term holding strategy. (CoinDesk)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054535&language=en-US",
            "pub_date": "2026-03-01 21:28:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054533,
            "title": "Hyperliquid Whale Positions Show Slight Imbalance in Long and Short Holdings",
            "description": "According to Coinglass data, Hyperliquid platform whales currently hold positions valued at $2.936 billion. According to ChainCatcher, long positions account for $1.448 billion, representing 49.3% of the total, while short positions amount to $1.489 billion, making up 50.7%. The long positions have an unrealized loss of $116 million, whereas the short positions show a profit of $200 million.\n\nNotably, a significant whale address, 0xa5b0..41, has taken a 15x leveraged long position on ETH at a price of $1,991.53, currently facing an unrealized loss of $982,400.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054533&language=en-US",
            "pub_date": "2026-03-01 21:13:33",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054532,
            "title": "Honor Device Unveils AI-Driven Innovations at MWC Barcelona 2026",
            "description": "Honor Device showcased its latest advancements in artificial intelligence technology at MWC Barcelona 2026 on Sunday. Bloomberg posted on X, highlighting the Chinese company's introduction of a humanoid robot and a novel 'robot phone.' These innovations mark Honor's strategic shift towards becoming an AI-focused hardware enterprise. The company's presentation at the event underscores its commitment to integrating cutting-edge AI capabilities into its product lineup, aiming to redefine its market presence.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054532&language=en-US",
            "pub_date": "2026-03-01 21:15:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054531,
            "title": "GEOPOLITICS | Poland Ensures Gas Supply Security Amid Middle East Tensions",
            "description": "Poland's gas pipeline operator, Gaz-System, has confirmed that the country's natural gas supply remains secure despite ongoing tensions in the Middle East. According to Jin10, Gaz-System has assured that measures are in place to maintain stability in gas supply, ensuring that Poland's energy needs are met without disruption. The operator emphasized its commitment to safeguarding energy security, highlighting the robustness of Poland's infrastructure and strategic reserves. This announcement comes as geopolitical uncertainties continue to affect global energy markets, underscoring the importance of reliable energy sources for national security.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054531&language=en-US",
            "pub_date": "2026-03-01 21:16:17",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054530,
            "title": "Jera Co. Evacuates Staff Amid Middle East Tensions",
            "description": "Japan's leading liquefied natural gas buyer, Jera Co., is evacuating its staff from the Middle East due to escalating tensions following the US-Israel attack on Iran. Bloomberg posted on X, highlighting the company's precautionary measures in response to the conflict's potential impact on the region. The situation underscores the growing concerns over energy security and the safety of personnel in volatile areas.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054530&language=en-US",
            "pub_date": "2026-03-01 21:17:01",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054527,
            "title": "Travel Boom Fueled by Popular Filming Locations",
            "description": "The global travel industry is experiencing a significant surge, driven by the popularity of destinations featured in films and television series. Bloomberg posted on X, highlighting that this trend is contributing to an $8 billion increase in travel-related revenue. However, not all communities are welcoming this influx of tourists. Some small towns, overwhelmed by the sudden attention, are expressing a desire to return to their quieter, less crowded days.\n\nThe phenomenon, often referred to as 'set-jetting,' sees fans flocking to locations made famous by their favorite shows and movies. This has led to a boost in local economies, with businesses benefiting from the increased foot traffic. Yet, the rapid growth in visitor numbers is also causing challenges, such as overcrowding and strain on local resources.\n\nWhile the economic benefits are undeniable, the impact on local communities is mixed. Some residents appreciate the financial boost, while others are concerned about the long-term effects on their towns' infrastructure and way of life. As the trend continues, balancing the economic gains with the preservation of local culture and environment remains a critical issue for these destinations.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054527&language=en-US",
            "pub_date": "2026-03-01 21:00:41",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054526,
            "title": "Apple's Touch-Screen MacBook Pro: A Step Away from Merging Mac and iPad",
            "description": "Apple is reportedly developing a touch-screen MacBook Pro, yet the company remains distant from merging its Mac and iPad product lines. Bloomberg posted on X, highlighting that despite this new development, Apple continues to maintain a clear distinction between its Mac computers and iPad tablets. The introduction of a touch-screen MacBook Pro suggests Apple's ongoing efforts to innovate within its existing product categories without blurring the lines between them. This move aligns with Apple's strategy to cater to different user needs while enhancing the functionality of its devices. The touch-screen feature is expected to offer users a new way to interact with their MacBook Pro, potentially attracting a broader audience. However, the company has not indicated any plans to fully integrate the Mac and iPad ecosystems, maintaining their separate identities in the market.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054526&language=en-US",
            "pub_date": "2026-03-01 21:05:15",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054521,
            "title": "Public Investment Corp. Announces Departure of Chief Investment Officer",
            "description": "Public Investment Corp. has announced that Chief Investment Officer Kabelo Rikhotso will be leaving the African money manager. Bloomberg posted on X that this decision comes five months after Rikhotso was suspended due to allegations of misconduct reported by a whistleblower. The company has not provided further details regarding the circumstances of his departure or the specifics of the allegations. Rikhotso's exit marks a significant change in the leadership of the organization, which manages substantial assets across the continent. The firm is expected to appoint a successor to ensure continuity in its investment strategies and operations.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054521&language=en-US",
            "pub_date": "2026-03-01 20:51:27",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054520,
            "title": "GEOPOLITICS | German Foreign Minister Stresses Common Interest in Resolving Iran Issue",
            "description": "The German Foreign Minister has emphasized the shared interest among various parties in finding a solution to the Iran issue. According to Jin10, the minister stated that achieving this goal is contingent upon Iran recognizing the necessity to abandon its nuclear weapons development. This statement underscores the ongoing diplomatic efforts to address concerns over Iran's nuclear ambitions.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054520&language=en-US",
            "pub_date": "2026-03-01 20:51:51",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054519,
            "title": "Data: Tether has frozen $4.2 billion worth of USDT over the past three years.",
            "description": "As regulators intensify their crackdown on illicit cryptocurrency-related financial flows, Tether has frozen $4.2 billion worth of USDT over the past three years. (Cointelegraph)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054519&language=en-US",
            "pub_date": "2026-03-01 20:52:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054507,
            "title": "The Key Events That Could Move Crypto Markets in March 2026",
            "description": "March 2026 arrives carrying more macro and regulatory weight than most months, with U. S. economic data releases, a Federal Reserve interest rate decision, multiple significant token unlocks, and a series of crypto-specific catalysts packed into a four-week window that could materially shift market direction\nsource: https://www.ethnews.com/the-key-events-that-could-move-crypto-markets-in-march-2026/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054507&language=en-US",
            "pub_date": "2026-03-01 20:34:11",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054513,
            "title": "Middle East Tensions Unlikely to Disrupt Poland's Oil Supply, Says PERN",
            "description": "Poland's oil pipeline operator, PERN, has stated that the current situation in the Middle East is not expected to affect the continuity of crude oil and refined product supplies to Poland. According to Jin10, PERN reassured stakeholders that despite geopolitical tensions, the supply chain remains stable. The company continues to monitor the situation closely to ensure uninterrupted operations. This announcement comes amid rising concerns over potential disruptions in global oil markets due to regional conflicts.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054513&language=en-US",
            "pub_date": "2026-03-01 20:41:22",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054511,
            "title": "Former Credit Suisse CIO: Tokenized gold underpins \"almost 100% price discovery\" during CME closures over the weekend.",
            "description": "Iggy Ioppe, former Chief Investment Officer of Credit Suisse, stated that during the period from the close of CME Group gold futures trading on Friday at 5:00 PM (Eastern Time) to its reopening at 6:00 PM on Sunday, almost all publicly visible gold price formation occurred on the on-chain market. He pointed out that during this window, regulated futures markets were suspended, and while over-the-counter (OTC) trading in Asia was active, it lacked transparency. Therefore, tokenized gold assets such as PAX Gold (PAXG) and Tether Gold (XAUt) became the only continuously tradable public markets. \"From the perspective of publicly visible price formation, the on-chain market accounted for almost 100% of the weekend price discovery.\" When CME resumed trading, futures prices typically aligned with the volatility already occurring on the on-chain market. Data shows that the market capitalization of tokenized gold has risen to $4.4 billion, an increase of approximately $2.8 billion over the past year, representing a growth of 177%, far exceeding the performance of most spot gold ETFs. The total trading volume for 2025 was approximately $178 billion, with a peak of over $126 billion in the fourth quarter alone, second only to SPDR Gold Shares in terms of trading volume. On Saturday, amid escalating geopolitical tensions following US-Israeli airstrikes against Iran, tokenized gold prices rose briefly, with XAUt briefly surpassing $5450 and PAXG approaching $5536, while Bitcoin and Ethereum retreated in tandem. Current major participants include market makers, cross-market liquidity providers, and crypto-native macro traders, who utilize tokenized gold for arbitrage, staking, hedging, and yield strategies. Some institutions also monitor on-chain gold price movements over the weekend to assess the \"gap risk\" before the CME market opens, but mostly treat it as a reference signal rather than a direct basis for establishing positions. (Cointelegraph)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054511&language=en-US",
            "pub_date": "2026-03-01 20:42:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054512,
            "title": "Hyperliquid's 13% Price Rally Amid US-Iran Tensions",
            "description": "Hyperliquid experienced a significant 13% price increase as geopolitical tensions between the United States and Iran prompted traders to turn to its derivatives platform during a weekend when traditional markets were closed. According to NS3.AI, the platform's open interest for commodities-linked perpetual futures reached an unprecedented high of over $1.1 billion, driven by the adoption of its HIP-3 protocol upgrade. Despite this growth, the platform faces potential regulatory challenges due to its lack of compliance measures such as Know Your Customer (KYC), which may attract scrutiny from U.S. authorities.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054512&language=en-US",
            "pub_date": "2026-03-01 20:47:43",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054497,
            "title": "XRP's Price Targets Challenged by Large Token Supply",
            "description": "XRP's substantial token supply presents challenges for achieving high price targets, as it would necessitate a market capitalization surpassing that of Bitcoin. According to NS3.AI, while Ripple's partnerships with banks and the ledger's technology, including capabilities of 40,000 transactions per second and ISO 20022 compliance, support its utility, they do not ensure widespread adoption of the XRP token. Analysts forecast moderate price increases, suggesting that XRP is unlikely to provide rapid wealth accumulation or significant short-term returns.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054497&language=en-US",
            "pub_date": "2026-03-01 20:19:01",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054496,
            "title": "Tron Inc. Increases TRX Holdings with Recent Purchase",
            "description": "Tron Inc., a company listed on Nasdaq, has expanded its TRX holdings by acquiring an additional 176,081 tokens at an average price of $0.28. According to NS3.AI, this acquisition raises Tron's total TRX treasury to over 684 million tokens. The purchase reflects ongoing confidence and accumulation by a significant institutional player in the TRX market.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054496&language=en-US",
            "pub_date": "2026-03-01 20:19:07",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}