{
    "data": [
        {
            "id": 1053447,
            "title": "A certain whale (a large investor) began accumulating a $12.4 million position in digital gold in October 2025, and currently has a floating profit of $3.521 million.",
            "description": "According to AI Aunt's monitoring, a certain whale has been gradually accumulating digital gold positions since October 2025, with a total cost of approximately $12.4 million. Currently, it has a floating profit of $3.521 million. This whale holds 2371.4 XAUT and 559.74 PAXG, with cost prices of $4283 and $4004 respectively, and has not sold any of its holdings for nearly five months.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053447&language=en-US",
            "pub_date": "2026-02-28 18:54:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053448,
            "title": "GEOPOLITICS | German Foreign Minister First to Learn of Upcoming Military Action from Israeli Counterpart",
            "description": "Germany's Foreign Minister was the first to be informed of an impending military operation by Israel's Foreign Minister Saar, according to a Foreign Ministry official. The announcement was made this morning, highlighting the close diplomatic communication between the two nations. According to Jin10, this development underscores the ongoing geopolitical dynamics in the region. The specifics of the military action were not disclosed, but the early notification suggests strategic alliances and shared interests between Germany and Israel. This move may have significant implications for regional stability and international relations.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053448&language=en-US",
            "pub_date": "2026-02-28 18:54:21",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053446,
            "title": "Iranian President's Son Confirms Father's Safety Amid Assassination Concerns",
            "description": "On February 28, Yousef Pezeshkian, son of Iranian President Pezeshkian, reassured the public about his father's well-being through social media. According to Jin10, Yousef stated that his father is in good health and emphasized that, based on his information, assassination attempts against key figures have been unsuccessful. He confirmed that several high-ranking government officials remain safe.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053446&language=en-US",
            "pub_date": "2026-02-28 18:42:41",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053445,
            "title": "GEOPOLITICS | Civil Aviation Faces High Risk in Conflict Zones, Says EASA",
            "description": "The European Union Aviation Safety Agency (EASA) has issued a warning regarding the elevated risks faced by civil aviation in airspaces affected by ongoing military interventions. According to Jin10, the agency highlighted the potential dangers for commercial flights operating in these regions, urging airlines to exercise heightened caution. The EASA's advisory comes amid increasing geopolitical tensions, which have raised concerns about the safety of air travel in conflict zones. The agency emphasized the importance of monitoring the situation closely and adjusting flight paths as necessary to ensure passenger safety. This warning underscores the broader implications of geopolitical conflicts on global aviation operations.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053445&language=en-US",
            "pub_date": "2026-02-28 18:42:47",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053444,
            "title": "EU Aviation Safety Agency Restricts Operations in Affected Airspace",
            "description": "The European Union Aviation Safety Agency (EASA) has issued a directive prohibiting aviation operators from conducting flights at any altitude within affected airspace. According to Jin10, this measure is part of a broader effort to ensure safety in regions experiencing heightened risks. The agency's decision underscores the importance of maintaining stringent safety protocols in response to evolving geopolitical and environmental challenges. Aviation operators are advised to comply with these restrictions to mitigate potential hazards and ensure passenger safety.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053444&language=en-US",
            "pub_date": "2026-02-28 18:44:28",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053443,
            "title": "Tinder Settles for $60.5 Million Over Pricing Allegations in California",
            "description": "Tinder has reached a $60.5 million settlement in response to allegations of charging older users higher prices in California. According to NS3.AI, after deducting fees and costs, approximately $39.72 million will be distributed to affected subscribers who purchased Tinder Plus or Tinder Gold between 2015 and 2019. Payments will be allocated based on individual subscription amounts, with claimants required to submit payment preferences by August 18.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053443&language=en-US",
            "pub_date": "2026-02-28 18:47:50",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053442,
            "title": "U.S. Official Reports No Casualties Among American Personnel",
            "description": "A senior U.S. official has reported that there have been no casualties among American personnel as of now. According to Jin10, the statement was made in response to recent events involving U.S. interests. The official emphasized the importance of ongoing assessments to ensure the safety of all personnel involved. Further updates are expected as the situation develops.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053442&language=en-US",
            "pub_date": "2026-02-28 18:34:24",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053441,
            "title": "Netflix Investors See Positive Returns Despite Initial Management Plans",
            "description": "Netflix investors are experiencing favorable outcomes, although not in the way the company's management initially anticipated. Wall Street Journal (Markets) posted on X, highlighting that the streaming giant's stock performance has been robust, driven by factors beyond the original strategic vision set by its leadership.\n\nThe company's recent financial results have shown resilience, with subscriber growth and revenue figures exceeding expectations. This success comes despite challenges in the competitive streaming market and evolving consumer preferences.\n\nAnalysts note that Netflix's ability to adapt its content strategy and explore new revenue streams has contributed to its strong market position. The company's focus on diversifying its offerings and expanding its global reach has played a crucial role in maintaining investor confidence.\n\nWhile the initial management plans may not have unfolded as expected, Netflix's agility in navigating industry shifts has resulted in a positive trajectory for its investors. The company's ongoing efforts to innovate and capture new audiences continue to bolster its standing in the entertainment sector.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053441&language=en-US",
            "pub_date": "2026-02-28 18:34:33",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053440,
            "title": "GEOPOLITICS | India and Canada to Enhance Academic Collaborations",
            "description": "Indian and Canadian universities are set to collaborate on research initiatives and student exchange programs, according to a new strategy announced during Prime Minister Mark Carney's visit to India. Bloomberg posted on X, highlighting the significance of this partnership in strengthening educational ties between the two nations. The initiative aims to foster academic cooperation and enhance the global competitiveness of both countries' educational institutions. This development is expected to provide students with broader opportunities for learning and cultural exchange, contributing to the overall growth of the academic sector.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053440&language=en-US",
            "pub_date": "2026-02-28 18:37:10",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053439,
            "title": "Explosion Reported Near U.S. Consulate in Erbil, Iraq",
            "description": "An explosion was reported near the U.S. Consulate in Erbil, Iraq. According to Jin10, the incident occurred in the vicinity of the consulate, raising concerns about security in the area. Details about the cause of the explosion and any potential casualties or damage have not been disclosed. The situation is being monitored closely by local authorities and international observers. Further updates are expected as more information becomes available.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053439&language=en-US",
            "pub_date": "2026-02-28 18:37:43",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053434,
            "title": "EU Commission President Calls for Restraint and Civilian Protection",
            "description": "European Commission President Ursula von der Leyen has urged all parties involved in ongoing conflicts to exercise maximum restraint. According to Jin10, she emphasized the importance of protecting civilians and fully respecting international law. Her statement comes amid rising tensions in various global hotspots, highlighting the EU's commitment to peace and adherence to international legal standards.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053434&language=en-US",
            "pub_date": "2026-02-28 18:27:18",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053433,
            "title": "GEOPOLITICS | EU to Coordinate Support for Citizens in the Region",
            "description": "The European Union is set to enhance its coordination efforts to support its citizens in the region, according to European Commission President Ursula von der Leyen. According to Jin10, von der Leyen emphasized the importance of close collaboration with EU member states to ensure comprehensive support for EU citizens. This initiative underscores the EU's commitment to safeguarding the welfare of its citizens amid ongoing geopolitical challenges. The European Commission is actively working with member states to implement necessary measures to address the needs of EU citizens effectively.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053433&language=en-US",
            "pub_date": "2026-02-28 18:27:26",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053432,
            "title": "GEOPOLITICS | EU Commission President Stresses Importance of Nuclear Safety",
            "description": "The President of the European Commission, Ursula von der Leyen, emphasized the critical importance of ensuring nuclear safety. According to Jin10, she highlighted the need to prevent any actions that could further escalate tensions or undermine the global nuclear non-proliferation framework. Her remarks underscore the EU's commitment to maintaining stability and security in the nuclear domain.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053432&language=en-US",
            "pub_date": "2026-02-28 18:27:32",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053431,
            "title": "Flight Disruptions at London Gatwick Due to Middle East Airspace Restrictions",
            "description": "Flights to and from London Gatwick Airport may face delays or cancellations due to airspace restrictions in the Middle East. According to Jin10, these restrictions are impacting flight schedules, leading to potential disruptions for travelers. Passengers are advised to check with their airlines for the latest updates on their flights. The situation underscores the broader impact of geopolitical tensions on global air travel.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053431&language=en-US",
            "pub_date": "2026-02-28 18:27:36",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053428,
            "title": "Coller Capital Partners with Mediobanca to Target Wealthy Italian Investors",
            "description": "Coller Capital has formed a strategic partnership with Mediobanca to introduce its private equity secondaries strategy to affluent individuals in Italy. Bloomberg posted on X, highlighting the collaboration aimed at expanding investment opportunities for wealthy Italian clients. This move is part of Coller Capital's broader strategy to tap into the European market, leveraging Mediobanca's strong presence and network in Italy. The partnership seeks to provide Italian investors with access to a diverse range of private equity secondary investments, enhancing their portfolio diversification. Both firms are optimistic about the potential growth and benefits this collaboration will bring to their clients.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053428&language=en-US",
            "pub_date": "2026-02-28 18:08:57",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053427,
            "title": "GEOPOLITICS | Greek Shipping Ministry Advises Ships to Avoid Persian Gulf Amid Heightened Tensions",
            "description": "The Greek Shipping Ministry has issued a warning to vessels flying the Greek flag, urging them to exercise heightened vigilance and avoid navigating through the Persian Gulf, the Gulf of Oman, and the Strait of Hormuz. According to Jin10, this advisory comes amid escalating geopolitical tensions in the region, which could pose risks to maritime operations.\n\nThe ministry's recommendation reflects concerns over potential threats to shipping routes, which are crucial for global trade. The Persian Gulf and its surrounding waters are strategic chokepoints for oil transportation, and any disruption could have significant implications for international markets.\n\nGreek authorities are closely monitoring the situation and have advised ship operators to remain informed about developments and adjust their routes accordingly to ensure safety. This move underscores the importance of maintaining secure passageways for commercial vessels in areas prone to conflict.\n\nThe advisory highlights the broader geopolitical challenges faced by nations reliant on maritime trade, as tensions in the Middle East continue to influence global shipping dynamics.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053427&language=en-US",
            "pub_date": "2026-02-28 18:09:50",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053426,
            "title": "Global Economic Developments This Week",
            "description": "This week, the global economy experienced several notable developments. Bloomberg posted on X, highlighting key economic indicators and trends that have shaped the financial landscape. \n\nThe U.S. economy showed signs of resilience, with employment figures indicating steady growth. Meanwhile, inflation rates remained a focal point for policymakers, as central banks worldwide continued to navigate the delicate balance between stimulating growth and controlling price increases.\n\nIn Europe, economic recovery efforts faced challenges due to fluctuating energy prices and supply chain disruptions. These factors have contributed to varying levels of economic performance across the region.\n\nAsian markets experienced mixed results, with China's economic data reflecting both growth and areas of concern. The ongoing impact of regulatory changes and geopolitical tensions has influenced market sentiment.\n\nOverall, the global economy remains in a state of flux, with various factors contributing to its dynamic nature. Analysts continue to monitor these developments closely, as they have significant implications for future economic policies and strategies.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053426&language=en-US",
            "pub_date": "2026-02-28 18:13:17",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053425,
            "title": "GEOPOLITICS | Iranian Foreign Minister Abbas Araghchi Reported Safe After Israeli Strike",
            "description": "Iranian Foreign Minister Abbas Araghchi is reportedly in good health following an assassination attempt by Israel, according to Jin10. The report, sourced from the Iranian Students' News Agency (ISNA), comes after Israel launched its initial targeted strike. The incident highlights ongoing tensions in the region, with geopolitical implications for both countries. Further details on the situation remain limited at this time.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053425&language=en-US",
            "pub_date": "2026-02-28 18:14:15",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053421,
            "title": "Iran launched ballistic missiles at all Gulf states except Oman.",
            "description": "Market news: Iran has launched ballistic missiles at all Gulf states except Oman. (Jinshi)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053421&language=en-US",
            "pub_date": "2026-02-28 18:01:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053423,
            "title": "Iranian Military Official Declines to Comment on Potential Targeting of Leaders",
            "description": "An Iranian military official has refrained from commenting on whether Iran's Supreme Leader or President might be targeted in attacks. According to Jin10, the official's silence comes amid heightened tensions in the region. The lack of response leaves questions about the security measures in place for Iran's top leaders. This development follows a series of incidents that have raised concerns about potential threats to national security. Observers are closely monitoring the situation for any further updates.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053423&language=en-US",
            "pub_date": "2026-02-28 18:02:27",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}