{
    "data": [
        {
            "id": 1054507,
            "title": "The Key Events That Could Move Crypto Markets in March 2026",
            "description": "March 2026 arrives carrying more macro and regulatory weight than most months, with U. S. economic data releases, a Federal Reserve interest rate decision, multiple significant token unlocks, and a series of crypto-specific catalysts packed into a four-week window that could materially shift market direction\nsource: https://www.ethnews.com/the-key-events-that-could-move-crypto-markets-in-march-2026/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054507&language=en-US",
            "pub_date": "2026-03-01 20:34:11",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054513,
            "title": "Middle East Tensions Unlikely to Disrupt Poland's Oil Supply, Says PERN",
            "description": "Poland's oil pipeline operator, PERN, has stated that the current situation in the Middle East is not expected to affect the continuity of crude oil and refined product supplies to Poland. According to Jin10, PERN reassured stakeholders that despite geopolitical tensions, the supply chain remains stable. The company continues to monitor the situation closely to ensure uninterrupted operations. This announcement comes amid rising concerns over potential disruptions in global oil markets due to regional conflicts.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054513&language=en-US",
            "pub_date": "2026-03-01 20:41:22",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054511,
            "title": "Former Credit Suisse CIO: Tokenized gold underpins \"almost 100% price discovery\" during CME closures over the weekend.",
            "description": "Iggy Ioppe, former Chief Investment Officer of Credit Suisse, stated that during the period from the close of CME Group gold futures trading on Friday at 5:00 PM (Eastern Time) to its reopening at 6:00 PM on Sunday, almost all publicly visible gold price formation occurred on the on-chain market. He pointed out that during this window, regulated futures markets were suspended, and while over-the-counter (OTC) trading in Asia was active, it lacked transparency. Therefore, tokenized gold assets such as PAX Gold (PAXG) and Tether Gold (XAUt) became the only continuously tradable public markets. \"From the perspective of publicly visible price formation, the on-chain market accounted for almost 100% of the weekend price discovery.\" When CME resumed trading, futures prices typically aligned with the volatility already occurring on the on-chain market. Data shows that the market capitalization of tokenized gold has risen to $4.4 billion, an increase of approximately $2.8 billion over the past year, representing a growth of 177%, far exceeding the performance of most spot gold ETFs. The total trading volume for 2025 was approximately $178 billion, with a peak of over $126 billion in the fourth quarter alone, second only to SPDR Gold Shares in terms of trading volume. On Saturday, amid escalating geopolitical tensions following US-Israeli airstrikes against Iran, tokenized gold prices rose briefly, with XAUt briefly surpassing $5450 and PAXG approaching $5536, while Bitcoin and Ethereum retreated in tandem. Current major participants include market makers, cross-market liquidity providers, and crypto-native macro traders, who utilize tokenized gold for arbitrage, staking, hedging, and yield strategies. Some institutions also monitor on-chain gold price movements over the weekend to assess the \"gap risk\" before the CME market opens, but mostly treat it as a reference signal rather than a direct basis for establishing positions. (Cointelegraph)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054511&language=en-US",
            "pub_date": "2026-03-01 20:42:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054512,
            "title": "Hyperliquid's 13% Price Rally Amid US-Iran Tensions",
            "description": "Hyperliquid experienced a significant 13% price increase as geopolitical tensions between the United States and Iran prompted traders to turn to its derivatives platform during a weekend when traditional markets were closed. According to NS3.AI, the platform's open interest for commodities-linked perpetual futures reached an unprecedented high of over $1.1 billion, driven by the adoption of its HIP-3 protocol upgrade. Despite this growth, the platform faces potential regulatory challenges due to its lack of compliance measures such as Know Your Customer (KYC), which may attract scrutiny from U.S. authorities.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054512&language=en-US",
            "pub_date": "2026-03-01 20:47:43",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054497,
            "title": "XRP's Price Targets Challenged by Large Token Supply",
            "description": "XRP's substantial token supply presents challenges for achieving high price targets, as it would necessitate a market capitalization surpassing that of Bitcoin. According to NS3.AI, while Ripple's partnerships with banks and the ledger's technology, including capabilities of 40,000 transactions per second and ISO 20022 compliance, support its utility, they do not ensure widespread adoption of the XRP token. Analysts forecast moderate price increases, suggesting that XRP is unlikely to provide rapid wealth accumulation or significant short-term returns.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054497&language=en-US",
            "pub_date": "2026-03-01 20:19:01",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054496,
            "title": "Tron Inc. Increases TRX Holdings with Recent Purchase",
            "description": "Tron Inc., a company listed on Nasdaq, has expanded its TRX holdings by acquiring an additional 176,081 tokens at an average price of $0.28. According to NS3.AI, this acquisition raises Tron's total TRX treasury to over 684 million tokens. The purchase reflects ongoing confidence and accumulation by a significant institutional player in the TRX market.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054496&language=en-US",
            "pub_date": "2026-03-01 20:19:07",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054495,
            "title": "Historical returns for Bitcoin and Ethereum in March: averaged 11.28% and 17.07% respectively.",
            "description": "According to Coinglass data, in the 13 \"March\" price movements in Bitcoin's history since 2013, 6 saw gains and 7 saw losses. The largest gain occurred in March 2013, with a monthly increase of 172.76%; the largest loss occurred in March 2018, with a monthly decrease of 32.85%. Since 2013, the average return for Bitcoin's \"March\" price movements has been 11.28%, with a median return of -1.55%. In the 11 \"March\" price movements in Ethereum's history since 2016, 8 saw gains and 3 saw losses. The largest gain occurred in March 2017, with a monthly increase of 214.11%; the largest loss occurred in March 2018, with a monthly decrease of 53.79%. Since 2016, Ethereum's \"March\" market has had an average return of 17.07% and a median return of -9.33%.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054495&language=en-US",
            "pub_date": "2026-03-01 20:24:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054492,
            "title": "Drone Crash and Explosions Reported in Syria",
            "description": "On March 1, a drone originating from Iran crashed in the rural area of Hilbet Ghazaleh in Syria's Daraa province. According to Jin10, the same day witnessed a series of explosions in the city of Damascus. The incidents highlight ongoing tensions in the region. Further details on the cause and impact of these events remain unclear.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054492&language=en-US",
            "pub_date": "2026-03-01 20:09:39",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054491,
            "title": "Russia's Central Bank Identifies Cryptocurrency as Key Tool in Financial Scams",
            "description": "Russia's central bank has revealed that approximately two-thirds of financial pyramid schemes in the country are utilizing cryptocurrency. According to NS3.AI, the bank has identified over 4,600 crypto wallets linked to scams. In response, more than 21,500 web pages associated with crypto fraud have been blocked. The increasing use of cryptocurrency by scammers is attributed to the anonymity it provides. Consequently, Russian authorities are expediting regulations to limit the operations of overseas crypto exchanges. They are also advising the public to invest only through firms that have the necessary permits.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054491&language=en-US",
            "pub_date": "2026-03-01 20:11:43",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054490,
            "title": "Lufthansa Extends Airspace Closure Over Middle Eastern Countries",
            "description": "Lufthansa has announced that it will continue to keep its airspace closed over several Middle Eastern countries until March 8. According to Jin10, the affected regions include Israel, Lebanon, Jordan, Iraq, Qatar, Kuwait, Bahrain, Dammam, and Iran. This decision is part of ongoing safety measures. The airline has not provided further details on the reasons behind the extended closure. Travelers are advised to stay updated on any changes to flight schedules.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054490&language=en-US",
            "pub_date": "2026-03-01 20:12:59",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054485,
            "title": "Iran's Latest Developments Unfold",
            "description": "Bloomberg posted on X, providing updates on the current situation in Iran. The details of the developments remain crucial as the region continues to experience significant changes. Observers are closely monitoring the unfolding events, which could have implications for international relations and economic stability. Further information is expected as the situation progresses.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054485&language=en-US",
            "pub_date": "2026-03-01 20:00:35",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054483,
            "title": "Tokenized gold leads ‘100% of weekend price discovery’ while CME futures are closed",
            "description": "Tokenized gold markets like PAXG and XAUt now handle nearly all gold price discovery when CME futures shut for the weekend.\nsource: https://cointelegraph.com/news/tokenized-gold-weekend-price-discovery-cme-closed?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054483&language=en-US",
            "pub_date": "2026-03-01 19:48:52",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054482,
            "title": "Tron Inc. disclosed that it increased its holdings by 176,081 TRX tokens, bringing its total holdings to over 684 million.",
            "description": "Nasdaq-listed TRX treasury company Tron Inc. disclosed that it has purchased another 176,081 TRX tokens at an average price of $0.28, bringing its total TRX treasury holdings to over 684 million.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054482&language=en-US",
            "pub_date": "2026-03-01 19:49:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054480,
            "title": "North Korea Condemns U.S. and Israel's Military Actions Against Iran",
            "description": "North Korea has issued a strong condemnation of the United States and Israel's military actions against Iran, labeling them as outright acts of aggression. According to Jin10, a spokesperson from North Korea's Foreign Ministry stated that such actions are intolerable under any circumstances. The statement criticized the U.S. and Israel for their disregard of international law and accused them of using military force to pursue hegemonic ambitions.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054480&language=en-US",
            "pub_date": "2026-03-01 19:49:37",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054481,
            "title": "Sam Altman responds to OpenAI nationalization: Establishing close cooperation between government and businesses is \"extremely important\"",
            "description": "Following his latest AMA, OpenAI founder Sam Altman released a summary, responding to a question about what would happen if the US government attempted to nationalize OpenAI or other AI projects. Altman stated that he cannot predict the outcome. While government-led development of AI may have been more suitable in the long run, nationalization is not highly probable given the current trajectory. However, he emphasized that close cooperation between the government and AI companies is \"extremely important.\" He noted that people take security \"guarantees\" for granted but often underestimate the enormous investment and effort required behind them. He believes this is generally a good thing, but still requires more respect and understanding.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054481&language=en-US",
            "pub_date": "2026-03-01 19:50:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054476,
            "title": "BREAKING: IRAN NAMES SENIOR CLERIC AYATOLLAH ALIREZA ARAFI AS INTERIM SUPREME LEADER AFTER KHAMENEI KILLED\n\nSenior cleric Ayatollah Alireza Arafi will serve as Iran's interim Supreme Leader. State-linked ISNA reported the appointment following Khamenei’s death.\n\nIran activated",
            "description": "null\nsource: https://x.com/BSCNews/status/2028072566431355342",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054476&language=en-US",
            "pub_date": "2026-03-01 19:39:14",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054473,
            "title": "GEOPOLITICS | Israeli Defense Forces Identify Increased Missile Production by Iran",
            "description": "The Israeli Defense Forces (IDF) have reported a significant increase in missile production activities by Iran, according to intelligence gathered prior to an operation launched in June last year. According to Jin10, the intelligence indicates that Iran's missile production has accelerated, with plans to produce approximately 8,000 missiles by 2027. This development highlights growing concerns over regional security and the potential implications for geopolitical stability.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054473&language=en-US",
            "pub_date": "2026-03-01 19:40:37",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054475,
            "title": "How 6 Polymarket ‘insiders’ secretly cashed in on Operation Epic Fury",
            "description": "After placing some amazingly accurate bets that the United States would strike Iran, six anonymous accounts on Polymarket won almost $1. 2 million. All of this occurred just hours before real bombs began to fall on Tehran and other locations in Iran on February 28. Bubblemaps, a blockchain analytics company, investigated and located those six accounts. […]\nsource: https://www.cryptopolitan.com/polymarket-insiders-operation-epic-fury/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054475&language=en-US",
            "pub_date": "2026-03-01 19:41:14",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054472,
            "title": "Australian Insurers Call for A$30 Billion Flood Defense Fund",
            "description": "Insurers in Australia are advocating for the establishment of a A$30 billion flood defense fund to address the rising costs associated with extreme weather events. Bloomberg posted on X, highlighting the industry's concerns over the financial impact of such natural disasters. The proposed fund aims to mitigate the economic burden on both insurers and policyholders by investing in infrastructure and preventive measures. As climate change continues to exacerbate weather-related challenges, the call for legislative action underscores the urgency of enhancing the nation's resilience against future floods.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054472&language=en-US",
            "pub_date": "2026-03-01 19:46:51",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054470,
            "title": "Planet Evening News",
            "description": "1. Paul Chan: Blockchain, AI, and other technologies empower financial services, creating a more efficient trading system; 2. Iranian stock market trading suspended until next week; 3. Bakkt plans to raise $48.125 million through the issuance of Class A ordinary shares and prepaid warrants; 4. A whale opened 40x leveraged long positions in BTC and 20x leveraged long positions in SOL today, only to have some liquidated; 5. Iranian President: Revenge is a \"legitimate right and obligation\"; 6. Ethereum's Q1 return is currently -32.17%, and Bitcoin's is currently -23.21%; 7. Data: Polymarket platform's contracts related to the US-Iran conflict have attracted $600 million; 8. Bitcoin on-chain NFT transactions have shrunk significantly, with February sales falling below $25 million, the lowest since March 2023; 9. Whale \"pension-usdt.eth\" closed its Bitcoin long positions, making a profit of $466,000; 10. Bitwise: Bitcoin investors need to hold for at least 3 years to avoid losses, and short-term trading has a nearly 50% probability of loss; 11. 21st Century Business Herald: Hong Kong will provide guidelines to clarify that the register of bondholders can be stored using a distributed ledger.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054470&language=en-US",
            "pub_date": "2026-03-01 19:30:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}