{
    "data": [
        {
            "id": 734277,
            "title": "U.S. Sovereign Wealth Fund Plan Expected Within 90 Days",
            "description": "According to PANews, Solid Intel reports that the newly appointed U.S. Treasury Secretary, Bessent, along with Commerce Secretary nominee Lutnick, are anticipated to unveil a U.S. sovereign wealth fund plan within the next 90 days. Additionally, Sacks, known as the \"czar\" of artificial intelligence and cryptocurrency, is expected to announce his cryptocurrency plan in 170 days.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734277&language=en-US",
            "pub_date": "2025-02-05 17:33:49",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734276,
            "title": "India and OpenAI Discuss AI Strategy and Collaboration",
            "description": "According to PANews, India's Minister of Electronics and Information Technology, Ashwini Vaishnaw, recently announced on social media platform X that he met with OpenAI CEO Sam Altman. The discussion focused on artificial intelligence strategies related to GPUs, models, and applications. Vaishnaw stated that OpenAI is interested in collaborating with India in these areas and praised Indian Prime Minister Narendra Modi's vision for democratizing technology.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734276&language=en-US",
            "pub_date": "2025-02-05 17:33:54",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734273,
            "title": "A whale invested 20,000 SOLs to become the top payment address of Meme coin PAIN",
            "description": "Odaily Planet Daily News According to the monitoring of Ai Yi, an analyst on the chain, during the pre-sale fundraising stage of Meme coin PAIN, the whale \"5r2kw...Aq1Bv\" invested 20,000 SOL (worth $4.3 million at the time) to become the TOP1 payment address, accounting for 10.74% of the total fund pool.\nIn addition, according to the pre-sale payment situation, after the airdrop is distributed in proportion, the distribution of the front-row chips is as follows:\nTOP5: 32,747 SOL, holding a total of 17.6%;\nTOP10: 43,242 SOL, holding a total of 23.2%;\nTOP20: 59,299 SOL, holding a total of 31.87%\nThe total proportion of TOP20 holdings exceeds one-third. If they are sold after the opening, it may have a great impact on the price of the currency.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734273&language=en-US",
            "pub_date": "2025-02-05 17:34:22",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734275,
            "title": "BNB Drops Below 570 USDT with a 1.09% Decrease in 24 Hours",
            "description": "On Feb 05, 2025, 09:34 AM(UTC). According to Binance Market Data, BNB has dropped below 570 USDT and is now trading at 569.630005 USDT, with a narrowed 1.09% decrease in 24 hours.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734275&language=en-US",
            "pub_date": "2025-02-05 17:34:41",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734255,
            "title": "Crypto analyst: Now is a better time for retail investors to enter the market",
            "description": "Odaily Planet Daily News Crypto analyst Miles Deutscher wrote that compared with November and December last year, now is a better time for retail investors to enter the market. Data shows that the number of views on major cryptocurrency YouTube channels has been halved since its peak in early December, reflecting that market sentiment has shifted from FOMO at the top to panic and indifference at the bottom.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734255&language=en-US",
            "pub_date": "2025-02-05 17:19:34",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734254,
            "title": "Citi: Cryptocurrency market's correlation with the stock market may weaken in the long run",
            "description": "Odaily Planet Daily News Citi said in its latest research report that as the adoption of digital assets grows, the correlation between Bitcoin and the stock market is expected to weaken in the long term. Citi pointed out that although the stock market is still the main macro driver of the crypto market, the correlation between the stock market and crypto assets will gradually decline as the crypto asset market matures, the investor base expands, and technological advances and adoption rates increase. In addition, further clarification of US crypto regulation may bring more market volatility driven by non-macro factors. The report also mentioned that Bitcoin's volatility is expected to continue to decline as institutional adoption grows. At the same time, Bitcoin's correlation with gold is worth paying attention to, which may be an early signal of its \"value storage\" attribute.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734254&language=en-US",
            "pub_date": "2025-02-05 17:23:06",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734272,
            "title": "Citi Predicts Decreasing Correlation Between Bitcoin And Stock Market",
            "description": "According to Odaily, Citi's latest research report suggests that the correlation between Bitcoin and the stock market is expected to weaken over the long term as digital asset adoption increases. Citi highlights that while the stock market remains a primary macroeconomic driver for the crypto market, the maturing of the crypto asset market, expansion of the investor base, technological advancements, and increased adoption rates will gradually reduce this correlation. Additionally, clearer U.S. crypto regulations may introduce more market fluctuations driven by non-macro factors. The report also notes that Bitcoin's volatility is anticipated to continue decreasing with the growth of institutional adoption. Furthermore, the correlation between Bitcoin and gold is noteworthy, potentially indicating early signs of its 'store of value' attribute.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734272&language=en-US",
            "pub_date": "2025-02-05 17:23:35",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734271,
            "title": "Current Market Conditions Favor Retail Investors, Says Analyst",
            "description": "According to Odaily, cryptocurrency analyst Miles Deutscher has stated that the present time offers a better entry opportunity for retail investors compared to November and December of last year. Data indicates that viewership on major cryptocurrency YouTube channels has halved since peaking in early December, reflecting a shift in market sentiment from peak FOMO (fear of missing out) to a state of fear and apathy at the bottom.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734271&language=en-US",
            "pub_date": "2025-02-05 17:23:42",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734234,
            "title": "Ethereum 2025: Is it worth investing in? Prospects and Risks",
            "description": "Will Ethereum in 2025 be a good investment? Find out the key factors, from Layer-2s to ETFs, to assess the prospects and risks of its future.\nsource: https://en.spaziocrypto.com/ethereum/ethereum-2025-is-it-worth-investing-in-prospects-and-risks/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734234&language=en-US",
            "pub_date": "2025-02-05 17:05:58",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734253,
            "title": "Analyst Advises Caution In Altcoin Investments Amid Bitcoin Volatility",
            "description": "According to BlockBeats, on February 5, CryptoQuant community analyst Maartunn highlighted that while Bitcoin experienced a modest 7% decline, altcoins showed significantly larger drops. He advised investors to limit their altcoin investments to 5-10% of their portfolios, depending on their risk tolerance.\n\nMaartunn noted that many investors are currently holding only altcoins without any Bitcoin, which could expose their portfolios to excessive volatility. He emphasized that Bitcoin's inherent volatility is already sufficient to yield substantial returns, especially when compared to traditional financial markets.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734253&language=en-US",
            "pub_date": "2025-02-05 17:13:36",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}