{
    "data": [
        {
            "id": 1050356,
            "title": "US Dollar's Share in Global Reserves Hits Lowest Level Since 1995",
            "description": "The International Monetary Fund (IMF) has revealed that the US dollar now constitutes just over 56.32% of global foreign exchange reserves, marking its lowest share since 1995. According to NS3.AI, central banks around the world are diversifying their reserves by increasing their holdings of gold, commodities, and local currencies, thereby reducing their dependence on the dollar. This persistent decline in the dominance of the USD poses significant economic risks for the United States, including the potential for recession and inflationary pressures.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050356&language=en-US",
            "pub_date": "2026-02-26 20:48:48",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050355,
            "title": "Institutional Adoption of Digital Assets Shows Varied Patterns",
            "description": "Institutional adoption of digital assets is experiencing significant variation, influenced by internal mandates, regulatory clarity, and operational readiness. According to NS3.AI, Samar Sen from Talos highlights that trust in digital assets is established through regulatory compliance, strong internal controls, and peer adoption, rather than mere visibility. Institutions are categorized into early movers, fast followers, and late adopters, each demonstrating different risk appetites and levels of conviction towards blockchain technology.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050355&language=en-US",
            "pub_date": "2026-02-26 20:48:55",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050354,
            "title": "Artificial Intelligence Predicted to Reshape Job Market, Not Cause Mass Unemployment",
            "description": "A recent report by Morgan Stanley suggests that artificial intelligence (AI) will not lead to widespread permanent unemployment but will instead transform the employment landscape by creating new job opportunities. According to BlockBeats, the report draws on 150 years of technological change history, noting that advancements from electrification to the internet have altered the labor market without replacing human labor entirely. The report anticipates the emergence of roles such as Chief AI Officer and AI governance specialists, along with hybrid positions across various industries.\n\nHowever, some economists caution that AI's automation of cognitive tasks could devalue human expertise, potentially decoupling corporate profit growth from employment growth. Currently, 30% of companies adopting AI report measurable financial or productivity gains, a significant increase from 16% a year ago.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050354&language=en-US",
            "pub_date": "2026-02-26 20:50:08",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050353,
            "title": "DMG Blockchain released its Q1 financial report: mining output was 69 Bitcoins, and several performance indicators declined.",
            "description": "Bitcoin mining company DMG Blockchain released its unaudited financial results for the first quarter of fiscal year 2026, disclosing revenue of CAD 11.2 million, a 2% decrease quarter-over-quarter and a 4% decrease year-over-year. A total of 69 Bitcoins were mined in the quarter, lower than the 72 in the previous quarter and the 97 in the same period last year. Hashrate rose to 1.76 EH/s, a 10% increase quarter-over-quarter. The company held a total of CAD 58.6 million in cash, short-term investments, and digital assets, a 10% decrease from the end of the fiscal year. Total assets were CAD 122 million, an 8% decrease quarter-over-quarter. Net loss was CAD 2.2 million (loss per share of CAD 0.01), narrowing from a net loss of CAD 3.1 million in the same period last year. However, due to changes in the fair value of digital assets, consolidated net profit turned from a profit of CAD 12.2 million in the same period last year to a loss of CAD 16.5 million. (Globenewswire)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050353&language=en-US",
            "pub_date": "2026-02-26 20:43:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050352,
            "title": "Bloomberg analysts: Bitcoin ETFs see large inflows, but signs of a dead cat bounce remain.",
            "description": "Eric Balchunas, a senior ETF analyst at Bloomberg, wrote on the X platform that Bitcoin ETFs attracted approximately $500 million in inflows yesterday, the largest single-day increase in recent times. Over the past two days, cumulative inflows have reached approximately $750 million. At a time of strong market pessimism, he described this inflow as \"like hitting a home run in a low point of the game,\" providing a boost to the market. Year-to-date, Bitcoin ETFs have still seen net outflows of less than $2 billion, but it remains unclear whether this marks the beginning of a genuine rebound or a short-lived \"dead cat bounce.\"",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050352&language=en-US",
            "pub_date": "2026-02-26 20:47:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050334,
            "title": "Papa John's Shares Decline Amid Disappointing Sales and Outlook",
            "description": "Papa John's shares experienced a decline following a report of sales shrinking more than anticipated. Bloomberg posted on X that the pizza chain's annual outlook also fell short of expectations, indicating that customers are increasingly cutting back on spending for its fast-food offerings. The company's performance suggests a challenging environment as consumers become more cautious with their expenditures.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050334&language=en-US",
            "pub_date": "2026-02-26 20:36:39",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050330,
            "title": "Bernstein: Circle has transformed into a fintech infrastructure, rating it as \"Outperform\".",
            "description": "Bernstein points out that Circle is no longer seen as a mere \"proxy investment\" for crypto assets, but has transformed into a fintech infrastructure service provider, reflecting a profound shift in the company's business positioning. According to Circle's Q4 2025 financial report, the company achieved significant revenue growth—total revenue for the fourth quarter reached approximately $770 million, a surge of 77% year-over-year. CEO Jeremy Allaire stated in the earnings call that the company is currently in the early stages of a fundamental transformation in how the global economic system operates, with the future economy becoming more internet-connected and highly automated. Bernstein's analyst team believes Circle will play a key role in this evolution and reaffirmed its \"Outperform\" rating and $190 price target in its latest research report, suggesting significant upside potential for the company's stock. Analyst Gautum Chhugani and his colleagues noted in their report that Circle's Q4 performance clearly diverged from the overall crypto market trend, emphasizing that the company is moving towards becoming a core internet infrastructure provider, rather than simply a stablecoin or crypto token business. (Dlnews)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050330&language=en-US",
            "pub_date": "2026-02-26 20:37:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050333,
            "title": "GEOPOLITICS | Ukraine Continues Negotiations in Geneva",
            "description": "Ukraine's Secretary of the National Security and Defense Council, Umerov, announced ongoing negotiations in Geneva. According to Jin10, Ukraine has scheduled bilateral meetings with the U.S. delegation, including Special Envoy Whitcoff and Kushner. These discussions are part of Ukraine's efforts to advance diplomatic talks.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050333&language=en-US",
            "pub_date": "2026-02-26 20:37:54",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050332,
            "title": "Nigeria Extends Shea Nut Export Ban to Enhance Local Processing",
            "description": "Nigeria has prolonged its ban on the export of shea nuts for another year, aiming to reduce the shipment of raw commodities and enhance local processing capabilities. Bloomberg posted on X, highlighting the government's strategy to increase value addition within the country. This move is part of a broader effort to stimulate local industries and improve economic growth by encouraging the processing of raw materials domestically.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050332&language=en-US",
            "pub_date": "2026-02-26 20:38:58",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050316,
            "title": "Smucker Announces New Board Members Following Agreement with Elliott",
            "description": "Smucker has announced the addition of two new directors to its board, following an agreement with activist investor Elliott. Bloomberg posted on X, highlighting the strategic move aimed at enhancing governance and driving future growth. The company has been in discussions with Elliott, which has been advocating for changes to improve shareholder value. The new appointments are expected to bring fresh perspectives and expertise to Smucker's leadership team, aligning with the company's long-term objectives. This development marks a significant step in Smucker's ongoing efforts to strengthen its board and optimize its business strategies.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050316&language=en-US",
            "pub_date": "2026-02-26 20:26:58",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050315,
            "title": "United Parks and Resorts Reports Lower Earnings and Sales",
            "description": "United Parks and Resorts announced that its earnings and sales fell short of analyst expectations. Bloomberg posted on X, highlighting that the theme park operator faced challenges due to a decline in attendance, particularly from international visitors. The company is experiencing difficulties in attracting overseas tourists, which has impacted its financial performance. Despite efforts to boost attendance, the results indicate a need for strategic adjustments to address the downturn in international interest.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050315&language=en-US",
            "pub_date": "2026-02-26 20:27:44",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050314,
            "title": "WHO Chief Criticizes U.S. Funding Withdrawal from Covid Vaccine Research",
            "description": "The World Health Organization's Chief, Tedros Adhanom Ghebreyesus, has criticized the United States for withdrawing nearly $500 million in funding from research into the technology that developed Covid-19 vaccines. Bloomberg posted on X, highlighting Tedros's concerns about the impact of this decision on global health initiatives. The funding cut is seen as a setback in the ongoing efforts to combat the pandemic and advance vaccine technology. Tedros emphasized the importance of continued investment in research to ensure preparedness for future health crises.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050314&language=en-US",
            "pub_date": "2026-02-26 20:29:26",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050310,
            "title": "Analysis: Bitcoin retreated after testing $70,000; derivatives funds flowed in, but bearish sentiment remained.",
            "description": "Bitcoin retreated after a strong surge to $70,000 in the US session on Wednesday, trading around $68,600 in the Asian session on Thursday, failing to hold above the key psychological level. Since the end of February, BTC has maintained a range-bound trading structure, having dipped to $62,500 this month and reached $71,100 on February 15th. Market analysts point out that Bitcoin broke out of a similar trading range in January, but subsequently fell rapidly from $98,000 to $60,000, forming lower highs in this downward cycle, making some traders cautious about the sustainability of the current breakout. Derivatives data shows that the total open interest (OI) in the crypto futures market increased by over 6.6%, approaching $100 billion, a higher increase than the overall market capitalization growth, indicating new capital inflows. In the options market, Deribit data shows that the Bitcoin rebound boosted demand for call options with strike prices between $85,000 and $90,000. However, the overall options structure still leans towards put protection, with $60,000 put options currently the most popular position, boasting a notional open interest exceeding $1.4 billion, indicating that the market remains wary of downside risks. (Coindesk)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050310&language=en-US",
            "pub_date": "2026-02-26 20:30:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050292,
            "title": "XRP Price News: Is a 20% March Rally Taking Shape After Months of Losses?",
            "description": "XRP may be approaching a pivotal turning point after months of sustained downside pressure. Technical signals and improving onchain data suggest the token could be setting up for a 20% rebound in March, provided key resistance levels are cleared.XRP is currently down more than 50% since October 2025 and has posted five consecutive red monthly candles. March could mark the first meaningful attempt to break that bearish streak.Key TakeawaysXRP is forming a double-bottom pattern, targeting a potential 20% upside move.Whale selling pressure has eased sharply, while large-holder balances are rising.A breakout above $1.50 is critical to confirm the bullish scenario.Failure at resistance could reopen downside risk toward $1.00.Double-Bottom Pattern Signals Potential 20% XRP UpsideXRP has twice defended the $1.30–$1.35 support zone in February, forming what appears to be a classic double-bottom reversal pattern on the daily chart.A double bottom typically signals trend exhaustion after a prolonged decline. The pattern confirms when price breaks above the neckline, which for XRP sits near $1.50.If XRP achieves a decisive close above this level, the technical target projects toward $1.68–$1.70, representing a gain of roughly 20% from current prices.This level would also place XRP back into a mid-range zone last seen before the sharp leg lower earlier this year.Whale Behavior Turns Supportive as Distribution FadesOnchain data shows a notable shift in large-holder behavior, strengthening the bullish case.According to CryptoQuant data:XRP whale net flows (90-day moving average) have improved to around -3.3 million XRP, down from -33.5 million XRP in December.This sharp reduction in outflows suggests that distribution has largely cooled, even as price fell another ~25% over the same period.At the same time, Glassnode data shows that wallets holding at least 1,000 XRP have resumed accumulation, indicating that larger holders may be positioning near local lows.A similar slowdown in whale selling occurred in April 2025, which preceded a 50%+ XRP rally in the months that followed.A clean flip of whale flows back into positive territory would further reinforce the probability of a March breakout.Resistance Levels That Could Stall the RallyDespite improving signals, XRP still faces important technical hurdles.The $1.68–$1.70 target zone sits above the 50-day exponential moving average (EMA) — a level XRP has repeatedly failed to reclaim throughout February.A rejection at the 50-day EMA could invalidate the double-bottom setup and shift the structure into a bear pennant, with downside risk extending toward $1.00, or roughly 30% lower from current levels.Macro Risks Remain a Key VariableEven with constructive technical and onchain signals, macro conditions remain a wildcard.Potential headwinds include:A renewed risk-off rotation driven by AI-sector volatilityGeopolitical tensions, particularly involving the US and IranBroader liquidity tightening impacting high-beta altcoinsThese factors could cap upside or delay confirmation, even if XRP’s chart structure continues to improve.Bottom LineXRP is showing its strongest bullish setup in months, supported by a double-bottom pattern and easing whale distribution. A confirmed breakout above $1.50 would significantly increase the odds of a 20% rally toward $1.68–$1.70 in March.However, failure to reclaim key resistance — or renewed macro stress — could quickly invalidate the setup. For now, XRP sits at a technical inflection point where March may finally determine whether the downtrend breaks or extends, according to Cointelegraph.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050292&language=en-US",
            "pub_date": "2026-02-26 20:18:10",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050291,
            "title": "JinkoSolar Secures 124MW Solar Module Supply Deal with UK Energy Developer",
            "description": "JinkoSolar has recently signed a significant agreement with a renowned UK energy developer to supply 124MW of its high-efficiency Tiger Neo 3.0 solar modules. According to Jin10, this order will be utilized entirely for a large-scale ground-mounted power station project within the United Kingdom. This collaboration marks a notable step in expanding renewable energy infrastructure in the region.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050291&language=en-US",
            "pub_date": "2026-02-26 20:19:42",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050290,
            "title": "Starknet Introduces strkBTC for Enhanced Bitcoin Privacy",
            "description": "Starknet has announced the launch of a new asset, strkBTC, designed to offer optional privacy features for Bitcoin. According to PANews, strkBTC is issued on Starknet and can be exchanged bidirectionally with native Bitcoin, addressing financial privacy concerns arising from Bitcoin's transparent ledger.\n\nstrkBTC supports two modes: in 'non-shielded mode,' it operates as a standard ERC-20 token with publicly accessible balances and transfers; in 'shielded mode,' asset balances and transaction details are concealed. This privacy mechanism is based on a pragmatic design, keeping information confidential by default but allowing compliance audits through a Viewing Key, ensuring operation in regulated environments. With strkBTC, users can engage in DeFi collateralization or settlement without exposing positions and strategies. Starknet has indicated that strkBTC will be officially launched soon, with plans to gradually expand its privacy features in the future.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050290&language=en-US",
            "pub_date": "2026-02-26 20:19:45",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050289,
            "title": "Market Sentiment Turns Defensive Amid Geopolitical Tensions and Economic Uncertainty",
            "description": "The outlook for 2026 is marked by widespread caution among investors due to geopolitical tensions, unclear U.S. fiscal and monetary policies, and weakening globalization amid regionalization trends. According to NS3.AI, participants across various asset classes, including equities, bonds, commodities, and cryptocurrencies, are reducing leverage and lowering exposure to riskier investments. This shift is fostering a defensive market stance as investors brace for a more uncertain economic environment.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050289&language=en-US",
            "pub_date": "2026-02-26 20:19:46",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050288,
            "title": "Cryptocurrency exchange STS Digital has raised $30 million in funding, led by CMT Digital.",
            "description": "Cryptocurrency exchange STS Digital announced the completion of a $30 million funding round, led by CMT Digital, with participation from cryptocurrency exchange Kraken, venture capital firm Arrington Capital, and an investment arm of Fidelity Investments. STS Digital co-founder and CEO Maxime Seiler declined to disclose the company's valuation in this round. The new funds will be used to expand its cryptocurrency perpetual contracts (rather than options) business. (Fortune)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050288&language=en-US",
            "pub_date": "2026-02-26 20:13:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050287,
            "title": "American Bitcoin Financial Report: Bitcoin reserves surpass 6,000, 2025 revenue exceeds $180 million.",
            "description": "American Bitcoin, a Nasdaq-listed Bitcoin mining company backed by the Trump family, released its 2025 financial report, disclosing that its Bitcoin reserves exceeded 6,000. 2025 marked its first year as an independently listed company, and its operational and capital execution performance throughout the year aligned with its established strategy. The company adopted a dual-track model of \"scaled mining + ATM fundraising\" to accelerate the accumulation of its strategic reserves. In 2025, its revenue reached $185.2 million, with a deployed hashrate of approximately 25 EH/s and approximately 78,000 ASIC miners. (PRNewswire)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050287&language=en-US",
            "pub_date": "2026-02-26 20:15:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050272,
            "title": "Construction Costs in New York City Driven by Insurance and Other Factors",
            "description": "New York City is known for its high construction costs, with insurance being a significant factor contributing to these expenses. Bloomberg posted on X, highlighting insights from Elizabeth Crowley, president and CEO of BTEA, and Michael Capasso, president and CEO of CAC Industries. They discussed how insurance, among other elements, is influencing the rising costs and emphasized the need for reform in the industry. The conversation sheds light on the challenges faced by the construction sector in the city and the urgency for changes to address these financial pressures.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050272&language=en-US",
            "pub_date": "2026-02-26 20:09:26",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}