{
    "data": [
        {
            "id": 1053333,
            "title": "Barclays Bets on Blockchain to Future-Proof Its Banking Infrastructure",
            "description": "Key Takeaways Barclays is building a blockchain-based platform to modernize its core banking infrastructure – covering payments, deposits, and settlements.\nsource: https://coindoo.com/barclays-bets-on-blockchain-to-future-proof-its-banking-infrastructure/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053333&language=en-US",
            "pub_date": "2026-02-28 16:39:33",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053330,
            "title": "Trump says action ends, taking over Iranian government",
            "description": "In an eight-minute video posted on Truth Social, Trump confirmed that the United States had launched a \"major military operation\" against Iran, and told Iran, \"When this is over, we'll take over your government.\" Trump stated that Tehran's \"threatening actions directly endanger the United States, the U.S. military, overseas military bases, and allies around the world.\" He claimed that Iran was \"attempting to rebuild its nuclear program and develop long-range missiles.\" Trump also declared, \"We will destroy their missiles\" and \"completely destroy their navy.\" In his speech, Trump demanded that the Iranian Islamic Revolutionary Guard Corps \"lay down their weapons\" or \"face certain death.\" He said, \"When this is over, we'll take over your government.\" (Jin Shi)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053330&language=en-US",
            "pub_date": "2026-02-28 16:40:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053332,
            "title": "Iranian Official Indicates All Scenarios Are on the Table",
            "description": "An Iranian senior official has stated that all scenarios are currently under discussion, including those previously not considered. According to Jin10, this statement highlights the evolving nature of Iran's strategic considerations. The official did not provide specific details on the scenarios being discussed, leaving room for speculation on potential developments in the region. This announcement comes amid ongoing geopolitical tensions and could signal a shift in Iran's approach to international relations.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053332&language=en-US",
            "pub_date": "2026-02-28 16:43:38",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053331,
            "title": "GEOPOLITICS | U.S. Embassy in Jordan Implements Shelter-in-Place Measures",
            "description": "The U.S. Embassy in Jordan has initiated shelter-in-place measures for all personnel, advising American citizens to follow suit until further notice. According to Jin10, this precautionary action reflects heightened security concerns in the region. The embassy's directive underscores the importance of vigilance and preparedness amid evolving geopolitical tensions. American citizens in Jordan are urged to remain indoors and stay informed through official channels for updates on the situation.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053331&language=en-US",
            "pub_date": "2026-02-28 16:45:29",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053320,
            "title": "Altcoins Bleed Out After Trump Confirms Attacks Against Iran, BTC Down to $63K: Weekend Watch",
            "description": "KCS, STABLE, and PIPPIN are today's top losers after the latest attacks.\nsource: https://cryptopotato.com/altcoins-bleed-out-after-trump-confirms-attacks-against-iran-btc-down-to-63k-weekend-watch/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053320&language=en-US",
            "pub_date": "2026-02-28 16:28:26",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053318,
            "title": "UBS Extends CEO Sergio Ermotti's Tenure Amid Regulatory Dispute",
            "description": "UBS Group AG intends to retain Chief Executive Officer Sergio Ermotti in his role beyond April 2027. Bloomberg posted on X that this decision comes as the bank faces a standoff with Swiss authorities regarding capital regulations, which has delayed succession planning. The Swiss newspaper NZZ reported on the ongoing discussions between UBS and the regulatory bodies, highlighting the challenges in reaching an agreement on capital requirements. Ermotti's extended tenure is seen as a strategic move to maintain stability within the bank during this period of regulatory uncertainty.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053318&language=en-US",
            "pub_date": "2026-02-28 16:28:58",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053316,
            "title": "IDF Spokesperson: Another round of missiles launched toward central Israel",
            "description": "An Israel Defense Forces spokesman said on the 28th that a new round of missiles had been launched towards Israel. He urged Israelis to remain in safe zones. Air raid sirens sounded in parts of central Israel and the West Bank. (Jinshi)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053316&language=en-US",
            "pub_date": "2026-02-28 16:34:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053317,
            "title": "GEOPOLITICS | Iran's Chabahar City Reportedly Attacked by Israel",
            "description": "Iran's Chabahar city, located along the Persian Gulf coast, has reportedly been attacked by Israel. According to Jin10, the incident was reported by Iran's Mehr News Agency. Details about the attack and its implications remain limited at this time.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053317&language=en-US",
            "pub_date": "2026-02-28 16:35:42",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053312,
            "title": "Credit One Settles for Over $10 Million in Debt Collection Harassment Case",
            "description": "Credit One, a U.S. bank managing nearly $2 billion in assets, has agreed to a settlement exceeding $10 million to resolve allegations of customer harassment through excessive debt collection calls. According to NS3.AI, the settlement follows a civil lawsuit filed by multiple district attorneys in California, accusing the bank of permitting its agents to contact customers up to 10 times a day, thereby breaching state consumer protection laws. The agreement includes $9 million in penalties and $1.2 million allocated for investigative costs. Despite the settlement, Credit One denies any wrongdoing.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053312&language=en-US",
            "pub_date": "2026-02-28 16:19:44",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053313,
            "title": "ZachXBT Axiom Exposé Sparked 411% Polymarket Returns as an Insider Bet at 13.8% Odds",
            "description": "Key Insights: On February 26, ZachXBT published findings exposing a sophisticated insider-trading operation by Axiom employees. The blockchain investigator detailed how employees allegedly exploited internal tools to track private wallet activity and profit from privileged information. ZachXBT was retained to investigate allegations of misconduct at Axiom following reports that employees had accessed sensitive user data. […] The post ZachXBT Axiom Exposé Sparked 411% Polymarket Returns as an Insider Bet at 13\nsource: https://www.thecoinrepublic.com/2026/02/28/zachxbt-axiom-expose-sparked-411-polymarket-returns-as-an-insider-bet-at-13-8-odds/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053313&language=en-US",
            "pub_date": "2026-02-28 16:20:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053311,
            "title": "GEOPOLITICS | Reports Emerge on Death of Iranian Army Chief Amir Hatami",
            "description": "Reports have surfaced regarding the death of Iranian Army Chief Amir Hatami. According to Jin10, the news has sparked significant attention and concern within geopolitical circles. The implications of this development are yet to be fully understood, but it is expected to have an impact on regional stability and military dynamics. Further details are awaited as the situation unfolds.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053311&language=en-US",
            "pub_date": "2026-02-28 16:23:45",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053300,
            "title": "SBI to launch Japan’s first trust bank yen stablecoin in Q2 2026",
            "description": "SBI Holdings plans to launch the JPYSC yen stablecoin as Japan’s first trust bank-issued token in Q2 2026. The coin will be issued by SBI Shinsei Trust Bank under domestic rules.\nsource: https://coinpaprika.com/news/sbi-launch-japans-first-trust-bank-yen-stablecoin-q2-2026",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053300&language=en-US",
            "pub_date": "2026-02-28 16:10:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053297,
            "title": "BitMart's \"BM Discover\" section launches Freedom of Money",
            "description": "BitMart's \"BM Discover\" section launched Freedom of Money (FOM) on February 28th at 16:00 (UTC+8), and the FOM/USDT trading pair was opened at this launch.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053297&language=en-US",
            "pub_date": "2026-02-28 16:12:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053299,
            "title": "GEOPOLITICS | Iranian Port City Bushehr Attacked Amid Uncertainty Over Nuclear Plant Damage",
            "description": "Iran's state media has reported an attack on the port city of Bushehr. According to Jin10, it remains unclear whether the Bushehr nuclear power plant has sustained any damage. The situation is developing, and further details are awaited to assess the impact of the attack on the region's infrastructure and security.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053299&language=en-US",
            "pub_date": "2026-02-28 16:12:10",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053296,
            "title": "Iran has launched its first batch of ballistic missiles at Israel, reportedly a total of 30 missiles.",
            "description": "Market news: Iran has launched its first batch of ballistic missiles at Israel, reportedly a total of 30 missiles. Israeli mobile phone users received alerts that missile launches had been detected. The Israeli military stated that its defense systems are operational to intercept the threat. (Jinshi)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053296&language=en-US",
            "pub_date": "2026-02-28 16:14:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053288,
            "title": "On Polymarket, the probability of the \"whether the US will strike Iran\" event has risen to 100%, and the process has begun.",
            "description": "The probability of a US strike on Iran has risen to 100% on the Polymarket forecasting market and is now in the settlement process.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053288&language=en-US",
            "pub_date": "2026-02-28 15:58:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053291,
            "title": "Morgan Stanley Applies for National Trust Charter to Hold Clients’ Crypto",
            "description": "Morgan Stanley applied for a national trust charter to custody crypto and provide trading and staking services.\nsource: https://cryptonews.com/news/morgan-stanley-applies-for-national-trust-charter-to-hold-clients-crypto/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053291&language=en-US",
            "pub_date": "2026-02-28 15:59:37",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053290,
            "title": "OpenAI, Paradigm Launch AI Tool to Test Smart Contract Security",
            "description": "OpenAI and Paradigm unveiled EVMbench, an AI benchmarking tool to detect and patch smart contract vulnerabilities, aiming to prevent costly DeFi exploits.\nsource: https://catenaa.com/industries/technology/openai-paradigm-launch-ai-tool-to-test-smart-contract-security/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053290&language=en-US",
            "pub_date": "2026-02-28 16:00:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053289,
            "title": "Iranian News Agency Website Briefly Disrupted by Cyber Attack",
            "description": "On February 28, the Iranian Islamic Republic News Agency reported that its website experienced a brief outage due to a hacker attack. According to Jin10, the issue was resolved quickly, and the website has returned to normal operation.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053289&language=en-US",
            "pub_date": "2026-02-28 16:02:49",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053282,
            "title": "Zack Polanski Leads Party to Major Electoral Victory",
            "description": "Zack Polanski, who transitioned from being an influencer to a political leader in the UK, has achieved a significant milestone. Bloomberg posted on X, highlighting that his party secured its first major electoral victory since he assumed leadership in September. This win marks a pivotal moment in Polanski's political career, showcasing his influence and leadership capabilities.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053282&language=en-US",
            "pub_date": "2026-02-28 15:47:34",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}