{
    "data": [
        {
            "id": 1054390,
            "title": "GEOPOLITICS | UK Defense Minister Reports Missile Threats Near British Troops in Cyprus",
            "description": "The UK Defense Minister has reported that two missiles were launched towards Cyprus, where thousands of British troops are stationed. According to Jin10, in Bahrain, missiles and Iranian drones landed just a few hundred meters away from British forces. The incidents highlight ongoing geopolitical tensions in the region.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054390&language=en-US",
            "pub_date": "2026-03-01 17:38:29",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054389,
            "title": "Antelope Enterprise Holdings Initiates Digital Asset Strategy with Bitcoin Purchase",
            "description": "Antelope Enterprise Holdings Limited, a Nasdaq-listed company, has announced the launch of its digital asset allocation initiative, the 'Genius Plan.' According to Odaily, the company has completed its first purchase of $1 million in Bitcoin. The plan involves a phased approach to building a structured portfolio, aiming to establish a Bitcoin allocation and capital circulation framework. This strategy seeks to capitalize on market downturns and investor fear, exploring a new model of synergy between Wall Street capital and the digital asset ecosystem.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054389&language=en-US",
            "pub_date": "2026-03-01 17:40:01",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054388,
            "title": "Analysts: Increased geopolitical risks could push New York silver futures back above $100.",
            "description": "Hareesh V, head of commodities research at Geojit Investments, said escalating geopolitical risks could trigger a buying frenzy in precious metals, potentially pushing New York silver futures back above $100 per ounce. Furthermore, the analyst stated that while the possibility of global gold prices reaching $6,000 in extreme scenarios cannot be ruled out, its trajectory will largely depend on how the conflict evolves. In the short term, increased market volatility and risk aversion are likely to continue supporting gold prices. Jigar Trivedi, senior research analyst at IndusInd Securities, believes that the unprecedented strikes by the US and Israel against Iran have exacerbated tensions in the Middle East and raised concerns about potential disruptions to global energy supplies, potentially providing new upward momentum for New York gold futures driven by safe-haven buying. Since the beginning of the year, ongoing geopolitical tensions have supported prices. Gold closed higher last Friday, and the precious metals market is likely to gap up again on Monday. (Jinshi)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054388&language=en-US",
            "pub_date": "2026-03-01 17:37:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054387,
            "title": "CITIC Securities: The situation in Iran is still changing rapidly, and it is unlikely that a final scenario can be predicted and interpreted in one go.",
            "description": "A research report from CITIC Securities stated that on February 28th local time, the situation in Iran entered a phase of military conflict. The situation in Iran is still rapidly changing, and CITIC Securities anticipates that it is difficult to predict and interpret the final scenario in one go. It is more likely that the situation will continue to fluctuate based on important signals. CITIC Securities believes that whether there are potential changes in three key signals—US military mobilization, changes in the Iranian political situation, and the scope of the conflict's spillover—will determine whether the global market impact will be an amplified version of the \"12-Day War\" in June 2025, or a more extreme scenario. To provide a reference for the potential market impact, CITIC Securities reviewed the market impact of eight major conflicts in the Middle East since 1970, summarizing the following patterns: gold is a better safe-haven asset than the US dollar; oil prices still depend on supply and demand in the long term; US stock market performance is directly related to the degree of US military intervention and the course of the war; and there is no significant impact on Chinese assets. (Jinshi)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054387&language=en-US",
            "pub_date": "2026-03-01 17:39:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054381,
            "title": "Hong Kong Police Report Rise in Online Shopping Scams in 2025",
            "description": "Hong Kong police have reported a significant increase in online shopping scams in 2025, with a total of 12,505 cases, marking an 8.2% rise compared to 2024. According to Odaily, the largest single loss in these scams involved cryptocurrency transactions. The victim joined a cryptocurrency trading group on Telegram, where a member impersonated Bittwatt (BWT) customer service and requested a 'verification code' for group entry. Subsequently, the scammer transferred all virtual assets from the victim's cryptocurrency wallet linked to Telegram, resulting in a loss exceeding HKD 3.7 million. Police advise contacting customer service through official channels when shopping online, verifying the authenticity of any transaction before payment, and carefully checking payment details. They also warn against clicking on unknown or suspicious links.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054381&language=en-US",
            "pub_date": "2026-03-01 17:27:03",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054378,
            "title": "US-listed company AEHL launched its \"Genius Program\" for digital asset allocation and completed its first $1 million BTC purchase.",
            "description": "Nasdaq-listed Antelope Enterprise Holdings Limited (AEHL) announced the official launch of its digital asset allocation \"Genius Plan\" and the completion of its first $1 million BTC purchase. The plan will employ a phased approach to gradually build a structured portfolio system, aiming to establish a framework for Bitcoin allocation and capital circulation. It seeks to buy on dips during market downturns and when investor sentiment rapidly shifts to fear, exploring a new model of crypto-equity linkage between Wall Street capital and the digital asset ecosystem. (Globenewswire)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054378&language=en-US",
            "pub_date": "2026-03-01 17:29:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054380,
            "title": "Binance Market Update (March 1, 2026)",
            "description": "The global cryptocurrency market cap now stands at $2.3T, down by 4.35% over the last day, according to CoinMarketCap data.Bitcoin (BTC) has been trading between $63,453 and $68,200 over the past 24 hours. As of 09:30 AM (UTC) today, BTC is trading at $66,629, up by 4.43%.Most major cryptocurrencies by market cap are trading mixed. Market outperformers include FIO, DENT, and COS, up by 48%, 44%, and 25%, respectively.Top stories of the day:Iran Confirms Supreme Leader Khamenei Is Dead after US, Israeli Attacks Guterres: Iran Bombing and Reprisals Pose “Grave Threat” to Global Peace U.S. Military Utilizes AI Technology in Middle East Strikes Amid New Ban  GEOPOLITICS | Polymarket Launches Contracts Amid U.S.-Iran Tensions Bubblemaps Flags 6 Polymarket Wallets That Profited $1.2M Betting on Feb. 28 U.S. Strike on Iran Iran's Cryptocurrency Ecosystem Projected to Reach $7.78 Billion by 2025 Cryptocurrency Market Rebounds Amid Geopolitical Tensions Bitcoin Spot ETFs Record Weekly Net Inflows of $787 Million, BlackRock's IBIT Leads with $503 Million InflowsVitalik Buterin Highlights AI's Role in Accelerating Ethereum DevelopmentMichael Saylor Announces Increase in STRC Deferred Dividend Rate Market movers: ETH: $1991.35 (+7.23%)BNB: $622.3 (+4.86%)XRP: $1.3846 (+7.91%)SOL: $85.54 (+8.94%)TRX: $0.2814 (+0.57%)DOGE: $0.09415 (+5.97%)WLFI: $0.111 (+3.93%)U: $1 (-0.01%)ADA: $0.2806 (+7.22%)BCH: $448.8 (+0.88%)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054380&language=en-US",
            "pub_date": "2026-03-01 17:30:05",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054377,
            "title": "SUI Group Financial Report: SUI holdings exceeded 108 million units and completed a buyback of 8.8% of issued common stock.",
            "description": "Nasdaq-listed Sui Group Holdings released its full-year 2025 operating results, disclosing a net loss of $221.8 million in Q4. As of February 23, its SUI token holdings increased to 108,368,594, almost all of which were staked for approximately 5,000 SUI tokens per day. The company also disclosed that it had completed the repurchase of 7,801,042 common shares under a previously approved $50 million share repurchase program, representing 8.80% of its outstanding common stock. (Businesswire)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054377&language=en-US",
            "pub_date": "2026-03-01 17:34:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054376,
            "title": "GEOPOLITICS | Iran's Vice President Orders Uninterrupted Wartime Administration",
            "description": "Iran's Vice President Arif has instructed ministers and provincial governors to ensure the continuity of administrative operations during wartime. According to Jin10, this directive aims to maintain governmental functions without disruption in the event of conflict. The order underscores the importance of preparedness and resilience in Iran's administrative framework amid geopolitical tensions.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054376&language=en-US",
            "pub_date": "2026-03-01 17:15:24",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054374,
            "title": "Hong Kong police reported 12,505 online shopping fraud cases in 2025, with the largest single loss involving cryptocurrency exceeding HK$3.7 million.",
            "description": "Hong Kong police announced that they received 12,505 reports of online shopping scams in 2025, an 8.2% increase from 2024. The largest single online shopping scam involving losses that year involved cryptocurrency transactions. A victim joined a Telegram cryptocurrency trading group and received a private message from a member impersonating Bittwatt (BWT) customer service, requesting a \"verification code\" for group entry. The scammer then transferred all virtual assets from the victim's Telegram-connected cryptocurrency wallet, resulting in a total loss of over HK$3.7 million. Police remind the public to contact customer service through official channels when shopping online. Regardless of the form of transfer, always verify the authenticity of the payment before making payment and carefully check payment details. Never click on unknown or suspicious links. (Hong Kong Commercial Daily)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054374&language=en-US",
            "pub_date": "2026-03-01 17:20:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054373,
            "title": "A whale account opened 40x leveraged long positions in BTC and 20x leveraged long positions in SOL today, but some of these positions were subsequently liquidated.",
            "description": "According to Lookonchain monitoring, a whale opened 40x leveraged long positions in BTC and 20x leveraged long positions in SOL today, which were partially liquidated. The current liquidation price for the Bitcoin long positions is $66,204.07, and the liquidation price for the SOL long positions is $81.90.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054373&language=en-US",
            "pub_date": "2026-03-01 17:22:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054375,
            "title": "Hong Kong to Validate Debenture Registers Using Distributed Ledger Technology",
            "description": "Hong Kong is preparing to release guidance that will confirm the legal validity of maintaining debenture holder registers through distributed ledger technology. According to NS3.AI, this initiative is designed to encourage electronic signing and the digitization of bearer bonds, aligning with the ongoing tokenization trends in the bond market. Experts view this development as a crucial step towards integrating digital currency with traditional finance within a compliant regulatory framework.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054375&language=en-US",
            "pub_date": "2026-03-01 17:23:04",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054370,
            "title": "PRECIOUS METALS | Guotai Junan UBS Silver Futures Fund Faces Significant Premium",
            "description": "Guotai Junan UBS Fund Management Co. Ltd. has announced that its Guotai Junan UBS Silver Futures Securities Investment Fund (LOF) A-class shares are trading at a significant premium over their net asset value. According to Jin10, to protect investor interests, the fund will suspend trading from the market opening until 10:30 on February 27, 2026, resuming at 10:30 the same day. Redemption services will continue as usual during the suspension. If the premium does not decrease effectively by March 2, 2026, the fund reserves the right to apply to the Shenzhen Stock Exchange for temporary intraday suspension or to extend the suspension period.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054370&language=en-US",
            "pub_date": "2026-03-01 17:05:18",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054369,
            "title": "Middle East Flight Cancellations Impact Hong Kong Travel Groups",
            "description": "Flights between Hong Kong and various Middle Eastern destinations have been canceled due to the situation in Iran. According to RTHK, the Travel Industry Council noted that travel groups scheduled to depart or return yesterday and today are affected. While specific numbers are not yet available, the council estimates that the number of impacted travel groups is minimal, as the peak Lunar New Year travel season has just concluded.\n\nThe Travel Industry Council responded to inquiries, highlighting that Dubai and Doha airports are key transit hubs in the Middle East. The suspension of all flights will affect air traffic to and from Europe. Editor: Chan Hiu Hing",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054369&language=en-US",
            "pub_date": "2026-03-01 17:06:40",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054368,
            "title": "Iranian President: Revenge is a \"legitimate right and obligation\"",
            "description": "Iranian President Peskhziyan stated that Iran considers revenge its \"legitimate right and obligation\" and will make every effort to fulfill this obligation. (Jinshi)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054368&language=en-US",
            "pub_date": "2026-03-01 17:09:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054362,
            "title": "NEAR Announces New AI and Crypto Products at NEARCON",
            "description": "NEAR has unveiled several new AI and crypto products during the NEARCON event. According to Foresight News, NEAR co-founder Illia Polosukhin announced the launch of various innovations, including the encrypted private agent IronClaw, the AI agent hosting service agent.near.ai, and the multi-chain account near.com that supports private transactions. Additionally, NEAR plans to implement the Nightshade 3.0 upgrade, which will enable the separation of consensus and execution, privacy sharding, and private intent transactions.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054362&language=en-US",
            "pub_date": "2026-03-01 16:58:09",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054361,
            "title": "Oil Tanker Attacked Near Strait of Hormuz Amid Middle East Conflict",
            "description": "Oman reported that a small oil tanker was attacked off its coast, marking the first indication of an assault on shipping in the vicinity of the Strait of Hormuz during the ongoing Middle East conflict. Bloomberg posted on X, highlighting the strategic importance of the Strait of Hormuz, a critical chokepoint for global oil transportation. The incident underscores the heightened tensions in the region, which could have significant implications for international oil markets. Authorities are investigating the attack, and further details are awaited to assess the impact on shipping and regional stability.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054361&language=en-US",
            "pub_date": "2026-03-01 16:58:33",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054360,
            "title": "WHO Chief Reflects on Measles and Child Mortality",
            "description": "World Health Organization chief Tedros Adhanom Ghebreyesus expressed his thoughts on the preventable nature of measles-related deaths, reflecting on the loss of his younger brother. Bloomberg posted on X, highlighting Tedros's statement that it is unacceptable for children to continue dying from measles in the present day. Tedros shared these reflections during an interview, emphasizing the advancements in technology and healthcare that could prevent such tragedies. His comments underscore the ongoing challenges in global health efforts to eradicate measles and protect vulnerable populations.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054360&language=en-US",
            "pub_date": "2026-03-01 17:00:38",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054358,
            "title": "21st Century Business Herald: Hong Kong will provide guidelines to clarify whether the register of bondholders can be maintained using a distributed ledger.",
            "description": "To facilitate the use of tokenization technology in the bond market, Hong Kong plans to provide guidelines clarifying that a distributed ledger can be used to maintain a register of bondholders, and to explore electronic signatures for issuance documents and promote the digitalization of bearer bonds. Zeng Gang, chief expert and director of the Shanghai Financial and Development Laboratory, believes this is a key institutional breakthrough for Hong Kong in promoting the deep integration of digital currency and traditional finance. After the Hong Kong government provides these guidelines, the registration records of the distributed ledger will gain clear legal effect, effectively bridging the language gap between traditional financial infrastructure and digital asset protocol layers, allowing institutions to confidently deploy related technologies within a compliant framework. (21st Century Business Herald)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054358&language=en-US",
            "pub_date": "2026-03-01 17:01:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054354,
            "title": "Israeli military claims first strikes against targets in central Iranian capital.",
            "description": "The Israel Defense Forces (IDF) announced on March 1 that it had conducted its first strikes against Iranian regime targets in central Tehran. Several loud explosions were heard in Tehran, and plumes of smoke were seen rising. The IDF stated that the Israeli Air Force, guided by intelligence, had begun strikes against Iranian regime targets in Tehran. This marks the first time the IDF has struck targets in central Tehran during its current military operation against Iran. (Xinhua)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054354&language=en-US",
            "pub_date": "2026-03-01 16:46:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}