{
    "data": [
        {
            "id": 734578,
            "title": "Bitcoin Enters Second Bull Market Phase, Analyst Suggests",
            "description": "According to Odaily, cryptocurrency analyst PlanB has indicated that nearly a year after the Bitcoin halving event, the S2F model shows a transition from a red dot to an orange one, eventually turning yellow. This shift signifies the market's entry into the second phase of a bull market, characterized by a significant surge driven by fear of missing out (FOMO).",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734578&language=en-US",
            "pub_date": "2025-02-05 23:03:40",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734574,
            "title": "About 1.729 million $UNI were transferred from Binance to Galaxy Digital’s marked address",
            "description": "Odaily Planet Daily News: On-chain data shows that approximately 1,729,686.46 $UNI were transferred from Binance to the Galaxy Digital OTC mark address, worth approximately US$16,103,380.94. The relevant wallet currently holds approximately 7.1 million $UNI, worth approximately US$66.5 million.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734574&language=en-US",
            "pub_date": "2025-02-05 23:05:29",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734577,
            "title": "Bitcoin(BTC) Drops Below 98,000 USDT with a 1.84% Decrease in 24 Hours",
            "description": "On Feb 05, 2025, 15:05 PM(UTC). According to Binance Market Data, Bitcoin has dropped below 98,000 USDT and is now trading at 97,908.140625 USDT, with a narrowed 1.84% decrease in 24 hours.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734577&language=en-US",
            "pub_date": "2025-02-05 23:05:45",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734573,
            "title": "Tether unveils second Satoshi statue at Plan ₿ forum in El Salvador",
            "description": "Odaily Planet Daily News According to official news, Plan ₿ is an initiative established in cooperation with Tether to promote the use of Bitcoin and blockchain technology. The initiative ended in El Salvador from January 30 to 31, 2025. Following the unveiling of the first Satoshi Nakamoto statue in Lugano, Switzerland, the first Plan ₿ forum held in El Salvador also unveiled the second Satoshi Nakamoto statue.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734573&language=en-US",
            "pub_date": "2025-02-05 23:08:30",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734567,
            "title": "1,239,940,928,235 SHIBs transferred out from Kraken, worth over $20 million",
            "description": "Odaily Planet Daily reported that according to Whale Alert monitoring, 1,239,940,928,235 SHIBs were transferred out from Kraken, worth US$20,136,020.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734567&language=en-US",
            "pub_date": "2025-02-05 22:53:35",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734566,
            "title": "1,155,431 #TRUMP transferred out of Kraken, worth over $23 million",
            "description": "Odaily Planet Daily News According to Whale Alert monitoring, 1,155,431 #TRUMP were transferred out of the cryptocurrency exchange Kraken, worth US$23,166,972.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734566&language=en-US",
            "pub_date": "2025-02-05 22:55:25",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734565,
            "title": "A whale withdrew 326,000 $UNI from Binance 5 minutes ago, worth $3.05 million",
            "description": "Odaily Planet Daily News: According to monitoring by on-chain analyst Yu Jin, a whale withdrew 326,000 $UNI from Binance 5 minutes ago, worth 3.05 million US dollars. He has accumulated a total of 1.183 million UNI (about 11.31 million US dollars) in the past two days, with an average price of 9.55 US dollars.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734565&language=en-US",
            "pub_date": "2025-02-05 22:56:43",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734564,
            "title": "PlanB: S2F model shows Bitcoin entering a FOMO phase of sharp rise",
            "description": "Odaily Planet Daily News: Crypto analyst PlanB said that nearly a year after the halving, the red dot of Bitcoin on the S2F model turned orange (and then yellow), which means that the market has entered the second stage of the bull market, the FOMO stage of a sharp rise.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734564&language=en-US",
            "pub_date": "2025-02-05 22:59:29",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734557,
            "title": "CoinDesk 20 Index Sees Modest Gains Amid Mixed Asset Performance",
            "description": "According to CoinDesk, the CoinDesk 20 Index experienced a slight increase in its latest market update, reflecting a 0.2% rise to 3310.92 points as of 4 p.m. ET on Tuesday. This performance highlights the mixed results among the assets within the index, with fourteen out of twenty assets showing positive movement.\n\nAmong the top performers, AAVE led the gains with a notable increase of 6.9%, followed by Litecoin (LTC), which rose by 3.7%. These assets contributed significantly to the overall upward trend of the index. However, not all assets shared in the positive momentum. XRP and SUI both experienced declines, each falling by 1.2%, marking them as the laggards in this trading session.\n\nThe CoinDesk 20 Index is a comprehensive benchmark that tracks the performance of twenty leading digital assets. It is traded across various platforms and regions worldwide, providing a broad perspective on the cryptocurrency market's movements. This index serves as a key indicator for investors and analysts monitoring the digital asset space, offering insights into the market's current trends and dynamics.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734557&language=en-US",
            "pub_date": "2025-02-05 22:43:49",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734556,
            "title": "Bitcoin Rebounds Above 99000 USDT",
            "description": "According to Odaily, Bitcoin has experienced a rebound, surpassing the 99000 USDT mark. Currently, it is trading at 99025.3 USDT. The 24-hour decline has narrowed to 1.07%.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734556&language=en-US",
            "pub_date": "2025-02-05 22:44:03",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}