{
    "data": [
        {
            "id": 1051884,
            "title": "Bitcoin(BTC) Drops Below 67,000 USDT with a 2.42% Decrease in 24 Hours",
            "description": "On Feb 27, 2026, 10:12 AM(UTC). According to Binance Market Data, Bitcoin has dropped below 67,000 USDT and is now trading at 66,954.59375 USDT, with a narrowed 2.42% decrease in 24 hours.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051884&language=en-US",
            "pub_date": "2026-02-27 18:12:08",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051885,
            "title": "BNB Drops Below 620 USDT with a 1.49% Decrease in 24 Hours",
            "description": "On Feb 27, 2026, 10:12 AM(UTC). According to Binance Market Data, BNB has dropped below 620 USDT and is now trading at 619.840027 USDT, with a narrowed 1.49% decrease in 24 hours.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051885&language=en-US",
            "pub_date": "2026-02-27 18:12:08",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051883,
            "title": "Britain's Flood Insurance Strategy Shifts Towards Capital Markets",
            "description": "Britain's flood insurance program is set to increasingly depend on capital markets to manage flood-related losses. Bloomberg posted on X, highlighting the country's strategic move to bolster its financial resilience against natural disasters. This shift aims to enhance the capacity to handle potential claims arising from severe flooding events, ensuring a robust financial framework. The initiative reflects a broader trend of integrating capital market solutions into traditional insurance models, providing a diversified approach to risk management. As climate change continues to pose significant challenges, this strategy underscores the importance of innovative financial mechanisms in safeguarding against environmental risks.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051883&language=en-US",
            "pub_date": "2026-02-27 18:13:15",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051882,
            "title": "Nvidia's Strong Quarter Highlights AI Infrastructure Spending",
            "description": "Nvidia has reported an impressive quarter, achieving $68.1 billion in revenue, driven by significant growth in its Data Center segment. According to NS3.AI, this performance underscores the ongoing narrative of increased spending on AI infrastructure. Bitcoin's price is currently mirroring the sentiment in the tech sector, functioning as a leveraged proxy for risk appetite linked to AI-related optimism or concerns. Upcoming reports on AI regulation and safety, especially from Anthropic, have the potential to introduce volatility, affecting both technology stocks and Bitcoin in various ways.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051882&language=en-US",
            "pub_date": "2026-02-27 18:13:20",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051854,
            "title": "Poland Emerges as Top Beneficiary of EU's SAFE Funding",
            "description": "Poland has become the largest recipient of the European Union's SAFE funding, aimed at supporting economic recovery across member states. Bloomberg posted on X, highlighting Poland's significant allocation from the fund, which is designed to bolster economies in the wake of recent challenges. The funding is part of the EU's broader strategy to ensure stability and growth within the region, providing financial assistance to countries most in need. Poland's allocation underscores its critical role in the EU's economic landscape, as the country continues to navigate the complexities of the current economic environment. This development is expected to have a positive impact on Poland's economic recovery efforts, contributing to the overall resilience of the EU's economy.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051854&language=en-US",
            "pub_date": "2026-02-27 17:58:51",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051853,
            "title": "Michael Pollan Explores Consciousness in New Book",
            "description": "Michael Pollan's latest book delves into the enigmatic realm of consciousness, offering readers an engaging exploration of what it means to be a bat, a plant, or even oneself. Bloomberg posted on X, highlighting the book's unique approach to unraveling the mysteries of consciousness. Pollan's work transforms this complex subject into an unexpectedly joyful journey, inviting readers to ponder the nature of awareness and existence. Through his insightful narrative, Pollan encourages a deeper understanding of consciousness, making it accessible and intriguing for a broad audience.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051853&language=en-US",
            "pub_date": "2026-02-27 18:00:47",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051852,
            "title": "Japan Reports Zero Forex Intervention in Early 2023",
            "description": "Japan's Ministry of Finance has announced that the country's foreign exchange intervention amount was zero yen from January 29 to February 25, 2023. According to Jin10, this period saw no active measures taken by Japan to influence its currency's value in the forex market. The report highlights Japan's current stance on foreign exchange activities, indicating a lack of intervention during this timeframe. This announcement comes amid ongoing global economic fluctuations and currency market dynamics.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051852&language=en-US",
            "pub_date": "2026-02-27 18:01:20",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051851,
            "title": "Berkshire Hathaway's PacifiCorp Faces Legal Challenges Over 2020 Oregon Wildfires",
            "description": "Berkshire Hathaway's utility company, PacifiCorp, is facing significant legal challenges due to the extensive damage caused by the 2020 wildfires in Oregon. Bloomberg posted on X that the company has been actively pursuing legislative measures across various western states to redistribute the financial burden of wildfire damages. This move comes as PacifiCorp seeks to mitigate the financial impact of the court rulings against it. The legal battles highlight the ongoing struggle between utility companies and the increasing frequency and severity of wildfires in the region.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051851&language=en-US",
            "pub_date": "2026-02-27 18:02:45",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051850,
            "title": "Cryptocurrency stocks were mixed in pre-market trading in the US, with BMNR rising 1.13%.",
            "description": "According to data from msx.com, pre-market performance of crypto stocks in the US market was mixed. BMNR rose 1.13%, SBET fell 0.28%, MSTR rose 0.67%, CRCL rose 0.06%, and COIN fell 0.03%. msx.com is a decentralized RWA trading platform that has listed hundreds of RWA tokens, covering US stock and ETF tokens such as AAPL, AMZN, GOOGL, META, MSFT, NFLX, and NVDA.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051850&language=en-US",
            "pub_date": "2026-02-27 17:50:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051849,
            "title": "Matrixport deposited 750 BTC worth $50.89 million into Binance.",
            "description": "According to Onchain Lens, Matrixport deposited 750 BTC worth $50.89 million into Binance.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051849&language=en-US",
            "pub_date": "2026-02-27 17:52:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051848,
            "title": "Figure Reports Significant Financial Growth in 2025",
            "description": "Figure, a blockchain capital markets company, released its financial report for the fourth quarter and full year of 2025. According to BlockBeats, the company saw a substantial increase in its consumer loan market transactions, reaching $2.7 billion in the fourth quarter, marking a 131% rise compared to the same period last year. Net income for the quarter grew by 91% year-over-year, with adjusted net income increasing by 106% to $158 million. Net profit surged by 156% to $15 million.\n\nFor the entire year of 2025, Figure's net profit rose by 574% to $134 million, while net income increased by 49% to $507 million. The consumer loan market transactions for the year totaled $8.4 billion, reflecting a 63% growth.\n\nAdditionally, Figure's board has authorized a stock repurchase program, allowing the company to buy back up to $200 million of Class A common stock and blockchain common stock over the next 12 months.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051848&language=en-US",
            "pub_date": "2026-02-27 17:46:41",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051847,
            "title": "Sui Group Holdings Reports 2025 Financial Performance with Significant Losses",
            "description": "Sui Group Holdings, a Nasdaq-listed company, has released its full-year operational performance report for 2025. According to Foresight News, the report reveals a net loss of $221.8 million in the fourth quarter of the previous year. As of February 23, the company increased its holdings of SUI tokens to 108,368,594, with nearly all tokens staked, generating an average daily yield of approximately 5,000 SUI.\n\nAdditionally, the company disclosed the completion of a stock repurchase plan, previously approved for $50 million, resulting in the buyback of 7,801,042 shares of common stock. This accounts for 8.8% of the issued common stock.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051847&language=en-US",
            "pub_date": "2026-02-27 17:46:52",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051846,
            "title": "Wizz Air Shares Decline Following Indigo Partners' Share Offering",
            "description": "Shares of Wizz Air experienced a significant drop of up to 10% on Friday. Bloomberg posted on X that this decline followed an offering by Indigo Partners' investment funds, which proposed approximately 10 million shares at a price of £12.50 each. The move by Indigo Partners, a major stakeholder in the airline, has impacted investor sentiment, leading to the notable decrease in share value. The offering price was set below the current market value, contributing to the downward pressure on the stock. This development comes amid a challenging period for the airline industry, which is navigating various economic pressures.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051846&language=en-US",
            "pub_date": "2026-02-27 17:51:27",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051845,
            "title": "GEOPOLITICS | U.S. Embassy Urges Immediate Departure from Israel Amid High Flight Demand",
            "description": "The U.S. Embassy in Israel has issued an urgent advisory for individuals wishing to leave the country, emphasizing the need to act promptly due to anticipated high demand for flights at Ben Gurion Airport. According to Jin10, the advisory was communicated via email approximately one hour ago, urging immediate action to secure departure. The embassy highlighted the potential challenges in securing flights, underscoring the importance of swift action.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051845&language=en-US",
            "pub_date": "2026-02-27 17:51:32",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051842,
            "title": "STOCKS | India's NIFTY 50 Index Continues Decline with 1.1% Drop",
            "description": "India's NIFTY 50 index has extended its downward trend, experiencing a 1.1% decrease. According to Jin10, this decline reflects ongoing market volatility and investor concerns. The NIFTY 50, a benchmark index for the Indian stock market, has been under pressure due to various economic factors and global market conditions. Analysts are closely monitoring the situation to assess potential impacts on the broader financial landscape.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051842&language=en-US",
            "pub_date": "2026-02-27 17:35:11",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051841,
            "title": "Hungary and Slovakia Plan Inspection of Druzhba Oil Pipeline in Ukraine",
            "description": "Hungary and Slovakia are coordinating efforts to dispatch a team of inspectors to Ukraine to assess the state of the Druzhba oil pipeline. Bloomberg posted on X that the initiative aims to ensure the pipeline's operational integrity and address any potential concerns. The Druzhba pipeline is a crucial conduit for oil supplies to Central Europe, and its maintenance is vital for energy security in the region. The inspection comes amid ongoing geopolitical tensions, highlighting the importance of infrastructure reliability. Both countries are keen to ensure that the pipeline remains functional and secure, reflecting their commitment to regional energy stability.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051841&language=en-US",
            "pub_date": "2026-02-27 17:37:10",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051840,
            "title": "Bitcoin's Market Cap Approaches Samsung's Amid Diverging Trends",
            "description": "Bitcoin's market capitalization is currently around $1.358 trillion, according to NS3.AI. This positions it closer to Samsung Electronics, which has seen its market value rise to approximately $1.005 trillion. Bitcoin, which reached a peak market cap of $2.1 trillion in mid-2023, has undergone a correction this year. In contrast, Samsung's stock has climbed significantly, driven by rising memory semiconductor prices. This situation highlights the differing market trajectories of a prominent cryptocurrency and a leading technology firm.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051840&language=en-US",
            "pub_date": "2026-02-27 17:37:20",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051844,
            "title": "Figure released its Q4 and full-year 2025 financial results: net profit increased by 574% to $134 million in 2025.",
            "description": "Blockchain capital markets company Figure announced its financial results for the fourth quarter and full year of 2025. In the fourth quarter of 2025, the consumer lending market saw transaction volume reach $2.7 billion, a 131% increase year-over-year. Net income increased by 91% year-over-year. Adjusted net income was $158 million, a 106% increase compared to the fourth quarter of 2024. Net income increased by 156% year-over-year to $15 million. For the full year of 2025, the company's net income increased by 574% year-over-year to $134 million, and net income increased by 49% year-over-year to $507 million. Its consumer lending market transaction volume for the full year was $8.4 billion, a 63% year-over-year increase. In addition, Figure's board of directors has authorized a share repurchase program, allowing the company to repurchase up to $200 million of its Class A common stock and blockchain common stock over the next 12 months.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051844&language=en-US",
            "pub_date": "2026-02-27 17:43:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051839,
            "title": "US fintech startup Dots raises $8.9 million in Series A funding, with Y Combinator participating.",
            "description": "US fintech startup Dots has raised $8.9 million in Series A funding, led by DCM with participation from Y Combinator, bringing its total funding to over $14.8 million. Dots is building a payments layer for modern platforms, processing over $150 million in payments monthly and having transferred over $1.5 billion to over 1 million gig workers, creators, and contractors worldwide. The company reported revenue growth of over 400% last year and aims to achieve profitability by 2025. Dots has launched several new features, including a self-service payment system with tax filing capabilities, support for cryptocurrency payments in USDC, USDT, Bitcoin, and Ethereum, fraud prevention tools, global invoice processing, and a new $19/month pricing tier called Dots Core. The company currently serves clients such as Appen, Sofar Sounds, and Cluely, aiming to streamline cross-border payment processes for businesses and individuals. (Tech in Asia)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051839&language=en-US",
            "pub_date": "2026-02-27 17:33:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051837,
            "title": "China's Central Bank Introduces New Rules for Cross-Border Yuan Funding",
            "description": "China's central bank has unveiled new regulations aimed at enhancing cross-border yuan funding between domestic and international financial institutions. Bloomberg posted on X, highlighting the significance of these rules in promoting the yuan's global use and facilitating smoother financial transactions. The initiative is part of China's broader strategy to internationalize its currency and strengthen its position in global markets. The new rules are expected to streamline processes and reduce barriers for financial institutions engaging in cross-border activities, thereby fostering increased economic collaboration.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051837&language=en-US",
            "pub_date": "2026-02-27 17:25:10",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}