{
    "data": [
        {
            "id": 1050200,
            "title": "Indian Regulators Intensify Scrutiny on Equity Options Market",
            "description": "Indian regulators are intensifying their scrutiny of the country's extensive equity options market amid concerns that small investors are incurring significant losses to advanced trading firms. Bloomberg posted on X, highlighting the regulatory efforts aimed at curbing market abuses. The crackdown is part of a broader initiative to protect retail investors and ensure market integrity. Authorities are focusing on identifying and addressing manipulative practices that may disadvantage less experienced participants. The effectiveness of these measures remains under evaluation as regulators continue to monitor the market closely.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050200&language=en-US",
            "pub_date": "2026-02-26 19:22:11",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050199,
            "title": "Argentex Faces Potential Shortfall on £35 Million Loan from IFX",
            "description": "Argentex is anticipated to experience a shortfall on its £35 million loan from IFX. Bloomberg posted on X, highlighting concerns over the financial implications for both parties involved. The situation underscores the challenges faced by companies in managing large-scale financial transactions and the potential risks associated with such loans. As the financial landscape continues to evolve, stakeholders are closely monitoring developments to assess the impact on future business operations.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050199&language=en-US",
            "pub_date": "2026-02-26 19:22:59",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050198,
            "title": "Bitcoin's MVRV Z-Score Indicates Strong Bearish Trend",
            "description": "On February 26, cryptocurrency market analyst Axel shared a report on social media highlighting data from CryptoQuant. According to BlockBeats, the report reveals that Bitcoin's MVRV Z-Score is currently at -2.28, surpassing the bear market lows of 2018 (-1.6) and 2022 (-1.4), indicating a 'strong bear' zone.The MVRV Z-Score measures the deviation of market value from realized value, with negative values suggesting that market prices are below the on-chain 'fair value.' Axel attributes this anomaly to the scale of realized market value in the ETF era, where significant institutional capital inflows have raised the cost basis, making the Z-Score more sensitive to price adjustments. A rise in the Z-Score above -1.5, coupled with prices maintaining above $65,000, would be the first technical confirmation signal of exiting the pressure zone.However, the NUPL indicator, which gauges market sentiment, currently stands at 0.197, remaining in the 'hope' zone and far from the capitulation areas seen in historical cycle bottoms. During true capitulation phases, such as December 2018, March 2020, and November 2022, the NUPL would dip into negative territory, indicating net losses for most holders. The current level of 0.197 is in the middle of the historical range, still distant from the true pain zone. The data suggests that while market sentiment is weakening, it has not yet reached panic levels. Most participants are still in a position of paper profits (NUPL > 0), although confidence has noticeably shaken.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050198&language=en-US",
            "pub_date": "2026-02-26 19:23:39",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050197,
            "title": "Tether and Circle are increasing their presence in the South Korean market, possibly to address local stablecoin regulations.",
            "description": "Stablecoin issuer Tether recently posted several job openings in South Korea, including a public relations manager, a blockchain investigator, and a government relations specialist. Previously, Tether entered the South Korean market by hiring a market representative, but after that person left, the company plans to expand its South Korean team. Industry sources also revealed that Circle has been expanding its business in South Korea since its CEO visited the country last August. Reports indicate that South Korea's upcoming Digital Asset Basic Law may require overseas stablecoin issuers to establish branches in South Korea to distribute their tokens in the local market. These recent moves by related companies are seen as proactive preparations for potential regulatory requirements. (News1)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050197&language=en-US",
            "pub_date": "2026-02-26 19:24:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050178,
            "title": "U.S. Pre-Market Crypto Stocks Mixed as ABTC Jumps 7%, MSTR Edges Lower",
            "description": "Crypto-related equities in the United States showed mixed performance in pre-market trading, with several stocks posting modest gains while others declined.According to data from msx.com:ABTC rose 7.14%BMNR gained 0.70%SBET advanced 0.67%MSTR slipped 0.11%BLSH fell 0.82%TRON declined 0.76%The moves reflect cautious positioning in crypto-linked equities ahead of the US market open, as Bitcoin and broader digital asset prices remain volatile.About msx.commsx.com is described as a decentralized real-world asset (RWA) trading platform that has listed hundreds of tokenized RWA products. These reportedly include tokenized US equities and ETFs tracking companies such as Apple (AAPL), Amazon (AMZN), Alphabet (GOOGL), Meta (META), Microsoft (MSFT), Netflix (NFLX), and Nvidia (NVDA).",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050178&language=en-US",
            "pub_date": "2026-02-26 19:18:50",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050176,
            "title": "Consulting Firms Adjust Recruitment Timelines to Compete with Investment Banks",
            "description": "Consulting giants McKinsey and Bain are adjusting their recruitment timelines to better align with top-tier investment banks. Bloomberg posted on X, highlighting that these changes aim to enhance their competitiveness in attracting top talent. By moving their recruitment cycles earlier, McKinsey and Bain hope to catch up with investment banks that have already shifted their hiring processes forward. This strategic adjustment reflects the evolving landscape of recruitment in the consulting and financial sectors.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050176&language=en-US",
            "pub_date": "2026-02-26 19:19:49",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050175,
            "title": "Ronaldo Invests in Spanish Football Club UD Almería",
            "description": "Portuguese football star Cristiano Ronaldo is set to invest in UD Almería, a team currently positioned third in Spain’s second division. Bloomberg posted on X, highlighting that the investment will be facilitated through CR7 Sports Investments, Ronaldo's investment vehicle. This move marks Ronaldo's latest venture into sports investments, expanding his portfolio beyond his illustrious football career. UD Almería has been gaining attention in the league, and Ronaldo's involvement is expected to bring further visibility to the club. The investment reflects Ronaldo's ongoing interest in diversifying his business interests within the sports industry.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050175&language=en-US",
            "pub_date": "2026-02-26 19:19:54",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050174,
            "title": "Pilots Union Supports Further Action Amid Labor Dispute",
            "description": "The Vereinigung Cockpit union announced that over 90% of regional airline pilots have endorsed advancing measures in an ongoing labor dispute. Bloomberg posted on X, highlighting the union's statement regarding the strong support from its members. The union is advocating for improved working conditions and better pay, emphasizing the need for negotiations with airline management. This development follows a series of discussions aimed at addressing the pilots' concerns. The union's decision reflects growing discontent among pilots, who have been vocal about their demands for fair treatment and compensation. The next steps in the dispute are expected to involve further talks and potential actions to push for resolution.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050174&language=en-US",
            "pub_date": "2026-02-26 19:20:28",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050157,
            "title": "Hong Kong Exchange Explores Multi-Asset Tokenization Platform",
            "description": "Hong Kong Exchange CEO, Chan Yi-ting, announced the exploration of a tokenization platform designed to support diverse assets, rather than focusing solely on tokenized stocks or bonds. According to RTHK, the feasibility and timing of this initiative depend on technological support and market demand. Chan emphasized the exchange's aim for diversification across various products while acknowledging the competitive landscape. She noted the distinct requirements between traditional securities and digital asset trading, stressing careful consideration.\n\nMarket Director, Yu Xueqin, highlighted that the future direction of the Hong Kong Exchange includes a multi-asset investment product platform. This platform will encompass stock futures, fixed income, gold futures, and will advance commodity products and more individual stock options. Yu also mentioned ongoing efforts to introduce zero-day options (0DTE) as soon as possible.\n\nChief Financial Officer, Xu Lianghua, underscored the importance of investing in future products and platforms. He assured that after distributing the second interim dividend, the group retains corporate funds ranging from 20 to 30 billion HKD for investment purposes, affirming that the exchange faces no financial issues.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050157&language=en-US",
            "pub_date": "2026-02-26 19:06:13",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050156,
            "title": "GEOPOLITICS | Trump Advocates for FEMA to Withdraw from Disaster Preparedness",
            "description": "U.S. President Donald Trump has expressed his desire for the Federal Emergency Management Agency (FEMA) to cease its involvement in preparing for natural disasters. Bloomberg posted on X that his administration has quietly dismantled a program designed to assist individuals in disaster readiness. This move aligns with Trump's broader approach to reduce federal oversight and shift responsibilities to state and local governments. Critics argue that this decision could leave communities vulnerable, especially in areas prone to natural disasters. The dismantled program previously offered resources and guidance to help citizens prepare for emergencies, aiming to enhance resilience and response capabilities. Trump's stance reflects his administration's focus on decentralizing disaster management, emphasizing local autonomy over federal intervention. The implications of this policy shift are yet to be fully realized, as communities assess their preparedness in the absence of federal support.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050156&language=en-US",
            "pub_date": "2026-02-26 19:06:20",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050155,
            "title": "South Korea Proposes Legislation for Influencer Transparency in Crypto",
            "description": "South Korea's ruling party is set to introduce a new bill that mandates financial and cryptocurrency influencers to disclose their asset holdings and any paid promotions. According to NS3.AI, the legislation aims to enhance transparency in the advice shared on social media and mass media platforms. This initiative seeks to address influencer marketing practices within the cryptocurrency sector to safeguard consumers.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050155&language=en-US",
            "pub_date": "2026-02-26 19:07:09",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050154,
            "title": "Strategy's Preferred Equity Sees Increased Corporate Adoption as Price Rebounds",
            "description": "Three companies have incorporated Strategy's preferred equity, STRC, into their treasuries as its share price returns to the par value of $100. According to NS3.AI, this development occurred during the Strategy World 2026 event, underscoring a rise in corporate adoption of STRC. The price recovery indicates growing confidence and strong demand in the market for Strategy's preferred equity.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050154&language=en-US",
            "pub_date": "2026-02-26 19:08:42",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050147,
            "title": "Bitcoin Futures Premium Declines Without Reaching Backwardation",
            "description": "Bitcoin futures on the Chicago Mercantile Exchange (CME) are currently exhibiting a reduced premium, though the market has not transitioned into backwardation, a condition observed during previous market bottoms. According to NS3.AI, the prices of longer-dated futures continue to exceed spot prices, resulting in a flat futures curve. Historical patterns suggest that backwardation and a significant drop in price basis were indicators of market bottoms in 2018 and 2022. This implies that Bitcoin has not yet entered a capitulation phase.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050147&language=en-US",
            "pub_date": "2026-02-26 18:54:20",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050146,
            "title": "Ethereum's Ploutus Protocol Suffers $390,000 Loss Due to Oracle Misconfiguration",
            "description": "A liquidity pool on the Ethereum-based Ploutus protocol was attacked, resulting in a loss of approximately $390,000. According to Odaily, the incident occurred due to a misconfiguration in the oracle setup, which incorrectly linked the USDC price to Chainlink's BTC/USD feed, causing a significant price deviation. The attacker exploited this vulnerability by using only 8 USDC as collateral to borrow 187 ETH. On-chain data indicates that the attack transaction took place in the block immediately following the confirmation of the configuration change, suggesting that the attacker may have been monitoring the updates in real-time and acted swiftly to exploit the parameter update.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050146&language=en-US",
            "pub_date": "2026-02-26 18:55:36",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050145,
            "title": "Security Concerns Arise Over Smart Home Devices After Programmer's Discovery",
            "description": "A French programmer working in Spain inadvertently gained remote access to approximately 7,000 similar robotic vacuum cleaners while modifying his own device. According to Ming Pao, this incident has raised concerns about potential security risks associated with smart home products. The discovery highlights vulnerabilities in the technology that could be exploited, prompting discussions on the safety and privacy of such devices.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050145&language=en-US",
            "pub_date": "2026-02-26 18:57:35",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050144,
            "title": "India and Israel Sign AI Cooperation Agreement",
            "description": "India and Israel have entered into a significant agreement to collaborate on artificial intelligence (AI) initiatives. According to Jin10, the partnership aims to enhance technological advancements and foster innovation in AI applications across various sectors. This agreement marks a strategic move for both nations as they seek to leverage AI technology to boost economic growth and address global challenges. The collaboration is expected to facilitate knowledge exchange and joint research efforts, paving the way for new developments in AI-driven solutions.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050144&language=en-US",
            "pub_date": "2026-02-26 19:00:18",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050128,
            "title": "Anything Labs Partners with UXUY to Expand AI Stablecoin Applications",
            "description": "On February 26, Anything Labs announced a strategic partnership with on-chain exchange UXUY. According to ChainCatcher, as the world's first crypto incubation institution focused on the AI stablecoin sector, Anything Labs aims to leverage UXUY's multi-chain ecosystem to accelerate the expansion and application of AI stablecoins, exploring new AI trading paradigms for high-frequency, asymmetric trading scenarios.\n\nThe AI-native stablecoin UUSD, launched by Anything Labs, has seen a rapid increase in market attention just one week after its release. The UUSD team is currently intensifying its penetration into AI developer communities, including OpenClaw, and addressing issues related to the native nature of AI assets through the X402 protocol.\n\nPatrick, the founder of Anything Labs, stated that the application scenarios for AI agents are continually expanding. The recent popularity of Elsp further confirms the vast opportunities AI holds in the social domain. Social scenarios are expected to gradually generate payment demands, which will extend to trading needs. The core value of UUSD lies in its ability to serve not only human transactions but also on-chain interactions involving AI, thereby building a peer-to-peer electronic cash system for the AI era.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050128&language=en-US",
            "pub_date": "2026-02-26 18:46:41",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050127,
            "title": "AI Models' Effectiveness Tied to Data Quality, Says London Stock Exchange CEO",
            "description": "London Stock Exchange Group CEO David Schwimmer emphasized the importance of data quality in the effectiveness of AI models. Bloomberg posted on X, highlighting Schwimmer's discussion on data ownership with @annaedwardsnews. Schwimmer noted that while AI models possess significant power, their performance is directly linked to the quality of the data they process. The conversation underscores the critical role of data management in maximizing AI capabilities.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050127&language=en-US",
            "pub_date": "2026-02-26 18:47:48",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050126,
            "title": "Nordic Countries Investigate Threats to Energy Infrastructure",
            "description": "Nordic countries are currently investigating potential threats to their energy infrastructure. According to Jin10, this development comes amid growing concerns over the security and stability of critical energy systems in the region. Authorities are working to assess the situation and implement measures to safeguard these essential resources. The investigation highlights the importance of maintaining robust security protocols to protect against potential disruptions.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050126&language=en-US",
            "pub_date": "2026-02-26 18:48:18",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050125,
            "title": "Norway's Wealth Fund Faces Challenges Due to Ethical Investment Guidelines",
            "description": "Norway's $2.2 trillion sovereign wealth fund has reported that its decision to exclude weapons manufacturers from its investment portfolio, based on ethical guidelines, is negatively impacting its financial returns. Bloomberg posted on X, highlighting the fund's adherence to ethical standards, which has led to a reduction in potential profits. The fund, known for its significant global investments, prioritizes ethical considerations, including environmental and social governance, in its investment strategy. This approach, while aligning with Norway's ethical stance, has resulted in missed opportunities in sectors that are currently profitable, such as defense and arms manufacturing. The fund's management continues to navigate the balance between ethical investment and financial performance, maintaining its commitment to responsible investing despite the challenges in maximizing returns.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050125&language=en-US",
            "pub_date": "2026-02-26 18:48:31",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}