{
    "data": [
        {
            "id": 733217,
            "title": "Cardano (ADA) at a Crossroads: Could Bears Take Control Again?",
            "description": "Cardano price started a fresh decline below the $0.9250 zone. ADA is now correcting losses and struggling to clear the $0.80 resistance. ADA price started a fresh decline from the $0.9250 zone. The price is trading below $0.850 and the 100-hourly simple moving average. There is a key bearish trend line forming with resistance at $0.8050 on the hourly chart of the ADA/USD pair (data source from...\nsource: https://www.newsbtc.com/analysis/ada/cardano-ada-at-a-crossroads-0-80/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733217&language=en-US",
            "pub_date": "2025-02-04 13:08:16",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733214,
            "title": "The historical cumulative net inflow of Bitcoin spot ETF has reached 40.263 billion US dollars, and the net outflow was the first after the net inflow in the past 4 days",
            "description": "Odaily Planet Daily News According to SoSoValue data, yesterday (February 3, Eastern Time), the total net outflow of Bitcoin spot ETFs was US$235 million.\nYesterday, Grayscale ETF GBTC had a single-day net inflow of US$8.0191 million, and the current historical net outflow of GBTC is US$21.883 billion.\nGrayscale Bitcoin Mini Trust ETF BTC had a single-day net outflow of US$0.00, and the current historical total net inflow of Grayscale Bitcoin Mini Trust BTC is US$1.232 billion.\nAs of press time, the total net asset value of Bitcoin spot ETF is US$119.14 billion, the ETF net asset ratio (market value to the total market value of Bitcoin) is 5.95%, and the historical cumulative net inflow has reached US$40.263 billion.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733214&language=en-US",
            "pub_date": "2025-02-04 13:03:10",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733216,
            "title": "BNB Drops Below 590 USDT with a Narrowed 8.22% Increase in 24 Hours",
            "description": "On Feb 04, 2025, 05:06 AM(UTC). According to Binance Market Data, BNB has dropped below 590 USDT and is now trading at 589.799988 USDT, with a narrowed narrowed 8.22% increase in 24 hours.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733216&language=en-US",
            "pub_date": "2025-02-04 13:06:36",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733209,
            "title": "The Ethereum spot ETF has accumulated a total net inflow of US$2.842 billion, and the ETF net asset ratio has reached 3.06%.",
            "description": "Odaily Planet Daily News According to SoSoValue data, yesterday (February 3, Eastern Time), the total net inflow of Ethereum spot ETFs was 83.5404 million US dollars.\nYesterday, Grayscale Ethereum Trust ETF ETHE had a single-day net inflow of 15.8517 million US dollars, and the current historical net outflow of ETHE is 3.918 billion US dollars.\nGrayscale Ethereum Mini Trust ETF ETH had a single-day net inflow of 12.7543 million US dollars, and the current historical total net inflow of Grayscale Ethereum Mini Trust ETH is 607 million US dollars.\nThe Ethereum spot ETF with the largest single-day net inflow yesterday was Fidelity ETF FETH, with a single-day net inflow of 49.7493 million US dollars, and the current historical total net inflow of FETH reached 1.462 billion US dollars.\nThe second is Grayscale ETF ETHE, with a single-day net inflow of US$15.8517 million. Currently, ETHE has a total net outflow of US$3.918 billion.\nAs of press time, the total net asset value of Ethereum spot ETF is US$9.979 billion, and the ETF net asset ratio (market value to Ethereum's total market value) is 3.06%, and the historical cumulative net inflow has reached US$2.842 billion.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733209&language=en-US",
            "pub_date": "2025-02-04 12:54:10",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733210,
            "title": "Bitcoin(BTC) Drops Below 100,000 USDT with a Narrowed 7.40% Increase in 24 Hours",
            "description": "On Feb 04, 2025, 05:02 AM(UTC). According to Binance Market Data, Bitcoin has dropped below 100,000 USDT and is now trading at 99,944.992188 USDT, with a narrowed narrowed 7.40% increase in 24 hours.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733210&language=en-US",
            "pub_date": "2025-02-04 13:02:36",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733205,
            "title": "BlockTower Capital deposited $16.78 million worth of 4 DeFi tokens into Binance in the past 9 hours",
            "description": "Odaily Planet Daily News Spot On Chain monitoring shows that BlockTower Capital deposited 4 DeFi tokens worth $16.78 million to Binance in the past 9 hours, with a net loss of $2.94 million. These include: \n532,754 UNI (US$5.33 million), a profit of $579,000 (+12%); \n197,451 LINK (US$4.29 million), a loss of $426,500 (-9%); \n3,862 MKR (US$3.77 million), a loss of $1.7 million (-31%); \n5.153 million ENA (US$3.39 million), a loss of $1.39 million (-29%). \nCurrently, BlockTower still owns approximately $21.7 million in assets, including 20,314 AAVE ($5.47 million) and 1,713 ETH ($4.84 million).",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733205&language=en-US",
            "pub_date": "2025-02-04 12:46:36",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733204,
            "title": "1kx opens a 20x long position on SUI on Hyperliquid, with an opening price of $3",
            "description": "Nansen monitoring shows that 1kx opened a 20x long SUI order on Hyperliquid, with an opening price of $3 and a collateral value of $985,000.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733204&language=en-US",
            "pub_date": "2025-02-04 12:46:53",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733203,
            "title": "ETH fell below 2800 USDT, and the 24-hour increase narrowed to 13.5%",
            "description": "OKX market shows that ETH fell below 2800 USDT and is now at 2799.99 USDT, with the 24-hour increase narrowed to 13.5%. (This newsletter is generated by AI)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733203&language=en-US",
            "pub_date": "2025-02-04 12:48:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733200,
            "title": "BNB Drops Below 600 USDT with a Narrowed 9.81% Increase in 24 Hours",
            "description": "On Feb 04, 2025, 04:40 AM(UTC). According to Binance Market Data, BNB has dropped below 600 USDT and is now trading at 599.929993 USDT, with a narrowed narrowed 9.81% increase in 24 hours.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733200&language=en-US",
            "pub_date": "2025-02-04 12:40:42",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733197,
            "title": "Canadian Man Charged for Exploiting DeFi Vulnerabilities in $65M Hacking Scheme",
            "description": "The man, still at large, faces five charges, including wire fraud, computer damage, extortion, and money laundering.\nsource: https://decrypt.co/304271/canadian-man-charged-for-exploiting-defi-vulnerabilities-in-65m-hacking-scheme",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733197&language=en-US",
            "pub_date": "2025-02-04 12:19:48",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}