{
    "data": [
        {
            "id": 734635,
            "title": "Cryptocurrency Market Falls into Fear Zone: Here's Why That's Big News",
            "description": "Cryptocurrency market drops into fear, and you'd love to know what happened last time\nsource: https://u.today/cryptocurrency-market-falls-into-fear-zone-heres-why-thats-big-news",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734635&language=en-US",
            "pub_date": "2025-02-06 00:00:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734634,
            "title": "Coinbase Users Lose Millions Annually – Here is How",
            "description": "An on-chain investigator, operating under the pseudonym ZachXBT, has revealed alarming details about the scale of social engineering scams affecting Coinbase users.\nThe post Coinbase Users Lose Millions Annually – Here is How appeared first on Cryptodnes.\nsource: https://cryptodnes.bg/en/coinbase-users-lose-millions-annually-here-is-how/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734634&language=en-US",
            "pub_date": "2025-02-06 00:00:19",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734633,
            "title": "EA’s $1B Buyback Plan Boosts Investor Confidence Amid 6.4% Revenue Drop",
            "description": "Electronic Arts reported a slight earnings miss for Q3 FY2025 but boosted investor confidence with a $1 billion stock repurchase plan.\nThe post EA’s $1B Buyback Plan Boosts Investor Confidence Amid 6.4% Revenue Drop appeared first on Tokenist.\nsource: https://tokenist.com/eas-1b-buyback-plan-boosts-investor-confidence-amid-6-4-revenue-drop/?utm_source=rss&utm_medium=rss&utm_campaign=eas-1b-buyback-plan-boosts-investor-confidence-amid-6-4-revenue-drop",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734633&language=en-US",
            "pub_date": "2025-02-06 00:00:27",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734632,
            "title": "Union Square Ventures Leads $14M Series A for Token Trading Infrastructure Reservoir",
            "description": "The company plans to use the fresh capital to expand beyond NFTs and enable token trading on apps across multiple blockchains.\nThe post Union Square Ventures Leads $14M Series A for Token Trading Infrastructure Reservoir appeared first on NFTgators .\nsource: https://www.nftgators.com/union-square-ventures-leads-14m-series-a-for-token-trading-infrastructure-reservoir/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734632&language=en-US",
            "pub_date": "2025-02-06 00:00:38",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734625,
            "title": "Rho Labs Completes $4 Million Seed Round, Led by CoinFund",
            "description": "Odaily Planet Daily News: Rho Labs, founded by former Copper Chief Product Officer Alex Ryvkin, announced the completion of a US$4 million seed round of financing, led by CoinFund, with participation from Auros, Flow Traders and Speedinvest. The company had completed a US$2.2 million Pre-Seed round of financing in 2023, led by Speedinvest, with participation from Keyrock, Re7 Capital, Daedalus Collective and Copper CEO Dmitry Tokarev.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734625&language=en-US",
            "pub_date": "2025-02-05 23:52:56",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734624,
            "title": "Messari Releases Solana Ecosystem 2024 Q4 Report: DeFi TVL Reaches $8.6 Billion",
            "description": "Odaily Planet Daily News Messari released Solana's 2024 Q4 report, which disclosed: \nSolana ecosystem DeFi TVL reached 8.6 billion US dollars (+64%), surpassing Tron to become the second largest public chain, with on-chain application revenue of 840 million US dollars (+213%); \nSolana ecosystem's average daily DEX trading volume is 3.3 billion US dollars (+150%), and Jupiter accounts for 38% of the market share, mainly due to Memecoin and AI token transactions; \nSolana ecosystem stablecoin market value is 5.1 billion US dollars (+36%), USDC accounts for 75%, and USDT increases to 912 million US dollars. \nIn addition, Visa expands SolanaUSDC settlement, and Grayscale submits SolanaETF application. Overall, Solana ecosystem growth is strong and institutional adoption is accelerating.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734624&language=en-US",
            "pub_date": "2025-02-05 23:58:44",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734618,
            "title": "Pudgy Penguins CEO: $PENGU application has officially ended",
            "description": "Odaily Planet Daily News: Luca Netz, CEO of the NFT project \"Fat Penguin\" Pudgy Penguins, announced on the X platform that the $PENGU application has officially ended.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734618&language=en-US",
            "pub_date": "2025-02-05 23:48:11",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734611,
            "title": "U.S. Senate Committee Approves Nomination Of Commerce Secretary",
            "description": "According to PANews, the U.S. Senate Committee has voted to approve the nomination of Howard Lutnick as the Secretary of Commerce. The committee's decision was reached with 16 votes in favor and 12 against. This approval marks a significant step in the confirmation process for Lutnick, who was nominated by U.S. President Donald Trump. The nomination will now proceed to the full Senate for further consideration.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734611&language=en-US",
            "pub_date": "2025-02-05 23:33:45",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734610,
            "title": "Fed's Barkin Highlights Conditions for Potential Rate Hikes",
            "description": "According to Odaily, Federal Reserve official Thomas Barkin stated that any decision to raise interest rates would depend on evidence of an overheating economy. He remains confident that inflation will gradually return to the Federal Reserve's 2% target. Barkin also noted that the U.S. labor market might shift towards either increased hiring or layoffs, indicating that it has stabilized.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734610&language=en-US",
            "pub_date": "2025-02-05 23:33:54",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734609,
            "title": "Moonbeam Foundation Launches DataHaven, a High-Performance Storage Chain for AI Applications",
            "description": "Odaily Planet Daily News: The Moonbeam Foundation recently officially announced its strategic plan to expand into the Ethereum ecosystem. The first step will be to cooperate with EigenLayer to introduce high-performance decentralized storage capabilities to the Ethereum ecosystem, especially focusing on meeting the storage needs of AI applications.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734609&language=en-US",
            "pub_date": "2025-02-05 23:38:03",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}