{
    "data": [
        {
            "id": 1051512,
            "title": "Russia's Recruitment Tactics in Africa Raise Concerns",
            "description": "Russia is reportedly misleading Africans to enlist them for its conflict in Ukraine, raising questions about its role as a genuine ally to the continent. Bloomberg posted on X, highlighting the deceptive strategies employed by Russia to recruit African individuals for its military efforts. This development has sparked concerns about the nature of Russia's relationship with African nations, suggesting a more opportunistic rather than supportive partnership. The situation underscores the complexities of international alliances and the potential implications for African countries involved.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051512&language=en-US",
            "pub_date": "2026-02-27 12:20:39",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051508,
            "title": "CZ's commentary on Block's layoffs: Either fully embrace AI or face being replaced.",
            "description": "CZ, commenting on social media about Block's planned large-scale layoffs and increased investment in its AI strategy, stated that companies that do not actively embrace artificial intelligence may ultimately face the risk of being replaced by technology. Previous reports indicated that Block would lay off approximately 40% of its workforce, and Jack Dorsey was pushing forward with an AI-first strategy.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051508&language=en-US",
            "pub_date": "2026-02-27 12:24:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051511,
            "title": "Cathie Wood Highlights Bitcoin's Role as Inflation and Deflation Hedge",
            "description": "Cathie Wood has emphasized that Bitcoin serves as a hedge against both inflation and deflation, outperforming gold in recent times. According to Bitalk News, Wood noted that while both Bitcoin and gold are tools for combating inflation and deflation, Bitcoin is digital. From the perspective of incremental demand, gold's demand is already established, whereas Bitcoin is relatively new, with minimal institutional involvement. Additionally, younger generations prefer holding Bitcoin over gold, contributing to its recent superior performance.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051511&language=en-US",
            "pub_date": "2026-02-27 12:30:16",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051507,
            "title": "Hong Kong Government Plans New Measures to Support SMEs and Expand Markets",
            "description": "The Secretary for Commerce and Economic Development, Edward Yau, announced at a press conference on budget-related measures that the government is committed to optimizing various initiatives to support small and medium enterprises (SMEs) in innovation, enhancing competitiveness, and seizing opportunities to explore new markets. According to RTHK, the government is preparing to inject HKD 200 million into the BUD Special Fund, with execution details expected to be launched in the second quarter of this year.\n\nYau stated that with the advancement of high-level two-way openness, mainland enterprises are more actively exploring overseas markets. Promotional activities will be held in Hong Kong and various provinces and cities in mainland China, and a cross-sector professional service platform will be established. This platform will include legal, accounting, financial, testing, certification, and marketing services from Hong Kong professionals to support mainland enterprises going abroad. The government also plans to organize overseas inspection tours to help mainland enterprises understand foreign markets.\n\nHe further mentioned that Hong Kong will strengthen its role as a key node in the Belt and Road Initiative, collaborating with the industry to deepen engagement in ASEAN and Middle Eastern markets, while exploring the potential of Central Asia, South Asia, and North Africa markets. The government has completed investment agreement negotiations with Qatar, Bangladesh, and Peru and is exploring new investment agreements with Saudi Arabia and Egypt.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051507&language=en-US",
            "pub_date": "2026-02-27 12:12:54",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051506,
            "title": "Dollar Faces Decline Amid Tariff News, China Stocks Expected to Outperform",
            "description": "The dollar is anticipated to be significantly impacted by the recent wave of tariff announcements, according to the latest Markets Pulse survey. Bloomberg posted on X that the survey results suggest a potential decline for the dollar, while Chinese stocks are expected to see gains. This development comes as market participants assess the implications of ongoing trade tensions and their effects on global financial markets. The survey highlights a shift in investor sentiment, with a growing preference for Chinese equities amid the current economic climate. The findings underscore the challenges facing the dollar as trade policies continue to evolve.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051506&language=en-US",
            "pub_date": "2026-02-27 12:15:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051505,
            "title": "Bitcoin(BTC) Surpasses 68,000 USDT with a Narrowed 0.82% Decrease in 24 Hours",
            "description": "On Feb 27, 2026, 04:16 AM(UTC). According to Binance Market Data, Bitcoin has crossed the 68,000 USDT benchmark and is now trading at 68,009.398438 USDT, with a narrowed narrowed 0.82% decrease in 24 hours.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051505&language=en-US",
            "pub_date": "2026-02-27 12:16:08",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051504,
            "title": "Dongchedi Considers Hong Kong IPO This Year",
            "description": "Dongchedi, also known as DCar, is reportedly planning an initial public offering (IPO) in Hong Kong, potentially as early as this year. Bloomberg posted on X, citing sources familiar with the matter, that the automotive information and trading platform is exploring this financial move. The company, which provides a range of services in the automotive sector, is evaluating the timing and details of the IPO. Further specifics about the offering, including the size and valuation, have not been disclosed. Dongchedi's decision to go public in Hong Kong aligns with a trend of companies seeking to tap into the region's capital markets. The move could provide the company with additional resources to expand its operations and enhance its market presence.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051504&language=en-US",
            "pub_date": "2026-02-27 12:17:01",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051498,
            "title": "Nvidia's Strategic Investment Shift: Intel and Nokia Stocks Surge",
            "description": "Nvidia has invested nearly $9 billion in Intel and Nokia, both of which have experienced significant stock price increases since early September 2025. According to NS3.AI, Intel's stock has surged approximately 92%, while Nokia's has risen about 79%. In contrast, Nvidia's investment in Synopsys has seen a decline. This move indicates Nvidia's strategic portfolio reshuffle, focusing on high-growth tech sectors, as the company reduces or exits stakes in several other firms.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051498&language=en-US",
            "pub_date": "2026-02-27 12:08:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051497,
            "title": "AI's Potential Role in Addressing U.S. Aging Workforce Challenges by 2040",
            "description": "Crypto KOL IncomeSharks posted on X. By 2040, the United States is projected to have approximately 80 million individuals aged 65 and older. This demographic shift indicates that tens of millions will be retiring and exiting the workforce. Previously considered a significant challenge, the advent of artificial intelligence now presents potential solutions to address this issue. AI technologies could play a crucial role in managing the impacts of an aging population, offering innovative ways to support the workforce and maintain economic stability.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051497&language=en-US",
            "pub_date": "2026-02-27 12:08:26",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051496,
            "title": "TeraWulf Reports Revenue Growth Amid Expanding Losses in 2025",
            "description": "TeraWulf, a Nasdaq-listed Bitcoin mining company, announced its financial results for 2025, revealing a revenue of $168.5 million, marking a 20.3% increase from the previous year. According to BlockBeats, the growth includes $16.9 million from its newly launched HPC leasing business. Despite the revenue increase, the company reported a net loss of $661.4 million for the year, with an adjusted EBITDA loss of $23.1 million.\n\nTeraWulf has labeled 2025 as a 'turning point year,' having secured long-term data center leases covering 522 megawatts of critical IT load. These contracts are expected to generate over $12.8 billion in customer revenue, supported by $6.5 billion in financing for its HPC platform development. In the fourth quarter, the company's digital asset revenue declined to $26.1 million due to decreased Bitcoin production and prices, while HPC leasing revenue rose to $9.7 million.\n\nThe company's strategy is increasingly focused on AI and cloud computing clients, with key operations centered in the Lake Mariner campus in New York and the Abernathy HPC campus in Texas. Earlier this month, TeraWulf acquired brownfield infrastructure in Kentucky and Maryland, adding approximately 1.5 GW of capacity.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051496&language=en-US",
            "pub_date": "2026-02-27 12:08:47",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051495,
            "title": "Nintendo to Reduce Strategic Shareholdings by ¥300 Billion",
            "description": "Nintendo is set to reduce its strategic shareholdings by approximately ¥300 billion, according to a report by Reuters. Bloomberg posted on X that the move involves shares owned by its partner banks. This decision is part of Nintendo's broader strategy to streamline its financial operations and focus on core business activities. The company has not publicly commented on the specifics of the shareholding reduction or the timeline for its implementation. The reduction in shareholdings is expected to impact Nintendo's financial relationships with its partner banks, although the exact implications remain unclear. This strategic move aligns with Nintendo's ongoing efforts to optimize its asset management and enhance shareholder value.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051495&language=en-US",
            "pub_date": "2026-02-27 12:09:21",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051491,
            "title": "The total amount of Gate.com's GT token staked has exceeded 4,000.",
            "description": "According to the latest data from the Gate platform, the total staked amount for its GT mining product has reached 4,000.05 GT. In addition to GT, the platform also offers staking options for multiple currencies. As of press time, the reference annualized yields are: GUSD 3.20%, BTC 5.49%, ETH 5.60%, SOL 11%, and USDT 3.44%. It is understood that GT staking requires a minimum of 1 GT to participate, supporting fast staking and redemption, making fund liquidity more flexible; it also unlocks diverse PoS staking strategies, distributes GT2 rewards daily, and provides strong protection for user assets through a 100% reserve mechanism.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051491&language=en-US",
            "pub_date": "2026-02-27 11:56:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051490,
            "title": "Solana Introduces Real-Time Payment Platform for Developers",
            "description": "Solana has unveiled Solana Payments, a new platform designed to support developers with real-time payment simulation and comprehensive documentation. According to NS3.AI, this initiative includes case studies to guide developers in creating on-chain payment solutions. The goal is to enhance the integration of real-time payment processing within the Solana blockchain ecosystem.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051490&language=en-US",
            "pub_date": "2026-02-27 11:54:34",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051489,
            "title": "South Korean Carbon Permit Prices Reach Highest Level Since April 2023",
            "description": "South Korean carbon permit prices have surged to their highest level since April 2023. Bloomberg posted on X that this increase is attributed to investors factoring in a tighter demand and supply balance due to recent policy changes. The adjustments in policy have led to expectations of a more constrained market, driving up the prices of carbon permits. This development reflects the ongoing adjustments in the carbon market as stakeholders respond to regulatory shifts.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051489&language=en-US",
            "pub_date": "2026-02-27 11:59:06",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051488,
            "title": "Binance to Conduct Wallet Maintenance for BNB Smart Chain",
            "description": "According to the announcement from Binance, the platform is set to perform wallet maintenance for the BNB Smart Chain (BEP20) on 2026-03-02 at 06:00 (UTC). This maintenance is expected to last approximately one hour. During this period, deposits and withdrawals on the BNB Smart Chain (BEP20) will be temporarily suspended starting from 2026-03-02 at 05:55 (UTC). However, trading of tokens on the network will remain unaffected.\n\nBinance assures users that all technical requirements will be managed by the platform, ensuring a smooth process. Once the network is deemed stable post-maintenance, deposits and withdrawals will be reopened. The announcement emphasizes that no further updates will be provided regarding the maintenance status. Users are encouraged to rely on the original English version of the announcement for the most accurate information, as there may be discrepancies in translated versions.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051488&language=en-US",
            "pub_date": "2026-02-27 12:00:18",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051485,
            "title": "IoTeX releases IIP-56 proposal: Deprecates CIOTX and opens up 1:1 claims for IIOTX exchange.",
            "description": "IoTeX has released its IIP-56 governance proposal, proposing to completely deprecate CIOTX on the Ethereum, Base, and Solana networks and permanently shut down related cross-chain bridges. This follows an attack on the ioTube cross-chain bridge on February 20th, which resulted in unauthorized issuance of CIOTX on the Ethereum network; such anomalous minting will not be recognized. According to the proposal, compliant holders must submit their transaction hashes through the official claims portal. After verification, IOTX will be distributed to the IoTeX mainnet at a 1:1 ratio. The BSC, Polygon, and IoTeX mainnets were not affected by the anomalous issuance; their cross-chain bridges will be temporarily restarted after audits are completed, allowing users to migrate back to IOTX, before being permanently decommissioned. Simultaneously, the project team will notify centralized and decentralized exchanges and DeFi protocols to remove CIOTX integrations.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051485&language=en-US",
            "pub_date": "2026-02-27 11:47:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051476,
            "title": "Cardano Bullish ABC Pattern Pending—What Could Drive the Next Rebound?",
            "description": "A developing Cardano ABC pattern has faced several roadblocks, but optimism remains that it will complete, pushing prices to measured targets. Cardano saw a relief rally from a key support area between $0. 24 and $0. 26 on Wednesday, pumping an impressive 14% to reach $0. 31 before a slight retraction. Visit Website\nsource: https://thecryptobasic.com/2026/02/27/cardano-bullish-abc-pattern-pending-what-could-drive-the-next-rebound/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051476&language=en-US",
            "pub_date": "2026-02-27 11:38:31",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051475,
            "title": "Ransomware incidents up 50% in 2025 as payments stay flat",
            "description": "A new Chainalysis report suggests ransomware attackers are \"working harder for diminishing returns\" as regulatory pressure and refusals to pay have hurt ransom proceeds.\nsource: https://cointelegraph.com/news/ransomware-attacks-rose-50-in-2025-chainalysis?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051475&language=en-US",
            "pub_date": "2026-02-27 11:38:44",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051484,
            "title": "Federal Reserve Faces Inquiry Over Building Renovations",
            "description": "The Federal Reserve is currently in a standoff with a federal prosecutor over requests for information concerning the renovations of two historic buildings at its headquarters in Washington. Bloomberg posted on X, highlighting the ongoing tension between the central bank and legal authorities. The prosecutor is seeking details about the refurbishment projects, which have raised questions regarding transparency and oversight. The Federal Reserve has yet to provide the requested information, leading to a stalemate in the investigation. The outcome of this inquiry could have implications for the central bank's operations and its relationship with federal oversight bodies.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051484&language=en-US",
            "pub_date": "2026-02-27 11:43:16",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051483,
            "title": "STOCKS | India's Sensex Index Opens Steady at 82,220.48 Points",
            "description": "India's Sensex Index opened unchanged at 82,220.48 points. According to Jin10, the index maintained its position as investors assessed market conditions. The stability in the Sensex reflects cautious sentiment among traders amid ongoing economic evaluations. Market participants are closely monitoring developments to gauge future movements in the index.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051483&language=en-US",
            "pub_date": "2026-02-27 11:49:12",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}