{
    "data": [
        {
            "id": 1052487,
            "title": "GEOPOLITICS | U.S. Secretary of State Rubio's Unusual Visit to Israel Without Press",
            "description": "U.S. Secretary of State Rubio's recent visit to Israel has drawn attention due to the absence of accompanying journalists, a departure from a longstanding tradition. According to Jin10, this move marks a rare break from the norm, as secretaries of state have typically traveled with media representatives for decades. The decision has sparked discussions about the implications and motivations behind this change in protocol.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052487&language=en-US",
            "pub_date": "2026-02-28 00:32:23",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052486,
            "title": "Kioxia Holdings Appoints Yoshihiko Kawamura as CFO",
            "description": "Kioxia Holdings has announced the appointment of Yoshihiko Kawamura as its new Chief Financial Officer. According to Jin10, this strategic move is part of the company's efforts to strengthen its financial leadership. Kawamura brings extensive experience in financial management, which is expected to support Kioxia's growth and operational efficiency. The appointment comes at a time when the company is navigating a competitive market landscape, aiming to enhance its position in the global semiconductor industry.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052486&language=en-US",
            "pub_date": "2026-02-28 00:32:27",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052485,
            "title": "India and EU Plan to Ease Trade Restrictions in Proposed FTA",
            "description": "India and the European Union are considering significant changes in their trade policies as part of a proposed Free Trade Agreement (FTA). According to Jin10, the draft indicates that both parties aim to eliminate new import and export restrictions that exceed World Trade Organization rules. Additionally, they plan to remove consular certification requirements, which could streamline trade processes and enhance economic cooperation between the two regions. These measures are expected to facilitate smoother trade operations and strengthen bilateral relations.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052485&language=en-US",
            "pub_date": "2026-02-28 00:33:55",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052484,
            "title": "India and EU Aim to Align Food Safety Rules with WTO Standards in Proposed Trade Agreement",
            "description": "India and the European Union are working towards aligning their food and plant safety regulations with World Trade Organization (WTO) standards as part of a proposed free trade agreement. According to Jin10, the draft agreement also seeks to streamline certification and auditing procedures. This move is expected to facilitate smoother trade relations between the two regions by ensuring compliance with international norms. The alignment with WTO standards is seen as a step towards enhancing trade efficiency and reducing barriers in the agricultural sector.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052484&language=en-US",
            "pub_date": "2026-02-28 00:38:18",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052483,
            "title": "A private survey of crypto KOLs' stock investments revealed that AI, metals, and energy were the most popular sectors.",
            "description": "South Korean KOL Joshua (MOZAIK) posted on the X platform that he conducted a private survey of approximately 120 crypto KOLs from mid-January to early February, with 55 submitting detailed responses. The survey results showed that 50 of the 55 respondents were currently trading stocks, while 5 were just starting out. Ranked by the number of KOLs holding positions, the most popular sectors were, in order: AI (11 people), Metals & Commodities (8 people), Energy & Power (8 people), Storage & Semiconductors (7 people), Robotics & Humanoid Robots (6 people), and Space & Defense (6 people). The most frequently mentioned stocks were INTC, GOOG, RKLB, ASTS, and AMZN, each mentioned by 4 people. Many respondents expressed a trend of rotating from cryptocurrencies to stocks, with some stating that \"the crypto market is no longer attractive,\" and instead investing in the robotics and humanoid robot sectors. High-confidence holding themes included AI-driven memory chip shortages, space and defense, and rare earth and uranium energy. Regarding trading platforms, IBKR topped the list with 24 users, followed by Robinhood with 8, and the rest were distributed across platforms such as Schwab and Hyperliquid. The most common other asset classes traded by respondents were metals, followed by commodities, options and futures, and foreign exchange and bonds. Among the stock KOLs followed by crypto traders, Citrini7 was mentioned most frequently.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052483&language=en-US",
            "pub_date": "2026-02-28 00:32:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052475,
            "title": "Bitcoin's 3% Decline Linked to Inflation Concerns After January PPI Data",
            "description": "Bitcoin experienced a 3% drop after the release of January's producer price index (PPI) data, which revealed higher-than-expected inflation primarily due to increased service costs and trade margins. According to NS3.AI, this unexpected inflation complicates the prospects for Federal Reserve rate cuts, potentially prolonging the current phase of monetary tightening. The February PPI report has been postponed until March 18, adding to market uncertainty amid conflicting inflation signals between producer and consumer prices.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052475&language=en-US",
            "pub_date": "2026-02-28 00:18:46",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052474,
            "title": "Terra Luna Classic Rises 30% Amid Speculative Activity",
            "description": "Terra Luna Classic (LUNC) has seen a significant 30% increase in its value, fueled by heightened trading volume and speculative activity. According to NS3.AI, this surge occurred despite LUNC's low correlation with Bitcoin. Technical indicators, including the Chaikin Money Flow, reveal a bearish divergence, indicating weak buying pressure behind the rally. Additionally, negative derivatives funding rates and existing resistance levels suggest a potential short-term reversal or consolidation for LUNC.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052474&language=en-US",
            "pub_date": "2026-02-28 00:22:12",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052473,
            "title": "U.S. Companies File Lawsuits Over Trump's Global Tariffs",
            "description": "Over 100 companies have initiated new lawsuits following the U.S. Supreme Court's ruling that deemed most of U.S. President Donald Trump's global tariffs illegal. According to Jin10, FedEx filed a lawsuit on Monday, with other companies quickly following suit. Subsidiaries of cosmetics giant L'Oréal, as well as footwear companies On Holding and Skechers USA, are seeking to recover the import tariffs they have paid. Bloomberg News analysis indicates that the latest cases have pushed the total number of tariff-related lawsuits to over 2,000. This presents a significant burden for trade courts, yet represents only a fraction of the hundreds of thousands of importers affected by the overturned tariffs.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052473&language=en-US",
            "pub_date": "2026-02-28 00:28:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052472,
            "title": "Japan's Kyoto to Increase Hotel Tax Starting March 1",
            "description": "Japan's Kyoto will implement a new hotel tax rate beginning March 1, according to Jin10. The highest tax rate will be set at $64 per night, as reported by Nikkei News. This move aims to adjust the city's tourism-related revenue structure.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052472&language=en-US",
            "pub_date": "2026-02-28 00:28:04",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052455,
            "title": "BlackRock Buys $289M Bitcoin: Is The Bottom Served?",
            "description": "Wall Street’s attraction towards Bitcoin isn’t losing steam even amidst the harshest of crypto winters.\nsource: https://dailycoin.com/blackrock-buys-289m-bitcoin-is-the-bottom-served/?utm_source=cryptopanic&utm_medium=rss",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052455&language=en-US",
            "pub_date": "2026-02-28 00:13:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052452,
            "title": "Wrexham AFC's Multifaceted Identity and Investment Potential",
            "description": "Wrexham AFC, a Welsh football club, is gaining attention for its diverse identity and investment potential. Bloomberg posted on X, highlighting the club's transformation into a US-focused content hub and its embrace of a neo-sports culture. The club's recent developments have sparked debates about its valuation and investment appeal. As Wrexham AFC continues to evolve, it remains a subject of interest for both sports enthusiasts and investors.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052452&language=en-US",
            "pub_date": "2026-02-28 00:14:52",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052471,
            "title": "Multiple countries issue evacuation warnings for the Middle East",
            "description": "1. The US State Department ordered the evacuation of non-essential diplomats from Israel. The US ambassador to Israel warned the mission that a US attack on Iran was imminent and urged them to leave Israel today. The US State Department also ordered the evacuation of non-essential staff and their families from the US Embassy in Iraq. (A US State Department deputy spokesperson responded that this was not true.) A large number of US citizens left Iraq via Baghdad International Airport in the past 24 hours. 2. Canada again urged its citizens to evacuate from Iran immediately. 3. The Kazakh Foreign Ministry called on its citizens to leave Iran and temporarily avoid traveling to the country. 4. The Chinese Foreign Ministry reminded Chinese citizens not to travel to Iran for the time being. The Chinese Embassy in Israel issued a security alert. 5. The British government: British staff have temporarily evacuated from Iran. (Jinshi Data APP) 6. The French Foreign Ministry advised French citizens not to travel to Israel, Jerusalem, and the West Bank. (Jinshi)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052471&language=en-US",
            "pub_date": "2026-02-28 00:15:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052470,
            "title": "Spot silver rose 6.48% on the day, while spot gold hit a new high since January 30.",
            "description": "According to Gate data, spot silver rose above $94 per ounce, up 6.48% on the day. Spot gold rose above $5,250 per ounce, up 1.26% on the day, reaching a new high since January 30.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052470&language=en-US",
            "pub_date": "2026-02-28 00:18:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052439,
            "title": "Bitcoin Nears Major Milestone As 100 BTC Wallets Approach Record Levels",
            "description": "As market participants focus on short-term price movements, Bitcoin is approaching a notable on-chain milestone, with the number of wallets holding at least 100 BTC climbing toward record levels. This growing concentration of high-value holdings reflects increasing accumulation by large investors, and is viewed as a sign of strong long-term confidence in the world’s leading cryptocurrency. How Large Holders Influence Bitcoin’s Market Cycles Bitcoin is approaching a major milestone, with the number of wallet addresses holding at least 100 BTC set to surpass 20,000. An on-chain analytics firm, Santiment, highlighted on X that at current market valuations, a wallet holding 100 BTC or more is valued at roughly $6\nsource: https://www.newsbtc.com/news/bitcoin/bitcoin-nears-major-milestone/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052439&language=en-US",
            "pub_date": "2026-02-28 00:00:32",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052438,
            "title": "Wikipedia Co-Founder Predicts Bitcoin Below $10,000 by 2050",
            "description": "Key Takeaways Wikipedia co-founder says Bitcoin won’t go to zero due to its robust design.\nsource: https://coindoo.com/wikipedia-co-founder-predicts-bitcoin-below-10000-by-2050/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052438&language=en-US",
            "pub_date": "2026-02-28 00:00:47",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052437,
            "title": "India to Launch First Commercial Chip Production in Gujarat",
            "description": "India is set to initiate its first commercial chip production in Sanand, Gujarat, according to India's Information Technology Minister. According to Jin10, this move positions India among a select group of countries with domestic semiconductor manufacturing capabilities. The development is part of India's broader strategy to enhance its technological infrastructure and reduce reliance on foreign chip imports. The initiative is expected to bolster the country's tech industry and contribute to global semiconductor supply chains.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052437&language=en-US",
            "pub_date": "2026-02-27 23:59:05",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052436,
            "title": "Senator Kelly Urges Congressional Action on AI Regulation",
            "description": "U.S. Senator Kelly has called for Congress to take action in regulating artificial intelligence to safeguard the American public. According to Jin10, the Democratic senator emphasized the importance of establishing a regulatory framework to address the potential risks associated with AI technologies. The call for regulation comes amid growing concerns about the impact of AI on privacy, security, and employment. Senator Kelly's remarks highlight the urgency for legislative measures to ensure that AI development aligns with public interest and safety.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052436&language=en-US",
            "pub_date": "2026-02-28 00:01:30",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052435,
            "title": "Pemex Reports Fourth-Quarter Loss Amid Rising Debt",
            "description": "Mexico’s state-owned oil company, Pemex, has announced a net loss for the fourth quarter, contributing to an annual deficit of 45.2 billion pesos. Bloomberg posted on X that the company’s debt has reached $85.2 billion. Despite a 1.3% decline in crude and condensate production, gas output increased by 7.4%. The financial challenges highlight ongoing issues for Pemex as it navigates fluctuating production levels and substantial debt.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052435&language=en-US",
            "pub_date": "2026-02-28 00:02:38",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052430,
            "title": "South Korean Government Blunder Exposes Ledger Wallet Seed Phrase, Triggers $4.8M Crypto Theft",
            "description": "A major security lapse by South Korea’s government exposed a Ledger wallet’s recovery phrase, enabling the theft of roughly $4. 8 million in digital assets. Colin Wu spotlighted the incident today, citing a report from local outlet Maeil Business News Korea. Visit Website\nsource: https://thecryptobasic.com/2026/02/27/south-korean-government-blunder-exposes-ledger-wallet-seed-phrase-triggers-4-8m-crypto-theft/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052430&language=en-US",
            "pub_date": "2026-02-27 23:53:11",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052429,
            "title": "Ethereum's Scaling Roadmap Unveiled by Vitalik Buterin",
            "description": "Vitalik Buterin has outlined Ethereum's scaling roadmap, which includes short-term upgrades set to be implemented in the upcoming Glamsterdam fork. According to NS3.AI, these enhancements will feature block-level access lists, ePBS, and multidimensional gas, all designed to improve execution efficiency and better manage state growth. In the long term, the scaling plans aim to increase blob throughput to facilitate the expansion of Ethereum's network.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052429&language=en-US",
            "pub_date": "2026-02-27 23:52:32",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}