{
    "data": [
        {
            "id": 1050590,
            "title": "AI Adoption in Financial Transactions Signals Market Shift",
            "description": "Leading payment and cryptocurrency platforms are increasingly incorporating AI-enabled financial transactions, indicating a significant shift towards AI agents actively participating in markets. According to NS3.AI, while programmable infrastructure such as stablecoins and smart contracts already exists, the essential exchange frameworks for autonomous AI trading and portfolio management are still largely absent. Exchanges that successfully integrate unified settlement, intelligent execution, and agent-ready architectures are poised to spearhead the next evolution in financial markets, as traditional finance accelerates its own AI infrastructure initiatives.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050590&language=en-US",
            "pub_date": "2026-02-26 22:48:57",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050587,
            "title": "Axiom's promotional partner, Devin, apologized: He admitted to risking his reputation but claimed he was unaware of the ZachXBT exposure information.",
            "description": "Devin, an Axiom promotion partner, issued an apology on the X platform, stating that he had indeed risked his reputation and had no way of knowing that ZachXBT would expose Axiom. Previously, Devin had repeatedly posted on the X platform in support of Axiom, showing screenshots to the community showing that he had bet on Axiom's NO on Polymarket (meaning the exposed company wouldn't be Axiom). He had previously posted: \"Here's some free insider information: Axiom is not the company mentioned in ZachXBT's investigation. Betting NO on Axiom on Polymarket is basically giving away free money.\"",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050587&language=en-US",
            "pub_date": "2026-02-26 22:49:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050589,
            "title": "Avalanche's Price Decline and Potential Recovery Amid Infrastructure Developments",
            "description": "Avalanche (AVAX) has experienced a significant price drop, falling over 94% from its all-time high. According to NS3.AI, there are indications of a potential recovery, driven by advancements in infrastructure and increased institutional adoption. Japan's largest digital securities platform, Progmat, is transitioning $2 billion in tokenized real-world assets onto Avalanche, highlighting confidence in its technology. Avalanche is noted for offering faster transaction finality and lower fees compared to Ethereum. Despite these advantages, current investor demand remains modest, although there is an increase in daily active addresses.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050589&language=en-US",
            "pub_date": "2026-02-26 22:49:04",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050588,
            "title": "STOCKS | IRFC Shares Hit Yearly Low Amid Government Stake Reduction",
            "description": "IRFC shares have reached a yearly low of 103.20, continuing a significant downward trend observed throughout the year. According to NS3.AI, the decline in share price followed the government's announcement to reduce its stake in the company. This decision led to weak demand in the Offers For Sale (OFS), contributing to further price declines. Analysts suggest that based on current technical indicators, the stock may experience additional declines, potentially reaching the 90-92 level.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050588&language=en-US",
            "pub_date": "2026-02-26 22:49:10",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050567,
            "title": "Cryptocurrency Index Declines as Aptos and Aave Lead Losses",
            "description": "The CoinDesk 20 index experienced a 1.4% decline, with all constituent cryptocurrencies trading lower. According to NS3.AI, Aptos (APT) saw a significant drop of 11%, while Aave (AAVE) decreased by 6.6%. These declines were major contributors to the overall index drop recorded on Wednesday.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050567&language=en-US",
            "pub_date": "2026-02-26 22:38:58",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050566,
            "title": "Investigation into Source of Funds for Predictorxyz",
            "description": "Blockchain sleuth ZachXBT posted on X about his investigation into the source of funds for the account 'predictorxyz.' He noted that $70,000 in USDC was funded on a newly created prediction market account. The investigation aims to uncover the origins and legitimacy of these funds.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050566&language=en-US",
            "pub_date": "2026-02-26 22:40:14",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050565,
            "title": "Sweetgreen Faces Challenges Amid Operational Hurdles",
            "description": "Sweetgreen, the salad chain known for its innovative approach to fast food, is currently grappling with operational challenges. Bloomberg posted on X, highlighting issues such as soggy fries and lettuce shortages that have impacted the company's performance. These setbacks have proven costly and have hindered Sweetgreen's mission to transform the fast-food industry. The company is working to address these problems to maintain its reputation and customer satisfaction.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050565&language=en-US",
            "pub_date": "2026-02-26 22:40:20",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050564,
            "title": "MEV Capital's assets under management have fallen to approximately $300 million, a decrease of 80% in four months.",
            "description": "MEV Capital's assets under management (AUM) fell 80% in four months to approximately $300 million as of February 25, down from a peak of $1.5 billion in October 2025 (Source: DefiLlama). This decline follows the de-pegging of the stablecoin deUSD on October 10, 2024, which triggered automatic liquidations in multiple protocols, resulting in direct losses of over $10 million for the company (Source: The Big Whale). MEV Capital has offices in Vilnius and Dubai, a predominantly French team, and previously had significant exposure to yield strategies involving deUSD. The company's revenue also declined sharply. In the first quarter of 2026, its gross revenue from protocols was $804,720, a year-over-year decrease of 86.8% and a 92.4% decrease from $6,100,000 in the fourth quarter of 2025. Quarterly net income fell to $99,020 in the latest quarter from $608,910 in the fourth quarter of 2025. Regarding personnel, CEO Laurent Bourquin (a former Société Générale executive) has stepped down from public view, and approximately 10 of the original 15 employees have left. An insider stated that Bourquin is \"on break.\" Luxembourg-based Belem Capital announced on Wednesday that it has internalized the institutional asset management team of MEV Capital, ending the previous management authority and transferring all investment operations to Belem's internal platform. Belem Capital is a digital asset investment platform providing regulated DeFi exposure to institutional investors; this integration includes 10 asset management, risk, and technology experts. Meanwhile, tokenization protocol Midas announced on its X platform that it has appointed RockawayX as the strategy manager for its mMEV and mevBTC products, effective immediately. RockawayX manages approximately $2 billion in assets and will be responsible for ongoing risk monitoring and strategy oversight. Midas added that all pending redemptions have been processed at the latest verified price. (The Block)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050564&language=en-US",
            "pub_date": "2026-02-26 22:41:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050543,
            "title": "French Electricity Prices Reach Six-Year Low Amid Supply Surplus",
            "description": "French electricity prices have dropped to their lowest point in six years due to an oversupply in the market. Bloomberg posted on X, highlighting the challenges France faces in exporting the excess power in the upcoming months. The surplus has led to a significant decrease in prices, impacting the country's energy sector. As France grapples with this situation, the focus remains on finding solutions to manage the surplus effectively.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050543&language=en-US",
            "pub_date": "2026-02-26 22:30:58",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050538,
            "title": "US stocks opened with mixed results for the crypto sector, with Circle down 1.97%.",
            "description": "According to data from msx.com, at the opening of the US stock market, the Dow Jones Industrial Average rose 0.35%, the S&P 500 fell 0.04%, and the Nasdaq Composite fell 0.28%. Cryptocurrency stocks showed mixed performance: ETHZilla fell 1.58%, Circle fell 1.97%, Bit Digital fell 0.95%, Hut 8 rose 1.63%, and Coinbase fell 0.82%. msx.com is a decentralized RWA trading platform that has listed hundreds of RWA tokens, covering US stock and ETF tokens such as AAPL, AMZN, GOOGL, META, MSFT, NFLX, and NVDA.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050538&language=en-US",
            "pub_date": "2026-02-26 22:31:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050542,
            "title": "Solana's DeFi Development Invests in Stablecoin Protocol Apyx",
            "description": "Solana's DeFi Development, a Nasdaq-listed company, has announced a strategic investment in the stablecoin protocol Apyx. According to Odaily, the specific amount of the investment has not been disclosed. The move aims to establish an early presence in the emerging category of dividend-backed stablecoins (DBS). The Apyx model is designed to convert dividend flows into on-chain yields, offering scarce yield opportunities in the stablecoin market, which exceeds $300 billion. This aligns with the trend of digital asset treasury companies accumulating digital assets through preferred shares.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050542&language=en-US",
            "pub_date": "2026-02-26 22:31:11",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050541,
            "title": "Capital Management Proposes Acquisition of Reservoir Media",
            "description": "Activist hedge fund Capital Management has submitted an unsolicited bid to acquire Reservoir Media. Bloomberg posted on X, highlighting the hedge fund's strategic move to expand its portfolio in the music rights industry. Reservoir Media, known for its extensive catalog of music rights, has yet to respond to the offer. The proposal underscores the growing interest in music rights as a lucrative investment opportunity. Details of the offer, including the proposed acquisition price, have not been disclosed. The market will be closely watching Reservoir Media's response to this unexpected bid.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050541&language=en-US",
            "pub_date": "2026-02-26 22:31:43",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050520,
            "title": "Decibel, a full-chain transaction engine, has officially launched with a pre-deposited fund of $58 million.",
            "description": "Decibel, a full-chain trading engine incubated by Aptos Labs, has officially launched, allowing users to trade on-chain perpetual contracts based on Aptos' high-performance underlying infrastructure. The mainnet version features a full-chain limit order book that verifies all transactions, a transparent on-chain risk engine, a DLP liquidity pool co-developed with Gauntlet, and the X-Chain account system supporting funding from Aptos, Ethereum, Solana, and CEXs. It uses Bridge's native USD stablecoin usDCBL as the default collateral asset and is equipped with institutional-grade tools and an open Builder Codes developer layer. During the previous testnet phase, over 700,000 unique accounts and 132,000 daily active accounts were generated, with an average of over 1 million transactions per day, and $58 million in pre-deposited funds, approximately 50% of which came from Solana and Ethereum ecosystem users. In the future, Decibel plans to expand from the crypto perpetual market to the spot market, a unified account system, and multi-collateral structures, and explore on-chain deployments for real-world assets, stock indices, and foreign exchange markets, aiming to bring more institutional-grade trading traffic to the Aptos ecosystem.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050520&language=en-US",
            "pub_date": "2026-02-26 22:14:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050521,
            "title": "OpenAI Reports Issues with ChatGPT Usage",
            "description": "OpenAI has announced that there are currently some issues being experienced with the use of ChatGPT. According to Jin10, the company has acknowledged these problems and is working towards resolving them. Users have reported various difficulties, although specific details about the nature of these issues have not been disclosed. OpenAI is actively investigating the situation to ensure a smooth user experience. Further updates are expected as the company addresses these concerns.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050521&language=en-US",
            "pub_date": "2026-02-26 22:15:51",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050519,
            "title": "USDC and CCTP will be listed on Morph, providing cross-chain USD settlement and payment applications.",
            "description": "According to official news, USDC and the Circle Cross-Chain Transfer Protocol (CCTP) will be listed on Morph. USDC will be issued on Morph by a regulated entity affiliated with Circle, serving as a USD-denominated settlement asset within the network and providing a more consistent USD settlement basis for payment applications. CCTP will support USDC transfers between supported blockchains via burn-and-mint. It involves burning USDC on the source chain and natively minting it on the target chain, maintaining 1:1 supply consistency and standardized settlement behavior. Applications can choose between Standard Transfer or Fast Transfer modes as needed. Morph stated that USDC and CCTP will support USD settlement and cross-chain fund transfers in scenarios such as encrypted cards, cross-border remittances, payment gateways, and DeFi and trading, and will advance its payment settlement layer positioning together with Morph's $150 million Payment Accelerator program.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050519&language=en-US",
            "pub_date": "2026-02-26 22:16:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050518,
            "title": "An alleged insider placed $59,800 in bets three hours before ZachXBT announced allegations of insider trading involving Axiom employees, netting a profit of nearly $110,000.",
            "description": "According to Lookonchain's monitoring, three hours before ZachXBT announced that an Axiom employee was suspected of insider trading, a suspected insider placed bets of $59,800 through two newly created wallets, making a profit of nearly $109,000.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050518&language=en-US",
            "pub_date": "2026-02-26 22:17:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050499,
            "title": "Court Awards Record Legal Costs to MyForexFunds",
            "description": "A court has granted record legal costs to MyForexFunds, a simulated trading company, following a prolonged asset freeze lasting over two years. Bloomberg posted on X, highlighting the court's dissatisfaction with the conduct of the Canadian regulator responsible for investigating the platform. The decision marks a significant development in the ongoing legal proceedings surrounding the firm.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050499&language=en-US",
            "pub_date": "2026-02-26 22:09:38",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050498,
            "title": "ZachXBT Investigates Employee Misconduct Allegations At Axiom",
            "description": "Crypto sleuth ZachXBT posted on X, revealing that the platform he has been investigating is Axiom. In his X thread,  ZachXBT discloses that multiple employees of the cryptocurrency exchange Axiom Exchange are suspected of abusing their access to internal tools to track users' private wallet activities and engage in insider trading. ZachXBT stated that they were commissioned to independently investigate allegations of misconduct at Axiom. The investigation outlines that certain employees allegedly abused the lack of access controls for internal tools to lookup sensitive user details to insider trade by tracking private wallet activity since early 2025. In a clip attached in ZachXBT's X thread, a person can be heard stating he can track any Axiom user via referral code, wallet, or UID. The person is also heard describing researching 10-20 wallets initially and slowly increasing over time \"so it does not look that suspicious\".ZachXBT stated that he contacted the Axiom team earlier today for their input. He hopes that Axiom's co-founders will further investigate this incident and consider taking legal action against the employees involved.The Axiom team replied on X, with the following statement: \"We are shocked and disappointed to hear that someone on our team abused internal customer support tools to look up user wallets. We have removed access to these tools and will continue to investigate and hold the offending parties responsible. This does not represent us as a team, we have always tried to put the user first. We’ll share updates on our twitter as we learn more.\"",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050498&language=en-US",
            "pub_date": "2026-02-26 22:11:29",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050497,
            "title": "UK Households Face Rising Energy Debt Amid Falling Wholesale Prices",
            "description": "UK households are increasingly burdened by energy debt, even as wholesale prices have decreased from the peaks seen during the 2022 crisis. Bloomberg posted on X, highlighting the ongoing impact of the energy shock on consumers. Despite the retreat in wholesale prices, many households continue to struggle with the financial aftermath, indicating that the effects of the crisis are far from over. The situation underscores the challenges faced by consumers in managing energy costs, as the debt accumulation persists despite a more favorable pricing environment. This trend raises concerns about the long-term financial stability of households and the broader economic implications.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050497&language=en-US",
            "pub_date": "2026-02-26 22:11:48",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050496,
            "title": "Billionaire Resnicks Donate $100 Million to UCLA Health",
            "description": "Lynda and Stewart Resnick, the billionaire co-owners of the agricultural conglomerate the Wonderful Company, have pledged a $100 million donation to UCLA Health. Bloomberg posted on X, highlighting the significance of this contribution to the healthcare sector. The donation is intended to support medical research and patient care initiatives at UCLA Health, enhancing its capacity to deliver advanced healthcare services. This substantial gift underscores the Resnicks' ongoing commitment to philanthropy and their focus on improving health outcomes through strategic investments in medical institutions.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050496&language=en-US",
            "pub_date": "2026-02-26 22:12:29",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}