{
    "data": [
        {
            "id": 1053102,
            "title": "YZi Labs questioned 10X Capital's failure to disclose its over 5% stake in CEA Industries and requested that it submit SEC filings to explain.",
            "description": "YZi Labs issued a statement saying that its latest filings show that 10X Capital Asset Management LLC and its affiliates may have held more than 5% of the company's issued common stock by the end of 2025, but have not yet filed the Schedule 13D disclosure required by the U.S. Securities and Exchange Commission (SEC). YZi Labs noted that, according to publicly disclosed warrant exercise data, approximately 2.376 million warrants have been exercised, corresponding to approximately 5.39% of the company's issued shares. YZi Labs stated that it itself has not exercised the relevant warrants, therefore it speculates that these shares mainly come from 10X's affiliated entities. The statement also stated that 10X and its director Hans Thomas have not publicly disclosed their shareholding percentages, nor have they filed the required shareholding disclosure documents. YZi Labs urges the relevant parties to clarify their shareholding situation as soon as possible and disclose whether there is a \"related shareholding group\" that needs to be disclosed under Section 13(d)(3) of the Securities Exchange Act.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053102&language=en-US",
            "pub_date": "2026-02-28 11:58:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053105,
            "title": "Anthropic CEO Predicts Emergence of AI Nation Within Three Years",
            "description": "Anthropic CEO Dario Amodei has expressed confidence in the rapid development of artificial intelligence, suggesting that a nation composed of numerous intelligent entities could emerge within the next three years. According to Bitalk News, Amodei believes there is a 95% chance that within a decade, data centers will give rise to a 'nation of geniuses' powered by superintelligent systems. However, his intuition indicates that this could happen as soon as one to three years from now.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053105&language=en-US",
            "pub_date": "2026-02-28 12:00:25",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053101,
            "title": "BitMart US announces its official launch in the US market after obtaining regulatory approval in New York: covering the entire US, offering zero transaction fees across the platform, and fully implementing compliant operations.",
            "description": "BitMart US, a digital asset trading platform specifically designed for the US market, announced today that it has officially obtained regulatory approval from New York State, completing its nationwide operations across the United States. Currently, BitMart US has obtained compliance licenses in all 50 states and territories, becoming one of the cryptocurrency exchanges authorized to provide services throughout the US. BitMart US offers users a zero-fee trading experience across the entire platform, with no fees for transactions, fiat currency deposits, and withdrawals. This means users can retain more profit at every step from buying crypto assets to exchanging them back to USD. Daniel Huang, Chief Operating Officer of BitMart US, stated, “In expanding into the US market, we have always adhered to a steady and pragmatic approach, rather than rushing for quick results. Trust, transparency, and compliance credibility are at the core of our long-term development vision. BitMart US has been completely rebuilt from the ground up, solely to serve users across the US with compliance standards, a zero-fee experience, and product quality that meet the expectations of US users.” BitMart US is designed for two different but complementary user groups: US individual retail users and international institutional clients seeking compliant entry channels that meet US regulatory standards. The platform aims to serve everyday users with a simple and easy-to-use interface, while meeting the stringent needs of professional market participants with institutional-grade security, liquidity depth, and compliance infrastructure. BitMart US has strategically planned to launch more products and services throughout 2026, continuously enriching its product portfolio for retail and institutional users. Specific information on these new products will be released in the coming months.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053101&language=en-US",
            "pub_date": "2026-02-28 12:02:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053104,
            "title": "Launch of Pre-IPO Section Enables Investment in Tokenized Equity",
            "description": "Maitong MSX has announced a strategic partnership with Republic to introduce a Pre-IPO section, allowing eligible investors to participate in tokenized equity of unlisted companies. According to NS3.AI, this initiative will initially offer over $10 million in subscription quotas, featuring shares from more than ten prominent unicorns, including SpaceX and ByteDance. Republic will offer compliance support and custody through regulated third-party services, leveraging its previous experience with tokenized stock initiatives for major companies.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053104&language=en-US",
            "pub_date": "2026-02-28 12:02:04",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053098,
            "title": "CZ Shares Title of Personal Memoir, Editing in Progress",
            "description": "Binance founder and former CEO, Changpeng Zhao (CZ) posted on X. He shared that The New York Times has reported on his upcoming personal memoir titled \"Freedom of Money\", but the media coverage was based solely on an early draft and was unauthorized. CZ also revealed that the new book is still in the editing process, with each round of revisions typically taking 2 to 3 weeks, and the title is also subject to change.  ﻿",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053098&language=en-US",
            "pub_date": "2026-02-28 11:46:29",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053097,
            "title": "GEOPOLITICS | Cuban Embassy Reveals Details of Armed Infiltration Attempt from Florida",
            "description": "On February 28, the Cuban Embassy in the United States released new details regarding an attempted armed infiltration by American speedboats with alleged terrorist intentions. According to Jin10, the statement clarified that the operation involved two boats departing from Florida, not just one as previously thought. One of the boats experienced technical difficulties, prompting the crew to transfer to the other vessel, ultimately arriving at their destination aboard a single boat. Cuban authorities seized 134 magazines and a total of 12,846 rounds of ammunition of various calibers.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053097&language=en-US",
            "pub_date": "2026-02-28 11:47:48",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053096,
            "title": "Tether Freezes Billions in USDT Linked to Illicit Activities",
            "description": "Tether has taken significant action by freezing approximately $4.2 billion worth of USDT associated with illicit activities. According to NS3.AI, this includes $3.5 billion that has been frozen since 2023. Recently, Tether collaborated with the U.S. Department of Justice to freeze nearly $61 million connected to 'pig-butchering' scams. Despite these measures, the circulating supply of USDT remains above $180 billion. Tether continues to have the capability to freeze tokens remotely when requested by law enforcement.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053096&language=en-US",
            "pub_date": "2026-02-28 11:49:15",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053095,
            "title": "Bitcoin Trading Patterns Show Unique 'U-Shaped' Structure",
            "description": "Crypto KOL Murphy posted on X that recent data from URPD indicates a significant shift in Bitcoin trading patterns. Over the past week, 1.71 million BTC changed hands in the $63,000 to $68,000 range, up from 1.53 million BTC, suggesting that bulls have acquired 180,000 BTC in this period. This activity contrasts with the accumulation of 1.89 million BTC in the $87,000 to $92,000 range, creating a unique 'U-shaped' structure with a gap in the $71,000 to $80,000 range. This gap indicates that during the last price surge in October 2024, Bitcoin quickly surpassed this range without significant trading, and similarly, it dropped rapidly during the recent decline.\n\nThe $63,000 to $68,000 range is becoming increasingly robust, indicating that some investors see value in Bitcoin at these prices, potentially providing support. As long-term holders reduce their selling, there is potential to challenge the aforementioned gap again.\n\nBelow $63,000, the only significant accumulation is at $16,000, where 391,000 BTC remain untouched since the last bear market bottom. It is unlikely that Bitcoin will return to $16,000 in this cycle. If the $63,000 to $68,000 range is breached, predicting the next support level is challenging. It will depend on where bulls establish a new defense, potentially forming a 'W-shaped' structure with the current accumulation zone, which would be a remarkable phenomenon.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053095&language=en-US",
            "pub_date": "2026-02-28 11:53:58",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053092,
            "title": "U.S. Seized $580 Million From Crypto Scam Networks In Three Months",
            "description": "U. S. Attorney for the District of Columbia Jeanine Ferris Pirro announced this week that the newly formed strike force, operational since November 2025, has frozen and seized over $580 million in cryptocurrency assets tied to transnational fraud networks. The targets are the same organized crime operations that have quietly extracted billions from American victims for […] The post U\nsource: https://www.ethnews.com/u-s-seized-580-million-from-crypto-scam-networks-in-three-months/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053092&language=en-US",
            "pub_date": "2026-02-28 11:36:49",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053090,
            "title": "Maitong MSX plans to launch a Pre-IPO section, initially partnering with Republic to offer over ten million US dollars in unicorn IPO subscription quotas.",
            "description": "Decentralized RWA trading platform MSX has entered into a strategic partnership with Republic, a US-compliant private equity and asset tokenization platform, to launch a Pre-IPO section. This section will open access to assets from unlisted companies for eligible users, exploring the tokenization path for unlisted company equity assets. The initial allocation exceeds ten million US dollars, covering more than 10 top global unicorns, including SpaceX and ByteDance. Details regarding the specific list of targets and the amount released will be announced upon the official launch. Republic supports investors in participating in growth-stage company financing and alternative asset investments, holding related assets through regulated third-party custody institutions (such as BitGo Trust Company). Previously, Republic supported Robinhood's tokenized equity services for OpenAI and SpaceX launched in Europe.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053090&language=en-US",
            "pub_date": "2026-02-28 11:39:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053091,
            "title": "Uniswap Community Initiates Final Vote on Protocol Fee Switch Across Multiple Chains",
            "description": "Uniswap's community has launched a final vote on enabling protocol fee switches across eight chains, including Base, Arbitrum, OP Mainnet, World Chain, X Layer, Celo, Soneium, and Zora. According to Odaily, the proposal aims to redirect at least one-sixth of transaction fees from liquidity provider income into a 'token jar,' distributing equivalent UNI to holders through a burning mechanism. Since the fee-sharing began on Ethereum's mainnet v2 and some v3 pools late last year, approximately $3.3 million in revenue has been generated. The current plan also intends to cover the remaining v3 pools on Ethereum. The two related final votes are set to conclude on March 4.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053091&language=en-US",
            "pub_date": "2026-02-28 11:40:20",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053089,
            "title": "CZ: My personal memoir, *Freedom of Money*, is coming soon.",
            "description": "CZ stated on social media that The New York Times had reported on her upcoming memoir, *Freedom of Money*, but the report was based on an early draft and was published without authorization. CZ's lawyer, Teresa Goody Guillén, stated that the content cited in the report was neither in the final manuscript nor a statement by CZ herself. She expressed her hope that readers would enjoy the full version after the book's official publication. CZ also revealed that the book is still being edited, with each revision typically taking two to three weeks, and the official release date will be announced later.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053089&language=en-US",
            "pub_date": "2026-02-28 11:41:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053088,
            "title": "Tech Employees Support Anthropic's Ethical Stance on AI Military Use",
            "description": "Over 300 Google employees and more than 60 OpenAI staff have signed an open letter backing Anthropic in its ethical stance against military applications of its AI technology. According to Jin10, the letter urges tech leaders to respect Anthropic's ethical limitations concerning the use of AI in military contexts. This move highlights ongoing debates within the tech industry regarding the ethical implications of AI deployment in defense sectors.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053088&language=en-US",
            "pub_date": "2026-02-28 11:32:16",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053087,
            "title": "Latin America's Crypto User Growth Expected to Triple U.S. Rate by 2025",
            "description": "According to ChainCatcher, a report from Argentine crypto exchange Lemon reveals that Latin America's monthly active crypto users are projected to grow at three times the rate of the United States by 2025. The region's annual digital asset reception is expected to exceed $730 billion, marking a growth of over 60% and accounting for 10% of the global total.\n\nThe report highlights significant regional disparities. Brazil leads in capital scale with a reception exceeding $318 billion, driven by institutional trading and integration with local payment systems, showing an annual growth of nearly 250%. Argentina boasts the highest per capita monthly active user ratio, with a penetration rate reaching 12% of the total population, accounting for over a quarter of the region's activity.\n\nIn high-inflation economies like Argentina and Venezuela, users tend to use crypto assets as a store of value, with USDT widely adopted in everyday transactions in Venezuela. Meanwhile, more stable markets such as Peru and Colombia focus on financial returns. Stablecoins are identified as the key factor driving regional adoption, with continued rapid growth anticipated through 2025.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053087&language=en-US",
            "pub_date": "2026-02-28 11:33:37",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053083,
            "title": "Amundi Significantly Increases Stake in Strategy",
            "description": "Crypto Jargon posted on X. Amundi has significantly increased its stake in Strategy, boosting its holdings by 373%. The investment firm now holds a total of 4.79 million shares, valued at approximately $641 million. This move reflects the growing trend of indirect exposure to Bitcoin, as more traditional financial institutions seek to capitalize on the cryptocurrency market's potential.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053083&language=en-US",
            "pub_date": "2026-02-28 11:19:40",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053082,
            "title": "Crypto Traders Influenced by Headlines and Algorithms",
            "description": "Santiment posted on X that most cryptocurrency traders tend to react primarily to headlines and the information presented by their timeline algorithms. This behavior highlights the significant influence of media and algorithm-driven content on trading decisions in the crypto market. The post suggests that traders often rely on these sources to guide their investment strategies, which can lead to reactive rather than proactive decision-making. Understanding this trend is crucial for market participants aiming to navigate the volatile crypto landscape effectively.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053082&language=en-US",
            "pub_date": "2026-02-28 11:19:59",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053081,
            "title": "Nvidia will launch a dedicated AI inference chip, with OpenAI potentially becoming one of its major customers.",
            "description": "NVIDIA is about to launch a dedicated processing chip for artificial intelligence inference scenarios, designed to improve AI query processing speed and enhance model responsiveness. Reports indicate that OpenAI is expected to be one of the major customers for this new processor. The chip focuses on optimizing the inference performance of AI models in real-world applications and is expected to be officially released at the NVIDIA GTC developer conference in San Jose next month. (Wall Street Journal)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053081&language=en-US",
            "pub_date": "2026-02-28 11:21:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053080,
            "title": "Uniswap has initiated a final vote on the multi-chain fee switch, proposing to allocate a portion of the fees to UNI holders.",
            "description": "The Uniswap community has launched a final vote on enabling protocol fee switching on eight chains: Base, Arbitrum, OP Mainnet, World Chain, X Layer, Celo, Soneium, and Zora. The proposal suggests allocating at least one-sixth of transaction fees from liquidity providers' revenue to a \"token jar,\" which will then be distributed to token holders by burning an equivalent amount of UNI. Previously, Ethereum mainnet v2 and some v3 pools have generated approximately $3.3 million in revenue since fee sharing began at the end of last year. This proposal also plans to cover the remaining Ethereum v3 pools. The two final votes will conclude on March 4th. (DL News)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053080&language=en-US",
            "pub_date": "2026-02-28 11:22:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053078,
            "title": "Nvidia Prepares to Launch Dedicated AI Chip, OpenAI Set to Be Major Customer",
            "description": "Nvidia is reportedly gearing up to introduce a specialized chip aimed at transforming the competitive landscape in AI computing. According to Jin10, OpenAI is expected to become one of the largest customers for Nvidia's new processor. This development marks a significant move in the tech industry, as Nvidia seeks to strengthen its position in the rapidly evolving AI sector.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053078&language=en-US",
            "pub_date": "2026-02-28 11:06:18",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053077,
            "title": "Nvidia CEO Jensen Huang: AI Revolutionizing Industries with New Software Development Approach",
            "description": "Nvidia CEO Jensen Huang has emphasized the transformative impact of artificial intelligence on software development. According to Bitalk News, Huang stated that AI has recently reached its third major turning point, with AI agents now capable of reasoning, accepting tasks, and completing computational work. The demand for AI has surged to unprecedented levels. Huang highlighted that AI fundamentally represents a new method of software development, influencing every company and transforming every industry, driven collectively by nations worldwide. This marks a new industrial revolution.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053077&language=en-US",
            "pub_date": "2026-02-28 11:06:51",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}