{
    "data": [
        {
            "id": 1050828,
            "title": "Flare Network and Xaman Finance Enhance DeFi Access for XRP Holders",
            "description": "Flare Network has teamed up with Xaman Finance to streamline decentralized finance (DeFi) access for XRP holders. According to NS3.AI, this collaboration enables users to deposit XRP into yield-generating vaults with a single transaction, removing the need for manual asset bridging or exiting current wallets. This integration could activate over 2 billion XRP that are currently inactive, potentially boosting XRP's utility in DeFi and expanding yield-generation opportunities for its holders.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050828&language=en-US",
            "pub_date": "2026-02-27 01:09:50",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050827,
            "title": "Jefferies Shares Decline 6.1% Amid Exposure to Defunct UK Lender",
            "description": "Jefferies Financial Group's stock experienced a 6.1% drop following reports of its £100 million exposure to the now-defunct UK lending institution, Market Financial Solutions. According to Jin10, the financial services company is facing potential losses due to its involvement with the collapsed lender. The situation has raised concerns among investors about the impact on Jefferies' financial stability and future performance. The exposure highlights the risks associated with lending to institutions that may face financial difficulties, prompting a reevaluation of investment strategies within the company. The market's reaction underscores the sensitivity to financial vulnerabilities in the current economic climate.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050827&language=en-US",
            "pub_date": "2026-02-27 01:10:03",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050826,
            "title": "U.S. President Donald Trump to Meet New York City Mayor in Washington on Thursday",
            "description": "U.S. President Donald Trump is scheduled to meet with New York City Mayor Manhattan in Washington on Thursday, according to Jin10. The meeting is expected to address various issues pertinent to both the federal and city governments. This engagement comes amid ongoing discussions about urban development and federal support for local initiatives. The agenda for the meeting has not been disclosed, but it is anticipated to cover topics of mutual interest and concern.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050826&language=en-US",
            "pub_date": "2026-02-27 01:11:32",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050825,
            "title": "Court Sets Deadline for Government Response to Sam Bankman-Fried's Retrial Request",
            "description": "A court in the Southern District of New York has set a deadline of March 11 for the government to respond to Sam Bankman-Fried's request for a retrial. According to NS3.AI, the former FTX founder is seeking a retrial based on new testimony that could influence his case. His initial 25-year sentence and $11.02 billion forfeiture were overturned on appeal.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050825&language=en-US",
            "pub_date": "2026-02-27 01:11:58",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050814,
            "title": "PRECIOUS METALS | Silver Prices Surge 25% in Eight Days Amid Inventory Concerns",
            "description": "Silver prices have surged by 25% over the past eight days, raising alarms about potential inventory shortages. According to Jin10, media reports have highlighted concerns over dwindling silver supplies, but questions remain about the accuracy of these claims. Some analysts suggest that the warnings of a 'short squeeze' may be exaggerated or manipulated by certain market players. The rapid price increase has sparked debates among investors about the true state of silver inventories and the potential for further market volatility.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050814&language=en-US",
            "pub_date": "2026-02-27 01:01:34",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050813,
            "title": "BNP Paribas' UK Success and LSEG's Buyback Announcement",
            "description": "BNP Paribas is experiencing a successful period in the UK market. Bloomberg posted on X, highlighting the bank's recent achievements. Meanwhile, the London Stock Exchange Group (LSEG) has announced a significant share buyback program. Additionally, a competitive bidding process has commenced for the acquisition of asset manager Janus Henderson. These developments mark notable movements in the financial sector.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050813&language=en-US",
            "pub_date": "2026-02-27 01:02:39",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050812,
            "title": "GEOPOLITICS | Ukrainian Delegation Departs from Talks with U.S.",
            "description": "A Ukrainian delegation has reportedly left the meeting location with the United States, according to Jin10. The departure comes amid ongoing geopolitical tensions and discussions between the two nations. The specifics of the talks and the reasons for the delegation's exit remain unclear, highlighting the complex nature of international relations in the region. Further developments are anticipated as both countries navigate their diplomatic engagements.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050812&language=en-US",
            "pub_date": "2026-02-27 01:03:48",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050811,
            "title": "Flavio Bolsonaro's Presidential Bid Gains Momentum",
            "description": "Flavio Bolsonaro's campaign for the presidency of Brazil is gaining traction, defying initial skepticism about the seriousness of his candidacy. Bloomberg posted on X, highlighting the unexpected progress of his political ambitions. As the son of former President Jair Bolsonaro, Flavio is leveraging his political lineage to strengthen his position in the race. Observers are now taking his campaign more seriously as he ramps up efforts to secure support across the nation. The evolving dynamics of his candidacy are drawing increased attention from both supporters and critics alike.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050811&language=en-US",
            "pub_date": "2026-02-27 01:03:52",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050807,
            "title": "Ethereum(ETH) Drops Below 2,000 USDT with a 2.04% Decrease in 24 Hours",
            "description": "On Feb 26, 2026, 16:46 PM(UTC). According to Binance Market Data, Ethereum has dropped below 2,000 USDT and is now trading at 1,995.650024 USDT, with a narrowed 2.04% decrease in 24 hours.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050807&language=en-US",
            "pub_date": "2026-02-27 00:46:08",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050806,
            "title": "Concerns Raised Over Misuse of Internal Tools at Axiom Exchange",
            "description": "Blockchain sleuth ZachXBT posted on X, highlighting concerns about the misuse of internal tools at Axiom Exchange. He noted that many individuals attacking him appear indifferent to the alleged abuse by business developers and moderators, suggesting that they might benefit from the information or believe it could affect referral links. ZachXBT's comments have sparked discussions about the ethical use of internal resources within the exchange community.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050806&language=en-US",
            "pub_date": "2026-02-27 00:48:20",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050805,
            "title": "PayPal Denies Sale Talks with Stripe Amid Acquisition Speculations",
            "description": "PayPal has officially denied rumors of being in sale discussions with Stripe. According to NS3.AI, the company is actively preparing for potential unsolicited takeover attempts or campaigns by activist shareholders. Previous reports had indicated that Stripe was contemplating an acquisition of PayPal, but these claims have been dismissed as unfounded by Semafor.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050805&language=en-US",
            "pub_date": "2026-02-27 00:48:37",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050793,
            "title": "UK Lifts Ban on Crypto ETNs for Retail Investors",
            "description": "The United Kingdom has removed the restriction on retail investors accessing cryptocurrency Exchange-Traded Notes (ETNs). According to NS3.AI, this policy change allows crypto ETNs to be included in Individual Savings Accounts (ISAs), potentially increasing their adoption among retail investors. UK investors have until April to incorporate these crypto ETNs into their ISAs.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050793&language=en-US",
            "pub_date": "2026-02-27 00:38:07",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050790,
            "title": "BlackRock withdrew 4,309 BTC from Coinbase in the past hour, worth nearly $290 million.",
            "description": "According to Onchain Lens monitoring, BlackRock withdrew 4,309 BTC from Coinbase in the past hour, worth nearly $290 million, and there may be further withdrawals in the future.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050790&language=en-US",
            "pub_date": "2026-02-27 00:40:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050792,
            "title": "Global Deal-Making Influences Highlighted at Qatar Economic Forum",
            "description": "The Qatar Economic Forum has sparked discussions on the primary forces driving global deal-making today. Bloomberg posted on X, highlighting a poll conducted during the event to gauge opinions on the most significant influences in the current economic landscape. The forum serves as a platform for leaders and experts to exchange insights on economic trends and strategies. Participants are keen to understand the evolving dynamics that shape international business transactions and investments. The event underscores the importance of collaboration and innovation in navigating the complexities of the global market.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050792&language=en-US",
            "pub_date": "2026-02-27 00:40:56",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050791,
            "title": "Vanguard Settles Energy Market Manipulation Lawsuit for $29.5 Million",
            "description": "Vanguard has agreed to pay $29.5 million to resolve a lawsuit filed by twelve states, including Texas, which accused the asset management firm of colluding to manipulate the energy market and decrease coal production. Bloomberg posted on X that the settlement addresses allegations that Vanguard engaged in practices that negatively impacted coal output. The lawsuit claimed that these actions were part of a broader strategy to influence energy market dynamics. The resolution of this case marks a significant development in the ongoing scrutiny of asset managers' roles in energy market operations. Vanguard's settlement is seen as a step towards addressing concerns over market manipulation and its effects on coal production.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050791&language=en-US",
            "pub_date": "2026-02-27 00:41:31",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050781,
            "title": "Spelling Error Sparks Online Debate",
            "description": "Blockchain sleuth ZachXBT posted on X about a humorous exchange regarding the spelling of 'Brooks' as 'Broox.' The conversation, involving users @dannydope and @WheresBroox, highlighted the playful nature of online interactions, with one user jokingly suggesting that the misspelling could be considered more criminal than other offenses. The lighthearted banter reflects the casual and informal communication style often found on social media platforms.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050781&language=en-US",
            "pub_date": "2026-02-27 00:24:12",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050780,
            "title": "GEOPOLITICS | Trump Administration Seeks to Retain $133 Billion in Tariffs Despite Court Ruling",
            "description": "The Trump administration is exploring methods to maintain $133 billion in tariffs, even after a Supreme Court ruling declared the collections illegal. According to NS3.AI, potential strategies involve redesigning the tariff system and minimizing refunds to companies. These actions are likely to face judicial scrutiny. The refund process could extend over several years, affecting federal finances and eliciting opposition from businesses and the Democratic Party.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050780&language=en-US",
            "pub_date": "2026-02-27 00:27:18",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050779,
            "title": "Arif Joshi Joins Bramshill Investments to Launch Emerging Markets Hedge Fund",
            "description": "Arif Joshi, previously the co-head of emerging-market debt at Lazard Asset Management, is set to join Bramshill Investments. Bloomberg posted on X that Joshi will assist in launching a hedge fund targeting opportunities in developing markets. This move highlights Bramshill's strategic expansion into emerging markets, leveraging Joshi's expertise in the sector.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050779&language=en-US",
            "pub_date": "2026-02-27 00:32:39",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050773,
            "title": "Cryptocurrency Market Sees Notable Gains and Losses",
            "description": "According to ChainCatcher, data from Coinmarketcap reveals the performance of the top 100 cryptocurrencies by market capitalization. Leading the gains, PIPPIN (PIPPIN) rose by 22.06%, currently priced at $0.877. Decred (DCR) increased by 9.74%, with a current price of $31.37. JUST (JST) saw a 7.43% rise, now at $0.04727. Polkadot (DOT) gained 6.38%, priced at $1.62, and Canton (CC) rose by 5.63%, with a current price of $0.1706.\n\nOn the other hand, Cosmos (ATOM) experienced the largest decline, dropping 11.04% to $1.87. Pepe (PEPE) fell by 6.85%, now priced at $0.000053897. Aave (AAVE) decreased by 6.02%, with a current price of $114.11. Kite (KITE) saw a 5.63% drop, priced at $0.2567, and Bitcoin Cash (BCH) fell by 5.56%, currently at $489.93.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050773&language=en-US",
            "pub_date": "2026-02-27 00:13:58",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050772,
            "title": "GEOPOLITICS | EU Delegation Meets Syrian Foreign Minister to Discuss Relations",
            "description": "Syrian Foreign Minister Assad Hassan Al-Shibani met with a European Union diplomatic delegation in Damascus to discuss the future of bilateral relations. According to Jin10, the meeting focused on the prospects for developing ties between Syria and the EU. The delegation confirmed that the EU will continue to support the Syrian government's efforts and anticipates upgrading the diplomatic status of its mission in Damascus soon.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050772&language=en-US",
            "pub_date": "2026-02-27 00:17:23",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}