{
    "data": [
        {
            "id": 1054026,
            "title": "Telegram Wallet Offers Up to 18% Yield on USDT, Here’s What Changed",
            "description": "Telegram’s TON Wallet has introduced on-chain yield vaults that allow users to earn returns on Bitcoin, Ethereum, and Tether directly within the wallet. The feature expands the wallet’s role from asset storage and transfers into yield generation using decentralized finance infrastructure. com\nsource: https://techgaged.com/telegram-wallet-offers-up-to-18-yield-on-usdt-heres-what-changed/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054026&language=en-US",
            "pub_date": "2026-03-01 07:40:23",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054025,
            "title": "Grayscale Research Calls the Current Drawdown a Mid-Cycle Transition, Not a Crypto Winter",
            "description": "Grayscale Managing Director of Research Zach Pandl has rejected the crypto winter narrative following Bitcoin’s 45% drawdown, characterizing the recent price action as a macroeconomic de-risking process driven by global monetary conditions rather than any fundamental failure of digital assets, and maintaining a bullish outlook targeting new all-time highs in late 2026.\nsource: https://www.ethnews.com/grayscale-research-calls-the-current-drawdown-a-mid-cycle-transition-not-a-crypto-winter/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054025&language=en-US",
            "pub_date": "2026-03-01 07:45:24",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054024,
            "title": "U.S. Energy Department Rules Out Strategic Oil Reserve Release",
            "description": "The U.S. Energy Department has stated that it is not considering releasing oil from the Strategic Petroleum Reserve. According to Jin10, this decision comes amid ongoing discussions about energy supply and market stability. The announcement aims to address concerns over potential disruptions in the oil market. The Strategic Petroleum Reserve is a critical tool for managing energy resources and ensuring national security. The department's stance reflects a cautious approach to maintaining reserve levels while monitoring global energy dynamics.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054024&language=en-US",
            "pub_date": "2026-03-01 07:50:26",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054018,
            "title": "Iran denies Khamenei death as claims remain unverified",
            "description": "Israeli officials and Trump claim Ayatollah Ali Khamenei death; Iranian outlets deny it. Status unverified; analysts cite succession rules and regional risk.\nsource: https://coincu.com/news/iran-denies-khamenei-death-as-claims-remain-unverified/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054018&language=en-US",
            "pub_date": "2026-03-01 07:26:40",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054017,
            "title": "BULLISH: BITCOIN ETF INVESTORS SHOW \"DIAMOND HANDS\" AND \"ABSURD STRENGTH\"\n\nHighlighting the $6-6.5 billion that has flowed out of $BTC ETFs since October price highs, two top ETF analysts have highlighted the incredible staying power of investors...\n\n\"ETF investors have largely",
            "description": "null\nsource: https://x.com/BSCNews/status/2027888545684193354",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054017&language=en-US",
            "pub_date": "2026-03-01 07:28:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054016,
            "title": "Israeli Military Identifies Seven Iranian Officials Allegedly Killed",
            "description": "The Israeli military announced on social media platform X at approximately 5 a.m. UTC+8 on Sunday that it has identified seven high-ranking Iranian military and political figures it claims have been killed. According to Ming Pao, the list includes Defense Minister Aziz Nasirzadeh, head of the Supreme Leader's Military Office Mohammad Shirazi, Secretary of the Defense Council Ali Shamkhani, Commander of the Revolutionary Guards Mohammad Pakpour, former head of the Defense Innovation and Research Organization (SPND) Reza Mozaffari-Nia, and Revolutionary Guards Intelligence Chief Saleh Asadi.\n\nAli Shamkhani, noted as a close confidant of Supreme Leader Ayatollah Ali Khamenei, was considered a potential candidate to assume power in the event of Khamenei's assassination. The announcement has not been independently verified, and the circumstances surrounding the alleged deaths remain unclear.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054016&language=en-US",
            "pub_date": "2026-03-01 07:36:42",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054008,
            "title": "Here’s why Stellar’s (XLM) price action may be at the risk of a 28% drop",
            "description": "XLM's price action is in a tricky spot right now.\nsource: https://ambcrypto.com/heres-why-stellars-xlm-price-action-may-be-at-the-risk-of-a-28-drop/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054008&language=en-US",
            "pub_date": "2026-03-01 07:00:14",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054007,
            "title": "HUGE: For the first time in history, the construction of Data Centers has surpassed the construction of General Offices.",
            "description": "null\nsource: https://x.com/cointelegraph/status/2027881692258546030",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054007&language=en-US",
            "pub_date": "2026-03-01 07:00:46",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054006,
            "title": "War and Peace of Crypto: US–Iran Escalation, Hormuz Risk, and the Future of Bitcoin in Wartime Economies",
            "description": "The US–Iran escalation and Hormuz Strait risk could trigger an oil shock and global macro stress. This analysis explores implications for Bitcoin and crypto. <p>The post War and Peace of Crypto: US–Iran Escalation, Hormuz Risk, and the Future of Bitcoin in Wartime Economies first appeared on Crypto News And Market Updates | BTCUSA. </p>\nsource: https://btcusa.com/war-and-peace-of-crypto-us-iran-escalation-hormuz-risk-and-the-future-of-bitcoin-in-wartime-economies/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054006&language=en-US",
            "pub_date": "2026-03-01 07:06:06",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054005,
            "title": "Israel's Strategic Influence in the Middle East: A Comprehensive Overview",
            "description": "The Long View, institutional investor, posted on X, highlighting Israel's significant impact on regional dynamics in the Middle East. The analysis underscores Israel's strategic actions across various neighboring territories, emphasizing its ability to decisively influence outcomes.\n\nIn Lebanon, Israel's technological advancements, such as 'magic beepers,' have played a crucial role in its defense strategy. Meanwhile, in Syria, the presence of a 'rebel' army has been a focal point in the ongoing conflict, with Israel's involvement shaping the military landscape.\n\nGaza has faced severe challenges, with the region often described as a rubble or graveyard due to continuous conflicts. Israel's military operations have significantly affected the area's stability and infrastructure.\n\nYemen has experienced precision strikes, showcasing Israel's capability to execute targeted military actions. These operations have contributed to the broader geopolitical shifts in the region.\n\nIran has been subjected to activist campaigns and the establishment of new boards, reflecting Israel's strategic efforts to counter Iranian influence. This approach is part of a broader initiative to address the Shia arc, which has seen significant changes.\n\nOverall, the analysis suggests that Israel's strategic maneuvers have effectively altered the balance of power in the Middle East, with implications for regional stability and future developments.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054005&language=en-US",
            "pub_date": "2026-03-01 07:09:33",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054004,
            "title": "Buying Bitcoin Is Easy. Keeping It Liquid and Intact Is Where People Break",
            "description": "You completed the purchase, the trade cleared, and the balance appeared. Then a withdrawal stalled under “review,” or a transfer you signed moved funds somewhere irreversible. Nothing crashed. No protocol failed\nsource: https://techgaged.com/buying-bitcoin-is-easy-keeping-it-liquid-and-intact-is-where-people-break/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054004&language=en-US",
            "pub_date": "2026-03-01 06:53:40",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054003,
            "title": "Ethereum Is Sitting on Its Last Major Trendline Support – The Weekly Close Will Tell the Story",
            "description": "Ethereum is trading at $1,896 at the time of writing, pressing against an ascending trendline that technical analysts identify as the final higher-timeframe higher low structure remaining in the current cycle, with the weekly close now carrying outsized significance for whether the asset stabilizes or confirms a broader trend breakdown.\nsource: https://www.ethnews.com/ethereum-is-sitting-on-its-last-major-trendline-support-the-weekly-close-will-tell-the-story/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054003&language=en-US",
            "pub_date": "2026-03-01 06:54:17",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053997,
            "title": "Michael Saylor Highlights Bitcoin's Historical Challenge",
            "description": "Michael Saylor, co-founder of MicroStrategy, has pointed out that Bitcoin's main vulnerability lies in its relatively brief 17-year history, rather than any inherent technical or economic issues. According to NS3.AI, Saylor drew parallels between Bitcoin's adoption process and the historical adoption of significant technologies such as electricity and automobiles, which required decades to achieve widespread acceptance. He suggests that Bitcoin is currently in a phase of commercialization, with time being a crucial element for its broader acceptance.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053997&language=en-US",
            "pub_date": "2026-03-01 06:38:53",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053996,
            "title": "Morgan Stanley Seeks National Trust Bank Charter for Crypto Custody",
            "description": "Morgan Stanley has applied for a national trust bank charter to custody cryptocurrencies, marking a significant step in its deeper involvement in the crypto industry. According to NS3.AI, this move is part of a broader trend where major financial institutions are pursuing banking licenses to manage digital assets and provide traditional banking services. Since 2021, Morgan Stanley has been expanding its crypto offerings, including Bitcoin funds and plans for Bitcoin and Ethereum ETFs.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053996&language=en-US",
            "pub_date": "2026-03-01 06:38:58",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053995,
            "title": "Iranian Major General Abdollahi on War's Conclusion",
            "description": "Iranian Major General Abdollahi has stated that the ultimate decision regarding the end of the war will rest with Iran. According to Jin10, Abdollahi emphasized Iran's role in determining the outcome of the conflict. This statement highlights Iran's strategic position and influence in the ongoing situation. The remarks come amid heightened tensions and underscore the complexities involved in reaching a resolution.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053995&language=en-US",
            "pub_date": "2026-03-01 06:44:04",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053998,
            "title": "Iranian First Vice President Aref announced plans to take full control of Iran under \"wartime conditions\".",
            "description": "Market news: Iran's First Vice President Aref announced plans to take full control of Iran under \"wartime conditions\".",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053998&language=en-US",
            "pub_date": "2026-03-01 06:46:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053991,
            "title": "GEOPOLITICS | Iran's First Vice President Announces Plans for Wartime Control",
            "description": "Iran's First Vice President, Aref, has announced plans to assume full control of the country under wartime conditions. According to Jin10, this move comes amid escalating tensions and challenges faced by Iran on both domestic and international fronts. The announcement signals a significant shift in Iran's governance strategy, potentially impacting regional stability and geopolitical dynamics. Observers are closely monitoring the situation as Iran navigates these complex circumstances.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053991&language=en-US",
            "pub_date": "2026-03-01 06:27:25",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053990,
            "title": "Controversial Social Media Post Sparks Debate on Racism",
            "description": "A recent post on social media has ignited a heated discussion about racism and online behavior. Blockchain sleuth ZachXBT posted on X, highlighting a comment made by a user identified as @mert. The user questioned whether changing their profile picture would permit them to engage in racist behavior. \n\nThe post has drawn widespread criticism, with many users condemning the notion that any change in online identity could justify discriminatory actions. The incident underscores ongoing concerns about racism and accountability on social media platforms. \n\nThis event has prompted discussions about the responsibilities of social media users and the platforms themselves in preventing and addressing harmful content. The debate continues as users call for stricter regulations and more effective moderation to combat racism online.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053990&language=en-US",
            "pub_date": "2026-03-01 06:30:30",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053989,
            "title": "GEOPOLITICS | Iranian Ambassador to UN Reports Civilian Casualties from US-Israeli Attacks",
            "description": "Iran's Ambassador to the United Nations has reported that recent attacks by the United States and Israel have resulted in hundreds of civilian casualties. According to Jin10, the ambassador highlighted the severe impact of these military actions on non-combatants, emphasizing the urgent need for international attention and intervention. The statement underscores the escalating tensions in the region and calls for a reassessment of military strategies to prevent further loss of civilian lives.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053989&language=en-US",
            "pub_date": "2026-03-01 06:35:25",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053988,
            "title": "BNB Surpasses 620 USDT with a 1.99% Increase in 24 Hours",
            "description": "On Feb 28, 2026, 22:36 PM(UTC). According to Binance Market Data, BNB has crossed the 620 USDT benchmark and is now trading at 620.119995 USDT, with a narrowed 1.99% increase in 24 hours.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053988&language=en-US",
            "pub_date": "2026-03-01 06:36:08",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}