{
    "data": [
        {
            "id": 1050157,
            "title": "Hong Kong Exchange Explores Multi-Asset Tokenization Platform",
            "description": "Hong Kong Exchange CEO, Chan Yi-ting, announced the exploration of a tokenization platform designed to support diverse assets, rather than focusing solely on tokenized stocks or bonds. According to RTHK, the feasibility and timing of this initiative depend on technological support and market demand. Chan emphasized the exchange's aim for diversification across various products while acknowledging the competitive landscape. She noted the distinct requirements between traditional securities and digital asset trading, stressing careful consideration.\n\nMarket Director, Yu Xueqin, highlighted that the future direction of the Hong Kong Exchange includes a multi-asset investment product platform. This platform will encompass stock futures, fixed income, gold futures, and will advance commodity products and more individual stock options. Yu also mentioned ongoing efforts to introduce zero-day options (0DTE) as soon as possible.\n\nChief Financial Officer, Xu Lianghua, underscored the importance of investing in future products and platforms. He assured that after distributing the second interim dividend, the group retains corporate funds ranging from 20 to 30 billion HKD for investment purposes, affirming that the exchange faces no financial issues.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050157&language=en-US",
            "pub_date": "2026-02-26 19:06:13",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050156,
            "title": "GEOPOLITICS | Trump Advocates for FEMA to Withdraw from Disaster Preparedness",
            "description": "U.S. President Donald Trump has expressed his desire for the Federal Emergency Management Agency (FEMA) to cease its involvement in preparing for natural disasters. Bloomberg posted on X that his administration has quietly dismantled a program designed to assist individuals in disaster readiness. This move aligns with Trump's broader approach to reduce federal oversight and shift responsibilities to state and local governments. Critics argue that this decision could leave communities vulnerable, especially in areas prone to natural disasters. The dismantled program previously offered resources and guidance to help citizens prepare for emergencies, aiming to enhance resilience and response capabilities. Trump's stance reflects his administration's focus on decentralizing disaster management, emphasizing local autonomy over federal intervention. The implications of this policy shift are yet to be fully realized, as communities assess their preparedness in the absence of federal support.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050156&language=en-US",
            "pub_date": "2026-02-26 19:06:20",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050155,
            "title": "South Korea Proposes Legislation for Influencer Transparency in Crypto",
            "description": "South Korea's ruling party is set to introduce a new bill that mandates financial and cryptocurrency influencers to disclose their asset holdings and any paid promotions. According to NS3.AI, the legislation aims to enhance transparency in the advice shared on social media and mass media platforms. This initiative seeks to address influencer marketing practices within the cryptocurrency sector to safeguard consumers.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050155&language=en-US",
            "pub_date": "2026-02-26 19:07:09",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050154,
            "title": "Strategy's Preferred Equity Sees Increased Corporate Adoption as Price Rebounds",
            "description": "Three companies have incorporated Strategy's preferred equity, STRC, into their treasuries as its share price returns to the par value of $100. According to NS3.AI, this development occurred during the Strategy World 2026 event, underscoring a rise in corporate adoption of STRC. The price recovery indicates growing confidence and strong demand in the market for Strategy's preferred equity.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050154&language=en-US",
            "pub_date": "2026-02-26 19:08:42",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050147,
            "title": "Bitcoin Futures Premium Declines Without Reaching Backwardation",
            "description": "Bitcoin futures on the Chicago Mercantile Exchange (CME) are currently exhibiting a reduced premium, though the market has not transitioned into backwardation, a condition observed during previous market bottoms. According to NS3.AI, the prices of longer-dated futures continue to exceed spot prices, resulting in a flat futures curve. Historical patterns suggest that backwardation and a significant drop in price basis were indicators of market bottoms in 2018 and 2022. This implies that Bitcoin has not yet entered a capitulation phase.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050147&language=en-US",
            "pub_date": "2026-02-26 18:54:20",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050146,
            "title": "Ethereum's Ploutus Protocol Suffers $390,000 Loss Due to Oracle Misconfiguration",
            "description": "A liquidity pool on the Ethereum-based Ploutus protocol was attacked, resulting in a loss of approximately $390,000. According to Odaily, the incident occurred due to a misconfiguration in the oracle setup, which incorrectly linked the USDC price to Chainlink's BTC/USD feed, causing a significant price deviation. The attacker exploited this vulnerability by using only 8 USDC as collateral to borrow 187 ETH. On-chain data indicates that the attack transaction took place in the block immediately following the confirmation of the configuration change, suggesting that the attacker may have been monitoring the updates in real-time and acted swiftly to exploit the parameter update.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050146&language=en-US",
            "pub_date": "2026-02-26 18:55:36",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050145,
            "title": "Security Concerns Arise Over Smart Home Devices After Programmer's Discovery",
            "description": "A French programmer working in Spain inadvertently gained remote access to approximately 7,000 similar robotic vacuum cleaners while modifying his own device. According to Ming Pao, this incident has raised concerns about potential security risks associated with smart home products. The discovery highlights vulnerabilities in the technology that could be exploited, prompting discussions on the safety and privacy of such devices.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050145&language=en-US",
            "pub_date": "2026-02-26 18:57:35",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050144,
            "title": "India and Israel Sign AI Cooperation Agreement",
            "description": "India and Israel have entered into a significant agreement to collaborate on artificial intelligence (AI) initiatives. According to Jin10, the partnership aims to enhance technological advancements and foster innovation in AI applications across various sectors. This agreement marks a strategic move for both nations as they seek to leverage AI technology to boost economic growth and address global challenges. The collaboration is expected to facilitate knowledge exchange and joint research efforts, paving the way for new developments in AI-driven solutions.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050144&language=en-US",
            "pub_date": "2026-02-26 19:00:18",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050128,
            "title": "Anything Labs Partners with UXUY to Expand AI Stablecoin Applications",
            "description": "On February 26, Anything Labs announced a strategic partnership with on-chain exchange UXUY. According to ChainCatcher, as the world's first crypto incubation institution focused on the AI stablecoin sector, Anything Labs aims to leverage UXUY's multi-chain ecosystem to accelerate the expansion and application of AI stablecoins, exploring new AI trading paradigms for high-frequency, asymmetric trading scenarios.\n\nThe AI-native stablecoin UUSD, launched by Anything Labs, has seen a rapid increase in market attention just one week after its release. The UUSD team is currently intensifying its penetration into AI developer communities, including OpenClaw, and addressing issues related to the native nature of AI assets through the X402 protocol.\n\nPatrick, the founder of Anything Labs, stated that the application scenarios for AI agents are continually expanding. The recent popularity of Elsp further confirms the vast opportunities AI holds in the social domain. Social scenarios are expected to gradually generate payment demands, which will extend to trading needs. The core value of UUSD lies in its ability to serve not only human transactions but also on-chain interactions involving AI, thereby building a peer-to-peer electronic cash system for the AI era.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050128&language=en-US",
            "pub_date": "2026-02-26 18:46:41",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050127,
            "title": "AI Models' Effectiveness Tied to Data Quality, Says London Stock Exchange CEO",
            "description": "London Stock Exchange Group CEO David Schwimmer emphasized the importance of data quality in the effectiveness of AI models. Bloomberg posted on X, highlighting Schwimmer's discussion on data ownership with @annaedwardsnews. Schwimmer noted that while AI models possess significant power, their performance is directly linked to the quality of the data they process. The conversation underscores the critical role of data management in maximizing AI capabilities.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050127&language=en-US",
            "pub_date": "2026-02-26 18:47:48",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050126,
            "title": "Nordic Countries Investigate Threats to Energy Infrastructure",
            "description": "Nordic countries are currently investigating potential threats to their energy infrastructure. According to Jin10, this development comes amid growing concerns over the security and stability of critical energy systems in the region. Authorities are working to assess the situation and implement measures to safeguard these essential resources. The investigation highlights the importance of maintaining robust security protocols to protect against potential disruptions.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050126&language=en-US",
            "pub_date": "2026-02-26 18:48:18",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050125,
            "title": "Norway's Wealth Fund Faces Challenges Due to Ethical Investment Guidelines",
            "description": "Norway's $2.2 trillion sovereign wealth fund has reported that its decision to exclude weapons manufacturers from its investment portfolio, based on ethical guidelines, is negatively impacting its financial returns. Bloomberg posted on X, highlighting the fund's adherence to ethical standards, which has led to a reduction in potential profits. The fund, known for its significant global investments, prioritizes ethical considerations, including environmental and social governance, in its investment strategy. This approach, while aligning with Norway's ethical stance, has resulted in missed opportunities in sectors that are currently profitable, such as defense and arms manufacturing. The fund's management continues to navigate the balance between ethical investment and financial performance, maintaining its commitment to responsible investing despite the challenges in maximizing returns.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050125&language=en-US",
            "pub_date": "2026-02-26 18:48:31",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050111,
            "title": "Institutional Interest in Strategy's Preferred Securities Amid Short Interest in Common Stock",
            "description": "Strategy, previously known as MicroStrategy, is drawing institutional attention to its preferred securities, despite its common stock, MSTR, facing significant short interest. According to NS3.AI, the company's variable-rate preferred stock offers an attractive yield of 11.25% and holds a $2.25 billion reserve. This financial structure may reduce the cost of capital and influence the short-selling narrative surrounding MSTR. While institutional demand for these preferred securities could bolster Strategy's funding model, it might also result in complex hedged short positions rather than completely eliminating short interest.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050111&language=en-US",
            "pub_date": "2026-02-26 18:33:13",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050110,
            "title": "Pound May Decline if Labour Loses By-Election, Says MUFG",
            "description": "MUFG has indicated that the British pound could face a decline if the ruling Labour Party loses the by-election in the Gordon and Denton area scheduled for Thursday. According to Jin10, the Labour Party had previously secured a comfortable victory in this constituency during the 2024 general election. Current polls suggest a tight race among the Labour Party, the Reform Party, and the Green Party. A loss for Labour could increase pressure on Prime Minister Keir Starmer and heighten concerns within the party about declining support, particularly ahead of the regional elections in May.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050110&language=en-US",
            "pub_date": "2026-02-26 18:33:21",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050109,
            "title": "Binance Square Launches MIRA Token Campaign with 250,000 Token Rewards",
            "description": "According to the announcement from Binance, Binance Square has introduced a new campaign on CreatorPad, offering verified users the opportunity to unlock 250,000 Mira (MIRA) token voucher rewards. The activity period is set from 2026-02-26 09:00 (UTC) to 2026-03-11 09:00 (UTC). Participants can join the campaign by completing specific tasks to earn points and qualify for rewards. \n\nTo participate, users must click 'Join now' on the activity page and complete tasks such as creating posts on Binance Square. Posts must be at least 100 characters long, include the hashtag #Mira, $MIRA, and mention the project’s account. Additionally, users are required to follow Mira’s account on Binance Square and X via the activity landing page. Points earned from these tasks will determine the user's rank on the leaderboard, which is crucial for qualifying for the reward pool. \n\nThe reward structure is based on the leaderboard results, with the top 50 creators on the MIRA Global Project Leaderboard eligible for the 250,000 MIRA reward pool. The leaderboard data is updated with a T+2 delay, meaning data from 2026-02-13 will be visible after 2026-02-15 09:00 (UTC). However, Chinese creators, defined as those producing 90% of their content in Mandarin Chinese over the last 90 days, are not eligible to participate. \n\nParticipants must complete account verification (KYC) to receive rewards, and any suspicious activity, such as using automated bots or modifying posts for submission, will result in disqualification. Rewards will be distributed by 31 March 2026, and users can check their voucher rewards via the Rewards Hub. The token voucher is valid for seven days from distribution. Binance reserves the right to amend the terms and conditions of the activity at its discretion.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050109&language=en-US",
            "pub_date": "2026-02-26 18:33:35",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050108,
            "title": "$MSTR Leads U.S. Stocks in Short Interest",
            "description": "Scott Melker, host of The Wolf Of All Streets Podcast, posted on X that $MSTR has the highest short interest among U.S. stocks. This indicates significant investor skepticism about the company's future performance.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050108&language=en-US",
            "pub_date": "2026-02-26 18:34:40",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050097,
            "title": "S&P Global Ratings Warns of Fiscal Pressures on Indonesia's Credit Profile",
            "description": "S&P Global Ratings has issued a warning regarding Indonesia's sovereign credit profile, highlighting the growing fiscal pressures due to increased debt-servicing costs. Bloomberg posted on X that these rising costs are contributing to heightened downside risks for the country's financial stability. The warning comes as Indonesia faces challenges in managing its fiscal policies amid global economic uncertainties. S&P Global Ratings emphasized the importance of addressing these fiscal pressures to maintain a stable credit outlook for Indonesia. The agency's assessment underscores the need for careful fiscal management to mitigate potential risks associated with higher debt obligations.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050097&language=en-US",
            "pub_date": "2026-02-26 18:25:43",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050096,
            "title": "Private Credit's Heavy Exposure to Software Industry Raises Concerns",
            "description": "Private credit markets are significantly exposed to the software industry, according to Bruce Richards, co-founder of Marathon Asset Management. Bloomberg posted on X, highlighting Richards' concerns about the concentration of investments in this sector.\n\nRichards emphasized that the software industry's dominance in private credit portfolios could pose risks, especially if market conditions change. He noted that while software companies have been attractive due to their growth potential and recurring revenue models, the lack of diversification could lead to vulnerabilities.\n\nThe private credit market has seen substantial growth in recent years, with investors seeking higher yields amid low-interest rates. However, Richards warned that the heavy reliance on a single industry might not be sustainable in the long term.\n\nRichards' comments come at a time when the software sector is experiencing rapid technological advancements and increased competition. He urged investors to consider diversifying their portfolios to mitigate potential risks associated with overexposure to any single industry.\n\nThe insights from Marathon Asset Management's co-founder underscore the importance of strategic diversification in private credit investments, particularly as economic uncertainties continue to loom.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050096&language=en-US",
            "pub_date": "2026-02-26 18:26:22",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050095,
            "title": "GEOPOLITICS | Hungarian Prime Minister Requests EU Fact-Finding Mission for 'Friendship' Oil Pipeline",
            "description": "Hungarian Prime Minister Viktor Orbán has formally requested the European Union to dispatch a fact-finding mission to assess the condition of the 'Friendship' oil pipeline. According to Jin10, this request comes amid growing concerns over the pipeline's operational status and its implications for energy security in the region. The 'Friendship' pipeline is a critical infrastructure component, facilitating the transport of oil across several European countries. Orbán's appeal underscores the importance of ensuring the pipeline's integrity and reliability, as it plays a vital role in Hungary's energy supply. The EU's response to this request could have significant ramifications for regional energy dynamics and diplomatic relations.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050095&language=en-US",
            "pub_date": "2026-02-26 18:27:43",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050094,
            "title": "U.S. Commerce Secretary Meets with India's Trade Minister to Discuss Economic Cooperation",
            "description": "U.S. Secretary of Commerce Howard Lutnick held discussions with India's Commerce and Trade Minister Piyush Goyal on Thursday. Bloomberg posted on X, highlighting the meeting's focus on strengthening economic ties between the two nations. The talks aimed to explore avenues for enhancing trade and investment, reflecting the ongoing efforts to deepen bilateral relations. Both officials emphasized the importance of collaboration in various sectors, including technology and manufacturing, to boost economic growth. The meeting underscored the commitment of the United States and India to work together in addressing global economic challenges and fostering mutual prosperity.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050094&language=en-US",
            "pub_date": "2026-02-26 18:27:48",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}