{
    "data": [
        {
            "id": 1053745,
            "title": "U.S. Spot Crypto ETFs Posted $66.7 Million in Net Outflows on Friday as BlackRock Sold Both BTC and ETH",
            "description": "U. S. spot cryptocurrency ETFs recorded approximately $66. 72 million in net outflows on February 28, 2026, with Bitcoin and Ethereum ETFs both posting redemptions while Solana, XRP, and Hedera bucked the trend with modest inflows, and BlackRock driving the majority of the selling pressure across both major assets\nsource: https://www.ethnews.com/u-s-spot-crypto-etfs-posted-66-7-million-in-net-outflows-on-friday-as-blackrock-sold-both-btc-and-eth/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053745&language=en-US",
            "pub_date": "2026-03-01 00:06:54",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053744,
            "title": "This looks like ai, wtf …",
            "description": "null\nsource: https://x.com/RealAllinCrypto/status/2027778270456865247",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053744&language=en-US",
            "pub_date": "2026-03-01 00:09:48",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053743,
            "title": "John Bolton Supports U.S. and Israeli Strikes on Iran, Raises Concerns Over Regime Change",
            "description": "Former U.S. Ambassador to the United Nations John Bolton has expressed his agreement with the objectives of the U.S. and Israeli military strikes on Iran. Bloomberg posted on X, highlighting Bolton's concerns regarding the potential for regime change in Iran. Speaking on \"This Weekend,\" Bolton emphasized his support for the strategic goals of the strikes but cautioned against the complexities involved in altering Iran's political landscape. His comments reflect ongoing debates about the best approach to addressing tensions with Iran.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053743&language=en-US",
            "pub_date": "2026-03-01 00:16:49",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053741,
            "title": "Bitcoin Historical Cycle Pattern Points To $31,500 Bottom Target – Details",
            "description": "Bitcoin price struggles persist as the premier cryptocurrency is yet to break above the key $70,000 resistance zone, suggesting the market remains at risk of a deeper correction. Notably, popular market analyst Yonsei_dent has shared an observation that backs these bearish investors’ expectations. Related Reading: Bitcoin ETF Investors Show Diamond Hands: Only $6. 5B In Outflows Since October 10 Bitcoin Supply In Profit Metric Shows Potential 75% Drawdown In a Quicktake post on CryptoQuant, Yonsei_dent has identified a potential price bottom of the present market cycle, considering the meltdown in recent months\nsource: https://www.newsbtc.com/news/bitcoin/bitcoin-historical-cycle-pattern-points-to-31500-bottom-target-details/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053741&language=en-US",
            "pub_date": "2026-03-01 00:00:07",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053740,
            "title": "Here’s why OpenAI’s $110B raise is a major headwind for crypto",
            "description": "How AI funding is widening the \"long-term\" conviction gap between crypto and equities.\nsource: https://ambcrypto.com/heres-why-openais-110b-raise-is-a-major-headwind-for-crypto/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053740&language=en-US",
            "pub_date": "2026-03-01 00:00:36",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053739,
            "title": "MFS Collapse Draws Parallels to Previous Financial Failures",
            "description": "The recent collapse of London-based MFS has sparked comparisons to the previous financial failures of First Brands and Tricolor. Bloomberg posted on X, highlighting the similarities in the circumstances surrounding these companies' downfalls. The financial instability of MFS has raised concerns among investors and analysts, who are closely monitoring the situation for potential ripple effects in the market.\n\nThe implosion of MFS is reminiscent of the challenges faced by First Brands and Tricolor, both of which experienced significant financial distress leading to their eventual collapse. Analysts are examining the factors that contributed to MFS's downfall, including market conditions and internal management decisions.\n\nThe situation has prompted discussions about the broader implications for the financial sector, with experts weighing in on the potential impact on investor confidence and market stability. As the story unfolds, stakeholders are keenly observing the developments to assess the long-term consequences for the industry.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053739&language=en-US",
            "pub_date": "2026-03-01 00:03:31",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053738,
            "title": "GEOPOLITICS | U.S. President Trump and National Security Team Monitor Situation Closely",
            "description": "U.S. President Donald Trump, along with his national security team, is closely monitoring the current situation throughout the day. According to Jin10, the White House has confirmed that the President and his team are maintaining vigilance to address any developments as they arise. This continuous observation underscores the administration's commitment to national security and readiness to respond to potential challenges.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053738&language=en-US",
            "pub_date": "2026-03-01 00:11:58",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053730,
            "title": "Ethereum MVRV Ratio Indicates Potential Long-Term Bottom",
            "description": "Ethereum's MVRV ratio has decreased to 0.78, suggesting a potential long-term bottom, according to ChainCatcher. Historical data indicates that when the MVRV ratio falls below 0.8, Ethereum often approaches a long-term bottom. However, the market is currently experiencing significant distribution.\n\nAnalyst @alicharts warns that if selling pressure continues, potential support levels are at $1,800, $1,584, $1,238, and $1,089.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053730&language=en-US",
            "pub_date": "2026-02-28 23:53:51",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053729,
            "title": "Experts Downplay Concerns Over Iran's Potential Oil Route Closure",
            "description": "Concerns within the cryptocurrency community regarding Iran's potential shutdown of a crucial oil supply route may be exaggerated. According to NS3.AI, experts suggest that a complete closure of the strait is improbable or unfeasible. This viewpoint could alleviate investor anxiety about short-term market disruptions stemming from geopolitical tensions.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053729&language=en-US",
            "pub_date": "2026-02-28 23:54:04",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053731,
            "title": "Vitalik: EIP-8141 is expected to be implemented within a year, comprehensively solving the account abstraction problem.",
            "description": "In a post on the X platform, Vitalik stated that Ethereum has been discussing Account Abstraction (AA) since early 2016, and now EIP-8141, as a comprehensive proposal, aims to solve all the remaining issues related to AA. The core concept of this proposal is \"frame transactions,\" where a transaction contains N calls that can read each other's call data and authorize senders and gas payers. This mechanism supports multiple use cases: ordinary account transactions (such as multi-signature, variable keys, and quantum-resistant signature schemes) are completed through verification frames and execution frames; when paying gas fees using non-ETH tokens, it can be achieved through the payment main contract without any intermediaries; regarding privacy protocols, it can be achieved by verifying ZK-SNARKs or adding two-dimensional random numbers through the payment contract. In terms of security, at the on-chain level, transactions are only valid when the verification frame returns ACCEPT with a payment gas flag; at the mempool level, conservative rules will be used initially, with gradual expansion later. EIP-8141 is highly complementary to FOCIL; FOCIL ensures rapid transaction inclusion, while AA ensures that complex operations can be executed directly as first-class transactions. The proposal is also discussing EOA compatibility, which is feasible in principle. After more than a decade of research, these technologies are expected to be implemented through a Hegota fork within a year.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053731&language=en-US",
            "pub_date": "2026-02-28 23:55:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053728,
            "title": "United Steelworkers President Seeks New Approach with Nippon Steel",
            "description": "The incoming president of the United Steelworkers is aiming to change the union's approach towards Nippon Steel. Bloomberg posted on X, indicating a shift from the previous leadership's resistance to the Japanese company's acquisition of US Steel. This change comes as the union prepares for contract negotiations later this year.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053728&language=en-US",
            "pub_date": "2026-02-28 23:57:17",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053725,
            "title": "AI Tool Catches Critical XRP Ledger Bug Before Hackers Could",
            "description": "An AI-driven security auditing tool identified a critical double-spend vulnerability within the XRP Ledger in February 2026, potentially preventing the loss of hundreds of millions in user assets before a single wallet was touched.\nsource: https://www.ethnews.com/ai-tool-catches-critical-xrp-ledger-bug-before-hackers-could/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053725&language=en-US",
            "pub_date": "2026-02-28 23:41:14",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053724,
            "title": "The cryptocurrency market saw $505 million in liquidations across all platforms in the past 24 hours, including $362 million in long positions.",
            "description": "According to CoinGlass data, 147,171 people were liquidated in the past 24 hours, with a total liquidation amount of $505 million. Of this, $362 million were long positions and $143 million were short positions. The largest single liquidation occurred on Aster's BTCUSDT trading pair, worth $11.1713 million.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053724&language=en-US",
            "pub_date": "2026-02-28 23:47:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053723,
            "title": "GEOPOLITICS | Iranian Revolutionary Guard Reports Attacks on U.S. Military Bases",
            "description": "Iran's Islamic Revolutionary Guard Corps spokesperson announced that 14 U.S. military bases have been attacked, resulting in the deaths of hundreds of American soldiers. According to Jin10, the spokesperson from the 'Khatam al-Anbiya' headquarters provided these details, highlighting a significant escalation in military tensions. The report underscores the ongoing geopolitical strife in the region, with potential implications for international relations and security dynamics. The situation remains fluid, and further developments are anticipated as global attention focuses on the unfolding events.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053723&language=en-US",
            "pub_date": "2026-02-28 23:51:40",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053722,
            "title": "GEOPOLITICS | Iran Launches Hypersonic Missile Targeting Tel Aviv",
            "description": "Iran has reportedly launched a 'Fattah' hypersonic missile aimed at specific targets, according to Jin10. Additionally, it is reported that a new wave of Iranian missiles has been directed towards Tel Aviv, Israel.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053722&language=en-US",
            "pub_date": "2026-02-28 23:51:46",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053717,
            "title": "Berkshire Hathaway's New CEO Greg Abel Reflects on Leadership Transition",
            "description": "Greg Abel, the newly appointed CEO of Berkshire Hathaway, shared his thoughts in his first annual letter, acknowledging the challenges of succeeding Warren Buffett. Bespoke Investment Group posted on X. Abel emphasized the significant legacy left by Buffett, describing him as a 'very hard act to follow.' Abel's letter marks a pivotal moment for the company as it transitions under new leadership, highlighting the importance of maintaining the values and principles established by Buffett. Abel's leadership will be closely watched as he navigates the future of Berkshire Hathaway, aiming to uphold the company's reputation and success.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053717&language=en-US",
            "pub_date": "2026-02-28 23:32:44",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053716,
            "title": "Hyundai Motor Leads in Humanoid Robotics Amid Global AI Competition",
            "description": "Hyundai Motor has positioned itself as a frontrunner in the development of humanoid robots, capturing attention amidst the global focus on Elon Musk's Optimus robot and the intense AI competition between the United States and China. Bloomberg posted on X, highlighting Hyundai's advancements in robotics technology, which have set it apart in the industry. As the world watches the unfolding AI race, Hyundai's progress in humanoid robotics signifies a significant milestone in technological innovation.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053716&language=en-US",
            "pub_date": "2026-02-28 23:33:34",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053715,
            "title": "U.S. House Democrats to Hold Online Caucus Meeting",
            "description": "U.S. House Democrats are set to convene an online caucus meeting tomorrow. According to Jin10, this virtual gathering aims to address key legislative priorities and strategize on upcoming political challenges. The meeting underscores the ongoing efforts by the Democratic Party to maintain cohesion and focus on their agenda amid a dynamic political landscape. Further details on the topics to be discussed have not been disclosed.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053715&language=en-US",
            "pub_date": "2026-02-28 23:34:42",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053714,
            "title": "GEOPOLITICS | India Calls for Dialogue to Address West Asia Crisis",
            "description": "India has issued a statement regarding the ongoing crisis in West Asia, emphasizing the need for dialogue and diplomatic efforts to ease tensions and address underlying issues. According to Jin10, the statement underscores the importance of respecting the sovereignty and territorial integrity of all nations involved. The call for peaceful resolution comes amid escalating geopolitical challenges in the region.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053714&language=en-US",
            "pub_date": "2026-02-28 23:36:22",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053712,
            "title": "Kalshi Contracts Reflect High Interest in Alien Existence Confirmation by 2027",
            "description": "Over $9 million has been traded on Kalshi contracts concerning the potential confirmation of alien existence by the United States. Bespoke Investment Group posted on X that these contracts currently indicate a 22.1% probability of such confirmation occurring before 2027. The significant trading volume highlights the growing interest and speculation surrounding extraterrestrial life and its acknowledgment by official entities. This development comes amid ongoing discussions and debates about the possibility of alien life and its implications for science and society.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053712&language=en-US",
            "pub_date": "2026-02-28 23:23:48",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}