{
    "data": [
        {
            "id": 1053997,
            "title": "Michael Saylor Highlights Bitcoin's Historical Challenge",
            "description": "Michael Saylor, co-founder of MicroStrategy, has pointed out that Bitcoin's main vulnerability lies in its relatively brief 17-year history, rather than any inherent technical or economic issues. According to NS3.AI, Saylor drew parallels between Bitcoin's adoption process and the historical adoption of significant technologies such as electricity and automobiles, which required decades to achieve widespread acceptance. He suggests that Bitcoin is currently in a phase of commercialization, with time being a crucial element for its broader acceptance.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053997&language=en-US",
            "pub_date": "2026-03-01 06:38:53",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053996,
            "title": "Morgan Stanley Seeks National Trust Bank Charter for Crypto Custody",
            "description": "Morgan Stanley has applied for a national trust bank charter to custody cryptocurrencies, marking a significant step in its deeper involvement in the crypto industry. According to NS3.AI, this move is part of a broader trend where major financial institutions are pursuing banking licenses to manage digital assets and provide traditional banking services. Since 2021, Morgan Stanley has been expanding its crypto offerings, including Bitcoin funds and plans for Bitcoin and Ethereum ETFs.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053996&language=en-US",
            "pub_date": "2026-03-01 06:38:58",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053995,
            "title": "Iranian Major General Abdollahi on War's Conclusion",
            "description": "Iranian Major General Abdollahi has stated that the ultimate decision regarding the end of the war will rest with Iran. According to Jin10, Abdollahi emphasized Iran's role in determining the outcome of the conflict. This statement highlights Iran's strategic position and influence in the ongoing situation. The remarks come amid heightened tensions and underscore the complexities involved in reaching a resolution.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053995&language=en-US",
            "pub_date": "2026-03-01 06:44:04",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053998,
            "title": "Iranian First Vice President Aref announced plans to take full control of Iran under \"wartime conditions\".",
            "description": "Market news: Iran's First Vice President Aref announced plans to take full control of Iran under \"wartime conditions\".",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053998&language=en-US",
            "pub_date": "2026-03-01 06:46:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053991,
            "title": "GEOPOLITICS | Iran's First Vice President Announces Plans for Wartime Control",
            "description": "Iran's First Vice President, Aref, has announced plans to assume full control of the country under wartime conditions. According to Jin10, this move comes amid escalating tensions and challenges faced by Iran on both domestic and international fronts. The announcement signals a significant shift in Iran's governance strategy, potentially impacting regional stability and geopolitical dynamics. Observers are closely monitoring the situation as Iran navigates these complex circumstances.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053991&language=en-US",
            "pub_date": "2026-03-01 06:27:25",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053990,
            "title": "Controversial Social Media Post Sparks Debate on Racism",
            "description": "A recent post on social media has ignited a heated discussion about racism and online behavior. Blockchain sleuth ZachXBT posted on X, highlighting a comment made by a user identified as @mert. The user questioned whether changing their profile picture would permit them to engage in racist behavior. \n\nThe post has drawn widespread criticism, with many users condemning the notion that any change in online identity could justify discriminatory actions. The incident underscores ongoing concerns about racism and accountability on social media platforms. \n\nThis event has prompted discussions about the responsibilities of social media users and the platforms themselves in preventing and addressing harmful content. The debate continues as users call for stricter regulations and more effective moderation to combat racism online.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053990&language=en-US",
            "pub_date": "2026-03-01 06:30:30",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053989,
            "title": "GEOPOLITICS | Iranian Ambassador to UN Reports Civilian Casualties from US-Israeli Attacks",
            "description": "Iran's Ambassador to the United Nations has reported that recent attacks by the United States and Israel have resulted in hundreds of civilian casualties. According to Jin10, the ambassador highlighted the severe impact of these military actions on non-combatants, emphasizing the urgent need for international attention and intervention. The statement underscores the escalating tensions in the region and calls for a reassessment of military strategies to prevent further loss of civilian lives.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053989&language=en-US",
            "pub_date": "2026-03-01 06:35:25",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053988,
            "title": "BNB Surpasses 620 USDT with a 1.99% Increase in 24 Hours",
            "description": "On Feb 28, 2026, 22:36 PM(UTC). According to Binance Market Data, BNB has crossed the 620 USDT benchmark and is now trading at 620.119995 USDT, with a narrowed 1.99% increase in 24 hours.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053988&language=en-US",
            "pub_date": "2026-03-01 06:36:08",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053987,
            "title": "Explosion in Tel Aviv Following Missile Strike",
            "description": "A missile strike resulted in a loud explosion in Tel Aviv, Israel, on the 28th, local reports indicate. According to NS3.AI, the incident has raised concerns among residents and authorities. As of now, there are no details available regarding damages or casualties.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053987&language=en-US",
            "pub_date": "2026-03-01 06:22:09",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053978,
            "title": "Wells Fargo Refuses To Reimburse Customer After Scammer Drains $18,000 From Account, Finding ‘No Evidence of Fraud’: Report",
            "description": "Wells Fargo has denied a customer’s plea for reimbursement after a scammer drained $18,000 from his account, according to a new report. Virginia resident William Sroufe lost more than $18,000 on December 17th in a phone scam where the caller impersonated Wells Fargo, reports the local news outlet WWBT.\nsource: https://dailyhodl.com/2026/02/28/wells-fargo-refuses-to-reimburse-customer-after-scammer-drains-18000-from-account-finding-no-evidence-of-fraud-report/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053978&language=en-US",
            "pub_date": "2026-03-01 06:02:28",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053977,
            "title": "Wells Fargo Customer Loses $18,000 in Phone Scam",
            "description": "A Wells Fargo customer in Virginia fell victim to a phone scam, losing $18,000 after a caller impersonated the bank and manipulated the victim into authorizing transfers. According to NS3.AI, despite the suspicious circumstances and the victim's assertion that authorization was obtained through deception, Wells Fargo declined to reimburse the loss, citing a lack of evidence of fraud. This incident highlights the difficulties consumers encounter with bank fraud protection, particularly when cryptocurrency references are involved.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053977&language=en-US",
            "pub_date": "2026-03-01 06:10:47",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053973,
            "title": "An Iranian Foreign Ministry spokesman said Iran's Supreme Leader and President are \"safe and sound.\"",
            "description": "Iranian Foreign Ministry spokesman Baghae said on the evening of February 28 that Iran's Supreme Leader Khamenei and President Pezechzian were both \"safe and sound.\" Baghae made this statement in separate interviews with ABC and Sky News.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053973&language=en-US",
            "pub_date": "2026-03-01 06:02:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053969,
            "title": "Cardano Faces Selling Pressure Amid Tightening Range",
            "description": "Cardano's price is currently consolidating within a narrowing range, experiencing ongoing selling pressure. According to NS3.AI, this is evident in the Money Flow Index and futures market data. Long-term holders are playing a crucial role by retaining older coins, which is helping ADA maintain the 13.6% Fibonacci retracement support around $0.256. If this support level fails, Cardano could see further declines toward $0.239. Conversely, a successful defense might lead to a rebound, testing resistance near $0.295.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053969&language=en-US",
            "pub_date": "2026-03-01 06:02:07",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053972,
            "title": "A huge explosion was heard in Tel Aviv, Israel.",
            "description": "A massive explosion was heard in Tel Aviv, Israel, on the 28th local time. It is reported that a missile crashed in Tel Aviv.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053972&language=en-US",
            "pub_date": "2026-03-01 06:03:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053971,
            "title": "The Iranian Islamic Revolutionary Guard Corps issued a statement saying that there were numerous US military casualties in Kuwait.",
            "description": "At 1:00 AM local time on March 1st, the Iranian Islamic Revolutionary Guard Corps (IRGC) issued Announcement No. 4. The announcement stated that in the fifth wave of \"True Commitment 4,\" a US warship transporting ammunition in Jebel Ali, UAE, was attacked by four drones, losing power and exploding. Additionally, a US naval base in Kuwait was attacked by four ballistic missiles and twelve drones, destroying all infrastructure and causing numerous US casualties. Furthermore, an MST-class combat support ship transporting fuel in the Indian Ocean was attacked by Iranian missiles. The IRGC's public relations department also announced that the Prince Sultan Air Base in Saudi Arabia was targeted by Iranian missiles and drones. The IRGC also announced that the Khalil military base in Iraq was attacked by missiles. The IRGC stated that US special forces and commandos are stationed at this base.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053971&language=en-US",
            "pub_date": "2026-03-01 06:04:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053966,
            "title": "BREAKING: US President Donald Trump Confirms Death of Iran’s Supreme Leader Khamenei",
            "description": "According to breaking news, US President Donald Trump has confirmed the death of Iranian religious leader Ali Khamenei. Trump made the following statement: “Khamenei is dead, now is Iran’s greatest chance to reclaim its country. ” Continue Reading: BREAKING: US President Donald Trump Confirms Death of Iran’s Supreme Leader Khamenei\nsource: https://en.bitcoinsistemi.com/breaking-us-president-donald-trump-confirms-death-of-iran-s-supreme-leader-khamenei/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053966&language=en-US",
            "pub_date": "2026-03-01 05:41:05",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053961,
            "title": "GEOPOLITICS | U.S. President Trump Comments on Iranian Forces' Alleged War Fatigue",
            "description": "U.S. President Donald Trump has stated that he has heard reports suggesting that many members of Iran's Islamic Revolutionary Guard Corps, military, and other security and police forces are reportedly weary of conflict and are seeking exemptions from the United States. According to Jin10, these remarks come amid ongoing tensions between the U.S. and Iran, highlighting the complex geopolitical dynamics in the region. The situation remains fluid as both nations navigate their diplomatic and military strategies.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053961&language=en-US",
            "pub_date": "2026-03-01 05:39:51",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053960,
            "title": "Military Strikes on Iran Lead to Significant Trading on Polymarket",
            "description": "Military actions by the United States and Israel against Iran over the weekend have led to a surge in trading activity on Polymarket, a prediction market platform. Bloomberg posted on X that contracts related to the timing of these strikes saw a trading volume of $529 million. This development highlights the intersection of geopolitical events and financial markets, as traders sought to capitalize on the unfolding situation.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053960&language=en-US",
            "pub_date": "2026-03-01 05:45:31",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053950,
            "title": "GEOPOLITICS | Iran's Revolutionary Guard Announces New Wave of Attacks",
            "description": "Iran's Revolutionary Guard has declared plans to initiate a new series of attacks aimed at 'expanding and deepening the war.' According to Jin10, this announcement signals a potential escalation in regional tensions. The move comes amid ongoing geopolitical conflicts, raising concerns about the stability in the Middle East. The Revolutionary Guard's statement did not specify the targets or the timeline for these attacks, leaving the international community on high alert. Observers are closely monitoring the situation for further developments.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053950&language=en-US",
            "pub_date": "2026-03-01 05:28:17",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053949,
            "title": "European Union Utilizes Minipigs to Strengthen Biotech Sector",
            "description": "Minipigs are becoming increasingly significant in the European Union's efforts to bolster its biotech industry. Bloomberg posted on X, highlighting their ease of breeding and cost-effectiveness as major advantages. These animals are being integrated into research and development processes, contributing to the EU's goal of enhancing resilience in the biotech sector. The use of minipigs is seen as a strategic move to advance scientific research and innovation within the region.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053949&language=en-US",
            "pub_date": "2026-03-01 05:30:29",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}