{
    "data": [
        {
            "id": 734170,
            "title": "Helium Mobile launches free 5G mobile plans and opens waiting list",
            "description": "Odaily Planet Daily News Helium Mobile announced its first free mobile phone package for 5G network. The new \"Zero Plan\" provides users with 3GB of data, 300 text messages and 100 minutes of talk time every month, completely free, and the waiting list is now open.\nFor users who need more traffic, there are other packages to choose from. The Air Plan costs $15 per month and provides 10GB of data traffic and unlimited call time and text messages. The highest-end Infinity Plan costs $30 per month and provides unlimited data traffic, text messages and call time. (Decrypt)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734170&language=en-US",
            "pub_date": "2025-02-05 16:01:03",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734169,
            "title": "Megabit will launch ARC/USDT contract trading",
            "description": "Odaily Planet Daily News According to official news, Megabit will officially launch ARC/USDT contract trading at 18:00 (SGT) on February 5.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734169&language=en-US",
            "pub_date": "2025-02-05 16:03:02",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734175,
            "title": "Bitcoin Network Sees Slight Hashrate Increase Amid Decreased Mining Difficulty",
            "description": "According to PANews, a recent report by CoinDesk highlights that JPMorgan has observed a slight increase in Bitcoin's network hashrate in January, rising by just 1%. Meanwhile, mining difficulty experienced a 2% decrease month-over-month. Analysts Reginald Smith and Charles Pearce noted that this scenario is relatively uncommon and presents a mild tailwind for Bitcoin mining economics. They also mentioned that the network difficulty remains 25% higher compared to levels before the halving event in April of last year.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734175&language=en-US",
            "pub_date": "2025-02-05 16:03:35",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734164,
            "title": "Industry insiders: Key DeFi protocols successfully withstood pressure during the tariff crisis and outperformed TradFi during the crisis",
            "description": "Odaily Planet Daily News: Driven by Trump's tariffs on major US trading partners, the market sold off sharply, causing billions of dollars in total market value to evaporate from the crypto industry. However, some DeFi founders see this as a bullish signal.\nSeveral developers said that despite ETH falling by at least 35% and SOL falling by about 25%, several key protocols withstood the stress test. Marc Zeller, founder of Aave Chan Initiative (ACI), the Aave contribution team, said in a private message: \"Aave's goal is to stay healthy and minimize pain.\"\nIn addition, Evan Van Ness, a long-time Ethereum commentator, said: \"Except for some isolated incidents of front-end downtime, it's good to see that Sky is running well. In times of crisis, DeFi performs better than TradFi.\" According to data source Block Analitica, Sky has 19 new liquidation positions involving assets worth more than $8 million. MakerDAO founder Rune Christensen said: \"From what I understand, everything is going smoothly.\"\nTo put the situation into perspective, risk services provider Chaos Labs said that Aave processed about $210 million in liquidations during the market downturn. In comparison, according to a previously published report, about $263 million was liquidated on Aave V2 between December 2020 and December 2022.\n\"Rapid market volatility led to a large number of liquidation events in the lending and perpetual contract markets, marking the largest day of liquidations ever,\" Chaos said in a status report, noting that more than 80% of liquidations occurred on the Aave Ethereum mainnet.\n\"Most importantly, compared to other venues, Aave does not force all user positions to close when liquidations occur. Only up to half are available for liquidation, mitigating user losses,\" said Zeller. According to Block Analytica data, the amounts of these liquidated positions ranged from tens of thousands of dollars to less than $100.\nZeller believes that the performance of the protocol, and many other decentralized protocols, shows that the effort to design secure platforms that simply “work properly” is worth it. He noted that the Aave team is working to integrate Chainlink’s smart value recovery solution to make liquidations more efficient and more profitable for the protocol. (The Block)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734164&language=en-US",
            "pub_date": "2025-02-05 15:45:31",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734166,
            "title": "SUI’s 30% Drop Just the Beginning? Crypto Expert Warns Of Devastating Crash Ahead!",
            "description": "The post SUI’s 30% Drop Just the Beginning? Crypto Expert Warns Of Devastating Crash Ahead! appeared first on Coinpedia Fintech News\nSUI, the native token of the Layer-1 blockchain, has taken a major hit, dropping more than 30% in a month. Such a massive drop has raised concerns among traders, with crypto analyst Jason Pizzino warning that the token might be following a historical pattern that...\nsource: https://coinpedia.org/news/suis-30-drop-just-the-beginning-crypto-expert-warns-devastating-crash/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734166&language=en-US",
            "pub_date": "2025-02-05 15:46:29",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734165,
            "title": "Good News for Crypto? US SEC to Scale Back Its Enforcement Division",
            "description": "The US Securities and Exchange Commission is reportedly reducing its enforcement division amid a shift in the regulatory landscape for the crypto industry.\nsource: https://cryptopotato.com/good-news-for-crypto-us-sec-to-scale-back-its-enforcement-division/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734165&language=en-US",
            "pub_date": "2025-02-05 15:46:30",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734163,
            "title": "After taking over as acting CFPB director, U.S. Treasury Secretary asks staff to stop litigation, investigation or enforcement proceedings",
            "description": "Odaily Planet Daily News Crypto-friendly U.S. Treasury Secretary Scott Bessent quickly got to work after taking on the role of acting director of the U.S. Consumer Financial Protection Bureau (CFPB). Now, Bessent has essentially put the CFPB on lockdown.\nStaff will cease any litigation, investigations, or enforcement proceedings and avoid making public statements. According to a memo, the effective date of any previously approved rules will also be suspended.\nThe shift is seen as particularly beneficial to the crypto industry, which was also a target of former CFPB Director Rohit Chopra. The CFPB proposed last month to expand the agency's electronic funds regulation to cryptocurrencies.\nWhile the rule is unlikely to be finalized, even the existence of such a proposal could affect pending litigation matters. The wording in the proposal could also be adopted by states, several of which already have nearly identical electronic funds transfer regulations.\nThe Trump administration has not yet nominated anyone to serve as CFPB director. (Blockworks)\nYesterday's news that US Treasury Secretary Scott Bessent is currently serving as the acting director of the US Consumer Financial Protection Bureau (CFPB) indicates that the Trump administration may shift the strict law enforcement and regulatory approach under Rohit Chopra. Chopra was previously fired by the Trump administration. The Biden-era official imposed billions of dollars in fines and consumer compensation on banks such as Wells Fargo, Goldman Sachs and Citigroup during his tenure.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734163&language=en-US",
            "pub_date": "2025-02-05 15:55:14",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734160,
            "title": "OpenZK and Rocket Pool Collaborate to Integrate rETH into the OpenZK Ecosystem",
            "description": "Odaily Planet Daily News According to official news, L2 project OpenZK announced a partnership with Rocket Pool to integrate rETH into the OpenZK ecosystem.\nIt is reported that OpenZK is an L2 solution that combines ZK rollup technology with ETH staking and re-staking, which can achieve lower Gas and faster transaction speeds.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734160&language=en-US",
            "pub_date": "2025-02-05 15:41:13",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734155,
            "title": "A trader bought more than 100 million SSE and now has a floating profit of 2.28 million US dollars",
            "description": "Odaily Planet Daily News According to Onchain Lens monitoring, a trader purchased 108,614,413 SSE tokens on the pump.fun platform at 9.35 SOL (about $1,854). The trader has not sold any tokens yet, and the floating profit has reached $2.28 million.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734155&language=en-US",
            "pub_date": "2025-02-05 15:28:09",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734154,
            "title": "WazirX creditors to vote on whether to approve restructuring plan extended to 5 years",
            "description": "Odaily Planet Daily News WazirX creditors will decide in the coming weeks whether to start receiving compensation in cryptocurrency as early as April 2025, or face a long recovery process that could extend to 2030.\nThe vote follows a ruling by the Singapore High Court that allows the troubled Indian exchange to seek a restructuring plan rather than face liquidation, depending on whether three-quarters of creditors approve the recovery plan.\nIf the threshold is met, WazirX will launch a phased compensation plan, including launching a DEX, issuing recovery tokens, and implementing regular buybacks to compensate affected users.\nIf the vote fails, the platform will be forced to liquidate, a process that the company noted could take years and reduce creditors' returns. Although WazirX claims that creditors can recover up to 80% of their balances through its new DEX and recovery token model, its proposed recovery plan has sparked controversy.\nMany users remain skeptical, and some critics believe that the five-year delay is a strategic means to force creditors to accept a new platform rather than a real recovery move.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734154&language=en-US",
            "pub_date": "2025-02-05 15:29:30",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}