{
    "data": [
        {
            "id": 1053673,
            "title": "Polymarket Trader Faces $6.5 Million Loss After Iran Airstrike",
            "description": "A Polymarket trader, identified as anoin123, experienced a significant financial setback, losing approximately $6.5 million in a single day due to an unexpected airstrike on Iran. According to NS3.AI, the trader had previously accumulated over $2 million in profits by betting against the likelihood of the U.S. and Israel launching an attack on Iran over the past two months. However, the airstrike led to a rapid and substantial reversal of fortune, transforming the trader's profits into a loss exceeding $4.5 million.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053673&language=en-US",
            "pub_date": "2026-02-28 22:42:45",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053672,
            "title": "GEOPOLITICS | U.S. Farmers Face Uncertainty Amid Tariff Concerns",
            "description": "U.S. farmers, who have been seeking stability from President Donald Trump regarding tariffs, are encountering increased uncertainty following a recent U.S. Supreme Court decision. Bloomberg posted on X, highlighting the growing concerns among the agricultural community as they navigate the complexities of international trade policies. The ruling has added to the challenges faced by farmers, who are already dealing with fluctuating market conditions and the impact of tariffs on their livelihoods. As the situation unfolds, farmers are left to grapple with the implications of the court's decision and its potential effects on their operations.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053672&language=en-US",
            "pub_date": "2026-02-28 22:42:59",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053671,
            "title": "GEOPOLITICS | Israeli Military Action Against Iran Expected to Last Over a Week",
            "description": "Israeli officials have announced that military operations against Iran are anticipated to extend for at least a week. According to Jin10, U.S. officials also predict that the action will last several days rather than just a few hours. This development highlights the escalating tensions in the region.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053671&language=en-US",
            "pub_date": "2026-02-28 22:43:12",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053670,
            "title": "JPMorgan Chase Apologizes for Delayed Annuity Check Deposit Related to 9/11",
            "description": "JPMorgan Chase recently faced scrutiny for flagging and delaying a legitimate annuity check deposit connected to the 9/11 death of a customer's father. According to NS3.AI, the bank subsequently closed the accounts of both the customer and his mother without providing an explanation, even after the check had cleared. A spokesperson for Chase issued an apology for the delay but refrained from commenting on the reasons behind the account closures.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053670&language=en-US",
            "pub_date": "2026-02-28 22:46:44",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053665,
            "title": "GEOPOLITICS | Russia Calls for Emergency UN Security Council Meeting on Iran Issue",
            "description": "Russia has requested an urgent meeting of the United Nations Security Council to address concerns related to Iran, according to Jin10. This move comes amid escalating tensions and geopolitical challenges involving Iran. The request highlights Russia's active role in international diplomacy and its interest in addressing issues that may impact global stability. The specifics of the agenda for the meeting have not been disclosed, but it underscores the importance of international dialogue in resolving complex geopolitical matters.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053665&language=en-US",
            "pub_date": "2026-02-28 22:32:10",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053664,
            "title": "German Chancellor Holds Talks with Israeli Prime Minister",
            "description": "German Chancellor Merz engaged in a telephone conversation with Israeli Prime Minister Netanyahu on Saturday. According to Jin10, the discussion between the two leaders focused on bilateral relations and regional issues. The call underscores the ongoing diplomatic engagement between Germany and Israel, highlighting the importance of dialogue in addressing mutual concerns and fostering cooperation.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053664&language=en-US",
            "pub_date": "2026-02-28 22:33:45",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053663,
            "title": "Iran Activates Air Defense System in Shiraz",
            "description": "Iran has initiated its air defense system in the city of Shiraz, according to Jin10. This development was reported by the Islamic Republic of Iran Broadcasting (IRIB). The activation of the defense system comes amid heightened regional tensions and reflects Iran's ongoing efforts to bolster its military capabilities. The move is part of a broader strategy to enhance national security and protect critical infrastructure. Iran's military advancements continue to be closely monitored by international observers, given the geopolitical implications in the Middle East.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053663&language=en-US",
            "pub_date": "2026-02-28 22:37:16",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053662,
            "title": "Bitcoin(BTC) Surpasses 65,000 USDT with a Narrowed 1.63% Decrease in 24 Hours",
            "description": "On Feb 28, 2026, 14:38 PM(UTC). According to Binance Market Data, Bitcoin has crossed the 65,000 USDT benchmark and is now trading at 65,127.351563 USDT, with a narrowed narrowed 1.63% decrease in 24 hours.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053662&language=en-US",
            "pub_date": "2026-02-28 22:38:08",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053650,
            "title": "GEOPOLITICS | Iran Confirms No Development of Missiles Capable of Striking the U.S.",
            "description": "Iran's Foreign Minister has confirmed that the country will not develop missiles capable of reaching the United States. According to Jin10, this statement aims to address international concerns over Iran's missile capabilities and intentions. The announcement comes amid ongoing geopolitical tensions and discussions about Iran's military capabilities. The assurance is seen as a move to ease fears of potential military escalation in the region.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053650&language=en-US",
            "pub_date": "2026-02-28 22:28:01",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053649,
            "title": "GEOPOLITICS | Iran's Foreign Minister Engages in Talks with Russian Counterpart",
            "description": "Iran's Foreign Minister has confirmed a conversation with Russia's Foreign Minister. According to Jin10, the discussion between the two diplomats highlights ongoing diplomatic engagements between Iran and Russia. The dialogue underscores the importance of bilateral relations and cooperation on various geopolitical issues. The conversation reflects the strategic partnership between the two nations, focusing on mutual interests and regional stability. This interaction is part of broader diplomatic efforts to address international challenges and strengthen alliances.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053649&language=en-US",
            "pub_date": "2026-02-28 22:30:11",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053648,
            "title": "GEOPOLITICS | UN Secretary-General Condemns Escalation in Middle East Military Tensions",
            "description": "The United Nations Secretary-General has expressed strong condemnation over the escalating military tensions in the Middle East. According to Jin10, the Secretary-General criticized the use of force by the United States and Israel, as well as retaliatory actions by Iran, stating that these developments are undermining international peace and security. The situation has raised concerns about the potential for further destabilization in the region, prompting calls for restraint and dialogue among the involved parties. The international community is urged to prioritize diplomatic solutions to prevent further deterioration of the situation.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053648&language=en-US",
            "pub_date": "2026-02-28 22:30:17",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053647,
            "title": "Michael Pollan Explores Consciousness in New Book",
            "description": "Michael Pollan's latest book delves into the enigmatic nature of consciousness, offering readers a joyful exploration of what it means to be a bat, a plant, or even oneself. Bloomberg posted on X, highlighting the book's unique approach to understanding consciousness. Pollan's work invites readers to consider the diverse perspectives of different beings, encouraging a deeper appreciation of the complexities of consciousness. Through this exploration, Pollan aims to shed light on the mysteries that surround our understanding of the mind and its various states.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053647&language=en-US",
            "pub_date": "2026-02-28 22:31:05",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053634,
            "title": "GEOPOLITICS | Iranian Foreign Minister Rejects U.S. President Trump's Regime Change Message",
            "description": "Iran's Foreign Minister has dismissed U.S. President Donald Trump's message regarding a regime change in Iran, labeling it as an impossible task. According to Jin10, the Iranian official emphasized that such an endeavor would not succeed, reflecting ongoing tensions between the two nations. This statement comes amid heightened geopolitical friction, with both countries maintaining firm stances on their respective positions. The Iranian response underscores the complexities involved in international diplomacy and the challenges of altering political landscapes.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053634&language=en-US",
            "pub_date": "2026-02-28 22:16:47",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053635,
            "title": "A Polymarket user bet that the US and Israel would not attack Iran, making over $2 million in two months before losing $6.5 million in a single day.",
            "description": "According to Lookonchain monitoring, Polymarket user anoin123 had been consistently betting that the US/Israel would not launch an attack on Iran, accumulating profits of over $2 million within two months. However, after the attack occurred, anoin123 suffered a single-day loss of $6.5 million, turning a profit of over $2 million into a loss of over $4.5 million.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053635&language=en-US",
            "pub_date": "2026-02-28 22:17:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053633,
            "title": "GEOPOLITICS | U.S. Reportedly Not Planning Attack on Iraq",
            "description": "The Iraqi National News Agency has reported that the United States does not intend to launch an attack on Iraq. According to Jin10, this information comes from unnamed sources within the agency. The report aims to address concerns about potential military actions in the region. The U.S. has been involved in various diplomatic and military engagements in the Middle East, and any changes in its strategy could have significant geopolitical implications. The statement seeks to reassure both local and international observers about the stability of U.S.-Iraq relations.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053633&language=en-US",
            "pub_date": "2026-02-28 22:20:08",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053632,
            "title": "GEOPOLITICS | Iran Expresses Intent to Ease Tensions",
            "description": "Iran's Foreign Minister has announced the country's intention to de-escalate tensions in the region. According to Jin10, this statement comes amid ongoing geopolitical challenges and reflects Iran's commitment to fostering stability. The minister emphasized the importance of dialogue and cooperation with neighboring countries to achieve lasting peace. This development is seen as a positive step towards reducing regional conflicts and enhancing diplomatic relations.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053632&language=en-US",
            "pub_date": "2026-02-28 22:20:12",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053621,
            "title": "GEOPOLITICS | U.S. Lawmakers Anticipate Briefing on Iran Attack",
            "description": "U.S. Republican Senator Thom Tillis has expressed expectations that all members of Congress will soon receive a briefing regarding the recent attack by Iran. According to Jin10, this development comes amid heightened geopolitical tensions and concerns over regional stability. The briefing is anticipated to provide lawmakers with detailed insights into the incident and its implications for U.S. foreign policy and national security. As the situation unfolds, Congress is likely to assess the potential impact on international relations and defense strategies.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053621&language=en-US",
            "pub_date": "2026-02-28 22:09:55",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053620,
            "title": "GEOPOLITICS | Iran Asserts Self-Reliance in Defense Capabilities",
            "description": "Iran's Foreign Minister has declared that the nation does not require external assistance for its defense, emphasizing its full capability to self-defend. According to Jin10, this statement underscores Iran's stance on maintaining sovereignty in military affairs amidst regional tensions. The assertion reflects Iran's commitment to bolstering its defense infrastructure independently, highlighting its strategic focus on self-reliance.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053620&language=en-US",
            "pub_date": "2026-02-28 22:10:02",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053619,
            "title": "GEOPOLITICS | Iranian Foreign Minister Describes Painful Negotiation Experience with the U.S.",
            "description": "Iranian Foreign Minister has characterized the negotiation experience with the United States as extremely painful. According to Jin10, the minister highlighted the challenges and difficulties faced during diplomatic discussions with the U.S. The statement reflects ongoing tensions and complexities in the relationship between the two nations. The minister's remarks underscore the broader geopolitical dynamics at play, as both countries navigate their diplomatic and strategic interests.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053619&language=en-US",
            "pub_date": "2026-02-28 22:10:07",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053618,
            "title": "GEOPOLITICS | U.S. Deploys Tomahawk Missiles in Initial Strike on Iran",
            "description": "The United States has utilized Tomahawk cruise missiles in its first wave of strikes against targets in Iran. According to Jin10, this military action marks a significant escalation in tensions between the two nations. The deployment of these missiles underscores the U.S. commitment to addressing perceived threats in the region. The use of Tomahawk missiles, known for their precision and effectiveness, highlights the strategic approach taken by U.S. forces in this operation. This development is likely to have far-reaching implications for geopolitical stability in the Middle East.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053618&language=en-US",
            "pub_date": "2026-02-28 22:10:11",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}