{
    "data": [
        {
            "id": 1051785,
            "title": "Bitcoin ETFs Pull $254M as BlackRock Leads: Ethereum Sees Modest Inflows, XRP Extends Gains",
            "description": "Key Takeaways: Bitcoin ETFs saw $254. 4M in net inflows on Feb. 26. Ethereum ETFs recorded $6. 6M in net inflows.\nsource: https://coindoo.com/bitcoin-etfs-pull-254m-as-blackrock-leads-ethereum-sees-modest-inflows-xrp-extends-gains/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051785&language=en-US",
            "pub_date": "2026-02-27 16:45:18",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051784,
            "title": "🇺🇸 LATEST: OCC says regulators should manage, not eliminate, risk and tailor rules to keep the federal banking system relevant and healthy.",
            "description": "null\nsource: https://x.com/cointelegraph/status/2027304110370812016",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051784&language=en-US",
            "pub_date": "2026-02-27 16:45:40",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051783,
            "title": "Cape Town Mayor Announces Candidacy for Democratic Alliance Leadership",
            "description": "Cape Town Mayor Geordin Hill-Lewis has announced his intention to run for the leadership of the Democratic Alliance, South Africa's second-largest political party. Bloomberg posted on X, detailing Hill-Lewis's decision to enter the race, which comes as the party seeks to strengthen its position ahead of upcoming elections. Hill-Lewis, who has served as mayor since November 2021, aims to bring fresh perspectives and strategies to the party's leadership. His candidacy is expected to influence the party's direction and policies as it prepares for future political challenges. The Democratic Alliance has been a significant force in South African politics, and Hill-Lewis's leadership bid marks a pivotal moment for the party.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051783&language=en-US",
            "pub_date": "2026-02-27 16:46:45",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051782,
            "title": "STOCKS | European Shares Set for Longest Monthly Winning Streak Since 2013",
            "description": "European shares began the last trading session of February poised to achieve their longest monthly winning streak since 2013. Bloomberg posted on X, highlighting the positive momentum in the market as investors remain optimistic about economic recovery prospects. The rally has been driven by strong corporate earnings and supportive monetary policies across the region. Analysts suggest that the sustained growth reflects confidence in the European economy's resilience amid global uncertainties. As February concludes, market participants are closely monitoring economic indicators and geopolitical developments that could influence future performance.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051782&language=en-US",
            "pub_date": "2026-02-27 16:48:47",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051778,
            "title": "Malaysia to Consider Royal Commission for Anti-Graft Agency Investigation",
            "description": "Malaysia is set to determine if a Royal Commission of Inquiry will be formed to probe allegations of misconduct within the nation's anti-corruption agency. Bloomberg posted on X, highlighting the government's deliberation on this significant matter. The decision comes amid growing concerns over the integrity and operations of the agency tasked with combating corruption. Authorities are weighing the potential impact of such an inquiry on public trust and the agency's future effectiveness. The move reflects Malaysia's ongoing efforts to address corruption and ensure transparency in its institutions. Further details on the timeline and scope of the inquiry are yet to be disclosed.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051778&language=en-US",
            "pub_date": "2026-02-27 16:37:11",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051777,
            "title": "Jack Dorsey Addresses Overstaffing Issues During Pandemic",
            "description": "Jack Dorsey, former Twitter founder, responded on the X platform to community concerns about Block's layoffs being attributed to over-hiring and mismanagement during the COVID-19 pandemic. According to Odaily, Dorsey acknowledged that the company mistakenly established two separate structures, Square and Cash App, leading to excessive hiring. This issue was corrected by mid-2024. However, he noted that this did not address the complexities in lending, banking, and BNPL services. The current goal is to achieve over $2 million in gross profit per employee, quadrupling pre-pandemic efficiency, which was around $500,000 from 2019 to 2024. Dorsey emphasized that the company operates more efficiently than most.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051777&language=en-US",
            "pub_date": "2026-02-27 16:41:04",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051768,
            "title": "ROBO draws scrutiny as Binance perp rumor vs KuCoin futures",
            "description": "Fact-check: ROBOUSDT perpetual contract, Binance announcement, KuCoin futures — data shows Binance perp unconfirmed while KuCoin lists USDT‑margined futures.\nsource: https://coincu.com/news/robo-draws-scrutiny-as-binance-perp-rumor-vs-kucoin-futures/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051768&language=en-US",
            "pub_date": "2026-02-27 16:23:38",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051776,
            "title": "ROBO continues to rise, breaking through 0.03 USDT.",
            "description": "Market data shows that ROBO has continued to rise and broken through 0.03 USDT, currently trading at 0.0377 USDT, a short-term increase of over 80%.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051776&language=en-US",
            "pub_date": "2026-02-27 16:30:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051775,
            "title": "Jack Dorsey reiterates his stance on laying off nearly 4,000 employees due to AI: he admits to over-hiring and sets a future goal of achieving a profit-to-employment ratio of $2 million.",
            "description": "In response to the community's claim that \"Block's layoffs were primarily due to over-hiring and mismanagement during the COVID-19 pandemic,\" former Twitter founder Jack Dorsey posted on the X platform, stating, \"Yes, we over-hired during the pandemic because we mistakenly created two separate company structures (Square and Cash App), but this issue was corrected by mid-2024. However, this doesn't cover the full complexity of our lending, banking, and BNPL operations. Our current goal is over $2 million in gross profit per person, reaching four times the efficiency we had before the pandemic, which has remained around $500,000 from 2019 to 2024. In fact, we run a more efficient company than most.\"",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051775&language=en-US",
            "pub_date": "2026-02-27 16:31:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051767,
            "title": "Rightmove CEO Confident in AI Adaptation for Property Portals",
            "description": "Rightmove's CEO expressed confidence in the company's ability to adapt and thrive amid the rise of artificial intelligence in the property sector. Bloomberg posted on X, highlighting the CEO's belief that Rightmove and similar property portals will continue to be relevant despite technological advancements.\n\nThe CEO emphasized that while AI is transforming various industries, the human element remains crucial in real estate transactions. He noted that AI can enhance the user experience by providing more personalized property recommendations and streamlining processes, but it cannot replace the expertise and personal touch of real estate professionals.\n\nRightmove, a leading property portal, is focusing on integrating AI technologies to improve its platform and offer better services to users. The company aims to leverage AI to analyze data more effectively and provide insights that can assist both buyers and sellers in making informed decisions.\n\nThe CEO's comments come at a time when many industries are grappling with the implications of AI and automation. However, he remains optimistic about the future, stating that the combination of technology and human expertise will lead to a more efficient and effective property market.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051767&language=en-US",
            "pub_date": "2026-02-27 16:32:50",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051757,
            "title": "Switzerland's Pharmaceutical Sector Spurs Economic Recovery",
            "description": "Switzerland's economy is witnessing a recovery, primarily driven by its pharmaceutical industry. Bloomberg posted on X that the sector's growth has helped counterbalance the negative impact of significant U.S. tariffs on the country's export-dependent economy. The pharmaceutical industry, a crucial component of Switzerland's economic framework, has shown resilience and adaptability in the face of these challenges. This recovery highlights the sector's pivotal role in stabilizing the nation's economic landscape amid external pressures.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051757&language=en-US",
            "pub_date": "2026-02-27 16:15:34",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051756,
            "title": "GEOPOLITICS | Hungarian PM Orban Indicates Willingness to Address EU Funding Dispute",
            "description": "Hungarian Prime Minister Viktor Orban has suggested a potential willingness to resolve ongoing disagreements with European Union partners concerning financial support for Ukraine. Bloomberg posted on X, highlighting Orban's comments as a significant development in the EU's efforts to maintain unity in its approach to the Ukraine conflict.\n\nOrban's remarks come amid tensions within the EU over the allocation of funds to support Ukraine, which has been a contentious issue among member states. The Hungarian leader's openness to dialogue may pave the way for negotiations aimed at overcoming the impasse.\n\nThe EU has been striving to present a united front in its response to the situation in Ukraine, with financial aid being a crucial component of its strategy. Orban's position could influence the bloc's ability to effectively coordinate its support efforts.\n\nThis development is part of broader geopolitical dynamics as the EU navigates its relationship with Ukraine and addresses internal divisions over foreign policy priorities. The outcome of these discussions could have significant implications for the EU's role in the region and its ability to manage external challenges.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051756&language=en-US",
            "pub_date": "2026-02-27 16:16:31",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051755,
            "title": "GEOPOLITICS | Japan's Prime Minister Takaichi Sanae Urges U.S. to Honor Tariff Commitments",
            "description": "Japan's Prime Minister Takaichi Sanae has called on the United States to fulfill its commitments regarding tariffs. According to Jin10, Takaichi emphasized the importance of the U.S. adhering to its agreements in this area. The statement highlights ongoing discussions and concerns about trade relations between the two nations. The Prime Minister's remarks come amid broader geopolitical tensions and economic negotiations, underscoring the significance of international trade agreements in maintaining stable economic relations.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051755&language=en-US",
            "pub_date": "2026-02-27 16:16:36",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051754,
            "title": "Saudi Arabia's Wealth Fund Executive to Oversee Investment Strategy",
            "description": "Saudi Arabia's Public Investment Fund (PIF) has tasked a senior executive with the dual responsibility of driving local development and overseeing its investment strategy. Bloomberg posted on X that the executive's expanded role is part of the fund's efforts to align its strategic investments with national development goals. The PIF, a key player in Saudi Arabia's economic diversification plans, aims to bolster its portfolio while contributing to the country's Vision 2030 initiative. This move underscores the fund's commitment to integrating investment strategies with broader economic objectives.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051754&language=en-US",
            "pub_date": "2026-02-27 16:20:53",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051753,
            "title": "MetaAlpha deposited over $14 million worth of ETH into Binance in the past 24 hours.",
            "description": "According to The Data Nerd, MetaAlpha deposited 3,300 ETH, worth $6.66 million, into Binance 6 hours ago. In the past 24 hours, MetaAlpha has deposited a total of 6,994 ETH, worth $14.3 million, into Binance.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051753&language=en-US",
            "pub_date": "2026-02-27 16:15:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051743,
            "title": "India's Trade Minister Responds to U.S. Tariffs on Solar Exports",
            "description": "India's Trade Minister has addressed the recent imposition of a 126% tariff by the United States on Indian solar exports. According to Jin10, the minister clarified that anti-dumping duties or safeguard measures are typically not related to trade agreements. This statement comes amid ongoing discussions about trade relations between the two countries, highlighting the complexities involved in international trade policies.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051743&language=en-US",
            "pub_date": "2026-02-27 16:08:44",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051742,
            "title": "Cryptocurrency Market Awaits White House Deadline on CLARITY Act",
            "description": "Santiment has highlighted a shift in focus towards the White House's internal deadline of March 1, which is linked to negotiations on the significant CLARITY Act. According to Foresight News, this legislation is crucial for the cryptocurrency sector as it aims to establish clearer regulatory guidelines, thereby reducing uncertainty for investors, exchanges, and blockchain companies. Over the past month, there has been an increase in transactions exceeding $100,000 on Bitcoin, Ethereum, USDT, and XRP networks, often indicating a potential market reversal. Regardless of the market's direction, a significant rise in whale trading activity is anticipated in early March.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051742&language=en-US",
            "pub_date": "2026-02-27 16:09:49",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051741,
            "title": "Binance Futures to Launch ROBOUSDT Perpetual Contract with 20x Leverage",
            "description": "According to the announcement from Binance, the platform is set to expand its trading options on Binance Futures by introducing the ROBOUSDT Perpetual Contract, scheduled for launch on 2026-02-27 at 08:45 (UTC). This new contract will offer up to 20x leverage, providing traders with enhanced opportunities to engage with the Fabric Protocol (ROBO). The Fabric Foundation aims to create a secure, open, and globally beneficial future for AI and robotics, with the settlement asset for this contract being USDT.\n\nThe ROBOUSDT Perpetual Contract will feature a tick size of 0.00001 and a minimum trade amount of 1 ROBO, with a minimum notional value set at 5 USDT. The funding rate is capped at +2.00% / -2.00%, and the funding fee will be settled every four hours. Trading will be available 24/7, and the Multi-Assets Mode will be supported, allowing users to trade across multiple margin assets. For instance, users can utilize BTC as margin when trading this contract.\n\nBinance notes that the ROBOUSDT Perpetual Contract will be available for Futures Copy Trading within 24 hours of its launch. The platform may adjust the contract specifications based on market risk conditions, including funding fees, tick size, maximum leverage, and margin requirements. The Multi-Assets Mode enables trading across various margin assets, subject to applicable haircuts. It is important to note that futures and spot token listings are not correlated, and a token listed on Binance Futures does not guarantee a spot listing. The contract is subject to Binance's Terms of Use and Futures Service Agreement.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051741&language=en-US",
            "pub_date": "2026-02-27 16:11:52",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051740,
            "title": "White House Deadline for Clarity Act Sparks Interest Amid Market Activity",
            "description": "Santiment posted on X. Following Jane Street's recent market influence, focus has shifted to the White House's internal deadline on March 1 concerning the Clarity Act negotiations. This legislation is crucial for the cryptocurrency sector as it seeks to establish clearer regulatory guidelines, thereby reducing uncertainty for investors, exchanges, and blockchain companies.\n\nIn the past month, there have been significant transfers exceeding $100,000 on the Bitcoin, Ethereum, Tether, and XRP Ledger networks. Notably, spikes in large-scale transactions often indicate potential market reversals. A surge in such 'whale' activity is anticipated at the beginning of March, irrespective of the legislative outcomes.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051740&language=en-US",
            "pub_date": "2026-02-27 16:12:41",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051731,
            "title": "DualPath lifts throughput as RDMA eases KV-cache I/O",
            "description": "Data shows DualPath inference, KV cache bottleneck, RDMA ease cache I/O via a second storage-to-decode path and prefill, lifting throughput, TTFT and latency.\nsource: https://coincu.com/news/dualpath-lifts-throughput-as-rdma-eases-kv-cache-i-o/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051731&language=en-US",
            "pub_date": "2026-02-27 15:52:20",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}