{
    "data": [
        {
            "id": 733979,
            "title": "BTC rebounded and broke through 98,000 USDT, and the 24-hour decline narrowed to 2.87%",
            "description": "OKX market shows that BTC rebounded and broke through 98,000 USDT, and is now at 98,033.3 USDT, with the 24-hour decline narrowed to 2.87%. (This newsletter is generated by AI)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733979&language=en-US",
            "pub_date": "2025-02-05 10:54:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733978,
            "title": "Binance will launch spot grid and spot DCA trading pairs such as LTC/USDC",
            "description": "According to the official announcement, Binance will enable spot grid and spot DCA services for the following trading pairs at 08:00 (UTC) on February 6, 2025: LTC/USDC, S/USDC, TRUMP/USDC. Users need to complete account verification before they can participate in the transaction. Currently, users living in Canada, Cuba, Crimea, Iran, the Netherlands, North Korea, Syria, the United States and its territories (American Samoa, Guam, Puerto Rico, Northern Mariana Islands, U.S. Virgin Islands) and non-government controlled areas of Ukraine will not be able to trade the above spot trading pairs. (This newsletter is generated by AI)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733978&language=en-US",
            "pub_date": "2025-02-05 11:01:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733977,
            "title": "Coinbase Chief Legal Officer Urges SEC to Immediately Submit Documents Related to ETH 2.0 Investigation",
            "description": "Odaily Planet Daily News Coinbase Chief Legal Officer Paul Grewal posted on X: \"Today, Coinbase filed a status report in our separate SEC FOIA lawsuit. In short: the former SEC leadership only looked for documents that were not disclosed to the public in the ETH 2.0 investigation, but they made a lot of trouble in supervision through subpoenas and lawsuits. We seek the U.S. SEC to conduct a full investigation immediately and provide the required documents.\"",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733977&language=en-US",
            "pub_date": "2025-02-05 10:45:23",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733976,
            "title": "A certain address spent $2 million USDC to buy 3.1 million Fartcoin",
            "description": "Odaily Planet Daily News: On-chain data shows that a certain address spent 2 million US dollars in USDC and bought 3.1 million Fartcoins at an average price of 0.67 US dollars.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733976&language=en-US",
            "pub_date": "2025-02-05 10:48:45",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733975,
            "title": "AI Agent stocks fell across the board: FARTCOIN fell 18.1%",
            "description": "Odaily Planet Daily News GMGN data shows that AI Agent tokens fell across the board, including:\nFARTCOIN: 24H down 18.1%, now reported 0.653 USDT;\nai16z: 24H down 15.3%, now reported 0.371 USDT;\nzerebro: 24H down 10.2%, now reported 0.061 USDT;\nswarms: 24H down 23.3%, now reported 0.051 USDT;\nBULLY: 24H down 35.4%, now reported 0.0081 USDT.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733975&language=en-US",
            "pub_date": "2025-02-05 10:49:45",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733974,
            "title": "A whale reduced its holdings of 4,117 ETH bought in 21 years, with an estimated profit of $2.45 million",
            "description": "Odaily Planet Daily News According to the monitoring of on-chain analyst @ai_9684xtpa, a certain ETH whale is reducing the 4,117 ETH (US$11.37 million) bought in 2021, and is expected to make a profit of US$2.45 million. \nHe bought 7,693 ETH at an average price of US$2,167 during 2021.02-09. In the past 13 hours, he exchanged 2,117 of them for WBTC and deposited another 2,000 into Binance. \nHe currently still holds 30,797 ETH, most of which are pledged in EigenLayer and ether.fi.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733974&language=en-US",
            "pub_date": "2025-02-05 10:51:40",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733973,
            "title": "A user made a profit of $4.4 million on ENRON in less than half an hour",
            "description": "Odaily Planet Daily News: According to Lookonchain monitoring, just one second after Enron released the contract address, a user spent US$900,000 to purchase 11.66 million ENRONs, and then cashed out US$5.3 million, making a profit of US$4.4 million in less than 30 minutes.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733973&language=en-US",
            "pub_date": "2025-02-05 10:34:21",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733972,
            "title": "Berachain Ecosystem Meme Coin Project Henlo Completes $3 Million Seed Round Financing, with Framework Ventures and Others Participating",
            "description": "Odaily Planet Daily News According to official news, Berachain Ecological Community-driven Meme Coin Project Henlo announced the completion of a $3 million seed round of financing, with Framework Ventures, SNZ Capital, Rubik VC, Baboon VC, Paramount Capital, Primitive Ventures, Asylum Ventures and others participating. \nAccording to reports, Henlo is currently conducting an event where more than 70 communities from Ethereum, Solana and Bitcoin can earn Henlo points by holding NFTs, Meme coins and DeFi tokens of these networks. There is also a treasure hunt event with a prize of $50,000 hidden in the ecosystem.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733972&language=en-US",
            "pub_date": "2025-02-05 10:39:18",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733969,
            "title": "Yesterday, BlackRock IBIT had a net inflow of $250.31 million and a trading volume of $2.6 billion",
            "description": "Odaily Planet Daily News According to Trader T monitoring, BlackRock IBIT had a net inflow of US$250.31 million (2,524 BTC) yesterday, with a trading volume of US$2.6 billion.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733969&language=en-US",
            "pub_date": "2025-02-05 10:24:38",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733968,
            "title": "Sol Strategies, the “Solana version of micro-strategy”, increased its holdings by more than 40,000 SOL in late January, bringing its total holdings to nearly 190,000 SOL",
            "description": "Odaily Planet Daily News Between January 19 and January 31, Sol Strategies, the \"Solana version of microstrategy\", spent approximately $9.93 million to increase its holdings by 40,300 SOLs at an average price of $246.53, including fees and expenses. The company also completed a second convertible bond private placement of $2.5 million, with total proceeds paid by 6,564.47 SOLs.\nAs of January 31, Sol Strategies and its subsidiaries held a total of 189,968 SOLs at an average price of $179, worth nearly $40 million.\nThe company also announced that Chief Investment Officer Moe Adham will resign on January 30 due to his family's relocation to Tokyo. Adham joined the Sol board of directors in 2018.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733968&language=en-US",
            "pub_date": "2025-02-05 10:27:22",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}