{
    "data": [
        {
            "id": 733885,
            "title": "Luke Pettit appointed as head of US Treasury’s banking policy, involving digital asset firms",
            "description": "Odaily Planet Daily News The Trump administration has appointed Luke Pettit, an assistant to Republican Senator Bill Hagerty, to a senior position in the U.S. Treasury Department. According to a notice on Congress.gov, Pettit has been nominated as Assistant Secretary of Financial Institutions. Pettit will be in charge of the Treasury Department's department office, which plays an important role in formulating policies to regulate banks, fintech companies (including digital asset companies), non-bank mortgage institutions and many other financial companies. The position requires Senate approval.\nPettit has served as a senior policy adviser to Hagerty, a Republican from Tennessee, for the past three years. According to his LinkedIn profile, before that, he was an economist on the Senate Banking Committee and served at Bridgewater Fund, the Monetary Affairs Department of the Federal Reserve Bank of Washington, and the Federal Reserve Bank of San Francisco.\nHe will replace Graham Steele, who held the position during the Biden administration. Steele left the Treasury Department in January 2024.\nEthan Fallang, a former Rumble Inc. board member and protégé of Vice President JD Vance, has also been appointed to a senior position in the Treasury Department's Office of Financial Institutions. Fallang was a top candidate for the position of deputy assistant secretary for capital markets, according to people familiar with the matter, but it is unclear whether he has accepted the position. (Bloomberg)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733885&language=en-US",
            "pub_date": "2025-02-05 07:54:07",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733882,
            "title": "President Trump’s Crypto Czar Hosts U.S.’s First Press Conference On Bitcoin And Digital Assets",
            "description": "David Sacks and several pro-crypto politicians discuss the future of the Bitcoin and crypto industry in the United States at the first-ever U.S. press conference on digital assets.\nsource: https://bitcoinmagazine.com/politics/president-trumps-crypto-czar-hosts-first-press-conference-on-bitcoin-and-digital-assets",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733882&language=en-US",
            "pub_date": "2025-02-05 07:39:46",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733881,
            "title": "SEC is scaling back its crypto enforcement unit: Report",
            "description": "The SEC’s 50-person crypto unit is getting a shakeup with some staff reassigned to other areas, The New York Times reports.\nsource: https://cointelegraph.com/news/sec-scale-back-crypto-enforcement-unit-nyt?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733881&language=en-US",
            "pub_date": "2025-02-05 07:40:17",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733880,
            "title": "Ohio Senator Proposes Building Bitcoin Reserve and Accepting It as Payment",
            "description": "Odaily Planet Daily News: Ohio Senator Sandra O'Brien introduced a bill proposing to establish a Bitcoin reserve and require state entities to accept Bitcoin as a payment method.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733880&language=en-US",
            "pub_date": "2025-02-05 07:43:13",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733884,
            "title": "Ohio Senator Proposes Bill for Bitcoin Reserves and Payments",
            "description": "According to Odaily, Ohio State Senator Sandra O'Brien has introduced a bill proposing the establishment of a Bitcoin reserve and mandating state entities to accept Bitcoin as a form of payment. This legislative move aims to integrate cryptocurrency into the state's financial system, reflecting a growing interest in digital currencies.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733884&language=en-US",
            "pub_date": "2025-02-05 07:43:33",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733876,
            "title": "Meet the US Congressman Who's Now Repping Ethereum on His X Profile",
            "description": "Rep. William Timmons said that he created a self-custodial Ethereum wallet to gain familiarity with technology enabling financial sovereignty.\nsource: https://decrypt.co/304425/meet-us-congressman-repping-ethereum-x-profile",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733876&language=en-US",
            "pub_date": "2025-02-05 07:25:28",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733875,
            "title": "#Bitcoin Drops After #Crypto Czar Press Conference\n🟠 BTC fell to $97,690 (-3.79%) after David Sacks’ speech lacked specifics on a U.S. Bitcoin Reserve.\n🟠 Market uncertainty rises as U.S.-China trade tensions escalate.\n🟠 $BTC intraday: High $101,752 | Low $96,026.",
            "description": "null\nsource: https://x.com/Bitcoinsensus/status/1886920355219956149",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733875&language=en-US",
            "pub_date": "2025-02-05 07:30:44",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733874,
            "title": "Short the market on WEEX for up to $20k as a welcome bonus and 50% off all fees using our referral link  in the thumbnail below ⬇️⬇️",
            "description": "null\nsource: https://x.com/Bitcoinsensus/status/1886920358562795617",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733874&language=en-US",
            "pub_date": "2025-02-05 07:30:45",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733879,
            "title": "Circle Issues 250 Million USDC on Solana Blockchain",
            "description": "According to BlockBeats, on February 5, blockchain data revealed that Circle has issued an additional 250 million USDC on the Solana blockchain two hours ago.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733879&language=en-US",
            "pub_date": "2025-02-05 07:33:33",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733871,
            "title": "WazirX creditors to decide on recovery plan or risk lengthy liquidation",
            "description": "WazirX creditors will decide in the coming weeks whether to begin receiving compensation for their lost crypto as early as April 2025 or face a prolonged recovery process that could extend to 2030. The vote follows a Singapore High Court ruling allowing the embattled Indian exchange to pursue a restructuring plan rather than face liquidation. The […]\nThe post WazirX creditors to decide on...\nsource: https://cryptoslate.com/wazirx-creditors-to-decide-on-recovery-plan-or-risk-lengthy-liquidation/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733871&language=en-US",
            "pub_date": "2025-02-05 07:15:46",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}