{
    "data": [
        {
            "id": 734091,
            "title": "Travel platform Trivago has partnered with blockchain company Travala to enable cryptocurrency bookings",
            "description": "Odaily Planet Daily News Travel platform Trivago has partnered with blockchain-based company Travala to allow users to book accommodation with cryptocurrencies. The partnership adds Travala's inventory of more than 2.2 million properties in 230 countries to the Trivago platform. Trivago users can pay with more than 100 cryptocurrencies, including Bitcoin and Ethereum. Travala members will be directed to Trivago to complete their reservations and use its AVA smart program, which offers discounts and rewards. (TechinAsia)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734091&language=en-US",
            "pub_date": "2025-02-05 14:08:21",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734077,
            "title": "FTT rose above 2 USDT, with a 24-hour increase of 14.36%",
            "description": "Odaily Planet Daily News: Bitget market data shows that FTT has risen above 2 USDT and is currently trading at 2.06 USDT, with a 24-hour increase of 14.36%.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734077&language=en-US",
            "pub_date": "2025-02-05 14:01:08",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734074,
            "title": "VINE rose above 0.15 USDT, with a 24-hour increase of 23.68%",
            "description": "Odaily Planet Daily News OKX market data shows that VINE rose above 0.15 USDT and is currently trading at 0.1577 USDT, with a 24-hour increase of 23.68%.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734074&language=en-US",
            "pub_date": "2025-02-05 13:45:40",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734073,
            "title": "Crypto market sectors continue to pull back, with DeFAI and AI Agents sectors falling the most",
            "description": "Odaily Planet Daily News According to SoSoValue data, the crypto market sector continued to pull back, and the DeFAI and AI Agents sectors fell the most. In addition, Bitcoin (BTC) and Ethereum (ETH) have fallen below the monthly line. The DeFAI sector fell by 10.32% in 24 hours, and GRIFFAIN, ORBIT (GRIFT), and Hive AI (BUZZ) in the sector fell by 7.73%, 22.44%, and 20.26% respectively. The AI ​​Agents sector fell by 8.69% in 24 hours, among which Virtuals Protocol (VIRTUAL) fell by 6.80%, Fartcoin (FARTCOIN) fell by 16.01%, and AI mainstream tokens ai16z (AI16Z), AIXBT, and ACT fell by 15.42%, 6.30%, and 3.74% respectively.\nIn other sectors, the CeFi sector fell 5.09% in 24 hours, the Layer1 sector fell 5.55%, and within the sector, Solana (SOL) fell 5.09%, and Cardano (ADA) fell 6.86%. The DeFi sector fell 5.66%, the Layer2 sector fell 5.89%, and the Meme sector continued to fall. Dogecoin (DOGE) fell 7.25%, Pepe (PEPE) fell 5.69%, and OFFICIAL TRUMP (TRUMP) fell 8.14%, but Pudgy Penguins (PENGU) performed strongly and rose 4.87% against the trend.\nIn addition, the PayFi sector fell 9.48% in 24 hours, the top project XRP fell 7.73%, and Stellar (XLM) fell 6%.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734073&language=en-US",
            "pub_date": "2025-02-05 13:49:36",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734072,
            "title": "Bitcoin spot ETF had a total net inflow of US$341 million yesterday, and the ETF net asset ratio reached 5.93%",
            "description": "Odaily Planet Daily News According to SoSoValue data, yesterday (February 4, Eastern Time), the total net inflow of Bitcoin spot ETFs was US$341 million. Yesterday, Grayscale ETF GBTC had a single-day net inflow of US$19.5412 million, and the current historical net outflow of GBTC is US$21.864 billion. Grayscale Bitcoin Mini Trust ETF BTC had a single-day net outflow of US$0.00, and the current total historical net inflow of Grayscale Bitcoin Mini Trust BTC is US$1.232 billion. The Bitcoin spot ETF with the largest single-day net inflow yesterday was BlackRock ETF IBIT, with a single-day net inflow of US$249 million, and the current total historical net inflow of IBIT reached US$40.729 billion. The second largest ETF is ARKB from Ark Invest and 21Shares, with a single-day net inflow of $56.1234 million. Currently, ARKB's total net inflow has reached $2.952 billion. As of press time, the total net asset value of the Bitcoin spot ETF is $116.044 billion, and the ETF net asset ratio (market value to the total market value of Bitcoin) is 5.93%, with a historical cumulative net inflow of $40.603 billion.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734072&language=en-US",
            "pub_date": "2025-02-05 13:50:51",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734071,
            "title": "Ethereum spot ETF had a total net inflow of US$308 million yesterday, continuing its net inflow for 4 consecutive days",
            "description": "Odaily Planet Daily News According to SoSoValue data, yesterday (February 4, Eastern Time), the total net inflow of Ethereum spot ETFs was 308 million US dollars. Yesterday, Grayscale Ethereum Trust ETF ETHE had a single-day net outflow of 0.00 US dollars, and the current historical net outflow of ETHE is 3.918 billion US dollars. Grayscale Ethereum Mini Trust ETF ETH had a single-day net outflow of 0.00 US dollars, and the current historical total net inflow of Grayscale Ethereum Mini Trust ETH is 607 million US dollars. The Ethereum spot ETF with the largest single-day net inflow yesterday was BlackRock ETF ETHA, with a single-day net inflow of 276 million US dollars, and the current historical total net inflow of ETHA reached 4.413 billion US dollars. The second is Fidelity ETF FETH, with a single-day net inflow of US$27.4655 million. Currently, FETH's total net inflow has reached US$1.49 billion. As of press time, the total net asset value of Ethereum spot ETF is US$10.369 billion, and the ETF net asset ratio (market value to Ethereum's total market value) is 3.15%, and the historical cumulative net inflow has reached US$3.15 billion.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734071&language=en-US",
            "pub_date": "2025-02-05 13:51:49",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734070,
            "title": "Thailand SEC Plans DLT-Based Debt Trading System",
            "description": "According to Odaily, the Thailand Securities and Exchange Commission (SEC) is preparing to implement a Distributed Ledger Technology (DLT)-based debt instrument trading system. The initiative aims to encourage securities companies to engage in digital token trading. SEC Deputy Secretary-General Jomkwan Kongsakul stated that the regulatory body has approved four digital token projects and is evaluating two more, focusing on green tokens and investment-driven plans.\n\nKongsakul explained that purchasing bonds from the primary market currently takes 7-14 days before they can be traded in the secondary market. Investors face challenges such as limited access to certain products and high costs with low liquidity for some bonds. Issuers also deal with extensive manual paperwork, leading to delays and errors. Utilizing DLT is expected to enhance efficiency, streamline processes, and address obstacles in the capital markets.\n\nThe SEC aims to fully digitize the bond trading system in both primary and secondary markets, covering settlement, trading, investor registration, and return payments. Kongsakul assured that competition will remain open, allowing companies with their own DLT infrastructure to establish independent chains, provided they ensure interoperability within unified standards. Other companies can access the SEC's public chain at an affordable cost. Looking ahead, multiple trading chains may emerge, all interconnected through shared ledgers, with completion anticipated soon.\n\nExisting financial products will be retained but converted into digital equivalents to facilitate smooth transactions on the DLT network. This approach promotes fractional trading at lower costs and enhances liquidity by introducing more participants, enabling real-time trading and reducing settlement issues.\n\nAdditionally, the SEC is developing the SEC Open API data platform to provide comprehensive data on all listed companies, aiding investors in better analysis and more informed investment decisions.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734070&language=en-US",
            "pub_date": "2025-02-05 13:43:55",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734068,
            "title": "Bitcoin ETFs See Explosive Growth as Institutional Investors Pour In",
            "description": "The post Bitcoin ETFs See Explosive Growth as Institutional Investors Pour In appeared first on Coinpedia Fintech News\nBitcoin’s climb past $100,000 was short-lived as U.S.-China trade tensions resurfaced, triggering market uncertainty. While prices briefly rebounded after President Donald Trump announced a 30-day delay on new tariffs, some analysts warn that Bitcoin could still face a...\nsource: https://coinpedia.org/news/bitcoin-etfs-see-explosive-growth-as-institutional-investors-pour-in/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734068&language=en-US",
            "pub_date": "2025-02-05 13:33:53",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734067,
            "title": "Encrypted collaboration terminal project Herd completes $1.8 million Pre-Seed round of financing, led by Semantic Ventures",
            "description": "Odaily Planet Daily News According to official news, the encrypted collaborative terminal project Herd announced the completion of a $1.8 million Pre-Seed round of financing, led by Semantic Ventures, with participation from Archetype and Hardi Meybaum. \nHerd is building a collaborative terminal (coterminal) for contracts, allowing users to work with agents to combine existing on-chain contracts into off-chain and on-chain outputs.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734067&language=en-US",
            "pub_date": "2025-02-05 13:39:01",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734066,
            "title": "Cryptocurrency phishing scams caused losses of $10.25 million in January, mostly to Ethereum network users",
            "description": "Odaily Planet Daily News Blockchain security company Scam Sniffer reported that cryptocurrency phishing scams stole $10.25 million from 9,220 victims in January, a 56% drop from the $23.58 million loss in December. However, the report pointed out that criminals are constantly evolving and adopting more sophisticated attack methods. According to Scam Sniffer data, Ethereum network users are the most affected by phishing scams, accounting for more than 80% of the stolen funds. Losses on Ethereum exceeded $8.6 million, while BNB Chain and Arbitrum users lost $710,000 and $572,000, respectively. Polygon and Optimism also lost approximately $191,000 and $82,000, respectively. (Cryptoslate)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734066&language=en-US",
            "pub_date": "2025-02-05 13:41:19",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}