{
    "data": [
        {
            "id": 1054427,
            "title": "BREAKING: MASSIVE EXPLOSION ROCKS CENTRAL TEHRAN\n\nA huge blast shook Iran’s capital Sunday, sending smoke over the skyline, according to NPR. \n\nIsraeli military said it was striking central Tehran.\n\nThe explosion appeared to hit a district housing police HQ and state TV.\n\nThe",
            "description": "null\nsource: https://x.com/BSCNews/status/2028057716179325253",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054427&language=en-US",
            "pub_date": "2026-03-01 18:40:13",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054426,
            "title": "BREAKING: IRAN MISSILES FIRED TOWARD UK BASES IN CYPRUS\n\nUK Defence Secretary John Healey confirmed two Iranian missiles were launched in the direction of Cyprus, according to The @Independent.\n\nBritain maintains sovereign military bases on the island.\nHealey said the missiles",
            "description": "null\nsource: https://x.com/BSCNews/status/2028059320848650468",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054426&language=en-US",
            "pub_date": "2026-03-01 18:46:36",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054425,
            "title": "GEOPOLITICS | UK Foreign Office Issues Travel Advisory for Middle Eastern Countries",
            "description": "The UK Foreign Office has issued a travel advisory against all non-essential travel to Bahrain, Kuwait, Qatar, and the United Arab Emirates. According to Jin10, this advisory comes amid rising geopolitical tensions in the region. The Foreign Office urges travelers to remain vigilant and consider the necessity of their trips to these countries. This move reflects growing concerns over regional stability and potential risks to travelers. The advisory is part of broader efforts by the UK government to ensure the safety of its citizens abroad.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054425&language=en-US",
            "pub_date": "2026-03-01 18:49:52",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054423,
            "title": "GEOPOLITICS | EU Seeks De-escalation Measures Amid Iranian Military Actions",
            "description": "The European Union's High Representative for Foreign Affairs and Security Policy, Kallas, is actively engaging with partners to address the impact of Iranian military actions on regional countries. According to Jin10, Kallas is focused on identifying practical measures to de-escalate tensions in affected areas. The EU's diplomatic efforts aim to stabilize the situation and prevent further escalation. Kallas's outreach underscores the EU's commitment to maintaining regional security and fostering cooperation among affected nations.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054423&language=en-US",
            "pub_date": "2026-03-01 18:42:45",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054416,
            "title": "PeckShield: Crypto hacker losses fell to $26.5 million in February, a sharp drop of 98.2% year-over-year.",
            "description": "A report released by PeckShield on its X platform shows that in February 2026, the crypto industry experienced 15 hacking incidents, resulting in a total loss of $26.5 million. This represents a 98.2% year-over-year decrease compared to February 2025 (which saw a loss of $1.5 billion, including $1.4 billion from Bybit), and a 69.2% month-over-month decrease compared to January 2026 (which saw a loss of $86.01 million).",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054416&language=en-US",
            "pub_date": "2026-03-01 18:29:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054418,
            "title": "Virginia Data Centers' Power Grid Disruption Raises Concerns",
            "description": "Early last year, a group of data centers in Virginia unexpectedly disconnected from the power grid, raising concerns about the stability of the already fragile system. Wall Street Journal (Markets) posted on X, highlighting the potential risks associated with such disruptions. The incident underscores the critical role data centers play in maintaining grid stability and the need for robust infrastructure to support them. As data centers continue to expand, ensuring their reliable integration into the power grid becomes increasingly important to prevent future disruptions.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054418&language=en-US",
            "pub_date": "2026-03-01 18:33:02",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054417,
            "title": "GEOPOLITICS | Tehran Airstrike Not Targeting Iranian Broadcasting Complex",
            "description": "An Iranian media outlet reported that the airstrike on Tehran on Sunday did not target the Iranian Broadcasting Complex. According to Jin10, the information was sourced from the public relations department of the Islamic Republic of Iran Broadcasting. The clarification comes amid heightened tensions in the region, with various entities closely monitoring the situation.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054417&language=en-US",
            "pub_date": "2026-03-01 18:33:06",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054415,
            "title": "Paul Chan: Blockchain, AI and other technologies empower financial services and create a more efficient transaction system.",
            "description": "Hong Kong Financial Secretary Paul Chan published a personal essay titled \"AI+ and Finance+ Promote Each Other,\" in which he pointed out that we are currently at a critical juncture in technological innovation. Artificial intelligence is not only a core technology of the future, but also a huge force that can influence thousands of industries. Innovation in financial services itself is further helping to expand the real economy and overcome pain points. Technological innovations such as AI and blockchain are constantly empowering financial services, creating a more efficient and convenient transaction system, and opening up new channels for various enterprises' trade, financing, and risk management activities.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054415&language=en-US",
            "pub_date": "2026-03-01 18:34:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054414,
            "title": "Ethereum Account Abstraction Reaches Protocol Layer: Inside Vitalik’s EIP-8141 Framework",
            "description": "Vitalik Buterin unveiled EIP-8141, a protocol-native account abstraction design for Ethereum. This analysis explains frame transactions, wallets, paymasters and impact. <p>The post Ethereum Account Abstraction Reaches Protocol Layer: Inside Vitalik’s EIP-8141 Framework first appeared on Crypto News And Market Updates | BTCUSA. </p>\nsource: https://btcusa.com/ethereum-account-abstraction-reaches-protocol-layer-inside-vitaliks-eip-8141-framework/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054414&language=en-US",
            "pub_date": "2026-03-01 18:13:36",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054412,
            "title": "Vitalik backs AI to fast-track Ethereum roadmap as ETH sits nearly 60% below 2025 peak",
            "description": "Vitalik Buterin said AI helped create Ethereum’s 2030 roadmap in just 2 weeks, rather than years.\nsource: https://www.cryptopolitan.com/vitalik-says-ai-could-fast-track-ethereum/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054412&language=en-US",
            "pub_date": "2026-03-01 18:16:30",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054411,
            "title": "Iranian Stock Market Halts Trading Until Next Week",
            "description": "Iran's stock market has temporarily suspended trading until next week. According to Jin10, a spokesperson for the Iranian Securities and Exchange Organization announced that only stock market trading is currently paused. Details regarding the operation of the spot market or other financial markets within the capital market will be disclosed later.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054411&language=en-US",
            "pub_date": "2026-03-01 18:22:16",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054410,
            "title": "Iranian stock market trading suspended until next week",
            "description": "Trading on the Iranian stock market has been suspended until next week. A spokesperson for the Iranian Securities and Exchange Organization stated that currently only stock market trading is suspended; details regarding arrangements for spot trading and other financial markets will be announced later. (CCTV News)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054410&language=en-US",
            "pub_date": "2026-03-01 18:23:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054407,
            "title": "AI predicts XRP price for March 31, 2026",
            "description": "XRP is likely to remain below the $2 mark by the end of March, according to insights from an artificial intelligence model. Notably, the asset has remained suppressed in recent weeks, losing key support levels amid broader weakness in the cryptocurrency market. As of press time, the token was trading at $1.39, having rallied by over 5% in the past 24 hours, while on the weekly timeline, the asset is down 2%\nsource: https://finbold.com/ai-predicts-xrp-price-for-march-31-2026/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054407&language=en-US",
            "pub_date": "2026-03-01 18:05:27",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054406,
            "title": "GEOPOLITICS | Putin Condemns Killing of Iran's Supreme Leader as Violation of International Law",
            "description": "Russian President Vladimir Putin has denounced the killing of Iran's Supreme Leader Ayatollah Ali Khamenei, describing it as a brutal murder that violates all human moral standards and international law. According to Jin10, Putin expressed his condemnation through the Russian news agency TASS, emphasizing the severity of the act and its implications on global ethics and legal norms. The statement reflects ongoing geopolitical tensions and highlights the gravity of the incident in the international arena.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054406&language=en-US",
            "pub_date": "2026-03-01 18:07:11",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054405,
            "title": "Earnings Season Concludes Amid AI and Geopolitical Concerns",
            "description": "As the latest earnings season comes to a close, investors may have overlooked some significant developments due to the dominating influence of artificial intelligence on market narratives. Bloomberg posted on X, highlighting that geopolitical tensions and renewed trade uncertainties have also contributed to the overshadowing of earnings reports. These factors have captured the attention of market participants, diverting focus from the financial results of companies. The interplay of these elements continues to shape the investment landscape, influencing decision-making processes and market dynamics.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054405&language=en-US",
            "pub_date": "2026-03-01 18:13:21",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054398,
            "title": "Middle East Conflict Causes Major Flight Disruptions",
            "description": "Thousands of flights have been disrupted due to the escalating conflict in the Middle East. Bloomberg posted on X, reporting that Dubai's main airport, the world's busiest aviation hub, has effectively shut down following a suspected aerial strike. The closure has led to significant travel disruptions, affecting numerous passengers and airlines operating in the region. The situation remains tense as authorities work to assess the damage and ensure safety measures are in place. Travelers are advised to check with their airlines for updates on flight schedules and potential delays.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054398&language=en-US",
            "pub_date": "2026-03-01 17:59:09",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054397,
            "title": "Iran Appoints Ali Reza Arafi as Guardian Council Jurist",
            "description": "Iran has announced the election of Ali Reza Arafi as a jurist selected by the Guardian Council, according to Jin10. Under the Iranian constitution, in the event of the Supreme Leader's death, resignation, or dismissal, the Assembly of Experts is required to promptly designate and appoint a new Supreme Leader. Until a new Supreme Leader is appointed, a temporary committee consisting of the President, the head of the judiciary, and a jurist elected from the Guardian Council will assume the Supreme Leader's responsibilities.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054397&language=en-US",
            "pub_date": "2026-03-01 17:59:57",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054396,
            "title": "GEOPOLITICS | Putin Offers Condolences to Iran Over Khamenei's Passing",
            "description": "Russian President Vladimir Putin has extended his condolences to Iranian President Ebrahim Raisi following the death of Iran's Supreme Leader Ayatollah Ali Khamenei. According to Jin10, the message was conveyed through the TASS news agency, highlighting the close ties between Russia and Iran. The passing of Khamenei marks a significant moment in Iranian politics, potentially impacting the geopolitical landscape in the region. Putin's message underscores the importance of the relationship between the two nations amid ongoing global tensions.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054396&language=en-US",
            "pub_date": "2026-03-01 18:05:51",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054394,
            "title": "Minnesota, USA, proposes a complete ban on cryptocurrency ATMs.",
            "description": "Minnesota lawmakers have introduced a bill to ban cryptocurrency ATMs statewide, one of the toughest regulatory moves against such devices in the U.S. House File 3642, introduced on February 23, 2026, by DFL Representative Erin Koegel, aims to prohibit the “placement or operation of virtual currency ATMs” anywhere in Minnesota and repeal the existing regulatory framework established in 2024. The proposal has received support from law enforcement and consumer advocacy groups, who point out that these devices have become a primary tool for scammers, particularly in “pig butchering” scams targeting the elderly. The Minnesota Department of Commerce strongly supports the bill, arguing that existing safeguards are ineffective against sophisticated fraud. The bill must pass the state House of Representatives and Senate before being sent to the governor for his signature; the Minnesota legislative session will continue until May 2026. (Ibtimes)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054394&language=en-US",
            "pub_date": "2026-03-01 17:49:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054395,
            "title": "Minnesota Lawmakers Propose Ban on Cryptocurrency ATMs",
            "description": "Minnesota legislators have introduced a bill aiming to prohibit cryptocurrency ATMs statewide, marking one of the strictest regulatory measures against such devices in the United States. According to ChainCatcher, House File 3642, proposed by DFL Representative Erin Koegel, seeks to ban the placement and operation of virtual currency ATMs across Minnesota and dismantle the existing regulatory framework established in 2024. The proposal has garnered support from law enforcement and consumer advocacy groups, who argue that these machines have become a primary tool for scammers, particularly in schemes targeting the elderly. The Minnesota Department of Commerce strongly backs the bill, citing the ineffectiveness of current safeguards against sophisticated fraud. The bill must pass the state House and Senate before being sent to the governor for approval. The Minnesota legislative session will continue until May 2026.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054395&language=en-US",
            "pub_date": "2026-03-01 17:53:34",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}