{
    "data": [
        {
            "id": 1052429,
            "title": "Ethereum's Scaling Roadmap Unveiled by Vitalik Buterin",
            "description": "Vitalik Buterin has outlined Ethereum's scaling roadmap, which includes short-term upgrades set to be implemented in the upcoming Glamsterdam fork. According to NS3.AI, these enhancements will feature block-level access lists, ePBS, and multidimensional gas, all designed to improve execution efficiency and better manage state growth. In the long term, the scaling plans aim to increase blob throughput to facilitate the expansion of Ethereum's network.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052429&language=en-US",
            "pub_date": "2026-02-27 23:52:32",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052428,
            "title": "GEOPOLITICS | U.S. Air Force Tankers Withdraw from Qatar's Al Udeid Air Base",
            "description": "All U.S. Air Force refueling aircraft have been withdrawn from Al Udeid Air Base in Qatar. According to Jin10, this move marks a significant shift in the U.S. military's operational strategy in the region. The withdrawal of these tankers, which play a crucial role in aerial refueling operations, could impact the U.S. military's capabilities in the Middle East. The decision comes amid ongoing geopolitical tensions and strategic realignments in the area. The implications of this withdrawal on regional security and U.S. military operations remain to be seen.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052428&language=en-US",
            "pub_date": "2026-02-27 23:53:13",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052427,
            "title": "Private Credit Manager Invico Capital Corp. Addresses Investor Redemption Requests",
            "description": "Private credit manager Invico Capital Corp. has developed a strategy to manage redemption requests from significant investors. Bloomberg posted on X, highlighting the challenges firms are encountering due to increased withdrawal pressures in the broader market. Invico's approach aims to stabilize its fund amidst these heightened demands, reflecting a broader trend in the financial sector where firms are adapting to shifting investor behaviors.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052427&language=en-US",
            "pub_date": "2026-02-27 23:54:43",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052414,
            "title": "Brazil's Soybean Exports Face Delays Amid Record Harvest",
            "description": "Brazil is experiencing significant delays in soybean exports due to logistical challenges at river ports. According to Jin10, the country has achieved a record soybean harvest, but the transportation of these goods is being hindered by congestion and infrastructure limitations. This situation is raising concerns about potential increases in shipping costs, which could impact the global soybean market. The delays are primarily attributed to the high volume of produce needing transport and the limited capacity of existing port facilities. As a result, there is a growing risk of shipping costs spiraling out of control, which could have broader implications for international trade and commodity prices. Stakeholders are closely monitoring the situation, as prolonged disruptions could affect supply chains and market dynamics.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052414&language=en-US",
            "pub_date": "2026-02-27 23:45:52",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052413,
            "title": "Florida's National Fire Expands Amid Severe Drought Conditions",
            "description": "A massive wildfire, known as the National Fire, has engulfed an area larger than Manhattan in Florida, exacerbated by worsening drought conditions. Bloomberg posted on X, highlighting the severity of the situation as firefighters struggle to contain the blaze. The drought has intensified the fire's spread, posing significant challenges to containment efforts. Authorities are closely monitoring the situation, urging residents to remain vigilant and adhere to safety guidelines. The fire's impact on local communities and ecosystems is a growing concern, with efforts underway to mitigate damage and protect affected areas.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052413&language=en-US",
            "pub_date": "2026-02-27 23:46:56",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052426,
            "title": "Citibank plans to launch institutional-grade Bitcoin custody services in 2026.",
            "description": "Nisha Surendran, Head of Digital Asset Custody Development at Citibank, announced at an industry event hosted by Strategy that Citibank plans to integrate Bitcoin into its core banking business later in 2026, offering institutional-grade custody services, key management, and a wallet system. The platform will extend traditional tax reporting, compliance, and risk management processes to Bitcoin holdings, and will support 24/7 operation, SWIFT global transfer messaging, and API connectivity. Citibank currently manages approximately $30 trillion in assets, and this move aims to remove operational barriers to crypto assets for institutional investors such as pension funds and insurance companies. Surendran stated that the initial phase will focus on core custody functions, with subsequent expansion to include asset segregation and collateral management services.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052426&language=en-US",
            "pub_date": "2026-02-27 23:52:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052425,
            "title": "Spot silver touched $93 per ounce, up 5.35% on the day.",
            "description": "According to Gate data, spot silver touched $93 per ounce, up 5.35% on the day.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052425&language=en-US",
            "pub_date": "2026-02-27 23:53:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052403,
            "title": "Nasdaq 100 and S&P 500 Recover to Pre-PPI Levels",
            "description": "The Nasdaq 100 and S&P 500 have rebounded to levels seen before the release of the Producer Price Index (PPI). Bespoke Investment Group posted on X, highlighting the recovery of these major indices. The Nasdaq 100 and S&P 500's return to pre-PPI levels indicates a stabilization in the market following recent fluctuations. Investors are closely monitoring these indices as they navigate the current economic landscape. The recovery suggests a positive sentiment among market participants, reflecting confidence in the broader economic outlook.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052403&language=en-US",
            "pub_date": "2026-02-27 23:32:56",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052402,
            "title": "Trump Media Technology Group Engages in Talks for Potential Transaction",
            "description": "Trump Media Technology Group (TMTG) has announced ongoing discussions with TAE Technologies and Texas Ventures Acquisition III Corp. regarding a potential transaction. According to ChainCatcher, the proposed plan involves the completion of a previously announced merger between TMTG and TAE. Following this merger, certain business segments, including Truth Social, may be spun off into a new publicly listed company. Upon completion of the transaction, TAE's related operations and some existing businesses and assets of TMTG will remain within the current publicly listed company.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052402&language=en-US",
            "pub_date": "2026-02-27 23:34:07",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052401,
            "title": "Video Game Franchise Aims for New Success",
            "description": "A long-standing video game franchise is making efforts to achieve renewed success. Bloomberg posted on X, highlighting the franchise's latest strategies to captivate audiences and expand its reach. The franchise, known for its enduring popularity, is focusing on innovative approaches to engage both new and existing fans. Industry experts are observing how these efforts will impact the franchise's position in the competitive gaming market. As the gaming landscape evolves, the franchise aims to adapt and thrive amidst changing consumer preferences and technological advancements.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052401&language=en-US",
            "pub_date": "2026-02-27 23:34:50",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052400,
            "title": "Merck Reduces Workforce at U.S. Plant Due to Decline in Gardasil Demand",
            "description": "Merck & Co. is reducing its workforce at a U.S. facility responsible for producing the HPV vaccine Gardasil, as global demand for the cancer-preventing vaccine declines. Bloomberg posted on X, highlighting the company's decision to adjust its operations in response to shifting market conditions. The reduction in staff reflects a broader trend in the pharmaceutical industry, where companies are adapting to changes in vaccine demand and production needs. Merck's move is part of its strategy to align resources with current market dynamics, ensuring efficiency and sustainability in its operations. The company continues to monitor global demand and adjust its production capabilities accordingly.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052400&language=en-US",
            "pub_date": "2026-02-27 23:37:08",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052399,
            "title": "Vitalik Buterin published an article outlining Ethereum's scaling plan, covering short-term gas optimization and long-term phased deployment of ZK-EVM.",
            "description": "Vitalik Buterin stated in an article on the X platform that Ethereum scaling is divided into short-term and long-term parts. In the short term, the Glamsterdam upgrade will introduce a block-level access list to enable parallel verification, ePBS will allow for a larger proportion of time slots to be used for block verification, and Gas repricing will ensure that operational costs are aligned with actual execution time. The multi-dimensional Gas mechanism will be implemented in stages. Firstly, in Glamsterdam, the cost of \"state creation\" will be separated from the cost of \"execution and calldata,\" with state creation Gas not included in the approximately 16 million transaction Gas cap. At the EVM level, a \"reservoir\" dimension mechanism will be introduced, prioritizing the consumption of dedicated dimension Gas by default, and consuming from the reservoir when insufficient. Later, it will transition to multi-dimensional pricing, with different dimensions having different floating Gas prices. Long-term scaling includes ZK-EVM and blob. Regarding blobs, the plan is to continuously iterate PeerDAS, aiming to achieve a data processing capacity of approximately 8MB per second. In the future, Ethereum block data will directly enter the blob. The ZK-EVM rollout will proceed in phases: in 2026, validator clients supporting ZK-EVM will be available, allowing approximately 5% of the network to run; in 2027, this will be expanded to a larger proportion of a small number of nodes, while formal verification will be promoted; once conditions are ripe, it will transition to a three-out-of-five mandatory proof mechanism, ultimately continuously improving the security and formal verification level of ZK-EVM, and involving VM changes such as RISC-V.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052399&language=en-US",
            "pub_date": "2026-02-27 23:30:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052392,
            "title": "Private Credit Lenders Seek Higher Margin on German Insurance Broker Loan Amid AI Concerns",
            "description": "Private credit lenders are demanding an increased margin on a €1.2 billion loan to a German insurance broker, driven by apprehensions regarding the potential risks artificial intelligence (AI) poses to the industry. Bloomberg posted on X, highlighting the lenders' concerns about AI's impact on the insurance sector, which has prompted them to seek better terms on the loan. The move reflects broader unease in the financial markets about AI's transformative effects and the uncertainties it introduces to traditional business models. As AI continues to evolve, lenders are increasingly cautious, seeking to mitigate potential risks associated with its integration into various sectors.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052392&language=en-US",
            "pub_date": "2026-02-27 23:21:21",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052391,
            "title": "Economic Indicators Show Strong Performance in Key Areas",
            "description": "Recent economic data reveals a robust performance across several key indicators. Bespoke Investment Group posted on X that the Producer Price Index (PPI) showed strong results across the board. Additionally, the Chicago Purchasing Managers' Index (PMI) exceeded expectations, registering at 57.7 compared to the anticipated 52.1. Construction spending also surpassed forecasts, with a slight increase of 0.1%. These figures suggest a positive trend in economic activity, reflecting resilience in various sectors.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052391&language=en-US",
            "pub_date": "2026-02-27 23:24:11",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052390,
            "title": "Proposed Student Loan Repayment Cuts May Exceed £10 Billion",
            "description": "Proposals to reduce student loan repayments for certain graduates could result in costs exceeding £10 billion ($13.5 billion). Bloomberg posted on X, highlighting the mounting pressure on the Labour government to address the potential shift of young voters towards the Greens. The financial implications of these proposals are significant, as the government seeks to balance fiscal responsibility with political considerations.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052390&language=en-US",
            "pub_date": "2026-02-27 23:27:06",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052342,
            "title": "South Africa Proposes Cheaper Electricity to Support Ferrochrome Industry",
            "description": "South Africa has proposed offering reduced electricity rates to Glencore's ferrochrome smelting venture and Samancor Chrome’s operations in an effort to preserve employment in the sector. Bloomberg posted on X, highlighting the government's initiative aimed at sustaining the ferrochrome industry amid economic challenges. The move is part of a broader strategy to support key industries and maintain job stability in the country. The ferrochrome sector, which is vital to South Africa's economy, has been facing difficulties due to rising operational costs and global market pressures. By providing cheaper electricity, the government hopes to alleviate some of these financial burdens and ensure the continued operation of these significant industrial players.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052342&language=en-US",
            "pub_date": "2026-02-27 23:11:29",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052341,
            "title": "Norway Exempts Emission Trading Companies from CO2 Tax",
            "description": "Norway has announced that companies participating in emission trading will be exempt from paying the carbon dioxide tax. According to Jin10, the Norwegian government stated that this exemption will not affect the country's climate commitments. The decision aims to support businesses involved in emission trading while maintaining Norway's environmental goals. The government reassures that the exemption aligns with their climate policies and will not hinder efforts to reduce carbon emissions.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052341&language=en-US",
            "pub_date": "2026-02-27 23:13:21",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052340,
            "title": "Yandex Founder Arkady Volozh Renounces Russian Citizenship",
            "description": "Arkady Volozh, the founder of Yandex, has officially renounced his Russian citizenship. Bloomberg posted on X that this decision comes almost two years after Volozh sold his stake in Russia's leading search engine. He has since concentrated on expanding his Dutch neocloud company, Nebius Group NV. Volozh's move marks a significant step in his transition away from Russian business interests, aligning with his focus on international ventures.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052340&language=en-US",
            "pub_date": "2026-02-27 23:14:41",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052389,
            "title": "OKX will launch ROBOUSDT perpetual futures.",
            "description": "According to official news, OKX will officially launch ROBOUSDT perpetual contracts on its website, app, and API at 23:30 (UTC+8) on February 27, 2026. Detailed rules are as follows: ROBOUSDT contract trading opening time: February 27, 2026, 23:30 (UTC+8)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052389&language=en-US",
            "pub_date": "2026-02-27 23:20:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1052335,
            "title": "GEOPOLITICS | Russia Summons Finnish Ambassador Amid Rising Tensions",
            "description": "Russia has summoned the Finnish ambassador, escalating diplomatic tensions between the two nations. According to Jin10, this move comes amid ongoing geopolitical disputes and reflects the strained relations in the region. The summoning of the ambassador is seen as a significant diplomatic gesture, indicating Russia's dissatisfaction with recent developments involving Finland. The specifics of the discussions or the reasons behind the summoning have not been disclosed, but it underscores the fragile state of international relations in the area. Observers are closely monitoring the situation for any further developments that could impact regional stability.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1052335&language=en-US",
            "pub_date": "2026-02-27 23:02:58",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}