{
    "data": [
        {
            "id": 1054140,
            "title": "PRECIOUS METALS | Oil and Precious Metals Contracts See Price Increase",
            "description": "Oil and precious metals contracts experienced notable price increases yesterday. According to Foresight News, Bloomberg reported that on Hyperliquid, the price of perpetual oil contracts rose by approximately 5% to $70.6 per barrel. Meanwhile, perpetual contracts for gold and silver increased by about 1.3% and 2%, reaching $5,323 per ounce and $94.9 per ounce, respectively.In addition, silver futures led the commodity futures market in trading volume, with transactions exceeding $227 million within 24 hours. Gold futures also saw significant activity, with a trading volume of approximately $173 million.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054140&language=en-US",
            "pub_date": "2026-03-01 10:45:04",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054139,
            "title": "Ahmad Vahidi Appointed as New Commander of Iran's Revolutionary Guard",
            "description": "Ahmad Vahidi has been appointed as the new commander of Iran's Revolutionary Guard. According to Jin10, this leadership change comes amid ongoing geopolitical tensions in the region. Vahidi, who holds the rank of brigadier general, is expected to bring his extensive military experience to the role, potentially influencing Iran's strategic direction. The appointment is seen as a significant move by the Iranian government, reflecting its focus on strengthening military leadership. Observers are closely monitoring how this change might impact Iran's domestic and international policies.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054139&language=en-US",
            "pub_date": "2026-03-01 10:49:21",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054137,
            "title": "MARKETS: $XRP'S BULLISH ETF RUN CONTINUES...\n\nSpot @Ripple ETFs in the United States have not seen a single day of outflows this week.\n\nDespite $BTC and $ETH seeing outflows on Friday, $XRP ETFs gained net $2.21 million.\n\nThey hold $983 million worth of the token as of Feb 27.",
            "description": "null\nsource: https://x.com/BSCNews/status/2027932837526311019",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054137&language=en-US",
            "pub_date": "2026-03-01 10:24:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054136,
            "title": "“Slow-Motion Lottery”: Bull Run Will Expose Investors Without a Plan",
            "description": "A crypto bull market is less a guaranteed jackpot and more a slow-motion lottery that exposes who actually has a plan.\nsource: https://dailycoin.com/slow-motion-lottery-bull-run-will-expose-investors-without-a-plan/?utm_source=cryptopanic&utm_medium=rss",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054136&language=en-US",
            "pub_date": "2026-03-01 10:25:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054135,
            "title": "Crypto Markets Update: Bitcoin and Altcoins Jump, Massive Short Liquidations Follow Middle East Shock",
            "description": "Key Takeaways Bitcoin dropped sharply after the US-Israel strike on Iran but quickly reversed, swinging from a $2,800 loss to […] The post Crypto Markets Update: Bitcoin and Altcoins Jump, Massive Short Liquidations Follow Middle East Shock appeared first on Coindoo.\nsource: https://coindoo.com/crypto-markets-update-bitcoin-and-altcoins-jump-massive-short-liquidations-follow-middle-east-shock/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054135&language=en-US",
            "pub_date": "2026-03-01 10:29:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054134,
            "title": "Vitalik Buterin Highlights AI's Role in Accelerating Ethereum Development",
            "description": "Ethereum co-founder Vitalik Buterin has highlighted the significant impact of artificial intelligence on the development of Ethereum. According to NS3.AI, Buterin pointed out that a developer utilized AI-driven agentic coding to rapidly create a comprehensive Ethereum client prototype, aligning with the 2030 roadmap, in just two weeks. He further noted that advancements in AI are anticipated to enhance network security by facilitating increased testing and formal verification.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054134&language=en-US",
            "pub_date": "2026-03-01 10:37:26",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054133,
            "title": "Iranian Revolutionary Guard: \"Most Fierce\" Offensive Against US-Israeli Bases Imminent",
            "description": "The Iranian Revolutionary Guard announced that its \"most intense\" offensive against Israeli and US bases is imminent. The situation continues to develop. (Jinshi)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054133&language=en-US",
            "pub_date": "2026-03-01 10:21:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054126,
            "title": "U.S. and Israel Conduct Strike on Iran Amid High-Level Meeting",
            "description": "According to BlockBeats, on March 1, reports from CCTV News indicate that two American sources and a U.S. official familiar with the matter revealed that Israel and the United States launched an attack on Iran on Saturday. This occurred during a meeting between Iran's Supreme Leader Ayatollah Khamenei and his senior aides.\n\nThe Iranian Revolutionary Guard has vowed to impose 'severe' and 'decisive' punishment on the United States and Israel in response to the attack on Khamenei.\n\nMeanwhile, protests are taking place in New York, where people are rallying against the U.S. and Israeli military actions in Iran.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054126&language=en-US",
            "pub_date": "2026-03-01 10:13:59",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054118,
            "title": "Bitcoin(BTC) Surpasses 68,000 USDT with a 3.37% Increase in 24 Hours",
            "description": "On Mar 01, 2026, 02:03 AM(UTC). According to Binance Market Data, Bitcoin has crossed the 68,000 USDT benchmark and is now trading at 68,007.601563 USDT, with a narrowed 3.37% increase in 24 hours.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054118&language=en-US",
            "pub_date": "2026-03-01 10:03:07",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054117,
            "title": "BNB Surpasses 630 USDT with a 2.97% Increase in 24 Hours",
            "description": "On Mar 01, 2026, 02:04 AM(UTC). According to Binance Market Data, BNB has crossed the 630 USDT benchmark and is now trading at 630.690002 USDT, with a narrowed 2.97% increase in 24 hours.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054117&language=en-US",
            "pub_date": "2026-03-01 10:04:08",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054119,
            "title": "The US and Israel launched attacks during the Khamenei meeting, and the Iranian Revolutionary Guard vowed to retaliate.",
            "description": "The United States and Israel launched an attack on Iran on Saturday, just as Supreme Leader Ayatollah Khamenei was holding a meeting with senior aides. According to BNO News, the Iranian Revolutionary Guard stated it would respond \"severely\" and \"decisively\" to the US and Israel regarding Khamenei's assassination. The situation continues to develop. (CCTV News)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054119&language=en-US",
            "pub_date": "2026-03-01 10:08:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054113,
            "title": "Iran Confirms Supreme Leader Khamenei Is Dead after US, Israeli Attacks",
            "description": "According to Reuters, Iranian state media confirmed that Iran's supreme leader Khamenei has been killed in Israeli and US strikes, and the country will enter 40 days of mourning.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054113&language=en-US",
            "pub_date": "2026-03-01 09:55:32",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054112,
            "title": "Ethereum Surpasses 2000 USDT with Daily Increase of 1.85%",
            "description": "Ethereum has exceeded the 2000 USDT mark, currently trading at 2000.80 USDT. According to Foresight News, the cryptocurrency has experienced a daily increase of 1.85%.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054112&language=en-US",
            "pub_date": "2026-03-01 09:57:18",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054111,
            "title": "Protests Erupt in New York Against U.S. and Israeli Military Actions in Iran",
            "description": "On February 28, a protest took place in New York, where citizens gathered to voice their opposition to military actions by the United States and Israel against Iran. According to Jin10, the demonstration highlighted growing public discontent with the ongoing military strategies in the region. The protestors called for a reevaluation of foreign policy and urged for peaceful resolutions to international conflicts. The event underscores the increasing tension surrounding U.S. and Israeli relations with Iran, as well as the broader geopolitical implications of military interventions.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054111&language=en-US",
            "pub_date": "2026-03-01 09:58:17",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054110,
            "title": "Crypto Treasury Firms Expected to Consolidate by 2026 Amid Market Downturn",
            "description": "BTCS Chief Strategy Officer Wojciech Kaszycki predicts a consolidation trend among crypto treasury companies by 2026, driven by the current market downturn. According to NS3.AI, Kaszycki emphasizes that firms with operational businesses generating cash flow are in a stronger position to acquire companies holding crypto assets without income. He also identifies significant growth potential in tokenized real-world assets, particularly credit instruments, as new revenue streams for treasury firms.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054110&language=en-US",
            "pub_date": "2026-03-01 09:58:50",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054106,
            "title": "Explosion Reported in Kabul Amid Jet and Missile Sounds",
            "description": "An explosion has been reported in Kabul, the capital of Afghanistan. According to Foresight News, local residents have claimed to hear sounds resembling jets and missiles. Further details on the incident are yet to be confirmed.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054106&language=en-US",
            "pub_date": "2026-03-01 09:39:20",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054105,
            "title": "Ethereum's EIP-8141 Expected to Address Account Abstraction Challenges",
            "description": "Ethereum's EIP-8141 is anticipated to resolve account abstraction issues within a year. According to NS3.AI, this development is expected to enhance the functionality and security of Ethereum accounts. Meanwhile, Iran's cryptocurrency market is projected to experience significant growth, with the Islamic Revolutionary Guard Corps exerting substantial control amid ongoing regional tensions. Bitcoin continues to be highly liquid, serving as a strategic asset in macroeconomic planning. Additionally, crypto security incidents have seen a notable decrease this February, indicating improved security measures in the industry.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054105&language=en-US",
            "pub_date": "2026-03-01 09:39:21",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054108,
            "title": "US media: Pressure from Saudi Arabia and Israel prompted Trump to order an attack on Iran.",
            "description": "According to four sources familiar with the matter, US President Trump launched a massive airstrike against Iran on Saturday, driven by weeks of lobbying from two unusual Middle Eastern allies—Israel and Saudi Arabia. The sources indicated that while Saudi Crown Prince Mohammed bin Salman publicly supported a diplomatic solution to the Iranian issue, he repeatedly called Trump privately over the past month, urging the US to launch the airstrike. Meanwhile, Israeli Prime Minister Netanyahu continued to publicly lobby the US to strike Iran, considering it Israel's \"mortal enemy.\" Under combined pressure, Trump ordered a massive airstrike against the Iranian leadership and military. Despite US intelligence assessments suggesting that Iranian forces are unlikely to pose a direct threat to the US mainland within the next decade, the attack still occurred. (Washington Post)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054108&language=en-US",
            "pub_date": "2026-03-01 09:40:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054107,
            "title": "A whale that had been dormant for two years bought 4,819 ETH in 6 hours.",
            "description": "According to crypto analyst Ai (@ai_9684xtpa), the dormant address 0x054…f9b40 withdrew 4819 ETH from OKX six hours ago at an average price of $1941.25, worth approximately $9.35 million, and subsequently transferred it to another address. Based on current prices, this portion of ETH has already generated a floating profit of approximately $125,000.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054107&language=en-US",
            "pub_date": "2026-03-01 09:47:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1054087,
            "title": "Aave Proposal Advances to Next Stage in Token-Centric Transformation",
            "description": "Aave founder Stani Kulechov has announced the successful passage of the 'Aave Will Win' proposal through the Temp Check stage. According to NS3.AI, this proposal seeks to transition Aave Labs into a fully token-centric ecosystem, with all product revenue directed towards the AAVE token. The upcoming phase will involve refining the proposal structure based on community feedback before advancing to the ARFC stage.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1054087&language=en-US",
            "pub_date": "2026-03-01 09:38:58",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}