{
    "data": [
        {
            "id": 733155,
            "title": "Crypto News: Xeggex CEO’s Account Hacked, Funds Go Missing",
            "description": "The post Crypto News: Xeggex CEO’s Account Hacked, Funds Go Missing appeared first on Coinpedia Fintech News\nXeggex, a popular cryptocurrency exchange, has been experiencing issues after users reported sudden loss of logins and disappearing asset balances. Many are concerned that the exchange may have been “rugpulled.” Xeggex officials have explained that the CEO’s account was hacked, which...\nsource: https://coinpedia.org/news/crypto-news-xeggex-ceos-account-hacked-funds-go-missing/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733155&language=en-US",
            "pub_date": "2025-02-04 10:56:47",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733153,
            "title": "Yesterday, BlackRock’s Ethereum ETF transaction volume reached US$700 million, setting a new record high",
            "description": "Trader T monitoring shows that the trading volume of BlackRock Ethereum ETF ETHA reached $700 million yesterday, a record high. However, the net inflow/outflow of the ETF yesterday was 0. On the other hand, the trading volume of BlackRock Bitcoin ETF yesterday reached $4.2 billion. Similarly, the net inflow/outflow of the ETF yesterday was 0.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733153&language=en-US",
            "pub_date": "2025-02-04 10:52:05",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733152,
            "title": "BTC fell below 101,000 USDT, and the 24-hour increase narrowed to 7.93%",
            "description": "OKX market shows that BTC fell below 101,000 USDT and is now at 100,966 USDT, with the 24-hour increase narrowed to 7.93%. (This newsletter is generated by AI)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733152&language=en-US",
            "pub_date": "2025-02-04 10:54:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733151,
            "title": "Sui Bridge announces support for wBTC",
            "description": "Sui officially announced that Sui Bridge now supports wBTC to introduce the value of Bitcoin into the Sui DeFi ecosystem.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733151&language=en-US",
            "pub_date": "2025-02-04 10:56:22",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733148,
            "title": "Yesterday, Fidelity FETH had a net inflow of $49.7 million, and FBTC had a net outflow of $177.6 million",
            "description": "Farside monitoring showed that yesterday the Fidelity Ethereum ETF FETH had a net inflow of US$49.7 million, while the Fidelity Bitcoin ETF FBTC had a net outflow of US$177.6 million.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733148&language=en-US",
            "pub_date": "2025-02-04 10:43:50",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733147,
            "title": "A whale sent a total of about $9.24 million worth of AI16Z to CEX 5 hours ago",
            "description": "Arkham monitoring shows that a whale transferred a total of 21.338 million AI16Z to Bybit and Gate about 5 hours ago, worth about $9.24 million. The whale's associated address purchased these tokens from Jupiter from December to early January. At that time, the project's market value was over $1 billion. As of press time, the market value of AI16Z has fallen to $477 million.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733147&language=en-US",
            "pub_date": "2025-02-04 10:38:14",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733146,
            "title": "Movement announces the launch of a year-long Cornucopia project to improve ecosystem liquidity",
            "description": "The Movement ecosystem announced the launch of the one-year Cornucopia program, which aims to significantly increase the liquidity of Movement DeFi. The first phase started last week, and most of the vaults (supporting BTC, ETH and stablecoin assets) are now officially open, and the MOVE vault is about to go live. After users deposit their assets, after an 8-week lock-up period, the assets will be returned through the Movement Public Mainnet Beta, which will be launched soon.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733146&language=en-US",
            "pub_date": "2025-02-04 10:38:34",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733144,
            "title": "Ethereum Co-Founder Vitalik Buterin Praises L1 Expansion Efforts",
            "description": "According to Odaily, Ethereum co-founder Vitalik Buterin recently expressed his views on X, highlighting the ongoing expansion of Layer 1 (L1) networks. He commended developers working on EIP-4444, statelessness, client efficiency upgrades, and other initiatives aimed at increasing L1 gas limits while maintaining decentralization. The upcoming Pectra upgrade, scheduled for March, is expected to double Layer 2 (L2) capacity by increasing the blob target from 3 to 6. Buterin suggested that the blob target should be determined by token holder votes, allowing for adjustments in line with technological advancements without the need for hard forks.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733144&language=en-US",
            "pub_date": "2025-02-04 10:23:41",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733143,
            "title": "Bedrock: Berachain Boyco deposit activity ended, about 1,000 uniBTC were deposited",
            "description": "Odaily Planet Daily News - Multi-asset liquidity re-pledge protocol Bedrock posted on X that the Berachain Boyco deposit activity has ended, with about 1,000 uniBTC deposited in the activity. As the Berachain mainnet launch approaches, Bedrock is preparing to deepen its influence and further integrate into the ecosystem.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733143&language=en-US",
            "pub_date": "2025-02-04 10:23:22",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 733139,
            "title": "Web3 game Fableborne completes $12.4 million in new round of financing, led by Delphi Ventures",
            "description": "Pixion Games, the game studio behind the Web3 action role-playing game Fableborne, announced that it has raised $12.4 million in its latest round of financing, led by Delphi Ventures, with participation from Animoca Brands, Yield Guild Games (YGG), and Axie Infinity creator Sky Mavis. The financing will help it prepare for the launch of the POWER token later this year. According to reports, Fableborne is a free Web3 action role-playing game built on Ronin. Fableborne was developed by Pixion Games and is currently in its first season. (NFT Plazas)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=733139&language=en-US",
            "pub_date": "2025-02-04 10:15:38",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}