{
    "data": [
        {
            "id": 1053805,
            "title": "Iran internet drops to 4% amid US-Israeli strikes",
            "description": "Network data shows connectivity fell to 4% amid U. S. -Israeli strikes. The Iran internet blackout raises rights concerns as Amnesty and HRW urge accountability.\nsource: https://coincu.com/news/iran-internet-drops-to-4-amid-us-israeli-strikes/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053805&language=en-US",
            "pub_date": "2026-03-01 01:54:49",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053803,
            "title": "GEOPOLITICS | Jordan's Foreign Minister Accuses Iran of Unprovoked Attack",
            "description": "Jordan's Foreign Minister has accused Iran of launching an unprovoked attack on Jordan. According to Jin10, the minister stated that Iran's actions were unjustified and have raised tensions in the region. The accusation comes amid ongoing geopolitical conflicts involving Iran and several Middle Eastern countries. The minister emphasized the need for diplomatic solutions to address the escalating situation. This development adds to the complexity of regional dynamics, with potential implications for international relations and security.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053803&language=en-US",
            "pub_date": "2026-03-01 01:56:31",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053802,
            "title": "GEOPOLITICS | Reports Emerge of Family Tragedy Involving Iran's Supreme Leader",
            "description": "Reports have surfaced indicating a tragic incident involving the family of Iran's Supreme Leader, Ayatollah Ali Khamenei. According to Jin10, a member of the Tehran City Council has stated that Khamenei's son-in-law and daughter-in-law were killed in an attack. The details surrounding the incident remain unclear, and there has been no official confirmation from Iranian authorities. This development comes amid heightened tensions in the region, raising concerns about potential repercussions. Observers are closely monitoring the situation for further updates.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053802&language=en-US",
            "pub_date": "2026-03-01 02:00:18",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053801,
            "title": "Iran Vows Retribution for Attack on Children",
            "description": "Iranian Foreign Minister Araghchi has declared that Iran will undoubtedly punish those responsible for the killing of their children. According to Jin10, this statement underscores Iran's commitment to seeking justice for the victims. The foreign minister's remarks highlight the gravity of the situation and Iran's determination to hold the perpetrators accountable. This development comes amid heightened tensions in the region, with Iran emphasizing its resolve to protect its citizens and respond to acts of aggression.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053801&language=en-US",
            "pub_date": "2026-03-01 02:03:02",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053799,
            "title": "Tether Freezes $4.2B in USDT, Here’s Why",
            "description": "Tether froze approximately $4. 2 billion in USDT tied to criminal investigations, according to reporting from Reuters. Since 2023, the company has blocked about $3. 5B of that total, showing a sharp increase in enforcement activity over the past two years\nsource: https://techgaged.com/tether-freezes-4-2b-in-usdt-heres-why/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053799&language=en-US",
            "pub_date": "2026-03-01 01:44:53",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053798,
            "title": "UK Labour Minister Josh Simmons Resigns",
            "description": "Josh Simmons, a prominent figure within the UK Labour Party, has announced his resignation from his ministerial position. According to Jin10, Simmons' departure comes amid ongoing political shifts within the party. His resignation is expected to impact the party's dynamics and future strategies. The Labour Party is currently navigating through a period of internal restructuring, and Simmons' exit adds another layer of complexity to the situation. Observers are closely monitoring how this development will influence the party's approach to upcoming political challenges.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053798&language=en-US",
            "pub_date": "2026-03-01 01:45:14",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053797,
            "title": "GEOPOLITICS | Macau Raises Travel Alert for Iran Amid Security Concerns",
            "description": "Macau's tourism authority has elevated its travel warning for Iran to the highest level due to security concerns. According to RTHK, residents of Macau are advised to avoid traveling to Iran and those currently in the country should enhance their safety measures and leave as soon as possible. The tourism authority has not yet received any inquiries or requests for assistance related to this situation. Macau residents in need of support can contact the 24-hour tourism hotline at +853 2833 3000 or the Ministry of Foreign Affairs' global consular protection and service hotline at +86 10 12308.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053797&language=en-US",
            "pub_date": "2026-03-01 01:51:30",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053795,
            "title": "GEOPOLITICS | Israeli Military Orders Evacuation of Iranian Industrial Park",
            "description": "The Israeli military has issued an evacuation order for an industrial park in Isfahan, Iran. According to Jin10, this development comes amid heightened tensions in the region. The specifics of the evacuation order and its implications for regional stability remain unclear. Observers are closely monitoring the situation for further updates.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053795&language=en-US",
            "pub_date": "2026-03-01 01:40:23",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053794,
            "title": "GEOPOLITICS | Greece's Souda Naval Base Heightens Security Amid Emergency Alert",
            "description": "Greece's Souda Naval Base has reportedly intensified security measures, restricting access to essential personnel only. According to Jin10, this move is part of an emergency alert protocol, with air defense systems now in place to ensure heightened protection.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053794&language=en-US",
            "pub_date": "2026-03-01 01:40:27",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053790,
            "title": "GEOPOLITICS | Israel Monitors 10th Round of Iranian Missiles",
            "description": "On February 28, local time, the Israeli military reported monitoring the 10th round of missiles launched by Iran towards Israel. According to Jin10, this development marks a continuation of heightened tensions between the two nations. The Israeli military's announcement underscores ongoing regional instability and the potential for further escalation. The situation remains closely watched by international observers.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053790&language=en-US",
            "pub_date": "2026-03-01 01:27:56",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053789,
            "title": "Elon Musk's Potential to Become World's First Trillionaire Examined",
            "description": "Elon Musk is on track to potentially become the world's first trillionaire, a milestone that could significantly impact global markets and politics. Bloomberg posted on X, highlighting how historical figures like John D. Rockefeller have demonstrated the transformative power of wealth at such a scale. Musk's ventures, including Tesla and SpaceX, continue to drive his financial ascent, raising questions about the broader implications of his growing influence. As Musk's wealth increases, the effects on economic structures and political dynamics are expected to be profound, echoing the shifts seen during Rockefeller's era.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053789&language=en-US",
            "pub_date": "2026-03-01 01:30:27",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053788,
            "title": "Bangladesh Ensures Safety of Diplomats and Students in Iran",
            "description": "Bangladesh's Ministry of Foreign Affairs has announced measures to ensure the safety and security of its diplomatic missions, diplomats, other staff, and Bangladeshi students in Iran. According to Jin10, the ministry emphasized its commitment to protecting its nationals amid the current geopolitical climate. The announcement comes as part of Bangladesh's broader efforts to safeguard its citizens abroad.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053788&language=en-US",
            "pub_date": "2026-03-01 01:31:38",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053787,
            "title": "FBI Heightens Alert Nationwide Following Iran Attack",
            "description": "The Federal Bureau of Investigation (FBI) has placed its counterterrorism and counterintelligence teams on high alert across the United States. According to Jin10, this heightened state of readiness comes in response to a recent attack by Iran. The FBI's increased vigilance aims to address potential threats and ensure national security in the wake of the incident. The agency is closely monitoring the situation and coordinating with other law enforcement agencies to mitigate any risks. This development underscores the ongoing geopolitical tensions and the need for heightened security measures.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053787&language=en-US",
            "pub_date": "2026-03-01 01:32:09",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053780,
            "title": "Shift in Career Trends: Emphasis on Apprenticeships Over Degrees",
            "description": "The focus on traditional education is shifting as more individuals consider apprenticeships over degrees. Bloomberg posted on X, highlighting the changing landscape where practical skills and hands-on experience are gaining importance. This trend reflects a broader movement towards valuing real-world experience and specialized training in various industries. As the job market evolves, the emphasis on apprenticeships is expected to grow, offering an alternative path to career development.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053780&language=en-US",
            "pub_date": "2026-03-01 01:14:07",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053783,
            "title": "Midnight Network Secures Google Cloud and MoneyGram Ahead of Mainnet Launch",
            "description": "Key Takeaways Google Cloud and MoneyGram joined Midnight as founding node operators before its March 2026 mainnet launch.\nsource: https://coindoo.com/midnight-network-secures-google-cloud-and-moneygram-ahead-of-mainnet-launch/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053783&language=en-US",
            "pub_date": "2026-03-01 01:15:08",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053779,
            "title": "GEOPOLITICS | Israel Conducts Largest Air Operation Against Iran",
            "description": "The Israeli Defense Forces announced that approximately 200 fighter jets have completed the largest military flyover in the history of the Israeli Air Force, targeting missile arrays and defense systems in western and central Iran. According to Jin10, the operation was meticulously planned and executed with high-quality intelligence, coordinating hundreds of aircraft. Israeli jets simultaneously dropped hundreds of munitions on multiple locations in Iran, striking around 500 targets, including air defense systems and missile launchers. The attack on defense systems has allowed the Israeli Air Force to expand its aerial dominance over Iranian airspace, significantly weakening Iran's offensive capabilities. This military operation demonstrated strong deterrence, successfully thwarting numerous threats against Israeli fighter jets and civilians. The Israeli Air Force continues its activities within Iranian territory, with the Israeli Defense Forces committed to further diminishing various aspects of the Iranian regime.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053779&language=en-US",
            "pub_date": "2026-03-01 01:15:15",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053778,
            "title": "GEOPOLITICS | Turkish President Erdogan Condemns Attack on Iranian Sovereignty",
            "description": "Turkish President Recep Tayyip Erdogan has publicly condemned the recent attack on Iranian sovereignty. According to Jin10, Erdogan expressed his disapproval of the incident that occurred on Saturday, emphasizing the importance of respecting national sovereignty and maintaining regional stability. The attack has raised concerns about escalating tensions in the region, prompting calls for diplomatic solutions to prevent further conflict. Erdogan's statement reflects Turkey's stance on upholding international law and fostering peaceful relations among neighboring countries.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053778&language=en-US",
            "pub_date": "2026-03-01 01:19:56",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053775,
            "title": "GEOPOLITICS | U.S. Ambassador Assures Lebanon of No Further Israeli Military Action",
            "description": "The U.S. Ambassador to Lebanon has conveyed to the Lebanese President that Israel will refrain from further military actions against Lebanon, provided that Lebanon does not engage in hostile activities. According to Jin10, this assurance aims to ease tensions in the region and promote stability. The statement comes amid ongoing geopolitical concerns and highlights the importance of diplomatic efforts in maintaining peace. The U.S. continues to play a mediating role in the Middle East, seeking to prevent escalation and encourage dialogue between neighboring countries.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053775&language=en-US",
            "pub_date": "2026-03-01 01:06:02",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053774,
            "title": "GEOPOLITICS | UK Advises Citizens in Saudi Arabia to Stay Indoors Amid Rising Tensions",
            "description": "The UK Foreign, Commonwealth & Development Office (FCDO) has issued a recommendation for British citizens residing in Saudi Arabia to remain indoors. According to Jin10, this advisory comes amid escalating geopolitical tensions in the region. The FCDO's guidance aims to ensure the safety of UK nationals as the situation develops. British citizens are urged to stay informed about local developments and follow any additional instructions from local authorities.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053774&language=en-US",
            "pub_date": "2026-03-01 01:11:51",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1053773,
            "title": "GEOPOLITICS | U.S. President Trump Initiates Middle Eastern Conflict",
            "description": "U.S. President Donald Trump has potentially initiated a prolonged conflict in the Middle East, a move he previously criticized in past administrations. Bloomberg posted on X, highlighting the irony of Trump's actions given his past condemnation of similar military engagements by his predecessors. The situation raises concerns about the long-term implications for regional stability and U.S. foreign policy. Observers are closely monitoring developments as tensions escalate, with potential impacts on international relations and security dynamics in the Middle East.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1053773&language=en-US",
            "pub_date": "2026-03-01 01:12:59",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}