{
    "data": [
        {
            "id": 734121,
            "title": "NFT Sales Decline in January 2025, Ethereum Leads Market",
            "description": "According to PANews, NFT sales across 23 blockchains tracked by CryptoSlam totaled approximately $677 million in January 2025. This marks a 23.84% decrease from December 2024's sales of $889 million. Ethereum dominated the market with NFT sales accounting for 49.97% of the total, amounting to around $338 million. Bitcoin followed with 17.15% of the sales, approximately $116 million. Other notable blockchains included Solana with $80.72 million, Mythos with $34.92 million, Immutable with $32.32 million, and Polygon with $24.95 million.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734121&language=en-US",
            "pub_date": "2025-02-05 14:43:48",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734120,
            "title": "Bitcoin's Price Shows Technical Divergence With RSI",
            "description": "According to PANews, Matrixport's latest report highlights a significant technical divergence between Bitcoin's price and its Relative Strength Index (RSI). Despite Bitcoin maintaining a price above $100,000, the RSI has been consolidating, indicating a weakening momentum in the underlying trend.\n\nHistorically, strong buying opportunities have only emerged when the RSI drops to around 40% during correction and consolidation phases prior to 2024. Currently, the RSI is close to this level at 48%, but has not yet reached it, suggesting that entering new long positions might be premature. A more strategic approach would be to remain patient and wait for the optimal entry point.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734120&language=en-US",
            "pub_date": "2025-02-05 14:43:56",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734119,
            "title": "A16z Urges DOJ To Reconsider Accountability In DeFi Protocols",
            "description": "According to Odaily, venture capital firm a16z has expressed that the U.S. Department of Justice (DOJ) should cease holding DeFi protocols accountable for unlawful activities they neither incited nor controlled. The firm emphasized that imposing responsibility on individuals for systems and activities beyond their control could lead to adverse outcomes. Unfortunately, the DOJ has overlooked this distinction, attempting to hold software developers accountable for third-party actions using neutral tools they initially created but no longer control.\n\nA16z suggests that the new U.S. presidential administration's primary policy focus on cryptocurrency should be to legally define and understand 'control' accurately. This understanding is crucial for determining whether cryptocurrency companies qualify as 'money transmission businesses,' which are subject to specific regulations and obligations. According to its official website, a16z's investment portfolio includes over 100 cryptocurrency companies, such as decentralized exchanges like Uniswap.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734119&language=en-US",
            "pub_date": "2025-02-05 14:44:12",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734118,
            "title": "Cryptocurrency Market Experiences Broad Pullback: DeFAI and AI Agents Sectors Suffer Significant Losses",
            "description": "The cryptocurrency market is undergoing a notable correction, with the DeFAI and AI Agents sectors experiencing the sharpest declines, according to a recent report by Odaily. Both Bitcoin (BTC) and Ethereum (ETH) have dipped below their monthly averages, indicating a bearish trend across the board.Sector-Specific PerformanceDeFAI Sector: This sector witnessed a significant drop of 10.32% over the last 24 hours. Notable cryptocurrencies within this sector such as GRIFFAIN, ORBIT (GRIFT), and Hive AI (BUZZ) recorded declines of 7.73%, 22.44%, and 20.26%, respectively.AI Agents Sector: Fell by 8.69% in the same period, with Virtuals Protocol (VIRTUAL) decreasing by 6.80%, Fartcoin (FARTCOIN) by 16.01%, and prominent AI tokens like ai16z (AI16Z), AIXBT, and ACT dropping by 15.42%, 6.30%, and 3.74%, respectively.Other Notable Sector MovementsCentralized Finance (CeFi): Dropped by 5.09%.Layer 1 Networks: Solana (SOL) and Cardano (ADA) saw decreases of 5.09% and 6.86%.Decentralized Finance (DeFi): Decreased by 5.66%.Layer 2 Solutions: Experienced a reduction of 5.89%.Meme Sector: Continued its downward trend with Dogecoin (DOGE) falling by 7.25%, Pepe (PEPE) by 5.69%, and OFFICIAL TRUMP (TRUMP) by 8.14%. However, Pudgy Penguins (PENGU) went against the grain, rising by 4.87%.Payment and Finance (PayFi): Suffered a 9.48% fall, with XRP down 7.73% and Stellar (XLM) declining by 6%.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734118&language=en-US",
            "pub_date": "2025-02-05 14:44:33",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734114,
            "title": "a16z calls on the US Department of Justice to stop requiring DeFi protocols to be responsible for user behavior",
            "description": "Odaily Planet Daily News Venture capital firm a16z issued an article stating that the U.S. Department of Justice (DOJ) should stop holding DeFi protocols accountable for illegal activities that they did not instigate and cannot control.\nThe article pointed out: \"Holding people accountable for systems and activities over which they have no power or control will lead to adverse consequences. Unfortunately, the Department of Justice ignored this distinction and tried to do this by holding software developers accountable for the actions of third parties who use neutral tools that they originally created but no longer control.\"\nThe agency said that the \"biggest policy focus\" of the new U.S. presidential administration on cryptocurrencies should be \"codifying the correct and legal understanding of 'control' in the law.\"\na16z believes that this is particularly important for determining whether a cryptocurrency company qualifies as a \"funds transmission business\" because the business needs to comply with specific rules and obligations.\nAccording to the official website, a16z's venture capital investment portfolio covers more than 100 cryptocurrency companies, including DEXs such as Uniswap.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734114&language=en-US",
            "pub_date": "2025-02-05 14:37:48",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734113,
            "title": "A whale deposited AAVE, LINK, UNI and other tokens into Binance 8 hours ago, equivalent to about 7.96 million US dollars",
            "description": "Odaily Planet Daily News According to Spot On Chain monitoring, 8 hours ago, the whale address \"0x257\" deposited 4 assets worth US$7.96 million to Binance, including 3 major DeFi tokens, specifically: \n13,816 AAVE, +2.56 million US dollars in profit (+255%); \n161,463 LINK, +2.13 million US dollars in profit (+213%); \n85,529 UNI, +258,000 US dollars in profit (+52%); \n289,399 EIGEN (US$531,000). \nThe whale has been a long-term holder of AAVE, LINK and UNI since mid-2022.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734113&language=en-US",
            "pub_date": "2025-02-05 14:37:49",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734112,
            "title": "Tether launches AI SDK platform to promote the integration of AI and crypto applications",
            "description": "Odaily Planet Daily News Tether CEO Paolo Ardoino announced the launch of the AI ​​SDK platform on X. Built on a Bare JavaScript runtime, the AI ​​SDK is compatible with a variety of hardware systems, including embedded devices. The open source platform is designed to facilitate the integration of artificial intelligence with cryptocurrency-related applications.\nThis AI SDK will support a variety of functions, such as AI translation, AI voice assistant, and AI Bitcoin wallet assistant. These tools are expected to enhance the accessibility of crypto transactions, making interactions more efficient and user-friendly.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734112&language=en-US",
            "pub_date": "2025-02-05 14:41:43",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734104,
            "title": "ETH supply exceeds Ethereum pre-merger level",
            "description": "Odaily Planet Daily News According to Ultrasound data, the current supply of ETH has exceeded the level before the Ethereum PoS merger. Data shows that the current ETH supply is 120,521,291, an increase from 120,521,140.92 at the time of the merger on September 15, 2022. Since Ethereum completed the transition to the Proof of Stake (PoS) mechanism, 1,947,607.01 ETH has been destroyed, and 1,947,757.18 ETH have been newly issued, with a net supply increase of 150.17 ETH.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734104&language=en-US",
            "pub_date": "2025-02-05 14:26:36",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734103,
            "title": "Gavin Wood: Polkadot’s Satoshi coefficient reaches 149, and its degree of decentralization far exceeds Ethereum and Solana",
            "description": "Odaily Planet Daily News: Ethereum co-founder and Polkadot founder Gavin Wood said in an interview with Forbes recently that blockchains that ignore decentralization and resilience should not be considered Web3. Measuring the resilience of a blockchain usually comes down to assessing its degree of decentralization, and Wood identified several questions to assess this metric: Who makes protocol decisions? Does governance have a clear or low entry barrier? And the Nakamoto coefficient, which measures how many parties are needed to destroy the network. Finally, Wood drew attention to more \"diffuse concepts,\" such as whether a single entity can define a narrative and \"fundamentally transcend the ecosystem and stifle other narratives.\" He is satisfied with Polkadot's decentralization. According to Nakaflow data, Polkadot's current Nakamoto coefficient is 149, which means that at least 149 independent validators are required to unite to destroy the network. In comparison, some other major blockchains have much lower scores, such as Solana's score of 19 and Ethereum's score of only 2. However, for Polkadot, the high barrier to entry is still a problem. In addition, Wood also proposed the following five basic criteria for judging the potential of blockchain: \n1. Resilience: The cornerstone of Web3, resilience combines cryptography, decentralization and game theory to protect blockchain from attacks and ensure its long-term stability; \n2. Performance: Not only scalability, performance also measures the efficiency of a network in processing and completing tasks; \n3. Generality: The ability of blockchain to support multiple applications and programmability; \n4. Accessibility: The ease with which users, developers, applications and robots interact with the network; \n5. Coherence: The ability of a system to maintain fast and consistent communication in its network.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734103&language=en-US",
            "pub_date": "2025-02-05 14:30:35",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734102,
            "title": "Matrixport: There is a clear technical divergence between Bitcoin price and RSI, indicating that its momentum is weakening",
            "description": "Odaily Planet Daily News Matrixport released today's chart saying that there is a clear technical divergence between the price of Bitcoin and the relative strength index (RSI). Although the price of Bitcoin has remained above $100,000, the RSI has been in a consolidation state, indicating that the momentum of the underlying trend is weakening.\nLooking back at the correction and consolidation phases before 2024, strong buying opportunities have historically only occurred when the RSI fell to about 40%. At present, although the RSI is close to that level (48%), it has not yet reached it, so it may be too early to enter a new long position. A more strategic approach is to remain patient and wait for the best entry point.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734102&language=en-US",
            "pub_date": "2025-02-05 14:34:05",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}