{
    "data": [
        {
            "id": 734137,
            "title": "X Money may support QR code payment",
            "description": "Odaily Planet Daily News: Independent App developer Nima Owji published a post revealing that X Money, the payment function of the X platform, may support QR codes.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734137&language=en-US",
            "pub_date": "2025-02-05 15:06:38",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734136,
            "title": "Analysis: Bitcoin miners' revenue increased 41% to $3.7 billion last quarter, but there may be fluctuations in the future",
            "description": "Odaily Planet Daily News H.C. Wainwright analysts said that as Bitcoin breaks through $100,000 for the first time in the fourth quarter of 2024, the profits earned by miners will increase significantly.\nSpot Bitcoin ETFs attracted $16.7 billion in inflows during the quarter, almost four times the $4.3 billion in the third quarter, pushing the average BTC price to $83,432 during the quarter, up 36.7% from the previous quarter.\nAnalysts expect these trends to drive strong revenue growth and improved profit margins in mining companies' upcoming earnings reports. The mining industry expanded significantly, with listed miners increasing their operations by 46 EH/s, bringing total deployed capacity to 235.8 EH/s. The global network hash rate averaged 738 EH/s in the fourth quarter, up 17.3% from the third quarter. As of the beginning of the first quarter of 2025, the hash rate continues to climb, reaching 833 EH/s on February 2.\nRising BTC prices and increased mining activity pushed total BTC production up 16.4% month-on-month to 11,366 BTC, while transaction fees surged 59.4% to 1,553 BTC. This pushed total miner revenue up 41% to $3.7 billion. The total market capitalization of listed mining companies increased by 21% to US$28 billion, with AI-related mining companies outperforming their peers.\nLooking ahead, Q1 2025 is off to a strong start, with average BTC prices approaching $100,000 and ETF inflows reaching $5.7 billion. However, analysts warned that markets could be volatile due to ongoing trade tensions between the United States and Canada, Mexico and China. Despite short-term uncertainty, they see any weak nodes in BTC or mining as buying opportunities. (crypto.news)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734136&language=en-US",
            "pub_date": "2025-02-05 15:14:27",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734133,
            "title": "Ethereum’s daily spot trading volume hits a record high of $38 billion",
            "description": "Odaily Planet Daily News FalconX Research Director David Lawant wrote on X that on February 3rd, local time, Ethereum's daily spot trading volume reached a record high of $38 billion, while Bitcoin's daily trading volume reached $49 billion, the third highest record in history. The surge in trading activity coincided with the volatility of Ethereum prices, with ETH falling to an intraday low of $2,152 before rebounding to $2,919. On the same day, Trump's second son Eric Trump said on X that now is a great time to add ETH (In my opinion, it's a great time to add ETH.).",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734133&language=en-US",
            "pub_date": "2025-02-05 15:01:56",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734132,
            "title": "Deribit BTC block options buy year-end $125,000 call options, totaling 600 BTC",
            "description": "Odaily Planet Daily News: Lin Chen, head of Asia-Pacific business at Deribit, wrote on X that today’s largest BTC option was: a user paid a premium of $9.856 million and purchased a $125,000 call option at the end of the year, for a total of 600 BTC.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734132&language=en-US",
            "pub_date": "2025-02-05 15:03:28",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734131,
            "title": "Deribit ETH block options sold $2,500 put options at the end of March, totaling 2,750 ETH",
            "description": "Odaily Planet Daily News: Lin Chen, head of Asia-Pacific business at Deribit, wrote on X that today’s largest ETH bulk option transaction was: a user earned $448,000 in premiums and sold a $2,500 put option at the end of March, totaling 2,750 ETH.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734131&language=en-US",
            "pub_date": "2025-02-05 15:04:24",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734130,
            "title": "SEC Requires Top-Level Approval for Launching Probes Under New Republican Leadership",
            "description": "According to Reuters - In a significant procedural shift, the U.S. Securities and Exchange Commission (SEC) now mandates that its lawyers obtain approval from its politically appointed leaders before initiating formal investigations, according to two sources familiar with the matter. This change reflects a new approach under the Trump administration's leadership, aiming to centralize decision-making and potentially slow the pace of SEC investigations.Changes in SEC ProceduresHistorically, the authority to launch formal orders of investigation—which allow the issuance of subpoenas for testimony or documents—was delegated to lower-level staff within the SEC. However, under the new guidelines, this authority must now be approved by the Commission itself, which currently consists of two Republicans and one Democrat, all appointed by the president.Impact on Enforcement AutonomyThis recent development marks a departure from previous norms at the agency, where such decisions were more decentralized. \"The move to centralize these decisions could lead to fewer impulsive probes and might be seen as an attempt to protect individuals from undue investigations,\" one source noted, speaking on condition of anonymity. However, critics argue that it restricts the autonomy of enforcement staff and could lead to delays in addressing potential violations.Leadership and Political InfluenceThe change comes as Republican Mark Uyeda leads the SEC, alongside Commissioner Hester Peirce and Democrat Caroline Crenshaw. The former chair, Gary Gensler, and Commissioner Jaime Lizárraga, both Democrats, exited the commission last month. Paul Atkins, a former SEC Commissioner nominated by President Trump to lead the agency, is pending confirmation. Atkins is anticipated to significantly shift the SEC's focus from the strategies employed during the Biden administration.Enforcement Practices and Industry ImpactSEC enforcement staff retain the ability to conduct informal inquiries, including sending out requests for information without requiring Commission approval. This setup maintains some level of investigative activity but centralizes more significant enforcement actions.During a recent industry conference panel, Steven Peikin, former SEC co-director of enforcement under Republican Jay Clayton, expressed his views on the changes. \"Centralizing formal order authority might reduce the wastage of resources but could also lead to a bottleneck in handling cases efficiently,\" he speculated.Presidential Influence and Future DirectionsPresident Trump’s executive order on his first day in office aimed to end the \"weaponization\" of the federal government, which includes agencies like the SEC. The full implications of this order are still unfolding, with ongoing debates about its impact on the SEC’s operational autonomy and its approach to capital market regulation.The new enforcement strategy under the current administration highlights a shift towards a regulatory environment that may be perceived as more business-friendly, potentially easing some of the rigorous oversight seen in previous years.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734130&language=en-US",
            "pub_date": "2025-02-05 14:54:57",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734129,
            "title": "DeepSeek's Impact on AI Supply Chain in 2025",
            "description": "According to Odaily, DeepSeek is not expected to significantly impact the demand for AI chips in 2025. DIGITIMES Research indicates that the global semiconductor industry revenue will continue the trend from 2024, with an anticipated annual growth of 13.4%, reaching a peak of $714 billion.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734129&language=en-US",
            "pub_date": "2025-02-05 14:55:14",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734124,
            "title": "BitMart will launch VVV/USDT perpetual contract, supporting 20x leverage",
            "description": "Odaily Planet Daily News: According to the official announcement, BitMart will launch the Venice Token (VVV) perpetual contract at 17:00 (UTC+8) on February 5, 2025, with a maximum leverage of 20 times. At that time, the VVV/USDT trading pair will be opened and trading will be started simultaneously.\nVenice Token is an artificial intelligence platform with privacy protection, decentralization and non-censorship as its core, and the underlying layer integrates open source large models including Deepseek.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734124&language=en-US",
            "pub_date": "2025-02-05 14:46:19",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734123,
            "title": "SEC requires staff to get top approval before launching investigations after leadership change",
            "description": "Odaily Planet Daily News: Two people familiar with the matter revealed that the US SEC now requires its lawyers to obtain high-level approval before officially launching an investigation. The new requirements stipulate that law enforcement officers must obtain permission from politically appointed commissioners to issue subpoenas, request documents and compel testimony. Previously, staff had the power to independently launch formal investigations, and SEC commissioners oversaw the entire process.\nThe change came after changes in SEC leadership, including the departure of former Chairman Gary Gensler and Democrat Jaime Lizárraga last month. President Trump appointed Mark Uyeda as acting chairman, and the commission currently consists of three commissioners: Uyeda, Hester Peirce, and Caroline Crenshaw.\nAccording to Tyler Warner, a former bank consultant and current NFT market analyst, the new system will prevent \"malicious attacks.\" SEC commissioners will act more cautiously and are less likely to approve investigations without solid evidence.\nOn the other hand, this procedural change may bring the risk of legitimate fraud cases being missed or delayed. “It’s too early to say whether it’s a net positive or negative, although I’m leaning toward positive,” Warner added.\nUnder the previous administration, the SEC needed approval from two enforcement chiefs to formally launch an investigation (the source did not specify whether the commission formally voted to revoke the previous authorization), while enforcement staff could continue informal investigations without commissioner approval, including sending requests for information. (Reuters)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734123&language=en-US",
            "pub_date": "2025-02-05 14:47:41",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734122,
            "title": "US Ethereum ETF daily trading volume hits record $1.5 billion during Trump tariff storm",
            "description": "Odaily Planet Daily News After President Trump announced the tariff policy last weekend, the cryptocurrency market plummeted. On Monday, the trading volume of nine Ethereum spot ETFs in the United States hit a record high.\nData shows that the trading volume of these Ethereum ETFs on February 3 was $1.5 billion, 23% higher than the record of $1.22 billion set on December 19 last year.\nAmong them, BlackRock ETHA had the highest trading volume, reaching $736 million, followed by Grayscale's converted ETHE fund, with a trading volume of $415 million, and Fidelity FETH with a trading volume of $155 million, reflecting their respective market shares by this indicator.\nJames Butterfill, head of research at CoinShares, said: \"Among all cryptocurrency exchanges, Ethereum's daily trading volume also reached $15 billion (a record high), but ETFs accounted for only 10% of it.\" (The Block)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734122&language=en-US",
            "pub_date": "2025-02-05 14:54:31",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}