{
    "data": [
        {
            "id": 1050316,
            "title": "Smucker Announces New Board Members Following Agreement with Elliott",
            "description": "Smucker has announced the addition of two new directors to its board, following an agreement with activist investor Elliott. Bloomberg posted on X, highlighting the strategic move aimed at enhancing governance and driving future growth. The company has been in discussions with Elliott, which has been advocating for changes to improve shareholder value. The new appointments are expected to bring fresh perspectives and expertise to Smucker's leadership team, aligning with the company's long-term objectives. This development marks a significant step in Smucker's ongoing efforts to strengthen its board and optimize its business strategies.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050316&language=en-US",
            "pub_date": "2026-02-26 20:26:58",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050315,
            "title": "United Parks and Resorts Reports Lower Earnings and Sales",
            "description": "United Parks and Resorts announced that its earnings and sales fell short of analyst expectations. Bloomberg posted on X, highlighting that the theme park operator faced challenges due to a decline in attendance, particularly from international visitors. The company is experiencing difficulties in attracting overseas tourists, which has impacted its financial performance. Despite efforts to boost attendance, the results indicate a need for strategic adjustments to address the downturn in international interest.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050315&language=en-US",
            "pub_date": "2026-02-26 20:27:44",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050314,
            "title": "WHO Chief Criticizes U.S. Funding Withdrawal from Covid Vaccine Research",
            "description": "The World Health Organization's Chief, Tedros Adhanom Ghebreyesus, has criticized the United States for withdrawing nearly $500 million in funding from research into the technology that developed Covid-19 vaccines. Bloomberg posted on X, highlighting Tedros's concerns about the impact of this decision on global health initiatives. The funding cut is seen as a setback in the ongoing efforts to combat the pandemic and advance vaccine technology. Tedros emphasized the importance of continued investment in research to ensure preparedness for future health crises.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050314&language=en-US",
            "pub_date": "2026-02-26 20:29:26",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050310,
            "title": "Analysis: Bitcoin retreated after testing $70,000; derivatives funds flowed in, but bearish sentiment remained.",
            "description": "Bitcoin retreated after a strong surge to $70,000 in the US session on Wednesday, trading around $68,600 in the Asian session on Thursday, failing to hold above the key psychological level. Since the end of February, BTC has maintained a range-bound trading structure, having dipped to $62,500 this month and reached $71,100 on February 15th. Market analysts point out that Bitcoin broke out of a similar trading range in January, but subsequently fell rapidly from $98,000 to $60,000, forming lower highs in this downward cycle, making some traders cautious about the sustainability of the current breakout. Derivatives data shows that the total open interest (OI) in the crypto futures market increased by over 6.6%, approaching $100 billion, a higher increase than the overall market capitalization growth, indicating new capital inflows. In the options market, Deribit data shows that the Bitcoin rebound boosted demand for call options with strike prices between $85,000 and $90,000. However, the overall options structure still leans towards put protection, with $60,000 put options currently the most popular position, boasting a notional open interest exceeding $1.4 billion, indicating that the market remains wary of downside risks. (Coindesk)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050310&language=en-US",
            "pub_date": "2026-02-26 20:30:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050292,
            "title": "XRP Price News: Is a 20% March Rally Taking Shape After Months of Losses?",
            "description": "XRP may be approaching a pivotal turning point after months of sustained downside pressure. Technical signals and improving onchain data suggest the token could be setting up for a 20% rebound in March, provided key resistance levels are cleared.XRP is currently down more than 50% since October 2025 and has posted five consecutive red monthly candles. March could mark the first meaningful attempt to break that bearish streak.Key TakeawaysXRP is forming a double-bottom pattern, targeting a potential 20% upside move.Whale selling pressure has eased sharply, while large-holder balances are rising.A breakout above $1.50 is critical to confirm the bullish scenario.Failure at resistance could reopen downside risk toward $1.00.Double-Bottom Pattern Signals Potential 20% XRP UpsideXRP has twice defended the $1.30–$1.35 support zone in February, forming what appears to be a classic double-bottom reversal pattern on the daily chart.A double bottom typically signals trend exhaustion after a prolonged decline. The pattern confirms when price breaks above the neckline, which for XRP sits near $1.50.If XRP achieves a decisive close above this level, the technical target projects toward $1.68–$1.70, representing a gain of roughly 20% from current prices.This level would also place XRP back into a mid-range zone last seen before the sharp leg lower earlier this year.Whale Behavior Turns Supportive as Distribution FadesOnchain data shows a notable shift in large-holder behavior, strengthening the bullish case.According to CryptoQuant data:XRP whale net flows (90-day moving average) have improved to around -3.3 million XRP, down from -33.5 million XRP in December.This sharp reduction in outflows suggests that distribution has largely cooled, even as price fell another ~25% over the same period.At the same time, Glassnode data shows that wallets holding at least 1,000 XRP have resumed accumulation, indicating that larger holders may be positioning near local lows.A similar slowdown in whale selling occurred in April 2025, which preceded a 50%+ XRP rally in the months that followed.A clean flip of whale flows back into positive territory would further reinforce the probability of a March breakout.Resistance Levels That Could Stall the RallyDespite improving signals, XRP still faces important technical hurdles.The $1.68–$1.70 target zone sits above the 50-day exponential moving average (EMA) — a level XRP has repeatedly failed to reclaim throughout February.A rejection at the 50-day EMA could invalidate the double-bottom setup and shift the structure into a bear pennant, with downside risk extending toward $1.00, or roughly 30% lower from current levels.Macro Risks Remain a Key VariableEven with constructive technical and onchain signals, macro conditions remain a wildcard.Potential headwinds include:A renewed risk-off rotation driven by AI-sector volatilityGeopolitical tensions, particularly involving the US and IranBroader liquidity tightening impacting high-beta altcoinsThese factors could cap upside or delay confirmation, even if XRP’s chart structure continues to improve.Bottom LineXRP is showing its strongest bullish setup in months, supported by a double-bottom pattern and easing whale distribution. A confirmed breakout above $1.50 would significantly increase the odds of a 20% rally toward $1.68–$1.70 in March.However, failure to reclaim key resistance — or renewed macro stress — could quickly invalidate the setup. For now, XRP sits at a technical inflection point where March may finally determine whether the downtrend breaks or extends, according to Cointelegraph.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050292&language=en-US",
            "pub_date": "2026-02-26 20:18:10",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050291,
            "title": "JinkoSolar Secures 124MW Solar Module Supply Deal with UK Energy Developer",
            "description": "JinkoSolar has recently signed a significant agreement with a renowned UK energy developer to supply 124MW of its high-efficiency Tiger Neo 3.0 solar modules. According to Jin10, this order will be utilized entirely for a large-scale ground-mounted power station project within the United Kingdom. This collaboration marks a notable step in expanding renewable energy infrastructure in the region.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050291&language=en-US",
            "pub_date": "2026-02-26 20:19:42",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050290,
            "title": "Starknet Introduces strkBTC for Enhanced Bitcoin Privacy",
            "description": "Starknet has announced the launch of a new asset, strkBTC, designed to offer optional privacy features for Bitcoin. According to PANews, strkBTC is issued on Starknet and can be exchanged bidirectionally with native Bitcoin, addressing financial privacy concerns arising from Bitcoin's transparent ledger.\n\nstrkBTC supports two modes: in 'non-shielded mode,' it operates as a standard ERC-20 token with publicly accessible balances and transfers; in 'shielded mode,' asset balances and transaction details are concealed. This privacy mechanism is based on a pragmatic design, keeping information confidential by default but allowing compliance audits through a Viewing Key, ensuring operation in regulated environments. With strkBTC, users can engage in DeFi collateralization or settlement without exposing positions and strategies. Starknet has indicated that strkBTC will be officially launched soon, with plans to gradually expand its privacy features in the future.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050290&language=en-US",
            "pub_date": "2026-02-26 20:19:45",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050289,
            "title": "Market Sentiment Turns Defensive Amid Geopolitical Tensions and Economic Uncertainty",
            "description": "The outlook for 2026 is marked by widespread caution among investors due to geopolitical tensions, unclear U.S. fiscal and monetary policies, and weakening globalization amid regionalization trends. According to NS3.AI, participants across various asset classes, including equities, bonds, commodities, and cryptocurrencies, are reducing leverage and lowering exposure to riskier investments. This shift is fostering a defensive market stance as investors brace for a more uncertain economic environment.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050289&language=en-US",
            "pub_date": "2026-02-26 20:19:46",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050288,
            "title": "Cryptocurrency exchange STS Digital has raised $30 million in funding, led by CMT Digital.",
            "description": "Cryptocurrency exchange STS Digital announced the completion of a $30 million funding round, led by CMT Digital, with participation from cryptocurrency exchange Kraken, venture capital firm Arrington Capital, and an investment arm of Fidelity Investments. STS Digital co-founder and CEO Maxime Seiler declined to disclose the company's valuation in this round. The new funds will be used to expand its cryptocurrency perpetual contracts (rather than options) business. (Fortune)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050288&language=en-US",
            "pub_date": "2026-02-26 20:13:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050287,
            "title": "American Bitcoin Financial Report: Bitcoin reserves surpass 6,000, 2025 revenue exceeds $180 million.",
            "description": "American Bitcoin, a Nasdaq-listed Bitcoin mining company backed by the Trump family, released its 2025 financial report, disclosing that its Bitcoin reserves exceeded 6,000. 2025 marked its first year as an independently listed company, and its operational and capital execution performance throughout the year aligned with its established strategy. The company adopted a dual-track model of \"scaled mining + ATM fundraising\" to accelerate the accumulation of its strategic reserves. In 2025, its revenue reached $185.2 million, with a deployed hashrate of approximately 25 EH/s and approximately 78,000 ASIC miners. (PRNewswire)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050287&language=en-US",
            "pub_date": "2026-02-26 20:15:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050272,
            "title": "Construction Costs in New York City Driven by Insurance and Other Factors",
            "description": "New York City is known for its high construction costs, with insurance being a significant factor contributing to these expenses. Bloomberg posted on X, highlighting insights from Elizabeth Crowley, president and CEO of BTEA, and Michael Capasso, president and CEO of CAC Industries. They discussed how insurance, among other elements, is influencing the rising costs and emphasized the need for reform in the industry. The conversation sheds light on the challenges faced by the construction sector in the city and the urgency for changes to address these financial pressures.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050272&language=en-US",
            "pub_date": "2026-02-26 20:09:26",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050271,
            "title": "STOCKS | Nvidia's Performance Leaves AI Trade Unaffected",
            "description": "Stocks remained stagnant as Nvidia's recent performance did not invigorate the AI trade. Bloomberg posted on X, highlighting the lack of movement in the market despite expectations surrounding Nvidia's influence. Analysts had anticipated that Nvidia's results might spark renewed interest in AI-related stocks, but the anticipated boost did not materialize. Investors are now closely monitoring other factors that could impact market dynamics. The broader market continues to navigate uncertainties, with attention on upcoming economic indicators and geopolitical developments that may influence stock movements.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050271&language=en-US",
            "pub_date": "2026-02-26 20:09:59",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050270,
            "title": "Record $50 Billion Put Trading on ETFs Amid AI Concerns",
            "description": "Macro Charts posted on X, highlighting that nearly $50 billion in notional put trading has occurred this month, surpassing past two decades' records. Themes include senior loans, consumer exposure, financials, and health care. This reflects a market eager to cover all eventualities, from present dangers to perceived threats and potential future risks.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050270&language=en-US",
            "pub_date": "2026-02-26 20:10:11",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050269,
            "title": "Bitcoin News Today: Bitcoin ETFs Attract $507M as BTC Reclaims $68K, Signaling Potential Trend Shift",
            "description": "US spot Bitcoin ETFs recorded $506.5 million in net inflows on Wednesday, marking the strongest single-day intake since early February as Bitcoin climbed back above $68,000.The renewed demand has pushed weekly ETF inflows to $560.4 million, putting funds on track for their first positive week after five consecutive weeks of net outflows totaling $3.8 billion, according to data from SoSoValue.The rebound follows a sharp February sell-off that erased roughly $20 billion in net ETF assets, suggesting institutional positioning may be stabilizing.BlackRock’s IBIT Leads Inflows as Trading Volumes SurgeThe largest inflows were seen in BlackRock’s iShares Bitcoin Trust (IBIT), which attracted $297.4 million in a single session, according to data from Farside.Other notable inflows included:Bitwise Bitcoin ETF (BITB): $39.4 millionFidelity Wise Origin Bitcoin Fund (FBTC): $30.1 millionETF trading activity also rebounded sharply, with total daily volumes surpassing $4.3 billion, the highest level since Feb. 9.The resurgence in flows coincided with Bitcoin reclaiming key technical levels above $68,000, reinforcing the perception of renewed institutional engagement.Market Structure Debate IntensifiesThe rebound in ETF inflows comes amid ongoing debate about Bitcoin price discovery and the role of authorized participants (APs) and major trading firms such as Jane Street.Speculation intensified following a lawsuit tied to the 2022 collapse of Terraform Labs’ TerraUSD stablecoin. Online discussions have questioned whether derivatives exposure and ETF-related mechanics could influence Bitcoin’s price structure.Bitwise adviser Jeff Park addressed the topic on social media, emphasizing that while no authorized participant explicitly suppresses Bitcoin’s price, ETF market structure can impact how price discovery unfolds.He noted that concerns about “paper Bitcoin” — trading exposure without acquiring underlying BTC — reflect broader questions about transparency rather than direct manipulation.ETF Recovery After Prolonged PressureDespite two strong inflow days, broader sentiment remains cautious. Bitcoin has faced persistent selling pressure since October 2025, and ETF assets under management remain well below recent peaks.However, the combination of:Consecutive daily inflowsRebounding ETF trading volumesBitcoin reclaiming $68,000A potential weekly net inflow after five negative weekssuggests that institutional demand may be returning incrementally.If inflows continue and BTC holds above key support levels, ETFs could play a pivotal role in stabilizing market structure following February’s volatility.For now, the ETF market appears to be regaining momentum — but sustained buying will be necessary to confirm a broader trend reversal.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050269&language=en-US",
            "pub_date": "2026-02-26 20:11:21",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050268,
            "title": "The head of Hong Kong cryptocurrency exchange AAX, suspected of embezzling over HK$600 million, was arrested and charged with three counts of theft and one count of fraud.",
            "description": "Hong Kong cryptocurrency exchange AAX ceased operations in mid-November 2022 citing system maintenance and updates, leaving over 300 customers unable to recover nearly HK$100 million in assets. Hong Kong law enforcement investigations revealed that the platform's shutdown was allegedly caused through false information and illegal means. The person in charge fled Hong Kong with cryptocurrency wallets and private keys, but was later arrested upon returning. Hong Kong police stated today that a thorough investigation revealed losses totaling approximately HK$81 million to 191 victims. The AAX person in charge withdrew approximately HK$633 million worth of cryptocurrency after the platform's closure and has been charged with three counts of theft and one count of fraud. (Hong Kong 01)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050268&language=en-US",
            "pub_date": "2026-02-26 20:02:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050241,
            "title": "Krispy Kreme Anticipates Reduced Leverage Amid Turnaround Efforts",
            "description": "Krispy Kreme is forecasting a further reduction in its leverage by the end of this year as it continues to implement its turnaround strategy. Bloomberg posted on X, highlighting the company's efforts to strengthen its financial position following the conclusion of its U.S. partnership with McDonald's. The doughnut chain is focusing on enhancing its operational efficiency and expanding its market presence to achieve its financial goals. This strategic shift comes as Krispy Kreme aims to optimize its business model and improve profitability in the competitive food industry.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050241&language=en-US",
            "pub_date": "2026-02-26 19:54:58",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050240,
            "title": "Bitcoin Spot ETFs Record $507M Net Inflows as All Funds Turn Positive",
            "description": "Bitcoin spot exchange-traded funds (ETFs) recorded $507 million in total net inflows on February 25 (U.S. Eastern Time), with none of the twelve listed ETFs posting net outflows, according to data from SoSoValue.Leading the inflows was BlackRock’s iShares Bitcoin Trust IBIT, which attracted $297 million in a single day. With the latest additions, IBIT’s historical cumulative net inflows have climbed to $61.563 billion, maintaining its position as the dominant vehicle for institutional Bitcoin exposure.The second-largest inflow was recorded by Grayscale’s Bitcoin Trust ETF GBTC, which saw $102 million in net inflows on the day. Despite the positive session, GBTC’s historical cumulative net outflows remain sizeable at $25.874 billion, reflecting the longer-term capital rotation away from the legacy product.As of the time of writing, the total net asset value (NAV) of Bitcoin spot ETFs stands at $87.604 billion. The ETF net asset ratio, measured as a percentage of Bitcoin’s total market capitalization, has reached 6.34%, while historical cumulative net inflows across all Bitcoin spot ETFs now total $54.573 billion.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050240&language=en-US",
            "pub_date": "2026-02-26 19:56:04",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050239,
            "title": "Bitcoin News: Indiana Bitcoin Rights Bill Advances to Governor After Bicameral Approval",
            "description": "Indiana lawmakers have advanced a wide-ranging digital asset bill that expands cryptocurrency investment access for public retirement plans while strengthening individual rights to use and hold crypto. The legislation now awaits final approval from Mike Braun, Indiana’s governor.House Bill 1042, formally titled “Regulation and Investment of Cryptocurrency,” received bicameral approval on Wednesday after the Indiana House concurred with amendments passed by the Senate. The bill was introduced by state Representative Kyle Pierce.Crypto Access for Public Retirement and Savings PlansHB 1042 requires several state-administered retirement and savings plans to offer participants a self-directed brokerage account that includes at least one cryptocurrency investment option.Plans covered under the bill include:The legislators’ defined contribution planThe Hoosier START college savings programDesignated plans under the Public Employees’ Retirement FundDesignated plans under the Teachers’ Retirement FundThe measure is designed to broaden investment choice while allowing participants to decide their own risk exposure, rather than mandating direct crypto allocation by the state.Legal Protections for Individual Crypto UseBeyond investment access, HB 1042 includes explicit protections for individual digital asset activity. The bill prevents most public agencies—excluding the Department of Financial Institutions—from enforcing rules that restrict the lawful use of cryptocurrencies.Under the bill:Individuals cannot be barred from accepting crypto as payment for legal goods and servicesResidents retain the right to hold digital assets in self-custodied or hardware walletsThe state is prohibited from imposing special or discriminatory taxes on crypto transactions that do not apply to other financial activitiesEffective Date and National ContextIf signed into law, HB 1042 will take effect on July 1, 2026.The legislation reflects a broader national shift toward integrating Bitcoin and digital assets into traditional financial frameworks while preserving user autonomy. At the federal level, Donald Trump signed an executive order in August allowing 401(k) retirement plans to include cryptocurrency investments, signaling growing acceptance of digital assets within regulated retirement systems.With final approval now resting on the governor’s desk, Indiana is positioned to become one of the more crypto-forward U.S. states in both retirement policy and individual digital asset rights, according to The Block.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050239&language=en-US",
            "pub_date": "2026-02-26 19:58:12",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050238,
            "title": "U.S. Commerce Secretary Faces Senate Inquiry Over Conflict of Interest Concerns",
            "description": "U.S. Commerce Secretary Gina Raimondo is under scrutiny as she faces questions from senators regarding potential conflicts of interest. According to Jin10, the inquiry focuses on her financial holdings and their possible influence on her policy decisions. The Senate's examination aims to ensure transparency and integrity within the Commerce Department. This development highlights ongoing concerns about the intersection of personal financial interests and public service roles in the U.S. government.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050238&language=en-US",
            "pub_date": "2026-02-26 20:00:24",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1050237,
            "title": "Analysis: BTC may challenge $80,000; a pullback to the 200-week moving average could become new resistance.",
            "description": "Market data shows that Bitcoin's price has risen above its 200-week exponential moving average (EMA) at $68,338. Rekt Capital analysis points out that Bitcoin is currently being suppressed by this trendline, and the latest rebound may evolve into a \"retest of the EMA after a break below, confirming new resistance.\" The market is focusing on the liquidity-intensive area above $72,000, anticipating a potential \"liquidity sweep.\" If the bulls successfully recover the key moving average and confirm it with a weekly close, $80,000 could become the next target price. AlphaBTC analysis states, \"The Bitcoin liquidity hunt has only just begun, and unless a catalyst for a decline emerges, the price highs are expected to be broken in the coming weeks.\" (Cointelegraph)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1050237&language=en-US",
            "pub_date": "2026-02-26 19:53:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}