{
    "data": [
        {
            "id": 1051521,
            "title": "Could Shiba Inu Make a Come Back This Year: Expert Shares Possible Targets",
            "description": "Analysis highlights possible targets, as Shiba Inu could be making a comeback this year after an extended period of price underperformance. After spending years sliding lower, Shiba Inu is showing early signs that its prolonged sideways trend may be easing. Visit Website\nsource: https://thecryptobasic.com/2026/02/27/could-shiba-inu-make-a-come-back-this-year-expert-shares-possible-targets/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051521&language=en-US",
            "pub_date": "2026-02-27 12:37:07",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051520,
            "title": "The ETF Store President: 50% drawdowns are not uncommon for Bitcoin; ETF investors are still buying the dip.",
            "description": "Nate Geraci, president of The ETF Store, stated that a 50% drawdown is not uncommon for long-term Bitcoin investors, and it may not be the last. He pointed out that despite the significant market decline, spot Bitcoin ETF investors have not shown obvious signs of panic, and fund flow data shows that their attitude remains stable. Geraci believes that recent fund movements indicate that some ETF investors prefer to buy on dips during pullbacks.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051520&language=en-US",
            "pub_date": "2026-02-27 12:38:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051519,
            "title": "SBI Holdings and Startale launched the Japanese yen stablecoin JPYSC, with plans to launch it in the second quarter.",
            "description": "Japanese financial group SBI Holdings and Startale Group announced the launch of JPYSC, a yen-denominated stablecoin, targeting institutional and cross-border payment scenarios. The stablecoin is issued and managed by SBI Shinsei Trust Bank, complies with Japan's digital asset regulatory framework, and SBI's trading platform, SBI VC Trade, will serve as the primary distribution channel, while Startale will handle technology development. Both parties stated that the trust bank support model will help improve governance and compliance, promote the application of the yen in the digital financial system, and provide a compliant alternative to the current market dominated by dollar-denominated stablecoins. The project is expected to launch in the second quarter of this year after obtaining regulatory approval. In recent years, Japan has continuously promoted the development of its stablecoin system. The 2022 revision of the Payment Services Law defined fiat-pegged stablecoins as \"electronic payment instruments\"; last October, Japan approved JPYC's issuance of the yen-denominated stablecoin. The three major banks, MUFG, SMBC, and Mizuho, ​​have also launched pilot programs for stablecoins and tokenized deposits. (The Block)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051519&language=en-US",
            "pub_date": "2026-02-27 12:41:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051514,
            "title": "$6B in Shorts Push Strategy to Most Shorted U.S. Mega-Cap Amid Bitcoin Dip",
            "description": "Strategy has become the most heavily shorted large-cap stock in the U. S. , reflecting growing doubts about its Bitcoin focus. The surge in bearish positioning follows a steep pullback in the Bitcoin price since its October 2025 record high, prompting investors to reassess the sustainability of the company’s aggressive Bitcoin accumulation strategy. Visit Website\nsource: https://thecryptobasic.com/2026/02/27/6b-in-shorts-push-strategy-to-most-shorted-u-s-mega-cap-amid-bitcoin-dip/",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051514&language=en-US",
            "pub_date": "2026-02-27 12:27:43",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051513,
            "title": "Crypto analyst says Bitcoin selling pressure is nearly exhausted",
            "description": "Bitcoin has been given some reprieve to trade sideways for a few weeks, but it won't likely emerge from the woods until the fourth quarter, says crypto analyst Willy Woo.\nsource: https://cointelegraph.com/news/bearish-bitcoin-selloff-by-investors-is-exhausted-analysts?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051513&language=en-US",
            "pub_date": "2026-02-27 12:28:54",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051518,
            "title": "Focus AI Acquires Major Stake in South Korea's Busan Digital Asset Exchange",
            "description": "Focus AI has completed the acquisition of a 40.61% stake in Busan Digital Asset Exchange (Bdan), making it the largest shareholder. According to NS3.AI, this strategic move strengthens Focus AI's position in digital asset infrastructure, encompassing real-world asset tokenization, security token offerings, and stablecoin payment services. Bdan is noted as South Korea's pioneering exchange dedicated to real-world asset tokenization, with ITcen Global also holding a significant stake.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051518&language=en-US",
            "pub_date": "2026-02-27 12:32:42",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051512,
            "title": "Russia's Recruitment Tactics in Africa Raise Concerns",
            "description": "Russia is reportedly misleading Africans to enlist them for its conflict in Ukraine, raising questions about its role as a genuine ally to the continent. Bloomberg posted on X, highlighting the deceptive strategies employed by Russia to recruit African individuals for its military efforts. This development has sparked concerns about the nature of Russia's relationship with African nations, suggesting a more opportunistic rather than supportive partnership. The situation underscores the complexities of international alliances and the potential implications for African countries involved.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051512&language=en-US",
            "pub_date": "2026-02-27 12:20:39",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051508,
            "title": "CZ's commentary on Block's layoffs: Either fully embrace AI or face being replaced.",
            "description": "CZ, commenting on social media about Block's planned large-scale layoffs and increased investment in its AI strategy, stated that companies that do not actively embrace artificial intelligence may ultimately face the risk of being replaced by technology. Previous reports indicated that Block would lay off approximately 40% of its workforce, and Jack Dorsey was pushing forward with an AI-first strategy.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051508&language=en-US",
            "pub_date": "2026-02-27 12:24:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051511,
            "title": "Cathie Wood Highlights Bitcoin's Role as Inflation and Deflation Hedge",
            "description": "Cathie Wood has emphasized that Bitcoin serves as a hedge against both inflation and deflation, outperforming gold in recent times. According to Bitalk News, Wood noted that while both Bitcoin and gold are tools for combating inflation and deflation, Bitcoin is digital. From the perspective of incremental demand, gold's demand is already established, whereas Bitcoin is relatively new, with minimal institutional involvement. Additionally, younger generations prefer holding Bitcoin over gold, contributing to its recent superior performance.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051511&language=en-US",
            "pub_date": "2026-02-27 12:30:16",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051507,
            "title": "Hong Kong Government Plans New Measures to Support SMEs and Expand Markets",
            "description": "The Secretary for Commerce and Economic Development, Edward Yau, announced at a press conference on budget-related measures that the government is committed to optimizing various initiatives to support small and medium enterprises (SMEs) in innovation, enhancing competitiveness, and seizing opportunities to explore new markets. According to RTHK, the government is preparing to inject HKD 200 million into the BUD Special Fund, with execution details expected to be launched in the second quarter of this year.\n\nYau stated that with the advancement of high-level two-way openness, mainland enterprises are more actively exploring overseas markets. Promotional activities will be held in Hong Kong and various provinces and cities in mainland China, and a cross-sector professional service platform will be established. This platform will include legal, accounting, financial, testing, certification, and marketing services from Hong Kong professionals to support mainland enterprises going abroad. The government also plans to organize overseas inspection tours to help mainland enterprises understand foreign markets.\n\nHe further mentioned that Hong Kong will strengthen its role as a key node in the Belt and Road Initiative, collaborating with the industry to deepen engagement in ASEAN and Middle Eastern markets, while exploring the potential of Central Asia, South Asia, and North Africa markets. The government has completed investment agreement negotiations with Qatar, Bangladesh, and Peru and is exploring new investment agreements with Saudi Arabia and Egypt.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051507&language=en-US",
            "pub_date": "2026-02-27 12:12:54",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051506,
            "title": "Dollar Faces Decline Amid Tariff News, China Stocks Expected to Outperform",
            "description": "The dollar is anticipated to be significantly impacted by the recent wave of tariff announcements, according to the latest Markets Pulse survey. Bloomberg posted on X that the survey results suggest a potential decline for the dollar, while Chinese stocks are expected to see gains. This development comes as market participants assess the implications of ongoing trade tensions and their effects on global financial markets. The survey highlights a shift in investor sentiment, with a growing preference for Chinese equities amid the current economic climate. The findings underscore the challenges facing the dollar as trade policies continue to evolve.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051506&language=en-US",
            "pub_date": "2026-02-27 12:15:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051505,
            "title": "Bitcoin(BTC) Surpasses 68,000 USDT with a Narrowed 0.82% Decrease in 24 Hours",
            "description": "On Feb 27, 2026, 04:16 AM(UTC). According to Binance Market Data, Bitcoin has crossed the 68,000 USDT benchmark and is now trading at 68,009.398438 USDT, with a narrowed narrowed 0.82% decrease in 24 hours.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051505&language=en-US",
            "pub_date": "2026-02-27 12:16:08",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051504,
            "title": "Dongchedi Considers Hong Kong IPO This Year",
            "description": "Dongchedi, also known as DCar, is reportedly planning an initial public offering (IPO) in Hong Kong, potentially as early as this year. Bloomberg posted on X, citing sources familiar with the matter, that the automotive information and trading platform is exploring this financial move. The company, which provides a range of services in the automotive sector, is evaluating the timing and details of the IPO. Further specifics about the offering, including the size and valuation, have not been disclosed. Dongchedi's decision to go public in Hong Kong aligns with a trend of companies seeking to tap into the region's capital markets. The move could provide the company with additional resources to expand its operations and enhance its market presence.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051504&language=en-US",
            "pub_date": "2026-02-27 12:17:01",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051498,
            "title": "Nvidia's Strategic Investment Shift: Intel and Nokia Stocks Surge",
            "description": "Nvidia has invested nearly $9 billion in Intel and Nokia, both of which have experienced significant stock price increases since early September 2025. According to NS3.AI, Intel's stock has surged approximately 92%, while Nokia's has risen about 79%. In contrast, Nvidia's investment in Synopsys has seen a decline. This move indicates Nvidia's strategic portfolio reshuffle, focusing on high-growth tech sectors, as the company reduces or exits stakes in several other firms.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051498&language=en-US",
            "pub_date": "2026-02-27 12:08:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051497,
            "title": "AI's Potential Role in Addressing U.S. Aging Workforce Challenges by 2040",
            "description": "Crypto KOL IncomeSharks posted on X. By 2040, the United States is projected to have approximately 80 million individuals aged 65 and older. This demographic shift indicates that tens of millions will be retiring and exiting the workforce. Previously considered a significant challenge, the advent of artificial intelligence now presents potential solutions to address this issue. AI technologies could play a crucial role in managing the impacts of an aging population, offering innovative ways to support the workforce and maintain economic stability.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051497&language=en-US",
            "pub_date": "2026-02-27 12:08:26",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051496,
            "title": "TeraWulf Reports Revenue Growth Amid Expanding Losses in 2025",
            "description": "TeraWulf, a Nasdaq-listed Bitcoin mining company, announced its financial results for 2025, revealing a revenue of $168.5 million, marking a 20.3% increase from the previous year. According to BlockBeats, the growth includes $16.9 million from its newly launched HPC leasing business. Despite the revenue increase, the company reported a net loss of $661.4 million for the year, with an adjusted EBITDA loss of $23.1 million.\n\nTeraWulf has labeled 2025 as a 'turning point year,' having secured long-term data center leases covering 522 megawatts of critical IT load. These contracts are expected to generate over $12.8 billion in customer revenue, supported by $6.5 billion in financing for its HPC platform development. In the fourth quarter, the company's digital asset revenue declined to $26.1 million due to decreased Bitcoin production and prices, while HPC leasing revenue rose to $9.7 million.\n\nThe company's strategy is increasingly focused on AI and cloud computing clients, with key operations centered in the Lake Mariner campus in New York and the Abernathy HPC campus in Texas. Earlier this month, TeraWulf acquired brownfield infrastructure in Kentucky and Maryland, adding approximately 1.5 GW of capacity.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051496&language=en-US",
            "pub_date": "2026-02-27 12:08:47",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051495,
            "title": "Nintendo to Reduce Strategic Shareholdings by ¥300 Billion",
            "description": "Nintendo is set to reduce its strategic shareholdings by approximately ¥300 billion, according to a report by Reuters. Bloomberg posted on X that the move involves shares owned by its partner banks. This decision is part of Nintendo's broader strategy to streamline its financial operations and focus on core business activities. The company has not publicly commented on the specifics of the shareholding reduction or the timeline for its implementation. The reduction in shareholdings is expected to impact Nintendo's financial relationships with its partner banks, although the exact implications remain unclear. This strategic move aligns with Nintendo's ongoing efforts to optimize its asset management and enhance shareholder value.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051495&language=en-US",
            "pub_date": "2026-02-27 12:09:21",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051491,
            "title": "The total amount of Gate.com's GT token staked has exceeded 4,000.",
            "description": "According to the latest data from the Gate platform, the total staked amount for its GT mining product has reached 4,000.05 GT. In addition to GT, the platform also offers staking options for multiple currencies. As of press time, the reference annualized yields are: GUSD 3.20%, BTC 5.49%, ETH 5.60%, SOL 11%, and USDT 3.44%. It is understood that GT staking requires a minimum of 1 GT to participate, supporting fast staking and redemption, making fund liquidity more flexible; it also unlocks diverse PoS staking strategies, distributes GT2 rewards daily, and provides strong protection for user assets through a 100% reserve mechanism.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051491&language=en-US",
            "pub_date": "2026-02-27 11:56:00",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051490,
            "title": "Solana Introduces Real-Time Payment Platform for Developers",
            "description": "Solana has unveiled Solana Payments, a new platform designed to support developers with real-time payment simulation and comprehensive documentation. According to NS3.AI, this initiative includes case studies to guide developers in creating on-chain payment solutions. The goal is to enhance the integration of real-time payment processing within the Solana blockchain ecosystem.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051490&language=en-US",
            "pub_date": "2026-02-27 11:54:34",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 1051489,
            "title": "South Korean Carbon Permit Prices Reach Highest Level Since April 2023",
            "description": "South Korean carbon permit prices have surged to their highest level since April 2023. Bloomberg posted on X that this increase is attributed to investors factoring in a tighter demand and supply balance due to recent policy changes. The adjustments in policy have led to expectations of a more constrained market, driving up the prices of carbon permits. This development reflects the ongoing adjustments in the carbon market as stakeholders respond to regulatory shifts.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=1051489&language=en-US",
            "pub_date": "2026-02-27 11:59:06",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}