{
    "data": [
        {
            "id": 734486,
            "title": "1,042 BTC transferred from Cumberland to Coinbase Institutional, worth more than $100 million",
            "description": "Odaily Planet Daily reported that according to Whale Alert monitoring, 1,042 BTC were transferred from Cumberland to Coinbase Institutional, worth US$102,625,111.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734486&language=en-US",
            "pub_date": "2025-02-05 21:30:49",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734487,
            "title": "Federal Reserve's March Rate Decision Probabilities Revealed",
            "description": "According to Odaily, the CME's \"FedWatch\" tool indicates an 83.5% probability that the Federal Reserve will maintain its current interest rates in March, unchanged from previous estimates. There is a 16.5% chance of a 25 basis point rate cut. Looking ahead to May, there is a 60.2% probability that rates will remain unchanged, a 35.2% chance of a cumulative 25 basis point cut, and a 4.6% probability of a cumulative 50 basis point cut.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734487&language=en-US",
            "pub_date": "2025-02-05 21:33:43",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734485,
            "title": "Alchemy Pay strategically invests in Korean electronic financial platform EZPG Co., Ltd.",
            "description": "Odaily Planet Daily News Cryptocurrency payment solution provider Alchemy Pay announced a strategic investment in South Korean electronic financial platform EZPG Co., Ltd. This investment enables Alchemy Pay to obtain EZPG Co., Ltd.'s registration qualification as an electronic financial business under the supervision of the Financial Supervisory Service (FSS), the comprehensive financial regulator of the South Korean government. It is reported that in the past year, Alchemy Pay has obtained remittance licenses in eight states in the United States, an authorized payment institution license in the United Kingdom, and registered as a digital currency exchange provider (DCEP) with AUSTRAC in Australia.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734485&language=en-US",
            "pub_date": "2025-02-05 21:35:03",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734479,
            "title": "Meme project PAIN: Pre-sale raised 185,976 SOL, 80% of the funds raised will be refunded",
            "description": "Odaily Planet Daily News Meme project PAIN officials posted on social media that the project raised 185,976 SOL in 48 hours during the pre-sale, but the launch of the Meme does not require so much money. At the launch, PAIN will return 80% of the funds raised and use the remaining 20% ​​to support the release, provide liquidity, and pay for listing fees (if any). It is reported that funds sent after block 318346069 will also be returned.\nOdaily reminds users that the price of Meme coins fluctuates greatly, so investors are advised to participate with caution.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734479&language=en-US",
            "pub_date": "2025-02-05 21:22:23",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734480,
            "title": "Ethereum Foundation Transfers Significant Funds To Multisig Contract",
            "description": "According to Foresight News, Arkham has detected a transaction from the Ethereum Foundation's Grant Provider address, which transferred approximately 220.452 ETH, valued at around $618,000, to a 4/8 multisignature contract starting with the address 0xeF. This funding is likely intended for donation to BuidlGuidl.\n\nBuidlGuidl is an organization focused on creating products, prototypes, and tutorials for Ethereum developers.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734480&language=en-US",
            "pub_date": "2025-02-05 21:23:33",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734478,
            "title": "The Ethereum Foundation transferred about 220 ETH to a multi-signature contract, which may be used to donate to BuidlGuidl",
            "description": "Odaily Planet Daily News According to Arkham monitoring, the Grant Provider address of the Ethereum Foundation transferred about 220.452 ETH (worth about $618,000) to a 4/8 multi-signature contract (address starting with 0xeF) 1 hour ago. This fund may be used to donate to BuidlGuidl. BuidlGuidl is an organization dedicated to creating products, prototypes and tutorials for Ethereum developers.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734478&language=en-US",
            "pub_date": "2025-02-05 21:25:10",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734477,
            "title": "The probability of the Fed keeping interest rates unchanged in March remains unchanged after the ADP release",
            "description": "Odaily Planet Daily News According to CME's \"Fed Watch\", the probability of the Fed keeping interest rates unchanged in March is 83.5% (83.5% before the announcement), and the probability of a 25 basis point rate cut is 16.5%. The probability of maintaining the current interest rate unchanged by May is 60.2%, the probability of a cumulative 25 basis point rate cut is 35.2%, and the probability of a cumulative 50 basis point rate cut is 4.6%. (Jinshi)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734477&language=en-US",
            "pub_date": "2025-02-05 21:25:15",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734467,
            "title": "Michael Saylor Hints At Bitcoin Strategy Update",
            "description": "According to Foresight News, MicroStrategy founder Michael Saylor has tweeted about a \"₿ig Strategy Day,\" which may suggest an update related to the company's Bitcoin strategy.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734467&language=en-US",
            "pub_date": "2025-02-05 21:13:51",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734466,
            "title": "Google Alters AI Principles Amid Military Use Concerns",
            "description": "According to PANews, Google has reportedly joined other leading U.S. artificial intelligence companies like OpenAI and Meta in allowing their AI models to be used for military purposes. Local media discovered on Tuesday that Google has removed a commitment from its AI principles that previously pledged to avoid using AI technology for weapons or other potentially harmful applications. In response, Google's Senior Vice President James Manyika and DeepMind's head Demis Hassabis defended this move in a blog post. They argued that collaboration between companies and governments is necessary to support national security through AI advancements.",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734466&language=en-US",
            "pub_date": "2025-02-05 21:13:58",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        },
        {
            "id": 734461,
            "title": "U.S. ADP employment in January was 183,000, expected to be 150,000, and the previous value was 122,000",
            "description": "Odaily Planet Daily News: The number of ADP employment in the United States in January was 183,000, the expected number was 150,000, and the previous value was 122,000. (Jinshi)",
            "link": "https://www.coinlive.com/mobile/hot-news/detail/?id=734461&language=en-US",
            "pub_date": "2025-02-05 21:15:18",
            "source": "coinlive",
            "kind": 2,
            "language": "en"
        }
    ]
}