{
    "data": [
        {
            "title": "ADB President on Tariff Uncertainty, BOJ Policy",
            "description": "<div class=\"txt-s4 article-text\"><div id=\"Zonebourse_Article_Video\"><div class=\"vsly-player\" data-template=\"PVaRF_MsC2XGj\" id=\"yz2qQP7m4-W\" style=\"background:#ddd;padding-top:calc(56.25% + 24px);font-size:0;position:relative;overflow:hidden;width:100%;\"></div></div>\n                        Masato Kanda, President of the Asian Development Bank and former Japanese Vice Minister of Finance for International Affairs, says trade uncertainties and geopolitical tensions are dampening investment in Asia. He also discusses Japan's fiscal and monetary policy with Bloomberg's Shery Ahn on The China Show.<p><span class=\"js-l-obf link link--blue\" data-lobf=\"v4fox4ar=NTQyQxJmBMKwpP7nl8C=BbKwgTpvkfAwLuu\" data-tobf=\"blank\" onclick=\"gaEvent('Out', 'mtnewswires', '52549356');\">Bloomberg videos</span>, provided by MT Newswires</p></div>",
            "link": "https://hk.marketscreener.com/news/adb-president-on-tariff-uncertainty-boj-policy-ce7e5cded08af222",
            "pub_date": "2026-02-27 18:16:07",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "BASF CEO: We continue to analyse whether US subsidiary has legal entitlement to tariff repayment that it can sue for",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/basf-ceo-we-continue-to-analyse-whether-us-subsidiary-has-legal-entitlement-to-tariff-repayment-tha-ce7e5cded08af227",
            "pub_date": "2026-02-27 18:16:10",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "China's gaming regulator",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/china-s-gaming-regulator-ce7e5cded08af226",
            "pub_date": "2026-02-27 18:16:11",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "China's gaming regulator grants license for 6 imported online games in Feb",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/china-s-gaming-regulator-grants-license-for-6-imported-online-games-in-feb-ce7e5cded08af32c",
            "pub_date": "2026-02-27 18:16:12",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "China's gaming regulator grants license for 146 domestic online games in Feb",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/china-s-gaming-regulator-grants-license-for-146-domestic-online-games-in-feb-ce7e5cded08af322",
            "pub_date": "2026-02-27 18:16:12",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "BASF CEO: If our US subsidiary is entitled to tariff reimbursement after Supreme Court verdict it will make legal claim",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/basf-ceo-if-our-us-subsidiary-is-entitled-to-tariff-reimbursement-after-supreme-court-verdict-it-wi-ce7e5cded08af321",
            "pub_date": "2026-02-27 18:16:13",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Netflix, Paramount shares jump as months-long fight for Warner Bros ends",
            "description": "<div class=\"txt-s4 article-text\"><p>Feb 27 (Reuters) - Netflix jumped more than 9% premarket on Friday as investors cheered its decision to exit the fight for Warner Bros Discovery, while Paramount rose about 10% on winning the race for some of the world's most prized TV and film assets.</p><p>\n              The end of the months-long bidding war put the focus back on the significant antitrust scrutiny that the Paramount-Warner Bros tie-up would face in the U.S. and Europe, including an active investigation in California. Warner Bros shares were marginally lower.</p><!-- Article --><p>\n              Paramount Skydance maintained its dogged pursuit of Warner Bros, launching a hostile campaign to wrest the prize from Netflix. It managed to lure Warner Bros back to the bargaining table last week, with a revised $31-a-share bid that topped Netflix's $27.75 offer for the studio and streaming assets. </p><p>\n              Netflix said the price required to stay in the contest had climbed beyond what it considered financially sound, confirming to Reuters that it would withdraw from the takeover battle. \"We've always been disciplined... the deal is no longer financially attractive,\" the company said.</p><p>\n              \"The bid always looked like a mix of offence and defence - shoring up content and scale, while keeping competition from gaining any edge, but at a very high price,\" said Matt Britzman, senior equity analyst, Hargreaves Lansdown.</p><p>\n              \"For now, at least, the market seems to be pricing this as a win for everyone.\"     </p><p>\n              In the fight for Warner Bros, the Paramount consortium backed by billionaire Larry Ellison and led by his son, Paramount CEO David Ellison, also boosted its termination fee to $7 billion and expanded its financing commitments, including $45.7 billion in equity.</p><p>\n              \"In the U.S., we believe Paramount has a good enough relationship with the presidential administration to ease concerns, and the Department of Justice has set a precedent in overlooking the merger of major studios when Disney bought Fox,\" analysts at Morningstar said.</p><p></p><p> (Reporting by Rashika Singh and Kanchana Chakravarty in Bengaluru; editing by Arpan Varghese and Devika Syamnath)</p></div>",
            "link": "https://hk.marketscreener.com/news/netflix-paramount-shares-jump-as-months-long-fight-for-warner-bros-ends-ce7e5cded08af522",
            "pub_date": "2026-02-27 18:16:13",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Beijing HyperStrong Technology prelim 2025 net profit up 46.5%",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/beijing-hyperstrong-technology-prelim-2025-net-profit-up-46-5-ce7e5cded08af724",
            "pub_date": "2026-02-27 18:16:14",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Calb Group expects net profit between RMB2,025 million to RMB2,193 million for FY",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/calb-group-expects-net-profit-between-rmb2-025-million-to-rmb2-193-million-for-fy-ce7e5cded08bfe23",
            "pub_date": "2026-02-27 18:16:15",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Loongson Technology prelim 2025 net loss 453.7 million yuan",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/loongson-technology-prelim-2025-net-loss-453-7-million-yuan-ce7e5cded08bf023",
            "pub_date": "2026-02-27 18:16:15",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Bradesco to consolidate in Odontoprev all its stakes in healthcare firms",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/bradesco-to-consolidate-in-odontoprev-all-its-stakes-in-healthcare-firms-ce7e5cded08bf022",
            "pub_date": "2026-02-27 18:16:16",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "European Midday Briefing : Shares Rise, On Track to End Week on Positive Note -2-",
            "description": "<div class=\"txt-s4 article-text\"><p>\n     Pirro, a longtime ally of President Trump, opened the probe to examine whether Powell gave false testimony to Congress last summer about the central bank's building-renovation project. The move prompted an unprecedented public response from Powell, who in a Jan. 11 video statement said the investigation was a pretext for Trump's continuing campaign to pressure the Fed to lower interest rates and end the independence of the central bank. </p><p>\n\n     Write to pierre.bertrand@wsj.com </p><!-- Article --><p>\n\n     Write to us at newsletters@dowjones.com </p><p>\n\n     We offer an enhanced version of this briefing that is optimized for viewing on mobile devices and sent directly to your email inbox. If you would like to sign up, please go to <span class=\"js-l-obf link link--blue\" data-lobf=\"v4fox4ar=NTJnlyOx2MPxNRQxpDJmpTI=QbPmCb9xBALy2AKwCau\" data-tobf=\"blank\" onclick=\"gaEvent('Out', 'dow_jones', '52549224');\">https://newsplus.wsj.com/subscriptions</span>. </p><p>\n\n     This article is a text version of a Wall Street Journal newsletter published earlier today. </p><br/><p>\n  (END) Dow Jones Newswires</p><p>\n\n  02-27-26 0504ET</p></div>",
            "link": "https://hk.marketscreener.com/news/european-midday-briefing-shares-rise-on-track-to-end-week-on-positive-note-2-ce7e5cded08bf520",
            "pub_date": "2026-02-27 18:10:47",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Yealink Xiamen Network Technology prelim 2025 net profit down 1.8%",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/yealink-xiamen-network-technology-prelim-2025-net-profit-down-1-8-ce7e5cded08bf620",
            "pub_date": "2026-02-27 18:10:48",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Advanced Micro-Fabrication Equipment Inc. China Reports Earnings Results for the Full Year Ended December 31, 2025",
            "description": "<div class=\"txt-s4 article-text\"><p>Advanced Micro-Fabrication Equipment Inc. China reported earnings results for the full year ended December 31, 2025. For the full year, the company reported sales was CNY 12,384.64 million compared to CNY 9,065.17 million a year ago. Net income was CNY 2,111.47 million compared to CNY 1,615.68 million a year ago.</p><p>Basic earnings per share from continuing operations was CNY 3.4 compared to CNY 2.61 a year ago.</p></div>",
            "link": "https://hk.marketscreener.com/news/advanced-micro-fabrication-equipment-inc-china-reports-earnings-results-for-the-full-year-ended-dec-ce7e5cded08bf626",
            "pub_date": "2026-02-27 18:10:49",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Jardine Cycle & Carriage's Attributable Profit Soars 36% in H2 2025",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/jardine-cycle-carriage-s-attributable-profit-soars-36-in-h2-2025-ce7e5cded08bf725",
            "pub_date": "2026-02-27 18:10:49",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "China State Construction Engineering acquires projects",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/china-state-construction-engineering-acquires-projects-ce7e5cded088fe2d",
            "pub_date": "2026-02-27 18:10:50",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Indian rupee down 0.07% at 90.9725 per U.S. dollar as of 3:30 p.m. IST; previous close 90.9050",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/indian-rupee-down-0-07-at-90-9725-per-u-s-dollar-as-of-3-30-p-m-ist-previous-close-90-9050-ce7e5cded088ff22",
            "pub_date": "2026-02-27 18:10:51",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Sino Land's Half-Year Profit Slides",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/sino-land-s-half-year-profit-slides-ce7e5cded088f121",
            "pub_date": "2026-02-27 18:10:52",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "U.S. Futures Fall as Risk-Off Mood Continues",
            "description": "<div class=\"txt-s4 article-text\"><p>\n  By Dow Jones Newswires Staff </p><br/><p>\n  U.S. futures fell in early European trade as investors continued to pull back from risk at the end of a volatile month. </p><!-- Article --><p>\n\n  Traders reacted negatively to Nvidia's earnings Thursday as hand-wringing over the delicate artificial-intelligence ecosystem troubled tech investors. The tech-driven surge in South Korea's Kospi was checked Thursday after the index had gained for six consecutive sessions. Meanwhile, concerns around private credit quality and renewed trade uncertainty weighed on market confidence more broadly. </p><p>\n\n  Safe haven assets saw a boost. U.S. 10-year Treasury yields slipped below 4% to a three-month low, while gold is on track for a 4% weekly gain. </p><p>\n\n  Oil rose, holding above $71 a barrel as investors remained cautious around potential risks to supply in the Middle East, even after positive signals from U.S-Iran talks Thursday. Talks between the two countries will continue next week. </p><br/><p>\n  --Equity futures in the U.S. pointed to another day of selling Friday. Futures for the S&amp;P 500 were down 0.2%, while the Dow Jones Industrial Average--which closed flat Thursday--fell 0.4%. Futures for the tech-heavy Nasdaq nudged down 0.1%, with shares in cloud computing company CoreWeave falling 9.4% premarket after it announced earnings. </p><p>\n\n  Nvidia gained 0.8% premarket after falling 5.5% Thursday. 'Big Short' investor Michael Burry flagged concerns over a rise in Nvidia's purchase obligations, which he said could tie the chip maker to paying for unused capacity. \"A year ago, the same commitment would have been considered bullish,\" Swissquote's Ipek Ozkardeskaya said. \"Today, the interpretation has flipped on fears that AI capex could slow and leave Nvidia with excess capacity. This looks like peak-cycle behavior.\" </p><br/><p>\n   --Asian markets were mixed on the last day of February trading. South Korea's Kospi finished 1.0% lower, snapping a six-session winning streak, though the index rose 20% for the month. Japan's Nikkei Stock Average closed 0.2% higher. Economic data earlier in the day firmed up rate-hike hopes, despite some reservations over recent days about political pressure deterring Bank of Japan normalization. That gave a little lift to the yen, combining with haven buying and continued trade uncertainty. </p><p>\n\n  The Shanghai Composite in China ended 0.4% higher, though the tech-heavy ChiNext index ended down 1.0%. The yuan softened after the People's Bank of China cut shorting costs for the currency. Markets are looking to China's Two Sessions next week for more clues into Beijing's policy path in the year head. Hong Kong's Hang Seng Index closed up 0.95%, led by real estate stocks such as Sun Hung Kai Properties and Hang Lung Properties. India's Sensex fell 0.8% ahead of GDP data. </p><br/><p>\n  --European indexes were largely higher at the open as basic-materials stocks across the continent gained. The U.K.'s FTSE 100 rose 0.35% as miners climbed, with gold and silver miner Fresnillo up 5.6%. Barclays slipped 1% after the collapse of a mortgage-finance company for which the bank arranged loans. Blue-chip indexes in Germany and France both struggled for direction, trading flat. Chemicals company BASF slipped 3.2%, though energy stocks gain in Frankfurt, while in Paris gains for energy group Schneider Electric--up 1.3%--countered a slip in utilities. The Italian FTSE MIB edged up 0.2% as electricity infrastructure company Prysmian climbed 4%, though Banca MPS slipped 2.2% after earnings. Spain's IBEX 35 was up 0.1% as construction group Acciona surged 7.4%. </p><br/><p>\n  --The dollar fell against a basket of currencies as tensions between the U.S. and Iran and tariff uncertainty leave investors cautious. Falls are limited as a drop in U.S. tech stocks stoked risk aversion. Still, investors remained wary of buying the dollar amid concerns about tariff policies, central bank independence and geopolitical interventions, including in Iran. Demand from international investors to hedge their U.S. assets against the risk of a dollar decline still \"plays a significant role,\" said BNY's Bob Savage in a note. U.S. producer price data for January will be watched at 1330 GMT. The DXY dollar index fell 0.2% to 97.63, although it remained within its recent tight trading range. </p><p>\n\n  Sterling fell to a 10-week low against the euro after the U.K.'s ruling Labour Party lost a one-off special district election, raising fresh concerns about a leadership challenge for Prime Minister Keir Starmer. The euro rose to 0.8764 pounds, LSEG data show. Sterling falls 0.1% to $1.3461. </p><br/><p>\n  --The 10-year U.S. Treasury yield slipped to a three-month low just below 4% in Asian trade as investors remained attentive to geopolitical developments. \"The latest round of U.S.-Iran talks in Geneva acted as a catalyst to trim down risk across the board,\" said Pepperstone's Michael Brown in a note. However, a sustainable fall below the 4% handle isn't in sight, at least for now. \"We do remain, just about, within the longer-run range here,\" the senior research strategist said. Should the 10-year yield trade under 4.00% on a closing basis, that would give U.S. Treasury bulls some degree of control in the near term, he said. The 10-year Treasury yield was last trading at 3.997%, down 1.9 basis points, according to Tradeweb. </p><p>\n\n  Yields on U.K. government bonds, or gilts, edged higher after the special election in Gorton and Denton revived political unease within the ruling Labour Party. Ten-year gilt yields were marginally higher at 4.282% after rising to 4.290% as the market opened. </p><br/><p>\n  --Bitcoin rose marginally but continued to struggle for a meaningful recovery after U.S. stocks closed mostly lower overnight. The cryptocurrency edged up 0.2% to $67,622, LSEG data showed. </p><br/><p>\n  --Oil prices rose as investors digested news that the U.S. and Iran will resume discussions next week after the latest round of talks wrapped up on Thursday without a deal. Brent crude rose 0.9% to $71.45 a barrel, while WTI was up 0.7% to $65.32 a barrel. Discussions \"on a technical level\" will take place next week in Vienna, Oman's Foreign Minister Badr bin Hamad al-Busaidi said in a post on X. However, markets remained on edge as any potential escalation of tensions could disrupt energy flows. Traders were also awaiting OPEC+'s meeting on Sunday for signals on future production policy. </p><br/><p>\n  --Gold prices were broadly steady in early trading, but are headed for a weekly gain of nearly 4% on news that the U.S. and Iran will continue discussions next week. Futures in New York were flat at $5,193.60 a troy ounce. \"Gold's role as a hedge against geopolitical and policy shocks is once again in focus,\" said Ewa Manthey from ING. At record prices, buyers are becoming more price sensitive, so short-term pullbacks or consolidation are to be expected. However, the main drivers of the rally--central bank diversification, geopolitical tensions, possible policy easing, and renewed ETF demand--remain strong, according to market watchers. </p><br/><p>\n  Write to Barcelona Editors at barcelonaeditors@dowjones.com </p><br/><p>\n  (END) Dow Jones Newswires</p><p>\n\n  02-27-26 0500ET</p></div>",
            "link": "https://hk.marketscreener.com/news/u-s-futures-fall-as-risk-off-mood-continues-ce7e5cded088f22d",
            "pub_date": "2026-02-27 18:10:52",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Smart-Core expects profit attributable of HK$140 million to HK$170 million for FY",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/smart-core-expects-profit-attributable-of-hk-140-million-to-hk-170-million-for-fy-ce7e5cded088f32d",
            "pub_date": "2026-02-27 18:10:53",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "StanChart Buys Back Shares",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/stanchart-buys-back-shares-ce7e5cded088f422",
            "pub_date": "2026-02-27 18:10:54",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "China suspends some agricultural tariffs on Canada after Carney visit",
            "description": "<div class=\"txt-s4 article-text\"><p>BEIJING, Feb 27 (Reuters) - China said on Friday it would suspend some tariffs on Canadian agricultural products imposed during a trade spat between Beijing and Ottawa, after Canadian Prime Minister Mark Carney struck an initial deal with Beijing during a visit in January.</p><p>\n              China will suspend 100% tariffs on Canadian canola meal and pea imports and will halt 25% tariffs on lobster and crab imports from March 1 through the end of 2026, the finance ministry said in a statement.</p><!-- Article --><p>\n              The outcome broadly aligns with Carney's expectations. But the Chinese announcement made no mention of canola seed tariffs, which Carney had previously said would be lowered by March 1.</p><p>\n              Ottawa expected Beijing to lower canola seed tariffs to a combined rate of about 15% from the current 84%. A probe into Canadian canola is set to conclude on March 9, the Chinese commerce ministry has said.</p><p>\n              \"One thing we do know is that Chinese buyers have been booking Canadian canola cargoes for March already. That gives me a pretty high degree of confidence that they're going to follow through on the reduced tariff rate,\" said Even Rogers Pay, director at Beijing-based consultancy Trivium China. </p><p>\n              Canola oil and pork were also not mentioned in the statement. But Beijing could still announce further adjustments by the March 1 deadline previewed by Carney.</p><p>\n              China was Canada's second largest market for canola in 2024.</p><p>\n              The suspensions come amid a wave of visits to Beijing by Western leaders as U.S. President Donald Trump's trade policies have strained Washington's traditional alliances. China has sought to present itself as a more stable and reliable economic partner in contrast.</p><p>\n              Carney went further than his European counterparts by securing a deal with China and signalling Canada's ambition to play a leading role in a new global trade order aimed at reducing dependence on the United States.</p><p>\n              During his China trip, Carney pledged to allow into Canada up to 49,000 Chinese electric vehicles at a tariff of 6.1% on most-favoured-nation terms.</p><p>\n               (Reporting by Ella Cao, Xiuhao Chen, Daphne Zhang and Lewis Jackson; Editing by Muralikumar Anantharaman and Gareth Jones)</p></div>",
            "link": "https://hk.marketscreener.com/news/china-suspends-some-agricultural-tariffs-on-canada-after-carney-visit-ce7e5cded088f421",
            "pub_date": "2026-02-27 18:10:55",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Raytron Technology prelim 2025 net profit up 93.4%",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/raytron-technology-prelim-2025-net-profit-up-93-4-ce7e5cded089ff21",
            "pub_date": "2026-02-27 17:55:57",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Union Semiconductor Hefei is seeking Hong Kong listing",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/union-semiconductor-hefei-is-seeking-hong-kong-listing-ce7e5cded089ff25",
            "pub_date": "2026-02-27 17:55:58",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Piotech prelim 2025 net profit up about 35.1%",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/piotech-prelim-2025-net-profit-up-about-35-1-ce7e5cded089f027",
            "pub_date": "2026-02-27 17:55:59",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Cowellnex Co., Ltd., Kyowa Kirin Co., Ltd and and Metagen, Inc. Announce to Begin Joint Research",
            "description": "<div class=\"txt-s4 article-text\">\n        \n                    Cowellnex Co., Ltd., Kyowa Kirin Co., Ltd. and and Metagen, Inc. announced to begin joint research in February 2026 to develop new test items based on gut microbiota data from Japanese individuals, as well as an algorithm (mechanism) that proposes foods suited to each person based on these test items. This research will leverage Cowellnex?s independently acquired, high-precision gut microbiota data obtained through shotgun metagenomic analysis*1?one of Japan?s most detailed gut microbiota tests?accumulated over approximately three years through its ?MicroBio Me?*2 service. The companies aim to commercialize and introduce the resulting new testing services to the market in the future. Gut microbiota has been gaining attention in recent years from a health maintenance perspective. However, because the composition (types and ratios) of gut bacteria varies greatly among individuals, dietary approaches also differ. As a result, indicators that show the desired state of gut microbiota for each person and concrete action guidelines are not yet sufficiently developed. The commonly used 16S rRNA gene analysis*3 helps grasp broad bacterial classifications but provides limited information compared with shotgun metagenomic analysis. Furthermore, methods academically established for test items or food recommendations based on gut microbiota data specifically for Japanese individuals currently do not exist. Against this backdrop, expectations are increasing for more accurate gut microbiota testing and for testing items and personalized food recommendations based on such data. In the MicroBio Me business operated by Cowellnex, the company has accumulated highly precise data over approximately three years using shotgun metagenomic analysis, one of the most detailed gut microbiota tests available in Japan. Leveraging these data, Cowellnex will create new test parameters that take into account the characteristics of the gut environment of Japanese people, and will develop an algorithm (mechanism) that proposes foods based on those parameters. In this joint research, Cowellnex will be responsible for providing data, formulating hypotheses for test parameters and food recommendations, and conducting acceptability verification. Metagen will be responsible for conducting metabolic pathway analysis based on its expertise in gut environment research and bioinformatics, as well as for developing the algorithm (mechanism) for food recommendations. Through this joint research, it will become possible not only to identify which gut bacteria are present but also to predict the overall capability of the gut environment?including interactions among gut bacteria?to produce beneficial metabolites. A series of consecutive chemical reactions along metabolic pathways carried out by gut bacteria. Through these processes, dietary fiber is broken down and various metabolites are produced.<br/>\nCowellnex plans to commercialize the results of this joint research as new testing services and launch them in the market. Even after the research concludes, Cowellnex will continue accumulating data and studying ways to utilize them, contributing to improving testing accuracy and developing ingredients that help regulate gut microbiota. By leveraging its strength in high-precision data obtained through shotgun metagenomic analysis, Cowellnex will accelerate innovation in the gut microbiota domain and create a market for personalized gut health solutions based on gut microbiota composition.\n    \n    </div>",
            "link": "https://hk.marketscreener.com/news/cowellnex-co-ltd-kyowa-kirin-co-ltd-and-and-metagen-inc-announce-to-begin-joint-research-ce7e5cded089f223",
            "pub_date": "2026-02-27 17:55:59",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Shanghai Bochu Electronic Technology prelim 2025 net profit up 25.6%",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/shanghai-bochu-electronic-technology-prelim-2025-net-profit-up-25-6-ce7e5cded089f222",
            "pub_date": "2026-02-27 17:56:00",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Kioxia Holdings Corporation Appoints Yoshihiko Kawamura as Chief Financial Officer, Effective April 1, 2026",
            "description": "<div class=\"txt-s4 article-text\"><p>Kioxia Holdings Corporation announced the appointment of Yoshihiko Kawamura as Chief Financial Officer, effective April 1, 2026. Mr. Kawamura brings extensive international experience to Kioxia, having held assignments at Mitsubishi Corporation?s U.S. headquarters, served as General Manager of its Chicago office, and completed a tenure at the World Bank. At Hitachi Ltd., he held senior leadership positions, including Chief Strategy Officer, Chief Financial Officer, and Chief Risk Management Officer, where he was instrumental in leading the company?s management reforms. Since joining Kioxia as Executive Vice President in June 2025, Mr. Kawamura has worked closely with the executive team to advance the business through strategic capital and financial planning.</p></div>",
            "link": "https://hk.marketscreener.com/news/kioxia-holdings-corporation-appoints-yoshihiko-kawamura-as-chief-financial-officer-effective-april-ce7e5cded089f225",
            "pub_date": "2026-02-27 17:56:01",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US allows some embassy staff to leave Israel, citing safety risks",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/us-allows-some-embassy-staff-to-leave-israel-citing-safety-risks-ce7e5cded089f725",
            "pub_date": "2026-02-27 17:50:50",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "SAP Faces Criticism Over Global Bonus System, Sets Aside Funds for Review",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/sap-faces-criticism-over-global-bonus-system-sets-aside-funds-for-review-ce7e5cded089f724",
            "pub_date": "2026-02-27 17:50:50",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Warner Bros. Says Paramount's $111 Billion Deal Tops Netflix",
            "description": "<div class=\"txt-s4 article-text\"><div id=\"Zonebourse_Article_Video\"><div class=\"vsly-player\" data-template=\"PVaRF_MsC2XGj\" id=\"7npQdi9fRG1\" style=\"background:#ddd;padding-top:calc(56.25% + 24px);font-size:0;position:relative;overflow:hidden;width:100%;\"></div></div>\n                        Warner Bros. Discovery (WBD) said a new $111 billion offer from Paramount Skydance (PSKY) is a better deal for shareholders than the one it agreed to earlier with Netflix (NFLX). Netflix will now have four business days to come up with a new proposal that beats Paramount or it will lose the fight for one of the industry's oldest film and TV studios. Paramount has offered $31 a share for all of Warner Bros. while Netflix has bid $27.75 a share for the company's studios and HBO business. Paramount Chief Executive Officer David Ellison has been pursuing Warner Bros. for months, efforts that prompted the parent of HBO and CNN to put itself up for sale in October. After Warner Bros. signed a deal in early December with Netflix, Paramount kept up the fight. Bloomberg News Senior Editor and Entertainment Team Leader Chris Palmeri joins Bloomberg Businessweek Daily to discuss. He speaks with Carol Massar and Tim Stenovec.<p><span class=\"js-l-obf link link--blue\" data-lobf=\"v4fox4ar=NTQyQxJmBMKwpP7nl8C=BbKwgTpvkfAwLuu\" data-tobf=\"blank\" onclick=\"gaEvent('Out', 'mtnewswires', '52548997');\">Bloomberg videos</span>, provided by MT Newswires</p></div>",
            "link": "https://hk.marketscreener.com/news/warner-bros-says-paramount-s-111-billion-deal-tops-netflix-ce7e5cded180fe23",
            "pub_date": "2026-02-27 17:50:52",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Swiss Re Shares Jump After Reinsurer Tops Up Returns With $1 Billion Buyback",
            "description": "<div class=\"txt-s4 article-text\"><p>\n  By Elena Vardon </p><br/><p>\n  Swiss Re's shares traded higher after the reinsurer paired its quarterly results with a surprise $1 billion share buyback, signaling a more aggressive stance on capital returns. </p><!-- Article --><p>\n\n  The Zurich-based group on Friday said that it would repurchase $1.5 billion of its own shares over the course of the year. The program includes the introduction of a recurring annual $500 million buyback as announced late last year, plus the $1 billion top up. </p><p>\n\n  The stock climbed around 5% in early trading to hit its highest level since before a December investor day that had weighed on shares. </p><p>\n\n  J.P. Morgan analysts described the unexpected extra buyback as \"the culmination of a number of resilience building activities and strong [Swiss Solvency Test ratio].\" The move reflects a pattern of proactive capital management often seen as pricing cycles soften, where underwriters prioritize capital returns over chasing volume, Jefferies wrote in a note to clients. </p><p>\n\n  Analysts at Keefe, Bruyette &amp; Woods struck a more cautious note and questioned the sustainability of such payouts as the total capital return slightly exceeded net operating capital generation for the year. </p><p>\n\n  For the full year, Swiss Re reported a 47% jump in net profit to a record $4.8 billion, beating its own guidance of more than $4.4 billion for 2025. The increase was driven by disciplined underwriting and a benign catastrophe environment in its property and casualty units, which helped offset a weaker showing in its life and health business. </p><p>\n\n  Performance in the last three months of the year was more nuanced. Swiss Re's net income reached $717 million, beating the company-compiled consensus of $687 million but falling sharply from the $1.05 billion recorded a year earlier. The top-line was also softer as insurance revenue slipped 6% to $11.14 billion while its investment result fell 12% to $966 million, with both metrics trailing consensus expectations. </p><p>\n\n  The quarterly print was weighed down by a review of underperforming life and health portfolios in Australia, Israel and South Korea. Swiss Re had warned this would shave off $250 million from its fourth-quarter earnings, leading it to miss its the division's annual profit target. While the review is now completed, analysts remain divided with some noting that the managed impact should reassure while others cautioned it may take some quarters of clean results to believe the issues are in the rearview mirror. </p><p>\n\n  \"All three of our business units are positioned to deliver consistent results,\" Chief Executive Officer Andreas Berger said. The company maintained its $4.5 billion net profit target for 2026, which includes a $1.7 billion contribution from the rehabilitated life and health business. </p><p>\n\n  In addition to the buybacks, the board proposed a 9% increase to its annual dividend to $8.0 per share. </p><br/><p>\n  Write to Elena Vardon at elena.vardon@wsj.com </p><br/><p>\n  (END) Dow Jones Newswires</p><p>\n\n  02-27-26 0439ET</p></div>",
            "link": "https://hk.marketscreener.com/news/swiss-re-shares-jump-after-reinsurer-tops-up-returns-with-1-billion-buyback-ce7e5cded180f223",
            "pub_date": "2026-02-27 17:50:53",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "LME launches consultation for proposed rules on position limits",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/lme-launches-consultation-for-proposed-rules-on-position-limits-ce7e5cded180f225",
            "pub_date": "2026-02-27 17:41:33",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Ameren Prices $400 Million Debt Offering",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/ameren-prices-400-million-debt-offering-ce7e5cded180f323",
            "pub_date": "2026-02-27 17:41:34",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CoreWeave Q4 Loss Widens, Revenue Rises; Shares Down Pre-Bell",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/coreweave-q4-loss-widens-revenue-rises-shares-down-pre-bell-ce7e5cded180f322",
            "pub_date": "2026-02-27 17:41:35",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "ANALYSIS -What AI windfall? Debt will still weigh on big economies",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/analysis-what-ai-windfall-debt-will-still-weigh-on-big-economies-ce7e5cded180f52d",
            "pub_date": "2026-02-27 17:41:36",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Take Five: Payrolls - Hot streak or head fake?",
            "description": "<div class=\"txt-s4 article-text\"><p>Feb 27 (Reuters) - The Federal Reserve will get another readout on the strength of the labour market before its March meeting, OPEC+ members meet to discuss output quotas and Beijing decides on its economic goals for the next year.</p><p>\n              All of this unfolds against a fraught geopolitical backdrop, with the United States expanding its military presence in the Middle East.</p><!-- Article --><p>\n              And don't forget about tariffs. </p><p>\n              Here's all you need to know about the coming week in financial markets by Lewis Krauskopf and Suzanne McGee in New York, Rocky Swift in Tokyo, and Amanda Cooper and Marc Jones in London.</p><p><b>1/ LABOUR LOOK</b></p><p>\n              Friday's U.S. employment report will shed light on whether the prior month's unexpectedly strong data was a one-off surprise or signs of a more robust labour market.</p><p>\n              The February report is expected to show payrolls rising by 60,000 jobs, according to a Reuters poll, after a 130,000 gain in January as the unemployment rate fell to 4.3%.</p><p>\n              The data, among the last major releases before the Fed's March meeting, come as attention sharpens on how artificial intelligence could affect the labour market and broader economy.</p><p>\n              In the coming week, reports on manufacturing and services activity will also offer insight into the U.S. economy's health along with retail sales data for January.</p><p><b>2/ CRUDE REALITY</b></p><p>\n              Tensions between the United States and Iran are high, with traders heading into recent weekends bracing for the possibility of a U.S. strike on Iranian targets and Tehran's response.</p><p>\n              This weekend, some of the OPEC+ group of major exporters, which includes Russia, review its crude production plans.</p><p>\n              Oil prices have risen 17% in 2026 to their highest since last July. This might look like great news for producers, but higher energy costs generally constrain demand.</p><p>\n              The International Energy Agency is forecasting a 2026 surplus of almost 4 million barrels a day, as stronger crude prices suppress consumption. There could be a limit to what OPEC+ can do to manage the supply side, when the IEA forecasts most extra crude will come from the \"American quintet\" - the U.S., Canada, Brazil, Argentina, and Guyana, none of which are in the group.</p><p><b>3/ BEIJING MAPS GROWTH, TOKYO TESTS BOND DEMAND</b></p><p>\n              Asia's two largest economies will offer key signals to markets. China decides on economic goals, while Japan tests demand in its volatile bond sector.</p><p>\n              Beijing convenes its closely watched National People's Congress, where officials are expected to set out targets for growth, inflation, and spending.</p><p>\n              At December's planning conference, policymakers pledged to maintain a \"proactive\" fiscal policy to stimulate consumption and investment.</p><p>\n              Tokyo will sell 10-year and 30-year government bonds. Yields on those tenors shot to historic levels in January, rattling global debt markets, on concerns about runaway stimulus from Prime Minister Sanae Takaichi. A measure of calm has returned, but that was shaken on Wednesday when Takaichi's government nominated two dovish academics to the Bank of Japan's board.</p><p><b>4/ HEIGHTENED TENSIONS</b></p><p>\n              The run-up in crude oil prices is an indication that geopolitics is again top of mind for investors. The most visible sign of heightened global anxiety is the price of gold, which has been tentatively edging higher again amid fears that talks between the U.S. and Iran aimed at averting conflict will collapse.</p><p>\n              As investors increasingly cite geopolitical anxiety as one of their main concerns, the range of assets potentially affected by these tensions is growing. The dollar and Treasury securities, for instance, remain in the hot seat as U.S. President Donald Trump has pledged, including at this week's State of the Union address, to replace tariffs overturned by the Supreme Court with other levies.</p><p>\n              Longstanding relationships between asset classes are being questioned, and the definition of safe havens and \"risk on\" assets is up for grabs. Today, the focus is on oil and gold; tomorrow it could be ... anything.</p><p>\n              5/ MEXICAN STANDOFFThe dust is far from settled after the killing of Mexico's notorious drug lord \"El Mencho\" last weekend, but traders there will have something else to watch on Monday, when a bill to slash spending on electoral processes by 25% goes to Congress.</p><p>\n              The reforms would cut financing for political parties, limit daily TV and radio time, require labels for AI-made content, ban bots, scrap consecutive reelection from 2030 and cap pay for elected representatives and electoral officials. </p><p>\n              Opposition party leaders warn it could undermine the entire democratic system and approval won't be easy. The bill will require two-thirds backing of each chamber of Congress, leaving President Claudia Sheinbaum's Morena party relying on its Labor and Green Party allies, both of whom have concerns.</p><p>\n              Coming at a time when Mexico is gearing up for crucial trade USMCA renegotiations and with disgruntled drug cartels now trying to whip up a war, it's a lot to be dealing with.       </p><p></p><p> (Graphics by Kripa Jayaram and Ron Bousso; Compiled by Samuel Indyk; Editing by Amanda Cooper and Nivedita Bhattacharjee)</p></div>",
            "link": "https://hk.marketscreener.com/news/take-five-payrolls-hot-streak-or-head-fake--ce7e5cded180f626",
            "pub_date": "2026-02-27 17:41:36",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "TechD Cybersecurity receives 2 orders worth 7.8 million rupees, 7.5 million rupees",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/techd-cybersecurity-receives-2-orders-worth-7-8-million-rupees-7-5-million-rupees-ce7e5cded180f727",
            "pub_date": "2026-02-27 17:41:37",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "ShFE copper stocks soar to 10-year high in post-Lunar New Year build",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/shfe-copper-stocks-soar-to-10-year-high-in-post-lunar-new-year-build-ce7e5cded181fe23",
            "pub_date": "2026-02-27 17:41:37",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Zydus Lifesciences says successful clinical development of pembrolizumab biosimilar fyb206",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/zydus-lifesciences-says-successful-clinical-development-of-pembrolizumab-biosimilar-fyb206-ce7e5cded181f120",
            "pub_date": "2026-02-27 17:35:53",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        }
    ]
}